{
  "s3607": "Year 3: Led the feudal lords to save Zheng.",
  "s3609": "Year 8: Attacked Zheng because they served Jin.",
  "s3615": "Year 10: Chu attacked us.",
  "s3623": "Year 4: Attacked Qin, took Shao Liang. Qin took our Bei Zheng.",
  "s3624": "Year 4: Jin attacked us, took Shao Liang. We attacked Jin and took Bei Zheng.",
  "s3637": "Year 11: Defeated Chang Di at Xian and returned, obtained Chang Di.",
  "s3642": "Year 4: Defeated Chang Di at Chang Qiu.",
  "s3655": "Year 6: Qin took our Ji Ma. Fought Qin at He Qu; Qin army retreated.",
  "s3656": "Year 6: Attacked Jin, took Ji Ma. Angry, fought us great battle at He Qu.",
  "s3671": "Year 7: Obtained Sui Hui.",
  "s3672": "Year 7: Jin deceived and obtained Sui Hui.",
  "s3684": "Year 6: Qing Wang died. Nobles contended for government, so did not announce.",
  "s3686": "Year 20: Zhao Gong died. Younger brother Shang Ren killed crown prince and self-established, was Yi Gong.",
  "s3687": "Year 8: Zhao Dun with 800 chariots installed Jie Kui, pacified the royal house.",
  "s3701": "Year 15: Sixth month Xin Chou, solar eclipse; Qi attacked us.",
  "s3703": "Year 9: We entered Cai.",
  "s3709": "Year 34: Jin attacked us. Zhuang Hou died.",
  "s3710": "Year 6: Qi entered our outer wall.",
  "s3718": "Year 2: Did not obtain the people's hearts.",
  "s3721": "Year 3: Destroyed Yong.",
  "s3722": "Year 9: Xiang Furen made Wei Bo kill Zhao Gong. Younger brother Bao established.",
  "s3733": "Year 17: Qi attacked us.",
  "s3734": "Year 3: Attacked Lu.",
  "s3735": "Year 11: Led the feudal lords to pacify Song.",
  "s3738": "Song Wen Gong Bao, first year. Zhao Gong's younger brother. Jin led feudal lords to pacify us.",
  "s3749": "Year 18: Xiang Zhong killed the legitimate heir and established concubine son as Xuan Gong.",
  "s3750": "Year 4: The duke cut off Bing Shou Fu's feet and took Yan Zhi's wife; the two together killed the duke and established Huan Gongzi as Hui Gong.",
  "s3767": "Year 13: Zhao Dun saved Chen and Song, attacked Zheng.",
  "s3769": "Year 6: Attacked Song and Chen because they broke their service to Jin.",
  "s3770": "Year 3: Chu and Zheng attacked us because we broke Chu."
}
