{
  "s3015": "Year 22: Destroyed Yu and Guo. Chong Er fled to Di.",
  "s3030": "Year 32: Led the feudal lords to attack Zheng.",
  "s3031": "Year 23: Yi Wu fled to Liang.",
  "s3033": "Year 18: Attacked Xu; the Xu ruler bare-chested apologized; Chu followed it.",
  "s3060": "Year 25: Xiang Wang was established; feared Tai Shu.",
  "s3063": "Year 25: Attacked Di, because of Chong Er.",
  "s3066": "Year 30: The duke was ill; Crown Prince Zi Fu yielded to elder brother Mu Yi's worthiness; the duke did not listen.",
  "s3077": "Year 9: Qi led us to attack Jin's chaos, reached Gao Liang and returned.",
  "s3078": "Year 35: Summer, assembled the feudal lords at Kui Qiu. The Son of Heaven sent Steward Kong to grant the thigh meat, commanded no bowing.",
  "s3079": "Year 26: The duke died; established Xi Qi; Li Ke killed him. And Zhuo Zi. Established Yi Wu.",
  "s3080": "Year 9: Yi Wu sent Xi Rang to bribe and seek entry.",
  "s3082": "Year 31: The duke died; not yet buried, Qi Huan assembled at Kui Qiu.",
  "s3094": "Year 36: Sent Xi Peng to establish Jin Hui Gong.",
  "s3096": "Year 10: Pi Zheng Zi Bao fled and came.",
  "s3108": "Year 3: The Rong attacked us; Tai Shu Dai summoned them. Wanted to execute Shu Dai; Shu Dai fled to Qi.",
  "s3112": "Year 11: Saved the king and attacked the Rong; the Rong left.",
  "s3113": "Year 23: Attacked Huang.",
  "s3119": "Year 24: Had a concubine who dreamed Heaven gave her orchids; gave birth to Mu Gong Lan.",
  "s3126": "Year 38: Sent Guan Zhong to pacify the Rong in Zhou; wished to use upper minister ritual, declined and received lower minister.",
  "s3142": "Year 39: Sent Zhong Sun to request the king, spoke about Shu Dai; the king was angry.",
  "s3143": "Year 4: Famine; requested grain; Qin gave to us.",
  "s3144": "Year 13: Pi Bao wanted not to give; the duke did not listen; transported Jin grain; rose from Yong to Jiang.",
  "s3159": "Year 5: Qin had famine; requested grain; Jin violated the agreement.",
  "s3161": "Year 26: Destroyed Liu and Ying.",
  "s3173": "Year 15: Fifth month, there was a solar eclipse. Not recorded; the historians omitted it.",
  "s3175": "Year 6: Qin captured Hui Gong and re-established him.",
  "s3176": "Year 15: Used bandits who ate good horses to defeat Jin.",
  "s3190": "Year 42: The king reported Rong invasion to Qi; Qi summoned the feudal lords to defend Zhou.",
  "s3191": "Year 7: Chong Er heard Guan Zhong died; left Di and went to Qi.",
  "s3192": "Year 16: Established officials for Hedong."
}
