{
  "s2283": "Year 18: Crown Prince Ji and younger brother Shou contended and died.",
  "s2300": "Year 7: The duke was licentious with Cai; Cai killed the duke.",
  "s2310": "Year 32: Xi Gong commanded Wu Zhi's rank to be the same as the crown prince.",
  "s2328": "Year 6: The three fathers killed Chu Zi and established his elder brother as Wu Gong.",
  "s2335": "Year 3: The feudal lords attacked us, in revenge for Song.",
  "s2341": "Year 15: The Heavenly King demanded chariots; it was not ritual.",
  "s2347": "Year 3: Shuo fled to Qi; established Qian Mu.",
  "s2351": "Year 4: Ji Zhong established Hu; the duke went into exile at Li.",
  "s2357": "Year 16: The duke met with Cao to plan attacking Zheng.",
  "s2367": "Zheng Zhao Gong Hu, first year. Hu's mother was a Deng woman; Ji Zhong took her.",
  "s2372": "Year 2: Had a younger brother Ke.",
  "s2373": "Year 17: Solar eclipse; the day was not recorded; the officials lost it.",
  "s2383": "Year 2: Qu Mi killed Zhao Gong.",
  "s2389": "Year 18: The duke and the lady went to Qi; the Qi duke seduced her and sent Peng Sheng to kill the duke on the chariot.",
  "s2390": "Year 4: Killed Lu Huan Gong and executed Peng Sheng.",
  "s2399": "Zheng Zi Mian, first year. Qi killed Zi Mian; Zhao Gong's younger brother.",
  "s2404": "Year 4: Zhou Gong wanted to kill the king and establish Zi Ke; the king executed Zhou Gong; Ke fled to Yan.",
  "s2415": "Zheng Zi Ying, first year. Zi Mian's younger brother.",
  "s2454": "Year 8: Attacked Ji and destroyed its capital cities.",
  "s2457": "Year 51: The king attacked; Sui reported that the lady's heart moved; the king died in the army.",
  "s2469": "Year 5: Together with Qi attacked Wei and installed Hui Gong.",
  "s2489": "Year 2: Attacked Shen, passed Deng; Deng's nephew said Chu could be taken; Deng Hou did not allow it.",
  "s2501": "Year 7: Stars fell like rain, together with the rain.",
  "s2507": "Year 10: Qi established Hui Gong; Qian Mu fled to Zhou.",
  "s2966": "Year 28: Built Chu Qiu for Wei. Saved from Rong Di attacks.",
  "s2967": "Year 19: Xun Xi used currency to borrow passage through Yu to attack Guo, destroyed Xia Yang.",
  "s2971": "Year 2: Qi Huan Gong led the feudal lords to build Chu Qiu for us.",
  "s2982": "Year 29: Together with Cai Ji in the same boat, rocked the duke; the duke was angry and returned Cai Ji.",
  "s2989": "Year 18: Because of the woman's matter, Qi attacked us.",
  "s2998": "Year 30: Led the feudal lords to attack Cai; Cai collapsed, then attacked Chu and demanded tribute of bundled mugwort.",
  "s2999": "Year 21: Shen Sheng killed himself because of Li Ji's slander. Chong Er fled to Pu; Yi Wu fled to Qu.",
  "s3000": "Year 4: Welcomed the bride from Jin.",
  "s3001": "Year 16: Qi attacked us, reached Xing, sent Qu Wan to make alliance."
}
