{
  "s3775": "Year 20: Together with Chu invaded Chen, then invaded Song. Jin sent Zhao Dun to attack us because we broke Jin.",
  "s3780": "Year 6: King Kuang died.",
  "s3782": "Year 2: Prince Cheng Fu defeated the Chang Di.",
  "s3783": "Year 14: Zhao Chuan killed Ling Gong; Zhao Dun sent Chuan to welcome Gongzi Hei Yu from Zhou and establish him. Zhao family granted ducal clan status.",
  "s3786": "Year 4: Hua Yuan because of the lamb stew matter was trapped in Zheng.",
  "s3791": "Year 21: Fought with Song army and captured Hua Yuan.",
  "s3799": "Jin Cheng Gong Hei Yu, first year. Attacked Zheng.",
  "s3801": "Year 8: Attacked Lu Hun, reached Luo, asked about the tripods' weight.",
  "s3802": "Year 5: Ransomed Hua Yuan; he fled and returned. Surrounded Cao.",
  "s3806": "Year 12: Song surrounded us.",
  "s3807": "Year 22: Hua Yuan fled and returned.",
  "s3817": "Year 9: The Ruo Ao clan made chaos; destroyed them. Attacked Zheng.",
  "s3823": "Zheng Ling Gong Yi, first year. Gongzi Gui Sheng because of the turtle matter killed Ling Gong.",
  "s3831": "Year 3: Zhong Xing Zi Xun Lin Fu saved Zheng and attacked Chen.",
  "s3836": "Year 10: Chu attacked Zheng and made peace with us. Jin Zhong Xing Zi resisted Chu, saved Zheng, and attacked us.",
  "s3839": "Zheng Xiang Gong Jian, first year. Ling Gong's concubine younger brother. Chu attacked us; Jin came to save.",
  "s3847": "Year 4: Together with Wei invaded Chen.",
  "s3851": "Year 32: Together with Jin invaded Chen.",
  "s3852": "Year 11: Jin and Wei invaded us.",
  "s3877": "Year 8: Seventh month, solar eclipse.",
  "s3879": "Year 6: Together with Lu attacked Qin, captured Qin spy, killed him in Jiang market; after six days he revived.",
  "s3880": "Year 3: Jin attacked us and captured spy.",
  "s3881": "Year 13: Attacked Chen and destroyed Shu Liao.",
  "s3884": "Year 13: Chu attacked us.",
  "s3895": "Year 7: Sent Zi Han to attack Chu. With feudal lords' army attacked Chen to save Zheng. Cheng Gong died.",
  "s3897": "Year 14: Attacked Zheng; Jin Xi Que saved Zheng and defeated us.",
  "s3903": "Year 5: Chu attacked us; Jin came to save and defeated Chu army.",
  "s3909": "Year 14: Lunar eclipse.",
  "s3910": "Year 10: The duke died. Cui Shu was favored; Gao and Guo drove him out; he fled to Wei.",
  "s3911": "Jin Jing Gong Ju, first year. Together with Song attacked Zheng.",
  "s3916": "Year 15: Xia Shi Shu because of his mother's disgrace killed Ling Gong.",
  "s3919": "Year 6: Jin, Song, Chu attacked us.",
  "s3929": "Year 16: Led feudal lords to punish Chen Xia Shi Shu and establish Chen Ling Gongzi Wu.",
  "s3943": "Year 3: Saved Zheng but was defeated by Chu at He Shang.",
  "s3945": "Year 17: Surrounded Zheng; Zheng Bo bare-chested apologized; released him.",
  "s3946": "Year 14: Attacked Chen.",
  "s3951": "Year 8: Chu surrounded us; we used humble words to resolve it.",
  "s3975": "Year 5: Attacked Zheng.",
  "s3977": "Year 19: Surrounded Song because of killing envoy.",
  "s3978": "Year 16: Killed Chu envoy; Chu surrounded us.",
  "s3982": "Year 23: Wen Gong died.",
  "s3983": "Year 10: Jin attacked us.",
  "s3989": "Year 15: First taxed the fields.",
  "s3991": "Year 6: Saved Song, seized Xie Yang who had envoy credentials. Qin attacked us.",
  "s3993": "Year 20: Surrounded Song. Fifth month, Hua Yuan told Zi Fan with sincerity; Chu withdrew.",
  "s3994": "Year 17: Hua Yuan informed Chu; Chu left.",
  "s3999": "Year 11: Assisted Chu to attack Song and seized Xie Yang.",
  "s4007": "Year 7: Sui Hui destroyed Chi Di.",
  "s4021": "Year 17: Solar eclipse.",
  "s4022": "Year 7: Jin sent Xi Que to come to Qi; women laughed at him; Ke was angry and returned.",
  "s4030": "Year 17: Solar eclipse.",
  "s4031": "Year 18: Solar eclipse.",
  "s4039": "Year 9: Attacked Qi to hostage Qiang; army stopped.",
  "s4053": "Lu Cheng Gong Hei Rong, first year. Spring, Qi took our Long.",
  "s4069": "Year 2: Together with Jin attacked Qi; Qi returned our Wen Yang but secretly allied with Chu.",
  "s4070": "Year 10: Jin Xi Que defeated duke at Shan; captured Feng Chou Fu.",
  "s4073": "Year 2: Autumn, Shen Gong Zi Wu Chen secretly stole Shi Shu Mu and fled to Jin to establish as Xing minister. Winter, invaded Wei, Lu, and saved Qi.",
  "s4075": "Year 11: Mu Gong died. Together with feudal lords defeated Qi and returned invaded land. Chu invaded us.",
  "s4085": "Year 3: Assembled Jin, Song, Wei, Cao to attack Zheng.",
  "s4086": "Year 11: Zhao Gong went to Jin; Jin was not respectful; duke wanted to break Jin and join Chu.",
  "s4087": "Year 12: Began to set six ministers. Led feudal lords to attack Zheng.",
  "s4101": "Year 4: Duke went to Jin; Jin was not respectful; duke wanted to break Jin and join Chu.",
  "s4111": "Year 18: Jin Lun Shu took our Fan. Xiang Gong died.",
  "s4119": "Year 14: Shan Mountain collapsed. Bo Zong hid his person and used his words.",
  "s4121": "Year 5: Attacked Zheng because we broke the agreement. Zheng Dao Gong came to sue.",
  "s4127": "Zheng Dao Gong Fei, first year. Duke went to Chu to sue.",
  "s4135": "Year 15: Sent Lun Shu to save Zheng and invaded Cai.",
  "s4143": "Year 2: Dao Gong died. Chu invaded us; Jin sent Lun Shu to come save.",
  "s4151": "Year 16: Began to connect with Wu.",
  "s4159": "Zheng Cheng Gong Zhao, first year. Dao Gong's younger brother. Chu invaded us.",
  "s4167": "Year 17: Restored Zhao Wu's field. Invaded Cai.",
  "s4183": "Year 18: Arrested Zheng Cheng Gong and attacked Zheng. Qin invaded us.",
  "s4191": "Year 3: Allied with Chu. Duke went to Jin; arrested duke and attacked us.",
  "s4216": "Year 24: Together with Jin duke crossed river and allied; returned and broke alliance.",
  "s4247": "Year 3: Attacked Qin to Jing and defeated them; obtained their general Cheng Cha.",
  "s4277": "Year 15: Began to connect with Wu; assembled Zhong Li.",
  "s4279": "Year 5: Three Xi slandered Bo Zong and killed him; Bo Zong was good at straightforward admonition.",
  "s4293": "Year 16: Xuan Bo announced Jin; wanted to kill Ji Wen Zi but Wen Zi escaped with righteousness.",
  "s4297": "Year 16: Saved Zheng but was unfavorable. Zi Fan was drunk; army defeated and killed Zi Fan who returned.",
  "s4303": "Year 10: Broke Jin alliance with Chu; Jin invaded us; Chu came to save.",
  "s4327": "Year 8: Lun Shu Zhong Xing Di killed Li Gong and established Xiang Gong's grandson as Dao Gong.",
  "s4341": "Lu Xiang Gong Wu, first year. Surrounded Song Peng Cheng.",
  "s4342": "Year 10: Invaded us; made Crown Prince Guang hostage to Jin.",
  "s4346": "Year 13: Jin invaded and defeated us; army at Yi Shang; Chu came to save.",
  "s4359": "Year 2: Led feudal lords to attack Zheng and built Hu Lao.",
  "s4367": "Year 14: Cheng Gong died. Jin led feudal lords to attack us.",
  "s4377": "Year 21: Sent Zi Zhong to attack Wu, reached Heng Shan. Sent He Qi to invade Chen.",
  "s4380": "Year 29: Broke Chu alliance; Chu invaded us.",
  "s4391": "Year 4: Wei Zhao advised uniting Rong and Di; Di courted Jin.",
  "s4447": "Year 5: Zi Shu made traitor night kill Xi Gong and falsely announced illness to feudal lords.",
  "s4469": "Year 9: Together with Jin invaded Zheng; assembled at river; asked duke's age - twelve, could be capped; capped at Wei.",
  "s4471": "Year 9: Led Qi, Lu, Song, Wei, Cao to invade Zheng. Qin invaded us.",
  "s4473": "Year 27: Invaded Zheng; army at Wu City for Qin.",
  "s4475": "Year 13: Jin led us to invade Zheng. Cao whip duke enjoyed concubine.",
  "s4479": "Year 2: Punished Zi Shu. Jin led feudal lords to invade us; we allied with them. Chu was angry and invaded us.",
  "s4486": "Year 19: Ordered Crown Prince Guang and Gao Hou to assemble feudal lords at Zhong Li.",
  "s4487": "Year 10: Led feudal lords to invade Zheng. Xi Ying invaded Qin.",
  "s4495": "Year 3: Jin led feudal lords to invade us; Chu came to save. Zi Kong made chaos; Zi Chan attacked him.",
  "s4501": "Year 11: Three Huan divided into three armies; each led his army.",
  "s4503": "Year 11: Led feudal lords to invade Zheng; Qin defeated us at Li. Duke said: 'My use of Wei Zhao united nine feudal lords,' granted him music.",
  "s4504": "Year 15: We sent Chang Shu Shu to invade Jin and save Zheng; defeated them at Li.",
  "s4511": "Year 4: Together with Chu invaded Song; Jin led feudal lords to invade us; Qin came to save.",
  "s4537": "Year 31: Wu invaded us; defeated them. Gong Wang died.",
  "s4551": "Year 14: Led feudal lords ministers to invade Qin; defeated Bai Lin.",
  "s4552": "Year 18: Jin feudal lords ministers invaded us; defeated Bai Lin.",
  "s4553": "Chu Kang Wang Zhao, first year. Gong Wang's Crown Prince fled Wu.",
  "s4555": "Year 18: Sun Wen Zi attacked duke; duke fled Qi; established duke's younger brother Di.",
  "s4581": "Year 16: Qi invaded us. Earthquake. Qi again invaded our northern border.",
  "s4583": "Jin Ping Gong Biao, first year. We defeated Chu at Zhan Ban.",
  "s4614": "Year 27: Jin surrounded Lin Zi. Yan Ying.",
  "s4615": "Year 3: Led Lu, Song, Zheng, Wei, Cao to surround Qi and greatly defeated them.",
  "s4623": "Year 11: Jin led us to surround Qi. Chu invaded us.",
  "s4630": "Year 28: Dismissed Guang and established Zi Ya as Crown Prince. Guang and Qu Ce killed Ya and self-established. Jin and Wei invaded us.",
  "s4661": "Year 21: Duke went to Jin. Suns eclipsed twice.",
  "s4663": "Year 6: Lu Xiang Gong came. Killed Yang Hu.",
  "s4678": "Year 3: Jin Lun Dao came fleeing; Yan Ying said 'better return him'.",
  "s4694": "Year 4: Wanted to dispatch Lun Dao into Quwo to invade Jin and take Chao Ge.",
  "s4713": "Year 11: Connected with Qi. Led Chen and Cai to invade Zheng and save Qi.",
  "s4719": "Year 17: Fan Xuan Zi governed. We requested to invade Chen.",
  "s4725": "Year 25: Qi invaded our northern border to avenge Xiao Bo's army.",
  "s4726": "Year 6: Jin invaded us to avenge Chao Ge. Qu Ce with Zhuang Gong through his wife killed him and established his younger brother as Jing Gong.",
  "s4727": "Year 10: Invaded Qi to Gao Tang to avenge Tai Xing army.",
  "s4728": "Year 29: Duke went to Jin; alliance not concluded.",
  "s4729": "Year 12: Wu invaded us to avenge boat army; shot and killed Wu king.",
  "s4737": "Year 13: Zhu Fan invaded Chu; pressed Ning Gate; injured and died from shooting.",
  "s4742": "Qi Jing Gong Chu Chou, first year. Went to Jin to request return of Wei Xuan Gong.",
  "s4743": "Year 11: Punished Wei Shang Gong and returned established Xuan Gong.",
  "s4747": "Year 12: Qi and Jin killed Shang Gong and returned established Xuan Gong.",
  "s4758": "Year 28: Duke went to Chu. Buried Kang Wang.",
  "s4773": "Year 3: Winter, Bao, Gao, Lun clan plotted Jing Fu; sent troops to attack Jing Fu; Jing Fu fled Wu.",
  "s4774": "Year 3: Wu Ji Zha came to observe Zhou music; all knew the music's meaning.",
  "s4775": "Year 4: Wu Ji Zha came as envoy; with Yan Ying was happy.",
  "s4776": "Year 14: Wu Ji Zha came; said 'Jin government will finally return to Han, Wei, Zhao.'",
  "s4784": "Year 22: Wu Ji Zha said Zi Chan: 'Politics will return to Zi; Zi with ritual, fortunately escape calamity.'",
  "s4785": "Yan Hui Gong, first year. Qi Gao Zhi came fleeing.",
  "s4786": "Year 4: Gate guard killed Yu Ce. Ji Zha made feudal lords.",
  "s4798": "Year 12: Younger brother Qu Jing killed duke and self-established as Yi Gong.",
  "s4800": "Year 23: Various dukes contended for favor and mutually killed; also wanted to kill Zi Chan; Zi Cheng stopped them.",
  "s4827": "Lu Zhao Gong Chou, first year. Zhao Gong was 19 years old and had childish heart.",
  "s4830": "Year 36: Duke's younger brother Hou Zi fled to Jin; chariots thousand.",
  "s4831": "Year 4: Duke went to Jin; reached river; Jin apologized and returned him.",
  "s4841": "Chu Ling Wang Wei, first year. Gong Wang's son; ivory elbow.",
  "s4854": "Year 9: Yan Ying went to Jin; saw Shu Xiang; said 'Qi government returns to Tian clan.' Shu Xiang said 'Jin ducal house is low.'",
  "s4863": "Year 27: Summer went to Jin. Winter went to Chu.",
  "s4864": "Year 6: Duke wanted to kill nobles and establish favorite minister; nobles punished favorite minister; duke feared and fled to Qi.",
  "s4873": "Year 3: Summer assembled feudal lords at Song land; allied. Invaded Wu Zhu Fang; punished Jing Fu. Winter reported us; took three cities.",
  "s4879": "Year 28: Zi Chan said: 'Three states will not assemble.'",
  "s4888": "Year 40: Duke died. Hou Zi returned from Jin.",
  "s4902": "Year 12: Duke went to Jin; requested to invade Yan; entered their ruler.",
  "s4903": "Year 22: Qi Jing Gong came; requested to invade Yan; entered their ruler.",
  "s4924": "Yan Dao Gong, first year. Hui Gong returned and died.",
  "s4929": "Year 8: Duke went to Chu; Chu detained him. Celebrated Zhang Hua Terrace.",
  "s4933": "Year 7: Went to Zhang Hua Terrace; inner lost people filled it. Extinguished Chen.",
  "s4936": "Year 35: Younger brother Zhao made chaos; Ai Gong self-killed.",
  "s4952": "Chen Hui Gong Wu, first year. Ai Gong's grandson. Chu came to pacify us.",
  "s4963": "Year 26: Spring had star out Yu Nu. Seven months, duke died.",
  "s4981": "Year 10: Drunk killed Cai Hou; made abandon Qi surround them. Abandon Qi resided there; was Cai Hou.",
  "s4985": "Year 12: Cai Hou went to Chu; Chu killed him; made abandon Qi reside there; was Cai Hou.",
  "s4993": "Year 12: Courted Jin to river; Jin apologized and returned him; returned. Solar eclipse.",
  "s5011": "Year 6: Zhou house was chaotic; duke pacified chaos; established Jing Wang.",
  "s5032": "Year 15: Wu defeated us; took Hu and Shen.",
  "s5045": "Year 11: Wu low Liang people contended for mulberry; invaded and took our Zhong Li.",
  "s5057": "Year 25: Duke wanted to punish Ji clan; three Huan attacked duke; duke went to reside in Yun.",
  "s5073": "Year 26: Qi took our Yun to place duke.",
  "s5074": "Year 32: Comet seen. Yan Ying said 'Tian clan has virtue in Qi; can fear.'",
  "s5075": "Year 10: Knowledge Li and Zhao Meng inner king at Wang City.",
  "s5077": "Year 13: Wanted to establish Zi Xi; Zi Xi did not want. Qin woman established; was Zhao Wang.",
  "s5093": "Chu Zhao Wang Zhen, first year. Punished Wu Hao to say the crowd.",
  "s5101": "Year 25: Sent Zhu Zi Quan to kill Zhao Wang and self-establish.",
  "s5105": "Year 28: Duke went to Jin; requested to enter; Jin did not listen; placed at Gan Hou.",
  "s5107": "Year 12: Six ministers punished ducal clan; divided their land. Each made his son a minister.",
  "s5121": "Year 29: Duke from Gan Hou went to Yun. Qi duke said: 'Main ruler.' Duke was ashamed; returned to Gan Hou.",
  "s5131": "Year 4: Wu three dukes came fleeing; enfeoffed to resist Wu.",
  "s5168": "Year 5: Ping Gong's younger brother Tong killed Xiang Gong and self-established.",
  "s5175": "Lu Ding Gong Song, first year. Zhao Gong's funeral from Gan Hou to.",
  "s5179": "Year 7: Nang Wa defeated Wu; obtained Chu Hou.",
  "s5187": "Year 6: Chu invaded us; welcomed and struck; defeated them; took their Ju Rong.",
  "s5211": "Year 35: Cai Zhao Hou detained three years; obtained cloak; so returned. Went to Jin; requested to invade Chu.",
  "s5223": "Year 10: With Nang Wa cloak obtained return; went to Jin; requested to invade Chu.",
  "s5235": "Year 10: Wu, Cai invaded us; entered Ying; Zhao Wang fled. Wu Zi Xu whipped Ping Wang's grave.",
  "s5239": "Year 13: Together with Wei rescued; arrested Xie Yang.",
  "s5256": "Year 25: Wang invaded Xu to frighten Wu; next Gan Xi. People tired at service; resented king.",
  "s5271": "Year 12: Abandon Qi made chaos and self-established; Ling Wang self-killed. Restored Chen and Cai.",
  "s5274": "Year 5: Chu Ping Wang restored Chen; established Hui Gong.",
  "s5275": "Year 2: Chu Ping Wang restored us; established Jing Hou.",
  "s5287": "Chu Ping Wang Ju, first year. Gong Wang's son; embraced jade.",
  "s5299": "Year 15: Solar eclipse. Duke went to Jin; Jin detained him for burial; duke was ashamed.",
  "s5303": "Year 2: King for Crown Prince took Qin woman; good; self took her.",
  "s5317": "Year 6: Duke died. Six ministers strong; ducal house low.",
  "s5331": "Year 17: Fifth month new moon; solar eclipse. Comet seen in stars.",
  "s5341": "Year 5: Fire; wanted to exorcise it; Zi Chan said: 'Better cultivate virtue.'",
  "s5389": "Year 24: Qi Jing Gong with Yan Ying hunted; entered Lu to ask ritual.",
  "s5390": "Year 26: Hunted Lu border; because entered Lu.",
  "s5393": "Year 7: Punished Meng Chou Fu. Day eclipsed.",
  "s5409": "Year 38: Confucius came; salary as Lu.",
  "s5428": "Year 6: Duke died. Younger brother Bao established as Wen Gong.",
  "s5434": "Year 36: Wen Gong died. Younger brother Min established.",
  "s5435": "Year 4: Min Gong died. Younger brother Zhuang established.",
  "s5449": "Year 15: Zhuang Gong died. Younger brother Xi established.",
  "s5450": "Year 5: Xi Gong died. Younger brother Xiang established.",
  "s5466": "Year 46: Lu invaded us. We invaded Lu.",
  "s5469": "Year 4: Duke went to Wu; Wu detained him; because died in Wu.",
  "s5477": "Year 13: Chen Huai Gong came; detained him; died in Wu.",
  "s5482": "Year 4: Imprisoned Yang Hu; Hu fled to Jin.",
  "s5497": "Year 10: Duke assembled Qi duke at Jia Gu. Confucius was chancellor. Qi returned our land.",
  "s5516": "Year 2: Gave birth to Zhao Gong, Huai Gong, Jian Gong.",
  "s5522": "Year 3: State people had dream various gentlemen stood in She Palace; plotted to perish Cao; Zhen Duo requested to wait for Gong Sun Qiang; allowed.",
  "s5529": "Year 12: Qi returned female musicians; Ji Kang Zi received them; Confucius departed.",
  "s5551": "Year 38: Confucius came; salary as Lu.",
  "s5570": "Year 6: Gong Sun Qiang good at shooting; offered geese; duke made him Si Cheng; dreamers son Xing.",
  "s5573": "Year 19: Invaded Yue; defeated us; injured He Lu finger; died with it.",
  "s5581": "Year 21: Extinguished Hu. With Wu defeated; we broke them.",
  "s5595": "Year 18: Zhao Meng surrounded Fan and Zhong Xing at Chao Ge. Qi and Wei invaded us.",
  "s5601": "Year 25: Chu invaded us with Wu resentment.",
  "s5610": "Year 5: Fifty-five years transported Fan and Zhong Xing millet.",
  "s5611": "Year 20: Zhao Meng defeated Fan Zhong Xing; invaded Wei.",
  "s5615": "Year 42: Ling Gong died. Wei Kuai Zi Che established. Jin entered Wei Kuai Zi at Wei.",
  "s5617": "Year 26: Feared Chu; privately summoned Wu people; begged to migrate to Zhou Lai; Zhou Lai near Wu.",
  "s5619": "Year 8: Saved Fan and Zhong Xing clan; fought Zhao Meng at Tie; defeated our army.",
  "s5630": "Year 21: Confucius passed Song; Hun Kuai hated him.",
  "s5643": "Year 21: Zhao Meng seized Han Dan, Bai Ren; had them.",
  "s5658": "Year 5: Fifty-eight years Jing Gong died. Established favorite concubine's son as Crown Prince.",
  "s5659": "Year 22: Zhao Meng defeated Fan Zhong Xing; invaded Wei.",
  "s5674": "Qi Shao Ru Zi, first year. Tian Qi falsely established Yang Sheng; killed Shao Ru Zi.",
  "s5677": "Year 23: Saved Chen; Wang died at Cheng Fu.",
  "s5689": "Year 7: Duke assembled Wu king at Zang. Wu requested hundred tripods; Ji Kang Zi made Zi Gong apologize.",
  "s5705": "Year 8: Wu for Lu invaded us; reached below city; allied and departed. Qi took our three cities.",
  "s5709": "Year 2: Zi Xi summoned Jian Zi from Wu; was Bai Gong.",
  "s5726": "Year 31: Zheng surrounded us at Yong Qiu.",
  "s5731": "Year 15: Surrounded Song; defeated our army at Yong Qiu; invaded us.",
  "s5738": "Year 4: Wu, Lu invaded us. Bao Zi killed Dao Gong; Qi people established his son Ren as Jian Gong.",
  "s5749": "Year 11: Lu invaded Qi to save Chen. Punished Wu Quan.",
  "s5753": "Year 11: Qi invaded us. Ran You said; so welcomed Confucius; Confucius returned.",
  "s5754": "Qi Jian Gong, first year. Lu with Wu defeated us.",
  "s5769": "Year 12: With Wu assembled at Zang Ao; used Tian tax.",
  "s5773": "Year 6: Bai Gong wanted to invade Zheng with father's resentment.",
  "s5775": "Year 10: Duke went to Jin; with Wu assembled at Zang Ao.",
  "s5787": "Year 30: With Wu assembled at Huang Pool; contended for supremacy.",
  "s5801": "Year 14: Western hunt obtained unicorn. Wei Chu Gong came fleeing.",
  "s5802": "Year 4: Tian Chang killed Jian Gong; established his younger brother Ao as Ping Gong; Chang was chancellor; monopolized state power.",
  "s5807": "Year 12: Father Wei Kuai entered; Che fled.",
  "s5817": "Year 15: Zi Fu Jing Bo made Qi; Zi Gong was assistant; Qi returned our invaded land.",
  "s5818": "Qi Ping Gong Ao, first year. Jing Gong's grandson. Qi from this called Tian clan.",
  "s5822": "Year 37: Ying Huo guarded heart; Zi Wei said 'good.'",
  "s5837": "Year 10: Bai Gong killed Ling Yin; attacked Hui Wang. Ye Gong attacked Bai Gong; Bai Gong self-killed. Hui Wang recovered state.",
  "s5840": "Year 23: Chu extinguished Chen; killed Min Gong.",
  "s5855": "Year 3: Zhuang Gong insulted Rong Zhou people; Rong Zhou people with Zhao Jian Zi attacked Zhuang Gong; fled.",
  "s5867": "Wei Jun Qi, first year. Shi Fu drove Qi out; Che returned and entered."
}
