{
  "s244": "Fourteenth year: King Xuan ascended the throne; the Gonghe regency ended.",
  "s567": "Fourth year: Took a Qi woman as his consort.",
  "s597": "Lu Xiao Gong first year (of his reign). Bo Yu was established as ruler, called one of the various princes. Bo Yu was the grandson of Wu Gong.",
  "s607": "Zheng Huan Gong You first year: first enfeoffment. Younger brother of King Xuan of Zhou's mother.",
  "s615": "Seventh year: Because of the campaign against Tiao, gave birth to Crown Prince Qiu.",
  "s663": "Tenth year: fought the battle of Qian Mu. Gave birth to Qiu's younger brother Cheng Shi. The two sons' names were reversed; the noblemen criticized this. Later there was disorder.",
  "s698": "Thirty-first year: Song Hui Gong passed away.",
  "s714": "Song Dai Gong was established. First year.",
  "s757": "Eleventh year: King Xuan of Zhou executed Bo Yu, established his younger brother Cheng as ruler; this was Xiao Gong.",
  "s935": "Twenty-seventh year: Mu Hou died; his younger brother Shang Shu established himself as ruler; Crown Prince Qiu fled.",
  "s999": "Fourth year: Qiu attacked and killed Shang Shu, established himself as Wen Hou.",
  "s1012": "Second year: the San Chuan earthquake.",
  "s1028": "Third year: the king took Bao Si.",
  "s1156": "Eleventh year: King You was killed by the Quan Rong.",
  "s1160": "Seventh year: began to be ranked among the feudal lords.",
  "s1167": "Thirty-sixth year: because of King You, was killed by the Quan Rong.",
  "s1176": "Eighth year: first established the Xi altar, sacrificed to the White Emperor.",
  "s1240": "Twelfth year: attacked the Rong, reached Qi, and died.",
  "s1327": "Tenth year: married the daughter of Shen Hou, Wu Jiang.",
  "s1391": "Fourteenth year: gave birth to Zhuang Gong Wu Sheng.",
  "s1400": "Tenth year: built the Fu altar.",
  "s1436": "Chen Wen Gong Yu first year: gave birth to Huan Gong Bao and Li Gong Ta. Ta's mother was a Cai woman.",
  "s1439": "Seventeenth year: gave birth to Tai Shu Duan; the mother wished to establish Duan, but the duke would not listen.",
  "s1530": "Eighteenth year: gave birth to the mother of Lu Huan Gong.",
  "s1544": "Nineteenth year: made sacrifices to Chen Bao.",
  "s1575": "Jin Zhao Hou first year: enfeoffed his uncle Cheng Shi at Qu Wo. Qu Wo was larger than the state; the noblemen criticized saying: 'The Jin disorder began with Qu Wo.'",
  "s1580": "Tenth year: Wen Gong passed away.",
  "s1615": "Zheng Zhuang Gong Wu Sheng first year: Ji Zhong was chancellor.",
  "s1643": "Seventeenth year: favored concubine Zi Zhou Xu; Zhou Xu was fond of war.",
  "s1671": "Pan Fu killed Zhao Hou, tried to install Cheng Shi, but failed. Zhao Hou's son was established as ruler; this was Xiao Hou.",
  "s1739": "Twenty-third year: the consort had no sons; Huan Gong was established.",
  "s1771": "Second year: younger brother Zhou Xu was arrogant; Huan Gong deposed him and he fled.",
  "s1799": "Ninth year: Qu Wo Huan Shu Cheng Shi died; his son Dai was established as Zhuang Bo.",
  "s1830": "Second year: younger brother Yi Zhong year gave birth to Gong Sun Wu Zhi.",
  "s1834": "Nineteenth year: the duke died; commanded to establish younger brother He as Mu Gong.",
  "s1911": "Sixteenth year: Qu Wo Zhuang Bo killed Xiao Hou; the Jin people established Xiao Hou's son Que as E Hou.",
  "s1927": "Jin E Hou Que first year: Qu Wo was stronger than Jin.",
  "s1941": "Lu Yin Gong Xi Gu first year: mother Sheng Zi.",
  "s1951": "Twenty-second year: Duan created disorder and fled.",
  "s1967": "Twenty-third year: the duke regretted it, thought of his mother and could not see her, dug a tunnel to meet her.",
  "s1973": "Third year, second month: solar eclipse.",
  "s1978": "Ninth year: the duke entrusted Kong Fu to establish Shang Gong. Feng fled to Zheng.",
  "s1983": "Twenty-fourth year: invaded Zhou and took the grain.",
  "s1995": "Sixteenth year: Zhou Xu assassinated the duke and established himself.",
  "s1996": "Twenty-sixth year: Wei Shi Que came to report, therefore seized Zhou Xu.",
  "s2004": "Second year: sent Guo Gong to attack Jin's Qu Wo.",
  "s2005": "Fifth year: the duke watched fishing at Tang; the noblemen criticized this.",
  "s2007": "Sixth year: E Hou died. Qu Wo Zhuang Bo again attacked Jin. Established E Hou's son Guang as Ai Hou.",
  "s2010": "Second year: Zheng attacked us. We attacked Zheng.",
  "s2011": "Wei Xuan Gong Jin first year: the people established him together. Executed Zhou Xu."
}