{
  "s3200": "Fourteenth year.",
  "s3208": "Seventeenth year.",
  "s3216": "Fifteenth year.",
  "s3220": "Tenth year.",
  "s3224": "Eighteenth year.",
  "s3232": "Sixteenth year.",
  "s3236": "Eleventh year.",
  "s3240": "Nineteenth year: extinguished Liang. Liang was fond of city walls, did not reside in them; the people were exhausted, startled each other, therefore perished.",
  "s3248": "Seventeenth year.",
  "s3252": "Twelfth year.",
  "s3256": "Twentieth year.",
  "s3264": "Eighteenth year.",
  "s3268": "Thirteenth year.",
  "s3272": "Twenty-first year.",
  "s3273": "Thirty-third year: seized Song Xiang Gong, released him again.",
  "s3274": "Twelfth year: summoned Chu alliance.",
  "s3280": "Nineteenth year.",
  "s3284": "Fourteenth year: Shu Dai returned again to Zhou.",
  "s3286": "Fifth year: returned the king's younger brother Dai.",
  "s3287": "Thirteenth year: Crown Prince Yu was hostage in Qin, fled and returned.",
  "s3288": "Twenty-second year.",
  "s3290": "Thirteenth year: battle of Hong, Chu defeated the duke.",
  "s3292": "Tenth year.",
  "s3295": "Thirty-fifth year: the duke went to Chu, Song attacked us.",
  "s3296": "Twentieth year.",
  "s3300": "Fifteenth year.",
  "s3302": "Sixth year: attacked Song because they did not join the alliance.",
  "s3303": "Fourteenth year: Yu was established as Hui Gong.",
  "s3304": "Twenty-third year: welcomed Chong Er from Chu, treated him with great courtesy, married him to a daughter. Chong Er wished to return.",
  "s3305": "Thirty-fifth year: Chong Er passed through, treated him with great courtesy.",
  "s3306": "Fourteenth year: the duke died ill from the Hong battle.",
  "s3307": "Twenty-third year: Chong Er came from Qi and passed through, was disrespectful.",
  "s3308": "Eleventh year.",
  "s3310": "Sixteenth year: Chong Er passed through, was disrespectful; Xi Fu Ji privately befriended him.",
  "s3311": "Thirty-sixth year: Chong Er passed through, was disrespectful; Shu Zhan admonished.",
  "s3312": "Twenty-first year.",
  "s3316": "Sixteenth year: the king fled to Si. Si was Zheng territory.",
  "s3320": "Twenty-fourth year: used troops to assist Chong Er.",
  "s3324": "Twelfth year.",
  "s3328": "Twenty-second year.",
  "s3332": "Seventeenth year: Jin installed the king.",
  "s3336": "Twenty-fifth year: wished to bring in the king, army on the Yellow River.",
  "s3340": "Thirteenth year.",
  "s3344": "Twenty-third year.",
  "s3348": "Eighteenth year.",
  "s3351": "Third year: Song submitted.",
  "s3352": "Twenty-sixth year.",
  "s3354": "Third year: violated Chu alliance, became close to Jin.",
  "s3356": "Fourteenth year.",
  "s3360": "Twenty-fourth year."
}
