{
  "s2517": "Eighth year: Zi Jiu came fleeing, along with Guan Zhong they avoided the Wu Zhi disorder.",
  "s2518": "Twelfth year: Wu Zhi killed the ruler and established himself.",
  "s2523": "Wei Hui Gong Shuo returned to enter. Fourteenth year.",
  "s2533": "Ninth year: Lu wished to enter with Jiu, came after Xiao Bai; Qi blocked Lu, made them bring Guan Zhong alive.",
  "s2534": "Qi Huan Gong Xiao Bai first year, spring: Qi killed Wu Zhi.",
  "s2549": "Tenth year: Qi attacked us, because of Jiu.",
  "s2553": "Sixth year: Xi Fu Ren, Chen woman, passed through Cai; Cai was disrespectful to her, she hated them. Chu attacked Cai, captured Ai Hou and returned.",
  "s2557": "Eleventh year: Chu captured our hou.",
  "s2565": "Eleventh year: Zang Wen Zhong condoled Song's flood.",
  "s2570": "Ninth year: Song great flood, the duke blamed himself. Lu sent Zang Wen Zhong to condole.",
  "s2586": "Tenth year: Wan killed the ruler; Qiu Mu had righteousness.",
  "s2597": "Thirteenth year: Cao Mo hijacked Huan Gong. Returned the lost territory.",
  "s2598": "Fifth year: assembled with Lu people at Ke.",
  "s2602": "Song Huan Gong Yu Shuo first year: Zhuang Gong's son.",
  "s2630": "Seventh year: began hegemony, assembled the feudal lords at Juan.",
  "s2631": "Twenty-eighth year: Qu Wo Wu Gong extinguished Jin Hou Min, offered the treasures to Zhou; Zhou commanded Wu Gong to be Jin's ruler, and combined their territories.",
  "s2639": "Zheng Li Gong first year: Li Gong fled and after 17 years returned to enter.",
  "s2647": "Jin Wu Gong established and combined Jin; already established 38 years, did not change the yuan, continued from his first year.",
  "s2648": "Twentieth year: buried at Yong, first used human sacrifices to follow in death.",
  "s2649": "Twelfth year: attacked Deng and extinguished it.",
  "s2655": "Second year: the feudal lords attacked us.",
  "s2663": "Thirty-ninth year: Wu Gong died; son Gui Zhu established, as Xian Gong.",
  "s2664": "Qin De Gong first year: Wu Gong's younger brother.",
  "s2680": "Second year: first made the Fu sacrifice, sacrificed to the She altar, split dogs at the four gates of the city.",
  "s2692": "Second year: Yan and Wei attacked the king; the king fled to Wen, established Zi Yi.",
  "s2698": "Seventh year: took a Wei woman. Wen Gong's younger brother.",
  "s2704": "Sixteenth year: attacked the king; the king fled to Wen, established Zi Yi.",
  "s2720": "Seventeenth year: Zheng seized our Zhong Fu.",
  "s2724": "Fourth year: executed Yi, entered Hui Wang.",
  "s2735": "Seventh year: rescued Zhou's disorder, entered the king.",
  "s2740": "Fifth year: the crown prince's mother died early. Hui Hou gave birth to Shu Dai.",
  "s2742": "Fourteenth year: Chen Wan came fleeing from Chen, Tian Chang began from this.",
  "s2743": "Fifth year: attacked the Li Rong, obtained Ji.",
  "s2744": "Fourth year: built the Mi altar.",
  "s2745": "Fifth year: younger brother Yun killed Du Ao and established himself.",
  "s2748": "Twenty-first year: Li Gong's son Wan fled to Qi.",
  "s2757": "Twenty-third year: the duke went to Qi to observe the She sacrifice.",
  "s2791": "Eighth year: completely killed the former Jin Hou's various sons.",
  "s2807": "Ninth year: began building Jiang capital city.",
  "s2820": "Tenth year: granted Qi Hou the mandate.",
  "s2855": "Twelfth year: Crown Prince Shen resided at Qu Wo, Chong Er resided at Pu City, Yi Wu resided at Qu. Because of Li Ji.",
  "s2886": "Twenty-third year: attacked the Shan Rong, for Yan's sake.",
  "s2901": "Thirty-second year: Zhuang Gong's younger brother Shu Ya was poisoned to death. Qing Fu assassinated Zi Ban. Ji You fled to Chen, established Min Gong.",
  "s2919": "Sixteenth year: extinguished Wei, Geng, Huo. First enfeoffed Zhao Su at Geng, Bi Wan at Wei, began from this.",
  "s2933": "Second year: Qing Fu killed Min Gong. Ji You from Chen established Shen as Xi Gong. Killed Qing Fu.",
  "s2935": "Seventeenth year: Shen Sheng was general; the noblemen knew he would be discarded.",
  "s2939": "Di attacked us. The duke was fond of cranes; the soldiers did not fight, extinguished our state. The state resented it; Hui Gong created disorder, extinguished his descendants, instead established Qian Mou's younger brother. Wei Dai Gong first year.",
  "s2949": "Lu Xi Gong Shen first year: Ai Jiang's mourning came from Qi.",
  "s2950": "Twenty-seventh year: killed younger sister Lu Zhuang Gong's consort, because of licentiousness.",
  "s2955": "Wei Wen Gong Hui first year: Dai Gong's younger brother."
}
