{
  "chapter": "002",
  "book": "hanshu",
  "extractedAt": "2025-12-24T07:49:21.304Z",
  "translations": [
    {
      "id": "s0126",
      "type": "paragraph",
      "chinese": "春正月丙午，韓王信等奏請以故東陽郡、鄣郡、吳郡五十三縣立劉賈為荊王，以碭郡、薛郡、郯郡三十六縣立弟文信君交為 楚王。",
      "english": "In the first month of spring on the day bingwu, King Han Xin and others petitioned to establish Liu Jia as King of Jing with the former Dongyang commandery, Zhang commandery, Wu commandery, fifty-three counties; and to establish younger brother Lord Wenxin Jiao as King of Chu with Dang commandery, Xue commandery, Tan commandery, thirty-six counties.",
      "context": {}
    },
    {
      "id": "s0127",
      "type": "paragraph",
      "chinese": "壬子，以雲中、鴈門、代郡五十三縣立兄宜信侯喜為代王，以膠東、膠西、臨淄、濟北、博陽、城陽郡七十三縣立子肥為齊王，以太原郡三十一縣為韓國，徙 韓王信都晉陽。",
      "english": "On the day renzi, he established elder brother Lord Yixin Xi as King of Dai with Yunzhong, Yanmen, Dai commanderies, fifty-three counties; established son Fei as King of Qi with Jiaodong, Jiaoxi, Linzi, Jibei, Boyang, Chengyang commanderies, seventy-three counties; made Taiyuan commandery thirty-one counties into Han kingdom, moved King Han Xin to establish capital at Jinyang.",
      "context": {}
    },
    {
      "id": "s0128",
      "type": "paragraph",
      "chinese": "上已封大功臣三十餘人，其餘爭功，未得行封。",
      "english": "The emperor had already enfeoffed over thirty great meritorious ministers. The rest contended for merit and had not yet received enfeoffment.",
      "context": {}
    },
    {
      "id": "s0129",
      "type": "paragraph",
      "chinese": "上居南宮，從復道上見諸將往往耦語，以問張良。",
      "english": "The emperor resided in the southern palace. From the covered walkway above he saw the generals often talking in pairs. He asked Zhang Liang about it.",
      "context": {}
    },
    {
      "id": "s0130",
      "type": "paragraph",
      "chinese": "良曰： 「陛下與此屬共取天下，今已為天子，而所封皆故人所愛，所誅皆平生仇怨。",
      "english": "Liang said: \"Your Majesty took the world together with these people. Now you are emperor, but those you enfeoff are all old friends you love, those you execute are all lifelong enemies.",
      "context": {}
    }
  ]
}