{
  "chapter": "002",
  "book": "hanshu",
  "extractedAt": "2025-12-24T08:08:00.258Z",
  "translations": [
    {
      "id": "s0345",
      "type": "paragraph",
      "chinese": "周勃重厚少文，然安劉氏者必勃也，可令為太尉。」",
      "english": "Zhou Bo is solid and sincere but lacks refinement. However, the one who will secure the Liu clan must be Bo. Can make him grand marshal.\"",
      "context": {}
    },
    {
      "id": "s0346",
      "type": "paragraph",
      "chinese": "呂后復問其次，上曰：「此後亦非乃所知也。」",
      "english": "Empress Lü asked about the next. The emperor said: \"This after is also not what you know.\"",
      "context": {}
    },
    {
      "id": "s0347",
      "type": "paragraph",
      "chinese": "盧綰與數千人居塞下候伺，幸上疾愈，自入謝。",
      "english": "Lu Wan with several thousand men dwelt below the frontier watching and waiting, hoping the emperor's illness would improve, personally entering to apologize.",
      "context": {}
    },
    {
      "id": "s0348",
      "type": "paragraph",
      "chinese": "夏四月甲辰，帝崩于長樂宮。",
      "english": "In the fourth month of summer on the day jiachen, the emperor passed away in Changlegong Palace.",
      "context": {}
    },
    {
      "id": "s0349",
      "type": "paragraph",
      "chinese": "盧綰聞之，遂亡入匈奴。",
      "english": "Lu Wan heard of it and fled into the Xiongnu.",
      "context": {}
    },
    {
      "id": "s0350",
      "type": "paragraph",
      "chinese": "呂后與審食其謀曰：「諸將故與帝為編戶民，北面為臣，心常鞅鞅，今乃事少主，非盡族是，天下不 安。」",
      "english": "Empress Lü plotted with Shen Shiqi: \"The generals formerly were commoners with the emperor, facing north as subjects, their hearts often dissatisfied. Now they serve a young ruler. If not exterminate their clans, the world will not be peaceful.\"",
      "context": {}
    },
    {
      "id": "s0351",
      "type": "paragraph",
      "chinese": "以故不發喪。",
      "english": "Therefore they did not announce the death.",
      "context": {}
    },
    {
      "id": "s0352",
      "type": "paragraph",
      "chinese": "人或聞，以語酈商。",
      "english": "Someone heard and told Ji Shang.",
      "context": {}
    },
    {
      "id": "s0353",
      "type": "paragraph",
      "chinese": "酈商見審食其曰：「聞帝已崩，四日不發喪，欲誅諸將。",
      "english": "Ji Shang saw Shen Shiqi and said: \"Heard the emperor has passed away. Four days without announcing death, wanting to execute the generals.",
      "context": {}
    },
    {
      "id": "s0354",
      "type": "paragraph",
      "chinese": "誠如此，天下危矣。",
      "english": "If truly so, the world is in danger.",
      "context": {}
    },
    {
      "id": "s0355",
      "type": "paragraph",
      "chinese": "陳平、灌嬰將十萬守滎陽，樊噲、周勃將二十 萬定燕代，此聞帝崩，諸將皆誅，必連兵還鄉，以攻關中。",
      "english": "Chen Ping and Guan Ying lead 100,000 guarding Xingyang, Fan Kuai and Zhou Bo lead 200,000 pacifying Yan and Dai. If they hear the emperor has died and the generals are all executed, they will surely join forces and return home to attack Guanzhong.",
      "context": {}
    },
    {
      "id": "s0356",
      "type": "paragraph",
      "chinese": "大臣內畔，諸將外反，亡可蹻足待也。」",
      "english": "Ministers rebel internally, generals revolt externally. There will be no time to even stamp one's foot.\"",
      "context": {}
    },
    {
      "id": "s0357",
      "type": "paragraph",
      "chinese": "審食其入言之，乃以丁未發喪，大赦天下。",
      "english": "Shen Shiqi entered and spoke of it. So on the day dingwei they announced the death and granted a great amnesty to the world.",
      "context": {}
    },
    {
      "id": "s0358",
      "type": "paragraph",
      "chinese": "五月丙寅，葬長陵。",
      "english": "In the fifth month on the day bingyin, buried at Changling.",
      "context": {}
    },
    {
      "id": "s0359",
      "type": "paragraph",
      "chinese": "已下，皇太子群臣皆反至太上皇廟。",
      "english": "After descending, the imperial crown prince and ministers all returned to the Taishang Huang temple.",
      "context": {}
    },
    {
      "id": "s0360",
      "type": "paragraph",
      "chinese": "群臣曰：「帝起細微，撥亂世反之正，平定天下，為漢太祖，功最高。」",
      "english": "The ministers said: \"The emperor rose from humble origins, corrected the chaotic world to righteousness, pacified the world, became Han Taizu. His merit is highest.\"",
      "context": {}
    },
    {
      "id": "s0361",
      "type": "paragraph",
      "chinese": "上尊號曰高皇帝。",
      "english": "They honored him with the title Gao Huangdi.",
      "context": {}
    },
    {
      "id": "s0362",
      "type": "paragraph",
      "chinese": "初，高祖不脩文學，而性明達，好謀，能聽，自監門戍卒，見之如舊。",
      "english": "Initially, Gaozu did not study literature, but his nature was clear and understanding, fond of planning, able to listen. From gate guard to soldier, he treated people as old friends.",
      "context": {}
    },
    {
      "id": "s0363",
      "type": "paragraph",
      "chinese": "初順民心作三章之約。",
      "english": "Initially he followed the people's hearts and made the three chapter covenant.",
      "context": {}
    },
    {
      "id": "s0364",
      "type": "paragraph",
      "chinese": "天下既定，命蕭何次律令，韓信申軍法，張蒼定章程，叔孫通制禮儀，陸賈造新語。",
      "english": "After the world was settled, he commanded Xiao He to arrange the statutes and commands, Han Xin to explain military law, Zhang Cang to establish procedures, Shu Sun Tong to create rituals and ceremonies, Lu Jia to compose new discourses.",
      "context": {}
    },
    {
      "id": "s0365",
      "type": "paragraph",
      "chinese": "又與功臣剖符作誓，丹書鐵契，金匱石室，藏之宗廟。",
      "english": "He also with the meritorious ministers divided tallies and made oaths, red writing on iron contracts, gold caskets and stone chambers, stored in the ancestral temple.",
      "context": {}
    },
    {
      "id": "s0366",
      "type": "paragraph",
      "chinese": "雖日不暇給，規摹弘遠矣。",
      "english": "Though days were not sufficient, his plans were broad and far-reaching.",
      "context": {}
    }
  ]
}