{
  "s82": "Ping Ding.",
  "s83": "As soldier followed Gaozu uprising in Liu, as household chariot official entered Han, as Brave Cavalry Colonel attacked Xiang Ji, achieved merit in capturing Loufan general, used as Chancellor of Qi, Marquis. One account says Xiang Juan.",
  "s85": "Eight. First year fourth month yi you, Marquis Jing Qi Shou first year.",
  "s86": "One. Four. Second year, Marquis of Qi Shi Ren first year. Eighteen. Sixth year, Marquis Gong Ying first year.",
  "s87": "Sixteen",
  "s88": "Seven. Yuanguang second year, Marquis Kang Yan Ju first year. Eighteen. Yuanding second year, Marquis Chang first year. Two. Yuanding fourth year, Marquis Chang committed crime, state abolished.",
  "s89": "Bo Cheng.",
  "s90": "As Palace Attendant of King Dao Wu, when troops first arose, followed Gaozu uprising in Feng, attacked Yongqiu, attacked Xiang Ji, fought strenuously, escorted King Dao Wu out of Xingyang, meritorious Marquis.",
  "s92": "Three. First year fourth month yi you, Marquis Jing Feng Wu Ze first year. Four. Fourth year, Marquis Dai first year. Eighth year, Marquis Dai convicted of Lü clan affairs, executed, state abolished.",
  "s96": "Pei.",
  "s97": "Youngest son of Empress Lü's elder brother Marquis Kang, Marquis, served Lü King Xuan's tomb garden.",
  "s99": "Seven. First year fourth month yi you, Marquis Lü Zhong first year. One. Became Marquis of Buqi. Eighth year, Marquis Zhong convicted of Lü clan affairs, executed, state abolished.",
  "s103": "Xiang Cheng.",
  "s104": "Son of Emperor Hui, Marquis.",
  "s106": "One. First year fourth month xin mao, Marquis Yi first year. Second year, Marquis Yi became King of Changshan, state abolished.",
  "s110": "Zhi.",
  "s111": "Son of Emperor Hui, Marquis.",
  "s113": "Three. First year fourth month xin mao, Marquis Chao first year. Fourth year, Marquis Chao became King of Changshan, state abolished.",
  "s117": "Hu Guan.",
  "s118": "Son of Emperor Hui, Marquis.",
  "s120": "Four. First year fourth month xin mao, Marquis Wu first year. Fifth year, Marquis Wu became King of Huaiyang, state abolished.",
  "s124": "Yuan Ling.",
  "s125": "Successor son of Prince Si Cheng of Changsha, Marquis.",
  "s127": "Eight. First year eleventh month ren shen, Marquis Qing Wu Yang first year.",
  "s128": "Seventeen. Six. Later second year, Marquis Qing Fu first year.",
  "s129": "Eleven. Four. Zhong fifth year, Marquis Ai Zhou first year. Later third year, Marquis Zhou died, no posterity, state abolished.",
  "s131": "Shang Pi",
  "s132": "Son of Prince Yuan of Chu, Marquis.",
  "s134": "Seven. Second year fifth month bing shen, Marquis Liu Ying Ke first year.",
  "s135": "One. Second year, Marquis Ying Ke became King of Chu, state abolished.",
  "s138": "Zhu Xu.",
  "s139": "Son of King Dao Hui of Qi, Marquis.",
  "s141": "Seven. Second year fifth month bing shen, Marquis Liu Zhang first year.",
  "s142": "One. Second year, Marquis Zhang became King of Chengyang, state abolished.",
  "s145": "Chang Ping.",
  "s146": "Son of Emperor Hui, Marquis.",
  "s148": "Three. Fourth year second month gui wei, Marquis Tai first year. Seventh year, Tai became King of Lü, state abolished.",
  "s152": "Zhui Qi.",
  "s153": "Younger brother's son of Empress Lü, used as Chancellor of Huaiyang, Marquis.",
  "s155": "Four. Fourth year fourth month bing shen, Marquis Lü Sheng first year. Eighth year, Marquis Sheng convicted of Lü clan affairs, executed, state abolished.",
  "s159": "Zhong Yi.",
  "s160": "As spear bearer followed Gaozu entering Han, as Commander broke Cao Jiu, used as Prime Minister of Lü, Marquis, six hundred households.",
  "s162": "Five. Fourth year fourth month bing shen, Marquis Zhen Zhu Tong first year.",
  "s163": "Seventeen. Six. Later second year, Marquis Dao first year.",
  "s164": "Fifteen. Later third year, Marquis Dao committed crime, state abolished.",
  "s166": "Le Ping.",
  "s167": "As squad soldier followed Gaozu uprising in Pei, belonged to Huang Xin, as Palace Attendant attacked Chen Yu, used as Commander of the Guards, Marquis, six hundred households.",
  "s169": "Two. Fourth year fourth month bing shen, Marquis Jian Wei Wu Ze first year. Three. Sixth year, Marquis Gong Sheng first year.",
  "s170": "Twenty-three",
  "s171": "Fifteen. One. Later third year, Marquis Chi first year."
}
