{
  "s260": "Eighth year fourth month ding you, Marquis Zhang Ze first year. Ninth month, title stripped, state abolished.",
  "s264": "Dong Ping.",
  "s265": "As younger brother of King Tong of Yan Lü, Marquis.",
  "s267": "Eighth year fifth month bing chen, Marquis Lü Zhuang first year. Convicted of Lü clan affairs, executed, state abolished.",
  "s278": "Yang Xin.",
  "s279": "In Gaozu eleventh year served as Palace Attendant. As Chief of Protocol seized King Lü Lu's seal of Zhao, closed palace gates, refused Lü Chan and others entry, together honored and established Emperor Wen, Marquis, two thousand households.",
  "s282": "Fourteen. First year third month xin chou, Marquis Liu Jie first year. Nine. Fifteenth year, Marquis Zhong Yi first year.",
  "s283": "Five. Sixth year, Marquis Zhong Yi committed crime, state abolished.",
  "s285": "Zhi.",
  "s286": "In Gaozu tenth year served as Palace Attendant, followed army, at seventeen became Grand Master of Ceremonies, welcomed Emperor Wen to succeed, used as General of Chariots and Cavalry to welcome Empress Dowager, Marquis, ten thousand households. Younger brother of Empress Dowager Bo.",
  "s289": "Ten. First year fourth month yi si, Marquis Bo Zhao first year. Thirteen. Eleventh year, Marquis Yi Rong Nu first year.",
  "s290": "Sixteen",
  "s291": "One. Jianyu second year, Marquis Liang first year.",
  "s292": "Zhuang Wu.",
  "s293": "As household official followed Gaozu uprising in Shandong, as Colonel defended Xingyang, had fief. As Commander of Dai persuaded King of Dai to enter, rode in same chariot to Dai residence, king finally became emperor, meritorious Marquis, one thousand four hundred households.",
  "s296": "Twenty-three. First year fourth month xin hai, Marquis Song Chang first year.",
  "s297": "Eleven. Zhong fourth year, Marquis Chang title stripped, state abolished.",
  "s299": "Qing Du.",
  "s300": "As maternal uncle of King Ai of Qi, Marquis.",
  "s303": "Five. First year fourth month xin wei, Marquis Si Jun first year. Former sixth year, Jun committed crime, state abolished.",
  "s306": "Zhou Yang.",
  "s307": "As maternal uncle of Prince Li of Huainan, Marquis.",
  "s310": "Five. First year fourth month xin wei, Marquis Zhao Jian first year. Former sixth year, Jian committed crime, state abolished.",
  "s313": "Fan.",
  "s314": "As magistrate of Suiyang followed Gaozu initial uprising at E, as Han family son returned to pacify Beidi, used as Prime Minister of Changshan, Marquis, one thousand two hundred households.",
  "s317": "Fourteen. First year sixth month bing yin, Marquis Cai Jian first year. Nine. Fifteenth year, Marquis Kang Ke first year.",
  "s318": "Nine. Seven. Zhong third year, Marquis Gong Ping first year.",
  "s319": "Thirteen. Yuanshuo second year, Marquis Pi Fang first year. Fourteen. Yuanding fourth year, Marquis Pi Fang committed crime, state abolished.",
  "s320": "Guan.",
  "s321": "Son of King Dao Hui of Qi, Marquis.",
  "s324": "Two. Fourth year fifth month jia yin, Marquis Gong Liu Ba Jun first year. Eighteen. Sixth year, Marquis Rong Nu first year.",
  "s325": "Two. Third year, Marquis Rong Nu rebelled, state abolished.",
  "s327": "Gua Qiu.",
  "s328": "Son of King Dao Hui of Qi.",
  "s331": "Eleven. Fourth year fifth month jia yin, Marquis Liu Ning Guo first year. Nine. Fifteenth year, Marquis Yan first year.",
  "s332": "Two. Third year, Marquis Yan rebelled, state abolished.",
  "s334": "Ying.",
  "s335": "Son of King Dao Hui of Qi, Marquis.",
  "s338": "Ten. Fourth year fifth month jia yin, Marquis Ping Liu Xin Du first year. Ten. Fourteenth year, Marquis Guang first year.",
  "s339": "Two. Third year, Marquis Guang rebelled, state abolished.",
  "s341": "Yang Xu",
  "s342": "Son of King Dao Hui of Qi, Marquis",
  "s345": "Twelve. Fourth year fifth month jia yin, Marquis Gong Liu Jiang Lu first year. Sixteenth year, Marquis Jiang Lu became King of Qi, committed crime, state abolished.",
  "s348": "Xi.",
  "s349": "Son of King Dao Hui of Qi, Marquis.",
  "s352": "Twelve. Fourth year fifth month jia yin, Marquis Liu Pi Guang first year. Sixteenth year, Marquis Pi Guang became King of Jinan, state abolished.",
  "s355": "An Du.",
  "s356": "Son of King Dao Hui of Qi, Marquis.",
  "s359": "Twelve. Fourth year fifth month jia yin, Marquis Liu Zhi first year. Sixteenth year, Marquis Zhi became King of Jibei, state abolished.",
  "s362": "Ping Chang."
}
