{
  "s0151": "Invaded Song Huang Chi, Song again took it.",
  "s0152": "Seventeenth year, with Qin battled Yuan Li, Qin took our Shao Liang.",
  "s0153": "Surrounded Zhao Han Dan.",
  "s0154": "Eighteenth year, took Han Dan.",
  "s0155": "Zhao requested aid from Qi, Qi made Tian Ji, Sun Bin save Zhao, defeated Wei Gui Ling.",
  "s0156": "Nineteenth year, feudal lords surrounded our Xiang Ling.",
  "s0157": "Built long wall, blocked Gu Yang.",
  "s0158": "Twentieth year, returned Zhao Han Dan, allied at Zhang Shui above.",
  "s0159": "Twenty-first year, with Qin assembled Tong.",
  "s0160": "Zhao Cheng Hou died.",
  "s0161": "Twenty-eighth year, Qi Wei Wang died.",
  "s0162": "Zhong Shan jun became chancellor of Wei.",
  "s0163": "Thirtieth year, Wei attacked Zhao, Zhao urgently told Qi.",
  "s0164": "Qi Xuan Wang used Sun Zi plan, saved Zhao attacked Wei.",
  "s0165": "Wei then greatly raised troops, made Pang Juan general, ordered Tai Zi Shen as upper general.",
  "s0166": "Passed Wai Huang, Wai Huang Xu Zi told Tai Zi said: 'Subject has hundred battle hundred victory technique.'",
  "s0167": "Tai Zi said: 'Can hear it?'",
  "s0168": "Guest said: 'Solid wish offer it.'",
  "s0169": "Said: 'Tai Zi self lead attack Qi, great victory unite Ju, then rich not over have Wei, noble not increase be wang.",
  "s0170": "If battle not victory Qi, then ten thousand generations without Wei.",
  "s0171": "This subject hundred battle hundred victory technique.'",
  "s0172": "Tai Zi said: 'Yes, please must follow gong words then return.'",
  "s0173": "Guest said: 'Tai Zi though wish return, cannot.",
  "s0174": "They urge Tai Zi battle attack, wish drink soup many.",
  "s0175": "Tai Zi though wish return, fear cannot.'",
  "s0176": "Tai Zi because wished return, his charioteer said: 'General leave then return, with north same.'",
  "s0177": "Tai Zi indeed with Qi people battled, defeated at Ma Ling.",
  "s0178": "Qi captured Wei Tai Zi Shen, killed general Juan, army then greatly broken.",
  "s0179": "Thirty-first year, Qin, Zhao, Qi together attacked us, Qin general Shang Jun deceived our general Gong Zi Ang then surprise seized his army, broke it.",
  "s0180": "Qin used Shang Jun, east land to river, and Qi, Zhao several broke us, An Yi near Qin, thereupon moved governed Da Liang.",
  "s0181": "Made Gong Zi He as Tai Zi.",
  "s0182": "Thirty-third year, Qin Xiao Gong died, Shang Jun fled Qin returned Wei, Wei angered, not entered.",
  "s0183": "Thirty-fifth year, with Qi Xuan Wang assembled Ping A south.",
  "s0184": "Hui Wang several defeated in military campaigns, lowly ritual thick gifts to recruit worthy people.",
  "s0185": "Zou Yan, Chun Yu Kun, Meng Ke all arrived Liang.",
  "s0186": "Liang Hui Wang said: 'I not worthy, troops three broken outside, Tai Zi captured, upper general died, state with empty, shame first jun ancestral temple she ji, I very ashamed it, old not far thousand li, disgrace fortunately arrived ruined yi court, will what benefit our state?'",
  "s0187": "Meng Ke said: 'Jun cannot speak profit like this.",
  "s0188": "Jun wish profit then da fu wish profit, da fu wish profit then common people wish profit, high low contend profit, state then dangerous.",
  "s0189": "Be person jun, benevolence righteousness only, what with profit!'",
  "s0191": "Thirty-sixth year, again with Qi wang assembled Zhen.",
  "s0192": "This year, Hui Wang died, son Xiang Wang established.",
  "s0193": "Xiang Wang first year, with feudal lords assembled Xu Zhou, mutually wang.",
  "s0194": "Pursued honored father Hui Wang as wang.",
  "s0195": "Fifth year, Qin defeated our Long Jia army forty-five thousand at Diao Yin, surrounded our Jiao, Qu Wo.",
  "s0196": "Gave Qin He Xi land.",
  "s0197": "Sixth year, with Qin assembled Ying.",
  "s0198": "Qin took our Fen Yin, Pi Shi, Jiao.",
  "s0199": "Wei attacked Chu, defeated them at Xing Shan.",
  "s0200": "Seventh year, Wei completely entered Shang Jun to Qin."
}
