{
  "s0052": "Thirteenth year, sent Zi Ji surround Fan, Pang, expel their people.",
  "s0053": "Sixteenth year, attacked Qin, built Lin Jin Yuan Li.",
  "s0054": "Seventeenth year, attacked Zhong Shan, made Zi Ji guard it, Zhao Cang Tang assisted him.",
  "s0055": "Zi Ji met Wen Hou teacher Tian Zi Fang at Zhao Ge, drew carriage aside, descended saluted.",
  "s0056": "Tian Zi Fang did not return courtesy.",
  "s0057": "Zi Ji because asked said: 'Rich noble arrogant people? Moreover poor lowly arrogant people?'",
  "s0058": "",
  "s0059": "Zi Fang said: 'Also poor lowly arrogant people. Feudal lords arrogant people then lose their state, grand masters arrogant people then lose their house. Poor lowly, conduct not accord, words not used, then depart to Chu, Yue, like shed shoes, how compare them!'",
  "s0060": "",
  "s0061": "",
  "s0062": "Zi Ji displeased departed.",
  "s0063": "West attacked Qin, arrived Zheng returned, built Luo Yin, He Yang.",
  "s0064": "Twenty-second year, Wei, Zhao, Han ranked as feudal lords.",
  "s0065": "Twenty-fourth year, Qin attacked us, arrived Yang Hu.",
  "s0066": "Twenty-fifth year, Zi Ji gave birth to Zi Ying.",
  "s0067": "Wen Hou received Zi Xia classics arts, hosted Duan Gan Mu, passed his gate, never not straightened.",
  "s0068": "Qin once wished attack Wei, someone said: 'Wei jun wise person courteous, state people called benevolent, high low harmonious united, not conquerable.'",
  "s0069": "Wen Hou from this obtained reputation among feudal lords.",
  "s0070": "Appointed Xi Men Bao guard Ye, and He Nei called governed.",
  "s0071": "Wei Wen Hou told Li Ke said: 'Sir once taught me said \"family poor then think good wife, state chaotic then think good chancellor\".",
  "s0072": "Now appointed not Cheng then Huang, two sons how?'",
  "s0073": "Li Ke replied said: 'Subject heard, lowly not plan honored, distant not plan close.",
  "s0074": "Subject at palace gate outside, dare not receive command.'",
  "s0075": "Wen Hou said: 'Sir face affair not decline.'",
  "s0076": "Li Ke said: 'Jun not examine old.",
  "s0077": "At residence view what close, rich view what give, successful view what promote, poor view what not do, destitute view what not take, five sufficient determine it, what await Ke!'",
  "s0078": "Wen Hou said: 'Sir go residence, my chancellor determined.'",
  "s0079": "Li Ke hurried out, passed Di Huang home.",
  "s0080": "Di Huang said: 'Now heard jun summoned sir divined chancellor, indeed who for it?'",
  "s0081": "Li Ke said: 'Wei Cheng Zi became chancellor.'",
  "s0082": "Di Huang angered changed color said: 'With ears eyes what saw recorded, subject what owed Wei Cheng Zi?",
  "s0083": "Xi He guard, subject what advanced.",
  "s0084": "Jun inside with Ye worried, subject advanced Xi Men Bao.",
  "s0085": "Jun planned wished attack Zhong Shan, subject advanced Yue Yang.",
  "s0086": "Zhong Shan with taken, no make guard it, subject advanced sir.",
  "s0087": "Jun son no tutor, subject advanced Qu Hou Fu.",
  "s0088": "Subject what owed Wei Cheng Zi!'",
  "s0089": "Li Ke said: 'Moreover your words Ke to your jun, how will clique to seek great office?",
  "s0090": "Jun asked placed chancellor \"not Cheng then Huang, two sons how?\"'",
  "s0091": "Ke replied: \"Jun not examine old.",
  "s0092": "At residence view what close, rich view what give, successful view what promote, poor view what not do, destitute view what not take, five sufficient determine it, what await Ke!\"",
  "s0093": "Therefore know Wei Cheng Zi became chancellor.",
  "s0094": "Moreover you how able with Wei Cheng Zi compare?",
  "s0095": "Wei Cheng Zi with food salary thousand zhong, ten nine outside, ten one inside, therefore east obtained Bu Zi Xia, Tian Zi Fang, Duan Gan Mu.",
  "s0096": "These three, jun all teacher them.",
  "s0097": "You what advanced five people, jun all minister them.",
  "s0098": "You how able with Wei Cheng Zi compare?'",
  "s0099": "Di Huang hesitant twice bowed said: 'Huang, rustic person, lost reply, wish finish be disciple.'"
}
