{
  "s0151": "Moment, wang drum qin, Zou Ji son pushed door entered said: 'Good drum qin!'",
  "s0152": "Wang suddenly not pleased, left qin pressed sword said: 'Sir saw appearance not examined, how know its good?'",
  "s0153": "Zou Ji son said: 'Big strings muddy with spring warm, jun;",
  "s0154": "Small strings frugal break with clear, chancellor;",
  "s0155": "Pluck deep, release pleasant, governance commands;",
  "s0156": "Harmonize with sound, big small mutually benefit, circuit evil not mutually harm, four seasons: I therefore know its good.'",
  "s0157": "Wang said: 'Good speak sound.'",
  "s0158": "Zou Ji son said: 'How alone speak sound, govern state pacify people all in midst.'",
  "s0159": "Wang again suddenly not pleased said: 'If speak five sounds record, truly not have like sir.",
  "s0160": "If govern state pacify people, moreover what for silk tong interval?'",
  "s0161": "Zou Ji son said: 'Big strings muddy with spring warm, jun;",
  "s0162": "Small strings frugal break with clear, chancellor;",
  "s0163": "Pluck deep release pleasant, governance commands;",
  "s0164": "Harmonize with sound, big small mutually benefit, circuit evil not mutually harm, four seasons.",
  "s0165": "Repeated not chaotic, what govern flourish;",
  "s0166": "Connected direct, what preserve perish: therefore said qin sound tuned then world governed.",
  "s0167": "Govern state pacify people, none like five sounds.'",
  "s0168": "Wang said: 'Good.'",
  "s0169": "Zou Ji son saw three months received chancellor seal.",
  "s0170": "Chun Yu Kun saw it said: 'Good persuade!",
  "s0171": "Kun have foolish will, wish present before.'",
  "s0172": "Zou Ji son said: 'Respectfully receive teaching.'",
  "s0173": "Chun Yu Kun said: 'Obtain complete complete flourish, lose complete complete perish.'",
  "s0174": "Zou Ji son said: 'Respectfully receive command, please respectfully not leave before.'",
  "s0175": "Chun Yu Kun said: 'Pig fat thorn axle, what make smooth, however cannot transport square bore.'",
  "s0176": "Zou Ji son said: 'Respectfully receive command, please respectfully serve left right.'",
  "s0177": "Chun Yu Kun said: 'Bow glue Xi Gan, what make join, however cannot attach join sparse cracks.'",
  "s0178": "Zou Ji son said: 'Respectfully receive command, please respectfully self attach to ten thousand people.'",
  "s0179": "Chun Yu Kun said: 'Fox fur though worn, cannot mend with yellow dog skin.'",
  "s0180": "Zou Ji son said: 'Respectfully receive command, please respectfully select gentleman, not mix small people its interval.'",
  "s0181": "Chun Yu Kun said: 'Big cart not check, cannot load its constant duty;",
  "s0182": "Qin se not check, cannot complete its five sounds.'",
  "s0183": "Zou Ji son said: 'Respectfully receive command, please respectfully repair laws supervise evil officials.'",
  "s0184": "Chun Yu Kun persuaded finished, hurried left, arrived gate, and faced his servant said: 'This person, I spoke subtle words five, his respond me like echo respond sound, this person must enfeoff soon.'",
  "s0185": "Resided period, enfeoffed Xia Pi below, number called Cheng Hou.",
  "s0186": "Wei Wang twenty-third year, with Zhao wang assembled Ping Lu.",
  "s0187": "Twenty-fourth year, with Wei wang assembled field at Jiao.",
  "s0188": "Wei wang asked said: 'Wang also have treasure?'",
  "s0189": "Wei Wang said: 'None have.'",
  "s0190": "Liang wang said: 'If my state small, still have diameter cun pearl illuminate cart front back each twelve multiply ten pieces, how with ten thousand multiply state while none treasure?'",
  "s0191": "Wei Wang said: 'My what called treasure with wang different.",
  "s0192": "My minister have Tan Zi, make guard south city, then Chu people dare not become bandit east take, Si Shang twelve feudal lords all come court.",
  "s0193": "My minister have Zi, make guard Gao Tang, then Zhao people dare not east fish at river.",
  "s0194": "My officials have Qian Fu, make guard Xu Zhou, then Yan people sacrifice north gate, Zhao people sacrifice west gate, moved followed several seven thousand plus households.",
  "s0195": "My minister have Zhong Shou, make prepare bandit thieves, then road not pick remain.",
  "s0196": "Will illuminate thousand li, how only twelve multiply!'",
  "s0197": "Liang Hui Wang ashamed, not pleased departed.",
  "s0198": "Twenty-sixth year, Wei Hui Wang surrounded Han Dan, Zhao sought aid from Qi.",
  "s0199": "Qi Wei Wang summoned ministers planned said: 'Save Zhao which compared not save?'",
  "s0200": "Zou Ji son said: 'Not if not save.'",
  "s0330": "To protect Ju city and cloth announce Qi state midst: 'Wang already established in Ju.'",
  "s0331": "Xiang Wang already established, established Grand Historian clan woman as wang empress, this was Jun Wang Empress, gave birth to son Jian.",
  "s0332": "Grand Historian Jiao said: 'Woman not take matchmaker because self marry, not my seed, defile my generation.'",
  "s0333": "Lifetime not saw Jun Wang Empress.",
  "s0334": "Jun Wang Empress worthy, not with not saw reason lose person child ritual.",
  "s0335": "Xiang Wang in Ju five years, Tian Dan with Ji Mo attacked broke Yan army, welcomed Xiang Wang at Ju, entered Lin Zi.",
  "s0336": "Qi former lands completely again belonged Qi.",
  "s0337": "Qi enfeoffed Tian Dan as An Ping Jun.",
  "s0338": "Fourteenth year, Qin attacked our Gang Shou.",
  "s0339": "Nineteenth year, Xiang Wang died, son Jian established.",
  "s0340": "Wang Jian established six years, Qin attacked Zhao, Qi Chu saved them.",
  "s0341": "Qin planned said: 'Qi Chu save Zhao, close then retreat troops, not close then attack them.'",
  "s0342": "Zhao without food, requested grain from Qi, Qi not listened.",
  "s0343": "Zhou Zi said: 'Not if listen to retreat Qin troops, not listen then Qin troops not retreat, is Qin plan midst and Qi Chu plan wrong.",
  "s0344": "Moreover Zhao at Qi Chu, defense screen, like teeth have lips, lips perish then teeth cold.",
  "s0345": "Today perish Zhao, tomorrow calamity reach Qi Chu.",
  "s0346": "Moreover save Zhao duty, suitable like offer leaky urn pour scorched cauldron.",
  "s0347": "Save Zhao, high righteousness;",
  "s0348": "Retreat Qin troops, manifest name.",
  "s0349": "Righteous save perished state, awe retreat strong Qin troops, not strive for this and strive love grain, for state plan wrong.'",
  "s0350": "Qi wang not listened.",
  "s0351": "Qin broke Zhao at Chang Ping forty plus ten thousand, then surrounded Han Dan.",
  "s0352": "Sixteenth year, Qin extinguished Zhou.",
  "s0353": "Jun Wang Empress died.",
  "s0354": "Twenty-third year, Qin established Dong Jun.",
  "s0355": "Twenty-eighth year, wang entered court Qin, Qin wang Zheng set wine Xian Yang.",
  "s0356": "Thirty-fifth year, Qin extinguished Han.",
  "s0357": "Thirty-seventh year, Qin extinguished Zhao.",
  "s0358": "Thirty-eighth year, Yan made Jing Ke stab Qin wang, Qin wang aware, killed Ke.",
  "s0359": "Next year, Qin broke Yan, Yan wang fled departed Liao Dong.",
  "s0360": "Next year, Qin extinguished Wei, Qin troops arrived Li Xia.",
  "s0361": "Forty-second year, Qin extinguished Chu.",
  "s0362": "Next year, captured Dai Wang Jia, extinguished Yan Wang Xi.",
  "s0363": "Forty-fourth year, Qin troops attacked Qi.",
  "s0364": "Qi wang listened chancellor Hou Sheng plan, not battled, with troops surrendered Qin.",
  "s0365": "Qin captured wang Jian, moved to Gong.",
  "s0366": "Then extinguished Qi made jun county.",
  "s0367": "World one united at Qin, Qin wang Zheng established title as emperor.",
  "s0368": "Initially, Jun Wang Empress worthy, served Qin careful, with feudal lords faithful, Qi also east edge sea, Qin day night attacked three Jin, Yan, Chu, five states each self saved at Qin, with reason wang Jian established forty plus years not received troops.",
  "s0369": "Jun Wang Empress died, Hou Sheng chancellor Qi, much received Qin interval gold, much made guests entered Qin, Qin moreover much gave gold, guests all became reverse interval, advised wang depart alliance court Qin, not repaired attack battle prepare, not aided five states attack Qin, Qin with reason obtained extinguished five states.",
  "s0370": "Five states already perished, Qin troops finally entered Lin Zi, people none dared resist.",
  "s0371": "Wang Jian then surrendered, moved to Gong.",
  "s0372": "Therefore Qi people resented wang Jian not early with feudal lords united alliance attacked Qin, listened evil minister guests to perish his state, sang it said: 'Pine or cypress?",
  "s0373": "Reside Jian Gong guests?'",
  "s0374": "Hated Jian used guests not auspicious.",
  "s0375": "Grand Historian said: Probably Confucius late happy Yi.",
  "s0376": "Yi what technique, dark bright far, not through person reach talent who able note!",
  "s0377": "Former Zhou Grand Historian divined Tian Jing Zhong Wan, occupied to ten generations after;",
  "s0378": "And Wan fled Qi, Yi Zhong divined also said.",
  "s0379": "Tian Qi and Chang so compared offend two jun, specialized Qi state governance, not necessarily affair momentum gradually so, probably followed fulfilled signs omens."
}
