{
  "s460": "Zhang Wu.",
  "s461": "As younger brother of Empress Wen, Marquis, ten thousand one thousand eight hundred sixty-nine households.",
  "s464": "One. Later seventh year sixth month yi mao, Marquis Jing Dou Guang Guo first year.",
  "s465": "Six. Ten. Former seventh year, Marquis Gong Wan first year.",
  "s466": "Eight. Yuanguang third year, Marquis Chang Zuo first year. Ten. Yuanshou first year, Marquis Chang Zuo convicted of plotting murder but not killing, state abolished.",
  "s467": "Nan Pi.",
  "s468": "As son of Dou Chang, elder brother of Empress Wen, Marquis, six thousand four hundred sixty households.",
  "s471": "One. Later seventh year sixth month yi mao, Marquis Dou Peng Zu first year.",
  "s472": "Sixteen",
  "s473": "Five. Jianyu sixth year, Marquis Yi Liang first year. Five. Yuanguang fifth year, Marquis Sang Lin first year. Eighteen. Yuanding fifth year, Marquis Sang Lin convicted of tribute gold, state abolished.",
  "s482": "Ping Lu.",
  "s483": "Son of Prince Yuan of Chu, Marquis, three thousand two hundred sixty-seven households.",
  "s487": "Two. First year fourth month yi si, Marquis Liu Li first year. Third year, Marquis Li became King of Chu, state abolished.",
  "s490": "Xiu",
  "s491": "Son of Prince Yuan of Chu, Marquis.",
  "s495": "Two. First year fourth month yi si, Marquis Fu first year. Third year, Marquis Fu with nephew Rong as King of Chu rebelled, Fu with family came to Chang'an north gate to surrender, could not control, submitted seal and ribbon. Decree restored king. Later Ping Lu Marquis became King of Chu, re-enfeoffed Fu as Marquis of Hong.",
  "s498": "Shen You.",
  "s499": "Son of Prince Yuan of Chu, Marquis, one thousand three hundred eighty households.",
  "s503": "Sixteen. First year fourth month yi si, Marquis Yi Liu Ai first year.",
  "s504": "Four. Jianyu fifth year, Marquis Shou first year. Eighteen. Yuanshou fifth year, Marquis Shou convicted of as Superintendent of the Imperial Clan not properly receiving imperial clan petitions, disrespectful, state abolished.",
  "s506": "Hong.",
  "s507": "Son of Prince Yuan of Chu, Marquis, one thousand seven hundred fifty households.",
  "s511": "Four. Third year fourth month yi si, Marquis Zhuang Fu first year. One. Former seventh year, Marquis Dao Cheng first year. Nine. Zhong first year, Marquis Jing Fa first year.",
  "s512": "Fifteen. Yuanshuo fourth year, Marquis Zhang first year. One. Yuanshuo fifth year, Marquis Zhang died, no posterity, state abolished.",
  "s514": "Wan Qu.",
  "s515": "Son of Prince Yuan of Chu, Marquis.",
  "s519": "Two. First year fourth month yi si, Marquis Liu Yi first year. Third year, Marquis Yi rebelled, state abolished.",
  "s522": "Wei Qi.",
  "s523": "As General garrisoned Xingyang, defended against seven states of Wu Chu, Marquis, three thousand three hundred fifty households.",
  "s527": "Fourteen. Third year sixth month yi si, Marquis Dou Ying first year.",
  "s528": "Nine. Jianyu first year became Chancellor, two years dismissed. Yuanguang fourth year, Marquis Ying convicted of disputing Guan Fu affair, memorialized claiming it was former emperor's edict, forged imperial order, executed in market, state abolished.",
  "s530": "Ji Le",
  "s531": "Son of Prince Yuan of Chu, Marquis, one thousand two hundred thirteen households.",
  "s535": "Fourteen. Third year eighth month ren zi, Marquis Jing Liu Tiao first year.",
  "s536": "One. Jianyu second year, Marquis Gong Ying first year. Eleven. Yuanshuo first year, Marquis Qing first year. Sixteen. Yuanding fifth year, Marquis Qing convicted of tribute gold, state abolished.",
  "s538": "Yu.",
  "s539": "As General in Wu Chu rebellion attacked Qi with merit. Bu was formerly Peng Yue's attendant, when Yue rebelled Bu was sent to Qi, returned after beheading Yue, Bu sacrificed and wept for him, should be boiled, spoke loyal words, Gaozu pardoned him. Ying Bu rebelled, Bu served as Colonel, Marquis, one thousand eight hundred households.",
  "s543": "Six. Sixth year fourth month ding mao, Marquis Luan Bu first year. Zhong fifth year, Marquis Bu died.",
  "s544": "Ten. Yuanshou sixth year, Marquis Ben convicted of as Grand Master of Ceremonies temple sacrifices not according to regulations, committed crime, state abolished.",
  "s546": "Jian Ling",
  "s547": "As General attacking Wu Chu with merit, used as Commander, Marquis, one thousand three hundred ten households.",
  "s551": "Eleven. Sixth year fourth month ding mao, Marquis Jing Wei Wan first year.",
  "s552": "Ten. Yuanguang fifth year, Marquis Xin first year. Eighteen. Yuanding fifth year, Marquis Xin convicted of tribute gold, state abolished.",
  "s554": "Jian Ping.",
  "s555": "As General attacking Wu Chu with merit, used as Prime Minister of Jiangdu, Marquis, three thousand one hundred fifty households.",
  "s559": "Eleven. Sixth year fourth month ding mao, Marquis Ai Cheng Jia first year.",
  "s560": "Seven. Yuanguang second year, Marquis Jie Heng first year. One. Yuanguang third year, Marquis Hui first year. One. Yuanguang fourth year, Marquis Hui died, no posterity, state abolished.",
  "s562": "Ping Qu.",
  "s563": "As General attacking Wu Chu with merit, used as Grand Administrator of Longxi, Marquis, three thousand two hundred twenty households.",
  "s567": "Five. Sixth year fourth month ji si, Marquis Gong Sun Kun first year. Xie. Zhong fourth year, Marquis Kun Xie committed crime, state abolished. Grand Servant He Father.",
  "s673": "Fifteen. Zhenghe second year seventh month xin si, Marquis He convicted of crown prince affair, state abolished.",
  "s674": "Long Lü.",
  "s675": "As son of eldest princess, Marquis, four thousand one hundred twenty-six households.",
  "s679": "Five. Zhong fifth year fifth month ding chou, Marquis Xi first year.",
  "s680": "Twenty-four. Yuanding first year, Marquis Xi convicted of mother eldest princess died without removing mourning clothes, adultery, beastly conduct, should die, suicide, state abolished.",
  "s682": "Cheng Shi.",
  "s683": "As son of Prince Xiao of Liang, Marquis.",
  "s687": "Zhong fifth year fifth month ding mao, Marquis Mai first year. Zhong sixth year, Marquis Mai succeeded as King of Liang, state abolished.",
  "s690": "Huan Yi",
  "s691": "As son of Prince Xiao of Liang, Marquis.",
  "s695": "One. Zhong fifth year fifth month ding mao, Marquis Ming first year. Zhong sixth year, became King of Jichuan, state abolished.",
  "s698": "Ge.",
  "s699": "As elder brother of Empress Jing, Marquis, two thousand eight hundred ninety households.",
  "s703": "Five. Zhong fifth year fifth month jia xu, Marquis Jing Wang Xin first year.",
  "s704": "Twenty. Yuanshou third year, Marquis Yan first year. Eight. Yuanding fifth year, Marquis Yan convicted of tribute gold, state abolished.",
  "s706": "Sai",
  "s707": "As former Grand Minister of Justice who led troops attacking Wu Chu with merit, Marquis, one thousand forty-six households.",
  "s711": "Three. Later first year eighth month, Marquis Zhi Bu Yi first year.",
  "s712": "Three. Jianyu fourth year, Marquis Xiang Ru first year. Twelve. Yuanshuo fourth year, Marquis Jian first year. Thirteen. Yuanding fifth year, Marquis Jian convicted of tribute gold, state abolished.",
  "s714": "Wu An.",
  "s715": "As uterine younger brother of Empress Jing, Marquis, eight thousand two hundred fourteen households.",
  "s719": "One. Later third year third month, Marquis Tian Fen first year.",
  "s720": "Nine. Yuanguang fourth year, Marquis Wu first year. Five. Yuanshuo third year, Marquis Wu convicted of wearing short coat entering palace courtyard, disrespectful, state abolished.",
  "s722": "Zhou Yang.",
  "s723": "As uterine younger brother of Empress Jing, Marquis, six thousand twenty-six households.",
  "s727": "One. Later third year third month, Marquis Yi Tian Sheng first year.",
  "s728": "Eleven. Yuanguang sixth year, Marquis Peng Zu first year. Eight. Yuanshou second year, Marquis Peng Zu convicted of returning and not giving residence to Marquis Zhang, state abolished."
}
