{
  "s0001": "Xiang Ji was a native of Xiaxiang, with the courtesy name Yu.",
  "s0002": "When he first arose, he was twenty-four years old.",
  "s0003": "His uncle Xiang Liang's father was the Chu general Xiang Yan, who had been executed by the Qin general Wang Jian.",
  "s0004": "The Xiang clan had served as Chu generals for generations; they were enfeoffed at Xiang, hence they took Xiang as their surname.",
  "s0005": "When Xiang Ji was young, he studied writing but did not succeed; he gave it up to study the sword, but again did not succeed.",
  "s0006": "Xiang Liang was angry with him.",
  "s0007": "Ji said: \"Writing is sufficient merely to record names.",
  "s0008": "The sword is for fighting one person—not worth learning. I want to learn how to fight ten thousand.",
  "s0009": "Thereupon Xiang Liang taught Ji military strategy. Ji was greatly pleased and came to understand its general principles, but again was unwilling to pursue it to the end.",
  "s0010": "Xiang Liang once had a warrant issued against him from Liyang, so he asked Cao Jiu, the prison clerk of Qi, to write a letter to Sima Xin, the prison clerk of Liyang; by this connection the matter was dropped.",
  "s0011": "Xiang Liang killed a man and fled with Ji to avoid vengeance in the Wu region.",
  "s0012": "All the worthy officers and gentlemen of Wu were inferior to Xiang Liang.",
  "s0013": "Whenever there was a major corvée labor or funeral in Wu, Xiang Liang always took charge of organizing it, secretly using military methods to arrange his guests and young followers; by this they knew his ability.",
  "s0014": "When the First Emperor of Qin traveled to Kuaiji and crossed the Zhe River, Liang and Ji both went to observe.",
  "s0015": "Ji said: \"That one can be taken and replaced!\"",
  "s0016": "Liang covered his mouth and said: \"Do not speak recklessly—you will bring destruction on the clan!\"",
  "s0017": "Liang considered Ji extraordinary for this.",
  "s0018": "Ji was over eight feet tall, had strength enough to lift a tripod, and his talent and spirit surpassed others; even the young men of Wu all stood in awe of Ji.",
  "s0019": "In the seventh month of the first year of the Second Emperor of Qin, Chen She and others arose in Daze.",
  "s0020": "That ninth month, the Commandery Administrator of Kuaiji, Tong, said to Liang: \"West of the Yangtze all have rebelled; this is also the time when Heaven destroys Qin.",
  "s0021": "I have heard that he who acts first controls others, while he who acts later is controlled by others.",
  "s0022": "I wish to raise troops and have you and Huan Chu as generals.\"",
  "s0023": "At that time Huan Chu was a fugitive hiding in the marshes.",
  "s0024": "Liang said: \"Huan Chu is a fugitive; no one knows where he is—only Ji knows.\"",
  "s0025": "Liang then went out and instructed Ji to hold his sword outside and wait.",
  "s0026": "Liang returned inside, sat with the Administrator, and said: \"Please summon Ji and have him receive orders to summon Huan Chu.\"",
  "s0027": "The Administrator said: \"Very well.\"",
  "s0028": "Liang summoned Ji inside.",
  "s0029": "After a moment, Liang gave Ji a meaningful look and said: \"It can be done now!\"",
  "s0030": "Thereupon Ji drew his sword and beheaded the Administrator.",
  "s0031": "Xiang Liang took the Administrator's head and donned his seal and ribbons.",
  "s0032": "The gate attendants were greatly alarmed and in disorder; those Ji struck down numbered several tens or hundreds.",
  "s0033": "Everyone in the prefecture was terrified into submission; none dared rise.",
  "s0034": "Liang then summoned the former heroic officials he knew, explained to them why he was undertaking this great affair, and thereupon raised troops in Wu.",
  "s0035": "He sent people to take control of subordinate counties, obtaining eight thousand crack troops.",
  "s0036": "Liang appointed the heroes of Wu as colonels, captains, and majors.",
  "s0037": "There was one man who was not given appointment and spoke to Liang about it.",
  "s0038": "Liang said: \"Previously at a certain funeral I had you manage a certain matter, and you could not handle it; for this reason I cannot employ you.\"",
  "s0039": "The crowd was then all convinced.",
  "s0040": "Thereupon Liang became Commandery Administrator of Kuaiji, and Ji became Assistant General, pacifying the subordinate counties.",
  "s0041": "Zhao Ping of Guangling was at that time pacifying Guangling for King Chen but had not yet been able to take it.",
  "s0042": "Hearing that King Chen had been defeated and fled, and that Qin troops were about to arrive, he crossed the Yangtze, falsely invoked King Chen's command, and appointed Liang as Supreme Pillar of State of the King of Chu.",
  "s0043": "He said: \"The east of the Yangtze is already settled; urgently lead troops west to attack Qin.\"",
  "s0044": "Xiang Liang then crossed the Yangtze westward with eight thousand men.",
  "s0045": "Hearing that Chen Ying had already taken Dongyang, he sent an envoy wishing to join forces with him and go west together.",
  "s0046": "Chen Ying was a former clerk of the Dongyang magistrate; residing in the county, he had always been trustworthy and careful, known as an elder.",
  "s0047": "The young men of Dongyang killed their magistrate and assembled several thousand men; wishing to establish a leader but finding none suitable, they invited Chen Ying.",
  "s0048": "Ying declined saying he was unable, but they forcibly made Ying their leader; those who followed him from the county numbered twenty thousand.",
  "s0049": "The young men wished to make Ying king immediately, establishing an exceptional army distinguished by its black-headed [common] origins.",
  "s0050": "Chen Ying's mother said to Ying: \"Since I became your family's daughter-in-law, I have never heard that your ancestors had anyone of high rank.",
  "s0051": "Now to suddenly gain great fame is inauspicious.",
  "s0052": "It would be better to attach yourself to someone; if the affair succeeds you can still be enfeoffed as a marquis; if it fails you can easily escape, and you will not be one singled out by name.\"",
  "s0053": "Ying then did not dare become king.",
  "s0054": "He told his military officers: \"The Xiang clan has been a family of generals for generations and is famous in Chu.",
  "s0055": "Now if we wish to undertake a great affair, the general must not be the wrong person.",
  "s0056": "If I rely on a renowned clan, the destruction of Qin is certain.\"",
  "s0057": "Thereupon the multitude followed his words and submitted their troops to Xiang Liang.",
  "s0058": "Xiang Liang crossed the Huai; Qing Bu and General Pu also brought their troops to join him.",
  "s0059": "In all sixty to seventy thousand men, they encamped at Xiapei.",
  "s0060": "At that time, Qin Jia had already installed Jing Ju as King of Chu and was encamped east of Pengcheng, intending to resist Xiang Liang.",
  "s0061": "Xiang Liang said to his military officers: \"King Chen was the first to initiate the affair; battles went unfavorably, and we have not heard where he is.",
  "s0062": "Now Qin Jia has betrayed King Chen and installed Jing Ju—this is rebellion against the Way.\"",
  "s0063": "He then advanced his troops and attacked Qin Jia.",
  "s0064": "Qin Jia's army was defeated and fled; pursuing them to Huling.",
  "s0065": "Jia turned and fought for one day; Jia died and his army surrendered.",
  "s0066": "Jing Ju fled and died in the Liang region.",
  "s0067": "Having absorbed Qin Jia's army, Xiang Liang encamped at Huling, preparing to lead his army westward.",
  "s0068": "Zhang Han's army arrived at Li; Xiang Liang sent separate commanders Zhu Jishi and Lord Yufan to do battle.",
  "s0069": "Lord Yufan died.",
  "s0070": "Zhu Jishi's army was defeated and fled back to Huling.",
  "s0071": "Xiang Liang then led his troops into Xue and executed Jishi.",
  "s0072": "Xiang Liang previously had sent Xiang Yu separately to attack Xiangcheng; Xiangcheng held firm and did not fall.",
  "s0073": "Once it was taken, all were buried alive.",
  "s0074": "He returned and reported to Xiang Liang.",
  "s0075": "Xiang Liang heard that King Chen had definitely died, so he summoned the separate commanders to meet at Xue to plan matters.",
  "s0076": "At this time Pei Gong had also arisen at Pei and went there.",
  "s0077": "Fan Zeng, a man from Ju, seventy years old, had always stayed at home and liked extraordinary schemes; he went and persuaded Xiang Liang, saying: \"Chen She's failure was deserved.",
  "s0078": "When Qin destroyed the Six States, Chu was the most blameless.",
  "s0079": "Since King Huai entered Qin and did not return, the Chu people have pitied him to this day; therefore the Nan Gong of Chu said 'Though Chu may have but three clans remaining, he who destroys Qin will surely be Chu.'",
  "s0080": "Now Chen She initiated the affair but did not establish a descendant of Chu and instead made himself king; his power could not last.",
  "s0081": "Now you have arisen in the east of the Yangtze, and all the Chu generals swarming like bees compete to attach themselves to you because you are from a family of Chu generals for generations and are capable of restoring a descendant of Chu.\"",
  "s0082": "Thereupon Xiang Liang agreed with his words and sought out Xin, grandson of King Huai of Chu, among the common people—he was herding sheep—and installed him as King Huai, following what the people hoped for.",
  "s0083": "Chen Ying was made Supreme Pillar of State of Chu, enfeoffed with five counties, and resided with King Huai at Xutai.",
  "s0084": "Xiang Liang styled himself Lord of Martial Trust.",
  "s0085": "After several months, he led troops to attack Kangfu, joining with Qi's Tian Rong and Major Long Ju's armies to rescue Dong'e, greatly defeating the Qin army at Dong'e.",
  "s0086": "Tian Rong then led his troops back and expelled his king, Jia.",
  "s0087": "Jia fled to Chu.",
  "s0088": "Jia's Prime Minister Tian Jiao fled to Zhao.",
  "s0089": "Jiao's younger brother Tian Jian, formerly a Qi general, was residing in Zhao and did not dare return.",
  "s0090": "Tian Rong installed Tian Dan's son Shi as King of Qi.",
  "s0091": "Having broken the army below Dong'e, Xiang Liang pursued the Qin army.",
  "s0092": "He repeatedly sent envoys to urge Qi troops, wishing to go west together.",
  "s0093": "Tian Rong said: \"If Chu kills Tian Jia and Zhao kills Tian Jiao and Tian Jian, then I will send troops.\"",
  "s0094": "Xiang Liang said: \"Tian Jia was the king of an allied state; he came to me in distress—I cannot bear to kill him.\"",
  "s0095": "Zhao also would not kill Tian Jiao and Tian Jian to trade with Qi.",
  "s0096": "Qi thereupon refused to send troops to aid Chu.",
  "s0097": "Xiang Liang sent Pei Gong and Xiang Yu separately to attack Chengyang and massacre it.",
  "s0098": "They defeated the Qin army west at Puyang, then east; the Qin troops withdrew into Puyang.",
  "s0099": "Pei Gong and Xiang Yu then attacked Dingtao.",
  "s0100": "Dingtao did not fall, so they departed and went west to take territory, reaching Yongqiu, where they greatly defeated the Qin army and beheaded Li You.",
  "s0101": "Returning, they attacked Waihuang, but Waihuang did not fall.",
  "s0102": "Xiang Liang arose from Dong'e and went west, arriving at Dingtao by comparison, defeating the Qin army twice; Xiang Yu and others also beheaded Li You, and increasingly despised Qin, showing an arrogant bearing.",
  "s0103": "Song Yi then remonstrated with Xiang Liang, saying: \"When battles are won but the general grows arrogant and the troops lazy, defeat follows.",
  "s0104": "Now the troops are becoming slightly lazy, while Qin troops increase daily; I fear this for you.\"",
  "s0105": "Xiang Liang did not listen.",
  "s0106": "He then sent Song Yi as envoy to Qi.",
  "s0107": "On the road he met the Qi envoy, Lord Gaolin Xian, who said: \"Are you going to see Lord Wuxin?\"",
  "s0108": "He said: \"Yes.\"",
  "s0109": "He said: \"I predict that Lord Wuxin's army will certainly be defeated.",
  "s0110": "If you walk slowly you will avoid death; if you walk quickly you will meet disaster.\"",
  "s0111": "Qin indeed mustered all its troops to reinforce Zhang Han, attacked the Chu army, and greatly defeated it at Dingtao; Xiang Liang died.",
  "s0112": "Pei Gong and Xiang Yu left Waihuang to attack Chenliu, but Chenliu held firm and could not be taken.",
  "s0113": "Pei Gong and Xiang Yu consulted with each other, saying: \"Now that Xiang Liang's army is broken, the officers and troops are fearful.\"",
  "s0114": "They then led their troops eastward together with Lü Chen's army.",
  "s0115": "Lü Chen's army was east of Pengcheng, Xiang Yu's army west of Pengcheng, and Pei Gong's army at Dang.",
  "s0116": "Having broken Xiang Liang's army, Zhang Han considered that Chu territory's troops were not worth worrying about, so he crossed the Yellow River to attack Zhao and greatly defeated them.",
  "s0117": "At this time, Zhao Xie was king, Chen Yu was general, and Zhang Er was prime minister; all fled into Julu city.",
  "s0118": "Zhang Han ordered Wang Li and She Jian to surround Julu, while Zhang Han's army was to the south, constructing a walled supply road to transport grain.",
  "s0119": "Chen Yu as general led several tens of thousands of troops and encamped north of Julu; this was called the army north of the Yellow River.",
  "s0120": "The Chu army having been broken at Dingtao, King Huai was afraid and moved from Xutai to Pengcheng, combining Xiang Yu's and Lü Chen's armies to command them himself.",
  "s0121": "He made Lü Chen Minister of Ceremonies and his father Lü Qing Grand Councillor.",
  "s0122": "He made Pei Gong Administrator of Dang Commandery, enfeoffed him as Marquis of Wu'an, and had him command the troops of Dang Commandery.",
  "s0123": "Earlier, the Qi envoy Lord Gaolin Xian whom Song Yi had met was with the Chu army and saw the King of Chu, saying: \"Song Yi predicted that Lord Wuxin's army would certainly be defeated, and after several days, the army was indeed defeated.",
  "s0124": "That he could foresee signs of defeat before troops engaged in battle—this can be called understanding warfare.\"",
  "s0125": "The king summoned Song Yi to consult on affairs and was greatly pleased with him; consequently he appointed him Supreme General, made Xiang Yu Duke of Lu as second general, and Fan Zeng final general, to rescue Zhao.",
  "s0126": "All the separate generals were subordinate to Song Yi, who was titled Lord Superior to Ministers.",
  "s0127": "They marched to Anyang and remained there for forty-six days without advancing.",
  "s0128": "Xiang Yu said: \"I have heard that the Qin army has surrounded King Zhao at Julu; we should quickly lead troops across the river—Chu attacks from outside, Zhao responds from inside, and the Qin army will certainly be broken.\"",
  "s0129": "Song Yi said: \"Not so.",
  "s0130": "A gadfly that strikes an ox cannot break lice and nits.",
  "s0131": "Now Qin attacks Zhao; if they win the battle their troops will be exhausted, and we take advantage of their exhaustion;",
  "s0132": "if they do not win, then we lead troops beating drums westward and will certainly take Qin.",
  "s0133": "Therefore it is better to let Qin and Zhao fight first.",
  "s0134": "As for wearing armor and wielding sharp weapons, I am not your equal;",
  "s0135": "as for sitting and devising strategies, you are not my equal.\"",
  "s0136": "He then issued an order throughout the army: \"Those who are fierce as tigers, stubborn as sheep, greedy as wolves, and too headstrong to be commanded shall all be beheaded.\"",
  "s0137": "He then sent his son Song Xiang as prime minister to Qi, personally escorting him to Wuyan, where they drank wine in grand celebration.",
  "s0138": "The weather was cold with heavy rain; the officers and troops were freezing and starving.",
  "s0139": "Xiang Yu said: \"We are to unite our strength to attack Qin, yet we remain long without moving.",
  "s0140": "This year there is famine and the people are poor; the officers and troops eat taro and beans, the army has no stored grain, yet he drinks wine in grand celebration and does not lead troops across the river to obtain food from Zhao and join forces with Zhao to attack Qin, but instead says 'take advantage of their exhaustion.'",
  "s0141": "Given Qin's strength attacking newly established Zhao, the situation will certainly result in Zhao being taken.",
  "s0142": "When Zhao is taken and Qin grows stronger, what exhaustion is there to take advantage of!",
  "s0143": "Moreover, our state's army is newly broken, the king sits uneasy in his seat, having swept the territory to entrust everything to the general; the state's safety or danger rests on this single action.",
  "s0144": "Now he does not care for the officers and troops but pursues his private interests—he is not a minister of the altars of soil and grain.\"",
  "s0145": "Xiang Yu at morning audience with Supreme General Song Yi entered his tent and beheaded Song Yi's head, then issued orders throughout the army saying: \"Song Yi conspired with Qi to rebel against Chu; the King of Chu secretly ordered Yu to execute him.\"",
  "s0146": "At that time, all the generals were terrified into submission; none dared resist.",
  "s0147": "They all said: \"It was the general's family who first established Chu.",
  "s0148": "Now the general has executed disorder.\"",
  "s0149": "Thereupon they together installed Yu as Acting Supreme General.",
  "s0150": "He sent men to pursue Song Yi's son, caught up with him in Qi, and killed him.",
  "s0151": "He sent Huan Chu to report the order to King Huai.",
  "s0152": "King Huai consequently made Xiang Yu Supreme General; Lord Dangyang and General Pu were both subordinated to Xiang Yu.",
  "s0153": "Having killed Lord Superior to Ministers, Xiang Yu's authority shook the state of Chu and his fame was heard among the feudal lords.",
  "s0154": "He then dispatched Lord Dangyang and General Pu to lead twenty thousand troops across the river to rescue Julu.",
  "s0155": "The battle went slightly in their favor; Chen Yu again requested troops.",
  "s0156": "Xiang Yu then led all his troops across the river, sank all the boats, smashed the cooking pots and cauldrons, burned the shelters, and carried only three days' rations, to show his officers and troops they must fight to the death with no thought of return.",
  "s0157": "Thereupon when they arrived they surrounded Wang Li, engaged the Qin army, fought nine battles, severed their supply corridor, greatly defeated them, killed Su Jiao, and captured Wang Li.",
  "s0158": "She Jian would not surrender to Chu and burned himself to death.",
  "s0159": "At that time, the Chu troops were foremost among the feudal lords.",
  "s0160": "The feudal lords' armies rescuing those below Julu numbered over ten encampments, but none dared release their troops.",
  "s0161": "When Chu attacked Qin, all the generals watched from atop their ramparts.",
  "s0162": "Every Chu fighting man fought one against ten; the Chu troops' battle cries shook the heavens, and there was not a man in the feudal lords' armies who was not trembling in fear.",
  "s0163": "Having thus broken the Qin army, Xiang Yu summoned to audience the feudal lords' generals; entering the gate with barriers, every one advanced on their knees, none daring to look up.",
  "s0164": "From this time Xiang Yu first became Supreme General over the feudal lords, and all the feudal lords were subordinate to him.",
  "s0165": "Zhang Han's army was at Jiyuan, Xiang Yu's army south of the Zhang River, confronting each other without battle.",
  "s0166": "The Qin army retreated several times; the Second Emperor sent men to reproach Zhang Han.",
  "s0167": "Zhang Han was afraid and sent Chief Clerk Xin to request instructions.",
  "s0168": "Reaching Xianyang, he remained at the Sima Gate for three days; Zhao Gao would not see him, and doubts arose in his heart.",
  "s0169": "Chief Clerk Xin was afraid and fled back to his army, not daring to take the usual route; Zhao Gao indeed sent men to pursue him but did not catch up.",
  "s0170": "Xin reached the army and reported: \"Zhao Gao handles affairs at court; below there is nothing that can be done.",
  "s0171": "Now if we win battles, Gao will certainly be jealous and resent our achievements;",
  "s0172": "if we cannot win battles, we will not escape death.",
  "s0173": "I hope the general will carefully consider this.\"",
  "s0174": "Chen Yu also sent a letter to Zhang Han saying: \"Bai Qi as Qin general conquered Yan and Ying to the south, buried alive the forces of Ma Fu to the north, attacked cities and took territory beyond count, yet in the end was granted death.",
  "s0175": "Meng Tian as Qin general drove back the Rong people to the north, opened up territory at Yuzhong for several thousand li, yet was finally beheaded at Yangzhou.",
  "s0176": "Why?",
  "s0177": "Their achievements were many; Qin could not enfeoff them all, so used the law to execute them.",
  "s0178": "Now the general has been Qin's general for three years; those lost and defeated number in the hundreds of thousands, yet the feudal lords rise together and increase ever more.",
  "s0179": "That Zhao Gao has long been accustomed to flattery; now that affairs are urgent, he also fears the Second Emperor will execute him, so wants to use the law to execute the general to evade responsibility, having someone else replace the general to escape his own disaster.",
  "s0180": "The general has been abroad long with many internal setbacks; whether you have achievements or not, you will be executed.",
  "s0181": "Moreover, that Heaven will destroy Qin is known by all, foolish or wise.",
  "s0182": "Now the general internally cannot remonstrate directly, and externally is a general of a perishing state, standing isolated and alone yet wishing to survive constantly—how pitiful!",
  "s0183": "Why does the general not turn his troops and form a vertical alliance with the feudal lords, agree to attack Qin together, divide and rule its territory, face south and call yourself lord?",
  "s0184": "Which is better—this, or having your body subjected to the axe and chopping block, your wife and children executed?\"",
  "s0185": "Zhang Han was doubtful and secretly sent Hou Shicheng as envoy to Xiang Yu, seeking an agreement.",
  "s0186": "Before the agreement was concluded, Xiang Yu had General Pu lead troops day and night across Sanhu, encamped south of the Zhang River, and fought with Qin, defeating them twice.",
  "s0187": "Xiang Yu led all his troops to attack the Qin army at Wu River, greatly defeating them.",
  "s0188": "Zhang Han sent men to see Xiang Yu, seeking an agreement.",
  "s0189": "Xiang Yu summoned his military officers to deliberate, saying: \"Grain is scarce; I wish to accept their agreement.\"",
  "s0190": "The military officers all said: \"Good.\"",
  "s0191": "Xiang Yu then made an appointment at Yin Ruins south of the Huan River.",
  "s0192": "Having sworn the oath, Zhang Han saw Xiang Yu and wept, explaining about Zhao Gao.",
  "s0193": "Xiang Yu then installed Zhang Han as King of Yong and kept him in the Chu army.",
  "s0194": "He made Chief Clerk Xin supreme general to lead the Qin army as vanguard.",
  "s0195": "They reached Xin'an.",
  "s0196": "The feudal lords' officers and troops at different times had previously been sent on corvée duty to garrison passes through Qin territory; Qin officers and troops had treated them mostly without propriety, and when the Qin army surrendered to the feudal lords, the feudal lords' officers and troops, riding their victory, mostly enslaved and used them, lightly abusing and humiliating Qin officers and troops.",
  "s0197": "Many Qin officers and troops secretly said: \"General Zhang and others deceived us into surrendering to the feudal lords; now if we can enter the passes and break Qin, very good;",
  "s0198": "but if we cannot, the feudal lords will capture us and go east, and Qin will certainly execute all our fathers, mothers, wives, and children.\"",
  "s0199": "The feudal lords faintly heard their plotting and informed Xiang Yu.",
  "s0200": "Xiang Yu then summoned Qing Bu and General Pu to deliberate, saying: \"The Qin officers and troops are still numerous and their hearts are not submissive; when we reach Guanzhong if they do not obey, the situation will certainly be dangerous; it would be better to strike and kill them, and go into Qin only with Zhang Han, Chief Clerk Xin, and Commandant Yi.\"",
  "s0201": "Thereupon the Chu army by night attacked and buried alive over two hundred thousand Qin troops south of Xin'an city.",
  "s0227": "Pei Gong said: \"How do you have a connection with Xiang Bo?\"",
  "s0228": "Zhang Liang said: \"In Qin times he traveled with me; Xiang Bo killed a man and I saved his life.",
  "s0229": "Now affairs are urgent, so he was fortunate to come inform Liang.\"",
  "s0230": "Pei Gong said: \"Who is older, you or he?\"",
  "s0231": "Liang said: \"He is older than me.\"",
  "s0232": "Pei Gong said: \"Call him in for me; I can treat him as an elder brother.\"",
  "s0233": "Zhang Liang went out and invited Xiang Bo.",
  "s0234": "Xiang Bo then entered to see Pei Gong.",
  "s0235": "Pei Gong presented a cup of wine for a toast, made an agreement of marriage alliance, and said: \"When I entered the passes, I did not dare touch even the slightest thing; I registered the officials and people, sealed the treasuries, and waited for the general.",
  "s0236": "The reason I dispatched generals to guard the passes was to prepare against other bandits entering and exiting and extraordinary events.",
  "s0237": "Day and night I awaited the general's arrival—how would I dare rebel!",
  "s0238": "I hope you will fully explain to him that I would not dare betray his kindness.\"",
  "s0239": "Xiang Bo consented.",
  "s0240": "He said to Pei Gong: \"Tomorrow you must come early yourself to apologize to King Xiang.\"",
  "s0241": "Pei Gong said: \"Yes.\"",
  "s0242": "Thereupon Xiang Bo departed again by night, reached the army, and fully reported Pei Gong's words to King Xiang.",
  "s0243": "He consequently said: \"If Pei Gong had not first broken through Guanzhong, how would you have dared enter?",
  "s0244": "Now the man has great achievements yet you attack him—this is not righteous; it would be better to treat him well on this account.\"",
  "s0245": "King Xiang consented.",
  "s0256": "Fan Zeng rose, went out and summoned Xiang Zhuang, saying: \"The king is too soft-hearted; if you go in to offer a toast, when the toast is finished, request to perform a sword dance, and take the opportunity to strike Pei Gong where he sits and kill him.",
  "s0257": "If not, you and your kind will all become his captives.\"",
  "s0258": "Zhuang then entered to offer a toast; when the toast was finished, he said: \"The king and Pei Gong are drinking; in the army there is no way to make merry—I request to perform a sword dance.\"",
  "s0259": "King Xiang said: \"Very well.\"",
  "s0260": "Xiang Zhuang drew his sword and rose to dance; Xiang Bo also drew his sword and rose to dance, constantly using his body to shield Pei Gong with his wings, so Zhuang could not strike.",
  "s0261": "Thereupon Zhang Liang went to the army gate and saw Fan Kuai.",
  "s0262": "Fan Kuai said: \"How go today's affairs?\"",
  "s0263": "Liang said: \"Very urgent.",
  "s0264": "Right now Xiang Zhuang is performing a sword dance, but his intent is always on Pei Gong.\"",
  "s0265": "Kuai said: \"This is pressing; I request to enter and share his fate.\"",
  "s0266": "Kuai then wore his sword, grasped his shield, and entered the army gate.",
  "s0267": "The guards with crossed halberds wished to stop him from entering; Fan Kuai turned his shield sideways to ram them, the guards fell to the ground, Kuai then entered, pushed aside the curtain and stood facing west, glaring at King Xiang, his hair standing on end and the corners of his eyes splitting open.",
  "s0268": "King Xiang pressed his hand on his sword and knelt upright, saying: \"Who is this stranger?\"",
  "s0269": "Zhang Liang said: \"This is Pei Gong's bodyguard Fan Kuai.\"",
  "s0270": "King Xiang said: \"A brave man! Give him a cup of wine.\"",
  "s0271": "They then gave him a dou-measure cup of wine.",
  "s0272": "Kuai bowed in thanks, rose, and drank it standing.",
  "s0273": "King Xiang said: \"Give him a pork shoulder.\"",
  "s0274": "They then gave him a raw pork shoulder.",
  "s0275": "Fan Kuai placed his shield on the ground, put the pork shoulder on top, drew his sword, sliced it, and devoured it.",
  "s0276": "King Xiang said: \"Brave man, can you drink more?\"",
  "s0277": "Fan Kuai said: \"I do not even avoid death—why would a cup of wine be worth declining!",
  "s0278": "The King of Qin had the heart of a tiger and wolf; he killed men as if unable to finish, punished men as if fearing he could not prevail; the entire world rebelled against him.",
  "s0279": "King Huai made an agreement with the generals saying 'He who first breaks through Qin and enters Xianyang shall be its king.'",
  "s0280": "Now Pei Gong first broke through Qin and entered Xianyang; he did not dare touch even the slightest hair, sealed and closed the palace chambers, returned his army to Bashang, and waited for the great king to arrive.",
  "s0281": "The reason he dispatched generals to guard the passes was to prepare against other bandits entering and exiting and extraordinary events.",
  "s0282": "His toil and suffering with achievements so high—yet there has been no reward of enfeoffment as a marquis, and instead you listen to petty slander wishing to execute someone with achievements.",
  "s0283": "This is merely continuing the Qin's path to destruction; I secretly believe the great king should not take it.\"",
  "s0284": "King Xiang had no response and said: \"Sit.\"",
  "s0285": "Fan Kuai sat with Liang.",
  "s0286": "After sitting briefly, Pei Gong rose as if to use the privy and beckoned Fan Kuai to come out.",
  "s0300": "After Pei Gong had left and stolen away to reach the army, Zhang Liang entered to apologize, saying: \"Pei Gong cannot hold his wine and is unable to take leave.",
  "s0301": "He has respectfully sent me, Liang, with a pair of white jade disks, to bow twice and present them at the great king's feet;",
  "s0302": "and a pair of jade dippers, to bow twice and offer them at the Supreme General's feet.\"",
  "s0303": "King Xiang said: \"Where is Pei Gong?\"",
  "s0304": "Liang said: \"Hearing the great king intended to reproach and censure him, he escaped alone and has already reached his army.\"",
  "s0305": "King Xiang then accepted the disks and placed them on his seat.",
  "s0306": "The Second Father accepted the jade dippers, placed them on the ground, drew his sword, struck and shattered them, saying: \"Alas!",
  "s0307": "This youngster is not worth plotting with.",
  "s0308": "He who seizes all under Heaven from King Xiang will certainly be Pei Gong; we will now become his captives.\"",
  "s0309": "When Pei Gong reached his army, he immediately executed Cao Wushang.",
  "s0310": "After several days, Xiang Yu led his troops west, massacred Xianyang, killed the surrendered King of Qin, Ziying, burned the Qin palace chambers—the fire did not go out for three months;",
  "s0311": "collected their wealth, treasures, and women, and went east.",
  "s0312": "Someone persuaded King Xiang, saying: \"Guanzhong is protected by mountains and rivers on four sides; the land is fertile and rich—you could make it your capital to establish hegemony.\"",
  "s0313": "King Xiang saw that the Qin palaces had all been burned and ruined, and in his heart he longed to return east, saying: \"Wealth and honor without returning to one's native place is like wearing embroidered robes at night—who would know it!\"",
  "s0314": "The persuader said: \"People say the Chu are macaques wearing caps—it turns out to be true.\"",
  "s0315": "King Xiang, hearing this, boiled the persuader alive.",
  "s0316": "King Xiang sent men to present orders to King Huai.",
  "s0317": "King Huai said: \"According to the agreement.\"",
  "s0318": "They then honored King Huai as the Righteous Emperor.",
  "s0319": "King Xiang wished to make himself king and first made the generals and ministers kings.",
  "s0320": "He said: \"When all under Heaven first raised difficulties, we provisionally installed descendants of feudal lords to attack Qin.",
  "s0321": "Yet I personally wore armor and wielded sharp weapons to initiate affairs, exposed in the wilderness for three years; those who destroyed Qin and settled all under Heaven were all you generals, ministers, and lords together with Ji's strength.",
  "s0322": "Though the Righteous Emperor had no achievements, he should still be given his share of territory to rule.\"",
  "s0323": "All the generals said: \"Excellent.\"",
  "s0324": "He then divided all under Heaven and installed the generals as marquis-kings.",
  "s0325": "King Xiang and Fan Zeng suspected Pei Gong of having designs on all under Heaven; affairs had already been reconciled, yet they were reluctant to break the agreement and feared the feudal lords would rebel; so they secretly plotted, saying: \"The roads of Ba and Shu are treacherous; the Qin people who were exiled all reside in Shu.\"",
  "s0326": "They then said: \"Ba and Shu are also Guanzhong territory.\"",
  "s0327": "Therefore they installed Pei Gong as King of Han, to rule Ba, Shu, and Hanzhong, with his capital at Nanzheng.",
  "s0328": "They divided Guanzhong into three parts, making kings of the surrendered Qin generals to block the King of Han.",
  "s0329": "King Xiang then installed Zhang Han as King of Yong, ruling west of Xianyang, with his capital at Feiqiu.",
  "s0330": "Chief Clerk Xin had formerly been a prison clerk at Liyang and once had shown kindness to Xiang Liang;",
  "s0331": "Commandant Dong Yi had originally urged Zhang Han to surrender to Chu.",
  "s0332": "Therefore he installed Sima Xin as King of Sai, ruling from east of Xianyang to the Yellow River, with his capital at Liyang;",
  "s0333": "installed Dong Yi as King of Di, ruling Shangjun, with his capital at Gaonu.",
  "s0334": "He moved King Bao of Wei to be King of Western Wei, ruling Hedong, with his capital at Pingyang.",
  "s0335": "Shen Yang of Xiaqiu was a favorite minister of Zhang Er; he had first taken Henan Commandery and welcomed Chu at the Yellow River, so they installed Shen Yang as King of Henan, with his capital at Luoyang.",
  "s0336": "King Cheng of Han retained his former capital, with his capital at Yangzhai.",
  "s0337": "Zhao general Sima Ang had pacified Henei and repeatedly achieved merit, so they installed Ang as King of Yin, ruling Henei, with his capital at Chaoge.",
  "s0338": "They moved King Xie of Zhao to be King of Dai.",
  "s0339": "Zhao's Prime Minister Zhang Er had always been worthy and also followed them into the passes, so they installed Er as King of Changshan, ruling Zhao territory, with his capital at Xiangguo.",
  "s0340": "Lord Dangyang Qing Bu as Chu general had always been foremost, so they installed Bu as King of Jiujiang, with his capital at Liu.",
  "s0341": "Lord Po Wu Rui led the Hundred Yue to assist the feudal lords and also followed them into the passes, so they installed Rui as King of Hengshan, with his capital at Zhu.",
  "s0342": "The Righteous Emperor's Supreme Pillar of State Gong Ao led troops to attack Nanjun with many achievements, so they installed Ao as King of Linjiang, with his capital at Jiangling.",
  "s0343": "They moved King Han Guang of Yan to be King of Liaodong.",
  "s0344": "Yan general Zang Tu followed Chu to rescue Zhao and consequently followed them into the passes, so they installed Tu as King of Yan, with his capital at Ji.",
  "s0345": "They moved King Tian Shi of Qi to be King of Jiaodong.",
  "s0346": "Qi general Tian Du followed together to rescue Zhao and consequently followed them into the passes, so they installed Du as King of Qi, with his capital at Linzi.",
  "s0347": "Tian An, grandson of King Jian of Qi whom Qin had destroyed—when Xiang Yu was crossing the Yellow River to rescue Zhao, Tian An took several cities in Jibei and led his troops to surrender to Xiang Yu, so they installed An as King of Jibei, with his capital at Boyang.",
  "s0348": "Thus the feudal lords were all enfeoffed; they all went to their states.",
  "s0349": "King Huai of Chu, the Righteous Emperor, was without territory.",
  "s0350": "In the tenth month, King Xiang of Chu left Xiang Yu to go to Pengcheng, killed Tian An of Jibei, made his state part of Chu.",
  "s0351": "In the first month, he made an announcement saying: \"The Righteous Emperor has no descendants.\"",
  "s0352": "He secretly ordered the kings of Hengshan and Linjiang to attack and kill the Righteous Emperor at Jiangzhong.",
  "s0353": "The King of Han heard that the Righteous Emperor had been killed, then mourned for him.",
  "s0354": "When the feudal lords heard that the King of Han mourned the Righteous Emperor, they mostly rebelled against Chu and pledged allegiance to Han; the land of Qi and Zhao revolted several times.",
  "s0355": "In the second month, the King of Han from his fief in Nanzheng went out and took his kingdom; the subordinate counties in the territory of Ba and Shu rallied to him.",
  "s0356": "In the third month, he crossed Lin Jin in the north.",
  "s0357": "In the fourth month, he reached Chencang, fixed roads and repaired bridges, blocked the old passage by burning.",
  "s0358": "King Xiang sent troops to block the Triple Pass; none could pass through.",
  "s0359": "In the fifth month, King Han pacified the Three Qins; King Xiang heard this and was greatly enraged.",
  "s0360": "He sent Marquis of Jiujiang to attack Han; also sent soldiers to surround the King of Yan and Marquis of Yangxia.",
  "s0361": "Marquis of Yangxia fled to Han.",
  "s0362": "He sent others to persuade the King of Qi to rebel against Han, and the King of Qi rebelled against Han and allied with Chu.",
  "s0363": "King Xiang himself marched east to strike Qi.",
  "s0364": "He reached Chenyi where he heard that the King of Han had already occupied the three parts of Guanzhong and would attack Chu; King Xiang then returned to lead his troops north, killing Tian Rong.",
  "s0365": "The King of Han went out to lead his troops to seize Pengcheng; King Xiang heard this and led his troops back to defeat the King of Han at Pengcheng, beheaded Marquis of Jiujiang, and the King of Han fled.",
  "s0366": "King Xiang then went north to strike the lands of Qi; all of Qi revolted to follow Tian Rong's younger brother Tian Heng as king.",
  "s0367": "The King of Han gained possession of Lu, Liang, Chu, and Zhao, and sent envoys respectfully inviting the kings of the feudal lords to attack Chu together.",
  "s0368": "In the fourth month of the third year of Han, King Xiang heard that the King of Han had occupied Pengcheng; King Xiang was then in Qi, riding day and night from Qi, engaging the Han army at Lu.",
  "s0369": "The Han army had many soldiers, tens of thousands of people, and blocked the water's edge; the King of Chu constantly selected elite cavalry of three thousand, the Han army was completely defeated.",
  "s0370": "In the fourth month of that year, King Xiang went west through Lingbi, striking the troops of Han and the feudal lords, defeating them; Liang and Chu were pacified.",
  "s0371": "The King of Han fled north, crossing the Sui River.",
  "s0372": "He obtained the soldiers of Marquis of Jiangxia and the King of Han troops, garrisoned them at Yongqiu, planning together to strike Chu.",
  "s0373": "Intending to go west to strike King Xiang.",
  "s0374": "King Xiang heard this and made camp at Lu, attacking eastward.",
  "s0375": "Marquis of Jiangxia and the King of Han's troops saw King Xiang coming and fled.",
  "s0376": "King Xiang then gathered his troops together and went west from Xiao, striking the Han army at dawn and going east, reaching Pengcheng at midday, greatly defeating the Han army.",
  "s0377": "The Han army all fled, following each other into the Gu and Si rivers; over a hundred thousand Han troops were killed.",
  "s0378": "The Han troops all fled south to the mountains; Chu pursued and struck them to east of Lingbi at the Sui River.",
  "s0379": "The Han army retreated and was pushed back by Chu; many were killed; over a hundred thousand Han troops all entered the Sui River, and the Sui River stopped flowing because of them.",
  "s0380": "They surrounded the King of Han three times round.",
  "s0381": "Thereupon a great wind arose from the northwest, breaking trees and overturning houses, raising sand and stones, darkness descending at midday, striking head-on against the Chu army.",
  "s0382": "The Chu army was thrown into great disorder and scattered, and the King of Han was then able to escape with several tens of riders; he wished to pass through Pei to collect his family and go west;",
  "s0383": "but Chu also sent men to pursue them to Pei and take the King of Han's family—the family had all disappeared and did not meet the King of Han.",
  "s0384": "On the road the King of Han happened to find Xiao Hui and Lu Yuan and then loaded them on his chariot.",
  "s0385": "Chu cavalry pursued the King of Han; the King of Han in his urgency pushed Xiao Hui and Lu Yuan off the chariot; Duke Teng constantly got down to pick them up and load them back.",
  "s0386": "It was like this three times.",
  "s0387": "He said: \"Though urgent, we cannot drive fast—how can you abandon them?\"",
  "s0388": "Thereupon they finally escaped.",
  "s0389": "Seeking the Grand Duke and Lü Hou, they did not meet.",
  "s0390": "Shen Yiji followed the Grand Duke and Lü Hou traveling secretly, seeking the King of Han, but instead encountered the Chu army.",
  "s0391": "The Chu army then took them back and reported to King Xiang; King Xiang constantly kept them in the army.",
  "s0392": "At this time Lü Hou's elder brother Lord Zhou Lü commanded Han troops stationed at Xiayi; the King of Han stole away to join him and gradually gathered his officers and troops.",
  "s0393": "Reaching Yingyang, all the defeated armies assembled; Xiao He also sent forth from Guanzhong the old and weak not yet registered, all arriving at Yingyang, and they greatly rallied again.",
  "s0394": "Chu arose from Pengcheng, constantly riding victory to pursue northward, and fought with Han between Jing and Suo south of Yingyang; Han defeated Chu, so Chu could not pass west of Yingyang.",
  "s0395": "When King Xiang rescued Pengcheng and pursued the King of Han to Yingyang, Tian Heng also managed to recover Qi and installed Tian Rong's son Guang as King of Qi.",
  "s0396": "After the King of Han's defeat at Pengcheng, the feudal lords all again joined with Chu and turned their backs on Han.",
  "s0397": "The Han army at Yingyang constructed a walled supply road connecting it to the river to obtain grain from Ao Granary.",
  "s0398": "In the third year of Han, King Xiang repeatedly raided and seized Han's supply road; the King of Han's food was scarce and he was afraid; he requested peace, offering to cede Yingyang and west as Han.",
  "s0399": "King Xiang wished to accept this.",
  "s0400": "Marquis of Liyang Fan Zeng said: \"Han is easy to deal with; now if you release them without taking them, you will certainly regret it later.\"",
  "s0401": "King Xiang then urgently besieged Yingyang together with Fan Zeng.",
  "s0402": "The King of Han was troubled by this and employed Chen Ping's stratagem to sow discord with King Xiang.",
  "s0403": "When King Xiang's envoy came, they prepared a grand feast and were about to present it.",
  "s0404": "Seeing the envoy, they feigned shock and said: \"I thought it was the Second Father's envoy, but it turns out to be King Xiang's envoy.\"",
  "s0405": "They took it away and instead served poor food to King Xiang's envoy.",
  "s0406": "The envoy returned and reported to King Xiang; King Xiang then suspected Fan Zeng of having secret dealings with Han and gradually took away his authority.",
  "s0407": "Fan Zeng was greatly enraged and said: \"The affairs of all under Heaven are largely settled; may the king manage them yourself.",
  "s0408": "I request to be granted my aged bones to return to the ranks.\"",
  "s0409": "King Xiang consented.",
  "s0410": "Before traveling to reach Pengcheng, an ulcer burst on his back and he died.",
  "s0411": "Han general Ji Xin persuaded the King of Han saying: \"Affairs are already urgent; I request to deceive Chu by pretending to be the king so the king can steal away.\"",
  "s0412": "Thereupon the King of Han sent out two thousand armored women by night from Yingyang's east gate; the Chu troops attacked them from four sides.",
  "s0413": "Ji Xin rode in a yellow-canopied chariot with a left-side banner and said: \"The city has run out of food; the King of Han surrenders.\"",
  "s0414": "The Chu army all shouted \"Long live!\"",
  "s0415": "The King of Han also with several tens of riders went out the west gate of the city and fled to Chenggao.",
  "s0416": "King Xiang saw Ji Xin and asked: \"Where is the King of Han?\"",
  "s0417": "He said: \"The King of Han has already left.\"",
  "s0418": "King Xiang burned and killed Ji Xin.",
  "s0419": "The King of Han sent Imperial Secretary Zhou Ke, Duke Cong, and Wei Bao to defend Yingyang.",
  "s0420": "Zhou Ke and Duke Cong plotted, saying: \"A king who has rebelled against his state is difficult to defend a city with.\"",
  "s0421": "They then together killed Wei Bao.",
  "s0422": "Chu took Yingyang city and captured Zhou Ke alive.",
  "s0423": "King Xiang said to Zhou Ke: \"Be my general; I will make you supreme general and enfeoff you with thirty thousand households.\"",
  "s0424": "Zhou Ke reviled him, saying: \"If you do not quickly surrender to Han, Han will now capture you; you are no match for Han.\"",
  "s0425": "King Xiang was enraged, boiled Zhou Ke, and also killed Duke Cong.",
  "s0426": "When the King of Han left Yingyang, he fled south to Wan and Ye, obtained King Bu of Jiujiang, marched gathering troops, and again entered to defend Chenggao.",
  "s0427": "In the fourth year of Han, King Xiang advanced his troops to besiege Chenggao.",
  "s0428": "The King of Han escaped, alone with Duke Teng going out Chenggao's north gate, crossed the Yellow River, and fled to Xiuwu, joining with Zhang Er and Han Xin's army.",
  "s0429": "The various generals gradually managed to exit Chenggao and follow the King of Han.",
  "s0430": "Chu then took Chenggao and wished to go west.",
  "s0431": "Han sent troops to resist them at Gong, preventing them from going west.",
  "s0432": "At this time, Peng Yue crossed the Yellow River to strike Chu at Dong'e, killing Chu general Xue Gong.",
  "s0433": "King Xiang then went east himself to strike Peng Yue.",
  "s0434": "The King of Han obtained the Marquis of Huaiyin's troops and wished to cross south of the Yellow River.",
  "s0435": "Zheng Zhong persuaded the King of Han, who then stopped and encamped in Henei.",
  "s0436": "He sent Liu Jia to lead troops to assist Peng Yue and burn Chu's accumulated stores.",
  "s0437": "King Xiang struck and broke them to the east, driving off Peng Yue.",
  "s0438": "The King of Han then led troops to cross the Yellow River, retook Chenggao, encamped at Guangwu, and relied on Ao Granary for food.",
  "s0439": "Having pacified the Eastern Sea, King Xiang came west and with Han faced each other at Guangwu and encamped, confronting each other for several months.",
  "s0440": "At this time, Peng Yue repeatedly rebelled in the land of Liang, cutting off Chu's grain supply; King Xiang was troubled by this.",
  "s0441": "He made a high chopping block, placed the Grand Duke on top of it, and told the King of Han: \"If you do not quickly surrender, I will boil the Grand Duke.\"",
  "s0442": "The King of Han said: \"I and Xiang Yu both faced north to receive orders from King Huai, saying 'We agreed to be brothers'; my old man is then your old man—if you must boil your old man, then I hope you will share with me a cup of the broth.\"",
  "s0443": "King Xiang was enraged and wished to kill him.",
  "s0444": "Xiang Bo said: \"Affairs under Heaven cannot yet be known, and moreover one who strives for all under Heaven does not care for family; even if you kill him there is no benefit, only increasing disaster.\"",
  "s0445": "King Xiang followed this.",
  "s0446": "Chu and Han long confronted each other without resolution; the able-bodied suffered from military service, the old and weak were exhausted transporting grain.",
  "s0447": "King Xiang said to the King of Han: \"All under Heaven has been in chaos for several years solely because of us two; I wish to challenge the King of Han to single combat to determine victory or defeat; let us not needlessly cause the fathers and sons of all under Heaven's people to suffer.\"",
  "s0448": "The King of Han laughed and declined, saying: \"I would rather fight with wits than fight with strength.\"",
  "s0449": "King Xiang ordered a brave warrior to come out and challenge.",
  "s0450": "Han had a skilled horseback archer named Lou Fan; when Chu challenged to three bouts, Lou Fan always shot and killed them.",
  "s0451": "King Xiang was greatly enraged and personally donned armor and grasped his halberd to challenge.",
  "s0452": "Lou Fan wanted to shoot him, but King Xiang glared and shouted at him; Lou Fan's eyes dared not look and his hands dared not release; he then fled back inside the ramparts and dared not come out again.",
  "s0453": "The King of Han sent men to secretly inquire, and it turned out to be King Xiang.",
  "s0454": "The King of Han was greatly shocked.",
  "s0455": "Thereupon King Xiang then went to face the King of Han between Guangwu and speak with him.",
  "s0456": "The King of Han enumerated his crimes; King Xiang was enraged and wished to do battle.",
  "s0457": "The King of Han would not listen; King Xiang shot with a hidden crossbow and hit the King of Han.",
  "s0458": "The King of Han, wounded, fled into Chenggao.",
  "s0459": "King Xiang heard that the Marquis of Huaiyin had already taken the region north of the Yellow River, broken Qi and Zhao, and was about to strike Chu, so he sent Long Ju to strike him.",
  "s0460": "The Marquis of Huaiyin engaged in battle; cavalry general Guan Ying struck them, greatly broke the Chu army, and killed Long Ju.",
  "s0461": "Han Xin consequently made himself King of Qi.",
  "s0462": "King Xiang heard that Long Ju's army was broken and was then afraid, sending Wu She of Xutai to persuade the Marquis of Huaiyin.",
  "s0463": "The Marquis of Huaiyin would not listen.",
  "s0464": "At this time, Peng Yue rebelled again, took the land of Liang, and cut off Chu's grain supply.",
  "s0465": "King Xiang then said to Marquis of Haichun Grand Marshal Cao Jiu and others: \"Carefully defend Chenggao; even if Han wishes to challenge to battle, be cautious not to engage in battle, and do not let them get east—that is all.",
  "s0466": "In fifteen days I will certainly execute Peng Yue, settle the land of Liang, and then return to join the generals.\"",
  "s0467": "He then went east and marched to strike Chenliu and Waihuang.",
  "s0468": "Waihuang would not fall.",
  "s0469": "After several days it surrendered; King Xiang was enraged and ordered all males aged fifteen and above to assemble east of the city, intending to bury them alive.",
  "s0470": "An attendant of the magistrate of Waihuang, a boy of thirteen years, went to persuade King Xiang, saying: \"Peng Yue by force coerced Waihuang; Waihuang was afraid, so it surrendered temporarily, waiting for the great king.",
  "s0471": "When the great king arrived, if you bury them all alive, how can the hundred clans have a heart to submit?",
  "s0472": "From here eastward, over ten cities in the land of Liang will all be afraid and none will be willing to surrender.\"",
  "s0473": "King Xiang considered his words correct and pardoned those of Waihuang who were to be buried alive.",
  "s0474": "Going east to Suiyang, hearing of this they all competed to surrender to King Xiang.",
  "s0475": "Han indeed repeatedly challenged the Chu army to battle, but the Chu army would not come out.",
  "s0476": "He sent men to insult them; after five or six days, the Grand Marshal was enraged and crossed his troops over the Fan River.",
  "s0477": "When half the officers and troops had crossed, Han struck them, greatly broke the Chu army, and completely obtained all Chu's wealth and bribes.",
  "s0478": "Grand Marshal Jiu, Chief Clerk Yi, and King Xin of Sai all slit their own throats at the Fan River.",
  "s0479": "Grand Marshal Jiu had formerly been a prison clerk at Qi; Chief Clerk Xin had also formerly been a prison official at Liyang; both men had once shown kindness to Xiang Liang, which is why King Xiang trusted and employed them.",
  "s0480": "At that time, King Xiang was at Suiyang; hearing that Marquis of Haichun's army was defeated, he led his troops back.",
  "s0481": "The Han army was besieging Zhongli Mo east of Yingyang; when King Xiang arrived, the Han army feared Chu and all fled to dangerous terrain.",
  "s0482": "At this time, Han troops were numerous and food plentiful; King Xiang's troops were exhausted and food cut off.",
  "s0483": "Han sent Lu Jia to persuade King Xiang to request the Grand Duke; King Xiang would not listen.",
  "s0484": "The King of Han again sent Marquis Gong to persuade King Xiang; King Xiang then made an agreement with Han to divide all under Heaven in the middle: those west of the Hong Canal would be Han, those east of the Hong Canal would be Chu.",
  "s0485": "King Xiang agreed to this and immediately returned the King of Han's father, mother, wife, and children.",
  "s0486": "The army all shouted \"Long live!\"",
  "s0487": "The King of Han then enfeoffed Marquis Gong as Lord of Pingguo.",
  "s0488": "He hid and refused to be seen again.",
  "s0489": "He said: \"This man is a skilled debater under Heaven; wherever he resides he topples states, hence he is titled Lord of Pingguo.\"",
  "s0490": "Having made the agreement, King Xiang led his troops away and returned eastward.",
  "s0491": "Han wished to return westward; Zhang Liang and Chen Ping persuaded him, saying: \"Han possesses more than half of all under Heaven, and the feudal lords are all attached to it.",
  "s0492": "Chu troops are exhausted and food finished; this is the time when Heaven destroys Chu—it would be better to take advantage of the opportunity and take them completely.",
  "s0493": "Now if you release them without striking, this is what is called 'raising a tiger to bring trouble upon oneself.'\"",
  "s0494": "The King of Han listened to this.",
  "s0495": "In the fifth year of Han, the King of Han pursued King Xiang to south of Yangxia, stopped his army, and made an appointment with the Marquis of Huaiyin Han Xin and Marquis of Jiancheng Peng Yue to meet and strike the Chu army.",
  "s0496": "Reaching Guling, Xin and Yue's troops did not meet.",
  "s0497": "Chu struck the Han army and greatly broke them.",
  "s0498": "The King of Han again entered his ramparts, dug deep trenches, and defended himself.",
  "s0499": "He said to Zhang Zifang: \"The feudal lords do not follow the agreement—what should be done?\"",
  "s0500": "He replied: \"The Chu troops are about to be broken, but Xin and Yue have not yet had territory divided to them; that they do not arrive is naturally proper.",
  "s0501": "If the king can share all under Heaven with them, now you can immediately summon them.",
  "s0502": "If you cannot, affairs cannot yet be known.",
  "s0503": "If the king can give everything from Chen east to the sea entirely to Han Xin;",
  "s0504": "and from Suiyang north to Gucheng to give to Peng Yue—have each fight for themselves, then Chu will be easy to defeat.\"",
  "s0505": "The King of Han said: \"Excellent.\"",
  "s0506": "Thereupon he sent envoys to inform Han Xin and Peng Yue, saying: \"Join forces to strike Chu.",
  "s0507": "When Chu is broken, from Chen east to the sea will be given to the King of Qi, and from Suiyang north to Gucheng to Prime Minister Peng.\"",
  "s0508": "When the envoys arrived, Han Xin and Peng Yue both reported: \"We request to advance troops now.\"",
  "s0509": "Han Xin then came from Qi; Liu Jia's army came from Shouchun and marched together, massacred Chengfu, and reached Gaixia.",
  "s0510": "Grand Marshal Zhou Yin rebelled against Chu, using Shu to massacre Liu, raised the troops of Jiujiang, followed Liu Jia and Peng Yue, all met at Gaixia, and went to King Xiang.",
  "s0511": "King Xiang's army was encamped at Gaixia; troops were few and food exhausted; the Han army and feudal lords' troops surrounded them in several layers.",
  "s0512": "At night they heard the Han army singing Chu songs on all four sides; King Xiang was then greatly shocked and said: \"Has Han already obtained all of Chu?",
  "s0513": "Why are there so many Chu people!\"",
  "s0514": "King Xiang then rose at night and drank in his tent.",
  "s0515": "There was a beautiful woman named Yu who was constantly favored and followed him;",
  "s0516": "a fine horse named Zhui that he constantly rode.",
  "s0517": "Thereupon King Xiang was grieved and sang with passion, composing a poem himself, saying: \"My strength pulled up mountains, my spirit covered the world; yet times are unfavorable and Zhui will not advance.",
  "s0518": "When Zhui will not advance, what can be done? Yu, oh Yu, what shall I do with you!\"",
  "s0519": "He sang several stanzas; the beautiful woman harmonized with him.",
  "s0520": "King Xiang wept, tears streaming down; those around him all wept, none able to look up.",
  "s0521": "Thereupon King Xiang mounted his horse and rode; over eight hundred brave warriors under his command rode following him, burst straight through the encirclement by night heading south, and galloped away.",
  "s0522": "At dawn, the Han army realized this and ordered cavalry general Guan Ying to pursue him with five thousand cavalry.",
  "s0523": "King Xiang crossed the Huai; only about a hundred riders were able to follow.",
  "s0524": "King Xiang reached Yinling and lost his way; he asked an old farmer, who deceived him saying \"Left.\"",
  "s0525": "Going left, he then fell into a great marsh.",
  "s0526": "Because of this Han caught up with him.",
  "s0527": "King Xiang then again led his troops eastward and reached Dongcheng with only twenty-eight riders.",
  "s0528": "Han cavalry pursuing numbered several thousand men.",
  "s0529": "King Xiang judged he could not escape.",
  "s0530": "He said to his riders: \"I have raised troops until now for eight years; I have personally fought over seventy battles; those I faced were broken, those I struck submitted; I have never been defeated, and thus established hegemony over all under Heaven.",
  "s0531": "Yet now I am finally trapped here; this is Heaven destroying me, not any fault in my warfare.",
  "s0532": "Today I am certainly resolved to die; I wish to fight a swift battle for you lords, certainly winning three victories, breaking through the encirclement for you lords, beheading a general, cutting down a flag, to let you lords know that Heaven is destroying me, that it is not any fault in my warfare.\"",
  "s0533": "He then divided his riders into four squads facing four directions.",
  "s0534": "The Han army surrounded them in several layers.",
  "s0535": "King Xiang said to his riders: \"I will take that general for you.\"",
  "s0536": "He ordered the four-sided cavalry to gallop down, making an appointment to meet at three places east of the mountain.",
  "s0537": "Thereupon King Xiang shouted loudly and galloped down; the Han army all scattered; he then beheaded one Han general.",
  "s0538": "At this time, Marquis of Chiquan was cavalry general pursuing King Xiang; King Xiang glared and shouted at him; Marquis of Chiquan's man and horse were both terrified and withdrew several li.",
  "s0539": "Meeting with his riders at three places.",
  "s0540": "The Han army did not know where King Xiang was, so they divided their army into three and surrounded them again.",
  "s0541": "King Xiang then galloped and again beheaded one Han commandant, killed several tens or hundreds of men, and again gathered his riders—only two riders were lost.",
  "s0542": "He then said to his riders: \"How was that?\"",
  "s0543": "The riders all bowed and said: \"As the great king said.\"",
  "s0544": "Thereupon King Xiang wished to cross the Wu River eastward.",
  "s0545": "The magistrate of Wu River Pavilion had his boat moored waiting and said to King Xiang: \"Though the east of the Yangtze is small, its territory is a thousand li square with a population of several hundred thousand—it would also be enough to be king.",
  "s0546": "I hope the great king will quickly cross.",
  "s0547": "Now only I have a boat; when the Han army arrives, they will have no way to cross.\"",
  "s0548": "King Xiang laughed and said: \"Heaven is destroying me—why should I cross!",
  "s0549": "Moreover, I crossed the Yangtze westward with eight thousand sons and younger brothers from east of the Yangtze; now not one returns—even if the fathers and elder brothers east of the Yangtze take pity and make me king, with what face would I see them?",
  "s0550": "Even if they say nothing, would I alone not feel ashamed in my heart?\"",
  "s0551": "He then said to the pavilion magistrate: \"I know you are a worthy man.",
  "s0552": "I have ridden this horse for five years; it met none that could match it and once traveled a thousand li in one day—I cannot bear to kill it; I give it to you as a gift.\"",
  "s0553": "He then ordered his riders to all dismount and fight on foot, wielding short weapons in close combat.",
  "s0554": "Ji alone killed several hundred Han troops.",
  "s0555": "King Xiang's body also received over ten wounds.",
  "s0556": "Looking around he saw Han cavalry Major Lü Matong and said: \"Are you not my old friend?\"",
  "s0557": "Matong faced him and pointed to Wang Yi, saying: \"This is King Xiang.\"",
  "s0558": "King Xiang then said: \"I have heard Han is offering a thousand gold pieces and ten thousand households for my head; I will do you this kindness.\"",
  "s0559": "He then slit his own throat and died.",
  "s0561": "Wang Yi took his head; the remaining cavalry trampled each other competing for King Xiang's body; dozens killed each other.",
  "s0578": "In the end, Gentleman Rider Yang Xi, Cavalry Major Lü Matong, Gentleman Lü Sheng, and Yang Wu each obtained one part of his body.",
  "s0579": "The five men together assembled his body; all parts matched.",
  "s0580": "Therefore they divided his territory into five: enfeoffed Lü Matong as Marquis of Zhongshui, enfeoffed Wang Yi as Marquis of Duyan, enfeoffed Yang Xi as Marquis of Chiquan, enfeoffed Yang Wu as Marquis of Wufang, enfeoffed Lü Sheng as Marquis of Nieyang.",
  "s0581": "After King Xiang died, all the lands of Chu surrendered to Han; only Lu would not submit.",
  "s0582": "Han then led all under Heaven's troops wishing to massacre it, but because they maintained ritual propriety and died loyal to their lord, they took King Xiang's head to show Lu; the fathers and elder brothers of Lu then surrendered.",
  "s0583": "At first, when King Huai of Chu first enfeoffed Xiang Ji as Duke of Lu, and when he died, Lu was the last to submit; therefore they buried King Xiang at Gucheng with the rites of Duke of Lu.",
  "s0584": "The King of Han announced mourning for him, wept, and departed.",
  "s0585": "All the Xiang clan's branch relatives—the King of Han did not execute any.",
  "s0586": "He then enfeoffed Xiang Bo as Marquis of Sheyang.",
  "s0587": "Marquis of Tao, Marquis of Pinggao, and Marquis of Xuanwu were all of the Xiang clan; they were bestowed the surname Liu.",
  "s0588": "The Grand Historian says: I heard from Zhou Sheng who said \"Shun's eyes had double pupils\"; I also heard that Xiang Yu also had double pupils.",
  "s0589": "Could Yu be his descendant?",
  "s0590": "How sudden was his rise!",
  "s0591": "When Qin lost its governance, Chen She first raised difficulties; heroes arose like a swarm of bees and competed together—their numbers cannot be counted.",
  "s0592": "Yet Yu without even a foot or inch of territory, riding and rising from among the fields, in three years then led the five feudal lords to destroy Qin, divided and carved up all under Heaven, and enfeoffed kings and marquises; governance issued from Yu; he was titled \"Hegemon-King\"—though his position did not last, from ancient times until now there has never been such a case.",
  "s0593": "When Yu turned his back on Guanzhong and longed for Chu, banished the Righteous Emperor and made himself king, resentment grew and the kings and marquises rebelled against him—this was difficult indeed.",
  "s0594": "Boasting of his achievements and victories, flourishing his personal cleverness without following the ancients, thinking the hegemon-king's enterprise could be managed by conquering all under Heaven through force alone—in five years he finally lost his state; his body died at Dongcheng, yet still he did not awaken or blame himself—this was an error.",
  "s0595": "To then say \"Heaven destroyed me, it was not any fault in my use of troops\"—is this not absurd!"
}