{
  "s852": "Eleventh year: The crown prince was born.",
  "s1096": "Ninth year: Fought with Qin at Shao Liang; they captured our crown prince.",
  "s1196": "Eighth year: Shen Bu Hai served as chancellor.",
  "s1290": "Second year: Defeated Wei at Ma Ling. Tian Ji, Tian Ying, and Tian Chou commanded; Sun Zi was the strategist.",
  "s1455": "Third year: Zhang Yi was dismissed as chancellor and became chancellor of Wei.",
  "s1521": "Eleventh year: Qin defeated our general Ying.",
  "s1539": "Thirteenth year: Qin captured our Lin and took general Zhao Zhuang prisoner.",
  "s1540": "Sixteenth year: Zhang Yi came to serve as chancellor.",
  "s1549": "Seventeenth year: Qin defeated our general Qu Dun.",
  "s1572": "Second year: First established the position of chancellor; Chu Li Zi and Gan Mao became chancellors.",
  "s1591": "Twelfth year: The crown prince went to court Qin.",
  "s1630": "Twenty-sixth year: The crown prince was hostage in Qin.",
  "s1647": "Twenty-fifth year: Zhao attacked Zhongshan. Hui Hou died.",
  "s1648": "Twenty-eighth year: Qin, Han, Wei, and Qi defeated our general Tang Mei at Chong Qiu.",
  "s1653": "Seventh year: Chu Li Ji died. Attacked Chu and beheaded 30,000. Wei Ran became chancellor.",
  "s1718": "Third year: Qin defeated us at Yi Que, beheaded 240,000, and captured general Xi.",
  "s1725": "Fifteenth year: Wei Ran was dismissed as chancellor.",
  "s1824": "Twenty-sixth year: Wei Ran again became chancellor.",
  "s1845": "Twentieth year: Met with Qin at Meng Chi; Lin Xiang Ru accompanied.",
  "s1896": "Thirty-fourth year: Bai Qi attacked Wei's Hua Yang army; Mang Mao fled; got the three Jin generals and beheaded 150,000.",
  "s1917": "Twenty-eighth year: Lin Xiang Ru attacked Qi and reached Ping Yi.",
  "s1926": "Twenty-ninth year: Qin attacked Han's Yan Yu. Zhao She commanded and attacked Qin, greatly defeating them; granted the title Ma Fu.",
  "s1950": "Fortieth year: The crown prince who was hostage in Wei died and was returned for burial at Zhi Yang.",
  "s2016": "Sixth year: Sent Zhao Kuo to replace Lian Po as commander. Bai Qi defeated Kuo's 450,000.",
  "s2169": "Second year: The crown prince returned from being hostage in Qin.",
  "s2270": "Twenty-third year: Crown Prince Dan, who was hostage in Qin, fled and returned."
}
