{
  "s0001": "Empress Dowager Lü was Gao Zu's consort from his humble days; she gave birth to Emperor Xiaohui and her daughter Grand Empress Dowager Lu Yuan.",
  "s0002": "When Gao Zu became King of Han, he obtained Consort Qi of Dingtao, whom he loved and favored; she gave birth to King Yin of Zhao, Ruyi.",
  "s0003": "Emperor Xiaohui as a person was benevolent and weak; Gao Zu considered he did not resemble him and constantly wished to depose the Crown Prince and install Consort Qi's son Ruyi, who resembled him.",
  "s0004": "Consort Qi was favored and constantly followed the superior east of the passes, weeping day and night, wishing to have her son replace the Crown Prince.",
  "s0005": "Empress Lü was older and constantly remained behind on guard duty, rarely seeing the superior, and grew increasingly estranged.",
  "s0006": "After Ruyi was installed as King of Zhao, he nearly replaced the Crown Prince several times; they relied on the great ministers to争 for it, as well as the Marquis of Liu's strategy, and the Crown Prince was able to avoid being deposed.",
  "s0007": "Empress Lü as a person was firm and resolute; she assisted Gao Zu in settling all under Heaven, and many of the great ministers who were executed owed much to Empress Lü's strength.",
  "s0008": "Empress Lü had two elder brothers, both of whom served as generals.",
  "s0009": "The eldest brother Lord Zhou Lü died in service; they enfeoffed his son Lü Tai as Marquis of Li and his son Chan as Marquis of Jiao;",
  "s0010": "the next elder brother Lü Shizhi was Marquis of Jiancheng.",
  "s0011": "On the jiachen day of the fourth month in the twelfth year of Gao Zu, he died at Changle Palace; the Crown Prince inherited the title as Emperor.",
  "s0012": "At this time Gao Zu had eight sons: the eldest son Fei was Emperor Xiaohui's elder brother by a different mother; Fei was King of Qi;",
  "s0013": "the rest were all Emperor Xiaohui's younger brothers—Consort Qi's son Ruyi was King of Zhao, Consort Bo's son Heng was King of Dai, various consorts' sons—Hui was King of Liang, You was King of Huaiyang, Chang was King of Huainan, and Jian was King of Yan.",
  "s0014": "Gao Zu's younger brother Jiao was King of Chu; his nephew Bi was King of Wu.",
  "s0015": "The non-Liu meritorious minister, son of Lord Fan Wu Rui, Chen, was King of Changsha.",
  "s0016": "Empress Lü most resented Consort Qi and her son the King of Zhao, so she ordered Consort Qi imprisoned in the Eternal Lanes and summoned the King of Zhao.",
  "s0017": "After the envoy went three times, Zhao Prime Minister Marquis of Jianping Zhou Chang said to the envoy: \"The High Emperor entrusted the King of Zhao to me; the King of Zhao is young.",
  "s0018": "I have secretly heard the Empress Dowager resents Consort Qi and wishes to summon the King of Zhao to execute them together; I dare not send the king.",
  "s0019": "Moreover, the king is also ill and cannot obey the edict.\"",
  "s0020": "Empress Lü was greatly enraged and sent men to summon the Zhao Prime Minister.",
  "s0021": "The Zhao Prime Minister was summoned to Chang'an, and she then sent men again to summon the King of Zhao.",
  "s0022": "The king came but had not yet arrived.",
  "s0023": "Emperor Xiaohui was compassionate and benevolent; knowing the Empress Dowager was angry, he personally welcomed the King of Zhao at Bashang, entered the palace with him, and personally stayed close to the King of Zhao in daily activities and meals.",
  "s0024": "The Empress Dowager wished to kill him but could not find an opportunity.",
  "s0025": "In the twelfth month of the first year of Emperor Xiaohui, the emperor went out at dawn to practice archery.",
  "s0026": "The King of Zhao was young and could not rise early.",
  "s0027": "The Empress Dowager heard he was alone and sent someone with poisoned wine for him to drink.",
  "s0028": "At dawn, Emperor Xiaohui returned; the King of Zhao was already dead.",
  "s0029": "Thereupon they moved King You of Huaiyang to be King of Zhao.",
  "s0030": "In summer, an edict bestowed on the Marquis of Li's father the posthumous title Lingwu Marquis.",
  "s0031": "The Empress Dowager then cut off Consort Qi's hands and feet, gouged out her eyes, seared her ears, made her drink a muting drug, had her reside in the privy, and named her 'Human Pig.'",
  "s0032": "After several days, she summoned Emperor Xiaohui to observe the Human Pig.",
  "s0033": "Emperor Xiaohui saw her, inquired, and then knew it was Consort Qi; he then wept loudly, consequently fell ill, and for over a year could not rise.",
  "s0034": "He sent someone to request of the Empress Dowager: \"This is not something a person would do.",
  "s0035": "I am the Empress Dowager's son, yet in the end I cannot govern all under Heaven.\"",
  "s0036": "From this day Emperor Xiaohui daily drank for dissolute pleasure and did not attend to government, which is why he had illness.",
  "s0037": "In the second year, King Yuan of Chu and King Daohui of Qi both came to court.",
  "s0038": "In the tenth month, Emperor Xiaohui held a banquet and drank with the King of Qi before the Empress Dowager; Emperor Xiaohui considered the King of Qi his elder brother, placed him in the seat of honor, following the rites of family members.",
  "s0039": "The Empress Dowager was angry and ordered two cups of poison poured and placed before them, ordering the King of Qi to rise and offer a toast.",
  "s0040": "The King of Qi rose; Emperor Xiaohui also rose, took the cup wishing to toast together.",
  "s0041": "The Empress Dowager was then afraid and personally rose to overturn Emperor Xiaohui's cup.",
  "s0042": "The King of Qi found this strange and consequently did not dare drink, feigned drunkenness, and departed.",
  "s0043": "Inquiring, he learned it was poison; the King of Qi was afraid, considering he could not escape Chang'an alive, and worried.",
  "s0044": "Qi's Internal Administrator Shi persuaded the king, saying: \"The Empress Dowager only has Emperor Xiaohui and Princess Lu Yuan.",
  "s0045": "Now the king has over seventy cities, while the princess eats from only several cities.",
  "s0046": "If the king truly offers one commandery to the Empress Dowager as a bathing estate for the princess, the Empress Dowager will certainly be pleased and the king will certainly have no worries.\"",
  "s0047": "Thereupon the King of Qi offered up the commandery of Chengyang and honored the princess as Queen Dowager.",
  "s0048": "Empress Lü was pleased and permitted it.",
  "s0049": "She then held a banquet at the Qi residence, drank in enjoyment, dismissed it, and returned the King of Qi.",
  "s0050": "In the third year, they were constructing the walls of Chang'an; in the fourth year half was completed; in the fifth and sixth years the walls were completed.",
  "s0051": "The feudal lords came to assemble.",
  "s0052": "In the tenth month they came to court to offer congratulations.",
  "s0053": "On the wuyin day of the eighth month in the seventh year of autumn, Emperor Xiaohui died.",
  "s0054": "The death was announced; the Empress Dowager cried but tears did not fall.",
  "s0055": "The Marquis of Liu's son Zhang Biqiang was an attendant, age fifteen, and said to the prime minister: \"The Empress Dowager only had Emperor Xiaohui; now he has died and she cries without grief—do you know why?\"",
  "s0056": "The prime minister said: \"What is the reason?\"",
  "s0057": "Biqiang said: \"The emperor has no grown sons; the Empress Dowager fears you lords.",
  "s0058": "If you lords now request to appoint Lü Tai, Lü Chan, and Lü Lu as generals commanding troops stationed at the Southern and Northern Armies, and have all the Lü clan enter the palace to reside within and handle affairs—if this is done then the Empress Dowager's heart will be at ease and you lords will be fortunate to escape disaster.\"",
  "s0059": "The prime minister then followed Biqiang's plan.",
  "s0060": "The Empress Dowager was pleased and her crying then became sorrowful.",
  "s0061": "The Lü clan's power arose from this.",
  "s0062": "They then granted a great amnesty to all under Heaven.",
  "s0063": "On the xinchou day of the ninth month, they buried him.",
  "s0064": "The Crown Prince assumed the position as Emperor and made obeisance at the High Temple.",
  "s0065": "In the first year, all orders issued from the Empress Dowager.",
  "s0066": "The Empress Dowager held power and discussed wishing to install various Lü as kings; she asked Right Prime Minister Wang Ling.",
  "s0067": "Wang Ling said: \"The High Emperor slaughtered a white horse and made an oath saying 'If any non-Liu becomes king, all under Heaven shall together strike them.'",
  "s0068": "Now to make the Lü kings is not in accord with the agreement.\"",
  "s0069": "The Empress Dowager was not pleased.",
  "s0070": "She asked Left Prime Minister Chen Ping and Marquis of Jiang Zhou Bo.",
  "s0071": "Bo and the others replied: \"The High Emperor settled all under Heaven and made kings of his sons and younger brothers; now the Empress Dowager holds power—making kings of brothers and the various Lü, there is nothing improper about it.\"",
  "s0072": "The Empress Dowager was pleased and dismissed the court.",
  "s0073": "Wang Ling reproached Chen Ping and Marquis of Jiang, saying: \"At first when we licked blood with the High Emperor in oath—were you lords not present?",
  "s0074": "Now the High Emperor has died, the Empress Dowager is a female lord wishing to make the Lü kings, and you lords follow desires to flatter her intentions and betray the agreement—with what face will you see the High Emperor below ground?\"",
  "s0075": "Chen Ping and Marquis of Jiang said: \"In opposing face to face and arguing at court now, we ministers are not your equal;",
  "s0076": "but in preserving the altars of soil and grain and stabilizing the Liu clan's succession, you are also not our equal.\"",
  "s0077": "Wang Ling had no response.",
  "s0078": "In the eleventh month, the Empress Dowager wishing to remove Wang Ling appointed him Grand Tutor of the Emperor, taking away his prime ministerial authority.",
  "s0079": "Wang Ling then pleaded illness, was dismissed, and returned home.",
  "s0080": "She then made Left Prime Minister Ping Right Prime Minister and made Marquis of Biyang Shen Yiji Left Prime Minister.",
  "s0081": "The Left Prime Minister did not handle affairs but was ordered to supervise within the palace, like a Gentleman of the Palace.",
  "s0082": "Yiji had formerly obtained the Empress Dowager's favor and constantly handled affairs; the dukes and ministers all went through him to decide matters.",
  "s0083": "They then posthumously honored the Marquis of Li's father as King Daowu, wishing to use this as a gradual approach to making the various Lü kings.",
  "s0084": "In the fourth month, the Empress Dowager wishing to make marquises of the various Lü first enfeoffed Gao Zu's meritorious minister, Gentleman of the Palace Wuze, as Marquis of Bocheng.",
  "s0085": "Princess Lu Yuan died; they bestowed the posthumous title Grand Empress Dowager Lu Yuan.",
  "s0086": "Her son Yan was King of Lu.",
  "s0087": "The King of Lu's father was Marquis of Xuanping Zhang Ao.",
  "s0088": "They enfeoffed King Daohui of Qi's son Zhang as Marquis of Zhuxu and married him to Lü Lu's daughter.",
  "s0089": "Qi's Prime Minister Shou was Marquis of Pingding.",
  "s0090": "Junior Supervisor Yan was Marquis of Wu.",
  "s0091": "They then enfeoffed Lü Zhong as Marquis of Pei, Lü Ping as Marquis of Fuliu, and Zhang Mai as Marquis of Nangong.",
  "s0092": "The Empress Dowager wishing to make the Lü kings first installed Emperor Xiaohui's palace sons—Qiang as King of Huaiyang, Buyi as King of Changshan, Shan as Marquis of Xiangcheng, Zhao as Marquis of Zhi, and Wu as Marquis of Huguan.",
  "s0093": "The Empress Dowager hinted to the great ministers; the great ministers requested to install Marquis of Li Lü Tai as King of Lü; the Empress Dowager permitted it.",
  "s0094": "Marquis Jiancheng Kang Shizhi died; his heir had committed a crime and was deposed; they installed his younger brother Lü Lu as Marquis of Huling to continue Marquis Kang's succession.",
  "s0095": "In the second year, the King of Changshan died; they made his younger brother Marquis of Xiangcheng Shan King of Changshan and changed his name to Yi.",
  "s0096": "In the eleventh month, King Tai of Lü died; his posthumous title was King Su; Crown Prince Jia succeeded as king.",
  "s0097": "In the third year, there were no events.",
  "s0098": "In the fourth year, they enfeoffed Lü Xu as Marquis of Linguang, Lü Ta as Marquis of Yu, Lü Gengshi as Marquis of Zhui Qi, Lü Fen as Marquis of Lü City, and five prime ministers of the feudal lords.",
  "s0099": "When the daughter of Marquis of Xuanping was Empress of Emperor Xiaohui, she had no son; pretending to be pregnant, she took a beautiful woman's son, named him, killed his mother, and installed the named son as Crown Prince.",
  "s0100": "Emperor Xiaohui died; the Crown Prince was installed as Emperor.",
  "s0101": "When the emperor grew up, someone told him his mother had died and he was not the true empress's son; he then spoke out, saying: \"How could the empress kill my mother and name me?",
  "s0102": "I am not yet grown; when I am grown I will make changes.\"",
  "s0103": "The Empress Dowager heard this and was troubled by it; fearing he would create disorder, she imprisoned him in the Eternal Coils, said the emperor was severely ill, and none of those around him could see him.",
  "s0104": "The Empress Dowager said: \"Those who possess all under Heaven and govern as the fate of the ten thousand people should cover them like Heaven and contain them like Earth; above having a joyful heart to comfort the hundred clans, the hundred clans delighting to serve their superior, joy and delight flowing between them and all under Heaven governed.",
  "s0105": "Now the emperor's illness has long not ceased; he has lost awareness and is confused and disordered, unable to continue succession to offer at the ancestral temples—all under Heaven cannot be entrusted to him; he should be replaced.\"",
  "s0106": "The assembled ministers all kowtowed and said: \"The Empress Dowager on behalf of the common people of all under Heaven plans for the security of the ancestral temples and altars of soil and grain very deeply; the assembled ministers kowtow and receive the edict.\"",
  "s0107": "The emperor was deposed; the Empress Dowager imprisoned and killed him.",
  "s0108": "On the bingchen day of the fifth month, they installed King Yi of Changshan as Emperor and changed his name to Hong.",
  "s0109": "They did not call it the first year because the Empress Dowager controlled the affairs of all under Heaven.",
  "s0110": "They made Marquis of Zhi Zhao King of Changshan.",
  "s0111": "They established the position of Grand Commandant; Marquis of Jiang Bo became Grand Commandant.",
  "s0112": "In the eighth month of the fifth year, the King of Huaiyang died; they made his younger brother Marquis of Huguan Wu King of Huaiyang.",
  "s0113": "In the tenth month of the sixth year, the Empress Dowager said King Jia of Lü was arrogant and self-indulgent in his residence and conduct and deposed him, making King Su Tai's younger brother Lü Chan King of Lü.",
  "s0114": "In summer, they pardoned all under Heaven.",
  "s0115": "They enfeoffed King Daohui of Qi's son Xingju as Marquis of Dongmou.",
  "s0116": "In the first month of the seventh year, the Empress Dowager summoned King You of Zhao.",
  "s0117": "You had taken a daughter of the various Lü as queen but did not love her, loving another consort; the Lü daughter was jealous, angrily departed, and slandered him to the Empress Dowager, falsely accusing him of crimes, saying: \"How can the Lü obtain kingship!",
  "s0118": "After the Empress Dowager's hundred years, I will certainly strike them.\"",
  "s0119": "The Empress Dowager was angry and consequently summoned the King of Zhao.",
  "s0120": "When the King of Zhao arrived, they placed him in a residence and would not see him, ordered guards to surround and watch him, and would not give him food.",
  "s0121": "Some of his assembled ministers secretly brought food; they would immediately arrest and prosecute them; the King of Zhao, starving, then sang: \"The various Lü handle affairs and the Liu clan is endangered; they coerce kings and marquises and forcibly gave me a consort.",
  "s0122": "My consort being jealous slandered me with wickedness; slanderous women disorder the state and the superior never awakens.",
  "s0123": "I have no loyal ministers—why should I abandon my state?",
  "s0124": "I will end myself in the wilderness—may Heaven raise up the upright!",
  "s0125": "Alas, it cannot be undone—better to have ended myself earlier.",
  "s0126": "To be a king and starve to death—who will pity this!",
  "s0127": "The Lü clan cuts off principle—I entrust Heaven to take revenge.\"",
  "s0128": "On the dingchou day, the King of Zhao died imprisoned; they buried him with commoner's rites in the commoner tomb grounds of Chang'an.",
  "s0129": "On the jichou day, there was a solar eclipse with darkness at midday.",
  "s0130": "The Empress Dowager took this as a bad omen, was unhappy in her heart, and said to those around her: \"This is because of me.\"",
  "s0132": "In the second month, they moved King Hui of Liang to be King of Zhao.",
  "s0133": "King Chan of Lü was moved to be King of Liang; the King of Liang did not go to his state but became Grand Tutor of the Emperor.",
  "s0134": "They installed the imperial son Marquis of Pingchang Tai as King of Lü.",
  "s0135": "They renamed Liang as Lü and Lü as Jichuan.",
  "s0136": "The Empress Dowager's younger sister Lü Xu had a daughter who was wife to Marquis of Yingling Liu Ze; Ze was Grand General.",
  "s0137": "The Empress Dowager making the various Lü kings feared that after she died General Liu would cause harm, so she made Liu Ze King of Langye to comfort his heart.",
  "s0138": "When King Hui of Liang was moved to be King of Zhao, his heart harbored unhappiness.",
  "s0139": "The Empress Dowager made Lü Chan's daughter Queen of Zhao.",
  "s0140": "The queen's attending officials were all various Lü who wielded power arbitrarily, secretly spied on the King of Zhao, and the King of Zhao could not act as he wished.",
  "s0141": "The king had a consort he loved; the queen sent someone to poison and kill her.",
  "s0142": "The king then composed four chapters of songs and poems and had musicians sing them.",
  "s0143": "The king grieved; in the sixth month he committed suicide.",
  "s0144": "The Empress Dowager heard of this and considered that the king had abandoned ancestral temple rites because of a woman; she abolished his succession.",
  "s0145": "Marquis of Xuanping Zhang Ao died; they made his son Yan King of Lu and bestowed on Ao the posthumous title King Lu Yuan.",
  "s0146": "In autumn, the Empress Dowager sent an envoy to inform the King of Dai, wishing to move him to be King of Zhao.",
  "s0147": "The King of Dai declined, wishing to remain defending the Dai border.",
  "s0148": "Grand Tutor Chan, Prime Minister Ping, and others said Marquis of Wuxin Lü Lu was the highest marquis, ranked first in position, and requested he be installed as King of Zhao.",
  "s0149": "The Empress Dowager permitted it and posthumously honored Lu's father Marquis Kang as King Zhao of Zhao.",
  "s0150": "In the ninth month, King Ling Jian of Yan died; he had a beautiful woman's son; the Empress Dowager sent men to kill him; without heir, the state was abolished.",
  "s0151": "In the tenth month of the eighth year, they installed King Su of Lü's son Marquis of Dongping Lü Tong as King of Yan and enfeoffed Tong's younger brother Lü Zhuang as Marquis of Dongping.",
  "s0152": "In the third month, Empress Lü performed purification rites and on return passed through Zhidao; she saw something like a grey dog that grabbed the High Empress's armpit and suddenly disappeared.",
  "s0153": "They divined it; the oracle said it was King Ruyi of Zhao as an avenging spirit.",
  "s0154": "The High Empress then fell ill from the armpit wound.",
  "s0155": "The High Empress's external grandson King Yan of Lu Yuan was young, having lost his parents early, isolated and weak; she then enfeoffed Zhang Ao's former consort's two sons—Chi as Marquis of Xindu and Shou as Marquis of Lechang—to assist King Yan of Lu Yuan.",
  "s0156": "She also enfeoffed Chief Herald Zhang Shi as Marquis of Jianling and Lü Rong as Marquis of Zhuzi.",
  "s0157": "All palace eunuch directors and assistants were made marquises within the passes, with estates of five hundred households.",
  "s0158": "In the seventh month, the High Empress's illness was severe; she then ordered King Lü Lu of Zhao to be Supreme General commanding the Northern Army;",
  "s0159": "King Chan of Lü commanded the Southern Army.",
  "s0160": "Empress Dowager Lü admonished Chan and Lu, saying: \"The High Emperor having settled all under Heaven made an agreement with the great ministers saying 'If any non-Liu becomes king, all under Heaven shall together strike them.'",
  "s0161": "Now the Lü have become kings; the great ministers are displeased.",
  "s0162": "When I die, the emperor is young; the great ministers fear making changes.",
  "s0163": "You must control troops to defend the palace; be careful not to attend the funeral and not be controlled by others.\"",
  "s0164": "On the xinsi day, the High Empress died; her testament bestowed a thousand gold each to the feudal lord kings; generals, ministers, ranked marquises, gentlemen, and officials were all bestowed gold according to rank.",
  "s0165": "They granted a great amnesty to all under Heaven.",
  "s0166": "They made King Chan of Lü Prime Minister and made Lü Lu's daughter Empress.",
  "s0167": "After the High Empress was buried, they made Left Prime Minister Shen Yiji Grand Tutor of the Emperor.",
  "s0168": "Marquis of Zhuxu Liu Zhang had spirit and strength; Marquis of Dongmou Xingju was his younger brother.",
  "s0169": "Both were younger brothers of King Ai of Qi, residing in Chang'an.",
  "s0170": "At that time, the various Lü handled affairs and wielded power arbitrarily, wishing to create disorder, but feared the High Emperor's former great ministers like Jiang and Guan and dared not initiate.",
  "s0171": "Marquis of Zhuxu's wife was Lü Lu's daughter and secretly knew their plotting.",
  "s0172": "Fearing being executed, she secretly had someone inform her elder brother the King of Qi, wishing to have him send troops west to execute the various Lü and be installed.",
  "s0173": "Marquis of Zhuxu wished to coordinate from within with the great ministers.",
  "s0174": "The King of Qi wished to send troops, but his prime minister would not listen.",
  "s0175": "On the bingwu day of the eighth month, the King of Qi wished to have someone execute the prime minister; Prime Minister Zhao Ping then rebelled, raising troops wishing to surround the king; the king consequently killed his prime minister, then sent troops east, deceitfully seized the King of Langye's troops, combined command of them, and went west.",
  "s0176": "The account is in the King of Qi's account.",
  "s0177": "The King of Qi then sent letters to the feudal lord kings saying: \"The High Emperor pacified and settled all under Heaven and made kings of his sons and younger brothers; King Daohui ruled Qi.",
  "s0178": "When King Daohui died, Emperor Xiaohui sent Marquis of Liu Liang to install me as King of Qi.",
  "s0179": "Emperor Xiaohui died; the High Empress handled affairs, was advanced in years, listened to the various Lü, arbitrarily deposed the emperor and installed another, also successively killed three Kings of Zhao, exterminated Liang, Zhao, and Yan to make the various Lü kings, and divided Qi into four.",
  "s0180": "Loyal ministers advanced remonstrations but the superior was confused and disordered and would not listen.",
  "s0181": "Now the High Empress has died, and the emperor is young, unable to govern all under Heaven, necessarily relying on the great ministers and feudal lords.",
  "s0182": "Yet the various Lü have again arbitrarily elevated their own offices, gathered troops to amass authority, coerced ranked marquises and loyal ministers, and falsely issued edicts to command all under Heaven—this is why the ancestral temples are endangered.",
  "s0183": "I lead troops to enter and execute those who should not be kings.\"",
  "s0184": "Han hearing of this, Prime Minister Lü Chan and others then sent Marquis of Yingyin Guan Ying to lead troops to strike them.",
  "s0185": "Guan Ying reached Yingyang and plotted, saying: \"The various Lü control troops within the passes, wishing to endanger the Liu clan and install themselves.",
  "s0186": "Now if I break Qi and return to report, this will increase the Lü clan's resources.\"",
  "s0187": "He then remained encamped at Yingyang, sent envoys to instruct the King of Qi and the feudal lords, made alliance with them, and waited for the Lü clan to make changes to together execute them.",
  "s0188": "The King of Qi heard this and then returned his troops to the western border to await the agreement.",
  "s0189": "Lü Lu and Lü Chan wished to initiate disorder in Guanzhong but internally feared Marquis of Jiang, Zhuxu, and others, externally feared the troops of Qi and Chu, and also feared Guan Ying would rebel; they wished to wait for Guan Ying's troops to join with Qi before initiating, and hesitated without deciding.",
  "s0190": "At that time, King Tai of Jichuan, King Wu of Huaiyang, King Zhao of Changshan were nominally younger brothers of the young emperor, and King Yan of Lu Yuan was Empress Lü's external grandson—all were young, had not yet gone to their states, and resided in Chang'an.",
  "s0191": "King Lu of Zhao and King Chan of Liang each commanded troops stationed at the Southern and Northern Armies—all were Lü clan people.",
  "s0192": "The ranked marquises and assembled ministers could not secure their own lives.",
  "s0193": "Grand Commandant Marquis of Jiang Bo could not enter the army to command troops.",
  "s0194": "Marquis of Quzhou Li Shang was old and ill; his son Ji was on good terms with Lü Lu.",
  "s0195": "Marquis of Jiang then plotted with Prime Minister Chen Ping, had men coerce Li Shang.",
  "s0196": "They ordered his son Ji to go deceive and persuade Lü Lu, saying: \"The High Emperor and Empress Lü together settled all under Heaven; the nine kings installed by the Liu clan and the three kings installed by the Lü clan were all議 by the great ministers; the matter has already been announced to the feudal lords, and the feudal lords all consider it proper.",
  "s0197": "Now the Empress Dowager has died, the emperor is young, yet you wear the King of Zhao's seal and do not urgently go to your state to defend your fief but instead serve as supreme general commanding troops remaining here—this causes the great ministers and feudal lords to suspect.",
  "s0198": "Why do you not return the seal and hand over troops to the Grand Commandant?",
  "s0199": "Request the King of Liang to return the prime minister's seal, make an oath with the great ministers and go to your state; the Qi troops will certainly be dismissed, the great ministers will be at ease, and you will rest easy while ruling a thousand li—this is benefit for ten thousand generations.\"",
  "s0200": "Lü Lu believed and agreed with this plan, wishing to return the general's seal and hand over troops to the Grand Commandant.",
  "s0201": "He sent men to report to Lü Chan and the various Lü elders; some considered it convenient, some said inconvenient; the planning hesitated without decision.",
  "s0202": "Lü Lu trusted Li Ji and from time to time went out hunting with him.",
  "s0203": "He passed by his aunt Lü Xu; Xu was greatly enraged and said: \"You serve as general yet abandon the army; the Lü clan now has no place.\"",
  "s0204": "She then brought out all pearls, jade, and precious vessels and scattered them below the hall, saying: \"Do not keep them for others.\"",
  "s0205": "Left Prime Minister Yiji was dismissed.",
  "s0206": "On the morning of the gengshen day of the eighth month, Marquis of Pingyang Chu acting as Imperial Secretary saw Prime Minister Chan to plan matters.",
  "s0207": "Gentleman of the Palace Jia Shou, sent as envoy from Qi, came and enumerated Chan's faults, saying: \"If the king does not go to his state early, now even if you wish to go, can you still obtain it?\"",
  "s0208": "He fully informed Chan that Guan Ying had formed a vertical alliance with Qi and Chu wishing to execute the various Lü, then urged Chan to urgently enter the palace.",
  "s0209": "Marquis of Pingyang had somewhat heard his words and galloped to inform the prime minister and grand commandant.",
  "s0210": "The Grand Commandant wished to enter the Northern Army but could not enter.",
  "s0211": "Marquis of Xiangping Tong was in charge of tallies and tokens.",
  "s0212": "They then had him hold the token and falsely admit the Grand Commandant into the Northern Army.",
  "s0213": "The Grand Commandant again had Li Ji and Chief of Guests Liu Jie first persuade Lü Lu, saying: \"The emperor has sent the Grand Commandant to defend the Northern Army and wishes you to go to your state; urgently return the general's seal, take leave, and depart—if not, disaster will arise.\"",
  "s0214": "Lü Lu believing Li as his elder brother would not deceive him then removed the seal, handed it over to the Chief of Guests, and handed over troops to the Grand Commandant.",
  "s0215": "The Grand Commandant took command and entered the army gate, issued orders throughout the army, saying: \"Those for the Lü clan bare the right shoulder; those for the Liu clan bare the left shoulder.\"",
  "s0216": "Throughout the army all bared the left shoulder for the Liu clan.",
  "s0217": "The Grand Commandant traveled to his post; General Lü Lu had also already removed and handed over the supreme general's seal and departed; the Grand Commandant then commanded the Northern Army.",
  "s0218": "However, there was still the Southern Army.",
  "s0219": "Marquis of Pingyang heard of this and reported Lü Chan's plotting to Prime Minister Ping; Prime Minister Ping then summoned Marquis of Zhuxu to assist the Grand Commandant.",
  "s0220": "The Grand Commandant ordered Marquis of Zhuxu to supervise the army gate.",
  "s0221": "He ordered Marquis of Pingyang to inform the Guard Commander: \"Do not admit Prime Minister Chan into the palace gate.\"",
  "s0222": "Lü Chan did not know Lü Lu had already left the Northern Army and entered Weiyang Palace wishing to create disorder, but could not enter the palace gate and paced back and forth.",
  "s0223": "Marquis of Pingyang feared he could not prevail and galloped to inform the Grand Commandant.",
  "s0224": "The Grand Commandant still feared he could not prevail over the various Lü and did not yet dare openly speak of executing them, so he sent Marquis of Zhuxu with the message: \"Urgently enter the palace to defend the emperor.\"",
  "s0225": "Marquis of Zhuxu requested troops; the Grand Commandant gave him over a thousand men.",
  "s0226": "He entered Weiyang Palace gate and then saw Chan in the courtyard.",
  "s0227": "At the time of the afternoon meal, he then struck Chan.",
  "s0228": "Chan fled; Heaven sent a great wind that arose, and because of this his attending officials were in disorder and none dared fight.",
  "s0229": "Pursuing Chan, they killed him in the privy of the Gentleman's Office.",
  "s0230": "Having killed Chan, Marquis of Zhuxu, the emperor ordered a herald bearing a token to thank Marquis of Zhuxu.",
  "s0231": "Marquis of Zhuxu wished to seize the token; the herald refused; Marquis of Zhuxu then rode together with him in the chariot, and using the token galloped off, beheading Guard Commander of Changle Lü Gengshi.",
  "s0232": "Returning, he galloped into the Northern Army and reported to the Grand Commandant.",
  "s0233": "The Grand Commandant rose and bowed in congratulation to Marquis of Zhuxu, saying: \"What we feared was only Lü Chan; now he has been executed, all under Heaven is settled.\"",
  "s0234": "They then sent men to divide into sections to completely arrest all Lü males and females; none, young or old, were spared—all were beheaded.",
  "s0235": "On the xinyou day, they arrested and beheaded Lü Lu and flogged Lü Xu to death.",
  "s0236": "They sent men to execute King Lü Tong of Yan and deposed King Yan of Lu.",
  "s0237": "On the renxu day, they made Grand Tutor of the Emperor Yiji again Left Prime Minister.",
  "s0238": "On the wuchen day, they moved King of Jichuan to rule Liang and installed the son of King You of Zhao, Sui, as King of Zhao.",
  "s0239": "They sent Marquis of Zhuxu Zhang to inform the King of Qi of the matter of executing the various Lü clan and ordered him to dismiss his troops.",
  "s0240": "Guan Ying's troops also dismissed from Yingyang and returned.",
  "s0241": "The various great ministers secretly plotted together, saying: \"The young emperor and the kings of Liang, Huaiyang, and Changshan are all not truly sons of Emperor Xiaohui.",
  "s0242": "Empress Lü by stratagem deceitfully named other people's sons, killed their mothers, raised them in the rear palace, had Emperor Xiaohui claim them as sons, and installed them as heirs and as the various kings to strengthen the Lü clan.",
  "s0243": "Now we have already exterminated all the various Lü, yet if we keep those who were installed and they grow up to handle affairs, we will have no posterity.",
  "s0244": "It would be better to examine which of the kings is most worthy and install him.\"",
  "s0245": "Some said: \"King Daohui of Qi was the High Emperor's eldest son; now his legitimate son is King of Qi; tracing it to the origin, he is the High Emperor's legitimate eldest grandson and can be installed.\"",
  "s0246": "The great ministers all said: \"The Lü clan as external family were wicked and nearly endangered the ancestral temples, disordering the meritorious ministers; now the King of Qi's maternal family is Sijun—Sijun are wicked people.",
  "s0247": "If we install the King of Qi, it will again become like the Lü clan.\"",
  "s0248": "They wished to install the King of Huainan but considered him young and his maternal family also wicked.",
  "s0249": "They then said: \"The King of Dai is presently the High Emperor's surviving son, the eldest, benevolent, filial, generous, and magnanimous.",
  "s0250": "The Grand Empress's family, the Bo clan, are careful and good.",
  "s0251": "Moreover, installing the eldest follows proper order; as he is known for benevolence and filial piety throughout all under Heaven, it is convenient.\"",
  "s0252": "They then together secretly sent men to summon the King of Dai.",
  "s0253": "The King of Dai sent men to decline and express thanks.",
  "s0254": "After going back and forth twice, he then rode in six relay chariots.",
  "s0255": "On the last day of the ninth month, the jiyou day, he reached Chang'an and lodged at the Dai residence.",
  "s0256": "The great ministers all went to pay respects, presented the Son of Heaven's seal to the King of Dai, and together honored and installed him as Son of Heaven.",
  "s0257": "The King of Dai declined several times; the assembled ministers firmly requested, and then he listened.",
  "s0258": "Marquis of Dongmou Xingju said: \"In executing the Lü clan I had no merit; I request to be allowed to purge the palace.\"",
  "s0259": "He then with Grand Coachman Marquis of Ruyin Duke Teng entered the palace, went before the young emperor and said: \"You are not of the Liu clan and should not be installed.\"",
  "s0260": "He then looked back and gestured to those around holding halberds to lay down their weapons and withdraw.",
  "s0261": "Several men refused to lay down their weapons; Eunuch Commander Zhang Ze instructed and informed them, and they also laid down their weapons.",
  "s0262": "Duke Teng then summoned the imperial chariot to carry the young emperor out.",
  "s0263": "The young emperor said: \"Where do you wish to take me?\"",
  "s0264": "Duke Teng said: \"Going out to your residence.\"",
  "s0265": "They lodged him at the Junior Supervisor's.",
  "s0266": "They then presented the Son of Heaven's ceremonial procession and welcomed the King of Dai at the residence.",
  "s0267": "They reported: \"The palace has been carefully purged.\"",
  "s0268": "The King of Dai that very evening entered Weiyang Palace.",
  "s0269": "There were ten heralds holding halberds defending the端 Gate who said: \"The Son of Heaven is within—who are you and why do you enter?\"",
  "s0270": "The King of Dai then addressed the Grand Commandant.",
  "s0271": "The Grand Commandant went to instruct them; the ten heralds all laid down their weapons and departed.",
  "s0272": "The King of Dai then entered and attended to government.",
  "s0273": "By night, the officials divided into sections to execute and exterminate the kings of Liang, Huaiyang, and Changshan as well as the young emperor at their residences.",
  "s0274": "The King of Dai was installed as Son of Heaven.",
  "s0275": "After twenty-three years he died; his posthumous title was Emperor Xiaowen.",
  "s0276": "The Grand Historian says: In the time of Emperor Xiaohui and the High Empress, the common people were able to leave behind the suffering of the Warring States; lords and ministers both wished to rest in non-action, therefore Emperor Hui folded his hands and垂拱, the High Empress as female lord held power, governance did not leave the chambers, and all under Heaven was tranquil.",
  "s0277": "Punishments were rarely used; criminals were few.",
  "s0278": "The people focused on agriculture; clothing and food grew abundant."
}
