{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "023",
    "url": "https://chinesenotes.com/shiji/shiji023.html",
    "title": {
      "zh": "書‧禮書",
      "en": "Treatises - Rites",
      "raw": "《書‧禮書》 Treatises - Rites"
    },
    "sentenceCount": 155,
    "translatedCount": 155,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:48.896Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "太史公曰：洋洋美德乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Grand Historian said: How vast and beautiful is virtue!",
              "idiomatic": "The Grand Historian says: How vast and beautiful virtue is!"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "宰制萬物，役使群眾，豈人力也哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To control all things and employ the multitudes, how can this be done by human strength alone?",
              "idiomatic": "To govern all things and command the multitudes—how can this be achieved by human power alone?"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "余至大行禮官，觀三代損益，乃知緣人情而制禮，依人性而作儀，其所由來尚矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I came to the Grand Ceremonial Office and observed the gains and losses of the Three Dynasties, and thus knew that rites are established according to human feelings, and ceremonies are made according to human nature—their origins are ancient indeed.",
              "idiomatic": "I visited the Grand Herald's Rites Office and examined the additions and subtractions of the Three Dynasties. Thus I understood that rites are formulated following human emotions, and ceremonies are created conforming to human nature—their origins go back to ancient times indeed."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian said: How vast and beautiful is virtue! To control all things and employ the multitudes, how can this be done by human strength alone? I came to the Grand Ceremonial Office and observed the gains and losses of the Three Dynasties, and thus knew that rites are established according to human feelings, and ceremonies are made according to human nature—their origins are ancient indeed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "人道經緯萬端，規矩無所不貫，誘進以仁義，束縛以刑罰，故德厚者位尊，祿重者寵榮，所以總一海內而整齊萬民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Human affairs have myriad aspects, yet regulations must penetrate everything. People are guided forward with benevolence and righteousness, restrained with punishments. Thus those with profound virtue receive honored positions; those with heavy merit receive glorious rewards. This serves to unify the empire and regulate the myriad people.",
              "idiomatic": "Human affairs are complex and multifaceted, yet rules and standards must govern everything. People are encouraged with benevolence and righteousness, restrained with punishments. Thus those with deep virtue receive honored positions; those with heavy merit receive glorious rewards. This serves to unify the empire and bring order to the multitude of people."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "人體安駕乘，為之金輿錯衡以繁其飾；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The human body delights in riding carriages, so golden chariots with inlaid yokes are made to enrich their adornment;",
              "idiomatic": "The human body finds comfort in carriages, so golden chariots with inlaid yokes are made to multiply their ornamentation;"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "目好五色，為之黼黻文章以表其能；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The eyes delight in the five colors, so embroidered patterns and designs are made to display their beauty;",
              "idiomatic": "The eyes love the five colors, so embroidered patterns and designs are made to manifest their capabilities;"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "耳樂鐘磬，為之調諧八音以蕩其心；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The ears delight in bells and chimes, so the eight sounds are tuned to move their hearts;",
              "idiomatic": "The ears enjoy bells and chimes, so the eight sounds are harmonized to stir their hearts;"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "口甘五味，為之庶羞酸咸以致其美；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The mouth delights in the five flavors, so many delicacies of sour and salty are prepared to bring out their excellence;",
              "idiomatic": "The mouth savors the five flavors, so abundant delicacies sour and salty are prepared to bring out their excellence;"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "情好珍善，為之琢磨圭璧以通其意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The emotions delight in treasures and goodness, so jade disks are polished to communicate their intentions.",
              "idiomatic": "Feelings desire precious and fine things, so carved and polished jade tablets are made to convey their intentions."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "故大路越席，皮弁布裳，朱弦洞越，大羹玄酒，所以防其淫侈，救其彫敝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore the great chariot and reed mat, the leather bonnet and cloth robe, the vermilion strings and penetrating tones, the great broth and plain wine—these all serve to prevent licentious extravagance and save from decay.",
              "idiomatic": "Therefore great carriages with reed mats, leather caps and linen robes, crimson strings and open-holed zithers, thick broth and clear wine—these serve to prevent licentious extravagance and rescue from exhaustion."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "是以君臣朝廷尊卑貴賤之序，下及黎庶車輿衣服宮室飲食嫁娶喪祭之分，事有宜適，物有節文。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thus the order of ruler and minister, court and official, honored and humble, noble and base—extending down to the common people with their carriages and clothing, palaces and chambers, food and drink, marriage and burial, mourning and sacrifice—each matter has what is suitable, each thing has its regulated form.",
              "idiomatic": "Thus the hierarchy of ruler and minister, court official, honored and humble, noble and base—extending down to the common people with their carriages and clothing, palaces and dwellings, food and drink, marriage and funeral rites—each affair has its appropriate measure, each object has its regulated form."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "仲尼曰：「褅自既灌而往者，吾不欲觀之矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Confucius said: 'For the sacrifice at the ancestral temple, once the libation has been poured, I no longer wish to watch it.'",
              "idiomatic": "Confucius said: 'For the imperial sacrifice, once the libation has been completed, I no longer wish to observe it.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The way of man has myriad aspects, and regulations penetrate everything; guiding forward with benevolence and righteousness, restraining with punishments, thus those with thick virtue have honored positions, those with heavy salaries have honored glory, so as to unify the empire and regulate the myriad people. The human body delights in riding carriages, so for it they make golden carriages with inlaid yokes to enrich its adornment; The eyes delight in the five colors, so for them they make embroidered patterns and designs to display their ability; The ears delight in bells and chimes, so for them they tune the eight sounds to move their hearts; The mouth delights in the five flavors, so for it they prepare many delicacies of sour and salty to bring their beauty; The emotions delight in treasures and goodness, so for them they polish jade disks to communicate their intentions. Therefore the great chariot and reed mat, the leather bonnet and cloth robe, the vermilion strings and penetrating tones, the great broth and plain wine—these serve to prevent licentious extravagance and save from decay. Thus the order of ruler and minister, court and official, honored and humble, noble and base, extending down to the common people, carriages and clothing, palaces and chambers, food and drink, marriage and burial, mourning and sacrifice—each matter has what is suitable, each thing has regulated form. Confucius said: 'For the sacrifice at the ancestral temple, once the libation has been poured, I no longer wish to watch it.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0014",
          "zh": "周衰，禮廢樂壞，大小相踰，管仲之家，兼備三歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Zhou declined, rites were abandoned and music corrupted, great and small overstepped each other; Guan Zhong's household possessed the three returns in combination.",
              "idiomatic": "When the Zhou dynasty declined, rites were abandoned and music corrupted, high and low overstepped each other; Guan Zhong's household combined all three forms of return."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "循法守正者見侮於世，奢溢僭差者謂之顯榮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those who followed the law and maintained correctness were insulted by the world, those who were extravagant and presumptuous were called glorious.",
              "idiomatic": "Those who followed the law and maintained uprightness were insulted by society; those who were extravagant and overstepped their stations were called glorious."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "自子夏，門人之高弟也，猶云「出見紛華盛麗而說，入聞夫子之道而樂，二者心戰，未能自決」，而況中庸以下，漸漬於失教，被服於成俗乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Even Zi Xia, Confucius's most eminent disciple, still said: 'Going out I see the splendor and magnificence and am pleased; coming in I hear the Master's way and am joyful—these two battle in my heart, and I cannot decide myself.' Moreover, those of mediocre capacity and below gradually became soaked in lost teachings and clothed in established customs—what then?",
              "idiomatic": "Even Zi Xia, who was the most eminent among Confucius's disciples, still said: 'When I go out and see the dazzling splendor and magnificence, I am delighted; when I come in and hear the Master's teachings, I am joyful—these two battle in my heart, and I cannot decide between them.' How much more so for those of average ability and below, who gradually become steeped in misguided teachings and clothed in established customs?"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "孔子曰「必也正名」，於衛所居不合。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Confucius said 'It is essential to correct names', but in Wei his dwelling was not in accord.",
              "idiomatic": "Confucius said 'It is essential to rectify names,' but in Wei his position was not in accord."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "仲尼沒後，受業之徒沈湮而不舉，或適齊、楚，或入河海，豈不痛哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After Confucius passed away, his disciples who received his teachings sank into obscurity and were not raised up; some went to Qi or Chu, some entered the rivers and seas—how painful it is!",
              "idiomatic": "After Confucius's death, his disciples who had studied under him sank into obscurity and were not promoted; some went to Qi and Chu, others entered the rivers and seas—is this not lamentable!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Zhou declined, rites were abandoned and music corrupted, great and small overstepped each other; Guan Zhong's household possessed the three returns in combination. Those who followed the law and maintained correctness were insulted by the world, those who were extravagant and presumptuous were called glorious. Even Zi Xia, the most eminent disciple of the disciples, still said 'Going out I see the splendor and magnificence and am pleased, coming in I hear the Master's way and am joyful—these two battle in my heart, I cannot decide myself', and moreover those of mediocre capacity and below, gradually soaked in lost teachings, clothed in established customs—what then? Confucius said 'It is essential to correct names', but in Wei his dwelling was not in accord. After Confucius passed away, his disciples who received his teachings sank into obscurity and were not raised up; some went to Qi or Chu, some entered the rivers and seas—how painful it is!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0019",
          "zh": "至秦有天下，悉內六國禮儀，采擇其善，雖不合聖制，其尊君抑臣，朝廷濟濟，依古以來。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Qin possessed the empire, it took in all the rites and ceremonies of the six states, selecting their good points; although not in accord with the sage's system, it honored the ruler and suppressed ministers, the court was orderly, following ancient ways.",
              "idiomatic": "When Qin unified the empire, it incorporated all the rites and ceremonies of the six states, selecting their best aspects; though not fully aligned with the sage-kings' system, it honored rulers and restrained ministers, making the court orderly and following ancient precedents."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "至于高祖，光有四海，叔孫通頗有所增益減損，大抵皆襲秦故。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Coming to Gaozu, who possessed the four seas, Shu Sun Tong considerably added to and reduced the rites, but on the whole they all inherited Qin's old ways.",
              "idiomatic": "When it came to Emperor Gaozu, who illuminated the four seas, Shu Sun Tong made considerable additions and subtractions to the rites, but on the whole they all followed Qin's old system."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "自天子稱號下至佐僚及宮室官名，少所變改。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "From the emperor's title downward to aides and officials, and the names of palaces and offices, few were changed.",
              "idiomatic": "From the emperor's title down to assistants and officials, as well as the names of palaces and offices, few changes were made."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "孝文即位，有司議欲定儀禮，孝文好道家之學，以為繁禮飾貌，無益於治，躬化謂何耳，故罷去之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Filial Wen ascended the throne, the officials discussed wanting to establish ceremonial rites; Filial Wen delighted in Daoist learning, considering elaborate rites and adorned appearances useless for governance, how could personal transformation be done?—thus he dismissed it.",
              "idiomatic": "When Emperor Wen ascended the throne, the officials discussed establishing ceremonial rites; Emperor Wen favored Daoist learning, believing that elaborate ceremonies and superficial appearances were useless for governance—what mattered was personal moral transformation—so he dismissed the proposal."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "孝景時，御史大夫晁錯明於世務刑名，數干諫孝景曰：「諸侯藩輔，臣子一例，古今之制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In Filial Jing's time, Imperial Secretary Chun Cuo was clear about worldly affairs and legalist names, repeatedly remonstrated Filial Jing saying: 'The nobles are bulwarks, ministers and sons are one example, this is the system of ancient and modern times.",
              "idiomatic": "During Emperor Jing's reign, Imperial Secretary Chao Cuo understood worldly affairs and legal terminology well, repeatedly remonstrating with Emperor Jing: 'The regional lords are the empire's bulwarks; ministers and sons follow the same rules—this is the system of ancient and modern times.'"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "今大國專治異政，不稟京師，恐不可傳後。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now the great states monopolize different governance, not receiving from the capital, I fear it cannot be transmitted to posterity.'",
              "idiomatic": "Now the powerful states monopolize their own governance and do not report to the capital—I fear this cannot be handed down to posterity.'"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "孝景用其計，而六國畔逆，以錯首名，天子誅錯以解難。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Filial Jing used his plan, and the six states rebelled in defiance, with Cuo as the first named, the Son of Heaven executed Cuo to resolve the difficulty.",
              "idiomatic": "Emperor Jing adopted his plan, but the seven states rebelled in defiance, with Chao Cuo named first; the Son of Heaven executed Chao Cuo to resolve the crisis."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "事在袁盎語中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The matter is in Yuan Ang's biography.",
              "idiomatic": "This matter is recorded in Yuan Ang's biography."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "是後官者養交安祿而已，莫敢復議。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After this, officials nourished connections and secured salaries, none dared discuss again.",
              "idiomatic": "After this, officials merely cultivated connections and secured their salaries—no one dared bring up the topic again."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Qin possessed the empire, it took in all the rites and ceremonies of the six states, selecting their good points; although not in accord with the sage's system, it honored the ruler and suppressed ministers, the court was orderly, following ancient ways. Coming to Gaozu, he possessed the four seas, Shu Sun Tong considerably added to and reduced them, but on the whole they all inherited Qin's old ways. From the emperor's title downward to aides and officials and palace and office names, few were changed. When Filial Wen ascended the throne, the officials discussed wanting to establish ceremonial rites; Filial Wen delighted in Daoist learning, considering elaborate rites and adorned appearances useless for governance, how could personal transformation be done?—thus he dismissed it. In Filial Jing's time, Imperial Secretary Chun Cuo was clear about worldly affairs and legalist names, repeatedly remonstrated Filial Jing saying: 'The nobles are bulwarks, ministers and sons are one example, this is the system of ancient and modern times. Now the great states monopolize different governance, not receiving from the capital, I fear it cannot be transmitted to posterity.' Filial Jing used his plan, and the six states rebelled in defiance, with Cuo as the first named, the Son of Heaven executed Cuo to resolve the difficulty. The matter is in Yuan Ang's biography. After this, officials nourished connections and secured salaries, none dared discuss again.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "今上即位，招致儒術之士，令共定儀，十餘年不就。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now when the present emperor ascended, he summoned Confucian scholars, ordered them to jointly establish ceremonies, over ten years not completed.",
              "idiomatic": "When the present emperor ascended the throne, he summoned Confucian scholars and ordered them to jointly establish the ceremonies, but after more than ten years they had not completed the task."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "或言古者太平，萬民和喜，瑞應辨至，乃采風俗，定制作。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Some said in ancient times when there was great peace, the myriad people were harmonious and joyful, auspicious responses clearly arrived, then they gathered customs, established the system of making.",
              "idiomatic": "Some said that in ancient times, during periods of great peace, the people lived in harmony and joy, and when auspicious omens clearly appeared, they would gather local customs and establish the system of rites and ceremonies."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "上聞之，制詔御史曰：「蓋受命而王，各有所由興，殊路而同歸，謂因民而作，追俗為制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The emperor heard this, issued an edict to the Imperial Secretary saying: 'Receiving the mandate and becoming king, each has its origin for rising, different paths but same destination, called following the people and making, pursuing customs to establish the system.",
              "idiomatic": "The emperor heard this and issued an edict to the Imperial Secretary saying: 'When receiving the mandate to become king, each dynasty has its own origins for rising to power; though the paths differ, they all lead to the same goal—this is called following the people's will to create institutions, and adapting to customs to establish the system.'"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "議者咸稱太古，百姓何望？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The discussers all praise great antiquity—what do the common people hope for?",
              "idiomatic": "The debaters all praise the great antiquity—what aspirations do the common people have?"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "漢亦一家之事，典法不傳，謂子孫何？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han is also one family's matter, classical laws not transmitted—what to tell descendants?",
              "idiomatic": "The Han dynasty is also just one family's affair; if classical laws are not transmitted, what can we say to our descendants?"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "化隆者閎博，治淺者褊狹，可不勉與！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those with flourishing transformation are broad and expansive, those with shallow governance are narrow and petty—can we not strive for it!'",
              "idiomatic": "Those whose transformations flourish are broad and expansive; those whose governance is shallow are narrow and petty—can we not strive to achieve this!'"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "乃以太初之元改正朔，易服色，封太山，定宗廟百官之儀，以為典常，垂之於後云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus with the Tai Chu era they corrected the calendar, changed the robe colors, sealed Mount Tai, established the ancestral temple and hundred officials' ceremonies, to serve as eternal standards, handing them down to posterity.",
              "idiomatic": "Therefore, using the Tai Chu era as the new beginning, they corrected the calendar, changed the official robes' colors, performed the Feng sacrifice on Mount Tai, and established the ceremonies for the ancestral temple and the hundred officials, to serve as eternal standards handed down to posterity."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Now when the present emperor ascended, he summoned Confucian scholars, ordered them to jointly establish ceremonies, over ten years not completed. Some said in ancient times when there was great peace, the myriad people were harmonious and joyful, auspicious responses clearly arrived, then they gathered customs, established the system of making. The emperor heard this, issued an edict to the Imperial Secretary saying: 'Receiving the mandate and becoming king, each has its origin for rising, different paths but same destination, called following the people and making, pursuing customs to establish the system. The discussers all praise great antiquity—what do the common people hope for? Han is also one family's matter, classical laws not transmitted—what to tell descendants? Those with flourishing transformation are broad and expansive, those with shallow governance are narrow and petty—can we not strive for it!' Thus with the Tai Chu era they corrected the calendar, changed the robe colors, sealed Mount Tai, established the ancestral temple and hundred officials' ceremonies, to serve as eternal standards, handing them down to posterity.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "禮由人起。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rites arise from people.",
              "idiomatic": "Rites arise from human nature."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "人生有欲，欲而不得則不能無忿，忿而無度量則爭，爭則亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People are born with desires; desiring but not obtaining cannot but cause resentment, resentment without measure leads to contention, contention leads to disorder.",
              "idiomatic": "People are born with desires; when desires are not satisfied, resentment inevitably arises. When resentment knows no bounds, it leads to contention, and contention leads to chaos."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "先王惡其亂，故制禮義以養人之欲，給人之求，使欲不窮於物，物不屈於欲，二者相待而長，是禮之所起也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The former kings hated this disorder, thus established rites and righteousness to nourish people's desires, supply people's needs, make desires not exhaust things, things not bend to desires—the two support each other and grow, this is where rites arise.",
              "idiomatic": "The former kings hated this chaos, so they established rites and righteousness to satisfy people's desires and provide for their needs. They ensured that desires would not exhaust resources, nor would resources be bent to desires—the two would support each other and flourish, and this is the origin of rites."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "故禮者養也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus rites are nourishment.",
              "idiomatic": "Therefore, rites are a form of nourishment."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "稻粱五味，所以養口也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rice and millet, the five flavors—these nourish the mouth;",
              "idiomatic": "Rice and millet, the five flavors—these nourish the mouth;"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "椒蘭芬茝，所以養鼻也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pepper and orchids, fragrant iris—these nourish the nose;",
              "idiomatic": "Pepper and orchids, fragrant iris—these nourish the nose;"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "鐘鼓管弦，所以養耳也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bells and drums, pipes and strings—these nourish the ears;",
              "idiomatic": "Bells and drums, pipes and strings—these nourish the ears;"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "刻鏤文章，所以養目也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Carved and inlaid designs—these nourish the eyes;",
              "idiomatic": "Carved and inlaid designs—these nourish the eyes;"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "疏房床笫几席，所以養體也：故禮者養也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Spacious chambers, beds and mats, tables and mats—these nourish the body: thus rites are nourishment.",
              "idiomatic": "Spacious chambers, beds and mats, tables and mats—these nourish the body: therefore, rites are nourishment."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Rites arise from people. People are born with desires; desiring but not obtaining cannot but cause resentment, resentment without measure leads to contention, contention leads to disorder. The former kings hated this disorder, thus established rites and righteousness to nourish people's desires, supply people's needs, make desires not exhaust things, things not bend to desires—the two support each other and grow, this is where rites arise. Thus rites are nourishment. Rice and millet, the five flavors—these nourish the mouth; Pepper and orchids, fragrant iris—these nourish the nose; Bells and drums, pipes and strings—these nourish the ears; Carved and inlaid designs—these nourish the eyes; Spacious chambers, beds and mats, tables and mats—these nourish the body: thus rites are nourishment.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "君子既得其養，又好其辨也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The gentleman having obtained his nourishment, moreover delights in its distinctions.",
              "idiomatic": "Once the gentleman has obtained his nourishment, he also delights in the distinctions it provides."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "所謂辨者，貴賤有等，長少有差，貧富輕重皆有稱也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "What are called distinctions: noble and base have ranks, elder and younger have differences, rich and poor, light and heavy all have their proper measure.",
              "idiomatic": "What are called distinctions: the noble and base have their ranks, the elder and younger have their differences, the rich and poor, the light and heavy—all have their appropriate measure."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "故天子大路越席，所以養體也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus the emperor's great chariot and reed mat nourish the body;",
              "idiomatic": "Therefore, the emperor's great chariot and reed mat nourish the body;"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "側載臭茝，所以養鼻也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Carrying fragrant iris on the side nourishes the nose;",
              "idiomatic": "Carrying fragrant iris on the side nourishes the nose;"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "前有錯衡，所以養目也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Having inlaid yokes in front nourishes the eyes;",
              "idiomatic": "Having inlaid yokes in front nourishes the eyes;"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "和鸞之聲，步中武象，驟中韶濩，所以養耳也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The harmonious bell sounds, steps accord with Wu and Xiang, gallops accord with Shao and Hua—these nourish the ears;",
              "idiomatic": "The harmonious bell sounds, walking steps accord with the Wu and Xiang tunes, galloping steps accord with the Shao and Hua tunes—these nourish the ears;"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "龍旂九斿，所以養信也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The dragon banner with nine streamers nourishes trust;",
              "idiomatic": "The dragon banner with nine streamers nourishes trust;"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "寢兕持虎，鮫韅彌龍，所以養威也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sleeping rhinoceros holding tiger, shark skin dragon scales—so nourish awe.",
              "idiomatic": "Sleeping on rhinoceros hide and grasping tiger skins, wearing shark-skin boots embroidered with dragons—these nourish awe."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "故大路之馬，必信至教順，然後乘之，所以養安也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus the great chariot's horses must be trustworthy, utmost trained obedient, then ride them—so nourish security.",
              "idiomatic": "Therefore, the horses of the great chariot must be trustworthy, perfectly trained, and obedient—only then may they be ridden, for this nourishes security."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "孰知夫［士］出死要節之所以養生也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who knows that scholars going to death for integrity is the means to nourish life.",
              "idiomatic": "Who understands that scholars facing death to preserve their integrity is precisely the way to nourish life?"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "孰知夫輕費用之所以養財也，孰知夫恭敬辭讓之所以養安也，孰知夫禮義文理之所以養情也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who knows that light expenditure is the means to nourish wealth, who knows that respectful yielding is the means to nourish security, who knows that rites righteousness pattern principle is the means to nourish emotion.",
              "idiomatic": "Who knows that frugal expenditure is the way to nourish wealth? Who knows that respectful yielding is the way to nourish security? Who knows that rites, righteousness, propriety, and principle are the way to nourish emotion?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The gentleman having obtained his nourishment, moreover delights in its distinctions. What are called distinctions: noble and base have ranks, elder and younger have differences, rich and poor, light and heavy all have their proper measure. Thus the emperor's great chariot and reed mat nourish the body; Carrying fragrant iris on the side nourishes the nose; Having inlaid yokes in front nourishes the eyes; The harmonious bell sounds, steps accord with Wu and Xiang, gallops accord with Shao and Hua—these nourish the ears; The dragon banner with nine streamers nourishes trust; Sleeping rhinoceros holding tiger, shark skin dragon scales—so nourish awe. Thus the great chariot's horses must be trustworthy, utmost trained obedient, then ride them—so nourish security. Who knows that scholars going to death for integrity is the means to nourish life. Who knows that light expenditure is the means to nourish wealth, who knows that respectful yielding is the means to nourish security, who knows that rites righteousness pattern principle is the means to nourish emotion.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "人茍生之為見，若者必死；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People if living as their view, those will certainly die;",
              "idiomatic": "If people take mere survival as their highest goal, those will certainly die;"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "茍利之為見，若者必害；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If profit as their view, those will certainly harm;",
              "idiomatic": "If they take profit as their highest goal, those will certainly come to harm;"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "怠惰之為安，若者必危；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If laziness as security, those will certainly danger;",
              "idiomatic": "If they take laziness as security, those will certainly come to danger;"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "情勝之為安，若者必滅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If emotion prevailing as security, those will certainly perish.",
              "idiomatic": "If they take emotional indulgence as security, those will certainly perish."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "故聖人一之於禮義，則兩得之矣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus sages unify it in rites righteousness, then obtain both;",
              "idiomatic": "Therefore, when the sages unify everything under rites and righteousness, they obtain both benefits;"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "一之於情性，則兩失之矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Unify it in emotion nature, then lose both.",
              "idiomatic": "When they unify everything under emotion and nature, they lose both benefits."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "故儒者將使人兩得之者也，墨者將使人兩失之者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus Confucianists will make people obtain both, Mohists will make people lose both.",
              "idiomatic": "Therefore, Confucianists aim to help people obtain both benefits, while Mohists cause people to lose both benefits."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "是儒墨之分。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This is the division between Confucians and Mohists.",
              "idiomatic": "This is the fundamental division between Confucians and Mohists."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "People if living as their view, those will certainly die; If profit as their view, those will certainly harm; If laziness as security, those will certainly danger; If emotion prevailing as security, those will certainly perish. Thus sages unify it in rites righteousness, then obtain both; Unify it in emotion nature, then lose both. Thus Confucianists will make people obtain both, Mohists will make people lose both. This is the division between Confucians and Mohists.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "治辨之極也，彊固之本也，威行之道也，功名之總也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The extreme of governing distinctions, the root of strength and firmness, the way of awesome conduct, the summation of merit and fame.",
              "idiomatic": "It is the ultimate in governing through distinctions, the foundation of strength and stability, the path of exercising authority, and the summation of merit and fame."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "王公由之，所以一天下，臣諸侯也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Kings and nobles follow it, thus unify the empire, make the nobles ministers;",
              "idiomatic": "When kings and nobles follow it, they unify the empire and make the regional lords their ministers;"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "弗由之，所以捐社稷也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Do not follow it, thus abandon the altars of soil and grain.",
              "idiomatic": "When they do not follow it, they abandon the altars of soil and grain."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "故堅革利兵不足以為勝，高城深池不足以為固，嚴令繁刑不足以為威。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus strong armor sharp weapons insufficient for victory, high walls deep moats insufficient for security, strict commands numerous punishments insufficient for awe.",
              "idiomatic": "Therefore, strong armor and sharp weapons are insufficient to achieve victory; high walls and deep moats are insufficient to ensure security; strict commands and numerous punishments are insufficient to inspire awe."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "由其道則行，不由其道則廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Follow its way then proceed, do not follow its way then fail.",
              "idiomatic": "If you follow its way, you will succeed; if you do not follow its way, you will fail."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "楚人鮫革犀兕，所以為甲，堅如金石；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu people shark skin rhinoceros leather, made into armor, hard as metal stone;",
              "idiomatic": "The people of Chu used shark skin and rhinoceros leather to make armor, hard as metal and stone;"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "宛之鉅鐵施，鉆如蜂蠆，輕利剽遫，卒如熛風。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wan great iron weapons, sharp as wasp sting, light swift nimble, troops like blazing wind.",
              "idiomatic": "Wan's great iron spears were sharp as wasp stings, light and swift, nimble and swift, their troops like a blazing wind."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "然而兵殆於垂涉，唐昧死焉；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet troops in danger at Chu She, Tang Mei died there;",
              "idiomatic": "Yet their troops came to danger at Chu She, and Tang Mei died there;"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "莊蹻起，楚分而為四參。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhuang Qiao arose, Chu divided into four parts.",
              "idiomatic": "Zhuang Qiao rose up, and Chu was divided into four parts."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "是豈無堅革利兵哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Is this not having strong armor sharp weapons?",
              "idiomatic": "Is this not having strong armor and sharp weapons?"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The way they controlled it was not correct, thus.",
              "idiomatic": "It was because the way they governed was not the correct way."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "汝潁以為險，江漢以為池，阻之以鄧林，緣之以方城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ru Ying as danger, Jiang Han as moat, blocked by Deng forest, edged by Fang city.",
              "idiomatic": "They took the Ru and Ying rivers as natural defenses, the Yangtze and Han as moats, blocked by Deng forest, and edged by Fang city."
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "然而秦師至鄢郢，舉若振槁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet Qin troops reached Yan Ying, captured like shaking withered grass.",
              "idiomatic": "Yet Qin troops reached Yan and Ying, capturing them as easily as shaking withered grass."
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "是豈無固塞險阻哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Is this not having secure barriers and dangers?",
              "idiomatic": "Is this not having secure barriers and natural defenses?"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The way they controlled it was not correct, thus.",
              "idiomatic": "It was because the way they governed was not the correct way."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "紂剖比干，囚箕子，為炮格，刑殺無辜，時臣下懔然，莫必其命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhou dismembered Bi Gan, imprisoned Ji Zi, made roasting frames, punished and killed the innocent, ministers at the time trembled, none certain of their lives.",
              "idiomatic": "The tyrant Zhou dismembered Bi Gan, imprisoned Ji Zi, made roasting frames for torture, punished and killed the innocent; his ministers at the time trembled in fear, none certain they would keep their lives."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "然而周師至，而令不行乎下，不能用其民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet Zhou troops arrived, and commands did not run below, could not use their people.",
              "idiomatic": "Yet when the Zhou troops arrived, his commands would not be carried out below, and he could not employ his people."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "是豈令不嚴，刑不陖哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Is this not commands not strict, punishments not severe?",
              "idiomatic": "Is this not having strict commands and severe punishments?"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The way they controlled it was not correct, thus.",
              "idiomatic": "It was because the way they governed was not the correct way."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The extreme of governing distinctions, the root of strength and firmness, the way of awesome conduct, the summation of merit and fame. Kings and nobles follow it, thus unify the empire, make the nobles ministers; Do not follow it, thus abandon the altars of soil and grain. Thus strong armor sharp weapons insufficient for victory, high walls deep moats insufficient for security, strict commands numerous punishments insufficient for awe. Follow its way then proceed, do not follow its way then fail. Chu people shark skin rhinoceros leather, made into armor, hard as metal stone; Wan great iron weapons, sharp as wasp sting, light swift nimble, troops like blazing wind. Yet troops in danger at Chu She, Tang Mei died there; Zhuang Qiao arose, Chu divided into four parts. Is this not having strong armor sharp weapons? The way they controlled it was not correct, thus. Ru Ying as danger, Jiang Han as moat, blocked by Deng forest, edged by Fang city. Yet Qin troops reached Yan Ying, captured like shaking withered grass. Is this not having secure barriers and dangers? The way they controlled it was not correct, thus. Zhou dismembered Bi Gan, imprisoned Ji Zi, made roasting frames, punished and killed the innocent, ministers at the time trembled, none certain of their lives. Yet Zhou troops arrived, and commands did not run below, could not use their people. Is this not commands not strict, punishments not severe? The way they controlled it was not correct, thus.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "古者之兵，戈矛弓矢而已，然而敵國不待試而詘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ancient times' weapons, halberds spears bows arrows only, yet enemy states without testing submitted.",
              "idiomatic": "In ancient times, weapons were only halberds, spears, bows, and arrows, yet enemy states submitted without even testing them."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "城郭不集，溝池不掘，固塞不樹，機變不張，然而國晏然不畏外而固者，無他故焉，明道而均分之，時使而誠愛之，則下應之如景響。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "City walls not gathered, moats not dug, barriers not planted, mechanisms not spread, yet states peacefully not fearing outside and secure—nothing other reason, enlightened way and equal division, timely employment and sincere love, then below responds like echo to shadow.",
              "idiomatic": "City walls were not built up, moats not dug, barriers not established, defensive mechanisms not deployed, yet the state was peaceful and secure without fearing external threats—no other reason than that they enlightened the people with the Way and distributed equally, employed them at the right times and loved them sincerely; then the people responded like an echo to a shadow."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "有不由命者，然後俟之以刑，則民知罪矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Have those not following commands, then await with punishment, then people know crime.",
              "idiomatic": "Only when there were those who did not follow commands were they met with punishment, and thus the people knew what constituted crime."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "故刑一人而天下服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus punish one person and empire submits.",
              "idiomatic": "Therefore, punishing one person would bring the entire empire into submission."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "罪人不尤其上，知罪之在己也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The criminal does not blame superiors, knows crime is in oneself.",
              "idiomatic": "The criminal does not blame his superiors, knowing that the crime lies within himself."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "是故刑罰省而威行如流，無他故焉，由其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus punishments few and awe flows like water, nothing other reason, by its way thus.",
              "idiomatic": "Therefore, punishments were few yet authority flowed like water—no other reason than that they followed the correct way."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "故由其道則行，不由其道則廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus follow its way then proceed, do not follow its way then fail.",
              "idiomatic": "Therefore, if you follow its way, you will succeed; if you do not follow its way, you will fail."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "古者帝堯之治天下也，蓋殺一人刑二人而天下治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ancient times when Emperor Yao governed the empire, executed one person punished two and empire governed.",
              "idiomatic": "In ancient times, when Emperor Yao governed the empire, he executed one person and punished two others, and the empire was well governed."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "傳曰「威厲而不試，刑措而不用」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tradition says 'awesome but not tested, punishments set aside and not used'.",
              "idiomatic": "The tradition says: 'Authority is awesome but never tested; punishments are set aside and never used.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ancient times' weapons, halberds spears bows arrows only, yet enemy states without testing submitted. City walls not gathered, moats not dug, barriers not planted, mechanisms not spread, yet states peacefully not fearing outside and secure—nothing other reason, enlightened way and equal division, timely employment and sincere love, then below responds like echo to shadow. Have those not following commands, then await with punishment, then people know crime. Thus punish one person and empire submits. The criminal does not blame superiors, knows crime is in oneself. Thus punishments few and awe flows like water, nothing other reason, by its way thus. Thus follow its way then proceed, do not follow its way then fail. Ancient times when Emperor Yao governed the empire, executed one person punished two and empire governed. Tradition says 'awesome but not tested, punishments set aside and not used'.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0091",
          "zh": "天地者，生之本也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Heaven and earth are the root of life;",
              "idiomatic": "Heaven and earth are the root of life;"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "先祖者，類之本也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Forefathers are the root of kind;",
              "idiomatic": "Forefathers are the root of our kind;"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "君師者，治之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ruler and teacher are the root of governance.",
              "idiomatic": "Ruler and teacher are the root of governance."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "無天地惡生？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Without heaven and earth who dislikes life?",
              "idiomatic": "Without heaven and earth, who would dislike life?"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "無先祖惡出？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Without forefathers who dislikes birth?",
              "idiomatic": "Without forefathers, who would dislike being born?"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "無君師惡治？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Without ruler teacher who dislikes governance?",
              "idiomatic": "Without ruler and teacher, who would dislike being governed?"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "三者偏亡，則無安人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If these three are partially lost, then no secure people.",
              "idiomatic": "If any of these three are lost, then there are no secure people."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "故禮，上事天，下事地，尊先祖而隆君師，是禮之三本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus rites serve heaven above, serve earth below, honor forefathers and flourish ruler teacher—this is rites' three roots.",
              "idiomatic": "Therefore, rites serve heaven above and earth below, honor the forefathers and exalt the ruler and teacher—these are the three roots of rites."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Heaven and earth are the root of life; Forefathers are the root of kind; Ruler and teacher are the root of governance. Without heaven and earth who dislikes life? Without forefathers who dislikes birth? Without ruler teacher who dislikes governance? If these three are partially lost, then no secure people. Thus rites serve heaven above, serve earth below, honor forefathers and flourish ruler teacher—this is rites' three roots.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "故王者天太祖，諸侯不敢懷，大夫士有常宗，所以辨貴賤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus kings take heaven as great ancestor, nobles dare not harbor, grandees scholars have constant ancestral temple, so distinguish noble base.",
              "idiomatic": "Therefore, kings take heaven as their great ancestor; nobles dare not claim this; grandees and scholars have fixed ancestral temples, so as to distinguish between noble and base."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "貴賤治，得之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Noble and base are governed, this obtains their root.",
              "idiomatic": "The distinction between noble and base is well ordered—this is obtaining their root."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus kings take heaven as great ancestor, nobles dare not harbor, grandees scholars have constant ancestral temple, so distinguish noble base. Noble and base are governed, this obtains their root.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "郊疇乎天子，社至乎諸侯，函及士大夫，所以辨尊者事尊，卑者事卑，宜鉅者鉅，宜小者小。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The suburban fields reach to the Son of Heaven, the altars reach to the nobles, the enclosures extend to the scholars and grandees, so as to distinguish those who honor serve the honored, the lowly serve the lowly, those suitable for great have greatness, those suitable for small have smallness.",
              "idiomatic": "The suburban sacrifices extend to the Son of Heaven, the altar sacrifices to the nobles, and the enclosure sacrifices to scholars and grandees, so as to distinguish: those who are honored serve the honored, those who are lowly serve the lowly, those suited for greatness have greatness, those suited for smallness have smallness."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The suburban fields reach to the Son of Heaven, the altars reach to the nobles, the enclosures extend to the scholars and grandees, so as to distinguish those who honor serve the honored, the lowly serve the lowly, those suitable for great have greatness, those suitable for small have smallness.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "故有天下者事七世，有一國者事五世，有五乘之地者事三世，有三乘之地者事二世，有特牲而食者不得立宗廟，所以辨積厚者流澤廣，積薄者流澤狹也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus those who possess the empire serve seven generations, those who possess one state serve five generations, those who possess five chariot lands serve three generations, those who possess three chariot lands serve two generations, those who have special victims and eat cannot establish ancestral temples, so as to distinguish those with thick accumulation have broad flowing favor, those with thin accumulation have narrow flowing favor.",
              "idiomatic": "Therefore, those who possess the empire sacrifice to seven generations; those who possess one state sacrifice to five generations; those who possess lands for five chariots sacrifice to three generations; those who possess lands for three chariots sacrifice to two generations; those who only offer special sacrifices and eat cannot establish ancestral temples. This serves to distinguish: those with thick accumulations have broadly flowing favor; those with thin accumulations have narrowly flowing favor."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus those who possess the empire serve seven generations, those who possess one state serve five generations, those who possess five chariot lands serve three generations, those who possess three chariot lands serve two generations, those who have special victims and eat cannot establish ancestral temples, so as to distinguish those with thick accumulation have broad flowing favor, those with thin accumulation have narrow flowing favor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "大饗上玄尊，俎上腥魚，先大羹，貴食飲之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The great feast honors the supreme cup, the stands have raw fish, precede with great broth—honoring the root of food and drink.",
              "idiomatic": "In the great feast, they honor the supreme cup; on the stands they place raw fish; they precede with great broth—honoring the root of food and drink."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great feast honors the supreme cup, the stands have raw fish, precede with great broth—honoring the root of food and drink.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "大饗上玄尊而用薄酒，食先黍稷而飯稻粱，祭嚌先大羹而飽庶羞，貴本而親用也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The great feast honors the supreme cup but uses thin wine, food precedes millet and grain but rice with rice and millet, sacrifice bites precede great broth but sate with many delicacies—honoring the root but being close to use.",
              "idiomatic": "In the great feast they honor the supreme cup but use thin wine; food precedes with millet and grain but is served with rice and millet; sacrifice bites precede with great broth but one becomes sated with many delicacies—honoring the root but being close to practical use."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "貴本之謂文，親用之謂理，兩者合而成文，以歸太一，是謂大隆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Honoring the root is called pattern, being close to use is called principle, the two combine to form pattern, to return to the great one, this is called great flourishing.",
              "idiomatic": "Honoring the root is called pattern; being close to practical use is called principle. The two combine to form pattern, returning to the great unity—this is called great flourishing."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great feast honors the supreme cup but uses thin wine, food precedes millet and grain but rice with rice and millet, sacrifice bites precede great broth but sate with many delicacies—honoring the root but being close to use. Honoring the root is called pattern, being close to use is called principle, the two combine to form pattern, to return to the great one, this is called great flourishing.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "故尊之上玄尊也，俎之上腥魚也，豆之先大羹，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus the supreme cup above the cups, raw fish above the stands, great broth first in the dishes—it is one.",
              "idiomatic": "Therefore, the supreme cup is above all cups; raw fish is above all stands; great broth comes first in all dishes—it is all one principle."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus the supreme cup above the cups, raw fish above the stands, great broth first in the dishes—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "利爵弗啐也，成事俎弗嘗也，三侑之弗食也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Profitable cups are not sipped, completed matter stands are not tasted, the three toasts are not eaten.",
              "idiomatic": "Profitable cups are not sipped; completed sacrificial stands are not tasted; the three toasts are not eaten."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Profitable cups are not sipped, completed matter stands are not tasted, the three toasts are not eaten.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "大昏之未廢齊也，大廟之未內尸也，始絕之未小斂，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The great marriage has not yet dismissed the fasting hut, the great temple has not yet entered the corpse, beginning mourning has not yet small dressing—it is one.",
              "idiomatic": "In the great marriage ceremony, they have not yet dismissed the fasting hut; in the great temple, they have not yet brought in the corpse; at the beginning of mourning, they have not yet done the small dressing—it is all one principle."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great marriage has not yet dismissed the fasting hut, the great temple has not yet entered the corpse, beginning mourning has not yet small dressing—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "大路之素幬也，郊之麻絻，喪服之先散麻，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The great chariot's plain canopy, the suburban hemp headbands, mourning garments first loose hemp—it is one.",
              "idiomatic": "The great chariot has a plain canopy; suburban sacrifices use hemp headbands; mourning garments begin with loose hemp—it is all one principle."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great chariot's plain canopy, the suburban hemp headbands, mourning garments first loose hemp—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0110",
          "zh": "三年哭之不反也，清廟之歌一倡而三嘆，縣一鐘尚拊膈，朱弦而通越，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Three years of weeping do not return, pure temple songs one begins and three sigh, hanging one bell still strikes the frame, vermilion strings and penetrating tones—it is one.",
              "idiomatic": "Three years of weeping do not return to normal; pure temple songs—one begins and three respond with sighs; hanging one bell still strikes the frame; vermilion strings and penetrating tones—it is all one principle."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Three years of weeping do not return, pure temple songs one begins and three sigh, hanging one bell still strikes the frame, vermilion strings and penetrating tones—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0111",
          "zh": "凡禮始乎脫，成乎文，終乎稅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "All rites begin with simplicity, are completed with pattern, end with relaxation.",
              "idiomatic": "All rites begin with simplicity, are completed with pattern, and end with relaxation."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "故至備，情文俱盡；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus in utmost completeness, emotion and pattern are both exhausted;",
              "idiomatic": "Therefore, in the utmost completeness, both emotion and pattern are fully expressed;"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "其次，情文代勝；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next, emotion and pattern alternately prevail;",
              "idiomatic": "Next, emotion and pattern alternately prevail;"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "其下，復情以歸太一。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Below this, return to emotion to go to the great one.",
              "idiomatic": "Below this, they return to emotion to unite with the great one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "All rites begin with simplicity, are completed with pattern, end with relaxation. Thus in utmost completeness, emotion and pattern are both exhausted; Next, emotion and pattern alternately prevail; Below this, return to emotion to go to the great one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "天地以合，日月以明，四時以序，星辰以行，江河以流，萬物以昌，好惡以節，喜怒以當。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Heaven and earth combine thereby, sun and moon are bright thereby, the four seasons are ordered thereby, stars and constellations move thereby, rivers and streams flow thereby, the myriad things flourish thereby, likes and dislikes are regulated thereby, joy and anger are appropriate thereby.",
              "idiomatic": "Through rites, heaven and earth are united; sun and moon shine brightly; the four seasons are ordered; stars and constellations move in their courses; rivers and streams flow; the myriad things flourish; likes and dislikes are regulated; joy and anger are appropriate."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "以為下則順，以為上則明。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Using it below then follows, using it above then is enlightened.",
              "idiomatic": "When used by those below, they follow; when used by those above, they are enlightened."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Heaven and earth combine thereby, sun and moon are bright thereby, the four seasons are ordered thereby, stars and constellations move thereby, rivers and streams flow thereby, the myriad things flourish thereby, likes and dislikes are regulated thereby, joy and anger are appropriate thereby. Using it below then follows, using it above then is enlightened.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0117",
          "zh": "太史公曰：至矣哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Grand Historian said: How supreme!",
              "idiomatic": "The Grand Historian said: How supreme!"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "立隆以為極，而天下莫之能益損也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Established flourishing as the extreme, and the empire cannot add to or diminish it.",
              "idiomatic": "They established flourishing as the ultimate standard, and none in the empire can add to or diminish it."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "本末相順，終始相應，至文有以辨，至察有以說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Root and branch are mutually compliant, beginning and end correspond, utmost pattern has distinctions, utmost examination has explanations.",
              "idiomatic": "Root and branch are mutually compliant; beginning and end correspond; utmost pattern provides distinctions; utmost examination provides explanations."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "天下從之者治，不從者亂；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The empire follows it and is ordered, does not follow it and is chaotic;",
              "idiomatic": "Those in the empire who follow it are well governed; those who do not follow it are chaotic;"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "從之者安，不從者危。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Follows it and is peaceful, does not follow it and is endangered.",
              "idiomatic": "Those who follow it are secure; those who do not follow it are in danger."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "小人不能則也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Small men cannot emulate it.",
              "idiomatic": "Small men cannot emulate it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian said: How supreme! Established flourishing as the extreme, and the empire cannot add to or diminish it. Root and branch are mutually compliant, beginning and end correspond, utmost pattern has distinctions, utmost examination has explanations. The empire follows it and is ordered, does not follow it and is chaotic; Follows it and is peaceful, does not follow it and is endangered. Small men cannot emulate it.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "禮之貌誠深矣，堅白同異之察，入焉而弱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The appearance of rites is truly profound, the examination of hard white same different enters it and weakens.",
              "idiomatic": "The appearance of rites is truly profound—the examinations of hardness and whiteness, sameness and difference enter it and are weakened."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "其貌誠大矣，擅作典制褊陋之說，入焉而望。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its appearance is truly great, the sayings of monopolizing creation of systems and narrow pettiness enter it and are daunted.",
              "idiomatic": "Its appearance is truly great—the sayings of monopolizing the creation of institutions and narrow pettiness enter it and are daunted."
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "其貌誠高矣，暴慢恣睢，輕俗以為高之屬，入焉而隊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its appearance is truly lofty, the violent rude unrestrained types who lightly regard customs as lofty enter it and collapse.",
              "idiomatic": "Its appearance is truly lofty—the violent, rude, unrestrained types who lightly regard customs as lofty enter it and collapse."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "故繩誠陳，則不可欺以曲直；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus when the cord is truly set out, it cannot be deceived with straight and crooked;",
              "idiomatic": "Therefore, when the plumb line is truly set out, it cannot be deceived with straight and crooked;"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "衡誠縣，則不可欺以輕重；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the balance is truly hung, it cannot be deceived with light and heavy;",
              "idiomatic": "When the balance is truly hung, it cannot be deceived with light and heavy;"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "規矩誠錯，則不可欺以方員；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When compass and square are truly applied, it cannot be deceived with square and round;",
              "idiomatic": "When compass and square are truly applied, it cannot be deceived with square and round;"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "君子審禮，則不可欺以詐偽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The gentleman examines rites, cannot be deceived with fraud and falsehood.",
              "idiomatic": "When the gentleman examines rites, he cannot be deceived with fraud and falsehood."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "故繩者，直之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus the cord is the utmost of straightness;",
              "idiomatic": "Therefore, the plumb line is the utmost of straightness;"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "衡者，平之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The balance is the utmost of levelness;",
              "idiomatic": "The balance is the utmost of levelness;"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "規矩者，方員之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Compass and square are the utmost of squareness and roundness;",
              "idiomatic": "Compass and square are the utmost of squareness and roundness;"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "禮者，人道之極也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rites are the extreme of the human way.",
              "idiomatic": "Rites are the extreme of the human way."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "然而不法禮者不足禮，謂之無方之民；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet those who do not follow rites are insufficient in rites, called people without direction;",
              "idiomatic": "Yet those who do not follow rites are insufficient in rites—they are called people without direction;"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "法禮足禮，謂之有方之士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those who follow rites and suffice in rites are called scholars with direction.",
              "idiomatic": "Those who follow rites and suffice in rites are called scholars with direction."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "禮之中，能思索，謂之能慮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Among rites, those who can contemplate are called able to consider;",
              "idiomatic": "Among rites, those who can contemplate are called able to consider;"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "能慮勿易，謂之能固。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Able to consider and not change are called able to be firm.",
              "idiomatic": "Able to consider and not change—these are called able to be firm."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "能慮能固，加好之焉，聖矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Able to consider and able to be firm, moreover delight in it—sages.",
              "idiomatic": "Able to consider and able to be firm, moreover delight in it—these are sages."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "天者，高之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Heaven is the extreme of height;",
              "idiomatic": "Heaven is the extreme of height;"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "地者，下之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Earth is the extreme of lowness;",
              "idiomatic": "Earth is the extreme of lowness;"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "日月者，明之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sun and moon are the extreme of brightness;",
              "idiomatic": "The sun and moon are the extreme of brightness;"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "無窮者，廣大之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The infinite is the extreme of vastness;",
              "idiomatic": "The infinite is the extreme of vastness;"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "聖人者，道之極也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sages are the extreme of the way.",
              "idiomatic": "Sages are the extreme of the way."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The appearance of rites is truly profound, the examination of hard white same different enters it and weakens. Its appearance is truly great, the sayings of monopolizing creation of systems and narrow pettiness enter it and are daunted. Its appearance is truly lofty, the violent rude unrestrained types who lightly regard customs as lofty enter it and collapse. Thus when the cord is truly set out, it cannot be deceived with straight and crooked; When the balance is truly hung, it cannot be deceived with light and heavy; When compass and square are truly applied, it cannot be deceived with square and round; The gentleman examines rites, cannot be deceived with fraud and falsehood. Thus the cord is the utmost of straightness; The balance is the utmost of levelness; Compass and square are the utmost of squareness and roundness; Rites are the extreme of the human way. Yet those who do not follow rites are insufficient in rites, called people without direction; Those who follow rites and suffice in rites are called scholars with direction. Among rites, those who can contemplate are called able to consider; Able to consider and not change are called able to be firm. Able to consider and able to be firm, moreover delight in it—sages. Heaven is the extreme of height; Earth is the extreme of lowness; Sun and moon are the extreme of brightness; The infinite is the extreme of vastness; Sages are the extreme of the way.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "以財物為用，以貴賤為文，以多少為異，以隆殺為要。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Using wealth and goods for use, using noble and base as pattern, using many and few as distinction, using flourishing and diminishing as essentials.",
              "idiomatic": "They use wealth and goods for practical purposes, noble and base as patterns, many and few as distinctions, flourishing and diminishing as essentials."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "文貌繁，情欲省，禮之隆也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pattern appearance elaborate, emotion desires few—this is rites' flourishing;",
              "idiomatic": "When pattern and appearance are elaborate but emotion and desires are restrained—this is the flourishing of rites;"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "文貌省，情欲繁，禮之殺也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pattern appearance few, emotion desires elaborate—this is rites' diminishing;",
              "idiomatic": "When pattern and appearance are restrained but emotion and desires are elaborate—this is the diminishing of rites;"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "文貌情欲相為內外表裏，并行而雜，禮之中流也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pattern appearance and emotion desires mutually inside outside, surface lining, proceed together and mixed—this is rites' middle flow.",
              "idiomatic": "When pattern and appearance, emotion and desires mutually serve as inner and outer, surface and lining, proceeding together and mixed—this is the middle flow of rites."
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "君子上致其隆，下盡其殺，而中處其中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The gentleman above reaches its flourishing, below exhausts its diminishing, and in the middle dwells in its middle.",
              "idiomatic": "The gentleman above reaches its flourishing, below exhausts its diminishing, and in the middle dwells in its middle."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "步驟馳騁廣騖不外，是以君子之性守宮庭也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Steps and gallops, rushing extensively do not go outside, thus the gentleman's nature guards the palace courtyard.",
              "idiomatic": "His steps and gallops, his extensive rushing do not go outside—thus the gentleman's nature guards the palace courtyard."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "人域是域，士君子也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This domain is domain, scholar gentlemen.",
              "idiomatic": "This domain is the domain of scholar gentlemen."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "外是，民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Outside this, the common people.",
              "idiomatic": "Outside this are the common people."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "於是中焉，房皇周浹，曲［直］得其次序，聖人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus in the middle, vast and encompassing, straight obtains its sequence—sages.",
              "idiomatic": "Thus in the middle, vast and encompassing, the straight obtains its proper sequence—these are sages."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "故厚者，禮之積也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus thickness is rites' accumulation;",
              "idiomatic": "Therefore, thickness is the accumulation of rites;"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "大者，禮之廣也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Greatness is rites' breadth;",
              "idiomatic": "Greatness is the breadth of rites;"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "高者，禮之隆也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Loftiness is rites' flourishing;",
              "idiomatic": "Loftiness is the flourishing of rites;"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "明者，禮之盡也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Brightness is rites' exhaustion.",
              "idiomatic": "Brightness is the exhaustion of rites."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Using wealth and goods for use, using noble and base as pattern, using many and few as distinction, using flourishing and diminishing as essentials. Pattern appearance elaborate, emotion desires few—this is rites' flourishing; Pattern appearance few, emotion desires elaborate—this is rites' diminishing; Pattern appearance and emotion desires mutually inside outside, surface lining, proceed together and mixed—this is rites' middle flow. The gentleman above reaches its flourishing, below exhausts its diminishing, and in the middle dwells in its middle. Steps and gallops, rushing extensively do not go outside, thus the gentleman's nature guards the palace courtyard. This domain is domain, scholar gentlemen. Outside this, the common people. Thus in the middle, vast and encompassing, straight obtains its sequence—sages. Thus thickness is rites' accumulation; Greatness is rites' breadth; Loftiness is rites' flourishing; Brightness is rites' exhaustion.",
          "idiomatic": null
        }
      ]
    }
  ]
}