{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "029",
    "url": "https://chinesenotes.com/shiji/shiji029.html",
    "title": {
      "zh": "河渠書",
      "en": "Rivers and canals",
      "raw": "《河渠書》 Rivers and canals"
    },
    "sentenceCount": 95,
    "translatedCount": 95,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:57.356Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "《夏書》曰：禹抑洪水十三年，過家不入門。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xia Shu said: Yu controlled floodwaters thirteen years, passed home not entered gate.",
              "idiomatic": "The Xia Shu says: Yu controlled the floodwaters for thirteen years, passing by his home but not entering the gate."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "陸行載車，水行載舟，泥行蹈毳，山行即橋。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Land travel rode cart, water travel rode boat, mud travel stepped rushes, mountain travel used bridge.",
              "idiomatic": "On land he traveled by cart, on water by boat, through mud he stepped on rushes, through mountains he used bridges."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "以別九州，隨山浚川，任土作貢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To distinguish nine provinces, following mountains dredged rivers, according to soil made tribute.",
              "idiomatic": "To distinguish the nine provinces, following the mountains he dredged the rivers, according to the soil he established tributes."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "通九道，陂九澤，度九山。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Opened nine roads, dammed nine marshes, crossed nine mountains.",
              "idiomatic": "He opened nine roads, dammed nine marshes, and crossed nine mountains."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "然河菑衍溢，害中國也尤甚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet river disasters spread overflowed, harmed China especially severely.",
              "idiomatic": "Yet the river disasters spread and overflowed, harming China especially severely."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "唯是為務。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Only this made task.",
              "idiomatic": "He made only this his task."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "故道河自積石歷龍門，南到華陰，東下砥柱，及孟津、雒汭，至于大邳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore guided river from Ji Shi through Long Men, south arrived Hua Yin, east down Di Zhu, and Meng Jin, Luo Rui, until Da Pei.",
              "idiomatic": "Therefore he guided the river from Ji Shi through Long Men, south to Hua Yin, east down to Di Zhu, and Meng Jin, Luo Rui, until Da Pei."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "於是禹以為河所從來者高，水湍悍，難以行平地，數為敗，乃二渠以引其河。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Yu thought river source high, water turbulent fierce, difficult flow flat land, frequently caused breaches, then two channels to divert its river.",
              "idiomatic": "Therefore Yu thought that the river's source was high, the water turbulent and fierce, difficult to flow on flat land, frequently causing breaches, so he made two channels to divert the river."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "北載之高地，過降水，至于大陸，播為九河，同為逆河，入于勃海九川既疏，九澤既灑，諸夏艾安，功施于三代。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "North diverted to high ground, passed Jiang Shui, arrived mainland, spread as nine rivers, all became counter rivers, entered Bohai Sea. Nine rivers already dredged, nine marshes already drained, various Xia peaceful, merit extended to three dynasties.",
              "idiomatic": "He diverted it north to high ground, passing through Jiang Shui to the mainland, spreading it into nine rivers, all flowing counter to the river, entering the Bohai Sea. The nine rivers were dredged, the nine marshes drained, the various Xia were peaceful, and the merit extended to the Three Dynasties."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "自是之後，滎陽下引河東南為鴻溝，以通宋、鄭、陳、蔡、曹、衛，與濟、汝、淮、泗會。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this after, Xingyang below diverted river southeast as Hong Gou, to connect Song, Zheng, Chen, Cai, Cao, Wei, with Ji, Ru, Huai, Si met.",
              "idiomatic": "From this time on, Xingyang below diverted the river southeast as the Hong Gou, to connect Song, Zheng, Chen, Cai, Cao, Wei, meeting with Ji, Ru, Huai, and Si."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "于楚，西方則通渠漢水、雲夢之野，東方則通［鴻］溝江淮之閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In Chu, west then opened channels Han River, Yunmeng marshes, east then connected Hong Gou Jiang Huai between.",
              "idiomatic": "In Chu, to the west he opened channels to the Han River and Yunmeng marshes, to the east he connected the Hong Gou between Jiang and Huai."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "於吳，則通渠三江、五湖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In Wu, then opened channels Three Jiang, Five Lakes.",
              "idiomatic": "In Wu, he opened channels to the Three Jiang and Five Lakes."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "於齊，則通菑濟之閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In Qi, then connected Zi Ji between.",
              "idiomatic": "In Qi, he connected between Zi and Ji."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "於蜀，蜀守冰鑿離碓，辟沫水之害，穿二江成都之中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In Shu, Shu governor Bing chiseled Li Dui, avoided Mo Shui harm, pierced two rivers Chengdu middle.",
              "idiomatic": "In Shu, the Shu governor Bing chiseled Li Dui, avoided the harm of Mo Shui, and pierced the two rivers through Chengdu's middle."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "此渠皆可行舟，有餘則用溉浸，百姓饗其利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "These channels all could carry boats, when surplus then used irrigate soak, people enjoyed its benefits.",
              "idiomatic": "These channels could all carry boats; when there was surplus water it was used for irrigation, and the people enjoyed its benefits."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "至于所過，往往引其水益用溉田疇之渠，以萬億計，然莫足數也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As to places passed, often led their water moreover used irrigate fields channels, counted in ten thousand hundred million, yet none sufficient to enumerate.",
              "idiomatic": "As for the places he passed through, he often led their waters to additionally irrigate field canals; these numbered in the tens of thousands, yet none were sufficient to enumerate."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0017",
          "zh": "西門豹引漳水溉鄴，以富魏之河內。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xi Men Bao led Zhang water irrigate Ye, to enrich Wei's He Nei.",
              "idiomatic": "Xi Men Bao led the Zhang River to irrigate Ye, thereby enriching Wei's He Nei region."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "而韓聞秦之好興事，欲罷之，毋令東伐，乃使水工鄭國閒說秦，令鑿涇水自中山西邸瓠口為渠，并北山東注洛三百餘里，欲以溉田。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Han heard Qin liked to start affairs, wanted to stop it, not let east attack, then made water engineer Zheng Guo secretly persuade Qin, ordered dig Jing water from Zhong Shan west Di Hulu mouth make canal, along north mountain east pour Luo three hundred more li, wanted to irrigate fields.",
              "idiomatic": "When Han heard that Qin liked to start projects, they wanted to stop Qin from doing so, to prevent eastward attacks; they sent water engineer Zheng Guo to secretly persuade Qin to dig the Jing River from Zhong Shan west Di Hulu mouth as a canal, along the north mountain eastward flowing to the Luo for over three hundred li, intending to irrigate fields."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "中作而覺，秦欲殺鄭國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Middle work and aware, Qin wanted kill Zheng Guo.",
              "idiomatic": "In the middle of the work they became aware of the scheme; Qin wanted to kill Zheng Guo."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "鄭國曰：「始臣為閒，然渠成亦秦之利也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zheng Guo said: 'Beginning minister did secretly, yet canal complete also Qin benefit.'",
              "idiomatic": "Zheng Guo said: 'At first I acted secretly, but the completed canal will also benefit Qin.'"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "秦以為然，卒使就渠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin considered it so, finally made complete canal.",
              "idiomatic": "Qin considered this reasonable and in the end had the canal completed."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "渠就，用注填閼之水，溉澤鹵之地四萬餘頃，收皆畝一鐘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Canal complete, used pour fill block water, irrigate salty alkali land four ten thousand more qing, harvest all mu one zhong.",
              "idiomatic": "The canal completed; using the water that filled and blocked, it irrigated over forty thousand qing of salty alkali land; the harvest was one zhong per mu."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "於是關中為沃野，無凶年，秦以富彊，卒并諸侯，因命曰鄭國渠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Guan Zhong became fertile fields, no famine years, Qin thereby rich strong, finally united feudal lords, therefore named Zheng Guo Canal.",
              "idiomatic": "Therefore Guan Zhong became fertile fields with no famine years; Qin thereby grew rich and strong, finally uniting the feudal lords; thus it was named the Zheng Guo Canal."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "漢興三十九年，孝文時河決酸棗，東潰金隄，於是東郡大興卒塞之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han rise thirty nine years, Xiao Wen time Yellow River burst Suan Zao, east burst Jin Di, therefore Dong Jun greatly raised troops blocked it.",
              "idiomatic": "Thirty-nine years after Han's rise, during Emperor Xiao Wen's time, the Yellow River burst at Suan Zao, bursting eastward through the Jin dike; Dong Commandery therefore greatly raised troops to block it."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0025",
          "zh": "其後四十有餘年，今天子元光之中，而河決於瓠子，東南注鉅野，通於淮、泗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after forty more years, now Son of Heaven Yuan Guang middle, and Yellow River burst at Hulu Zi, southeast poured Ju Ye, connected to Huai, Si.",
              "idiomatic": "Over forty years later, now in the middle of the present Son of Heaven's Yuan Guang era, the Yellow River burst at Hulu Zi, flowing southeast into Ju Ye, connecting to the Huai and Si Rivers."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "於是天子使汲黯、鄭當時興人徒塞之，輒復壞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven made Ji An, Zheng Dang Shi raise people troops block it, then again broke.",
              "idiomatic": "Therefore the Son of Heaven sent Ji An and Zheng Dang Shi to raise people and troops to block it, but it repeatedly broke again."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "是時武安侯田蚡為丞相，其奉邑食鄃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Wu An Hou Tian Fen was Chancellor, his fief ate Zhu.",
              "idiomatic": "At this time, the Marquis of Wu An, Tian Fen, was Chancellor; his fiefdom drew sustenance from Zhu."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "鄃居河北，河決而南則鄃無水菑，邑收多。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhu located north of Yellow River, Yellow River burst south then Zhu no water disaster, fief harvest much.",
              "idiomatic": "Zhu was located north of the Yellow River; if the river burst southward, Zhu would have no water disasters, and the fiefdom's harvests would be plentiful."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "蚡言於上曰：「江河之決皆天事，未易以人力為彊塞，塞之未必應天。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fen spoke to emperor: 'Yangtze Yellow River bursts all heaven affairs, not easy with human force strongly block, block it not necessarily respond to heaven.'",
              "idiomatic": "Fen spoke to the emperor: 'The bursting of the Yangtze and Yellow Rivers are all matters of heaven; it is not easy to strongly block them with human force; blocking them may not accord with heaven's will.'"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "而望氣用數者亦以為然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And those who watched qi used numbers also considered it so.",
              "idiomatic": "Those who observed qi and used divination numbers also considered it so."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "於是天子久之不事復塞也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven long time not undertake again block also.",
              "idiomatic": "Therefore the Son of Heaven for a long time did not undertake to block it again."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "是時鄭當時為大農，言曰：「異時關東漕粟從渭中上，度六月而罷，而漕水道九百餘里，時有難處。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Zheng Dang Shi was Grand Agrarian, spoke: 'Different time Guan Dong transported grain from Wei middle up, estimated six months and stop, and transported water route nine hundred more li, sometimes had difficult places.'",
              "idiomatic": "At this time Zheng Dang Shi was Grand Agrarian; he said: 'In former times, Guan Dong transported grain up from the middle of the Wei, taking an estimated six months to complete; the transport water route was over nine hundred li, and sometimes had difficult places.'"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "引渭穿渠起長安，并南山下，至河三百餘里，徑，易漕，度可令三月罷；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lead Wei dig canal start Chang An, along south mountain down, to Yellow River three hundred more li, direct, easy transport, estimated can make three months stop;",
              "idiomatic": "Lead the Wei and dig a canal starting from Chang An, along the south mountain downward, to the Yellow River over three hundred li; direct route, easy transport, estimated to complete in three months;"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "而渠下民田萬餘頃，又可得以溉田：此損漕省卒，而益肥關中之地，得穀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And canal below people fields ten thousand more qing, also can use to irrigate fields: this reduce transport save troops, and benefit fertilize Guan Zhong land, get grain.",
              "idiomatic": "And below the canal are over ten thousand qing of people's fields, which can also be used to irrigate fields: this reduces transport and saves troops, while benefiting and fertilizing Guan Zhong's land to obtain grain.'"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "天子以為然，令齊人水工徐伯表，悉發卒數萬人穿漕渠，三歲而通。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven considered it so, ordered Qi person water engineer Xu Bo Biao, all raised troops several ten thousand dig transport canal, three years and connected.",
              "idiomatic": "The Son of Heaven considered it so; he ordered the Qi person water engineer Xu Bo Biao to raise all troops, several tens of thousands, to dig the transport canal; in three years it was connected."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "通，以漕，大便利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Connected, used transport, greatly convenient.",
              "idiomatic": "Connected; used for transport; greatly convenient."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "其後漕稍多，而渠下之民頗得以溉田矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after transport gradually much, and canal below people rather could irrigate fields.",
              "idiomatic": "Afterward transport gradually increased, and the people below the canal rather could irrigate their fields."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0038",
          "zh": "其後河東守番系言：「漕從山東西，歲百餘萬石，更砥柱之限，敗亡甚多，而亦煩費。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after He Dong governor Fan Xi spoke: 'Transport from mountain west east, year hundred more ten thousand shi, pass Di Zhu limit, damage loss very much, and also troublesome costly.'",
              "idiomatic": "Afterward, He Dong governor Fan Xi spoke: 'Transport from west of the mountains to east, yearly over a hundred ten thousand shi; passing the Di Zhu limit, damage and loss are very great, and also troublesome and costly.'"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "穿渠引汾溉皮氏、汾陰下，引河溉汾陰、蒲阪下，度可得五千頃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dig canal lead Fen irrigate Pi Shi, Fen Yin below, lead Yellow River irrigate Fen Yin, Pu Ban below, estimated can get five thousand qing.",
              "idiomatic": "Dig a canal to lead the Fen to irrigate below Pi Shi and Fen Yin; lead the Yellow River to irrigate below Fen Yin and Pu Ban; estimated to obtain five thousand qing."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "五千頃故盡河壖棄地，民茭牧其中耳，今溉田之，度可得穀二百萬石以上。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Five thousand qing formerly all Yellow River bank abandoned land, people cut grass pasture among it, now irrigate fields it, estimated can get grain two hundred ten thousand shi above.",
              "idiomatic": "The five thousand qing were formerly all Yellow River bank abandoned land; people only cut grass and pastured among it; now irrigating fields there, estimated to obtain over two hundred ten thousand shi of grain."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "穀從渭上，與關中無異，而砥柱之東可無復漕。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grain from Wei up, with Guan Zhong no different, and Di Zhu east can no again transport.",
              "idiomatic": "Grain from the Wei upward, no different from Guan Zhong, and east of Di Zhu can have no more transport.'"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "天子以為然，發卒數萬人作渠田。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven considered it so, raised troops several ten thousand make canal fields.",
              "idiomatic": "The Son of Heaven considered it so; he raised several tens of thousands of troops to make canal fields."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "數歲，河移徙，渠不利，則田者不能償種。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Several years, Yellow River moved migrated, canal not beneficial, then field workers could not repay seed.",
              "idiomatic": "After several years, the Yellow River migrated and the canal was not beneficial; the field workers could not repay their seed costs."
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "久之，河東渠田廢，予越人，令少府以為稍入。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Long time, He Dong canal fields abandoned, gave Yue people, ordered Shao Fu as grain income.",
              "idiomatic": "After a long time, the He Dong canal fields were abandoned; they were given to Yue people, and ordered the Shao Fu to use them as grain income."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0045",
          "zh": "其後人有上書欲通褒斜道及漕事，下御史大夫張湯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after someone memorialed wanted connect Bao Xie road and transport affairs, sent down Yu Shi Da Fu Zhang Tang.",
              "idiomatic": "Afterward someone memorialed desiring to connect the Bao Xie road and transport affairs; it was sent down to Grandee Secretary Zhang Tang."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "湯問其事，因言：「抵蜀從故道，故道多阪，回遠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tang asked its affairs, therefore spoke: 'Go Shu from old road, old road many slopes, circuitous far.'",
              "idiomatic": "Tang asked about the affairs; therefore he spoke: 'Going to Shu from the old road, the old road has many slopes and is circuitous and far.'"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "今穿褒斜道，少阪，近四百里；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now dig Bao Xie road, few slopes, near four hundred li;",
              "idiomatic": "Now digging the Bao Xie road has few slopes and is nearly four hundred li;"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "而褒水通沔，斜水通渭，皆可以行船漕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Bao water connects Mian, Xie water connects Wei, all can travel boats transport.",
              "idiomatic": "And Bao water connects to Mian, Xie water connects to Wei; all can travel boats for transport."
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "漕從南陽上沔入褒，褒之絕水至斜，閒百餘里，以車轉，從斜下下渭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Transport from Nan Yang up Mian enter Bao, Bao carry water to Xie, between hundred more li, with cart transfer, from Xie down down Wei.",
              "idiomatic": "Transport from Nan Yang up the Mian entering Bao; carry by water from Bao to Xie; between them over a hundred li, transfer by cart; from Xie down to the Wei."
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "如此，漢中之穀可致，山東從沔無限，便於砥柱之漕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Like this, Han Zhong grain can bring, Shan Dong from Mian unlimited, convenient than Di Zhu transport.",
              "idiomatic": "Like this, Han Zhong's grain can be brought; Shan Dong from the Mian has no limit; more convenient than Di Zhu's transport."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "且褒斜材木竹箭之饒，擬於巴蜀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover Bao Xie timber bamboo arrows abundant, comparable to Ba Shu.",
              "idiomatic": "Moreover Bao Xie's timber, bamboo, and arrows are abundant, comparable to Ba Shu.'"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "天子以為然，拜湯子卬為漢中守，發數萬人作褒斜道五百餘里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven considered it so, appointed Tang Zi Ang as Han Zhong governor, raised several ten thousand make Bao Xie road five hundred more li.",
              "idiomatic": "The Son of Heaven considered it so; he appointed Tang Zi Ang as Han Zhong governor and raised several tens of thousands to make the Bao Xie road over five hundred li."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "道果便近，而水湍石，不可漕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Road indeed convenient near, but water rapid stones, cannot transport.",
              "idiomatic": "The road was indeed convenient and near, but the water was rapid with stones; could not transport."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0054",
          "zh": "其後莊熊羆言：「臨晉民願穿洛以溉重泉以東萬餘頃故鹵地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after Zhuang Xiong Pi spoke: 'Lin Jin people wish dig Luo to irrigate Chong Quan east ten thousand more qing former salty alkali land.'",
              "idiomatic": "Afterward Zhuang Xiong Pi spoke: 'Lin Jin people wish to dig the Luo to irrigate the over ten thousand qing of former salty alkali land east of Chong Quan.'"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "誠得水，可令畝十石。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Truly get water, can make mu ten shi.",
              "idiomatic": "Truly obtaining water, can make each mu yield ten shi.'"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "於是為發卒萬餘人穿渠，自徵引洛水至商顏山下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore for raised troops ten thousand more dig canal, from Zheng lead Luo water to Shang Yan mountain below.",
              "idiomatic": "Therefore they raised over ten thousand troops to dig the canal, leading the Luo water from Zheng to below Shang Yan mountain."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "岸善崩，乃鑿井，深者四十餘丈。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Banks easily collapse, then dug wells, deep ones forty more zhang.",
              "idiomatic": "The banks easily collapsed; they then dug wells, the deep ones over forty zhang."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "往往為井，井下相通行水。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Often made wells, wells below mutually connected flowing water.",
              "idiomatic": "Often they made wells; below the wells they mutually connected flowing water."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "水穨以絕商顏，東至山嶺十餘里閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Water floated to cross Shang Yan, east to mountain ridge ten more li between.",
              "idiomatic": "Water floated to cross Shang Yan, eastward to the mountain ridge over ten li between."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "井渠之生自此始。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Well canal origin from this began.",
              "idiomatic": "The origin of well canals began from this."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "穿渠得龍骨，故名曰龍首渠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dig canal got dragon bone, therefore named Dragon Head Canal.",
              "idiomatic": "When digging the canal they got dragon bones; therefore it was named the Dragon Head Canal."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "作之十餘歲，渠頗通，猶未得其饒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Made it ten more years, canal rather connected, still not got its abundance.",
              "idiomatic": "They worked on it for over ten years; the canal was rather connected, but still had not obtained its abundance."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "自河決瓠子後二十餘歲，歲因以數不登，而梁楚之地尤甚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From Yellow River burst Hulu Zi after twenty more years, years therefore repeatedly not abundant, and Liang Chu lands especially severe.",
              "idiomatic": "Over twenty years after the Yellow River burst at Hulu Zi, the years therefore repeatedly had poor harvests, and the lands of Liang and Chu were especially severe."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "天子既封禪巡祭山川，其明年，旱，乾封少雨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven having feng shan toured sacrificed mountains rivers, its next year, drought, dry feng little rain.",
              "idiomatic": "The Son of Heaven having performed feng shan and toured sacrificing to mountains and rivers; the next year there was drought, the dry feng had little rain."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "天子乃使汲仁、郭昌發卒數萬人塞瓠子決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven then made Ji Ren, Guo Chang raise troops several ten thousand block Hulu Zi breach.",
              "idiomatic": "The Son of Heaven then sent Ji Ren and Guo Chang to raise several tens of thousands of troops to block the Hulu Zi breach."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "於是天子已用事萬里沙，則還自臨決河，沈白馬玉璧于河，令群臣從官自將軍已下皆負薪窴決河。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven having used affairs Wan Li Sha, then returned personally viewed breached river, sank white horse jade bi into river, ordered court officials attendants from generals below all carried firewood filled breached river.",
              "idiomatic": "Therefore the Son of Heaven, having used affairs at Wan Li Sha, then returned and personally viewed the breached river; sank white horses and jade bi into the river; ordered all court officials and attendants from generals below to carry firewood and fill the breached river."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "是時東郡燒草，以故薪柴少，而下淇園之竹以為楗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Dong Jun burned grass, because firewood few, and cut down Qi garden bamboo to make stakes.",
              "idiomatic": "At this time Dong Jun burned grass; because firewood was scarce, they cut down the bamboo from Qi garden to make stakes."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "天子既臨河決，悼功之不成，乃作歌曰：「瓠子決兮將柰何？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven having viewed river breach, lamented work not complete, then made song said: 'Hulu Zi breach ah what to do?'",
              "idiomatic": "The Son of Heaven having viewed the river breach and lamented that the work was not complete, then made a song saying: 'Hulu Zi breach, what shall be done?'"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "皓皓旰旰兮閭殫為河！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bright bright anxious anxious ah gate exhausted for river!",
              "idiomatic": "Bright and anxious, the gates exhausted for the river!"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "殫為河兮地不得寧，功無已時兮吾山平。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Exhausted for river ah earth not get peace, work no end time ah my mountains level.",
              "idiomatic": "Exhausted for the river, the earth finds no peace; the work has no end time, my mountains level."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "吾山平兮鉅野溢，魚沸郁兮柏冬日。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My mountains level ah Ju Ye overflow, fish boil depressed ah cypress winter day.",
              "idiomatic": "My mountains level, Ju Ye overflows; fish boil in depression like cypress in winter days."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "延道弛兮離常流，蛟龍騁兮方遠遊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Long road relaxed ah depart normal flow, flood dragons gallop ah just far travel.",
              "idiomatic": "Long roads relaxed, departing the normal flow; flood dragons gallop, just embarking on far travels."
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "歸舊川兮神哉沛，不封禪兮安知外！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Return old channel ah spirit ah full, not feng shan ah how know outer!",
              "idiomatic": "Return to the old channel, spirit fully present; not performing feng shan, how to know the outer!"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "為我謂河伯兮何不仁，泛濫不止兮愁吾人？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "For me tell River Earl ah why not benevolent, overflowing not stop ah worry my people?",
              "idiomatic": "For me tell the River Earl, why so unkind; overflowing without stop, troubling my people?"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "齧桑浮兮淮、泗滿，久不反兮水維緩。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gnaw mulberry float ah Huai, Si full, long not return ah water only slow.",
              "idiomatic": "Gnawing mulberry floats, Huai and Si full; long not returning, water only slow.'"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "一曰：「河湯湯兮激潺湲，北渡污兮浚流難。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "One said: 'River boiling boiling ah rush gurgling, north cross dirty ah dredge flow difficult.'",
              "idiomatic": "Another said: 'The river boils and rushes gurgling; north crossing the mire, dredging the flow is difficult.'"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "搴長茭兮沈美玉，河伯許兮薪不屬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pluck long reeds ah sink beautiful jade, River Earl promised ah firewood not continuous.",
              "idiomatic": "Pluck long reeds and sink beautiful jade; the River Earl promised, but firewood is not continuous.'"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "薪不屬兮衛人罪，燒蕭條兮噫乎何以御水！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Firewood not continuous ah Wei people crime, burn desolate ah sigh ah what with control water!",
              "idiomatic": "Firewood not continuous, the Wei people's crime; burn desolate, sigh, what to control the water with!'"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "穨林竹兮楗石菑，宣房塞兮萬福來。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bundle forest bamboo ah stake stone dike, Xuan Fang blocked ah ten thousand blessings come.",
              "idiomatic": "Bundle forest bamboo and stake stone dikes; Xuan Fang blocked, ten thousand blessings come.'"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "於是卒塞瓠子，筑宮其上，名曰宣房宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore finally blocked Hulu Zi, built palace on it, named Xuan Fang Palace.",
              "idiomatic": "Therefore they finally blocked Hulu Zi; built a palace on it, named Xuan Fang Palace."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "而道河北行二渠，復禹舊跡，而梁、楚之地復寧，無水災。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And led north Yellow River two canals, restored Yu old traces, and Liang, Chu lands again peaceful, no water disaster.",
              "idiomatic": "And led north along the Yellow River with two canals, restored Yu's old traces; and the lands of Liang and Chu again became peaceful, without water disasters."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "自是之後，用事者爭言水利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this after, those in power competed spoke water benefits.",
              "idiomatic": "From this time on, those in power competed to speak of water benefits."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "朔方、西河、河西、酒泉皆引河及川谷以溉田；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shuo Fang, Xi He, He Xi, Jiu Quan all led Yellow River and streams valleys to irrigate fields;",
              "idiomatic": "Shuo Fang, Xi He, He Xi, Jiu Quan all led the Yellow River and stream valleys to irrigate fields;"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "而關中輔渠、靈軹引堵水；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Guan Zhong Fu Canal, Ling Zhi led Du water;",
              "idiomatic": "And Guan Zhong's Fu Canal and Ling Zhi led Du water;"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "汝南、九江引淮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ru Nan, Jiu Jiang led Huai;",
              "idiomatic": "Ru Nan and Jiu Jiang led the Huai;"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "東海引鉅定；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dong Hai led Ju Ding;",
              "idiomatic": "Dong Hai led Ju Ding;"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "泰山下引汶水：皆穿渠為溉田，各萬餘頃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tai Shan below led Wen water: all dug canals for irrigating fields, each ten thousand more qing.",
              "idiomatic": "Below Tai Shan led Wen water: all dug canals for irrigating fields, each over ten thousand qing."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "佗小渠披山通道者，不可勝言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Other small canals split mountains opened roads ones, cannot all be spoken.",
              "idiomatic": "Other small canals that split mountains and opened roads cannot all be spoken of."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "然其著者在宣房。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet their famous ones in Xuan Fang.",
              "idiomatic": "Yet the most famous of them was in Xuan Fang."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "太史公曰：余南登廬山，觀禹疏九江，遂至于會稽太湟，上姑蘇，望五湖；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grand Historian said: I south ascended Lu Shan, viewed Yu dredged nine Jiang, then arrived at Hui Ji Tai Huang, ascended Gu Su, gazed five lakes;",
              "idiomatic": "The Grand Historian said: I south ascended Lu Shan, viewed how Yu dredged the nine Jiang, then arrived at Hui Ji Tai Huang; ascended Gu Su, gazed at the five lakes;"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "東闚洛汭、大邳，迎河，行淮、泗、濟、漯洛渠；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "East peeked Luo Rui, Da Pi, met Yellow River, traveled Huai, Si, Ji, Ta Luo canals;",
              "idiomatic": "East I peered at Luo Rui and Da Pi, met the Yellow River, traveled the Huai, Si, Ji, and Ta Luo canals;"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "西瞻蜀之岷山及離碓；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "West gazed Shu Min Shan and Li Dui;",
              "idiomatic": "West I gazed at Shu's Min Shan and Li Dui;"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "北自龍門至于朔方。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "North from Long Men to Shuo Fang.",
              "idiomatic": "North from Long Men to Shuo Fang."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "曰：甚哉，水之為利害也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Said: Extreme ah, water as benefit harm also!",
              "idiomatic": "He said: 'How extreme are water's benefits and harms!'"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "余從負薪塞宣房，悲瓠子之詩而作河渠書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I followed carried firewood blocked Xuan Fang, grieved Hulu Zi poem and made Yellow River Canals book.",
              "idiomatic": "I followed carrying firewood to block Xuan Fang; grieved by the Hulu Zi poem, I made the Yellow River Canals book."
            }
          ]
        }
      ]
    }
  ]
}