{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "030",
    "url": "https://chinesenotes.com/shiji/shiji030.html",
    "title": {
      "zh": "平準書",
      "en": "Equalization",
      "raw": "《平準書》 Equalization"
    },
    "sentenceCount": 286,
    "translatedCount": 286,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:58.820Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "漢興，接秦之獘，丈夫從軍旅，老弱轉糧馕，作業劇而財匱，自天子不能具鈞駟，而將相或乘牛車，齊民無藏蓋。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han rose, connected Qin exhaustion, men followed military campaigns, old weak transported grain food, work intense and wealth scarce, from Son of Heaven could not equip matched horses, and generals ministers or rode ox carts, common people no stored covers.",
              "idiomatic": "When Han rose, taking over Qin's exhaustion, men followed military campaigns while the old and weak transported grain and provisions; work was intense and wealth scarce; even the Son of Heaven could not equip matched teams of horses, and generals and ministers sometimes rode ox carts; common people had no stored goods."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "於是為秦錢重難用，更令民鑄錢，一黃金一斤，約法省禁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore because Qin money heavy difficult use, moreover ordered people cast money, one yellow gold one jin, regulated laws reduced prohibitions.",
              "idiomatic": "Therefore, because Qin money was heavy and difficult to use, they moreover ordered the people to cast money; one piece of yellow gold equaled one jin; regulated laws and reduced prohibitions."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "而不軌逐利之民，蓄積餘業以稽市物，物踴騰糶，米至石萬錢，馬一匹則百金。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And not following tracks pursuing profit people, accumulated surplus business to delay market goods, goods leaped soared sold, rice to shi ten thousand cash, horse one then hundred gold.",
              "idiomatic": "And lawless profit-seeking people accumulated surplus goods to delay market supplies; goods leaped and soared in price; rice reached ten thousand cash per shi, and a single horse was worth a hundred gold pieces."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "天下已平，高祖乃令賈人不得衣絲乘車，重租稅以困辱之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "World already pacified, Gao Zu then ordered merchants not wear silk ride carriages, heavy taxes to distress humiliate them.",
              "idiomatic": "The world already pacified, Gao Zu then ordered that merchants could not wear silk or ride carriages; he imposed heavy taxes to distress and humiliate them."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "孝惠、高后時，為天下初定，復弛商賈之律，然市井之子孫亦不得仕宦為吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xiao Hui, Gao Hou time, because world initially settled, again relaxed merchant laws, yet marketplace sons grandsons also not allowed serve as officials be clerks.",
              "idiomatic": "During Xiao Hui and Gao Hou's time, because the world was initially settled, they again relaxed the merchant laws; yet the sons and grandsons of marketplace people were also not allowed to serve as officials or clerks."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "量吏祿，度官用，以賦於民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Measured clerk salaries, estimated official expenses, to levy on people.",
              "idiomatic": "They measured clerk salaries and estimated official expenses, to levy them on the people."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "而山川園池市井租稅之入，自天子以至于封君湯沐邑，皆各為私奉養焉，不領於天下之經費。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And mountains rivers parks ponds marketplace tax incomes, from Son of Heaven down to sealed lords hot bath towns, all each for private support, not included in world regular expenses.",
              "idiomatic": "And the tax incomes from mountains, rivers, parks, ponds, and marketplaces, from the Son of Heaven down to the sealed lords' hot bath towns, all went to each for private support; they were not included in the world's regular expenses."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "漕轉山東粟，以給中都官，歲不過數十萬石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Transported transferred Shan Dong grain, to supply central capital officials, year not over several ten thousand shi.",
              "idiomatic": "They transported Shan Dong grain to supply the central capital officials; yearly it was not over several tens of thousands of shi."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "至孝文時，莢錢益多，輕，乃更鑄四銖錢，其文為「半兩」，令民縱得自鑄錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To Xiao Wen time, leather money increasingly many, light, then moreover cast four zhu money, its inscription 'half liang', ordered people freely could self cast money.",
              "idiomatic": "By Xiao Wen's time, leather money was increasingly plentiful but light in value; they then moreover cast four zhu coins, their inscription being 'half liang'; they ordered that people could freely cast money themselves."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "故吳諸侯也，以即山鑄錢，富埒天子，其後卒以叛逆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Wu feudal lord, by near mountain cast money, rich equal Son of Heaven, his after finally with rebellion.",
              "idiomatic": "Therefore the Wu feudal lord, by casting money near the mountains, became as rich as the Son of Heaven; afterward he finally rebelled."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "鄧通，大夫也，以鑄錢財過王者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Deng Tong, grand master, with casting money wealth exceeded kings.",
              "idiomatic": "Deng Tong, a grand master, with casting money his wealth exceeded that of kings."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "故吳、鄧氏錢布天下，而鑄錢之禁生焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Wu, Deng clan money spread world, and casting money prohibition born there.",
              "idiomatic": "Therefore Wu and Deng clan money spread throughout the world, and the prohibition on casting money was born from this."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "匈奴數侵盜北邊，屯戍者多，邊粟不足給食當食者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xiongnu frequently invaded robbed north border, garrisoned defended many, border grain insufficient supply food should eat ones.",
              "idiomatic": "The Xiongnu frequently invaded and robbed the northern border; those garrisoned and defending were many; border grain was insufficient to supply food to those who should eat."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "於是募民能輸及轉粟於邊者拜爵，爵得至大庶長。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore recruited people could transport and transfer grain to border ones granted nobility rank, rank could reach great commoner chief.",
              "idiomatic": "Therefore they recruited people who could transport and transfer grain to the border, granting them nobility ranks; the ranks could reach that of great commoner chief."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0015",
          "zh": "孝景時，上郡以西旱，亦復修賣爵令，而賤其價以招民；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xiao Jing time, Shang Jun west drought, also again repaired sell nobility rank command, and cheapened its price to attract people;",
              "idiomatic": "During Xiao Jing's time, west of Shang Jun there was drought; they also again repaired the sell nobility rank command, and cheapened its price to attract people;"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "及徒復作，得輸粟縣官以除罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And convict labor again worked, got transport grain county officials to remove crime.",
              "idiomatic": "And convict laborers again worked; they could transport grain to county officials to remove their crimes."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "益造苑馬以廣用，而宮室列觀輿馬益增修矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover made garden horses to broaden use, and palace rooms arranged towers carriages horses moreover increased repaired.",
              "idiomatic": "They moreover made garden horses to broaden their use, and palace rooms, arranged towers, carriages, and horses were moreover increased and repaired."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "至今上即位數歲，漢興七十餘年之閒，國家無事，非遇水旱之災，民則人給家足，都鄙廩庾皆滿，而府庫餘貨財。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To now emperor ascended throne several years, Han rise seventy more years between, nation no affairs, not encounter water drought disasters, people then person supplied house sufficient, cities towns granaries all full, and treasuries surplus goods wealth.",
              "idiomatic": "By the time the current emperor had ascended the throne for several years, within the seventy-plus years since Han's rise, the nation had no affairs except when encountering water or drought disasters; the people were then personally supplied and houses sufficient; cities and towns' granaries were all full; and the treasuries had surplus goods and wealth."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "京師之錢累巨萬，貫朽而不可校。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Capital money accumulated huge ten thousand, strings rotted and could not be counted.",
              "idiomatic": "The capital's money accumulated in huge tens of thousands; the strings rotted and could not be counted."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "太倉之粟陳陳相因，充溢露積於外，至腐敗不可食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great granary grain old old mutually followed, full overflowed exposed piled outside, to rotten could not be eaten.",
              "idiomatic": "The great granary's grain was old upon old, mutually following; it was full and overflowed, exposed and piled outside, to the point of rotting and being inedible."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "眾庶街巷有馬，阡陌之閒成群，而乘字牝者儐而不得聚會。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Masses streets alleys had horses, paths crossroads between formed groups, and riding marked mares guide and could not gather meet.",
              "idiomatic": "The masses in streets and alleys had horses; between the paths and crossroads they formed groups; and those riding marked mares were guided but could not gather and meet."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "守閭閻者食粱肉，為吏者長子孫，居官者以為姓號。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Guarded alley gates ate fine grain meat, served as clerks extended sons grandsons, resided as officials took as surname appellation.",
              "idiomatic": "Those guarding alley gates ate fine grain and meat; those serving as clerks extended their sons and grandsons; those residing as officials took it as surname and appellation."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "故人人自愛而重犯法，先行義而後絀恥辱焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore each person self loved and valued not violate law, first practiced righteousness then shrank from shame humiliation.",
              "idiomatic": "Therefore each person valued themselves and did not violate the law; they first practiced righteousness and then shrank from shame and humiliation."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "當此之時，網疏而民富，役財驕溢，或至兼并豪黨之徒，以武斷於鄉曲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When this time, net loose and people rich, corvee wealth arrogant overflowing, or to annexed merged powerful faction followers, with military decided in rural areas.",
              "idiomatic": "At this time, the net was loose and the people rich; corvee and wealth were arrogantly overflowing; some even became annexed and merged with powerful faction followers, using military decisions in rural areas."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "宗室有土公卿大夫以下，爭于奢侈，室廬輿服僭于上，無限度。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial clan had land dukes ministers grand masters below, contended in luxury, rooms houses carriages clothing usurped superiors, no limits.",
              "idiomatic": "The imperial clan who had land, from dukes and ministers down to grand masters, contended in luxury; their rooms, houses, carriages, and clothing usurped their superiors, with no limits."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "物盛而衰，固其變也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Things flourish then decline, certainly their change.",
              "idiomatic": "Things flourish then decline; certainly their change."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "自是之後，嚴助、朱買臣等招來東甌，事兩越，江淮之閒蕭然煩費矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this after, Yan Zhu, Zhu Mai Chen etc. summoned came Dong Ou, managed two Yue, Jiang Huai between desolate troublesome costly.",
              "idiomatic": "From this time on, Yan Zhu, Zhu Mai Chen and others summoned and brought Dong Ou; they managed the two Yue; between Jiang and Huai it became desolate, troublesome, and costly."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "唐蒙、司馬相如開路西南夷，鑿山通道千餘里，以廣巴蜀，巴蜀之民罷焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tang Meng, Sima Xiang Ru opened road southwest barbarians, chiseled mountain opened path thousand more li, to broaden Ba Shu, Ba Shu people exhausted there.",
              "idiomatic": "Tang Meng and Sima Xiang Ru opened roads to the southwest barbarians, chiseled mountains and opened paths over a thousand li, to broaden Ba and Shu; the people of Ba and Shu were exhausted by it."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "彭吳賈滅朝鮮，置滄海之郡，則燕齊之閒靡然發動。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Peng Wu Jia extinguished Joseon, established vast sea commandery, then Yan Qi between dissipated moved.",
              "idiomatic": "Peng Wu Jia extinguished Joseon and established the vast sea commandery; then between Yan and Qi it dissipated and moved."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "及王恢設謀馬邑，匈奴絕和親，侵擾北邊，兵連而不解，天下苦其勞，而干戈日滋。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Wang Hui set strategy Mai Yi, Xiongnu cut off peace marriage, invaded disturbed north border, wars connected not resolved, world suffered its labor, and weapons daily increased.",
              "idiomatic": "And Wang Hui set strategy at Mai Yi; the Xiongnu cut off peace marriage, invaded and disturbed the northern border; wars connected without resolution; the world suffered its labor; and weapons daily increased."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "行者齎，居者送，中外騷擾而相奉，百姓抏獘以巧法，財賂衰秏而不贍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Travelers carried provisions, residents sent, inside outside disturbed mutually supplied, hundred surnames constrained exhausted with skillful laws, wealth bribes declined expended not sufficient.",
              "idiomatic": "Travelers carried provisions; residents sent them; inside and outside were disturbed while mutually supplying; the hundred surnames were constrained and exhausted by skillful laws; wealth and bribes declined and were expended without sufficiency."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "入物者補官，出貨者除罪，選舉陵遲，廉恥相冒，武力進用，法嚴令具。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Entered goods ones filled offices, exported goods ones removed crime, selections declined, integrity shame mutually deceived, martial force advanced used, laws strict commands complete.",
              "idiomatic": "Those who entered goods filled offices; those who exported goods had their crimes removed; selections declined; integrity and shame mutually deceived each other; martial force was advanced and used; laws were strict and commands complete."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "興利之臣自此始也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Arouse benefit ministers from this began also.",
              "idiomatic": "Ministers who aroused benefits began from this time."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "其後漢將歲以數萬騎出擊胡，及車騎將軍衛青取匈奴河南地，筑朔方。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after Han generals yearly with several ten thousand cavalry went out attacked Hu, and chariot cavalry general Wei Qing took Xiongnu Yellow River south land, built Shuo Fang.",
              "idiomatic": "Afterward, Han generals yearly went out with several tens of thousands of cavalry to attack the Hu; and the chariot cavalry general Wei Qing took the Xiongnu's Yellow River south land and built Shuo Fang."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "當是時，漢通西南夷道，作者數萬人，千里負擔饋糧，率十餘鐘致一石，散幣於邛僰以集之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When this time, Han opened southwest barbarians road, workers several ten thousand, thousand li carried loads fed grain, rate ten more zhong delivered one shi, scattered coins at Qiong Bo to gather it.",
              "idiomatic": "At this time, Han opened the southwest barbarians' road; workers numbered several tens of thousands; they carried loads and fed grain over a thousand li; at the rate of ten-plus zhong to deliver one shi; they scattered coins at Qiong Bo to gather it."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "數歲道不通，蠻夷因以數攻，吏發兵誅之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Several years road not connected, barbarian barbarians therefore frequently attacked, clerks raised troops executed them.",
              "idiomatic": "For several years the road was not connected; the barbarian barbarians therefore frequently attacked; the clerks raised troops and executed them."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "悉巴蜀租賦不足以更之，乃募豪民田南夷，入粟縣官，而內受錢於都內。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "All Ba Shu rents taxes insufficient to change it, then recruited rich people farmed south barbarians, entered grain county officials, and internally received money at capital inside.",
              "idiomatic": "All of Ba and Shu's rents and taxes were insufficient to change it; they then recruited rich people to farm the south barbarians, entering grain with county officials, and internally receiving money within the capital."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "東至滄海之郡，人徒之費擬於南夷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "East to vast sea commandery, people troops expenses comparable to south barbarians.",
              "idiomatic": "East to the vast sea commandery, the expenses for people and troops were comparable to the south barbarians."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "又興十萬餘人筑衛朔方，轉漕甚遼遠，自山東咸被其勞，費數十百巨萬，府庫益虛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Again raised ten thousand more people built defended Shuo Fang, transported very far distant, from Shan Dong all suffered its labor, cost several ten hundred huge ten thousand, treasuries moreover empty.",
              "idiomatic": "Again they raised over ten thousand people to build and defend Shuo Fang; transport was very far distant; from Shan Dong all suffered its labor; the cost was several tens of hundreds of huge tens of thousands; the treasuries moreover became empty."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "乃募民能入奴婢得以終身復，為郎增秩，及入羊為郎，始於此。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then recruited people could enter slave women got lifetime exemption, became lang increased rank, and entered sheep became lang, began from this.",
              "idiomatic": "They then recruited people who could enter slaves and women to get lifetime exemption; became lang with increased rank; and entering sheep to become lang began from this."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "其後四年，而漢遣大將將六將軍，軍十餘萬，擊右賢王，獲首虜萬五千級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after four years, and Han sent great general led six generals, army ten more thousand, attacked right worthy king, obtained heads captives ten five thousand ranks.",
              "idiomatic": "Four years later, Han sent a great general leading six generals, with an army of over ten thousand, to attack the right worthy king; they obtained heads and captives of fifteen thousand ranks."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "明年，大將軍將六將軍仍再出擊胡，得首虜萬九千級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next year, great general led six generals still again went out attacked Hu, got heads captives ten nine thousand ranks.",
              "idiomatic": "The next year, the great general leading six generals still again went out to attack the Hu; they got heads and captives of nineteen thousand ranks."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "捕斬首虜之士受賜黃金二十餘萬斤，虜數萬人皆得厚賞，衣食仰給縣官；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Captured beheaded heads captives soldiers received rewarded yellow gold twenty more ten thousand jin, captives several ten thousand people all got thick reward, clothing food looked up supplied county officials;",
              "idiomatic": "The soldiers who captured and beheaded heads and captives received rewards of yellow gold of over two hundred ten thousand jin; the captives, several tens of thousands of people, all got thick rewards; their clothing and food were supplied by looking up to county officials;"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "而漢軍之士馬死者十餘萬，兵甲之財轉漕之費不與焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Han army soldiers horses dead ones ten more thousand, weapons armor wealth transported expenses not included there.",
              "idiomatic": "And the Han army's soldiers and horses that died numbered over ten thousand; the wealth of weapons and armor and transport expenses were not included there."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "於是大農陳藏錢經秏，賦稅既竭，猶不足以奉戰士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore great farmer Chen stored money already expended, taxes already exhausted, still insufficient to support warriors.",
              "idiomatic": "Therefore the great farmer Chen's stored money was already expended; taxes were already exhausted; still insufficient to support the warriors."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "有司言：「天子曰『朕聞五帝之教不相復而治，禹湯之法不同道而王，所由殊路，而建德一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Officials spoke: 'Son of Heaven said 'I heard five emperors teachings not repeated and governed, Yu Tang laws different ways and kinged, what from different roads, but established virtue one also.'",
              "idiomatic": "The officials spoke: 'The Son of Heaven said: \"I have heard that the Five Emperors' teachings did not repeat and yet governed; Yu and Tang's laws differed in way but they kinged; what they came from were different roads, but establishing virtue was one.\"'"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "北邊未安，朕甚悼之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "North border not peaceful, I very mourn it.",
              "idiomatic": "'The northern border is not yet peaceful; I very much mourn it.'"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "日者，大將軍攻匈奴，斬首虜萬九千級，留蹛無所食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Recently, great general attacked Xiongnu, beheaded heads captives ten nine thousand ranks, left captives nowhere eat.",
              "idiomatic": "'Recently, the great general attacked the Xiongnu, beheading heads and captives of nineteen thousand ranks; the remaining captives have nowhere to eat.'"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "議令民得買爵及贖禁錮免減罪』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Discuss ordered people could buy nobility rank and redeem prohibitions imprisonments exempt reduce crimes.'",
              "idiomatic": "'Discuss ordering that people can buy nobility ranks and redeem prohibitions, imprisonments, exemptions, and crime reductions.'"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "請置賞官，命曰武功爵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Request establish reward officials, named martial merit nobility ranks.",
              "idiomatic": "'Request to establish reward officials, named martial merit nobility ranks.'"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "級十七萬，凡直三十餘萬金。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ranks seventeen thousand, altogether worth thirty more ten thousand gold.",
              "idiomatic": "'Ranks: seventeen thousand; altogether worth over thirty ten thousand gold.'"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "諸買武功爵官首者試補吏，先除；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various buy martial merit nobility rank officials first ones tested filled clerks, first exempted;",
              "idiomatic": "'Those who buy martial merit nobility ranks and are first in office are tested to fill clerk positions, exempted first;'"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "千夫如五大夫；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thousand leader like five grand masters;",
              "idiomatic": "'Thousand leader like five grand masters;'"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "其有罪又減二等；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Their had crimes moreover reduced two grades;",
              "idiomatic": "'Those who have crimes moreover have them reduced two grades;'"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "爵得至樂卿：以顯軍功。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nobility rank could reach music minister: to display military merit.'",
              "idiomatic": "'Nobility ranks can reach music minister: to display military merit.'"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "軍功多用越等，大者封侯卿大夫，小者郎吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Military merits many used jumped grades, big ones sealed marquises ministers grand masters, small ones lang clerks.",
              "idiomatic": "Military merits were often used to jump grades; big ones were sealed as marquises, ministers, grand masters; small ones became lang and clerks."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "吏道雜而多端，則官職秏廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Clerk ways mixed and many branches, then official duties expended abolished.",
              "idiomatic": "Clerk ways were mixed and had many branches; then official duties were expended and abolished."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "自公孫弘以春秋之義繩臣下取漢相，張湯用唆文決理為廷尉，於是見知之法生，而廢格沮誹窮治之獄用矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From Gong Sun Hong with Spring Autumn righteousness bound ministers below took Han chancellor, Zhang Tang used cunning writings decided principles became court judge, therefore seen known laws born, and obstructed blocked discouraged slandered thorough investigated prisons used.",
              "idiomatic": "From Gong Sun Hong using Spring and Autumn righteousness to bind ministers below and take the Han chancellorship, and Zhang Tang using cunning writings to decide principles and become court judge; therefore the laws of seen and known were born, and the prisons of obstructing, blocking, discouraging, slandering, and thorough investigation were used."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "其明年，淮南、衡山、江都王謀反跡見，而公卿尋端治之，竟其黨與，而坐死者數萬人，長吏益慘急而法令明察。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, Huai Nan, Heng Shan, Jiang Du kings plotted rebellion traces seen, and dukes ministers sought beginnings governed them, exhausted their parties allies, and sat died ones several ten thousand people, senior clerks moreover cruel urgent and laws commands clear examined.",
              "idiomatic": "The next year, the kings of Huai Nan, Heng Shan, and Jiang Du had traces of plotting rebellion seen; the dukes and ministers sought beginnings and governed them; they exhausted their parties and allies; those who sat and died numbered several tens of thousands; senior clerks moreover became cruel and urgent while laws and commands were clearly examined."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "當是之時，招尊方正賢良文學之士，或至公卿大夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When this time, recruited honored upright worthy good literature scholars, or reached dukes ministers grand masters.",
              "idiomatic": "At this time, they recruited and honored upright, worthy, good literature scholars; some reached dukes, ministers, grand masters."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "公孫弘以漢相，布被，食不重味，為天下先。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gong Sun Hong became Han chancellor, cloth coverlet, ate not repeated flavors, was world first.",
              "idiomatic": "Gong Sun Hong became Han chancellor; cloth coverlet, ate not repeated flavors; was first in the world."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "然無益於俗，稍騖於功利矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet no benefit to customs, gradually raced to merit profit.",
              "idiomatic": "Yet no benefit to customs; gradually raced toward merit and profit."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "其明年，驃騎仍再出擊胡，獲首四萬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, super cavalry still again went out attacked Hu, obtained heads forty thousand.",
              "idiomatic": "The next year, the super cavalry still again went out to attack the Hu; obtained forty thousand heads."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "其秋，渾邪王率數萬之眾來降，於是漢發車二萬乘迎之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its autumn, Hun Ye king led several ten thousand crowd came surrendered, therefore Han sent carriages twenty thousand teams welcomed them.",
              "idiomatic": "That autumn, King Hun Ye led several tens of thousands of his crowd to come and surrender; therefore Han sent twenty thousand teams of carriages to welcome them."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "既至，受賞，賜及有功之士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Having arrived, received rewards, bestowed reached meritorious warriors.",
              "idiomatic": "Having arrived, they received rewards; bestowal reached the meritorious warriors."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "是歲費凡百餘巨萬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This year expenses altogether hundred more huge ten thousand.",
              "idiomatic": "This year's expenses altogether were over a hundred huge ten thousands."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "初，先是往十餘歲河決觀，梁楚之地固已數困，而緣河之郡隄塞河，輒決壞，費不可勝計。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially, before this ten more years Yellow River burst Guan, Liang Chu lands certainly already repeatedly distressed, and along Yellow River commanderies dikes blocked river, then burst broke, expenses could not be completely counted.",
              "idiomatic": "Initially, over ten years before this, the Yellow River burst at Guan; the lands of Liang and Chu certainly had already been repeatedly distressed; and the commanderies along the Yellow River built dikes to block the river, but they then burst and broke; the expenses could not be completely counted."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "其後番系欲省底柱之漕，穿汾、河渠以為溉田，作者數萬人；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after Fan Xi wanted reduce Di Zhu transport, dug Fen, Yellow River canal to irrigate fields, workers several ten thousand;",
              "idiomatic": "Afterward Fan Xi wanted to reduce Di Zhu's transport; dug a Fen-Yellow River canal to irrigate fields; workers numbered several tens of thousands;"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "鄭當時為渭漕渠回遠，鑿直渠自長安至華陰，作者數萬人；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zheng Dang Shi because Wei transport canal circuitous far, chiseled straight canal from Chang An to Hua Yin, workers several ten thousand;",
              "idiomatic": "Zheng Dang Shi, because the Wei transport canal was circuitous and far, chiseled a straight canal from Chang An to Hua Yin; workers numbered several tens of thousands;"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "朔方亦穿渠，作者數萬人：各歷二三期，功未就，費亦各巨萬十數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shuo Fang also dug canal, workers several ten thousand: each experienced two three periods, merit not completed, expenses also each huge ten thousand several.",
              "idiomatic": "Shuo Fang also dug canals; workers numbered several tens of thousands: each experienced two or three periods; the merit was not completed; expenses were also each several huge ten thousands."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "天子為伐胡，盛養馬，馬之來食長安者數萬匹，卒牽掌者關中不足，乃調旁近郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven for attacked Hu, greatly raised horses, horses that came ate Chang An several ten thousand horses, soldiers led cared ones Guan Zhong insufficient, then transferred nearby commanderies.",
              "idiomatic": "The Son of Heaven, for attacking the Hu, greatly raised horses; horses that came to eat at Chang An numbered several tens of thousands; soldiers to lead and care for them were insufficient in Guan Zhong; they then transferred nearby commanderies."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "而胡降者皆衣食縣官，縣官不給，天子乃損膳，解乘輿駟，出御府禁藏以贍之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Hu surrendered ones all clothed fed county officials, county officials not supplied, Son of Heaven then reduced meals, released carriage teams, took out imperial storehouse forbidden stores to support them.",
              "idiomatic": "And the Hu who surrendered were all clothed and fed by county officials; county officials could not supply them; the Son of Heaven then reduced his meals, released his carriage teams, and took out imperial storehouse forbidden stores to support them."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "其明年，山東被水菑，民多饑乏，於是天子遣使者虛郡國倉廥以振貧民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, Shan Dong suffered water disaster, people many hungry lacking, therefore Son of Heaven sent messengers emptied commandery kingdom granaries to relieve poor people.",
              "idiomatic": "The next year, Shan Dong suffered water disasters; people were many hungry and lacking; therefore the Son of Heaven sent messengers to empty commandery and kingdom granaries to relieve the poor people."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "猶不足，又募豪富人相貸假。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Still insufficient, moreover recruited rich wealthy people mutually lent borrowed.",
              "idiomatic": "Still insufficient; moreover recruited rich and wealthy people to mutually lend and borrow."
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "尚不能相救，乃徙貧民於關以西，及充朔方以南新秦中，七十餘萬口，衣食皆仰給縣官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Still could not mutually save, then moved poor people to pass west, and filled Shuo Fang south new Qin middle, seventy more ten thousand mouths, clothing food all looked up supplied county officials.",
              "idiomatic": "Still could not mutually save; then moved poor people west of the pass, and filled south of Shuo Fang in the new Qin middle; over seventy ten thousand mouths; clothing and food all looked up to be supplied by county officials."
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "數歲，假予產業，使者分部護之，冠蓋相望。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Several years, lent gave properties, messengers divided sections protected them, official hats canopies mutually gazed.",
              "idiomatic": "After several years, they lent and gave properties; messengers divided sections and protected them; official hats and canopies were mutually in view."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "其費以億計，不可勝數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its expenses counted in hundred million, could not be completely counted.",
              "idiomatic": "Its expenses were counted in the hundred millions; could not be completely counted."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "於是縣官大空。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore county officials greatly empty.",
              "idiomatic": "Therefore the county officials were greatly emptied."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "而富商大賈或蹛財役貧，轉轂百數，廢居居邑，封君皆低首仰給。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And rich merchants great traders or amassed wealth employed poor, rotated axles hundred counted, abandoned residences resided towns, sealed lords all lowered heads looked up supplied.",
              "idiomatic": "And rich merchants and great traders amassed wealth and employed the poor; rotated axles in the hundreds; abandoned their residences and resided in towns; the sealed lords all lowered their heads and looked up to be supplied."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "冶鑄煮鹽，財或累萬金，而不佐國家之急，黎民重困。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Smelted cast boiled salt, wealth or accumulated ten thousand gold, but not assisted nation urgent, common people heavily distressed.",
              "idiomatic": "Smelted and cast, boiled salt; wealth accumulated to ten thousand gold; but did not assist the nation's urgencies; the common people were heavily distressed."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "於是天子與公卿議，更錢造幣以贍用，而摧浮淫并兼之徒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven with dukes ministers discussed, changed money made currency to support use, and crushed floating lewd annexed merged followers.",
              "idiomatic": "Therefore the Son of Heaven discussed with the dukes and ministers; changed money and made currency to support use; and crushed the floating lewd annexed and merged followers."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "是時禁苑有白鹿而少府多銀錫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time forbidden park had white deer and Shao Fu much silver tin.",
              "idiomatic": "At this time the forbidden park had white deer; and the Shao Fu had much silver and tin."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "自孝文更造四銖錢，至是歲四十餘年，從建元以來，用少，縣官往往即多銅山而鑄錢，民亦閒盜鑄錢，不可勝數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From Xiao Wen moreover made four zhu money, to this year forty more years, from Jian Yuan since, use few, county officials often took many copper mountains and cast money, people also secretly stole cast money, could not be completely counted.",
              "idiomatic": "From when Xiao Wen moreover made four zhu coins, to this year over forty years; since Jian Yuan, use was few; county officials often took many copper mountains and cast money; people also secretly stole and cast money; could not be completely counted."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "錢益多而輕，物益少而貴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Money moreover many and light, goods moreover few and expensive.",
              "idiomatic": "Money became moreover many and light; goods became moreover few and expensive."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "有司言曰：「古者皮幣，諸侯以聘享。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Officials spoke: 'Ancient ones leather currency, feudal lords with presented enjoyed.'",
              "idiomatic": "The officials spoke: 'In ancient times leather currency; feudal lords used it for presenting and enjoying.'"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "金有三等，黃金為上，白金為中，赤金為下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gold had three grades, yellow gold as upper, white gold as middle, red gold as lower.",
              "idiomatic": "Gold had three grades: yellow gold as upper, white gold as middle, red gold as lower."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "今半兩錢法重四銖，而姦或盜摩錢裏取鋊，錢益輕薄而物貴，則遠方用幣煩費不省。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now half liang money method heavy four zhu, but evil ones or stole ground money inside took filings, money moreover light thin and goods expensive, then distant places used currency troublesome costly not economical.'",
              "idiomatic": "Now the half liang money method is heavy four zhu, but evil ones steal and grind the money inside to take filings; money becomes moreover light and thin while goods are expensive; then distant places using currency is troublesome, costly, and not economical.'"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "乃以白鹿皮方尺，緣以藻繢，為皮幣，直四十萬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then with white deer skin square foot, edged with algae embroidered, made leather currency, worth forty ten thousand.",
              "idiomatic": "They then used white deer skin of one square foot, edged with algae embroidery, to make leather currency worth forty ten thousand."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "王侯宗室朝覲聘享，必以皮幣薦璧，然後得行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Kings marquises imperial clan morning audiences presented enjoyed, must with leather currency presented jade bi, then could proceed.",
              "idiomatic": "Kings, marquises, and imperial clan for morning audiences, presenting and enjoying, must present leather currency and jade bi; only then could they proceed."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "又造銀錫為白金。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover made silver tin as white gold.",
              "idiomatic": "They moreover made silver and tin as white gold."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "以為天用莫如龍，地用莫如馬，人用莫如龜，故白金三品：其一曰重八兩，圜之，其文龍，名曰「白選」，直三千；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Considered heaven use nothing like dragon, earth use nothing like horse, person use nothing like turtle, therefore white gold three kinds: its one said heavy eight liang, rounded it, its inscription dragon, named 'white select', worth three thousand;",
              "idiomatic": "They considered that for heaven's use nothing was like the dragon; for earth's use nothing was like the horse; for person's use nothing was like the turtle; therefore white gold had three kinds: the first was heavy eight liang, rounded it, its inscription dragon, named 'white select', worth three thousand;"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "二曰以重差小，方之，其文馬，直五百；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Two said with weight difference small, squared it, its inscription horse, worth five hundred;",
              "idiomatic": "The second was with weight difference smaller, squared it, its inscription horse, worth five hundred;"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "三曰復小，撱之，其文龜，直三百。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Three said again small, oval it, its inscription turtle, worth three hundred.",
              "idiomatic": "The third was again smaller, ovaled it, its inscription turtle, worth three hundred."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "令縣官銷半兩錢，更鑄三銖錢，文如其重。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ordered county officials melted half liang money, moreover cast three zhu money, inscription like its weight.",
              "idiomatic": "They ordered county officials to melt half liang coins and moreover cast three zhu coins, inscription like their weight."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "盜鑄諸金錢罪皆死，而吏民之盜鑄白金者不可勝數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Stole cast various gold money crimes all death, but clerks people stole cast white gold ones could not be completely counted.",
              "idiomatic": "Stealing and casting various gold monies carried the death penalty; but clerks and people who stole and cast white gold could not be completely counted."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0096",
          "zh": "於是以東郭咸陽、孔僅為大農丞，領鹽鐵事；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore with Dong Guo Xian Yang, Kong Jin as Great Farmer Assistant, led salt iron affairs;",
              "idiomatic": "Therefore they appointed Dong Guo Xian Yang and Kong Jin as Great Farmer Assistants, leading salt and iron affairs;"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "桑弘羊以計算用事，侍中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sang Hong Yang with calculations handled affairs, Palace Attendant.",
              "idiomatic": "Sang Hong Yang, with calculations, handled affairs as Palace Attendant."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "咸陽，齊之大煮鹽，孔僅，南陽大冶，皆致生累千金，故鄭當時進言之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xian Yang, Qi great boiled salt, Kong Jin, Nan Yang great smelter, all brought living accumulated thousand gold, therefore Zheng Dang Shi advanced spoke them.",
              "idiomatic": "Xian Yang was Qi's great salt boiler; Kong Jin was Nan Yang's great smelter; all brought living and accumulated thousand gold; therefore Zheng Dang Shi advanced and spoke of them."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "弘羊，雒陽賈人子，以心計，年十三侍中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hong Yang, Luo Yang merchant son, with mental calculations, year thirteen Palace Attendant.",
              "idiomatic": "Hong Yang was the son of a Luo Yang merchant; with mental calculations, at age thirteen became Palace Attendant."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "故三人言利事析秋豪矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore three people spoke profit affairs analyzed autumn down.",
              "idiomatic": "Therefore the three people spoke of profit affairs and analyzed down to the finest autumn hair."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "法既益嚴，吏多廢免。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Laws already moreover strict, clerks many abolished exempted.",
              "idiomatic": "The laws having become moreover strict, many clerks were abolished and exempted."
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "兵革數動，民多買復及五大夫，徵發之士益鮮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Weapons armor frequently moved, people many bought exemption and five grand masters, conscripted soldiers moreover few.",
              "idiomatic": "Weapons and armor frequently moved; people many bought exemption and five grand master ranks; conscripted soldiers became moreover few."
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "於是除千夫五大夫為吏，不欲者出馬；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore exempted thousand leaders five grand masters served as clerks, not wanting ones gave horses;",
              "idiomatic": "Therefore they exempted thousand leaders and five grand masters to serve as clerks; those not wanting gave horses;"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "故吏皆（通）適令伐棘上林，作昆明池。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore old clerks all universally ordered cut thorns Shang Lin, made Kunming Pool.",
              "idiomatic": "Therefore all old clerks were universally ordered to cut thorns in Shang Lin and make Kunming Pool."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0105",
          "zh": "其明年，大將軍、驃騎大出擊胡，得首虜八九萬級，賞賜五十萬金，漢軍馬死者十餘萬匹，轉漕車甲之費不與焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, great general, super cavalry greatly went out attacked Hu, got heads captives eighty nine thousand ranks, rewarded bestowed fifty ten thousand gold, Han army horses dead ones ten more ten thousand horses, transported ferried chariots armor expenses not included there.",
              "idiomatic": "The next year, the great general and super cavalry greatly went out to attack the Hu; got heads and captives of eighty-nine thousand ranks; rewards bestowed fifty ten thousand gold; Han army horses that died numbered over ten ten thousand horses; transported and ferried chariot and armor expenses were not included there."
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "是時財匱，戰士頗不得祿矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time wealth scarce, warriors rather not got salary.",
              "idiomatic": "At this time wealth was scarce; warriors rather did not get their salaries."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "有司言三銖錢輕，易姦詐，乃更請諸郡國鑄五銖錢，周郭其下，令不可磨取鋊焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Officials spoke three zhu money light, easy evil deception, then moreover requested various commanderies kingdoms cast five zhu money, surrounded protected its bottom, ordered could not grind take filings there.",
              "idiomatic": "The officials spoke that three zhu coins were light and easy for evil deception; they then moreover requested various commanderies and kingdoms to cast five zhu coins, surrounded and protected their bottoms, ordered that filings could not be ground and taken from there."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "大農上鹽鐵丞孔僅、咸陽言：「山海，天地之藏也，皆宜屬少府，陛下不私，以屬大農佐賦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great Farmer submitted salt iron assistant Kong Jin, Xian Yang spoke: 'Mountains seas, heaven earth stores also, all should belong Shao Fu, Your Majesty not private, to belong Great Farmer assist taxes.'",
              "idiomatic": "The Great Farmer submitted salt and iron assistants Kong Jin and Xian Yang who spoke: 'Mountains and seas are heaven and earth's stores; all should belong to the Shao Fu; Your Majesty does not take privately, so belongs to the Great Farmer to assist taxes.'"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "願募民自給費，因官器作煮鹽，官與牢盆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wish recruit people self supply expenses, using official tools make boil salt, officials give iron pans.",
              "idiomatic": "We wish to recruit people to supply their own expenses, using official tools to make and boil salt; officials will give iron pans."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "浮食奇民欲擅管山海之貨，以致富羨，役利細民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Floating eating strange people wish monopolize control mountains seas goods, to become rich abundant, employ profit small people.",
              "idiomatic": "Floating and eating strange people wish to monopolize and control the goods of mountains and seas, to become rich and abundant, employing and profiting from small people."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "其沮事之議，不可勝聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Their obstructed affairs discussions, could not be completely heard.",
              "idiomatic": "Their discussions obstructing affairs could not be completely heard."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "敢私鑄鐵器煮鹽者，釱左趾，沒入其器物。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dare privately cast iron tools boil salt ones, branded left toe, confiscated their tools goods.",
              "idiomatic": "Those who dare privately cast iron tools and boil salt will be branded on the left toe; their tools and goods will be confiscated."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "郡不出鐵者，置小鐵官，便屬在所縣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Commanderies not produce iron ones, establish small iron officials, conveniently belong local counties.",
              "idiomatic": "For commanderies that do not produce iron, establish small iron officials; conveniently they will belong to the local counties.'"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "使孔僅、東郭咸陽乘傳舉行天下鹽鐵，作官府，除故鹽鐵家富者為吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Made Kong Jin, Dong Guo Xian Yang ride post carriages toured world salt iron, established official offices, removed former salt iron family rich ones served as clerks.",
              "idiomatic": "They made Kong Jin and Dong Guo Xian Yang ride post carriages and tour the world's salt and iron; established official offices; removed former salt and iron family rich ones to serve as clerks."
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "吏道益雜，不選，而多賈人矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Clerk ways moreover mixed, not selected, and many merchants.",
              "idiomatic": "Clerk ways became moreover mixed; not selected; and many were merchants."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "商賈以幣之變，多積貨逐利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Merchants with currency changes, many accumulated goods pursued profit.",
              "idiomatic": "Merchants, with currency changes, many accumulated goods and pursued profit."
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "於是公卿言：「郡國頗被菑害，貧民無產業者，募徙廣饒之地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore dukes ministers spoke: 'Commanderies kingdoms rather suffered disasters, poor people no property ones, recruit move broad fertile lands.'",
              "idiomatic": "Therefore the dukes and ministers spoke: 'Commanderies and kingdoms rather suffer disasters; poor people without property; recruit and move them to broad and fertile lands.'"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "陛下損膳省用，出禁錢以振元元，寬貸賦，而民不齊出於南畝，商賈滋眾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty reduced meals economized use, took out forbidden money to relieve common people, leniently lent taxes, but people not uniformly went out to south fields, merchants increased many.",
              "idiomatic": "'Your Majesty reduced meals and economized use; took out forbidden money to relieve the common people; leniently lent taxes; but people do not uniformly go out to the south fields; merchants have increased in numbers.'"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "貧者畜積無有，皆仰縣官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Poor ones stored accumulated none had, all looked up county officials.",
              "idiomatic": "'Poor ones have no stored accumulations; all look up to county officials.'"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "異時算軺車賈人緡錢皆有差，請算如故。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Different times taxed light carriages merchants string money all had differences, request tax as before.",
              "idiomatic": "'In different times, taxing light carriages and merchants' string money all had differences; request to tax as before.'"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "諸賈人末作貰貸賣買，居邑稽諸物，及商以取利者，雖無市籍，各以其物自占，率緡錢二千而一算。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various merchants end business borrowed lent bought sold, resided towns delayed various goods, and merchants to take profit ones, although no market registration, each with their goods self registered, rate string money two thousand and one tax.",
              "idiomatic": "Various merchants' end businesses of borrowing, lending, buying, and selling; residing in towns delaying various goods; and merchants who take profit; although without market registration, each with their goods self-registered; rate of two thousand string money and one tax."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "諸作有租及鑄，率緡錢四千一算。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various works had rent and cast, rate string money four thousand one tax.",
              "idiomatic": "Various works that had rent and casting; rate of four thousand string money and one tax."
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "非吏比者三老、北邊騎士，軺車以一算；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Not clerk rank ones three elders, north border cavalry, light carriages with one tax;",
              "idiomatic": "Those not of clerk rank: three elders, north border cavalry; light carriages with one tax;"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "商賈人軺車二算；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Merchant people light carriages two taxes;",
              "idiomatic": "Merchant people's light carriages two taxes;"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "船五丈以上一算。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Boats five zhang above one tax.",
              "idiomatic": "Boats five zhang and above one tax."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "匿不自占，占不悉，戍邊一歲，沒入緡錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Concealed not self registered, registered not complete, garrisoned border one year, confiscated string money.",
              "idiomatic": "Those who concealed and did not self-register, or registered incompletely; garrisoned the border for one year; string money confiscated."
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "有能告者，以其半畀之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Had could report ones, with their half gave them.",
              "idiomatic": "Those who could report it; gave them half of it."
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "賈人有市籍者，及其家屬，皆無得籍名田，以便農。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Merchants had market registration ones, and their family dependents, all not got registered named fields, to facilitate farming.",
              "idiomatic": "Merchants who had market registration, and their family dependents; all could not get registered named fields; to facilitate farming."
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "敢犯令，沒入田僮。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dare violate command, confiscated fields servants.",
              "idiomatic": "'Those who dare violate the command; fields and servants confiscated.'"
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0131",
          "zh": "天子乃思卜式之言，召拜式為中郎，爵左庶長，賜田十頃，布告天下，使明知之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven then thought Bu Shi words, summoned appointed Shi as Palace Attendant, nobility rank left commoner chief, granted fields ten qing, announced world, made clear know it.",
              "idiomatic": "The Son of Heaven then thought of Bu Shi's words; summoned and appointed Shi as Palace Attendant; nobility rank of left commoner chief; granted ten qing of fields; announced to the world; made it clearly known."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0132",
          "zh": "初，卜式者，河南人也，以田畜為事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially, Bu Shi was, He Nan person also, with farming livestock as affairs.",
              "idiomatic": "Initially, Bu Shi was a He Nan person; he took farming and livestock as his affairs."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "親死，式有少弟，弟壯，式脫身出分，獨取畜羊百餘，田宅財物盡予弟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Parents died, Shi had young brother, brother grew up, Shi separated body out divided, alone took livestock sheep hundred more, fields houses wealth goods all gave brother.",
              "idiomatic": "When his parents died, Shi had a young brother; when the brother grew up, Shi separated and went out to divide the property; he alone took over a hundred livestock sheep; gave all the fields, houses, wealth, and goods to his brother."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "式入山牧十餘歲，羊致千餘頭，買田宅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi entered mountain pastured ten more years, sheep brought thousand more heads, bought fields houses.",
              "idiomatic": "Shi entered the mountains to pasture for over ten years; sheep brought over a thousand heads; bought fields and houses."
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "而其弟盡破其業，式輒復分予弟者數矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And his brother completely broke his business, Shi then again divided gave brother ones several times.",
              "idiomatic": "And his brother completely broke the business; Shi then again divided and gave to his brother several times."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "是時漢方數使將擊匈奴，卜式上書，願輸家之半縣官助邊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Han just frequently sent generals attacked Xiongnu, Bu Shi memorialed, wished transport family half county officials assist border.",
              "idiomatic": "At this time Han was just frequently sending generals to attack the Xiongnu; Bu Shi memorialed; wished to transport half his family's wealth to county officials to assist the border."
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "天子使使問式：「欲官乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven made messenger asked Shi: 'Want office?'",
              "idiomatic": "The Son of Heaven sent a messenger to ask Shi: 'Do you want an official position?'"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "式曰：「臣少牧，不習仕宦，不願也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi said: 'Minister young pastured, not accustomed official service, not wish also.'",
              "idiomatic": "Shi said: 'I have pastured since young; not accustomed to official service; do not wish it.'"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "使問曰：「家豈有冤，欲言事乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Messenger asked: 'Family perhaps has grievance, want speak affairs?'",
              "idiomatic": "The messenger asked: 'Does your family perhaps have grievances? Do you want to speak of affairs?'"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "式曰：「臣生與人無分爭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi said: 'Minister life with people no divided contended.'",
              "idiomatic": "Shi said: 'In my life I have had no divided contentions with people.'"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "式邑人貧者貸之，不善者教順之，所居人皆從式，式何故見冤於人！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi town people poor ones lent them, not good ones taught submit them, resided people all followed Shi, Shi why see grievance from people!",
              "idiomatic": "The people of Shi's town who were poor I lent to; those not good I taught to submit; the people where I resided all followed Shi; why would Shi see grievances from people!"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "無所欲言也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nothing wished speak also.",
              "idiomatic": "There is nothing I wish to speak of.'"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "使者曰：「茍如此，子何欲而然？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Messenger said: 'If like this, son what want and thus?'",
              "idiomatic": "The messenger said: 'If this is so, what do you want and why do this?'"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "式曰：「天子誅匈奴，愚以為賢者宜死節於邊，有財者宜輸委，如此而匈奴可滅也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi said: 'Son of Heaven punish Xiongnu, foolish thought worthy ones should die loyalty at border, had wealth ones should transport contribute, like this and Xiongnu can extinguish also.'",
              "idiomatic": "Shi said: 'The Son of Heaven punishes the Xiongnu; I foolishly think that worthy ones should die with loyalty at the border; those with wealth should transport and contribute; like this the Xiongnu can be extinguished.'"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "使者具其言入以聞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Messenger complete his words entered to report.",
              "idiomatic": "The messenger took his complete words and entered to report them."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "天子以語丞相弘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven with spoke Chancellor Hong.",
              "idiomatic": "The Son of Heaven spoke of this to Chancellor Hong."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "弘曰：「此非人情。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hong said: 'This not human feelings.'",
              "idiomatic": "Hong said: 'This is not human feeling.'"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "不軌之臣，不可以為化而亂法，願陛下勿許。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Not following track ministers, cannot for transformation and disorder laws, wish Your Majesty not permit.",
              "idiomatic": "Ministers who do not follow the track cannot be allowed to transform and disorder the laws; I wish Your Majesty not to permit it.'"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "於是上久不報式，數歲，乃罷式。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore emperor long not replied Shi, several years, then dismissed Shi.",
              "idiomatic": "Therefore the emperor for a long time did not reply to Shi; after several years, he then dismissed Shi."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "式歸，復田牧。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi returned, again farmed pastured.",
              "idiomatic": "Shi returned and again farmed and pastured."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "歲餘，會軍數出，渾邪王等降，縣官費眾，倉府空。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Year more, met army frequently went out, Hun Ye king etc. surrendered, county officials expenses many, granaries treasuries empty.",
              "idiomatic": "After more than a year, meeting that the army frequently went out, King Hun Ye and others surrendered; county officials' expenses were many; granaries and treasuries empty."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "其明年，貧民大徙，皆仰給縣官，無以盡贍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, poor people greatly moved, all looked up supplied county officials, no with completely support.",
              "idiomatic": "The next year, poor people greatly migrated; all looked up to be supplied by county officials; there was no way to completely support them."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "卜式持錢二十萬予河南守，以給徙民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bu Shi held money twenty ten thousand gave He Nan governor, to supply moved people.",
              "idiomatic": "Bu Shi held two hundred ten thousand in money and gave it to the He Nan governor, to supply the migrated people."
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "河南上富人助貧人者籍，天子見卜式名，識之，曰「是固前而欲輸其家半助邊」，乃賜式外繇四百人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He Nan submitted rich people helped poor people ones register, Son of Heaven saw Bu Shi name, recognized it, said 'this certainly before wanted transport his family half assist border', then granted Shi outer labor four hundred people.",
              "idiomatic": "He Nan submitted a register of rich people who helped poor people; the Son of Heaven saw Bu Shi's name and recognized it, saying 'This is certainly the one who before wanted to transport half his family wealth to assist the border'; he then granted Shi four hundred people for outer labor."
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "式又盡復予縣官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi moreover completely again gave county officials.",
              "idiomatic": "Shi moreover completely again gave to county officials."
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "是時富豪皆爭匿財，唯式尤欲輸之助費。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time rich powerful all contended hid wealth, only Shi especially wanted transport it assist expenses.",
              "idiomatic": "At this time the rich and powerful all contended to hide their wealth; only Shi especially wanted to transport it to assist expenses."
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "天子於是以式終長者，故尊顯以風百姓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven therefore with Shi as worthy elder, therefore honored displayed to influence hundred surnames.",
              "idiomatic": "The Son of Heaven therefore took Shi as a worthy elder in the end; therefore honored and displayed him to influence the hundred surnames."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0158",
          "zh": "初，式不願為郎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially, Shi not wished be lang.",
              "idiomatic": "Initially, Shi did not wish to be a lang."
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "上曰：「吾有羊上林中，欲令子牧之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'I have sheep Shang Lin middle, want order son pasture them.'",
              "idiomatic": "The emperor said: 'I have sheep in Shang Lin; I want to order you to pasture them.'"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "式乃拜為郎，布衣屩而牧羊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi then appointed lang, cloth clothes sandals and pastured sheep.",
              "idiomatic": "Shi was then appointed as lang; in cloth clothes and sandals he pastured sheep."
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "歲餘，羊肥息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Year more, sheep fat increased.",
              "idiomatic": "After more than a year, the sheep were fat and had increased."
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "上過見其羊，善之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor passed saw his sheep, good them.",
              "idiomatic": "The emperor passed by and saw his sheep; he considered them good."
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "式曰：「非獨羊也，治民亦猶是也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi said: 'Not only sheep also, govern people also like this also.'",
              "idiomatic": "Shi said: 'It is not only sheep; governing people is also like this.'"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "以時起居；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "By time rise reside;",
              "idiomatic": "Rise and reside according to the time;"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "惡者輒斥去，毋令敗群。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bad ones then expelled go, not let ruin flock.",
              "idiomatic": "The bad ones are then expelled; do not let them ruin the flock.'"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "上以式為奇，拜為緱氏令試之，緱氏便之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor considered Shi strange, appointed Gou Shi magistrate tested him, Gou Shi convenient him.",
              "idiomatic": "The emperor considered Shi strange; appointed him as Gou Shi magistrate to test him; Gou Shi found him convenient."
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "遷為成皋令，將漕最。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moved appointed Cheng Gao magistrate, led transport best.",
              "idiomatic": "He was moved and appointed as Cheng Gao magistrate; he led transport as the best."
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "上以為式樸忠，拜為齊王太傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor considered Shi simple loyal, appointed Qi king grand tutor.",
              "idiomatic": "The emperor considered Shi simple and loyal; appointed him as Qi king's grand tutor."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0169",
          "zh": "而孔僅之使天下鑄作器，三年中拜為大農，列於九卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Kong Jin made world cast make tools, three years middle appointed great farmer, ranked among nine ministers.",
              "idiomatic": "And Kong Jin made the world cast and make tools; within three years he was appointed great farmer, ranked among the nine ministers."
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "而桑弘羊為大農丞，筦諸會計事，稍稍置均輸以通貨物矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Sang Hong Yang became great farmer assistant, managed various accounting affairs, gradually established equal transport to circulate goods.",
              "idiomatic": "And Sang Hong Yang became great farmer assistant; managed various accounting affairs; gradually established equal transport to circulate goods."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0171",
          "zh": "始令吏得入穀補官，郎至六百石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Began ordered clerks could enter grain supplement offices, lang to six hundred shi.",
              "idiomatic": "Began ordering that clerks could enter grain to supplement offices; lang up to six hundred shi."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0172",
          "zh": "自造白金五銖錢後五歲，赦吏民之坐盜鑄金錢死者數十萬人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From made white gold five zhu money after five years, pardoned clerks people sat stole cast gold money died ones several ten thousand people.",
              "idiomatic": "Five years after making white gold five zhu coins, pardoned clerks and people who sat with the death penalty for stealing and casting gold money; several tens of thousands of people."
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "其不發覺相殺者，不可勝計。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Their not discovered mutually killed ones, could not be completely counted.",
              "idiomatic": "Those who were not discovered and mutually killed could not be completely counted."
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "赦自出者百餘萬人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pardoned self came out ones hundred more ten thousand people.",
              "idiomatic": "Those who pardoned themselves by coming out: over a hundred ten thousand people."
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "然不能半自出，天下大抵無慮皆鑄金錢矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet could not half self came out, world generally without worry all cast gold money.",
              "idiomatic": "Yet could not even half come out themselves; the world generally without worry all cast gold money."
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "犯者眾，吏不能盡誅取，於是遣博士褚大、徐偃等分曹循行郡國，舉兼并之徒守相為（吏）［利］者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Violators many, clerks could not completely execute take, therefore sent erudites Chu Da, Xu Yan etc. divided sections followed toured commanderies kingdoms, raised annexed merged followers governors ministers for (clerks) [benefit] ones.",
              "idiomatic": "Violators were many; clerks could not completely execute and take them; therefore sent erudites Chu Da, Xu Yan and others divided into sections following and touring commanderies and kingdoms, raising the annexed and merged followers and governors and ministers who acted for (clerks) [benefit]."
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "而御史大夫張湯方隆貴用事，減宣、杜周等為中丞，義縱、尹齊、王溫舒等用慘急刻深為九卿，而直指夏蘭之屬始出矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And imperial censor Zhang Tang just exalted noble used affairs, appointed Xuan, Du Zhou etc. as assistant censors, Yi Zong, Yin Qi, Wang Wen Shu etc. used cruel urgent harsh deep as nine ministers, and direct finger Xia Lan kind began came out.",
              "idiomatic": "And imperial censor Zhang Tang was just exalted and noble, using affairs; appointed Xuan, Du Zhou and others as assistant censors; Yi Zong, Yin Qi, Wang Wen Shu and others used cruel, urgent, harsh, and deep methods as nine ministers; and the direct finger Xia Lan kind began to come out."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0178",
          "zh": "而大農顏異誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And great farmer Yan Yi executed.",
              "idiomatic": "And great farmer Yan Yi was executed."
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "初，異為濟南亭長，以廉直稍遷至九卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially, Yi was Ji Nan pavilion chief, with integrity straight gradually moved to nine ministers.",
              "idiomatic": "Initially, Yi was Ji Nan pavilion chief; with integrity and straightness he gradually moved up to the nine ministers."
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "上與張湯既造白鹿皮幣，問異。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor with Zhang Tang having made white deer skin currency, asked Yi.",
              "idiomatic": "The emperor and Zhang Tang having made white deer skin currency, asked Yi."
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "異曰：「今王侯朝賀以蒼璧，直數千，而其皮薦反四十萬，本末不相稱。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yi said: 'Now kings marquises morning congratulations with blue jade bi, worth several thousand, but its skin presented instead forty ten thousand, root tip not match.'",
              "idiomatic": "Yi said: 'Now kings and marquises for morning congratulations use blue jade bi worth several thousand, but its skin presented is instead forty ten thousand; root and tip do not match.'"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "天子不說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven not pleased.",
              "idiomatic": "The Son of Heaven was not pleased."
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "張湯又與異有卻，及有人告異以它議，事下張湯治異。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhang Tang moreover with Yi had grudge, and someone accused Yi with other discussions, matter sent down Zhang Tang governed Yi.",
              "idiomatic": "Zhang Tang moreover had a grudge with Yi; and someone accused Yi of other discussions; the matter was sent down for Zhang Tang to govern Yi."
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "異與客語，客語初令下有不便者，異不應，微反脣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yi with guest spoke, guest spoke initial command issued had inconvenient ones, Yi not responded, slightly turned lips.",
              "idiomatic": "Yi spoke with a guest; the guest spoke of initial commands issued that had inconvenient aspects; Yi did not respond, slightly turned his lips."
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "湯奏當異九卿見令不便，不入言而腹誹，論死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tang memorialed should Yi nine ministers saw command inconvenient, not entered spoke but abdomen slandered, sentenced death.",
              "idiomatic": "Tang memorialed that Yi as nine ministers saw the command was inconvenient; did not enter and speak but abdomen-slandered; sentenced to death."
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "自是之後，有腹誹之法（以此）［比］，而公卿大夫多諂諛取容矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this after, had abdomen slander law (with this) [compared], and dukes ministers grand masters many flattered pleased took favor.",
              "idiomatic": "From this time on, there was the law of abdomen slandering (with this) [compared]; and dukes, ministers, grand masters many flattered and pleased to take favor."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0187",
          "zh": "天子既下緡錢令而尊卜式，百姓終莫分財佐縣官，於是（楊可）告緡錢縱矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven having issued string money command and honored Bu Shi, hundred surnames finally none divided wealth assisted county officials, therefore (Yang Ke) accused string money let go.",
              "idiomatic": "The Son of Heaven having issued the string money command and honored Bu Shi, the hundred surnames finally none divided their wealth to assist county officials; therefore (Yang Ke) accused string money was let go."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0188",
          "zh": "郡國多姦鑄錢，錢多輕，而公卿請令京師鑄鐘官赤側，一當五，賦官用非赤側不得行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Commanderies kingdoms many evil cast money, money many light, and dukes ministers requested ordered capital cast bell official red side, one when five, levy officials used not red side could not proceed.",
              "idiomatic": "Commanderies and kingdoms many evilly cast money; money many light; and dukes and ministers requested ordering the capital to cast bell official red side coins; one equaling five; levy officials used coins that were not red side could not proceed."
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "白金稍賤，民不寶用，縣官以令禁之，無益。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "White gold gradually cheapened, people not treasured used, county officials with commands prohibited it, no benefit.",
              "idiomatic": "White gold gradually cheapened; people did not treasure and use it; county officials prohibited it with commands; no benefit."
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "歲餘，白金終廢不行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Year more, white gold finally abolished not proceeded.",
              "idiomatic": "After more than a year, white gold was finally abolished and did not proceed."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0191",
          "zh": "是歲也，張湯死而民不思。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This year also, Zhang Tang died and people not thought of.",
              "idiomatic": "This year also, Zhang Tang died and the people did not think of him."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0192",
          "zh": "其後二歲，赤側錢賤，民巧法用之，不便，又廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its after two years, red side money cheapened, people skillful laws used it, inconvenient, again abolished.",
              "idiomatic": "Two years later, red side coins cheapened; people used skillful laws with them; inconvenient; again abolished."
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "於是悉禁郡國無鑄錢，專令上林三官鑄。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore all prohibited commanderies kingdoms no cast money, specially ordered Shang Lin three officials cast.",
              "idiomatic": "Therefore all prohibited commanderies and kingdoms from casting money; specially ordered Shang Lin's three officials to cast."
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "錢既多，而令天下非三官錢不得行，諸郡國所前鑄錢皆廢銷之，輸其銅三官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Money already many, and ordered world not three officials money could not proceed, various commanderies kingdoms previously cast money all abolished melted it, transported their copper three officials.",
              "idiomatic": "Money was already many; and ordered the world that non-three officials money could not proceed; various commanderies and kingdoms' previously cast money all abolished and melted; transported their copper to the three officials."
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "而民之鑄錢益少，計其費不能相當，唯真工大姦乃盜為之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And people's cast money moreover few, calculated its expenses could not match, only true craftsmen great evil ones then stole did it.",
              "idiomatic": "And people's casting of money became moreover few; calculated its expenses could not match; only true craftsmen and great evil ones then stole and did it."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0196",
          "zh": "卜式相齊，而楊可告緡遍天下，中家以上大抵皆遇告。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bu Shi chancellor Qi, and Yang Ke accused string money spread world, middle families above generally all encountered accusation.",
              "idiomatic": "Bu Shi was chancellor of Qi; and Yang Ke's accusations of string money spread throughout the world; middle families and above generally all encountered accusation."
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "杜周治之，獄少反者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Du Zhou governed it, prisons few reversed ones.",
              "idiomatic": "Du Zhou governed it; prisons had few reversed cases."
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "乃分遣御史廷尉正監分曹往，即治郡國緡錢，得民財物以億計，奴婢以千萬數，田大縣數百頃，小縣百餘頃，宅亦如之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then divided sent imperial secretaries court judge assistants supervisors divided sections went, immediately governed commanderies kingdoms string money, got people's wealth goods counted in hundred million, slave women counted in thousand ten thousand, fields big counties several hundred qing, small counties hundred more qing, houses also like it.",
              "idiomatic": "They then divided and sent imperial secretaries, court judge assistants, and supervisors divided into sections to go; immediately governed commanderies and kingdoms' string money; got people's wealth and goods counted in the hundred millions; slave women counted in the thousand ten thousands; fields in big counties several hundred qing, small counties over a hundred qing; houses also like it."
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "於是商賈中家以上大率破，民偷甘食好衣，不事畜藏之產業，而縣官有鹽鐵緡錢之故，用益饒矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore merchants middle families above greatly generally broken, people secretly sweet ate good clothes, not managed stored hidden industries, but county officials had salt iron string money reason, use moreover abundant.",
              "idiomatic": "Therefore merchants and middle families above were greatly generally broken; people secretly enjoyed sweet food and good clothes; did not manage stored and hidden industries; but county officials had the reason of salt, iron, and string money; use became moreover abundant."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0200",
          "zh": "益廣關，置左右輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover broadened pass, established left right assistants.",
              "idiomatic": "Moreover broadened the pass; established left and right assistants."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0201",
          "zh": "初，大農筦鹽鐵官布多，置水衡，欲以主鹽鐵；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially, great farmer managed salt iron officials spread many, established water balance, wanted to master salt iron;",
              "idiomatic": "Initially, the great farmer managed salt and iron officials spread many; established the water balance; wanted to master salt and iron;"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "及楊可告緡錢，上林財物眾，乃令水衡主上林。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Yang Ke accused string money, Shang Lin wealth goods many, then ordered water balance master Shang Lin.",
              "idiomatic": "And Yang Ke accused string money; Shang Lin's wealth and goods were many; then ordered the water balance to master Shang Lin."
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "上林既充滿，益廣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shang Lin already filled full, moreover broadened.",
              "idiomatic": "Shang Lin already filled and full; moreover broadened."
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "是時越欲與漢用船戰逐，乃大修昆明池，列觀環之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Yue wanted with Han used boats battled pursued, then greatly repaired Kunming Pool, arranged towers surrounded it.",
              "idiomatic": "At this time Yue wanted to battle and pursue with Han using boats; then greatly repaired Kunming Pool; arranged towers surrounding it."
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "治樓船，高十餘丈，旗幟加其上，甚壯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Made tower boats, high ten more zhang, flags banners added on it, very strong.",
              "idiomatic": "Made tower boats; high over ten zhang; flags and banners added on them; very strong."
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "於是天子感之，乃作柏梁臺，高數十丈。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven sensed it, then made Bo Liang Terrace, high several ten zhang.",
              "idiomatic": "Therefore the Son of Heaven sensed it; then made the Bo Liang Terrace; high several ten zhang."
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "宮室之修，由此日麗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Palace rooms repair, from this daily beautiful.",
              "idiomatic": "Palace rooms' repair; from this daily beautiful."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0208",
          "zh": "乃分緡錢諸官，而水衡、少府、大農、太仆各置農官，往往即郡縣比沒入田田之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then divided string money various officials, and water balance, Shao Fu, great farmer, Tai Pu each established farm officials, often took commanderies counties nearby confiscated fields farmed them.",
              "idiomatic": "Then divided string money to various officials; and water balance, Shao Fu, great farmer, Tai Pu each established farm officials; often took commanderies and counties' nearby confiscated fields and farmed them."
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "其沒入奴婢，分諸苑養狗馬禽獸，及與諸官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Their confiscated slave women, divided various gardens raised dogs horses birds beasts, and gave various officials.",
              "idiomatic": "Their confiscated slave women; divided to various gardens to raise dogs, horses, birds, beasts; and gave to various officials."
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "諸官益雜置多，徒奴婢眾，而下河漕度四百萬石，及官自糴乃足。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various officials moreover mixed established many, convict slave women many, but lower Yellow River transported crossed four hundred ten thousand shi, and officials self bought then sufficient.",
              "idiomatic": "Various officials moreover mixed and established many; convict slave women many; but lower Yellow River transport crossed four hundred ten thousand shi; and officials self-bought grain then sufficient."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0211",
          "zh": "所忠言：「世家子弟富人或鬬雞走狗馬，弋獵博戲，亂齊民。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Suo Zhong spoke: 'Established family sons rich people or fought cocks walked dogs horses, shot hunted gambled played, disordered uniform people.'",
              "idiomatic": "Suo Zhong spoke: 'Established family sons and rich people sometimes fight cocks, walk dogs and horses, shoot and hunt, gamble and play; disorder the uniform people.'"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "乃徵諸犯令，相引數千人，命曰「株送徒」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then summoned various violated command ones, mutually implicated several thousand people, named 'uproot sent convicts'.",
              "idiomatic": "Then summoned those who violated commands; they mutually implicated several thousand people; named 'uproot sent convicts'."
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "入財者得補郎，郎選衰矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Entered wealth ones got supplemented lang, lang selections declined.",
              "idiomatic": "Those who entered wealth got supplemented as lang; lang selections declined."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0214",
          "zh": "是時山東被河菑，及歲不登數年，人或相食，方一二千里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Shan Dong suffered Yellow River disaster, and years not abundant several years, people or mutually ate, area one two thousand li.",
              "idiomatic": "At this time Shan Dong suffered Yellow River disasters; and for several years the harvests were poor; people sometimes ate each other; the area was one or two thousand li."
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "天子憐之，詔曰：「江南火耕水耨，令饑民得流就食江淮閒，欲留，留處。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven pitied them, edict said: 'Jiang Nan fire plow water weed, order hungry people can flow seek food Jiang Huai between, want stay, stay place.'",
              "idiomatic": "The Son of Heaven pitied them; edict said: 'Jiang Nan uses fire plowing and water weeding; order hungry people can migrate to seek food between Jiang and Huai; those who want to stay, stay in place.'"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "遣使冠蓋相屬於道，護之，下巴蜀粟以振之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sent messengers official hats continuously connected on road, protected them, sent down Ba Shu grain to relieve them.",
              "idiomatic": "Sent messengers with official hats continuously connected on the road; protected them; sent down Ba and Shu grain to relieve them."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0217",
          "zh": "其明年，天子始巡郡國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, Son of Heaven began toured commanderies kingdoms.",
              "idiomatic": "The next year, the Son of Heaven began touring the commanderies and kingdoms."
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "東度河，河東守不意行至，不辨，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "East crossed Yellow River, He Dong governor not expected travel arrived, not prepared, committed suicide.",
              "idiomatic": "East crossed the Yellow River; the He Dong governor did not expect the travel to arrive; was unprepared; committed suicide."
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "行西踰隴，隴西守以行往卒，天子從官不得食，隴西守自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Traveled west crossed Long, Long Xi governor with travel went troops, Son of Heaven attendants not got food, Long Xi governor committed suicide.",
              "idiomatic": "Traveled west across Long; the Long Xi governor with travel went troops; the Son of Heaven's attendants did not get food; the Long Xi governor committed suicide."
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "於是上北出蕭關，從數萬騎，獵新秦中，以勒邊兵而歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore emperor north exited Xiao Guan, followed several ten thousand cavalry, hunted new Qin middle, to restrain border troops and return.",
              "idiomatic": "Therefore the emperor north exited Xiao Guan; followed several tens of thousands of cavalry; hunted in new Qin middle; to restrain border troops and return."
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "新秦中或千里無亭徼，於是誅北地太守以下，而令民得畜牧邊縣，官假馬母，三歲而歸，及息什一，以除告緡，用充仞新秦中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "New Qin middle or thousand li no watch stations, therefore executed Bei Di grand administrator below, and ordered people could raise livestock border counties, officials lent mare mothers, three years and return, and increased one tenth, to remove accuse string money, used fill populate new Qin middle.",
              "idiomatic": "New Qin middle sometimes had a thousand li without watch stations; therefore executed the Bei Di grand administrator and below; and ordered people could raise livestock in border counties; officials lent mare mothers; three years and return them; and increased by one tenth; to remove accusations of string money; used to fill and populate new Qin middle."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0222",
          "zh": "既得寶鼎，立后土、太一祠，公卿議封禪事，而天下郡國皆豫治道橋，繕故宮，及當馳道縣，縣治官儲，設供具，而望以待幸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Having got precious ding, established Hou Tu, Tai Yi sacrifices, dukes ministers discussed feng shan affairs, and world commanderies kingdoms all prepared repaired roads bridges, mended former palaces, and should gallop road counties, counties administered official stores, set up supplies, and gazed to await favor.",
              "idiomatic": "Having obtained the precious ding; established Hou Tu and Tai Yi sacrifices; dukes and ministers discussed feng shan affairs; and the world's commanderies and kingdoms all prepared and repaired roads and bridges; mended former palaces; and counties that should have galloping roads; counties administered official stores; set up supplies; and gazed to await favor."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0223",
          "zh": "其明年，南越反，西羌侵邊為桀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, Nan Yue rebelled, Xi Qiang invaded border became rebellious.",
              "idiomatic": "The next year, Nan Yue rebelled; Xi Qiang invaded the border and became rebellious."
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "於是天子為山東不贍，赦天下［囚］，因南方樓船卒二十餘萬人擊南越，數萬人發三河以西騎擊西羌，又數萬人度河筑令居。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven for Shan Dong not sufficient, pardoned world [prisoners], using south tower boat troops twenty more ten thousand attacked Nan Yue, several ten thousand sent San He west cavalry attacked Xi Qiang, moreover several ten thousand crossed Yellow River built Ling Ju.",
              "idiomatic": "Therefore the Son of Heaven, for Shan Dong not being sufficient; pardoned the world's [prisoners]; using southern tower boat troops over two hundred ten thousand to attack Nan Yue; several tens of thousands sent San He west cavalry to attack Xi Qiang; moreover several tens of thousands crossed the Yellow River to build Ling Ju."
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "初置張掖、酒泉郡，而上郡、朔方、西河、河西開田官，斥塞卒六十萬人戍田之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Initially established Zhang Ye, Jiu Quan commanderies, and Shang Jun, Shuo Fang, Xi He, He Xi opened field officials, expanded border troops sixty ten thousand garrisoned farmed them.",
              "idiomatic": "Initially established Zhang Ye and Jiu Quan commanderies; and Shang Jun, Shuo Fang, Xi He, He Xi opened field officials; expanded border troops of six hundred ten thousand to garrison and farm them."
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "中國繕道餽糧，遠者三千，近者千餘里，皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Central states repaired roads sent grain, far ones three thousand, near ones thousand more li, all looked up supplied great farmer.",
              "idiomatic": "The central states repaired roads and sent grain; far ones three thousand li, near ones over a thousand li; all looked up to be supplied by the great farmer."
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "邊兵不足，乃發武庫工官兵器以贍之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Border troops insufficient, then issued martial storehouse craftsmen official weapons to support them.",
              "idiomatic": "Border troops were insufficient; then issued martial storehouse craftsmen and official weapons to support them."
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "車騎馬乏絕，縣官錢少，買馬難得，乃著令，令封君以下至三百石以上吏，以差出牝馬天下亭，亭有畜牸馬，歲課息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chariot cavalry horses lacked exhausted, county officials money few, buy horses difficult got, then established command, ordered sealed lords below to three hundred shi above clerks, by differences sent out female horses world pavilions, pavilions had raised female horses, yearly assessed interest.",
              "idiomatic": "Chariot cavalry horses lacked and were exhausted; county officials had little money; buying horses was difficult to obtain; then established a command ordering sealed lords below to three hundred shi and above clerks, by differences to send out female horses to the world's pavilions; pavilions had raised female horses; yearly assessed the interest."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0229",
          "zh": "齊相卜式上書曰：「臣聞主憂臣辱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qi chancellor Bu Shi memorialed said: 'Minister heard lord worries minister shames.'",
              "idiomatic": "Qi chancellor Bu Shi memorialed saying: 'Minister has heard that when the lord worries, the minister is shamed.'"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "南越反，臣願父子與齊習船者往死之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nan Yue rebelled, minister wishes father son with Qi practiced boat ones go die for it.'",
              "idiomatic": "'Nan Yue has rebelled; minister wishes father and son with Qi's boat-trained ones to go die for it.'"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "天子下詔曰：「卜式雖躬耕牧，不以為利，有餘輒助縣官之用。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven issued edict said: 'Bu Shi although personally farmed pastured, not took as profit, had surplus then assisted county officials use.'",
              "idiomatic": "The Son of Heaven issued an edict saying: 'Bu Shi, although personally farming and pasturing, did not take it as profit; when he had surplus he assisted county officials' use.'"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "今天下不幸有急，而式奮願父子死之，雖未戰，可謂義形於內。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now world unfortunately has urgency, and Shi aroused wished father son die for it, although not yet battled, can be called righteousness shaped within.'",
              "idiomatic": "'Now the world unfortunately has urgency, and Shi aroused and wished father and son to die for it; although not yet battled, can be called righteousness shaped within.'"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "賜爵關內侯，金六十斤，田十頃。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Granted nobility Guan Nei Hou, gold sixty jin, fields ten qing.'",
              "idiomatic": "'Granted nobility as Guan Nei Hou, gold sixty jin, fields ten qing.'"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "布告天下，天下莫應。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Announced world, world none responded.",
              "idiomatic": "Announced to the world; the world none responded."
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "列侯以百數，皆莫求從軍擊羌、越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Arranged marquises by hundred counted, all none sought follow army attack Qiang, Yue.",
              "idiomatic": "Arranged marquises numbered in the hundreds; all none sought to follow the army to attack Qiang and Yue."
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "至酎，少府省金，而列侯坐酎金失侯者百餘人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To Jiu, Shao Fu examined gold, and arranged marquises sat Jiu gold lost marquises ones hundred more people.",
              "idiomatic": "By the Jiu ceremony, Shao Fu examined the gold; and arranged marquises who sat with Jiu gold lost their marquises; over a hundred people."
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "乃拜式為御史大夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then appointed Shi as Imperial Censor.",
              "idiomatic": "Then appointed Shi as Imperial Censor."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "式既在位，見郡國多不便縣官作鹽鐵，鐵器苦惡，賈貴，或彊令民賣買之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shi already in position, saw commanderies kingdoms many inconvenient county officials made salt iron, iron tools bitter bad, merchants expensive, or strongly ordered people bought sold them.",
              "idiomatic": "Shi already in position; saw that commanderies and kingdoms many found it inconvenient that county officials made salt and iron; iron tools were bitter and bad; merchants expensive; or strongly ordered people to buy and sell them."
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "而船有算，商者少，物貴，乃因孔僅言船算事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And boats had tax, merchants few, goods expensive, then through Kong Jin spoke boat tax affairs.",
              "idiomatic": "And boats had tax; merchants few; goods expensive; then through Kong Jin spoke of boat tax affairs."
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "上由是不悅卜式。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emperor therefore not pleased Bu Shi.",
              "idiomatic": "The emperor therefore was not pleased with Bu Shi."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0241",
          "zh": "漢連兵三歲，誅羌，滅南越，番禺以西至蜀南者置初郡十七，且以其故俗治，毋賦稅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han connected troops three years, executed Qiang, extinguished Nan Yue, Pan Yu west to Shu south ones established initial commanderies seventeen, moreover with their former customs governed, no taxes.",
              "idiomatic": "Han connected troops for three years; executed Qiang; extinguished Nan Yue; Pan Yu west to Shu south ones established initial commanderies seventeen; moreover governed with their former customs; no taxes."
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "南陽、漢中以往郡，各以地比給初郡吏卒奉食幣物，傳車馬被具。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nan Yang, Han Zhong past commanderies, each with land proportion supplied initial commanderies clerks troops provisions food currency goods, relay carriages horses covered equipment.",
              "idiomatic": "Nan Yang and Han Zhong past commanderies; each with land proportion supplied initial commanderies' clerks and troops' provisions, food, currency, goods; relay carriages, horses, and covered equipment."
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "而初郡時時小反，殺吏，漢發南方吏卒往誅之，閒歲萬餘人，費皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And initial commanderies sometimes small rebelled, killed clerks, Han sent southern clerks troops went executed them, between years ten thousand more people, expenses all looked up supplied great farmer.",
              "idiomatic": "And initial commanderies sometimes small rebelled and killed clerks; Han sent southern clerks and troops to go execute them; between years over ten thousand people; expenses all looked up to be supplied by the great farmer."
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "大農以均輸調鹽鐵助賦，故能贍之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great farmer with equal transport regulated salt iron assisted taxes, therefore could support them.",
              "idiomatic": "The great farmer with equal transport regulated salt and iron to assist taxes; therefore could support them."
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "然兵所過縣，為以訾給毋乏而已，不敢言擅賦法矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet troops passed counties, for with wealth supplied not lacked only, not dared speak monopolized tax laws.",
              "idiomatic": "Yet troops passed counties; only supplied with wealth so as not to lack; did not dare speak of monopolizing tax laws."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0246",
          "zh": "其明年，元封元年，卜式貶秩為太子太傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its next year, Yuan Feng first year, Bu Shi demoted rank became Crown Prince grand tutor.",
              "idiomatic": "The next year, Yuan Feng first year, Bu Shi was demoted in rank to become Crown Prince grand tutor."
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "而桑弘羊為治粟都尉，領大農，盡代僅筦天下鹽鐵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Sang Hong Yang became Governing Grain colonel, led great farmer, completely replaced Jin managed world salt iron.",
              "idiomatic": "And Sang Hong Yang became Governing Grain colonel; led the great farmer; completely replaced Jin in managing the world's salt and iron."
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "弘羊以諸官各自市，相與爭，物故騰躍，而天下賦輸或不償其僦費，乃請置大農部丞數十人，分部主郡國，各往往縣置均輸鹽鐵官，令遠方各以其物貴時商賈所轉販者為賦，而相灌輸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hong Yang with various officials each self purchased, mutually contended, goods therefore leaped jumped, and world taxes transports or not repaid their hired expenses, then requested established great farmer division assistants several ten people, divided sections mastered commanderies kingdoms, each often county established equal transport salt iron officials, ordered distant places each with their goods expensive time merchants transferred sold ones as taxes, and mutually irrigated input.",
              "idiomatic": "Hong Yang, because various officials each self-purchased and mutually contended; goods therefore leaped and jumped; and the world's taxes and transports sometimes did not repay their hired expenses; then requested to establish great farmer division assistants several tens of people; divided sections to master commanderies and kingdoms; each often in counties established equal transport salt and iron officials; ordered distant places each with their goods' expensive times when merchants transferred and sold them as taxes; and mutually irrigated and input them."
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "置平準于京師，都受天下委輸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Established level standard at capital, capital received world entrusted transports.",
              "idiomatic": "Established level standard at the capital; the capital received the world's entrusted transports."
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "召工官治車諸器，皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Summoned craftsmen officials repaired carriages various tools, all looked up supplied great farmer.",
              "idiomatic": "Summoned craftsmen officials to repair carriages and various tools; all looked up to be supplied by the great farmer."
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "大農之諸官盡籠天下之貨物，貴即賣之，賤則買之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great farmer various officials completely contained world goods, expensive then sold them, cheap then bought them.",
              "idiomatic": "The great farmer's various officials completely contained the world's goods; when expensive then sold them; when cheap then bought them."
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "如此，富商大賈無所牟大利，則反本，而萬物不得騰踴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Like this, rich merchants great traders nowhere sought great profits, then returned to fundamentals, and myriad things not got to leap jump.",
              "idiomatic": "Like this, rich merchants and great traders had nowhere to seek great profits; then returned to fundamentals; and myriad things could not leap and jump."
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "故抑天下物，名曰「平準」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore suppressed world goods, named 'level standard'.",
              "idiomatic": "Therefore suppressed the world's goods; named 'level standard'."
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "天子以為然，許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven considered it so, permitted it.",
              "idiomatic": "The Son of Heaven considered it so; permitted it."
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "於是天子北至朔方，東到太山，巡海上，并北邊以歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Son of Heaven north to Shuo Fang, east to Tai Shan, toured sea above, along north border to return.",
              "idiomatic": "Therefore the Son of Heaven north to Shuo Fang, east to Tai Shan; toured above the sea; along the north border to return."
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "所過賞賜，用帛百餘萬匹，錢金以巨萬計，皆取足大農。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Passed places rewarded bestowed, used silk hundred more ten thousand bolts, money gold counted in huge ten thousands, all took sufficient great farmer.",
              "idiomatic": "Places passed rewarded and bestowed; used silk over a hundred ten thousand bolts; money and gold counted in huge ten thousands; all took sufficient from the great farmer."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "弘羊又請令吏得入粟補官，及罪人贖罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hong Yang moreover requested ordered clerks could enter grain supplement offices, and criminals redeem crimes.",
              "idiomatic": "Hong Yang moreover requested to order that clerks could enter grain to supplement offices, and criminals redeem crimes."
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "令民能入粟甘泉各有差，以復終身，不告緡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ordered people could enter grain Gan Quan each had differences, to exempt lifetime, not accuse string money.",
              "idiomatic": "Ordered that people could enter grain at Gan Quan with various differences, to exempt lifetime service, not to accuse of string money."
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "他郡各輸急處，而諸農各致粟，山東漕益歲六百萬石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Other commanderies each transported urgent places, and various farmers each brought grain, Shan Dong transported moreover year six hundred ten thousand shi.",
              "idiomatic": "Other commanderies each transported to urgent places; and various farmers each brought grain; Shan Dong transport moreover yearly six hundred ten thousand shi."
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "一歲之中，太倉、甘泉倉滿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "One year middle, great granary, Gan Quan granary full.",
              "idiomatic": "Within one year, the great granary and Gan Quan granary were full."
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "邊餘穀諸物均輸帛五百萬匹。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Border surplus grain various goods equal transported silk five hundred ten thousand bolts.",
              "idiomatic": "Border surplus grain and various goods were equally transported as five hundred ten thousand bolts of silk."
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "民不益賦而天下用饒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People not increased taxes and world use abundant.",
              "idiomatic": "The people did not increase taxes yet the world's use was abundant."
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "於是弘羊賜爵左庶長，黃金再百斤焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Hong Yang granted nobility left commoner chief, yellow gold two hundred jin there.",
              "idiomatic": "Therefore Hong Yang was granted nobility as left commoner chief, and two hundred jin of yellow gold."
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0264",
          "zh": "是歲小旱，上令官求雨，卜式言曰：「縣官當食租衣稅而已，今弘羊令吏坐市列肆，販物求利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This year small drought, emperor ordered officials seek rain, Bu Shi spoke: 'County officials should eat rents wear taxes only, now Hong Yang makes clerks sit markets arranged shops, peddle goods seek profit.'",
              "idiomatic": "This year there was a small drought; the emperor ordered officials to seek rain; Bu Shi spoke: 'County officials should only eat rents and wear taxes; now Hong Yang makes clerks sit in markets and arranged shops, peddling goods to seek profit.'"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "亨弘羊，天乃雨。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Cook Hong Yang, heaven then rain.'",
              "idiomatic": "'Cook Hong Yang, and heaven will then rain.'"
            }
          ]
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0267",
          "zh": "太史公曰：農工商交易之路通，而龜貝金錢刀布之幣興焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grand Historian said: farming commerce artisans exchange roads connected, and turtle shells cowries gold money knives cloth currencies arose there.",
              "idiomatic": "The Grand Historian said: When farming, commerce, and artisans' exchange roads were connected, then currencies of turtle shells, cowries, gold money, knives, and cloth arose."
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "所從來久遠，自高辛氏之前尚矣，靡得而記云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "What came from long distant, from Gao Xin clan before still was, could not be recorded.",
              "idiomatic": "What they came from was long distant; from before the Gao Xin clan it was still so; cannot be recorded."
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "故書道唐虞之際，詩述殷周之世，安寧則長庠序，先本絀末，以禮義防于利；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore writings spoke Tang Yu time, poems described Yin Zhou age, peaceful then grew schools, first fundamentals reduced ends, with rites righteousness guarded against profits;",
              "idiomatic": "Therefore writings spoke of the Tang Yu time; poems described the Yin Zhou age; when peaceful then grew schools; first fundamentals reduced ends; with rites and righteousness guarded against profits;"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "事變多故而亦反是。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Affairs changed many troubles and also reversed this.",
              "idiomatic": "When affairs changed and there were many troubles, it also reversed this."
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "是以物盛則衰，時極而轉，一質一文，終始之變也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore things flourish then decline, time extreme then turn, one solid one pattern, beginning end change also.",
              "idiomatic": "Therefore things flourish then decline; time reaches extreme then turns; one solid, one patterned; the change of beginning and end."
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "禹貢九州，各因其土地所宜，人民所多少而納職焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu tribute nine provinces, each according to their land suitable, people more less and paid duties there.",
              "idiomatic": "Yu's tribute of the nine provinces; each according to their land's suitability and people's more or less, paid duties there."
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "湯武承獘易變，使民不倦，各兢兢所以為治，而稍陵遲衰微。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tang Wu inherited exhaustion easily changed, made people not weary, each earnestly so governed, but gradually declined weakened.",
              "idiomatic": "Tang and Wu inherited exhaustion and easily changed it; made the people not weary; each earnestly so governed; but gradually declined and weakened."
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "齊桓公用管仲之謀，通輕重之權，徼山海之業，以朝諸侯，用區區之齊顯成霸名。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qi Huan duke used Guan Zhong strategy, connected light heavy power, cornered mountain sea industries, to make audience feudal lords, used small small Qi displayed became hegemon name.",
              "idiomatic": "Duke Huan of Qi used Guan Zhong's strategy; connected the power of light and heavy; cornered the industries of mountains and seas; to make audience with feudal lords; used small Qi to display and become hegemon name."
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "魏用李克，盡地力，為彊君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wei used Li Ke, exhausted land strength, became strong ruler.",
              "idiomatic": "Wei used Li Ke; exhausted the land's strength; became a strong ruler."
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "自是以後，天下爭於戰國，貴詐力而賤仁義，先富有而後推讓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this after, world contended in Warring States, valued deceit force but cheapened benevolence righteousness, first rich had then afterward yielded.",
              "idiomatic": "From this time on, the world contended in the Warring States; valued deceit and force but cheapened benevolence and righteousness; first had riches then afterward yielded."
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "故庶人之富者或累巨萬，而貧者或不厭糟糠；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore commoners rich ones or accumulated huge ten thousand, but poor ones or not satisfied with bran husks;",
              "idiomatic": "Therefore among commoners the rich ones accumulated huge ten thousands, but the poor ones were not satisfied with bran and husks;"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "有國彊者或并群小以臣諸侯，而弱國或絕祀而滅世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Had states strong ones or annexed groups small to serve feudal lords, but weak states or cut sacrifices extinguished generations.",
              "idiomatic": "States that were strong annexed groups of small ones to serve as feudal lords, but weak states cut off sacrifices and extinguished generations."
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "以至於秦，卒并海內。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To arrived at Qin, finally united within seas.",
              "idiomatic": "Until arriving at Qin, finally united within the seas."
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "虞夏之幣，金為三品，或黃，或白，或赤；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Xia currencies, gold as three kinds, or yellow, or white, or red;",
              "idiomatic": "Yu and Xia's currencies; gold as three kinds: or yellow, or white, or red;"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "或錢，或布，或刀，或龜貝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Or coins, or cloth, or knives, or turtle shells cowries.",
              "idiomatic": "Or coins, or cloth, or knives, or turtle shells and cowries."
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "及至秦，中一國之幣為（三）［二］等，黃金以溢名，為上幣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And to Qin, unifying one state currencies as (three) [two] grades, yellow gold with yi named, as upper currency;",
              "idiomatic": "And to Qin; unifying one state's currencies as (three) [two] grades; yellow gold named with yi; as upper currency;"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "銅錢識曰半兩，重如其文，為下幣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Copper coins inscription said half liang, heavy like its writing, as lower currency.",
              "idiomatic": "Copper coins' inscription said 'half liang'; heavy like its writing; as lower currency."
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "而珠玉、龜貝、銀錫之屬為器飾寶藏，不為幣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And pearls jade, turtle shells cowries, silver tin kind as vessel decorations treasure stores, not as currency.",
              "idiomatic": "And pearls and jade, turtle shells and cowries, silver and tin kind were vessel decorations and treasure stores, not currency."
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "然各隨時而輕重無常。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet each followed time and light heavy no constant.",
              "idiomatic": "Yet each followed the time with light and heavy having no constant."
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "於是外攘夷狄，內興功業，海內之士力耕不足糧馕，女子紡績不足衣服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore externally repelled barbarian barbarians, internally aroused merit works, within seas scholars strength farmed insufficient grain food, women spun wove insufficient clothes.",
              "idiomatic": "Therefore externally repelled barbarian barbarians; internally aroused merit and works; within the seas the scholars' strength farming was insufficient for grain and food; women's spinning and weaving insufficient for clothes."
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "古者嘗竭天下之資財以奉其上，猶自以為不足也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ancient ones often exhausted world resources wealth to support their superiors, still self considered insufficient also.",
              "idiomatic": "Ancient ones often exhausted the world's resources and wealth to support their superiors; still themselves considered it insufficient."
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "無異故云，事勢之流，相激使然，曷足怪焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "No different therefore speak, affairs situations flow, mutually stimulated made so, why sufficient strange there.",
              "idiomatic": "No different therefore I speak; the flow of affairs and situations; mutually stimulated made so; why is it sufficient to be strange?"
            }
          ]
        }
      ]
    }
  ]
}