{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "033",
    "url": "https://chinesenotes.com/shiji/shiji033.html",
    "title": {
      "zh": "魯周公世家",
      "en": "House of Lu Zhougong",
      "raw": "《魯周公世家》 House of Lu Zhougong"
    },
    "sentenceCount": 444,
    "translatedCount": 444,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:03.257Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "周公旦者，周武王弟也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong Dan, Zhou Wu Wang younger brother.",
              "idiomatic": "The Duke of Zhou (Dan) was the younger brother of King Wu of Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "自文王在時，旦為子孝，篤仁，異於群子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From Wen Wang time, Dan as son filial, sincere benevolent, different from group sons.",
              "idiomatic": "Even during King Wen's lifetime, Dan was exceptionally filial as a son, sincerely benevolent, and distinguished from his brothers.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "及武王即位，旦常輔翼武王，用事居多。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Wu Wang ascended throne, Dan constantly assisted Wu Wang, handling affairs majority.",
              "idiomatic": "After King Wu ascended the throne, Dan constantly assisted him and handled most of the affairs of state.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "武王九年，東伐至盟津，周公輔行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Wang ninth year, east attacked arrived Meng Jin, Zhou Gong assisted journey.",
              "idiomatic": "In King Wu's ninth year, during the eastern campaign that reached Mengjin, the Duke of Zhou assisted with the expedition.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "十一年，伐紂，至牧野，周公佐武王，作牧誓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh year, attacked Zhou, arrived Mu Ye, Zhou Gong assisted Wu Wang, made Mu Oath.",
              "idiomatic": "In the eleventh year, during the attack on Zhou that reached Muye, the Duke of Zhou assisted King Wu and composed the Oath of Mu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "破殷，入商宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Broke Yin, entered Shang palace.",
              "idiomatic": "They defeated Yin and entered the Shang palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "已殺紂，周公把大鉞，召公把小鉞，以夾武王，釁社，告紂之罪于天，及殷民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Already killed Zhou, Zhou Gong held large axe, Shao Gong held small axe, to flank Wu Wang, smeared altar, informed Zhou's crimes to heaven, and Yin people.",
              "idiomatic": "After killing Zhou, the Duke of Zhou held the large axe and the Duke of Shao held the small axe, flanking King Wu. They smeared the sacrificial altar with blood and informed heaven and the Yin people of Zhou's crimes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "釋箕子之囚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Released Ji Zi prisoner.",
              "idiomatic": "They released Ji Zi from prison.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "封紂子武庚祿父，使管叔、蔡叔傅之，以續殷祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoffed Zhou son Wu Geng Lu Fu, made Guan Shu, Cai Shu tutor him, to continue Yin sacrifices.",
              "idiomatic": "They enfeoffed Zhou's son Wu Geng Lu Fu, appointing Guan Shu and Cai Shu to tutor him and continue the Yin sacrifices.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "遍封功臣同姓戚者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Extensively enfeoffed meritorious officials same surname close relatives.",
              "idiomatic": "They extensively enfeoffed meritorious officials and same-surname relatives.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "封周公旦於少昊之虛曲阜，是為魯公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoffed Zhou Gong Dan at Shao Hao empty Qu Fu, this was Lu Gong.",
              "idiomatic": "They enfeoffed the Duke of Zhou (Dan) at the old site of Shao Hao in Qufu, making him Duke of Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "周公不就封，留佐武王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong not accept enfeoffment, stayed assisted Wu Wang.",
              "idiomatic": "The Duke of Zhou did not accept the enfeoffment and stayed to assist King Wu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "武王克殷二年，天下未集，武王有疾，不豫，群臣懼，太公、召公乃繆卜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Wang conquered Yin second year, world not gathered, Wu Wang had illness, not cheerful, group ministers feared, Tai Gong, Shao Gong then falsely divined.",
              "idiomatic": "In the second year after King Wu conquered Yin, the world was not yet pacified. King Wu fell ill and was not cheerful. The ministers were fearful, so the Grand Duke and Duke Shao performed false divinations.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "周公曰：「未可以戚我先王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong said: 'Not yet can grieve our former kings.'",
              "idiomatic": "The Duke of Zhou said: 'This is not yet a matter to grieve our former kings.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "周公於是乃自以為質，設三壇，周公北面立，戴璧秉圭，告于太王、王季、文王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong therefore self as pledge, set three altars, Zhou Gong north face stood, wore jade disk held jade tablet, informed Tai Wang, Wang Ji, Wen Wang.",
              "idiomatic": "The Duke of Zhou therefore offered himself as pledge, setting up three altars. The Duke of Zhou stood facing north, wearing a jade disk and holding a jade tablet, and informed King Tai, King Ji, and King Wen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "史策祝曰：「惟爾元孫王發，勤勞阻疾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Scribe bamboo slips prayed said: 'Only your eldest grandson Wang Fa, diligent labor obstructed illness.",
              "idiomatic": "The scribe on the bamboo slips prayed: 'Your eldest grandson King Fa has labored diligently and is obstructed by illness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "若爾三王是有負子之責於天，以旦代王發之身。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If you three kings have responsibility for son to heaven, with Dan substitute Wang Fa body.",
              "idiomatic": "If you three kings bear responsibility for your son to heaven, let Dan substitute for King Fa's body.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "旦巧能，多材多藝，能事鬼神。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dan skillful able, many talents many arts, able serve ghosts spirits.",
              "idiomatic": "Dan is skillful and able, with many talents and arts, able to serve the ghosts and spirits.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "乃王發不如旦多材多藝，不能事鬼神。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Wang Fa not equal Dan many talents many arts, cannot serve ghosts spirits.",
              "idiomatic": "King Fa is not equal to Dan in many talents and arts, and cannot serve the ghosts and spirits.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "乃命于帝庭，敷佑四方，用能定汝子孫于下地，四方之民罔不敬畏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then commanded at Emperor court, spread aid four directions, used able settle your descendants on lower earth, four directions people none not respectful fearful.",
              "idiomatic": "Heaven commanded at the imperial court, spreading aid to the four directions, thereby able to settle your descendants on the earth below. The people of the four directions, none are not respectful and fearful.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "無墜天之降葆命，我先王亦永有所依歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "No drop heaven's descended precious mandate, our former kings also eternally have place to depend return.",
              "idiomatic": "Do not drop heaven's descended precious mandate. Our former kings will also eternally have a place to depend and return to.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "今我其即命於元龜，爾之許我，我以其璧與圭歸，以俟爾命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now I will immediately command at great turtle, you permit me, I with its jade disk and tablet return, to await your command.",
              "idiomatic": "Now I will immediately divine with the great turtle. If you permit me, I will return with the jade disk and tablet to await your command.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "爾不許我，我乃屏璧與圭。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "You not permit me, I then discard jade disk and tablet.'",
              "idiomatic": "If you do not permit me, I will then discard the jade disk and tablet.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "周公已令史策告太王、王季、文王，欲代武王發，於是乃即三王而卜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong already ordered scribe bamboo slips inform Tai Wang, Wang Ji, Wen Wang, wished substitute Wu Wang Fa, therefore then approached three kings and divined.",
              "idiomatic": "The Duke of Zhou had already ordered the scribe to inform King Tai, King Ji, and King Wen on the bamboo slips of his wish to substitute for King Wu (Fa). He then approached the three kings and performed divination.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "卜人皆曰吉，發書視之，信吉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Diviners all said auspicious, opened slips viewed them, truly auspicious.",
              "idiomatic": "All the diviners said it was auspicious. When they opened the slips and viewed them, it was truly auspicious.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "周公喜，開籥，乃見書遇吉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong happy, opened chest, then saw slips encountered auspicious.",
              "idiomatic": "The Duke of Zhou was happy. When he opened the chest, he saw that the slips had encountered auspicious omens.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "周公入賀武王曰：「王其無害。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong entered congratulated Wu Wang said: 'Wang certainly no harm.",
              "idiomatic": "The Duke of Zhou entered and congratulated King Wu: 'Your Majesty will certainly suffer no harm.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "旦新受命三王，維長終是圖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dan newly received command three kings, maintain long end this plan.",
              "idiomatic": "Dan has newly received the command of the three kings, and will maintain this plan for the long term.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "茲道能念予一人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This way able think of me one person.'",
              "idiomatic": "This way will be able to care for me as one person.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "周公藏其策金縢匱中，誡守者勿敢言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong hid his slips gold wrapped box middle, warned guardians dare not speak.",
              "idiomatic": "The Duke of Zhou hid the slips in a gold-wrapped box and warned the guardians not to dare speak of it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "明日，武王有瘳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Next day, Wu Wang had recovery.",
              "idiomatic": "The next day, King Wu recovered.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "其後武王既崩，成王少，在彊葆之中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After this Wu Wang already collapsed, Cheng Wang young, in strong protection midst.",
              "idiomatic": "After this, King Wu died. King Cheng was young and under strong protection.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "周公恐天下聞武王崩而畔，周公乃踐阼代成王攝行政當國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong feared world heard Wu Wang collapse and rebel, Zhou Gong then ascended throne substituted Cheng Wang administered government governed state.",
              "idiomatic": "The Duke of Zhou feared that if the world heard of King Wu's death they would rebel. The Duke of Zhou therefore ascended the throne and substituted for King Cheng, administering the government and governing the state.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "管叔及其群弟流言於國曰：「周公將不利於成王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Shu and his group younger brothers spread rumors in state said: 'Zhou Gong will harm Cheng Wang.'",
              "idiomatic": "Guan Shu and his younger brothers spread rumors throughout the state: 'The Duke of Zhou intends harm to King Cheng.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "周公乃告太公望、召公奭曰：「我之所以弗辟而攝行政者，恐天下畔周，無以告我先王太王、王季、文王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong then informed Tai Gong Wang, Shao Gong Shi said: 'I reason not avoid but administer government, fear world rebel Zhou, no way inform my former kings Tai Wang, Wang Ji, Wen Wang.",
              "idiomatic": "The Duke of Zhou then informed the Grand Duke and Duke Shao: 'The reason I did not avoid responsibility but administer the government is that I fear the world will rebel against Zhou, and I will have no way to face my former kings King Tai, King Ji, and King Wen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "三王之憂勞天下久矣，於今而后成。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three kings' worry labor world long, from now and after complete.",
              "idiomatic": "The three kings worried and labored over the world for so long. From now on it will be complete.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "武王蚤終，成王少，將以成周，我所以為之若此。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Wang early end, Cheng Wang young, will use complete Zhou, I reason do it like this.'",
              "idiomatic": "King Wu died early. King Cheng is young. I will complete the Zhou enterprise, which is why I do this.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "於是卒相成王，而使其子伯禽代就封於魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore finally assisted Cheng Wang, and made his son Bo Qin substitute accept enfeoffment at Lu.",
              "idiomatic": "He therefore continued to assist King Cheng, and sent his son Bo Qin to accept the enfeoffment at Lu in his place.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "周公戒伯禽曰：「我文王之子，武王之弟，成王之叔父，我於天下亦不賤矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong warned Bo Qin said: 'I Wen Wang son, Wu Wang younger brother, Cheng Wang uncle father, I in world also not lowly.",
              "idiomatic": "The Duke of Zhou warned Bo Qin: 'I am King Wen's son, King Wu's younger brother, and King Cheng's uncle. I am not lowly in the world.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "然我一沐三捉發，一飯三吐哺，起以待士，猶恐失天下之賢人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yet I one bath three grasp hair, one meal three spit mouthful, rise to await scholars, still fear lose world worthy people.",
              "idiomatic": "Yet I interrupt my bath three times to grasp my hair, interrupt my meal three times to spit out my food, and rise to greet scholars, still fearing I might lose the worthy people of the world.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "子之魯，慎無以國驕人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "You go to Lu, careful not use state arrogant people.'",
              "idiomatic": "When you go to Lu, be careful not to use your position as ruler to be arrogant toward people.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "管、蔡、武庚等果率淮夷而反。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan, Cai, Wu Geng etc. indeed led Huai Yi and rebelled.",
              "idiomatic": "Guan Shu, Cai Shu, Wu Geng, and others indeed led the Huai Yi barbarians and rebelled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "周公乃奉成王命，興師東伐，作大誥。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong then received Cheng Wang command, raised troops east attacked, made Great Announcement.",
              "idiomatic": "The Duke of Zhou then received King Cheng's command, raised troops to attack eastward, and composed the Great Announcement.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "遂誅管叔，殺武庚，放蔡叔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then executed Guan Shu, killed Wu Geng, banished Cai Shu.",
              "idiomatic": "He then executed Guan Shu, killed Wu Geng, and banished Cai Shu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "收殷餘民，以封康叔於衛，封微子於宋，以奉殷祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gathered Yin remaining people, to enfeoff Kang Shu at Wei, enfeoff Wei Zi at Song, to continue Yin sacrifices.",
              "idiomatic": "He gathered the remaining Yin people and enfeoffed Kang Shu at Wei, enfeoffed Wei Zi at Song, to continue the Yin sacrifices.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "寧淮夷東土，二年而畢定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pacified Huai Yi eastern lands, two years and completely settled.",
              "idiomatic": "He pacified the Huai Yi barbarians in the eastern lands, and in two years it was completely settled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "諸侯咸服宗周。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Feudal lords all submitted honored Zhou.",
              "idiomatic": "All the feudal lords submitted and honored Zhou.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0049",
          "zh": "天降祉福，唐叔得禾，異母同穎，獻之成王，成王命唐叔以餽周公於東土，作餽禾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Heaven descended fortune blessing, Tang Shu obtained grain, different stalks same head, presented to Cheng Wang, Cheng Wang commanded Tang Shu with present Zhou Gong at eastern lands, made Present Grain.",
              "idiomatic": "Heaven sent down fortune and blessing. Tang Shu obtained grain with different stalks but the same head. He presented it to King Cheng. King Cheng commanded Tang Shu to present it to the Duke of Zhou in the eastern lands, and composed the 'Present Grain' ode.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "周公既受命禾，嘉天子命，作嘉禾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong already received commanded grain, praised Son of Heaven command, made Praise Grain.",
              "idiomatic": "The Duke of Zhou having received the commanded grain, praised the Son of Heaven's command, and composed the 'Praise Grain' ode.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "東土以集，周公歸報成王，乃為詩貽王，命之曰鴟鸮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eastern lands thereby gathered, Zhou Gong returned reported Cheng Wang, then made poem gave to Wang, named it Owl.",
              "idiomatic": "The eastern lands were thereby gathered together. The Duke of Zhou returned and reported to King Cheng. He then composed a poem and presented it to the king, naming it 'Owl'.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "王亦未敢訓周公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wang also not dared instruct Zhou Gong.",
              "idiomatic": "The king also did not dare to instruct the Duke of Zhou.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "成王七年二月乙未，王朝步自周，至豐，使太保召公先之雒相土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang seventh year second month yi wei, wang morning walked from Zhou, arrived Feng, made Tai Bao Shao Gong precede to Luo survey land.",
              "idiomatic": "In King Cheng's seventh year, second month, day yi wei, the king walked from Zhou to Feng in the morning, and sent the Grand Protector Duke Shao ahead to survey the land at Luo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "其三月，周公往營成周雒邑，卜居焉，曰吉，遂國之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Its third month, Zhou Gong went planned Cheng Zhou Luo city, divined dwelling there, said auspicious, then established state there.",
              "idiomatic": "In the third month, the Duke of Zhou went to plan Chengzhou at Luoyi. He divined about dwelling there, and it was auspicious, so he established the state there.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "成王長，能聽政。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang grown up, able listen to government.",
              "idiomatic": "King Cheng had grown up and was able to handle government affairs.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "於是周公乃還政於成王，成王臨朝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore Zhou Gong then returned government to Cheng Wang, Cheng Wang presided over court.",
              "idiomatic": "The Duke of Zhou therefore returned the government to King Cheng, and King Cheng presided over the court.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "周公之代成王治，南面倍依以朝諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong's substitute Cheng Wang govern, south face doubled support to receive feudal lords.",
              "idiomatic": "When the Duke of Zhou substituted for King Cheng in governing, he faced south and leaned on doubled supports to receive the feudal lords.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "及七年後，還政成王，北面就臣位，匔匔如畏然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When seven years later, returned government Cheng Wang, north face took minister position, fearful fearful as if afraid thus.",
              "idiomatic": "When seven years had passed, he returned the government to King Cheng, faced north to take his position as minister, appearing fearful and apprehensive.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0059",
          "zh": "初，成王少時，病，周公乃自揃其蚤沈之河，以祝於神曰：「王少未有識，奸神命者乃旦也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially, Cheng Wang young time, ill, Zhou Gong then self cut his nails sank river, to pray to spirits said: 'Wang young not have knowledge, violate spirit command is Dan.'",
              "idiomatic": "Originally, when King Cheng was young and ill, the Duke of Zhou cut off his own fingernails and sank them in the river, praying to the spirits: 'The king is young and has no knowledge. If anyone violates the spirits' commands, let it be Dan.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "亦藏其策於府。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Also hid his bamboo slips in treasury.",
              "idiomatic": "He also hid the bamboo slips in the treasury.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "成王病有瘳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang illness had recovery.",
              "idiomatic": "King Cheng's illness improved.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "及成王用事，人或譖周公，周公奔楚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Cheng Wang handled affairs, people or slandered Zhou Gong, Zhou Gong fled Chu.",
              "idiomatic": "When King Cheng began handling affairs, some people slandered the Duke of Zhou, so the Duke of Zhou fled to Chu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "成王發府，見周公禱書，乃泣，反周公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang opened treasury, saw Zhou Gong prayer writing, then wept, recalled Zhou Gong.",
              "idiomatic": "King Cheng opened the treasury and saw the Duke of Zhou's prayer writings. He wept and recalled the Duke of Zhou.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0064",
          "zh": "周公歸，恐成王壯，治有所淫佚，乃作多士，作毋逸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong returned, feared Cheng Wang mature, governance have excess indulgence, then made Many Officers, made No Indulgence.",
              "idiomatic": "Upon returning, the Duke of Zhou feared that when King Cheng matured, his governance might become excessive and indulgent. He therefore composed 'Many Officers' and 'No Indulgence.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "毋逸稱：「為人父母，為業至長久，子孫驕奢忘之，以亡其家，為人子可不慎乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "No Indulgence says: 'Be person parents, enterprise to very long lasting, descendants extravagant luxurious forget it, to lose their family, be person son can not careful?'",
              "idiomatic": "'No Indulgence' states: 'To be parents, the enterprise must be very long-lasting. If descendants become extravagant and luxurious and forget this, they will lose their family. As a son, can one not be careful?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "笔昔在殷王中宗，嚴恭敬畏天命，自度治民，震懼不敢荒寧，故中宗饗國七十五年。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Formerly in Yin Wang Zhong Zong, strict reverent fearful heaven mandate, self measured governed people, trembled feared dared not neglect peaceful, therefore Zhong Zong enjoyed state seventy-five years.",
              "idiomatic": "Formerly, King Zhong Zong of Yin was strict, reverent, and fearful of heaven's mandate. He personally measured and governed the people, trembled in fear and dared not neglect his duties in peace. Therefore Zhong Zong enjoyed the state for seventy-five years.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "其在高宗，久勞于外，為與小人，作其即位，乃有亮闇，三年不言，言乃讙，不敢荒寧，密靖殷國，至于小大無怨，故高宗饗國五十五年。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Gao Zong, long labored outside, served with petty men, made his ascension, then had mourning period, three years not speak, spoke then clear, dared not neglect peaceful, secretly pacified Yin state, to small great no resentment, therefore Gao Zong enjoyed state fifty-five years.",
              "idiomatic": "In the case of Gao Zong, he long labored outside and served with petty men. When he ascended, he observed a mourning period, not speaking for three years. When he spoke, it was clear. He dared not neglect his peaceful duties, secretly pacified the Yin state, so that from small to great none had resentment. Therefore Gao Zong enjoyed the state for fifty-five years.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "其在祖甲，不義惟王，久為小人于外，知小人之依，能保施小民，不侮寡，故祖甲饗國三十三年。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Zu Jia, not righteous only king, long served as petty man outside, knew petty men's dependence, able protect apply to small people, not insult few, therefore Zu Jia enjoyed state thirty-three years.'",
              "idiomatic": "In the case of Zu Jia, he was not righteous, only acting as king. He long served as a petty man outside, knew the petty men's dependence, was able to protect and apply to the small people, did not insult the few. Therefore Zu Jia enjoyed the state for thirty-three years.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "多士稱曰：「自湯至于帝乙，無不率祀明德，帝無不配天者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Many Officers says: 'From Tang to Di Yi, none not followed sacrifices bright virtue, emperors none not matched heaven.",
              "idiomatic": "Many Officers states: 'From Tang to Di Yi, none failed to follow the sacrifices and bright virtue. The emperors, none failed to match heaven.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "在今後嗣王紂，誕淫厥佚，不顧天及民之從也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now later successor Wang Zhou, greatly licentious his indulgence, not regard heaven and people's following.",
              "idiomatic": "Now the later successor King Zhou was greatly licentious in his indulgence, not regarding heaven and the people's following.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "其民皆可誅。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His people all may be executed.'",
              "idiomatic": "His people could all be executed.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "（周多士）「文王日中昃不暇食，饗國五十年。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "(Zhou Many Officers) 'Wen Wang sun midday set no leisure eat, enjoyed state fifty years.'",
              "idiomatic": "(Zhou Many Officers) 'King Wen, from midday until sunset, had no leisure to eat. He enjoyed the state for fifty years.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "作此以誡成王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Made this to admonish Cheng Wang.",
              "idiomatic": "He composed this to admonish King Cheng.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0074",
          "zh": "成王在豐，天下已安，周之官政未次序，於是周公作周官，官別其宜，作立政，以便百姓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang in Feng, world already peaceful, Zhou's official government not in order, therefore Zhou Gong made Zhou Officers, officials distinguished their suitability, made Establish Government, to benefit common people.",
              "idiomatic": "King Cheng was in Feng, the world was already peaceful, but Zhou's official government was not in order. Therefore the Duke of Zhou composed 'Zhou Officers,' distinguishing officials' suitability, and composed 'Establish Government' to benefit the common people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "百姓說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Common people pleased.",
              "idiomatic": "The common people were pleased.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "周公在豐，病，將沒，曰：「必葬我成周，以明吾不敢離成王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong in Feng, ill, about to die, said: 'Must bury me Cheng Zhou, to make clear I dare not separate from Cheng Wang.'",
              "idiomatic": "The Duke of Zhou was in Feng, ill, about to die. He said: 'You must bury me in Chengzhou, to make clear that I dare not separate from King Cheng.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "周公既卒，成王亦讓，葬周公於畢，從文王，以明予小子不敢臣周公也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong already died, Cheng Wang also declined, buried Zhou Gong at Bi, following Wen Wang, to make clear my boy dare not minister Zhou Gong.",
              "idiomatic": "After the Duke of Zhou died, King Cheng also declined (the honor), and buried the Duke of Zhou at Bi, following King Wen, to make clear that this young one dares not treat the Duke of Zhou as a minister.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0078",
          "zh": "周公卒後，秋未穫，暴風雷［雨］，禾盡偃，大木盡拔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong died after, autumn not yet harvest, violent wind thunder [rain], grain all flattened, great trees all uprooted.",
              "idiomatic": "After the Duke of Zhou died, in autumn before the harvest, there was violent wind, thunder, and rain. All the grain was flattened, and great trees were all uprooted.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "周國大恐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou state greatly fearful.",
              "idiomatic": "The Zhou state was greatly fearful.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "成王與大夫朝服以開金縢書，王乃得周公所自以為功代武王之說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang with grand officers court robes opened gold wrapped writings, wang then obtained Zhou Gong what self offered as pledge substituted Wu Wang sayings.",
              "idiomatic": "King Cheng, together with the grand officers in court robes, opened the gold-wrapped writings. The king then obtained the Duke of Zhou's statements about offering himself as pledge to substitute for King Wu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "二公及王乃問史百執事，史百執事曰：「信有，昔周公命我勿敢言。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Two dukes and wang then asked scribe hundred officials, scribe hundred officials said: 'Truly have, formerly Zhou Gong commanded me dare not speak.'",
              "idiomatic": "The two dukes and the king then questioned the scribe and the hundred officials. The scribe and hundred officials said: 'It truly exists. Formerly the Duke of Zhou commanded us not to dare speak of it.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "成王執書以泣，曰：「自今後其無繆卜乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang held writings wept, said: 'From now after perhaps no false divination!'",
              "idiomatic": "King Cheng held the writings and wept, saying: 'From now on there will be no more false divinations!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "昔周公勤勞王家，惟予幼人弗及知。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Formerly Zhou Gong diligent labored royal family, only my young person not reached know.",
              "idiomatic": "Formerly the Duke of Zhou diligently labored for the royal family, but only this young one did not reach understanding.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "今天動威以彰周公之德，惟朕小子其迎，我國家禮亦宜之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now heaven moved awe to make clear Zhou Gong virtue, only Our boy should welcome, our state ceremony also suitable it.'",
              "idiomatic": "Now heaven has moved in awe to make clear the Duke of Zhou's virtue. Only this boy should welcome it. Our state's ceremonies are also suitable for it.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "王出郊，天乃雨，反風，禾盡起。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wang went out suburbs, heaven then rained, reversed wind, grain all rose.",
              "idiomatic": "The king went out to the suburbs. Heaven then rained, the wind reversed, and all the grain stood up.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "二公命國人，凡大木所偃，盡起而筑之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Two dukes commanded state people, all great trees what flattened, completely raise and prop them.",
              "idiomatic": "The two dukes commanded the people of the state to raise and prop up all the great trees that had been flattened.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "歲則大孰。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Year then greatly ripe.",
              "idiomatic": "The year then had a great harvest.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "於是成王乃命魯得郊祭文王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore Cheng Wang then commanded Lu obtain suburban sacrifice Wen Wang.",
              "idiomatic": "Therefore King Cheng then commanded that Lu be allowed to perform the suburban sacrifice to King Wen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "魯有天子禮樂者，以褒周公之德也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu has Son of Heaven ceremonies music, to praise Zhou Gong virtue.",
              "idiomatic": "Lu having the Son of Heaven's ceremonies and music was to praise the Duke of Zhou's virtue.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "周公卒，子伯禽固已前受封，是為魯公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong died, son Bo Qin originally already beforehand received enfeoffment, this was Lu Gong.",
              "idiomatic": "After the Duke of Zhou died, his son Bo Qin had already previously received the enfeoffment and became Duke of Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "魯公伯禽之初受封之魯，三年而後報政周公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu Gong Bo Qin initially received enfeoffment Lu, three years then after reported government Zhou Gong.",
              "idiomatic": "When Duke Bo Qin of Lu initially received the enfeoffment of Lu, it was three years later that he reported on the government to the Duke of Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "周公曰：「何遲也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong said: 'Why late?'",
              "idiomatic": "The Duke of Zhou said: 'Why so late?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "伯禽曰：「變其俗，革其禮，喪三年然後除之，故遲。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo Qin said: 'Change their customs, reform their rites, mourning three years then after remove it, therefore late.'",
              "idiomatic": "Bo Qin said: 'I had to change their customs and reform their rites. The mourning lasted three years before it could be ended, which is why it was late.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "太公亦封於齊，五月而報政周公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tai Gong also enfeoffed at Qi, five months then reported government Zhou Gong.",
              "idiomatic": "The Grand Duke was also enfeoffed at Qi, and reported on the government to the Duke of Zhou after five months.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "周公曰：「何疾也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou Gong said: 'Why quick?'",
              "idiomatic": "The Duke of Zhou said: 'Why so quick?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "曰：「吾簡其君臣禮，從其俗為也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Said: 'I simplified their ruler minister rites, followed their customs did it.'",
              "idiomatic": "He said: 'I simplified their ruler and minister rites, following their customs in doing so.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "及後聞伯禽報政遲，乃嘆曰：「嗚呼，魯後世其北面事齊矣！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When later heard Bo Qin reported government late, then sighed said: 'Alas, Lu later generations perhaps north face serve Qi!'",
              "idiomatic": "When he later heard that Bo Qin reported on the government late, he sighed and said: 'Alas! Lu's later generations will perhaps face north and serve Qi!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "夫政不簡不易，民不有近；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Indeed government not simple not easy, people not have near;",
              "idiomatic": "Indeed, if government is not simple and easy, the people will not draw near;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "平易近民，民必歸之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Peaceful easy near people, people must return to it.'",
              "idiomatic": "If it is peaceful and easy, drawing near to the people, the people will surely return to it.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "伯禽即位之後，有管、蔡等反也，淮夷、徐戎亦并興反。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo Qin ascended position after, had Guan, Cai etc. rebel, Huai Yi, Xu Rong also together arose rebel.",
              "idiomatic": "After Bo Qin ascended to his position, Guan, Cai, and others rebelled, and the Huai barbarians and Xu Rong also arose together in rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "於是伯禽率師伐之於肸，作肸誓，曰：「陳爾甲胄，無敢不善。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore Bo Qin led troops attacked them at Xi, made Xi oath, said: 'Array your armor helmets, none dare not good.",
              "idiomatic": "Therefore Bo Qin led troops to attack them at Xi, and composed the Xi Oath, saying: 'Array your armor and helmets. None dare be not good.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "無敢傷牿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "None dare wound pregnant.",
              "idiomatic": "None dare wound the pregnant.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "馬牛其風，臣妾逋逃，勿敢越逐，敬復之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Horses oxen their herd, ministers concubines fled, do not dare cross pursue, respectfully return them.",
              "idiomatic": "For horses and oxen in their herds, and for ministers and concubines who have fled, do not dare cross boundaries to pursue them. Respectfully return them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "無敢寇攘，踰墻垣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "None dare plunder seize, cross walls fences.",
              "idiomatic": "None dare plunder or seize, or cross walls and fences.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "魯人三郊三隧，峙爾芻茭、糗糧、楨榦，無敢不逮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu people three suburbs three tunnels, prepare your fodder reeds, dry grain, timber beams, none dare not arrive.",
              "idiomatic": "Lu people of the three suburbs and three tunnels, prepare your fodder and reeds, dry rations, and timber beams. None dare fail to arrive.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "我甲戌筑而征徐戎，無敢不及，有大刑。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I armor day build to campaign Xu Rong, none dare not arrive, have great punishment.'",
              "idiomatic": "On the day jia-xu we build fortifications and campaign against the Xu Rong. None dare fail to arrive, or face great punishment.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "作此肸誓，遂平徐戎，定魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Made this Xi oath, then pacified Xu Rong, settled Lu.",
              "idiomatic": "He composed this Xi Oath, then pacified the Xu Rong and settled Lu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "魯公伯禽卒，子考公酋立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu Gong Bo Qin died, son Kao Gong Qiu ascended.",
              "idiomatic": "Duke Bo Qin of Lu died, and his son Duke Kao Qiu ascended.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "考公四年卒，立弟熙，是謂煬公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Kao Gong fourth year died, established younger brother Xi, this called Yang Gong.",
              "idiomatic": "Duke Kao died in his fourth year, and his younger brother Xi was established as Duke Yang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "煬公筑茅闕門。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yang Gong built thatched gate tower.",
              "idiomatic": "Duke Yang built the thatched gate tower.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "六年卒，子幽公宰立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth year died, son You Gong Zai ascended.",
              "idiomatic": "He died in the sixth year, and his son Duke You Zai ascended.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "幽公十四年。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "You Gong fourteenth year.",
              "idiomatic": "Duke You's fourteenth year.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "幽公弟沸殺幽公而自立，是為魏公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "You Gong younger brother Fei killed You Gong and self ascended, this was Wei Gong.",
              "idiomatic": "Duke You's younger brother Fei killed Duke You and ascended himself, becoming Duke Wei.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "魏公五十年卒，子厲公擢立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wei Gong fiftieth year died, son Li Gong Zhuo ascended.",
              "idiomatic": "Duke Wei died in his fiftieth year, and his son Duke Li Zhuo ascended.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "厲公三十七年卒，魯人立其弟具，是為獻公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Li Gong thirty-seventh year died, Lu people established his younger brother Ju, this was Xian Gong.",
              "idiomatic": "Duke Li died in his thirty-seventh year, and the Lu people established his younger brother Ju as Duke Xian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "獻公三十二年卒，子真公濞立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xian Gong thirty-second year died, son Zhen Gong Bi ascended.",
              "idiomatic": "Duke Xian died in his thirty-second year, and his son Duke Zhen Bi ascended.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0118",
          "zh": "真公十四年，周厲王無道，出奔彘，共和行政。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhen Gong fourteenth year, Zhou Li Wang without way, fled to Zhi, Gong He administered government.",
              "idiomatic": "In Duke Zhen's fourteenth year, King Li of Zhou behaved without moral principle, fled to Zhi, and Gong He administered the government.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "二十九年，周宣王即位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-ninth year, Zhou Xuan Wang ascended throne.",
              "idiomatic": "In the twenty-ninth year, King Xuan of Zhou ascended the throne.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0120",
          "zh": "三十年，真公卒，弟敖立，是為武公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirtieth year, Zhen Gong died, younger brother Ao ascended, this was Wu Gong.",
              "idiomatic": "In the thirtieth year, Duke Zhen died, and his younger brother Ao ascended as Duke Wu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0121",
          "zh": "武公九年春，武公與長子括，少子戲，西朝周宣王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Gong ninth year spring, Wu Gong with eldest son Kuo, youngest son Xi, west audience Zhou Xuan Wang.",
              "idiomatic": "In Duke Wu's ninth year, spring, Duke Wu together with his eldest son Kuo and youngest son Xi went west to audience King Xuan of Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "宣王愛戲，欲立戲為魯太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xuan Wang loved Xi, desired establish Xi as Lu crown prince.",
              "idiomatic": "King Xuan loved Xi and desired to establish Xi as the Lu crown prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "周之樊仲山父諫宣王曰：「廢長立少，不順；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou's Fan Zhong Shan Fu admonished Xuan Wang said: 'Abolish eldest establish youngest, not proper;",
              "idiomatic": "Zhou's Fan Zhong Shan Fu admonished King Xuan, saying: 'To abolish the eldest and establish the youngest is not proper;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "不順，必犯王命；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not proper, must violate wang command;",
              "idiomatic": "If not proper, it must violate the king's command;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "犯王命，必誅之：故出令不可不順也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Violate wang command, must execute them: therefore issue commands cannot not proper.",
              "idiomatic": "To violate the king's command must be punished with execution. Therefore, issuing commands cannot be improper.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "令之不行，政之不立；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Commands not carried out, government not established;",
              "idiomatic": "If commands are not carried out, government is not established;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "行而不順，民將棄上。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Carried out but not proper, people will abandon superiors.",
              "idiomatic": "If carried out but improper, the people will abandon their superiors.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "夫下事上，少事長，所以為順。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Indeed inferior serves superior, young serves old, this is proper.",
              "idiomatic": "Indeed, inferiors serving superiors, the young serving the old—this is what is proper.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "今天子建諸侯，立其少，是教民逆也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Son of Heaven establishes feudal lords, establishes their young, this teaches people rebellion.",
              "idiomatic": "Now the Son of Heaven establishes feudal lords, establishing their youngest—this teaches the people rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "若魯從之，諸侯效之，王命將有所壅；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If Lu follows it, feudal lords imitate it, wang command will be obstructed;",
              "idiomatic": "If Lu follows this, the feudal lords will imitate it, and the king's commands will be obstructed;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "若弗從而誅之，是自誅王命也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If not follow and execute them, this is self executing wang command.",
              "idiomatic": "If they do not follow and you execute them, this is self-executing the king's command.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "誅之亦失，不誅亦失，王其圖之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Execute them also loss, not execute also loss, wang should consider it.'",
              "idiomatic": "To execute them is also a loss, not to execute them is also a loss. Your Majesty should consider this.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "宣王弗聽，卒立戲為魯太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xuan Wang not listen, finally established Xi as Lu crown prince.",
              "idiomatic": "King Xuan did not listen and finally established Xi as the Lu crown prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "夏，武公歸而卒，戲立，是為懿公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, Wu Gong returned and died, Xi ascended, this was Yi Gong.",
              "idiomatic": "In summer, Duke Wu returned and died, Xi ascended as Duke Yi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "懿公九年，懿公兄括之子伯御與魯人攻弒懿公，而立伯御為君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Gong ninth year, Yi Gong elder brother Kuo's son Bo Yu with Lu people attacked assassinated Yi Gong, and established Bo Yu as ruler.",
              "idiomatic": "In Duke Yi's ninth year, Bo Yu, son of Duke Yi's elder brother Kuo, together with Lu people attacked and assassinated Duke Yi, establishing Bo Yu as ruler.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "伯御即位十一年，周宣王伐魯，殺其君伯御，而問魯公子能道順諸侯者，以為魯後。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo Yu ascended throne eleventh year, Zhou Xuan Wang attacked Lu, killed their ruler Bo Yu, and asked Lu noble sons able properly govern feudal lords, to be Lu successor.",
              "idiomatic": "In Bo Yu's eleventh year on the throne, King Xuan of Zhou attacked Lu, killed their ruler Bo Yu, and asked which Lu noble son was able to properly govern the feudal lords, to be the Lu successor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "樊穆仲曰：「魯懿公弟稱，肅恭明神，敬事耆老；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fan Mu Zhong said: 'Lu Yi Gong younger brother Cheng, solemn reverent bright spirits, respectfully served elders;",
              "idiomatic": "Fan Mu Zhong said: 'Duke Yi of Lu's younger brother Cheng is solemn and reverent toward the bright spirits, respectfully serves the elders;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "賦事行刑，必問於遺訓而咨於固實；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Assign affairs execute punishments, must ask of inherited instructions and consult with established precedents;",
              "idiomatic": "In assigning affairs and executing punishments, he must ask about the inherited instructions and consult with established precedents;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "不干所問，不犯所（知）［咨］。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not interfere with what questioned, not violate what consulted.'",
              "idiomatic": "He does not interfere with what is questioned, does not violate what is consulted.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "宣王曰：「然，能訓治其民矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xuan Wang said: 'Correct, able instruct govern their people.'",
              "idiomatic": "King Xuan said: 'Correct, he is able to instruct and govern their people.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "乃立稱於夷宮，是為孝公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then established Cheng at Yi Palace, this was Xiao Gong.",
              "idiomatic": "He then established Cheng at Yi Palace as Duke Xiao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "自是後，諸侯多畔王命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From this after, feudal lords many rebelled wang commands.",
              "idiomatic": "From this time on, many feudal lords rebelled against the king's commands.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0143",
          "zh": "孝公二十五年，諸侯畔周，犬戎殺幽王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiao Gong twenty-fifth year, feudal lords rebelled Zhou, Quan Rong killed You Wang.",
              "idiomatic": "In Duke Xiao's twenty-fifth year, the feudal lords rebelled against Zhou, and the Quan Rong killed King You.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "秦始列為諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qin began ranked as feudal lords.",
              "idiomatic": "Qin began to be ranked as feudal lords.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0145",
          "zh": "二十七年，孝公卒，子弗湟立，是為惠公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-seventh year, Xiao Gong died, son Fu Nai ascended, this was Hui Gong.",
              "idiomatic": "In the twenty-seventh year, Duke Xiao died, and his son Fu Nai ascended as Duke Hui.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0146",
          "zh": "惠公三十年，晉人弒其君昭侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hui Gong thirtieth year, Jin people assassinated their ruler Zhao Hou.",
              "idiomatic": "In Duke Hui's thirtieth year, the Jin people assassinated their ruler Duke Zhao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "四十五年，晉人又弒其君孝侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Forty-fifth year, Jin people again assassinated their ruler Xiao Hou.",
              "idiomatic": "In the forty-fifth year, the Jin people again assassinated their ruler Duke Xiao.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "四十六年，惠公卒，長庶子息攝當國，行君事，是為隱公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Forty-sixth year, Hui Gong died, eldest concubine son Xi acted for state, carried out ruler affairs, this was Yin Gong.",
              "idiomatic": "In the forty-sixth year, Duke Hui died, and his eldest concubine-born son Xi acted for the state and carried out ruler affairs as Duke Yin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "初，惠公適夫人無子，公賤妾聲子生子息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially, Hui Gong proper wife without sons, gong lowly concubine Sheng Zi gave birth son Xi.",
              "idiomatic": "Originally, Duke Hui's proper wife had no sons, so the duke's lowly concubine Sheng Zi gave birth to the son Xi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "息長，為娶於宋。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi grew up, for him took wife in Song.",
              "idiomatic": "When Xi grew up, a wife was taken for him from Song.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "宋女至而好，惠公奪而自妻之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Song woman arrived and beautiful, Hui Gong seized and personally married her.",
              "idiomatic": "The Song woman arrived and was beautiful, so Duke Hui seized her and personally married her.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "生子允。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gave birth son Yun.",
              "idiomatic": "She gave birth to the son Yun.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "登宋女為夫人，以允為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Elevated Song woman as wife, with Yun as crown prince.",
              "idiomatic": "He elevated the Song woman to be his wife and made Yun the crown prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "及惠公卒，為允少故，魯人共令息攝政，不言即位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Hui Gong died, because Yun young reason, Lu people together commanded Xi act as government, not speak ascending throne.",
              "idiomatic": "When Duke Hui died, because Yun was young, the Lu people together commanded Xi to act as regent, without speaking of ascending the throne.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0155",
          "zh": "隱公五年，觀漁於棠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yin Gong fifth year, watched fishing at Tang.",
              "idiomatic": "In Duke Yin's fifth year, he watched fishing at Tang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "八年，與鄭易天子之太山之邑祊及許田，君子譏之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth year, with Zheng exchanged Son of Heaven's Tai Shan city Bang and Xu fields, noble men criticized it.",
              "idiomatic": "In the eighth year, he exchanged with Zheng the Son of Heaven's Tai Shan city of Bang and Xu fields. The noble men criticized this.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "十一年冬，公子揮諂謂隱公曰：「百姓便君，君其遂立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh year winter, noble son Hui flattered said to Yin Gong: 'Common people convenient lord, lord should then establish.",
              "idiomatic": "In the eleventh year, winter, the noble son Hui flattered Duke Yin, saying: 'The common people are convenient to you as lord. You should then establish yourself.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "吾請為君殺子允，君以我為相。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I request for lord kill son Yun, lord make me prime minister.'",
              "idiomatic": "I request to kill the son Yun for you, my lord. Make me your prime minister.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "隱公曰：「有先君命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yin Gong said: 'There is former lord command.",
              "idiomatic": "Duke Yin said: 'There is the former lord's command.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "吾為允少，故攝代。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I because Yun young, therefore acted substitute.",
              "idiomatic": "Because Yun was young, I therefore acted as substitute.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "今允長矣，吾方營菟裘之地而老焉，以授子允政。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Yun grown up, I just manage Tu Qiu land and grow old there, to hand over son Yun government.'",
              "idiomatic": "Now Yun has grown up. I am just going to manage the Tu Qiu lands and grow old there, to hand over the government to the son Yun.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "揮懼子允聞而反誅之，乃反譖隱公於子允曰：「隱公欲遂立，去子，子其圖之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hui feared son Yun heard and instead executed him, then instead slandered Yin Gong to son Yun said: 'Yin Gong desires then establish, remove son, son should plan it.",
              "idiomatic": "Hui feared that if the son Yun heard this he would instead execute him, so he instead slandered Duke Yin to the son Yun, saying: 'Duke Yin desires to then establish himself and remove you, son. You should plan for it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "請為子殺隱公。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Request for son kill Yin Gong.'",
              "idiomatic": "I request to kill Duke Yin for you.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "子允許諾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Son Yun permitted agreed.",
              "idiomatic": "The son Yun permitted and agreed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "十一月，隱公祭鐘巫，齊于社圃，館于蒍氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh month, Yin Gong sacrificed Zhong Wu, purified at She Pu, lodged at Wei Shi.",
              "idiomatic": "In the eleventh month, Duke Yin sacrificed to Zhong Wu, purified himself at She Pu, and lodged at the Wei family.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "揮使人殺隱公于蒍氏，而立子允為君，是為桓公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hui made people kill Yin Gong at Wei Shi, and established son Yun as ruler, this was Huan Gong.",
              "idiomatic": "Hui had people kill Duke Yin at the Wei family, and established the son Yun as ruler, who became Duke Huan.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "桓公元年，鄭以璧易天子之許田。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong first year, Zheng with jade disc exchanged Son of Heaven's Xu fields.",
              "idiomatic": "In Duke Huan's first year, Zheng exchanged the Son of Heaven's Xu fields with a jade disc.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "二年，以宋之賂鼎入於太廟，君子譏之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year, with Song's bribe tripod entered great temple, noble men criticized it.",
              "idiomatic": "In the second year, he brought Song's bribe tripod into the great temple. The noble men criticized this.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0169",
          "zh": "三年，使揮迎婦于齊為夫人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year, made Hui welcome woman from Qi to be wife.",
              "idiomatic": "In the third year, he had Hui welcome a woman from Qi to be his wife.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "六年，夫人生子，與桓公同日，故名曰同。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth year, wife gave birth son, same day as Huan Gong, therefore named said Tong.",
              "idiomatic": "In the sixth year, his wife gave birth to a son on the same day as Duke Huan's birth, so he was named Tong.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "同長，為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tong grew up, became crown prince.",
              "idiomatic": "When Tong grew up, he became the crown prince.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0172",
          "zh": "十六年，會于曹，伐鄭，入厲公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixteenth year, assembled at Cao, attacked Zheng, entered Li Gong.",
              "idiomatic": "In the sixteenth year, he assembled at Cao, attacked Zheng, and installed Duke Li.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0173",
          "zh": "十八年春，公將有行，遂與夫人如齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighteenth year spring, gong will have journey, then with wife went to Qi.",
              "idiomatic": "In the eighteenth year, spring, the duke was about to undertake a journey, and went with his wife to Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "申繻諫止，公不聽，遂如齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shen Xu admonished stopped, gong not listen, then went to Qi.",
              "idiomatic": "Shen Xu admonished him to stop, but the duke did not listen and went to Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "齊襄公通桓公夫人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Xiang Gong had illicit relations with Huan Gong wife.",
              "idiomatic": "Duke Xiang of Qi had illicit relations with Duke Huan's wife.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "公怒夫人，夫人以告齊侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong angered wife, wife with told Qi Hou.",
              "idiomatic": "The duke became angry with his wife, and the wife told Duke Xiang of Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "夏四月丙子，齊襄公饗公，公醉，使公子彭生抱魯桓公，因命彭生摺其脅，公死于車。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month bing zi, Qi Xiang Gong feasted gong, gong drunk, made noble son Peng Sheng embrace Lu Huan Gong, then commanded Peng Sheng squeeze his ribs, gong died in chariot.",
              "idiomatic": "Summer, fourth month, day bing-zi, Duke Xiang of Qi feasted the duke. The duke got drunk, so Duke Xiang had the noble son Peng Sheng embrace Duke Huan of Lu, then commanded Peng Sheng to squeeze his ribs. The duke died in his chariot.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "魯人告于齊曰：「寡君畏君之威，不敢寧居，來修好禮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu people reported to Qi said: 'Our orphaned ruler feared lord's might, dared not peaceful residence, came repair good rites.",
              "idiomatic": "The Lu people reported to Qi, saying: 'Our orphaned ruler feared your lordship's might and dared not reside in peace. He came to repair good rites.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "禮成而不反，無所歸咎，請得彭生除丑於諸侯。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rites completed but not return, nowhere place blame, request obtain Peng Sheng remove disgrace among feudal lords.'",
              "idiomatic": "The rites were completed but he did not return. There is nowhere to place the blame. We request to obtain Peng Sheng to remove the disgrace among the feudal lords.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "齊人殺彭生以說魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi people killed Peng Sheng to please Lu.",
              "idiomatic": "The Qi people killed Peng Sheng to please Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "立太子同，是為莊公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established crown prince Tong, this was Zhuang Gong.",
              "idiomatic": "They established the crown prince Tong as Duke Zhuang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "莊公母夫人因留齊，不敢歸魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong mother wife therefore stayed Qi, dared not return Lu.",
              "idiomatic": "Duke Zhuang's mother the wife therefore stayed in Qi and dared not return to Lu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0183",
          "zh": "莊公五年冬，伐衛，內衛惠公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong fifth year winter, attacked Wei, installed Wei Hui Gong.",
              "idiomatic": "In Duke Zhuang's fifth year, winter, he attacked Wei and installed Duke Hui of Wei.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0184",
          "zh": "八年，齊公子糾來奔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth year, Qi noble son Jiu came fleeing.",
              "idiomatic": "In the eighth year, the Qi noble son Jiu came fleeing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "九年，魯欲內子糾於齊，後桓公，桓公發兵擊魯，魯急，殺子糾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth year, Lu desired install son Jiu in Qi, support Huan Gong, Huan Gong sent troops attacked Lu, Lu urgent, killed son Jiu.",
              "idiomatic": "In the ninth year, Lu desired to install the son Jiu in Qi, supporting Duke Huan. Duke Huan sent troops to attack Lu. Lu was in dire straits and killed the son Jiu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "召忽死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Hu died.",
              "idiomatic": "Zhao Hu died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "齊告魯生致管仲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi told Lu deliver Guan Zhong alive.",
              "idiomatic": "Qi informed Lu to deliver Guan Zhong alive.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "魯人施伯曰：「齊欲得管仲，非殺之也，將用之，用之則為魯患。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu person Shi Bo said: 'Qi desires obtain Guan Zhong, not kill him, will use him, using him then becomes Lu calamity.",
              "idiomatic": "The Lu person Shi Bo said: 'Qi desires to obtain Guan Zhong. They will not kill him but will use him. If they use him, he will become a calamity for Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "不如殺，以其尸與之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not as good kill, with his corpse give them.'",
              "idiomatic": "It would be better to kill him and give them his corpse.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "莊公不聽，遂囚管仲與齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong not listen, then imprisoned Guan Zhong gave to Qi.",
              "idiomatic": "Duke Zhuang did not listen and imprisoned Guan Zhong to give to Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "齊人相管仲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi people made Guan Zhong prime minister.",
              "idiomatic": "The Qi people made Guan Zhong their prime minister.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0192",
          "zh": "十三年，魯莊公與曹沬會齊桓公於柯，曹沬劫齊桓公，求魯侵地，已盟而釋桓公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirteenth year, Lu Zhuang Gong with Cao Mei assembled Qi Huan Gong at Ke, Cao Mei kidnapped Qi Huan Gong, demanded Lu invaded lands, already allied then released Huan Gong.",
              "idiomatic": "In the thirteenth year, Duke Zhuang of Lu together with Cao Mei assembled Duke Huan of Qi at Ke. Cao Mei kidnapped Duke Huan of Qi, demanding the lands Lu had invaded. After they allied, he released Duke Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "桓公欲背約，管仲諫，卒歸魯侵地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong desired renege agreement, Guan Zhong admonished, finally returned Lu invaded lands.",
              "idiomatic": "Duke Huan desired to renege on the agreement, but Guan Zhong admonished him, and he finally returned the Lu invaded lands.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "十五年，齊桓公始霸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, Qi Huan Gong began hegemony.",
              "idiomatic": "In the fifteenth year, Duke Huan of Qi began his hegemony.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "二十三年，莊公如齊觀社。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-third year, Zhuang Gong went to Qi observed She sacrifice.",
              "idiomatic": "In the twenty-third year, Duke Zhuang went to Qi to observe the She sacrifice.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0196",
          "zh": "三十二年，初，莊公筑臺臨黨氏，見孟女，說而愛之，許立為夫人，割臂以盟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-second year, initially, Zhuang Gong built tower overlooking Dang Shi, saw Meng woman, pleased and loved her, promised establish as wife, cut arm to covenant.",
              "idiomatic": "In the thirty-second year, initially, Duke Zhuang built a tower overlooking the Dang family, saw the Meng woman, was pleased and loved her, promised to establish her as his wife, and cut his arm to make a covenant.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "孟女生子斑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Meng woman gave birth son Ban.",
              "idiomatic": "The Meng woman gave birth to the son Ban.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "斑長，說梁氏女，往觀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ban grew up, pleased Liang Shi woman, went observe.",
              "idiomatic": "When Ban grew up, he was pleased with the Liang family woman and went to observe her.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "圉人犖自墻外與梁氏女戲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Stable man Luo from wall outside with Liang Shi woman flirted.",
              "idiomatic": "The stable man Luo flirted with the Liang family woman from outside the wall.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "斑怒，鞭犖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ban angered, whipped Luo.",
              "idiomatic": "Ban became angry and whipped Luo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "莊公聞之，曰：「犖有力焉，遂殺之，是未可鞭而置也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong heard it, said: 'Luo has strength, then killed him, this not may whip and place.'",
              "idiomatic": "Duke Zhuang heard of it and said: 'Luo had strength in him. He then killed him. This is not something that may be whipped and left.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "斑未得殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ban not yet able kill.",
              "idiomatic": "Ban was not yet able to kill him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "會莊公有疾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Coincidentally Zhuang Gong had illness.",
              "idiomatic": "Coincidentally Duke Zhuang became ill.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "莊公有三弟，長曰慶父，次曰叔牙，次曰季友。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong had three younger brothers, eldest called Qing Fu, next called Shu Ya, next called Ji You.",
              "idiomatic": "Duke Zhuang had three younger brothers: the eldest was called Qing Fu, the next Shu Ya, and the next Ji You.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "莊公取齊女為夫人曰哀姜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong took Qi woman as wife called Ai Jiang.",
              "idiomatic": "Duke Zhuang took a Qi woman as his wife, called Ai Jiang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "哀姜無子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang without sons.",
              "idiomatic": "Ai Jiang had no sons.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "哀姜娣曰叔姜，生子開。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang younger sister called Shu Jiang, gave birth son Kai.",
              "idiomatic": "Ai Jiang's younger sister, called Shu Jiang, gave birth to the son Kai.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "莊公無適嗣，愛孟女，欲立其子斑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong without proper heir, loved Meng woman, desired establish her son Ban.",
              "idiomatic": "Duke Zhuang had no proper heir. He loved the Meng woman and desired to establish her son Ban.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "莊公病，而問嗣於弟叔牙。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong ill, and asked heir from younger brother Shu Ya.",
              "idiomatic": "Duke Zhuang was ill and asked about the heir from his younger brother Shu Ya.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "叔牙曰：「一繼一及，魯之常也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shu Ya said: 'One inherits one reaches, Lu's constant.",
              "idiomatic": "Shu Ya said: 'One inherits, one reaches—the constant practice of Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "慶父在，可為嗣，君何憂？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Fu present, may be heir, lord why worry?'",
              "idiomatic": "Qing Fu is present. He may be the heir. Why does my lord worry?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "莊公患叔牙欲立慶父，退而問季友。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong worried Shu Ya desired establish Qing Fu, withdrew and asked Ji You.",
              "idiomatic": "Duke Zhuang was worried that Shu Ya desired to establish Qing Fu, so he withdrew and asked Ji You.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "季友曰：「請以死立斑也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You said: 'Request with death establish Ban.'",
              "idiomatic": "Ji You said: 'I request to establish Ban, even to the death.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "莊公曰：「曩者叔牙欲立慶父，柰何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong said: 'Formerly Shu Ya desired establish Qing Fu, what to do?'",
              "idiomatic": "Duke Zhuang said: 'Formerly Shu Ya desired to establish Qing Fu. What should be done?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "季友以莊公命命牙待於鍼巫氏，使鍼季劫飲叔牙以鴆，曰：「飲此則有後奉祀；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You with Zhuang Gong command commanded Ya wait at Zhen Wu Shi, made Zhen Ji coerce drink Shu Ya with poison, said: 'Drink this then have descendants serve sacrifices;",
              "idiomatic": "Ji You, with Duke Zhuang's command, commanded Ya to wait at the Zhen Wu family, and had Zhen Ji coerce Shu Ya to drink poison, saying: 'Drink this and you will have descendants to serve the sacrifices;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "不然，死且無後。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not so, die and without descendants.'",
              "idiomatic": "If not, you will die without descendants.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "牙遂飲鴆而死，魯立其子為叔孫氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ya then drank poison died, Lu established his son as Shu Sun clan.",
              "idiomatic": "Ya then drank the poison and died. Lu established his son as the Shu Sun clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "八月癸亥，莊公卒，季友竟立子斑為君，如莊公命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth month gui hai, Zhuang Gong died, Ji You finally established son Ban as ruler, like Zhuang Gong command.",
              "idiomatic": "In the eighth month, day gui-hai, Duke Zhuang died. Ji You finally established the son Ban as ruler, as Duke Zhuang had commanded.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "侍喪，舍于黨氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Served mourning, lodged at Dang Shi.",
              "idiomatic": "He served the mourning and lodged at the Dang family.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "先時慶父與哀姜私通，欲立哀姜娣子開。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Before time Qing Fu with Ai Jiang illicit relations, desired establish Ai Jiang younger sister son Kai.",
              "idiomatic": "Previously Qing Fu had illicit relations with Ai Jiang and desired to establish Ai Jiang's younger sister's son Kai.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "及莊公卒而季友立斑，十月己未，慶父使圉人犖殺魯公子斑於黨氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Zhuang Gong died and Ji You established Ban, tenth month ji wei, Qing Fu made stable man Luo kill Lu noble son Ban at Dang Shi.",
              "idiomatic": "When Duke Zhuang died and Ji You established Ban, in the tenth month, day ji-wei, Qing Fu had the stable man Luo kill the Lu noble son Ban at the Dang family.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "季友奔陳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You fled Chen.",
              "idiomatic": "Ji You fled to Chen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "慶父竟立莊公子開，是為湣公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Fu finally established Zhuang Gong son Kai, this was Min Gong.",
              "idiomatic": "Qing Fu finally established Duke Zhuang's son Kai, who became Duke Min.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0224",
          "zh": "湣公二年，慶父與哀姜通益甚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Min Gong second year, Qing Fu with Ai Jiang illicit relations even more severe.",
              "idiomatic": "In Duke Min's second year, Qing Fu's illicit relations with Ai Jiang became even more severe.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "哀姜與慶父謀殺湣公而立慶父。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang with Qing Fu plotted kill Min Gong and establish Qing Fu.",
              "idiomatic": "Ai Jiang plotted with Qing Fu to kill Duke Min and establish Qing Fu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "慶父使卜齮襲殺湣公於武闈。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Fu made Bu Ni attack kill Min Gong at Wu Wei.",
              "idiomatic": "Qing Fu had Bu Ni attack and kill Duke Min at Wu Wei.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "季友聞之，自陳與湣公弟申如邾，請魯求內之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You heard it, from Chen with Min Gong younger brother Shen went to Zhu, requested Lu seek install him.",
              "idiomatic": "Ji You heard of it and, from Chen together with Duke Min's younger brother Shen, went to Zhu and requested that Lu seek to install him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "魯人欲誅慶父。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu people desired execute Qing Fu.",
              "idiomatic": "The Lu people desired to execute Qing Fu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "慶父恐，奔莒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Fu feared, fled Ju.",
              "idiomatic": "Qing Fu feared and fled to Ju.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "於是季友奉子申入，立之，是為釐公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore Ji You honored son Shen entered, established him, this was Xi Gong.",
              "idiomatic": "Therefore Ji You honored the son Shen and entered, establishing him as Duke Xi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "釐公亦莊公少子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi Gong also Zhuang Gong youngest son.",
              "idiomatic": "Duke Xi was also Duke Zhuang's youngest son.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "哀姜恐，奔邾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang feared, fled Zhu.",
              "idiomatic": "Ai Jiang feared and fled to Zhu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "季友以賂如莒求慶父，慶父歸，使人殺慶父，慶父請奔，弗聽，乃使大夫奚斯行哭而往。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You with bribes went to Ju sought Qing Fu, Qing Fu returned, made people kill Qing Fu, Qing Fu requested flee, not listen, then made grand officer Xi Si perform crying and go.",
              "idiomatic": "Ji You went to Ju with bribes to seek Qing Fu. Qing Fu returned, but Ji You had people kill Qing Fu. Qing Fu requested to flee, but they did not listen. Then he had the grand officer Xi Si perform the crying ritual and go.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "慶父聞奚斯音，乃自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Fu heard Xi Si voice, then committed suicide.",
              "idiomatic": "Qing Fu heard Xi Si's voice and then committed suicide.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "齊桓公聞哀姜與慶父亂以危魯，及召之邾而殺之，以其尸歸，戮之魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Huan Gong heard Ai Jiang with Qing Fu disorder endangered Lu, and summoned her from Zhu killed her, with her corpse returned, displayed her in Lu.",
              "idiomatic": "Duke Huan of Qi heard that Ai Jiang's disorder with Qing Fu endangered Lu, and summoned her from Zhu to kill her. He returned with her corpse and displayed it in Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "魯釐公請而葬之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu Xi Gong requested and buried her.",
              "idiomatic": "Duke Xi of Lu requested and buried her.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0237",
          "zh": "季友母陳女，故亡在陳，陳故佐送季友及子申。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You mother Chen woman, therefore fled in Chen, Chen therefore assisted sent Ji You and son Shen.",
              "idiomatic": "Ji You's mother was a Chen woman, so he had fled to Chen. Chen therefore assisted in sending Ji You and the son Shen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "季友之將生也，父魯桓公使人卜之，曰：「男也，其名曰『友』，閒于兩社，為公室輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You about to be born, father Lu Huan Gong made people divine it, said: 'Male, his name called 'You', between two altars, for ducal chamber auxiliary.",
              "idiomatic": "When Ji You was about to be born, his father Duke Huan of Lu had people divine it, saying: 'It is a male. His name shall be called 'You'. He will be between two altars, an auxiliary for the ducal chamber.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "季友亡，則魯不昌。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You flees, then Lu not prosperous.'",
              "idiomatic": "If Ji You flees, then Lu will not prosper.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "及生，有文在掌曰「友」，遂以名之，號為成季。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When born, had writing on palm said 'You', then with named him, styled as Cheng Ji.",
              "idiomatic": "When he was born, there was writing on his palm that said 'You', so he was named accordingly and styled as Cheng Ji.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "其後為季氏，慶父後為孟氏也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His descendants became Ji clan, Qing Fu descendants became Meng clan.",
              "idiomatic": "His descendants became the Ji clan, Qing Fu's descendants became the Meng clan.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0242",
          "zh": "釐公元年，以汶陽鄪封季友。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi Gong first year, with Wen Yang Mang enfeoffed Ji You.",
              "idiomatic": "In Duke Xi's first year, he enfeoffed Ji You with Wen Yang and Mang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "季友為相。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You became prime minister.",
              "idiomatic": "Ji You became prime minister.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0244",
          "zh": "九年，晉裏克殺其君奚齊、卓子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth year, Jin Li Ke killed their ruler Xi Qi, Zhuo Zi.",
              "idiomatic": "In the ninth year, Jin's Li Ke killed their ruler Xi Qi and Zhuo Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "齊桓公率釐公討晉亂，至高梁而還，立晉惠公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Huan Gong led Xi Gong attacked Jin disorder, arrived Gao Liang then returned, established Jin Hui Gong.",
              "idiomatic": "Duke Huan of Qi led Duke Xi to attack the Jin disorder. They arrived at Gao Liang and then returned, establishing Duke Hui of Jin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "十七年，齊桓公卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Seventeenth year, Qi Huan Gong died.",
              "idiomatic": "In the seventeenth year, Duke Huan of Qi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "二十四年，晉文公即位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-fourth year, Jin Wen Gong ascended throne.",
              "idiomatic": "In the twenty-fourth year, Duke Wen of Jin ascended the throne.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0248",
          "zh": "三十三年，釐公卒，子興立，是為文公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-third year, Xi Gong died, son Xing ascended, this was Wen Gong.",
              "idiomatic": "In the thirty-third year, Duke Xi died, and his son Xing ascended as Duke Wen.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0249",
          "zh": "文公元年，楚太子商臣弒其父成王，代立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wen Gong first year, Chu crown prince Shang Chen assassinated his father Cheng Wang, substituted ascended.",
              "idiomatic": "In Duke Wen's first year, Chu's crown prince Shang Chen assassinated his father King Cheng and substituted in ascending.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "三年，文公朝晉襄父。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year, Wen Gong audience Jin Xiang Fu.",
              "idiomatic": "In the third year, Duke Wen went to audience Duke Xiang of Jin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0251",
          "zh": "十一年十月甲午，魯敗翟于咸，獲長翟喬如，富父終甥舂其喉，以戈殺之，埋其首於子駒之門，以命宣伯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh year tenth month jia wu, Lu defeated Di at Xian, captured long Di Qiao Ru, Fu Fu Zhong Sheng pounded his throat, with spear killed him, buried his head at Zi Ju gate, to command Xuan Bo.",
              "idiomatic": "In the eleventh year, tenth month, day jia-wu, Lu defeated the Di at Xian and captured the long Di Qiao Ru. Fu Fu Zhong Sheng pounded his throat and killed him with a spear. They buried his head at the Zi Ju gate to command Xuan Bo.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0252",
          "zh": "初，宋武公之世，鄋瞞伐宋，司徒皇父帥師御之，以敗翟于長丘，獲長翟緣斯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially, Song Wu Gong time, Mang Man attacked Song, Si Tu Huang Fu led troops resisted them, with defeated Di at Chang Qiu, captured long Di Yuan Si.",
              "idiomatic": "Initially, in Duke Wu of Song's time, Mang Man attacked Song. The Si Tu Huang Fu led troops to resist them and defeated the Di at Chang Qiu, capturing the long Di Yuan Si.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "晉之滅路，獲喬如弟棼如。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin's extinguished Lu, captured Qiao Ru younger brother Fen Ru.",
              "idiomatic": "When Jin extinguished Lu, they captured Qiao Ru's younger brother Fen Ru.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "齊惠公二年，鄋瞞伐齊，齊王子城父獲其弟榮如，埋其首於北門。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Hui Gong second year, Mang Man attacked Qi, Qi noble son Cheng Fu captured his younger brother Rong Ru, buried his head at north gate.",
              "idiomatic": "In Duke Hui of Qi's second year, Mang Man attacked Qi. Qi's noble son Cheng Fu captured his younger brother Rong Ru and buried his head at the north gate.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "衛人獲其季弟簡如。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wei people captured his youngest brother Jian Ru.",
              "idiomatic": "The Wei people captured his youngest brother Jian Ru.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "鄋瞞由是遂亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Mang Man from this then perished.",
              "idiomatic": "Mang Man from this then perished.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "十五年，季文子使於晉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, Ji Wen Zi made mission to Jin.",
              "idiomatic": "In the fifteenth year, Ji Wen Zi made a mission to Jin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0258",
          "zh": "十八年二月，文公卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighteenth year second month, Wen Gong died.",
              "idiomatic": "In the eighteenth year, second month, Duke Wen died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "文公有二妃：長妃齊女為哀姜，生子惡及視；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wen Gong had two consorts: eldest consort Qi woman was Ai Jiang, gave birth son Wu and Shi;",
              "idiomatic": "Duke Wen had two consorts: the eldest consort, a Qi woman who was Ai Jiang, gave birth to the sons Wu and Shi;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "次妃敬嬴，嬖愛，生子俀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second consort Jing Ying, favored loved, gave birth son Chou.",
              "idiomatic": "The second consort Jing Ying was favored and loved, and gave birth to the son Chou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "俀私事襄仲，襄仲欲立之，叔仲曰不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chou privately served Xiang Zhong, Xiang Zhong desired establish him, Shu Zhong said not possible.",
              "idiomatic": "Chou privately served Xiang Zhong. Xiang Zhong desired to establish him, but Shu Zhong said it was not possible.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "襄仲請齊惠公，惠公新立，欲親魯，許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Zhong requested Qi Hui Gong, Hui Gong newly ascended, desired close Ru, permitted it.",
              "idiomatic": "Xiang Zhong requested Duke Hui of Qi. Duke Hui had newly ascended and desired to be close to Lu, so he permitted it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "冬十月，襄仲殺子惡及視而立俀，是為宣公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter tenth month, Xiang Zhong killed son Wu and Shi and established Chou, this was Xuan Gong.",
              "idiomatic": "In winter, tenth month, Xiang Zhong killed the sons Wu and Shi and established Chou as Duke Xuan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "哀姜歸齊，哭而過市，曰：「天乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang returned Qi, cried and passed market, said: 'Heaven!",
              "idiomatic": "Ai Jiang returned to Qi, crying as she passed through the market, saying: 'Heaven!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "襄仲為不道，殺適立庶！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Zhong does not follow way, kills proper establishes concubine-born!'",
              "idiomatic": "Xiang Zhong does not follow the proper way—he kills the legitimate heir and establishes the concubine-born!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "市人皆哭，魯人謂之「哀姜」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Market people all cried, Lu people called her 'Ai Jiang'.",
              "idiomatic": "All the market people cried, and the Lu people called her 'Ai Jiang'.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "魯由此公室卑，三桓彊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu from this ducal chamber lowly, three Huan strong.",
              "idiomatic": "From this time, Lu's ducal chamber was lowly, and the three Huan were strong.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0268",
          "zh": "宣公俀十二年，楚莊王彊，圍鄭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xuan Gong Chou twelfth year, Chu Zhuang Wang strong, surrounded Zheng.",
              "idiomatic": "In Duke Xuan Chou's twelfth year, King Zhuang of Chu was strong and surrounded Zheng.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "鄭伯降，復國之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zheng Bo surrendered, again returned state to him.",
              "idiomatic": "The Duke of Zheng surrendered, and he returned the state to him again.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0270",
          "zh": "十八年，宣公卒，子成公黑肱立，是為成公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighteenth year, Xuan Gong died, son Cheng Gong Hei Gong ascended, this was Cheng Gong.",
              "idiomatic": "In the eighteenth year, Duke Xuan died, and his son Duke Cheng Hei Gong ascended as Duke Cheng.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "季文子曰：「使我殺適立庶失大援者，襄仲。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Wen Zi said: 'Made me kill proper establish concubine-born lose great support is Xiang Zhong.'",
              "idiomatic": "Ji Wen Zi said: 'The one who made me kill the legitimate heir and establish the concubine-born, losing our great support, was Xiang Zhong.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "襄仲立宣公，公孫歸父有寵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Zhong established Xuan Gong, Gong Sun Gui Fu had favor.",
              "idiomatic": "Xiang Zhong established Duke Xuan, and Gong Sun Gui Fu had favor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "宣公欲去三桓，與晉謀伐三桓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xuan Gong desired remove three Huan, with Jin plotted attacked three Huan.",
              "idiomatic": "Duke Xuan desired to remove the three Huan and plotted with Jin to attack the three Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "會宣公卒，季文子怨之，歸父奔齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Coincidentally Xuan Gong died, Ji Wen Zi resented it, Gui Fu fled Qi.",
              "idiomatic": "Coincidentally Duke Xuan died. Ji Wen Zi resented this, and Gui Fu fled to Qi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0275",
          "zh": "成公二年春，齊伐取我隆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Gong second year spring, Qi attacked took our Long.",
              "idiomatic": "In Duke Cheng's second year, spring, Qi attacked and took our Long.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "夏，公與晉郤克敗齊頃公於砹齊復歸我侵地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, gong with Jin Xi Ke defeated Qi Qing Gong at Ai, Qi again returned our invaded lands.",
              "idiomatic": "In summer, the duke together with Jin's Xi Ke defeated Duke Qing of Qi at Ai, and Qi again returned our invaded lands.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "四年，成公如晉，晉景公不敬魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year, Cheng Gong went to Jin, Jin Jing Gong not respect Lu.",
              "idiomatic": "In the fourth year, Duke Cheng went to Jin, but Duke Jing of Jin did not respect Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "魯欲背晉合於楚，或諫，乃不。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu desired renege Jin unite with Chu, someone admonished, then not.",
              "idiomatic": "Lu desired to renege on Jin and unite with Chu, but someone admonished against it, so they did not.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "十年，成公如晉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth year, Cheng Gong went to Jin.",
              "idiomatic": "In the tenth year, Duke Cheng went to Jin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "晉景公卒，因留成公送葬，魯諱之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin Jing Gong died, therefore detained Cheng Gong send funeral, Lu considered it shame.",
              "idiomatic": "Duke Jing of Jin died, so they detained Duke Cheng to send the funeral. Lu considered this a shame.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "十五年，始與吳王壽夢會鐘離。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, began with Wu Wang Shou Meng assembled Zhong Li.",
              "idiomatic": "In the fifteenth year, they began meeting with King Shou Meng of Wu at Zhong Li.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0282",
          "zh": "十六年，宣伯告晉，欲誅季文子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixteenth year, Xuan Bo reported Jin, desired execute Ji Wen Zi.",
              "idiomatic": "In the sixteenth year, Xuan Bo reported to Jin, desiring to execute Ji Wen Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "文子有義，晉人弗許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wen Zi had righteousness, Jin people not permitted.",
              "idiomatic": "Wen Zi had righteousness, but the Jin people did not permit it.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0284",
          "zh": "十八年，成公卒，子午立，是為襄公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighteenth year, Cheng Gong died, son Wu ascended, this was Xiang Gong.",
              "idiomatic": "In the eighteenth year, Duke Cheng died, and his son Wu ascended as Duke Xiang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "是時襄公三歲也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time Xiang Gong three years old.",
              "idiomatic": "At this time Duke Xiang was three years old.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0286",
          "zh": "襄公元年，晉立悼公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Gong first year, Jin established Dao Gong.",
              "idiomatic": "In Duke Xiang's first year, Jin established Duke Dao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "往年冬，晉欒書弒其君厲公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Previous year winter, Jin Luan Shu assassinated their ruler Li Gong.",
              "idiomatic": "In the previous year, winter, Jin's Luan Shu assassinated their ruler Duke Li.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "四年，襄公朝晉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year, Xiang Gong audience Jin.",
              "idiomatic": "In the fourth year, Duke Xiang went to audience Jin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0289",
          "zh": "五年，季文子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth year, Ji Wen Zi died.",
              "idiomatic": "In the fifth year, Ji Wen Zi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "家無衣帛之妾，廄無食粟之馬，府無金玉，以相三君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Family without silk clothed concubines, stables without grain eating horses, treasury without gold jade, to assist three lords.",
              "idiomatic": "His family had no concubines clothed in silk, his stables had no horses eating grain, his treasury had no gold or jade, yet he assisted three lords.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "君子曰：「季文子廉忠矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Noble men said: 'Ji Wen Zi incorruptible loyal.'",
              "idiomatic": "The noble men said: 'Ji Wen Zi was incorruptible and loyal.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0293",
          "zh": "九年，與晉伐鄭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth year, with Jin attacked Zheng.",
              "idiomatic": "In the ninth year, they attacked Zheng together with Jin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "晉悼公冠襄公於衛，季武子從，相行禮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin Dao Gong capped Xiang Gong at Wei, Ji Wu Zi followed, assisted performed rites.",
              "idiomatic": "Duke Dao of Jin capped Duke Xiang at Wei, and Ji Wu Zi followed, assisting in performing the rites.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "十一年，三桓氏分為三軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh year, three Huan clans divided into three armies.",
              "idiomatic": "In the eleventh year, the three Huan clans divided into three armies.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0296",
          "zh": "十二年，朝晉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth year, audience Jin.",
              "idiomatic": "In the twelfth year, they went to audience Jin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "十六年，晉平公即位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixteenth year, Jin Ping Gong ascended throne.",
              "idiomatic": "In the sixteenth year, Duke Ping of Jin ascended the throne.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "二十一年，朝晉平公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-first year, audience Jin Ping Gong.",
              "idiomatic": "In the twenty-first year, they went to audience Duke Ping of Jin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0299",
          "zh": "二十二年，孔丘生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-second year, Kong Qiu born.",
              "idiomatic": "In the twenty-second year, Kong Qiu was born.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0300",
          "zh": "二十五年，齊崔杼弒其君莊公，立其弟景公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-fifth year, Qi Cui Zhu assassinated their ruler Zhuang Gong, established his younger brother Jing Gong.",
              "idiomatic": "In the twenty-fifth year, Qi's Cui Zhu assassinated their ruler Duke Zhuang and established his younger brother Duke Jing.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0301",
          "zh": "二十九年，吳延陵季子使魯，問周樂，盡知其意，魯人敬焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-ninth year, Wu Yan Ling Ji Zi made mission to Lu, asked Zhou music, completely knew its meaning, Lu people respected him.",
              "idiomatic": "In the twenty-ninth year, Wu's Yan Ling Ji Zi made a mission to Lu, asked about Zhou music, completely knew its meaning, and the Lu people respected him.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0302",
          "zh": "三十一年六月，襄公卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-first year sixth month, Xiang Gong died.",
              "idiomatic": "In the thirty-first year, sixth month, Duke Xiang died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "其九月，太子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Its ninth month, crown prince died.",
              "idiomatic": "In its ninth month, the crown prince died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "魯人立齊歸之子裯為君，是為昭公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu people established Qi Gui's son Chou as ruler, this was Zhao Gong.",
              "idiomatic": "The Lu people established Qi Gui's son Chou as ruler, who became Duke Zhao.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0305",
          "zh": "昭公年十九，猶有童心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong age nineteen, still had child heart.",
              "idiomatic": "Duke Zhao was nineteen years old but still had a child's heart.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "穆叔不欲立，曰：「太子死，有母弟可立，不即立長。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Mu Shu not desired establish, said: 'Crown prince died, have same mother younger brothers may establish, not immediately establish eldest.",
              "idiomatic": "Mu Shu did not desire to establish him, saying: 'The crown prince died. There are same-mother younger brothers who may be established. Do not immediately establish the eldest.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "年鈞擇賢，義鈞則卜之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ages equal choose worthy, righteousness equal then divine it.",
              "idiomatic": "If ages are equal, choose the worthy one. If righteousness is equal, then divine it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "今裯非適嗣，且又居喪意不在戚而有喜色，若果立，必為季氏憂。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Chou not proper heir, moreover also during mourning intention not in grief but has happy color, if indeed establish, must become Ji clan worry.'",
              "idiomatic": "Now Chou is not the proper heir, and moreover during mourning his intention is not in grief but shows happy color. If he is indeed established, he will surely become a worry for the Ji clan.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "季武子弗聽，卒立之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Wu Zi not listen, finally established him.",
              "idiomatic": "Ji Wu Zi did not listen and finally established him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "比及葬，三易衰。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "By time of burial, three times changed mourning garments.",
              "idiomatic": "By the time of the burial, he changed his mourning garments three times.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "君子曰：「是不終也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Noble men said: 'This is not completing mourning.'",
              "idiomatic": "The noble men said: 'This does not complete the mourning.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0313",
          "zh": "昭公三年，朝晉至河，晉平公謝還之，魯恥焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong third year, audience Jin arrived river, Jin Ping Gong apologized sent back him, Lu ashamed.",
              "idiomatic": "In Duke Zhao's third year, he went to audience Jin but arrived at the river. Duke Ping of Jin apologized and sent him back. Lu was ashamed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "四年，楚靈王會諸侯於申，昭公稱病不往。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year, Chu Ling Wang assembled feudal lords at Shen, Zhao Gong claimed illness not go.",
              "idiomatic": "In the fourth year, King Ling of Chu assembled the feudal lords at Shen. Duke Zhao claimed illness and did not go.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "七年，季武子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Seventh year, Ji Wu Zi died.",
              "idiomatic": "In the seventh year, Ji Wu Zi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "八年，楚靈王就章華臺，召昭公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth year, Chu Ling Wang completed Zhang Hua Terrace, summoned Zhao Gong.",
              "idiomatic": "In the eighth year, King Ling of Chu completed the Zhang Hua Terrace and summoned Duke Zhao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "昭公往賀，賜昭公寶器；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong went congratulate, bestowed Zhao Gong treasure vessels;",
              "idiomatic": "Duke Zhao went to congratulate him, and he bestowed treasure vessels on Duke Zhao;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "已而悔，復詐取之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Already then regretted, again deceitfully took them back.",
              "idiomatic": "He then regretted it and again deceitfully took them back.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "十二年，朝晉至河，晉平公謝還之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth year, audience Jin arrived river, Jin Ping Gong apologized sent back him.",
              "idiomatic": "In the twelfth year, he went to audience Jin but arrived at the river. Duke Ping of Jin apologized and sent him back.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "十三年，楚公子棄疾弒其君靈王，代立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirteenth year, Chu noble son Qi Ji assassinated their ruler Ling Wang, substituted ascended.",
              "idiomatic": "In the thirteenth year, Chu's noble son Qi Ji assassinated their ruler King Ling and substituted in ascending.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "十五年，朝晉，晉留之葬晉昭公，魯恥之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, audience Jin, Jin detained him bury Jin Zhao Gong, Lu ashamed it.",
              "idiomatic": "In the fifteenth year, he went to audience Jin, but Jin detained him to bury Duke Zhao of Jin. Lu was ashamed of this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "二十年，齊景公與晏子狩竟，因入魯問禮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twentieth year, Qi Jing Gong with Yan Zi hunted border, therefore entered Lu asked rites.",
              "idiomatic": "In the twentieth year, Duke Jing of Qi hunted the border with Yan Zi, and therefore entered Lu to ask about rites.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "二十一年，朝晉至河，晉謝還之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-first year, audience Jin arrived river, Jin apologized sent back him.",
              "idiomatic": "In the twenty-first year, he went to audience Jin but arrived at the river. Jin apologized and sent him back.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0324",
          "zh": "二十五年春，鸜鵒來巢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-fifth year spring, qiu yao came nest.",
              "idiomatic": "In the twenty-fifth year, spring, the qiu yao birds came to nest.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "師己曰：「文成之世童謠曰『鸜鵒來巢，公在乾侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shi Ji said: 'Wen Cheng time children's rhyme said 'Qiu yao come nest, duke at Qian Hou.",
              "idiomatic": "Shi Ji said: 'In Wen Cheng's time, the children's rhyme said: 'The qiu yao come to nest, the duke is at Qian Hou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "鸜鵒入處，公在外野』。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qiu yao enter dwell, duke outside wild.'",
              "idiomatic": "The qiu yao birds enter to dwell, the duke is outside in the wild.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0328",
          "zh": "季氏與郈氏鬬雞，季氏芥雞羽，郈氏金距。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji clan with Hou clan fought cocks, Ji clan mustard rooster feathers, Hou clan gold spurs.",
              "idiomatic": "The Ji clan fought cocks with the Hou clan. The Ji clan had mustard on their rooster's feathers, the Hou clan had gold spurs.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "季平子怒而侵郈氏，郈昭伯亦怒平子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Ping Zi angered and invaded Hou clan, Hou Zhao Bo also angered Ping Zi.",
              "idiomatic": "Ji Ping Zi became angry and invaded the Hou clan. Hou Zhao Bo also became angry with Ping Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "臧昭伯之弟會偽讒臧氏，匿季氏，臧昭伯囚季氏人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zang Zhao Bo's younger brother Hui falsely slandered Zang clan, hid Ji clan, Zang Zhao Bo imprisoned Ji clan people.",
              "idiomatic": "Zang Zhao Bo's younger brother Hui falsely slandered the Zang clan and hid with the Ji clan. Zang Zhao Bo imprisoned people of the Ji clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "季平子怒，囚臧氏老。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Ping Zi angered, imprisoned Zang clan elders.",
              "idiomatic": "Ji Ping Zi became angry and imprisoned the Zang clan elders.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "臧、郈氏以難告昭公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zang, Hou clans with difficulty reported Zhao Gong.",
              "idiomatic": "The Zang and Hou clans reported their difficulties to Duke Zhao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "昭公九月戊戌伐季氏，遂入。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong ninth month wu xu attacked Ji clan, then entered.",
              "idiomatic": "Duke Zhao, in the ninth month on day wu-xu, attacked the Ji clan and then entered.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "平子登臺請曰：「君以讒不察臣罪，誅之，請遷沂上。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ping Zi ascended tower pleaded said: 'Lord with slander not examine minister crime, execute him, please move to Yi upper.'",
              "idiomatic": "Ping Zi ascended the tower and pleaded, saying: 'My lord, because of slander, does not examine my crime. Execute me, I beg to move to the upper Yi.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "弗許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not permitted.",
              "idiomatic": "He did not permit it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "請囚於鄪，弗許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Requested imprisoned at Mang, not permitted.",
              "idiomatic": "He requested to be imprisoned at Mang, but it was not permitted.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0337",
          "zh": "請以五乘亡，弗許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Requested with five chariots flee, not permitted.",
              "idiomatic": "He requested to flee with five chariots, but it was not permitted.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "子家駒曰：「君其許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Jia Ju said: 'Lord should permit him.",
              "idiomatic": "Zi Jia Ju said: 'My lord should permit him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "政自季氏久矣，為徒者眾，眾將合謀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Government from Ji clan long ago, followers numerous, numerous will join plot.'",
              "idiomatic": "Government has been with the Ji clan for a long time. The followers are numerous. The numerous will join together in plotting.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "弗聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not listen.",
              "idiomatic": "He did not listen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "郈氏曰：「必殺之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hou clan said: 'Must kill him.'",
              "idiomatic": "The Hou clan said: 'We must kill him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "叔孫氏之臣戾謂其眾曰：「無季氏與有，孰利？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shu Sun clan's minister Li told his multitude said: 'Without Ji clan compared to having, which beneficial?'",
              "idiomatic": "The Shu Sun clan's minister Li told his multitude, saying: 'Without the Ji clan compared to having them, which is more beneficial?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "皆曰：「無季氏是無叔孫氏。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All said: 'Without Ji clan is without Shu Sun clan.'",
              "idiomatic": "All said: 'Without the Ji clan is to be without the Shu Sun clan.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0344",
          "zh": "戾曰：「然，救季氏！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Li said: 'Correct, save Ji clan!'",
              "idiomatic": "Li said: 'Correct, save the Ji clan!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "遂敗公師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then defeated duke's army.",
              "idiomatic": "They then defeated the duke's army.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "孟懿子聞叔孫氏勝，亦殺郈昭伯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Meng Yi Zi heard Shu Sun clan victory, also killed Hou Zhao Bo.",
              "idiomatic": "Meng Yi Zi heard of the Shu Sun clan's victory and also killed Hou Zhao Bo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "郈昭伯為公使，故孟氏得之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hou Zhao Bo served duke's envoy, therefore Meng clan got him.",
              "idiomatic": "Hou Zhao Bo was the duke's envoy, therefore the Meng clan got him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "三家共伐公，公遂奔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three houses together attacked duke, duke then fled.",
              "idiomatic": "The three houses together attacked the duke, and the duke then fled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "己亥，公至于齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji hai, duke arrived at Qi.",
              "idiomatic": "On day ji-hai, the duke arrived at Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "齊景公曰：「請致千社待君。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Jing Gong said: 'Please deliver thousand she to wait for lord.'",
              "idiomatic": "Duke Jing of Qi said: 'I will deliver a thousand she to wait for my lord.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "子家曰：「棄周公之業而臣於齊，可乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Jia said: 'Abandon Zhou Gong's enterprise and serve as minister to Qi, possible?'",
              "idiomatic": "Zi Jia said: 'To abandon the Duke of Zhou's enterprise and serve as minister to Qi—is this possible?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "乃止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then stopped.",
              "idiomatic": "They then stopped.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "子家曰：「齊景公無信，不如早之晉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Jia said: 'Qi Jing Gong without trust, not as good early to Jin.'",
              "idiomatic": "Zi Jia said: 'Duke Jing of Qi has no trustworthiness. It would be better to go early to Jin.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "弗從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not follow.",
              "idiomatic": "He did not follow.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "叔孫見公還，見平子，平子頓首。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shu Sun saw duke return, saw Ping Zi, Ping Zi knocked head.",
              "idiomatic": "Shu Sun saw the duke return and saw Ping Zi. Ping Zi knocked his head (in apology).",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "初欲迎昭公，孟孫、季孫後悔，乃止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially desired welcome Zhao Gong, Meng Sun, Ji Sun later regretted, then stopped.",
              "idiomatic": "Initially they desired to welcome Duke Zhao, but Meng Sun and Ji Sun later regretted it and stopped.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0357",
          "zh": "二十六年春，齊伐魯，取鄆而居昭公焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-sixth year spring, Qi attacked Lu, took Yun and housed Zhao Gong there.",
              "idiomatic": "In the twenty-sixth year, spring, Qi attacked Lu, took Yun, and housed Duke Zhao there.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0358",
          "zh": "夏，齊景公將內公，令無受魯賂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, Qi Jing Gong will install duke, commanded not accept Lu bribes.",
              "idiomatic": "In summer, Duke Jing of Qi was about to install the duke and commanded not to accept Lu bribes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "申豐、汝賈許齊臣高龁、子將粟五千庾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shen Feng, Ru Jia promised Qi ministers Gao He, Zi Jiang grain five thousand yu.",
              "idiomatic": "Shen Feng and Ru Jia promised the Qi ministers Gao He and Zi Jiang five thousand yu of grain.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "子將言於齊侯曰：「群臣不能事魯君，有異焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Jiang spoke to Qi Hou said: 'Multitude ministers cannot serve Lu lord, have strangeness.",
              "idiomatic": "Zi Jiang spoke to the Duke of Qi, saying: 'The multitude of ministers cannot serve the Lu lord. There is strangeness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0361",
          "zh": "宋元公為魯如晉，求內之，道卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Song Yuan Gong for Lu went to Jin, sought install him, road died.",
              "idiomatic": "Duke Yuan of Song, for Lu's sake, went to Jin to seek installing him, but died on the road.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "叔孫昭子求內其君，無病而死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shu Sun Zhao Zi sought install their lord, without illness died.",
              "idiomatic": "Shu Sun Zhao Zi sought to install their lord, but died without illness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "不知天棄魯乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not know heaven abandon Lu?",
              "idiomatic": "I do not know if heaven has abandoned Lu?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0364",
          "zh": "抑魯君有罪于鬼神也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Or Lu lord has crime toward ghosts spirits?",
              "idiomatic": "Or does the Lu lord have crimes toward the ghosts and spirits?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0365",
          "zh": "願君且待。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wish lord temporarily wait.'",
              "idiomatic": "I wish my lord to temporarily wait.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0366",
          "zh": "齊景公從之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Jing Gong followed it.",
              "idiomatic": "Duke Jing of Qi followed this.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0367",
          "zh": "二十八年，昭公如晉，求入。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-eighth year, Zhao Gong went to Jin, sought entry.",
              "idiomatic": "In the twenty-eighth year, Duke Zhao went to Jin seeking entry.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "季平子私於晉六卿，六卿受季氏賂，諫晉君，晉君乃止，居昭公乾侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Ping Zi privately with Jin six qing, six qing received Ji clan bribes, admonished Jin lord, Jin lord then stopped, housed Zhao Gong Qian Hou.",
              "idiomatic": "Ji Ping Zi privately dealt with Jin's six ministers. The six ministers received Ji clan bribes and admonished the Jin lord. The Jin lord then stopped and housed Duke Zhao at Qian Hou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "二十九年，昭公如鄆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-ninth year, Zhao Gong went to Yun.",
              "idiomatic": "In the twenty-ninth year, Duke Zhao went to Yun.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0370",
          "zh": "齊景公使人賜昭公書，自謂「主君」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Jing Gong made people bestow Zhao Gong writings, self called 'master lord'.",
              "idiomatic": "Duke Jing of Qi had people bestow writings on Duke Zhao, calling himself 'master lord'.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "昭公恥之，怒而去乾侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong ashamed it, angered and left Qian Hou.",
              "idiomatic": "Duke Zhao was ashamed by it, angered, and left Qian Hou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0372",
          "zh": "三十一年，晉欲內昭公，召季平子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-first year, Jin desired install Zhao Gong, summoned Ji Ping Zi.",
              "idiomatic": "In the thirty-first year, Jin desired to install Duke Zhao and summoned Ji Ping Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "平子布衣跣行，因六卿謝罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ping Zi plain clothes barefoot walked, through six ministers apologized for crime.",
              "idiomatic": "Ping Zi, in plain clothes and barefoot, went through the six ministers apologizing for the crime.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "六卿為言曰：「晉欲內昭公，眾不從。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Six ministers spoke said: 'Jin desires install Zhao Gong, multitude not follow.'",
              "idiomatic": "The six ministers spoke, saying: 'Jin desires to install Duke Zhao, but the multitude will not follow.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0375",
          "zh": "晉人止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin people stopped.",
              "idiomatic": "The Jin people stopped.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0376",
          "zh": "三十二年，昭公卒於乾侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-second year, Zhao Gong died at Qian Hou.",
              "idiomatic": "In the thirty-second year, Duke Zhao died at Qian Hou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0377",
          "zh": "魯人共立昭公弟宋為君，是為定公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu people together established Zhao Gong younger brother Song as ruler, this was Ding Gong.",
              "idiomatic": "The Lu people together established Duke Zhao's younger brother Song as ruler, who became Duke Ding.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0378",
          "zh": "定公立，趙簡子問史墨曰：「季氏亡乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ding Gong established, Zhao Jian Zi asked Shi Mo said: 'Ji clan perish?'",
              "idiomatic": "When Duke Ding was established, Zhao Jian Zi asked Shi Mo, saying: 'Will the Ji clan perish?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0379",
          "zh": "史墨對曰：「不亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shi Mo replied said: 'Not perish.",
              "idiomatic": "Shi Mo replied, saying: 'They will not perish.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0380",
          "zh": "季友有大功於魯，受鄪為上卿，至于文子、武子，世增其業。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji You had great merit in Lu, received Mang as chief minister, to Wen Zi, Wu Zi, generations increased their enterprise.",
              "idiomatic": "Ji You had great merit in Lu, received Mang as chief minister. Down to Wen Zi and Wu Zi, the generations increased their enterprise.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0381",
          "zh": "魯文公卒，東門遂殺適立庶，魯君於是失國政。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu Wen Gong died, Dong Men Sui killed proper established concubine-born, Lu lord from this lost state government.",
              "idiomatic": "When Duke Wen of Lu died, Dong Men Sui killed the legitimate heir and established the concubine-born. The Lu lord from this lost the state government.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0382",
          "zh": "政在季氏，於今四君矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Government in Ji clan, to now four lords.",
              "idiomatic": "The government has been in the Ji clan for four lords now.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0383",
          "zh": "民不知君，何以得國！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "People not know lord, how obtain state!",
              "idiomatic": "If the people do not know their lord, how can he obtain the state!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "是以為君慎器與名，不可以假人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore for lord careful vessels and names, cannot lend people.'",
              "idiomatic": "Therefore, as lord, be careful with vessels and names. They cannot be lent to others.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0386",
          "zh": "定公五年，季平子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ding Gong fifth year, Ji Ping Zi died.",
              "idiomatic": "In Duke Ding's fifth year, Ji Ping Zi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0387",
          "zh": "陽虎私怒，囚季桓子，與盟，乃捨之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yang Hu privately angered, imprisoned Ji Huan Zi, made covenant with him, then released him.",
              "idiomatic": "Yang Hu was privately angered, imprisoned Ji Huan Zi, made a covenant with him, and then released him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0388",
          "zh": "七年，齊伐我，取鄆，以為魯陽虎邑以從政。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Seventh year, Qi attacked us, took Yun, made it Yang Hu's city for Lu to conduct government.",
              "idiomatic": "In the seventh year, Qi attacked us and took Yun, making it Yang Hu's city for conducting government in Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "八年，陽虎欲盡殺三桓適，而更立其所善庶子以代之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth year, Yang Hu desired completely kill three Huan proper heirs, and replace establish his favored concubine-born sons to substitute them;",
              "idiomatic": "In the eighth year, Yang Hu desired to completely kill the three Huan legitimate heirs and replace them by establishing his favored concubine-born sons;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0390",
          "zh": "載季桓子將殺之，桓子詐而得脫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Loaded Ji Huan Zi about to kill him, Huan Zi deceived and obtained escape.",
              "idiomatic": "He loaded Ji Huan Zi (in a cart) intending to kill him, but Huan Zi deceived him and escaped.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "三桓共攻陽虎，陽虎居陽關。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three Huan together attacked Yang Hu, Yang Hu resided Yang Pass.",
              "idiomatic": "The three Huan together attacked Yang Hu, and Yang Hu resided at Yang Pass.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0392",
          "zh": "九年，魯伐陽虎，陽虎奔齊，已而奔晉趙氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth year, Lu attacked Yang Hu, Yang Hu fled Qi, already then fled Jin Zhao clan.",
              "idiomatic": "In the ninth year, Lu attacked Yang Hu. Yang Hu fled to Qi, and then fled to the Zhao clan in Jin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0393",
          "zh": "十年，定公與齊景公會於夾谷，孔子行相事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth year, Ding Gong with Qi Jing Gong assembled at Jia Gu, Kong Qiu performed assistant affairs.",
              "idiomatic": "In the tenth year, Duke Ding assembled with Duke Jing of Qi at Jia Gu, and Kong Qiu performed the assistant's duties.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "齊欲襲魯君，孔子以禮歷階，誅齊淫樂，齊侯懼，乃止，歸魯侵地而謝過。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi desired attack Lu lord, Kong Qiu with rites ascended steps, executed Qi lewd music, Qi Hou feared, then stopped, returned Lu invaded lands and apologized for offense.",
              "idiomatic": "Qi desired to attack the Lu lord. Kong Qiu, with rites, ascended the steps, executed Qi's lewd music. The Qi lord feared and stopped, returning the Lu invaded lands and apologizing for the offense.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0395",
          "zh": "十二年，使仲由毀三桓城，收其甲兵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth year, made Zhong You destroy three Huan cities, collected their armor weapons.",
              "idiomatic": "In the twelfth year, he had Zhong You destroy the three Huan cities and collect their armor and weapons.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "孟氏不肯墮城，伐之，不克而止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Meng clan not willing demolish city, attacked them, not conquered and stopped.",
              "idiomatic": "The Meng clan was not willing to demolish the city. He attacked them but did not conquer and stopped.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "季桓子受齊女樂，孔子去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Huan Zi accepted Qi female music, Kong Qiu left.",
              "idiomatic": "Ji Huan Zi accepted Qi female musicians. Kong Qiu left.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0398",
          "zh": "十五年，定公卒，子將立，是為哀公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, Ding Gong died, son Jiang ascended, this was Ai Gong.",
              "idiomatic": "In the fifteenth year, Duke Ding died, and his son Jiang ascended as Duke Ai.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0399",
          "zh": "哀公五年，齊景公卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Gong fifth year, Qi Jing Gong died.",
              "idiomatic": "In Duke Ai's fifth year, Duke Jing of Qi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0400",
          "zh": "六年，齊田乞弒其君孺子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth year, Qi Tian Qi assassinated their lord Ru Zi.",
              "idiomatic": "In the sixth year, Qi's Tian Qi assassinated their lord Ru Zi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0401",
          "zh": "七年，吳王夫差彊，伐齊，至繒，徵百牢於魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Seventh year, Wu Wang Fu Cha strong, attacked Qi, arrived Zeng, demanded hundred cattle at Lu.",
              "idiomatic": "In the seventh year, King Fu Cha of Wu was strong. He attacked Qi, arrived at Zeng, and demanded a hundred cattle from Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0402",
          "zh": "季康子使子貢說吳王及太宰嚭，以禮詘之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Kang Zi made Zi Gong persuade Wu Wang and Tai Zai Pi, with rites subdue them.",
              "idiomatic": "Ji Kang Zi had Zi Gong persuade King Wu and Tai Zai Pi, subduing them with rites.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0403",
          "zh": "吳王曰：「我文身，不足責禮。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Wang said: 'I tattoo body, not worth demand rites.'",
              "idiomatic": "The Wu king said: 'I have a tattooed body. It is not worth demanding rites from me.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0404",
          "zh": "乃止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then stopped.",
              "idiomatic": "They then stopped.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0405",
          "zh": "吳為鄒伐魯，至城下，盟而去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu for Zou attacked Lu, arrived city walls, allied and left.",
              "idiomatic": "Wu, for Zou's sake, attacked Lu, arrived at the city walls, made an alliance, and left.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0406",
          "zh": "齊伐我，取三邑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi attacked us, took three cities.",
              "idiomatic": "Qi attacked us and took three cities.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0407",
          "zh": "十年，伐齊南邊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth year, attacked Qi southern border.",
              "idiomatic": "In the tenth year, they attacked Qi's southern border.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0408",
          "zh": "齊伐魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi attacked Lu.",
              "idiomatic": "Qi attacked Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0409",
          "zh": "季氏用冉有有功，思孔子，孔子自衛歸魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji clan used Ran You had merit, thought of Kong Qiu, Kong Qiu from Wei returned Lu.",
              "idiomatic": "The Ji clan used Ran You and had merit. They thought of Kong Qiu, and Kong Qiu returned to Lu from Wei.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0410",
          "zh": "齊田常弒其君簡公於俆州。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Tian Chang assassinated their lord Jian Gong at Xu Zhou.",
              "idiomatic": "Qi's Tian Chang assassinated their lord Duke Jian at Xu Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0411",
          "zh": "孔子請伐之，哀公不聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Kong Qiu requested attack them, Ai Gong not listen.",
              "idiomatic": "Kong Qiu requested to attack them, but Duke Ai did not listen.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0412",
          "zh": "十五年，使子服景伯、子貢為介，適齊，齊歸我侵地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifteenth year, made Zi Fu Jing Bo, Zi Gong be intermediaries, went to Qi, Qi returned our invaded lands.",
              "idiomatic": "In the fifteenth year, he had Zi Fu Jing Bo and Zi Gong act as intermediaries, went to Qi, and Qi returned our invaded lands.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0413",
          "zh": "田常初相，欲親諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Chang initially prime minister, desired close feudal lords.",
              "idiomatic": "Tian Chang, initially prime minister, desired to be close to the feudal lords.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0414",
          "zh": "十六年，孔子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixteenth year, Kong Qiu died.",
              "idiomatic": "In the sixteenth year, Kong Qiu died.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0415",
          "zh": "二十二年，越王句踐滅吳王夫差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-second year, Yue Wang Gou Jian extinguished Wu Wang Fu Cha.",
              "idiomatic": "In the twenty-second year, King Gou Jian of Yue extinguished King Fu Cha of Wu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0416",
          "zh": "二十七年春，季康子卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-seventh year spring, Ji Kang Zi died.",
              "idiomatic": "In the twenty-seventh year, spring, Ji Kang Zi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0417",
          "zh": "夏，哀公患三桓，將欲因諸侯以劫之，三桓亦患公作難，故君臣多閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, Ai Gong worried three Huan, about to desire use feudal lords to coerce them, three Huan also worried duke make difficulty, therefore lord minister many estrangements.",
              "idiomatic": "In summer, Duke Ai worried about the three Huan and was about to use the feudal lords to coerce them. The three Huan also worried the duke would make difficulties, so lord and ministers had many estrangements.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0418",
          "zh": "公游于陵阪，遇孟武伯於街，曰：「請問余及死乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong strolled at Ling Ban, encountered Meng Wu Bo at street, said: 'Please ask will I reach death?'",
              "idiomatic": "The duke strolled at Ling Ban and encountered Meng Wu Bo on the street, saying: 'Please tell me, will I reach death?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0419",
          "zh": "對曰：「不知也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied said: 'Not know.'",
              "idiomatic": "He replied, saying: 'I do not know.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0420",
          "zh": "公欲以越伐三桓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong desired with Yue attack three Huan.",
              "idiomatic": "The duke desired to use Yue to attack the three Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0421",
          "zh": "八月，哀公如陘氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth month, Ai Gong went to Xing Shi.",
              "idiomatic": "In the eighth month, Duke Ai went to the Xing family.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0422",
          "zh": "三桓攻公，公奔于衛，去如鄒，遂如越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three Huan attacked duke, duke fled to Wei, left went to Zou, then went to Yue.",
              "idiomatic": "The three Huan attacked the duke. The duke fled to Wei, then went to Zou, and finally went to Yue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0423",
          "zh": "國人迎哀公復歸，卒于有山氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "State people welcomed Ai Gong return again, died at You Shan Shi.",
              "idiomatic": "The people of the state welcomed Duke Ai to return again, but he died at the You Shan family.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0424",
          "zh": "子寧立，是為悼公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Son Ning ascended, this was Dao Gong.",
              "idiomatic": "His son Ning ascended, who became Duke Dao.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0425",
          "zh": "悼公之時，三桓勝，魯如小侯，卑於三桓之家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dao Gong time, three Huan victorious, Lu like small marquis, lowly compared to three Huan families.",
              "idiomatic": "In Duke Dao's time, the three Huan were victorious. Lu was like a small marquis, lowly compared to the three Huan families.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0426",
          "zh": "十三年，三晉滅智伯，分其地有之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirteenth year, three Jin extinguished Zhi Bo, divided his land possessed it.",
              "idiomatic": "In the thirteenth year, the three Jin extinguished Zhi Bo and divided his land among themselves.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0427",
          "zh": "三十七年，悼公卒，子嘉立，是為元公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-seventh year, Dao Gong died, son Jia ascended, this was Yuan Gong.",
              "idiomatic": "In the thirty-seventh year, Duke Dao died, and his son Jia ascended as Duke Yuan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0428",
          "zh": "元公二十一年卒，子顯立，是為穆公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yuan Gong twenty-first year died, son Xian ascended, this was Mu Gong.",
              "idiomatic": "Duke Yuan died in his twenty-first year, and his son Xian ascended as Duke Mu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0429",
          "zh": "穆公三十三年卒，子奮立，是為共公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Mu Gong thirty-third year died, son Fen ascended, this was Gong Gong.",
              "idiomatic": "Duke Mu died in his thirty-third year, and his son Fen ascended as Duke Gong.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0430",
          "zh": "共公二十二年卒，子屯立，是為康公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong Gong twenty-second year died, son Tun ascended, this was Kang Gong.",
              "idiomatic": "Duke Gong died in his twenty-second year, and his son Tun ascended as Duke Kang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0431",
          "zh": "康公九年卒，子匽立，是為景公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Kang Gong ninth year died, son Yan ascended, this was Jing Gong.",
              "idiomatic": "Duke Kang died in his ninth year, and his son Yan ascended as Duke Jing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0432",
          "zh": "景公二十九年卒，子叔立，是為平公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jing Gong twenty-ninth year died, son Shu ascended, this was Ping Gong.",
              "idiomatic": "Duke Jing died in his twenty-ninth year, and his son Shu ascended as Duke Ping.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0433",
          "zh": "是時六國皆稱王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time six states all called wang.",
              "idiomatic": "At this time the six states all called themselves wang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0434",
          "zh": "平公十二年，秦惠王卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ping Gong twelfth year, Qin Hui Wang died.",
              "idiomatic": "In Duke Ping's twelfth year, King Hui of Qin died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0435",
          "zh": "二十（二）年，平公卒，子賈立，是為文公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-second year, Ping Gong died, son Jia ascended, this was Wen Gong.",
              "idiomatic": "In the twenty-second year, Duke Ping died, and his son Jia ascended as Duke Wen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0436",
          "zh": "文公（七）［元］年，楚懷王死于秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wen Gong first year, Chu Huai Wang died in Qin.",
              "idiomatic": "In Duke Wen's first year, King Huai of Chu died in Qin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0437",
          "zh": "二十三年，文公卒，子讎立，是為頃公。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-third year, Wen Gong died, son Chou ascended, this was Qing Gong.",
              "idiomatic": "In the twenty-third year, Duke Wen died, and his son Chou ascended as Duke Qing.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0438",
          "zh": "頃公二年，秦拔楚之郢，楚頃王東徙于陳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Gong second year, Qin captured Chu's Ying, Chu Qing Wang east moved to Chen.",
              "idiomatic": "In Duke Qing's second year, Qin captured Chu's Ying, and King Qing of Chu moved east to Chen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0439",
          "zh": "十九年，楚伐我，取徐州。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Nineteenth year, Chu attacked us, took Xu Zhou.",
              "idiomatic": "In the nineteenth year, Chu attacked us and took Xu Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0440",
          "zh": "二十四年，楚考烈王伐滅魯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-fourth year, Chu Kao Lie Wang attacked extinguished Lu.",
              "idiomatic": "In the twenty-fourth year, King Kao Lie of Chu attacked and extinguished Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0441",
          "zh": "頃公亡，遷於下邑，為家人，魯絕祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Gong perished, moved to lower city, became commoner, Lu cut off sacrifices.",
              "idiomatic": "Duke Qing perished, moved to a lower city, became a commoner, and Lu's sacrifices were cut off.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0442",
          "zh": "頃公卒于柯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Gong died at Ke.",
              "idiomatic": "Duke Qing died at Ke.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0443",
          "zh": "魯起周公至頃公，凡三十四世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu from Zhou Gong to Qing Gong, altogether thirty-four generations.",
              "idiomatic": "From the Duke of Zhou to Duke Qing, Lu had altogether thirty-four generations.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0444",
          "zh": "太史公曰：余聞孔子稱曰「甚矣魯道之衰也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Scribe said: I heard Kong Qiu say 'Extreme indeed Lu way decline!",
              "idiomatic": "The Grand Scribe said: I heard Kong Qiu say 'How extreme is Lu's way in decline!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0445",
          "zh": "洙泗之閒龂龂如也」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhu Si between argumentative like.'",
              "idiomatic": "Between Zhu and Si, it is argumentative like that.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0446",
          "zh": "觀慶父及叔牙閔公之際，何其亂也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Observe Qing Fu and Shu Ya Min Gong time, how chaotic?",
              "idiomatic": "Observe the time of Qing Fu and Shu Ya with Duke Min, how chaotic was it?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0447",
          "zh": "隱桓之事；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yin Huan matters;",
              "idiomatic": "The matters of Yin and Huan;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0448",
          "zh": "襄仲殺適立庶；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Zhong killed proper established concubine-born;",
              "idiomatic": "Xiang Zhong killed the legitimate heir and established the concubine-born;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0449",
          "zh": "三家北面為臣，親攻昭公，昭公以奔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three houses north face became ministers, personally attacked Zhao Gong, Zhao Gong therefore fled.",
              "idiomatic": "The three houses faced north as ministers, personally attacked Duke Zhao, and Duke Zhao therefore fled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0450",
          "zh": "至其揖讓之禮則從矣，而行事何其戾也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "To their yielding courtesy rites then followed, but actions how perverse?",
              "idiomatic": "To their yielding courtesy rites they then followed, but their actions how perverse?",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    }
  ]
}