{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "050",
    "url": "https://chinesenotes.com/shiji/shiji050.html",
    "title": {
      "zh": "楚元王世家",
      "en": "House of Prince Yuan of Chu",
      "raw": "《楚元王世家》 House of Prince Yuan of Chu"
    },
    "sentenceCount": 52,
    "translatedCount": 52,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:30.218Z",
    "translators": [
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 10,
        "sentences": 52
      }
    ],
    "citation": "Translation: Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "楚元王劉交者，高祖之同母少弟也，字游。",
          "translations": [
            {
              "lang": "en",
              "text": "Prince Yuan of Chu, Liu Jiao, was Gaozu's younger brother by the same mother, styled You.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Prince Yuan of Chu, Liu Jiao, was Gaozu's younger brother by the same mother, styled You.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0002",
          "zh": "高祖兄弟四人，長兄伯，伯蚤卒。",
          "translations": [
            {
              "lang": "en",
              "text": "Gaozu had four brothers: the eldest was Bo, who died young.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "始高祖微時，嘗辟事，時時與賓客過巨嫂食。",
          "translations": [
            {
              "lang": "en",
              "text": "When Gaozu was still of humble status, he once avoided official duties and frequently went with guests to eat at his elder brother's wife's house.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "嫂厭叔，叔與客來，嫂詳為羹盡，櫟釜，賓客以故去。",
          "translations": [
            {
              "lang": "en",
              "text": "The sister-in-law disliked her brother-in-law, and when the brother-in-law came with guests, she pretended the stew was finished, covered the pot, and the guests left because of this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "已而視釜中尚有羹，高祖由此怨其嫂。",
          "translations": [
            {
              "lang": "en",
              "text": "Later, when they looked in the pot there was still stew, and Gaozu resented his sister-in-law from this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "及高祖為帝，封昆弟，而伯子獨不得封。",
          "translations": [
            {
              "lang": "en",
              "text": "When Gaozu became emperor, he enfeoffed his brothers, but Bo's son alone did not receive an enfeoffment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "太上皇以為言，高祖曰：「某非忘封之也，為其母不長者耳。」",
          "translations": [
            {
              "lang": "en",
              "text": "The Supreme Emperor spoke of this, and Gaozu said: \"It's not that I forgot to enfeoff him, but because his mother was not virtuous.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "於是乃封其子信為羹頡侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore, he enfeoffed Bo's son Xin as Marquis of Gengjie.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "而王次兄仲於代。",
          "translations": [
            {
              "lang": "en",
              "text": "The prince's second brother Zhong was established in Dai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gaozu had four brothers: the eldest was Bo, who died young. When Gaozu was still of humble status, he once avoided official duties and frequently went with guests to eat at his elder brother's wife's house. The sister-in-law disliked her brother-in-law, and when the brother-in-law came with guests, she pretended the stew was finished, covered the pot, and the guests left because of this. Later, when they looked in the pot there was still stew, and Gaozu resented his sister-in-law from this. When Gaozu became emperor, he enfeoffed his brothers, but Bo's son alone did not receive an enfeoffment. The Supreme Emperor spoke of this, and Gaozu said: \"It's not that I forgot to enfeoff him, but because his mother was not virtuous.\" Therefore, he enfeoffed Bo's son Xin as Marquis of Gengjie. The prince's second brother Zhong was established in Dai.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "高祖六年，已禽楚王韓信於陳，乃以弟交為楚王，都彭城。",
          "translations": [
            {
              "lang": "en",
              "text": "In Gaozu's sixth year, after capturing the Chu king Han Xin at Chen, he made his brother Jiao King of Chu, with his capital at Pengcheng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "即位二十三年卒，子夷王郢立。",
          "translations": [
            {
              "lang": "en",
              "text": "He reigned for twenty-three years and died, his son King Yi Ying ascended the throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "夷王四年卒，子王戊立。",
          "translations": [
            {
              "lang": "en",
              "text": "King Yi reigned for four years and died, his son King Wu ascended the throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In Gaozu's sixth year, after capturing the Chu king Han Xin at Chen, he made his brother Jiao King of Chu, with his capital at Pengcheng. He reigned for twenty-three years and died, his son King Yi Ying ascended the throne. King Yi reigned for four years and died, his son King Wu ascended the throne.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "王戊立二十年，冬，坐為薄太后服私姦，削東海郡。",
          "translations": [
            {
              "lang": "en",
              "text": "King Wu reigned for twenty years, in winter he was convicted of illicit sexual relations while mourning Empress Bo, and Donghai commandery was stripped from him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "春，戊與吳王合謀反，其相張尚、太傅趙夷吾諫，不聽。",
          "translations": [
            {
              "lang": "en",
              "text": "In spring, Wu conspired with the King of Wu to rebel, his chancellor Zhang Shang and tutor Zhao Yiwu advised against it, but he did not listen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "戊則殺尚、夷吾，起兵與吳西攻梁，破棘壁。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu then executed Shang and Yiwu, raised troops and attacked west with Wu toward Liang, breaking through Jibi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "至昌邑南，與漢將周亞夫戰。",
          "translations": [
            {
              "lang": "en",
              "text": "They reached south of Changyi, and fought with the Han general Zhou Yafu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "漢絕吳楚糧道，士卒饑，吳王走，楚王戊自殺，軍遂降漢。",
          "translations": [
            {
              "lang": "en",
              "text": "Han cut off the Wu and Chu supply lines, the soldiers were hungry, the King of Wu fled, King Wu of Chu committed suicide, and the army surrendered to Han.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "King Wu reigned for twenty years, in winter he was convicted of illicit sexual relations while mourning Empress Bo, and Donghai commandery was stripped from him. In spring, Wu conspired with the King of Wu to rebel, his chancellor Zhang Shang and tutor Zhao Yiwu advised against it, but he did not listen. Wu then executed Shang and Yiwu, raised troops and attacked west with Wu toward Liang, breaking through Jibi. They reached south of Changyi, and fought with the Han general Zhou Yafu. Han cut off the Wu and Chu supply lines, the soldiers were hungry, the King of Wu fled, King Wu of Chu committed suicide, and the army surrendered to Han.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "漢已平吳楚，孝景帝欲以德侯子續吳，以元王子禮續楚。",
          "translations": [
            {
              "lang": "en",
              "text": "After Han had pacified Wu and Chu, Emperor Jing wished to continue Wu with the son of Marquis De, and continue Chu with the son of Prince Yuan, Liu Li.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "竇太后曰：「吳王，老人也，宜為宗室順善。",
          "translations": [
            {
              "lang": "en",
              "text": "Empress Dou said: \"The King of Wu was an old man, he should have been compliant and virtuous within the imperial clan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "今乃首率七國，紛亂天下，柰何續其後！」",
          "translations": [
            {
              "lang": "en",
              "text": "Now he was the first to lead the seven states in throwing the realm into chaos—how can we continue his descendants!\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "不許吳，許立楚後。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu was not permitted, but Chu was permitted to establish descendants.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "是時禮為漢宗正。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time Li served as Han's Director of the Imperial Clan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "乃拜禮為楚王，奉元王宗廟，是為楚文王。",
          "translations": [
            {
              "lang": "en",
              "text": "He was appointed King of Chu to maintain Prince Yuan's ancestral temples, and became King Wen of Chu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After Han had pacified Wu and Chu, Emperor Jing wished to continue Wu with the son of Marquis De, and continue Chu with the son of Prince Yuan, Liu Li. Empress Dou said: \"The King of Wu was an old man, he should have been compliant and virtuous within the imperial clan. Now he was the first to lead the seven states in throwing the realm into chaos—how can we continue his descendants!\" Wu was not permitted, but Chu was permitted to establish descendants. At this time Li served as Han's Director of the Imperial Clan. He was appointed King of Chu to maintain Prince Yuan's ancestral temples, and became King Wen of Chu.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "文王立三年卒，子安王道立。",
          "translations": [
            {
              "lang": "en",
              "text": "King Wen reigned for three years and died, his son King An Dao ascended the throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "安王二十二年卒，子襄王注立。",
          "translations": [
            {
              "lang": "en",
              "text": "King An reigned for twenty-two years and died, his son King Xiang Zhu ascended the throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "襄王立十四年卒，子王純代立。",
          "translations": [
            {
              "lang": "en",
              "text": "King Xiang reigned for fourteen years and died, his son King Chun succeeded him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "王純立，地節二年，中人上書告楚王謀反，王自殺，國除，入漢為彭城郡。",
          "translations": [
            {
              "lang": "en",
              "text": "King Chun ascended the throne, in the second year of Dijie, a palace attendant submitted a memorial accusing the King of Chu of plotting rebellion. The king committed suicide, the state was abolished, and it became Pengcheng commandery of Han.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "King Wen reigned for three years and died, his son King An Dao ascended the throne. King An reigned for twenty-two years and died, his son King Xiang Zhu ascended the throne. King Xiang reigned for fourteen years and died, his son King Chun succeeded him. King Chun ascended the throne, in the second year of Dijie, a palace attendant submitted a memorial accusing the King of Chu of plotting rebellion. The king committed suicide, the state was abolished, and it became Pengcheng commandery of Han.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "趙王劉遂者，其父高祖中子，名友，謚曰「幽」。",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao Liu Sui—his father was Gaozu's middle son, named You, posthumously titled \"You.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "幽王以憂死，故為「幽」。",
          "translations": [
            {
              "lang": "en",
              "text": "King You died of sorrow, hence \"You.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "高后王呂祿於趙，一歲而高后崩。",
          "translations": [
            {
              "lang": "en",
              "text": "Empress Gao established Lü Lü as king in Zhao, and after one year Empress Gao passed away.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "大臣誅諸呂呂祿等，乃立幽王子遂為趙王。",
          "translations": [
            {
              "lang": "en",
              "text": "The ministers executed the various Lü clansmen including Lü Lü, and established King You's son Sui as King of Zhao.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "King Zhao Liu Sui—his father was Gaozu's middle son, named You, posthumously titled \"You.\" King You died of sorrow, hence \"You.\" Empress Gao established Lü Lü as king in Zhao, and after one year Empress Gao passed away. The ministers executed the various Lü clansmen including Lü Lü, and established King You's son Sui as King of Zhao.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "孝文帝即位二年，立遂弟辟彊，取趙之河閒郡為河閒王，（以）［是］為文王。",
          "translations": [
            {
              "lang": "en",
              "text": "In the second year of Emperor Wen's reign, he established Sui's younger brother Piqiang, taking Zhao's Hejian commandery to make him King of Hejian, who became King Wen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "立十三年卒，子哀王福立。",
          "translations": [
            {
              "lang": "en",
              "text": "He reigned for thirteen years and died, his son King Ai Fu ascended the throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "一年卒，無子，絕後，國除，入于漢。",
          "translations": [
            {
              "lang": "en",
              "text": "He reigned for one year and died without sons, the line was extinguished, the state abolished, and it reverted to Han.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In the second year of Emperor Wen's reign, he established Sui's younger brother Piqiang, taking Zhao's Hejian commandery to make him King of Hejian, who became King Wen. He reigned for thirteen years and died, his son King Ai Fu ascended the throne. He reigned for one year and died without sons, the line was extinguished, the state abolished, and it reverted to Han.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "遂既王趙二十六年，孝景帝時坐晁錯以適削趙王常山之郡。",
          "translations": [
            {
              "lang": "en",
              "text": "Sui had been king of Zhao for twenty-six years, during Emperor Jing's time he was convicted through Chao Cuo's machinations and had the King of Zhao's Changshan commandery stripped away.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "吳楚反，趙王遂與合謀起兵。",
          "translations": [
            {
              "lang": "en",
              "text": "When Wu and Chu rebelled, King Zhao Sui conspired with them and raised troops.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "其相建德、內史王悍諫，不聽。",
          "translations": [
            {
              "lang": "en",
              "text": "His chancellor Jiande and interior minister Wang Han advised against it, but he did not listen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "遂燒殺建德、王悍，發兵屯其西界，欲待吳與俱西。",
          "translations": [
            {
              "lang": "en",
              "text": "Sui burned and killed Jiande and Wang Han, sent troops to garrison his western border, wishing to wait for Wu to advance west together.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "北使匈奴，與連和攻漢。",
          "translations": [
            {
              "lang": "en",
              "text": "He sent envoys north to the Xiongnu to ally with them and attack Han.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "漢使曲周侯酈寄擊之。",
          "translations": [
            {
              "lang": "en",
              "text": "Han sent Marquis Quzhou Li Ji to attack him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "趙王遂還，城守邯鄲，相距七月。",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao Sui returned and defended Handan, they confronted each other for seven months.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "吳楚敗於梁，不能西。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu and Chu were defeated at Liang and could not advance west.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "匈奴聞之，亦止，不肯入漢邊。",
          "translations": [
            {
              "lang": "en",
              "text": "The Xiongnu heard of this and also stopped, refusing to enter Han territory.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "欒布自破齊還，乃并兵引水灌趙城。",
          "translations": [
            {
              "lang": "en",
              "text": "Luan Bu returned from defeating Qi and combined forces to divert water and flood Zhao city.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "趙城壞，趙王自殺，邯鄲遂降。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhao city was breached, King Zhao committed suicide, and Handan surrendered.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "趙幽王絕後。",
          "translations": [
            {
              "lang": "en",
              "text": "The line of King Zhao You was extinguished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Sui had been king of Zhao for twenty-six years, during Emperor Jing's time he was convicted through Chao Cuo's machinations and had the King of Zhao's Changshan commandery stripped away. When Wu and Chu rebelled, King Zhao Sui conspired with them and raised troops. His chancellor Jiande and interior minister Wang Han advised against it, but he did not listen. Sui burned and killed Jiande and Wang Han, sent troops to garrison his western border, wishing to wait for Wu to advance west together. He sent envoys north to the Xiongnu to ally with them and attack Han. Han sent Marquis Quzhou Li Ji to attack him. King Zhao Sui returned and defended Handan, they confronted each other for seven months. Wu and Chu were defeated at Liang and could not advance west. The Xiongnu heard of this and also stopped, refusing to enter Han territory. Luan Bu returned from defeating Qi and combined forces to divert water and flood Zhao city. Zhao city was breached, King Zhao committed suicide, and Handan surrendered. The line of King Zhao You was extinguished.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0047",
          "zh": "太史公曰：國之將興，必有禎祥，君子用而小人退。",
          "translations": [
            {
              "lang": "en",
              "text": "The Grand Historian says: When a state is about to flourish, there will certainly be auspicious omens, the worthy are employed and the petty withdraw.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "國之將亡，賢人隱，亂臣貴。",
          "translations": [
            {
              "lang": "en",
              "text": "When a state is about to perish, the worthy hide themselves and traitors are honored.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "使楚王戊毋刑申公，遵其言，趙任防與先生，豈有篡殺之謀，為天下僇哉？",
          "translations": [
            {
              "lang": "en",
              "text": "If King Chu Wu had not executed Master Shen and followed his advice, and Zhao had employed Fang and the masters, how could there have been plots of usurpation and murder, bringing disgrace upon the realm?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "賢人乎，賢人乎！",
          "translations": [
            {
              "lang": "en",
              "text": "Ah, the worthy! Ah, the worthy!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "非質有其內，惡能用之哉？",
          "translations": [
            {
              "lang": "en",
              "text": "If one does not possess the substance within, how can one employ it?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "甚矣，「安危在出令，存亡在所任」，誠哉是言也！",
          "translations": [
            {
              "lang": "en",
              "text": "How true it is that 'security and danger lie in issuing commands, survival and extinction lie in whom one employs'—truly this saying is correct!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Grand Historian says: When a state is about to flourish, there will certainly be auspicious omens, the worthy are employed and the petty withdraw. When a state is about to perish, the worthy hide themselves and traitors are honored. If King Chu Wu had not executed Master Shen and followed his advice, and Zhao had employed Fang and the masters, how could there have been plots of usurpation and murder, bringing disgrace upon the realm? Ah, the worthy! Ah, the worthy! If one does not possess the substance within, how can one employ it? How true it is that 'security and danger lie in issuing commands, survival and extinction lie in whom one employs'—truly this saying is correct!",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}