{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "056",
    "url": "https://chinesenotes.com/shiji/shiji056.html",
    "title": {
      "zh": "陳丞相世家",
      "en": "House of Chancellor Chen",
      "raw": "《陳丞相世家》 House of Chancellor Chen"
    },
    "sentenceCount": 246,
    "translatedCount": 0,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:38.346Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "陳丞相平者，陽武戶牖鄉人也。",
          "translations": []
        },
        {
          "id": "s0002",
          "zh": "少時家貧，好讀書，有田三十畝，獨與兄伯居。",
          "translations": []
        },
        {
          "id": "s0003",
          "zh": "伯常耕田，縱平使游學。",
          "translations": []
        },
        {
          "id": "s0004",
          "zh": "平為人長［大］美色。",
          "translations": []
        },
        {
          "id": "s0005",
          "zh": "人或謂陳平曰：「貧何食而肥若是？」",
          "translations": []
        },
        {
          "id": "s0006",
          "zh": "其嫂嫉平之不視家生產，曰：「亦食糠覈耳。",
          "translations": []
        },
        {
          "id": "s0007",
          "zh": "有叔如此，不如無有。」",
          "translations": []
        },
        {
          "id": "s0008",
          "zh": "伯聞之，逐其婦而棄之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Chancellor Chen Ping was a native of Huyou township in Yangwu county. In his youth his family was poor, he loved reading books, had thirty mu of fields, and lived alone with his elder brother Bo. Bo constantly plowed the fields, allowing Ping to study abroad. Ping was tall and strikingly handsome. Someone asked Chen Ping: 'Though poor, how do you eat so well that you are this plump?' His sister-in-law was jealous that Ping did not oversee household production, saying: 'He also just eats bran and husks. With an uncle like this, better to have none.' Bo heard this and drove out his wife, divorcing her.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "及平長，可娶妻，富人莫肯與者，貧者平亦恥之。",
          "translations": []
        },
        {
          "id": "s0010",
          "zh": "久之，戶牖富人有張負，張負女孫五嫁而夫輒死，人莫敢娶。",
          "translations": []
        },
        {
          "id": "s0011",
          "zh": "平欲得之。",
          "translations": []
        },
        {
          "id": "s0012",
          "zh": "邑中有喪，平貧，侍喪，以先往後罷為助。",
          "translations": []
        },
        {
          "id": "s0013",
          "zh": "張負既見之喪所，獨視偉平，平亦以故後去。",
          "translations": []
        },
        {
          "id": "s0014",
          "zh": "負隨平至其家，家乃負郭窮巷，以獘席為門，然門外多有長者車轍。",
          "translations": []
        },
        {
          "id": "s0015",
          "zh": "張負歸，謂其子仲曰：「吾欲以女孫予陳平。」",
          "translations": []
        },
        {
          "id": "s0016",
          "zh": "張仲曰：「平貧不事事，一縣中盡笑其所為，獨柰何予女乎？」",
          "translations": []
        },
        {
          "id": "s0017",
          "zh": "負曰：「人固有好美如陳平而長貧賤者乎？」",
          "translations": []
        },
        {
          "id": "s0018",
          "zh": "卒與女。",
          "translations": []
        },
        {
          "id": "s0019",
          "zh": "為平貧，乃假貸幣以聘，予酒肉之資以內婦。",
          "translations": []
        },
        {
          "id": "s0020",
          "zh": "負誡其孫曰：「毋以貧故，事人不謹。",
          "translations": []
        },
        {
          "id": "s0021",
          "zh": "事兄伯如事父，事嫂如母。」",
          "translations": []
        },
        {
          "id": "s0022",
          "zh": "平既娶張氏女，齎用益饒，游道日廣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Ping grew up and was old enough to marry, rich people would not give him their daughters, poor ones Ping also disdained. After a long time, there was a rich man in Huyou named Zhang Fu, whose granddaughter had married five times but her husbands always died, no one dared marry her. Ping desired her. There was a funeral in the town, Ping was poor and attended the mourning, helping by arriving first and leaving last. Zhang Fu saw him at the funeral site and gazed at the impressive Ping alone, Ping also deliberately left later. Fu followed Ping to his home, which was in a poor alley outside the city walls, with a ragged mat as a door, yet outside the door there were many ruts from elders' carriages. Zhang Fu returned and told his son Zhong: 'I wish to give my granddaughter to Chen Ping.' Zhang Zhong said: 'Ping is poor and does no work, the whole county laughs at what he does—why give him a daughter?' Fu said: 'Is there anyone who loves beauty like Chen Ping and remains long in poverty and lowliness?' He finally gave her to him. Because Ping was poor, he loaned money for the betrothal gifts, provided funds for wine and meat to bring in the bride. Fu admonished his granddaughter: 'Do not because of poverty serve people carelessly. Serve your brother Bo as you would a father, serve your sister-in-law as a mother.' After Ping married the Zhang family daughter, his travel expenses became more abundant, his wanderings grew broader daily.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0023",
          "zh": "裏中社，平為宰，分肉食甚均。",
          "translations": []
        },
        {
          "id": "s0024",
          "zh": "父老曰：「善，陳孺子之為宰！」",
          "translations": []
        },
        {
          "id": "s0025",
          "zh": "平曰：「嗟乎，使平得宰天下，亦如是肉矣！」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "In the village sacrificial ceremony, Ping served as steward, dividing the meat very evenly. The elders said: 'Good, how Chen the young man serves as steward!' Ping said: 'Alas, if Ping could steward the realm, he would divide the meat like this!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "陳涉起而王陳，使周市略定魏地，立魏咎為魏王，與秦軍相攻於臨濟。",
          "translations": []
        },
        {
          "id": "s0028",
          "zh": "陳平固已前謝其兄伯，從少年往事魏王咎於臨濟。",
          "translations": []
        },
        {
          "id": "s0029",
          "zh": "魏王以為太仆。",
          "translations": []
        },
        {
          "id": "s0030",
          "zh": "說魏王不聽，人或讒之，陳平亡去。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Chen She rose up and made himself king of Chen, sent Zhou Shi to raid and pacify Wei territory, established Wei Jiu as King of Wei, who fought with Qin armies at Linji. Chen Ping had already beforehand taken leave of his brother Bo, following youths to serve King Wei Jiu at Linji. The King of Wei appointed him Grand Coachman. He advised the King of Wei but was not listened to, someone slandered him, Chen Ping fled.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "久之，項羽略地至河上，陳平往歸之，從入破秦，賜平爵卿。",
          "translations": []
        },
        {
          "id": "s0032",
          "zh": "項羽之東王彭城也，漢王還定三秦而東，殷王反楚。",
          "translations": []
        },
        {
          "id": "s0033",
          "zh": "項羽乃以平為信武君，將魏王咎客在楚者以往，擊降殷王而還。",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "項王使項悍拜平為都尉，賜金二十溢。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "居無何，漢王攻下殷（王）。",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "項王怒，將誅定殷者將吏。",
          "translations": []
        },
        {
          "id": "s0037",
          "zh": "陳平懼誅，乃封其金與印，使使歸項王，而平身閒行杖劍亡。",
          "translations": []
        },
        {
          "id": "s0038",
          "zh": "渡河，船人見其美丈夫獨行，疑其亡將，要中當有金玉寶器，目之，欲殺平。",
          "translations": []
        },
        {
          "id": "s0039",
          "zh": "平恐，乃解衣躶而佐刺船，船人知其無有，乃止。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "After a long time, Xiang Yu raided territory to the Yellow River, Chen Ping went and joined him, followed in entering and destroying Qin, Xiang Yu granted Ping the rank of minister. When Xiang Yu went east to rule Pengcheng, the King of Han returned and pacified the Three Qins then went east, the King of Yin rebelled against Chu. Xiang Yu then appointed Ping as Lord Xinwu, leading the King of Wei's retainers in Chu to go attack and subdue the King of Yin, then return. The Lord of Chu had Xiang Han appoint Ping as Commandant, granting twenty yi of gold. Before long, the King of Han attacked and captured the King of Yin. The Lord of Chu was angry and would execute those generals and officials who pacified Yin. Chen Ping feared execution, so he sealed his gold and seal, sent an envoy to return them to the Lord of Chu, while Ping himself secretly traveled with sword and staff, fleeing. Crossing the river, the boatman saw this handsome man traveling alone, suspected he was a fleeing general, that in his baggage there must be gold, jade, and precious objects, eyed him, desiring to kill Ping. Ping feared, so he stripped off his clothes naked and helped pole the boat, the boatman knew he had nothing, so stopped.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "平遂至修武降漢，因魏無知求見漢王，漢王召入。",
          "translations": []
        },
        {
          "id": "s0041",
          "zh": "是時萬石君奮為漢王中涓，受平謁，入見平。",
          "translations": []
        },
        {
          "id": "s0042",
          "zh": "平等七人俱進，賜食。",
          "translations": []
        },
        {
          "id": "s0043",
          "zh": "王曰：「罷，就舍矣。」",
          "translations": []
        },
        {
          "id": "s0044",
          "zh": "平曰：「臣為事來，所言不可以過今日。」",
          "translations": []
        },
        {
          "id": "s0045",
          "zh": "於是漢王與語而說之，問曰：「子之居楚何官？」",
          "translations": []
        },
        {
          "id": "s0046",
          "zh": "曰：「為都尉。」",
          "translations": []
        },
        {
          "id": "s0047",
          "zh": "是日乃拜平為都尉，使為參乘，典護軍。",
          "translations": []
        },
        {
          "id": "s0048",
          "zh": "諸將盡讙，曰：「大王一日得楚之亡卒，未知其高下，而即與同載，反使監護軍長者！」",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "漢王聞之，愈益幸平。",
          "translations": []
        },
        {
          "id": "s0050",
          "zh": "遂與東伐項王。",
          "translations": []
        },
        {
          "id": "s0051",
          "zh": "至彭城，為楚所敗。",
          "translations": []
        },
        {
          "id": "s0052",
          "zh": "引而還，收散兵至滎陽，以平為亞將，屬於韓王信，軍廣武。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping thus reached Xiuwu and surrendered to Han, through Wei Wuzhi sought to see the King of Han, the King of Han summoned him in. At this time Lord Wanshi Fen served as the King of Han's attendant, received Ping's card, entered and saw Ping. Ping and six others all advanced, granted food. The king said: 'Dismissed, go to your quarters.' Ping said: 'Your servant comes for matters, what I say cannot wait past today.' Thus the King of Han spoke with him and was pleased, asked: 'What office did you hold in Chu?' Said: 'Served as Commandant.' That day he appointed Ping as Commandant, had him serve as chariot companion, overseeing and protecting the army. All the generals laughed uproariously, saying: 'The great king in one day gets a fleeing soldier from Chu, not knowing his quality, yet immediately rides with him in the same chariot, moreover has him oversee and protect the senior generals!' The King of Han heard this and all the more favored Ping. Thus he went east with him to attack Xiang Yu. Arriving at Pengcheng, he was defeated by Chu. He led the retreat, gathered the scattered troops to Xingyang, appointed Ping as second-in-command, subordinate to King Han Xin, stationed at Guangwu.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "絳侯、灌嬰等咸讒陳平曰：「平雖美丈夫，如冠玉耳，其中未必有也。",
          "translations": []
        },
        {
          "id": "s0054",
          "zh": "臣聞平居家時，盜其嫂；",
          "translations": []
        },
        {
          "id": "s0055",
          "zh": "事魏不容，亡歸楚；",
          "translations": []
        },
        {
          "id": "s0056",
          "zh": "歸楚不中，又亡歸漢。",
          "translations": []
        },
        {
          "id": "s0057",
          "zh": "今日大王尊官之，令護軍。",
          "translations": []
        },
        {
          "id": "s0058",
          "zh": "臣聞平受諸將金，金多者得善處，金少者得惡處。",
          "translations": []
        },
        {
          "id": "s0059",
          "zh": "平，反覆亂臣也，願王察之。」",
          "translations": []
        },
        {
          "id": "s0060",
          "zh": "漢王疑之，召讓魏無知。",
          "translations": []
        },
        {
          "id": "s0061",
          "zh": "無知曰：「臣所言者，能也；",
          "translations": []
        },
        {
          "id": "s0062",
          "zh": "陛下所問者，行也。",
          "translations": []
        },
        {
          "id": "s0063",
          "zh": "今有尾生、孝己之行而無益處於勝負之數，陛下何暇用之乎？",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "楚漢相距，臣進奇謀之士，顧其計誠足以利國家不耳。",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "且盜嫂受金又何足疑乎？」",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "漢王召讓平曰：「先生事魏不中，遂事楚而去，今又從吾游，信者固多心乎？」",
          "translations": []
        },
        {
          "id": "s0067",
          "zh": "平曰：「臣事魏王，魏王不能用臣說，故去事項王。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "項王不能信人，其所任愛，非諸項即妻之昆弟，雖有奇士不能用，平乃去楚。",
          "translations": []
        },
        {
          "id": "s0069",
          "zh": "聞漢王之能用人，故歸大王。",
          "translations": []
        },
        {
          "id": "s0070",
          "zh": "臣躶身來，不受金無以為資。",
          "translations": []
        },
        {
          "id": "s0071",
          "zh": "誠臣計畫有可采者，（顧）［願］大王用之；",
          "translations": []
        },
        {
          "id": "s0072",
          "zh": "使無可用者，金具在，請封輸官，得請骸骨。」",
          "translations": []
        },
        {
          "id": "s0073",
          "zh": "漢王乃謝，厚賜，拜為護軍中尉，盡護諸將。",
          "translations": []
        },
        {
          "id": "s0074",
          "zh": "諸將乃不敢復言。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Marquis Jiang, Guan Ying and others all slandered Chen Ping, saying: 'Ping though a handsome man, is like a jade crown—perhaps beautiful outside but empty within. Your servants have heard that when Ping lived at home, he stole his sister-in-law; served Wei but was not tolerated, fled to join Chu; joined Chu but was not appreciated, again fled to join Han. Now the great king honors him with office, commands him to protect the army. Your servants have heard Ping accepts gold from the generals—those who give much gold get good positions, those who give little gold get bad positions. Ping is a fickle rebellious minister, we wish the king to examine him.' The King of Han doubted it, summoned and reproached Wei Wuzhi. Wuzhi said: 'What your servant spoke of was ability; what your majesty asks about is conduct. Now if there are men with the conduct of Wei Sheng or Xiao Ji but no benefit for the calculations of victory and defeat, why would your majesty have time to employ them? Chu and Han confront each other, your servant advances men of extraordinary strategy, only considering whether their plans can truly benefit the state. Moreover, stealing sister-in-law and accepting gold—what is there to doubt?' The King of Han summoned and reproached Ping: 'Sir served Wei without success, then served Chu and left, now again follows my wanderings—faithful people are certainly suspicious?' Ping said: 'Your servant served the King of Wei, the King of Wei could not use your servant's advice, so left to serve Xiang Wang. Xiang Wang cannot trust people, those he appoints and loves are either various Xiangs or his wife's brothers and sisters—even if there are extraordinary scholars he cannot employ, so Ping left Chu. Heard the King of Han can employ people, so returned to the great king. Your servant came naked, without accepting gold could not provide for himself. If your servant's plans have anything worth adopting, [I wish] the great king would use them; if there is nothing usable, the gold is all here, please seal and deliver to the treasury, allow your servant to request his old bones.' The King of Han then apologized, richly rewarded him, appointed him Protector of the Army Commandant, overseeing all generals. The generals then dared not speak again.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "其後，楚急攻，絕漢甬道，圍漢王於滎陽城。",
          "translations": []
        },
        {
          "id": "s0076",
          "zh": "久之，漢王患之，請割滎陽以西以和。",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "項王不聽。",
          "translations": []
        },
        {
          "id": "s0078",
          "zh": "漢王謂陳平曰：「天下紛紛，何時定乎？」",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "陳平曰：「項王為人，恭敬愛人，士之廉節好禮者多歸之。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "至於行功爵邑，重之，士亦以此不附。",
          "translations": []
        },
        {
          "id": "s0081",
          "zh": "今大王慢而少禮，士廉節者不來；",
          "translations": []
        },
        {
          "id": "s0082",
          "zh": "然大王能饒人以爵邑，士之頑鈍嗜利無恥者亦多歸漢。",
          "translations": []
        },
        {
          "id": "s0083",
          "zh": "誠各去其兩短，襲其兩長，天下指麾則定矣。",
          "translations": []
        },
        {
          "id": "s0084",
          "zh": "然大王恣侮人，不能得廉節之士。",
          "translations": []
        },
        {
          "id": "s0085",
          "zh": "顧楚有可亂者，彼項王骨鯁之臣亞父、鐘離眛、龍且、周殷之屬，不過數人耳。",
          "translations": []
        },
        {
          "id": "s0086",
          "zh": "大王誠能出捐數萬斤金，行反閒，閒其君臣，以疑其心，項王為人意忌信讒，必內相誅。",
          "translations": []
        },
        {
          "id": "s0087",
          "zh": "漢因舉兵而攻之，破楚必矣。」",
          "translations": []
        },
        {
          "id": "s0088",
          "zh": "漢王以為然，乃出黃金四萬斤，與陳平，恣所為，不問其出入。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Afterwards, Chu urgently attacked, cut off the Han covered walkway, besieged the King of Han in Xingyang city. After a long time, the King of Han was troubled by it, requested to cede west of Xingyang for peace. Xiang Wang would not listen. The King of Han told Chen Ping: 'The realm is in chaos, when will it be settled?' Chen Ping said: 'Xiang Wang as a person is respectful and loves people, scholars who are incorruptible and value ritual mostly go to him. As for rewarding merit with ranks and fiefs, he is stingy with them, scholars also do not attach because of this. Now the great king is arrogant and lacks ritual, incorruptible scholars do not come; yet the great king can enrich people with ranks and fiefs, scholars who are dull, greedy for profit, and shameless also mostly go to Han. If we truly each abandon our two shortcomings and adopt our two strengths, the realm will be settled at a wave of the hand. Yet the great king indulges in insulting people, cannot obtain incorruptible scholars. But Chu has vulnerabilities to exploit—Xiang Wang's unyielding ministers like Yafu, Zhongli Mei, Long Ju, Zhou Yin and such are no more than several people. If the great king can truly put out tens of thousands of jin of gold, employ reverse espionage, sow discord among their ruler and ministers to make their hearts suspicious, Xiang Wang as a person is suspicious and believes slander, they will certainly slaughter each other internally. Han will then raise troops and attack them, defeating Chu is certain.' The King of Han considered it right, so put out 40,000 jin of yellow gold, gave it to Chen Ping, let him do as he wished, not questioning his comings and goings.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0089",
          "zh": "陳平既多以金縱反閒於楚軍，宣言諸將鐘離眛等為項王將，功多矣，然而終不得裂地而王，欲與漢為一，以滅項氏而分王其地。",
          "translations": []
        },
        {
          "id": "s0090",
          "zh": "項羽果意不信鐘離眛等。",
          "translations": []
        },
        {
          "id": "s0091",
          "zh": "項王既疑之，使使至漢。",
          "translations": []
        },
        {
          "id": "s0092",
          "zh": "漢王為太牢具，舉進。",
          "translations": []
        },
        {
          "id": "s0093",
          "zh": "見楚使，即詳驚曰：「吾以為亞父使，乃項王使！」",
          "translations": []
        },
        {
          "id": "s0094",
          "zh": "復持去，更以惡草具進楚使。",
          "translations": []
        },
        {
          "id": "s0095",
          "zh": "楚使歸，具以報項王。",
          "translations": []
        },
        {
          "id": "s0096",
          "zh": "項王果大疑亞父。",
          "translations": []
        },
        {
          "id": "s0097",
          "zh": "亞父欲急攻下滎陽城，項王不信，不肯聽。",
          "translations": []
        },
        {
          "id": "s0098",
          "zh": "亞父聞項王疑之，乃怒曰：「天下事大定矣，君王自為之！",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "願請骸骨歸！」",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "歸未至彭城，疽發背而死。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "陳平乃夜出女子二千人滎陽城東門，楚因擊之，陳平乃與漢王從城西門夜出去。",
          "translations": []
        },
        {
          "id": "s0102",
          "zh": "遂入關，收散兵復東。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Chen Ping having used much gold to spread reverse espionage in the Chu army, proclaiming that generals like Zhongli Mei served as Xiang Wang's generals with great merit, yet ultimately could not split off land and become kings, wished to unite with Han to extinguish the Xiang clan and divide their land as kingdoms. Xiang Yu indeed began to distrust Zhongli Mei and others. The Lord of Chu having suspected them, sent envoys to Han. The King of Han prepared a grand feast, presented it. Seeing the Chu envoy, he pretended to be shocked: 'I thought it was Yafu's envoy, but it's Xiang Wang's envoy!' Then took it away, changed to poor grass provisions to present to the Chu envoy. The Chu envoy returned and fully reported to Xiang Wang. Xiang Wang indeed greatly suspected Yafu. Yafu wished to urgently attack and capture Xingyang city, Xiang Wang did not trust him, would not listen. Yafu heard Xiang Wang suspected him, then angered: 'The realm's affairs are greatly settled, your majesty do it yourself! I wish to request my old bones and return!' Returning before reaching Pengcheng, a carbuncle erupted on his back and he died. Chen Ping then at night sent out 2000 women from Xingyang city's east gate, Chu thus attacked them, Chen Ping then with the King of Han went out from the west gate at night. Thus entered the passes, gathered scattered troops and again went east.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "其明年，淮陰侯破齊，自立為齊王，使使言之漢王。",
          "translations": []
        },
        {
          "id": "s0104",
          "zh": "漢王大怒而罵，陳平躡漢王。",
          "translations": []
        },
        {
          "id": "s0105",
          "zh": "漢王亦悟，乃厚遇齊使，使張子房卒立信為齊王。",
          "translations": []
        },
        {
          "id": "s0106",
          "zh": "封平以戶牖鄉。",
          "translations": []
        },
        {
          "id": "s0107",
          "zh": "用其奇計策，卒滅楚。",
          "translations": []
        },
        {
          "id": "s0108",
          "zh": "常以護軍中尉從定燕王臧荼。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The next year, Marquis Huaiyin defeated Qi, established himself as King of Qi, sent envoys to inform the King of Han. The King of Han greatly angered and cursed, Chen Ping stepped on the King of Han's foot. The King of Han also awoke, then treated the Qi envoy generously, had Zhang Zifang finally establish Xin as King of Qi. Enfeoffed Ping with Huyou township. Used his extraordinary strategies, ultimately extinguished Chu. Constantly as Protector of the Army Commandant followed in pacifying King Yan Zang Tu.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "漢六年，人有上書告楚王韓信反。",
          "translations": []
        },
        {
          "id": "s0110",
          "zh": "高帝問諸將，諸將曰：「亟發兵阬豎子耳。」",
          "translations": []
        },
        {
          "id": "s0111",
          "zh": "高帝默然。",
          "translations": []
        },
        {
          "id": "s0112",
          "zh": "問陳平，平固辭謝，曰：「諸將云何？」",
          "translations": []
        },
        {
          "id": "s0113",
          "zh": "上具告之。",
          "translations": []
        },
        {
          "id": "s0114",
          "zh": "陳平曰：「人之上書言信反，有知之者乎？」",
          "translations": []
        },
        {
          "id": "s0115",
          "zh": "曰：「未有。」",
          "translations": []
        },
        {
          "id": "s0116",
          "zh": "曰：「信知之乎？」",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "曰：「不知。」",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "陳平曰：「陛下精兵孰與楚？」",
          "translations": []
        },
        {
          "id": "s0119",
          "zh": "上曰：「不能過。」",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "平曰：「陛下將用兵有能過韓信者乎？」",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "上曰：「莫及也。」",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "平曰：「今兵不如楚精，而將不能及，而舉兵攻之，是趣之戰也，竊為陛下危之。」",
          "translations": []
        },
        {
          "id": "s0123",
          "zh": "上曰：「為之柰何？」",
          "translations": []
        },
        {
          "id": "s0124",
          "zh": "平曰：「古者天子巡狩，會諸侯。",
          "translations": []
        },
        {
          "id": "s0125",
          "zh": "南方有雲夢，陛下弟出偽游雲夢，會諸侯於陳。",
          "translations": []
        },
        {
          "id": "s0126",
          "zh": "陳，楚之西界，信聞天子以好出游，其勢必無事而郊迎謁。",
          "translations": []
        },
        {
          "id": "s0127",
          "zh": "謁，而陛下因禽之，此特一力士之事耳。」",
          "translations": []
        },
        {
          "id": "s0128",
          "zh": "高帝以為然，乃發使告諸侯會陳，「吾將南游雲夢」。",
          "translations": []
        },
        {
          "id": "s0129",
          "zh": "上因隨以行。",
          "translations": []
        },
        {
          "id": "s0130",
          "zh": "行未至陳，楚王信果郊迎道中。",
          "translations": []
        },
        {
          "id": "s0131",
          "zh": "高帝豫具武士，見信至，即執縛之，載後車。",
          "translations": []
        },
        {
          "id": "s0132",
          "zh": "信呼曰：「天下已定，我固當烹！」",
          "translations": []
        },
        {
          "id": "s0133",
          "zh": "高帝顧謂信曰：「若毋聲！",
          "translations": []
        },
        {
          "id": "s0134",
          "zh": "而反，明矣！」",
          "translations": []
        },
        {
          "id": "s0135",
          "zh": "武士反接之。",
          "translations": []
        },
        {
          "id": "s0136",
          "zh": "遂會諸侯于陳，盡定楚地。",
          "translations": []
        },
        {
          "id": "s0137",
          "zh": "還至雒陽，赦信以為淮陰侯，而與功臣剖符定封。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Han year 6, someone submitted a memorial accusing King Chu Han Xin of rebellion. Gaozu asked the generals, the generals said: 'Urgently dispatch troops and bury the bastard.' Gaozu was silent. Asked Chen Ping, Ping firmly declined and apologized, said: 'What do the generals say?' The emperor fully told him. Chen Ping said: 'The person who submitted the memorial saying Xin rebels—does anyone know about it?' Said: 'None.' Said: 'Does Xin know about it?' Said: 'Does not know.' Chen Ping said: 'Your majesty's elite troops compared to Chu's?' The emperor said: 'Cannot surpass.' Ping said: 'Your majesty's generals who use troops—any who surpass Han Xin?' The emperor said: 'None match.' Ping said: 'Now troops are not as elite as Chu's, generals cannot match, yet raise troops to attack him—this is rushing him into battle, I secretly worry for your majesty.' The emperor said: 'What to do?' Ping said: 'In ancient times the Son of Heaven toured and inspected, assembled the feudal lords. In the south there is Yunmeng, your majesty should go out pretending to tour Yunmeng, assemble the feudal lords at Chen. Chen is Chu's western border, Xin hearing the Son of Heaven goes out on a pleasure tour, by necessity he will have no affairs and come to welcome and greet in the suburbs. When he greets, your majesty then captures him—this is particularly the work of one strongman.' Gaozu considered it right, so sent envoys to inform the feudal lords to assemble at Chen, 'I will tour south to Yunmeng.' The emperor then followed to go. Before reaching Chen, King Chu Xin indeed came to welcome in the suburbs on the road. Gaozu had prepared warriors in advance, seeing Xin arrive, immediately seized and bound him, loaded him in the rear carriage. Xin called out: 'The realm is already settled, I certainly should be boiled!' Gaozu turned and told Xin: 'You be silent! Your rebellion is clear!' The warriors bound him with hands behind back. Thus assembled the feudal lords at Chen, completely pacified Chu territory. Returned to Luoyang, pardoned Xin to be Marquis of Huaiyin, and with the meritorious officials shared the tally and determined enfeoffments.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0138",
          "zh": "於是與平剖符，世世勿絕，為戶牖侯。",
          "translations": []
        },
        {
          "id": "s0139",
          "zh": "平辭曰：「此非臣之功也。」",
          "translations": []
        },
        {
          "id": "s0140",
          "zh": "上曰：「吾用先生謀計，戰勝剋敵，非功而何？」",
          "translations": []
        },
        {
          "id": "s0141",
          "zh": "平曰：「非魏無知臣安得進？」",
          "translations": []
        },
        {
          "id": "s0142",
          "zh": "上曰；",
          "translations": []
        },
        {
          "id": "s0143",
          "zh": "「若子可謂不背本矣。」",
          "translations": []
        },
        {
          "id": "s0144",
          "zh": "乃復賞魏無知。",
          "translations": []
        },
        {
          "id": "s0145",
          "zh": "其明年，以護軍中尉從攻反者韓王信於代。",
          "translations": []
        },
        {
          "id": "s0146",
          "zh": "卒至平城，為匈奴所圍，七日不得食。",
          "translations": []
        },
        {
          "id": "s0147",
          "zh": "高帝用陳平奇計，使單于閼氏，圍以得開。",
          "translations": []
        },
        {
          "id": "s0148",
          "zh": "高帝既出，其計祕，世莫得聞。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus shared the tally with Ping, never to be extinguished generation after generation, as Marquis of Huyou. Ping declined, saying: 'This is not your servant's merit.' The emperor said: 'I used sir's strategies, won victories and conquered enemies—what is this if not merit?' Ping said: 'Without Wei Wuzhi how could your servant advance?' The emperor said: 'You can be called one who does not forget his roots.' Thus again rewarded Wei Wuzhi. The next year, as Protector of the Army Commandant followed in attacking the rebel King Han Xin in Dai. Ultimately reached Pingcheng, was surrounded by the Xiongnu, seven days without food. Gaozu used Chen Ping's extraordinary strategy, sent gifts to the Chanyu's consort, the siege thus lifted. Gaozu having left, the strategy was secret, the world could not hear it.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "高帝南過曲逆，上其城，望見其屋室甚大，曰：「壯哉縣！",
          "translations": []
        },
        {
          "id": "s0150",
          "zh": "吾行天下，獨見洛陽與是耳。」",
          "translations": []
        },
        {
          "id": "s0151",
          "zh": "顧問御史曰：「曲逆戶口幾何？」",
          "translations": []
        },
        {
          "id": "s0152",
          "zh": "對曰：「始秦時三萬餘戶，閒者兵數起，多亡匿，今見五千戶。」",
          "translations": []
        },
        {
          "id": "s0153",
          "zh": "於是乃詔御史，更以陳平為曲逆侯，盡食之，除前所食戶牖。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Gaozu passing south through Qu Ni, ascended its city wall, saw its buildings were very large, said: 'Magnificent county! I have traveled the realm, only seen Luoyang and this.' Turned and asked the imperial secretary: 'How many households does Qu Ni have?' Replied: 'In the beginning of Qin there were over 30,000 households, but in the intervening time wars rose repeatedly, many fled and hid, now there are only 5,000 households.' Thus commanded the imperial secretary to change and make Chen Ping Marquis of Qu Ni, eating all of it, removing the previous Huyou he ate.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0154",
          "zh": "其後常以護軍中尉從攻陳豨及黥布。",
          "translations": []
        },
        {
          "id": "s0155",
          "zh": "凡六出奇計，輒益邑，凡六益封。",
          "translations": []
        },
        {
          "id": "s0156",
          "zh": "奇計或頗祕，世莫能聞也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Afterwards constantly as Protector of the Army Commandant followed in attacking Chen Xi and Ying Bu. Altogether six times put forth extraordinary strategies, each time increased his fief, altogether six increases in enfeoffment. The extraordinary strategies were somewhat secret, the world could not hear them.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "高帝從破布軍還，病創，徐行至長安。",
          "translations": []
        },
        {
          "id": "s0158",
          "zh": "燕王盧綰反，上使樊噲以相國將兵攻之。",
          "translations": []
        },
        {
          "id": "s0159",
          "zh": "既行，人有短惡噲者。",
          "translations": []
        },
        {
          "id": "s0160",
          "zh": "高帝怒曰：「噲見吾病，乃冀我死也。」",
          "translations": []
        },
        {
          "id": "s0161",
          "zh": "用陳平謀而召絳侯周勃受詔床下，曰：「陳平亟馳傳載勃代噲將，平至軍中即斬噲頭！」",
          "translations": []
        },
        {
          "id": "s0162",
          "zh": "二人既受詔，馳傳未至軍，行計之曰：「樊噲，帝之故人也，功多，且又乃呂后弟呂媭之夫，有親且貴，帝以忿怒故，欲斬之，則恐後悔。",
          "translations": []
        },
        {
          "id": "s0163",
          "zh": "寧囚而致上，上自誅之。」",
          "translations": []
        },
        {
          "id": "s0164",
          "zh": "未至軍，為壇，以節召樊噲。",
          "translations": []
        },
        {
          "id": "s0165",
          "zh": "噲受詔，即反接載檻車，傳詣長安，而令絳侯勃代將，將兵定燕反縣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Gaozu following the defeat of Bu's army returned, wounded by arrows, slowly traveled to Chang'an. King Yan Lu Wan rebelled, the emperor sent Fan Kuai as prime minister leading troops to attack him. Having gone, someone spoke ill of Kuai. Gaozu angered said: 'Kuai seeing my illness, hopes I die.' Using Chen Ping's strategy summoned Marquis Jiang Zhou Bo to receive the decree under the bed, said: 'Chen Ping urgently gallop by relay, carry Bo to replace Kuai as general, Ping arriving in the army immediately behead Kuai!' The two having received the decree, galloped by relay not yet reaching the army, discussed it saying: 'Fan Kuai is the emperor's old friend, merits many, moreover is the husband of Empress Lü's younger brother Lü Chan, has close relations and is noble, the emperor in anger wishes to behead him, then fears regret. Better to imprison and deliver to the emperor, the emperor himself will execute him.' Before reaching the army, built an altar, summoned Fan Kuai with the tally. Kuai received the decree, immediately was bound with hands behind back and loaded in a caged carriage, transported to Chang'an, while commanding Marquis Jiang Bo to replace as general, leading troops to pacify Yan's rebellious counties.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0166",
          "zh": "平行聞高帝崩，平恐呂太后及呂媭讒怒，乃馳傳先去。",
          "translations": []
        },
        {
          "id": "s0167",
          "zh": "逢使者詔平與灌嬰屯於滎陽。",
          "translations": []
        },
        {
          "id": "s0168",
          "zh": "平受詔，立復馳至宮，哭甚哀，因奏事喪前。",
          "translations": []
        },
        {
          "id": "s0169",
          "zh": "呂太后哀之，曰：「君勞，出休矣。」",
          "translations": []
        },
        {
          "id": "s0170",
          "zh": "平畏讒之就，因固請得宿衛中。",
          "translations": []
        },
        {
          "id": "s0171",
          "zh": "太后乃以為郎中令，曰：「傅教孝惠。」",
          "translations": []
        },
        {
          "id": "s0172",
          "zh": "是後呂媭讒乃不得行。",
          "translations": []
        },
        {
          "id": "s0173",
          "zh": "樊噲至，則赦復爵邑。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping on the way heard Gaozu had collapsed, Ping fearing Empress Lü and Lü Chan would slander in anger, so galloped by relay ahead. Met envoys decreeing Ping and Guan Ying to station at Xingyang. Ping received the decree, immediately galloped again to the palace, wept very mournfully, thus memorialized affairs before the funeral. Empress Lü pitied him, said: 'Sir is weary, go out and rest.' Ping fearing slander would reach him, thus firmly requested to be among the palace guards. The empress then made him Commandant of the Langzhong, said: 'Tutor and teach Xiaohui.' After this Lü Chan's slander could not be carried out. Fan Kuai arrived, then was pardoned and restored rank and fief.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0174",
          "zh": "孝惠帝六年，相國曹參卒，以安國侯王陵為右丞相，陳平為左丞相。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Emperor Xiaohui year 6, prime minister Cao Can died, made Marquis Anguo Wang Ling right chancellor, Chen Ping left chancellor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0175",
          "zh": "王陵者，故沛人，始為縣豪，高祖微時，兄事陵。",
          "translations": []
        },
        {
          "id": "s0176",
          "zh": "陵少文，任氣，好直言。",
          "translations": []
        },
        {
          "id": "s0177",
          "zh": "及高祖起沛，入至咸陽，陵亦自聚黨數千人，居南陽，不肯從沛公。",
          "translations": []
        },
        {
          "id": "s0178",
          "zh": "及漢王之還攻項籍，陵乃以兵屬漢。",
          "translations": []
        },
        {
          "id": "s0179",
          "zh": "項羽取陵母置軍中，陵使至，則東鄉坐陵母，欲以招陵。",
          "translations": []
        },
        {
          "id": "s0180",
          "zh": "陵母既私送使者，泣曰：「為老妾語陵，謹事漢王。",
          "translations": []
        },
        {
          "id": "s0181",
          "zh": "漢王，長者也，無以老妾故，持二心。",
          "translations": []
        },
        {
          "id": "s0182",
          "zh": "妾以死送使者。」",
          "translations": []
        },
        {
          "id": "s0183",
          "zh": "遂伏劍而死。",
          "translations": []
        },
        {
          "id": "s0184",
          "zh": "項王怒，烹陵母。",
          "translations": []
        },
        {
          "id": "s0185",
          "zh": "陵卒從漢王定天下。",
          "translations": []
        },
        {
          "id": "s0186",
          "zh": "以善雍齒，雍齒，高帝之仇，而陵本無意從高帝，以故晚封，為安國侯。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Wang Ling was originally from Pei, began as a county bully, when Gaozu was humble, treated Ling as elder brother. Ling was little educated, impetuous, liked direct speech. When Gaozu rose from Pei, entered to Xianyang, Ling also gathered several thousand followers, resided in Nanyang, would not follow Duke Pei. When the King of Han returned to attack Xiang Ji, Ling then attached his troops to Han. Xiang Yu took Ling's mother and placed her in the army, when Ling's envoy arrived, then sat Ling's mother facing east, wishing to summon Ling. Ling's mother having secretly sent the envoy, wept saying: 'For this old concubine tell Ling, serve the King of Han carefully. The King of Han is a gentleman, do not because of this old concubine hold divided loyalties. This concubine sends the envoy with death.' Thus fell on her sword and died. Xiang Wang angered, boiled Ling's mother. Ling ultimately followed the King of Han to settle the realm. Because he was on good terms with Yong Chi—Chi was Gaozu's enemy—and Ling originally had no intention to follow Gaozu, therefore was enfeoffed late, as Marquis of Anguo.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0187",
          "zh": "安國侯既為右丞相，二歲，孝惠帝崩。",
          "translations": []
        },
        {
          "id": "s0188",
          "zh": "高后欲立諸呂為王，問王陵，王陵曰：「不可。」",
          "translations": []
        },
        {
          "id": "s0189",
          "zh": "問陳平，陳平曰：「可。」",
          "translations": []
        },
        {
          "id": "s0190",
          "zh": "呂太后怒，乃詳遷陵為帝太傅，實不用陵。",
          "translations": []
        },
        {
          "id": "s0191",
          "zh": "陵怒，謝疾免，杜門竟不朝請，七年而卒。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Marquis Anguo having become right chancellor, two years, Emperor Xiaohui collapsed. Empress Gao wished to establish various Lü as kings, asked Wang Ling, Wang Ling said: 'Cannot.' Asked Chen Ping, Chen Ping said: 'Can.' Empress Lü angered, pretended to transfer Ling to be imperial tutor, actually did not use Ling. Ling angered, pleaded illness and resigned, closed his door and never attended court audiences, seven years and died.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0192",
          "zh": "陵之免丞相，呂太后乃徙平為右丞相，以辟陽侯審食其為左丞相。",
          "translations": []
        },
        {
          "id": "s0193",
          "zh": "左丞相不治，常給事於中。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Ling resigned as chancellor, Empress Lü then transferred Ping to be right chancellor, made Marquis Piyang Shen Yiji left chancellor. The left chancellor did not manage affairs, constantly served in the palace.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0194",
          "zh": "食其亦沛人。",
          "translations": []
        },
        {
          "id": "s0195",
          "zh": "漢王之敗彭城西，楚取太上皇、呂后為質，食其以舍人侍呂后。",
          "translations": []
        },
        {
          "id": "s0196",
          "zh": "其後從破項籍為侯，幸於呂太后。",
          "translations": []
        },
        {
          "id": "s0197",
          "zh": "及為相，居中，百官皆因決事。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yiji was also from Pei. When the King of Han was defeated west of Pengcheng, Chu took the Supreme Ancestor and Empress Lü as hostages, Yiji as attendant served Empress Lü. Afterwards followed in defeating Xiang Ji became marquis, was favored by Empress Lü. When became chancellor, resided in the palace, all officials decided affairs through him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0198",
          "zh": "呂媭常以前陳平為高帝謀執樊噲，數讒曰：「陳平為相非治事，日飲醇酒，戲婦女。」",
          "translations": []
        },
        {
          "id": "s0199",
          "zh": "陳平聞，日益甚。",
          "translations": []
        },
        {
          "id": "s0200",
          "zh": "呂太后聞之，私獨喜。",
          "translations": []
        },
        {
          "id": "s0201",
          "zh": "面質呂媭於陳平曰：「鄙語曰『兒婦人口不可用』，顧君與我何如耳。",
          "translations": []
        },
        {
          "id": "s0202",
          "zh": "無畏呂媭之讒也。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lü Chan often because Ping had earlier strategized for Gaozu to seize Fan Kuai, frequently slandered saying: 'Chen Ping as chancellor does not manage affairs, daily drinks strong wine, plays with women.' Chen Ping hearing it, did it increasingly. Empress Lü hearing it, privately was alone pleased. Confronted Lü Chan about Chen Ping saying: 'The vulgar saying goes 'children and women's mouths cannot be used', but consider sir and me what relation.' Do not fear Lü Chan's slander.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0204",
          "zh": "呂太后立諸呂為王，陳平偽聽之。",
          "translations": []
        },
        {
          "id": "s0205",
          "zh": "及呂太后崩，平與太尉勃合謀，卒誅諸呂，立孝文皇帝，陳平本謀也。",
          "translations": []
        },
        {
          "id": "s0206",
          "zh": "審食其免相。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Lü established various Lü as kings, Chen Ping pretended to approve. When Empress Lü collapsed, Ping and Grand Commandant Bo together plotted, ultimately executed various Lü, established Emperor Xiaowen, Chen Ping was the original plotter. Shen Yiji was dismissed from chancellor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0207",
          "zh": "孝文帝立，以為太尉勃親以兵誅呂氏，功多；",
          "translations": []
        },
        {
          "id": "s0208",
          "zh": "陳平欲讓勃尊位，乃謝病。",
          "translations": []
        },
        {
          "id": "s0209",
          "zh": "孝文帝初立，怪平病，問之。",
          "translations": []
        },
        {
          "id": "s0210",
          "zh": "平曰：「高祖時，勃功不如臣平。",
          "translations": []
        },
        {
          "id": "s0211",
          "zh": "及誅諸呂，臣功亦不如勃。",
          "translations": []
        },
        {
          "id": "s0212",
          "zh": "願以右丞相讓勃。」",
          "translations": []
        },
        {
          "id": "s0213",
          "zh": "於是孝文帝乃以絳侯勃為右丞相，位次第一；",
          "translations": []
        },
        {
          "id": "s0214",
          "zh": "平徙為左丞相，位次第二。",
          "translations": []
        },
        {
          "id": "s0215",
          "zh": "賜平金千斤，益封三千戶。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Emperor Xiaowen established, considered that Grand Commandant Bo personally with troops executed the Lü clan, merits many; Chen Ping wished to yield the honored position to Bo, so pleaded illness. Emperor Xiaowen newly established, was surprised Ping was ill, asked him. Ping said: 'In Gaozu's time, Bo's merits were not equal to your servant Ping. When executing various Lü, your servant's merits also not equal to Bo. Wish to yield the right chancellorship to Bo.' Thus Emperor Xiaowen made Marquis Jiang Bo right chancellor, position first; Ping transferred to left chancellor, position second. Granted Ping a thousand jin of gold, increased enfeoffment by three thousand households.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "居頃之，孝文皇帝既益明習國家事，朝而問右丞相勃曰：「天下一歲決獄幾何？」",
          "translations": []
        },
        {
          "id": "s0217",
          "zh": "勃謝曰：「不知。」",
          "translations": []
        },
        {
          "id": "s0218",
          "zh": "問：「天下一歲錢穀出入幾何？」",
          "translations": []
        },
        {
          "id": "s0219",
          "zh": "勃又謝不知，汗出沾背，愧不能對。",
          "translations": []
        },
        {
          "id": "s0220",
          "zh": "於是上亦問左丞相平。",
          "translations": []
        },
        {
          "id": "s0221",
          "zh": "平曰：「有主者。」",
          "translations": []
        },
        {
          "id": "s0222",
          "zh": "上曰：「主者謂誰？」",
          "translations": []
        },
        {
          "id": "s0223",
          "zh": "平曰：「陛下即問決獄，責廷尉；",
          "translations": []
        },
        {
          "id": "s0224",
          "zh": "問錢穀，責治粟內史。」",
          "translations": []
        },
        {
          "id": "s0225",
          "zh": "上曰：「茍各有主者，而君所主者何事也？」",
          "translations": []
        },
        {
          "id": "s0226",
          "zh": "平謝曰：「主臣！",
          "translations": []
        },
        {
          "id": "s0227",
          "zh": "陛下不知其駑下，使待罪宰相。",
          "translations": []
        },
        {
          "id": "s0228",
          "zh": "宰相者，上佐天子理陰陽，順四時，下育萬物之宜，外鎮撫四夷諸侯，內親附百姓，使卿大夫各得任其職焉。」",
          "translations": []
        },
        {
          "id": "s0229",
          "zh": "孝文帝乃稱善。",
          "translations": []
        },
        {
          "id": "s0230",
          "zh": "右丞相大慚，出而讓陳平曰：「君獨不素教我對！」",
          "translations": []
        },
        {
          "id": "s0231",
          "zh": "陳平笑曰：「君居其位，不知其任邪？",
          "translations": []
        },
        {
          "id": "s0232",
          "zh": "且陛下即問長安中盜賊數，君欲彊對邪？」",
          "translations": []
        },
        {
          "id": "s0233",
          "zh": "於是絳侯自知其能不如平遠矣。",
          "translations": []
        },
        {
          "id": "s0234",
          "zh": "居頃之，絳侯謝病請免相，陳平專為一丞相。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "After a short time, Emperor Xiaowen having increasingly become familiar with state affairs, in court asked right chancellor Bo: 'Throughout the realm, how many cases are decided in a year?' Bo apologized saying: 'Do not know.' Asked: 'Throughout the realm, how much money and grain enter and exit in a year?' Bo again apologized did not know, sweat soaked his back, ashamed could not answer. Thus the emperor also asked left chancellor Ping. Ping said: 'There are those who are responsible.' The emperor said: 'Those responsible mean who?' Ping said: 'Your majesty if asks about deciding cases, blame the Chamberlain for Law Enforcement; asks about money and grain, blame the Chamberlain for the Granaries.' The emperor said: 'If each has those responsible, then what affairs does sir oversee?' Ping apologized saying: 'Oversee your servant! Your majesty does not know my incompetence, makes me await punishment as chancellor. The chancellor above assists the Son of Heaven to order yin and yang, follow the four seasons, below nurtures what is suitable for the ten thousand things, externally soothes and controls the four barbarians and feudal lords, internally draws close and attaches the people, makes the ministers and grandees each able to carry out their duties.' Emperor Xiaowen then praised it as good. The right chancellor greatly ashamed, went out and reproached Chen Ping saying: 'Sir alone did not usually teach me to answer!' Chen Ping laughed saying: 'Sir occupies that position, does not know its responsibilities?' Moreover if the emperor asks the number of bandits and thieves in Chang'an, does sir wish to forcibly answer?' Thus Marquis Jiang himself knew his ability was far inferior to Ping's. After a short time, Marquis Jiang pleaded illness and requested to resign chancellor, Chen Ping alone became chancellor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "孝文帝二年，丞相陳平卒，謚為獻侯。",
          "translations": []
        },
        {
          "id": "s0236",
          "zh": "子共侯買代侯。",
          "translations": []
        },
        {
          "id": "s0237",
          "zh": "二年卒，子簡侯恢代侯。",
          "translations": []
        },
        {
          "id": "s0238",
          "zh": "二十三年卒，子何代侯。",
          "translations": []
        },
        {
          "id": "s0239",
          "zh": "二十三年，何坐略人妻，棄市，國除。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Emperor Xiaowen year 2, Chancellor Chen Ping died, posthumous title Marquis Xian. Son Marquis Gong Mai succeeded to the marquisate. Two years died, son Marquis Jian Hui succeeded to the marquisate. Twenty-three years died, son He succeeded to the marquisate. Twenty-three years, He because of abducting someone's wife, executed in market, state abolished.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0240",
          "zh": "始陳平曰：「我多陰謀，是道家之所禁。",
          "translations": []
        },
        {
          "id": "s0241",
          "zh": "吾世即廢，亦已矣，終不能復起，以吾多陰禍也。」",
          "translations": []
        },
        {
          "id": "s0242",
          "zh": "然其後曾孫陳掌以衛氏親貴戚，願得續封陳氏，然終不得。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Originally Chen Ping said: 'I have many secret plots, this is what the Daoists prohibit. My descendants will be abolished, that is all, ultimately cannot rise again, because I have many secret misfortunes.' Yet afterwards his great-grandson Chen Zhang because of Wei clan close relatives being noble relatives, wished to continue enfeoffing the Chen clan, yet ultimately could not.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "太史公曰：陳丞相平少時，本好黃帝、老子之術。",
          "translations": []
        },
        {
          "id": "s0244",
          "zh": "方其割肉俎上之時，其意固已遠矣。",
          "translations": []
        },
        {
          "id": "s0245",
          "zh": "傾側擾攘楚魏之閒，卒歸高帝。",
          "translations": []
        },
        {
          "id": "s0246",
          "zh": "常出奇計，救紛糾之難，振國家之患。",
          "translations": []
        },
        {
          "id": "s0247",
          "zh": "及呂后時，事多故矣，然平竟自脫，定宗廟，以榮名終，稱賢相，豈不善始善終哉！",
          "translations": []
        },
        {
          "id": "s0248",
          "zh": "非知謀孰能當此者乎？",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian says: Chancellor Chen Ping in youth, originally liked the arts of the Yellow Emperor and Laozi. When he was dividing meat on the chopping block, his intentions were already far-reaching. Careering and struggling between Chu and Wei, ultimately returned to Gaozu. Constantly put forth extraordinary strategies, rescued difficulties of entanglements, relieved the state's calamities. When Empress Lü's time, affairs were greatly troubled, yet Ping ultimately freed himself, stabilized the ancestral temple, ended with honored name, called wise chancellor—how good a beginning and good ending! If not knowledgeable strategy, who could match this?",
          "idiomatic": null
        }
      ]
    }
  ]
}