{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "078",
    "url": "https://chinesenotes.com/shiji/shiji078.html",
    "title": {
      "zh": "春申君列傳",
      "en": "Biography of Lord Chunshen",
      "raw": "《春申君列傳》 Biography of Lord Chunshen"
    },
    "sentenceCount": 174,
    "translatedCount": 174,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:03.071Z",
    "translators": [
      {
        "name": "Garrett M. Petersen",
        "paragraphs": 22,
        "sentences": 174
      }
    ],
    "citation": "Translation: Garrett M. Petersen"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "春申君者，楚人也，名歇，姓黃氏。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen was a man of Chu, named Xie, surname Huang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "游學博聞，事楚頃襄王。",
          "translations": [
            {
              "lang": "en",
              "text": "He traveled to study widely and gained broad knowledge, serving King Qingxiang of Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "頃襄王以歇為辯，使於秦。",
          "translations": [
            {
              "lang": "en",
              "text": "King Qingxiang employed Xie for his eloquence and sent him as envoy to Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "秦昭王使白起攻韓、魏，敗之於華陽，禽魏將芒卯，韓、魏服而事秦。",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao of Qin sent Bai Qi to attack Han and Wei, defeating them at Huayang, capturing Wei's general Mang Mao. Han and Wei submitted and served Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "秦昭王方令白起與韓、魏共伐楚，未行，而楚使黃歇適至於秦，聞秦之計。",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao of Qin was about to order Bai Qi to join with Han and Wei to attack Chu, but the plan had not yet been carried out when Chu's envoy Huang Xie arrived in Qin and learned of Qin's plans.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "當是之時，秦已前使白起攻楚，取巫、黔中之郡，拔鄢郢，東至竟陵，楚頃襄王東徙治於陳縣。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time, Qin had previously sent Bai Qi to attack Chu, taking the commanderies of Wu and Qianzhong, capturing Ying and Yiling, advancing east to Jingling. King Qingxiang of Chu moved his capital east to Chen county.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "黃歇見楚懷王之為秦所誘而入朝，遂見欺，留死於秦。",
          "translations": [
            {
              "lang": "en",
              "text": "Huang Xie saw that King Huai of Chu had been lured by Qin into attending court, then deceived and detained until death in Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "頃襄王，其子也，秦輕之，恐壹舉兵而滅楚。",
          "translations": [
            {
              "lang": "en",
              "text": "King Qingxiang was his son. Qin regarded him lightly and feared that in one campaign they could extinguish Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "歇乃上書說秦昭王曰：",
          "translations": [
            {
              "lang": "en",
              "text": "Xie then presented a memorial advising King Zhao of Qin:",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen was a man of Chu, named Xie, surname Huang. He traveled to study widely and gained broad knowledge, serving King Qingxiang of Chu. King Qingxiang employed Xie for his eloquence and sent him as envoy to Qin. King Zhao of Qin sent Bai Qi to attack Han and Wei, defeating them at Huayang, capturing Wei's general Mang Mao. Han and Wei submitted and served Qin. King Zhao of Qin was about to order Bai Qi to join with Han and Wei to attack Chu, but the plan had not yet been carried out when Chu's envoy Huang Xie arrived in Qin and learned of Qin's plans. At this time, Qin had previously sent Bai Qi to attack Chu, taking the commanderies of Wu and Qianzhong, capturing Ying and Yiling, advancing east to Jingling. King Qingxiang of Chu moved his capital east to Chen county. Huang Xie saw that King Huai of Chu had been lured by Qin into attending court, then deceived and detained until death in Qin. King Qingxiang was his son. Qin regarded him lightly and feared that in one campaign they could extinguish Chu. Xie then presented a memorial advising King Zhao of Qin:",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "天下莫彊於秦、楚。",
          "translations": [
            {
              "lang": "en",
              "text": "In all the world, none are stronger than Qin and Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "今聞大王欲伐楚，此猶兩虎相與鬬。",
          "translations": [
            {
              "lang": "en",
              "text": "Now I hear Your Majesty wishes to attack Chu—this is like two tigers fighting each other.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "兩虎相與鬬而駑犬受其獘，不如善楚。",
          "translations": [
            {
              "lang": "en",
              "text": "When two tigers fight each other, the lame dog benefits from their exhaustion. It would be better to befriend Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "臣請言其說：臣聞物至則反，冬夏是也；",
          "translations": [
            {
              "lang": "en",
              "text": "Allow me to explain my reasoning: I have heard that things reach an extreme and then reverse, like winter and summer.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "致至則危，累棋是也。",
          "translations": [
            {
              "lang": "en",
              "text": "When power reaches its peak it becomes dangerous, like piling up chess pieces.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "今大國之地，遍天下有其二垂，此從生民已來，萬乘之地未嘗有也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Majesty's territory covers two-thirds of the world—this has not happened since the beginning of civilization, no kingdom of ten thousand chariots has ever achieved it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "先帝文王、莊王之身，三世不妄接地於齊，以絕從親之要。",
          "translations": [
            {
              "lang": "en",
              "text": "The Former Kings Wen and Zhuang in three generations never rashly engaged in battle with Qi, to avoid cutting off the strategy of alliance through marriage.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "今王使盛橋守事於韓，盛橋以其地入秦，是王不用甲，不信威，而得百里之地。",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Majesty has Sheng Qiao guarding affairs in Han, and Sheng Qiao has brought his territory into Qin. This is Your Majesty gaining a hundred li of land without using armor or showing force.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "王可謂能矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty can truly be called capable.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "王又舉甲而攻魏，杜大梁之門，舉河內，拔燕、酸棗、虛、桃，入邢，魏之兵雲翔而不敢捄。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty again raised troops and attacked Wei, blocked the gates of Daliang, took Henei, captured Yan, Suantao, Xu, Tao, entered Xing. Wei's troops flew like clouds but dared not rescue.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "王之功亦多矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty's achievements are also numerous.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "王休甲息眾，二年而後復之；",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty rested the troops for two years, then resumed campaigning.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "又并蒲、衍、首、垣，以臨仁、平丘，黃、濟陽嬰城而魏氏服；",
          "translations": [
            {
              "lang": "en",
              "text": "Again annexing Pu, Yan, Shou, Yuan, threatening Ren and Pingqiu. Huang and Jiyang were besieged and the House of Wei submitted.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "王又割濮磿之北，注齊秦之要，絕楚趙之脊，天下五合六聚而不敢救。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty again cut off the north of Puyang, blocked Qin's vital routes to Qi, severed the spine connecting Chu and Zhao. The world united five times and gathered six times but dared not rescue.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "王之威亦單矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty's prestige is also unmatched.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In all the world, none are stronger than Qin and Chu. Now I hear Your Majesty wishes to attack Chu—this is like two tigers fighting each other. When two tigers fight each other, the lame dog benefits from their exhaustion. It would be better to befriend Chu. Allow me to explain my reasoning: I have heard that things reach an extreme and then reverse, like winter and summer. When power reaches its peak it becomes dangerous, like piling up chess pieces. Now Your Majesty's territory covers two-thirds of the world—this has not happened since the beginning of civilization, no kingdom of ten thousand chariots has ever achieved it. The Former Kings Wen and Zhuang in three generations never rashly engaged in battle with Qi, to avoid cutting off the strategy of alliance through marriage. Now Your Majesty has Sheng Qiao guarding affairs in Han, and Sheng Qiao has brought his territory into Qin. This is Your Majesty gaining a hundred li of land without using armor or showing force. Your Majesty can truly be called capable. Your Majesty again raised troops and attacked Wei, blocked the gates of Daliang, took Henei, captured Yan, Suantao, Xu, Tao, entered Xing. Wei's troops flew like clouds but dared not rescue. Your Majesty's achievements are also numerous. Your Majesty rested the troops for two years, then resumed campaigning. Again annexing Pu, Yan, Shou, Yuan, threatening Ren and Pingqiu. Huang and Jiyang were besieged and the House of Wei submitted. Your Majesty again cut off the north of Puyang, blocked Qin's vital routes to Qi, severed the spine connecting Chu and Zhao. The world united five times and gathered six times but dared not rescue. Your Majesty's prestige is also unmatched.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0025",
          "zh": "王若能持功守威，絀攻取之心而肥仁義之地，使無後患，三王不足四，五伯不足六也。",
          "translations": [
            {
              "lang": "en",
              "text": "If Your Majesty can maintain these achievements and prestige, set aside thoughts of conquest and expand the territory of benevolence and righteousness, avoiding future disasters, then the Three Kings would not be worth four, the Five Hegemons would not be worth six.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "王若負人徒之眾，仗兵革之彊，乘毀魏之威，而欲以力臣天下之主，臣恐其有後患也。",
          "translations": [
            {
              "lang": "en",
              "text": "If Your Majesty relies on a multitude of common people and the strength of weapons and armor, taking advantage of having broken Wei's power, desiring to force the lords of the world to submit, I fear there will be future disasters.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "《詩》曰「靡不有初，鮮克有終」。",
          "translations": [
            {
              "lang": "en",
              "text": "The Book of Songs says: 'Nothing lacks a beginning, few achieve the end.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "《易》曰「狐涉水，濡其尾」。",
          "translations": [
            {
              "lang": "en",
              "text": "The Book of Changes says: 'The fox fords the water, wets its tail.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "此言始之易，終之難也。",
          "translations": [
            {
              "lang": "en",
              "text": "This speaks of how beginnings are easy but endings are difficult.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "何以知其然也？",
          "translations": [
            {
              "lang": "en",
              "text": "How do I know this is so?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "昔智氏見伐趙之利而不知榆次之禍，吳見伐齊之便而不知干隧之敗。",
          "translations": [
            {
              "lang": "en",
              "text": "In former times, the Zhi clan saw the advantage of attacking Zhao but did not foresee the disaster at Yuxi. Wu saw the convenience of attacking Qi but did not foresee the defeat at Gantui.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "此二國者，非無大功也，沒利於前而易患於後也。",
          "translations": [
            {
              "lang": "en",
              "text": "These two states were not without great achievements, but they were blinded by advantages in front and easily suffered disasters afterward.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "吳之信越也，從而伐齊，既勝齊人於艾陵，還為越王禽三渚之浦。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu trusted Yue and followed them to attack Qi. Having defeated Qi at Ailing, on their return Yue's King Goujian captured them at the ford of Sanchu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "智氏之信韓、魏也，從而伐趙，攻晉陽城，勝有日矣，韓、魏叛之，殺智伯瑤於鑿臺之下。",
          "translations": [
            {
              "lang": "en",
              "text": "The Zhi clan trusted Han and Wei and followed them to attack Zhao, besieging Jinyang city. Victory was near, but Han and Wei rebelled against them, killing Zhi Boyao beneath the Zao Terrace.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "今王妒楚之不毀也，而忘毀楚之彊韓、魏也，臣為王慮而不取也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Majesty envies that Chu has not been destroyed, but forgets that destroying Chu strengthened Han and Wei. I advise Your Majesty to consider this and not proceed.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "If Your Majesty can maintain these achievements and prestige, set aside thoughts of conquest and expand the territory of benevolence and righteousness, avoiding future disasters, then the Three Kings would not be worth four, the Five Hegemons would not be worth six. If Your Majesty relies on a multitude of common people and the strength of weapons and armor, taking advantage of having broken Wei's power, desiring to force the lords of the world to submit, I fear there will be future disasters. The Book of Songs says: 'Nothing lacks a beginning, few achieve the end.' The Book of Changes says: 'The fox fords the water, wets its tail.' This speaks of how beginnings are easy but endings are difficult. How do I know this is so? In former times, the Zhi clan saw the advantage of attacking Zhao but did not foresee the disaster at Yuxi. Wu saw the convenience of attacking Qi but did not foresee the defeat at Gantui. These two states were not without great achievements, but they were blinded by advantages in front and easily suffered disasters afterward. Wu trusted Yue and followed them to attack Qi. Having defeated Qi at Ailing, on their return Yue's King Goujian captured them at the ford of Sanchu. The Zhi clan trusted Han and Wei and followed them to attack Zhao, besieging Jinyang city. Victory was near, but Han and Wei rebelled against them, killing Zhi Boyao beneath the Zao Terrace. Now Your Majesty envies that Chu has not been destroyed, but forgets that destroying Chu strengthened Han and Wei. I advise Your Majesty to consider this and not proceed.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0036",
          "zh": "《詩》曰「大武遠宅而不涉」。",
          "translations": [
            {
              "lang": "en",
              "text": "The Book of Songs says: 'Great martial virtue dwells afar and does not cross.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "從此觀之，楚國，援也；",
          "translations": [
            {
              "lang": "en",
              "text": "From this we can see that Chu is an ally.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "鄰國，敵也。",
          "translations": [
            {
              "lang": "en",
              "text": "Neighboring states are enemies.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "《詩》云「趯趯毚免，還犬獲之。",
          "translations": [
            {
              "lang": "en",
              "text": "The Book of Songs says: 'The rabbits leap about, and the hound catches them.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "他人有心，余忖度之」。",
          "translations": [
            {
              "lang": "en",
              "text": "Others have their schemes, I fathom them.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "今王中道而信韓、魏之善王也，此正吳之信越也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Majesty halfway believes in Han and Wei's loyalty to Your Majesty—this is exactly like Wu trusting Yue.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "臣聞之，敵不可假，時不可失。",
          "translations": [
            {
              "lang": "en",
              "text": "I have heard that enemies should not be lent aid, opportunities should not be lost.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "臣恐韓、魏卑辭除患而實欲欺大國也。",
          "translations": [
            {
              "lang": "en",
              "text": "I fear Han and Wei use humble words to remove their troubles but actually wish to deceive the great kingdom.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "何則？",
          "translations": [
            {
              "lang": "en",
              "text": "Why is this?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "王無重世之德於韓、魏，而有累世之怨焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty has no deep favors toward Han and Wei for generations, but has accumulated resentments for generations.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "夫韓、魏父子兄弟接踵而死於秦者將十世矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Fathers and sons, brothers of Han and Wei who have died at Qin's hands now reach ten generations.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "本國殘，社稷壞，宗廟毀。",
          "translations": [
            {
              "lang": "en",
              "text": "Their home states are ruined, their altars of soil and grain destroyed, ancestral temples demolished.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "刳腹絕腸，折頸摺頤，首身分離，暴骸骨於草澤，頭顱僵仆，相望於境，父子老弱系脰束手為群虜者相及於路。",
          "translations": [
            {
              "lang": "en",
              "text": "Bellies ripped open, intestines severed, necks broken, jaws crushed, heads separated from bodies, corpses exposed in the wilds, skulls stiff and fallen, visible across the borders. Fathers and sons, old and young bound at the neck with hands tied, becoming groups of captives meeting on the roads.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "鬼神孤傷，無所血食。",
          "translations": [
            {
              "lang": "en",
              "text": "Ghosts and spirits grieve in isolation, with no blood sacrifices.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "人民不聊生，族類離散，流亡為仆妾者，盈滿海內矣。",
          "translations": [
            {
              "lang": "en",
              "text": "The people cannot live, clans are scattered, those who have fled and become servants and concubines fill the seas within the four directions.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "故韓、魏之不亡，秦社稷之憂也，今王資之與攻楚，不亦過乎！",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore Han and Wei not being destroyed is Qin's state concern. Now Your Majesty aids them in attacking Chu—is this not a mistake?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Book of Songs says: 'Great martial virtue dwells afar and does not cross.' From this we can see that Chu is an ally. Neighboring states are enemies. The Book of Songs says: 'The rabbits leap about, and the hound catches them. Others have their schemes, I fathom them.' Now Your Majesty halfway believes in Han and Wei's loyalty to Your Majesty—this is exactly like Wu trusting Yue. I have heard that enemies should not be lent aid, opportunities should not be lost. I fear Han and Wei use humble words to remove their troubles but actually wish to deceive the great kingdom. Why is this? Your Majesty has no deep favors toward Han and Wei for generations, but has accumulated resentments for generations. Fathers and sons, brothers of Han and Wei who have died at Qin's hands now reach ten generations. Their home states are ruined, their altars of soil and grain destroyed, ancestral temples demolished. Bellies ripped open, intestines severed, necks broken, jaws crushed, heads separated from bodies, corpses exposed in the wilds, skulls stiff and fallen, visible across the borders. Fathers and sons, old and young bound at the neck with hands tied, becoming groups of captives meeting on the roads. Ghosts and spirits grieve in isolation, with no blood sacrifices. The people cannot live, clans are scattered, those who have fled and become servants and concubines fill the seas within the four directions. Therefore Han and Wei not being destroyed is Qin's state concern. Now Your Majesty aids them in attacking Chu—is this not a mistake?",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "且王攻楚將惡出兵？",
          "translations": [
            {
              "lang": "en",
              "text": "Moreover, when Your Majesty attacks Chu, where will the troops emerge?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "王將借路於仇讎之韓、魏乎？",
          "translations": [
            {
              "lang": "en",
              "text": "Will Your Majesty borrow the road through enemy Han and Wei?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "兵出之日而王憂其不返也，是王以兵資於仇讎之韓、魏也。",
          "translations": [
            {
              "lang": "en",
              "text": "On the day the troops emerge Your Majesty will worry they do not return—this is Your Majesty providing troops to enemy Han and Wei.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "王若不借路於仇讎之韓、魏，必攻隨水右壤。",
          "translations": [
            {
              "lang": "en",
              "text": "If Your Majesty does not borrow the road through enemy Han and Wei, you must attack along the right bank of the Sui River.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "隨水右壤，此皆廣川大水，山林谿谷，不食之地也，王雖有之，不為得地。",
          "translations": [
            {
              "lang": "en",
              "text": "The right bank of the Sui River—all broad rivers and great waters, mountain forests and valleys, land where crops cannot be grown. Even if Your Majesty takes it, it is not gaining territory.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "是王有毀楚之名而無得地之實也。",
          "translations": [
            {
              "lang": "en",
              "text": "This gives Your Majesty the name of destroying Chu but no reality of gaining land.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Moreover, when Your Majesty attacks Chu, where will the troops emerge? Will Your Majesty borrow the road through enemy Han and Wei? On the day the troops emerge Your Majesty will worry they do not return—this is Your Majesty providing troops to enemy Han and Wei. If Your Majesty does not borrow the road through enemy Han and Wei, you must attack along the right bank of the Sui River. The right bank of the Sui River—all broad rivers and great waters, mountain forests and valleys, land where crops cannot be grown. Even if Your Majesty takes it, it is not gaining territory. This gives Your Majesty the name of destroying Chu but no reality of gaining land.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "且王攻楚之日，四國必悉起兵以應王。",
          "translations": [
            {
              "lang": "en",
              "text": "Moreover, on the day Your Majesty attacks Chu, the four states will certainly all raise troops to respond to Your Majesty.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "秦、楚之兵構而不離，魏氏將出而攻留、方與、铚、湖陵、碭、蕭、相，故宋必盡。",
          "translations": [
            {
              "lang": "en",
              "text": "Qin and Chu troops will be locked in combat without separating. Wei will emerge to attack Liu, Fangyu, Zhi, Huling, Dang, Xiao, Xiang—thus exhausting the old territory of Song.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "齊人南面攻楚，泗上必舉。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi will attack Chu southward, taking the Si River region.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "此皆平原四達，膏腴之地，而使獨攻。",
          "translations": [
            {
              "lang": "en",
              "text": "These are all broad plains with four-way access, fertile lands, yet left for Qin to attack alone.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "王破楚以肥韓、魏於中國而勁齊。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty destroys Chu to fatten Han and Wei in the central states and strengthen Qi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "韓、魏之彊，足以校於秦。",
          "translations": [
            {
              "lang": "en",
              "text": "When Han and Wei are strong, they will be able to contend with Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "齊南以泗水為境，東負海，北倚河，而無後患，天下之國莫彊於齊、魏，齊、魏得地葆利而詳事下吏，一年之後，為帝未能，其於禁王之為帝有餘矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi to the south has the Si River as border, east faces the sea, north relies on the Yellow River, without worries from behind. No state in the world is stronger than Qi and Wei. If Qi and Wei gain land and preserve advantages while carefully serving as subordinate officials, within a year, even if they cannot become emperor themselves, they will have more than enough to prevent Your Majesty from becoming emperor.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Moreover, on the day Your Majesty attacks Chu, the four states will certainly all raise troops to respond to Your Majesty. Qin and Chu troops will be locked in combat without separating. Wei will emerge to attack Liu, Fangyu, Zhi, Huling, Dang, Xiao, Xiang—thus exhausting the old territory of Song. Qi will face south to attack Chu, and the area above the Si River will certainly be taken. These are all broad plains with four-way access, fertile lands, yet left for Qin to attack alone. Your Majesty destroys Chu to fatten Han and Wei in the central states and strengthen Qi. When Han and Wei are strong, they will be able to contend with Qin. Qi to the south has the Si River as border, east faces the sea, north relies on the Yellow River, without worries from behind. No state in the world is stronger than Qi and Wei. If Qi and Wei gain land and preserve advantages while carefully serving as subordinate officials, within a year, even if they cannot become emperor themselves, they will have more than enough to prevent Your Majesty from becoming emperor.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0065",
          "zh": "夫以王壤土之博，人徒之眾，兵革之彊，壹舉事而樹怨於楚，遲令韓、魏歸帝重於齊，是王失計也。",
          "translations": [
            {
              "lang": "en",
              "text": "With Your Majesty's vast territory, numerous people, strong weapons and armor, in one campaign creating resentment with Chu, delaying until Han and Wei return the imperial title to Qi—this is Your Majesty losing the plan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "臣為王慮，莫若善楚。",
          "translations": [
            {
              "lang": "en",
              "text": "I advise Your Majesty, nothing is better than befriending Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "秦、楚合而為一以臨韓，韓必斂手。",
          "translations": [
            {
              "lang": "en",
              "text": "If Qin and Chu unite as one to face Han, Han will certainly fold its hands.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "王施以東山之險，帶以曲河之利，韓必為關內之侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty can deploy the danger of Dongshan, gird with the advantage of the Qu River—Han will certainly become an inner pass marquis.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "若是而王以十萬戍鄭，梁氏寒心，許、鄢陵嬰城，而上蔡、召陵不往來也，如此而魏亦關內侯矣。",
          "translations": [
            {
              "lang": "en",
              "text": "In this way Your Majesty stations 100,000 troops in Zheng, the Liang clan will lose heart. Xu and Yanling will be besieged, and Shangcai and Shaoling will have no commerce. In this way Wei also becomes an inner pass marquis.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "王壹善楚，而關內兩萬乘之主注地於齊，齊右壤可拱手而取也。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty befriends Chu, and the two marquisates of ten thousand chariots within the pass will pour their land toward Qi. Qin's right flank can be taken with folded hands.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "王之地一經兩海，要約天下，是燕、趙無齊、楚，齊、楚無燕、趙也。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty's territory will span the two seas, commanding the world's strategic points—this makes Yan and Zhao unable to oppose Qi and Chu, Qi and Chu unable to oppose Yan and Zhao.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "然後危動燕、趙，直搖齊、楚，此四國者不待痛而服矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Then threatening Yan and Zhao, directly shaking Qi and Chu—these four states will submit without being wounded.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "With Your Majesty's vast territory, numerous people, strong weapons and armor, in one campaign creating resentment with Chu, delaying until Han and Wei return the imperial title to Qi—this is Your Majesty losing the plan. I advise Your Majesty, nothing is better than befriending Chu. If Qin and Chu unite as one to face Han, Han will certainly fold its hands. Your Majesty can deploy the danger of Dongshan, gird with the advantage of the Qu River—Han will certainly become an inner pass marquis. In this way Your Majesty stations 100,000 troops in Zheng, the Liang clan will lose heart. Xu and Yanling will be besieged, and Shangcai and Shaoling will have no commerce. In this way Wei also becomes an inner pass marquis. Your Majesty befriends Chu, and the two marquisates of ten thousand chariots within the pass will pour their land toward Qi. Qin's right flank can be taken with folded hands. Your Majesty's territory will span the two seas, commanding the world's strategic points—this makes Yan and Zhao unable to oppose Qi and Chu, Qi and Chu unable to oppose Yan and Zhao. Then threatening Yan and Zhao, directly shaking Qi and Chu—these four states will submit without being wounded.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "昭王曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao said: 'Excellent.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "於是乃止白起而謝韓、魏。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus he stopped Bai Qi and apologized to Han and Wei.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "發使賂楚，約為與國。",
          "translations": [
            {
              "lang": "en",
              "text": "He sent envoys to bribe Chu, making a treaty as allied states.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "King Zhao said: 'Excellent.' Thus he stopped Bai Qi and apologized to Han and Wei. He sent envoys to bribe Chu, making a treaty as allied states.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "黃歇受約歸楚，楚使歇與太子完入質於秦，秦留之數年。",
          "translations": [
            {
              "lang": "en",
              "text": "Huang Xie accepted the treaty and returned to Chu. Chu sent Xie with Crown Prince Wan as hostages in Qin. Qin detained them for several years.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "楚頃襄王病，太子不得歸。",
          "translations": [
            {
              "lang": "en",
              "text": "King Qingxiang of Chu fell ill, the crown prince could not return.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "而楚太子與秦相應侯善，於是黃歇乃說應侯曰：「相國誠善楚太子乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "The Chu crown prince was on good terms with Qin's prime minister Lord Ying. Thus Huang Xie advised Lord Ying: 'Prime Minister, do you truly befriend the Chu crown prince?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "應侯曰：「然。」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Ying said: 'Yes.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "歇曰：「今楚王恐不起疾，秦不如歸其太子。",
          "translations": [
            {
              "lang": "en",
              "text": "Xie said: 'Now the King of Chu fears he will not recover from illness. Qin should return the crown prince.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "太子得立，其事秦必重而德相國無窮，是親與國而得儲萬乘也。",
          "translations": [
            {
              "lang": "en",
              "text": "If the crown prince ascends the throne, he will certainly value Qin greatly and show infinite gratitude to the prime minister. This is gaining an ally and securing ten thousand chariots.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "若不歸，則咸陽一布衣耳；",
          "translations": [
            {
              "lang": "en",
              "text": "If not returned, he will be just a commoner in Xianyang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "楚更立太子，必不事秦。",
          "translations": [
            {
              "lang": "en",
              "text": "Chu will establish another crown prince who will certainly not serve Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "夫失與國而絕萬乘之和，非計也。",
          "translations": [
            {
              "lang": "en",
              "text": "Losing an allied state and breaking harmony with ten thousand chariots is not wise.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "願相國孰慮之。」",
          "translations": [
            {
              "lang": "en",
              "text": "I hope the prime minister will consider this carefully.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "應侯以聞秦王。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Ying reported this to the King of Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "秦王曰：「令楚太子之傅先往問楚王之疾，返而後圖之。」",
          "translations": [
            {
              "lang": "en",
              "text": "The King of Qin said: 'Have the Chu crown prince's tutor first go ask about the King of Chu's illness, then we can plan afterward.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "黃歇為楚太子計曰：「秦之留太子也，欲以求利也。",
          "translations": [
            {
              "lang": "en",
              "text": "Huang Xie planned for the Chu crown prince: 'Qin's detention of the crown prince is to seek advantage.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "今太子力未能有以利秦也，歇憂之甚。",
          "translations": [
            {
              "lang": "en",
              "text": "Now the crown prince has no strength to benefit Qin. I worry about this greatly.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "而陽文君子二人在中，王若卒大命，太子不在，陽文君子必立為後，太子不得奉宗廟矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Yang Wenjun and Zi Chun are in the court. If the king meets his great fate and the crown prince is not present, Yang Wenjun and Zi Chun will certainly be established as heirs. The crown prince will not be able to serve the ancestral temples.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "不如亡秦，與使者俱出；",
          "translations": [
            {
              "lang": "en",
              "text": "It would be better to flee Qin, going out with the envoys.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "臣請止，以死當之。」",
          "translations": [
            {
              "lang": "en",
              "text": "I will stay behind and face death for it.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "楚太子因變衣服為楚使者御以出關，而黃歇守舍，常為謝病。",
          "translations": [
            {
              "lang": "en",
              "text": "The Chu crown prince changed clothes to resemble a Chu envoy's driver and escaped through the pass. Huang Xie guarded the residence, constantly feigning illness.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "度太子已遠，秦不能追，歇乃自言秦昭王曰：「楚太子已歸，出遠矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When he calculated the crown prince was far away and Qin could not pursue, Xie then spoke to King Zhao of Qin: 'The Chu crown prince has returned, he is far away now.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "歇當死，願賜死。」",
          "translations": [
            {
              "lang": "en",
              "text": "I deserve death. I beg to be granted death.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "昭王大怒，欲聽其自殺也。",
          "translations": [
            {
              "lang": "en",
              "text": "King Zhao was greatly angered and wished to allow him to commit suicide.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "應侯曰：「歇為人臣，出身以徇其主，太子立，必用歇，故不如無罪而歸之，以親楚。」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Ying said: 'Xie acts as a minister, risking his life to follow his lord. If the crown prince ascends, he will certainly employ Xie. It would be better to release him without guilt to befriend Chu.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "秦因遣黃歇。",
          "translations": [
            {
              "lang": "en",
              "text": "Qin thus sent Huang Xie away.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Huang Xie accepted the treaty and returned to Chu. Chu sent Xie with Crown Prince Wan as hostages in Qin. Qin detained them for several years. King Qingxiang of Chu fell ill, the crown prince could not return. The Chu crown prince was on good terms with Qin's prime minister Lord Ying. Thus Huang Xie advised Lord Ying: 'Prime Minister, do you truly befriend the Chu crown prince?' Lord Ying said: 'Yes.' Xie said: 'Now the King of Chu fears he will not recover from illness. Qin should return the crown prince. If the crown prince ascends the throne, he will certainly value Qin greatly and show infinite gratitude to the prime minister. This is gaining an ally and securing ten thousand chariots. If not returned, he will be just a commoner in Xianyang. Chu will establish another crown prince who will certainly not serve Qin. Losing an allied state and breaking harmony with ten thousand chariots is not wise. I hope the prime minister will consider this carefully.' Lord Ying reported this to the King of Qin. The King of Qin said: 'Have the Chu crown prince's tutor first go ask about the King of Chu's illness, then we can plan afterward.' Huang Xie planned for the Chu crown prince: 'Qin's detention of the crown prince is to seek advantage. Now the crown prince has no strength to benefit Qin. I worry about this greatly. Yang Wenjun and Zi Chun are in the court. If the king meets his great fate and the crown prince is not present, Yang Wenjun and Zi Chun will certainly be established as heirs. The crown prince will not be able to serve the ancestral temples. It would be better to flee Qin, going out with the envoys. I will stay behind and face death for it.' The Chu crown prince changed clothes to resemble a Chu envoy's driver and escaped through the pass. Huang Xie guarded the residence, constantly feigning illness. When he calculated the crown prince was far away and Qin could not pursue, Xie then spoke to King Zhao of Qin: 'The Chu crown prince has returned, he is far away now. I deserve death. I beg to be granted death.' King Zhao was greatly angered and wished to allow him to commit suicide. Lord Ying said: 'Xie acts as a minister, risking his life to follow his lord. If the crown prince ascends, he will certainly employ Xie. It would be better to release him without guilt to befriend Chu.' Qin thus sent Huang Xie away.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "歇至楚三月，楚頃襄王卒，太子完立，是為考烈王。",
          "translations": [
            {
              "lang": "en",
              "text": "Xie reached Chu after three months. King Qingxiang of Chu died, Crown Prince Wan ascended, becoming King Kaolie.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "考烈王元年，以黃歇為相，封為春申君，賜淮北地十二縣。",
          "translations": [
            {
              "lang": "en",
              "text": "In the first year of King Kaolie, he appointed Huang Xie as prime minister, enfeoffed him as Lord Chunshen, granting him twelve counties in the northern Huai region.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "後十五歲，黃歇言之楚王曰：「淮北地邊齊，其事急，請以為郡便。」",
          "translations": [
            {
              "lang": "en",
              "text": "Fifteen years later, Huang Xie spoke to the King of Chu: 'The northern Huai region borders Qi, affairs there are urgent. Please make it a commandery for convenience.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "因并獻淮北十二縣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus he annexed and offered the twelve counties of northern Huai.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "請封於江東。",
          "translations": [
            {
              "lang": "en",
              "text": "He requested enfeoffment in the Jiangdong region.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "考烈王許之。",
          "translations": [
            {
              "lang": "en",
              "text": "King Kaolie granted it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "春申君因城故吳墟，以自為都邑。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen built a city on the old ruins of Wu, making it his own capital city.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Xie reached Chu after three months. King Qingxiang of Chu died, Crown Prince Wan ascended, becoming King Kaolie. In the first year of King Kaolie, he appointed Huang Xie as prime minister, enfeoffed him as Lord Chunshen, granting him twelve counties in the northern Huai region. Fifteen years later, Huang Xie spoke to the King of Chu: 'The northern Huai region borders Qi, affairs there are urgent. Please make it a commandery for convenience.' Thus he annexed and offered the twelve counties of northern Huai. He requested enfeoffment in the Jiangdong region. King Kaolie granted it. Lord Chunshen built a city on the old ruins of Wu, making it his own capital city.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "春申君既相楚，是時齊有孟嘗君，趙有平原君，魏有信陵君，方爭下士，招致賓客，以相傾奪，輔國持權。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen became prime minister of Chu. At this time Qi had Lord Mengchang, Zhao had Lord Pingyuan, Wei had Lord Xinling, all competing to humble themselves before scholars, recruiting retainers to rival and undermine each other, assisting their states and wielding power.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen became prime minister of Chu. At this time Qi had Lord Mengchang, Zhao had Lord Pingyuan, Wei had Lord Xinling, all competing to humble themselves before scholars, recruiting retainers to rival and undermine each other, assisting their states and wielding power.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "春申君為楚相四年，秦破趙之長平軍四十餘萬。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen served as Chu's prime minister for four years when Qin broke Zhao's Changping army of over 400,000.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "五年，圍邯鄲。",
          "translations": [
            {
              "lang": "en",
              "text": "In the fifth year, they besieged Handan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "邯鄲告急於楚，楚使春申君將兵往救之，秦兵亦去，春申君歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Handan urgently appealed to Chu. Chu sent Lord Chunshen leading troops to rescue them. The Qin troops also withdrew. Lord Chunshen returned.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "春申君相楚八年，為楚北伐滅魯，以荀卿為蘭陵令。",
          "translations": [
            {
              "lang": "en",
              "text": "A retainer from Guanjin named Zhu Ying told Lord Chunshen: 'People all consider Chu strong and Your Lordship makes it weak, but in Zhu Ying's view it is not so.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "當是時，楚復彊。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time, Chu grew strong again.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen served as Chu's prime minister for four years when Qin broke Zhao's Changping army of over 400,000. In the fifth year, they besieged Handan. Handan urgently appealed to Chu. Chu sent Lord Chunshen leading troops to rescue them. The Qin troops also withdrew. Lord Chunshen returned. A retainer from Guanjin named Zhu Ying told Lord Chunshen: 'People all consider Chu strong and Your Lordship makes it weak, but in Zhu Ying's view it is not so. At this time, Chu grew strong again.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0112",
          "zh": "趙平原君使人於春申君，春申君捨之於上舍。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Pingyuan of Zhao sent someone to Lord Chunshen. Lord Chunshen housed him in the upper guest quarters.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "趙使欲夸楚，為瑁簪，刀劍室以珠玉飾之，請命春申君客。",
          "translations": [
            {
              "lang": "en",
              "text": "The Zhao envoy wished to impress Chu, making a cap of green jade, decorating sword hilts and scabbards with pearls and jade, requesting to present them to Lord Chunshen's retainers.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "春申君客三千餘人，其上客皆躡珠履以見趙使，趙使大慚。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen had over three thousand retainers. His upper retainers all wore pearl-embroidered shoes to meet the Zhao envoy. The Zhao envoy was greatly ashamed.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Pingyuan of Zhao sent someone to Lord Chunshen. Lord Chunshen housed him in the upper guest quarters. The Zhao envoy wished to impress Chu, making a cap of green jade, decorating sword hilts and scabbards with pearls and jade, requesting to present them to Lord Chunshen's retainers. Lord Chunshen had over three thousand retainers. His upper retainers all wore pearl-embroidered shoes to meet the Zhao envoy. The Zhao envoy was greatly ashamed.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "春申君相十四年，秦莊襄王立，以呂不韋為相，封為文信侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen served as prime minister for fourteen years when Qin established King Zhuangxiang, appointing Lü Buwei as prime minister, enfeoffing him as Lord Wenxin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "取東周。",
          "translations": [
            {
              "lang": "en",
              "text": "They took Eastern Zhou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen served as prime minister for fourteen years when Qin established King Zhuangxiang, appointing Lü Buwei as prime minister, enfeoffing him as Lord Wenxin. They took Eastern Zhou.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0117",
          "zh": "春申君相二十二年，諸侯患秦攻伐無已時，乃相與合從，西伐秦，而楚王為從長，春申君用事。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen served as prime minister for twenty-two years. The feudal lords, troubled by Qin's endless attacks, united in alliance to attack Qin westward. The King of Chu served as alliance leader, with Lord Chunshen managing affairs.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "至函谷關，秦出兵攻，諸侯兵皆敗走。",
          "translations": [
            {
              "lang": "en",
              "text": "They reached Hangu Pass. Qin sent troops to attack. The allied troops all fled in defeat.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "楚考烈王以咎春申君，春申君以此益疏。",
          "translations": [
            {
              "lang": "en",
              "text": "King Kaolie of Chu blamed Lord Chunshen. Lord Chunshen thus became increasingly distant.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen served as prime minister for twenty-two years. The feudal lords, troubled by Qin's endless attacks, united in alliance to attack Qin westward. The King of Chu served as alliance leader, with Lord Chunshen managing affairs. They reached Hangu Pass. Qin sent troops to attack. The allied troops all fled in defeat. King Kaolie of Chu blamed Lord Chunshen. Lord Chunshen thus became increasingly distant.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0120",
          "zh": "客有觀津人朱英，謂春申君曰：「人皆以楚為彊而君用之弱，其於英不然。",
          "translations": [
            {
              "lang": "en",
              "text": "A retainer from Guanjin named Zhu Ying told Lord Chunshen: 'People all consider Chu strong and Your Lordship makes it weak, but in Zhu Ying's view it is not so.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "先君時善秦二十年而不攻楚，何也？",
          "translations": [
            {
              "lang": "en",
              "text": "In the previous king's time, being friendly with Qin for twenty years without attacking Chu—why?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "秦踰黽隘之塞而攻楚，不便；",
          "translations": [
            {
              "lang": "en",
              "text": "Qin crossing the Meng Pass to attack Chu is inconvenient.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "假道於兩周，背韓、魏而攻楚，不可。",
          "translations": [
            {
              "lang": "en",
              "text": "Borrowing the road through the two Zhous, turning their back on Han and Wei to attack Chu, is impossible.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "今則不然，魏旦暮亡，不能愛許、鄢陵，其許魏割以與秦。",
          "translations": [
            {
              "lang": "en",
              "text": "Now it is different. Wei will perish any day, cannot cherish Xu and Yanling. They will allow Wei to cede them to Qin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "秦兵去陳百六十里，臣之所觀者，見秦、楚之日斗也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Qin troops are only 160 li from Chen. What I observe is that Qin and Chu will battle daily.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "楚於是去陳徙壽春；",
          "translations": [
            {
              "lang": "en",
              "text": "Chu thus abandoned Chen and moved to Shouchun.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "而秦徙衛野王，作置東郡。",
          "translations": [
            {
              "lang": "en",
              "text": "Qin moved Wei's capital to Yewang, establishing Dongjun commandery.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "春申君由此就封於吳，行相事。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen thus went to his enfeoffment in Wu, continuing to manage prime ministerial affairs.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In the previous king's time, being friendly with Qin for twenty years without attacking Chu—why? Qin crossing the Meng Pass to attack Chu is inconvenient. Borrowing the road through the two Zhous, turning their back on Han and Wei to attack Chu, is impossible. Now it is different. Wei will perish any day, cannot cherish Xu and Yanling. They will allow Wei to cede them to Qin. Qin troops are only 160 li from Chen. What I observe is that Qin and Chu will battle daily.' Chu thus abandoned Chen and moved to Shouchun. Qin moved Wei's capital to Yewang, establishing Dongjun commandery. Lord Chunshen thus went to his enfeoffment in Wu, continuing to manage prime ministerial affairs.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "楚考烈王無子，春申君患之，求婦人宜子者進之，甚眾，卒無子。",
          "translations": [
            {
              "lang": "en",
              "text": "King Kaolie of Chu had no sons. Lord Chunshen worried about this and sought women suitable for bearing children to present to him—very many, but ultimately no sons.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "趙人李園持其女弟，欲進之楚王，聞其不宜子，恐久毋寵。",
          "translations": [
            {
              "lang": "en",
              "text": "A man from Zhao named Li Yuan brought his younger sister, wishing to present her to the King of Chu. Hearing she was not suitable for bearing children, he feared she would not gain favor for long.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "李園求事春申君為舍人，已而謁歸，故失期。",
          "translations": [
            {
              "lang": "en",
              "text": "Li Yuan sought service with Lord Chunshen as a retainer. After a while he requested leave to return home, deliberately missing his deadline.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "還謁，春申君問之狀，對曰：「齊王使使求臣之女弟，與其使者飲，故失期。」",
          "translations": [
            {
              "lang": "en",
              "text": "When he returned to audience, Lord Chunshen asked about the situation. He replied: 'The King of Qi sent an envoy to seek my younger sister. I drank with the envoy, thus missed the deadline.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "春申君曰：「娉入乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'Have you betrothed her?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "對曰：「未也。」",
          "translations": [
            {
              "lang": "en",
              "text": "He replied: 'Not yet.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "春申君曰：「可得見乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'Can I see her?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "text": "'Yes.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "於是李園乃進其女弟，即幸於春申君。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus Li Yuan presented his younger sister, who was favored by Lord Chunshen.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "知其有身，李園乃與其女弟謀。",
          "translations": [
            {
              "lang": "en",
              "text": "Knowing she was pregnant, Li Yuan plotted with his younger sister.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "園女弟承閒以說春申君曰：「楚王之貴幸君，雖兄弟不如也。",
          "translations": [
            {
              "lang": "en",
              "text": "Li Yuan's younger sister took advantage of an intimate moment to advise Lord Chunshen: 'The King of Chu values and favors Your Lordship more than brothers.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "今君相楚二十餘年，而王無子，即百歲後將更立兄弟，則楚更立君後，亦各貴其故所親，君又安得長有寵乎？",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Lordship has been prime minister of Chu for over twenty years, yet the king has no sons. After a hundred years he will establish brothers, then when Chu establishes new rulers, each will value their old associates. How can Your Lordship remain favored forever?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "非徒然也，君貴用事久，多失禮於王兄弟，兄弟誠立，禍且及身，何以保相印江東之封乎？",
          "translations": [
            {
              "lang": "en",
              "text": "It is not just empty talk. Your Lordship has been noble and in power for long, has offended the king's brothers many times. If brothers truly ascend, disaster will reach Your Lordship. How can you preserve the prime minister's seal and Jiangdong enfeoffment?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "今妾自知有身矣，而人莫知。",
          "translations": [
            {
              "lang": "en",
              "text": "Now I know I am pregnant, yet no one knows.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "妾幸君未久，誠以君之重而進妾於楚王，王必幸妾；",
          "translations": [
            {
              "lang": "en",
              "text": "I have been favored by Your Lordship not long. If you truly use Your Lordship's influence to present me to the King of Chu, the king will certainly favor me.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "妾賴天有子男，則是君之子為王也，楚國盡可得，孰與身臨不測之罪乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "If heaven grants me a son, then Your Lordship's son becomes king. The whole Chu state can be obtained—who compares to facing uncertain crimes?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "春申君大然之，乃出李園女弟，謹舍而言之楚王。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen greatly agreed. He sent Li Yuan's younger sister out, carefully housed her and spoke of her to the King of Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "楚王召入幸之，遂生子男，立為太子，以李園女弟為王后。",
          "translations": [
            {
              "lang": "en",
              "text": "The King of Chu summoned her and favored her. She bore a son, established as crown prince, making Li Yuan's younger sister queen.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "楚王貴李園，園用事。",
          "translations": [
            {
              "lang": "en",
              "text": "The King of Chu valued Li Yuan, who wielded power.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "King Kaolie of Chu had no sons. Lord Chunshen worried about this and sought women suitable for bearing children to present to him—very many, but ultimately no sons. A man from Zhao named Li Yuan brought his younger sister, wishing to present her to the King of Chu. Hearing she was not suitable for bearing children, he feared she would not gain favor for long. Li Yuan sought service with Lord Chunshen as a retainer. After a while he requested leave to return home, deliberately missing his deadline. When he returned to audience, Lord Chunshen asked about the situation. He replied: 'The King of Qi sent an envoy to seek my younger sister. I drank with the envoy, thus missed the deadline.' Lord Chunshen said: 'Have you betrothed her?' He replied: 'Not yet.' Lord Chunshen said: 'Can I see her?' 'Yes.' Thus Li Yuan presented his younger sister, who was favored by Lord Chunshen. Knowing she was pregnant, Li Yuan plotted with his younger sister. Li Yuan's younger sister took advantage of an intimate moment to advise Lord Chunshen: 'The King of Chu values and favors Your Lordship more than brothers. Now Your Lordship has been prime minister of Chu for over twenty years, yet the king has no sons. After a hundred years he will establish brothers, then when Chu establishes new rulers, each will value their old associates. How can Your Lordship remain favored forever? It is not just empty talk. Your Lordship has been noble and in power for long, has offended the king's brothers many times. If brothers truly ascend, disaster will reach Your Lordship. How can you preserve the prime minister's seal and Jiangdong enfeoffment? Now I know I am pregnant, yet no one knows. I have been favored by Your Lordship not long. If you truly use Your Lordship's influence to present me to the King of Chu, the king will certainly favor me. If heaven grants me a son, then Your Lordship's son becomes king. The whole Chu state can be obtained—who compares to facing uncertain crimes?' Lord Chunshen greatly agreed. He sent Li Yuan's younger sister out, carefully housed her and spoke of her to the King of Chu. The King of Chu summoned her and favored her. She bore a son, established as crown prince, making Li Yuan's younger sister queen. The King of Chu valued Li Yuan, who wielded power.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "李園既入其女弟，立為王后，子為太子，恐春申君語泄而益驕，陰養死士，欲殺春申君以滅口，而國人頗有知之者。",
          "translations": [
            {
              "lang": "en",
              "text": "Li Yuan having brought his younger sister in, established as queen and her son as crown prince, feared Lord Chunshen would leak the secret and become even more arrogant. He secretly raised assassins, wishing to kill Lord Chunshen to silence him. Many in the state knew of this.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Li Yuan having brought his younger sister in, established as queen and her son as crown prince, feared Lord Chunshen would leak the secret and become even more arrogant. He secretly raised assassins, wishing to kill Lord Chunshen to silence him. Many in the state knew of this.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "春申君相二十五年，楚考烈王病。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen served as prime minister for twenty-five years. King Kaolie of Chu fell ill.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "朱英謂春申君曰：「世有毋望之福，又有毋望之禍。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhu Ying told Lord Chunshen: 'The world has blessings that come without expectation, and disasters that come without expectation.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "今君處毋望之世，事毋望之主，安可以無毋望之人乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Lordship lives in a time without expectations, serving a lord without expectations. How can you lack a person without expectations?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "春申君曰：「何謂毋望之福？」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'What are blessings without expectation?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "曰：「君相楚二十餘年矣，雖名相國，實楚王也。",
          "translations": [
            {
              "lang": "en",
              "text": "'Your Lordship has been prime minister of Chu for over twenty years. Though nominally prime minister, you are truly the king of Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "今楚王病，旦暮且卒，而君相少主，因而代立當國，如伊尹、周公，王長而反政，不即遂南面稱孤而有楚國？",
          "translations": [
            {
              "lang": "en",
              "text": "Now the King of Chu is ill, will die any day. Your Lordship assists the young ruler and takes over the state, ascending the throne like Yi Yin and the Duke of Zhou. When the king matures you return power. If not, you face south and proclaim yourself ruler, possessing Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "此所謂毋望之福也。」",
          "translations": [
            {
              "lang": "en",
              "text": "This is called blessing without expectation.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "春申君曰：「何謂毋望之禍？」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'What is disaster without expectation?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "曰：「李園不治國而君之仇也，不為兵而養死士之日久矣，楚王卒，李園必先入據權而殺君以滅口。",
          "translations": [
            {
              "lang": "en",
              "text": "'Li Yuan does not govern the state but is Your Lordship's enemy. Not raising troops but nurturing assassins for a long time. When the King of Chu dies, Li Yuan will certainly enter first, seize power and kill Your Lordship to silence him.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "此所謂毋望之禍也。」",
          "translations": [
            {
              "lang": "en",
              "text": "This is called disaster without expectation.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "春申君曰：「何謂毋望之人？」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'What is a person without expectation?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "對曰：「君置臣郎中，楚王卒，李園必先入，臣為君殺李園。",
          "translations": [
            {
              "lang": "en",
              "text": "He replied: 'Appoint me as your attendant. When the King of Chu dies, Li Yuan will certainly enter first. I will kill Li Yuan for Your Lordship.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "此所謂毋望之人也。」",
          "translations": [
            {
              "lang": "en",
              "text": "This is called a person without expectation.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "春申君曰：「足下置之，李園，弱人也，仆又善之，且又何至此！」",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen said: 'I will place you there. Li Yuan is a weak man. I also treat him well. How could it come to this!'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "朱英知言不用，恐禍及身，乃亡去。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhu Ying knew his words would not be used and feared disaster would reach him, so he fled.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lord Chunshen served as prime minister for twenty-five years. King Kaolie of Chu fell ill. Zhu Ying told Lord Chunshen: 'The world has blessings that come without expectation, and disasters that come without expectation. Now Your Lordship lives in a time without expectations, serving a lord without expectations. How can you lack a person without expectations?' Lord Chunshen said: 'What are blessings without expectation?' 'Your Lordship has been prime minister of Chu for over twenty years. Though nominally prime minister, you are truly the king of Chu. Now the King of Chu is ill, will die any day. Your Lordship assists the young ruler and takes over the state, ascending the throne like Yi Yin and the Duke of Zhou. When the king matures you return power. If not, you face south and proclaim yourself ruler, possessing Chu. This is called blessing without expectation.' Lord Chunshen said: 'What is disaster without expectation?' 'Li Yuan does not govern the state but is Your Lordship's enemy. Not raising troops but nurturing assassins for a long time. When the King of Chu dies, Li Yuan will certainly enter first, seize power and kill Your Lordship to silence him. This is called disaster without expectation.' Lord Chunshen said: 'What is a person without expectation?' He replied: 'Appoint me as your attendant. When the King of Chu dies, Li Yuan will certainly enter first. I will kill Li Yuan for Your Lordship. This is called a person without expectation.' Lord Chunshen said: 'I will place you there. Li Yuan is a weak man. I also treat him well. How could it come to this!' Zhu Ying knew his words would not be used and feared disaster would reach him, so he fled.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0164",
          "zh": "後十七日，楚考烈王卒，李園果先入，伏死士於棘門之內。",
          "translations": [
            {
              "lang": "en",
              "text": "Seventeen days later, King Kaolie of Chu died. Li Yuan indeed entered first, hiding assassins within the Thorn Gate.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "春申君入棘門，園死士俠刺春申君，斬其頭，投之棘門外。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord Chunshen entered the Thorn Gate. Li Yuan's assassins attacked from both sides, beheading Lord Chunshen and throwing his head outside the Thorn Gate.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "於是遂使吏盡滅春申君之家。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus they ordered officials to completely exterminate Lord Chunshen's family.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "而李園女弟初幸春申君有身而入之王所生子者遂立，是為楚幽王。",
          "translations": [
            {
              "lang": "en",
              "text": "Li Yuan's younger sister, who had been pregnant by Lord Chunshen when presented to the king, gave birth to the son who was established, becoming King You of Chu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Seventeen days later, King Kaolie of Chu died. Li Yuan indeed entered first, hiding assassins within the Thorn Gate. Lord Chunshen entered the Thorn Gate. Li Yuan's assassins attacked from both sides, beheading Lord Chunshen and throwing his head outside the Thorn Gate. Thus they ordered officials to completely exterminate Lord Chunshen's family. Li Yuan's younger sister, who had been pregnant by Lord Chunshen when presented to the king, gave birth to the son who was established, becoming King You of Chu.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0168",
          "zh": "是歲也，秦始皇帝立九年矣。",
          "translations": [
            {
              "lang": "en",
              "text": "This year, Qin Shihuang had been established for nine years.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "嫪毐亦為亂於秦，覺，夷其三族，而呂不韋廢。",
          "translations": [
            {
              "lang": "en",
              "text": "Liao Ai also caused disorder in Qin, was discovered, his three clans exterminated, and Lü Buwei dismissed.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "This year, Qin Shihuang had been established for nine years. Liao Ai also caused disorder in Qin, was discovered, his three clans exterminated, and Lü Buwei dismissed.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0170",
          "zh": "太史公曰：吾適楚，觀春申君故城，宮室盛矣哉！",
          "translations": [
            {
              "lang": "en",
              "text": "The Grand Historian says: I traveled to Chu and viewed Lord Chunshen's old city—how magnificent its palaces!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "初，春申君之說秦昭王，及出身遣楚太子歸，何其智之明也！",
          "translations": [
            {
              "lang": "en",
              "text": "At first, Lord Chunshen's persuasion of King Zhao of Qin, and risking his life to send the Chu crown prince home—how clear his wisdom!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "後制於李園，旄矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Later he was manipulated by Li Yuan—how confused!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "語曰：「當斷不斷，反受其亂。」",
          "translations": [
            {
              "lang": "en",
              "text": "The saying goes: 'When you should cut, don't cut, and you suffer chaos in return.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "春申君失朱英之謂邪？",
          "translations": [
            {
              "lang": "en",
              "text": "Does this refer to Lord Chunshen missing Zhu Ying's advice?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Grand Historian says: I traveled to Chu and viewed Lord Chunshen's old city—how magnificent its palaces! At first, Lord Chunshen's persuasion of King Zhao of Qin, and risking his life to send the Chu crown prince home—how clear his wisdom! Later he was manipulated by Li Yuan—how confused! The saying goes: 'When you should cut, don't cut, and you suffer chaos in return.' Does this refer to Lord Chunshen missing Zhu Ying's advice?",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}