{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "080",
    "url": "https://chinesenotes.com/shiji/shiji080.html",
    "title": {
      "zh": "樂毅列傳",
      "en": "Biography of Yue Yi",
      "raw": "《樂毅列傳》 Biography of Yue Yi"
    },
    "sentenceCount": 121,
    "translatedCount": 0,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:05.682Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "樂毅者，其先祖曰樂羊。",
          "translations": []
        },
        {
          "id": "s0002",
          "zh": "樂羊為魏文侯將，伐取中山，魏文侯封樂羊以靈壽。",
          "translations": []
        },
        {
          "id": "s0003",
          "zh": "樂羊死，葬於靈壽，其後子孫因家焉。",
          "translations": []
        },
        {
          "id": "s0004",
          "zh": "中山復國，至趙武靈王時復滅中山，而樂氏後有樂毅。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yue Yi's ancestor was named Yue Yang. Yue Yang served as general for Wei Marquis Wen, attacking and taking Zhongshan. Wei Marquis Wen enfeoffed Yue Yang with Lingshou. Yue Yang died and was buried in Lingshou. His descendants settled there. Zhongshan was restored as a state, then during Zhao King Wuling's time Zhongshan was destroyed again. The Yue clan later produced Yue Yi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0005",
          "zh": "樂毅賢，好兵，趙人舉之。",
          "translations": []
        },
        {
          "id": "s0006",
          "zh": "及武靈王有沙丘之亂，乃去趙適魏。",
          "translations": []
        },
        {
          "id": "s0007",
          "zh": "聞燕昭王以子之之亂而齊大敗燕，燕昭王怨齊，未嘗一日而忘報齊也。",
          "translations": []
        },
        {
          "id": "s0008",
          "zh": "燕國小，辟遠，力不能制，於是屈身下士，先禮郭隗以招賢者。",
          "translations": []
        },
        {
          "id": "s0009",
          "zh": "樂毅於是為魏昭王使於燕，燕王以客禮待之。",
          "translations": []
        },
        {
          "id": "s0010",
          "zh": "樂毅辭讓，遂委質為臣，燕昭王以為亞卿，久之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yue Yi was worthy and fond of military affairs. Zhao recommended him. When King Wuling had the Shagiu uprising, Yue Yi left Zhao and went to Wei. He heard that Yan King Zhao, because of the defeat at Zishi where Qi greatly defeated Yan, harbored resentment toward Qi and never forgot revenge against Qi for a single day. Yan was small and remote, lacking the strength to contend. Thus the king humbled himself and treated scholars with respect, first honoring Guo Wei to attract the worthy. Yue Yi then served as Wei King Zhao's envoy to Yan. The Yan king treated him with guest courtesy. Yue Yi declined modestly, then pledged loyalty as a minister. Yan King Zhao appointed him second minister. This continued for some time.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "當是時，齊湣王彊，南敗楚相唐眛於重丘，西摧三晉於觀津，遂與三晉擊秦，助趙滅中山，破宋，廣地千餘里。",
          "translations": []
        },
        {
          "id": "s0012",
          "zh": "與秦昭王爭重為帝，已而復歸之。",
          "translations": []
        },
        {
          "id": "s0013",
          "zh": "諸侯皆欲背秦而服於齊。",
          "translations": []
        },
        {
          "id": "s0014",
          "zh": "湣王自矜，百姓弗堪。",
          "translations": []
        },
        {
          "id": "s0015",
          "zh": "於是燕昭王問伐齊之事。",
          "translations": []
        },
        {
          "id": "s0016",
          "zh": "樂毅對曰：「齊，霸國之餘業也，地大人眾，未易獨攻也。",
          "translations": []
        },
        {
          "id": "s0017",
          "zh": "王必欲伐之，莫如與趙及楚、魏。」",
          "translations": []
        },
        {
          "id": "s0018",
          "zh": "於是使樂毅約趙惠文王，別使連楚、魏，令趙嚪說秦以伐齊之利。",
          "translations": []
        },
        {
          "id": "s0019",
          "zh": "諸侯害齊湣王之驕暴，皆爭合從與燕伐齊。",
          "translations": []
        },
        {
          "id": "s0020",
          "zh": "樂毅還報，燕昭王悉起兵，使樂毅為上將軍，趙惠文王以相國印授樂毅。",
          "translations": []
        },
        {
          "id": "s0021",
          "zh": "樂毅於是并護趙、楚、韓、魏、燕之兵以伐齊，破之濟西。",
          "translations": []
        },
        {
          "id": "s0022",
          "zh": "諸侯兵罷歸，而燕軍樂毅獨追，至于臨菑。",
          "translations": []
        },
        {
          "id": "s0023",
          "zh": "齊湣王之敗濟西，亡走，保於莒。",
          "translations": []
        },
        {
          "id": "s0024",
          "zh": "樂毅獨留徇齊，齊皆城守。",
          "translations": []
        },
        {
          "id": "s0025",
          "zh": "樂毅攻入臨菑，盡取齊寶財物祭器輸之燕。",
          "translations": []
        },
        {
          "id": "s0026",
          "zh": "燕昭王大說，親至濟上勞軍，行賞饗士，封樂毅於昌國，號為昌國君。",
          "translations": []
        },
        {
          "id": "s0027",
          "zh": "於是燕昭王收齊鹵獲以歸，而使樂毅復以兵平齊城之不下者。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "At this time, Qi King Min was strong. South he defeated Chu prime minister Tang Mai at Chongqiu, west he crushed the three Jin at Guanjin, then allied with the three Jin to attack Qin, helped Zhao destroy Zhongshan, broke Song, expanding territory over a thousand li. He contended with Qin King Zhao to be emperor, but later abandoned it. The feudal lords all wished to turn from Qin and submit to Qi. King Min was arrogant. The people could not bear it. Thus Yan King Zhao inquired about attacking Qi. Yue Yi replied: 'Qi is the remaining enterprise of a hegemon state, with vast territory and large population—not easy to attack alone. If Your Majesty wishes to attack it, nothing better than allying with Zhao and Chu, Wei.' Thus he sent Yue Yi to make treaty with Zhao King Huiwen, separately sent envoys to connect with Chu and Wei, ordering Zhao to persuade Qin of the advantages of attacking Qi. The feudal lords hated Qi King Min's arrogance and tyranny, all competed to form alliance with Yan to attack Qi. Yue Yi returned and reported. Yan King Zhao mobilized all troops, making Yue Yi supreme general. Zhao King Huiwen granted Yue Yi the prime minister seal. Yue Yi thus combined and commanded the troops of Zhao, Chu, Han, Wei, Yan to attack Qi, defeating them west of Ji. The allied troops withdrew and returned, but Yan's army under Yue Yi alone pursued, reaching Linzi. Qi King Min's defeat west of Ji caused him to flee and defend Ju. Yue Yi alone remained to campaign in Qi. Qi all defended their cities. Yue Yi attacked and entered Linzi, taking all Qi's treasures, valuables, and sacrificial vessels, transporting them to Yan. Yan King Zhao was greatly pleased, personally came to Ji to reward the army, distribute rewards and feast the soldiers, enfeoffing Yue Yi at Changguo, titled Lord Changguo. Thus Yan King Zhao took the Qi captives and spoils back, while ordering Yue Yi to again use troops to pacify the Qi cities that had not surrendered.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "樂毅留徇齊五歲，下齊七十餘城，皆為郡縣以屬燕，唯獨莒、即墨未服。",
          "translations": []
        },
        {
          "id": "s0029",
          "zh": "會燕昭王死，子立為燕惠王。",
          "translations": []
        },
        {
          "id": "s0030",
          "zh": "惠王自為太子時嘗不快於樂毅，及即位，齊之田單聞之，乃縱反閒於燕，曰：「齊城不下者兩城耳。",
          "translations": []
        },
        {
          "id": "s0031",
          "zh": "然所以不早拔者，聞樂毅與燕新王有隙，欲連兵且留齊，南面而王齊。",
          "translations": []
        },
        {
          "id": "s0032",
          "zh": "齊之所患，唯恐他將之來。」",
          "translations": []
        },
        {
          "id": "s0033",
          "zh": "於是燕惠王固已疑樂毅，得齊反閒，乃使騎劫代將，而召樂毅。",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "樂毅知燕惠王之不善代之，畏誅，遂西降趙。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "趙封樂毅於觀津，號曰望諸君。",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "尊寵樂毅以警動於燕、齊。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yue Yi remained campaigning in Qi for five years, taking over seventy Qi cities, all made into commanderies and counties belonging to Yan. Only Ju and Jimu remained unsubdued. Yan King Zhao died, his son ascended as Yan King Hui. King Hui, when he was crown prince, had once been displeased with Yue Yi. Upon ascending, Qi's Tian Dan heard of this and spread false rumors in Yan: 'The Qi cities not fallen are only two. Yet the reason they are not quickly taken is that Yue Yi has a rift with Yan's new king, wishing to join forces and remain in Qi, facing south to become king of Qi. What Qi fears most is another general coming.' Thus Yan King Hui was already suspicious of Yue Yi. Receiving Qi's false rumors, he sent Ji Jie to replace the general and summoned Yue Yi. Yue Yi knew Yan King Hui did not properly replace him, feared execution, thus surrendered west to Zhao. Zhao enfeoffed Yue Yi at Guanjin, titled Lord Wangzhu. Zhao honored and favored Yue Yi to threaten Yan and Qi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "齊田單後與騎劫戰，果設詐誑燕軍，遂破騎劫於即墨下，而轉戰逐燕，北至河上，盡復得齊城，而迎襄王於莒，入于臨菑。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Later Qi's Tian Dan battled Ji Jie, indeed used deception to trick the Yan army, defeating Ji Jie below Jimu, then turned and fought, pursuing Yan north to the Yellow River, recovering all Qi cities, welcoming King Xiang at Ju, entering Linzi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0038",
          "zh": "燕惠王後悔使騎劫代樂毅，以故破軍亡將失齊；",
          "translations": []
        },
        {
          "id": "s0039",
          "zh": "又怨樂毅之降趙，恐趙用樂毅而乘燕之獘以伐燕。",
          "translations": []
        },
        {
          "id": "s0040",
          "zh": "燕惠王乃使人讓樂毅，且謝之曰：「先王舉國而委將軍，將軍為燕破齊，報先王之讎，天下莫不震動，寡人豈敢一日而忘將軍之功哉！",
          "translations": []
        },
        {
          "id": "s0041",
          "zh": "會先王棄群臣，寡人新即位，左右誤寡人。",
          "translations": []
        },
        {
          "id": "s0042",
          "zh": "寡人之使騎劫代將軍，為將軍久暴露於外，故召將軍且休，計事。",
          "translations": []
        },
        {
          "id": "s0043",
          "zh": "將軍過聽，以與寡人有隙，遂捐燕歸趙。",
          "translations": []
        },
        {
          "id": "s0044",
          "zh": "將軍自為計則可矣，而亦何以報先王之所以遇將軍之意乎？」",
          "translations": []
        },
        {
          "id": "s0045",
          "zh": "樂毅報遺燕惠王書曰：",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yan King Hui later regretted replacing Yue Yi with Ji Jie, thus causing the army to break, generals lost, Qi lost. He also resented Yue Yi's surrender to Zhao, fearing Zhao would use Yue Yi to take advantage of Yan's weakness to attack Yan. Yan King Hui sent someone to reproach Yue Yi and apologize: 'The former king entrusted the entire state to the general. The general broke Qi for Yan, avenged the former king's grudge. The world all trembled. How dare I forget the general's merit for a single day! The former king abandoned the ministers, I newly ascended. My attendants misled me. My sending Ji Jie to replace the general was because the general had long been exposed abroad, thus summoning the general to rest and discuss plans. The general misheard, thinking I had a rift with you, thus abandoning Yan for Zhao. The general planning for himself is acceptable, but how do you repay the former king's treatment of the general?' Yue Yi sent a letter in reply to Yan King Hui:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0046",
          "zh": "臣不佞，不能奉承王命，以順左右之心，恐傷先王之明，有害足下之義，故遁逃走趙。",
          "translations": []
        },
        {
          "id": "s0047",
          "zh": "今足下使人數之以罪，臣恐侍御者不察先王之所以畜幸臣之理，又不白臣之所以事先王之心，故敢以書對。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "I am unworthy, could not follow Your Majesty's commands to comply with the attendants' wishes, fearing to harm the former king's wisdom and injure Your Majesty's righteousness, thus fled to Zhao. Now Your Majesty sends people to enumerate my crimes. I fear the attendants do not examine the former king's reasons for raising and favoring me, nor understand my intentions in serving the former king, thus dare to reply in writing.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0048",
          "zh": "臣聞賢聖之君不以祿私親，其功多者賞之，其能當者處之。",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "故察能而授官者，成功之君也；",
          "translations": []
        },
        {
          "id": "s0050",
          "zh": "論行而結交者，立名之士也。",
          "translations": []
        },
        {
          "id": "s0051",
          "zh": "臣竊觀先王之舉也，見有高世主之心，故假節於魏，以身得察於燕。",
          "translations": []
        },
        {
          "id": "s0052",
          "zh": "先王過舉，廁之賓客之中，立之群臣之上，不謀父兄，以為亞卿。",
          "translations": []
        },
        {
          "id": "s0053",
          "zh": "臣竊不自知，自以為奉令承教，可幸無罪，故受令而不辭。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "I have heard that worthy and sage lords do not favor relatives with stipends. Those with great merit they reward, those capable they place. Therefore examining ability and granting office is a lord who achieves success. Discussing conduct and forming friendships is a scholar who establishes reputation. I secretly observed the former king's actions, saw his heart surpassed the lords of the age, thus borrowed credentials from Wei to personally be examined in Yan. The former king mistakenly promoted me, placing me among the guests, establishing me above the ministers, not consulting father or brothers, appointing me second minister. I secretly did not understand myself, thinking I followed commands and teachings, could fortunately avoid crime, thus accepted the command without declining.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0054",
          "zh": "先王命之曰：「我有積怨深怒於齊，不量輕弱，而欲以齊為事。」",
          "translations": []
        },
        {
          "id": "s0055",
          "zh": "臣曰：「夫齊，霸國之餘業而最勝之遺事也。",
          "translations": []
        },
        {
          "id": "s0056",
          "zh": "練於兵甲，習於戰攻。",
          "translations": []
        },
        {
          "id": "s0057",
          "zh": "王若欲伐之，必與天下圖之。",
          "translations": []
        },
        {
          "id": "s0058",
          "zh": "與天下圖之，莫若結於趙。",
          "translations": []
        },
        {
          "id": "s0059",
          "zh": "且又淮北、宋地，楚魏之所欲也，趙若許而約四國攻之，齊可大破也。」",
          "translations": []
        },
        {
          "id": "s0060",
          "zh": "先王以為然，具符節南使臣於趙。",
          "translations": []
        },
        {
          "id": "s0061",
          "zh": "顧反命，起兵擊齊。",
          "translations": []
        },
        {
          "id": "s0062",
          "zh": "以天之道，先王之靈，河北之地隨先王而舉之濟上。",
          "translations": []
        },
        {
          "id": "s0063",
          "zh": "濟上之軍受命擊齊，大敗齊人。",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "輕卒銳兵，長驅至國。",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "齊王遁而走莒，僅以身免；",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "珠玉財寶車甲珍器盡收入于燕。",
          "translations": []
        },
        {
          "id": "s0067",
          "zh": "齊器設於寧臺，大呂陳於元英，故鼎反乎磿室，薊丘之植植於汶篁，自五伯已來，功未有及先王者也。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "先王以為慊於志，故裂地而封之，使得比小國諸侯。",
          "translations": []
        },
        {
          "id": "s0069",
          "zh": "臣竊不自知，自以為奉命承教，可幸無罪，是以受命不辭。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The former king commanded me: 'I have accumulated resentment and deep anger toward Qi, not measuring my weakness, wishing to make Qi my affair.' I said: 'Qi is the remaining enterprise of a hegemon state and the legacy of the most victorious. Skilled in armor and weapons, practiced in battle and attack. If Your Majesty wishes to attack it, must plan with the world. Planning with the world, nothing better than allying with Zhao. Moreover Huai north and Song territory are what Chu and Wei desire. If Zhao agrees and unites the four states to attack, Qi can be greatly broken.' The former king considered it correct, prepared tallies and credentials, sending me south as envoy to Zhao. Returning with the reply, raised troops to attack Qi. By heaven's way and the former king's spirit, the lands north of the Yellow River followed the former king and were raised at Ji. The army at Ji received command to attack Qi, greatly defeating the Qi people. Light troops and sharp soldiers drove straight to the capital. The Qi king fled to Ju, barely escaping with his life. Pearls, jade, treasures, carriages, armor, precious vessels—all entered Yan. Qi vessels displayed at Ning Terrace, great bells arrayed at Yuan Ying, ancient tripods returned to the stone chamber, Jizhou plants planted at Wen bamboo—from the Five Hegemons onward, none achieved merit matching the former king. The former king was satisfied in his ambitions, thus divided land to enfeoff him, allowing him to equal the small state feudal lords. I secretly did not understand myself, thinking I followed commands and teachings, could fortunately avoid crime, thus accepted the command without declining.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0070",
          "zh": "臣聞賢聖之君，功立而不廢，故著於春秋；",
          "translations": []
        },
        {
          "id": "s0071",
          "zh": "蚤知之士，名成而不毀，故稱於後世。",
          "translations": []
        },
        {
          "id": "s0072",
          "zh": "若先王之報怨雪恥，夷萬乘之彊國，收八百歲之蓄積，及至棄群臣之日，餘教未衰，執政任事之臣，修法令，慎庶孽，施及乎萌隸，皆可以教後世。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "I have heard that worthy and sage lords establish merit without abandoning it, thus recorded in the Spring and Autumn Annals. Scholars who early understand establish fame without destroying it, thus praised in later generations. Like the former king's revenge and washing away shame, leveling a ten thousand chariot strong state, collecting eight hundred years of accumulations—until the day he abandoned his ministers, his remaining teachings did not decline. The governing ministers who handle affairs refine laws and commands, are cautious with heirs, extend to the lowest servants—all can instruct later generations.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "臣聞之，善作者不必善成，善始者不必善終。",
          "translations": []
        },
        {
          "id": "s0074",
          "zh": "昔伍子胥說聽於闔閭，而吳王遠跡至郢；",
          "translations": []
        },
        {
          "id": "s0075",
          "zh": "夫差弗是也，賜之鴟夷而浮之江。",
          "translations": []
        },
        {
          "id": "s0076",
          "zh": "吳王不寤先論之可以立功，故沈子胥而不悔；",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "子胥不蚤見主之不同量，是以至於入江而不化。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "I have heard that those skilled at beginning are not necessarily skilled at completing, those good at starting are not necessarily good at ending. In former times Wu Zixu advised Helu and was heeded, Wu king far reached Ying. Fuchai did not follow this, granted him the owl stomach and floated him on the river. Wu king did not realize the earlier advice could establish merit, thus drowned Zixu without regret. Zixu did not early see his lord's different measure, thus reached floating on the river without change.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0078",
          "zh": "夫免身立功，以明先王之跡，臣之上計也。",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "離毀辱之誹謗，墮先王之名，臣之所大恐也。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "臨不測之罪，以幸為利，義之所不敢出也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Saving myself and establishing merit to illuminate the former king's traces—this is my highest plan. Avoiding slanders of destruction and disgrace, tarnishing the former king's name—this is my great fear. Facing unpredictable crime to seek personal profit—righteousness does not dare go there.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0081",
          "zh": "臣聞古之君子，交絕不出惡聲；",
          "translations": []
        },
        {
          "id": "s0082",
          "zh": "忠臣去國，不絜其名。",
          "translations": []
        },
        {
          "id": "s0083",
          "zh": "臣雖不佞，數奉教於君子矣。",
          "translations": []
        },
        {
          "id": "s0084",
          "zh": "恐侍御者之親左右之說，不察疏遠之行，故敢獻書以聞，唯君王之留意焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "I have heard that ancient gentlemen, when friendship ends, do not speak ill. Loyal ministers leaving their state do not cleanse their names. Though I am unworthy, I have repeatedly received teachings from gentlemen. I fear the attendants favor the close attendants' words, do not examine distant conduct, thus dare to present this letter to inform. May Your Majesty pay attention.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "於是燕王復以樂毅子樂閒為昌國君；",
          "translations": []
        },
        {
          "id": "s0086",
          "zh": "而樂毅往來復通燕，燕、趙以為客卿。",
          "translations": []
        },
        {
          "id": "s0087",
          "zh": "樂毅卒於趙。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus Yan king again made Yue Yi's son Yue Xian Lord Changguo. Yue Yi traveled back and forth maintaining relations with Yan. Yan and Zhao employed him as guest minister. Yue Yi died in Zhao.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0088",
          "zh": "樂閒居燕三十餘年，燕王喜用其相栗腹之計，欲攻趙，而問昌國君樂閒。",
          "translations": []
        },
        {
          "id": "s0089",
          "zh": "樂閒曰：「趙，四戰之國也，其民習兵，伐之不可。」",
          "translations": []
        },
        {
          "id": "s0090",
          "zh": "燕王不聽，遂伐趙。",
          "translations": []
        },
        {
          "id": "s0091",
          "zh": "趙使廉頗擊之，大破栗腹之軍於鄗，禽栗腹、樂乘。",
          "translations": []
        },
        {
          "id": "s0092",
          "zh": "樂乘者，樂閒之宗也。",
          "translations": []
        },
        {
          "id": "s0093",
          "zh": "於是樂閒奔趙，趙遂圍燕。",
          "translations": []
        },
        {
          "id": "s0094",
          "zh": "燕重割地以與趙和，趙乃解而去。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yue Xian resided in Yan over thirty years. Yan King Hui favored using his prime minister Li Fu's plans, wishing to attack Zhao, and asked Lord Changguo Yue Xian. Yue Xian said: 'Zhao is a nation of four frontiers, its people practiced in warfare. Attacking it is not possible.' Yan king did not listen, thus attacked Zhao. Zhao sent Lian Po to attack them, greatly defeating Li Fu's army at Gao, capturing Li Fu and Yue Cheng. Yue Cheng was Yue Xian's clan member. Thus Yue Xian fled to Zhao. Zhao then besieged Yan. Yan heavily ceded land to make peace with Zhao. Zhao then withdrew.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0095",
          "zh": "燕王恨不用樂閒，樂閒既在趙，乃遺樂閒書曰：「紂之時，箕子不用，犯諫不怠，以冀其聽；",
          "translations": []
        },
        {
          "id": "s0096",
          "zh": "商容不達，身祇辱焉，以冀其變。",
          "translations": []
        },
        {
          "id": "s0097",
          "zh": "及民志不入，獄囚自出，然後二子退隱。",
          "translations": []
        },
        {
          "id": "s0098",
          "zh": "故紂負桀暴之累，二子不失忠聖之名。",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "何者？",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "其憂患之盡矣。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "今寡人雖愚，不若紂之暴也；",
          "translations": []
        },
        {
          "id": "s0102",
          "zh": "燕民雖亂，不若殷民之甚也。",
          "translations": []
        },
        {
          "id": "s0103",
          "zh": "室有語，不相盡，以告鄰里。",
          "translations": []
        },
        {
          "id": "s0104",
          "zh": "二者，寡人不為君取也。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yan king regretted not using Yue Xian. Yue Xian being in Zhao, sent Yue Xian a letter: 'In Zhou's time, Ji Zi was not used, committed remonstrance without tiring, hoping for his listening. Shang Rong was not accepted, personally endured disgrace, hoping for change. When the people's will did not enter, prisoners released themselves, then the two scholars retired and hid. Thus Zhou bore the burden of Jie-like tyranny, the two scholars did not lose their loyal sage names. Why? Their concern and suffering were complete. Now though I am foolish, not matching Zhou's tyranny. Yan people though in disorder, not matching Yin people's extremity. If the house has words, not fully spoken, to tell the neighbors and villagers. These two, I do not do for my lord.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "樂閒、樂乘怨燕不聽其計，二人卒留趙。",
          "translations": []
        },
        {
          "id": "s0107",
          "zh": "趙封樂乘為武襄君。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zhao enfeoffed Yue Cheng as Lord Wuxiang. The next year, Yue Cheng and Lian Po besieged Yan for Zhao. Yan used heavy ceremony to make peace, then they withdrew.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "其明年，樂乘、廉頗為趙圍燕，燕重禮以和，乃解。",
          "translations": []
        },
        {
          "id": "s0109",
          "zh": "後五歲，趙孝成王卒。",
          "translations": []
        },
        {
          "id": "s0110",
          "zh": "襄王使樂乘代廉頗。",
          "translations": []
        },
        {
          "id": "s0111",
          "zh": "廉頗攻樂乘，樂乘走，廉頗亡入魏。",
          "translations": []
        },
        {
          "id": "s0112",
          "zh": "其後十六年而秦滅趙。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Five years later, Zhao King Xiaocheng died. King Xiang sent Yue Cheng to replace Lian Po. Lian Po attacked Yue Cheng. Yue Cheng fled. Lian Po deserted to Wei. Sixteen years later Qin destroyed Zhao. Over twenty years later, Gaozu passed through Zhao and asked: 'Does Yue Yi have descendants?'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0113",
          "zh": "其後二十餘年，高帝過趙，問：「樂毅有後世乎？」",
          "translations": []
        },
        {
          "id": "s0114",
          "zh": "對曰：「有樂叔。」",
          "translations": []
        },
        {
          "id": "s0115",
          "zh": "高帝封之樂卿，號曰華成君。",
          "translations": []
        },
        {
          "id": "s0116",
          "zh": "華成君，樂毅之孫也。",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "而樂氏之族有樂瑕公、樂臣公，趙且為秦所滅，亡之齊高密。",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "樂臣公善修黃帝、老子之言，顯聞於齊，稱賢師。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "They replied: 'There is Yue Shu.' Gaozu enfeoffed him as Lord Yue, titled Lord Huacheng. Lord Huacheng was Yue Yi's grandson. The Yue clan had Lord Yue Xia and Lord Yue Chen. Zhao was about to be destroyed by Qin, they fled to Qi's Gaomi. Lord Yue Chen was skilled in the teachings of Yellow Emperor and Laozi, became famous in Qi, called a worthy teacher. The Grand Historian says: At first, Qi's Kuai Tong and Lord Father Jian read Yue Yi's letter replying to the Yan king, never failed to put down the book and weep.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0119",
          "zh": "太史公曰：始齊之蒯通及主父偃讀樂毅之報燕王書，未嘗不廢書而泣也。",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "樂臣公學黃帝、老子，其本師號曰河上丈人，不知其所出。",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "河上丈人教安期生，安期生教毛翕公，毛翕公教樂瑕公，樂瑕公教樂臣公，樂臣公教蓋公。",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "蓋公教於齊高密、膠西，為曹相國師。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Lord Yue Chen studied Yellow Emperor and Laozi. His original teacher was titled Riverbank Elder, no one knows his origin. Riverbank Elder taught An Qisheng, An Qisheng taught Mao Xigong, Mao Xigong taught Lord Yue Xia, Lord Yue Xia taught Lord Yue Chen, Lord Yue Chen taught Gai Gong. Gai Gong taught in Qi's Gaomi and Jiaoxi, became teacher to Chancellor Cao. Gai Gong taught in Qi's Gaomi and Jiaoxi, became teacher to Chancellor Cao.",
          "idiomatic": null
        }
      ]
    }
  ]
}