{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "084",
    "url": "https://chinesenotes.com/shiji/shiji084.html",
    "title": {
      "zh": "屈原賈生列傳",
      "en": "Biographies of Qu Yuan and Master Jia",
      "raw": "《屈原賈生列傳》 Biographies of Qu Yuan and Master Jia"
    },
    "sentenceCount": 246,
    "translatedCount": 246,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:10.108Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "屈原者，名平，楚之同姓也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Yuan, named Ping, Chu same clan.",
              "idiomatic": "Qu Yuan, named Ping, was of the same clan as Chu."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "為楚懷王左徒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Served Chu Huai Wang Left Tutor.",
              "idiomatic": "He served as King Huai of Chu's Left Tutor."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "博聞彊志，明於治亂，嫻于辭令。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Broad learning strong will, clear on order chaos, skilled in rhetoric.",
              "idiomatic": "He had broad learning and strong will, was clear on order and chaos, skilled in rhetoric."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "入則與王圖議國事，以出號令；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Enter then with king plan discuss state affairs, to issue commands;",
              "idiomatic": "When in court, he discussed state affairs with the king and issued commands;"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "出則接遇賓客，應對諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Exit then receive guests, respond to feudal lords.",
              "idiomatic": "when out, he received guests and responded to feudal lords."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "王甚任之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King greatly relied on him.",
              "idiomatic": "The king greatly relied on him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Yuan, named Ping, was of Chu's royal clan. He served as Chu King Huai's left aide. Broad in learning and strong in will, clear on order and chaos, skilled in rhetoric. When in court he consulted with the king on state affairs and issued commands; When abroad he received guests and responded to feudal lords. The king relied on him greatly.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0007",
          "zh": "上官大夫與之同列，爭寵而心害其能。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shangguan Chamberlain with him same rank, competed favor yet heart resented his ability.",
              "idiomatic": "The Chamberlain Shangguan was his colleague, competed for favor and resented his ability in his heart."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "懷王使屈原造為憲令，屈平屬草槁未定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang made Qu Yuan draft constitutional laws, Qu Ping had just finished draft not yet decided.",
              "idiomatic": "King Huai had Qu Yuan draft constitutional laws. Qu Ping had just finished the draft but it was not yet finalized."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "上官大夫見而欲奪之，屈平不與，因讒之曰：「王使屈平為令，眾莫不知，每一令出，平伐其功，（曰）以為『非我莫能為』也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shangguan Chamberlain saw and wished seize it, Qu Ping not give, therefore slandered said: 'King made Qu Ping for laws, crowd none not know, every time law out, Ping boasted merit, said 'only I can do'.'",
              "idiomatic": "The Chamberlain Shangguan saw it and wanted to seize it. Qu Ping wouldn't give it to him, so he slandered him, saying: 'The king had Qu Ping make the laws. Everyone knows this. Every time a law comes out, Ping boasts of the merit, saying \"Only I could do it.\"'"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "王怒而疏屈平。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King angered distanced Qu Ping.",
              "idiomatic": "The king was angry and distanced Qu Ping."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Grand Chamberlain shared his rank, competed for favor and secretly envied his talent. King Huai ordered Qu Yuan to draft the constitution. Qu Ping had just finished the rough draft. The Grand Chamberlain saw it and wanted to steal it. Qu Ping would not give it. Thus he slandered saying: 'The king ordered Qu Ping to draft the constitution. Everyone knows this. Every time a command is issued, Ping claims the credit, saying \"Only I could do this.\"' The king grew angry and distanced Qu Ping.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "屈平疾王聽之不聰也，讒諂之蔽明也，邪曲之害公也，方正之不容也，故憂愁幽思而作離騷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Ping grieved king listening not wise, slander flattery blocked clarity, crooked harmed justice, upright not tolerated, therefore worried sorrowful deep thought composed Li Sao.",
              "idiomatic": "Qu Ping grieved that the king's listening was not wise, that slander and flattery blocked clarity, that crooked harmed justice, that upright was not tolerated. Therefore he worried and sorrowed, pondered deeply, and composed 'Li Sao'."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "離騷者，猶離憂也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Li Sao' like 'li you' (leaving sorrow).",
              "idiomatic": "'Li Sao' is like 'li you' - leaving sorrow."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "夫天者，人之始也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That heaven, people beginning;",
              "idiomatic": "Heaven is the beginning of people;"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "父母者，人之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Parents, people root.",
              "idiomatic": "parents are the root of people."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "人窮則反本，故勞苦倦極，未嘗不呼天也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People poor then return to roots, therefore labor toil exhausted extreme, never not call heaven;",
              "idiomatic": "When people are poor they return to their roots. Therefore when exhausted from labor and toil, they never fail to call on heaven;"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "疾痛慘怛，未嘗不呼父母也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Illness pain bitter sorrow, never not call parents.",
              "idiomatic": "When in illness and pain, bitter sorrow, they never fail to call on parents."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "屈平正道直行，竭忠盡智以事其君，讒人閒之，可謂窮矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Ping correct path straight conduct, exhausted loyalty wisdom to serve his lord, slanderers separated them, can be called poor indeed.",
              "idiomatic": "Qu Ping followed the correct path and straight conduct, exhausted loyalty and wisdom to serve his lord. Slanderers came between them - can be called poor indeed."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "信而見疑，忠而被謗，能無怨乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Faithful yet seen suspicious, loyal yet slandered, can have no resentment?",
              "idiomatic": "Faithful yet seen as suspicious, loyal yet slandered - how could there be no resentment?"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "屈平之作離騷，蓋自怨生也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Ping composed Li Sao, probably self-resignation born.",
              "idiomatic": "Qu Ping's composition of 'Li Sao' was probably born from self-resignation."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "國風好色而不淫，小雅怨誹而不亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Guo Feng loves beauty not licentious, Xiao Ya resents criticizes not chaotic.",
              "idiomatic": "'Guo Feng' loves beauty but is not licentious, 'Xiao Ya' resents and criticizes but is not chaotic."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "若離騷者，可謂兼之矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As for Li Sao, can be said combines them.",
              "idiomatic": "As for 'Li Sao', it can be said to combine them."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "上稱帝嚳，下道齊桓，中述湯武，以刺世事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Above mentions Emperor Ku, below speaks Duke Huan, middle describes Tang Wu, to criticize current affairs.",
              "idiomatic": "Above it mentions Emperor Ku, below speaks of Duke Huan, in the middle describes Tang and Wu, to criticize current affairs."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "明道德之廣崇，治亂之條貫，靡不畢見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Clarifies morality broad elevation, governance chaos systematic order, nothing not completely seen.",
              "idiomatic": "It clarifies the broad elevation of morality, the systematic order of governance and chaos - nothing is not completely seen."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "其文約，其辭微，其志絜，其行廉，其稱文小而其指極大，舉類邇而見義遠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its text concise, its words subtle, its will pure, its conduct clean, its references small yet its meaning extremely great, cites nearby examples yet sees far justice.",
              "idiomatic": "Its text is concise, its words subtle, its will pure, its conduct clean. Its references are small but its meaning extremely great, cites nearby examples yet sees far-reaching justice."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "其志絜，故其稱物芳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its will pure, therefore its named things fragrant.",
              "idiomatic": "Its will is pure, therefore its named things are fragrant."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "其行廉，故死而不容自疏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its conduct clean, therefore died not allowing self distant.",
              "idiomatic": "Its conduct is clean, therefore died without allowing self to be distant."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "濯淖汙泥之中，蟬蛻於濁穢，以浮游塵埃之外，不獲世之滋垢，皭然泥而不滓者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Washed mud filth midst, cicada molted foulness, to float roam dust outside, not obtaining world accumulated filth, pure unstained mud not dregs.",
              "idiomatic": "Washed in mud and filth's midst, molted like cicada from foulness, to float and roam beyond dust, not obtaining the world's accumulated filth - pure and unstained in mud yet without dregs."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "推此志也，雖與日月爭光可也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pushing this ambition, even with sun moon contend light possible.",
              "idiomatic": "Pushing this ambition, even contending with sun and moon's light is possible."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Ping resented that the king listened without wisdom, that slanderers blocked clarity, that crookedness harmed justice, that uprightness was not tolerated. Thus he worried and brooded in sorrow and composed 'Li Sao'. 'Li Sao' means departing sorrow. Heaven is the beginning of man; Parents are man's foundation. When man is in distress he returns to fundamentals, thus when exhausted by toil and weariness, one inevitably cries to heaven; When pained by illness and suffering, one inevitably cries to parents. Qu Ping walked the straight path, exhausted loyalty and wisdom serving his lord. Slanderers came between them - he can be called destitute. Trusted yet suspected, loyal yet slandered - how could he not resent? Qu Ping's composition of 'Li Sao' arose from self-pity. 'Guo Feng' delights in beauty without licentiousness, 'Xiao Ya' resents and satirizes without disorder. As for 'Li Sao', it can be said to combine both. Above it praises Emperor Ku, below it describes Duke Huan of Qi, in the middle it narrates Tang and Wu, to criticize contemporary affairs. It illuminates the vast sublimity of morality, the systematic principles of order and chaos - nothing is not fully revealed. Its text is concise, its diction subtle, its ambition pure, its conduct honest. Its language is modest but its meaning extremely grand, citing near examples yet revealing far-reaching principles. Its ambition pure, thus it praises fragrant things. Its conduct honest, thus in death it would not let itself be distant. Washing in filthy mud, shedding like a cicada from impurity, to float and roam beyond the dust, not acquiring the world's defilement, pure white mud yet unstained. Extending this ambition, even contending with sun and moon for brilliance is possible.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0029",
          "zh": "屈平既絀，其後秦欲伐齊，齊與楚從親，惠王患之，乃令張儀詳去秦，厚幣委質事楚，曰：「秦甚憎齊，齊與楚從親，楚誠能絕齊，秦願獻商、於之地六百里。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Ping already dismissed, after this Qin wished attack Qi, Qi with Chu allied closely, Hui Wang worried it, then had Zhang Yi pretend leave Qin, thick gifts humble serve Chu, said: 'Qin greatly hates Qi, Qi with Chu allied closely. Chu truly can break Qi, Qin wishes offer Shang Yu lands 600 li.'",
              "idiomatic": "Qu Ping was already dismissed. After this, Qin wished to attack Qi. Qi and Chu were allied closely. King Hui worried about it, so he had Zhang Yi pretend to leave Qin, send thick gifts and humbly serve Chu, saying: 'Qin greatly hates Qi. Qi and Chu are allied closely. If Chu can truly break with Qi, Qin wishes to offer Shang and Yu lands 600 li.'"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "楚懷王貪而信張儀，遂絕齊，使使如秦受地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Huai Wang greedy believed Zhang Yi, thus broke Qi, sent envoy to Qin receive land.",
              "idiomatic": "Chu's King Huai was greedy and believed Zhang Yi, thus broke with Qi, sent envoys to Qin to receive the land."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "張儀詐之曰：「儀與王約六里，不聞六百里。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhang Yi deceived them said: 'Yi with king agreed six li, not heard six hundred li.'",
              "idiomatic": "Zhang Yi deceived them, saying: 'I agreed with the king on six li, not six hundred li.'"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "楚使怒去，歸告懷王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu envoy angered left, returned told Huai Wang.",
              "idiomatic": "The Chu envoy angrily left, returned and told King Huai."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "懷王怒，大興師伐秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang angered, greatly raised troops attacked Qin.",
              "idiomatic": "King Huai was angry, greatly raised troops to attack Qin."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "秦發兵擊之，大破楚師於丹、淅，斬首八萬，虜楚將屈丐，遂取楚之漢中地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin sent troops struck them, greatly defeated Chu army at Dan Xi, beheaded eighty thousand, captured Chu general Qu Gai, thus took Chu Hanzhong land.",
              "idiomatic": "Qin sent troops to strike them, greatly defeated the Chu army at Dan and Xi, beheaded eighty thousand, captured Chu general Qu Gai, thus took Chu's Hanzhong land."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "懷王乃悉發國中兵以深入擊秦，戰於藍田。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang then sent all state troops to deeply attack Qin, battled at Lantian.",
              "idiomatic": "King Huai then sent all the state's troops to deeply attack Qin, battled at Lantian."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "魏聞之，襲楚至鄧。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wei heard it, attacked Chu to Deng.",
              "idiomatic": "Wei heard of it, attacked Chu to Deng."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "楚兵懼，自秦歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu troops feared, from Qin returned.",
              "idiomatic": "The Chu troops feared, returned from Qin."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "而齊竟怒不救楚，楚大困。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "And Qi finally angered not rescued Chu, Chu greatly distressed.",
              "idiomatic": "And Qi finally angered and did not rescue Chu, Chu was greatly distressed."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Ping having been demoted, afterward Qin wanted to attack Qi. Qi and Chu had allied closely. Qin King Hui worried, thus ordered Zhang Yi to pretend to leave Qin, offer rich gifts and serve Chu, saying: 'Qin greatly hates Qi. Qi and Chu have allied closely. If Chu can truly break with Qi, Qin wishes to offer the lands of Shang and Yu, six hundred li.' Chu King Huai, greedy, believed Zhang Yi, thus broke with Qi and sent envoys to Qin to receive land. Zhang Yi deceived saying: 'Yi and the king agreed to six li, not six hundred li.' The Chu envoy angrily left, returned and reported to King Huai. King Huai angered, greatly raised troops to attack Qin. Qin sent troops to strike them, greatly defeated Chu army at Dan and Xi, beheaded eighty thousand, captured Chu general Qu Gai, thus took Chu's Han River region. King Huai then mobilized all troops in the state for deep invasion to attack Qin, battled at Lan Tian. Wei heard of it, raided Chu to Deng. Chu troops feared, returned from Qin. Yet Qi ultimately angered and did not rescue Chu, Chu greatly distressed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0039",
          "zh": "明年，秦割漢中地與楚以和。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next year, Qin ceded Hanzhong land to Chu for peace.",
              "idiomatic": "Next year, Qin ceded Hanzhong land to Chu for peace."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "楚王曰：「不願得地，願得張儀而甘心焉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wang said: 'Not wish get land, wish get Zhang Yi satisfy hatred.'",
              "idiomatic": "The Chu king said: 'Do not wish to get the land, wish to get Zhang Yi and satisfy our hatred.'"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "張儀聞，乃曰：「以一儀而當漢中地，臣請往如楚。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhang Yi heard, then said: 'With one Zhang Yi match Hanzhong land, minister requests go to Chu.'",
              "idiomatic": "Zhang Yi heard, then said: 'With one Zhang Yi to match Hanzhong land, I request to go to Chu.'"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "如楚，又因厚幣用事者臣靳尚，而設詭辯於懷王之寵姬鄭袖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Went to Chu, moreover used thick gifts influential minister Jin Shang, set up deceptive arguments with Huai Wang favored concubine Zheng Xiu.",
              "idiomatic": "He went to Chu, moreover used thick gifts on influential minister Jin Shang, and set up deceptive arguments with King Huai's favored concubine Zheng Xiu."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "懷王竟聽鄭袖，復釋去張儀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang finally listened Zheng Xiu, again released Zhang Yi.",
              "idiomatic": "King Huai finally listened to Zheng Xiu, again released Zhang Yi."
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "是時屈平既疏，不復在位，使於齊，顧反，諫懷王曰：「何不殺張儀？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Qu Ping already alienated, no longer in position, sent to Qi, looked back, advised Huai Wang said: 'Why not kill Zhang Yi?'",
              "idiomatic": "At this time Qu Ping was already alienated, no longer in position. Sent to Qi, he looked back and advised King Huai, saying: 'Why not kill Zhang Yi?'"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "懷王悔，追張儀不及。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang regretted, pursued Zhang Yi could not catch.",
              "idiomatic": "King Huai regretted, pursued Zhang Yi but could not catch him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Next year, Qin ceded Han River region to Chu for peace. Chu king said: 'I do not wish land, I wish Zhang Yi to satisfy my hatred.' Zhang Yi heard, thus said: 'Using one Yi to exchange for Han River region, minister requests to go to Chu.' Went to Chu, again used rich gifts to make the influential minister Jin Shang serve him, and set deceptive arguments through King Huai's favored concubine Zheng Xiu. King Huai ultimately listened to Zheng Xiu, again released Zhang Yi. At this time Qu Ping was already estranged, no longer in position. Sent to Qi, on return advised King Huai: 'Why not kill Zhang Yi?' King Huai regretted, pursued Zhang Yi but could not catch him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0046",
          "zh": "其後諸侯共擊楚，大破之，殺其將唐眛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After this feudal lords together attacked Chu, greatly defeated them, killed their general Tang Mei.",
              "idiomatic": "After this, the feudal lords together attacked Chu, greatly defeated them, and killed their general Tang Mei."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Afterward the feudal lords together attacked Chu, greatly defeated them, killed their general Tang Mei.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0047",
          "zh": "時秦昭王與楚婚，欲與懷王會。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time Qin Zhao Wang married with Chu, wished to meet with Huai Wang.",
              "idiomatic": "At this time, Qin's King Zhao married with Chu and wished to meet with King Huai."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "懷王欲行，屈平曰：「秦虎狼之國，不可信，不如毋行。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang wished go, Qu Ping said: 'Qin tiger wolf country, cannot trust, better not go.'",
              "idiomatic": "King Huai wished to go. Qu Ping said: 'Qin is a tiger and wolf country that cannot be trusted. It would be better not to go.'"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "懷王稚子子蘭勸王行：「柰何絕秦歡！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang young son Zi Lan advised king go: 'How break Qin friendship!'",
              "idiomatic": "King Huai's young son Zi Lan advised the king to go: 'How can we break off Qin's friendship!'"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "懷王卒行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang finally went.",
              "idiomatic": "King Huai finally went."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "入武關，秦伏兵絕其後，因留懷王，以求割地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Entered Wuguan, Qin ambush troops cut off their rear, thus detained Huai Wang to demand ceding land.",
              "idiomatic": "They entered Wuguan. Qin ambush troops cut off their rear, thus detaining King Huai to demand the ceding of land."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "懷王怒，不聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang angered, did not listen.",
              "idiomatic": "King Huai was angry and did not listen."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "亡走趙，趙不內。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fled to Zhao, Zhao not admit.",
              "idiomatic": "He fled to Zhao, but Zhao would not admit him."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "復之秦，竟死於秦而歸葬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Returned to Qin, finally died in Qin returned for burial.",
              "idiomatic": "He returned to Qin and finally died there, his body returned for burial."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "At this time Qin King Zhao married into Chu, wished to meet with King Huai. King Huai wished to go. Qu Ping said: 'Qin is a tiger wolf state, cannot be trusted, better not to go.' King Huai's young son Zi Lan urged the king to go: 'How can we cut off Qin's goodwill!' King Huai ultimately went. Entered Wu Pass, Qin ambushed troops cut off his rear, thus detained King Huai to demand territory cession. King Huai angered, would not listen. Fled to Zhao, Zhao would not admit him. Returned to Qin, ultimately died in Qin and was returned for burial.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "長子頃襄王立，以其弟子蘭為令尹。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Eldest son King Qingxiang established, made his younger brother Zi Lan prime minister.",
              "idiomatic": "His eldest son, King Qingxiang, was established on the throne, and he made his younger brother Zi Lan prime minister."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "楚人既咎子蘭以勸懷王入秦而不反也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu people already blamed Zi Lan for advising Huai Wang enter Qin not return.",
              "idiomatic": "The Chu people already blamed Zi Lan for advising King Huai to enter Qin and not return."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Eldest son King Qingxiang ascended, made his younger brother Zi Lan prime minister. Chu people already blamed Zi Lan for urging King Huai to enter Qin without return.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "屈平既嫉之，雖放流，睠顧楚國，系心懷王，不忘欲反，冀幸君之一悟，俗之一改也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Ping already hated him, though banished, fondly regarded Chu state, tied heart Huai Wang, not forget wished return, hoped king one awakening, customs one change.",
              "idiomatic": "Qu Ping already hated Zi Lan. Though banished, he fondly regarded the Chu state, tied his heart to King Huai, did not forget his wish to return, hoping for the king's one awakening and the customs' one change."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "其存君興國而欲反覆之，一篇之中三致志焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "His preserve lord revive country wish reverse it, one chapter three times expressed will.",
              "idiomatic": "His desire to preserve the lord and revive the country and reverse their situation is expressed three times in this one chapter."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "然終無可柰何，故不可以反，卒以此見懷王之終不悟也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet finally nothing could be done, therefore could not return, finally thus saw Huai Wang final lack of awakening.",
              "idiomatic": "Yet finally there was nothing that could be done, therefore he could not return. He finally thus saw King Huai's final lack of awakening."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "人君無愚智賢不肖，莫不欲求忠以自為，舉賢以自佐，然亡國破家相隨屬，而聖君治國累世而不見者，其所謂忠者不忠，而所謂賢者不賢也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rulers regardless foolish wise worthy unworthy, none not wish seek loyal for themselves, raise worthy assist themselves, yet ruined states broken families follow succession, yet sage kings govern states generations not appear - what they called loyal not loyal, what they called worthy not worthy.",
              "idiomatic": "Rulers, regardless of foolish or wise, worthy or unworthy, none do not wish to seek loyal ministers for themselves and raise worthy ones to assist them. Yet ruined states and broken families follow in succession, while sage kings who govern states for generations do not appear - what they call loyal is not loyal, what they call worthy is not worthy."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "懷王以不知忠臣之分，故內惑於鄭袖，外欺於張儀，疏屈平而信上官大夫、令尹子蘭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Huai Wang because not know loyal ministers distinction, therefore internally confused by Zheng Xiu, externally deceived by Zhang Yi, alienated Qu Ping trusted Chamberlain Shangguan, Prime Minister Zi Lan.",
              "idiomatic": "King Huai, because he did not know the distinction of loyal ministers, was therefore internally confused by Zheng Xiu, externally deceived by Zhang Yi, alienated Qu Ping and trusted Chamberlain Shangguan and Prime Minister Zi Lan."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "兵挫地削，亡其六郡，身客死於秦，為天下笑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Army defeated land reduced, lost six commanderies, body died as guest in Qin, became world laughingstock.",
              "idiomatic": "His army was defeated and land reduced, he lost six commanderies, his body died as a guest in Qin, and he became the world's laughingstock."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "此不知人之禍也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This not know people calamity.",
              "idiomatic": "This is the calamity of not knowing people."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "《易》曰：「井泄不食，為我心惻，可以汲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Yi Jing' said: 'Well leaks not drunk, makes my heart sorrowful, can draw water.",
              "idiomatic": "The 'Yi Jing' says: 'Well leaks but is not drunk from, makes my heart sorrowful, can draw water."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "王明，并受其福。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King enlightened, all receive its blessing.'",
              "idiomatic": "King enlightened, all receive its blessing.'"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "王之不明，豈足福哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King lack of enlightenment, how sufficient blessing!",
              "idiomatic": "The king's lack of enlightenment - how sufficient for blessing!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Ping having envied this, though banished, gazed back at Chu state, heart attached to King Huai, not forgetting desire to return, hoping the lord would one day awaken, customs would one day change. His preserving the lord and reviving the state while wishing to overturn them - in one poem three times expressing this ambition. Yet ultimately nothing could be done, thus could not return, finally showed King Huai's final lack of awakening. Rulers, whether foolish or wise, worthy or unworthy, all wish to seek loyalty for themselves, promote worthies to assist themselves. Yet ruined states and broken families follow one after another, while sage lords govern states for generations without being seen. What they call loyal is not loyal, what they call worthy is not worthy. King Huai because he did not know the distinction of loyal ministers, thus internally deluded by Zheng Xiu, externally deceived by Zhang Yi, distanced Qu Ping while trusting Grand Chamberlain and Prime Minister Zi Lan. Troops defeated territory reduced, lost six commanderies, person died as guest in Qin, became world's laughter. This is the calamity of not knowing people. 'Yi' says: 'Well leaks not drunk, makes my heart sorrowful, can draw water. King enlightened, all receive its blessing.' The king's lack of enlightenment, how can it bring blessing!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "令尹子蘭聞之大怒，卒使上官大夫短屈原於頃襄王，頃襄王怒而遷之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Prime Minister Zi Lan heard greatly angered, finally made Chamberlain Shangguan slander Qu Yuan to King Qingxiang, King Qingxiang angered banished him.",
              "idiomatic": "Prime Minister Zi Lan heard this and was greatly angered. He finally had Chamberlain Shangguan slander Qu Yuan to King Qingxiang. King Qingxiang was angered and banished him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Prime Minister Zi Lan heard of it greatly angered, ultimately had Grand Chamberlain slander Qu Yuan to King Qingxiang. King Qingxiang angered and banished him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "屈原至於江濱，被髪行吟澤畔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Yuan arrived at Jiang shore, disheveled hair walking reciting marsh side.",
              "idiomatic": "Qu Yuan arrived at the Jiang shore, disheveled hair, walking and reciting by the marsh side."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "顏色憔悴，形容枯槁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Color haggard, appearance withered.",
              "idiomatic": "His color was haggard, his appearance withered."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "漁父見而問之曰：「子非三閭大夫歟？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fisherman saw asked him said: 'You not San Lu official?",
              "idiomatic": "A fisherman saw him and asked, saying: 'Are you not the San Lu official?"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "何故而至此？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Why come to this?'",
              "idiomatic": "Why have you come to this?'"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "屈原曰：「舉世混濁而我獨清，眾人皆醉而我獨醒，是以見放。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Yuan said: 'Whole world turbid yet I alone clear, everyone drunk yet I alone sober, therefore banished.'",
              "idiomatic": "Qu Yuan said: 'The whole world is turbid yet I alone am clear, everyone is drunk yet I alone am sober. Therefore I have been banished.'"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "漁父曰：「夫聖人者，不凝滯於物而能與世推移。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fisherman said: 'Sage people not congealed stagnant in things can shift with world.",
              "idiomatic": "The fisherman said: 'Sage people are not congealed and stagnant in things but can shift with the world."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "舉世混濁，何不隨其流而揚其波？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Whole world turbid, why not follow its flow raise its waves?",
              "idiomatic": "The whole world is turbid. Why not follow its flow and raise its waves?"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "眾人皆醉，何不餔其糟而啜其醨？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Everyone drunk, why not eat its dregs drink its thin wine?",
              "idiomatic": "Everyone is drunk. Why not eat its dregs and drink its thin wine?"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "何故懷瑾握瑜而自令見放為？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Why hold jade embrace purity yet self make see banished?'",
              "idiomatic": "Why hold jade and embrace purity, yet make yourself banished?'"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "屈原曰：「吾聞之，新沐者必彈冠，新浴者必振衣，人又誰能以身之察察，受物之汶汶者乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Yuan said: 'I heard, newly bathed must flick cap, newly washed must shake clothes, who can with body clean, receive things dirty!",
              "idiomatic": "Qu Yuan said: 'I have heard that newly bathed must flick the cap, newly washed must shake the clothes. Who can with a clean body receive dirty things!'"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "寧赴常流而葬乎江魚腹中耳，又安能以皓皓之白而蒙世俗之溫蠖乎！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rather go constant flow bury Jiang fish belly, how can with bright white covered world dust!'",
              "idiomatic": "Rather go to the constant flow and bury in the Jiang fish belly. How can I with bright white be covered by the world's dust!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Yuan reached the Jiang River shore, disheveled wandering reciting by the marsh. Complexion haggard, form withered. Fisherman saw and asked him: 'Are you not the San Lu official? Why have you come to this?' Qu Yuan said: 'The whole world is muddy yet I alone am clear, everyone is drunk yet I alone am sober, thus I am banished.' Fisherman said: 'Sages do not congeal in things and can shift with the age. Whole world muddy, why not follow the current and raise its waves? Everyone drunk, why not drink the dregs and sip the thin wine? Why embrace jade and hold pearl yet make yourself banished?' Qu Yuan said: 'I have heard, newly washed must dust the cap, newly bathed must shake the clothes. Moreover who can with body's purity receive things' defilement? Rather enter the constant current and be buried in the Jiang fish belly, how can I with gleaming white submit to the world's dust and filth!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0080",
          "zh": "乃作懷沙之賦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then composed Huai Sha assignment.",
              "idiomatic": "Then he composed the 'Huai Sha' rhapsody."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "其辭曰：",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its words said:",
              "idiomatic": "Its words said:"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus composed 'Huai Sha' rhapsody. Its words say:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "陶陶孟夏兮，草木莽莽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bustling mid-summer, vegetation lush.",
              "idiomatic": "Bustling mid-summer, vegetation lush."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "傷懷永哀兮，汩徂南土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wounded heart eternal sorrow, rushing to southern land.",
              "idiomatic": "Wounded heart eternal sorrow, rushing to southern land."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "眴兮窈窈，孔靜幽墨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dazzling deep dark, greatly quiet mysterious dark.",
              "idiomatic": "Dazzling deep dark, greatly quiet mysterious dark."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "冤結紆軫兮，離愍之長鞠；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grievance knotted twisted pained, separated pity long drawn out;",
              "idiomatic": "Grievance knotted twisted pained, separated pity long drawn out;"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "撫情效志兮，俛詘以自抑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Caress feelings follow will, bow bend self restrain.",
              "idiomatic": "Caress feelings follow will, bow bend self restrain."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Bright fifth month, plants and trees dense. Wounded heart eternal sorrow, hastening to southern lands. Gazing deep dark, extremely quiet secluded dark. Grievance knotted twisting pained, sorrow's long suffering; Caressing feelings examining ambition, bending to restrain oneself.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0087",
          "zh": "刓方以為圜兮，常度未替；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Blunt square make round, constant measure not changed;",
              "idiomatic": "Blunt square make round, constant measure not changed;"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "易初本由兮，君子所鄙。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Change beginning follow by, gentleman despised.",
              "idiomatic": "Change beginning follow by, gentleman despised."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "章畫職墨兮，前度未改；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Clear markings duty ink, previous measure not changed;",
              "idiomatic": "Clear markings duty ink, previous measure not changed;"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "內直質重兮，大人所盛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Inner straight quality heavy, great man esteemed.",
              "idiomatic": "Inner straight quality heavy, great man esteemed."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "巧匠不斲兮，孰察其揆正？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Skillful craftsman not chisel, who discerns its standard correctness?",
              "idiomatic": "Skillful craftsman not chisel, who discerns its standard correctness?"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "玄文幽處兮，矇謂之不章；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dark writings hidden place, blind call not clear;",
              "idiomatic": "Dark writings in hidden places - the blind call them unclear;"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "離婁微睇兮，瞽以為無明。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Lou slight glance, blind consider no sight.",
              "idiomatic": "Li Lou's sharp gaze - the blind think it has no clarity."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "變白而為黑兮，倒上以為下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Change white become black, invert upper become lower.",
              "idiomatic": "They turn white into black, invert what is above into below."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "鳳皇在笯兮，雞雉翔舞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Phoenix in cage, chickens pheasants fly dance.",
              "idiomatic": "The phoenix is caged, while chickens and pheasants fly and dance."
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "同糅玉石兮，一而相量。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mix jade stone together, one yet measure each other.",
              "idiomatic": "Jade and stone are mixed together, yet treated as equals."
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "夫黨人之鄙妒兮，羌不知吾所臧。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That faction people base jealousy, utterly not know my treasures.",
              "idiomatic": "Those faction people with their base jealousy utterly fail to know my treasures."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Rounding square to make round, constant measure unchanged; Changing beginning following precedent, gentleman despises. Pattern drawing using ink, previous measure unchanged; Inner straight substantial heavy, great man values. Skilled artisan not hews, who examines its standard correctness? Dark patterns hidden place, blind calls it not bright; Li Lou subtle gaze, blind considers it no sight. Changing white to black, inverting top to bottom. Phoenix in cage, chickens fly dance. Mixing jade stone together, same yet compared. Faction men's base jealousy, utterly unknown my treasure.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0098",
          "zh": "任重載盛兮，陷滯而不濟；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bear heavy load full load, trapped stuck not cross;",
              "idiomatic": "I bear heavy burdens and full loads, trapped and stuck without crossing;"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "懷瑾握瑜兮，窮不得余所示。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hold jade embrace purity, poor not get I show.",
              "idiomatic": "I hold jade and embrace purity, yet in poverty cannot show what I have."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "邑犬群吠兮，吠所怪也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Village dogs pack bark, bark what strange;",
              "idiomatic": "The village dogs bark in packs at what they find strange;"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "誹駿疑桀兮，固庸態也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Slander excellent suspect Jie, originally common attitude.",
              "idiomatic": "They slander the excellent and suspect Jie - this is truly the common attitude."
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "文質疏內兮，眾不知吾之異采；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Culture substance coarse inner, crowd not know my different colors;",
              "idiomatic": "My culture and substance are coarse within, the crowd does not know my distinctive colors;"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "材樸委積兮，莫知余之所有。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Timber simple piled up, none know I have.",
              "idiomatic": "My simple timber is piled up, none know what I possess."
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "重仁襲義兮，謹厚以為豐；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Heavy benevolence layer righteousness, careful thick as abundance;",
              "idiomatic": "I layer benevolence upon benevolence, careful and thick as abundance;"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "重華不可牾兮，孰知余之從容！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chong Hua cannot oppose, who knows my composed!",
              "idiomatic": "Chong Hua cannot be opposed, who knows my composed demeanor!"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "迸固有不并兮，豈知其故也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Burst solid have not together, how know its reason?",
              "idiomatic": "Though firm and solid, they do not unite - how can one know the reason?"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "湯禹久遠兮，邈不可慕也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tang Yu distant, remote cannot admire.",
              "idiomatic": "Tang and Yu are distant, remote and cannot be admired."
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "懲違改忿兮，抑心而自彊；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Punish violation change anger, repress heart self strengthen;",
              "idiomatic": "Punish violations and change anger, repress the heart and strengthen oneself;"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "離湣而不遷兮，願志之有象。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Separated pity not move, wish ambition have image.",
              "idiomatic": "Separated in pity yet not moving, I wish my ambition to have an image."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "進路北次兮，日昧昧其將暮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Advance road north lodge, day dim its will dusk;",
              "idiomatic": "Advance on the road and lodge in the north, the day grows dim and will soon be dusk;"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "含憂虞哀兮，限之以大故。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Contain worry fear sorrow, limited by great matter.",
              "idiomatic": "Contain worry and fear sorrow, limited by the great matter."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Bearing heavy carrying full, sinking stuck not crossing; Embracing jade holding pearl, destitute cannot show to others. City dogs pack barking, barking what they consider strange; Slandering steeds doubting Jie, originally common attitude. Literary quality sparse inner, crowd unknown my different colors; Talents unhewn accumulated, none know my possessions. Repeated benevolence repeated righteousness, careful substantial as abundance; Repeated Hua cannot oppose, who knows my ease! Banished firmly not together, how know its reason? Tang Yu long distant, far cannot admire. Punished violation changed anger, suppressed heart self-strengthened; Departed sorrow not moved, wished ambition have model. Advanced road north lodged, day dim dim will evening; Contained worry feared sorrow, limited by great cause.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0112",
          "zh": "亂曰：浩浩沅、湘兮，分流汨兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chaos says: Vast Yuan Xiang, divide flow Mi.",
              "idiomatic": "The concluding verses say: Vast are the Yuan and Xiang rivers, their divided flows rush on."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "修路幽拂兮，道遠忽兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Long road dark brush, way far suddenly.",
              "idiomatic": "The long road is dark and brushed, the way far and sudden."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "曾唫恒悲兮，永嘆慨兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Increasing sigh constant sorrow, eternal sigh indignant.",
              "idiomatic": "Increasing sighs and constant sorrow, eternal sighs of indignation."
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "世既莫吾知兮，人心不可謂兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "World already none know me, human heart cannot predict.",
              "idiomatic": "The world already knows none of me, human hearts cannot be predicted."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "懷情抱質兮，獨無匹兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Embrace feelings hold quality, alone without match.",
              "idiomatic": "I embrace feelings and hold quality, alone without a match."
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "伯樂既歿兮，驥將焉程兮？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bo Le already dead, steed where appraise?",
              "idiomatic": "Bo Le is already dead, where will the steed be appraised?"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "人生稟命兮，各有所錯兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Human life receive fate, each has placement.",
              "idiomatic": "Human life receives fate, each has its placement."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "定心廣志，餘何畏懼兮？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Settle heart broaden ambition, I what fear?",
              "idiomatic": "I settle my heart and broaden my ambition, what do I have to fear?"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "曾傷爰哀，永嘆喟兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Increasingly wounded beloved sorrow, eternal sigh indignant.",
              "idiomatic": "Increasingly wounded and beloved in sorrow, eternal sighs of indignation."
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "世溷不吾知，心不可謂兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "World turbid not know me, heart cannot predict.",
              "idiomatic": "The world is turbid and does not know me, hearts cannot be predicted."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "知死不可讓兮，願勿愛兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Know death cannot yield, wish not love.",
              "idiomatic": "I know death cannot be yielded, I wish you not to love it."
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "明以告君子兮，吾將以為類兮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Clearly tell gentlemen, I will take as example.",
              "idiomatic": "I clearly tell the gentlemen, I will take this as an example."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Chaos says: Vast Yuan Xiang, divided flow Mi. Long road secluded brushed, way far sudden. Layer sighed constant sorrow, eternal sighed grieved. Age already none know me, human heart cannot speak. Embrace feelings hold quality, alone without match. Bo Le already dead, steed where appraise? Human life receives fate, each has placement. Fixed heart broad ambition, I what fear? Layer injured loved sorrow, eternal sighed grieved. Age muddy not know me, heart cannot speak. Know death cannot yield, wish not cherish. Clearly tell gentleman, I will take as example.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0124",
          "zh": "於是懷石遂自（投）［沈］汨羅以死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then embrace stone then self drown Miluo to die.",
              "idiomatic": "Then embracing a stone, he drowned himself in the Miluo River to die."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus embracing stone self-drowned Mi Luo to die.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "屈原既死之後，楚有宋玉、唐勒、景差之徒者，皆好辭而以賦見稱；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qu Yuan already died after, Chu had Song Yu, Tang Le, Jing Chai and others, all good rhetoric and with rhapsodies seen praised;",
              "idiomatic": "After Qu Yuan died, Chu had Song Yu, Tang Le, Jing Chai and others, all skilled in rhetoric and famous for their rhapsodies;"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "然皆祖屈原之從容辭令，終莫敢直諫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet all followed Qu Yuan composed rhetoric, finally none dared direct admonish.",
              "idiomatic": "Yet they all followed Qu Yuan's composed rhetoric, but finally none dared to directly admonish."
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "其後楚日以削，數十年竟為秦所滅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After this Chu day by day diminished, several decades finally by Qin destroyed.",
              "idiomatic": "After this, Chu diminished day by day, and after several decades was finally destroyed by Qin."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qu Yuan having died after, Chu had Song Yu, Tang Le, Jing Chai and others, all good at rhetoric and famous for rhapsodies; Yet all followed Qu Yuan's ease and rhetoric, ultimately dared not directly remonstrate. Afterward Chu daily diminished, several decades ultimately destroyed by Qin.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0128",
          "zh": "自屈原沈汨羅後百有餘年，漢有賈生，為長沙王太傅，過湘水，投書以弔屈原。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From Qu Yuan drowned Miluo after hundred plus years, Han had Jia Sheng, was Changsha King Taifu, crossed Xiang water, cast letter to lament Qu Yuan.",
              "idiomatic": "Over a hundred years after Qu Yuan drowned in the Miluo, Han had Jia Sheng, who was Taifu to the King of Changsha. Crossing the Xiang River, he cast a letter to lament Qu Yuan."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "From Qu Yuan drowning Mi Luo after hundred plus years, Han had Jia Sheng, as Changsha King tutor, passed Xiang water, cast letter to mourn Qu Yuan.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "賈生名誼，雒陽人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jia Sheng named Yi, Luoyang person.",
              "idiomatic": "Jia Sheng was named Yi, a native of Luoyang."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "年十八，以能誦詩屬書聞於郡中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Age eighteen, able recite poetry compose writings famous in commandery.",
              "idiomatic": "At age eighteen, he became famous in the commandery for being able to recite poetry and compose writings."
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "吳廷尉為河南守，聞其秀才，召置門下，甚幸愛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wu廷尉 as Henan governor, heard his talent, summoned place gate, greatly favored loved.",
              "idiomatic": "Wu the Superintendent of Trials was governor of Henan. Hearing of his talent, he summoned him and placed him at his gate, greatly favoring and loving him."
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "孝文皇帝初立，聞河南守吳公治平為天下第一，故與李斯同邑而常學事焉，乃徵為廷尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Filial Wen Emperor initially established, heard Henan governor Wu Gong governance peaceful first in world, thus with Li Si same town often studied matters, then summoned as廷尉.",
              "idiomatic": "When Emperor Wen first ascended the throne, he heard that Henan governor Wu Gong's governance was the most peaceful in the world. Since Wu Gong was from the same town as Li Si and had often studied matters with him, he summoned him to be Superintendent of Trials."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "廷尉乃言賈生年少，頗通諸子百家之書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "廷尉 then said Jia Sheng young, quite versed various philosophers hundred schools books.",
              "idiomatic": "The Superintendent of Trials then said that Jia Sheng was young but quite versed in the books of various philosophers and the hundred schools."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "文帝召以為博士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wen Emperor summoned as erudite.",
              "idiomatic": "Emperor Wen summoned him to be an erudite."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Jia Sheng named Yi, Luoyang person. Age eighteen, with ability to recite poetry and books famous in commandery. Wu Court Scribe as Henan governor, heard his outstanding talent, summoned to place under gate, greatly favored loved. Filial Wen emperor initially ascended, heard Henan governor Wu Gong governed peacefully as world first, thus with Li Si same district and often studied affairs from him, thus summoned as Court Scribe. Court Scribe then spoke Jia Sheng young, quite versed in hundred schools books. Wen emperor summoned as erudite.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "是時賈生年二十餘，最為少。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time Jia Sheng age twenty plus, most young.",
              "idiomatic": "At this time Jia Sheng was over twenty years old, the youngest among them."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "每詔令議下，諸老先生不能言，賈生盡為之對，人人各如其意所欲出。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Every time edicts discussions sent down, various old masters could not speak, Jia Sheng completely answered for them, everyone each as their intention wished out.",
              "idiomatic": "Every time edicts and discussions were sent down, the various old masters could not speak. Jia Sheng completely answered for them, with everyone speaking as their intentions wished."
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "諸生於是乃以為能，不及也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various scholars then considered him able, not inferior.",
              "idiomatic": "The various scholars then considered him able, not inferior."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "孝文帝說之，超遷，一歲中至太中大夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Filial Wen Emperor pleased, promoted extraordinarily, one year to Grand Palace Grandee.",
              "idiomatic": "Emperor Wen was pleased and promoted him extraordinarily. In one year he reached the position of Grand Palace Grandee."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "At this time Jia Sheng age twenty plus, was youngest. Every time edicts and commands issued for discussion, various old masters could not speak, Jia Sheng completely responded to them, each person as their intent desired. Various scholars then considered him able, could not match. Filial Wen emperor pleased, promoted extraordinarily, one year to Grand Palace Grandee.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0139",
          "zh": "賈生以為漢興至孝文二十餘年，天下和洽，而固當改正朔，易服色，法制度，定官名，興禮樂，乃悉草具其事儀法，色尚黃，數用五，為官名，悉更秦之法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jia Sheng thought Han rise to Filial Wen twenty plus years, world peaceful harmonious, should change calendar, change colors, establish laws systems, fix official names, promote rites music, then completely drafted all matters ceremonies laws, color esteem yellow, number use five, for official names, completely changed Qin laws.",
              "idiomatic": "Jia Sheng thought that since the Han rise to Emperor Wen's reign of over twenty years, the world was peaceful and harmonious, they should change the calendar, change the colors, establish laws and systems, fix official names, and promote rites and music. He completely drafted all the matters, ceremonies, and laws, with yellow as the esteemed color, using five as the number, and completely changed Qin's laws for the official names."
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "孝文帝初即位，謙讓未遑也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Filial Wen Emperor initially ascended, modest yielding not leisure.",
              "idiomatic": "When Emperor Wen first ascended the throne, he was modest and yielding, with no leisure for it."
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "諸律令所更定，及列侯悉就國，其說皆自賈生發之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various statutes orders what changed fixed, and marquises all go to states, these theories all from Jia Sheng originated.",
              "idiomatic": "The various statutes and orders that were changed and fixed, as well as the marquises all going to their states, these ideas all originated from Jia Sheng."
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "於是天子議以為賈生任公卿之位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then emperor discussed make Jia Sheng assume duke ministers position.",
              "idiomatic": "Then the emperor discussed making Jia Sheng assume the position of duke or minister."
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "絳、灌、東陽侯、馮敬之屬盡害之，乃短賈生曰：「雒陽之人，年少初學，專欲擅權，紛亂諸事。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jiang, Guan, Dongyang Hou, Feng Jing and others all harmed him, then slandered Jia Sheng said: 'Luoyang person, young just studied, monopolize want seize power, confuse various matters.'",
              "idiomatic": "Zhou Bo, Guan Ying, the Marquis of Dongyang, Feng Jing and others all harmed him. They then slandered Jia Sheng, saying: 'This man from Luoyang is young and just studied. He wants to monopolize and seize power, confusing various matters.'"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "於是天子後亦疏之，不用其議，乃以賈生為長沙王太傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then emperor afterward also distanced him, not used his proposals, then made Jia Sheng Changsha King Taifu.",
              "idiomatic": "Then the emperor afterward also distanced him and did not use his proposals. He made Jia Sheng the Taifu to the King of Changsha."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Jia Sheng considered Han rise to Filial Wen twenty plus years, world peaceful harmonious, yet should correct calendar, change clothing colors, establish laws systems, determine official names, promote rites music. Thus completely drafted all affair ceremonies laws, color honored yellow, number used five, for official names, completely changed Qin's laws. Filial Wen emperor initially ascended, modest yielding not yet had time. Various statutes commands newly determined, and marquises all went to fiefs, these theories all originated from Jia Sheng. Thus Son of Heaven discussed appointing Jia Sheng to duke minister position. Jiang, Guan, Dongyang Marquis, Feng Jing and others all harmed him, thus slandered Jia Sheng saying: 'Luoyang person, young beginner scholar, specially wishes to monopolize power, disorder various affairs.' Thus Son of Heaven afterward also distanced him, did not use his proposals, appointed Jia Sheng as Changsha King tutor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0145",
          "zh": "賈生既辭往行，聞長沙卑溼，自以壽不得長，又以適去，意不自得。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jia Sheng already declined went, heard Changsha low wet, self thought longevity not long, moreover banished went, intention not self satisfied.",
              "idiomatic": "Jia Sheng had already declined and gone. Hearing that Changsha was low and wet, he thought his life would not be long. Moreover, being banished, his intention was not self-satisfied."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "及渡湘水，為賦以弔屈原。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When crossed Xiang water, made rhapsody to lament Qu Yuan.",
              "idiomatic": "When he crossed the Xiang River, he composed a rhapsody to lament Qu Yuan."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "其辭曰：",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its words said:",
              "idiomatic": "Its words said:"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Jia Sheng having declined went traveling, heard Changsha low wet, self-considered lifespan could not be long, moreover departing capital, intent not self-satisfied. When crossing Xiang water, composed rhapsody to mourn Qu Yuan. Its words say:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "共承嘉惠兮，俟罪長沙。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Together receive fine favor, await crime Changsha.",
              "idiomatic": "Together I receive fine favor, awaiting my crime in Changsha."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "側聞屈原兮，自沈汨羅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Side heard Qu Yuan, self drowned Miluo.",
              "idiomatic": "I have heard from the side about Qu Yuan, who drowned himself in the Miluo."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "造託湘流兮，敬弔先生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Created entrusted Xiang flow, respectfully lament master.",
              "idiomatic": "I created and entrusted it to the Xiang flow, respectfully lamenting the master."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "遭世罔極兮，乃隕厥身。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Encountered world without standard, then fell his body.",
              "idiomatic": "He encountered a world without standards, and thus fell his body."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "嗚呼哀哉，逢時不祥！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Alas sorrowful, met untimely time!",
              "idiomatic": "Alas, how sorrowful! He met an untimely time!"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "鸞鳳伏竄兮，鴟梟翺翔：闒茸尊顯兮，讒諛得志；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Luan phoenix hide conceal, owl kite fly soar: base people honored exalted, slander flatterers get ambition;",
              "idiomatic": "The luan and phoenix hide and conceal themselves, while owls and kites fly and soar. Base people are honored and exalted, while slanderers and flatterers achieve their ambitions;"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "賢聖逆曳兮，方正倒植。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Worthy sages dragged backward, upright square inverted planted.",
              "idiomatic": "Worthy sages are dragged backward, upright and square are inverted and planted."
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "世謂伯夷貪兮，謂盜跖廉；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "World calls Bo Yi greedy, calls Dao Zhi frugal;",
              "idiomatic": "The world calls Bo Yi greedy, calls Dao Zhi frugal;"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "莫邪為頓兮，鉛刀為铦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mo Ye made blunt, lead knife made sharp.",
              "idiomatic": "Mo Ye is made blunt, the lead knife is made sharp."
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "于嗟嚜嚜兮，生之無故！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Alas dark dark, life without reason!",
              "idiomatic": "Alas, how dark and dim! Life without reason!"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "斡棄周鼎兮寶康瓠，騰駕罷牛兮驂蹇驢，驥垂兩耳兮服鹽車。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Swirled abandoned Zhou tripod treasured calabash, mounted drove exhausted ox hitched lame donkey, steed hung two ears yoked salt cart.",
              "idiomatic": "They swirled and abandoned the Zhou tripod, treasuring the calabash. They mounted and drove exhausted oxen, hitched lame donkeys. The steed hung its two ears, yoked to the salt cart."
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "章甫薦屨兮，漸不可久；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhang Fu presented shoe, gradually cannot last;",
              "idiomatic": "The Zhang Fu is presented as shoes - gradually it cannot last;"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "嗟苦先生兮，獨離此咎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Alas bitter master, alone separated this blame!",
              "idiomatic": "Alas, how bitter, Master! Alone separated from this blame!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Together receive fine favor, await guilt Changsha. Side heard Qu Yuan, self-drowned Mi Luo. Made entrusted Xiang current, respectfully mourn master. Encountered age without extreme, thus fell his person. Alas sorrowful, encountered age inauspicious! Luan phoenix crouch hide, owl kite soar fly: despicable honored eminent, slanders obtain ambition; Worthy sages dragged backward, upright overturned planted. Age calls Bo Yi greedy, calls Dao Zhi honest; Mo Ye made blunt, lead knife made sharp. Alas dark dark, life without reason! Turned abandoned Zhou tripod treasured marrow gourd, galloped drove exhausted ox hitched lame donkey, steed drooped two ears harnessed salt cart. Ceremonial cap recommended shoes, gradually cannot last; Alas bitter master, alone separate this blame!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0161",
          "zh": "訊曰：已矣，國其莫我知，獨堙郁兮其誰語？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Message says: Finished, state none know me, alone choked pent up who speak to?",
              "idiomatic": "The message says: It is finished. The state knows none of me. Alone choked and pent up - to whom can I speak?"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "鳳漂漂其高遰兮，夫固自縮而遠去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Phoenix floats floats its high far, husband indeed self contracted far gone.",
              "idiomatic": "The phoenix floats and floats, high and far away. Indeed, it has contracted itself and gone far."
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "襲九淵之神龍兮，沕深潛以自珍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Followed nine abysses divine dragon, swam deep hidden self treasure.",
              "idiomatic": "Following the divine dragon of the nine abysses, swimming deep and hidden to treasure oneself."
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "彌融爚以隱處兮，夫豈從螘與蛭螾？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Widely melted bright hidden place, husband how follow ants leeches worms?",
              "idiomatic": "Widely melted and bright in hidden places - how could it follow ants, leeches, and worms?"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "所貴聖人之神德兮，遠濁世而自藏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "What valued sage man divine virtue, far turbid world self hide.",
              "idiomatic": "What is valued is the sage's divine virtue - far from the turbid world, hiding oneself."
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "使騏驥可得系羈兮，豈云異夫犬羊！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Make steed can get tied restrained, how say different from dogs sheep!",
              "idiomatic": "If the steed can be gotten and tied and restrained, how is it said to be different from dogs and sheep!"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "般紛紛其離此尤兮，亦夫子之辜也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Generally confused left this blame, also master guilt!",
              "idiomatic": "Generally confused, they leave this blame - it is also the master's guilt!"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "瞝九州而相君兮，何必懷此都也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Look nine provinces choose lord, why must cherish this capital?",
              "idiomatic": "Looking at the nine provinces to choose a lord, why must one cherish this capital?"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "鳳皇翔于千仞之上兮，覽德惪而下之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Phoenix soars thousand ren above, views virtue solid descend it;",
              "idiomatic": "The phoenix soars above a thousand ren, views virtue solid and descends to it;"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "見細德之險（微）［徵］兮，搖增翮逝而去之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "See small virtue danger omen, shake increase wings departed gone.",
              "idiomatic": "Seeing the danger omens of small virtue, it shakes its increased wings and departs, gone."
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "彼尋常之汙瀆兮，豈能容吞舟之魚！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That ordinary dirty ditch, how can contain swallow boat fish!",
              "idiomatic": "That ordinary dirty ditch - how can it contain fish that swallow boats!"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "橫江湖之鱣鱏兮，固將制於蟻螻。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Horizontal rivers lakes sturgeon, indeed will controlled by ants mole crickets.",
              "idiomatic": "The sturgeons that cross rivers and lakes will indeed be controlled by ants and mole crickets."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Message says: Finished, state none know me, alone stifled depressed who speak? Phoenix drifting high far, indeed self-shrink far go. Follow nine abysses divine dragon, deep submerged self-treasure. Profoundly hidden concealed place, how follow ants leeches? Valued sages divine virtue, far muddy age self-hide. Make qi ji can obtain tied restrained, how different from dogs sheep! Various confused depart this fault, also master's guilt! Look nine provinces mutually lord, why must cherish this capital? Phoenix soars thousand ren above, views virtue solid descend; Sees petty virtue dangerous signs, shakes increased feathers departed gone. That common filth ditch, how can contain swallow boat fish! Horizontal rivers lakes giant fish, indeed will controlled by ants mole crickets.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0173",
          "zh": "賈生為長沙王太傅三年，有鸮飛入賈生舍，止于坐隅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jia Sheng was Changsha King Taifu three years, had owl fly enter Jia Sheng dwelling, stopped at seat corner.",
              "idiomatic": "Jia Sheng served as Taifu to the King of Changsha for three years. An owl flew into Jia Sheng's dwelling and stopped at the corner of the seat."
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "楚人命鸮曰「服」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu people call owl 'Fu'.",
              "idiomatic": "The Chu people call the owl 'Fu'."
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "賈生既以適居長沙，長沙卑溼，自以為壽不得長，傷悼之，乃為賦以自廣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jia Sheng already banished live Changsha, Changsha low wet, self thought longevity not long, wounded mourned it, then made rhapsody self console.",
              "idiomatic": "Jia Sheng, having been banished to live in Changsha, where Changsha was low and wet, thought his life would not be long. He was wounded and mourned it, so he composed a rhapsody to console himself."
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "其辭曰：",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Its words said:",
              "idiomatic": "Its words said:"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Jia Sheng as Changsha King tutor three years, owl flew into Jia Sheng residence, stopped at seat corner. Chu people name owl 'fu'. Jia Sheng since banished dwell Changsha, Changsha low wet, self-considered lifespan could not be long, injured mourned it, thus composed rhapsody self-consolation. Its words say:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0177",
          "zh": "單閼之歲兮，四月孟夏，庚子日施兮，服集予舍，止于坐隅，貌甚閒暇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Single narrow year, fourth month first summer, Gengzi day loose, service gathered my dwelling, stopped at seat corner, appearance very leisurely.",
              "idiomatic": "In the year of Shan Yan, fourth month, first summer, Gengzi day, Fu gathered at my dwelling, stopped at the seat corner, its appearance very leisurely."
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "異物來集兮，私怪其故，發書占之兮，筴言其度。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Strange thing come gather, privately strange its reason, sent book divine it, bamboo spoke its measure.",
              "idiomatic": "A strange thing came and gathered. Privately I was strange about its reason. I sent a book to divine it, and the bamboo spoke its measure."
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "曰「野鳥入處兮，主人將去」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Said 'wild bird enter dwelling, master will go'.",
              "idiomatic": "It said: 'A wild bird enters the dwelling - the master will go.'"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "請問于服兮：「予去何之？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Please ask Fu: 'I go where?",
              "idiomatic": "I ask Fu: 'Where will I go?'"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "吉乎告我，凶言其菑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Auspicious tell me, inauspicious speak its calamity.",
              "idiomatic": "If auspicious, tell me; if inauspicious, speak of its calamity."
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "淹數之度兮，語予其期。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Soak several measure, tell me its time.",
              "idiomatic": "Tell me the measure of its span, tell me its time."
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "服乃嘆息，舉首奮翼，口不能言，請對以意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fu then sighed, raised head shook wings, mouth cannot speak, please respond with intention.",
              "idiomatic": "Fu then sighed, raised its head and shook its wings. Its mouth could not speak, so it responded with intention."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Single gate year, fourth month first summer, geng zi day si, fu gathered my residence, stopped at seat corner, appearance very leisurely. Strange thing come gathered, privately strange its reason, opened book divined it, tally spoke its measure. Said 'wild bird enter dwelling, master will depart'. Request ask fu: 'I depart where go? Auspicious tell me, inauspicious speak its calamity. Dwell number measure, tell me its time.' Fu then sighed, raised head shook wings, mouth cannot speak, requested respond with intention.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0184",
          "zh": "萬物變化兮，固無休息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Myriad things change, indeed no rest.",
              "idiomatic": "The myriad things change - indeed there is no rest."
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "斡流而遷兮，或推而還。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rotate flow migrate, or push return.",
              "idiomatic": "They rotate and flow, migrating; or are pushed and return."
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "形氣轉續兮，變化而嬗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Form qi transfer continue, change transform.",
              "idiomatic": "Form and qi transfer and continue, changing and transforming."
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "沕穆無窮兮，胡可勝言！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Swim silent no end, how can exhaust speak!",
              "idiomatic": "Swimming silently without end - how can one exhaust speaking of it!"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "禍兮福所倚，福兮禍所伏；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Calamity fortune depend on each other, fortune calamity lie hidden;",
              "idiomatic": "Calamity is what fortune depends on, fortune is what calamity lies hidden in;"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "憂喜聚門兮，吉凶同域。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Worry joy gather gate, auspicious inauspicious same region.",
              "idiomatic": "Worry and joy gather at the gate, auspicious and inauspicious are in the same region."
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "彼吳彊大兮，夫差以敗；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That Wu strong great, Fu Chai with defeat;",
              "idiomatic": "That Wu was strong and great, yet Fu Chai suffered defeat;"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "越棲會稽兮，句踐霸世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yue dwell Kuaiji, Gou Jian hegemon world.",
              "idiomatic": "Yue dwelt at Kuaiji, yet Gou Jian became hegemon of the world."
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "斯游遂成兮，卒被五刑；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Si You finally succeed, finally received five punishments;",
              "idiomatic": "Si You finally succeeded, yet finally received the five punishments;"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "傅說胥靡兮，乃相武丁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fu Yue slave labor, then became minister Wu Ding.",
              "idiomatic": "Fu Yue was in slave labor, yet then became minister to Wu Ding."
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "夫禍之與福兮，何異糾纆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That calamity and fortune, what different twisted rope.",
              "idiomatic": "As for calamity and fortune, what difference is there from a twisted rope?"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "命不可說兮，孰知其極？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fate cannot explain, who knows its limit?",
              "idiomatic": "Fate cannot be explained - who knows its limit?"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "水激則旱兮，矢激則遠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Water pressed then shoots high, arrow pressed then goes far.",
              "idiomatic": "Water, when pressed, shoots high; arrows, when pressed, go far."
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "萬物回薄兮，振蕩相轉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Myriad things return press, shake sway transfer each other.",
              "idiomatic": "The myriad things return and press, shaking and swaying, transferring each other."
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "雲蒸雨降兮，錯繆相紛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Cloud steam rain fall, wrong error mix confused.",
              "idiomatic": "Clouds steam and rain falls, wrong and erroneous, mixing and confused."
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "大專槃物兮，坱軋無垠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great concentrated encompass things, vast press no border.",
              "idiomatic": "Greatly concentrated, encompassing things, vast and pressing without border."
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "天不可與慮兮，道不可與謀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Heaven cannot with deliberate, way cannot with plan.",
              "idiomatic": "Heaven cannot be deliberated with, the Way cannot be planned with."
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "遲數有命兮，惡識其時？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Slow hasten have fate, how know its time?",
              "idiomatic": "Slow or hasten have fate - how can one know its time?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Myriad things change, indeed no rest. Turn flow migrate, or push return. Form qi transfer continue, change transform. Profound silent no limit, how can exhaust speak! Calamity fortune relies on, fortune calamity hides; Worry joy gather gate, auspicious inauspicious same domain. That Wu strong great, Fu Cha with defeat; Yue dwelt Kui Ji, Gou Jian hegemon world. Si You succeeded, finally suffered five punishments; Fu Yue slave labor, then ministered Wu Ding. Calamity and fortune, what different rope tangle. Fate cannot explain, who knows its extreme? Water shoots then dry, arrow shoots then far. Myriad things turn press, shake move mutually transfer. Cloud steams rain descends, wrong error mutually confused. Great specialized turns things, vast presses no border. Heaven cannot with deliberate, way cannot with plan. Slow number has fate, evil know its time?",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0202",
          "zh": "且夫天地為鑪兮，造化為工；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover heaven earth furnace, creation worker;",
              "idiomatic": "Moreover, heaven and earth are the furnace, creation is the worker;"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "陰陽為炭兮，萬物為銅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yin yang charcoal, myriad things copper.",
              "idiomatic": "Yin and yang are the charcoal, the myriad things are the copper."
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "合散消息兮，安有常則；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Combine disperse grow decline, how have constant rule;",
              "idiomatic": "Combining and dispersing, growing and declining - how can there be constant rules?"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "千變萬化兮，未始有極。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thousand change ten thousand transform, never have limit.",
              "idiomatic": "A thousand changes and ten thousand transformations - they never have a limit."
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "忽然為人兮，何足控摶；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Suddenly become person, what sufficient hold grasp;",
              "idiomatic": "Suddenly becoming a person - what is sufficient to hold and grasp?"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "化為異物兮，又何足患！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Transform become different thing, again what sufficient worry!",
              "idiomatic": "Transforming into a different thing - again, what is sufficient to worry about!"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "小知自私兮，賤彼貴我；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Small knowledge self private, despise that value I;",
              "idiomatic": "Small knowledge is selfish, despising that and valuing self;"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "通人大觀兮，物無不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Penetrating great person view, things none not can.",
              "idiomatic": "The penetrating great person's view - there is nothing that cannot be."
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "貪夫徇財兮，烈士徇名；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Greedy man follow wealth, fierce knight follow name;",
              "idiomatic": "The greedy man follows wealth, the fierce knight follows name;"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "夸者死權兮，品庶馮生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Boaster die power, common people rely life.",
              "idiomatic": "The boaster dies for power, the common people rely on life."
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "述迫之徒兮，或趨西東；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "State urge crowd, or hasten west east;",
              "idiomatic": "The crowd urged by circumstances hasten west or east;"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "大人不曲兮，億變齊同。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great person not bend, hundred million change same same.",
              "idiomatic": "The great person does not bend, treating a hundred million changes as the same."
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "拘士系俗兮，攌如囚拘；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Constrain knight tie custom, tied like prisoner;",
              "idiomatic": "The constrained knight tied by custom is bound like a prisoner;"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "至人遺物兮，獨與道俱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Perfect person abandon things, alone with way together.",
              "idiomatic": "The perfect person abandons things, alone accompanying the Way."
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "眾人或或兮，好惡積意；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crowd people various, good bad accumulate intention;",
              "idiomatic": "The crowd is various in their likes and dislikes, accumulating intentions;"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "真人淡漠兮，獨與道息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "True person indifferent, alone with way rest.",
              "idiomatic": "The true person is indifferent, alone resting with the Way."
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "釋知遺形兮，超然自喪；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Release knowledge abandon form, transcend self forget;",
              "idiomatic": "Releasing knowledge and abandoning form, transcending and forgetting oneself;"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "寥廓忽荒兮，與道翺翔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Vast suddenly vast, with way soar fly.",
              "idiomatic": "Vast and suddenly vast, soaring and flying with the Way."
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "乘流則逝兮，得坻則止；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ride current then go, get shore then stop;",
              "idiomatic": "Riding the current then departing, reaching shore then stopping;"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "縱軀委命兮，不私與己。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Free body entrust fate, not private with self.",
              "idiomatic": "Freeing the body and entrusting to fate, not being private with oneself."
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "其生若浮兮，其死若休；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "His life like float, his death like rest;",
              "idiomatic": "His life is like floating, his death like resting;"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "澹乎若深淵之靜，氾乎若不系之舟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Indifferent like deep abyss quiet, vast like not tied boat.",
              "idiomatic": "Indifferent like the quiet of a deep abyss, vast like an untethered boat."
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "不以生故自寶兮，養空而浮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Not because life reason self treasure, nurture empty float;",
              "idiomatic": "Not treasuring oneself because of life, nurturing emptiness and floating;"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "德人無累兮，知命不憂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Virtue person no burden, know fate not worry.",
              "idiomatic": "The virtuous person has no burdens, knowing fate without worry."
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "細故遰葪兮，何足以疑！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Small matter far small, what sufficient doubt!",
              "idiomatic": "Small matters are far and small - what is sufficient to doubt!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Moreover heaven earth as furnace, creation as artisan; Yin yang as charcoal, myriad things as copper. Combine disperse wax wane, how have constant rule; Thousand changes ten thousand transformations, not begun have extreme. Suddenly become human, what sufficient control grasp; Transform become different thing, again what sufficient worry! Small knowledge self-private, belittle others value self; Greatly connected great view, things nothing cannot. Greedy man risk wealth, fierce scholars risk name; Boasters die for power, common people rely on life. Urged pressed followers, or hurry west east; Great man not bent, hundred million changes same together. Constrained scholar tied customs, entangled like prisoner restrained; Perfect man abandons things, alone with way together. Crowd confused confused, good evil accumulate intention; True person indifferent indifferent, alone with way rest. Release knowledge abandon form, transcend self-forget; Vast empty sudden wild, with way soar fly. Ride current then go, obtain shore then stop; Release body entrust fate, not private with self. His life like float, his death like rest; Indifferent like deep abyss quiet, broad like untied boat. Not because life self-treasure, nourish emptiness float; Virtue man no burden, know fate not worry. Small matters far distant, what sufficient doubt!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0227",
          "zh": "後歲餘，賈生徵見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "After year plus, Jia Sheng summoned appear.",
              "idiomatic": "After more than a year, Jia Sheng was summoned to appear."
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "孝文帝方受釐，坐宣室。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Filial Wen Emperor just received ceremony, sat Xuanshi.",
              "idiomatic": "Emperor Wen had just completed the ceremonies and was seated in the Xuanshi Hall."
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "上因感鬼神事，而問鬼神之本。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Emperor because sense ghost spirit matters, ask ghost spirit origin.",
              "idiomatic": "The emperor, being moved by matters of ghosts and spirits, asked about the origin of ghosts and spirits."
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "賈生因具道所以然之狀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jia Sheng then completely explain so reason condition.",
              "idiomatic": "Jia Sheng then fully explained the reasons and circumstances."
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "至夜半，文帝前席。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "To midnight, Wen Emperor advance mat.",
              "idiomatic": "Until midnight, Emperor Wen leaned forward on his mat."
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "既罷，曰：「吾久不見賈生，自以為過之，今不及也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "After finished, said: 'I long not see Jia Sheng, self think surpass him, now not equal.'",
              "idiomatic": "After it was finished, he said: 'I have not seen Jia Sheng for a long time. I thought I surpassed him, but now I do not equal him.'"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "居頃之，拜賈生為梁懷王太傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Dwell moment, appoint Jia Sheng Liang Huai King Taifu.",
              "idiomatic": "After a short time, he appointed Jia Sheng as Taifu to King Huai of Liang."
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "梁懷王，文帝之少子，愛，而好書，故令賈生傅之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Liang Huai King, Wen Emperor young son, loved, and good books, therefore make Jia Sheng tutor him.",
              "idiomatic": "King Huai of Liang was Emperor Wen's youngest son, whom he loved and who was fond of books, so he had Jia Sheng tutor him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Later year plus, Jia Sheng summoned seen. Filial Wen emperor just received li, sat Xuanshi. Above thus sensed ghosts spirits affairs, asked ghosts spirits foundation. Jia Sheng thus completely spoke its so condition. To midnight, Wen emperor advanced mat. Having finished, said: 'I long not see Jia Sheng, self-considered surpassed him, now cannot match.' Dwelt moment, appointed Jia Sheng as Liang Huai King tutor. Liang Huai King, Wen emperor young son, loved, and liked books, thus commanded Jia Sheng tutor him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "文帝復封淮南厲王子四人皆為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Wen Emperor again enfeoff four sons of Huainan Li King all as marquises.",
              "idiomatic": "Emperor Wen again enfeoffed four sons of King Li of Huainan, making them all marquises."
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "賈生諫，以為患之興自此起矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jia Sheng admonished, thought calamity rise from this.",
              "idiomatic": "Jia Sheng admonished, thinking that calamity would arise from this."
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "賈生數上疏，言諸侯或連數郡，非古之制，可稍削之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jia Sheng several times submit memorials, speak marquises some connect several commanderies, not ancient system, can gradually reduce them.",
              "idiomatic": "Jia Sheng several times submitted memorials, saying that some marquises connected several commanderies, which was not the ancient system, and they could gradually be reduced."
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "文帝不聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Wen Emperor not listen.",
              "idiomatic": "Emperor Wen did not listen."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Wen emperor again enfeoffed Huainan Li Wang sons four people all as marquises. Jia Sheng advised, considered calamity rise from this. Jia Sheng several times submitted memorials, spoke various marquises connected several commanderies, not ancient system, can gradually reduce them. Wen emperor not listened.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0239",
          "zh": "居數年，懷王騎，墮馬而死，無後。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Dwell several years, Huai King ride horse, fall horse die, no posterity.",
              "idiomatic": "After several years, King Huai was riding a horse, fell from the horse and died, leaving no posterity."
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "賈生自傷為傅無狀，哭泣歲餘，亦死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jia Sheng self blame as tutor without achievement, cry weep year plus, also die.",
              "idiomatic": "Jia Sheng blamed himself for being an unsuccessful tutor, wept for more than a year, and also died."
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "賈生之死時年三十三矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jia Sheng death time age thirty three.",
              "idiomatic": "At the time of Jia Sheng's death, he was thirty-three years old."
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "及孝文崩，孝武皇帝立，舉賈生之孫二人至郡守，而賈嘉最好學，世其家，與余通書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When Filial Wen passed, Filial Wu Emperor established, raise Jia Sheng two grandsons to commandery governors, Jia Jia most good learning, inherit family, with me communicate writings.",
              "idiomatic": "When Emperor Wen passed away and Emperor Wu ascended the throne, he raised two of Jia Sheng's grandsons to the position of commandery governors. Jia Jia was the most studious and inherited the family tradition, communicating with me through writings."
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "至孝昭時，列為九卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "To Filial Zhao time, listed as nine ministers.",
              "idiomatic": "During Emperor Zhao's reign, he was listed among the nine ministers."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Dwelt several years, Huai Wang rode, fell horse died, no posterity. Jia Sheng self-injured as tutor without achievement, wept year plus, also died. Jia Sheng death time age thirty-three. When Filial Wen collapsed, Filial Wu emperor ascended, promoted Jia Sheng grandsons two to commandery governors, Jia Jia most liked learning, inherited family, with me exchanged letters. To Filial Zhao time, listed as nine ministers.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0244",
          "zh": "太史公曰：余讀離騷、天問、招魂、哀郢，悲其志。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Grand Historian said: I read Li Sao, Tian Wen, Zhao Hun, Ai Ying, grieve his ambition.",
              "idiomatic": "The Grand Historian said: I have read 'Li Sao', 'Tian Wen', 'Zhao Hun', and 'Ai Ying', and grieve for his ambition."
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "適長沙，觀屈原所自沈淵，未嘗不垂涕，想見其為人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Went Changsha, view Qu Yuan where self drowned abyss, never not shed tears, imagine see his person.",
              "idiomatic": "When I went to Changsha and viewed the abyss where Qu Yuan drowned himself, I never failed to shed tears, imagining I could see his character."
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "及見賈生弔之，又怪屈原以彼其材，游諸侯，何國不容，而自令若是。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When see Jia Sheng lament him, again strange Qu Yuan with his talent, travel various lords, what country not contain, yet self make like this.",
              "idiomatic": "When I saw Jia Sheng's lament for him, I was again puzzled that Qu Yuan, with his talent, traveling among the various lords, would not be contained by any country, yet made himself like this."
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "讀服烏賦，同死生，輕去就，又爽然自失矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Read Fu Ou assignment, same death life, light leave take, again clearly self lost.",
              "idiomatic": "When I read the 'Fu on the Owl', treating death and life as the same, lightly regarding leaving and taking, I was again clearly lost in self-reflection."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Grand Historian says: I read 'Li Sao', 'Tian Wen', 'Zhao Hun', 'Ai Ying', sorrowful his ambition. Passed Changsha, viewed Qu Yuan self-drowned abyss, never not shed tears, imagined saw his person. When saw Jia Sheng mourn him, again strange Qu Yuan with his talent, traveled feudal lords, what state not contain, yet self made like this. Read 'Fu Niao' rhapsody, same death life, light depart stay, again clearly self-lost.",
          "idiomatic": null
        }
      ]
    }
  ]
}