{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "093",
    "url": "https://chinesenotes.com/shiji/shiji093.html",
    "title": {
      "zh": "韓信盧綰列傳",
      "en": "Biographies of Han Xin (King of Han) and Lu Wan",
      "raw": "《韓信盧綰列傳》Biographies of Han Xin (King of Han) and Lu Wan"
    },
    "sentenceCount": 163,
    "translatedCount": 163,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:20.247Z",
    "translators": [
      {
        "name": "Garrett M. Petersen",
        "paragraphs": 20,
        "sentences": 163
      }
    ],
    "citation": "Translation: Garrett M. Petersen"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "韓王信者，故韓襄王孽孫也，長八尺五寸。",
          "translations": [
            {
              "lang": "en",
              "text": "Han Wang Xin, former Han Xiang Wang bastard grandson, long eight chi five cun.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "及項梁之立楚後懷王也，燕、齊、趙、魏皆已前王，唯韓無有後，故立韓諸公子橫陽君成為韓王，欲以撫定韓故地。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Xiang Liang establish Chu after Huai Wang, Yan, Qi, Zhao, Wei all already before wang, only Han no have after, therefore establish Han various gong zi Heng Yang Jun Cheng become Han Wang, desire with pacify settle Han old land.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "項梁敗死定陶，成奔懷王。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiang Liang defeat die Ding Tao, Cheng flee Huai Wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "沛公引兵擊陽城，使張良以韓司徒降下韓故地，得信，以為韓將，將其兵從沛公入武關。",
          "translations": [
            {
              "lang": "en",
              "text": "Pei Gong lead troops strike Yang Cheng, make Zhang Liang with Han si tu descend Han old land, obtain Xin, become Han jiang, lead his troops follow Pei Gong enter Wu Guan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han Wang Xin, former Han Xiang Wang bastard grandson, long eight chi five cun. Reach Xiang Liang establish Chu after Huai Wang, Yan, Qi, Zhao, Wei all already before wang, only Han no have after, therefore establish Han various gong zi Heng Yang Jun Cheng become Han Wang, desire with pacify settle Han old land. Xiang Liang defeat die Ding Tao, Cheng flee Huai Wang. Pei Gong lead troops strike Yang Cheng, make Zhang Liang with Han si tu descend Han old land, obtain Xin, become Han jiang, lead his troops follow Pei Gong enter Wu Guan.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0005",
          "zh": "沛公立為漢王，韓信從入漢中，乃說漢王曰：「項王王諸將近地，而王獨遠居此，此左遷也。",
          "translations": [
            {
              "lang": "en",
              "text": "Pei Gong establish become Han Wang, Han Xin follow enter Han Zhong, then say Han Wang said: 'Xiang Wang wang various jiang near land, yet wang alone far dwell this, this left move.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "士卒皆山東人，跂而望歸，及其鋒東鄉，可以爭天下。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shi zu all Shan Dong person, qi yet hope return, reach its front east xiang, able contend tian xia.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "漢王還定三秦，乃許信為韓王，先拜信為韓太尉，將兵略韓地。",
          "translations": [
            {
              "lang": "en",
              "text": "Han Wang return settle three Qin, then allow Xin become Han Wang, first appoint Xin become Han tai wei, lead troops sweep Han land.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Pei Gong establish become Han Wang, Han Xin follow enter Han Zhong, then say Han Wang said: 'Xiang Wang wang various jiang near land, yet wang alone far dwell this, this left move.' Shi zu all Shan Dong person, qi yet hope return, reach its front east xiang, able contend tian xia.' Han Wang return settle three Qin, then allow Xin become Han Wang, first appoint Xin become Han tai wei, lead troops sweep Han land.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "項籍之封諸王皆就國，韓王成以不從無功，不遣就國，更以為列侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiang Ji seal various wang all go country, Han Wang Cheng with not follow no merit, not send go country, change become lie hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "及聞漢遣韓信略韓地，乃令故項籍游吳時吳令鄭昌為韓王以距漢。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach hear Han send Han Xin sweep Han land, then make former Xiang Ji you Wu time Wu ling Zheng Chang become Han Wang with resist Han.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "漢二年，韓信略定韓十餘城。",
          "translations": [
            {
              "lang": "en",
              "text": "Han two years, Han Xin sweep settle Han ten remain city.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "漢王至河南，韓信急擊韓王昌陽城。",
          "translations": [
            {
              "lang": "en",
              "text": "Han Wang reach He Nan, Han Xin urgent strike Han Wang Chang Yang Cheng.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "昌降，漢王乃立韓信為韓王，常將韓兵從。",
          "translations": [
            {
              "lang": "en",
              "text": "Chang descend, Han Wang then establish Han Xin become Han Wang, constant lead Han troops follow.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "三年，漢王出滎陽，韓王信、周苛等守滎陽。",
          "translations": [
            {
              "lang": "en",
              "text": "Three years, Han Wang out Xing Yang, Han Wang Xin, Zhou Ke wait guard Xing Yang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "及楚敗滎陽，信降楚，已而得亡，復歸漢，漢復立以為韓王，竟從擊破項籍，天下定。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Chu defeat Xing Yang, Xin descend Chu, already yet obtain flee, again return Han, Han again establish become Han Wang, finally follow strike break Xiang Ji, tian xia settle.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "五年春，遂與剖符為韓王，王潁川。",
          "translations": [
            {
              "lang": "en",
              "text": "Five years spring, then with carve fu become Han Wang, wang Ying Chuan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Xiang Ji seal various wang all go country, Han Wang Cheng with not follow no merit, not send go country, change become lie hou. Reach hear Han send Han Xin sweep Han land, then make former Xiang Ji you Wu time Wu ling Zheng Chang become Han Wang with resist Han. Han two years, Han Xin sweep settle Han ten remain city. Han Wang reach He Nan, Han Xin urgent strike Han Wang Chang Yang Cheng. Chang descend, Han Wang then establish Han Xin become Han Wang, constant lead Han troops follow. Three years, Han Wang out Xing Yang, Han Wang Xin, Zhou Ke wait guard Xing Yang. Reach Chu defeat Xing Yang, Xin descend Chu, already yet obtain flee, again return Han, Han again establish become Han Wang, finally follow strike break Xiang Ji, tian xia settle. Five years spring, then with carve fu become Han Wang, wang Ying Chuan.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0016",
          "zh": "明年春，上以韓信材武，所王北近鞏、洛，南迫宛、葉，東有淮陽，皆天下勁兵處，乃詔徙韓王信王太原以北，備御胡，都晉陽。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year spring, shang with Han Xin cai wu, place wang north near Gong, Luo, south press Wan, Ye, east have Huai Yang, all tian xia strong troops place, then zhao move Han Wang Xin wang Tai Yuan with north, prepare yu Hu, capital Jin Yang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "信上書曰：「國被邊，匈奴數入，晉陽去塞遠，請治馬邑。」",
          "translations": [
            {
              "lang": "en",
              "text": "Xin shang book said: 'Country border edge, Xiong Nu number enter, Jin Yang go sai far, please govern Ma Yi.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "上許之，信乃徙治馬邑。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang allow it, Xin then move govern Ma Yi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "秋，匈奴冒頓大圍信，信數使使胡求和解。",
          "translations": [
            {
              "lang": "en",
              "text": "Autumn, Xiong Nu Mao Dun big surround Xin, Xin number make shi Hu seek peace dissolve.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "漢發兵救之，疑信數閒使，有二心，使人責讓信。",
          "translations": [
            {
              "lang": "en",
              "text": "Han send troops save it, suspect Xin number space shi, have two heart, make person blame let Xin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "信恐誅，因與匈奴約共攻漢，反，以馬邑降胡，擊太原。",
          "translations": [
            {
              "lang": "en",
              "text": "Xin fear execute, because with Xiong Nu about together attack Han, rebel, with Ma Yi descend Hu, strike Tai Yuan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year spring, shang with Han Xin cai wu, place wang north near Gong, Luo, south press Wan, Ye, east have Huai Yang, all tian xia strong troops place, then zhao move Han Wang Xin wang Tai Yuan with north, prepare yu Hu, capital Jin Yang. Xin shang book said: 'Country border edge, Xiong Nu number enter, Jin Yang go sai far, please govern Ma Yi.' Shang allow it, Xin then move govern Ma Yi. Autumn, Xiong Nu Mao Dun big surround Xin, Xin number make shi Hu seek peace dissolve. Han send troops save it, suspect Xin number space shi, have two heart, make person blame let Xin. Xin fear execute, because with Xiong Nu about together attack Han, rebel, with Ma Yi descend Hu, strike Tai Yuan.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "七年冬，上自往擊，破信軍銅鞮，斬其將王喜。",
          "translations": [
            {
              "lang": "en",
              "text": "Seven years winter, shang self go strike, break Xin army Tong Di, cut his jiang Wang Xi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "信亡走匈奴。",
          "translations": [
            {
              "lang": "en",
              "text": "Xin flee walk Xiong Nu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "（與）其與白土人曼丘臣、王黃等立趙苗裔趙利為王，復收信敗散兵，而與信及冒頓謀攻漢。",
          "translations": [
            {
              "lang": "en",
              "text": "Its with Bai Tu person Man Qiu Chen, Wang Huang wait establish Zhao Miao yi Zhao Li become wang, again collect Xin defeat scatter troops, yet with Xin and Mao Dun plan attack Han.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "匈奴仗左右賢王將萬餘騎與王黃等屯廣武以南，至晉陽，與漢兵戰，漢大破之，追至于離石，復破之。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiong Nu depend left right Xian Wang lead ten thousand remain ride with Wang Huang wait garrison Guang Wu with south, reach Jin Yang, with Han troops battle, Han big break it, pursue reach Li Shi, again break it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "匈奴復聚兵樓煩西北，漢令車騎擊破匈奴。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiong Nu again gather troops Lou Fan north west, Han make che ride strike break Xiong Nu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "匈奴常敗走，漢乘勝追北，聞冒頓居代（上）谷，高皇帝居晉陽，使人視冒頓，還報曰「可擊」。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiong Nu constant defeat walk, Han ride victory pursue north, hear Mao Dun dwell Dai Gu, Gao Huang Di dwell Jin Yang, make person see Mao Dun, return report said 'able strike'.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "上遂至平城。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang then reach Ping Cheng.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "上出白登，匈奴騎圍上，上乃使人厚遺閼氏。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang out Bai Deng, Xiong Nu ride surround shang, shang then make person thick yi Yan Zhi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "閼氏乃說冒頓曰：「今得漢地，猶不能居；",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zhi then say Mao Dun said: 'Now obtain Han land, still not able dwell;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "且兩主不相緱」居七日，胡騎稍引去。",
          "translations": [
            {
              "lang": "en",
              "text": "And two jun not each gou' dwell seven days, Hu ride gradually lead go.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "時天大霧，漢使人往來，胡不覺。",
          "translations": [
            {
              "lang": "en",
              "text": "Time heaven big fog, Han make person go come, Hu not aware.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "護軍中尉陳平言上曰：「胡者全兵，請令彊弩傅兩矢外向，徐行出圍。」",
          "translations": [
            {
              "lang": "en",
              "text": "Hu jun zhong wei Chen Ping speak shang said: 'Hu wait whole troops, please make strong nu fu two arrow outside toward, slow walk out surround.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "入平城，漢救兵亦到，胡騎遂解去。",
          "translations": [
            {
              "lang": "en",
              "text": "Enter Ping Cheng, Han save troops also arrive, Hu ride then dissolve go.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "漢亦罷兵歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Han also stop troops return.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "韓信為匈奴將兵往來擊邊。",
          "translations": [
            {
              "lang": "en",
              "text": "Han Xin become Xiong Nu jiang troops go come strike border.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Seven years winter, shang self go strike, break Xin army Tong Di, cut his jiang Wang Xi. Xin flee walk Xiong Nu. Its with Bai Tu person Man Qiu Chen, Wang Huang wait establish Zhao Miao yi Zhao Li become wang, again collect Xin defeat scatter troops, yet with Xin and Mao Dun plan attack Han. Xiong Nu depend left right Xian Wang lead ten thousand remain ride with Wang Huang wait garrison Guang Wu with south, reach Jin Yang, with Han troops battle, Han big break it, pursue reach Li Shi, again break it. Xiong Nu again gather troops Lou Fan north west, Han make che ride strike break Xiong Nu. Xiong Nu constant defeat walk, Han ride victory pursue north, hear Mao Dun dwell Dai Gu, Gao Huang Di dwell Jin Yang, make person see Mao Dun, return report said 'able strike'. Shang then reach Ping Cheng. Shang out Bai Deng, Xiong Nu ride surround shang, shang then make person thick yi Yan Zhi. Yan Zhi then say Mao Dun said: 'Now obtain Han land, still not able dwell; And two jun not each gou' dwell seven days, Hu ride gradually lead go. Time heaven big fog, Han make person go come, Hu not aware. Hu jun zhong wei Chen Ping speak shang said: 'Hu wait whole troops, please make strong nu fu two arrow outside toward, slow walk out surround.' Enter Ping Cheng, Han save troops also arrive, Hu ride then dissolve go. Han also stop troops return. Han Xin become Xiong Nu jiang troops go come strike border.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "漢十年，信令王黃等說誤陳豨。",
          "translations": [
            {
              "lang": "en",
              "text": "Han ten years, Xin make Wang Huang wait say mislead Chen Xi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "十一年春，故韓王信復與胡騎入居參合，距漢。",
          "translations": [
            {
              "lang": "en",
              "text": "Eleven years spring, former Han Wang Xin again with Hu ride enter dwell Can He, resist Han.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "漢使柴將軍擊之，遺信書曰：「陛下寬仁，諸侯雖有畔亡，而復歸，輒復故位號，不誅也。",
          "translations": [
            {
              "lang": "en",
              "text": "Han make Chai jiang jun strike it, send Xin book said: 'Bi Xia kuan ren, various hou though have pan perish, yet again return, then again old position number, not execute.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "大王所知。",
          "translations": [
            {
              "lang": "en",
              "text": "Da Wang place know.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "今王以敗亡走胡，非有大罪，急自歸！」",
          "translations": [
            {
              "lang": "en",
              "text": "Now wang with defeat perish walk Hu, not have big crime, urgent self return!'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "韓王信報曰：「陛下擢仆起閭巷，南面稱孤，此仆之幸也。",
          "translations": [
            {
              "lang": "en",
              "text": "Han Wang Xin report said: 'Bi Xia pick pu rise li xiang, south face call gu, this pu lucky.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "滎陽之事，仆不能死，囚於項籍，此一罪也。",
          "translations": [
            {
              "lang": "en",
              "text": "Xing Yang affairs, pu cannot die, prisoner at Xiang Ji, this one crime.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "及寇攻馬邑，仆不能堅守，以城降之，此二罪也。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach bandit attack Ma Yi, pu cannot firm guard, with city descend it, this two crime.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "今反為寇將兵，與將軍爭一旦之命，此三罪也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now rebel become bandit jiang troops, with jiang jun contend one morning life, this three crime.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "夫種、蠡無一罪，身死亡；",
          "translations": [
            {
              "lang": "en",
              "text": "Fu Zhong, Li no one crime, body death perish;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "今仆有三罪於陛下，而欲求活於世，此伍子胥所以僨於吳也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now pu have three crime at bi xia, yet desire seek live at world, this Wu Zi Xu so dun at Wu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "今仆亡匿山谷閒，旦暮乞貸蠻夷，仆之思歸，如痿人不忘起，盲者不忘視也，勢不可耳。」",
          "translations": [
            {
              "lang": "en",
              "text": "Now pu perish hide mountain valley jian, dawn dusk beg lend Man Yi, pu think return, like cripple not forget rise, blind not forget see, power not able ear.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "遂戰。",
          "translations": [
            {
              "lang": "en",
              "text": "Then battle.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "柴將軍屠參合，斬韓王信。",
          "translations": [
            {
              "lang": "en",
              "text": "Chai jiang jun slaughter Can He, cut Han Wang Xin.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han ten years, Xin make Wang Huang wait say mislead Chen Xi. Eleven years spring, former Han Wang Xin again with Hu ride enter dwell Can He, resist Han. Han make Chai jiang jun strike it, send Xin book said: 'Bi Xia kuan ren, various hou though have pan perish, yet again return, then again old position number, not execute.' Da Wang place know. Now wang with defeat perish walk Hu, not have big crime, urgent self return!' Han Wang Xin report said: 'Bi Xia pick pu rise li xiang, south face call gu, this pu lucky.' Xing Yang affairs, pu cannot die, prisoner at Xiang Ji, this one crime. Reach bandit attack Ma Yi, pu cannot firm guard, with city descend it, this two crime. Now rebel become bandit jiang troops, with jiang jun contend one morning life, this three crime. Fu Zhong, Li no one crime, body death perish; Now pu have three crime at bi xia, yet desire seek live at world, this Wu Zi Xu so dun at Wu. Now pu perish hide mountain valley jian, dawn dusk beg lend Man Yi, pu think return, like cripple not forget rise, blind not forget see, power not able ear.' Then battle. Chai jiang jun slaughter Can He, cut Han Wang Xin.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0051",
          "zh": "信之入匈奴，與太子俱；",
          "translations": [
            {
              "lang": "en",
              "text": "Xin enter Xiong Nu, with crown prince both;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "及至穨當城，生子，因名曰穨當。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach reach Peng Dang city, give birth son, because name said Peng Dang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "韓太子亦生子，命曰嬰。",
          "translations": [
            {
              "lang": "en",
              "text": "Han crown prince also give birth son, life said Ying.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "至孝文十四年，穨當及嬰率其眾降漢。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Xiao Wen fourteen years, Peng Dang and Ying lead their crowd descend Han.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "漢封穨當為弓高侯，嬰為襄城侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Han seal Peng Dang become Gong Gao hou, Ying become Xiang Cheng hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "吳楚軍時，弓高侯功冠諸將。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu Chu army time, Gong Gao hou merit crown various jiang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "傳子至孫，孫無子，失侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Transmit son reach grandson, grandson no son, lose hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "嬰孫以不敬失侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Ying grandson with not respect lose hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "穨當孽孫韓嫣，貴幸，名富顯於當世。",
          "translations": [
            {
              "lang": "en",
              "text": "Peng Dang bastard grandson Han Yan, noble fortunate, name rich manifest at dang world.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "其弟說，再封，數稱將軍，卒為案道侯。",
          "translations": [
            {
              "lang": "en",
              "text": "His brother Shuo, again seal, number call jiang jun, die become An Dao hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "子代，歲餘坐法死。",
          "translations": [
            {
              "lang": "en",
              "text": "Son replace, year remain sit law die.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "後歲餘，說孫曾拜為龍頟侯，續說後。",
          "translations": [
            {
              "lang": "en",
              "text": "After year remain, Shuo grandson Zeng appoint become Long Shou hou, continue Shuo after.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Xin enter Xiong Nu, with crown prince both; Reach reach Peng Dang city, give birth son, because name said Peng Dang. Han crown prince also give birth son, life said Ying. Reach Xiao Wen fourteen years, Peng Dang and Ying lead their crowd descend Han. Han seal Peng Dang become Gong Gao hou, Ying become Xiang Cheng hou. Wu Chu army time, Gong Gao hou merit crown various jiang. Transmit son reach grandson, grandson no son, lose hou. Ying grandson with not respect lose hou. Peng Dang bastard grandson Han Yan, noble fortunate, name rich manifest at dang world. His brother Shuo, again seal, number call jiang jun, die become An Dao hou. Son replace, year remain sit law die. After year remain, Shuo grandson Zeng appoint become Long Shou hou, continue Shuo after.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "盧綰者，豐人也，與高祖同里。",
          "translations": [
            {
              "lang": "en",
              "text": "Lu Wan, Feng person, with Gao Zu same li.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "盧綰親與高祖太上皇相愛，及生男，高祖、盧綰同日生，里中持羊酒賀兩家。",
          "translations": [
            {
              "lang": "en",
              "text": "Lu Wan close with Gao Zu tai shang huang each love, reach give birth male, Gao Zu, Lu Wan same day give birth, li middle hold sheep wine congratulate two home.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "及高祖、盧綰壯，俱學書，又相愛也。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Gao Zu, Lu Wan strong, both study book, again each love.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "里中嘉兩家親相愛，生子同日，壯又相愛，復賀兩家羊酒。",
          "translations": [
            {
              "lang": "en",
              "text": "Li middle praise two home close each love, give birth son same day, strong again each love, again congratulate two home sheep wine.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "高祖為布衣時，有吏事辟匿，盧綰常隨出入上下。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Zu become bu yi time, have li affairs bi ni, Lu Wan constant follow go out enter up down.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "及高祖初起沛，盧綰以客從，入漢中為將軍，常侍中。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Gao Zu begin rise Pei, Lu Wan with guest follow, enter Han Zhong become jiang jun, constant serve middle.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "從東擊項籍，以太尉常從，出入臥內，衣被飲食賞賜，群臣莫敢望，雖蕭曹等，特以事見禮，至其親幸，莫及盧綰。",
          "translations": [
            {
              "lang": "en",
              "text": "Follow east strike Xiang Ji, with tai wei constant follow, go out enter sleep inner, clothes cover eat drink reward grant, group minister not dare hope, though Xiao Cao wait, special with affairs see li, reach his close fortunate, not reach Lu Wan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "綰封為長安侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Wan seal become Chang An hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "長安，故咸陽也。",
          "translations": [
            {
              "lang": "en",
              "text": "Chang An, old Xian Yang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lu Wan, Feng person, with Gao Zu same li. Lu Wan close with Gao Zu tai shang huang each love, reach give birth male, Gao Zu, Lu Wan same day give birth, li middle hold sheep wine congratulate two home. Reach Gao Zu, Lu Wan strong, both study book, again each love. Li middle praise two home close each love, give birth son same day, strong again each love, again congratulate two home sheep wine. Gao Zu become bu yi time, have li affairs bi ni, Lu Wan constant follow go out enter up down. Reach Gao Zu begin rise Pei, Lu Wan with guest follow, enter Han Zhong become jiang jun, constant serve middle. Follow east strike Xiang Ji, with tai wei constant follow, go out enter sleep inner, clothes cover eat drink reward grant, group minister not dare hope, though Xiao Cao wait, special with affairs see li, reach his close fortunate, not reach Lu Wan. Wan seal become Chang An hou. Chang An, old Xian Yang.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "漢五年冬，以破項籍，乃使盧綰別將，與劉賈擊臨江王共尉，破之。",
          "translations": [
            {
              "lang": "en",
              "text": "Han five years winter, with break Xiang Ji, then make Lu Wan separate lead, with Liu Jia strike Lin Jiang wang Gong Wei, break it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "七月還，從擊燕王臧荼，臧荼降。",
          "translations": [
            {
              "lang": "en",
              "text": "Seven month return, follow strike Yan wang Zang Tu, Zang Tu descend.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "高祖已定天下，諸侯非劉氏而王者七人。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Zu already settle tian xia, various hou not Liu shi yet wang seven people.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "欲王盧綰，為群臣觖望。",
          "translations": [
            {
              "lang": "en",
              "text": "Desire wang Lu Wan, become group minister ju wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "及虜臧荼，乃下詔諸將相列侯，擇群臣有功者以為燕王。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach capture Zang Tu, then descend zhao various jiang xiang lie hou, select group minister have merit become Yan wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "群臣知上欲王盧綰，皆言曰：「太尉長安侯盧綰常從平定天下，功最多，可王燕。」",
          "translations": [
            {
              "lang": "en",
              "text": "Group minister know shang desire wang Lu Wan, all speak said: 'Tai wei Chang An hou Lu Wan constant follow settle tian xia, merit most many, able wang Yan.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "詔許之。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhao allow it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "漢五年八月，乃立虜綰為燕王。",
          "translations": [
            {
              "lang": "en",
              "text": "Han five years eight month, then establish Lu Wan become Yan wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "諸侯王得幸莫如燕王。",
          "translations": [
            {
              "lang": "en",
              "text": "Various hou wang obtain fortunate not like Yan wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han five years winter, with break Xiang Ji, then make Lu Wan separate lead, with Liu Jia strike Lin Jiang wang Gong Wei, break it. Seven month return, follow strike Yan wang Zang Tu, Zang Tu descend. Gao Zu already settle tian xia, various hou not Liu shi yet wang seven people. Desire wang Lu Wan, become group minister ju wang. Reach capture Zang Tu, then descend zhao various jiang xiang lie hou, select group minister have merit become Yan wang. Group minister know shang desire wang Lu Wan, all speak said: 'Tai wei Chang An hou Lu Wan constant follow settle tian xia, merit most many, able wang Yan.' Zhao allow it. Han five years eight month, then establish Lu Wan become Yan wang. Various hou wang obtain fortunate not like Yan wang.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0081",
          "zh": "漢十一年秋，陳豨反代地，高祖如邯鄲擊豨兵，燕王綰亦擊其東北。",
          "translations": [
            {
              "lang": "en",
              "text": "Han eleven years autumn, Chen Xi rebel Dai land, Gao Zu like Han Dan strike Xi troops, Yan wang Wan also strike its north east.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "當是時，陳豨使王黃求救匈奴。",
          "translations": [
            {
              "lang": "en",
              "text": "When this time, Chen Xi make Wang Huang seek save Xiong Nu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "燕王綰亦使其臣張勝於匈奴，言豨等軍破。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan wang Wan also make his minister Zhang Sheng at Xiong Nu, speak Xi wait army break.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "張勝至胡，故燕王臧茶子衍出亡在胡，見張勝曰：「公所以重於燕者，以習胡事也。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhang Sheng reach Hu, old Yan wang Zang Cha son Yan out perish at Hu, see Zhang Sheng said: 'Gong so heavy at Yan, with practice Hu affairs.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "燕所以久存者，以諸侯數反，兵連不決也。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan so long exist, with various hou number rebel, troops connect not decide.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "今公為燕欲急滅豨等，豨等已盡，次亦至燕，公等亦且為虜矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Now gong become Yan desire urgent extinguish Xi wait, Xi wait already exhaust, next also reach Yan, gong wait also and become captive.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "公何不令燕且緩陳豨而與胡和？",
          "translations": [
            {
              "lang": "en",
              "text": "Gong what not make Yan and slow Chen Xi yet with Hu and?",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "事寬，得長王燕；",
          "translations": [
            {
              "lang": "en",
              "text": "Affairs wide, obtain long wang Yan;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "即有漢急，可以安國。」",
          "translations": [
            {
              "lang": "en",
              "text": "That have Han urgent, able settle country.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "張勝以為然，豨私令匈奴助豨等擊燕。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhang Sheng with think so, Xi private make Xiong Nu help Xi wait strike Yan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "燕王綰疑張勝與胡反，上書請族張勝。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan wang Wan suspect Zhang Sheng with Hu rebel, shang book please clan Zhang Sheng.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "勝還，具道所以為者。",
          "translations": [
            {
              "lang": "en",
              "text": "Sheng return, all way so become.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "燕王寤，乃詐論它人，脫勝家屬，使得為匈奴閒，而陰使范齊之陳豨所，欲令久亡，連兵勿決。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan wang Wu, then cheat judge other person, take off Sheng home belong, make obtain become Xiong Nu jian, yet yin make Fan Qi reach Chen Xi place, desire make long perish, connect troops not decide.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han eleven years autumn, Chen Xi rebel Dai land, Gao Zu like Han Dan strike Xi troops, Yan wang Wan also strike its north east. When this time, Chen Xi make Wang Huang seek save Xiong Nu. Yan wang Wan also make his minister Zhang Sheng at Xiong Nu, speak Xi wait army break. Zhang Sheng reach Hu, old Yan wang Zang Cha son Yan out perish at Hu, see Zhang Sheng said: 'Gong so heavy at Yan, with practice Hu affairs.' Yan so long exist, with various hou number rebel, troops connect not decide. Now gong become Yan desire urgent extinguish Xi wait, Xi wait already exhaust, next also reach Yan, gong wait also and become captive. Gong what not make Yan and slow Chen Xi yet with Hu and? Affairs wide, obtain long wang Yan; That have Han urgent, able settle country.' Zhang Sheng with think so, Xi private make Xiong Nu help Xi wait strike Yan. Yan wang Wan suspect Zhang Sheng with Hu rebel, shang book please clan Zhang Sheng. Sheng return, all way so become. Yan wang Wu, then cheat judge other person, take off Sheng home belong, make obtain become Xiong Nu jian, yet yin make Fan Qi reach Chen Xi place, desire make long perish, connect troops not decide.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0094",
          "zh": "漢十二年，東擊黥布，豨常將兵居代，漢使樊噲擊斬豨。",
          "translations": [
            {
              "lang": "en",
              "text": "Han twelve years, east strike Qing Bu, Xi constant lead troops dwell Dai, Han make Fan Kuai strike cut Xi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "其裨將降，言燕王綰使范齊通計謀於豨所。",
          "translations": [
            {
              "lang": "en",
              "text": "Its pi jiang descend, speak Yan wang Wan make Fan Qi pass plan plot at Xi place.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "高祖使使召盧綰，綰稱病。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Zu make shi summon Lu Wan, Wan claim illness.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "上又使辟陽侯審食其、御史大夫趙堯往迎燕王，因驗問左右。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang again make Pi Yang hou Shen Shi Qi, yu shi da fu Zhao Yao go welcome Yan wang, because examine ask left right.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "綰愈恐，閉匿，謂其幸臣曰：「非劉氏而王，獨我與長沙耳。",
          "translations": [
            {
              "lang": "en",
              "text": "Wan more fear, close hide, speak his fortunate minister said: 'Not Liu shi yet wang, alone I and Chang Sha ear.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "往年春，漢族淮陰，夏，誅彭越，皆呂后計。",
          "translations": [
            {
              "lang": "en",
              "text": "Go year spring, Han clan Huai Yin, summer, kill Peng Yue, all Lü Hou plan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "今上病，屬任呂后。",
          "translations": [
            {
              "lang": "en",
              "text": "Now shang illness, belong duty Lü Hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "呂后婦人，專欲以事誅異姓王者及大功臣。」",
          "translations": [
            {
              "lang": "en",
              "text": "Lü Hou woman person, specialize desire with affairs kill different surname wang and big merit minister.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "乃遂稱病不行。",
          "translations": [
            {
              "lang": "en",
              "text": "Then then claim illness not go.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "其左右皆亡匿。",
          "translations": [
            {
              "lang": "en",
              "text": "Its left right all perish hide.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "語頗泄，辟陽侯聞之，歸具報上，上益怒。",
          "translations": [
            {
              "lang": "en",
              "text": "Speak somewhat leak, Pi Yang hou hear it, return all report shang, shang benefit anger.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "又得匈奴降者，降者言張勝亡在匈奴，為燕使。",
          "translations": [
            {
              "lang": "en",
              "text": "Again obtain Xiong Nu descend, descend speak Zhang Sheng perish at Xiong Nu, become Yan shi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "於是上曰：「盧綰果反矣！」",
          "translations": [
            {
              "lang": "en",
              "text": "Then shang said: 'Lu Wan fruit rebel!'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "使樊噲擊燕。",
          "translations": [
            {
              "lang": "en",
              "text": "Make Fan Kuai strike Yan.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "燕王綰悉將其宮人家屬騎數千居長城下，侯伺，幸上病愈，自入謝。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan wang Wan all lead his palace person home belong ride several thousand dwell long city down, hou si, fortunate shang illness better, self enter thank.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "四月，高祖崩，盧綰遂將其眾亡入匈奴，匈奴以為東胡盧王。",
          "translations": [
            {
              "lang": "en",
              "text": "Four month, Gao Zu collapse, Lu Wan then lead his crowd perish enter Xiong Nu, Xiong Nu with become Dong Hu Lu wang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "綰為蠻夷所侵奪，常思復歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Wan become Man Yi place invade rob, constant think again return.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "居歲餘，死胡中。",
          "translations": [
            {
              "lang": "en",
              "text": "Dwell year remain, die Hu middle.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han twelve years, east strike Qing Bu, Xi constant lead troops dwell Dai, Han make Fan Kuai strike cut Xi. Its pi jiang descend, speak Yan wang Wan make Fan Qi pass plan plot at Xi place. Gao Zu make shi summon Lu Wan, Wan claim illness. Shang again make Pi Yang hou Shen Shi Qi, yu shi da fu Zhao Yao go welcome Yan wang, because examine ask left right. Wan more fear, close hide, speak his fortunate minister said: 'Not Liu shi yet wang, alone I and Chang Sha ear. Go year spring, Han clan Huai Yin, summer, kill Peng Yue, all Lü Hou plan. Now shang illness, belong duty Lü Hou. Lü Hou woman person, specialize desire with affairs kill different surname wang and big merit minister.' Then then claim illness not go. Its left right all perish hide. Speak somewhat leak, Pi Yang hou hear it, return all report shang, shang benefit anger. Again obtain Xiong Nu descend, descend speak Zhang Sheng perish at Xiong Nu, become Yan shi. Then shang said: 'Lu Wan fruit rebel!' Make Fan Kuai strike Yan. Yan wang Wan all lead his palace person home belong ride several thousand dwell long city down, hou si, fortunate shang illness better, self enter thank. Four month, Gao Zu collapse, Lu Wan then lead his crowd perish enter Xiong Nu, Xiong Nu with become Dong Hu Lu wang. Wan become Man Yi place invade rob, constant think again return. Dwell year remain, die Hu middle.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0112",
          "zh": "高后時，盧綰妻子亡降漢，會高后病，不能見，舍燕邸，為欲置酒見之。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Hou time, Lu Wan wife son perish descend Han, meet Gao Hou illness, cannot see, shed Yan di, become desire place wine see it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "高祖竟崩，不得見。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Zu finally collapse, not obtain see.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "盧綰妻亦病死。",
          "translations": [
            {
              "lang": "en",
              "text": "Lu Wan wife also illness die.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gao Hou time, Lu Wan wife son perish descend Han, meet Gao Hou illness, cannot see, shed Yan di, become desire place wine see it. Gao Zu finally collapse, not obtain see. Lu Wan wife also illness die.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "孝景中六年，盧綰孫他之，以東胡王降，封為亞谷侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Xiao Jing middle six years, Lu Wan grandson Ta Zhi, with Dong Hu wang descend, seal become Ya Gu hou.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Xiao Jing middle six years, Lu Wan grandson Ta Zhi, with Dong Hu wang descend, seal become Ya Gu hou.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "陳豨者，宛朐人也，不知始所以得從。",
          "translations": [
            {
              "lang": "en",
              "text": "Chen Xi, Wan Qu person, not know start so obtain follow.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "及高祖七年冬，韓王信反，入匈奴，上至平城還，乃封豨為列侯，以趙相國將監趙、代邊兵，邊兵皆屬焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Gao Zu seven years winter, Han wang Xin rebel, enter Xiong Nu, shang reach Ping Cheng return, then seal Xi become lie hou, with Zhao xiang guo lead supervise Zhao, Dai border troops, border troops all belong it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Chen Xi, Wan Qu person, not know start so obtain follow. Reach Gao Zu seven years winter, Han wang Xin rebel, enter Xiong Nu, shang reach Ping Cheng return, then seal Xi become lie hou, with Zhao xiang guo lead supervise Zhao, Dai border troops, border troops all belong it.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0118",
          "zh": "豨常告歸過趙，趙相周昌見豨賓客隨之者千餘乘，邯鄲官舍皆滿。",
          "translations": [
            {
              "lang": "en",
              "text": "Xi constant tell return pass Zhao, Zhao xiang Zhou Chang see Xi bin guest follow it several thousand ride, Han Dan official shed all full.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "豨所以待賓客布衣交，皆出客下。",
          "translations": [
            {
              "lang": "en",
              "text": "Xi so wait bin guest bu yi jiao, all out guest down.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "豨還之代，周昌乃求入見。",
          "translations": [
            {
              "lang": "en",
              "text": "Xi return Dai, Zhou Chang then seek enter see.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "見上，具言豨賓客盛甚，擅兵於外數歲，恐有變。",
          "translations": [
            {
              "lang": "en",
              "text": "See shang, all speak Xi bin guest abundant very, arbitrarily troops at outer several years, fear have change.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "上乃令人覆案豨客居代者財物諸不法事，多連引豨。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang then make person cover examine Xi guest dwell Dai wealth thing various not law affairs, many connect lead Xi.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "豨恐，陰令客通使王黃、曼丘臣所。",
          "translations": [
            {
              "lang": "en",
              "text": "Xi fear, yin make guest pass shi Wang Huang, Man Qiu Chen place.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "及高祖十年七月，太上皇崩，使人召豨，豨稱病甚。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach Gao Zu ten years seven month, tai shang huang collapse, make person summon Xi, Xi claim illness very.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "九月，遂與王黃等反，自立為代王，劫略趙、代。",
          "translations": [
            {
              "lang": "en",
              "text": "Nine month, then with Wang Huang wait rebel, self establish become Dai wang, rob sweep Zhao, Dai.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Xi constant tell return pass Zhao, Zhao xiang Zhou Chang see Xi bin guest follow it several thousand ride, Han Dan official shed all full. Xi so wait bin guest bu yi jiao, all out guest down. Xi return Dai, Zhou Chang then seek enter see. See shang, all speak Xi bin guest abundant very, arbitrarily troops at outer several years, fear have change. Shang then make person cover examine Xi guest dwell Dai wealth thing various not law affairs, many connect lead Xi. Xi fear, yin make guest pass shi Wang Huang, Man Qiu Chen place. Reach Gao Zu ten years seven month, tai shang huang collapse, make person summon Xi, Xi claim illness very. Nine month, then with Wang Huang wait rebel, self establish become Dai wang, rob sweep Zhao, Dai.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0126",
          "zh": "上聞，乃赦趙、代吏人為豨所詿誤劫略者，皆赦之。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang hear, then pardon Zhao, Dai li person become Xi place cheat mistake rob sweep, all pardon it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "上自往，至邯鄲，喜曰：「豨不南據漳水，北守邯鄲，知其無能為也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang self go, reach Han Dan, happy said: 'Xi not south according Zhang Shui, north guard Han Dan, know its no able become.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "趙相奏斬常山守、尉，曰：「常山二十五城，豨反，亡其二十城。」",
          "translations": [
            {
              "lang": "en",
              "text": "Zhao xiang memorial cut Chang Shan guard, wei, said: 'Chang Shan twenty five city, Xi rebel, perish its twenty city.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "上問曰：「守、尉反乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang ask said: 'Guard, wei rebel?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "對曰：「不反。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answer said: 'Not rebel.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "上曰：「是力不足也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang said: 'This strength not enough.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "赦之，復以為常山守、尉。",
          "translations": [
            {
              "lang": "en",
              "text": "Pardon it, again become Chang Shan guard, wei.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "上問周昌曰：「趙亦有壯士可令將者乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang ask Zhou Chang said: 'Zhao also have strong shi able make lead?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "對曰：「有四人。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answer said: 'Have four people.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "四人謁，上謾罵曰：「豎子能為將乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Four people ye, shang man scold said: 'Shu zi able become jiang?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "四人慚伏。",
          "translations": [
            {
              "lang": "en",
              "text": "Four people shame prostrate.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "上封之各千戶，以為將。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang seal it each thousand hu, become jiang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "左右諫曰：「從入蜀、漢，伐楚，功未遍行，今此何功而封？」",
          "translations": [
            {
              "lang": "en",
              "text": "Left right advise said: 'Follow enter Shu, Han, attack Chu, merit not all line, now this what merit yet seal?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "上曰：「非若所知！",
          "translations": [
            {
              "lang": "en",
              "text": "Shang said: 'Not if place know!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "陳豨反，邯鄲以北皆豨有，吾以羽檄徵天下兵，未有至者，今唯獨邯鄲中兵耳。",
          "translations": [
            {
              "lang": "en",
              "text": "Chen Xi rebel, Han Dan with north all Xi have, I with yu xi raise tian xia troops, not have reach, now only alone Han Dan middle troops ear.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "吾胡愛四千戶封四人，不以慰趙子弟！」",
          "translations": [
            {
              "lang": "en",
              "text": "I Hu love four thousand hu seal four people, not with comfort Zhao zi brother!'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "皆曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "text": "All said: 'Good.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "於是上曰：「陳豨將誰？」",
          "translations": [
            {
              "lang": "en",
              "text": "Then shang said: 'Chen Xi lead who?'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "曰：「王黃、曼丘臣，皆故賈人。」",
          "translations": [
            {
              "lang": "en",
              "text": "Said: 'Wang Huang, Man Qiu Chen, all old Jia person.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "上曰：「吾知之矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang said: 'I know it.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "乃各以千金購黃、臣等。",
          "translations": [
            {
              "lang": "en",
              "text": "Then each with thousand jin purchase Huang, Chen wait.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Shang hear, then pardon Zhao, Dai li person become Xi place cheat mistake rob sweep, all pardon it. Shang self go, reach Han Dan, happy said: 'Xi not south according Zhang Shui, north guard Han Dan, know its no able become.' Zhao xiang memorial cut Chang Shan guard, wei, said: 'Chang Shan twenty five city, Xi rebel, perish its twenty city.' Shang ask said: 'Guard, wei rebel?' Answer said: 'Not rebel.' Shang said: 'This strength not enough.' Pardon it, again become Chang Shan guard, wei. Shang ask Zhou Chang said: 'Zhao also have strong shi able make lead?' Answer said: 'Have four people.' Four people ye, shang man scold said: 'Shu zi able become jiang?' Four people shame prostrate. Shang seal it each thousand hu, become jiang. Left right advise said: 'Follow enter Shu, Han, attack Chu, merit not all line, now this what merit yet seal?' Shang said: 'Not if place know! Chen Xi rebel, Han Dan with north all Xi have, I with yu xi raise tian xia troops, not have reach, now only alone Han Dan middle troops ear. I Hu love four thousand hu seal four people, not with comfort Zhao zi brother!' All said: 'Good.' Then shang said: 'Chen Xi lead who?' Said: 'Wang Huang, Man Qiu Chen, all old Jia person.' Shang said: 'I know it.' Then each with thousand jin purchase Huang, Chen wait.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0147",
          "zh": "十一年冬，漢兵擊斬陳豨將侯敞、王黃於曲逆下，破豨將張春於聊城，斬首萬餘。",
          "translations": [
            {
              "lang": "en",
              "text": "Eleven years winter, Han troops strike cut Chen Xi jiang Hou Chang, Wang Huang at Qu Ni down, break Xi jiang Zhang Chun at Liao Cheng, cut head ten thousand remain.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "太尉勃入定太原、代地。",
          "translations": [
            {
              "lang": "en",
              "text": "Tai wei Bo enter settle Tai Yuan, Dai land.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "十二月，上自擊東垣，東垣不下，卒罵上；",
          "translations": [
            {
              "lang": "en",
              "text": "Twelve month, shang self strike Dong Yuan, Dong Yuan not descend, zu scold shang;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "東垣降，卒罵者斬之，不罵者黥之。",
          "translations": [
            {
              "lang": "en",
              "text": "Dong Yuan descend, zu scold cut it, not scold qing it.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "更命東垣為真定。",
          "translations": [
            {
              "lang": "en",
              "text": "Change life Dong Yuan become Zhen Ding.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "王黃、曼丘臣其麾下受購賞之，皆生得，以故陳豨軍遂敗。",
          "translations": [
            {
              "lang": "en",
              "text": "Wang Huang, Man Qiu Chen its wei down receive purchase reward, all live obtain, with reason Chen Xi army then defeat.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Eleven years winter, Han troops strike cut Chen Xi jiang Hou Chang, Wang Huang at Qu Ni down, break Xi jiang Zhang Chun at Liao Cheng, cut head ten thousand remain. Tai wei Bo enter settle Tai Yuan, Dai land. Twelve month, shang self strike Dong Yuan, Dong Yuan not descend, zu scold shang; Dong Yuan descend, zu scold cut it, not scold qing it. Change life Dong Yuan become Zhen Ding. Wang Huang, Man Qiu Chen its wei down receive purchase reward, all live obtain, with reason Chen Xi army then defeat.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0153",
          "zh": "上還至洛陽。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang return reach Luo Yang.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "上曰：「代居常山北，趙乃從山南有之，遠。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shang said: 'Dai dwell Chang Shan north, Zhao then from mountain south have it, far.'",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "乃立子恒為代王，都中都，代、鴈門皆屬代。",
          "translations": [
            {
              "lang": "en",
              "text": "Then establish son Heng become Dai wang, capital Zhong Du, Dai, Yan Men all belong Dai.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Shang return reach Luo Yang. Shang said: 'Dai dwell Chang Shan north, Zhao then from mountain south have it, far.' Then establish son Heng become Dai wang, capital Zhong Du, Dai, Yan Men all belong Dai.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0156",
          "zh": "高祖十二年冬，樊噲軍卒追斬豨於靈丘。",
          "translations": [
            {
              "lang": "en",
              "text": "Gao Zu twelve years winter, Fan Kuai army zu pursue cut Xi at Ling Qiu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gao Zu twelve years winter, Fan Kuai army zu pursue cut Xi at Ling Qiu.",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "太史公曰：韓信、盧綰非素積德累善之世，徼一時權變，以詐力成功，遭漢初定，故得列地，南面稱孤。",
          "translations": [
            {
              "lang": "en",
              "text": "Tai shi gong said: Han Xin, Lu Wan not su accumulate virtue accumulate good world, jiao one time power change, with zha li success, encounter Han begin settle, therefore obtain arrange land, south face call gu.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "內見疑彊大，外倚蠻貊以為援，是以日疏自危，事窮智困，卒赴匈奴，豈不哀哉！",
          "translations": [
            {
              "lang": "en",
              "text": "Inner see suspect qiang big, outer rely Man Mo become aid, therefore day su self danger, affairs poor wisdom kun, finally go Xiong Nu, qi not sorrow!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "陳豨，梁人，其少時數稱慕魏公子；",
          "translations": [
            {
              "lang": "en",
              "text": "Chen Xi, Liang person, its young time number call admire Wei gong zi;",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "及將軍守邊，招致賓客而下士，名聲過實。",
          "translations": [
            {
              "lang": "en",
              "text": "Reach jiang jun guard border, recruit reach bin guest yet down shi, name sound over real.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "周昌疑之，疵瑕頗起，懼禍及身，邪人進說，遂陷無道。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhou Chang suspect it, ci xia somewhat rise, fear calamity reach body, evil person advance say, then trap no way.",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "於戲悲夫！",
          "translations": [
            {
              "lang": "en",
              "text": "Yu xi sorrow!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "夫計之生孰成敗於人也深矣！",
          "translations": [
            {
              "lang": "en",
              "text": "Fu plan become shu success fail at person deep!",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Tai shi gong said: Han Xin, Lu Wan not su accumulate virtue accumulate good world, jiao one time power change, with zha li success, encounter Han begin settle, therefore obtain arrange land, south face call gu. Inner see suspect qiang big, outer rely Man Mo become aid, therefore day su self danger, affairs poor wisdom kun, finally go Xiong Nu, qi not sorrow! Chen Xi, Liang person, its young time number call admire Wei gong zi; Reach jiang jun guard border, recruit reach bin guest yet down shi, name sound over real. Zhou Chang suspect it, ci xia somewhat rise, fear calamity reach body, evil person advance say, then trap no way. Yu xi sorrow! Fu plan become shu success fail at person deep!",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}