{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "095",
    "url": "https://chinesenotes.com/shiji/shiji095.html",
    "title": {
      "zh": "樊酈滕灌列傳",
      "en": "Biographies of Fan, Li, Teng and Guan",
      "raw": "《樊酈滕灌列傳》 Biographies of Fan, Li, Teng and Guan"
    },
    "sentenceCount": 267,
    "translatedCount": 267,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:22.450Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "舞陽侯樊噲者，沛人也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wu Yang marquis Fan Kuai person, Pei person.",
              "idiomatic": "Fan Kuai, Marquis of Wuyang, was a man from Pei."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "以屠狗為事，與高祖俱隱。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With butcher dog as occupation, with Gao Zu both conceal.",
              "idiomatic": "He made his living butchering dogs, and hid himself together with Gaozu."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fan Kuai, Marquis of Wuyang, hailed from Pei. He earned his living as a dog butcher and went into hiding alongside Gaozu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0003",
          "zh": "初從高祖起豐，攻下沛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Initially follow Gao Zu rise Feng, attack take Pei.",
              "idiomatic": "He initially followed Gaozu in rising at Feng, attacking and taking Pei."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "高祖為沛公，以噲為舍人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Zu be Pei gong, with Kuai as attendant.",
              "idiomatic": "When Gaozu became Duke of Pei, he made Kuai his attendant."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "從攻胡陵、方與，還守豐，擊泗水監豐下，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Hu Ling, Fang Yu, return defend Feng, strike Si Shui supervisor Feng below, break it.",
              "idiomatic": "He followed in attacking Huling and Fangyu, returned to defend Feng, attacked the Si Shui supervisor below Feng, and broke him."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "復東定沛，破泗水守薛西。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again east pacify Pei, break Si Shui defender Xue west.",
              "idiomatic": "He again went east to pacify Pei, breaking the Si Shui defender west of Xue."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "與司馬夷戰碭東，卻敵，斬首十五級，賜爵國大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With military secretary Yi battle Dang east, repel enemy, behead heads fifteen, grant nobility state grand master.",
              "idiomatic": "He battled with Military Secretary Yi east of Dang, repelled the enemy, beheaded fifteen heads, and was granted the nobility rank of State Grand Master."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "常從，沛公擊章邯軍濮陽，攻城先登，斬首二十三級，賜爵列大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Often follow, Pei gong strike Zhang Han army Pu Yang, attack city first ascend, behead heads twenty three, grant nobility ranked grand master.",
              "idiomatic": "He often followed, as Duke of Pei attacked Zhang Han's army at Puyang, attacked the city and was first to ascend, beheaded twenty-three heads, and was granted the nobility rank of Ranked Grand Master."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "復常從，從攻城陽，先登。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again often follow, follow attack Cheng Yang, first ascend.",
              "idiomatic": "He again often followed, following in attacking Chengyang, being first to ascend."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "下戶牖，破李由軍，斬首十六級，賜上閒爵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Take Hu You, break Li You army, behead heads sixteen, grant upper leisure nobility.",
              "idiomatic": "He took Huyou, broke Li You's army, beheaded sixteen heads, and was granted upper leisure nobility."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "從攻圍東郡守尉於成武，卻敵，斬首十四級，捕虜十一人，賜爵五大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack besiege Dong jun guard captain at Cheng Wu, repel enemy, behead heads fourteen, capture captives eleven, grant nobility five grand masters.",
              "idiomatic": "He followed in attacking and besieging the Dongjun guard captain at Chengwu, repelled the enemy, beheaded fourteen heads, captured eleven captives, and was granted the nobility rank of Five Grand Masters."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "從擊秦軍，出亳南。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow strike Qin army, exit Hao south.",
              "idiomatic": "He followed in striking the Qin army, exiting south of Hao."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "河閒守軍於杠里，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He Jian guard army at Gang Li, break it.",
              "idiomatic": "He broke the Hejian guard's army at Gangli."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "擊破趙賁軍開封北，以卻敵先登，斬候一人，首六十八級，捕虜二十七人，賜爵卿。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike break Zhao Ben army Kai Feng north, because repel enemy first ascend, behead scout one, heads sixty eight, capture captives twenty seven, grant nobility minister.",
              "idiomatic": "He struck and broke Zhao Ben's army north of Kaifeng. Because he repelled the enemy and was first to ascend, he beheaded one scout, sixty-eight heads, captured twenty-seven captives, and was granted the nobility rank of Minister."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "從攻破楊熊軍於曲遇。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack break Yang Xiong army at Qu Yu.",
              "idiomatic": "He followed in attacking and breaking Yang Xiong's army at Quyu."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "攻宛陵，先登，斬首八級，捕虜四十四人，賜爵封號賢成君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Wan Ling, first ascend, behead heads eight, capture captives forty four, grant nobility enfeoff title Xian Cheng jun.",
              "idiomatic": "He attacked Wanling, was first to ascend, beheaded eight heads, captured forty-four captives, and was granted nobility with the enfeoffed title of Lord Xiancheng."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "從攻長社、轘轅，絕河津，東攻秦軍於尸，南攻秦軍於犨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Chang She, Huan Yuan, cut off river ford, east attack Qin army at Shi, south attack Qin army at Chou.",
              "idiomatic": "He followed in attacking Changshe and Huanyuan, cut off the river ford, attacked the Qin army east at Shi, and attacked the Qin army south at Chou."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "破南陽守齮於陽城。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Break Nan Yang guard Yi at Yang Cheng.",
              "idiomatic": "He broke the Nanyang guard Yi at Yangcheng."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "東攻宛城，先登。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "East attack Wan city, first ascend.",
              "idiomatic": "He attacked Wancheng to the east, being first to ascend."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "西至酈，以卻敵，斬首二十四級，捕虜四十人，賜重封。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "West arrive Li, because repel enemy, behead heads twenty four, capture captives forty, grant heavy enfeoffment.",
              "idiomatic": "He went west to Li. Because he repelled the enemy, he beheaded twenty-four heads, captured forty captives, and was granted heavy enfeoffment."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "攻武關，至霸上，斬都尉一人，首十級，捕虜百四十六人，降卒二千九百人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Wu Guan, arrive Ba Shang, behead commandants one, heads ten, capture captives hundred forty six, surrender soldiers two thousand nine hundred.",
              "idiomatic": "He attacked Wuguan, arrived at Bashang, beheaded one commandant, ten heads, captured one hundred forty-six captives, and accepted the surrender of two thousand nine hundred soldiers."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He first followed Gaozu in his uprising from Feng, helping capture Pei. When Gaozu became Duke of Pei, he appointed Fan Kuai as his personal attendant. He followed in attacking Hul陵 and Fangyu, then returned to defend Feng. Former guests who had once deserted him occasionally came to congratulate him. On a leisurely day, the Duke of Pei went out with over a hundred horsemen to hunt pheasants and rabbits in the fields. Yong Chi came as a guest to the Duke of Pei. The duke drank with him, and their feast was very merry. Yong Chi got drunk. The Duke of Pei secretly placed stolen dog meat on Yong Chi's seat. Yong Chi grew angry and left. Yong Chi was furious and rebelled against the Duke of Pei. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled. Yong Chi rebelled against the Duke of Pei. The duke and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "項羽在戲下，欲攻沛公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu at Xi below, wish attack Pei gong.",
              "idiomatic": "Xiang Yu was below Xi and wished to attack the Duke of Pei."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "沛公從百餘騎因項伯面見項羽，謝無有閉關事。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pei gong follow hundred more riders through Xiang Bo face see Xiang Yu, apologize no have close pass affairs.",
              "idiomatic": "The Duke of Pei followed with over a hundred riders and through Xiang Bo's mediation met Xiang Yu face to face, apologizing that there was no matter of closing the passes."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "項羽既饗軍士，中酒，亞父謀欲殺沛公，令項莊拔劍舞坐中，欲擊沛公，項伯常（肩）［屏］蔽之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu already feast army soldiers, in wine, Ya Fu plot wish kill Pei gong, order Xiang Zhuang draw sword dance seat middle, wish strike Pei gong, Xiang Bo often screen shield it.",
              "idiomatic": "Xiang Yu had already feasted the army soldiers. He was drunk, and Yafu plotted to kill the Duke of Pei. He ordered Xiang Zhuang to draw his sword and dance in the midst of the seats, intending to strike the Duke of Pei, but Xiang Bo often screened and shielded him."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "時獨沛公與張良得入坐，樊噌在營外，聞事急，乃持鐵盾入到營。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At time only Pei gong with Zhang Liang able enter sit, Fan Kuai at camp outside, hear affairs urgent, then hold iron shield enter arrive camp.",
              "idiomatic": "At the time, only the Duke of Pei and Zhang Liang were able to enter and sit. Fan Kuai was outside the camp. Hearing that affairs were urgent, he then held an iron shield and entered the camp."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "營衛止噲，噲直撞入，立帳下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Camp guards stop Kuai, Kuai straight rush enter, stand tent below.",
              "idiomatic": "The camp guards stopped Kuai, but Kuai charged straight in and stood below the tent."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "項羽目之，問為誰。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu eye it, ask is who.",
              "idiomatic": "Xiang Yu eyed him and asked who he was."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "張良曰：「沛公參乘樊噲。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhang Liang say: Pei gong chariot attendant Fan Kuai.",
              "idiomatic": "Zhang Liang said: 'The Duke of Pei's chariot attendant, Fan Kuai.'"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "項羽曰：「壯士。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu say: Strong warrior.",
              "idiomatic": "Xiang Yu said: 'A strong warrior.'"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "賜之卮酒彘肩。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grant him cup wine pig shoulder.",
              "idiomatic": "He granted him a cup of wine and a pig shoulder."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "噲既飲酒，拔劍切肉食，盡之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai already drink wine, draw sword cut meat eat, exhaust it.",
              "idiomatic": "Kuai having drunk the wine, drew his sword and cut the meat to eat, finishing it all."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "項羽曰：「能復飲乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu say: Able again drink?",
              "idiomatic": "Xiang Yu said: 'Can you drink again?'"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "噲曰：「臣死且不辭，豈特卮酒乎！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai say: Minister die moreover not decline, how only cup wine!",
              "idiomatic": "Kuai said: 'This minister would not decline even death, how much less a cup of wine!'"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "且沛公先入定咸陽，暴師霸上，以待大王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover Pei gong first enter settle Xian Yang, station troops Ba Shang, to wait great wang.",
              "idiomatic": "Moreover, the Duke of Pei was first to enter and settle Xianyang, stationing his troops at Bashang to wait for the Great King."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "大王今日至，聽小人之言，與沛公有隙，臣恐天下解，心疑大王也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Great wang today arrive, listen small person words, with Pei gong have rift, minister fear world dissolve, heart doubt great wang.'",
              "idiomatic": "The Great King has arrived today. Listening to the words of petty men and creating a rift with the Duke of Pei, this minister fears the world will dissolve and hearts will doubt the Great King.'"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "項羽默然。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu silent.",
              "idiomatic": "Xiang Yu was silent."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "沛公如廁，麾樊噲去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pei gong go toilet, wave Fan Kuai go.",
              "idiomatic": "The Duke of Pei went to the toilet and waved for Fan Kuai to leave."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "既出，沛公留車騎，獨騎一馬，與樊噲等四人步從，從閒道山下歸走霸上軍，而使張良謝項羽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Already out, Pei gong leave chariot cavalry, alone ride one horse, with Fan Kuai etc four people foot follow, from secluded path mountain below return run Ba Shang army, but make Zhang Liang apologize Xiang Yu.",
              "idiomatic": "Having left, the Duke of Pei left his chariot and cavalry, rode alone on one horse, and with Fan Kuai and three others following on foot, took a secluded mountain path back to his Bashang army, while having Zhang Liang apologize to Xiang Yu."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "項羽亦因遂已，無誅沛公之心矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu also therefore then stop, no execute Pei gong heart.",
              "idiomatic": "Xiang Yu also therefore let it go, having no more intention to execute the Duke of Pei."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "是日微樊噲奔入營譙讓項羽，沛公事幾殆。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "This day almost Fan Kuai run enter camp berate rebuke Xiang Yu, Pei gong affairs almost perilous.",
              "idiomatic": "That day, if not for Fan Kuai charging into the camp and berating Xiang Yu, the Duke of Pei's affairs would have been almost perilous."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "明日，項羽入屠咸陽，立沛公為漢王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tomorrow, Xiang Yu enter slaughter Xian Yang, establish Pei gong as Han wang.",
              "idiomatic": "The next day, Xiang Yu entered and slaughtered Xianyang, establishing the Duke of Pei as King of Han."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "漢王賜噲爵為列侯，號臨武侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang grant Kuai nobility as ranked marquis, title Lin Wu marquis.",
              "idiomatic": "The Han king granted Kuai the nobility rank of Ranked Marquis, with the title Marquis of Linwu."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "遷為郎中，從入漢中。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Move as court gentleman, follow enter Han middle.",
              "idiomatic": "He was moved to the position of Court Gentleman and followed in entering Hanzhong."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "還定三秦，別擊西丞白水北，雍輕車騎於雍南，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return settle three Qin, separately strike west chancellor Bai Shui north, Yong light chariots cavalry at Yong south, break it.",
              "idiomatic": "He returned to settle the Three Qin, separately attacked the Western Chancellor north of Baishui, and Yong's light chariots and cavalry south of Yong, breaking them."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "從攻雍、斄城，先登。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Yong, Lai city, first ascend.",
              "idiomatic": "He followed in attacking Yong and Lai cities, being first to ascend."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "擊章平軍好畤，攻城，先登陷陣，斬縣令丞各一人，首十一級，虜二十人，遷郎中騎將。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike Zhang Ping army Hao Zhi, attack city, first ascend break array, behead county magistrate assistant each one, heads eleven, captives twenty, move court gentleman cavalry general.",
              "idiomatic": "He struck Zhang Ping's army at Haozhi, attacked the city, was first to ascend and break the battle array, beheaded the county magistrate and his assistant each one, eleven heads, captured twenty captives, and was moved to Court Gentleman Cavalry General."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "從擊秦車騎壤東，卻敵，遷為將軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow strike Qin chariots cavalry Rang east, repel enemy, move as general.",
              "idiomatic": "He followed in striking the Qin chariots and cavalry east of Rang, repelled the enemy, and was moved to the position of General."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "攻趙賁，下郿、槐裏、柳中、咸陽；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Zhao Ben, take Mei, Huai Li, Liu Zhong, Xian Yang;",
              "idiomatic": "He attacked Zhao Ben, taking Mei, Huaili, Liuzhong, and Xianyang;"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "灌廢丘，最。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Irrigate Fei Qiu, most.",
              "idiomatic": "He irrigated Feiqiu, being the most."
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "至櫟陽，賜食邑杜之樊鄉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive Yue Yang, grant food fief Du Fan Xiang.",
              "idiomatic": "He arrived at Yueyang and was granted the food fief of Fanxiang in Du."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "從攻項籍，屠煮棗。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Xiang Ji, slaughter Zhu Zao.",
              "idiomatic": "He followed in attacking Xiang Ji, slaughtering at Zhuzao."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "擊破王武、程處軍於外黃。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike break Wang Wu, Cheng Chu army at Wai Huang.",
              "idiomatic": "He struck and broke Wang Wu and Cheng Chu's army at Waihuang."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "攻鄒、魯、瑕丘、薛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Zou, Lu, Xia Qiu, Xue.",
              "idiomatic": "He attacked Zou, Lu, Xiaqiu, and Xue."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "項羽敗漢王於彭城，盡復取魯、梁地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu defeat Han wang at Peng Cheng, exhaust again take Lu, Liang land.",
              "idiomatic": "Xiang Yu defeated the Han king at Pengcheng and completely retook the lands of Lu and Liang."
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "噲還至滎陽，益食平陰二千戶，以將軍守廣武。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai return arrive Xing Yang, increase food Ping Yin two thousand households, with general guard Guang Wu.",
              "idiomatic": "Kuai returned to Xingyang, was granted an additional two thousand households in Pingyin, and guarded Guangwu as a general."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "一歲，項羽引而東。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "One year, Xiang Yu lead and east.",
              "idiomatic": "After one year, Xiang Yu led forces and went east."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "從高祖擊項籍，下陽夏，虜楚周將軍卒四千人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow Gao Zu strike Xiang Ji, take Yang Xia, capture Chu Zhou general soldiers four thousand.",
              "idiomatic": "He followed Gaozu in attacking Xiang Ji, took Yangxia, and captured four thousand soldiers of the Chu general Zhou."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "圍項籍於陳，大破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Besiege Xiang Ji at Chen, greatly break him.",
              "idiomatic": "He besieged Xiang Ji at Chen and greatly defeated him."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "屠胡陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Slaughter Hu Ling.",
              "idiomatic": "He slaughtered at Huling."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. He followed Gaozu in attacking Xiang Yu, massacring the defenders at Zhujiao. He smashed Wang Wu and Cheng Chu's forces at Waihuang. He attacked the cities of Zou, Lu, Xiaqiu, and Xue. Xiang Yu defeated the Han King at Pengcheng and completely regained control of Lu and Liang territories. Fan Kuai returned to Xingyang. He was additionally granted two thousand households in Pingyin and appointed general to defend Guangwu. After one year, Xiang Yu led his troops eastward. He followed Gaozu in attacking Xiang Yu, capturing Yangxia and taking four thousand troops from the Chu general Zhou. He surrounded Xiang Yu at Chen and dealt him a crushing defeat. He massacred the defenders at Hul陵.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "項籍既死，漢王為帝，以噲堅守戰有功，益食八百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Ji already die, Han wang become emperor, with Kuai firm guard battle have merit, increase food eight hundred households.",
              "idiomatic": "After Xiang Ji died and the Han king became emperor, because Kuai had firm defense and battle merit, he was granted an additional eight hundred households."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "從高帝攻反燕王臧荼，虜荼，定燕地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow Gao Di attack rebel Yan wang Zang Tu, capture Tu, settle Yan land.",
              "idiomatic": "He followed Gao Di in attacking the rebelling Yan king Zang Tu, captured Tu, and settled the Yan lands."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "楚王韓信反，噲從至陳，取信，定楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chu wang Han Xin rebel, Kuai follow arrive Chen, take Xin, settle Chu.",
              "idiomatic": "When Chu king Han Xin rebelled, Kuai followed to Chen, took Xin, and settled Chu."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "更賜爵列侯，與諸侯剖符，世世勿絕，食舞陽，號為舞陽侯，除前所食。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again grant nobility ranked marquis, with various marquises split tally, generation generation not cut off, food Wu Yang, title as Wu Yang marquis, remove previous food.",
              "idiomatic": "He was again granted the nobility rank of Ranked Marquis, given a split tally with the various marquises for generations without end, granted Wu Yang as food fief, titled Marquis of Wuyang, and his previous food grants were removed."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "以將軍從高祖攻反韓王信於代。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With general follow Gao Zu attack rebel Han wang Xin at Dai.",
              "idiomatic": "As a general he followed Gaozu in attacking the rebelling Han king Xin in Dai."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "自霍人以往至雲中，與絳侯等共定之，益食千五百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "From Huo person in past arrive Yun Zhong, with Jiang marquis etc together settle it, increase food thousand five hundred households.",
              "idiomatic": "From Huo people onward to Yunzhong, together with the Jiang marquis and others he settled it, and was granted an additional one thousand five hundred households."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "因擊陳豨與曼丘臣軍，戰襄國，破柏人，先登，降定清河、常山凡二十七縣，殘東垣，遷為左丞相。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then strike Chen Xi with Man Qiu Chen army, battle Xiang Guo, break Bai Ren, first ascend, surrender settle Qing He, Chang Shan altogether twenty seven counties, damage Dong Yuan, move as left chancellor.",
              "idiomatic": "He then struck Chen Xi and the army of Manqiu Chen, battled at Xiangguo, broke Bairen, was first to ascend, surrendered and settled Qinghe and Changshan for a total of twenty-seven counties, damaged Dongyuan, and was moved to Left Chancellor."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "破得綦毋卹、尹潘軍於無終、廣昌。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Break obtain Qi Wu Xu, Yin Pan army at Wu Zhong, Guang Chang.",
              "idiomatic": "He broke and obtained the armies of Qiwu Xu and Yin Pan at Wuzhong and Guangchang."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "破豨別將胡人王黃軍於代南，因擊韓信軍於參合。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Break Xi separate general barbarian king Huang army at Dai south, then strike Han Xin army at Can He.",
              "idiomatic": "He broke Xi's separate general, the barbarian king Huang's army, south of Dai, and then struck Han Xin's army at Canhe."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "軍所將卒斬韓信，破豨胡騎橫谷，斬將軍趙既，虜代丞相馮梁、守孫奮、大將王黃、將軍、（太卜）太仆解福等十人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Army what lead soldiers behead Han Xin, break Xi barbarian cavalry Heng Gu, behead general Zhao Ji, capture Dai chancellor Feng Liang, defender Sun Fen, great general Wang Huang, general, grand servant Xie Fu etc ten people.",
              "idiomatic": "The soldiers he led beheaded Han Xin, broke Xi's barbarian cavalry at Henggu, beheaded General Zhao Ji, and captured the Dai chancellor Feng Liang, defender Sun Fen, great general Wang Huang, generals, and Grand Servant Xie Fu and others, ten people in total."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "與諸將共定代鄉邑七十三。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With various generals together settle Dai rural towns seventy three.",
              "idiomatic": "Together with the various generals he settled seventy-three rural towns in Dai."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "其後燕王盧綰反，噲以相國擊盧綰，破其丞相抵薊南，定燕地，凡縣十八，鄉邑五十一。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His after Yan wang Lu Wan rebel, Kuai with prime minister strike Lu Wan, break his chancellor resist Ji south, settle Yan land, altogether counties eighteen, rural towns fifty one.",
              "idiomatic": "Afterward, when Yan king Lu Wan rebelled, Kuai as prime minister struck Lu Wan, broke his chancellor who resisted south of Ji, settled the Yan lands, for a total of eighteen counties and fifty-one rural towns."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "益食邑千三百戶，定食舞陽五千四百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Increase food fief thousand three hundred households, settle food Wu Yang five thousand four hundred households.",
              "idiomatic": "He was granted an additional food fief of one thousand three hundred households, settling his food fief at Wu Yang with five thousand four hundred households."
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "從，斬首百七十六級，虜二百八十八人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow, behead heads hundred seventy six, captives two hundred eighty eight.",
              "idiomatic": "He followed and beheaded one hundred seventy-six heads, capturing two hundred eighty-eight."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "別，破軍七，下城五，定郡六，縣五十二，得丞相一人，將軍十二人，二千石已下至三百石十一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Separately, break armies seven, take cities five, settle commanderies six, counties fifty two, obtain chancellor one, generals twelve, two thousand stone already below to three hundred stone eleven.",
              "idiomatic": "Separately, he broke seven armies, took five cities, settled six commanderies and fifty-two counties, obtained one chancellor, twelve generals, and eleven officials from two thousand stone down to three hundred stone."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Xiang Yu's death, the Han King became emperor. For Fan Kuai's steadfast defense and meritorious service in battle, he was additionally granted eight hundred households. He followed Gaozu in attacking the rebel Yan King Zang Tu at Ji, defeating him. He followed again to Chen, captured Chu King Xin, and received an enfeoffment document guaranteeing his title for generations without end. He was granted Wuyang as his fief and given the title Left General. The next year, he pacified Di and attacked Chen Xi, fighting continuous battles against Chen Xi. Chen Xi was defeated, and Fan Kuai conducted mobile warfare with Manqiu Chen in Dai. Gaozu marched south to intercept Feng Yi and others on the Long road, attacked Yong, and pacified Longxi. With the troops he commanded, he reached Guguan and the Xinan army. His nobility rank was increased, making him eligible for the position of chancellor. This is recorded in the Hereditary House of Marquis Jiang Zhou Bo. When Xiang Yu rebelled against Chu, Han Xin from Huaiyin fled from Chu to join Han. The Han King appointed Han Xin as grain commissioner, but did not consider him exceptional. Han Xin often spoke with Xiao He, who recognized his talent. This continued until they reached Nanzheng. Xiao He had not finished speaking when Gaozu exclaimed in great surprise: My realm is small—how can it contain a man like Han Xin? If we want to contend for the world, there is no one else but Han Xin. He then appointed Han Xin as Grand General, executed Zhongli Mei and six others, and sent him east to pacify Qi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "噲以呂后女弟呂須為婦，生子伉，故其比諸將最親。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai with Empress Lu younger sister Lu Xu as wife, give birth son Kang, therefore he compare various generals most close.",
              "idiomatic": "Kuai took Empress Lu's younger sister Lu Xu as his wife, who bore him a son named Kang, therefore he was the closest among the various generals."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Qi territory was completely pacified, Han Xin was transferred to become King of Chu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "先黥布反時，高祖嘗病甚，惡見人，臥禁中，詔戶者無得入群臣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Before Qing Bu rebel time, Gao Zu once ill very, hate see people, lie forbidden middle, decree gate keepers no able enter various ministers.",
              "idiomatic": "Before Qing Bu rebelled, Gaozu was once very ill and hated seeing people. He lay in the inner chambers and decreed that the gate keepers should not allow the various ministers to enter."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "群臣絳、灌等莫敢入。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Various ministers Jiang, Guan etc none dare enter.",
              "idiomatic": "The various ministers like Jiang and Guan did not dare enter."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "十餘日，噲乃排闥直入，大臣隨之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ten more days, Kuai then push door straight enter, great ministers follow him.",
              "idiomatic": "After more than ten days, Kuai then pushed open the door and entered straight in, with the great ministers following him."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "上獨枕一宦者臥。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Sovereign alone pillow one eunuch lie.",
              "idiomatic": "The sovereign lay alone, pillowing on one eunuch."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "噲等見上流涕曰：「始陛下與臣等起豐沛，定天下，何其壯也！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai etc see sovereign flow tears say: Begin your majesty with minister etc rise Feng Pei, settle world, what its strong!",
              "idiomatic": "Kuai and the others, seeing the sovereign, flowed tears and said: 'When Your Majesty and we ministers rose from Feng and Pei to settle the world, how strong you were!'"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "今天下已定，又何憊也！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now world already settle, again what tired!",
              "idiomatic": "Now the world is already settled, why are you tired again!'"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "且陛下病甚，大臣震恐，不見臣等計事，顧獨與一宦者絕乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover your majesty ill very, great ministers shake fear, not see minister etc plan affairs, but alone with one eunuch cut off?",
              "idiomatic": "Moreover, Your Majesty's illness is very serious. The great ministers are shaking with fear. You do not see us ministers to plan affairs, but would you cut yourself off alone with one eunuch?'"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "且陛下獨不見趙高之事乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover your majesty alone not see Zhao Gao affairs?",
              "idiomatic": "Moreover, does Your Majesty alone not see the affairs of Zhao Gao?'"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "高帝笑而起。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di laugh and rise.",
              "idiomatic": "The Gao Emperor laughed and rose."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Xiang Yu's death, Han Xin was transferred to become Marquis of Huaiyin. Han Xin joined Jiang Hou and others in suppressing the rebellions of Chen Xi and Ying Bu, then died. His son Han Fei succeeded him, then died without heirs. His younger brother Han Wei succeeded him as marquis. When Wei died, his son Han Dan succeeded him. When Dan died, his son Han Dai succeeded him. When Dai died, his son Han Jian succeeded him. When Jian died, his son Han Xiang succeeded him. When Xiang died, his son Han Zhong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "其後盧綰反，高帝使噲以相國擊燕。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His after Lu Wan rebel, Gao Di make Kuai with prime minister strike Yan.",
              "idiomatic": "Afterward, when Lu Wan rebelled, the Gao Emperor sent Kuai as prime minister to strike Yan."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "是時高帝病甚，人有惡噲黨於呂氏，即上一日宮車晏駕，則噲欲以兵盡誅滅戚氏、趙王如意之屬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "This time Gao Di ill very, person have hate Kuai party with Lu clan, immediately sovereign one day palace chariot late depart, then Kuai wish with troops exhaust execute exterminate Qi clan, Zhao wang Ru Yi those.",
              "idiomatic": "At this time the Gao Emperor was very ill. Someone hated that Kuai was allied with the Lu clan. If the sovereign's palace chariot departed late by one day, then Kuai intended to use troops to completely execute and exterminate the Qi clan and those like Zhao king Ruyi."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "高帝聞之大怒，乃使陳平載絳侯代將，而即軍中斬噲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di hear it greatly angry, then make Chen Ping carry Jiang marquis replace general, but immediately army middle behead Kuai.",
              "idiomatic": "The Gao Emperor heard it and was greatly angered. He then had Chen Ping carry the Jiang marquis to replace the general, and immediately beheaded Kuai in the army."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "陳平畏呂后，執噲詣長安。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chen Ping fear Empress Lu, seize Kuai go Chang An.",
              "idiomatic": "Chen Ping feared Empress Lu and seized Kuai to go to Chang'an."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "至則高祖已崩，呂后釋噲，使復爵邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive then Gao Zu already collapse, Empress Lu release Kuai, make restore nobility fief.",
              "idiomatic": "When they arrived, Gaozu had already passed away. Empress Lu released Kuai and had him restore his nobility and fief."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Zhong died, his son Han Shu succeeded him. When Shu died, his son Han Xi succeeded him. When Xi died, his son Han Qingji succeeded him. When Qingji died, his son Han Gong succeeded him. When Gong died, his son Han Bing succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "孝惠六年，樊噲卒，謚為武侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Hui six year, Fan Kuai die, posthumous title as Wu marquis.",
              "idiomatic": "In the sixth year of Xiaohui, Fan Kuai died and was posthumously titled Marquis Wu."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "子伉代侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Kang replace marquis.",
              "idiomatic": "His son Kang succeeded as marquis."
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "而伉母呂須亦為臨光侯，高后時用事專權，大臣盡畏之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "But Kang mother Lu Xu also be Lin Guang marquis, Gao empress time use affairs monopolize power, great ministers exhaust fear her.",
              "idiomatic": "But Kang's mother Lu Xu was also made Marquis of Linguang. During Gao empress's time when she held power and monopolized authority, all the great ministers feared her."
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "伉代侯九歲，高后崩。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kang replace marquis nine years, Gao empress collapse.",
              "idiomatic": "Kang succeeded as marquis for nine years, then Gao empress passed away."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "大臣誅諸呂、呂須婘屬，因誅伉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Great ministers execute various Lu, Lu Xu clan relatives, then execute Kang.",
              "idiomatic": "The great ministers executed the various Lu clan members and Lu Xu's relatives, and in the process executed Kang."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "舞陽侯中絕數月。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wu Yang marquis middle cut off several months.",
              "idiomatic": "The Marquis of Wuyang was cut off in the middle for several months."
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "孝文帝既立，乃復封噲他庶子市人為舞陽侯，復故爵邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Wen emperor already establish, then again enfeoff Kuai other concubine son Shi Ren as Wu Yang marquis, restore former nobility fief.",
              "idiomatic": "After the Xiaowen emperor was established, he then again enfeoffed Kuai's other concubine son Shi Ren as Marquis of Wuyang, restoring the former nobility and fief."
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "市人立二十九歲卒，謚為荒侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Shi Ren establish twenty nine years die, posthumous title as Huang marquis.",
              "idiomatic": "Shi Ren was established for twenty-nine years and died, posthumously titled Marquis Huang."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "子他廣代侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Ta Guang replace marquis.",
              "idiomatic": "His son Ta Guang succeeded as marquis."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "六歲，侯家舍人得罪他廣，怨之，乃上書曰：「荒侯市人病不能為人，令其夫人與其弟亂而生他廣，他廣實非荒侯子，不當代後。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Six years, marquis house retainer offend Ta Guang, resent him, then submit memorial say: Huang marquis Shi Ren ill not able be person, order his wife with his younger brother disorder give birth Ta Guang, Ta Guang really not Huang marquis son, not should succeed after.",
              "idiomatic": "After six years, a retainer in the marquis's household offended Ta Guang. Resenting him, he submitted a memorial saying: 'Marquis Huang Shi Ren was ill and could not perform as a man. He had his wife commit adultery with his younger brother, giving birth to Ta Guang. Ta Guang is really not Marquis Huang's son and should not succeed him.'"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "詔下吏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Decree send officials.",
              "idiomatic": "The decree was sent to the officials."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "孝景中六年，他廣奪侯為庶人，國除。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Jing middle six year, Ta Guang seize marquis make common person, state eliminate.",
              "idiomatic": "In the sixth year of the middle period of Xiaojing, Ta Guang was stripped of his marquisate and made a commoner, and the state was abolished."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Bing died, his son Han Gai succeeded him. When Gai died, his son Han Hu succeeded him. When Hu died, his son Han Guang succeeded him. When Guang died, his son Han Dang succeeded him. When Dang died, his son Han Hui succeeded him. When Hui died, his son Han Feng succeeded him. When Feng died, his son Han Zhang succeeded him. When Zhang died, his son Han Shi succeeded him. When Shi died, his son Han Chang succeeded him. When Chang died, his son Han Chong succeeded him. When Chong died, his son Han Heng succeeded him. When Heng died, his son Han Yu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "曲周侯酈商者，高陽人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qu Zhou marquis Li Shang person, Gao Yang person.",
              "idiomatic": "Li Shang, Marquis of Quzhou, was a man of Gaoyang."
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "陳勝起時，商聚少年東西略人，得數千。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chen Sheng rise time, Shang gather youths east west raid people, obtain several thousand.",
              "idiomatic": "When Chen Sheng rose, Shang gathered youths and raided people east and west, obtaining several thousand."
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "沛公略地至陳留，六月餘，商以將卒四千人屬沛公於岐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pei gong raid land arrive Chen Liu, six month more, Shang with lead soldiers four thousand belong Pei gong at Qi.",
              "idiomatic": "When the Duke of Pei raided territory and arrived at Chenliu, after more than six months, Shang led four thousand soldiers to join the Duke of Pei at Qi."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "從攻長社，先登，賜爵封信成君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Chang She, first ascend, grant nobility enfeoff Xin Cheng jun.",
              "idiomatic": "He followed in attacking Changshe, was first to ascend, and was granted nobility with the enfeoffed title of Lord Xincheng."
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "從沛公攻緱氏，絕河津，破秦軍洛陽東。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow Pei gong attack Gou Shi, cut off river ford, break Qin army Luo Yang east.",
              "idiomatic": "He followed the Duke of Pei in attacking Goushi, cut off the river ford, and broke the Qin army east of Luoyang."
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "從攻下宛、穰，定十七縣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack take Wan, Rang, settle seventeen counties.",
              "idiomatic": "He followed in attacking and taking Wan and Rang, settling seventeen counties."
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "別將攻旬關，定漢中。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Separately lead attack Xun Guan, settle Han middle.",
              "idiomatic": "He separately led in attacking Xunguan and settling Hanzhong."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yu died, his son Han Xian succeeded him. When Xian died, his son Han Jia succeeded him. When Jia died, his son Han Hong succeeded him. When Hong died, his son Han Yi succeeded him. When Yi died, his son Han An succeeded him. When An died, his son Han Rong succeeded him. When Rong died, his son Han Xu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "項羽滅秦，立沛公為漢王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu extinguish Qin, establish Pei gong as Han wang.",
              "idiomatic": "Xiang Yu extinguished Qin and established the Duke of Pei as King of Han."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "漢王賜商爵信成君，以將軍為隴西都尉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang grant Shang nobility Xin Cheng jun, with general as Long Xi commandery captain.",
              "idiomatic": "The Han king granted Shang the nobility title of Lord Xincheng, and as a general made him Commandery Captain of Longxi."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "別將定北地、上郡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Separately lead settle Bei Di, Shang jun.",
              "idiomatic": "He separately led in settling Beidi and Shangjun."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "破雍將軍焉氏，周類軍栒邑，蘇駔軍於泥陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Break Yong general Yan Shi, Zhou Lei army Yu Yi, Su Ju army at Ni Yang.",
              "idiomatic": "He broke the Yong general Yan Shi, Zhou Lei's army at Yuyi, and Su Ju's army at Niyang."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "賜食邑武成六千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grant food fief Wu Cheng six thousand households.",
              "idiomatic": "He was granted a food fief of six thousand households in Wucheng."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "以隴西都尉從擊項籍軍五月，出鉅野，與鐘離眛戰，疾鬬，受梁相國印，益食邑四千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With Long Xi commandery captain follow strike Xiang Ji army five months, exit Ju Ye, with Zhong Li Mo battle, fierce fight, receive Liang prime minister seal, increase food fief four thousand households.",
              "idiomatic": "As Commandery Captain of Longxi he followed in striking Xiang Ji's army for five months, exited Juye, battled with Zhongli Mo, fought fiercely, received the Liang prime minister's seal, and was granted an additional food fief of four thousand households."
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "以梁相國將從擊項羽二歲三月，攻胡陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With Liang prime minister lead follow strike Xiang Yu two years three months, attack Hu Ling.",
              "idiomatic": "As Liang prime minister he led in following the attack on Xiang Yu for two years and three months, attacking Huling."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xu died, his son Han Sui succeeded him. When Sui died, his son Han Duan succeeded him. When Duan died, his son Han Chen succeeded him. When Chen died, his son Han Yi succeeded him. When Yi died, his son Han Zhao succeeded him. When Zhao died, his son Han Yan succeeded him. When Yan died, his son Han Qiang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "項羽既已死，漢王為帝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu already die, Han wang become emperor.",
              "idiomatic": "After Xiang Yu had died, the Han king became emperor."
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "其秋，燕王臧荼反，商以將軍從擊荼，戰龍脫，先登陷陣，破荼軍易下，卻敵，遷為右丞相，賜爵列侯，與諸侯剖符，世世勿絕，食邑涿五千戶，號曰涿侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Its autumn, Yan wang Zang Tu rebel, Shang with general follow strike Tu, battle Long Tuo, first ascend break array, break Tu army Yi Xia, repel enemy, move as right chancellor, grant nobility ranked marquis, with various marquises split tally, generation generation not cut off, food fief Zhu five thousand households, title called Zhu marquis.",
              "idiomatic": "That autumn, Yan king Zang Tu rebelled. Shang as a general followed in striking Tu, battled at Longtuo, was first to ascend and break the battle array, broke Tu's army at Yixia, repelled the enemy, was moved to Right Chancellor, granted the nobility rank of Ranked Marquis, given a split tally with the various marquises for generations without end, granted a food fief of five thousand households in Zhu, and titled Marquis of Zhu."
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "以右丞相別定上谷，因攻代，受趙相國印。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With right chancellor separately settle Shang Gu, then attack Dai, receive Zhao prime minister seal.",
              "idiomatic": "As Right Chancellor he separately settled Shanggu, then attacked Dai, and received the Zhao prime minister's seal."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "以右丞相趙相國別與絳侯等定代、鴈門，得代丞相程縱、守相郭同、將軍已下至六百石十九人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With right chancellor Zhao prime minister separately with Jiang marquis etc settle Dai, Yan Men, obtain Dai chancellor Cheng Zong, defender chancellor Guo Tong, generals already below to six hundred stone nineteen people.",
              "idiomatic": "As Right Chancellor and Zhao prime minister he separately, together with the Jiang marquis and others, settled Dai and Yanmen, obtaining the Dai chancellor Cheng Zong, defender chancellor Guo Tong, and generals and others down to six hundred stone, nineteen people."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "還，以將軍為太上皇衛一歲七月。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return, with general be Tai Shang Huang guard one year seven months.",
              "idiomatic": "Upon returning, as a general he guarded the Taishang Huang for one year and seven months."
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "以右丞相擊陳豨，殘東垣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With right chancellor strike Chen Xi, damage Dong Yuan.",
              "idiomatic": "As Right Chancellor he struck Chen Xi and damaged Dongyuan."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "又以右丞相從高帝擊黥布，攻其前拒，陷兩陳，得以破布軍，更食曲周五千一百戶，除前所食，凡別破軍三，降定郡六，縣七十三，得丞相、守相、大將各一人，小將二人，二千石已下至六百石十九人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again with right chancellor follow Gao Di strike Qing Bu, attack his front resistance, break two battle arrays, able break Bu army, change food Qu Zhou five thousand one hundred households, remove previous food, altogether separately break armies three, surrender settle commanderies six, counties seventy three, obtain chancellor, defender chancellor, great general each one, small generals two, two thousand stone already below to six hundred stone nineteen people.",
              "idiomatic": "Again as Right Chancellor he followed Gao Di in striking Qing Bu, attacked his forward resistance, broke two battle arrays, thereby breaking Bu's army. He was granted a changed food fief of five thousand one hundred households in Quzhou, with previous food grants removed. In total he separately broke three armies, surrendered and settled six commanderies and seventy-three counties, obtained one chancellor, one defender chancellor, one great general, two small generals, and nineteen officials from two thousand stone down to six hundred stone."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Qiang died, his son Han Yan succeeded him. When Yan died, his son Han Wu succeeded him. When Wu died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Jie succeeded him. When Jie died, his son Han Min succeeded him. When Min died, his son Han Zhi succeeded him. When Zhi died, his son Han Fu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "商事孝惠、高后時，商病，不治。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Shang serve Xiao Hui, Gao empress time, Shang ill, not cure.",
              "idiomatic": "Shang served during the time of Xiaohui and Gao empress. Shang became ill and did not recover."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "其子寄，字況，與呂祿善。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His son Ji, style Kuang, with Lu Lu good.",
              "idiomatic": "His son Ji, styled Kuang, was on good terms with Lu Lu."
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "及高后崩，大臣欲誅諸呂，呂祿為將軍，軍於北軍，太尉勃不得入北軍，於是乃使人劫酈商，令其子況紿呂祿，呂祿信之，故與出游，而太尉勃乃得入據北軍，遂誅諸呂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Reach Gao empress collapse, great ministers wish execute various Lu, Lu Lu as general, army at north army, grand commander Bo not able enter north army, then then send person coerce Li Shang, order his son Kuang deceive Lu Lu, Lu Lu believe it, therefore with out tour, but grand commander Bo then able enter occupy north army, then execute various Lu.",
              "idiomatic": "When Gao empress passed away, the great ministers wished to execute the various Lu clan members. Lu Lu was a general stationed with the northern army. Grand Commander Bo could not enter the northern army. Therefore they sent people to coerce Li Shang, ordering his son Kuang to deceive Lu Lu. Lu Lu believed it and went out touring with him. Thus Grand Commander Bo was able to enter and occupy the northern army, and they executed the various Lu clan members."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "是歲商卒，謚為景侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "This year Shang die, posthumous title as Jing marquis.",
              "idiomatic": "That year Shang died and was posthumously titled Marquis Jing."
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "子寄代侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Ji replace marquis.",
              "idiomatic": "His son Ji succeeded as marquis."
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "天下稱酈況賣交也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "World call Li Kuang sell friendship.",
              "idiomatic": "The world called Li Kuang one who sold out his friendships."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Fu died, his son Han Xian succeeded him. When Xian died, his son Han Yu succeeded him. When Yu died, his son Han Kang succeeded him. When Kang died, his son Han He succeeded him. When He died, his son Han Qi succeeded him. When Qi died, his son Han Yuan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "孝景前三年，吳、楚、齊、趙反，上以寄為將軍，圍趙城，十月不能下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Jing before three year, Wu, Chu, Qi, Zhao rebel, sovereign with Ji as general, besiege Zhao city, ten month not able take.",
              "idiomatic": "In the third year before Xiaojing, Wu, Chu, Qi, and Zhao rebelled. The sovereign made Ji a general to besiege Zhao city, but could not take it in ten months."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "得俞侯欒布自平齊來，乃下趙城，滅趙，王自殺，除國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Obtain Yu marquis Luan Bu from pacify Qi come, then take Zhao city, extinguish Zhao, wang suicide, eliminate state.",
              "idiomatic": "He obtained Yu marquis Luan Bu coming from pacifying Qi, then took Zhao city, extinguished Zhao, the king committed suicide, and the state was abolished."
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "孝景中二年，寄欲取平原君為夫人，景帝怒，下寄吏，有罪，奪侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Jing middle two year, Ji wish take Ping Yuan jun as wife, Jing emperor angry, send Ji to officials, have crime, seize marquis.",
              "idiomatic": "In the second year of the middle period of Xiaojing, Ji wished to take the Lord of Pingyuan as his wife. The Jing emperor was angry, sent Ji to the officials, he had crimes, and his marquisate was seized."
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "景帝乃以商他子堅封為繆侯，續酈氏後。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Jing emperor then with Shang other son Jian enfeoff as Miao marquis, continue Li clan after.",
              "idiomatic": "The Jing emperor then enfeoffed Shang's other son Jian as Marquis Miao to continue the Li clan lineage."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "繆靖侯卒，子康侯遂成立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Miao Jing marquis die, son Kang marquis Sui Cheng establish.",
              "idiomatic": "Marquis Miao Jing died, and his son Sui Cheng was established as Marquis Kang."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "遂成卒，子懷侯世宗立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Sui Cheng die, son Huai marquis Shi Zong establish.",
              "idiomatic": "Sui Cheng died, and his son Shi Zong was established as Marquis Huai."
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "世宗卒，子侯終根立，為太常，坐法，國除。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Shi Zong die, son marquis Zhong Gen establish, be grand master of ceremonies, sit law, state eliminate.",
              "idiomatic": "Shi Zong died, and his son Zhong Gen was established as marquis. He became Grand Master of Ceremonies but was convicted by law, and the state was abolished."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yuan died, his son Han Mao succeeded him. When Mao died, his son Han Bao succeeded him. When Bao died, his son Han Xun succeeded him. When Xun died, his son Han Ji succeeded him. When Ji died, his son Han Ying succeeded him. When Ying died, his son Han Huang succeeded him. When Huang died, his son Han Kui succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0136",
          "zh": "汝陰侯夏侯嬰，沛人也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ru Yin marquis Xia Hou Ying, Pei person.",
              "idiomatic": "Xiahou Ying, Marquis of Ruyin, was a man from Pei."
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "為沛廄司御。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Be Pei stable manager charioteer.",
              "idiomatic": "He was the stable manager and charioteer for Pei."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "每送使客還，過沛泗上亭，與高祖語，未嘗不移日也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Each send envoy guests return, pass Pei Si upper pavilion, with Gao Zu speak, never not move day.",
              "idiomatic": "Each time he sent envoy guests returning, passing by the upper pavilion on the Si River in Pei, he would speak with Gaozu, and never failed to spend the whole day."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "嬰已而試補縣吏，與高祖相愛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying then test fill county official, with Gao Zu mutually love.",
              "idiomatic": "Ying then tested and filled a county official position, and was mutually fond of Gaozu."
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "高祖戲而傷嬰，人有告高祖。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Zu play and wound Ying, person have inform Gao Zu.",
              "idiomatic": "Gaozu playfully wounded Ying, and someone informed on Gaozu."
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "高祖時為亭長，重坐傷人，告故不傷嬰，嬰證之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Zu at time be pavilion chief, heavy sit wound person, inform reason not wound Ying, Ying prove it.",
              "idiomatic": "At the time Gaozu was pavilion chief and was heavily convicted for wounding someone. He informed that it was not intentional to wound Ying, and Ying testified for him."
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "後獄覆，嬰坐高祖系歲餘，掠笞數百，終以是脫高祖。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After prison review, Ying sit Gao Zu bind year more, flog cane several hundred, finally with this release Gao Zu.",
              "idiomatic": "After the prison case was reviewed, Ying was imprisoned because of Gaozu for over a year, flogged and caned several hundred times, but in the end this released Gaozu."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Kui died, his son Han Yong succeeded him. When Yong died, his son Han Xi succeeded him. When Xi died, his son Han Yan succeeded him. When Yan died, his son Han Jing succeeded him. When Jing died, his son Han Fang succeeded him. When Fang died, his son Han Xun succeeded him. When Xun died, his son Han Zhu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0143",
          "zh": "高祖之初與徒屬欲攻沛也，嬰時以縣令史為高祖使。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Zu beginning with followers wish attack Pei, Ying at time with county magistrate secretary be Gao Zu envoy.",
              "idiomatic": "At the beginning when Gaozu with his followers wished to attack Pei, Ying at the time as county magistrate secretary became Gaozu's envoy."
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "上降沛一日，高祖為沛公，賜嬰爵七大夫，以為太仆。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Sovereign descend Pei one day, Gao Zu become Pei gong, grant Ying nobility seven grand master, with as grand servant.",
              "idiomatic": "The sovereign descended on Pei for one day. Gaozu became Duke of Pei, granted Ying the nobility rank of Seven Grand Masters, and made him Grand Servant."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "從攻胡陵，嬰與蕭何降泗水監平，平以胡陵降，賜嬰爵五大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Hu Ling, Ying with Xiao He surrender Si water supervisor Ping, Ping with Hu Ling surrender, grant Ying nobility five grand master.",
              "idiomatic": "He followed in attacking Huling. Ying together with Xiao He surrendered the Si water supervisor Ping, who surrendered Huling, and Ying was granted the nobility rank of Five Grand Masters."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "從擊秦軍碭東，攻濟陽，下戶牖，破李由軍雍丘下，以兵車趣攻戰疾，賜爵執帛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow strike Qin army Dang east, attack Ji Yang, take Hu You, break Li You army Yong Qiu below, with war chariot hasten attack battle fierce, grant nobility hold silk.",
              "idiomatic": "He followed in striking the Qin army east of Dang, attacked Jiyang, took Huyou, broke Li You's army below Yongqiu, hastened with war chariots to attack fiercely in battle, and was granted the nobility rank of Silk Holder."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "常以太仆奉車從擊章邯軍東阿、濮陽下，以兵車趣攻戰疾，破之，賜爵執珪。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Often with grand servant attend chariot follow strike Zhang Han army Dong E, Pu Yang below, with war chariot hasten attack battle fierce, break it, grant nobility hold jade tablet.",
              "idiomatic": "He often as Grand Servant attending the chariot followed in striking Zhang Han's army at Dong'e and below Puyang, hastened with war chariots to attack fiercely in battle, broke them, and was granted the nobility rank of Jade Tablet Holder."
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "復常奉車從擊趙賁軍開封，楊熊軍曲遇。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again often attend chariot follow strike Zhao Ben army Kai Feng, Yang Xiong army Qu Yu.",
              "idiomatic": "Again he often attended the chariot following in striking Zhao Ben's army at Kaifeng and Yang Xiong's army at Quyu."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "嬰從捕虜六十八人，降卒八百五十人，得印一匱。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying follow capture captives sixty eight people, surrender soldiers eight hundred fifty people, obtain seals one box.",
              "idiomatic": "Ying followed and captured sixty-eight captives, obtained eight hundred fifty surrendering soldiers, and got one box of seals."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "因復常奉車從擊秦軍雒陽東，以兵車趣攻戰疾，賜爵封轉為滕公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then again often attend chariot follow strike Qin army Luo Yang east, with war chariot hasten attack battle fierce, grant nobility enfeoff turn as Teng gong.",
              "idiomatic": "He then again often attended the chariot following in striking the Qin army east of Luoyang, hastened with war chariots to attack fiercely in battle, and was granted nobility with enfeoffment turned to Duke of Teng."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "因復奉車從攻南陽，戰於藍田、芷陽，以兵車趣攻戰疾，至霸上。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then again attend chariot follow attack Nan Yang, battle at Lan Tian, Zhi Yang, with war chariot hasten attack battle fierce, arrive Ba Shang.",
              "idiomatic": "He then again attended the chariot following in attacking Nanyang, battled at Lantian and Zhiyang, hastened with war chariots to attack fiercely in battle, and arrived at Bashang."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "項羽至，滅秦，立沛公為漢王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu arrive, extinguish Qin, establish Pei gong as Han wang.",
              "idiomatic": "Xiang Yu arrived, extinguished Qin, and established the Duke of Pei as King of Han."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "漢王賜嬰爵列侯，號昭平侯，復為太仆，從入蜀、漢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang grant Ying nobility ranked marquis, title Zhao Ping marquis, again be grand servant, follow enter Shu, Han.",
              "idiomatic": "The Han king granted Ying the nobility rank of Ranked Marquis, titled Marquis of Zhaoping, again made him Grand Servant, and he followed in entering Shu and Han."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Zhu died, his son Han Wei succeeded him. When Wei died, his son Han Liang succeeded him. When Liang died, his son Han Kang succeeded him. When Kang died, his son Han Sheng succeeded him. When Sheng died, his son Han Xiang succeeded him. When Xiang died, his son Han Peng succeeded him. When Peng died, his son Han Qu succeeded him. When Qu died, his son Han Quan succeeded him. When Quan died, his son Han Ping succeeded him. When Ping died, his son Han Fu succeeded him. When Fu died, his son Han Gong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0154",
          "zh": "還定三秦，從擊項籍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return settle three Qin, follow strike Xiang Ji.",
              "idiomatic": "He returned to settle the Three Qin, and followed in striking Xiang Ji."
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "至彭城，項羽大破漢軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive Peng Cheng, Xiang Yu greatly break Han army.",
              "idiomatic": "They arrived at Pengcheng where Xiang Yu greatly broke the Han army."
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "漢王敗，不利，馳去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang defeat, unfavorable, gallop go.",
              "idiomatic": "The Han king was defeated and unfavorable, so he galloped away."
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "見孝惠、魯元，載之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "See Xiao Hui, Lu Yuan, load them.",
              "idiomatic": "He saw Xiaohui and Lu Yuan and loaded them on board."
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "漢王急，馬罷，虜在後，常蹶兩兒欲棄之，嬰常收，竟載之，徐行面雍樹乃馳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang urgent, horse tired, captives behind, often kick two children wish abandon them, Ying often gather, finally load them, slow walk face Yong tree then gallop.",
              "idiomatic": "The Han king was urgent, the horse was tired, captives were behind, he often kicked the two children wanting to abandon them, but Ying always gathered them back, finally loaded them on, and they proceeded slowly until facing a willow tree, then galloped."
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "漢王怒，行欲斬嬰者十餘，卒得脫，而致孝惠、魯元於豐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang angry, march wish behead Ying ten more, finally able escape, but deliver Xiao Hui, Lu Yuan to Feng.",
              "idiomatic": "The Han king was angry, and during the march wished to behead Ying more than ten times, but they finally escaped, and delivered Xiaohui and Lu Yuan to Feng."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Gong died, his son Han Yan succeeded him. When Yan died, his son Han Ling succeeded him. When Ling died, his son Han Zhou succeeded him. When Zhou died, his son Han Tai succeeded him. When Tai died, his son Han Cheng succeeded him. When Cheng died, his son Han Xuan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0160",
          "zh": "漢王既至滎陽，收散兵，復振，賜嬰食祈陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang already arrive Xing Yang, gather scattered soldiers, again flourish, grant Ying food Qi Yang.",
              "idiomatic": "The Han king already arrived at Xingyang, gathered the scattered soldiers, flourished again, and granted Ying food fief at Qiyang."
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "復常奉車從擊項籍，追至陳，卒定楚，至魯，益食茲氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again often attend chariot follow strike Xiang Ji, pursue arrive Chen, finally settle Chu, arrive Lu, increase food Zi Shi.",
              "idiomatic": "He again often attended the chariot following in striking Xiang Ji, pursued to Chen, finally settled Chu, arrived at Lu, and was granted additional food fief at Zishi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xuan died, his son Han Ji succeeded him. When Ji died, his son Han Yin succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0162",
          "zh": "漢王立為帝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang establish as emperor.",
              "idiomatic": "The Han king was established as emperor."
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "其秋，燕王臧荼反，嬰以太仆從擊荼。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Its autumn, Yan wang Zang Tu rebel, Ying with grand servant follow strike Tu.",
              "idiomatic": "That autumn, Yan king Zang Tu rebelled, and Ying as Grand Servant followed in striking Tu."
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "明年，從至陳，取楚王信。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Next year, follow arrive Chen, take Chu wang Xin.",
              "idiomatic": "The next year, he followed to Chen and took Chu king Xin."
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "更食汝陰，剖符世世勿絕。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Change food Ru Yin, split tally generation generation not cut off.",
              "idiomatic": "He was granted a changed food fief at Ruyin, with a split tally for generations without end."
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "以太仆從擊代，至武泉、雲中，益食千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With grand servant follow strike Dai, arrive Wu Quan, Yun Zhong, increase food thousand households.",
              "idiomatic": "As Grand Servant he followed in striking Dai, arrived at Wuquan and Yunzhong, and was granted an additional food fief of one thousand households."
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "因從擊韓信軍胡騎晉陽旁，大破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then follow strike Han Xin army barbarian cavalry Jin Yang beside, greatly break it.",
              "idiomatic": "He then followed in striking Han Xin's army of barbarian cavalry beside Jinyang, and greatly broke them."
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "追北至平城，為胡所圍，七日不得通。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pursue north arrive Ping Cheng, be barbarian surrounded, seven days not able pass through.",
              "idiomatic": "He pursued north to Pingcheng, was surrounded by the barbarians, and could not pass through for seven days."
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "高帝使使厚遺閼氏，冒頓開圍一角。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di make envoy thick give Yan Zhi, Mao Dun open siege one corner.",
              "idiomatic": "The Gao Emperor sent envoys to thickly gift Yanzhi, and Maodun opened one corner of the siege."
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "高帝出欲馳，嬰固徐行，弩皆持滿外向，卒得脫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di out wish gallop, Ying firmly slow walk, crossbows all hold full outward face, finally able escape.",
              "idiomatic": "The Gao Emperor wanted to go out and gallop, but Ying firmly proceeded slowly, with all the crossbows held full facing outward, and they finally escaped."
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "益食嬰細陽千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Increase food Ying Xi Yang thousand households.",
              "idiomatic": "He was granted an additional food fief of one thousand households at Xiyang for Ying."
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "復以太仆從擊胡騎句注北，大破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again with grand servant follow strike barbarian cavalry Gou Zhu north, greatly break it.",
              "idiomatic": "Again as Grand Servant he followed in striking the barbarian cavalry north of Gouzhu, and greatly broke them."
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "以太仆擊胡騎平城南，三陷陳，功為多，賜所奪邑五百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With grand servant strike barbarian cavalry Ping Cheng south, three break battle arrays, merit be many, grant captured fief five hundred households.",
              "idiomatic": "As Grand Servant he struck the barbarian cavalry south of Pingcheng, broke battle arrays three times, his merit was great, and he was granted five hundred households from captured fiefs."
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "以太仆擊陳豨、黥布軍，陷陳卻敵，益食千戶，定食汝陰六千九百戶，除前所食。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With grand servant strike Chen Xi, Qing Bu army, break battle array repel enemy, increase food thousand households, settle food Ru Yin six thousand nine hundred households, remove previous food.",
              "idiomatic": "As Grand Servant he struck Chen Xi and Qing Bu's army, broke battle arrays and repelled the enemy, was granted an additional food fief of one thousand households, settled his food fief at Ruyin with six thousand nine hundred households, and previous food grants were removed."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yin died, his son Han Xi succeeded him. When Xi died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Kai succeeded him. When Kai died, his son Han Hao succeeded him. When Hao died, his son Han Yong succeeded him. When Yong died, his son Han Jing succeeded him. When Jing died, his son Han Guang succeeded him. When Guang died, his son Han Tao succeeded him. When Tao died, his son Han Song succeeded him. When Song died, his son Han Chen succeeded him. When Chen died, his son Han Yang succeeded him. When Yang died, his son Han Jun succeeded him. When Jun died, his son Han Yu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0175",
          "zh": "嬰自上初起沛，常為太仆，竟高祖崩。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying from sovereign begin rise Pei, often be grand servant, end Gao Zu collapse.",
              "idiomatic": "Ying from when the sovereign began rising at Pei, often served as Grand Servant, until Gaozu's collapse."
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "以太仆事孝惠。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With grand servant serve Xiao Hui.",
              "idiomatic": "He served Xiaohui as Grand Servant."
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "孝惠帝及高后德嬰之脫孝惠、魯元於下邑之閒也，乃賜嬰縣北第第一，曰「近我」，以尊異之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Hui emperor and Gao empress virtue Ying of release Xiao Hui, Lu Yuan from lower city between, then grant Ying county north mansion first, say near me, with honor distinguish it.",
              "idiomatic": "The Xiaohui emperor and Gao empress were virtuous toward Ying for rescuing Xiaohui and Lu Yuan from between the lower cities, so they granted Ying the first mansion north of the county, saying 'Near me,' to honor and distinguish him."
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "孝惠帝崩，以太仆事高后。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Hui emperor collapse, with grand servant serve Gao empress.",
              "idiomatic": "After the Xiaohui emperor collapsed, he served Gao empress as Grand Servant."
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "高后崩，代王之來，嬰以太仆與東牟侯入清宮，廢少帝，以天子法駕迎代王代邸，與大臣共立為孝文皇帝，復為太仆。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao empress collapse, Dai wang come, Ying with grand servant and Dong Mou marquis enter clear palace, abolish young emperor, with emperor ritual chariot welcome Dai wang Dai residence, with great ministers together establish as Xiao Wen emperor, again be grand servant.",
              "idiomatic": "After Gao empress collapsed and the King of Dai came, Ying as Grand Servant together with the Marquis of Dongmou entered the clear palace, abolished the young emperor, used the emperor's ritual chariot to welcome the King of Dai to the Dai residence, and together with the great ministers established him as the Xiaowen emperor, again serving as Grand Servant."
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "八歲卒，謚為文侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Eight years die, posthumous title as Wen marquis.",
              "idiomatic": "He died after eight years, posthumously titled Marquis Wen."
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "子夷侯灶立，七年卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Yi marquis Zao establish, seven years die.",
              "idiomatic": "His son Zao was established as Marquis Yi, and died after seven years."
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "子共侯賜立，三十一年卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Gong marquis Ci establish, thirty one years die.",
              "idiomatic": "His son Ci was established as Marquis Gong, and died after thirty-one years."
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "子侯頗尚平陽公主。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son marquis Po marry Ping Yang princess.",
              "idiomatic": "His son Po the marquis married the Princess of Pingyang."
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "立十九歲，元鼎二年，坐與父御婢姦罪，自殺，國除。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Establish nineteen years, Yuan Ding two year, sit with father imperial concubine adultery crime, suicide, state eliminate.",
              "idiomatic": "He was established for nineteen years. In the second year of Yuanding, convicted of adultery with his father's imperial concubine, he committed suicide, and the state was abolished."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yu died, his son Han Quan succeeded him. When Quan died, his son Han Xiang succeeded him. When Xiang died, his son Han Qiang succeeded him. When Qiang died, his son Han Jie succeeded him. When Jie died, his son Han Bo succeeded him. When Bo died, his son Han Lian succeeded him. When Lian died, his son Han Rong succeeded him. When Rong died, his son Han Xin succeeded him. When Xin died, his son Han Wei succeeded him. When Wei died, his son Han Sheng succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0185",
          "zh": "潁陰侯灌嬰者，睢陽販繒者也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying Yin marquis Guan Ying person, Sui Yang sell silk person.",
              "idiomatic": "Guan Ying, Marquis of Yingyin, was a silk merchant from Suiyang."
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "高祖之為沛公，略地至雍丘下，章邯敗殺項梁，而沛公還軍於碭，嬰初以中涓從擊破東郡尉於成武及秦軍於扛裏，疾鬬，賜爵七大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Zu of be Pei gong, raid land arrive Yong Qiu below, Zhang Han defeat kill Xiang Liang, but Pei gong return army at Dang, Ying begin with inner attendant follow strike break Dong jun captain at Cheng Wu and Qin army at Gang Li, fierce fight, grant nobility seven grand master.",
              "idiomatic": "When Gaozu was Duke of Pei, raiding territory he arrived below Yongqiu. Zhang Han defeated and killed Xiang Liang, so the Duke of Pei returned his army to Dang. Ying at first as inner attendant followed in striking and breaking the Dongjun captain at Chengwu and the Qin army at Gangli, fought fiercely, and was granted the nobility rank of Seven Grand Masters."
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "從攻秦軍亳南、開封、曲遇，戰疾力，賜爵執帛，號宣陵君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Qin army Bo south, Kai Feng, Qu Yu, battle fierce strength, grant nobility hold silk, title Xuan Ling jun.",
              "idiomatic": "He followed in attacking the Qin army south of Bo, Kaifeng, and Quyu, battled with fierce strength, was granted the nobility rank of Silk Holder, and titled Lord of Xuanling."
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "從攻陽武以西至雒陽，破秦軍尸北，北絕河津，南破南陽守齮陽城東，遂定南陽郡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow attack Yang Wu west to Luo Yang, break Qin army Shi north, north cut off river ford, south break Nan Yang defender Yi Yang city east, then settle Nan Yang commandery.",
              "idiomatic": "He followed in attacking from Yangwu west to Luoyang, broke the Qin army north of Shi, cut off the river ford to the north, broke the Nanyang defender east of Yiyang city to the south, and thus settled the Nanyang commandery."
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "西入武關，戰於藍田，疾力，至霸上，賜爵執珪，號昌文君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "West enter Wu Guan, battle at Lan Tian, fierce strength, arrive Ba Shang, grant nobility hold jade tablet, title Chang Wen jun.",
              "idiomatic": "He entered west through Wuguan, battled at Lantian with fierce strength, arrived at Bashang, was granted the nobility rank of Jade Tablet Holder, and titled Lord of Changwen."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Sheng died, his son Han Yi succeeded him. When Yi died, his son Han Liang succeeded him. When Liang died, his son Han Jun succeeded him. When Jun died, his son Han Kai succeeded him. When Kai died, his son Han Hao succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "沛公立為漢王，拜嬰為郎中，從入漢中，十月，拜為中謁者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pei gong establish as Han wang, appoint Ying as court gentleman, follow enter Han middle, ten month, appoint as middle announcer.",
              "idiomatic": "The Duke of Pei was established as King of Han, appointed Ying as Court Gentleman, followed in entering Hanzhong, and after ten months was appointed as Middle Announcer."
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "從還定三秦，下櫟陽，降塞王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow return settle three Qin, take Li Yang, surrender Sai wang.",
              "idiomatic": "He followed in returning to settle the Three Qin, took Liyang, and surrendered the King of Sai."
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "還圍章邯於廢丘，未拔。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return besiege Zhang Han at Fei Qiu, not take.",
              "idiomatic": "He returned to besiege Zhang Han at Fei Qiu, but did not take it."
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "從東出臨晉關，擊降殷王，定其地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow east exit Lin Jin guan, strike surrender Yin wang, settle its land.",
              "idiomatic": "He followed in going east out of Linjin Pass, struck and surrendered the King of Yin, settling his territory."
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "擊項羽將龍且、魏相項他軍定陶南，疾戰，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike Xiang Yu general Long Ju, Wei chancellor Xiang Ta army Ding Tao south, fierce battle, break it.",
              "idiomatic": "He struck Xiang Yu's general Long Ju and Wei chancellor Xiang Ta's army south of Dingtao, battled fiercely, and broke them."
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "賜嬰爵列侯，號昌文侯，食杜平鄉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grant Ying nobility ranked marquis, title Chang Wen marquis, food Du Ping township.",
              "idiomatic": "He granted Ying the nobility rank of Ranked Marquis, titled Marquis of Changwen, with food fief at Duping township."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Hao died, his son Han Hong succeeded him. When Hong died, his son Han Li succeeded him. When Li died, his son Han Tong succeeded him. When Tong died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0196",
          "zh": "復以中謁者從降下碭，以至彭城。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again with middle announcer follow surrender take Dang, to arrive Peng Cheng.",
              "idiomatic": "Again as Middle Announcer he followed in surrendering and taking Dang, arriving at Pengcheng."
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "項羽擊，大破漢王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu strike, greatly break Han wang.",
              "idiomatic": "Xiang Yu struck and greatly broke the Han king."
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "漢王遁而西，嬰從還，軍於雍丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang flee and west, Ying follow return, army at Yong Qiu.",
              "idiomatic": "The Han king fled west, Ying followed in returning, and stationed his army at Yongqiu."
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "王武、魏公申徒反，從擊破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang Wu, Wei gong Shen Tu rebel, follow strike break it.",
              "idiomatic": "Wang Wu and Wei duke Shen Tu rebelled, and he followed in striking and breaking them."
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "攻下黃，西收兵，軍於滎陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack take Huang, west gather soldiers, army at Xing Yang.",
              "idiomatic": "He attacked and took Huang, gathered soldiers to the west, and stationed his army at Xingyang."
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "楚騎來眾，漢王乃擇軍中可為（車）騎將者，皆推故秦騎士重泉人李必、駱甲習騎兵，今為校尉，可為騎將。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chu cavalry come numerous, Han wang then select army middle can be cavalry general, all push former Qin cavalry soldier Chong Quan person Li Bi, Luo Jia practiced cavalry, now be commandery captain, can be cavalry general.",
              "idiomatic": "The Chu cavalry came in great numbers. The Han king then selected from the army those who could serve as cavalry generals. All recommended the former Qin cavalry soldiers Li Bi and Luo Jia of Chongquan who were skilled with cavalry and now served as commandery captains, saying they could be cavalry generals."
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "漢王欲拜之，必、甲曰：「臣故秦民，恐軍不信臣，臣願得大王左右善騎者傅之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang wish appoint them, Bi, Jia say: Minister former Qin people, fear army not trust minister, minister wish obtain great wang left right good cavalry teach them.",
              "idiomatic": "The Han king wished to appoint them. Li Bi and Luo Jia said: 'We ministers are former Qin people. We fear the army will not trust us. We wish to obtain Your Majesty's attendants who are skilled with cavalry to teach them.'"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "灌嬰雖少，然數力戰，乃拜灌嬰為中大夫，令李必、駱甲為左右校尉，將郎中騎兵擊楚騎於滎陽東，大破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Guan Ying though young, however several times strength battle, then appoint Guan Ying as middle grand master, order Li Bi, Luo Jia as left right commandery captains, lead court gentleman cavalry strike Chu cavalry at Xing Yang east, greatly break it.",
              "idiomatic": "Although Guan Ying was young, he had battled fiercely several times. He was then appointed Middle Grand Master, and Li Bi and Luo Jia were made Left and Right Commandery Captains. Leading the court gentleman's cavalry, they struck the Chu cavalry east of Xingyang and greatly broke them."
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "受詔別擊楚軍後，絕其餉道，起陽武至襄邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Receive decree separately strike Chu army rear, cut off their provisions road, rise Yang Wu arrive Xiang Yi.",
              "idiomatic": "He received a decree to separately strike the Chu army's rear, cutting off their provisions road, from Yangwu to Xiangyi."
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "擊項羽之將項冠於魯下，破之，所將卒斬右司馬、騎將各一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike Xiang Yu of general Xiang Guan at Lu below, break it, what lead soldiers behead right marshal, cavalry general each one.",
              "idiomatic": "He struck Xiang Yu's general Xiang Guan below Lu, broke him, and the soldiers he led beheaded one Right Marshal and one cavalry general each."
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "擊破柘公王武，軍於燕西，所將卒斬樓煩將五人，連尹一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike break Zhe gong Wang Wu, army at Yan west, what lead soldiers behead Lou Fan general five people, Lian Yin one.",
              "idiomatic": "He struck and broke Duke Zhe Wang Wu, stationed his army west of Yan, and the soldiers he led beheaded five Loufan generals and one Lian Yin."
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "擊王武別將桓嬰白馬下，破之，所將卒斬都尉一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Strike Wang Wu separate general Huan Ying Bai Ma below, break it, what lead soldiers behead commandery captain one.",
              "idiomatic": "He struck Wang Wu's separate general Huan Ying below Baima, broke him, and the soldiers he led beheaded one commandery captain."
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "以騎渡河南，送漢王到雒陽，使北迎相國韓信軍於邯鄲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With cavalry cross He south, send Han wang arrive Luo Yang, make north welcome prime minister Han Xin army at Han Dan.",
              "idiomatic": "With cavalry he crossed south of the He, sent the Han king to Luoyang, and went north to welcome Prime Minister Han Xin's army at Handan."
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "還至敖倉，嬰遷為御史大夫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return arrive Ao Cang, Ying move as censor grand master.",
              "idiomatic": "Upon returning to Aocang, Ying was moved to the position of Censor Grand Master."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Guang succeeded him. When Guang died, his son Han Cheng succeeded him. When Cheng died, his son Han Ji succeeded him. When Ji died, his son Han Yu succeeded him. When Yu died, his son Han Tai succeeded him. When Tai died, his son Han Fu succeeded him. When Fu died, his son Han Fan succeeded him. When Fan died, his son Han Yan succeeded him. When Yan died, his son Han Yi succeeded him. When Yi died, his son Han Xin succeeded him. When Xin died, his son Han Jie succeeded him. When Jie died, his son Han Lian succeeded him. When Lian died, his son Han Guang succeeded him. When Guang died, his son Han Kai succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0210",
          "zh": "三年，以列侯食邑杜平鄉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Three years, with ranked marquis food fief Du Ping township.",
              "idiomatic": "After three years, as Ranked Marquis he was granted food fief at Duping township."
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "以御史大夫受詔將郎中騎兵東屬相國韓信，擊破齊軍於歷下，所將卒虜車騎將軍華毋傷及將吏四十六人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With censor grand master receive decree lead court gentleman cavalry east belong prime minister Han Xin, strike break Qi army at Li Xia, what lead soldiers capture chariot cavalry general Hua Wu Shang and generals officials forty six people.",
              "idiomatic": "As Censor Grand Master he received a decree to lead the court gentleman's cavalry east to join Prime Minister Han Xin, struck and broke the Qi army at Lixia, and the soldiers he led captured the chariot cavalry general Hua Wushang and forty-six generals and officials."
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "降下臨菑，得齊守相田光。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Surrender take Lin Zi, obtain Qi defender chancellor Tian Guang.",
              "idiomatic": "He surrendered and took Linzi, obtaining the Qi defender chancellor Tian Guang."
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "追齊相田橫至嬴、博，破其騎，所將卒斬騎將一人，生得騎將四人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pursue Qi chancellor Tian Heng arrive Ying, Bo, break his cavalry, what lead soldiers behead cavalry general one, alive obtain cavalry general four.",
              "idiomatic": "He pursued Qi chancellor Tian Heng to Ying and Bo, broke his cavalry, and the soldiers he led beheaded one cavalry general and captured four cavalry generals alive."
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "攻下嬴、博，破齊將軍田吸於千乘，所將卒斬吸。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack take Ying, Bo, break Qi general Tian Xi at Qian Cheng, what lead soldiers behead Xi.",
              "idiomatic": "He attacked and took Ying and Bo, broke Qi general Tian Xi at Qiancheng, and the soldiers he led beheaded Xi."
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "東從韓信攻龍且、留公旋於高密，卒斬龍且，生得右司馬、連尹各一人，樓煩將十人，身生得亞將周蘭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "East follow Han Xin attack Long Ju, Liu gong Xuan at Gao Mi, soldiers behead Long Ju, alive obtain right marshal, Lian Yin each one, Lou Fan general ten, personally alive obtain deputy general Zhou Lan.",
              "idiomatic": "Following Han Xin east, he attacked Long Ju and Duke Liu Xuan at Gaomi. The soldiers beheaded Long Ju, captured alive one Right Marshal and one Lian Yin each, ten Loufan generals, and he personally captured deputy general Zhou Lan alive."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Kai died, his son Han Sheng succeeded him. When Sheng died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Qiang succeeded him. When Qiang died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Hong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "齊地已定，韓信自立為齊王，使嬰別將擊楚將公杲於魯北，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi land already settle, Han Xin self establish as Qi wang, make Ying separately lead strike Chu general Gong Gao at Lu north, break it.",
              "idiomatic": "Once the Qi lands were settled, Han Xin established himself as King of Qi and sent Ying to separately lead in striking Chu general Gong Gao north of Lu, breaking him."
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "轉南，破薛郡長，身虜騎將一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Turn south, break Xue commandery chief, personally capture cavalry general one.",
              "idiomatic": "Turning south, he broke Xue commandery chief and personally captured one cavalry general."
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "攻（博）［傅］陽，前至下相以東南僮、取慮、徐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Fu Yang, advance arrive Xia Xiang southeast Tong, take Lu, Xu.",
              "idiomatic": "He attacked Fuyang, advanced to southeast of Xiaxiang at Tong, and took Lu and Xu."
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "度淮，盡降其城邑，至廣陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Cross Huai, exhaust surrender their city towns, arrive Guang Ling.",
              "idiomatic": "He crossed the Huai and completely surrendered their city towns, arriving at Guangling."
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "項羽使項聲、薛公、郯公復定淮北。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu make Xiang Sheng, Xue gong, Tan gong again settle Huai north.",
              "idiomatic": "Xiang Yu sent Xiang Sheng, Duke Xue, and Duke Tan to again settle north of the Huai."
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "嬰度淮北，擊破項聲、郯公下邳，斬薛公，下下邳，擊破楚騎於平陽，遂降彭城，虜柱國項佗，降留、薛、沛、酂、蕭、相。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying cross Huai north, strike break Xiang Sheng, Tan gong Xia Pi, behead Xue gong, take Xia Pi, strike break Chu cavalry at Ping Yang, then surrender Peng Cheng, capture pillar state Xiang Tuo, surrender Liu, Xue, Pei, Zuo, Xiao, Xiang.",
              "idiomatic": "Ying crossed north of the Huai, struck and broke Xiang Sheng and Duke Tan at Xiapi, beheaded Duke Xue, took Xiapi, struck and broke Chu cavalry at Pingyang, then surrendered Pengcheng, captured Pillar State Xiang Tuo, and surrendered Liu, Xue, Pei, Zuo, Xiao, and Xiang."
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "攻苦、譙，復得亞將周蘭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack Ku, Qiao, again obtain deputy general Zhou Lan.",
              "idiomatic": "He attacked Ku and Qiao, and again obtained deputy general Zhou Lan."
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "與漢王會頤鄉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With Han wang meet Yi Xiang.",
              "idiomatic": "He met with the Han king at Yixiang."
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "從擊項籍軍於陳下，破之，所將卒斬樓煩將二人，虜騎將八人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow strike Xiang Ji army at Chen below, break it, what lead soldiers behead Lou Fan general two, capture cavalry general eight.",
              "idiomatic": "He followed in striking Xiang Ji's army below Chen, broke it, and the soldiers he led beheaded two Loufan generals and captured eight cavalry generals."
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "賜益食邑二千五百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grant increase food fief two thousand five hundred households.",
              "idiomatic": "He was granted an additional food fief of two thousand five hundred households."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Hong died, his son Han Sheng succeeded him. When Sheng died, his son Han Wei succeeded him. When Wei died, his son Han Tao succeeded him. When Tao died, his son Han Jun succeeded him. When Jun died, his son Han Ji succeeded him. When Ji died, his son Han Quan succeeded him. When Quan died, his son Han Xun succeeded him. When Xun died, his son Han Bo succeeded him. When Bo died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Jie succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0226",
          "zh": "項籍敗垓下去也，嬰以御史大夫受詔將車騎別追項籍至東城，破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Ji defeat Gai Xia go, Ying with censor grand master receive decree lead chariots cavalry separately pursue Xiang Ji arrive Dong Cheng, break it.",
              "idiomatic": "After Xiang Ji was defeated and fled from Gaixia, Ying as Censor Grand Master received a decree to lead chariots and cavalry separately pursuing Xiang Ji to Dongcheng, breaking him."
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "所將卒五人共斬項籍，皆賜爵列侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "What lead soldiers five people together behead Xiang Ji, all grant nobility ranked marquis.",
              "idiomatic": "Five of the soldiers he led together beheaded Xiang Ji, and all were granted the nobility rank of Ranked Marquis."
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "降左右司馬各一人，卒萬二千人，盡得其軍將吏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Surrender left right marshals each one, soldiers twelve thousand, exhaust obtain their army generals officials.",
              "idiomatic": "He surrendered one Left Marshal and one Right Marshal each, twelve thousand soldiers, and completely obtained their army's generals and officials."
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "下東城、歷陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Take Dong Cheng, Li Yang.",
              "idiomatic": "He took Dongcheng and Liyang."
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "渡江，破吳郡長吳下，得吳守，遂定吳、豫章、會稽郡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Cross Jiang, break Wu commandery chief Wu below, obtain Wu defender, then settle Wu, Yu Zhang, Hui Ji commanderies.",
              "idiomatic": "He crossed the Jiang, broke Wu commandery chief below Wu, obtained the Wu defender, and thus settled the Wu, Yuzhang, and Huiji commanderies."
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "還定淮北，凡五十二縣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return settle Huai north, altogether fifty two counties.",
              "idiomatic": "He returned to settle north of the Huai, for a total of fifty-two counties."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him. When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0232",
          "zh": "漢王立為皇帝，賜益嬰邑三千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han wang establish as emperor, grant increase Ying fief three thousand households.",
              "idiomatic": "The Han king was established as emperor, and granted Ying an additional fief of three thousand households."
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "其秋，以車騎將軍從擊破燕王臧荼。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Its autumn, with chariot cavalry general follow strike break Yan wang Zang Tu.",
              "idiomatic": "That autumn, as Chariot Cavalry General he followed in striking and breaking Yan king Zang Tu."
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "明年，從至陳，取楚王信。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Next year, follow arrive Chen, take Chu wang Xin.",
              "idiomatic": "The next year, he followed to Chen and took Chu king Xin."
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "還，剖符，世世勿絕，食潁陰二千五百戶，號曰潁陰侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Return, split tally, generation generation not cut off, food Ying Yin two thousand five hundred households, title called Ying Yin marquis.",
              "idiomatic": "He returned, received a split tally for generations without end, food fief of two thousand five hundred households at Yingyin, and was titled Marquis of Yingyin."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Quan died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0236",
          "zh": "以車騎將軍從擊反韓王信於代，至馬邑，受詔別降樓煩以北六縣，斬代左相，破胡騎於武泉北。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With chariot cavalry general follow strike rebel Han wang Xin at Dai, arrive Ma Yi, receive decree separately surrender Lou Fan north six counties, behead Dai left chancellor, break barbarian cavalry at Wu Quan north.",
              "idiomatic": "As Chariot Cavalry General he followed in striking the rebelling Han king Xin at Dai, arrived at Maiyi, received a decree to separately surrender six counties north of Loufan, beheaded the Dai left chancellor, and broke barbarian cavalry north of Wuquan."
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "復從擊韓信胡騎晉陽下，所將卒斬胡白題將一人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again follow strike Han Xin barbarian cavalry Jin Yang below, what lead soldiers behead barbarian white forehead general one.",
              "idiomatic": "He again followed in striking Han Xin's barbarian cavalry below Jinyang, and the soldiers he led beheaded one barbarian general with a white forehead mark."
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "受詔并將燕、趙、齊、梁、楚車騎，擊破胡騎於硰石。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Receive decree together lead Yan, Zhao, Qi, Liang, Chu chariots cavalry, strike break barbarian cavalry at Kong Shi.",
              "idiomatic": "He received a decree to together lead the chariots and cavalry of Yan, Zhao, Qi, Liang, and Chu, striking and breaking barbarian cavalry at Kongshi."
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "至平城，為胡所圍，從還軍東垣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive Ping Cheng, be barbarian surrounded, follow return army Dong Yuan.",
              "idiomatic": "He arrived at Pingcheng and was surrounded by barbarians, following in returning the army to Dongyuan."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0240",
          "zh": "從擊陳豨，受詔別攻豨丞相侯敞軍曲逆下，破之，卒斬敞及特將五人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Follow strike Chen Xi, receive decree separately attack Xi chancellor Hou Chang army Qu Ni below, break it, soldiers behead Chang and special generals five.",
              "idiomatic": "He followed in striking Chen Xi, received a decree to separately attack Xi's chancellor Hou Chang's army below Qu Ni, broke it, and the soldiers beheaded Chang and five special generals."
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "降曲逆、盧奴、上曲陽、安國、安平。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Surrender Qu Ni, Lu Nu, Shang Qu Yang, An Guo, An Ping.",
              "idiomatic": "He surrendered Qu Ni, Lu Nu, Shang Qu Yang, An Guo, and An Ping."
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "攻下東垣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Attack take Dong Yuan.",
              "idiomatic": "He attacked and took Dongyuan."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Quan died, his son Han Xin succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "黥布反，以車騎將軍先出，攻布別將於相，破之，斬亞將樓煩將三人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qing Bu rebel, with chariot cavalry general first out, attack Bu separate general at Xiang, break it, behead deputy general Lou Fan general three.",
              "idiomatic": "When Qing Bu rebelled, as Chariot Cavalry General he went out first, attacked Bu's separate general at Xiang, broke him, and beheaded three deputy generals and Loufan generals."
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "又進擊破布上柱國軍及大司馬軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again advance strike break Bu upper pillar state army and great marshal army.",
              "idiomatic": "He again advanced and struck, breaking Bu's Upper Pillar State army and Great Marshal army."
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "又進破布別將肥誅。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Again advance break Bu separate general Fei Zhu.",
              "idiomatic": "He again advanced and broke Bu's separate general Fei Zhu."
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "嬰身生得左司馬一人，所將卒斬其小將十人，追北至淮上。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying personally alive obtain left marshal one, what lead soldiers behead their small generals ten, pursue north arrive Huai above.",
              "idiomatic": "Ying personally captured one Left Marshal alive, the soldiers he led beheaded ten of their small generals, and pursued north to the Huai."
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "益食二千五百戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Increase food two thousand five hundred households.",
              "idiomatic": "He was granted an additional food fief of two thousand five hundred households."
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "布已破，高帝歸，定令嬰食穎陰五千戶，除前所食邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Bu already broken, Gao Di return, settle order Ying food Ying Yin five thousand households, remove previous food fief.",
              "idiomatic": "After Bu was broken and the Gao Emperor returned, he settled on ordering Ying a food fief of five thousand households at Yingyin, removing his previous food fief."
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "凡從得二千石二人，別破軍十六，降城四十六，定國一，郡二，縣五十二，得將軍二人，柱國、相國各一人，二千石十人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Altogether follow obtain two thousand stone two, separately break armies sixteen, surrender cities forty six, settle states one, commanderies two, counties fifty two, obtain generals two, pillar state, prime minister each one, two thousand stone ten.",
              "idiomatic": "In total he followed and obtained two officials of two thousand stone, separately broke sixteen armies, surrendered forty-six cities, settled one state, two commanderies, and fifty-two counties, obtained two generals, one Pillar State and one Prime Minister each, and ten officials of two thousand stone."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "嬰自破布歸，高帝崩，嬰以列侯事孝惠帝及呂太后。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying from break Bu return, Gao Di collapse, Ying with ranked marquis serve Xiao Hui emperor and Lu empress dowager.",
              "idiomatic": "After Ying returned from breaking Bu, the Gao Emperor collapsed, and Ying as Ranked Marquis served the Xiaohui emperor and Empress Dowager Lu."
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "太后崩，呂祿等以趙王自置為將軍，軍長安，為亂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress dowager collapse, Lu Lu etc with Zhao wang self appoint as generals, army Chang An, make rebellion.",
              "idiomatic": "After the Empress Dowager collapsed, Lu Lu and others, using the King of Zhao, appointed themselves generals, stationed troops at Chang'an, and caused rebellion."
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "齊哀王聞之，舉兵西，且入誅不當為王者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi Ai wang hear it, raise troops west, and enter execute not should be wang ones.",
              "idiomatic": "When the King of Qi Ai heard this, he raised troops and went west, intending to enter and execute those who should not be kings."
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "上將軍呂祿等聞之，乃遣嬰為大將，將軍往擊之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Supreme general Lu Lu etc hear it, then send Ying as great general, lead army go strike it.",
              "idiomatic": "The Supreme General Lu Lu and others heard this and sent Ying as great general to lead troops and go strike them."
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "嬰行至滎陽，乃與絳侯等謀，因屯兵滎陽，風齊王以誅呂氏事，齊兵止不前。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Ying march arrive Xing Yang, then with Jiang marquis etc plot, then station troops Xing Yang, secretly inform Qi wang with execute Lu clan matters, Qi troops stop not advance.",
              "idiomatic": "Ying marched to Xingyang, then plotted with the Jiang marquis and others, stationed troops at Xingyang, and secretly informed the King of Qi about executing the Lu clan, so the Qi troops stopped and did not advance."
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "絳侯等既誅諸呂，齊王罷兵歸，嬰亦罷兵自滎陽歸，與絳侯、陳平共立代王為孝文皇帝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Jiang marquis etc already execute various Lu, Qi wang disband troops return, Ying also disband troops from Xing Yang return, with Jiang marquis, Chen Ping together establish Dai wang as Xiao Wen emperor.",
              "idiomatic": "After the Jiang marquis and others executed the various Lu clan members, the King of Qi disbanded his troops and returned. Ying also disbanded his troops and returned from Xingyang, together with the Jiang marquis and Chen Ping establishing the King of Dai as Emperor Xiaowen."
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "孝文皇帝於是益封嬰三千戶，賜黃金千斤，拜為太尉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Wen emperor then increase enfeoff Ying three thousand households, grant yellow gold thousand jin, appoint as grand marshal.",
              "idiomatic": "Emperor Xiaowen then increased Ying's enfeoffment by three thousand households, granted him one thousand jin of yellow gold, and appointed him Grand Marshal."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Xin died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "三歲，絳侯勃免相就國，嬰為丞相，罷太尉官。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Three years, Jiang marquis Bo resign chancellor go to state, Ying become chancellor, dismiss grand marshal office.",
              "idiomatic": "After three years, the Jiang marquis Bo resigned as chancellor and went to his state. Ying became chancellor and dismissed his grand marshal office."
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "是歲，匈奴大入北地、上郡，令丞相嬰將騎八萬五千往擊匈奴。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "This year, Xiongnu greatly enter Bei Di, Shang jun, order chancellor Ying lead cavalry eighty five thousand go strike Xiongnu.",
              "idiomatic": "That year, the Xiongnu greatly entered Beidi and Shangjun. They ordered Chancellor Ying to lead eighty-five thousand cavalry to go strike the Xiongnu."
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "匈奴去，濟北王反，詔乃罷嬰之兵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiongnu go, Ji Bei wang rebel, decree then dismiss Ying of troops.",
              "idiomatic": "The Xiongnu left, but the King of Jibei rebelled, so the decree dismissed Ying's troops."
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "後歲餘，嬰以丞相卒，謚曰懿侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After year more, Ying with chancellor die, posthumous title called Yi marquis.",
              "idiomatic": "After more than a year, Ying died as chancellor, posthumously titled Marquis Yi."
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "子平侯阿代侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Son Ping marquis A replace marquis.",
              "idiomatic": "His son A succeeded as Marquis Ping."
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "二十八年卒，子彊代侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Twenty eight years die, son Jiang replace marquis.",
              "idiomatic": "He died after twenty-eight years, and his son Jiang succeeded as marquis."
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "十三年，彊有罪，絕二歲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Thirteen years, Jiang have crime, cut off two years.",
              "idiomatic": "After thirteen years, Jiang committed a crime and the line was cut off for two years."
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "元光三年，天子封灌嬰孫賢為臨汝侯，續灌氏後，八歲，坐行賕有罪，國除。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yuan Guang three year, Son of Heaven enfeoff Guan Ying grandson Xian as Lin Ru marquis, continue Guan clan after, eight years, sit practice bribe have crime, state eliminate.",
              "idiomatic": "In the third year of Yuanguang, the Son of Heaven enfeoffed Guan Ying's grandson Xian as Marquis of Linru to continue the Guan clan lineage. After eight years, convicted of bribery, the state was abolished."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him. When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Xin died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0265",
          "zh": "太史公曰：吾適豐沛，問其遺老，觀故蕭、曹、樊噲、滕公之家，及其素，異哉所聞！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grand Historian say: I visit Feng Pei, ask their surviving elders, observe former Xiao, Cao, Fan Kuai, Teng gong of homes, and their plainness, different what heard!",
              "idiomatic": "The Grand Historian says: I visited Feng and Pei, asked their surviving elders, observed the former homes of Xiao, Cao, Fan Kuai, and Duke Teng, and their plainness. How different from what I had heard!"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "方其鼓刀屠狗賣繒之時，豈自知附驥之尾，垂名漢廷，德流子孫哉？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When their beat knife butcher dogs sell silk time, how self know attach fine horse tail, hang name Han court, virtue flow descendants?",
              "idiomatic": "When they were beating knives, butchering dogs, and selling silk, how could they have known they would attach to the tail of a fine horse, hang their names in the Han court, and have their virtue flow to their descendants?"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "余與他廣通，為言高祖功臣之興時若此云。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "I with Ta Guang communicate, for speak Gao Zu merit ministers of rise time like this cloud.",
              "idiomatic": "I communicated with Ta Guang in order to speak of how Gaozu's merit ministers rose in such times."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}