{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "114",
    "url": "https://chinesenotes.com/shiji/shiji114.html",
    "title": {
      "zh": "東越列傳",
      "en": "Treatise on the Eastern Yue",
      "raw": "《東越列傳》 Treatise on the Eastern Yue"
    },
    "sentenceCount": 82,
    "translatedCount": 82,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:44.402Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "閩越王無諸及越東海王搖者，其先皆越王句踐之後也，姓騶氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Min Yue wang Wu Zhu and Yue Dong Hai wang Yao, their first all Yue wang Gou Jian after, surname Zou shi.",
              "idiomatic": "Min Yue king Wu Zhu and Yue Dong Hai king Yao: their ancestors were all descendants of Yue king Gou Jian, of the Zou clan."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "秦已并天下，皆廢為君長，以其地為閩中郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Qin already bing tian xia, all free become jun zhang, with their land become Min Zhong jun.",
              "idiomatic": "After Qin unified the empire, it deposed them as rulers and made their lands Minzhong commandery."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "及諸侯畔秦，無諸、搖率越歸鄱陽令吳芮，所謂鄱君者也，從諸侯滅秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Reach various hou pan Qin, Wu Zhu, Yao lead Yue return Po Yang ling Wu Rui, place call Po Jun, follow various hou extinguish Qin.",
              "idiomatic": "When the feudal lords rebelled against Qin, Wu Zhu and Yao led the Yue people to submit to Poyang magistrate Wu Rui—the one called Lord Po—and followed the feudal lords in overthrowing Qin."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "當是之時，項籍主命，弗王，以故不附楚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "When this time, Xiang Ji zhu ming, not wang, with reason not attach Chu.",
              "idiomatic": "At this time, Xiang Ji controlled the mandate and did not enfeoff them as kings, so they did not attach themselves to Chu."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "漢擊項籍，無諸、搖率越人佐漢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Han strike Xiang Ji, Wu Zhu, Yao lead Yue person zu Han.",
              "idiomatic": "When Han attacked Xiang Ji, Wu Zhu and Yao led the Yue people to aid Han."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "漢五年，復立無諸為閩越王，王閩中故地，都東冶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Han five years, again establish Wu Zhu become Min Yue wang, wang Min Zhong old land, capital Dong Ye.",
              "idiomatic": "In the fifth year of Han, Wu Zhu was again established as Min Yue king, ruling the old Minzhong lands with his capital at Dongye."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "孝惠三年，舉高帝時越功，曰閩君搖功多，其民便附，乃立搖為東海王，都東甌，世俗號為東甌王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Xiao Hui three years, raise Gao Di time Yue merit, said Min Jun Yao merit many, their people convenient attach, then establish Yao become Dong Hai wang, capital Dong Ou, world custom number become Dong Ou wang.",
              "idiomatic": "In the third year of Emperor Hui, recognizing the Yue merits from the time of Gao Di, it was said that Lord Yao of Min had many merits and his people were conveniently attached, so Yao was established as Dong Hai king with his capital at Dong'ou, which the common people called the Dong'ou king."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Min Yue king Wu Zhu and Yue Dong Hai king Yao: their ancestors were all descendants of Yue king Gou Jian, of the Zou clan. After Qin unified the empire, it deposed them as rulers and made their lands Minzhong commandery. When the feudal lords rebelled against Qin, Wu Zhu and Yao led the Yue people to submit to Poyang magistrate Wu Rui—the one called Lord Po—and followed the feudal lords in overthrowing Qin. At this time, Xiang Ji controlled the mandate and did not enfeoff them as kings, so they did not attach themselves to Chu. When Han attacked Xiang Ji, Wu Zhu and Yao led the Yue people to aid Han. In the fifth year of Han, Wu Zhu was again established as Min Yue king, ruling the old Minzhong lands with his capital at Dongye. In the third year of Emperor Hui, recognizing the Yue merits from the time of Gao Di, it was said that Lord Yao of Min had many merits and his people were conveniently attached, so Yao was established as Dong Hai king with his capital at Dong'ou, which the common people called the Dong'ou king.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "後數世，至孝景三年，吳王濞反，欲從閩越，閩越未肯行，獨東甌從吳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "After number world, reach Xiao Jing three years, Wu wang Bi rebel, desire follow Min Yue, Min Yue not willing go, alone Dong Ou follow Wu.",
              "idiomatic": "Several generations later, in the third year of Emperor Jing, King Bi of Wu rebelled and wanted to join with Min Yue, but Min Yue refused to go along, and only Dong'ou followed Wu."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "及吳破，東甌受漢購，殺吳王丹徒，以故皆得不誅，歸國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Reach Wu break, Dong Ou receive Han gou, kill Wu wang Dan Tu, with reason all obtain not zhu, return country.",
              "idiomatic": "When Wu was defeated, Dong'ou accepted Han's bounty and killed King Bi of Wu at Dantu, and therefore all escaped execution and returned to their kingdoms."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Several generations later, in the third year of Emperor Jing, King Bi of Wu rebelled and wanted to join with Min Yue, but Min Yue refused to go along, and only Dong'ou followed Wu. When Wu was defeated, Dong'ou accepted Han's bounty and killed King Bi of Wu at Dantu, and therefore all escaped execution and returned to their kingdoms.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "吳王子子駒亡走閩越，怨東甌殺其父，常勸閩越擊東甌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Wu wang zi Zi Ju perish walk Min Yue, resent Dong Ou kill its father, constant advise Min Yue strike Dong Ou.",
              "idiomatic": "Prince Ziju of Wu fled to Min Yue, resented Dong'ou for killing his father, and constantly urged Min Yue to attack Dong'ou."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "至建元三年，閩越發兵圍東甌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Reach Jian Yuan three years, Min Yue send troops surround Dong Ou.",
              "idiomatic": "In the third year of Jian Yuan, Min Yue sent troops to besiege Dong'ou."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "東甌食盡，困，且降，乃使人告急天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Dong Ou food exhaust, kun, and descend, then make person tell urgent tian zi.",
              "idiomatic": "Dong'ou ran out of food, was in dire straits, and was about to surrender, so sent envoys to urgently report to the Son of Heaven."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "天子問太尉田蚡，蚡對曰：「越人相攻擊，固其常，又數反覆，不足以煩中國往救也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Tian zi ask tai wei Tian Fen, Fen answer said: 'Yue person each attack strike, certainly their constant, again number fan fu, not sufficient fan Zhong Guo go save.'",
              "idiomatic": "The Son of Heaven consulted Grand Commandant Tian Fen, who replied: 'The Yue people attacking each other is certainly their custom, and they have repeatedly been fickle, so it is not worth troubling China to go save them."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "自秦時棄弗屬。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Self Qin time abandon not belong.'",
              "idiomatic": "Since Qin times they have been abandoned and not governed.'"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "於是中大夫莊助詰蚡曰：「特患力弗能救，德弗能覆；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Then zhong da fu Zhuang Zhu jie Fen said: 'Special huan strength not able save, de not able cover;",
              "idiomatic": "Then Zhong Dafu Zhuang Zhu interrogated Fen: 'The special worry is not that strength cannot save them, nor that virtue cannot cover them;"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "誠能，何故棄之？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Cheng able, what reason abandon it?",
              "idiomatic": "If we truly can, why abandon them?"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "且秦舉咸陽而棄之，何乃越也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "And Qin raise Xian Yang yet abandon it, what then Yue!",
              "idiomatic": "Moreover, Qin took Xianyang and abandoned it—how much more so with Yue!"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "今小國以窮困來告急天子，天子弗振，彼當安所告愬？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Now small country with poor kun come tell urgent tian zi, tian zi not zhen, bi dang settle place tell su?",
              "idiomatic": "Now a small kingdom comes to urgently report distress to the Son of Heaven, and if the Son of Heaven does not revive it, where should they go to make their complaints?"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "又何以子萬國乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Again what with govern wan country?'",
              "idiomatic": "And how then to govern the ten thousand kingdoms?'"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "上曰：「太尉未足與計。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Shang said: 'Tai wei not sufficient with plan.",
              "idiomatic": "The emperor said: 'The Grand Commandant is not sufficient to plan with."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "吾初即位，不欲出虎符發兵郡國。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "I initial ji wei, not desire out hu fu send troops jun country.'",
              "idiomatic": "I have just ascended the throne and do not wish to issue tiger tallies to mobilize troops from the commanderies and kingdoms.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "乃遣莊助以節發兵會稽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Then send Zhuang Zhu with jie send troops Hui Ji.",
              "idiomatic": "Then dispatched Zhuang Zhu with credentials to mobilize troops from Kuaiji.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "會稽太守欲距不為發兵，助乃斬一司馬，諭意指，遂發兵浮海救東甌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Hui Ji tai shou desire ju not become send troops, Zhu then zhan one si ma, yu yi zhi, sui send troops fu hai save Dong Ou.",
              "idiomatic": "The Kuaiji Grand Administrator wanted to resist and not send troops, but Zhu executed one Colonel and made clear his intentions, so troops were sent sailing across the sea to save Dong'ou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "未至，閩越引兵而去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Not arrive, Min Yue lead troops go.",
              "idiomatic": "Before they arrived, Min Yue led troops away.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "東甌請舉國徙中國，乃悉舉眾來，處江淮之閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Dong Ou please raise country move Zhong Guo, then all raise zhong come, chu Jiang Huai zhi jian.",
              "idiomatic": "Dong'ou requested to move the entire kingdom to China, so they all moved their people and settled between the Jiang and Huai rivers.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Prince Ziju of Wu fled to Min Yue, resented Dong'ou for killing his father, and constantly urged Min Yue to attack Dong'ou. In the third year of Jian Yuan, Min Yue sent troops to besiege Dong'ou. Dong'ou ran out of food, was in dire straits, and was about to surrender, so sent envoys to urgently report to the Son of Heaven. The Son of Heaven consulted Grand Commandant Tian Fen, who replied: 'The Yue people attacking each other is certainly their custom, and they have repeatedly been fickle, so it is not worth troubling China to go save them. Since Qin times they have been abandoned and not governed.' Then Zhong Dafu Zhuang Zhu interrogated Fen: 'The special worry is not that strength cannot save them, nor that virtue cannot cover them; If we truly can, why abandon them? Moreover, Qin took Xianyang and abandoned it—how much more so with Yue! Now a small kingdom comes to urgently report distress to the Son of Heaven, and if the Son of Heaven does not revive it, where should they go to make their complaints? And how then to govern the ten thousand kingdoms?' The emperor said: 'The Grand Commandant is not sufficient to plan with. I have just ascended the throne and do not wish to issue tiger tallies to mobilize troops from the commanderies and kingdoms.' Then dispatched Zhuang Zhu with credentials to mobilize troops from Kuaiji. The Kuaiji Grand Administrator wanted to resist and not send troops, but Zhu executed one Colonel and made clear his intentions, so troops were sent sailing across the sea to save Dong'ou. Before they arrived, Min Yue led troops away. Dong'ou requested to move the entire kingdom to China, so they all moved their people and settled between the Jiang and Huai rivers.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0026",
          "zh": "至建元六年，閩越擊南越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Reach Jian Yuan six years, Min Yue strike Nan Yue.",
              "idiomatic": "In the sixth year of Jian Yuan, Min Yue attacked Nan Yue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "南越守天子約，不敢擅發兵擊而以聞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Nan Yue shou tian zi yue, not dare shan send troops strike yet with hear.",
              "idiomatic": "Nan Yue observed the Son of Heaven's covenant and did not dare arbitrarily send troops to attack, but reported it instead.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "上遣大行王恢出豫章，大農韓安國出會稽，皆為將軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Shang send da xing Wang Hui out Yu Zhang, da nong Han An Guo out Hui Ji, all become jiang jun.",
              "idiomatic": "The emperor dispatched Grand Messenger Wang Hui from Yuzhang and Grand Provisioner Han An Guo from Kuaiji, both as generals.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "兵未踰嶺，閩越王郢發兵距險。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Troops not yu ling, Min Yue wang Ying send troops ju xian.",
              "idiomatic": "Before the troops crossed the ranges, Min Yue king Ying sent troops to block the defiles.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "其弟餘善乃與相、宗族謀曰：「王以擅發兵擊南越，不請，故天子兵來誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Its di Yu Shan then with xiang, zong zu plan said: 'Wang with shan send troops strike Nan Yue, not request, therefore tian zi troops come zhu.'",
              "idiomatic": "His younger brother Yu Shan then plotted with the chancellor and clansmen, saying: 'The king arbitrarily sent troops to attack Nan Yue without permission, so the Son of Heaven's troops have come to execute him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "今漢兵眾彊，今即幸勝之，后來益多，終滅國而止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Now Han troops zhong qiang, now ji xing win it, after come yi duo, zhong extinguish country yet stop.",
              "idiomatic": "Now the Han troops are numerous and strong; if we luckily defeat them now, more will come later, and it will end with the kingdom's destruction.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "今殺王以謝天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Now kill wang to apologize tian zi.",
              "idiomatic": "Now let us kill the king to apologize to the Son of Heaven.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "天子聽，罷兵，固一國完；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Tian zi listen, stop troops, certainly one country complete;",
              "idiomatic": "If the Son of Heaven listens, he will dismiss the troops and certainly preserve the kingdom intact;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "不聽，乃力戰；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Not listen, then strength battle;",
              "idiomatic": "If he does not listen, then we will fight with all our strength;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "不勝，即亡入海。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Not win, ji perish enter sea.'",
              "idiomatic": "If we do not win, we will flee into the sea.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "皆曰「善」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "All said 'good'.",
              "idiomatic": "All said: 'Good.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "即鏦殺王，使使奉其頭致大行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Ji chan kill wang, make shi honor its head give da xing.",
              "idiomatic": "Immediately assassinated the king and sent envoys to present his head to the Grand Messenger.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "大行曰：「所為來者誅王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Da xing said: 'Place for come ones zhu wang.'",
              "idiomatic": "The Grand Messenger said: 'What we came for was to execute the king.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "今王頭至，謝罪，不戰而耘，利莫大焉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Now wang head arrive, apologize crime, not battle yet yun, li mo da yan.'",
              "idiomatic": "Now that the king's head has arrived and they have apologized for their crimes, we can avoid battle and reap the harvest—there is no greater advantage.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "乃以便宜案兵告大農軍，而使使奉王頭馳報天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Then with convenient an troops tell da nong army, yet make shi honor wang head chi report tian zi.",
              "idiomatic": "Then, acting on his own discretion, he halted the troops and informed the Grand Provisioner's army, while sending envoys to present the king's head and gallop to report to the Son of Heaven.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "詔罷兩將兵，曰：「郢等首惡，獨無諸孫繇君丑不與謀焉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Zhao stop two generals troops, said: 'Ying etc. first evil, alone Wu Zhu grandson Rou Jun Chou not participate plan.'",
              "idiomatic": "An edict dismissed the two generals' troops, saying: 'Ying and the others were the chief culprits, only Wu Zhu's grandson Lord Rou Chou did not participate in the plotting.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "乃使郎中將立丑為越繇王，奉閩越先祭祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Then make lang zhong jiang establish Chou become Yue Rou wang, honor Min Yue first sacrifices.",
              "idiomatic": "Then sent a Palace Attendant in charge of cavalry to establish Chou as Yue Rou king, to maintain the ancestral sacrifices of Min Yue.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth year of Jian Yuan, Min Yue attacked Nan Yue. Nan Yue observed the Son of Heaven's covenant and did not dare arbitrarily send troops to attack, but reported it instead. The emperor dispatched Grand Messenger Wang Hui from Yuzhang and Grand Provisioner Han An Guo from Kuaiji, both as generals. Before the troops crossed the ranges, Min Yue king Ying sent troops to block the defiles. His younger brother Yu Shan then plotted with the chancellor and clansmen, saying: 'The king arbitrarily sent troops to attack Nan Yue without permission, so the Son of Heaven's troops have come to execute him. Now the Han troops are numerous and strong; if we luckily defeat them now, more will come later, and it will end with the kingdom's destruction.' Now let us kill the king to apologize to the Son of Heaven.' If the Son of Heaven listens, he will dismiss the troops and certainly preserve the kingdom intact; If he does not listen, then we will fight with all our strength; If we do not win, we will flee into the sea.' All said: 'Good.' Immediately assassinated the king and sent envoys to present his head to the Grand Messenger. The Grand Messenger said: 'What we came for was to execute the king. Now that the king's head has arrived and they have apologized for their crimes, we can avoid battle and reap the harvest—there is no greater advantage.' Then, acting on his own discretion, he halted the troops and informed the Grand Provisioner's army, while sending envoys to present the king's head and gallop to report to the Son of Heaven. An edict dismissed the two generals' troops, saying: 'Ying and the others were the chief culprits, only Wu Zhu's grandson Lord Rou Chou did not participate in the plotting.' Then sent a Palace Attendant in charge of cavalry to establish Chou as Yue Rou king, to maintain the ancestral sacrifices of Min Yue.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "餘善已殺郢，威行於國，國民多屬，竊自立為王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yu Shan already kill Ying, wei walk yu country, country people many belong, steal self establish become wang.",
              "idiomatic": "Yu Shan had already killed Ying, his authority ran throughout the kingdom, many of the people attached to him, so he secretly established himself as king.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "繇王不能矯其眾持正。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Rou wang not able jiao its zhong hold zheng.",
              "idiomatic": "King Rou was unable to correct his followers and hold to righteousness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "天子聞之，為餘善不足復興師，曰：「餘善數與郢謀亂，而後首誅郢，師得不勞。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Tian zi hear it, for Yu Shan not sufficient again rise shi, said: 'Yu Shan number with Ying plan chaos, yet after first zhu Ying, shi obtain not lao.'",
              "idiomatic": "When the Son of Heaven heard of it, he considered Yu Shan not worth raising troops again for, saying: 'Yu Shan repeatedly plotted rebellion with Ying, but then was the first to execute Ying, so the troops were spared labor.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "因立餘善為東越王，與繇王并處。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Because establish Yu Shan become Dong Yue wang, with Rou wang bing chu.",
              "idiomatic": "Therefore established Yu Shan as Dong Yue king, to dwell alongside King Rou.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yu Shan had already killed Ying, his authority ran throughout the kingdom, many of the people attached to him, so he secretly established himself as king. King Rou was unable to correct his followers and hold to righteousness. When the Son of Heaven heard of it, he considered Yu Shan not worth raising troops again for, saying: 'Yu Shan repeatedly plotted rebellion with Ying, but then was the first to execute Ying, so the troops were spared labor.' Therefore established Yu Shan as Dong Yue king, to dwell alongside King Rou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0047",
          "zh": "至元鼎五年，南越反，東越王餘善上書，請以卒八千人從樓船將軍擊呂嘉等。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Reach Yuan Ding five years, Nan Yue rebel, Dong Yue wang Yu Shan shang shu, please with troops eight thousand follow Lou Chuan jiang jun strike Lu Jia etc.",
              "idiomatic": "In the fifth year of Yuan Ding, when Nan Yue rebelled, Dong Yue king Yu Shan submitted a memorial requesting to lead eight thousand troops to follow General Lou Chuan in attacking Lu Jia and the others.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "兵至揭揚，以海風波為解，不行，持兩端，陰使南越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Troops reach Jie Yang, with sea wind wave become excuse, not go, hold two ends, yin make Nan Yue.",
              "idiomatic": "When the troops reached Jieyang, he used rough seas as an excuse not to proceed, played both sides, and secretly communicated with Nan Yue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "及漢破番禺，不至。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Reach Han break Pan Yu, not arrive.",
              "idiomatic": "When Han broke Panyu, he did not arrive.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "是時樓船將軍楊仆使使上書，願便引兵擊東越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "This time Lou Chuan jiang jun Yang Pu make shi shang shu, wish convenient lead troops strike Dong Yue.",
              "idiomatic": "At this time, General Lou Chuan Yang Pu sent an envoy to submit a memorial, wishing to conveniently lead troops to attack Dong Yue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "上曰士卒勞倦，不許，罷兵，令諸校屯豫章梅領待命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Shang said shi zu lao juan, not allow, stop troops, order various xiao tun Yu Zhang Mei Ling wait ming.",
              "idiomatic": "The emperor said the soldiers were weary and tired, did not permit it, dismissed the troops, and ordered the various officers to encamp at Yuzhang Meiling to await orders.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth year of Yuan Ding, when Nan Yue rebelled, Dong Yue king Yu Shan submitted a memorial requesting to lead eight thousand troops to follow General Lou Chuan in attacking Lu Jia and the others. When the troops reached Jieyang, he used rough seas as an excuse not to proceed, played both sides, and secretly communicated with Nan Yue. When Han broke Panyu, he did not arrive. At this time, General Lou Chuan Yang Pu sent an envoy to submit a memorial, wishing to conveniently lead troops to attack Dong Yue. The emperor said the soldiers were weary and tired, did not permit it, dismissed the troops, and ordered the various officers to encamp at Yuzhang Meiling to await orders.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "元鼎六年秋，餘善聞樓船請誅之，漢兵臨境，且往，乃遂反，發兵距漢道。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yuan Ding six years autumn, Yu Shan hear Lou Chuan request zhu it, Han troops lin jing, and go, then sui rebel, send troops ju Han dao.",
              "idiomatic": "In the autumn of the sixth year of Yuan Ding, Yu Shan heard that Lou Chuan had requested to execute him, with Han troops approaching the borders and about to advance, so he rebelled and sent troops to block the Han roads.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "號將軍騶力等為「吞漢將軍」，入白沙、武林、梅嶺，殺漢三校尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Hao jiang jun Zou Li etc. become 'Tun Han jiang jun', enter Bai Sha, Wu Lin, Mei Ling, kill Han three xiao wei.",
              "idiomatic": "He titled generals Zou Li and others as 'Han-Devouring Generals', entered Baisha, Wulin, and Meiling, and killed three Han officers.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "是時漢使大農張成、故山州侯齒將屯，弗敢擊，卻就便處，皆坐畏懦誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "This time Han make da nong Zhang Cheng, old Shan Zhou hou Chi lead tun, not dare strike, back seek convenient place, all sit wei nuo zhu.",
              "idiomatic": "At this time, Han had sent Grand Provisioner Zhang Cheng and former Lord Chi of Shanzhou to lead the encampments, but they did not dare attack, retreated to convenient places, and all were executed for cowardice and timidity.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the autumn of the sixth year of Yuan Ding, Yu Shan heard that Lou Chuan had requested to execute him, with Han troops approaching the borders and about to advance, so he rebelled and sent troops to block the Han roads. He titled generals Zou Li and others as 'Han-Devouring Generals', entered Baisha, Wulin, and Meiling, and killed three Han officers. At this time, Han had sent Grand Provisioner Zhang Cheng and former Lord Chi of Shanzhou to lead the encampments, but they did not dare attack, retreated to convenient places, and all were executed for cowardice and timidity.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "餘善刻「武帝」璽自立，詐其民，為妄言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yu Shan ke 'Wu Di' xi self establish, zha its people, become wang yan.",
              "idiomatic": "Yu Shan carved a 'Wu Di' seal to establish himself, deceived his people with false words.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "天子遣橫海將軍韓說出句章，浮海從東方往；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Tian zi send heng hai jiang jun Han Shuo out Gou Zhang, fu hai follow dong fang go;",
              "idiomatic": "The Son of Heaven dispatched General Heng Hai Han Shuo from Gouzhang, sailing across the sea from the east;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "樓船將軍楊仆出武林；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Lou chuan jiang jun Yang Pu out Wu Lin;",
              "idiomatic": "General Lou Chuan Yang Pu from Wulin;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "中尉王溫舒出梅嶺；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Zhong wei Wang Wen Shu out Mei Ling;",
              "idiomatic": "Colonel Wang Wen Shu from Meiling;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "越侯為戈船、下瀨將軍，出若邪、白沙。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yue hou become Ge chuan, xia lai jiang jun, out Ruo Xie, Bai Sha.",
              "idiomatic": "And the Yue marquis as Spear Boat and Rapids General, from Ruoye and Baisha.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "元封元年冬，咸入東越。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yuan Feng one year winter, all enter Dong Yue.",
              "idiomatic": "In the winter of the first year of Yuan Feng, they all entered Dong Yue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "東越素發兵距險，使徇北將軍守武林，敗樓船軍數校尉，殺長吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Dong Yue su send troops ju xian, make xun bei jiang jun shou Wu Lin, defeat Lou Chuan army number xiao wei, kill chang li.",
              "idiomatic": "Dong Yue had already sent troops to block the defiles, appointed Xun Bei General to defend Wulin, defeated several officers of the Lou Chuan army, and killed the senior officials.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "樓船將軍率錢唐轅終古斬徇北將軍，為御兒侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Lou Chuan jiang jun lead Qian Tang yuan Zhong Gu zhan Xun Bei jiang jun, become Yu Er hou.",
              "idiomatic": "General Lou Chuan led Qian Tang garrison commander Zhong Gu to execute the Xun Bei General, and was enfeoffed as Marquis of Yu'er.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "自兵未往。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Self troops not go.",
              "idiomatic": "Since the troops had not yet gone.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yu Shan carved a 'Wu Di' seal to establish himself, deceived his people with false words. The Son of Heaven dispatched General Heng Hai Han Shuo from Gouzhang, sailing across the sea from the east; General Lou Chuan Yang Pu from Wulin; Colonel Wang Wen Shu from Meiling; And the Yue marquis as Spear Boat and Rapids General, from Ruoye and Baisha. In the winter of the first year of Yuan Feng, they all entered Dong Yue. Dong Yue had already sent troops to block the defiles, appointed Xun Bei General to defend Wulin, defeated several officers of the Lou Chuan army, and killed the senior officials. General Lou Chuan led Qian Tang garrison commander Zhong Gu to execute the Xun Bei General, and was enfeoffed as Marquis of Yu'er. Since the troops had not yet gone.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0064",
          "zh": "故越衍侯吳陽前在漢，漢使歸諭餘善，餘善弗聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Old Yue Yan hou Wu Yang before in Han, Han make return yu Yu Shan, Yu Shan not listen.",
              "idiomatic": "Former Yue Yan marquis Wu Yang was previously in Han, and Han sent him back to persuade Yu Shan, but Yu Shan would not listen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "及橫海將軍先至，越衍侯吳陽以其邑七百人反，攻越軍於漢陽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Reach Heng Hai jiang jun first arrive, Yue Yan hou Wu Yang with its yi seven hundred people rebel, attack Yue army yu Han Yang.",
              "idiomatic": "When General Heng Hai arrived first, Yue Yan marquis Wu Yang rebelled with seven hundred men from his fief and attacked the Yue army at Hanyang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "從建成侯敖，與其率，從繇王居股謀曰：「餘善首惡，劫守吾屬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Follow Jian Cheng hou Ao, with its shuai, follow Rou wang Ju Gu plan said: 'Yu Shan first evil, jie shou I belong.'",
              "idiomatic": "Following Jian Cheng marquis Ao and his commanders, together with King Rou's Ju Gu, they plotted: 'Yu Shan is the chief culprit, coercing and guarding us dependents.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "今漢兵至，眾彊，計殺餘善，自歸諸將，儻幸得脫。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Now Han troops arrive, zhong qiang, plan kill Yu Shan, self return various jiang, tang xing obtain tuo.'",
              "idiomatic": "Now Han troops have arrived, numerous and strong; let us plan to kill Yu Shan, surrender ourselves to the various generals, and perhaps luckily escape.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "乃遂俱殺餘善，以其眾降橫海將軍，故封繇王居股為東成侯，萬戶；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Then sui all kill Yu Shan, with its zhong descend Heng Hai jiang jun, therefore seal Rou wang Ju Gu become Dong Cheng hou, wan hu;",
              "idiomatic": "Then they all killed Yu Shan and surrendered their forces to General Heng Hai, so King Rou's Ju Gu was enfeoffed as Dong Cheng marquis with ten thousand households;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "封建成侯敖為開陵侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Seal Jian Cheng hou Ao become Kai Ling hou;",
              "idiomatic": "Jian Cheng marquis Ao was enfeoffed as Kai Ling marquis;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "封越衍侯吳陽為北石侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Seal Yue Yan hou Wu Yang become Bei Shi hou;",
              "idiomatic": "Yue Yan marquis Wu Yang was enfeoffed as Bei Shi marquis;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "封橫海將軍說為案道侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Seal Heng Hai jiang jun Shuo become An Dao hou;",
              "idiomatic": "General Heng Hai Shuo was enfeoffed as An Dao marquis;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "封橫海校尉福為繚嫈侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Seal Heng Hai xiao wei Fu become Liao Yi hou.",
              "idiomatic": "Heng Hai Colonel Fu was enfeoffed as Liao Yi marquis.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "福者，成陽共王子，故為海常侯，坐法失侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Fu ones, Cheng Yang Gong wang zi, old become Hai Chang hou, sit fa lose hou.",
              "idiomatic": "Fu was a son of King Gong of Cheng Yang, formerly Marquis of Hai Chang, but lost his marquisate for violating the law.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "舊從軍無功，以宗室故侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Old follow army no merit, with zong shi reason hou.",
              "idiomatic": "He had previously followed the army without merit, but was made a marquis because of his imperial clan status.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "諸將皆無成功，莫封。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Various jiang all no success merit, mo seal.",
              "idiomatic": "The various generals had no successful merits and none were enfeoffed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "東越將多軍，漢兵至，棄其軍降，封為無錫侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Dong Yue jiang Duo Jun, Han troops arrive, abandon its army descend, seal become Wu Xi hou.",
              "idiomatic": "Dong Yue general Duo Jun, when Han troops arrived, abandoned his army and surrendered, and was enfeoffed as Wu Xi marquis.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Former Yue Yan marquis Wu Yang was previously in Han, and Han sent him back to persuade Yu Shan, but Yu Shan would not listen. When General Heng Hai arrived first, Yue Yan marquis Wu Yang rebelled with seven hundred men from his fief and attacked the Yue army at Hanyang. Following Jian Cheng marquis Ao and his commanders, together with King Rou's Ju Gu, they plotted: 'Yu Shan is the chief culprit, coercing and guarding us dependents. Now Han troops have arrived, numerous and strong; let us plan to kill Yu Shan, surrender ourselves to the various generals, and perhaps luckily escape.' Then they all killed Yu Shan and surrendered their forces to General Heng Hai, so King Rou's Ju Gu was enfeoffed as Dong Cheng marquis with ten thousand households; Jian Cheng marquis Ao was enfeoffed as Kai Ling marquis; Yue Yan marquis Wu Yang was enfeoffed as Bei Shi marquis; General Heng Hai Shuo was enfeoffed as An Dao marquis; Heng Hai Colonel Fu was enfeoffed as Liao Yi marquis. Fu was a son of King Gong of Cheng Yang, formerly Marquis of Hai Chang, but lost his marquisate for violating the law. He had previously followed the army without merit, but was made a marquis because of his imperial clan status. The various generals had no successful merits and none were enfeoffed. Dong Yue general Duo Jun, when Han troops arrived, abandoned his army and surrendered, and was enfeoffed as Wu Xi marquis.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0077",
          "zh": "於是天子曰東越狹多阻，閩越悍，數反覆，詔軍吏皆將其民徙處江淮閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Then tian zi said Dong Yue narrow many zu, Min Yue han, number fan fu, zhao army li all lead its people move chu Jiang Huai jian.",
              "idiomatic": "Then the Son of Heaven said Dong Yue was narrow with many obstacles, Min Yue fierce and repeatedly fickle, and decreed that the military officials should all lead their people to relocate between the Jiang and Huai.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "東越地遂虛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Dong Yue land sui xu.",
              "idiomatic": "Dong Yue lands were thus emptied.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Then the Son of Heaven said Dong Yue was narrow with many obstacles, Min Yue fierce and repeatedly fickle, and decreed that the military officials should all lead their people to relocate between the Jiang and Huai. Dong Yue lands were thus emptied.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "太史公曰：越雖蠻夷，其先豈嘗有大功德於民哉，何其久也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Tai shi gong said: Yue though man yi, its first qi chang have big merit virtue yu people, what its long!",
              "idiomatic": "The Grand Historian says: Though Yue were barbarians, did their ancestors ever have great merits and virtues for the people? How enduring they were!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "歷數代常為君王，句踐一稱伯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Li number generation constant become jun wang, Gou Jian one call bo.",
              "idiomatic": "Through several generations they constantly served as rulers, with Gou Jian alone styling himself hegemon.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "然餘善至大逆，滅國遷眾，其先苗裔繇王居股等猶尚封為萬戶侯，由此知越世世為公侯矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Yet Yu Shan reach big ni, extinguish country move zhong, its first miao yi Rou wang Ju Gu etc. still yet seal become wan hu hou, by this know Yue world world become gong hou.",
              "idiomatic": "Yet Yu Shan committed great rebellion, destroying the kingdom and moving the people, but their ancestral descendants like King Rou's Ju Gu were still enfeoffed as marquises with ten thousand households, from which we know Yue generation after generation served as dukes and marquises.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "蓋禹之餘烈也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "literal": "Cover Yu zhi yu lie.",
              "idiomatic": "It was indeed the lingering influence of Yu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Grand Historian says: Though Yue were barbarians, did their ancestors ever have great merits and virtues for the people? How enduring they were! Through several generations they constantly served as rulers, with Gou Jian alone styling himself hegemon. Yet Yu Shan committed great rebellion, destroying the kingdom and moving the people, but their ancestral descendants like King Rou's Ju Gu were still enfeoffed as marquises with ten thousand households, from which we know Yue generation after generation served as dukes and marquises. It was indeed the lingering influence of Yu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}