{
  "meta": {
    "book": "hanshu",
    "bookInfo": {
      "name": "Book of Han",
      "chinese": "漢書",
      "pinyin": "Hànshū",
      "dynasty": "Western Han",
      "author": "Ban Gu",
      "authorChinese": "班固"
    },
    "chapter": "004",
    "url": "https://chinesenotes.com/hanshu/hanshu004.html",
    "title": {
      "zh": "卷三 高后紀",
      "en": "Volume 3: Annals of Empress Lü Zhi",
      "raw": "卷三 高后紀 Volume 3: Annals of Empress Lü Zhi"
    },
    "sentenceCount": 89,
    "translatedCount": 89,
    "glossarySize": 14449,
    "scrapedAt": "2025-12-23T16:54:29.026Z",
    "translators": [],
    "citation": null,
    "qualityScore": 8
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "元年春正月，詔曰：「前日孝惠皇帝言欲除三族罪、妖言令，議未決而崩，今除之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the first year, spring, first month, the edict said: 'Previously Emperor Xiaohui spoke of wanting to abolish the three clans punishment and the demonic speech ordinance, but the discussion was not decided when he passed away, now we abolish them.'",
              "idiomatic": "In the first year, during the first month of spring, an imperial edict declared: 'Previously, Emperor Xiaohui had expressed a desire to abolish the punishment of the three clans and the ordinance against demonic speech, but the discussion remained unresolved when he passed away. We now abolish them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "二月，賜民爵，戶一級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month, granted the people noble ranks, one level per household.",
              "idiomatic": "In the second month, noble ranks were granted to the people, one level per household.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "初置孝弟力田二千石者一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "First established one person at 2000 shi who is filial, fraternal, and works the fields.",
              "idiomatic": "For the first time, one person who exemplifies filial piety, fraternal duty, and dedication to farming was appointed at the rank of 2000 shi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "夏五月丙申，趙王宮叢臺災。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month bing-shen day, the Zhao king palace Cong Terrace disaster.",
              "idiomatic": "On the bing-shen day of the fifth month in summer, the Cong Terrace in the Zhao king's palace suffered a disaster.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "立孝惠後宮子強為淮陽王，不疑為恆山王，弘為襄城侯，朝為軹侯，武為壺關侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established Emperor Xiaohui's harem son Qiang as Huaiyang king, Buyi as Hengshan king, Hong as Xiangcheng marquis, Chao as Zhi marquis, Wu as Huguan marquis.",
              "idiomatic": "The sons of Emperor Xiaohui's harem were enfeoffed: Qiang as King of Huaiyang, Buyi as King of Hengshan, Hong as Marquis of Xiangcheng, Chao as Marquis of Zhi, and Wu as Marquis of Huguan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "秋，桃李華。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, peach and plum blossomed.",
              "idiomatic": "In autumn, peach and plum trees came into bloom.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first year, during the first month of spring, an imperial edict declared: 'Previously, Emperor Xiaohui had expressed a desire to abolish the punishment of the three clans and the ordinance against demonic speech, but the discussion remained unresolved when he passed away. We now abolish them.' In the second month, the people were granted noble titles, with each household receiving one rank. For the first time, one person who exemplifies filial piety, fraternal duty, and dedication to farming was appointed at the rank of 2000 shi. On the bing-shen day of the fifth month in summer, the Cong Terrace in the Zhao king's palace suffered a disaster. The sons of Emperor Xiaohui's harem were enfeoffed: Qiang as King of Huaiyang, Buyi as King of Hengshan, Hong as Marquis of Xiangcheng, Chao as Marquis of Zhi, and Wu as Marquis of Huguan. In autumn, peach and plum trees came into bloom.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0007",
          "zh": "二年春，詔曰：「高皇帝匡飭天下，諸有功者皆受分地為列侯，萬民大安，莫不受休德。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring, edict said: 'Emperor Gao rectified and ordered the realm, all who had merit received divided land as liehou, the myriad people greatly at peace, none did not receive benevolent virtue.'",
              "idiomatic": "In spring of the second year, an imperial edict declared: 'Emperor Gao brought order and discipline to the realm. All who had achieved merit received divided territories as marquises, and the people lived in great peace, all benefiting from his benevolent virtue.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "朕思念至於久遠 而功名不著，亡以尊大誼，施後世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I think of this to the distant future but merit and fame are not manifest, there is nothing to honor great righteousness, extend to later generations.",
              "idiomatic": "I have reflected on this extending far into the future, yet their merits and achievements remain unrecorded, leaving nothing to honor the great righteousness and pass on to future generations.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "今欲差次列侯功以定朝位，臧于高廟，世世勿絕，嗣子各襲其功位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now wish to differentiate and order the liehou merits to establish court positions, store in the Gao Temple, generation after generation never cease, heir sons each inherit their merit positions.",
              "idiomatic": "Now I wish to differentiate and rank the merits of the marquises to establish their positions at court. These rankings shall be preserved in the Gao Temple, maintained generation after generation without interruption, with each heir inheriting his father's meritorious position.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "其與列侯議定奏之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Discuss and decide with the liehou and memorialize it.'",
              "idiomatic": "Discuss and determine this with the marquises, then submit a memorial.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "丞相臣平言：「謹與絳侯臣勃、曲周 侯臣商、潁陰侯臣嬰、安國侯臣陵等議，列侯幸得賜餐錢奉邑，陛下加惠，以功次定朝位，臣請臧高廟。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chancellor minister Ping said: 'Respectfully with Jianghou minister Bo, Quzhou marquis minister Shang, Yingyin marquis minister Ying, Anguo marquis minister Ling and others discussed, the liehou fortunately received bestowed meal money fief income, Your Majesty adds favor, with merits establish court positions, minister requests store in Gao Temple.'",
              "idiomatic": "Chancellor Ping memorialized: 'I have respectfully discussed this with Marquises Jianghou Bo, Quzhou Shang, Yingyin Ying, Anguo Ling, and others. The marquises have fortunately received bestowed meal allowances and fief incomes. Your Majesty adds further favor by establishing court positions according to merit. I request that these rankings be preserved in the Gao Temple.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "奏可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Memorial approved.",
              "idiomatic": "The memorial was approved.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "春正月乙卯，地震，羌道、武都道山崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Spring first month yi-mao day, earthquake, Qiang road, Wudu road mountains collapsed.",
              "idiomatic": "On the yi-mao day of the first month in spring, an earthquake struck, causing mountains to collapse along the Qiang and Wudu roads.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "夏六月丙 戌晦，日有蝕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer sixth month bing-xu last day, the sun was eclipsed.",
              "idiomatic": "On the last day of the sixth month in summer, a bing-xu day, the sun was eclipsed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "秋七月，恆山王不疑薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn seventh month, Hengshan king Buyi passed away.",
              "idiomatic": "In the seventh month of autumn, King Buyi of Hengshan passed away.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "行八銖錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Circulated eight zhu coins.",
              "idiomatic": "Eight-zhu coins were put into circulation.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In spring of the second year, an imperial edict declared: 'Emperor Gao brought order and discipline to the realm. All who had achieved merit received divided territories as marquises, and the people lived in great peace, all benefiting from his benevolent virtue.' I have reflected on this extending far into the future, yet their merits and achievements remain unrecorded, leaving nothing to honor the great righteousness and pass on to future generations. Now I wish to differentiate and rank the merits of the marquises to establish their positions at court. These rankings shall be preserved in the Gao Temple, maintained generation after generation without interruption, with each heir inheriting his father's meritorious position. Discuss and determine this with the marquises, then submit a memorial.' Chancellor Ping memorialized: 'I have respectfully discussed this with Marquises Jianghou Bo, Quzhou Shang, Yingyin Ying, Anguo Ling, and others. The marquises have fortunately received bestowed meal allowances and fief incomes. Your Majesty adds further favor by establishing court positions according to merit. I request that these rankings be preserved in the Gao Temple.' The memorial was approved. On the yi-mao day of the first month in spring, an earthquake struck, causing mountains to collapse along the Qiang and Wudu roads. On the last day of the sixth month in summer, a bing-xu day, the sun was eclipsed. In the seventh month of autumn, King Buyi of Hengshan passed away. Eight-zhu coins were put into circulation.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0017",
          "zh": "三年夏，江水、溢，流民四千餘家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year summer, Yangtze River overflowed, flooded people four thousand plus households.",
              "idiomatic": "In summer of the third year, the Yangtze River overflowed its banks, displacing more than four thousand households.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "秋，星晝見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, stars seen in daytime.",
              "idiomatic": "In autumn, stars were visible during the daytime.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In summer of the third year, the Yangtze River overflowed its banks, displacing more than four thousand households. In autumn, stars were visible during the daytime.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0019",
          "zh": "四年夏，少帝自知非皇后子，出怨言，皇太后幽之永巷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year summer, the young emperor knew himself not the queen's son, came out with resentful words, the empress dowager confined him in the permanent lane.",
              "idiomatic": "In summer of the fourth year, the young emperor realized he was not the queen's son and spoke words of resentment. The Empress Dowager confined him in the permanent quarters.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "詔曰：「凡有天下治萬民者，蓋之如天，容之如 地；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'All who govern the realm and rule the myriad people, cover them like heaven, contain them like earth;'",
              "idiomatic": "An imperial edict declared: 'All who govern the realm and rule the myriad people should cover them like heaven and contain them like earth;'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "上有驩心以使百姓，百姓欣然以事其上，驩欣交通而天下治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Above has happy heart to employ the hundred clans, the hundred clans joyfully serve their superiors, happy and joyful communicate and the realm is governed.",
              "idiomatic": "Above, there should be a joyful heart to employ the people, and the people should joyfully serve their superiors. When joy flows between ruler and subjects, the realm is well governed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "今皇帝疾久不已，乃失惑昏亂，不能繼嗣奉宗廟，守祭祀，不可屬天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now the emperor's illness long not cured, moreover confused and disordered, cannot continue and serve the ancestral temple, guard the sacrifices, cannot be entrusted with the realm.",
              "idiomatic": "Now the emperor's illness has persisted without cure, and moreover he has become confused and disordered. He cannot continue the line and serve the ancestral temple, nor guard the sacrifices. He cannot be entrusted with governing the realm.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "其議代之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Discuss replacing him.'",
              "idiomatic": "Discuss who should replace him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "群臣皆曰： 「皇太后為天下計，所以安宗廟社稷甚深。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All ministers all said: 'The Empress Dowager for the realm calculates, so that ancestral temple and altars of soil and grain deeply secure.'",
              "idiomatic": "All the ministers declared: 'The Empress Dowager has calculated for the sake of the realm, ensuring the deep security of the ancestral temple and the altars of soil and grain.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "頓首奉詔。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bow heads and receive the edict.'",
              "idiomatic": "We bow our heads and receive the edict.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "五月丙辰，立恆山王弘為皇帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth month bing-chen day, established Hengshan king Hong as emperor.",
              "idiomatic": "On the bing-chen day of the fifth month, King Hong of Hengshan was established as emperor.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In summer of the fourth year, the young emperor realized he was not the queen's son and spoke words of resentment. The Empress Dowager confined him in the permanent quarters. An imperial edict declared: 'All who govern the realm and rule the myriad people should cover them like heaven and contain them like earth;' Above, there should be a joyful heart to employ the people, and the people should joyfully serve their superiors. When joy flows between ruler and subjects, the realm is well governed. Now the emperor's illness has persisted without cure, and moreover he has become confused and disordered. He cannot continue the line and serve the ancestral temple, nor guard the sacrifices. He cannot be entrusted with governing the realm. Discuss who should replace him.' All the ministers declared: 'The Empress Dowager has calculated for the sake of the realm, ensuring the deep security of the ancestral temple and the altars of soil and grain.' We bow our heads and receive the edict.' On the bing-chen day of the fifth month, King Hong of Hengshan was established as emperor.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "五年春，南粵王尉佗自稱南武帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth year spring, Nanyue king Zhao Tuo self-called Southern Martial Emperor.",
              "idiomatic": "In spring of the fifth year, Zhao Tuo, king of Nanyue, proclaimed himself the Southern Martial Emperor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "秋八月，淮陽王彊薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn eighth month, Huaiyang king Qiang passed away.",
              "idiomatic": "In the eighth month of autumn, King Qiang of Huaiyang passed away.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "九月，發河東、上黨騎屯北地。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth month, dispatched Hedong, Shangdang cavalry to garrison Beidi.",
              "idiomatic": "In the ninth month, cavalry from Hedong and Shangdang were dispatched to garrison Beidi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In spring of the fifth year, the king of Nanyue,尉佗, proclaimed himself the Southern Martial Emperor. In the eighth month of autumn, King Qiang of Huaiyang passed away. In the ninth month, cavalry from Hedong and Shangdang were dispatched to garrison Beidi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0030",
          "zh": "六年春，星晝見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth year spring, stars seen in daytime.",
              "idiomatic": "In spring of the sixth year, stars were visible during the daytime.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "夏四月，赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, amnesty the realm.",
              "idiomatic": "In the fourth month of summer, a general amnesty was granted throughout the realm.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "秩長陵令二千石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rank Changling commandery two thousand shi.",
              "idiomatic": "The Changling commandery was ranked at two thousand shi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "六月，城長陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month, walled Changling.",
              "idiomatic": "In the sixth month, walls were built around Changling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "匈奴寇狄道，攻阿陽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu raided Di Dao, attacked A Yang.",
              "idiomatic": "The Xiongnu raided Di Dao and attacked A Yang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "行五分錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Circulated five parts coin.",
              "idiomatic": "Five-parts coins were put into circulation.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In spring of the sixth year, stars were visible during the daytime. In the fourth month of summer, a general amnesty was granted throughout the realm. The Changling commandery was ranked at two thousand shi. In the sixth month, walls were built around Changling. The Xiongnu raided Di Dao and attacked A Yang. Five-parts coins were put into circulation.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0036",
          "zh": "八年春，封中謁者張釋卿為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth year spring, sealed the palace attendant Zhang Shiqing as liehou.",
              "idiomatic": "In spring of the eighth year, the palace attendant Zhang Shiqing was enfeoffed as a marquis.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "諸中官、宦者令丞皆賜爵關內侯，食邑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All palace officials, eunuch officials and assistants all granted the title Guan nei hou, food fief.",
              "idiomatic": "All palace officials and eunuch officials and their assistants were granted the title of Guan nei hou with food fiefs.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "夏，江水、漢水溢，流萬餘家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, Yangtze River, Han River overflowed, flooded ten thousand plus households.",
              "idiomatic": "In summer, the Yangtze and Han rivers overflowed their banks, displacing more than ten thousand households.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In spring of the eighth year, the palace attendant Zhang Shiqing was enfeoffed as a marquis. All palace officials and eunuch officials and their assistants were granted the title of Guan nei hou with food fiefs. In summer, the Yangtze and Han rivers overflowed their banks, displacing more than ten thousand households.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0039",
          "zh": "秋七月辛巳，皇太后崩于未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn seventh month xin-si day, Empress Dowager passed away in Weiyang Palace.",
              "idiomatic": "On the xin-si day of the seventh month in autumn, the Empress Dowager passed away in Weiyang Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "遺詔賜諸侯王各千金，將相列侯下至郎吏各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bequeathed edict granted the various regional kings each one thousand gold, generals and chancellors liehou down to the lang officials each according to difference.",
              "idiomatic": "By bequeathed edict, the various regional kings were each granted one thousand pieces of gold, while generals, chancellors, marquises, and officials down to the lang rank each received amounts according to their position.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great amnesty the realm.",
              "idiomatic": "A great amnesty was granted throughout the realm.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the xin-si day of the seventh month in autumn, the Empress Dowager passed away in Weiyang Palace. By bequeathed edict, the various regional kings were each granted one thousand pieces of gold, while generals, chancellors, marquises, and officials down to the lang rank each received amounts according to their position. A great amnesty was granted throughout the realm.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0042",
          "zh": "上將軍祿、相國產顓兵秉政，自知背高皇帝約，恐為大臣諸侯王所誅，因謀作亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upper general Lu, prime minister Chan wholly grasped the troops and administered government, self-knowing violated Emperor Gao's agreement, feared being executed by the ministers and regional kings, therefore plotted to make rebellion.",
              "idiomatic": "General Lu and Prime Minister Chan had complete control over the troops and government. Knowing they had violated Emperor Gao's agreement, they feared execution by the ministers and regional kings, so they plotted rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "時齊悼惠王子朱虛侯章 在京師，以祿女為婦，知其謀，乃使人告兄齊王，令發兵西。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At the time, Qi Daohui king's son Zhu Xu marquis Zhang was in the capital, with Lu's daughter as wife, knew their plot, then sent people to inform elder brother Qi king, ordered to dispatch troops west.",
              "idiomatic": "At this time, Zhu Xu Marquis Zhang, son of King Daohui of Qi, was in the capital. Married to Lu's daughter, he knew of their plot and sent messengers to inform his elder brother, the King of Qi, ordering him to dispatch troops westward.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "章欲與太尉勃、丞相平為內應，以誅諸呂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhang wished to with Grand Commandant Bo, Chancellor Ping make internal response, to execute the various Lu.",
              "idiomatic": "Zhang wished to coordinate internally with Grand Commandant Bo and Chancellor Ping to execute the various members of the Lü clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "齊王遂發兵，又詐琅邪王澤發其國兵，并將而西。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi king then dispatched troops, moreover deceived Langye king Ze to dispatch his country's troops, combined led and went west.",
              "idiomatic": "The King of Qi then dispatched troops, and moreover deceived King Ze of Langye into dispatching his country's forces. They combined their armies and marched westward.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "產、祿等 遣大將軍灌嬰將兵擊之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chan, Lu and others dispatched grand general Guan Ying to lead troops strike them.",
              "idiomatic": "Chan and Lu dispatched Grand General Guan Ying to lead troops against them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "嬰至滎陽，使人諭齊王與連和，待呂氏變而共誅之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ying arrived at Xingyang, sent people to persuade Qi king to ally with him, wait for Lu clan change and together execute them.",
              "idiomatic": "When Ying reached Xingyang, he sent messengers to persuade the King of Qi to form an alliance, waiting for changes within the Lü clan before jointly executing them.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "General Lu and Prime Minister Chan had complete control over the troops and government. Knowing they had violated Emperor Gao's agreement, they feared execution by the ministers and regional kings, so they plotted rebellion. At this time, Zhu Xu Marquis Zhang, son of King Daohui of Qi, was in the capital. Married to Lu's daughter, he knew of their plot and sent messengers to inform his elder brother, the King of Qi, ordering him to dispatch troops westward. Zhang wished to coordinate internally with Grand Commandant Bo and Chancellor Ping to execute the various members of the Lü clan. The King of Qi then dispatched troops, and moreover deceived King Ze of Langye into dispatching his country's forces. They combined their armies and marched westward. Chan and Lu dispatched Grand General Guan Ying to lead troops against them. When Ying reached Xingyang, he sent messengers to persuade the King of Qi to form an alliance, waiting for changes within the Lü clan before jointly executing them.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0048",
          "zh": "太尉勃與丞相平謀，以曲周侯酈商子寄與祿善，使人劫商令寄紿說祿曰：「高帝與呂后共定天下，劉氏所 立九王，呂氏所立三王，皆大臣之議。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Commandant Bo with Chancellor Ping plotted, with Qu Zhou marquis Li Shang's son Ji and Lu on good terms, sent people to coerce Shang to make Ji deceive and persuade Lu saying: 'Emperor Gao and Empress Lu together settled the realm, Liu clan established nine kings, Lu clan established three kings, all were ministers' discussions.",
              "idiomatic": "Grand Commandant Bo and Chancellor Ping plotted together. Since Qu Zhou Marquis Li Shang's son Ji was on good terms with Lu, they sent people to coerce Shang into having Ji deceive and persuade Lu: 'Emperor Gao and Empress Lü together pacified the realm. The Liu clan established nine kings, the Lü clan established three kings - all were matters discussed by the ministers.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "事以布告諸侯王，諸侯王以為宜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Matters with announcements proclaim to the various regional kings, the various regional kings considered it appropriate.",
              "idiomatic": "These matters were proclaimed by announcement to the various regional kings, who all considered them appropriate.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "今太后崩，帝少，足下不急之國守藩，乃為上將將兵留此，為大臣諸侯所疑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Empress Dowager collapsed, emperor young, you not urgently go to your country guard the border, instead as upper general lead troops remain here, cause ministers and regional kings to suspect you.",
              "idiomatic": "Now the Empress Dowager has passed away and the emperor is young. Instead of urgently returning to your country to guard your border, you remain here as General leading troops, causing suspicion among ministers and regional kings.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "何不速歸將軍 印，以兵屬太尉，請梁王亦歸相國印，與大臣盟而之國？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Why not quickly return the general seal, entrust the troops to the Grand Commandant, request Liang king also return the prime minister seal, ally with ministers and go to your country?",
              "idiomatic": "Why not quickly return the general's seal and entrust the troops to the Grand Commandant? Request that the King of Liang also return the prime minister's seal. Then ally with the ministers and return to your country.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "齊兵必罷，大臣得安，足下高枕而王千里，此萬世之利也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi troops certainly will stop, ministers can be at peace, you can recline pillow and be king of a thousand li, this is ten thousand generations' benefit.'",
              "idiomatic": "The Qi troops will certainly withdraw, allowing the ministers to rest easy. You can recline on your pillow and rule as king of a thousand li territory - this is a benefit for ten thousand generations.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "祿然其計，使人報產及諸呂老人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu approved the plan, sent people to report to Chan and the various Lu elders.",
              "idiomatic": "Lu approved the plan and sent messengers to inform Chan and the elders of the Lü clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "或以為不 便，計猶豫未有所決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some considered it inappropriate, the plan hesitated not yet decided.",
              "idiomatic": "Some considered it inappropriate, and the plan remained undecided amid hesitation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "祿信寄，與俱出遊，過其姑呂嬃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu trusted Ji, went out touring with him, passed his aunt Lü Xu.",
              "idiomatic": "Lu trusted Ji and went out touring with him, passing by his aunt Lü Xu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "嬃怒曰：「奴為將而棄軍，呂氏今無處矣！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xu angry said: 'You slave as general yet abandon the army, Lu clan now has no place!'",
              "idiomatic": "Lü Xu angrily exclaimed: 'You slave! As a general you abandon the army. The Lü clan now has nowhere to go!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "乃悉出珠玉寶器散堂下，曰：「無為它人守也！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then completely took out pearls jade precious vessels scattered below the hall, said: 'Do not guard for other people!'",
              "idiomatic": "She then took out all the pearls, jade, and precious vessels, scattering them below the hall, saying: 'Don't guard these for other people!'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Grand Commandant Bo and Chancellor Ping plotted together. Since Qu Zhou Marquis Li Shang's son Ji was on good terms with Lu, they sent people to coerce Shang into having Ji deceive and persuade Lu: 'Emperor Gao and Empress Lü together pacified the realm. The Liu clan established nine kings, the Lü clan established three kings - all were matters discussed by the ministers.' These matters were proclaimed by announcement to the various regional kings, who all considered them appropriate. Now the Empress Dowager has passed away and the emperor is young. Instead of urgently returning to your country to guard your border, you remain here as General leading troops, causing suspicion among ministers and regional kings. Why not quickly return the general's seal and entrust the troops to the Grand Commandant? Request that the King of Liang also return the prime minister's seal. Then ally with the ministers and return to your country. The Qi troops will certainly withdraw, allowing the ministers to rest easy. You can recline on your pillow and rule as king of a thousand li territory - this is a benefit for ten thousand generations.' Lu approved the plan and sent messengers to inform Chan and the elders of the Lü clan. Some considered it inappropriate, and the plan remained undecided amid hesitation. Lu trusted Ji and went out touring with him, passing by his aunt Lü Xu. Lü Xu angrily exclaimed: 'You slave! As a general you abandon the army. The Lü clan now has nowhere to go!' She then took out all the pearls, jade, and precious vessels, scattering them below the hall, saying: 'Don't guard these for other people!'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "八月庚申，平陽侯窋行御史大夫事，見相國產計事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth month geng-shen day, Pingyang marquis Kui acted as imperial censor chief, saw prime minister Chan discuss matters.",
              "idiomatic": "On the geng-shen day of the eighth month, Pingyang Marquis Kui, acting as Imperial Censor Chief, went to see Prime Minister Chan to discuss matters.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "郎中令賈壽使從齊來，因數產曰：「王不早之國，今 雖欲行，尚可得邪？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Palace attendant commander Jia Shou made follower from Qi come, because of this berated Chan saying: 'The king not early go to country, now although wish to go, still can obtain?'",
              "idiomatic": "Palace Attendant Commander Jia Shou had brought a follower from Qi, who used this opportunity to berate Chan: 'The king should have returned to his country early. Now even if he wishes to go, can he still manage it?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "具以灌嬰與齊楚合從狀告產。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Completely with Guan Ying and Qi Chu allied from situation informed Chan.",
              "idiomatic": "He fully informed Chan of the situation where Guan Ying had allied with Qi and Chu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "平陽侯窋聞其語，馳告丞相平、太尉勃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pingyang marquis Kui heard their words, galloped to inform Chancellor Ping, Grand Commandant Bo.",
              "idiomatic": "Pingyang Marquis Kui heard their conversation and galloped to inform Chancellor Ping and Grand Commandant Bo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "勃欲入北軍，不得入。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo wished to enter the northern army, could not enter.",
              "idiomatic": "Bo wished to enter the Northern Army but was unable to do so.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "襄平侯紀通尚符節，乃令持節矯內勃北軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiangping marquis Ji Tong still held the tally and seal, then ordered to hold the seal forge inner Bo into the northern army.",
              "idiomatic": "Xiangping Marquis Ji Tong still held the imperial tally and seal. He was ordered to hold the seal and forge an imperial command to bring Bo into the Northern Army.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "勃復 令酈寄、典客劉揭說祿，曰：「帝使太尉守北軍，欲令足下之國，急歸將軍印辭去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo again ordered Li Ji, protocol director Liu Jie persuade Lu, said: 'The emperor makes Grand Commandant guard the northern army, wishes to make you go to your country, urgently return the general seal and depart.'",
              "idiomatic": "Bo then ordered Li Ji and Protocol Director Liu Jie to persuade Lu: 'The emperor has made the Grand Commandant guard the Northern Army. He wishes you to return to your country. Urgently return the general's seal and depart.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "不然，禍且起。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If not, calamity will arise.'",
              "idiomatic": "Otherwise, calamity will ensue.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "祿遂解印屬典客，而以兵授太尉勃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu then untied the seal entrusted to protocol director, and gave the troops to Grand Commandant Bo.",
              "idiomatic": "Lu then removed his seal and entrusted it to the Protocol Director, handing over command of the troops to Grand Commandant Bo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "勃入軍門，行令軍中曰： 「為呂氏右袒，為劉氏左袒。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo entered the army gate, issued command in the army saying: 'For Lu clan bare right arm, for Liu clan bare left arm.'",
              "idiomatic": "Bo entered the army gate and issued a command throughout the army: 'Bare your right arm for the Lü clan, bare your left arm for the Liu clan.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "軍皆左袒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The army all bared left arms.",
              "idiomatic": "The entire army bared their left arms.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "勃遂將北軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo then led the northern army.",
              "idiomatic": "Bo then took command of the Northern Army.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "然尚有南軍，丞相平召朱虛侯章佐勃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "However still had southern army, Chancellor Ping summoned Zhu Xu marquis Zhang to assist Bo.",
              "idiomatic": "However, there was still the Southern Army. Chancellor Ping summoned Zhu Xu Marquis Zhang to assist Bo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "勃令章監軍門，令平陽侯告衛尉，毋內相國產殿門。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo ordered Zhang oversee the army gate, ordered Pingyang marquis inform the guard commander, do not admit prime minister Chan through the palace gate.",
              "idiomatic": "Bo ordered Zhang to oversee the army gate and commanded Pingyang Marquis to inform the Guard Commander not to admit Prime Minister Chan through the palace gate.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "產不知祿已去北 軍，入未央宮欲為亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chan not knowing Lu already left the northern army, entered Weiyang Palace wishing to make rebellion.",
              "idiomatic": "Unaware that Lu had already left the Northern Army, Chan entered Weiyang Palace intending to start a rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "殿門弗內，徘徊往來。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Palace gate not admitted, paced back and forth.",
              "idiomatic": "The palace gate would not admit him, so he paced back and forth outside.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "平陽侯馳語太尉勃，勃尚恐不勝，未敢誦言誅之，乃謂朱虛侯章曰：「急入宮衛帝。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pingyang marquis galloped to tell Grand Commandant Bo, Bo still feared not victorious, not dared to openly speak of executing them, then said to Zhu Xu marquis Zhang: 'Urgently enter palace guard the emperor.'",
              "idiomatic": "Pingyang Marquis galloped to inform Grand Commandant Bo. Bo still feared they might not prevail and dared not openly speak of executing them. He then said to Zhu Xu Marquis Zhang: 'Urgently enter the palace to guard the emperor.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "章從勃請卒千人，入未央宮掖 門，見產廷中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhang from Bo requested troops one thousand, entered Weiyang Palace side gate, saw Chan in the courtyard.",
              "idiomatic": "Zhang requested one thousand troops from Bo and entered Weiyang Palace through the side gate, where he saw Chan in the courtyard.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "日餔時，遂擊產。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Late afternoon time, then struck Chan.",
              "idiomatic": "At dusk, they attacked Chan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "產走。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chan fled.",
              "idiomatic": "Chan fled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "天大風，從官亂，莫敢鬥者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Heaven great wind, attendant officials in chaos, none dared fight.",
              "idiomatic": "A great wind arose from heaven, throwing the attendant officials into chaos. None dared to fight.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "逐產，殺之郎中府吏舍廁中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pursued Chan, killed him in the langzhong mansion clerk residence toilet.",
              "idiomatic": "They pursued Chan and killed him in the toilet of the Langzhong Mansion clerk's residence.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the geng-shen day of the eighth month, Pingyang Marquis Kui, acting as Imperial Censor Chief, went to see Prime Minister Chan to discuss matters. Palace Attendant Commander Jia Shou had brought a follower from Qi, who used this opportunity to berate Chan: 'The king should have returned to his country early. Now even if he wishes to go, can he still manage it?' He fully informed Chan of the situation where Guan Ying had allied with Qi and Chu. Pingyang Marquis Kui heard their conversation and galloped to inform Chancellor Ping and Grand Commandant Bo. Bo wished to enter the Northern Army but was unable to do so. Xiangping Marquis Ji Tong still held the imperial tally and seal. He was ordered to hold the seal and forge an imperial command to bring Bo into the Northern Army. Bo then ordered Li Ji and Protocol Director Liu Jie to persuade Lu: 'The emperor has made the Grand Commandant guard the Northern Army. He wishes you to return to your country. Urgently return the general's seal and depart.' Otherwise, calamity will ensue.' Lu then removed his seal and entrusted it to the Protocol Director, handing over command of the troops to Grand Commandant Bo. Bo entered the army gate and issued a command throughout the army: 'Bare your right arm for the Lü clan, bare your left arm for the Liu clan.' The entire army bared their left arms. Bo then took command of the Northern Army. However, there was still the Southern Army. Chancellor Ping summoned Zhu Xu Marquis Zhang to assist Bo. Bo ordered Zhang to oversee the army gate and commanded Pingyang Marquis to inform the Guard Commander not to admit Prime Minister Chan through the palace gate. Unaware that Lu had already left the Northern Army, Chan entered Weiyang Palace intending to start a rebellion. The palace gate would not admit him, so he paced back and forth outside. Pingyang Marquis galloped to inform Grand Commandant Bo. Bo still feared they might not prevail and dared not openly speak of executing them. He then said to Zhu Xu Marquis Zhang: 'Urgently enter the palace to guard the emperor.' Zhang requested one thousand troops from Bo and entered Weiyang Palace through the side gate, where he saw Chan in the courtyard. At dusk, they attacked Chan. Chan fled. A great wind arose from heaven, throwing the attendant officials into chaos. None dared to fight. They pursued Chan and killed him in the toilet of the Langzhong Mansion clerk's residence.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0080",
          "zh": "章已殺產，帝令謁者持節勞章。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhang already killed Chan, emperor ordered courtier hold seal reward Zhang.",
              "idiomatic": "After Zhang had killed Chan, the emperor ordered a courtier to hold the imperial seal and reward Zhang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "章欲奪節，謁者不肯，章乃從與載，因節信馳斬長樂衛尉呂更始。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhang wished to seize the seal, courtier not willing, Zhang then followed and rode with him, by means of the seal galloped and beheaded Changle guard commander Lü Gengshi.",
              "idiomatic": "Zhang wished to seize the seal, but the courtier refused. Zhang then rode with him and, using the authority of the seal, galloped to behead Changle Guard Commander Lü Gengshi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "還入北軍，復報太尉勃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Returned entered northern army, again reported to Grand Commandant Bo.",
              "idiomatic": "He returned and entered the Northern Army, then reported back to Grand Commandant Bo.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "勃起拜賀章，曰：「所患獨產，今已誅，天下定矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo rose bowed congratulated Zhang, said: 'What we feared was only Chan, now already executed, the realm is settled.'",
              "idiomatic": "Bo rose, bowed, and congratulated Zhang: 'What we feared was only Chan. Now he has been executed and the realm is at peace.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "辛酉，",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xin-you,",
              "idiomatic": "On xin-you day,",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Zhang had killed Chan, the emperor ordered a courtier to hold the imperial seal and reward Zhang. Zhang wished to seize the seal, but the courtier refused. Zhang then rode with him and, using the authority of the seal, galloped to behead Changle Guard Commander Lü Gengshi. He returned and entered the Northern Army, then reported back to Grand Commandant Bo. Bo rose, bowed, and congratulated Zhang: 'What we feared was only Chan. Now he has been executed and the realm is at peace.' On xin-you day,",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "殺呂祿，笞殺呂嬃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "killed Lü Lu, flogged to death Lü Xu.",
              "idiomatic": "they killed Lü Lu and flogged Lü Xu to death.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "分部悉捕諸呂男女，無少長皆斬之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Divided commands completely captured the various Lü males and females, regardless of young or old all beheaded them.",
              "idiomatic": "They divided into commands and completely captured all males and females of the Lü clan, beheading them regardless of age.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "they killed Lü Lu and flogged Lü Xu to death. They divided into commands and completely captured all males and females of the Lü clan, beheading them regardless of age.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0087",
          "zh": "大臣相與陰謀，以為少帝及三弟為王者皆非孝惠子，復共誅之，尊立文帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ministers mutually secretly plotted, considered the young emperor and three younger brothers who were kings all not Xiaohui's sons, again together executed them, honored and established Wen emperor.",
              "idiomatic": "The ministers secretly plotted together, determining that the young emperor and his three younger brothers who were kings were all not sons of Emperor Xiaohui. They executed them as well and honored Emperor Wen by establishing him on the throne.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "語在周勃、高五王傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Words in Zhou Bo, Gao Wu Wang transmission.",
              "idiomatic": "The account is in the biographies of Zhou Bo and the Five Kings of Gao.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The ministers secretly plotted together, determining that the young emperor and his three younger brothers who were kings were all not sons of Emperor Xiaohui. They executed them as well and honored Emperor Wen by establishing him on the throne. The account is in the biographies of Zhou Bo and the Five Kings of Gao.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0089",
          "zh": "贊曰：孝惠、高后之時，海內得離戰國之苦，君臣俱欲無為，故惠帝拱己，高后女主制政，不出房闥，而天下晏然，刑罰罕用，民務稼穡，衣食滋殖。",
          "translations": [
            {
              "lang": "en",
              "literal": "Praise says: Xiaohui, Gao Hou's time, within the seas obtained release from Warring States suffering, ruler and ministers all wished non-action, therefore Hui emperor embraced himself, Gao Hou female ruler administered government, not leaving the chambers, yet the realm peaceful, punishments rarely used, people devoted to farming, clothing and food increased and grew.",
              "idiomatic": "The commentator says: During the reigns of Emperor Xiaohui and Empress Gao, the realm obtained release from the sufferings of the Warring States period. Both ruler and ministers wished for non-interference in governance. Therefore Emperor Hui embraced a policy of inaction, while Empress Gao, as female ruler, administered government without leaving her chambers. Yet the realm remained peaceful, punishments were rarely used, the people devoted themselves to farming, and clothing and food increased abundantly.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The commentator says: During the reigns of Emperor Xiaohui and Empress Gao, the realm obtained release from the sufferings of the Warring States period. Both ruler and ministers wished for non-interference in governance. Therefore Emperor Hui embraced a policy of inaction, while Empress Gao, as female ruler, administered government without leaving her chambers. Yet the realm remained peaceful, punishments were rarely used, the people devoted themselves to farming, and clothing and food increased abundantly.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}