{
  "meta": {
    "book": "hanshu",
    "bookInfo": {
      "name": "Book of Han",
      "chinese": "漢書",
      "pinyin": "Hànshū",
      "dynasty": "Western Han",
      "author": "Ban Gu",
      "authorChinese": "班固"
    },
    "chapter": "009",
    "url": "https://chinesenotes.com/hanshu/hanshu009.html",
    "title": {
      "zh": "卷八 宣帝紀",
      "en": "Volume 8: Annals of Emperor Xuan",
      "raw": "卷八 宣帝紀 Volume 8: Annals of Emperor Xuan"
    },
    "sentenceCount": 402,
    "translatedCount": 402,
    "glossarySize": 14688,
    "scrapedAt": "2025-12-23T16:54:34.165Z",
    "translators": [],
    "citation": null,
    "qualityScore": 8
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝宣皇帝，武帝曾孫，戾太子孫也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Filial Emperor Xuan was Emperor Wu's great-grandson, Li Prince's grandson.",
              "idiomatic": "Emperor Xuan, known for his filial piety, was the great-grandson of Emperor Wu and the grandson of the ill-fated Crown Prince Li.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "太子納史良娣，生史皇孫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Crown Prince took Lady Shi as consort, gave birth to Shi the Imperial Grandson.",
              "idiomatic": "The Crown Prince took Lady Shi as his consort, and she bore him a son who became known as Imperial Grandson Shi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "皇孫納王夫人，生宣帝，號曰皇曾孫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Imperial Grandson took Lady Wang as wife, gave birth to Xuan Emperor, styled Royal Great-Grandson.",
              "idiomatic": "The Imperial Grandson married Lady Wang, and she bore him a son who would become Emperor Xuan, known at the time as the Royal Great-Grandson.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "生 數月，遭巫蠱事，太子、良娣、皇孫、王夫人皆遇害。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Born several months, encountered witchcraft affair, Crown Prince, consort, Imperial Grandson, Lady Wang all suffered harm.",
              "idiomatic": "Just months after his birth, disaster struck with the witchcraft scandal. The Crown Prince, his consort, the Imperial Grandson, and Lady Wang were all put to death.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "語在太子傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Account in Crown Prince biography.",
              "idiomatic": "The full account appears in the biography of the Crown Prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "曾孫雖在襁褓，猶坐收繫郡邸獄。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great-grandson though in swaddling clothes, still implicated arrested confined in commandery residence prison.",
              "idiomatic": "Though still an infant in swaddling clothes, the great-grandson was nonetheless implicated and imprisoned in the commandery residence jail.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "而邴吉為廷尉監，治巫蠱於郡邸，憐曾孫之亡辜，使女徒復作 淮陽趙徵卿、渭城胡組更乳養，私給衣食，視遇甚有恩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bing Ji was Court Judge Supervisor, handled witchcraft at commandery residence, pitied great-grandson of innocence, made female convicts Zhao Zhengqing of Huaiyang, Hu Zu of Weicheng alternately nurse, privately provided clothing food, treatment had much kindness.",
              "idiomatic": "Bing Ji, who supervised the Court Judge's office and handled the witchcraft case at the commandery residence, took pity on the innocent great-grandson. He arranged for female convicts—Zhao Zhengqing from Huaiyang and Hu Zu from Weicheng—to take turns nursing the child, and he personally provided for the boy's clothing and food, treating him with great kindness.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "巫蠱事連歲不決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Witchcraft affair connected years not resolved.",
              "idiomatic": "The witchcraft scandal dragged on for years without resolution.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "至後元二年，武帝疾，往來長楊、五柞宮，望氣者言長安獄中有天子氣，上遣使者分條中都官獄繫者，輕重皆殺之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "To Houyuan second year, Emperor Wu ill, traveled Changyang, Wuzuo Palaces, qi observers said Chang'an prison had imperial aura, His Majesty sent envoys separately execute capital official prison prisoners, light heavy all kill them.",
              "idiomatic": "By the second year of the Houyuan era, Emperor Wu fell ill and traveled between the Changyang and Wuzuo Palaces. Diviners reported that an imperial aura emanated from the Chang'an prison. The emperor sent envoys to execute all prisoners in the capital's official jails, regardless of whether their crimes were serious or minor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "內謁者令郭穰夜至郡邸獄，吉拒閉，使者不得入，曾孫賴吉得全。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Inner Usher Superintendent Guo Rang night arrived commandery residence prison, Ji refused closed, envoys could not enter, great-grandson relied on Ji survived complete.",
              "idiomatic": "That night, Inner Usher Superintendent Guo Rang arrived at the commandery residence prison. Bing Ji barred the gates and refused entry to the envoys. Thanks to Ji's protection, the great-grandson survived unharmed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "因遭大赦，吉乃載曾孫送祖母史良娣家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Because encountered general amnesty, Ji then loaded great-grandson sent to grandmother Lady Shi consort home.",
              "idiomatic": "When a general amnesty was declared, Bing Ji took the great-grandson and delivered him to the home of his grandmother, Lady Shi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "語在吉及外戚傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Account in Ji and imperial relatives biographies.",
              "idiomatic": "The full account appears in the biographies of Bing Ji and the imperial relatives.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "後有詔掖庭養視，上屬籍宗正。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Later had edict rear court nurture oversee, register in Superintendent of Imperial Clan records.",
              "idiomatic": "Later, an edict ordered the rear court to nurture and oversee him, and he was registered in the records of the Superintendent of the Imperial Clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "時掖庭令張賀嘗事戾太子，思顧舊恩，哀曾孫，奉養甚謹，以私錢供給教 書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At time rear court superintendent Zhang He once served Li Crown Prince, thought of repaid old kindness, pitied great-grandson, cared for very carefully, with private money provided teaching books.",
              "idiomatic": "Zhang He, superintendent of the rear court, had once served the ill-fated Crown Prince Li and felt a sense of obligation from past loyalties. He took pity on the great-grandson and cared for him with great attentiveness, using his own money to provide education and books.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "既壯，為取暴室嗇夫許廣漢女，曾孫因依倚廣漢兄弟及祖母家史氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Already grown, for him took Baoshi bailiff Xu Guanghan's daughter, great-grandson therefore relied on Guanghan brothers and grandmother's family Shi clan.",
              "idiomatic": "Once he was grown, arrangements were made for him to marry the daughter of Xu Guanghan, the bailiff of the Baoshi prison. The great-grandson came to rely on the Guanghan brothers and his grandmother's family, the Shi clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "受詩於東海澓中翁，高材好學，然亦喜游俠，鬥雞走馬，具知閭里奸邪，吏治得失。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Received Poetry from Donghai Pi Zhongong, high talent fond of study, yet also delighted in wandering knights, cockfighting horse racing, fully knew alley evil, official administration gains losses.",
              "idiomatic": "He studied the Poetry with Pi Zhongong of Donghai, showing great talent and a love of learning. Yet he also enjoyed the company of wandering knights, cockfighting, and horse racing. He came to know intimately the vices of the common people and the successes and failures of local administration.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "數上下 諸陵，周遍三輔，常困於蓮勺鹵中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Frequently went up down various tombs, circled Three Adjuncts, often poor in Lian Shao Lu middle.",
              "idiomatic": "He frequently traveled to visit the various imperial tombs, circling through the Three Adjuncts region. He often found himself in dire financial straits in the midst of Lian, Shao, and Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "尤樂杜、鄠之間，率常在下杜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Especially delighted Du, Hu between, generally often at Lower Du.",
              "idiomatic": "He particularly enjoyed the area between Du and Hu, and generally spent his time in Lower Du.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "時會朝請，舍長安尚冠里，身足下有毛，臥居數有光燿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At times attended court audiences, resided Chang'an Shangguan quarter, body feet below had fur, sleeping living several had bright radiance.",
              "idiomatic": "When he attended court audiences, he resided in the Shangguan quarter of Chang'an. His body and legs below the knees grew fur, and his sleeping quarters were frequently filled with radiant light.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "每買餅，所從買家輒大讎，亦以自是 怪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Every bought cakes, place bought from immediately big wealth, also considered this strange omen.",
              "idiomatic": "Whenever he bought cakes, the seller's family would immediately become wealthy. He himself considered this an auspicious omen.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0021",
          "zh": "元平元年四月，昭帝崩，毋嗣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yuanping first year fourth month, Emperor Zhao passed away, no heir.",
              "idiomatic": "In the fourth month of the first year of the Yuanping era, Emperor Zhao passed away without an heir.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "大將軍霍光請皇后徵昌邑王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand General Huo Guang requested Empress summon Changyi King.",
              "idiomatic": "Grand General Huo Guang petitioned the Empress to summon the King of Changyi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "六月丙寅，王受皇帝璽綬，尊皇后曰皇太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month Bingyin, King received imperial seal ribbons, honored Empress as Empress Dowager.",
              "idiomatic": "On the Bingyin day of the sixth month, the King received the imperial seal and ribbons, and the Empress was honored as Empress Dowager.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "癸巳，光奏王賀淫亂，請廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guiwei, Guang memorialized King He licentious disorder, requested depose.",
              "idiomatic": "On the Guiwei day, Huo Guang memorialized that King He was licentious and disorderly, requesting his deposition.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "語在賀及光傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Account in He and Guang biographies.",
              "idiomatic": "The full account appears in the biographies of King He and Huo Guang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0026",
          "zh": "秋七月，光奏議曰：「禮，人道親親故尊祖，尊祖故敬宗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn seventh month, Guang memorialized discussion said: 'Ritual, human way love relatives therefore honor ancestors, honor ancestors therefore respect clan.",
              "idiomatic": "In the seventh month of autumn, Huo Guang memorialized: 'According to ritual, human relationships require loving relatives and thus honoring ancestors; honoring ancestors requires respecting the clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "大宗毋嗣，擇支子孫賢者為嗣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Main line no heir, choose branch descendants worthy one as heir.",
              "idiomatic": "When the main line has no heir, one chooses a worthy descendant from a collateral branch to succeed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "孝武皇帝曾孫 病已，有詔掖庭養視，至今年十八，師受詩、論語、孝經，操行節儉，慈仁愛人，可以嗣孝昭皇帝後，奉承祖宗，子萬姓。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Filial Wu Emperor great-grandson Bing Ji, had edict rear court nurture oversee, to this year eighteen, studied received Poetry, Analects, Filial Piety Classic, conduct frugal, compassionate benevolent loves people, can succeed Filial Zhao Emperor line, serve ancestors, father myriad surnames.'",
              "idiomatic": "The great-grandson of Emperor Wu, Liu Bing Ji, was placed under the care of the rear court by imperial edict. He is now eighteen years old and has studied the Poetry, the Analects, and the Classic of Filial Piety. His conduct is frugal, he is compassionate and benevolent, loving toward people. He can succeed to the line of Emperor Zhao, serve the ancestors, and become father to the myriad people.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "奏可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Memorial approved.",
              "idiomatic": "The memorial was approved.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "遣宗正德至曾孫尚冠里舍，洗 沐，賜御府衣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sent Superintendent of Imperial Clan De to great-grandson Shangguan quarter residence, bathed, granted imperial wardrobe clothing.",
              "idiomatic": "Superintendent of the Imperial Clan Liu De was sent to the great-grandson's residence in the Shangguan quarter. He was bathed and given clothing from the imperial wardrobe.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "太僕以軨獵車奉迎曾孫，就齊宗正府。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Coachman with canopy hunting chariot welcomed great-grandson, proceeded to Superintendent of Imperial Clan office.",
              "idiomatic": "The Grand Coachman arrived with a canopied hunting chariot to welcome the great-grandson and escort him to the office of the Superintendent of the Imperial Clan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "庚申，入未央宮，見皇太后，封為陽武侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gengshen, entered Weiyang Palace, saw Empress Dowager, enfeoffed as Yangwu Marquis.",
              "idiomatic": "On the Gengshen day, he entered Weiyang Palace, was presented to the Empress Dowager, and was enfeoffed as Marquis of Yangwu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "已而群臣奉上璽綬，即皇帝位，謁高廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then all ministers presented imperial seal ribbons, assumed emperor position, visited Gao Temple.",
              "idiomatic": "The assembled ministers then presented him with the imperial seal and ribbons. He assumed the emperor's position and paid respects at the Gao Temple.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "八月己巳，丞相敞薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth month Jisi, Chancellor Dang passed away.",
              "idiomatic": "On the Jisi day of the eighth month, Chancellor Dang passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "九月，大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth month, great amnesty empire.",
              "idiomatic": "In the ninth month, a general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0036",
          "zh": "十一月壬子，立皇后許氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh month Renshu, established Empress Xu clan.",
              "idiomatic": "On the Renshu day of the eleventh month, Lady Xu was established as Empress.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "賜諸侯王以下金錢，至吏民鰥寡孤獨各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted feudal lords and below gold money, to officials commoners widowers widows orphans solitary each according to degree.",
              "idiomatic": "Grants of gold and money were given to the feudal kings and below, extending down to officials and commoners, including widowers, widows, orphans, and the solitary, each according to their circumstances.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "皇太后歸長樂宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Empress Dowager returned Changle Palace.",
              "idiomatic": "The Empress Dowager returned to Changle Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "初置屯衛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "First established garrison guards.",
              "idiomatic": "Garrison guards were established for the first time.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "本始元年春正月，募郡國吏民訾百萬以上徙平陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Benshi first year spring first month, recruited commanderies kingdoms officials civilians property worth million above relocate Pingling.",
              "idiomatic": "In the first month of spring in the first year of the Benshi era, officials and civilians from the commanderies and kingdoms whose property was worth more than 1,000,000 cash were recruited to relocate to Pingling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "遣使者持節詔郡國二千石謹牧養民而風德化。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sent envoys holding tallies edicted commanderies kingdoms 2000 piculs officials carefully shepherd nurture people and spread moral transformation.",
              "idiomatic": "Envoys bearing imperial tallies were sent to issue edicts to the officials of 2000 piculs rank in the commanderies and kingdoms, instructing them to carefully shepherd and nurture the people while spreading moral transformation.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0042",
          "zh": "大將軍光稽首歸政，上謙讓委任焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand General Guang bowed head returned government, His Majesty modestly declined entrusted therewith.",
              "idiomatic": "Grand General Huo Guang bowed low and returned governance to the emperor. His Majesty modestly declined but entrusted him with the responsibility nonetheless.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "論定策功，益封大將軍光萬七千戶，車騎將軍光祿勳富平侯安世萬 戶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Evaluated establishing policy merit, increased fief Grand General Guang 17,000 households, Cavalry General Chamberlain for Attendants Fuping Marquis Anshi 10,000 households.",
              "idiomatic": "For their merit in establishing the succession policy, Grand General Huo Guang was granted an additional 17,000 households in fief, and Cavalry General and Chamberlain for Attendants Jin Anshi, Marquis of Fuping, was granted an additional 10,000 households.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "詔曰：「故丞相安平侯敞等居位守職，與大將軍光、車騎將軍安世建議定策，以安宗廟，功賞未加而薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Former Chancellor Anping Marquis Dang and others held positions defended duties, with Grand General Guang, Cavalry General Anshi suggested established policy, to pacify ancestral temples, merit reward not yet added when passed away.",
              "idiomatic": "An edict declared: 'The former Chancellor, Marquis of Anping, Wei Dang, and others held their positions and fulfilled their duties. Together with Grand General Huo Guang and Cavalry General Jin Anshi, they proposed and established the succession policy to pacify the ancestral temples. Their merit was not yet rewarded when they passed away.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "其益封敞嗣子忠及丞相陽平侯義、度遼將軍平陵侯明 友、前將軍龍雒侯增、太僕建平侯延年、太常蒲侯昌、諫大夫宜春侯譚、當塗侯平、杜侯屠耆堂、長信少府關內侯勝邑戶各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Their increased fief Dang successor son Zhong and Chancellor Yangping Marquis Yi, General Who Crosses Liao Pingling Marquis Mingyou, Former General Longluo Marquis Zeng, Grand Coachman Jianping Marquis Yannian, Grand Master of Ceremonies Pu Marquis Chang, Remonstrance Official Yichun Marquis Tan, Dangtu Marquis Ping, Du Marquis Tu Qitang, Changxin Junior Treasurer Guannei Marquis Sheng estate households each according to degree.",
              "idiomatic": "Their heirs were accordingly granted increased fiefs: Wei Dang's successor son Wei Zhong; Chancellor and Marquis of Yangping Wang Yi; General Who Crosses Liao and Marquis of Pingling Fan Mingyou; Former General and Marquis of Longluo Li Zeng; Grand Coachman and Marquis of Jianping Du Yannian; Grand Master of Ceremonies and Marquis of Pu Su Chang; Remonstrance Official and Marquis of Yichun Wang Tan; Marquis of Dangtu Wei Ping; Marquis of Du Tu Qitang; and Changxin Junior Treasurer and Guannei Marquis Wei Sheng. Each received estates and households according to their merit.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "封御史大夫廣明為昌水侯，後將軍 充國為營平侯，大司農延年為陽城侯，少府樂成為爰氏侯，光祿大夫遷為平丘侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoffed Chamberlain for Law Enforcement Guangming as Changshui Marquis, Rear General Chongguo as Yingping Marquis, Grand Minister of Agriculture Yannian as Yangcheng Marquis, Junior Treasurer Yuecheng as Yuanshi Marquis, Chamberlain for Attendants Qian as Pingqiu Marquis.",
              "idiomatic": "Chamberlain for Law Enforcement Zheng Guangming was enfeoffed as Marquis of Changshui; Rear General Zhao Chongguo as Marquis of Yingping; Grand Minister of Agriculture Ning Yannian as Marquis of Yangcheng; Junior Treasurer Shi Yuecheng as Marquis of Yuanshi; and Chamberlain for Attendants Ren Qian as Marquis of Pingqiu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "賜右扶風德、典屬國武、廷尉光、宗正德、大鴻臚賢、詹事畸、光祿大夫吉、京輔 都尉廣漢爵皆關內侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted Right Assistant Protector De, Superintendent of Dependencies Wu, Court Judge Guang, Superintendent of Imperial Clan De, Grand Herald Xian, Household Administrator Yi, Chamberlain for Attendants Ji, Capital Area Commandant Guanghan ranks all Guannei Marquis.",
              "idiomatic": "Right Assistant Protector Zhao De, Superintendent of Dependencies Zhang Wu, Court Judge Du Guang, Superintendent of the Imperial Clan Liu De, Grand Herald Wei Xian, Household Administrator Shi Yi, Chamberlain for Attendants Bing Ji, and Capital Area Commandant Xu Guanghan were all granted the rank of Guannei Marquis.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "德、武食邑。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "De, Wu received fief income.'",
              "idiomatic": "Zhao De and Zhang Wu were granted fief income.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0049",
          "zh": "夏四月庚午，地震。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month Gengwu, earthquake.",
              "idiomatic": "On the Gengwu day of the fourth month of summer, there was an earthquake.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "詔內郡國舉文學高第各一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict inner commanderies kingdoms recommend literary scholars highest rank each one person.",
              "idiomatic": "An edict ordered the inner commanderies and kingdoms to recommend one literary scholar of the highest rank each.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0051",
          "zh": "五月，鳳皇集膠東、千乘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth month: Phoenix gathered in Jiaodong, Qiansheng.",
              "idiomatic": "In the fifth month, a phoenix appeared in Jiaodong and Qiansheng commanderies.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Amnestied the empire.",
              "idiomatic": "A general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "賜吏二千石、諸侯相、下至中都官、宦吏、六百石爵，各有差，自左更至五大夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted officials of 2000 piculs, feudal lords' chancellors, down to capital official eunuchs, 600 piculs officials noble ranks, each according to degree, from Left Alternate to Grandee of the Fifth Rank.",
              "idiomatic": "Officials ranked at 2000 piculs, chancellors of the feudal kingdoms, and all officials down to the eunuchs in the capital offices and those ranked at 600 piculs were granted noble ranks according to their positions, ranging from the rank of Left Alternate to Grandee of the Fifth Rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "賜天下人爵各一級，孝者二級，女子百戶牛酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted empire people noble ranks each one level, filial ones two levels, women 100 households cattle wine.",
              "idiomatic": "All people in the empire were granted one noble rank, while the filial received two levels. Women who headed 100 households were granted cattle and wine.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "租稅勿收。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rents taxes do not collect.",
              "idiomatic": "Land rents and taxes were suspended.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0056",
          "zh": "六月，詔曰：「故皇太子在湖，未有號諡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month, edict said: 'Former Crown Prince at Lake, not yet had designation posthumous name.",
              "idiomatic": "In the sixth month, an edict declared: 'The former Crown Prince, who lies buried at the Lake, has not yet received a designated posthumous name.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "歲時祠，其議諡，置園邑。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Year season sacrifice, discuss posthumous name, establish park estate.'",
              "idiomatic": "Seasonal sacrifices should be offered. Discuss and establish a posthumous name, and set up a park estate.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "語在太子傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Account in Crown Prince biography.",
              "idiomatic": "The full account appears in the biography of the Crown Prince.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0059",
          "zh": "秋七月，詔立燕剌王太子建為廣陽王，立廣陵王胥少子弘為高密王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn seventh month, edict established Yan Stab King crown prince Jian as Guangyang King, established Guangling King Xu youngest son Hong as Gaomi King.",
              "idiomatic": "In the seventh month of autumn, an edict established the Crown Prince Jian of the King of Yan (who had been executed) as King of Guangyang, and established Hong, the youngest son of the King of Guangling, as King of Gaomi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "二年春，以水衡錢為平陵，徙民起第宅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring, used Water Bureau money for Pingling, relocated people built mansions residences.",
              "idiomatic": "In spring of the second year, funds from the Water Bureau were used for Pingling to relocate people and build mansions and residences.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "大司農陽城侯田延年有罪，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Minister of Agriculture Yangcheng Marquis Tian Yannian had crime, committed suicide.",
              "idiomatic": "Tian Yannian, Grand Minister of Agriculture and Marquis of Yangcheng, was found guilty of a crime and committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0062",
          "zh": "夏五月，詔曰：「朕以眇身奉承祖宗，夙夜惟念孝武皇帝躬履仁義，選明將，討不服，匈奴遠遁，平氐、 羌、昆明、南越，百蠻鄉風，款塞來享；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, edict said: 'I with slight body serve ancestors, morning night only think Filial Wu Emperor personally practice benevolence righteousness, selected wise generals, attacked unsubmissive, Xiongnu far fled, pacified Di, Qiang, Kunming, Nanyue, hundred barbarians turned toward wind, submitted frontier came enjoy;",
              "idiomatic": "In the fifth month of summer, an edict declared: 'With my unworthy person I serve the ancestors, and morning and night I think only of how Emperor Wu personally practiced benevolence and righteousness, selected wise generals, attacked those who would not submit, causing the Xiongnu to flee far away. He pacified the Di, Qiang, Kunming, and Nanyue, and the hundred barbarian tribes turned toward civilization, submitting at the frontiers to enjoy peace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "建太學，修郊祀，定正朔，協音律；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established Grand Academy, repaired suburban sacrifices, determined correct calendar, harmonized musical pitches;",
              "idiomatic": "He established the Grand Academy, repaired the suburban sacrifices, determined the correct calendar, and harmonized the musical pitches.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "封泰山，塞宣房，符瑞應，寶鼎出，白麟獲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoffed Mount Tai, blocked Xuanfang, talismans auspicious responses, precious tripod emerged, white unicorn obtained.",
              "idiomatic": "He performed the Feng sacrifice on Mount Tai, built dikes at Xuanfang, received auspicious talismans and omens, saw the precious tripod emerge, and obtained a white unicorn.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "功德茂盛，不能盡宣，而廟樂未稱，其議 奏。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Merit virtue luxuriant flourishing, cannot exhaust proclaim, yet temple music not fitting, discuss memorialize.'",
              "idiomatic": "His merit and virtue were luxuriantly flourishing and cannot be fully proclaimed, yet the temple music does not do them justice. Discuss and memorialize on this matter.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "有司奏請宜加尊號。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Officials memorialized requested should add honored title.",
              "idiomatic": "The officials memorialized requesting that an honored title should be added.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "六月庚午，尊孝武廟為世宗廟，奏盛德、文始、五行之舞，天子世世獻。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month Gengwu, honored Filial Wu temple as Shizong temple, performed Prosperous Virtue, Literary Beginning, Five Phases dances, Son of Heaven generation generation offer.",
              "idiomatic": "On the Gengwu day of the sixth month, the temple of Emperor Wu was honored as the Shizong Temple, and the dances of Prosperous Virtue, Literary Beginning, and the Five Phases were performed, to be offered by the Son of Heaven in every generation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "武帝巡狩所幸之郡國，皆立廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Emperor inspection tours favored commanderies kingdoms, all established temples.",
              "idiomatic": "Temples were established in all the commanderies and kingdoms that Emperor Wu had visited during his inspection tours.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "賜民爵一級，女子百戶牛酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted people noble rank one level, women 100 households cattle wine.",
              "idiomatic": "The people were granted one noble rank, and women who headed 100 households were granted cattle and wine.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0070",
          "zh": "匈奴數侵邊，又西伐烏孫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu frequently invaded borders, moreover west attacked Wusun.",
              "idiomatic": "The Xiongnu frequently invaded the borders and also attacked the Wusun to the west.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "烏孫昆彌及公主因國使者上書，言昆彌願發國精兵擊匈奴，唯天子哀憐，出兵 以救公主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wusun Kunmi and princess through state envoys submitted memorial, said Kunmi wished dispatch state elite troops attack Xiongnu, only Son of Heaven pity, send troops rescue princess.",
              "idiomatic": "The Kunmi of Wusun and the princess, through their state's envoys, submitted a memorial stating that the Kunmi wished to dispatch the state's elite troops to attack the Xiongnu. They only asked that the Son of Heaven, in his pity, send troops to rescue the princess.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "秋，大發興調關東輕車銳卒，選郡國吏三百石伉健習騎射者，皆從軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, greatly mobilized raised levied Guandong light chariots sharp troops, selected commanderies kingdoms officials 300 piculs strong robust practiced horse archery ones, all followed army.",
              "idiomatic": "In autumn, a great mobilization was ordered, levying light chariots and elite troops from east of the passes. Officials of 300 piculs rank from the commanderies and kingdoms who were strong, robust, and skilled in horse archery were selected and all joined the army.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "御史大夫田廣明為祁連將軍，後將軍趙充國為蒲類將軍，雲中太守田順為虎牙將 軍，及度遼將軍范明友、前將軍韓增，凡五將軍，兵十五萬騎，校尉常惠持節護烏孫兵，咸擊匈奴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chamberlain for Law Enforcement Tian Guangming as Qilian General, Rear General Zhao Chongguo as Pulei General, Yunzhong Governor Tian Shun as Huyao General, and Crossing Liao General Fan Mingyou, Former General Han Zeng, altogether five generals, troops 150,000 cavalry, Colonel Chang Hui held tally protected Wusun troops, all attacked Xiongnu.",
              "idiomatic": "Tian Guangming, Chamberlain for Law Enforcement, was appointed General of Qilian; Zhao Chongguo, Rear General, as General of Pulei; Tian Shun, Governor of Yunzhong, as General of Huyao; along with Fan Mingyou, General Who Crosses the Liao, and Han Zeng, Former General. Altogether five generals commanded 150,000 cavalry troops. Colonel Chang Hui, bearing the imperial tally, protected the Wusun forces. All attacked the Xiongnu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0074",
          "zh": "三年春正月癸亥，皇后許氏崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring first month Guihai, Empress Xu clan passed away.",
              "idiomatic": "On the Guihai day of the first month of spring in the third year, Empress Xu passed away.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "戊辰，五將軍師發長安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wuchen, five generals' armies departed Chang'an.",
              "idiomatic": "On the Wuchen day, the armies of the five generals departed from Chang'an.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "夏五月，軍罷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, army dismissed.",
              "idiomatic": "In the fifth month of summer, the army was disbanded.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "祁連將軍廣明、虎牙將軍順有罪，下有司，皆自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qilian General Guangming, Huyao General Shun had crime, sent to officials, all committed suicide.",
              "idiomatic": "General of Qilian Guangming and General of Huyao Shun were found guilty of crimes. They were handed over to the officials and both committed suicide.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "校尉常惠將烏孫兵入匈奴右地，大克獲，封列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Colonel Chang Hui led Wusun troops entered Xiongnu right land, greatly victorious captured, enfeoffed marquises.",
              "idiomatic": "Colonel Chang Hui led the Wusun troops into the right flank territory of the Xiongnu, achieving great victories and captures. He was enfeoffed as a marquis.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "大旱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great drought.",
              "idiomatic": "There was a great drought.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "郡國傷旱甚者，民毋出租賦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Commanderies kingdoms harmed by drought severely ones, people do not pay rents taxes.",
              "idiomatic": "In commanderies and kingdoms severely harmed by drought, the people were exempted from rents and taxes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "三輔民就賤者，且毋收事，盡四年。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three Adjuncts people seeking cheap ones, temporarily do not collect labor service, until fourth year.",
              "idiomatic": "People in the Three Adjuncts who were seeking cheaper grain were temporarily exempted from labor service until the end of the fourth year.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "六月己丑，丞相義薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month Jichou, Chancellor Yi passed away.",
              "idiomatic": "On the Jichou day of the sixth month, Chancellor Yi passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0083",
          "zh": "四年春正月，詔曰：「蓋聞農者興德之本也，今歲不登，已遣使者振貸困乏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year spring first month, edict said: 'Indeed heard farming is foundation of raising virtue, now year not bountiful, already sent envoys relieve aid impoverished destitute.",
              "idiomatic": "In the first month of spring in the fourth year, an edict declared: 'Indeed I have heard that farming is the foundation for cultivating virtue. This year has not been bountiful, so I have already sent envoys to relieve and aid those who are impoverished and destitute.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "其令太官損膳省宰，樂府減樂人，使歸就農業。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order Grand Provisioner reduce meals save butchering, Music Bureau reduce musicians, make return pursue agriculture.",
              "idiomatic": "I order the Grand Provisioner to reduce meals and save on butchering, the Music Bureau to reduce its musicians, and have them return to pursue agriculture.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "丞相以下至都官令丞上書入穀，輸長安倉，助貸貧民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chancellor below to capital official directors secretaries submit memorials enter grain, transport Chang'an granary, assist loan poor people.",
              "idiomatic": "From the Chancellor downward to the directors and secretaries of the capital offices, all should submit memorials to contribute grain, which will be transported to the Chang'an granary to assist in loans to the poor people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "民以車船載穀入關者，得毋用傳。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "People with carts boats carrying grain enter passes ones, permitted not use travel documents.'",
              "idiomatic": "People who transport grain by cart or boat to enter the passes are permitted to do so without requiring travel documents.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0087",
          "zh": "三月乙卯，立皇后霍氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month Yimao, established Empress Huo clan.",
              "idiomatic": "On the Yimao day of the third month, Lady Huo was established as Empress.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "賜丞相以下至郎吏從官金錢帛各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted Chancellor below to court gentleman officials attendants gold money silk each according to degree.",
              "idiomatic": "Grants of gold, money, and silk were given to the Chancellor and below, down to the court gentlemen and attendant officials, each according to their rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Amnestied the empire.",
              "idiomatic": "A general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "夏四月壬寅，郡國四十九地震，或山崩水出。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month Renyin, commanderies kingdoms forty-nine earthquakes, some mountains collapsed water emerged.",
              "idiomatic": "On the Renyin day of the fourth month of summer, earthquakes struck forty-nine commanderies and kingdoms, with some mountains collapsing and water emerging.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "詔曰：「蓋災異者，天地之戒也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Indeed calamities anomalies are Heaven Earth's warnings.",
              "idiomatic": "An edict declared: 'Indeed, calamities and anomalies are warnings from Heaven and Earth.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "朕承洪業，奉宗廟，託于 士民之上，未能和群生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I bear great enterprise, serve ancestral temples, entrusted above scholar people, not yet able harmonize all living things.",
              "idiomatic": "I bear this great enterprise, serve the ancestral temples, and am entrusted above the scholars and people, yet I have not been able to harmonize all living things.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "乃者地震北海、琅邪，壞祖宗廟，朕甚懼焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Recently earthquakes Beihai, Langye, damaged ancestor temples, I greatly fear this.",
              "idiomatic": "Recently there were earthquakes in Beihai and Langye that damaged the ancestral temples. I am greatly fearful of this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "丞相、御史其與列侯、中二千石博問經學之士，有以應變，輔朕之不逮，毋有所諱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chancellor, Chamberlain for Law Enforcement together with marquises, 2000 piculs officials extensively consult classics scholars, have ways respond to changes, assist my shortcomings, do not hold back.",
              "idiomatic": "The Chancellor and Chamberlain for Law Enforcement, together with the marquises and officials of 2000 piculs, should extensively consult with scholars of the classics. If they have ways to respond to these changes and assist my shortcomings, they should not hold back.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "令三輔、 太常、內郡國舉賢良方正各一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order Three Adjuncts, Grand Master of Ceremonies, inner commanderies kingdoms recommend worthy good upright each one person.",
              "idiomatic": "I order the Three Adjuncts, the Grand Master of Ceremonies, and the inner commanderies and kingdoms to recommend one person each who is worthy, good, and upright.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "律令有可蠲除以安百姓，條奏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Statutes ordinances have can remit eliminate to pacify common people, itemize memorialize.",
              "idiomatic": "If there are statutes and ordinances that can be remitted or eliminated to pacify the common people, itemize and memorialize on them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "被地震壞敗甚者，勿收租賦。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Suffered earthquake damaged destroyed severely ones, do not collect rents taxes.'",
              "idiomatic": "Those severely damaged and destroyed by the earthquakes shall have their rents and taxes exempted.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great amnesty empire.",
              "idiomatic": "A general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "上以宗廟墮，素服，避正殿五日。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty because ancestral temples collapsed, plain clothes, avoided main hall five days.",
              "idiomatic": "Because the ancestral temples had collapsed, His Majesty wore mourning clothes and avoided the main hall for five days.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0100",
          "zh": "五月，鳳皇集北海安丘、淳于。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth month: Phoenix gathered in Beihai Anqiu, Chunyu.",
              "idiomatic": "In the fifth month, a phoenix appeared in Anqiu and Chunyu of Beihai commandery.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "秋，廣川王吉有罪，廢遷上庸，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, Guangchuan King Ji had crime, deposed banished Shangyong, committed suicide.",
              "idiomatic": "In autumn, King Ji of Guangchuan was found guilty of a crime, deposed, banished to Shangyong, and committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "地節元年春正月，有星孛于西方。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dijie first year spring first month, had comet in western direction.",
              "idiomatic": "In the first month of spring in the first year of the Dijie era, a comet appeared in the western sky.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "三月，假郡國貧民田。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, loaned commanderies kingdoms poor people fields.",
              "idiomatic": "In the third month, fields were loaned to poor people in the commanderies and kingdoms.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "夏六月，詔曰：「蓋聞堯親九族，以和萬國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer sixth month, edict said: 'Indeed heard Yao loved nine clans, to harmonize myriad states.",
              "idiomatic": "In the sixth month of summer, an edict declared: 'Indeed I have heard that Yao loved his nine clans in order to harmonize the myriad states.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "朕蒙遺德，奉承聖業，惟念宗室屬未盡而以罪絕，若有賢材，改行勸善，其復屬，使得自新。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I receive inherited virtue, serve uphold sage enterprise, only think imperial clan connections not exhausted yet cut off by crime, if have worthy talent, reform conduct encourage goodness, then restore connections, enable self renewal.'",
              "idiomatic": "I have received inherited virtue and uphold the sage's enterprise. I think only of how the imperial clan's connections have not been exhausted, yet they have been cut off due to crimes. If there are those with worthy talents who reform their conduct and encourage goodness, then restore their connections and allow them to renew themselves.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "冬十一月，楚王延壽謀反，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter eleventh month, Chu King Yanshou plotted rebellion, committed suicide.",
              "idiomatic": "In the eleventh month of winter, King Yanshou of Chu plotted rebellion and committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "十二月癸亥晦，日有蝕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth month Guihai last day, there was an eclipse of the sun.",
              "idiomatic": "On the last day of the twelfth month, which fell on a Guihai day, there was a solar eclipse.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "夏四月，鳳皇集魯郡，群鳥從之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, phoenix gathered in Lu commandery, flock of birds followed it.",
              "idiomatic": "In the fourth month of summer, a phoenix appeared in Lu commandery, and a flock of birds followed it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great amnesty empire.",
              "idiomatic": "A general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0110",
          "zh": "五月，光祿大夫平丘侯王遷有罪，下獄死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth month, Chamberlain for Attendants Pingqiu Marquis Wang Qian had crime, imprisoned died.",
              "idiomatic": "In the fifth month, Wang Qian, Chamberlain for Attendants and Marquis of Pingqiu, was found guilty of a crime, imprisoned, and died.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0111",
          "zh": "上始親政事，又思報大將軍功德，乃復使樂平侯山領尚書事，而令群臣得奏封事，以知下情。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty began personally handle governmental affairs, moreover thought repay Grand General merit virtue, then again made Le Ping Marquis Shan lead Secretariat matters, and ordered all ministers able memorialize sealed documents, to know lower sentiments.",
              "idiomatic": "His Majesty began to personally handle governmental affairs, and thinking to repay the Grand General's meritorious service, he once again had Marquis Shan of Le Ping oversee Secretariat affairs. He also ordered that all ministers could submit sealed memorials to understand the sentiments of those below.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "五日一聽事，以下各奉職奏事，以傅奏其言，考試功能。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Every five days once hear affairs, below each fulfill duties memorialize affairs, use attendant relay their words, examine test abilities functions.",
              "idiomatic": "Every five days he would hear affairs once, and those below would each fulfill their duties and memorialize on affairs. Attendants would relay their words, and their abilities and functions would be examined and tested.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "侍中尚書功勞當遷及有異善，厚加賞賜，至于子孫，終不改易。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Palace Attendants Secretariat meritorious service should promote and have exceptional goodness, thickly add rewards grants, extend to sons grandsons, forever not change alter.",
              "idiomatic": "Palace Attendants and Secretariat officials whose meritorious service warranted promotion and who showed exceptional goodness were richly rewarded, with benefits extending to their sons and grandsons, never to be altered.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "樞機周密，品式備具，上下相安，莫有苟且之意也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Key mechanisms careful meticulous, categories models fully equipped, superiors inferiors mutually peaceful, none had perfunctory negligent intentions.",
              "idiomatic": "The key mechanisms were handled with careful meticulousness, all categories and models were fully equipped, superiors and inferiors were mutually at peace, and no one harbored perfunctory or negligent intentions.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "三年春三月，詔曰：「蓋聞有功不賞，有罪不誅，雖唐虞猶不能以化天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring third month, edict said: 'Indeed heard have merit not reward, have crime not punish, though Tang Yu still could not use to transform empire.",
              "idiomatic": "In the third month of spring in the third year, an edict declared: 'Indeed I have heard that if merit is not rewarded and crime is not punished, then even Tang and Yu could not use this to transform the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "今膠東相成勞來不怠，流民自占八萬餘口，治有異等。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Jiaodong Chancellor Cheng labored attracted not weary, floating people self registered eighty thousand more mouths, governance had exceptional rank.",
              "idiomatic": "Now Chancellor Cheng of Jiaodong has labored tirelessly to attract people, and more than 80,000 floating people have registered themselves. His governance has been of exceptional quality.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "其秩成中二千石，賜爵關內侯。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Give Cheng rank of 2000 piculs, grant title Guannei Marquis.'",
              "idiomatic": "Give Cheng the rank of 2000 piculs and grant him the title of Guannei Marquis.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0118",
          "zh": "又曰：「鰥寡孤獨高年貧困之民，朕所憐也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further said: 'Widowers widows orphans solitary aged impoverished people, I what pity.",
              "idiomatic": "The edict continued: 'Widowers, widows, orphans, the solitary, the aged, and impoverished people—these are those I pity.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "前下詔假公田，貨種、食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Previously issued edict loaned public fields, sold seed, food.",
              "idiomatic": "Previously, an edict was issued loaning public fields and selling seed and food.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "其加賜鰥寡孤獨高年帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Additionally grant widowers widows orphans solitary aged silk.",
              "idiomatic": "Additionally, grant silk to widowers, widows, orphans, the solitary, and the aged.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "二千石嚴教吏謹視遇，毋令失職。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "2000 piculs strictly teach officials carefully oversee treatment, do not let lose duties.'",
              "idiomatic": "Officials of 2000 piculs should strictly teach their subordinates and carefully oversee their treatment, not allowing them to neglect their duties.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "令內郡國舉賢良方正可親民者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order inner commanderies kingdoms recommend worthy good upright can approach people ones.",
              "idiomatic": "Order the inner commanderies and kingdoms to recommend those who are worthy, good, and upright, and who can approach and care for the people.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "夏四月戊申，立皇太子，大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month Wushen, established Crown Prince, great amnesty empire.",
              "idiomatic": "On the Wushen day of the fourth month of summer, the Crown Prince was established, and a general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "賜御史大夫爵關內侯，中二千石爵右庶長，天下當為父後者爵一級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted Chamberlain for Law Enforcement title Guannei Marquis, 2000 piculs title Right Shaolao, empire those who should succeed fathers noble rank one level.",
              "idiomatic": "The Chamberlain for Law Enforcement was granted the title of Guannei Marquis, officials of 2000 piculs were granted the title of Right Shaolao, and throughout the empire those who were to succeed their fathers were granted one noble rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "賜廣陵王黃金千斤，諸侯王十五人黃金各百斤，列侯在國者八十七人黃金各二十斤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted Guangling King gold thousand catties, feudal kings fifteen people gold each hundred catties, marquises in kingdoms eighty-seven people gold each twenty catties.",
              "idiomatic": "The King of Guangling was granted 1,000 catties of gold, fifteen feudal kings were each granted 100 catties of gold, and eighty-seven marquises in their kingdoms were each granted 20 catties of gold.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0126",
          "zh": "冬十月，詔曰：「乃者九月壬申地震，朕甚懼焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter tenth month, edict said: 'Recently ninth month Renshen earthquake, I greatly fear this.",
              "idiomatic": "In the tenth month of winter, an edict declared: 'Recently, on the Renshen day of the ninth month, there was an earthquake. I am greatly fearful of this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "有能箴朕過失，及賢良方正直言極諫之士以匡朕之不 逮，毋諱有司。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Have able admonish my faults, and worthy good upright direct speech extreme remonstrance scholars to correct my shortcomings, do not avoid officials.",
              "idiomatic": "If there are those able to admonish my faults, and worthy, good, and upright scholars who speak directly and remonstrate extremely to correct my shortcomings, do not avoid the officials.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "朕既不德，不能附遠，是以邊境屯戍未息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I already lacking virtue, cannot attach distant, therefore border garrisons not ceased.",
              "idiomatic": "I, lacking virtue, have been unable to win over distant peoples, which is why the border garrisons have not ceased.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "今復飭兵重屯，久勞百姓，非所以綏天下也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now again prepared troops heavy garrisons, long labor common people, not the way to pacify empire.",
              "idiomatic": "Now again preparing troops and establishing heavy garrisons has long labored the common people, which is not the way to pacify the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "其罷車騎將軍、右將軍屯兵。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dismiss Cavalry General, Right General garrison troops.'",
              "idiomatic": "Dismiss the garrison troops of the Cavalry General and Right General.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "又詔曰：「池烃未御幸者， 假與貧民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further edict said: 'Ponds marshes not yet imperial visited, loan to poor people.",
              "idiomatic": "A further edict declared: 'Ponds and marshes that have not yet been visited by the emperor should be loaned to poor people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "郡國宮館，勿復修治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Commanderies kingdoms palace lodgings, do not again repair maintain.",
              "idiomatic": "Palace lodgings in the commanderies and kingdoms should not be repaired and maintained again.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "流民還歸者，假公田，貸種、食，且勿算事。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Floating people return home ones, loan public fields, lend seed, food, temporarily do not calculate labor service.'",
              "idiomatic": "For floating people who return home, loan them public fields, lend them seed and food, and temporarily exempt them from labor service calculations.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0134",
          "zh": "十一月，詔曰：「朕既不逮，導民不明，反側晨興，念慮萬方，不忘元元。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh month, edict said: 'I already not reach, guide people not clear, restless early rise, think consider myriad directions, not forget common people.",
              "idiomatic": "In the eleventh month, an edict declared: 'I, being inadequate, have not clearly guided the people. Restless, I rise early and consider matters in all directions, never forgetting the common people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "唯恐羞先帝聖德，故並舉賢良方正以親萬姓，歷載臻茲，然而俗化闕焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Only fear shame former emperor sage virtue, therefore together recommend worthy good upright to approach myriad surnames, years reach here, yet customs transformation lacking.",
              "idiomatic": "I only fear shaming the sage virtue of the former emperor, which is why I have together recommended worthy and good upright officials to approach and care for the myriad people. Years have passed to reach this point, yet the transformation of customs is still lacking.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "傳曰：『孝弟也者，其為仁之本與！』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tradition says: 'Filial piety fraternity these, they are foundation of benevolence ah!'",
              "idiomatic": "The traditions say: 'Filial piety and fraternity—these are the foundation of benevolence, are they not!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "其令郡國舉孝弟有行義聞于鄉里者各一人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order commanderies kingdoms recommend filial fraternal have righteous conduct renowned in villages hamlets ones each one person.'",
              "idiomatic": "Order the commanderies and kingdoms to recommend one person each who is filial and fraternal and whose righteous conduct is renowned in their villages and hamlets.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0138",
          "zh": "十二月，初置廷尉平四人，秩六百石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth month, first established Court Judge assistants four people, rank 600 piculs.",
              "idiomatic": "In the twelfth month, four assistants to the Court Judge were first established, with a rank of 600 piculs.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0139",
          "zh": "省文山郡，并蜀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Abolished Wenshan commandery, merged with Shu.",
              "idiomatic": "Wenshan commandery was abolished and merged with Shu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0140",
          "zh": "四年春二月，封外祖母博平君，故酇侯蕭何曾孫建世為侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year spring second month, enfeoffed maternal grandmother Boping Jun, former Que Marquis Xiao He great-grandson Jianshi as marquis.",
              "idiomatic": "In the second month of spring in the fourth year, the maternal grandmother was enfeoffed as Lady of Boping, and Jianshi, great-grandson of the former Marquis of Que Xiao He, was enfeoffed as a marquis.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0141",
          "zh": "詔曰：「導民以孝，則天下順。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Guide people with filial piety, then empire orderly.",
              "idiomatic": "An edict declared: 'If the people are guided by filial piety, then the empire will be orderly.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "今百姓或遭衰絰凶災，而吏繇事，使不得葬，傷孝子之心，朕甚憐之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now common people some encounter mourning calamities disasters, yet officials labor service, cause cannot bury, wound filial sons' hearts, I greatly pity this.",
              "idiomatic": "Now some common people encounter mourning and calamitous disasters, yet officials make them perform labor service, preventing them from burying their dead and wounding the hearts of filial sons. I greatly pity this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "自今諸有大父母，父母喪者勿繇事，使得收斂送終，盡其子道。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From now all have grandparents, parents mourning ones do not labor service, enable them collect remains send to end, exhaust their son duty.'",
              "idiomatic": "From now on, all those mourning grandparents or parents should not perform labor service, allowing them to collect the remains and see the funeral through to completion, exhausting their duties as sons.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "夏五月，詔曰：「父子之親，夫婦之道，天性也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, edict said: 'Father son closeness, husband wife way, heavenly nature.",
              "idiomatic": "In the fifth month of summer, an edict declared: 'The closeness between father and son, the way of husband and wife—these are heavenly nature.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "雖有患禍，猶蒙死而存之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Though have troubles calamities, still cover death and preserve them.",
              "idiomatic": "Even when there are troubles and calamities, they still cover for each other in death and preserve one another.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "誠愛結于心，仁厚之至也，豈能違之哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sincere love tied in heart, benevolence thickness extreme, how can violate it ah!",
              "idiomatic": "Sincere love is tied in the heart, the utmost of benevolence and kindness—how could one violate it!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "自今子首匿父母，妻匿夫，孫匿大父母，皆勿坐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From now sons harbor hide parents, wives harbor hide husbands, grandsons harbor hide grandparents, all do not punish.",
              "idiomatic": "From now on, sons who harbor and hide their parents, wives who harbor and hide their husbands, and grandsons who harbor and hide their grandparents should all not be punished.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "其父母匿子，夫匿妻，大父母匿孫，罪殊死，皆上請廷尉以聞。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Their parents harbor hide sons, husbands harbor hide wives, grandparents harbor hide grandsons, crimes different death, all memorialize request Court Judge to hear.'",
              "idiomatic": "For parents who harbor and hide their sons, husbands who harbor and hide their wives, and grandparents who harbor and hide their grandsons, though their crimes differ from death, all should memorialize and request the Court Judge to hear the cases.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "立廣川惠王孫文為廣川王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established Guangchuan Hui King grandson Wen as Guangchuan King.",
              "idiomatic": "The grandson of King Hui of Guangchuan, Wen, was established as King of Guangchuan.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0150",
          "zh": "秋七月，大司馬霍禹謀反。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn seventh month, Grand Commander Huo Yu plotted rebellion.",
              "idiomatic": "In the seventh month of autumn, Grand Commander Huo Yu plotted rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "詔曰：「乃者，東織室令史張赦使魏郡豪李竟報冠陽侯霍雲謀為大逆，朕以大 將軍故，抑而不揚，冀其自新。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Recently, Eastern Weaving Room clerk Zhang She sent Weijun powerful family Li Jing to report Guanyang Marquis Huo Yun plotting great rebellion, I because Grand General reason, suppressed not raised, hoped they self renew.",
              "idiomatic": "An edict declared: 'Recently, the clerk of the Eastern Weaving Room, Zhang She, sent Li Jing, a powerful figure from Weijun, to report that Marquis of Guanyang Huo Yun was plotting great rebellion. Because of the Grand General, I suppressed the matter without publicizing it, hoping they would reform themselves.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "今大司馬博陸侯禹與母宣成侯夫人顯及從昆弟冠陽侯雲、樂平侯山、諸姊妹婿度遼將軍范明友、長信少府鄧廣漢、中郎將任勝、騎都 尉趙平、長安男子馮殷等謀為大逆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Grand Commander Bolu Marquis Yu with mother Xuancheng Marquis Lady Xian and paternal cousins Guanyang Marquis Yun, Leping Marquis Shan, various sisters' husbands Crossing Liao General Fan Mingyou, Changxin Junior Treasurer Deng Guanghan, Court Attendant Ren Sheng, Cavalry Commandant Zhao Ping, Chang'an man Feng Yin and others plotted great rebellion.",
              "idiomatic": "Now Grand Commander and Marquis of Bolu Huo Yu, together with his mother Lady Xian (wife of the Marquis of Xuancheng), his paternal cousins Marquis of Guanyang Huo Yun and Marquis of Leping Huo Shan, his various brothers-in-law General Who Crosses the Liao Fan Mingyou, Junior Treasurer of Changxin Deng Guanghan, Court Attendant Ren Sheng, Cavalry Commandant Zhao Ping, and Chang'an resident Feng Yin and others have plotted great rebellion.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "顯前又使女侍醫淳于衍進藥殺共哀后，謀毒太子，欲危宗廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xian previously moreover made female attendant physician Chunyu Yan present medicine kill Empress Gong'ai, plotted poison Crown Prince, wished endanger ancestral temples.",
              "idiomatic": "Previously, Xian also had the female attendant physician Chunyu Yan administer medicine to kill Empress Gong'ai, plotted to poison the Crown Prince, and sought to endanger the ancestral temples.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "逆亂不道，咸服其辜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rebellious disorder unprincipled, all submit to their guilt.",
              "idiomatic": "Their rebellious disorder and lack of principle have caused them all to submit to their guilt.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "諸為霍氏所詿誤未發覺在吏者，皆赦除 之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All who by Huo clan were deceived misled not yet discovered in office ones, all pardon remove them.'",
              "idiomatic": "All those who were deceived and misled by the Huo clan and whose involvement has not yet been discovered while they remain in office should all be pardoned and relieved of their duties.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "八月己酉，皇后霍氏廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eighth month Jiyou, Empress Huo clan deposed.",
              "idiomatic": "On the Jiyou day of the eighth month, Empress Huo was deposed.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "九月，詔曰：「朕惟百姓失職不贍，遣使者循行郡國問民所疾苦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth month, edict said: 'I consider common people lost employment not sufficient, sent envoys tour inspect commanderies kingdoms ask people sufferings hardships.",
              "idiomatic": "In the ninth month, an edict declared: 'I am concerned that the common people have lost their employment and are not sufficiently provided for. I have sent envoys to tour and inspect the commanderies and kingdoms to ask about the people's sufferings and hardships.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "吏或營私煩擾，不顧厥咎，朕甚閔之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Officials some pursue private interests troublesome disturbance, not consider their faults, I greatly pity this.",
              "idiomatic": "Some officials pursue private interests and cause troublesome disturbances, not considering their faults. I greatly pity this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "今年郡國頗被水災，已振貸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This year commanderies kingdoms considerably suffered flood disasters, already relieved aided.",
              "idiomatic": "This year the commanderies and kingdoms have considerably suffered flood disasters, and relief aid has already been provided.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "鹽，民之食，而賈咸貴，眾庶重困。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Salt, people's food, yet prices all expensive, multitudes heavily distressed.",
              "idiomatic": "Salt is the people's food, yet all prices are expensive, and the multitudes are heavily distressed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "其減天下鹽賈。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Reduce empire salt prices.'",
              "idiomatic": "Reduce salt prices throughout the empire.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0162",
          "zh": "又曰：「令甲，死者不可生，刑者不可息。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further said: 'Statute first, dead ones cannot be revived, punished ones cannot be stopped.",
              "idiomatic": "The edict continued: 'According to the primary statutes, the dead cannot be revived, and those under punishment cannot be released.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "此先帝之所重，而吏未稱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This former emperor valued, yet officials not matched.",
              "idiomatic": "This was valued by the former emperor, yet the officials have not lived up to it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "今繫者或以掠辜若飢寒瘐死獄中，何用心逆人道也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now imprisoned ones some because beaten falsely guilty or hunger cold illness die in prison, what use heart contrary to human way!",
              "idiomatic": "Now some of those imprisoned die in prison either from being beaten into false confessions or from hunger, cold, and illness—what kind of heart is this that goes against human morality!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "朕甚痛之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I greatly pained by this.",
              "idiomatic": "I am greatly pained by this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "其令郡國歲上繫囚以掠笞若瘐死者所坐名、縣、爵、里，丞相御史課殿最以聞。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order commanderies kingdoms yearly submit imprisoned prisoners by beaten whipped or illness died ones' convicted names, counties, ranks, villages, Chancellor Chamberlain for Law Enforcement evaluate merits demerits to report.'",
              "idiomatic": "Order the commanderies and kingdoms to yearly submit reports on imprisoned prisoners who died from beatings and whippings or from illness, including their convicted names, counties, ranks, and villages. The Chancellor and Chamberlain for Law Enforcement should evaluate merits and demerits and report.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "十二月，清河王年有罪，廢遷房陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth month, Qinghe King Nian had crime, deposed banished Fangling.",
              "idiomatic": "In the twelfth month, King Nian of Qinghe was found guilty of a crime, deposed, and banished to Fangling.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0168",
          "zh": "元康元年春，以杜東原上為初陵，更名杜縣為杜陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yuankang first year spring, used Du east plain above as Chuling, changed name Du county to Duling.",
              "idiomatic": "In spring of the first year of the Yuankang era, the land above the eastern plain of Du was made into Chuling, and Du county was renamed Duling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "徙丞相、將軍、列侯、吏二千石、訾百萬者杜陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Relocated Chancellor, generals, marquises, officials 2000 piculs, property worth million ones to Duling.",
              "idiomatic": "The Chancellor, generals, marquises, officials of 2000 piculs rank, and those with property worth 1,000,000 cash were relocated to Duling.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0170",
          "zh": "三月，詔曰：「乃者鳳皇集泰山、陳留，甘露降未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, edict said: 'Recently phoenix gathered Mount Tai, Chenliu, sweet dew descended Weiyang Palace.",
              "idiomatic": "In the third month, an edict declared: 'Recently a phoenix gathered at Mount Tai and Chenliu, and sweet dew descended on Weiyang Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "朕未能章先帝休烈，協寧百姓，承天順地，調序 四時，獲蒙嘉瑞，賜茲祉福，夙夜兢兢，靡有驕色，內省匪解，永惟罔極。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I not yet manifested former emperor blessed achievements, harmonized pacified common people, received heaven followed earth, regulated ordered four seasons, obtained graced auspicious omens, granted this blessings fortune, morning night trembling trembling, no proud color, inner reflection not relaxed, forever think limitless.",
              "idiomatic": "I have not yet manifested the blessed achievements of the former emperor, harmonized and pacified the common people, received heaven and followed earth, regulated and ordered the four seasons. I have obtained graced auspicious omens and been granted this blessings and fortune. Morning and night I tremble with care, having no proud bearing, my inner reflection never relaxed, forever thinking of the limitless.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "書不云乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Documents not say?",
              "idiomatic": "Do the Documents not say?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "『鳳皇來儀，庶不允諧。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'Phoenix comes with ceremony, common people not truly harmonious.'",
              "idiomatic": "'When the phoenix comes with ceremony, the common people will not be truly harmonious.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "其赦天下徒，賜勤事吏中二千石以下至六百石爵， 自中郎吏至五大夫，佐史以上二級，民一級，女子百戶牛酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pardon empire convicts, grant diligent service officials 2000 piculs and below to 600 piculs noble ranks, from Court Attendant officials to Grandee of the Fifth Rank, Assistant Scribes above two levels, people one level, women 100 households cattle wine.",
              "idiomatic": "Pardon convicts throughout the empire. Grant noble ranks to diligent officials from 2000 piculs rank down to 600 piculs, ranging from Court Attendant officials to Grandee of the Fifth Rank. Assistant scribes and above receive two levels, the people receive one level, and women who head 100 households receive cattle and wine.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "加賜鰥寡孤獨、三老、孝弟力田帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Additionally grant widowers widows orphans solitary, Three Elders, filial fraternal diligent farmers silk.",
              "idiomatic": "Additionally grant silk to widowers, widows, orphans, the solitary, the Three Elders, and filial, fraternal, diligent farmers.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "所振貸勿收。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Relief aid given do not collect.'",
              "idiomatic": "The relief aid that has been given should not be collected.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0177",
          "zh": "夏五月，立皇考廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, established Imperial Father temple.",
              "idiomatic": "In the fifth month of summer, a temple was established for the Imperial Father.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "益奉明園戶為奉明縣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Increased Fengming park households to Fengming county.",
              "idiomatic": "The households of Fengming Park were increased to form Fengming county.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0179",
          "zh": "復高皇帝功臣絳侯周勃等百三十六人家子孫，令奉祭祀，世世勿絕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Restored High Emperor meritorious officials Jiang Marquis Zhou Bo and others 136 families' sons grandsons, ordered conduct sacrifices, generation generation not cut off.",
              "idiomatic": "Restored the sons and grandsons of 136 families of meritorious officials of the High Emperor, including Jiang Marquis Zhou Bo and others. They were ordered to conduct sacrifices, never to be cut off generation after generation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "其毋嗣者，復其次。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Those without heirs, restore their successors.",
              "idiomatic": "For those without heirs, restore their successors.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0181",
          "zh": "秋八月，詔曰：「朕不明六藝，鬱于大道，是以陰陽風雨未時。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn eighth month, edict said: 'I not clear on six arts, blocked on great way, therefore yin yang wind rain not timely.",
              "idiomatic": "In the eighth month of autumn, an edict declared: 'I am not clear on the six arts, blocked on the great way, which is why yin and yang, wind and rain are not timely.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "其博舉吏民，厥身修正，通文學，明於先王之術，宣究其意者，各二人，中二千石各一人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Broadly recommend officials common people, their persons upright correct, proficient literature, clear on former kings' methods, proclaim investigate their intentions ones, each two persons, 2000 piculs each one person.'",
              "idiomatic": "Broadly recommend officials and common people whose persons are upright and correct, proficient in literature, clear on the former kings' methods, and who proclaim and investigate their intentions—each two persons, and one each for those of 2000 piculs rank.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0183",
          "zh": "冬，置建章衛尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter, established Jianzhang Commandant of the Guards.",
              "idiomatic": "In winter, a Commandant of the Guards was established for Jianzhang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0184",
          "zh": "二年春正月，詔曰：「《書》云『文王作罰，刑茲無赦』，今吏修身奉法，未有能稱朕意，朕甚愍焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring first month, edict said: 'Documents say King Wen made punishments, executed these without pardon, now officials cultivate persons uphold law, not yet have able match my intentions, I greatly pity this.",
              "idiomatic": "In the first month of spring in the second year, an edict declared: 'The Documents say King Wen made punishments, executed these without pardon. Now officials cultivate their persons and uphold the law, but none have yet been able to match my intentions. I greatly pity this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "其赦天下，與士大夫厲精更始。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pardon the empire, with gentlemen officials exert essence renew beginnings.'",
              "idiomatic": "Pardon the empire, and together with the gentlemen officials exert our essence to make a fresh start.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0186",
          "zh": "二月乙丑，立皇后王氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month Yichou, established Empress Wang clan.",
              "idiomatic": "On the Yichou day of the second month, Lady Wang was established as Empress.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "賜丞相以下至郎從官錢帛各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted Chancellor below to court attendant officials money silk each according to degree.",
              "idiomatic": "Grants of money and silk were given to the Chancellor and below, down to the court attendant officials, each according to their rank.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0188",
          "zh": "三月，以鳳皇甘露降集，賜天下吏爵二級，民一級，女子百戶牛酒，鰥寡孤獨高年帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, because phoenix sweet dew descended gathered, granted empire officials noble ranks two levels, people one level, women 100 households cattle wine, widowers widows orphans solitary aged silk.",
              "idiomatic": "In the third month, because phoenixes and sweet dew descended and gathered, officials throughout the empire were granted two noble ranks, the people one level, women who headed 100 households received cattle and wine, and widowers, widows, orphans, the solitary, and the aged received silk.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0189",
          "zh": "夏五月，詔曰：「獄者萬民之命，所以禁暴止邪，養育群生也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, edict said: 'Prisons are myriad people's fate, for prohibiting violence stopping evil, nurturing raising all living things.",
              "idiomatic": "In the fifth month of summer, an edict declared: 'Prisons determine the fate of the myriad people, serving to prohibit violence and stop evil, nurturing and raising all living things.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "能使生者不怨，死者不恨，則可謂文吏 矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Able make living not resent, dead not hate, then can be called cultured officials.",
              "idiomatic": "If one can make the living not resent and the dead not hate, then they can be called cultured officials.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "今則不然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now then not so.",
              "idiomatic": "Now it is not so.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "用法或持巧心，析律貳端，深淺不平，增辭飾非，以成其罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Using law sometimes hold clever mind, analyze statutes dual ends, deep shallow not even, increase words decorate wrongs, to complete their crimes.",
              "idiomatic": "In applying the law, some hold clever minds, analyzing statutes with dual interpretations, making deep and shallow cases uneven, increasing words to decorate wrongs, in order to complete their crimes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "奏不如實，上亦亡繇知。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Memorialize not according to reality, His Majesty also has no way know.",
              "idiomatic": "Memorials do not accord with reality, and His Majesty also has no way to know.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "此朕之不明，吏之不稱，四方黎民將何仰哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This my not clear, officials not match, four directions black-haired people will what rely ah!",
              "idiomatic": "This is my lack of clarity, the officials' failure to match expectations—how will the black-haired people of the four directions find anything to rely on!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "二千石各察官 屬，勿用此人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "2000 piculs each examine official subordinates, do not employ these people.",
              "idiomatic": "Officials of 2000 piculs should each examine their subordinates and not employ such people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "吏務平法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Officials strive for evenhanded law.",
              "idiomatic": "Officials should strive for evenhanded application of the law.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "或擅興繇役，飾廚傳，稱過使客，越職踰法，以取名譽，譬猶踐薄冰以待白日，豈不殆哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some arbitrarily raise corvée labor, decorate kitchens relay stations, exaggerate entertain envoys guests, exceed duties overstep law, to obtain reputation, analogous to treading thin ice awaiting daylight, how not dangerous ah!",
              "idiomatic": "Some arbitrarily raise corvée labor, decorate kitchens and relay stations, exaggerate in entertaining envoys and guests, exceed their duties and overstep the law, all to obtain reputation. It is analogous to treading thin ice while awaiting daylight—how could it not be dangerous!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "今天下頗被疾疫之災，朕甚愍之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Today empire considerably suffered disease epidemic disaster, I greatly pity this.",
              "idiomatic": "Today the empire has considerably suffered from the disaster of disease and epidemics. I greatly pity this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "其令郡國被 災甚者，毋出今年租賦。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order commanderies kingdoms suffered disaster severely ones, do not pay this year rents taxes.'",
              "idiomatic": "Order that commanderies and kingdoms severely afflicted by disaster should not pay this year's rents and taxes.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0200",
          "zh": "又曰：「聞古天子之名，難知而易諱也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further said: 'Heard ancient Son of Heaven names, difficult know yet easy avoid.",
              "idiomatic": "The edict continued: 'I have heard that the names of ancient Sons of Heaven are difficult to know but easy to avoid.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "今百姓多上書觸諱以犯罪者，朕甚憐之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now common people many submit memorials touch taboos to commit crimes ones, I greatly pity them.",
              "idiomatic": "Now many common people submit memorials that touch on taboos and thereby commit crimes. I greatly pity them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "其更諱詢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Change taboos consult.",
              "idiomatic": "Change the taboos after consultation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "諸觸諱在令前者，赦之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All touch taboos before edict ones, pardon them.'",
              "idiomatic": "All who touched on taboos before this edict should be pardoned.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0204",
          "zh": "冬，京兆尹趙廣漢有罪，要斬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter, Jingzhao Governor Zhao Guanghan had crime, condemned behead.",
              "idiomatic": "In winter, Jingzhao Governor Zhao Guanghan was found guilty of a crime and condemned to beheading.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0205",
          "zh": "三年春，以神爵數集泰山，賜諸侯王、丞相、將軍、列侯、二千石金，郎從官帛，各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring, because divine pheasants frequently gathered Mount Tai, granted feudal kings, chancellor, generals, marquises, 2000 piculs gold, court attendant officials silk, each according to degree.",
              "idiomatic": "In spring of the third year, because divine pheasants frequently gathered at Mount Tai, feudal kings, the chancellor, generals, marquises, and officials of 2000 piculs were granted gold, while court attendant officials were granted silk, each according to their rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "賜天下吏爵二級，民一級，女子百戶牛酒，鰥寡孤獨高年帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted empire officials noble ranks two levels, people one level, women 100 households cattle wine, widowers widows orphans solitary aged silk.",
              "idiomatic": "Officials throughout the empire were granted two noble ranks, the people one level, women who headed 100 households received cattle and wine, and widowers, widows, orphans, the solitary, and the aged received silk.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0207",
          "zh": "三月，詔曰：「蓋聞象有罪，舜封之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, edict said: 'Indeed heard Xiang had crime, Shun enfeoffed him.",
              "idiomatic": "In the third month, an edict declared: 'Indeed I have heard that when Xiang had committed crimes, Shun still enfeoffed him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "骨肉之親粲而不殊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bone flesh relatives bright not different.",
              "idiomatic": "Blood relatives shine brightly and are not to be distinguished from one another.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "其封故昌邑王賀為海昏侯。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoff former Changyi King He as Haihun Marquis.'",
              "idiomatic": "Enfeoff the former King He of Changyi as Marquis of Haihun.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0210",
          "zh": "又曰：「朕微眇時，御史大夫丙吉、中郎將史曾、史玄、長樂衛尉許舜、侍中光祿大夫許延壽皆與朕有舊 恩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further said: 'I slight insignificant time, Chamberlain for Law Enforcement Bing Ji, Court Attendant Shi Zeng, Shi Xuan, Changle Commandant Xu Shun, Palace Attendant Chamberlain for Attendants Xu Yanshou all with I had old kindness.",
              "idiomatic": "The edict continued: 'During my time of slight insignificance, Chamberlain for Law Enforcement Bing Ji, Court Attendants Shi Zeng and Shi Xuan, Changle Commandant Xu Shun, and Palace Attendant Chamberlain for Attendants Xu Yanshou all showed me old kindness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "及故掖庭令張賀輔導朕躬，修文學經術，恩惠卓異，厥功茂焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "And former rear court superintendent Zhang He guided instructed my person, cultivated literature classics methods, kindness favor outstanding different, his merit luxuriant there.",
              "idiomatic": "And the former rear court superintendent Zhang He guided and instructed my person, cultivating literature and classical methods. His kindness and favor were outstandingly different; his merit was luxuriantly great.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "詩不云乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Poetry not say?",
              "idiomatic": "Does the Poetry not say?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "『無德不報。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'No virtue not repay.'",
              "idiomatic": "'No virtue goes unrepaid.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "封賀所子弟子侍中中郎將彭祖為陽都侯，追賜賀諡曰陽都哀侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Enfeoff He disciple son Palace Attendant Court Attendant Peng Zu as Yangdu Marquis, posthumously granted He posthumous name Yangdu Sorrowful Marquis.",
              "idiomatic": "Zhang He's disciple and adopted son, Palace Attendant and Court Attendant Peng Zu, was enfeoffed as Marquis of Yangdu, and He was posthumously granted the title of Sorrowful Marquis of Yangdu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "吉、 曾、玄、舜、延壽皆為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji, Zeng, Xuan, Shun, Yanshou all became marquises.",
              "idiomatic": "Bing Ji, Shi Zeng, Shi Xuan, Xu Shun, and Xu Yanshou all became marquises.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "故人下至郡邸獄復作嘗有阿保之功，皆受官祿田宅財物，各以恩深淺報之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Old acquaintances down to commandery residence prison convict workers once had fostering protecting merit, all received official salaries fields residences wealth goods, each according to kindness depth shallowness repay them.'",
              "idiomatic": "Old acquaintances down to the convict workers in the commandery residence prison who once had merit in fostering and protecting me all received official salaries, fields, residences, and wealth. Each was repaid according to the depth of their kindness.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0217",
          "zh": "夏六月，詔曰：「前年夏，神爵集雍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer sixth month, edict said: 'Previous year summer, divine pheasants gathered Yong.",
              "idiomatic": "In the sixth month of summer, an edict declared: 'In the summer of the previous year, divine pheasants gathered in Yong.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "今春，五色鳥以萬數飛過屬縣，翱翔而舞，欲集未下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This spring, five-color birds in ten thousand numbers flew over subordinate counties, soared danced, wished gather not descended.",
              "idiomatic": "This spring, five-colored birds numbering in the tens of thousands flew over the subordinate counties, soaring and dancing, wishing to gather but not descending.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "其令三輔毋得以春夏擿巢探卵，彈射飛鳥。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order Three Adjuncts not able in spring summer pluck nests probe eggs, pellet shoot flying birds.",
              "idiomatic": "Order the Three Adjuncts not to pluck nests and probe for eggs in spring and summer, nor to shoot flying birds with pellets.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "具為令。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fully make ordinance.'",
              "idiomatic": "Make this a complete ordinance.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0221",
          "zh": "立皇子欽為淮陽王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established imperial son Qin as Huaiyang King.",
              "idiomatic": "Imperial son Qin was established as King of Huaiyang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0222",
          "zh": "遣大中大夫彊等十二人循行天下，存問鰥寡，覽觀風俗，察吏治得失，舉茂材異倫之士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sent Grand Palace Grandee Qiang and others twelve people tour inspect empire, inquire visit widowers widows, view observe customs, examine official administration gains losses, recommend excellent talents extraordinary rank scholars.",
              "idiomatic": "Twelve men including Grand Palace Grandee Qiang were sent to tour and inspect the empire, inquiring after widowers and widows, viewing local customs, examining the successes and failures of official administration, and recommending excellent talents of extraordinary rank.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0223",
          "zh": "二月，河東霍徵史等謀反，誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month, Hedong Huo Zhengshi and others plotted rebellion, executed.",
              "idiomatic": "In the second month, Huo Zhengshi of Hedong and others plotted rebellion and were executed.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0224",
          "zh": "三月，詔曰：「乃者，神爵五采以萬數集長樂、未央、北宮、高寢、甘泉泰畤殿中及上林苑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, edict said: 'Recently, divine pheasants five colors in ten thousand numbers gathered Changle, Weiyang, North Palace, High Chamber, Ganquan Supreme Altar halls and Shanglin Park.",
              "idiomatic": "In the third month, an edict declared: 'Recently, five-colored divine pheasants numbering in the tens of thousands gathered in the halls of Changle Palace, Weiyang Palace, the North Palace, the High Chamber, the Supreme Altar at Ganquan, and Shanglin Park.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "朕之不逮，寡于德厚，屢獲嘉祥，非朕之任。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "My not reach, few in virtue thickness, repeatedly obtained auspicious omens, not my bearing.",
              "idiomatic": "I have not reached the standard, being meager in virtuous thickness, yet I have repeatedly obtained auspicious omens. This is not due to my bearing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "其賜天下吏爵二級，民一級，女子百戶牛酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grant empire officials noble ranks two levels, people one level, women 100 households cattle wine.",
              "idiomatic": "Grant officials throughout the empire two noble ranks, the people one level, and women who head 100 households cattle and wine.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "加賜三老、孝弟力田帛，人二匹，鰥寡孤獨各一匹。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Additionally grant Three Elders, filial fraternal diligent farmers silk, person two bolts, widowers widows orphans solitary each one bolt.'",
              "idiomatic": "Additionally grant silk to the Three Elders and filial, fraternal, diligent farmers—two bolts per person—and one bolt each to widowers, widows, orphans, and the solitary.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0228",
          "zh": "秋八月，賜故右扶風尹翁歸子黃金百斤，以奉其祭祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn eighth month, granted former Right Assistant Protector Yin Wengui son gold hundred catties, to conduct his sacrifices.",
              "idiomatic": "In the eighth month of autumn, the son of the former Right Assistant Protector Yin Wengui was granted 100 catties of gold to conduct his father's sacrifices.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "又賜功臣適後黃金，人二十斤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further granted meritorious officials proper heirs gold, person twenty catties.",
              "idiomatic": "The proper heirs of meritorious officials were further granted gold, 20 catties per person.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0230",
          "zh": "比年豐，穀石五錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Recent years abundant, grain stone five cash.",
              "idiomatic": "In recent years there has been abundance, with grain at five cash per stone.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0231",
          "zh": "神爵元年春正月，行幸甘泉，郊泰畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shenjue first year spring first month, proceeded favored Ganquan, suburban Supreme Altar.",
              "idiomatic": "In the first month of spring in the first year of Shenjue, His Majesty proceeded to Ganquan and performed the suburban sacrifice at the Supreme Altar.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "三月，行幸河東，祠后土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, proceeded favored Hedong, sacrificed to Houtu.",
              "idiomatic": "In the third month, His Majesty proceeded to Hedong and sacrificed to Houtu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "詔曰：「朕承宗廟，戰戰栗栗，惟萬事 統，未燭厥理。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'I bear ancestral temples, trembling trembling, only myriad affairs govern, not illuminated their principles.",
              "idiomatic": "An edict declared: 'I bear the ancestral temples with trembling caution, governing only the myriad affairs without illuminating their principles.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "乃元康四年嘉穀玄稷降于郡國，神爵仍集，金芝九莖產于函德殿銅池中，九真獻奇獸，南郡獲白虎威鳳為寶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then Yuankang fourth year fine grain black millet descended on commanderies kingdoms, divine pheasants repeatedly gathered, golden mushroom nine stems produced in Hande Hall bronze pool, Jiuzhen offered strange beast, Nanhun obtained white tiger majestic phoenix as treasure.",
              "idiomatic": "Then in the fourth year of Yuankang, fine grain and black millet descended on the commanderies and kingdoms, divine pheasants gathered repeatedly, nine stems of golden mushrooms grew in the bronze pool of Hande Hall, Jiuzhen offered a strange beast, and Nanhun obtained a white tiger and majestic phoenix as treasures.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "朕之不明，震于珍物，飭躬齋精，祈為 百姓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "My not clear, shaken by precious objects, rectified person purified essence, prayed for common people.",
              "idiomatic": "Being unenlightened, I am shaken by these precious objects. I have rectified my person and purified my essence, praying for the common people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "東濟大河，天氣清靜，神魚舞河。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "East crossed great river, weather clear tranquil, divine fish danced river.",
              "idiomatic": "Crossing the great river to the east, the weather was clear and tranquil, and divine fish danced in the river.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "幸萬歲宮，神爵翔集。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Favored Wansui Palace, divine pheasants soared gathered.",
              "idiomatic": "His Majesty favored Wansui Palace, where divine pheasants soared and gathered.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "朕之不德，懼不能任。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "My lacking virtue, fear cannot bear.",
              "idiomatic": "Lacking virtue as I do, I fear I cannot bear this responsibility.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "其以五年為神爵元年。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Take fifth year as Shenjue first year.",
              "idiomatic": "Let the fifth year be designated as the first year of Shenjue.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "賜天下勤事吏爵二級，民一級，女子百戶牛酒，鰥寡孤 獨高年帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted empire diligent service officials noble ranks two levels, people one level, women 100 households cattle wine, widowers widows orphans solitary aged silk.",
              "idiomatic": "Officials throughout the empire who served diligently were granted two noble ranks, the people one level, women who headed 100 households received cattle and wine, and widowers, widows, orphans, the solitary, and the aged received silk.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "所振貸物勿收。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Relief aid goods do not collect.",
              "idiomatic": "The goods provided as relief aid should not be collected.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "行所過毋出田租。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Procession passed places do not pay field rents.'",
              "idiomatic": "In places where the imperial procession passed, field rents should not be paid.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "西羌反，發三輔、中都官徒弛刑，及應募佽飛射士、羽林孤兒，胡、越騎，三河、潁川、沛郡、淮陽、汝南材官，金城、隴西、天水、安定、北地、上郡騎士、羌騎，詣金城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Western Qiang rebelled, mobilized Three Adjuncts, capital official convicts released punishment, and recruited crossbow flying shooting soldiers, Feather Forest orphans, Hu, Yue cavalry, Three Rivers, Yingchuan, Pei commandery, Huaiyang, Runan weapons officials, Jincheng, Longxi, Tianshui, Anding, Beidi, Shang commandery cavalry, Qiang cavalry, went to Jincheng.",
              "idiomatic": "The Western Qiang rebelled. Troops were mobilized including convicts from the Three Adjuncts and capital offices whose punishments were released, recruited crossbowmen and flying shooters, Feather Forest orphans, Hu and Yue cavalry, weapons officials from the Three Rivers, Yingchuan, Pei commandery, Huaiyang, and Runan, cavalry from Jincheng, Longxi, Tianshui, Anding, Beidi, and Shang commandery, and Qiang cavalry. They proceeded to Jincheng.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "夏四月，遣後將軍趙充國、彊弩將軍許延壽擊西羌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, sent Rear General Zhao Chongguo, Strong Crossbow General Xu Yanshou attack Western Qiang.",
              "idiomatic": "In the fourth month of summer, Rear General Zhao Chongguo and Strong Crossbow General Xu Yanshou were sent to attack the Western Qiang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0245",
          "zh": "六月，有星孛于東方。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixth month, had comet in eastern direction.",
              "idiomatic": "In the sixth month, a comet appeared in the eastern sky.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0246",
          "zh": "即拜酒泉太守辛武賢為破羌將軍，與兩將軍並進。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Immediately appointed Jiuquan Governor Xin Wuxian as Qiang-breaking General, with two generals advanced together.",
              "idiomatic": "Xin Wuxian, Governor of Jiuquan, was immediately appointed Qiang-breaking General and advanced together with the two generals.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "詔曰：「軍旅暴露，轉輸煩勞，其令諸侯王、列侯、蠻夷王侯君長當朝二年者，皆毋朝。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Armies exposed, transport transfer troublesome labor, order feudal kings, marquises, barbarian yi kings marquises chiefs should attend court two years ones, all do not attend.'",
              "idiomatic": "An edict declared: 'The armies are exposed to the elements and transport is troublesome and laborious. Feudal kings, marquises, and barbarian chiefs who should attend court for two years are all excused from attending.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0248",
          "zh": "秋，賜故大司農朱邑子黃金百斤，以奉祭祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, granted former Grand Minister of Agriculture Zhu Yi son gold hundred catties, to conduct sacrifices.",
              "idiomatic": "In autumn, the son of the former Grand Minister of Agriculture Zhu Yi was granted 100 catties of gold to conduct his father's sacrifices.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "後將軍充國言屯田之計，語在充國傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rear General Chongguo spoke of garrison farming plan, account in Chongguo biography.",
              "idiomatic": "Rear General Zhao Chongguo spoke of the plan for garrison farming. The account appears in his biography.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "二年春二月，詔曰：「乃者正月乙丑，鳳皇甘露降集京師，群鳥從以萬數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring second month, edict said: 'Recently first month Yichou, phoenix sweet dew descended gathered capital, flock birds followed in ten thousand numbers.",
              "idiomatic": "In the second month of spring in the second year, an edict declared: 'Recently, on the Yichou day of the first month, phoenixes and sweet dew descended and gathered in the capital, with flocks of birds following in numbers of ten thousand.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "朕之不德，屢獲天福，祗事不怠，其赦天下。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "My lacking virtue, repeatedly obtained heavenly blessings, respectfully served not weary, pardon the empire.'",
              "idiomatic": "Though I lack virtue, I have repeatedly received heavenly blessings. I have served respectfully without growing weary. Pardon the empire.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0252",
          "zh": "夏五月，羌虜降服，斬其首惡大豪楊玉、酋非首。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fifth month, Qiang bandits submitted surrendered, beheaded their chief evil great powerful Yang Yu, Qiu Feishou.",
              "idiomatic": "In the fifth month of summer, the Qiang bandits submitted and surrendered. Their chief evil-doers, the great powerful Yang Yu and Qiu Feishou, were beheaded.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "置金城屬國以處降羌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established Jincheng dependent state to place surrendered Qiang.",
              "idiomatic": "A dependent state was established at Jincheng to settle the surrendered Qiang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0254",
          "zh": "秋，匈奴日逐王先賢撣將人眾萬餘來降。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, Xiongnu Rizhu King Xianxianchan led people multitudes ten thousand more came to surrender.",
              "idiomatic": "In autumn, Xianxianchan, King of the Rizhu tribe of the Xiongnu, led more than 10,000 people to surrender.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "使都護西域騎都尉鄭吉迎日逐，破車師，皆封列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sent Protector General Western Regions Cavalry Commandant Zheng Ji welcome Rizhu, broke Cheshi, all enfeoffed marquises.",
              "idiomatic": "Protector General of the Western Regions and Cavalry Commandant Zheng Ji was sent to welcome the Rizhu and defeat the Cheshi. All were enfeoffed as marquises.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0256",
          "zh": "九月，司隸校尉蓋寬饒有罪，下有司，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth month, Superintendent of the Capital Commandant Gai Kuanrao had crime, sent to officials, committed suicide.",
              "idiomatic": "In the ninth month, Superintendent of the Capital Commandant Gai Kuanrao was found guilty of a crime. He was handed over to the officials and committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "匈奴單于遣名王奉獻，賀正月，始和親。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Chanyu sent famous king presented tribute, congratulated first month, began peaceful relations.",
              "idiomatic": "The Chanyu of the Xiongnu sent a famous king to present tribute and congratulate the new year. Peaceful relations began.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0258",
          "zh": "三年春，起樂游苑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring, built Leyou Park.",
              "idiomatic": "In spring of the third year, the Leyou Park was built.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0259",
          "zh": "三月丙午，丞相相薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month Bingwu, Chancellor Xiang passed away.",
              "idiomatic": "On the Bingwu day of the third month, Chancellor Xiang passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0260",
          "zh": "秋八月，詔曰：「吏不廉平則治道衰。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn eighth month, edict said: 'Officials not upright impartial then governing way declines.",
              "idiomatic": "In the eighth month of autumn, an edict declared: 'If officials are not upright and impartial, then the way of governance declines.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "今小吏皆勤事，而奉祿薄，欲其毋侵漁百姓，難矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now minor officials all diligent in affairs, yet salaries meager, wish they not plunder fish common people, difficult ah.",
              "idiomatic": "Now minor officials are all diligent in their affairs, yet their salaries are meager. To wish that they not plunder and exploit the common people is difficult indeed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "其益吏百石以下奉十五。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Increase officials 100 piculs below salaries fifteen.'",
              "idiomatic": "Increase the salaries of officials ranked at 100 piculs and below by fifteen.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0263",
          "zh": "四年春二月，詔曰：「乃者鳳皇甘露降集京師，嘉瑞並見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year spring second month, edict said: 'Recently phoenixes sweet dew descended gathered capital, auspicious omens appeared together.",
              "idiomatic": "In the second month of spring in the fourth year, an edict declared: 'Recently phoenixes and sweet dew descended and gathered in the capital, and auspicious omens appeared together.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "修興泰一、五帝、后土之祠，祈為百姓蒙祉 福。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Repaired raised Taiyi, Five Emperors, Houtu temples, prayed for common people receive blessings fortune.",
              "idiomatic": "The temples of Taiyi, the Five Emperors, and Houtu were repaired and raised. Prayers were offered that the common people might receive blessings and fortune.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "鸞鳳萬舉，蜚覽翱翔，集止于旁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Luan phoenixes ten thousand arose, flew viewed soared circled, gathered stopped at side.",
              "idiomatic": "Luan birds and phoenixes arose by the tens of thousands, flew and viewed, soared and circled, gathered and stopped nearby.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "齋戒之暮，神光顯著。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Purification fasting evening, divine light manifested prominently.",
              "idiomatic": "In the evening of purification and fasting, divine light manifested prominently.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "薦鬯之夕，神光交錯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Offering fragrant wine evening, divine lights intercrossed.",
              "idiomatic": "In the evening of offering fragrant wine, divine lights intercrossed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "或降于天，或登于地，或從四方來集于壇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some descended from heaven, some ascended to earth, some from four directions came gathered at altar.",
              "idiomatic": "Some descended from heaven, some ascended to earth, some came from the four directions and gathered at the altar.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "上帝嘉嚮，海內承福。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Supreme Deity favored directed, within seas received fortune.",
              "idiomatic": "The Supreme Deity showed favor and guidance, and those within the seas received fortune.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "其赦天下，賜 民爵一級，女子百戶牛酒，鰥寡孤獨高年帛。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pardon the empire, grant people noble ranks one level, women 100 households cattle wine, widowers widows orphans solitary aged silk.'",
              "idiomatic": "Pardon the empire. Grant the people one noble rank, women who head 100 households cattle and wine, and widowers, widows, orphans, the solitary, and the aged silk.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0271",
          "zh": "夏四月，潁川太守黃霸以治行尤異秩中二千石，賜爵關內侯，黃金百斤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, Yingchuan Governor Huang Ba because governing conduct especially exceptional ranked 2000 piculs, granted title Guannei Marquis, gold hundred catties.",
              "idiomatic": "In the fourth month of summer, Yingchuan Governor Huang Ba, because his governing conduct was especially exceptional, was ranked at 2000 piculs, granted the title of Guannei Marquis, and given 100 catties of gold.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "及潁川吏民有行義者爵，人二級，力田一級，貞婦順女帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "And Yingchuan officials common people have righteous conduct ones noble ranks, person two levels, diligent farming one level, chaste women obedient daughters silk.",
              "idiomatic": "And for officials and common people of Yingchuan who had righteous conduct, noble ranks were granted—two levels per person—and one level for diligent farmers, with silk for chaste women and obedient daughters.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0273",
          "zh": "令內郡國舉賢良可親民者各一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order inner commanderies kingdoms recommend worthy good can approach people ones each one person.",
              "idiomatic": "Order the inner commanderies and kingdoms to recommend one person each who is worthy and good and who can approach and care for the people.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0274",
          "zh": "五月，匈奴單于遣弟呼留若王勝之來朝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifth month, Xiongnu Chanyu sent younger brother Huliuruo King Shengzhi came to court.",
              "idiomatic": "In the fifth month, the Chanyu of the Xiongnu sent his younger brother Shengzhi, King of Huliuruo, to come to court.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0275",
          "zh": "冬十月，鳳皇十一集杜陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter tenth month, phoenixes eleven times gathered Duling.",
              "idiomatic": "In the tenth month of winter, phoenixes gathered eleven times at Duling.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0276",
          "zh": "十一月，河南太守嚴延年有罪，棄巿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eleventh month, Henan Governor Yan Yannian had crime, executed in marketplace.",
              "idiomatic": "In the eleventh month, Henan Governor Yan Yannian was found guilty of a crime and executed in the marketplace.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0277",
          "zh": "十二月，鳳皇集上林。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth month, phoenixes gathered Shanglin.",
              "idiomatic": "In the twelfth month, phoenixes gathered at Shanglin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0278",
          "zh": "五鳳元年春正月，行幸甘泉，郊泰畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wufeng first year spring first month, proceeded favored Ganquan, suburban Supreme Altar.",
              "idiomatic": "In the first month of spring in the first year of Wufeng, His Majesty proceeded to Ganquan and performed the suburban sacrifice at the Supreme Altar.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0279",
          "zh": "皇太子冠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Crown Prince capped.",
              "idiomatic": "The Crown Prince was capped.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "皇太后賜丞相、將軍、列侯、中二千石帛，人百匹，大夫人八十匹。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Empress Dowager granted Chancellor, generals, marquises, 2000 piculs silk, person hundred bolts, grand ladies eighty bolts.",
              "idiomatic": "The Empress Dowager granted silk to the Chancellor, generals, marquises, and officials of 2000 piculs—100 bolts per person, and 80 bolts for grand ladies.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "又賜列侯嗣子爵五大夫，男子為父後者爵一級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Further granted marquises' successor sons noble rank Grandee of the Fifth Rank, males who succeed fathers noble rank one level.",
              "idiomatic": "Further granted the successor sons of marquises the noble rank of Grandee of the Fifth Rank, and males who succeed their fathers one noble rank.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0282",
          "zh": "夏，赦徒作杜陵者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer, pardoned convicts working Duling ones.",
              "idiomatic": "In summer, convicts working at Duling were pardoned.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0283",
          "zh": "冬十二月乙酉朔，日有蝕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter twelfth month Yiyou new moon, there was an eclipse of the sun.",
              "idiomatic": "On the new moon of the twelfth month of winter, which fell on a Yiyou day, there was a solar eclipse.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0284",
          "zh": "左馮翊韓延壽有罪，棄巿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Left Assistant Protector Han Yanshou had crime, executed in marketplace.",
              "idiomatic": "Left Assistant Protector Han Yanshou was found guilty of a crime and executed in the marketplace.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0285",
          "zh": "二年春三月，行幸雍，祠五畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring third month, proceeded favored Yong, sacrificed Five Altars.",
              "idiomatic": "In the third month of spring in the second year, His Majesty proceeded to Yong and sacrificed at the Five Altars.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0286",
          "zh": "夏四月己丑，大司馬車騎將軍增薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month Jichou, Grand Commander Cavalry General Zeng passed away.",
              "idiomatic": "On the Jichou day of the fourth month of summer, Grand Commander and Cavalry General Zeng passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0287",
          "zh": "秋八月，詔曰：「夫婚姻之禮，人倫之大者也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn eighth month, edict said: 'Indeed marriage ritual, human relationships' great ones;",
              "idiomatic": "In the eighth month of autumn, an edict declared: 'Indeed, the ritual of marriage is one of the greatest among human relationships.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "酒食之會，所以行禮樂也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wine food gatherings, for practicing ritual music.",
              "idiomatic": "Gatherings with wine and food serve to practice ritual and music.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "今郡國二千石或擅為苛禁，禁民嫁娶不得具酒食相賀召。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now commanderies kingdoms 2000 piculs some arbitrarily make harsh prohibitions, prohibit people marriage betrothal cannot prepare wine food mutually congratulate summon.",
              "idiomatic": "Now some officials of 2000 piculs in the commanderies and kingdoms arbitrarily make harsh prohibitions, forbidding people to marry and betroth without preparing wine and food for mutual congratulations and summons.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "由是廢鄉黨之禮，令民亡所樂，非所以導民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Because of this abolish villages hamlets' rituals, cause people have nothing to enjoy, not the way to guide people.",
              "idiomatic": "Because of this, the rituals of villages and hamlets are abolished, causing the people to have nothing to enjoy, which is not the way to guide the people.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "詩不云乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Poetry not say?",
              "idiomatic": "Does the Poetry not say?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "『民之失德，乾餱以愆。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'People's loss of virtue, dried provisions with fault.'",
              "idiomatic": "'When the people lose their virtue, dried provisions result in fault.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "勿行苛政。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Do not carry out harsh government.'",
              "idiomatic": "Do not carry out harsh government.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0294",
          "zh": "冬十一月，匈奴呼鸱累單于帥眾來降，封為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter eleventh month, Xiongnu Huqiulei Chanyu led multitudes came to surrender, enfeoffed as marquis.",
              "idiomatic": "In the eleventh month of winter, Huqiulei, Chanyu of the Xiongnu, led multitudes to surrender and was enfeoffed as a marquis.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "十二月，平通侯陽惲坐前為光祿勳有罪，免為庶人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelfth month, Pingtong Marquis Yang Yun convicted previously as Chamberlain for Attendants had crime, dismissed as commoner.",
              "idiomatic": "In the twelfth month, Pingtong Marquis Yang Yun was convicted for a crime he committed while previously serving as Chamberlain for Attendants, and dismissed to commoner status.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "不悔過，怨望，大逆不道，要斬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Not repent fault, resentful gazing, great rebellion unprincipled, condemned behead.",
              "idiomatic": "He did not repent of his faults, harbored resentful thoughts, committed great rebellion and lacked principle, and was condemned to beheading.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0297",
          "zh": "三年春正月癸卯，丞相吉薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring first month Guimao, Chancellor Ji passed away.",
              "idiomatic": "On the Guimao day of the first month of spring in the third year, Chancellor Ji passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0298",
          "zh": "三月，行幸河東，祠后土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, proceeded favored Hedong, sacrificed Houtu.",
              "idiomatic": "In the third month, His Majesty proceeded to Hedong and sacrificed to Houtu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "詔曰：「往者匈奴數為邊寇，百姓被其害。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Previously Xiongnu frequently became border bandits, common people suffered their harm.",
              "idiomatic": "An edict declared: 'Previously the Xiongnu frequently became border bandits, and the common people suffered their harm.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "朕承至尊，未能綏定匈奴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I bear utmost honor, not yet able pacify settle Xiongnu.",
              "idiomatic": "I bear the utmost honor, but have not yet been able to pacify and settle the Xiongnu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "虛閭權 渠單于請求和親，病死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xulu Quanqu Chanyu requested peaceful relations, died of illness.",
              "idiomatic": "Chanyu Xulu Quanqu requested peaceful relations but died of illness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "右賢王屠耆堂代立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Right Wise King Tu Qitang replaced stood.",
              "idiomatic": "Right Wise King Tu Qitang replaced him on the throne.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "骨肉大臣立虛閭權渠單于子為呼韓邪單于，擊殺屠耆堂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Flesh blood ministers established Xulu Quanqu Chanyu son as Huhanye Chanyu, struck killed Tu Qitang.",
              "idiomatic": "The ministers of the royal clan established the son of Chanyu Xulu Quanqu as Chanyu Huhanye, who then struck down and killed Tu Qitang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "諸王並自立，分為五單于，更相攻擊，死者以萬數，畜產大耗 什八九，人民飢餓，相燔燒以求食，因大乖亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Various kings all self-established, divided into five chanyus, mutually attacked, dead ones in ten thousand numbers, livestock greatly depleted eight nine tenths, people hungry starving, mutually burned to seek food, because of great disorder.",
              "idiomatic": "The various kings all established themselves independently, dividing into five chanyus who attacked each other. The dead numbered in the tens of thousands, livestock was depleted by eight or nine tenths, the people were hungry and starving, and they even burned each other to seek food, resulting in great disorder.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "單于閼氏子孫昆弟及呼鸱累單于、名王、右伊秩訾、且渠、當戶以下將眾五萬餘人來降歸義。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chanyu Yanzhi sons grandsons cousins and Huqiulei Chanyu, famous kings, Right Yizhizi, Juqu, Danghu below led multitudes fifty thousand more people came to surrender return righteousness.",
              "idiomatic": "The sons, grandsons, and cousins of the Chanyu's consort Yanzhi, along with Chanyu Huqiulei, famous kings, Right Yizhizi, Juqu, Danghu and below, led more than 50,000 people to surrender and return to righteousness.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "單于稱臣，使弟奉珍朝 賀正月，北邊晏然，靡有兵革之事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chanyu called himself minister, sent younger brother presented treasures courted congratulated first month, northern border peaceful quiet, none had weapons armor affairs.",
              "idiomatic": "The Chanyu called himself a minister, sent his younger brother to present treasures and court congratulations for the new year. The northern border was peaceful and quiet, with no affairs of weapons and armor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "朕飭躬齊戒，郊上帝，祠后土，神光並見，或興于谷，燭燿齊宮，十有餘刻。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I ordered my person purified fasted, suburban Supreme Deity, sacrificed Houtu, divine lights appeared together, some arose in valley, illuminated brightened Qigong, ten have remaining quarters.",
              "idiomatic": "I ordered myself to be purified and fasted, performed the suburban sacrifice to the Supreme Deity and sacrificed to Houtu. Divine lights appeared together, some arose in the valley, illuminating and brightening Qigong for more than ten quarters.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "甘露降，神爵集。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sweet dew descended, divine pheasants gathered.",
              "idiomatic": "Sweet dew descended, and divine pheasants gathered.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "已詔有司告祠上帝、宗廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Already edicted officials announced sacrificed Supreme Deity, ancestral temples.",
              "idiomatic": "I already edicted the officials to announce sacrifices to the Supreme Deity and the ancestral temples.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "三月 辛丑，鸞鳳又集長樂宮東闕中樹上，飛下止地，文章五色，留十餘刻，吏民並觀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month Xinchou, luan phoenixes again gathered Changlegong east gate middle tree on, flew down stopped ground, patterns five colors, remained ten remaining quarters, officials common people together observed.",
              "idiomatic": "On the Xinchou day of the third month, luan birds and phoenixes again gathered on the tree in the middle of the east gate of Changlegong Palace. They flew down and stopped on the ground, their patterns in five colors, remaining for more than ten quarters while officials and common people observed together.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "朕之不敏，懼不能任，婁蒙嘉瑞，獲茲祉福。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "My lacking intelligence, fear cannot bear, moreover received auspicious omens, obtained this blessings fortune.",
              "idiomatic": "Due to my lacking intelligence, I fear I cannot bear this responsibility. Moreover, I have received auspicious omens and obtained this blessing and fortune.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "書不云乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Book not say?",
              "idiomatic": "Does the Book not say?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "『雖休勿休，祗事不 怠。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'Though rest do not rest, respectfully serve not weary.'",
              "idiomatic": "'Though there is rest, do not rest; respectfully serve without growing weary.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "公卿大夫其勗焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Dukes ministers grandees let exhort there.",
              "idiomatic": "Let the dukes, ministers, and grandees exhort themselves to this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "減天下口錢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Reduce empire poll money.",
              "idiomatic": "Reduce the poll tax throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "赦殊死以下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pardon special death below.",
              "idiomatic": "Pardon those sentenced to special death and below.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "賜民爵一級，女子百戶牛酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grant people noble ranks one level, women 100 households cattle wine.",
              "idiomatic": "Grant the people one noble rank, and women who head 100 households cattle and wine.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "大酺五日。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Great community feast five days.",
              "idiomatic": "Hold a great community feast for five days.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "加賜鰥寡孤獨高年帛。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Additionally grant widowers widows orphans solitary aged silk.'",
              "idiomatic": "Additionally grant silk to widowers, widows, orphans, the solitary, and the aged.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0320",
          "zh": "置西河、北地屬國以處匈奴降者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Established Xihe, Beidi dependent states to place Xiongnu surrendered ones.",
              "idiomatic": "Established dependent states at Xihe and Beidi to settle the Xiongnu who had surrendered.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0321",
          "zh": "四年春正月，廣陵王胥有罪，自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year spring first month, Guangling King Xu had crime, committed suicide.",
              "idiomatic": "In the first month of spring in the fourth year, King Xu of Guangling was found guilty of a crime and committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0322",
          "zh": "匈奴單于稱臣，遣弟谷蠡王入侍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Chanyu called himself minister, sent younger brother Guli King entered served.",
              "idiomatic": "The Chanyu of the Xiongnu called himself a minister and sent his younger brother, King Guli, to enter and serve.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "以邊塞亡寇，減戍卒什二。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Because border fortifications none bandits, reduce garrison troops ten two.",
              "idiomatic": "Because the border fortifications had no bandits, reduce the garrison troops by two tenths.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0324",
          "zh": "大司農中丞耿壽昌奏設常平倉，以給北邊，省轉漕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Minister of Agriculture Assistant Geng Shouchang memorialized established constant level granaries, to supply northern border, save transport canal.",
              "idiomatic": "Assistant Grand Minister of Agriculture Geng Shouchang memorialized to establish constant-level granaries to supply the northern border and save on transport and canal shipping.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "賜爵關內侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted title Guannei Marquis.",
              "idiomatic": "Granted the title of Guannei Marquis.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0326",
          "zh": "夏四月辛丑晦，日有蝕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month Xinchou last day, sun had eclipse of it.",
              "idiomatic": "On the last day of the fourth month of summer, which fell on a Xinchou day, there was a solar eclipse.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "詔曰：「皇天見異，以戒朕躬，是朕之不逮，吏之不稱也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'August Heaven shows anomaly, to warn my person, this is my not reaching, officials' not matching.",
              "idiomatic": "An edict declared: 'The August Heaven shows an anomaly to warn my person. This is because I do not reach expectations, and officials do not match their roles.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "以前使使者問民所疾苦，復遣丞相、御史掾二十四人循行天下，舉冤獄，察擅為苛禁深刻不改者。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Previously sent envoys asked people what pains sufferings, again sent Chancellor, Imperial Secretary clerks twenty four people toured empire, raised unjust prisons, investigated arbitrarily made harsh prohibitions profound deep not reformed ones.'",
              "idiomatic": "Previously I sent envoys to ask the people what their pains and sufferings were. Now I again send twenty-four clerks from the Chancellor and Imperial Secretary to tour the empire, raise up unjust imprisonments, and investigate those who arbitrarily made harsh prohibitions that were profound and deep and did not reform.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0329",
          "zh": "甘露元年春正月，行幸甘泉，郊泰畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ganlu first year spring first month, proceeded favored Ganquan, suburban Supreme Altar.",
              "idiomatic": "In the first month of spring in the first year of Ganlu, His Majesty proceeded to Ganquan and performed the suburban sacrifice at the Supreme Altar.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0330",
          "zh": "匈奴呼韓邪單于遣子右賢王銖婁渠堂入侍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Huhanye Chanyu sent son Right Wise King Zhulou Qutang entered served.",
              "idiomatic": "Chanyu Huhanye of the Xiongnu sent his son, Right Wise King Zhulou Qutang, to enter and serve.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0331",
          "zh": "二月丁巳，大司馬車騎將軍延壽薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month Dingsi, Grand Commander Cavalry General Yanshou passed away.",
              "idiomatic": "On the Dingsi day of the second month, Grand Commander and Cavalry General Yanshou passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0332",
          "zh": "夏四月，黃龍見新豐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, yellow dragon appeared Xinfeng.",
              "idiomatic": "In the fourth month of summer, a yellow dragon appeared at Xinfeng.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0333",
          "zh": "丙申，太上皇廟火。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bingshen, Grand Emperor Ancestor temple fire.",
              "idiomatic": "On Bingshen, the temple of the Grand Emperor Ancestor caught fire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "甲辰，孝文廟火。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jiachen, Filial Wen temple fire.",
              "idiomatic": "On Jiachen, the temple of Emperor Wen caught fire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "上素服五日。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty wore plain clothes five days.",
              "idiomatic": "His Majesty wore plain mourning clothes for five days.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0336",
          "zh": "冬，匈奴單于遣弟左賢王來朝賀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter, Xiongnu Chanyu sent younger brother Left Wise King came to court congratulate.",
              "idiomatic": "In winter, the Chanyu of the Xiongnu sent his younger brother, the Left Wise King, to come to court and congratulate.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0337",
          "zh": "二年春正月，立皇子囂為定陶王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year spring first month, established crown prince Xiao as Dingtao King.",
              "idiomatic": "In the first month of spring in the second year, Crown Prince Xiao was established as King of Dingtao.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0338",
          "zh": "詔曰：「乃者鳳皇甘露降集，黃龍登興，醴泉滂流，枯槁榮茂，神光並見，咸受禎祥。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Recently phoenixes sweet dew descended gathered, yellow dragon ascended aroused, sweet springs abundantly flowed, withered dried gloriously flourished, divine lights appeared together, all received auspicious omens.",
              "idiomatic": "An edict declared: 'Recently phoenixes and sweet dew descended and gathered, yellow dragons ascended and arose, sweet springs flowed abundantly, the withered and dried flourished gloriously, divine lights appeared together, and all received auspicious omens.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "其赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pardon the empire.",
              "idiomatic": "Pardon the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "減民算三十。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Reduce people's poll tax thirty.",
              "idiomatic": "Reduce the people's poll tax by thirty.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "賜諸侯王、丞相、將軍、列侯、中二千石金錢各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted feudal lords kings, Chancellor, generals, marquises, 2000 piculs gold money each had difference.",
              "idiomatic": "Granted gold and money to the feudal kings, Chancellor, generals, marquises, and officials of 2000 piculs, each according to their rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "賜民爵一級，女子百戶牛酒，鰥寡孤獨高年帛。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted people noble ranks one level, women 100 households cattle wine, widowers widows orphans solitary aged silk.'",
              "idiomatic": "Granted the people one noble rank, women who head 100 households cattle and wine, and widowers, widows, orphans, the solitary, and the aged silk.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0343",
          "zh": "夏四月，遣護軍都尉祿將兵擊珠崖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, sent Protector General Commandant Lu led troops struck Zhujia.",
              "idiomatic": "In the fourth month of summer, Protector General Commandant Lu was sent to lead troops and attack Zhujia.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0344",
          "zh": "秋九月，立皇子宇為東平王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn ninth month, established crown prince Yu as Dongping King.",
              "idiomatic": "In the ninth month of autumn, Crown Prince Yu was established as King of Dongping.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0345",
          "zh": "冬十二月，行幸萯陽宮屬玉觀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter twelfth month, proceeded favored Yangyang Palace attached Jade View.",
              "idiomatic": "In the twelfth month of winter, His Majesty proceeded to Yangyang Palace and the attached Jade View.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0346",
          "zh": "匈奴呼韓邪單于款五原塞，願奉國珍朝三年正月。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Huhanye Chanyu came to Wuyuan border, wished presented state treasures courted third year first month.",
              "idiomatic": "Chanyu Huhanye of the Xiongnu came to the Wuyuan border and wished to present state treasures and court congratulations in the first month of the third year.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "詔有司議。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edicted officials discussed.",
              "idiomatic": "An edict was issued for the officials to discuss this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "咸曰：「聖王之制，施德行禮，先京師而後諸夏，先諸夏而後夷狄。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All said: 'Sage kings' system, applied virtue practiced ritual, first capital then various Xia, first various Xia then barbarian Di.",
              "idiomatic": "All said: 'The system of sage kings is to apply virtue and practice ritual, first the capital then the various Xia, first the various Xia then the barbarian Di.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "《詩》 云：『率禮不越，遂視既發。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Poetry says: 'Follow ritual not transgress, then visit already sent.",
              "idiomatic": "The Poetry says: 'Follow ritual and do not transgress, then visit after already sending.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "相土烈烈，海外有涞。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiangtu vigorous vigorous, overseas has Lai.'",
              "idiomatic": "Xiangtu was vigorous and vigorous, overseas had Lai.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "陛下聖德，充塞天地，光被四表。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Your Majesty sage virtue, fills blocks heaven earth, light covers four limits.",
              "idiomatic": "Your Majesty's sage virtue fills heaven and earth, and its light covers the four limits.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "匈奴單于鄉風慕義，舉國同心，奉珍朝賀，自古未之有也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Chanyu faces wind admires righteousness, raises country same heart, presents treasures courts congratulates, since ancient not it have also.",
              "idiomatic": "The Chanyu of the Xiongnu faces our culture and admires righteousness, raises his entire country with one heart, presents treasures and courts congratulations—something never before seen since ancient times.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "單于非正朔所 加，王者所客也，禮儀宜如諸侯王，稱臣昧死再拜，位次諸侯王下。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chanyu not proper calendar added, king makers guest also, ritual ceremony suitable like feudal lords kings, calls himself minister dies in fear twice bows, position ranks feudal lords kings below.'",
              "idiomatic": "The Chanyu is not one to whom the proper calendar is added, nor is he a guest of the king makers. His ritual ceremony should be like that of the feudal kings: he calls himself a minister and twice bows in mortal fear, his position ranking below the feudal kings.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "詔曰：「蓋聞五帝三王，禮所不施，不及以政。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Indeed heard Five Emperors Three Kings, ritual where not applied, not reached with government.",
              "idiomatic": "An edict declared: 'Indeed I have heard that the Five Emperors and Three Kings did not apply ritual where it was not appropriate, nor did they reach with government.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "今匈奴單于稱北藩臣，朝正月，朕之不逮，德 不能弘覆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Xiongnu Chanyu calls himself northern border minister, courts first month, my not reaching, virtue cannot grandly cover.",
              "idiomatic": "Now the Chanyu of the Xiongnu calls himself a northern border minister and courts in the first month. Because of my shortcomings, my virtue cannot grandly cover them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "其以客禮待之，位在諸侯王上。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Treat him with guest ritual, position above feudal lords kings.'",
              "idiomatic": "Treat him with guest ritual, his position above the feudal kings.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0357",
          "zh": "三年春正月，行幸甘泉，郊泰畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third year spring first month, proceeded favored Ganquan, suburban Supreme Altar.",
              "idiomatic": "In the first month of spring in the third year, His Majesty proceeded to Ganquan and performed the suburban sacrifice at the Supreme Altar.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0358",
          "zh": "匈奴呼韓邪單于稽侯蛳來朝，贊謁稱藩臣而不名。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Huhanye Chanyu Qihou Shi came to court, announced audience called border minister and not named.",
              "idiomatic": "Chanyu Huhanye of the Xiongnu, Qihou Shi, came to court. In announcing his audience, he was called a border minister and not named.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "賜以璽綬、冠帶、衣裳、安車、駟馬、黃金、錦繡、繒 絮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Granted him seal cords, crown belts, clothes robes, peaceful carriage, four horses, gold, brocade embroidery, silk floss.",
              "idiomatic": "Granted him seal cords, crown belts, clothes and robes, a peaceful carriage, four horses, gold, brocade and embroidery, silk and floss.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "使有司道單于先行就邸長安，宿長平。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sent officials guided Chanyu first go to residence Chang'an, lodged Changping.",
              "idiomatic": "Officials were sent to guide the Chanyu to first go to his residence in Chang'an, where he lodged at Changping.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0361",
          "zh": "上自甘泉宿池陽宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty from Ganquan lodged Chiyang Palace.",
              "idiomatic": "His Majesty lodged at Chiyang Palace coming from Ganquan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "上登長平阪，詔單于毋謁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty ascended Changping slope, edicted Chanyu not audience.",
              "idiomatic": "His Majesty ascended the Changping slope and edicted that the Chanyu should not make an audience.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "其左右當戶之群皆列觀，蠻夷君長王侯迎者數萬人，夾道陳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His left right Danghu crowds all arrayed observed, barbarian barbarian lords chiefs marquises greeting ones several ten thousand people, flanked road displayed.",
              "idiomatic": "All the crowds of Danghu on his left and right were arrayed to observe, with barbarian lords, chiefs, and marquises who came to greet numbering tens of thousands, displayed along both sides of the road.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0364",
          "zh": "上登渭橋， 咸稱萬歲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His Majesty ascended Wei bridge, all called ten thousand years.",
              "idiomatic": "His Majesty ascended the Wei bridge, and all called out 'ten thousand years.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0365",
          "zh": "單于就邸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chanyu went to residence.",
              "idiomatic": "The Chanyu went to his residence.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0366",
          "zh": "置酒建章宮，饗賜單于，觀以珍寶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Set wine Jianzhang Palace, feasted granted Chanyu, viewed with precious treasures.",
              "idiomatic": "Wine was set at Jianzhang Palace, the Chanyu was feasted and granted gifts, and shown precious treasures.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0367",
          "zh": "二月，單于罷歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month, Chanyu dismissed returned.",
              "idiomatic": "In the second month, the Chanyu was dismissed and returned.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "之長樂衛尉高昌侯忠、車騎都尉昌、騎都尉虎將萬六千騎送單于。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "To Changlegong Guard Commandant Gaochang Marquis Zhong, Cavalry Commandant Chang, Cavalry Commandant Hu led sixteen thousand riders sent Chanyu.",
              "idiomatic": "Changlegong Guard Commandant and Gaochang Marquis Zhong, Cavalry Commandant Chang, and Cavalry Commandant Hu led 16,000 riders to send off the Chanyu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "單于居幕南，保光祿 城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chanyu dwelt tent south, protected Chamberlain for Attendants city.",
              "idiomatic": "The Chanyu dwelt south of the tent and protected the Chamberlain for Attendants' city.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0370",
          "zh": "詔北邊振穀食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edicted northern border provide grain food.",
              "idiomatic": "An edict was issued to provide grain and food to the northern border.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "郅支單于遠遁，匈奴遂定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhizhi Chanyu far fled, Xiongnu then settled.",
              "idiomatic": "Chanyu Zhizhi fled far away, and the Xiongnu were then settled.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0372",
          "zh": "詔曰：「乃者鳳皇集新蔡，群鳥四面行列，皆鄉鳳皇立，以萬數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Recently phoenixes gathered Xincai, flock birds four sides arrayed in rows, all faced phoenixes stood, in ten thousand numbers.",
              "idiomatic": "An edict declared: 'Recently phoenixes gathered at Xincai, and flocks of birds arrayed in rows on all four sides, all facing the phoenixes and standing, numbering in the tens of thousands.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "其賜汝南太守帛百匹，新蔡長吏、三老、孝弟力田、鰥寡孤獨各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grant Yunan Governor silk hundred bolts, Xincai officials chiefs, three elders, filial younger brothers diligent farming, widowers widows orphans solitary each had difference.",
              "idiomatic": "Grant the Yunan Governor 100 bolts of silk, and Xincai officials and chiefs, the three elders, filial younger brothers, diligent farmers, widowers, widows, orphans, and the solitary each according to their rank.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "賜民爵二級。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grant people noble ranks two levels.",
              "idiomatic": "Grant the people two noble ranks.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0375",
          "zh": "毋出今年租。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Do not pay this year rents.'",
              "idiomatic": "Do not pay the rents for this year.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0376",
          "zh": "三月己丑，丞相霸薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month Jichou, Chancellor Ba passed away.",
              "idiomatic": "On the Jichou day of the third month, Chancellor Ba passed away.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0377",
          "zh": "詔諸儒講五經同異，太子太傅蕭望之等平奏其議，上親稱制臨決焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edicted various scholars lecture Five Classics similarities differences, Crown Prince Grand Tutor Xiao Wangzhi etc. balanced memorialized their discussions, His Majesty personally stated regulations personally judged there.",
              "idiomatic": "An edict was issued for various scholars to lecture on the similarities and differences in the Five Classics. Crown Prince Grand Tutor Xiao Wangzhi and others balanced their discussions in a memorial, and His Majesty personally stated the regulations and personally judged them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0378",
          "zh": "乃立梁丘易、大小夏侯尚書、穀梁春秋博士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then established Liangqiu Yi, Greater Lesser Xiahou Documents, Guliang Spring Autumns doctors.",
              "idiomatic": "Then established doctors for Liangqiu Yi, Greater and Lesser Xiahou Documents, and Guliang Spring and Autumns.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0379",
          "zh": "冬，烏孫公主來歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter, Wusun Princess came returned.",
              "idiomatic": "In winter, the Wusun Princess came and returned.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0380",
          "zh": "四年夏，廣川王海陽有罪，廢遷房陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourth year summer, Guangchuan King Haiyang had crime, deposed banished Fangling.",
              "idiomatic": "In summer of the fourth year, King Haiyang of Guangchuan was found guilty of a crime, deposed, and banished to Fangling.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0381",
          "zh": "冬十月丁卯，未央宮宣室閣火。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter tenth month Dingmao, Weiyang Palace Xuanshi pavilion fire.",
              "idiomatic": "On the Dingmao day of the tenth month of winter, the Xuanshi pavilion of Weiyang Palace caught fire.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0382",
          "zh": "黃龍元年春正月，行幸甘泉，郊泰畤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huanglong first year spring first month, proceeded favored Ganquan, suburban Supreme Altar.",
              "idiomatic": "In the first month of spring in the first year of Huanglong, His Majesty proceeded to Ganquan and performed the suburban sacrifice at the Supreme Altar.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0383",
          "zh": "匈奴呼韓邪單于來朝，禮賜如初。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiongnu Huhanye Chanyu came to court, ritual grants like beginning.",
              "idiomatic": "Chanyu Huhanye of the Xiongnu came to court, and the ritual grants were like the beginning.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "二月，單于歸國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second month, Chanyu returned to country.",
              "idiomatic": "In the second month, the Chanyu returned to his country.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0385",
          "zh": "詔曰：「蓋聞上古之治，君臣同心，舉措曲直，各得其所。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Edict said: 'Indeed heard highest antiquity's governance, ruler ministers same heart, actions measures straight crooked, each obtained their place.",
              "idiomatic": "An edict declared: 'Indeed I have heard that in the governance of highest antiquity, rulers and ministers were of one heart, their actions and measures were straight or crooked, each obtaining their proper place.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "是以上下和洽，海內康平，其德弗可及已。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore above below harmonious united, within seas peaceful tranquil, their virtue not can reach already.",
              "idiomatic": "Therefore superiors and inferiors were harmonious and united, within the seas peaceful and tranquil—their virtue could not be reached.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0387",
          "zh": "朕 既不明，數申詔公卿大夫務行寬大，順民所疾苦，將欲配三王之隆，明先帝之德也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I already not bright, repeatedly issued edicts dukes ministers grandees must practice magnanimity, follow people what pains sufferings, will wish match Three Kings' prosperity, clarify Former Emperor's virtue also.",
              "idiomatic": "I am already not bright, and have repeatedly issued edicts that dukes, ministers, and grandees must practice magnanimity and follow what pains and sufferings the people have. I wish to match the prosperity of the Three Kings and clarify the virtue of the Former Emperor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0388",
          "zh": "今吏或以不禁姦邪為寬大，縱釋有罪為不苛，或以酷惡為賢，皆失其中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now officials some with not prohibiting wicked evil as magnanimity, release have crime as not harsh, some with cruel wicked as worthy, all lose their middle.",
              "idiomatic": "Now some officials take not prohibiting wickedness and evil as magnanimity, releasing the guilty as not being harsh, or take cruelty and wickedness as worthiness—all lose the proper middle way.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "奉詔宣 化如此，豈不繆哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Receive edict announce transformation like this, how not wrong!",
              "idiomatic": "To receive edicts and announce transformation like this, how is it not wrong!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0390",
          "zh": "方今天下少事，繇役省減，兵革不動，而民多貧，盜賊不止，其咎安在？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Just now empire few affairs, corvee services reduced diminished, weapons armor not moved, yet people many poor, bandits robbers not stop, their fault where in?",
              "idiomatic": "Just now the empire has few affairs, corvee services are reduced and diminished, weapons and armor are not moved, yet the people are many and poor, bandits and robbers do not stop—where is their fault?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "上計簿，具文而已，務為欺謾，以避其課。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upper accounting registers, merely formal text only, diligently make deceit deception, to avoid their assessments.",
              "idiomatic": "The upper accounting registers are merely formal text only, diligently made deceit and deception to avoid their assessments.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0392",
          "zh": "三公不以為意，朕將何任？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three dukes not take as intention, I will what rely on?",
              "idiomatic": "The three dukes do not take this as their intention—what will I rely on?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0393",
          "zh": "諸請詔省卒徒自給者皆止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Various request edicts reduce soldiers laborers self-support ones all stop.",
              "idiomatic": "All those who request edicts to reduce soldiers and laborers for self-support shall stop.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "御史察計簿，疑非實者，按之，使真偽毋相亂。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Imperial secretary inspect accounting registers, suspect not real ones, investigate them, cause true false not mutually confused.'",
              "idiomatic": "Imperial secretaries shall inspect the accounting registers, investigate those suspected of not being real, and cause true and false not to be mutually confused.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0395",
          "zh": "三月，有星孛于王良、閣道，入紫宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Third month, there was comet at Wangliang, Gallery Way, entered Purple Palace.",
              "idiomatic": "In the third month, there was a comet at Wangliang and Gallery Way that entered the Purple Palace.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0396",
          "zh": "夏四月，詔曰：「舉廉吏，誠欲得其真也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Summer fourth month, edict said: 'Recommend incorruptible officials, sincerely wish obtain their true also.",
              "idiomatic": "In the fourth month of summer, an edict declared: 'To recommend incorruptible officials is sincerely to wish to obtain their true selves.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "吏六百石位大夫，有罪先請，秩祿上通，足以效其賢材，自今以來毋得舉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Officials 600 piculs rank grandee, have crime first request, ranks salaries upward communicate, sufficient to display their worthy talents, from now henceforth not permitted recommend.'",
              "idiomatic": "Officials of 600 piculs rank as grandees, when they have crimes, request first. Their ranks and salaries communicate upward, sufficient to display their worthy talents. From now henceforth they shall not be permitted to be recommended.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0398",
          "zh": "冬十二月甲戌，帝崩于未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Winter twelfth month Jiaxu, Emperor collapsed at Weiyang Palace.",
              "idiomatic": "On the Jiaxu day of the twelfth month of winter, the Emperor collapsed at Weiyang Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0399",
          "zh": "癸巳，尊皇太后曰太皇太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guisi, honored Empress Dowager called Grand Empress Dowager.",
              "idiomatic": "On Guisi, the Empress Dowager was honored and called Grand Empress Dowager.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0400",
          "zh": "贊曰：孝宣之治，信賞必罰，綜核名實，政事文學法理之士咸精其能，至于技巧工匠器械，自元、成間鮮能及之，亦足以知吏稱其職，民安其業也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Praise said: Filial Xuan's governance, trustworthy rewards certain punishments, comprehensively verified names realities, administration literature law principle gentlemen all refined their abilities, as for skills craftsmen machines implements, from Yuan, Cheng interval few could match them, also sufficient to know officials matched their duties, people peaceful their occupations also.",
              "idiomatic": "Praise says: In Filial Xuan's governance, rewards were trustworthy and punishments certain, names and realities were comprehensively verified. Gentlemen of administration, literature, and legal principles all refined their abilities. As for skills, craftsmen, and machines and implements, from the Yuan and Cheng periods few could match them. This is also sufficient to know that officials matched their duties and the people were peaceful in their occupations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0401",
          "zh": "遭值匈奴乖亂，推亡固存，信威北夷，單于慕義，稽首稱藩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Encountered encountered Xiongnu disorder rebellion, pushed perished strengthened survived, trustworthy might northern barbarians, Chanyu admired righteousness, kowtowed called border minister.",
              "idiomatic": "He encountered the Xiongnu in disorder and rebellion, pushed those who perished and strengthened those who survived, made trustworthy his might against the northern barbarians. The Chanyu admired righteousness, kowtowed, and called himself a border minister.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0402",
          "zh": "功光祖宗，業垂後嗣，可謂中興，侔德殷宗、周宣矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Merit illuminated ancestors, enterprise hung to posterity, can call middle rise, equaled virtue Yin ancestor, Zhou Xuan ah.",
              "idiomatic": "His merit illuminated the ancestors, his enterprise hung down to posterity. He can be called a middle revival, equaling the virtue of the Yin ancestor and Zhou Xuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    }
  ]
}