{
  "meta": {
    "book": "hanshu",
    "bookInfo": {
      "name": "Book of Han",
      "chinese": "漢書",
      "pinyin": "Hànshū",
      "dynasty": "Western Han",
      "author": "Ban Gu",
      "authorChinese": "班固"
    },
    "chapter": "012",
    "url": "https://chinesenotes.com/hanshu/hanshu012.html",
    "title": {
      "zh": "卷十一 哀帝紀",
      "en": "Volume 11: Annals of Emperor Ai",
      "raw": "卷十一 哀帝紀 Volume 11: Annals of Emperor Ai"
    },
    "sentenceCount": 138,
    "translatedCount": 138,
    "glossarySize": 14858,
    "scrapedAt": "2025-12-23T16:54:37.130Z",
    "translators": [],
    "citation": null,
    "qualityScore": 8
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝哀皇帝，元帝庶孫，定陶恭王子也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Filial and Lamented Emperor was the grandson through a concubine of Emperor Yuan, and the son of Prince Gong of Dingtao.",
              "idiomatic": "Emperor Ai, known for his filial piety, was the grandson of Emperor Yuan through a concubine, and the son of Prince Gong of Dingtao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "母曰丁姬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His mother was named Lady Ding.",
              "idiomatic": "His mother was Lady Ding.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "年三歲嗣立為王，長好文辭法律。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At age three he succeeded to the throne as king, and when grown he favored literary compositions and laws.",
              "idiomatic": "At the age of three, he ascended to the throne as king, and as he grew up, he developed a love for literature and legal studies.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "元延四年入朝，盡從傅、相、中尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth year of Yuanyan, he entered the court, bringing all his tutor, chancellor, and commandant with him.",
              "idiomatic": "In the fourth year of the Yuanyan era (12 BCE), he came to court accompanied by his entire retinue: his tutor, chancellor, and commandant.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "時成帝少弟中山孝王亦來朝，獨從傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, Emperor Cheng's younger brother King Xiao of Zhongshan also came to court, bringing only his tutor.",
              "idiomatic": "At the same time, Emperor Cheng's younger brother, King Xiao of Zhongshan, also came to court but brought only his tutor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "上怪之，以問定陶王，對曰：「令，諸侯王朝，得從其國二千石。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The emperor was surprised by this and asked the King of Dingtao about it. He replied: 'According to the regulations, when feudal lords come to court, they may bring officials of two thousand bushels from their fiefs.",
              "idiomatic": "The emperor found this strange and asked the King of Dingtao about it. He replied: 'According to the regulations, when feudal lords come to court, they are allowed to bring officials ranked at two thousand bushels from their domains.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "傅、相、中尉皆國二千石，故盡從之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The tutor, chancellor, and commandant are all officials of two thousand bushels in the state, so I brought all of them.'",
              "idiomatic": "The tutor, chancellor, and commandant are all two-thousand-bushel officials in my domain, so I brought them all with me.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "上令誦詩，通習，能說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The emperor ordered him to recite poetry; he was fluent and could explain it.",
              "idiomatic": "The emperor had him recite poetry; he was fluent in it and could explain its meaning.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "他日問中山王：「",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Another day he asked the King of Zhongshan: '",
              "idiomatic": "On another occasion, he asked the King of Zhongshan: '",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Ai, known for his filial piety, was the grandson of Emperor Yuan through a concubine, and the son of Prince Gong of Dingtao. His mother was Lady Ding. At the age of three, he ascended to the throne as king, and as he grew up, he developed a love for literature and legal studies. In the fourth year of the Yuanyan era (12 BCE), he came to court accompanied by his entire retinue: his tutor, chancellor, and commandant. At the same time, Emperor Cheng's younger brother, King Xiao of Zhongshan, also came to court but brought only his tutor. The emperor found this strange and asked the King of Dingtao about it. He replied: 'According to the regulations, when feudal lords come to court, they are allowed to bring officials ranked at two thousand bushels from their domains. The tutor, chancellor, and commandant are all two-thousand-bushel officials in my domain, so I brought them all with me.' The emperor had him recite poetry; he was fluent in it and could explain its meaning. On another occasion, he asked the King of Zhongshan: '",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "獨從傅在何法令？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "What regulation says you may bring only your tutor?'",
              "idiomatic": "What regulation allows you to bring only your tutor?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "不能對。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He could not answer.",
              "idiomatic": "He was unable to answer.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "令誦尚書，又廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He ordered him to recite the Book of Documents, but he failed again.",
              "idiomatic": "He then had him recite from the Book of Documents, but he failed once more.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "及賜食於前，後飽；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When food was bestowed before him, he ate after becoming full;",
              "idiomatic": "When food was served in front of him, he ate until he was full;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "起下，陉係解。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When he rose to descend, the belt cord came undone.",
              "idiomatic": "When he stood up to leave, his belt came untied.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "成帝由此以為不能，而賢定陶王，數稱其材。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Emperor Cheng thereby considered him incapable, but esteemed the King of Dingtao and frequently praised his abilities.",
              "idiomatic": "From this, Emperor Cheng concluded that the King of Zhongshan was incompetent, but he came to admire the King of Dingtao and often praised his talents.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "時王祖母傅太后隨王來朝，私賂遺上所幸趙昭儀及帝舅票騎將軍曲陽侯王根。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, the king's grandmother Empress Dowager Fu accompanied the king to court and privately bribed and gifted the emperor's favored Consort Zhao and the emperor's uncle General of Chariots and Cavalry Marquis Quyang Wang Gen.",
              "idiomatic": "Meanwhile, the king's grandmother, Empress Dowager Fu, had accompanied him to court and secretly bribed both the emperor's favorite, Consort Zhao, and the emperor's uncle, General Wang Gen, Marquis of Quyang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "昭儀及根見上亡子，亦欲豫自結為長久計，皆更稱定陶王，勸帝以為嗣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Consort Zhao and Wang Gen, seeing that the emperor had no sons, also wished to secure themselves for the long term, and both spoke favorably of the King of Dingtao, urging the emperor to make him heir.",
              "idiomatic": "Consort Zhao and Wang Gen, observing that the emperor had no sons, wanted to secure their own long-term interests. They both spoke highly of the King of Dingtao and urged the emperor to name him as heir.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "成帝亦自美其材，為加元服而遣之，時年十七矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Emperor Cheng himself admired his abilities, performed the capping ceremony for him, and sent him away; he was then seventeen years old.",
              "idiomatic": "Emperor Cheng himself admired the young man's talents, performed the coming-of-age capping ceremony for him, and sent him back home. He was seventeen at the time.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "明年，使執金吾任宏守大鴻臚，持節徵定陶王，立為皇太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The next year, he sent Colonel of the City Gates Ren Hong, acting as Grand Herald, bearing credentials to summon the King of Dingtao and establish him as Crown Prince.",
              "idiomatic": "The following year, Emperor Cheng sent Colonel Ren Hong, temporarily serving as Grand Herald, to summon the King of Dingtao with imperial credentials and establish him as Crown Prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "謝曰：「臣幸得繼父守藩為諸侯王，材質不足以假充太子之宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He declined, saying: 'Your servant has fortunately succeeded his father in guarding the border as a feudal lord king. My abilities and qualities are insufficient to temporarily fill the position of Crown Prince.",
              "idiomatic": "He respectfully declined, saying: 'I am fortunate to have succeeded my father as a feudal king guarding the borders. My talents and character are inadequate to serve even temporarily as Crown Prince.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "陛下聖德寬仁，敬承祖宗，奉順神祇，宜蒙福祐子孫千億之報。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Your Majesty's sage virtue is broad and benevolent; reverently continuing the ancestors, complying with the spirits, you should receive blessed protection for your descendants numbering thousands and myriads.",
              "idiomatic": "Your Majesty's wisdom and benevolence are boundless. You honor your ancestors and obey the gods, and surely you will be blessed with countless descendants.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "臣願且得留國邸，旦夕奉問起居，俟有聖嗣，歸國守藩。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I wish to remain in my country's residence for now, morning and evening attending to your inquiries about your condition, awaiting a sage heir, then return to my country to guard the border.'",
              "idiomatic": "I wish only to remain in my residence for now, serving you faithfully by inquiring daily about your well-being, until you have a worthy heir, and then return to guard my domain.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "書奏，天子報聞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The memorial was presented; the Son of Heaven acknowledged receipt.",
              "idiomatic": "The memorial was submitted, and the emperor acknowledged it.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "後月餘，立楚孝王孫景為定陶王，奉恭王祀，所以獎厲太子專為後之誼。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "More than a month later, he established King Xiao of Chu's grandson Jing as King of Dingtao to continue King Gong's sacrifices, in order to encourage and exhort the Crown Prince to focus single-mindedly on succession.",
              "idiomatic": "Over a month later, he installed Jing, grandson of King Xiao of Chu, as King of Dingtao to maintain the sacrifices to King Gong, thereby encouraging the Crown Prince to concentrate solely on securing the succession.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "語在外戚傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The account is in the Biographies of the Imperial Affines.",
              "idiomatic": "The full story is told in the biographies of the imperial relatives.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "What regulation allows you to bring only your tutor?' He was unable to answer. He then had him recite from the Book of Documents, but he failed once more. When food was served in front of him, he ate until he was full; When he stood up to leave, his belt came untied. From this, Emperor Cheng concluded that the King of Zhongshan was incompetent, but he came to admire the King of Dingtao and often praised his talents. Meanwhile, the king's grandmother, Empress Dowager Fu, had accompanied him to court and secretly bribed both the emperor's favorite, Consort Zhao, and the emperor's uncle, General Wang Gen, Marquis of Quyang. Consort Zhao and Wang Gen, observing that the emperor had no sons, wanted to secure their own long-term interests. They both spoke highly of the King of Dingtao and urged the emperor to name him as heir. Emperor Cheng himself admired the young man's talents, performed the coming-of-age capping ceremony for him, and sent him back home. He was seventeen at the time. The following year, Emperor Cheng sent Colonel Ren Hong, temporarily serving as Grand Herald, to summon the King of Dingtao with imperial credentials and establish him as Crown Prince. He respectfully declined, saying: 'I am fortunate to have succeeded my father as a feudal king guarding the borders. My talents and character are inadequate to serve even temporarily as Crown Prince. Your Majesty's wisdom and benevolence are boundless. You honor your ancestors and obey the gods, and surely you will be blessed with countless descendants. I wish only to remain in my residence for now, serving you faithfully by inquiring daily about your well-being, until you have a worthy heir, and then return to guard my domain.' The memorial was submitted, and the emperor acknowledged it. Over a month later, he installed Jing, grandson of King Xiao of Chu, as King of Dingtao to maintain the sacrifices to King Gong, thereby encouraging the Crown Prince to concentrate solely on securing the succession. The full story is told in the biographies of the imperial relatives.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0026",
          "zh": "綏和二年三月，成帝崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month of the second year of Suihe, Emperor Cheng passed away.",
              "idiomatic": "In the third month of the second year of the Suihe era (7 BCE), Emperor Cheng died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "四月丙午，太子即皇帝位，謁高廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth month, on the day Bingwu, the Crown Prince ascended the imperial throne and paid respects at the High Temple.",
              "idiomatic": "In the fourth month, on the day bingwu, the Crown Prince ascended the throne as emperor and performed the ancestral rites at the imperial temple.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "尊皇太后曰太皇太后，皇后曰皇太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He honored the Empress Dowager as Grand Empress Dowager, and the Empress as Empress Dowager.",
              "idiomatic": "He elevated the Empress Dowager to Grand Empress Dowager, and the Empress to Empress Dowager.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "大赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He granted a general amnesty to all under heaven.",
              "idiomatic": "He declared a general amnesty throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "賜宗室王子有屬者馬各一駟，吏民爵，百戶牛酒，三老、孝弟力田、鰥寡孤獨帛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He bestowed upon imperial clansmen and princes who had heirs one team of horses each; officials and commoners were granted noble ranks; every hundred households received beef and wine; the elders, filial and fraternal, diligent farmers, widows, widowers, orphans, and solitary were given silk.",
              "idiomatic": "He granted each imperial clansman and prince with heirs a team of horses. Officials and commoners received noble titles. Every hundred households got beef and wine. The village elders, the filial and brotherly, hardworking farmers, widows, widowers, orphans, and the destitute all received gifts of silk.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "太皇太后詔尊定陶恭王為恭皇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Grand Empress Dowager issued an edict honoring King Gong of Dingtao as Emperor Gong.",
              "idiomatic": "By edict of the Grand Empress Dowager, King Gong of Dingtao was honored with the posthumous title Emperor Gong.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month of the second year of the Suihe era (7 BCE), Emperor Cheng died. In the fourth month, on the day bingwu, the Crown Prince ascended the throne as emperor and performed the ancestral rites at the imperial temple. He elevated the Empress Dowager to Grand Empress Dowager, and the Empress to Empress Dowager. He declared a general amnesty throughout the empire. He granted each imperial clansman and prince with heirs a team of horses. Officials and commoners received noble titles. Every hundred households got beef and wine. The village elders, the filial and brotherly, hardworking farmers, widows, widowers, orphans, and the destitute all received gifts of silk. By edict of the Grand Empress Dowager, King Gong of Dingtao was honored with the posthumous title Emperor Gong.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "五月丙戌，立皇后傅氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month, on the day Bingxu, he established Empress Fu.",
              "idiomatic": "In the fifth month, on the day bingxu, he installed Empress Fu on the throne.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "詔曰：「春秋『母以子貴』，尊定陶太后曰恭皇太后，丁姬曰恭皇后，各置左右詹事，食邑如長信宮、中宮。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "An edict stated: 'The Spring and Autumn Annals say \"The mother is honored through the son.\" Honor the Empress Dowager of Dingtao as Empress Dowager Gong, and Lady Ding as Empress Gong. Each shall have left and right palace attendants established, with fiefs equal to the Changxin Palace and the Central Palace.'",
              "idiomatic": "An imperial edict declared: 'As the Spring and Autumn Annals teach, \"The mother gains honor through her son.\" The Empress Dowager of Dingtao shall be honored as Empress Dowager Gong, and Lady Ding as Empress Gong. Each shall have their own attendants, with estates equal to the Changxin Palace and the imperial residence.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "追尊傅父為崇祖侯、丁父為褒德侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He posthumously honored Fu's father as Marquis Chongzu, and Ding's father as Marquis Baode.",
              "idiomatic": "He granted posthumous honors: Fu's father became Marquis Chongzu, and Ding's father became Marquis Baode.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "封舅丁明為陽安侯，舅子滿為平周侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He enfeoffed maternal uncle Ding Ming as Marquis Yang'an, and maternal uncle's son Man as Marquis Pingzhou.",
              "idiomatic": "He enfeoffed his maternal uncle Ding Ming as Marquis of Yang'an, and Ding Ming's son Man as Marquis of Pingzhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "追諡滿父忠為平周懷侯，皇后父晏為孔鄉侯，皇太后弟侍中光祿大夫趙欽為新成侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He posthumously conferred the title Marquis Huai of Pingzhou on Man's father Zhong; the Empress's father Yan as Marquis Kongxiang; and the Empress Dowager's younger brother Chamberlain for Attendants Gentleman of the Interior Zhao Qin as Marquis Xincheng.",
              "idiomatic": "He granted posthumous titles: Marquis Huai of Pingzhou to Man's father Zhong; Marquis Kongxiang to the Empress's father Yan; and Marquis Xincheng to the Empress Dowager's younger brother, Chamberlain Zhao Qin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth month, on the day bingxu, he installed Empress Fu on the throne. An imperial edict declared: 'As the Spring and Autumn Annals teach, \"The mother gains honor through her son.\" The Empress Dowager of Dingtao shall be honored as Empress Dowager Gong, and Lady Ding as Empress Gong. Each shall have their own attendants, with estates equal to the Changxin Palace and the imperial residence.' He granted posthumous honors: Fu's father became Marquis Chongzu, and Ding's father became Marquis Baode. He enfeoffed his maternal uncle Ding Ming as Marquis of Yang'an, and Ding Ming's son Man as Marquis of Pingzhou. He granted posthumous titles: Marquis Huai of Pingzhou to Man's father Zhong; Marquis Kongxiang to the Empress's father Yan; and Marquis Xincheng to the Empress Dowager's younger brother, Chamberlain Zhao Qin.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "六月，詔曰：「鄭聲淫而亂樂，聖王所放，其罷樂府。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month, an edict stated: 'Zheng music is licentious and confuses ritual music; the sage kings banished it. We shall abolish the Music Bureau.'",
              "idiomatic": "In the sixth month, an imperial edict declared: 'The decadent music of Zheng confuses proper ritual music; the sage kings banished it. We shall abolish the Music Bureau.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth month, an imperial edict declared: 'The decadent music of Zheng confuses proper ritual music; the sage kings banished it. We shall abolish the Music Bureau.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0038",
          "zh": "曲陽侯根前以大司馬建社稷策，益封二千戶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Marquis Quyang Wang Gen had previously, as Grand Commandant, established plans for the altars of soil and grain; his fief was increased by two thousand households.",
              "idiomatic": "Marquis Wang Gen of Quyang had previously, as Grand Commandant, established policies for the state altars. His fief was increased by two thousand households.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "太僕安陽侯舜輔導有舊恩，益封五百戶，及丞相孔光、大司空氾鄉侯何武益封各千戶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Coachman Marquis Anyang Shun had old merits in guidance and assistance; his fief was increased by five hundred households, and Chancellor Kong Guang and Grand Minister of Works Marquis Fanxiang He Wu each had their fiefs increased by one thousand households.",
              "idiomatic": "Grand Coachman Shun, Marquis of Anyang, had longstanding merits in guidance and support. His fief was increased by five hundred households. Chancellor Kong Guang and Grand Minister of Works He Wu, Marquis of Fanxiang, each had their fiefs increased by one thousand households.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Marquis Wang Gen of Quyang had previously, as Grand Commandant, established policies for the state altars. His fief was increased by two thousand households. Grand Coachman Shun, Marquis of Anyang, had longstanding merits in guidance and support. His fief was increased by five hundred households. Chancellor Kong Guang and Grand Minister of Works He Wu, Marquis of Fanxiang, each had their fiefs increased by one thousand households.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "詔曰：「河間王良喪太后三年，為宗室儀表，益封萬戶。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "An edict stated: 'King Liang of Hejian mourned his empress dowager for three years, serving as a model for the imperial clan. His fief shall be increased by ten thousand households.'",
              "idiomatic": "An imperial edict declared: 'King Liang of Hejian mourned his mother for three years, setting an example for the entire imperial clan. His fief shall be increased by ten thousand households.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "An imperial edict declared: 'King Liang of Hejian mourned his mother for three years, setting an example for the entire imperial clan. His fief shall be increased by ten thousand households.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "又曰：「制節謹度以防奢淫，為政所先，百王不易之道也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Another edict stated: 'Moderating expenditures and being careful with standards to prevent extravagance and licentiousness is the foremost matter in governing. It is the unchanging way of the hundred kings.",
              "idiomatic": "Another edict declared: 'Controlling expenditures and maintaining proper standards to prevent extravagance and immorality is the highest priority in governance. This is the eternal principle followed by all wise rulers.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "諸侯王、列侯、公主、吏二千石及豪富民多畜奴婢，田宅亡限，與民爭利，百姓失職，重困不足。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Feudal lords, marquises, princesses, officials of two thousand bushels, and wealthy commoners extensively accumulate slaves and bondservants, fields and dwellings without limit, contending with the people for profit. The common people lose their occupations, suffering doubly from hardship and insufficiency.",
              "idiomatic": "Feudal kings, marquises, princesses, high officials, and wealthy families accumulate vast numbers of slaves and servants, owning unlimited fields and estates. They compete with ordinary people for profits, leaving the common folk unemployed and suffering from severe poverty.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "其議限列。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Let there be discussion of establishing limits.'",
              "idiomatic": "Let the officials discuss and establish proper limits.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "有司條奏：「諸王、列侯得名田國中，列侯在長安及公主名田縣道，關內侯、吏民名田，皆無得過三十頃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The officials submitted a detailed memorial: 'The various kings and marquises may own named fields within their states. Marquises in Chang'an and princesses may own named fields in counties and districts. Gentlemen of the Interior and officials and commoners may own named fields, but none may exceed thirty qing.",
              "idiomatic": "The officials submitted detailed proposals: 'Kings and marquises may own designated fields within their domains. Marquises in Chang'an and princesses may own designated fields in counties and administrative districts. Gentlemen of the Interior, officials, and commoners may own designated fields, but none may exceed thirty qing in size.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "諸侯王奴婢二百人，列侯、公主百人，關內侯、吏民三十人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Feudal lords may have two hundred slaves and bondservants; marquises and princesses one hundred; gentlemen of the Interior, officials, and commoners thirty.",
              "idiomatic": "Feudal kings may own two hundred slaves and servants; marquises and princesses one hundred; gentlemen of the interior, officials, and commoners thirty.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "年六十以上，十歲以下，不在數中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Those sixty years and above, ten years and below, are not counted in the number.",
              "idiomatic": "Those over sixty and under ten years old are not counted in these limits.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "賈人皆不得名田、為吏，犯者以律論。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Merchants all may not own named fields or serve as officials; violators shall be judged according to the law.",
              "idiomatic": "Merchants are prohibited from owning designated fields or holding official positions. Violators will be prosecuted according to the law.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "諸名田畜奴婢過品，皆沒入縣官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All named fields and slaves and bondservants exceeding the categories shall all be confiscated to the county officials.",
              "idiomatic": "Any designated fields or slaves/servants exceeding the prescribed limits shall be confiscated by the government.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "齊三服官、諸官織綺繡，難成，害女紅之物，皆止，無作輸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Qi three robes offices and various offices weaving patterned silk and embroidery, difficult to complete, harming women's needlework items, all shall stop, without making or transporting.",
              "idiomatic": "The Qi offices for the three ceremonial robes and other offices producing patterned silks and embroidery are to cease operations, as they are difficult to complete and interfere with women's traditional crafts. No more production or delivery.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "除任子令及誹謗詆欺法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Abolish the hereditary office appointment command and the slander and defamation laws.",
              "idiomatic": "Abolish the system of hereditary official appointments and the laws against slander and defamation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "掖庭宮人年三十以下，出嫁之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Palace women in the side quarters thirty years and below shall be married off.",
              "idiomatic": "Palace ladies under thirty years old in the imperial residence shall be married off.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "官奴婢五十以上，免為庶人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Official slaves and bondservants fifty years and above shall be released as commoners.",
              "idiomatic": "Government slaves and servants over fifty years old shall be freed and become commoners.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "禁郡國無得獻名獸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Prohibit commanderies and states from offering famous beasts.",
              "idiomatic": "Commanderies and principalities are forbidden from presenting exotic animals as tribute.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "益吏三百石以下奉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Increase the stipends of officials three hundred bushels and below.",
              "idiomatic": "Increase the salaries of officials ranked at three hundred bushels or less.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "察吏殘賊酷虐者，以時退。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Investigate officials who are cruel, harmful, and tyrannical, and dismiss them in due time.",
              "idiomatic": "Investigate and promptly remove officials who are cruel, corrupt, or tyrannical.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "有司無得舉赦前往事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The various officials may not cite amnesty for past matters.",
              "idiomatic": "Officials are prohibited from citing amnesties when dealing with past offenses.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "博士弟子父母死，予寧三年。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Doctoral disciples whose parents die shall be granted three years of mourning leave.'",
              "idiomatic": "Students in the Imperial Academy whose parents die shall be granted three years of mourning leave.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Another edict declared: 'Controlling expenditures and maintaining proper standards to prevent extravagance and immorality is the highest priority in governance. This is the eternal principle followed by all wise rulers. Feudal kings, marquises, princesses, high officials, and wealthy families accumulate vast numbers of slaves and servants, owning unlimited fields and estates. They compete with ordinary people for profits, leaving the common folk unemployed and suffering from severe poverty. Let the officials discuss and establish proper limits.' The officials submitted detailed proposals: 'Kings and marquises may own designated fields within their domains. Marquises in Chang'an and princesses may own designated fields in counties and administrative districts. Gentlemen of the Interior, officials, and commoners may own designated fields, but none may exceed thirty qing in size. Feudal kings may own two hundred slaves and servants; marquises and princesses one hundred; gentlemen of the interior, officials, and commoners thirty. Those over sixty and under ten years old are not counted in these limits. Merchants are prohibited from owning designated fields or holding official positions. Violators will be prosecuted according to the law. Any designated fields or slaves/servants exceeding the prescribed limits shall be confiscated by the government. The Qi offices for the three ceremonial robes and other offices producing patterned silks and embroidery are to cease operations, as they are difficult to complete and interfere with women's traditional crafts. No more production or delivery. Abolish the system of hereditary official appointments and the laws against slander and defamation. Palace ladies under thirty years old in the imperial residence shall be married off. Government slaves and servants over fifty years old shall be freed and become commoners. Commanderies and principalities are forbidden from presenting exotic animals as tribute. Increase the salaries of officials ranked at three hundred bushels or less. Investigate and promptly remove officials who are cruel, corrupt, or tyrannical. Officials are prohibited from citing amnesties when dealing with past offenses. Students in the Imperial Academy whose parents die shall be granted three years of mourning leave.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "秋，曲陽侯王根、成都侯王況皆有罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In autumn, Marquis Quyang Wang Gen and Marquis Chengdu Wang Kuang both had crimes.",
              "idiomatic": "In autumn, both Marquis Wang Gen of Quyang and Marquis Wang Kuang of Chengdu were found guilty of offenses.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "根就國，況免為庶人，歸故郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gen proceeded to his state, Kuang was dismissed as a commoner and returned to his former commandery.",
              "idiomatic": "Wang Gen was sent to his fief, while Wang Kuang was stripped of his title and returned as a commoner to his home commandery.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In autumn, both Marquis Wang Gen of Quyang and Marquis Wang Kuang of Chengdu were found guilty of offenses. Wang Gen was sent to his fief, while Wang Kuang was stripped of his title and returned as a commoner to his home commandery.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "詔曰：「朕承宗廟之重，戰戰兢兢，懼失天心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "An edict stated: 'I bear the heavy responsibility of the ancestral temples, trembling with fear, afraid of losing the favor of heaven.",
              "idiomatic": "An imperial edict declared: 'I bear the sacred trust of our ancestral temples, filled with trepidation, fearing I have lost heaven's favor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "間者日月亡光，五星失行，郡國比比地動。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Recently the sun and moon have lost their light, the five planets have deviated from their courses, and earthquakes have occurred repeatedly in commanderies and states.",
              "idiomatic": "Recently, the sun and moon have been eclipsed, the five planets have wandered from their proper paths, and earthquakes have struck repeatedly throughout the commanderies and principalities.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "乃者河南、穎川郡水出，流殺人民，壞敗廬舍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Recently in Henan and Yingchuan commanderies water overflowed, flooding and killing people, destroying houses and dwellings.",
              "idiomatic": "Recently, flooding in Henan and Yingchuan commanderies has drowned people and destroyed homes and shelters.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "朕之不德，民反蒙辜，朕甚懼焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Because of my lack of virtue, the people have conversely suffered unjustly; I am greatly fearful.",
              "idiomatic": "My lack of virtue has caused the people to suffer unjustly; I am deeply alarmed by this.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "已遣光祿大夫循行舉籍，賜死者棺錢，人三千。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I have already dispatched a Gentleman of the Interior to tour and register them, granting coffin money to the dead, three thousand cash per person.",
              "idiomatic": "I have dispatched a high official to inspect and record the damages, providing three thousand cash for burial expenses to each deceased person.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "其令水所傷縣邑及他郡國災害什四以上，民貲不滿十萬，皆無出今年租賦。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Order that counties and towns damaged by water and other commanderies and states suffering disasters of ten to four tenths or more, people whose property is less than one hundred thousand, all shall not pay this year's rents and taxes.'",
              "idiomatic": "Command that counties and townships damaged by flooding, and other commanderies and states suffering losses of 40% or more, where people's property is valued at less than 100,000 cash, shall be exempted from this year's taxes and levies.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "An imperial edict declared: 'I bear the sacred trust of our ancestral temples, filled with trepidation, fearing I have lost heaven's favor. Recently, the sun and moon have been eclipsed, the five planets have wandered from their proper paths, and earthquakes have struck repeatedly throughout the commanderies and principalities. Recently, flooding in Henan and Yingchuan commanderies has drowned people and destroyed homes and shelters. My lack of virtue has caused the people to suffer unjustly; I am deeply alarmed by this. I have dispatched a high official to inspect and record the damages, providing three thousand cash for burial expenses to each deceased person. Command that counties and townships damaged by flooding, and other commanderies and states suffering losses of 40% or more, where people's property is valued at less than 100,000 cash, shall be exempted from this year's taxes and levies.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0066",
          "zh": "建平元年春正月，赦天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the first month of spring of the first year of Jianping, he granted amnesty to all under heaven.",
              "idiomatic": "In the first month of spring of the first year of the Jianping era (6 BCE), a general amnesty was declared throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "侍中騎都尉新成侯趙欽、成陽侯趙訢皆有罪，免為庶人，徙遼西。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chamberlain for Attendants Colonel of Cavalry Marquis Xincheng Zhao Qin and Marquis Chengyang Zhao Xin both had crimes; they were dismissed as commoners and banished to Liaoxi.",
              "idiomatic": "Chamberlain Zhao Qin, Marquis of Xincheng, and Zhao Xin, Marquis of Chengyang, were both found guilty. They were stripped of their titles and banished as commoners to Liaoxi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first month of spring of the first year of the Jianping era (6 BCE), a general amnesty was declared throughout the empire. Chamberlain Zhao Qin, Marquis of Xincheng, and Zhao Xin, Marquis of Chengyang, were both found guilty. They were stripped of their titles and banished as commoners to Liaoxi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "太皇太后詔外家王氏田非冢塋，皆以賦貧民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Grand Empress Dowager issued an edict that the Wang family's external family fields that are not ancestral tombs shall all be assigned to poor people.",
              "idiomatic": "By edict of the Grand Empress Dowager, all Wang family lands not used for ancestral tombs shall be distributed to the poor.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "By edict of the Grand Empress Dowager, all Wang family lands not used for ancestral tombs shall be distributed to the poor.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0069",
          "zh": "二月，詔曰：「蓋聞聖王之治，以得賢為首。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the second month, an edict stated: 'I have heard that the governance of sage kings takes obtaining worthy men as the first priority.",
              "idiomatic": "In the second month, an imperial edict declared: 'It is said that wise rulers prioritize finding worthy officials above all else.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "其與大司馬、列侯、將軍、中二千石、州牧、守、相舉孝弟惇厚能直言通政事，延于側陋可親民者，各一人。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Let them together with the Grand Commandant, marquises, generals, officials of middle two thousand bushels, provincial governors, governors, and chancellors recommend filial and fraternal, sincere and substantial, able to speak directly and understand state affairs, extending to those in humble positions who can be close to the people, each one person.'",
              "idiomatic": "Together with the Grand Commandant, marquises, generals, and officials of all ranks, let them recommend individuals who are filial and brotherly, sincere and upright, able to speak frankly and understand governance, including those from humble backgrounds who can connect with the people - one person each.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the second month, an imperial edict declared: 'It is said that wise rulers prioritize finding worthy officials above all else. Together with the Grand Commandant, marquises, generals, and officials of all ranks, let them recommend individuals who are filial and brotherly, sincere and upright, able to speak frankly and understand governance, including those from humble backgrounds who can connect with the people - one person each.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "三月，賜諸侯王、公主、列侯、丞相、將軍、中二千石、中都官郎吏金錢帛，各有差。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month, he bestowed upon feudal lords, princesses, marquises, chancellors, generals, officials of middle two thousand bushels, and central capital official attendants gold, money, and silk, each according to their rank.",
              "idiomatic": "In the third month, gifts of gold, money, and silk were bestowed upon feudal kings, princesses, marquises, chancellors, generals, mid-level officials, and central government attendants, with amounts varying by rank.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, gifts of gold, money, and silk were bestowed upon feudal kings, princesses, marquises, chancellors, generals, mid-level officials, and central government attendants, with amounts varying by rank.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "冬，中山孝王太后媛、弟宜鄉侯馮參有罪，皆自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In winter, King Xiao of Zhongshan's Empress Dowager Yuan and younger brother Marquis Yixiang Feng Can had crimes; both committed suicide.",
              "idiomatic": "In winter, Empress Dowager Yuan of King Xiao of Zhongshan and her younger brother, Marquis Feng Can of Yixiang, were found guilty and both committed suicide.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In winter, Empress Dowager Yuan of King Xiao of Zhongshan and her younger brother, Marquis Feng Can of Yixiang, were found guilty and both committed suicide.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "二年春三月，罷大司空，復御史大夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month of spring of the second year, he abolished the Grand Minister of Works and restored the Chamberlain for the Palace Revenues.",
              "idiomatic": "In the third month of spring of the second year, the office of Grand Minister of Works was abolished and the Chamberlain for the Palace Revenues was restored.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month of spring of the second year, the office of Grand Minister of Works was abolished and the Chamberlain for the Palace Revenues was restored.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0074",
          "zh": "夏四月，詔曰：「漢家之制，推親親以顯尊尊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth month of summer, an edict stated: 'The Han system promotes kinship to manifest respect for superiors.",
              "idiomatic": "In the fourth month of summer, an imperial edict declared: 'The Han dynasty system honors relatives to demonstrate respect for superiors.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "定陶恭皇之號不宜復稱定陶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Emperor Gong of Dingtao's designation should not again be called Dingtao.",
              "idiomatic": "The title of Emperor Gong of Dingtao should no longer include the name Dingtao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "尊恭皇太后曰帝太太后，稱永信宮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Honor Empress Dowager Gong as Imperial Grand Empress Dowager, called the Yongxin Palace;",
              "idiomatic": "Empress Dowager Gong shall be honored as Imperial Grand Empress Dowager, residing in the Yongxin Palace;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "恭皇后曰帝太后，稱中安宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Empress Gong shall be called Imperial Empress Dowager, called the Zhong'an Palace.",
              "idiomatic": "Empress Gong shall be honored as Imperial Empress Dowager, residing in the Zhong'an Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "立恭皇廟于京師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Establish Emperor Gong's temple in the capital.",
              "idiomatic": "A temple for Emperor Gong shall be established in the capital.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "赦天下徒。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grant amnesty to convicts throughout the realm.'",
              "idiomatic": "All prisoners throughout the empire shall be granted amnesty.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fourth month of summer, an imperial edict declared: 'The Han dynasty system honors relatives to demonstrate respect for superiors. The title of Emperor Gong of Dingtao should no longer include the name Dingtao. Empress Dowager Gong shall be honored as Imperial Grand Empress Dowager, residing in the Yongxin Palace; Empress Gong shall be honored as Imperial Empress Dowager, residing in the Zhong'an Palace. A temple for Emperor Gong shall be established in the capital. All prisoners throughout the empire shall be granted amnesty.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0080",
          "zh": "罷州牧，復刺史。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Abolish provincial governors, restore inspectors.",
              "idiomatic": "The office of provincial governor was abolished and the office of inspector was restored.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The office of provincial governor was abolished and the office of inspector was restored.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0081",
          "zh": "六月庚申，帝太后丁氏崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month, on the day gengshen, Imperial Empress Dowager Ding passed away.",
              "idiomatic": "In the sixth month, on the day gengshen, Imperial Empress Dowager Ding died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "上曰：「朕聞夫婦一體。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The emperor said: 'I have heard that husband and wife are one body.",
              "idiomatic": "The emperor declared: 'I have heard that husband and wife are one flesh.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "《詩》云：『穀則異室，死則同穴。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Odes say: \"While alive they dwell in separate chambers, in death they share the same tomb.\"",
              "idiomatic": "The Book of Odes states: \"In life they occupy different rooms, in death they share one grave.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "昔季武子成寑，杜氏之殯在西階下，請合葬而許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Formerly Ji Wuzi completed his sleeping arrangements, the Du family's coffin was at the western steps, he requested joint burial and it was permitted.",
              "idiomatic": "In ancient times, when Ji Wuzi had completed his funeral preparations, the coffin of his wife from the Du family lay at the western steps. He requested joint burial and was granted permission.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "附葬之禮，自周興焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The rite of joint burial arose from the Zhou dynasty.",
              "idiomatic": "The practice of joint burial originated with the Zhou dynasty.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "『郁郁乎文哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'How cultured and refined!",
              "idiomatic": "'How elegant and civilized!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "吾從周。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I follow the Zhou.'",
              "idiomatic": "I shall follow the Zhou tradition.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "孝子事亡如事存。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "A filial son serves the deceased as if serving the living.",
              "idiomatic": "A dutiful son honors the dead as he would honor the living.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "帝太后宜起陵恭皇之園。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Imperial Empress Dowager should have her tomb raised in Emperor Gong's park.'",
              "idiomatic": "The Imperial Empress Dowager should be buried in the grounds of Emperor Gong's tomb.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "遂葬定陶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thereupon she was buried in Dingtao.",
              "idiomatic": "She was accordingly buried in Dingtao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "發陳留、濟陰近郡國五萬人穿復土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He mobilized fifty thousand people from nearby commanderies and states of Chenliu and Jiyin to dig and cover the earth.",
              "idiomatic": "Fifty thousand laborers were mobilized from the nearby commanderies of Chenliu and Jiyin to excavate and complete the tomb.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth month, on the day gengshen, Imperial Empress Dowager Ding died. The emperor declared: 'I have heard that husband and wife are one flesh. The Book of Odes states: \"In life they occupy different rooms, in death they share one grave.\" In ancient times, when Ji Wuzi had completed his funeral preparations, the coffin of his wife from the Du family lay at the western steps. He requested joint burial and was granted permission. The practice of joint burial originated with the Zhou dynasty. 'How elegant and civilized! I shall follow the Zhou tradition.' A dutiful son honors the dead as he would honor the living. The Imperial Empress Dowager should be buried in the grounds of Emperor Gong's tomb.' She was accordingly buried in Dingtao. Fifty thousand laborers were mobilized from the nearby commanderies of Chenliu and Jiyin to excavate and complete the tomb.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0092",
          "zh": "七月，以渭城西北原上永陵亭部為初陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventh month, he established the Yongling pavilion section on the plain northwest of Weicheng as the preliminary tomb.",
              "idiomatic": "In the seventh month, the area around Yongling pavilion on the plain northwest of Weicheng was designated as the preliminary imperial tomb.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "勿徙郡國民，使得自安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Do not relocate the people of commanderies and states, allowing them to settle themselves.",
              "idiomatic": "The people of the commanderies and principalities should not be relocated, allowing them to remain in their homes.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the seventh month, the area around Yongling pavilion on the plain northwest of Weicheng was designated as the preliminary imperial tomb. The people of the commanderies and principalities should not be relocated, allowing them to remain in their homes.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0094",
          "zh": "八月，詔曰：「時詔夏賀良等建言改元易號，增益漏刻，可以永安國家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighth month, an edict stated: 'At the time I ordered Xia Helang and others to propose changing the era name and designation, increasing the water clock periods, believing it could permanently secure the state.",
              "idiomatic": "In the eighth month, an imperial edict declared: 'Previously I commanded Xia Helang and others to propose changing the reign title and extending the calendar periods, believing this would bring lasting stability to the nation.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "朕過聽賀良等言，冀為海內獲福，卒亡嘉應。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I mistakenly listened to Helang and others' words, hoping to obtain blessings for all within the seas, but in the end there was no auspicious response.",
              "idiomatic": "I erroneously heeded the words of Helang and his associates, hoping to bring blessings to the entire realm, but ultimately received no favorable signs.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "皆違經背古，不合時宜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All of these contravene the classics and oppose antiquity, not conforming to what is appropriate for the times.",
              "idiomatic": "All these proposals violate the classics and contradict ancient precedents, failing to suit the current era.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "六月甲子制書，非赦令也，皆蠲除之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The edict of the jiazi day in the sixth month was not an amnesty decree; all of them are to be remitted and eliminated.",
              "idiomatic": "The imperial order issued on the jiazi day of the sixth month was not a pardon; all such measures are to be rescinded.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "賀良等反道惑眾，下有司。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Helang and others go against the Way and delude the masses; send them to the officials.'",
              "idiomatic": "Helang and his associates defy moral principles and mislead the people; turn them over to the authorities.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "皆伏辜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All submitted to their punishment.",
              "idiomatic": "All were executed for their crimes.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the eighth month, an imperial edict declared: 'Previously I commanded Xia Helang and others to propose changing the reign title and extending the calendar periods, believing this would bring lasting stability to the nation. I erroneously heeded the words of Helang and his associates, hoping to bring blessings to the entire realm, but ultimately received no favorable signs. All these proposals violate the classics and contradict ancient precedents, failing to suit the current era. The imperial order issued on the jiazi day of the sixth month was not a pardon; all such measures are to be rescinded. Helang and his associates defy moral principles and mislead the people; turn them over to the authorities.' All were executed for their crimes.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0100",
          "zh": "丞相博、御史大夫玄、孔鄉侯晏有罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chancellor Bo, Chamberlain for the Palace Revenues Xuan, and Marquis Kongxiang Yan had crimes.",
              "idiomatic": "Chancellor Bo, Chamberlain Xuan, and Marquis Yan of Kongxiang were found guilty of offenses.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "博自殺，玄減死二等論，晏削戶四分之一。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bo committed suicide, Xuan was sentenced two degrees below death, Yan had one quarter of his households reduced.",
              "idiomatic": "Bo committed suicide. Xuan was sentenced to two degrees less than execution. Yan had one-quarter of his fief reduced.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "語在博傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The account is in Bo's biography.",
              "idiomatic": "The full story is told in Bo's biography.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Chancellor Bo, Chamberlain Xuan, and Marquis Yan of Kongxiang were found guilty of offenses. Bo committed suicide. Xuan was sentenced to two degrees less than execution. Yan had one-quarter of his fief reduced. The full story is told in Bo's biography.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "三年春正月，立廣德夷王弟廣漢為廣平王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the first month of spring of the third year, he established King Yi of Guangde's younger brother Guanghan as King of Guangping.",
              "idiomatic": "In the first month of spring of the third year, King Yi of Guangde's younger brother Guanghan was installed as King of Guangping.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first month of spring of the third year, King Yi of Guangde's younger brother Guanghan was installed as King of Guangping.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "癸卯，帝太太后所居桂宮正殿火。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the day guimao, fire in the main hall of the Gui Palace where Imperial Grand Empress Dowager resided.",
              "idiomatic": "On the day guimao, a fire broke out in the main hall of the Gui Palace, residence of the Imperial Grand Empress Dowager.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the day guimao, a fire broke out in the main hall of the Gui Palace, residence of the Imperial Grand Empress Dowager.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0105",
          "zh": "三月己酉，丞相當薨。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month, on the day jiyou, Chancellor Shang passed away.",
              "idiomatic": "In the third month, on the day jiyou, Chancellor Shang died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "有星孛于河鼓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "There was a comet in the River Drum constellation.",
              "idiomatic": "A comet appeared in the constellation of the River Drum.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, on the day jiyou, Chancellor Shang died. A comet appeared in the constellation of the River Drum.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "夏六月，立魯頃王子郚鄉侯閔為王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month of summer, he established King Kuang of Lu's son Marquis Wuxiang Min as king.",
              "idiomatic": "In the sixth month of summer, King Kuang of Lu's son, Marquis Min of Wuxiang, was installed as king.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth month of summer, King Kuang of Lu's son, Marquis Min of Wuxiang, was installed as king.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "冬十一月壬子，復甘泉泰畤、汾陰后土祠，罷南北郊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eleventh month of winter, on the day renzi, he restored the Ganquan Grand Altar and Fenyin Queen of Earth shrine, abolished the northern and southern suburbs.",
              "idiomatic": "In the eleventh month of winter, on the day renzi, the Grand Altar at Ganquan and the shrine to the Queen of Earth at Fenyin were restored, while the northern and southern suburban altars were abolished.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the eleventh month of winter, on the day renzi, the Grand Altar at Ganquan and the shrine to the Queen of Earth at Fenyin were restored, while the northern and southern suburban altars were abolished.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "東平王雲、雲后謁、安成恭侯夫人放皆有罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Yun of Dongping, Yun's consort Ye, and the wife of Marquis Gong of Ancheng Fang all had crimes.",
              "idiomatic": "King Yun of Dongping, his consort Ye, and the wife of Marquis Gong of Ancheng, Lady Fang, were all found guilty of offenses.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "雲自殺，謁、放棄市。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yun committed suicide, Ye and Fang were executed in the market.",
              "idiomatic": "Yun committed suicide. Ye and Fang were publicly executed.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Yun of Dongping, his consort Ye, and the wife of Marquis Gong of Ancheng, Lady Fang, were all found guilty of offenses. Yun committed suicide. Ye and Fang were publicly executed.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0111",
          "zh": "四年春，大旱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the fourth year, great drought.",
              "idiomatic": "In the spring of the fourth year, a severe drought occurred.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "關東民傳行西王母籌，經歷郡國，西入關至京師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people east of the passes transmitted and circulated Queen Mother of the West tallies, passing through commanderies and states, entering the western pass to the capital.",
              "idiomatic": "People east of the passes circulated divining tallies from the Queen Mother of the West, traveling through various commanderies and states, entering the western pass to reach the capital.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "民又會聚祠西王母，或夜持火上屋，擊鼓號呼相驚恐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people also gathered in groups to sacrifice to the Queen Mother of the West, or at night held fire on rooftops, beat drums and shouted to terrify each other.",
              "idiomatic": "The people also gathered in crowds to worship the Queen Mother of the West, or carried torches onto rooftops at night, beating drums and shouting to frighten one another.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the spring of the fourth year, a severe drought occurred. People east of the passes circulated divining tallies from the Queen Mother of the West, traveling through various commanderies and states, entering the western pass to reach the capital. The people also gathered in crowds to worship the Queen Mother of the West, or carried torches onto rooftops at night, beating drums and shouting to frighten one another.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0114",
          "zh": "二月，封帝太太后從弟侍中傅商為汝昌侯，太后同母弟子侍中鄭業為陽信侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the second month, he enfeoffed Imperial Grand Empress Dowager's younger cousin Chamberlain Fu Shang as Marquis of Ruchang, and Empress Dowager's uterine younger brother Chamberlain Zheng Ye as Marquis of Yangxin.",
              "idiomatic": "In the second month, the emperor enfeoffed the Imperial Grand Empress Dowager's younger cousin, Chamberlain Fu Shang, as Marquis of Ruchang, and the Empress Dowager's uterine younger brother, Chamberlain Zheng Ye, as Marquis of Yangxin.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the second month, the emperor enfeoffed the Imperial Grand Empress Dowager's younger cousin, Chamberlain Fu Shang, as Marquis of Ruchang, and the Empress Dowager's uterine younger brother, Chamberlain Zheng Ye, as Marquis of Yangxin.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "三月，侍中駙馬都尉董賢、光祿大夫息夫躬、南陽太守孫寵皆以告東平王封列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month, Chamberlain Commandant of the Imperial Stables Dong Xian, Gentleman of the Interior Xi Fu Gong, and Nanyang governor Sun Chong were all enfeoffed as marquises for informing on King Dongping.",
              "idiomatic": "In the third month, Chamberlain Dong Xian (Commandant of the Imperial Stables), Gentleman Xi Fu Gong, and Governor Sun Chong of Nanyang were all enfeoffed as marquises for reporting on King Dongping.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "語在賢傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The account is in Xian's biography.",
              "idiomatic": "The full story is told in Xian's biography.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, Chamberlain Dong Xian (Commandant of the Imperial Stables), Gentleman Xi Fu Gong, and Governor Sun Chong of Nanyang were all enfeoffed as marquises for reporting on King Dongping. The full story is told in Xian's biography.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0117",
          "zh": "夏五月，賜中二千石至六百石及天下男子爵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month of summer, he bestowed noble ranks on officials from middle two thousand bushels down to six hundred bushels and on all males throughout the realm.",
              "idiomatic": "In the fifth month of summer, noble titles were granted to officials ranging from mid-level bureaucrats down to those of six hundred bushels rank, as well as to all men throughout the empire.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth month of summer, noble titles were granted to officials ranging from mid-level bureaucrats down to those of six hundred bushels rank, as well as to all men throughout the empire.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0118",
          "zh": "六月，尊帝太太后為皇太太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month, he honored the Imperial Grand Empress Dowager as Grand Empress Dowager.",
              "idiomatic": "In the sixth month, the Imperial Grand Empress Dowager was elevated to the title of Grand Empress Dowager.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth month, the Imperial Grand Empress Dowager was elevated to the title of Grand Empress Dowager.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0119",
          "zh": "秋八月，恭皇園北門災。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighth month of autumn, disaster at the north gate of Emperor Gong's park.",
              "idiomatic": "In the eighth month of autumn, a calamity struck the north gate of Emperor Gong's tomb grounds.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the eighth month of autumn, a calamity struck the north gate of Emperor Gong's tomb grounds.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0120",
          "zh": "冬，詔將軍、中二千石舉明兵法有大慮者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In winter, an edict ordered generals and officials of middle two thousand bushels to recommend those who understand military strategy and have great strategic vision.",
              "idiomatic": "In winter, an imperial edict commanded generals and mid-level officials to recommend individuals skilled in military tactics who possess strategic foresight.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In winter, an imperial edict commanded generals and mid-level officials to recommend individuals skilled in military tactics who possess strategic foresight.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0121",
          "zh": "丁巳，皇太太后傅氏崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the day dingsi, Grand Empress Dowager Fu passed away.",
              "idiomatic": "On the day dingsi, Grand Empress Dowager Fu died.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the day dingsi, Grand Empress Dowager Fu died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "三月，丞相嘉有罪，下獄死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month, Chancellor Jia had crimes, was imprisoned and died.",
              "idiomatic": "In the third month, Chancellor Jia was found guilty of offenses, imprisoned, and died.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, Chancellor Jia was found guilty of offenses, imprisoned, and died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "秋九月，大司馬票騎將軍丁明免。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the ninth month of autumn, Grand Commandant General of Chariots and Cavalry Ding Ming was dismissed.",
              "idiomatic": "In the ninth month of autumn, Grand Commandant Ding Ming was relieved of his position.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the ninth month of autumn, Grand Commandant Ding Ming was relieved of his position.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0124",
          "zh": "孝元廟殿門銅龜蛇鋪首鳴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The copper turtle-snake door knockers on the temple hall gate of Filial Emperor Yuan made sound.",
              "idiomatic": "The copper turtle-serpent door knockers on the gate of Emperor Yuan's temple hall rang out.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The copper turtle-serpent door knockers on the gate of Emperor Yuan's temple hall rang out.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "二年春正月，匈奴單于、烏孫大昆彌來朝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the first month of spring of the second year, the Xiongnu Chanyu and Wusun Great Kunmi came to court.",
              "idiomatic": "In the first month of spring of the second year, the Xiongnu chanyu and the Wusun great kunmi paid court visits.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "二月，歸國，單于不說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the second month, they returned to their countries; the Chanyu was not pleased.",
              "idiomatic": "In the second month, they returned to their homelands, but the chanyu was dissatisfied.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "語在匈奴傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The account is in the Xiongnu biography.",
              "idiomatic": "The full story is told in the biography of the Xiongnu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first month of spring of the second year, the Xiongnu chanyu and the Wusun great kunmi paid court visits. In the second month, they returned to their homelands, but the chanyu was dissatisfied. The full story is told in the biography of the Xiongnu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0128",
          "zh": "夏四月壬辰晦，日有蝕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth month of summer, on the last day renchen, there was an eclipse of the sun.",
              "idiomatic": "In the fourth month of summer, on the last day (renchen), a solar eclipse occurred.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fourth month of summer, on the last day (renchen), a solar eclipse occurred.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "五月，正三公官分職。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month, he corrected the Three Excellencies offices and divided their duties.",
              "idiomatic": "In the fifth month, the offices of the Three Excellencies were reorganized and their responsibilities clarified.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "大司馬衛將軍董賢為大司馬，丞相孔光為大司徒，御史大夫彭宣為大司空，封長平侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Commandant Guard General Dong Xian became Grand Commandant, Chancellor Kong Guang became Grand Minister of Works, Chamberlain for the Palace Revenues Peng Xuan became Grand Minister of Agriculture, and was enfeoffed as Marquis of Changping.",
              "idiomatic": "Guard General Dong Xian was appointed Grand Commandant; Chancellor Kong Guang became Grand Minister of Works; Chamberlain Peng Xuan became Grand Minister of Agriculture and was enfeoffed as Marquis of Changping.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "正司直、司隸，造司寇職，事未定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He corrected the offices of Superintendent of Trials and Metropolitan Superintendent, created the office of Minister of Justice; the matter was not settled.",
              "idiomatic": "The offices of Superintendent of Trials and Metropolitan Superintendent were reorganized, and a new Minister of Justice position was created, though the arrangements remained unsettled.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth month, the offices of the Three Excellencies were reorganized and their responsibilities clarified. Guard General Dong Xian was appointed Grand Commandant; Chancellor Kong Guang became Grand Minister of Works; Chamberlain Peng Xuan became Grand Minister of Agriculture and was enfeoffed as Marquis of Changping. The offices of Superintendent of Trials and Metropolitan Superintendent were reorganized, and a new Minister of Justice position was created, though the arrangements remained unsettled.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0132",
          "zh": "六月戊午，帝崩于未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month, on the day wuwu, the emperor passed away in the Weiyang Palace.",
              "idiomatic": "In the sixth month, on the day wuwu, the emperor died in the Weiyang Palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "秋九月壬寅，葬義陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the ninth month of autumn, on the day renyin, he was buried in the Yiling tomb.",
              "idiomatic": "In the ninth month of autumn, on the day renyin, he was interred in the Yiling tomb.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth month, on the day wuwu, the emperor died in the Weiyang Palace. In the ninth month of autumn, on the day renyin, he was interred in the Yiling tomb.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0134",
          "zh": "贊曰：孝哀自為藩王及充太子之宮，文辭博敏，幼有令聞。",
          "translations": [
            {
              "lang": "en",
              "literal": "Appraisal says: Filial and Lamented, from being a feudal king and filling the position of Crown Prince, had broad and quick literary compositions, from youth had excellent reputation.",
              "idiomatic": "Appraisal: Emperor Ai, from his time as a feudal king to his tenure as Crown Prince, displayed extensive and nimble literary skills, earning an excellent reputation from his youth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "睹孝成世祿去王室，權柄外移，是故臨朝婁誅大臣，欲彊主威，以則武、宣。",
          "translations": [
            {
              "lang": "en",
              "literal": "He observed that in the generation of Filial Cheng, emoluments departed from the imperial house, authority shifted outward, therefore upon ascending the throne he frequently executed ministers, desiring to strengthen imperial authority, to follow Wu and Xuan.",
              "idiomatic": "Witnessing how in Emperor Cheng's era, hereditary stipends left the imperial family and power shifted to outsiders, he frequently executed ministers upon ascending the throne, seeking to strengthen imperial authority and emulate Emperors Wu and Xuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "雅性不好聲色，時覽卞射武戲。",
          "translations": [
            {
              "lang": "en",
              "literal": "His elegant nature did not favor music and sex; he occasionally viewed archery and martial displays.",
              "idiomatic": "His refined character showed no interest in music or sensual pleasures; he occasionally enjoyed watching archery contests and martial demonstrations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "即位痿痺，末年寖劇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upon ascending the throne he had flaccid paralysis; in his final years it gradually worsened.",
              "idiomatic": "Upon ascending the throne, he suffered from paralysis; in his later years, the condition steadily deteriorated.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "饗國不永，哀哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He enjoyed the state not for long; alas!",
              "idiomatic": "His reign over the nation was brief; alas!",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Appraisal: Emperor Ai, from his time as a feudal king to his tenure as Crown Prince, displayed extensive and nimble literary skills, earning an excellent reputation from his youth. Witnessing how in Emperor Cheng's era, hereditary stipends left the imperial family and power shifted to outsiders, he frequently executed ministers upon ascending the throne, seeking to strengthen imperial authority and emulate Emperors Wu and Xuan. His refined character showed no interest in music or sensual pleasures; he occasionally enjoyed watching archery contests and martial demonstrations. Upon ascending the throne, he suffered from paralysis; in his later years, the condition steadily deteriorated. His reign over the nation was brief; alas!",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}