{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "002",
    "url": "https://chinesenotes.com/shiji/shiji002.html",
    "title": {
      "zh": "夏本紀",
      "en": "Annals of Xia",
      "raw": "《夏本紀》 Annals of Xia"
    },
    "sentenceCount": 258,
    "translatedCount": 258,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:18.368Z",
    "translators": [
      {
        "name": "Herbert J. Allen (1894)",
        "paragraphs": 34,
        "sentences": 253
      },
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 1,
        "sentences": 5
      }
    ],
    "citation": "Translation: Partial translation by Herbert J. Allen (1894); remaining portions by Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "夏禹，名曰文命。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu of Xia was styled Wenming.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "禹之父曰鯀，鯀之父曰帝顓頊，顓頊之父曰昌意，昌意之父曰黃帝。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu's father was Gun, whose father was the Emperor Zhuanxu, whose father was Changyi, whose father was Huangdi;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "禹者，黃帝之玄孫而帝顓頊之孫也。",
          "translations": [
            {
              "lang": "en",
              "text": "so Yu was Huangdi's great-great-grandson, and Zhuanxu's grandson.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "禹之曾大父昌意及父鯀皆不得在帝位，為人臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu's great-grandfather Changyi and his father Gun were both unable to sit on the Imperial throne, being simply officials.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yu of Xia was styled Wenming. Yu's father was Gun, whose father was the Emperor Zhuanxu, whose father was Changyi, whose father was Huangdi; so Yu was Huangdi's great-great-grandson, and Zhuanxu's grandson. Yu's great-grandfather Changyi and his father Gun were both unable to sit on the Imperial throne, being simply officials.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0005",
          "zh": "當帝堯之時，鴻水滔天，浩浩懷山襄陵，下民其憂。",
          "translations": [
            {
              "lang": "en",
              "text": "In the time of the Emperor Yao the deluge assailed the heavens, and in its vast expanse encompassed the mountains, and overtopped the hills,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "堯求能治水者，群臣四嶽皆曰鯀可。",
          "translations": [
            {
              "lang": "en",
              "text": "so that the common people were troubled about it. Yao sought for one capable of controlling the waters. All the officials and presidents of the four mountains said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "堯曰：「鯀為人負命毀族，不可。」",
          "translations": [
            {
              "lang": "en",
              "text": "Gun might do it.' Yao said, 'Gun is a man who disobeys orders, and ruins his companions.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "四嶽曰：「等之未有賢於鯀者，願帝試之。」",
          "translations": [
            {
              "lang": "en",
              "text": "He will not do.' The president of the four mountains said, 'Among his equals there is no one so worthy as Gun;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "於是堯聽四嶽，用鯀治水。",
          "translations": [
            {
              "lang": "en",
              "text": "I wish your Majesty would try him.' Upon which Yao, giving heed to the president of the four mountains,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "九年而水不息，功用不成。",
          "translations": [
            {
              "lang": "en",
              "text": "employed Gun to control the waters for nine years, but the waters did not abate,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "於是帝堯乃求人，更得舜。",
          "translations": [
            {
              "lang": "en",
              "text": "and the work was unaccomplished. Then the Emperor Yao sought a man in his stead,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "舜登用，攝行天子之政，巡狩。",
          "translations": [
            {
              "lang": "en",
              "text": "and secured Shun. Shun being employed in the public service was associated with the Son of Heaven in the administration.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "行視鯀之治水無狀，乃殛鯀於羽山以死。",
          "translations": [
            {
              "lang": "en",
              "text": "While on a tour of inspection, he saw that there was no evidence that Gun kept the waters under control,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "天下皆以舜之誅為是。",
          "translations": [
            {
              "lang": "en",
              "text": "so he imprisoned him for life on Mount Yu, and everyone in the Empire said that Shun's decision was a just one.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "於是舜舉鯀子禹，而使續鯀之業。",
          "translations": [
            {
              "lang": "en",
              "text": "Shun then appointed Gun's son Yu to the post, and directed him to continue his father's occupation.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In the time of the Emperor Yao the deluge assailed the heavens, and in its vast expanse encompassed the mountains, and overtopped the hills, so that the common people were troubled about it. Yao sought for one capable of controlling the waters. All the officials and presidents of the four mountains said, 'Gun might do it.' Yao said, 'Gun is a man who disobeys orders, and ruins his companions. He will not do.' The president of the four mountains said, 'Among his equals there is no one so worthy as Gun; I wish your Majesty would try him.' Upon which Yao, giving heed to the president of the four mountains, employed Gun to control the waters for nine years, but the waters did not abate, and the work was unaccomplished. Then the Emperor Yao sought a man in his stead, and secured Shun. Shun being employed in the public service was associated with the Son of Heaven in the administration. While on a tour of inspection, he saw that there was no evidence that Gun kept the waters under control, so he imprisoned him for life on Mount Yu, and everyone in the Empire said that Shun's decision was a just one. Shun then appointed Gun's son Yu to the post, and directed him to continue his father's occupation.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0016",
          "zh": "堯崩，帝舜問四嶽曰：「有能成美堯之事者使居官？」",
          "translations": [
            {
              "lang": "en",
              "text": "After Yao's death,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "皆曰：「伯禹為司空，可成美堯之功。」",
          "translations": [
            {
              "lang": "en",
              "text": "the Emperor Shun asked the presidents of the four mountains,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "舜曰：「嗟，然！」",
          "translations": [
            {
              "lang": "en",
              "text": "is there was any one who can perfect and develop Yao's undertakings,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "命禹：「女平水土，維是勉之。」",
          "translations": [
            {
              "lang": "en",
              "text": "and can be employed in an official capacity?' They all said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "禹拜稽首，讓於契、后稷、皋陶。",
          "translations": [
            {
              "lang": "en",
              "text": "There is lord Yu,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "舜曰：「女其往視爾事矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "the Minister of Works; he might perfect and develop Yao's labours.' Shun said,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After Yao's death, the Emperor Shun asked the presidents of the four mountains, 'is there was any one who can perfect and develop Yao's undertakings, and can be employed in an official capacity?' They all said, 'There is lord Yu, the Minister of Works; he might perfect and develop Yao's labours.' Shun said, 'Ah yes! you, Yu, have regulated the water and the land, but in this office you must exert yourself.' Yu did obeisance with his head to the ground, and would have declined in favour of Xie, Prince Millet, or Gaoyao, but Shun said 'Go and attend to your duties.'",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0023",
          "zh": "禹為人敏給克勤；",
          "translations": [
            {
              "lang": "en",
              "text": "Yu was quick, earnest, and diligent, not deviating from virtue, kind,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "其德不違，其仁可親，其言可信；",
          "translations": [
            {
              "lang": "en",
              "text": "and lovable; his word could be depended on, his voice was musical,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "聲為律，身為度，稱以出；",
          "translations": [
            {
              "lang": "en",
              "text": "and his body, like a balance properly adjusted,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "亹亹穆穆，為綱為紀。",
          "translations": [
            {
              "lang": "en",
              "text": "moved unweariedly and solemnly in accordance with certain fixed rules.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yu was quick, earnest, and diligent, not deviating from virtue, kind, and lovable; his word could be depended on, his voice was musical, and his body, like a balance properly adjusted, moved unweariedly and solemnly in accordance with certain fixed rules.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "禹乃遂與益、后稷奉帝命，命諸侯百姓興人徒以傅土，行山表木，定高山大川。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu, then in company with Yi and Prince Millet, having received the Emperor's orders, bade the princes and people raise a gang of men to make a division of the land, and following the line of the hills hew down the trees, and determine the characteristics of the high hills and great rivers. Yu was grieved in that his progenitor Gun had been punished on account of his work being incomplete,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "禹傷先人父鯀功之不成受誅，乃勞身焦思，居外十三年，過家門不敢入。",
          "translations": [
            {
              "lang": "en",
              "text": "so, wearied in body and distressed in mind, he lived away from his home for 13 years, passing the door of his house without daring to enter. With ragged clothes and poor diet he paid his devotions to the spirits until his wretched hovel fell in ruins in the ditch. When travelling along the dry land he used a carriage, on the water he used a boat, in miry places a sledge, while in going over the hills he used spikes.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "薄衣食，致孝于鬼神。",
          "translations": [
            {
              "lang": "en",
              "text": "On the one hand he used the marking-line, and on the other the compass and square. Working as the seasons permitted,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "卑宮室，致費於溝淢。",
          "translations": [
            {
              "lang": "en",
              "text": "and with a view to open up the nine provinces, he made the roads communicable, banked up the marshes,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "陸行乘車，水行乘船，泥行乘橇，山行乘檋。",
          "translations": [
            {
              "lang": "en",
              "text": "surveyed the hills, told Yi and his band that paddy should be planted in low damp places,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "左準繩，右規矩，載四時，以開九州，通九道，陂九澤，度九山。",
          "translations": [
            {
              "lang": "en",
              "text": "and directed Lord Millet and his band, when it was difficult to obtain food,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "令益予眾庶稻，可種卑溼。",
          "translations": [
            {
              "lang": "en",
              "text": "or when food was scarce,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "命后稷予眾庶難得之食。",
          "translations": [
            {
              "lang": "en",
              "text": "to barter their surplus stock in exchange for what they had not,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "食少，調有餘相給，以均諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "so as to put all the princes on an equal footing.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "禹乃行相地宜所有以貢，及山川之便利。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu in this way worked for the mutual convenience of the respective districts as regards the distribution of the wealth and resources of the country.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yu, then in company with Yi and Prince Millet, having received the Emperor's orders, bade the princes and people raise a gang of men to make a division of the land, and following the line of the hills hew down the trees, and determine the characteristics of the high hills and great rivers. Yu was grieved in that his progenitor Gun had been punished on account of his work being incomplete, so, wearied in body and distressed in mind, he lived away from his home for 13 years, passing the door of his house without daring to enter. With ragged clothes and poor diet he paid his devotions to the spirits until his wretched hovel fell in ruins in the ditch. When travelling along the dry land he used a carriage, on the water he used a boat, in miry places a sledge, while in going over the hills he used spikes. On the one hand he used the marking-line, and on the other the compass and square. Working as the seasons permitted, and with a view to open up the nine provinces, he made the roads communicable, banked up the marshes, surveyed the hills, told Yi and his band that paddy should be planted in low damp places, and directed Lord Millet and his band, when it was difficult to obtain food, or when food was scarce, to barter their surplus stock in exchange for what they had not, so as to put all the princes on an equal footing. Yu in this way worked for the mutual convenience of the respective districts as regards the distribution of the wealth and resources of the country.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "禹行自冀州始。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu started from Jizhou.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "冀州：既載壺口，治梁及岐。",
          "translations": [
            {
              "lang": "en",
              "text": "He commenced his work in Jizhou at Pot's mouth, and regulated the country about the Liang and Qi mountains.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "既修太原，至于嶽陽。",
          "translations": [
            {
              "lang": "en",
              "text": "Having repaired the works at Taiyuan he went to the south of Mount Yue.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "覃懷致功，至於衡漳。",
          "translations": [
            {
              "lang": "en",
              "text": "He was successful with his labours at Tanhuai, and went to the cross-flowing stream of Zhang.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "其土白壤。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of the province was white clay.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "賦上上錯，田中中，常、衛既從，大陸既為。",
          "translations": [
            {
              "lang": "en",
              "text": "Its contribution of revenue was the first of the highest class with some admixture of the second, while its fields were the average of the middle class.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "鳥夷皮服。",
          "translations": [
            {
              "lang": "en",
              "text": "The Chang and Wei rivers flowed in their proper channels, and the Dalu plain was formed.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "夾右碣石，入于海。",
          "translations": [
            {
              "lang": "en",
              "text": "The bird barbarians, wearing skin dresses, kept close on the right to the granite rocks until they came to the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yu started from Jizhou. He commenced his work in Jizhou at Pot's mouth, and regulated the country about the Liang and Qi mountains. Having repaired the works at Taiyuan he went to the south of Mount Yue. He was successful with his labours at Tanhuai, and went to the cross-flowing stream of Zhang. The soil of the province was white clay. Its contribution of revenue was the first of the highest class with some admixture of the second, while its fields were the average of the middle class. The Chang and Wei rivers flowed in their proper channels, and the Dalu plain was formed. The bird barbarians, wearing skin dresses, kept close on the right to the granite rocks until they came to the sea.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0045",
          "zh": "濟、河維沇州：九河既道，雷夏既澤，雍、沮會同，桑土既蠶，於是民得下丘居土。",
          "translations": [
            {
              "lang": "en",
              "text": "The Qi and Yellow rivers formed the boundaries of Yanzhou. The nine branches of the Yellow river followed their courses, and Lei Xia was a marsh, in which the Yong and Ju streams were united. The mulberry region was supplied with silkworms, and then the people came down from the heights and occupied it.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "其土黑墳，草繇木條。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of the province was black loam, its herbage luxuriant, and trees tall. Its fields were the lowest of the middle class.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "田中下，賦貞，作十有三年乃同。",
          "translations": [
            {
              "lang": "en",
              "text": "Its contribution of revenue was fixed at what would just be deemed the correct amount, and after it had been worked for 13 years it was assimilated to the other provinces.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "其貢漆絲，其篚織文。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of varnish and silk, and woven ornamental fabrics in baskets.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "浮於濟、漯，通於河。",
          "translations": [
            {
              "lang": "en",
              "text": "You float along the Qi and Ta and so reach the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Qi and Yellow rivers formed the boundaries of Yanzhou. The nine branches of the Yellow river followed their courses, and Lei Xia was a marsh, in which the Yong and Ju streams were united. The mulberry region was supplied with silkworms, and then the people came down from the heights and occupied it. The soil of the province was black loam, its herbage luxuriant, and trees tall. Its fields were the lowest of the middle class. Its contribution of revenue was fixed at what would just be deemed the correct amount, and after it had been worked for 13 years it was assimilated to the other provinces. Its tribute consisted of varnish and silk, and woven ornamental fabrics in baskets. You float along the Qi and Ta and so reach the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0050",
          "zh": "海岱維青州：堣夷既略，濰、淄其道。",
          "translations": [
            {
              "lang": "en",
              "text": "The sea and the Tai mountain formed the boundaries of Qingzhou.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "其土白墳，海濱廣潟，厥田斥鹵。",
          "translations": [
            {
              "lang": "en",
              "text": "The territory of Yuyi was defined, and the Wei and Zi rivers flowed in their proper channels. The soil of the province was white loam, and on the sea-coast were wide tracts of salt land.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "田上下，賦中上。",
          "translations": [
            {
              "lang": "en",
              "text": "Its fields, which were impregnated with salt, were the lowest of the first class, and its contribution of revenue the highest of the second.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "厥貢鹽絺，海物維錯，岱畎絲、枲、鉛、松、怪石，萊夷為牧，其篚酓絲。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of salt, fine cloth of dolichos fibre, and productions of the sea of various kinds, with silk, hemp, lead, pine-trees, and strange stones from the valleys of the Tai. The wild tribes of Lai were shepherds, and brought in their baskets silk from the mountain mulberry.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "浮於汶，通於濟。",
          "translations": [
            {
              "lang": "en",
              "text": "You float down the Wen, and so reach the Qi.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The sea and the Tai mountain formed the boundaries of Qingzhou. The territory of Yuyi was defined, and the Wei and Zi rivers flowed in their proper channels. The soil of the province was white loam, and on the sea-coast were wide tracts of salt land. Its fields, which were impregnated with salt, were the lowest of the first class, and its contribution of revenue the highest of the second. Its tribute consisted of salt, fine cloth of dolichos fibre, and productions of the sea of various kinds, with silk, hemp, lead, pine-trees, and strange stones from the valleys of the Tai. The wild tribes of Lai were shepherds, and brought in their baskets silk from the mountain mulberry. You float down the Wen, and so reach the Qi.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "海岱及淮維徐州：淮、沂其治，蒙、羽其藝。",
          "translations": [
            {
              "lang": "en",
              "text": "The sea, the Tai mountain, and the river Huai formed the boundaries of Xuzhou. The Huai and Yi rivers were regulated. The Meng and Yu mountains were made fit for cultivation. The waters of Daye formed a marsh, and the eastern plain became level.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "大野既都，東原底平。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of this province was red, clayey, and rich.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "其土赤埴墳，草木漸包。",
          "translations": [
            {
              "lang": "en",
              "text": "The grass and trees grew more and more bushy.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "其田上中，賦中中。",
          "translations": [
            {
              "lang": "en",
              "text": "Its fields were the second of the highest class, and its contribution of revenue was the average of the second.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "貢維土五色，羽畎夏狄，嶧陽孤桐，泗濱浮磬，淮夷蠙珠臮魚，其篚玄纖縞。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of earth of different colours, the variegated pheasants from the valleys of mount Yu, the solitary dryandra from the south of mount Yi, and the floating musical stones from the banks of the Si. The wild tribes of the Huai brought oyster-pearls and fish, and their baskets were full of dark embroideries and pure white silken fabrics.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "浮于淮、泗，通于河。",
          "translations": [
            {
              "lang": "en",
              "text": "You float along the Huai and Si and so reach the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The sea, the Tai mountain, and the river Huai formed the boundaries of Xuzhou. The Huai and Yi rivers were regulated. The Meng and Yu mountains were made fit for cultivation. The waters of Daye formed a marsh, and the eastern plain became level. The soil of this province was red, clayey, and rich. The grass and trees grew more and more bushy. Its fields were the second of the highest class, and its contribution of revenue was the average of the second. Its tribute consisted of earth of different colours, the variegated pheasants from the valleys of mount Yu, the solitary dryandra from the south of mount Yi, and the floating musical stones from the banks of the Si. The wild tribes of the Huai brought oyster-pearls and fish, and their baskets were full of dark embroideries and pure white silken fabrics. You float along the Huai and Si and so reach the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "淮海維揚州：彭蠡既都，陽鳥所居。",
          "translations": [
            {
              "lang": "en",
              "text": "The Huai river and the sea formed the boundaries of Yangzhou.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "三江既入，震澤致定。",
          "translations": [
            {
              "lang": "en",
              "text": "The Pengli lake formed a reservoir of water, where the sun birds (i.e. the wild geese) settled.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "竹箭既布。",
          "translations": [
            {
              "lang": "en",
              "text": "The three large rivers entered the sea, and the shaking marsh became quite still.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "其草惟夭，其木惟喬，其土涂泥。",
          "translations": [
            {
              "lang": "en",
              "text": "Bamboos of different kinds were spread about, the grass grew luxuriantly, and the trees tall, but the soil was miry. The fields of this province were the lowest of the lowest class; its contribution of revenue was the highest of the lowest class, with a proportion of the class above.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "田下下，賦下上上雜。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of gold, silver, and copper, jasper, pearls, bamboos of various kinds, ivory, hides, feathers, and hair.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "貢金三品，瑤、琨、竹箭，齒、革、羽、旄，島夷卉服，其篚織貝，其包橘、柚錫貢。",
          "translations": [
            {
              "lang": "en",
              "text": "The wild people of the isles brought garments of grass; their baskets were filled with woven silks and cowries, and their bundles contained small oranges and pummeloes, which were rendered when required.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "均江海，通淮、泗。",
          "translations": [
            {
              "lang": "en",
              "text": "You follow the course of the Great river and the sea, and so reach the Huai and Si rivers.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Huai river and the sea formed the boundaries of Yangzhou. The Pengli lake formed a reservoir of water, where the sun birds (i.e. the wild geese) settled. The three large rivers entered the sea, and the shaking marsh became quite still. Bamboos of different kinds were spread about, the grass grew luxuriantly, and the trees tall, but the soil was miry. The fields of this province were the lowest of the lowest class; its contribution of revenue was the highest of the lowest class, with a proportion of the class above. Its tribute consisted of gold, silver, and copper, jasper, pearls, bamboos of various kinds, ivory, hides, feathers, and hair. The wild people of the isles brought garments of grass; their baskets were filled with woven silks and cowries, and their bundles contained small oranges and pummeloes, which were rendered when required. You follow the course of the Great river and the sea, and so reach the Huai and Si rivers.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "荊及衡陽維荊州：江、漢朝宗于海。",
          "translations": [
            {
              "lang": "en",
              "text": "Mount Jing and the south of Mount Heng formed the boundaries of Jingzhou.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "九江甚中，沱、涔已道，云土、夢為治。",
          "translations": [
            {
              "lang": "en",
              "text": "The Great river and Han rivers paid their court to the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "其土涂泥。",
          "translations": [
            {
              "lang": "en",
              "text": "The nine rivers occupied all the middle of the land. The Tuo and Qian rivers flowed in their proper channels; and the land in the Yun and Meng marshes was made capable of cultivation.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "田下中，賦上下。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of this province was miry; its fields were the average of the lowest class; its contribution of revenue was the lowest of the highest class.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "貢羽、旄、齒、革，金三品，杶、榦、栝、柏，礪、砥、砮、丹，維箘簬、楛，三國致貢其名，包匭菁茅，其篚玄纁璣組，九江入賜大龜。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of feathers, hair, ivory, hides, gold, silver, copper, woods of the wild varnish, cudrania, triloba, juniper, and cypress trees, with grindstones, whetstones, stone arrowheads, and cinnabar, likewise the Jun and Lu bamboos, and the wood of the redthorn, of which the three states brought the most noted specimens. The three ribbed rush was put in cases which were wrapped up, while the baskets were filled with dark and purple silks and strings of coarse pearls.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "浮于江、沱、涔、（于）漢，踰于雒，至于南河。",
          "translations": [
            {
              "lang": "en",
              "text": "From the country of the nine rivers the great tortoise was presented. You float down the Great river, the Tuo, the Qian, and the Han rivers, cross over to the Luo, whence you reach the southern part of the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Mount Jing and the south of Mount Heng formed the boundaries of Jingzhou. The Great river and Han rivers paid their court to the sea. The nine rivers occupied all the middle of the land. The Tuo and Qian rivers flowed in their proper channels; and the land in the Yun and Meng marshes was made capable of cultivation. The soil of this province was miry; its fields were the average of the lowest class; its contribution of revenue was the lowest of the highest class. Its tribute consisted of feathers, hair, ivory, hides, gold, silver, copper, woods of the wild varnish, cudrania, triloba, juniper, and cypress trees, with grindstones, whetstones, stone arrowheads, and cinnabar, likewise the Jun and Lu bamboos, and the wood of the redthorn, of which the three states brought the most noted specimens. The three ribbed rush was put in cases which were wrapped up, while the baskets were filled with dark and purple silks and strings of coarse pearls. From the country of the nine rivers the great tortoise was presented. You float down the Great river, the Tuo, the Qian, and the Han rivers, cross over to the Luo, whence you reach the southern part of the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0074",
          "zh": "荊河惟豫州：伊、雒、瀍、澗既入于河，滎播既都，道荷澤，被明都。",
          "translations": [
            {
              "lang": "en",
              "text": "The Jing mountain and the Yellow river formed the boundaries of Yuzhou. The Yi, the Luo the Chan, and the Jian streams flowed into the Yellow river, the Yingbo waters formed a lake, and the waters of the Ke marsh were conducted to the Ming reservoir.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "其土壤，下土墳壚。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of this province was clayey, while in its lower parts it was rich, and in clods.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "田中上，賦雜上中。",
          "translations": [
            {
              "lang": "en",
              "text": "Its fields were the highest of the middle class; its contribution of revenue was the average of the highest class, with a proportion of the very highest.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "貢漆、絲、絺、紵，其篚纖絮，錫貢磬錯。",
          "translations": [
            {
              "lang": "en",
              "text": "The tribute was varnish, silk, fine cloth of dolichos fibre, and sackcloth. The baskets were filled with delicate embroidery and floss-silk, and stones for polishing musical stones were rendered when required.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "浮於雒，達於河。",
          "translations": [
            {
              "lang": "en",
              "text": "You float along the Luo until you reach the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Jing mountain and the Yellow river formed the boundaries of Yuzhou. The Yi, the Luo the Chan, and the Jian streams flowed into the Yellow river, the Yingbo waters formed a lake, and the waters of the Ke marsh were conducted to the Ming reservoir. The soil of this province was clayey, while in its lower parts it was rich, and in clods. Its fields were the highest of the middle class; its contribution of revenue was the average of the highest class, with a proportion of the very highest. The tribute was varnish, silk, fine cloth of dolichos fibre, and sackcloth. The baskets were filled with delicate embroidery and floss-silk, and stones for polishing musical stones were rendered when required. You float along the Luo until you reach the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "華陽黑水惟梁州：汶、嶓既藝，沱、涔既道，蔡、蒙旅平，和夷厎績。",
          "translations": [
            {
              "lang": "en",
              "text": "The south of Mount Hua and the Blackwater formed the boundaries of Liangzhou. The Min and Bo hills were cultivated. The Tuo and Qian rivers flowed in their channels, sacrifices were offered to the hills Cai and Meng on the plateaux, and the wild tribes on the He river were successfully managed.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "其土青驪。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of the province was bluish black.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "田下上，賦下中三錯。",
          "translations": [
            {
              "lang": "en",
              "text": "Its fields were the highest of the lowest class; its contribution of revenue was the average of the lowest class, with proportions of the rates above and below.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "貢璆、鐵、銀、鏤、砮、磬，熊、羆、狐、貍、織皮。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute consisted of the best gold, iron, silver, steel, stone arrow-heads, musical stones, and nets woven from the hair of bears and foxes.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "西傾因桓是來，浮于潛，踰于沔，入于渭，亂于河。",
          "translations": [
            {
              "lang": "en",
              "text": "From Xiqing you come along the river Huan, float down the Qian, cross over to the Mian, enter the Wei, and ferry across the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The south of Mount Hua and the Blackwater formed the boundaries of Liangzhou. The Min and Bo hills were cultivated. The Tuo and Qian rivers flowed in their channels, sacrifices were offered to the hills Cai and Meng on the plateaux, and the wild tribes on the He river were successfully managed. The soil of the province was bluish black. Its fields were the highest of the lowest class; its contribution of revenue was the average of the lowest class, with proportions of the rates above and below. Its tribute consisted of the best gold, iron, silver, steel, stone arrow-heads, musical stones, and nets woven from the hair of bears and foxes. From Xiqing you come along the river Huan, float down the Qian, cross over to the Mian, enter the Wei, and ferry across the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0084",
          "zh": "黑水西河惟雍州：弱水既西，涇屬渭汭。",
          "translations": [
            {
              "lang": "en",
              "text": "The Blackwater and the western bend of the Yellow river formed the boundaries of Yongzhou.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "漆、沮既從，灃水所同。",
          "translations": [
            {
              "lang": "en",
              "text": "The Ruo water flowed westward; the Qing, the Qi, and Ju streams formed a junction with the Wei, as also did the waters of the Feng.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "荊、岐已旅，終南、敦物至于鳥鼠。",
          "translations": [
            {
              "lang": "en",
              "text": "The Jing and Qi hills were sacrificed too, and so were those of Zhongnan and Dunwu all the way to 'Bird-and-Rat' hill.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "原隰厎績，至于都野。",
          "translations": [
            {
              "lang": "en",
              "text": "Successful measures were taken with the plains and swamps as far as the Duye marsh.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "三危既度，三苗大序。",
          "translations": [
            {
              "lang": "en",
              "text": "The people of Sanwei were controlled, and the Sanmiao tribes kept in good order.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "其土黃壤。",
          "translations": [
            {
              "lang": "en",
              "text": "The soil of the province was yellow clay.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "田上上，賦中下。",
          "translations": [
            {
              "lang": "en",
              "text": "Its fields were the highest of the highest class, while its contribution of revenue was the lowest of the second.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "貢璆、琳、瑯玕。",
          "translations": [
            {
              "lang": "en",
              "text": "Its tribute was jade, topazes, and white cornelian stones.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "浮于積石，至于龍門西河，會于渭汭。",
          "translations": [
            {
              "lang": "en",
              "text": "From 'Stonepile' hill you float on to 'Dragongate' on the western branch of the Yellow river at its junction with the Wei river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "織皮昆侖、析支、渠搜，西戎即序。",
          "translations": [
            {
              "lang": "en",
              "text": "The western Jung tribes from the Gunlun, Hsichih, and Ch『üsou mountains with their hair-cloth and furs were kept in order.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Blackwater and the western bend of the Yellow river formed the boundaries of Yongzhou. The Ruo water flowed westward; the Qing, the Qi, and Ju streams formed a junction with the Wei, as also did the waters of the Feng. The Jing and Qi hills were sacrificed too, and so were those of Zhongnan and Dunwu all the way to 'Bird-and-Rat' hill. Successful measures were taken with the plains and swamps as far as the Duye marsh. The people of Sanwei were controlled, and the Sanmiao tribes kept in good order. The soil of the province was yellow clay. Its fields were the highest of the highest class, while its contribution of revenue was the lowest of the second. Its tribute was jade, topazes, and white cornelian stones. From 'Stonepile' hill you float on to 'Dragongate' on the western branch of the Yellow river at its junction with the Wei river. The western Jung tribes from the Gunlun, Hsichih, and Ch『üsou mountains with their hair-cloth and furs were kept in order.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0094",
          "zh": "道九山：汧及岐至于荊山，踰于河；",
          "translations": [
            {
              "lang": "en",
              "text": "Journeying over the nine mountains, you go from Qian and Qi hills to mount Jing;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "壺口、雷首至于太嶽；",
          "translations": [
            {
              "lang": "en",
              "text": "passing the Yellow river, Pot's mouth,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "砥柱、析城至于王屋；",
          "translations": [
            {
              "lang": "en",
              "text": "and Leishou you come to Taiyue; from Dizhu and Xicheng hills to 'King's house';",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "太行、常山至于碣石，入于海；",
          "translations": [
            {
              "lang": "en",
              "text": "from Taihang and Mount Chang to the granite rocks and the sea; from Xiqing,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "西傾、朱圉、鳥鼠至于太華；",
          "translations": [
            {
              "lang": "en",
              "text": "Zhuyu, and 'Bird-and-Rat' hills to mount Taihua;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "熊耳、外方、桐柏至于負尾；",
          "translations": [
            {
              "lang": "en",
              "text": "from 'Bear's-ear,' Waifang, and Tongbo hills to Fuwei;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "道嶓冢，至于荊山；",
          "translations": [
            {
              "lang": "en",
              "text": "you journey from Bozhong to mount Jing; from Neifang to Dabie,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "內方至于大別；",
          "translations": [
            {
              "lang": "en",
              "text": "and from the south of Mount Min to Mount Heng,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "汶山之陽至衡山，過九江，至于敷淺原。",
          "translations": [
            {
              "lang": "en",
              "text": "and cross the nine rivers to the Fuqian plain.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Journeying over the nine mountains, you go from Qian and Qi hills to mount Jing; passing the Yellow river, Pot's mouth, and Leishou you come to Taiyue; from Dizhu and Xicheng hills to 'King's house'; from Taihang and Mount Chang to the granite rocks and the sea; from Xiqing, Zhuyu, and 'Bird-and-Rat' hills to mount Taihua; from 'Bear's-ear,' Waifang, and Tongbo hills to Fuwei; you journey from Bozhong to mount Jing; from Neifang to Dabie, and from the south of Mount Min to Mount Heng, and cross the nine rivers to the Fuqian plain.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "道九川：弱水至於合黎，餘波入于流沙。",
          "translations": [
            {
              "lang": "en",
              "text": "Following the course of the nine large rivers: from the Ruo river you go to Heli, whence the superfluous water flows into the Rolling sands.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "道黑水，至于三危，入于南海。",
          "translations": [
            {
              "lang": "en",
              "text": "You trace the Blackwater to Sanwei, where it enters the southern sea; you trace the Yellow river from 'Stone-pile' to 'Dragongate,' southward to the north of Mount Hua, eastward to Dizhu, again eastward to the ford Meng, eastward you pass the junction of the Luo river to Dapei, northward past the Jiang water to Dalu, northward the stream is divided and becomes the nine rivers, reunited it forms the opposing river and flows into the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "道河積石，至于龍門，南至華陰，東至砥柱，又東至于盟津，東過雒汭，至于大邳，北過降水，至于大陸，北播為九河，同為逆河，入于海。",
          "translations": [
            {
              "lang": "en",
              "text": "From Bozhong you trace the course of the Yang.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "嶓冢道瀁，東流為漢，又東為蒼浪之水，過三澨，入于大別，南入于江，東匯澤為彭蠡，東為北江，入于海。",
          "translations": [
            {
              "lang": "en",
              "text": "Flowing eastward it becomes the Han, further east it becomes the Canglang water, passing the three dykes it goes to Dabie, southward it enters the great river, eastward whirling on it forms the Pengli marsh, again eastward it forms the northern great river and enters the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "汶山道江，東別為沱，又東至于醴，過九江，至于東陵，東迆北會于匯，東為中江，入于梅。",
          "translations": [
            {
              "lang": "en",
              "text": "From mount Min you trace the great river, which branching to the east becomes the Tuo, again eastward it comes to the Li, passes the nine great rivers and comes to the eastern ridge, flows eastward, winds to the north, and joins the eddies, eastward it becomes the middle great river and enters the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "道沇水，東為濟，入于河，泆為滎，東出陶丘北，又東至于荷，又東北會于汶，又東北入于海。",
          "translations": [
            {
              "lang": "en",
              "text": "Tracing the course of the Yan river—it flows to the east, becomes the Qi, enters the Yellow river, flows on and becomes the Ying; eastward it comes out to the north of Taoqiu, further east flows into the Ke marsh, again north-eastward it unites with the Wen, and still further to the north-east it enters the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "道淮自桐柏，東會于泗、沂，東入于海。",
          "translations": [
            {
              "lang": "en",
              "text": "Tracing the course of the Huai from Tongbo, to the eastward it unites with the Si and Yi rivers, and flowing to the east enters the sea.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "道渭自鳥鼠同穴，東會于灃，又東北至于涇，東過漆、沮，入于河。",
          "translations": [
            {
              "lang": "en",
              "text": "Tracing the course of the Wei from 'Bird-and-rat-in-the-same-hole' hill—it unites to the east with the Feng, further to the north-east it flows into the Jing, to the east passing the Qi and Ju streams it enters the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "道雒自熊耳，東北會于澗、瀍，又東會于伊，東北入于河。",
          "translations": [
            {
              "lang": "en",
              "text": "Tracing the course of the Luo from 'Bear's-ear' hill, on the north-east it unites with the Jian and Chan, further to the east it unites with the Yi, and to the north-east enters the Yellow river.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Following the course of the nine large rivers: from the Ruo river you go to Heli, whence the superfluous water flows into the Rolling sands. You trace the Blackwater to Sanwei, where it enters the southern sea; you trace the Yellow river from 'Stone-pile' to 'Dragongate,' southward to the north of Mount Hua, eastward to Dizhu, again eastward to the ford Meng, eastward you pass the junction of the Luo river to Dapei, northward past the Jiang water to Dalu, northward the stream is divided and becomes the nine rivers, reunited it forms the opposing river and flows into the sea. From Bozhong you trace the course of the Yang. Flowing eastward it becomes the Han, further east it becomes the Canglang water, passing the three dykes it goes to Dabie, southward it enters the great river, eastward whirling on it forms the Pengli marsh, again eastward it forms the northern great river and enters the sea. From mount Min you trace the great river, which branching to the east becomes the Tuo, again eastward it comes to the Li, passes the nine great rivers and comes to the eastern ridge, flows eastward, winds to the north, and joins the eddies, eastward it becomes the middle great river and enters the sea. Tracing the course of the Yan river—it flows to the east, becomes the Qi, enters the Yellow river, flows on and becomes the Ying; eastward it comes out to the north of Taoqiu, further east flows into the Ke marsh, again north-eastward it unites with the Wen, and still further to the north-east it enters the sea. Tracing the course of the Huai from Tongbo, to the eastward it unites with the Si and Yi rivers, and flowing to the east enters the sea. Tracing the course of the Wei from 'Bird-and-rat-in-the-same-hole' hill—it unites to the east with the Feng, further to the north-east it flows into the Jing, to the east passing the Qi and Ju streams it enters the Yellow river. Tracing the course of the Luo from 'Bear's-ear' hill, on the north-east it unites with the Jian and Chan, further to the east it unites with the Yi, and to the north-east enters the Yellow river.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0112",
          "zh": "於是九州攸同，四奧既居，九山刊旅，九川滌原，九澤既陂，四海會同。",
          "translations": [
            {
              "lang": "en",
              "text": "So throughout the nine provinces a similar order was effected: the four coasts were built over, the hills were cleared of their wood and sacrificed to, the streams had their sources scoured out, the marshes were well banked, and all within the four seas had access to the capital.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "六府甚修，眾土交正，致慎財賦，咸則三壤成賦。",
          "translations": [
            {
              "lang": "en",
              "text": "The six treasuries of nature were made the most of, and the various parts of the country exactly compared so that the receipt of revenue could be carefully adjusted according to their resources.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "中國賜土姓：「祗臺德先，不距朕行。」",
          "translations": [
            {
              "lang": "en",
              "text": "The three characters of the soil were classified, and the taxation fixed.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "So throughout the nine provinces a similar order was effected: the four coasts were built over, the hills were cleared of their wood and sacrificed to, the streams had their sources scoured out, the marshes were well banked, and all within the four seas had access to the capital. The six treasuries of nature were made the most of, and the various parts of the country exactly compared so that the receipt of revenue could be carefully adjusted according to their resources. The three characters of the soil were classified, and the taxation fixed. The central government conferred lands and surnames. Revenue was paid to the Emperor's exalted virtue, which was set up as an example, and none opposed his Majesty's action.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "令天子之國以外五百里甸服：百里賦納總，二百里納銍，三百里納秸服，四百里粟，五百里米。",
          "translations": [
            {
              "lang": "en",
              "text": "Now beyond the Emperor's capital 500 li constituted the Imperial domain. From the first hundred li they brought, as revenue, the whole plant of the grain, from the second the ears, from the third the straw, but the people had to perform feudal services, from the fourth the grain in the husk, and from the fifth the grain cleaned.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "甸服外五百里侯服：百里采，二百里任國，三百里諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Five hundred li beyond the Imperial domain constituted the domain of the nobles. The first hundred li formed the allotments to the feudal nobles, the second hundred those to the people employed by the State, and the other 300 those to the various princes.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "侯服外五百里綏服：三百里揆文教，二百里奮武衛。",
          "translations": [
            {
              "lang": "en",
              "text": "Five hundred li beyond the nobles' domain lay the peaceful domain. In the first 300 li they cultivated learning and the moral duties, and in the other 200 their energies lay in the direction of war and defence.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "綏服外五百里要服：三百里夷，二百里蔡。",
          "translations": [
            {
              "lang": "en",
              "text": "Five hundred li beyond the peaceful domain was the domain of restraint. The first 300 were occupied by the Yi tribes, and the other 200 by criminals undergoing the lesser banishment.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "要服外五百里荒服：三百里蠻，二百里流。",
          "translations": [
            {
              "lang": "en",
              "text": "Five hundred li beyond the domain of restraint lay the wild domain. Three hundred li were occupied by the Man tribes, and the other 200 li by criminals undergoing the greater banishment.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Now beyond the Emperor's capital 500 li constituted the Imperial domain. From the first hundred li they brought, as revenue, the whole plant of the grain, from the second the ears, from the third the straw, but the people had to perform feudal services, from the fourth the grain in the husk, and from the fifth the grain cleaned. Five hundred li beyond the Imperial domain constituted the domain of the nobles. The first hundred li formed the allotments to the feudal nobles, the second hundred those to the people employed by the State, and the other 300 those to the various princes. Five hundred li beyond the nobles' domain lay the peaceful domain. In the first 300 li they cultivated learning and the moral duties, and in the other 200 their energies lay in the direction of war and defence. Five hundred li beyond the peaceful domain was the domain of restraint. The first 300 were occupied by the Yi tribes, and the other 200 by criminals undergoing the lesser banishment. Five hundred li beyond the domain of restraint lay the wild domain. Three hundred li were occupied by the Man tribes, and the other 200 li by criminals undergoing the greater banishment.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0121",
          "zh": "東漸于海，西被于流沙，朔、南暨：聲教訖于四海。",
          "translations": [
            {
              "lang": "en",
              "text": "On the east reaching to the sea, on the west extending to the rolling sands, to the utmost limits of the north and south, Yu's fame and influence spread everywhere within the four seas,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "於是帝錫禹玄圭，以告成功于天下。",
          "translations": [
            {
              "lang": "en",
              "text": "so the Emperor presented him with a dark-coloured sceptre, thus announcing to the empire the completion of his work.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "天下於是太平治。",
          "translations": [
            {
              "lang": "en",
              "text": "The empire was at peace and well governed.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "On the east reaching to the sea, on the west extending to the rolling sands, to the utmost limits of the north and south, Yu's fame and influence spread everywhere within the four seas, so the Emperor presented him with a dark-coloured sceptre, thus announcing to the empire the completion of his work. The empire was at peace and well governed.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0124",
          "zh": "皋陶作士以理民。",
          "translations": [
            {
              "lang": "en",
              "text": "Gaoyao was made chief minister of state with a view to his ruling the people.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "帝舜朝，禹、伯夷、皋陶相與語帝前。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor Shun gave audience to Yu,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "皋陶述其謀曰：「信其道德，謀明輔和。」",
          "translations": [
            {
              "lang": "en",
              "text": "Poyi,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "禹曰：「然，如何？」",
          "translations": [
            {
              "lang": "en",
              "text": "and Gaoyao,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "皋陶曰：「於！",
          "translations": [
            {
              "lang": "en",
              "text": "who addressed each other before the Emperor.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "慎其身修，思長，敦序九族，眾明高翼，近可遠在已。」",
          "translations": [
            {
              "lang": "en",
              "text": "Gaoyao,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "禹拜美言，曰：「然。」",
          "translations": [
            {
              "lang": "en",
              "text": "setting forth his counsels,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "皋陶曰：「於！",
          "translations": [
            {
              "lang": "en",
              "text": "said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "在知人，在安民。」",
          "translations": [
            {
              "lang": "en",
              "text": "If a man sincerely follows the path of duty and virtue,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "禹曰：「吁！",
          "translations": [
            {
              "lang": "en",
              "text": "his counsellors will be intelligent,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "皆若是，惟帝其難之。",
          "translations": [
            {
              "lang": "en",
              "text": "and those who aid him will act in harmony.' Yu said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "知人則智，能官人；",
          "translations": [
            {
              "lang": "en",
              "text": "Yes,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "能安民則惠，黎民懷之。",
          "translations": [
            {
              "lang": "en",
              "text": "but what do you mean?' Gaoyao said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "能知能惠，何憂乎驩兜，何遷乎有苗，何畏乎巧言善色佞人？」",
          "translations": [
            {
              "lang": "en",
              "text": "Oh! he will be careful about his personal cultivation,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "皋陶曰：「然，於！",
          "translations": [
            {
              "lang": "en",
              "text": "and will think constantly about it.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "亦行有九德，亦言其有德。」",
          "translations": [
            {
              "lang": "en",
              "text": "Thus he will pay due regard to precedence among the nine branches of his kindred,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "乃言曰：「始事事，寬而栗，柔而立，願而共，治而敬，擾而毅，直而溫，簡而廉，剛而實，彊而義，章其有常，吉哉。",
          "translations": [
            {
              "lang": "en",
              "text": "all the intelligent will exert themselves in his service,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "日宣三德，蚤夜翊明有家。",
          "translations": [
            {
              "lang": "en",
              "text": "and so from what is at hand he may attain to what is far off.' Yu made obeisance at these excellent words,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "日嚴振敬六德，亮采有國。",
          "translations": [
            {
              "lang": "en",
              "text": "and said, 'It is so.' Gaoyao said 'Oh!",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "翕受普施，九德咸事，俊乂在官，百吏肅謹。",
          "translations": [
            {
              "lang": "en",
              "text": "It all lies in knowing mankind, and in quieting the people.' Yu said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "毋教邪淫奇謀。",
          "translations": [
            {
              "lang": "en",
              "text": "Alas! to attain to all this would be difficult even for the Emperor. He who knows men is wise;",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "非其人居其官，是謂亂天事。",
          "translations": [
            {
              "lang": "en",
              "text": "he who can put men into the posts for which they are fit, and can quiet the people,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "天討有罪，五刑五用哉。",
          "translations": [
            {
              "lang": "en",
              "text": "is benevolent, and the black-haired race will cherish him in their hearts. When a man can be thus wise and kind,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "吾言厎可行乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "why should he have anxiety about a Huandou? why to be removing a chief of the Miao tribes? why should he fear a man of specious words, good appearance, and artful ways?' Gaoyao said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "禹曰：「女言致可績行。」",
          "translations": [
            {
              "lang": "en",
              "text": "Just so! there are in all nine virtues, and when we say that a man possesses these virtues it is as much as to say that he begins to do such and such things. They are liberality combined with dignity, mildness combined with firmness,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "皋陶曰：「余未有知，思贊道哉。」",
          "translations": [
            {
              "lang": "en",
              "text": "bluntness combined with respect, aptness for government combined with caution, docility combined with boldness, straightforwardness combined with gentleness, easy negligence combined with discrimination,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gaoyao was made chief minister of state with a view to his ruling the people. The emperor Shun gave audience to Yu, Poyi, and Gaoyao, who addressed each other before the Emperor. Gaoyao, setting forth his counsels, said, 'If a man sincerely follows the path of duty and virtue, his counsellors will be intelligent, and those who aid him will act in harmony.' Yu said, 'Yes, but what do you mean?' Gaoyao said, 'Oh! he will be careful about his personal cultivation, and will think constantly about it. Thus he will pay due regard to precedence among the nine branches of his kindred, all the intelligent will exert themselves in his service, and so from what is at hand he may attain to what is far off.' Yu made obeisance at these excellent words, and said, 'It is so.' Gaoyao said 'Oh! It all lies in knowing mankind, and in quieting the people.' Yu said, 'Alas! to attain to all this would be difficult even for the Emperor. He who knows men is wise; he who can put men into the posts for which they are fit, and can quiet the people, is benevolent, and the black-haired race will cherish him in their hearts. When a man can be thus wise and kind, why should he have anxiety about a Huandou? why to be removing a chief of the Miao tribes? why should he fear a man of specious words, good appearance, and artful ways?' Gaoyao said, 'Just so! there are in all nine virtues, and when we say that a man possesses these virtues it is as much as to say that he begins to do such and such things. They are liberality combined with dignity, mildness combined with firmness, bluntness combined with respect, aptness for government combined with caution, docility combined with boldness, straightforwardness combined with gentleness, easy negligence combined with discrimination, resolution combined with sincerity, and courage combined with justice. If these are apparent, and that continuously, how fortunate it will be. He who daily displays three of these virtues could early and late support and educate a family. He who is strict and reverent in cultivating six of these virtues could brilliantly conduct the affairs of the State. When such men are received and found everywhere, the possessors of those nine virtues will all be employed, and men of eminence will hold office, and the various officers will be respectful and diligent, not teaching heretical, vicious, or strange doctrines. If such men and such officers do not exist it may be said that the affairs of Heaven are in confusion. Heaven punishes the guilty, and the five punishments can be severally applied for that purpose. Are my words sound, and can they be put in force?' Yu said, 'Your words are perfect, and can be successfully put in force.' Gaoyao said, 'As to that I do not know, but I aim at assisting in the path of duty.'",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0151",
          "zh": "帝舜謂禹曰：「女亦昌言。」",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor Shun said to Yu,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "禹拜曰；",
          "translations": [
            {
              "lang": "en",
              "text": "Will you,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "「於，予何言！",
          "translations": [
            {
              "lang": "en",
              "text": "too,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "予思日孳孳。」",
          "translations": [
            {
              "lang": "en",
              "text": "make a brilliant speech?' Yu did obeisance and said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "皋陶難禹曰：「何謂孳孳？」",
          "translations": [
            {
              "lang": "en",
              "text": "Ah! what can I say?",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "禹曰：「鴻水滔天，浩浩懷山襄陵，下民皆服於水。",
          "translations": [
            {
              "lang": "en",
              "text": "I aim at being assiduous from day to day.' Gaoyao,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "予陸行乘車，水行乘舟，泥行乘橇，山行乘檋，行山刊木。",
          "translations": [
            {
              "lang": "en",
              "text": "teasing Yu,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "與益予眾庶稻鮮食。",
          "translations": [
            {
              "lang": "en",
              "text": "said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "以決九川致四海，浚畎澮致之川。",
          "translations": [
            {
              "lang": "en",
              "text": "What do you mean by being assiduous?' Yu said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "與稷予眾庶難得之食。",
          "translations": [
            {
              "lang": "en",
              "text": "When the flood assailed the heavens,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "食少，調有餘補不足，徙居。",
          "translations": [
            {
              "lang": "en",
              "text": "and in its vast expanse encompassed the mountains and overtopped the hills,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "眾民乃定，萬國為治。」",
          "translations": [
            {
              "lang": "en",
              "text": "so that the common people were overcome by the water, I travelled on dry land in a carriage,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "皋陶曰：「然，此而美也。」",
          "translations": [
            {
              "lang": "en",
              "text": "went about on the water in a boat, in miry places I used a sledge,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Emperor Shun said to Yu, 'Will you, too, make a brilliant speech?' Yu did obeisance and said, 'Ah! what can I say? I aim at being assiduous from day to day.' Gaoyao, teasing Yu, said, 'What do you mean by being assiduous?' Yu said, 'When the flood assailed the heavens, and in its vast expanse encompassed the mountains and overtopped the hills, so that the common people were overcome by the water, I travelled on dry land in a carriage, went about on the water in a boat, in miry places I used a sledge, while in going over the hills I used spikes. All along the hills I hewed paths through the woods, and together with Yi supplied the people with paddy and fresh meat. In order to drain the nine streams into the four seas, I deepened the channels and canals, and connected them with the rivers, and together with 'Millet' and the people in general when it was difficult to obtain food, and when food was scarce I bartered the surplus stock to make up for deficiencies, and removed the stores. Thus the people were quieted, and the various states properly governed.' Gaoyao said, 'Yes! this was good on your part.'",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0165",
          "zh": "禹曰：「於，帝！",
          "translations": [
            {
              "lang": "en",
              "text": "Yu said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "慎乃在位，安爾止。",
          "translations": [
            {
              "lang": "en",
              "text": "Ah! your Majesty,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "輔德，天下大應。",
          "translations": [
            {
              "lang": "en",
              "text": "carefully maintain the Throne which you occupy,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "清意以昭待上帝命，天其重命用休。」",
          "translations": [
            {
              "lang": "en",
              "text": "and be quiet in your behaviour,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "帝曰：「吁，臣哉，臣哉！",
          "translations": [
            {
              "lang": "en",
              "text": "assist virtue,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "臣作朕股肱耳目。",
          "translations": [
            {
              "lang": "en",
              "text": "and the nation will grandly respond to your pure desires.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "予欲左右有民，女輔之。",
          "translations": [
            {
              "lang": "en",
              "text": "It will thus be manifest that you await the decrees of the Supreme Being,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "余欲觀古人之象。",
          "translations": [
            {
              "lang": "en",
              "text": "and will not Heaven renew its favouring appointment by conferring blessings on you?' The Emperor said,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "日月星辰，作文繡服色，女明之。",
          "translations": [
            {
              "lang": "en",
              "text": "Dear me! ministers! ministers! you constitute my legs and arms,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "予欲聞六律五聲八音，來始滑，以出入五言，女聽。",
          "translations": [
            {
              "lang": "en",
              "text": "my ears and eyes.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "予即辟，女匡拂予。",
          "translations": [
            {
              "lang": "en",
              "text": "If I wish to aid and support the people,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "女無面諛。",
          "translations": [
            {
              "lang": "en",
              "text": "you help me to do so.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "退而謗予。",
          "translations": [
            {
              "lang": "en",
              "text": "If I wish to see the emblematic figures of the ancients — the sun,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "敬四輔臣。",
          "translations": [
            {
              "lang": "en",
              "text": "moon,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "諸眾讒嬖臣，君德誠施皆清矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "and stars — which are embroidered on the robes and coloured silks,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "禹曰：「然。",
          "translations": [
            {
              "lang": "en",
              "text": "you see them clearly for me. If I wish to hear the six pitchpipes,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "帝即不時，布同善惡則毋功。」",
          "translations": [
            {
              "lang": "en",
              "text": "the five notes, and the eight musical instruments on the adjustment of which depend good government or misrule,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yu said, 'Ah! your Majesty, carefully maintain the Throne which you occupy, and be quiet in your behaviour, assist virtue, and the nation will grandly respond to your pure desires. It will thus be manifest that you await the decrees of the Supreme Being, and will not Heaven renew its favouring appointment by conferring blessings on you?' The Emperor said, 'Dear me! ministers! ministers! you constitute my legs and arms, my ears and eyes. If I wish to aid and support the people, you help me to do so. If I wish to see the emblematic figures of the ancients — the sun, moon, and stars — which are embroidered on the robes and coloured silks, you see them clearly for me. If I wish to hear the six pitchpipes, the five notes, and the eight musical instruments on the adjustment of which depend good government or misrule, and the consequent rise or decline of the five duties, you hear them for me. If I do wrong, you have to correct me. Do not flatter me to my face and speak evil of me behind my back. Be reverent, ye four ministers, and all ye calumniating minions of officials. If the prince's virtue is honestly displayed all men will be pure.' Yu said, 'Yes! should your Majesty not act thus, but equally employ the good and bad, you will gain no credit.'",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0183",
          "zh": "帝曰：「毋若丹朱傲，維慢游是好，毋水行舟，朋淫于家，用絕其世。",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor said, 'Do not be arrogant like Zhu of Dan, who took his pleasure only in idleness and dissipation.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "予不能順是。」",
          "translations": [
            {
              "lang": "en",
              "text": "He would make boats go where there was no water, introduced licentious friends into his family, and thereby cut off the hereditary honours of his house.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "禹曰：「予（辛壬）娶涂山，［辛壬］癸甲，生啟予不子，以故能成水土功。",
          "translations": [
            {
              "lang": "en",
              "text": "I could not follow that line of conduct.' Yu said, 'I was married at Tushan on the days xin and ren, and on the days gui and jia my son Qi was born.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "輔成五服，至于五千里，州十二師，外薄四海，咸建五長，各道有功。",
          "translations": [
            {
              "lang": "en",
              "text": "I did not treat him as a son, and therefore was able to complete my labours on the water and on land.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "苗頑不即功，帝其念哉。」",
          "translations": [
            {
              "lang": "en",
              "text": "I assisted, in completing the five Tenures, extending over 5000 li.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "帝曰：「道吾德，乃女功序之也。」",
          "translations": [
            {
              "lang": "en",
              "text": "In the provinces I appointed twelve tutors, and in the regions beyond to the four seas I established five presidents.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Emperor said, 'Do not be arrogant like Zhu of Dan, who took his pleasure only in idleness and dissipation. He would make boats go where there was no water, introduced licentious friends into his family, and thereby cut off the hereditary honours of his house. I could not follow that line of conduct.' Yu said, 'I was married at Tushan on the days xin and ren, and on the days gui and jia my son Qi was born. I did not treat him as a son, and therefore was able to complete my labours on the water and on land. I assisted, in completing the five Tenures, extending over 5000 li. In the provinces I appointed twelve tutors, and in the regions beyond to the four seas I established five presidents. These all did their duty, and achieved great results, but the Miao tribes were obstinate, and refused to do their work. Think of this, your Majesty.' The Emperor said, 'That my virtue is the guide is the result of your orderly arrangements.'",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "皋陶於是敬禹之德，令民皆則禹。",
          "translations": [
            {
              "lang": "en",
              "text": "Gaoyao therefore, respecting Yu's virtues, bade the people carry out as a rule his plan of preferring admonition,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "不如言，刑從之。",
          "translations": [
            {
              "lang": "en",
              "text": "but also made use of punishments.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "舜德大明。",
          "translations": [
            {
              "lang": "en",
              "text": "Shun's virtues were very clear.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gaoyao therefore, respecting Yu's virtues, bade the people carry out as a rule his plan of preferring admonition, but also made use of punishments. Shun's virtues were very clear.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0193",
          "zh": "於是夔行樂，祖考至，群后相讓，鳥獸翔舞，簫韶九成，鳳皇來儀，百獸率舞，百官信諧。",
          "translations": [
            {
              "lang": "en",
              "text": "Kui played some music; the spirits of Imperial ancestors, and hosts of nobles gave place to one another, and even birds and beasts wheeled about and danced. When the nine airs of Shun's music were played, the phoenixes came and put themselves in attitudes, the different beasts led each other on to dance, and the various officials were really in harmony.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "帝用此作歌曰：「陟天之命，維時維幾。」",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor upon this composed the following ode, 'Being set on high by the favouring appointment of Heaven, we must be careful at every moment, and in every particular.' He then sang as follows,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "乃歌曰：「股肱喜哉，元首起哉，百工熙哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "When the members are happy, the head is exalted, and the various kinds of work are happily performed.' Gaoyao did obeisance with his head to his hands, and then to the ground, and with a loud voice said, 'Oh! think.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "皋陶拜手稽首揚言曰：「念哉，率為興事，慎乃憲，敬哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "It is yours to lead on and originate affairs. Pay careful attention to your laws. Be cautious.' He continued his song, saying, 'When the head is intelligent,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "乃更為歌曰：「元首明哉，股肱良哉，庶事康哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "the members are good, and all business will prosper.' Shun again sang as follows, 'When the head is vexatious,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "（舜）又歌曰：「元首叢脞哉，股肱惰哉，萬事墮哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "the members are idle, and all business is ruined.' The Emperor bowed and said, 'Yes,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "帝拜曰：「然，往欽哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "go and be reverent!' The whole nation upon this applauded Yu's brilliant musical performance,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "於是天下皆宗禹之明度數聲樂，為山川神主。",
          "translations": [
            {
              "lang": "en",
              "text": "and the divine lord of hills and streams.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kui played some music; the spirits of Imperial ancestors, and hosts of nobles gave place to one another, and even birds and beasts wheeled about and danced. When the nine airs of Shun's music were played, the phoenixes came and put themselves in attitudes, the different beasts led each other on to dance, and the various officials were really in harmony. The Emperor upon this composed the following ode, 'Being set on high by the favouring appointment of Heaven, we must be careful at every moment, and in every particular.' He then sang as follows, 'When the members are happy, the head is exalted, and the various kinds of work are happily performed.' Gaoyao did obeisance with his head to his hands, and then to the ground, and with a loud voice said, 'Oh! think. It is yours to lead on and originate affairs. Pay careful attention to your laws. Be cautious.' He continued his song, saying, 'When the head is intelligent, the members are good, and all business will prosper.' Shun again sang as follows, 'When the head is vexatious, the members are idle, and all business is ruined.' The Emperor bowed and said, 'Yes, go and be reverent!' The whole nation upon this applauded Yu's brilliant musical performance, and the divine lord of hills and streams.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0201",
          "zh": "帝舜薦禹於天，為嗣。",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor Shun presented Yu to Heaven as his heir,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "十七年而帝舜崩。",
          "translations": [
            {
              "lang": "en",
              "text": "and 17 years afterwards the Emperor Shun died.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "三年喪畢，禹辭辟舜之子商均於陽城。",
          "translations": [
            {
              "lang": "en",
              "text": "The three years' mourning being over,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "天下諸侯皆去商均而朝禹。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu retired before Shun's son Shangjun to the town of Yang,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "禹於是遂即天子位，南面朝天下，國號曰夏后，姓姒氏。",
          "translations": [
            {
              "lang": "en",
              "text": "but the princes of the empire all left Shangjun, and went to Yu's court, and Yu accordingly occupied the Imperial throne. Facing the south he gave audience to the nation. His dynastic appellation was (Xia hou) Prince of Xia, and his surname Si.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Emperor Shun presented Yu to Heaven as his heir, and 17 years afterwards the Emperor Shun died. The three years' mourning being over, Yu retired before Shun's son Shangjun to the town of Yang, but the princes of the empire all left Shangjun, and went to Yu's court, and Yu accordingly occupied the Imperial throne. Facing the south he gave audience to the nation. His dynastic appellation was (Xia hou) Prince of Xia, and his surname Si.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0206",
          "zh": "帝禹立而舉皋陶薦之，且授政焉，而皋陶卒。",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor Yu sat on the throne and recommended Gaoyao for promotion, transferring also the administration of affairs to him,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "封皋陶之後於英、六，或在許。",
          "translations": [
            {
              "lang": "en",
              "text": "but Gaoyao died, and his descendants were enfeoffed with the principalities of Yingliu and Xu.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "而后舉益，任之政。",
          "translations": [
            {
              "lang": "en",
              "text": "The prince then recommended Yi for the appointment of administrator of affairs.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Emperor Yu sat on the throne and recommended Gaoyao for promotion, transferring also the administration of affairs to him, but Gaoyao died, and his descendants were enfeoffed with the principalities of Yingliu and Xu. The prince then recommended Yi for the appointment of administrator of affairs.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0209",
          "zh": "十年，帝禹東巡狩，至于會稽而崩。",
          "translations": [
            {
              "lang": "en",
              "text": "Ten years elapsed, when the Emperor Yu, having gone to the east on a tour of inspection,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "以天下授益。",
          "translations": [
            {
              "lang": "en",
              "text": "died at Guiji, and the rule of the empire was given to Yi. When the three years' mourning was over,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "三年之喪畢，益讓帝禹之子啟，而辟居箕山之陽。",
          "translations": [
            {
              "lang": "en",
              "text": "Yi resigned in favour of Yu's son Qi, and retired to the south of Mount Ji. Yu's son Qi was worthy,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "禹子啟賢，天下屬意焉。",
          "translations": [
            {
              "lang": "en",
              "text": "and the nation fixed its desires upon him, but when Yu died, although the rule was given to Yi,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "及禹崩，雖授益，益之佐禹日淺，天下未洽。",
          "translations": [
            {
              "lang": "en",
              "text": "he supported Yu but a few days, when the nation not being content the princes all left Yi, and went to Qi's court saying,'",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "故諸侯皆去益而朝啟，曰：「吾君帝禹之子也」。",
          "translations": [
            {
              "lang": "en",
              "text": "He is the son of our sovereign' emperor Yu. Qi then succeeded to the Imperial throne,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "於是啟遂即天子之位，是為夏后帝啟。",
          "translations": [
            {
              "lang": "en",
              "text": "and became Emperor Qi, the Prince of Xia.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Ten years elapsed, when the Emperor Yu, having gone to the east on a tour of inspection, died at Guiji, and the rule of the empire was given to Yi. When the three years' mourning was over, Yi resigned in favour of Yu's son Qi, and retired to the south of Mount Ji. Yu's son Qi was worthy, and the nation fixed its desires upon him, but when Yu died, although the rule was given to Yi, he supported Yu but a few days, when the nation not being content the princes all left Yi, and went to Qi's court saying, 'He is the son of our sovereign' emperor Yu. Qi then succeeded to the Imperial throne, and became Emperor Qi, the Prince of Xia.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "夏后帝啟，禹之子，其母涂山氏之女也。",
          "translations": [
            {
              "lang": "en",
              "text": "The Prince of Xia, Emperor Qi, was the son of Yu, his mother being the daughter of the lord of Tushan.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Prince of Xia, Emperor Qi, was the son of Yu, his mother being the daughter of the lord of Tushan.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0217",
          "zh": "有扈氏不服，啟伐之，大戰於甘。",
          "translations": [
            {
              "lang": "en",
              "text": "As the lord of Hu would not submit, Qi attacked him, and there was a great battle at Han. Just before the engagement the speech at Gan was delivered to the six generals, who were summoned together; Qi said, 'Ah! ye who are engaged in my six armies, I have a solemn announcement to make to you.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "將戰，作甘誓，乃召六卿申之。",
          "translations": [
            {
              "lang": "en",
              "text": "The chief of Hu violently sets at naught the five human relations, and idly casts aside the three obligations of duty. Heaven will on this account oppose him and cut off the span of his life,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "啟曰：「嗟！",
          "translations": [
            {
              "lang": "en",
              "text": "and I am now but reverently executing the punishment appointed by Heaven.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "六事之人，予誓告女：有扈氏威侮五行，怠棄三正，天用勦絕其命。",
          "translations": [
            {
              "lang": "en",
              "text": "If you on the left do not do your work on the left, and you on the right do not do your work on the right,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "今予維共行天之罰。",
          "translations": [
            {
              "lang": "en",
              "text": "it will be a disregard of my orders. If you, charioteers, do not observe the rules for the management of your horses,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "左不攻于左，右不攻于右，女不共命。",
          "translations": [
            {
              "lang": "en",
              "text": "it will be a disregard of my orders.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "御非其馬之政，女不共命。",
          "translations": [
            {
              "lang": "en",
              "text": "You who obey my orders shall be rewarded in the ancestral temple,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "用命，賞于祖；",
          "translations": [
            {
              "lang": "en",
              "text": "but you who disobey my orders shall be slain before the altar of the spirits of the land,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "不用命，僇于社，予則帑僇女。」",
          "translations": [
            {
              "lang": "en",
              "text": "and I will destroy both you and your children.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "遂滅有扈氏。",
          "translations": [
            {
              "lang": "en",
              "text": "He thereupon destroyed the chief of Hu,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "天下咸朝。",
          "translations": [
            {
              "lang": "en",
              "text": "and the whole nation went to the court of the Prince of Xia.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "As the lord of Hu would not submit, Qi attacked him, and there was a great battle at Han. Just before the engagement the speech at Gan was delivered to the six generals, who were summoned together; Qi said, 'Ah! ye who are engaged in my six armies, I have a solemn announcement to make to you. The chief of Hu violently sets at naught the five human relations, and idly casts aside the three obligations of duty. Heaven will on this account oppose him and cut off the span of his life, and I am now but reverently executing the punishment appointed by Heaven. If you on the left do not do your work on the left, and you on the right do not do your work on the right, it will be a disregard of my orders. If you, charioteers, do not observe the rules for the management of your horses, it will be a disregard of my orders. You who obey my orders shall be rewarded in the ancestral temple, but you who disobey my orders shall be slain before the altar of the spirits of the land, and I will destroy both you and your children. He thereupon destroyed the chief of Hu, and the whole nation went to the court of the Prince of Xia.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0228",
          "zh": "夏后帝啟崩，子帝太康立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Qi died, and his son Emperor Taikang (Kang the first) came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "帝太康失國，昆弟五人，須于洛汭，作五子之歌。",
          "translations": [
            {
              "lang": "en",
              "text": "The Emperor Taikang lost his kingdom; his five brothers waited for him on the north of the Luo river, and composed the song of the five sons.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor Qi died, and his son Emperor Taikang (Kang the first) came to the throne. The Emperor Taikang lost his kingdom; his five brothers waited for him on the north of the Luo river, and composed the song of the five sons.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0230",
          "zh": "太康崩，弟中康立，是為帝中康。",
          "translations": [
            {
              "lang": "en",
              "text": "Kang the first died, and his brother Kang the second came to the throne, that is the Emperor Kang the second.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "帝中康時，羲、和湎淫，廢時亂日。",
          "translations": [
            {
              "lang": "en",
              "text": "In the time of the Emperor Kang the second, Xi and He, indulging in wine and dissipation, neglected the seasons, and let the calendar get into confusion.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "胤往征之，作胤征。",
          "translations": [
            {
              "lang": "en",
              "text": "Yin went to punish them, and the 'punitive expedition of Yin' was composed.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kang the first died, and his brother Kang the second came to the throne, that is the Emperor Kang the second. In the time of the Emperor Kang the second, Xi and He, indulging in wine and dissipation, neglected the seasons, and let the calendar get into confusion. Yin went to punish them, and the 'punitive expedition of Yin' was composed.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0233",
          "zh": "中康崩，子帝相立。",
          "translations": [
            {
              "lang": "en",
              "text": "Kang the second died, and his son Emperor Xiang came to the throne. Emperor Xiang died,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "帝相崩，子帝少康立。",
          "translations": [
            {
              "lang": "en",
              "text": "and his Son Kang the third came to the throne. Emperor Kang the third died, and his son Emperor Chu came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "帝少康崩，子帝予立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Chu died, and his son Emperor Huai came the throne. Emperor Huai died,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "帝予崩，子帝槐立。",
          "translations": [
            {
              "lang": "en",
              "text": "and his Son Emperor Mang came to the throne. Emperor Mang died, and his Son Emperor Xie came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "帝槐崩，子帝芒立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Xie died, and his son Emperor Bujiang came to the throne. Emperor Bujiang died,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "帝芒崩，子帝泄立。",
          "translations": [
            {
              "lang": "en",
              "text": "and his brother Emperor Jiong came to the throne. Emperor Jiong died, and his Son Emperor Jin came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "帝泄崩，子帝不降立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Jin died, and Emperor Bujiang's son Kongjia,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "帝不降崩，弟帝扃立。",
          "translations": [
            {
              "lang": "en",
              "text": "that is Emperor Kongjia, came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "帝扃崩，子帝廑立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Kongjia was fond of enquiring into spiritual matters, and indulged in dissipation,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "帝廑崩，立帝不降之子孔甲，是為帝孔甲。",
          "translations": [
            {
              "lang": "en",
              "text": "and the virtue of the princes of Xia having degenerated, the chiefs rebelled.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "帝孔甲立，好方鬼神，事淫亂。",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven sent down two dragons, a male and a female.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "夏后氏德衰，諸侯畔之。",
          "translations": [
            {
              "lang": "en",
              "text": "Kongjia could not feed them, and could not obtain a dragon-keeper.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "天降龍二，有雌雄，孔甲不能食，未得豢龍氏。",
          "translations": [
            {
              "lang": "en",
              "text": "After the decline of Taotang (Yao) one of his descendants, Liu Lei,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "陶唐既衰，其后有劉累，學擾龍于豢龍氏，以事孔甲。",
          "translations": [
            {
              "lang": "en",
              "text": "learnt to train dragons, and he was chosen out of the dragon-keepers to wait on Kongjia,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "孔甲賜之姓曰御龍氏，受豕韋之後。",
          "translations": [
            {
              "lang": "en",
              "text": "who gave him the title of dragon-tamer, which was inherited by the descendants of the Shiwei.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "龍一雌死，以食夏后。",
          "translations": [
            {
              "lang": "en",
              "text": "The female dragon died, and he served it up as a meal for the Prince of Xia,",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "夏后使求，懼而遷去。",
          "translations": [
            {
              "lang": "en",
              "text": "but the latter having sent some one to look for it, he became frightened and ran away.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kang the second died, and his son Emperor Xiang came to the throne. Emperor Xiang died, and his Son Kang the third came to the throne. Emperor Kang the third died, and his son Emperor Chu came to the throne. Emperor Chu died, and his son Emperor Huai came the throne. Emperor Huai died, and his Son Emperor Mang came to the throne. Emperor Mang died, and his Son Emperor Xie came to the throne. Emperor Xie died, and his son Emperor Bujiang came to the throne. Emperor Bujiang died, and his brother Emperor Jiong came to the throne. Emperor Jiong died, and his Son Emperor Jin came to the throne. Emperor Jin died, and Emperor Bujiang's son Kongjia, that is Emperor Kongjia, came to the throne. Emperor Kongjia was fond of enquiring into spiritual matters, and indulged in dissipation, and the virtue of the princes of Xia having degenerated, the chiefs rebelled. Heaven sent down two dragons, a male and a female. Kongjia could not feed them, and could not obtain a dragon-keeper. After the decline of Taotang (Yao) one of his descendants, Liu Lei, learnt to train dragons, and he was chosen out of the dragon-keepers to wait on Kongjia, who gave him the title of dragon-tamer, which was inherited by the descendants of the Shiwei. The female dragon died, and he served it up as a meal for the Prince of Xia, but the latter having sent some one to look for it, he became frightened and ran away.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "孔甲崩，子帝皋立。",
          "translations": [
            {
              "lang": "en",
              "text": "Kongjia died, and his son Emperor Gao came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "帝皋崩，子帝發立。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Gao died, and his son Emperor Fa came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "帝發崩，子帝履癸立，是為桀。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Fa died, and his son Emperor Lu Gui, that is Jie, came to the throne.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "帝桀之時，自孔甲以來而諸侯多畔夏，桀不務德而武傷百姓，百姓弗堪。",
          "translations": [
            {
              "lang": "en",
              "text": "Regarding the reign of the Emperor Jie, ever since the time of Kongjia the barons had frequently rebelled. Jie of Xia did not strive after virtue, and the wars injured the people.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "乃召湯而囚之夏臺，已而釋之。",
          "translations": [
            {
              "lang": "en",
              "text": "Unable to endure their wrongs they summoned Tang to their aid, but he was imprisoned in the tower of Xia; being afterwards released.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "湯修德，諸侯皆歸湯，湯遂率兵以伐夏桀。",
          "translations": [
            {
              "lang": "en",
              "text": "Tang cultivated virtue, and the princes all went over to him, so Tang led an army to attack Jie of Xia.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "桀走鳴條，遂放而死。",
          "translations": [
            {
              "lang": "en",
              "text": "Jie fled to Mingtiao, and was eventually driven out and slain.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "桀謂人曰：「吾悔不遂殺湯於夏臺，使至此。」",
          "translations": [
            {
              "lang": "en",
              "text": "Jie observed to someone, 'I regret that I did not take the opportunity of killing Tang in the tower of Xia, and then I should not have been brought to such a pass.' Tang, being seated on the Imperial throne, superseded Xia, and gave audience to the people.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "湯乃踐天子位，代夏朝天下。",
          "translations": [
            {
              "lang": "en",
              "text": "Tang enfeoffed the descendants of the Xias.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "湯封夏之後，至周封於杞也。",
          "translations": [
            {
              "lang": "en",
              "text": "Until the time of the Zhou dynasty they held the principality of Qi.",
              "translator": "Herbert J. Allen (1894)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kongjia died, and his son Emperor Gao came to the throne. Emperor Gao died, and his son Emperor Fa came to the throne. Emperor Fa died, and his son Emperor Lu Gui, that is Jie, came to the throne. Regarding the reign of the Emperor Jie, ever since the time of Kongjia the barons had frequently rebelled. Jie of Xia did not strive after virtue, and the wars injured the people. Unable to endure their wrongs they summoned Tang to their aid, but he was imprisoned in the tower of Xia; being afterwards released. Tang cultivated virtue, and the princes all went over to him, so Tang led an army to attack Jie of Xia. Jie fled to Mingtiao, and was eventually driven out and slain. Jie observed to someone, 'I regret that I did not take the opportunity of killing Tang in the tower of Xia, and then I should not have been brought to such a pass.' Tang, being seated on the Imperial throne, superseded Xia, and gave audience to the people. Tang enfeoffed the descendants of the Xias. Until the time of the Zhou dynasty they held the principality of Qi.",
          "translator": "Herbert J. Allen (1894)"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0260",
          "zh": "太史公曰：禹為姒姓，其後分封，用國為姓，故有夏后氏、有扈氏、有男氏、斟尋氏、彤城氏、褒氏、費 氏、杞氏、繒氏、辛氏、冥氏、斟（氏）戈氏。",
          "translations": [
            {
              "lang": "en",
              "text": "The Grand Historian says: Yu bore the surname Si, and his descendants were enfeoffed and took their states as surnames, thus there were the Xiahou clan, the Youhu clan, the Younan clan, the Zhenxun clan, the Tongcheng clan, the Bao clan, the Fei clan, the Qi clan, the Zeng clan, the Xin clan, the Ming clan, and the Zhenge clan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "Claude (Anthropic AI - claude-sonnet-4)"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "孔子正夏時，學者多傳夏小正云。",
          "translations": [
            {
              "lang": "en",
              "text": "Confucius rectified the Xia calendar, and many scholars transmitted the Xia Xiaozheng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "Claude (Anthropic AI - claude-sonnet-4)"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "自虞、夏時，貢賦備矣。",
          "translations": [
            {
              "lang": "en",
              "text": "From the time of Yu and Xia, the system of tribute and taxation was complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "Claude (Anthropic AI - claude-sonnet-4)"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "或言禹會諸侯江南，計功而崩，因葬焉，命曰會稽。",
          "translations": [
            {
              "lang": "en",
              "text": "Some say that Yu assembled the feudal lords south of the Yangtze, and after calculating their merits he died and was therefore buried there, the place being named Guiji.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "Claude (Anthropic AI - claude-sonnet-4)"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "會稽者，會計也。",
          "translations": [
            {
              "lang": "en",
              "text": "Guiji\" means \"to assemble and calculate.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "Claude (Anthropic AI - claude-sonnet-4)"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "",
          "translator": ""
        }
      ]
    }
  ]
}