{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "004",
    "url": "https://chinesenotes.com/shiji/shiji004.html",
    "title": {
      "zh": "周本紀",
      "en": "Annals of Zhou",
      "raw": "《周本紀》 Annals of Zhou"
    },
    "sentenceCount": 595,
    "translatedCount": 0,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:21.259Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "周后稷，名棄。",
          "translations": []
        },
        {
          "id": "s0002",
          "zh": "其母有邰氏女，曰姜原。",
          "translations": []
        },
        {
          "id": "s0003",
          "zh": "姜原為帝嚳元妃。",
          "translations": []
        },
        {
          "id": "s0004",
          "zh": "姜原出野，見巨人跡，心忻然說，欲踐之，踐之而身動如孕者。",
          "translations": []
        },
        {
          "id": "s0005",
          "zh": "居期而生子，以為不祥，棄之隘巷，馬牛過者皆辟不踐；",
          "translations": []
        },
        {
          "id": "s0006",
          "zh": "徙置之林中，適會山林多人，遷之；",
          "translations": []
        },
        {
          "id": "s0007",
          "zh": "而棄渠中冰上，飛鳥以其翼覆薦之。",
          "translations": []
        },
        {
          "id": "s0008",
          "zh": "姜原以為神，遂收養長之。",
          "translations": []
        },
        {
          "id": "s0009",
          "zh": "初欲棄之，因名曰棄。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Zhou ancestor Houji was named Qi. His mother was a woman of the Youtai clan named Jiang Yuan. Jiang Yuan was the primary consort of Emperor Ku. Jiang Yuan went out into the wilderness and saw giant footprints. Her heart was filled with delight; she wished to step on them, and when she did, her body moved as if she were with child. She carried the child to term and gave birth to a son, but considered it an ill omen and abandoned him in a narrow alley. Horses and oxen passing by all avoided stepping on him. She moved him to the forest, but by chance encountered many woodcutters who moved him elsewhere. She abandoned him in a ditch on the ice, but flying birds covered and protected him with their wings. Jiang Yuan considered this a divine sign and took him in to raise. Since she had initially wanted to abandon him, she named him Qi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0010",
          "zh": "棄為兒時，屹如巨人之志。",
          "translations": []
        },
        {
          "id": "s0011",
          "zh": "其游戲，好種樹麻、菽，麻、菽美。",
          "translations": []
        },
        {
          "id": "s0012",
          "zh": "及為成人，遂好耕農，相地之宜，宜穀者稼穡焉，民皆法則之。",
          "translations": []
        },
        {
          "id": "s0013",
          "zh": "帝堯聞之，舉棄為農師，天下得其利，有功。",
          "translations": []
        },
        {
          "id": "s0014",
          "zh": "帝舜曰：「棄，黎民始饑，爾后稷播時百穀。」",
          "translations": []
        },
        {
          "id": "s0015",
          "zh": "封棄於邰，號曰后稷，別姓姬氏。",
          "translations": []
        },
        {
          "id": "s0016",
          "zh": "后稷之興，在陶唐﹑虞﹑夏之際，皆有令德。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Even as a child, Qi had the aspirations of a giant. In his play, he loved planting hemp and soybeans; they grew beautifully. When he became an adult, he loved farming. He assessed the suitability of the land; where grain grew well he planted crops, and the people all followed his example. Emperor Yao heard of this and appointed Qi as Minister of Agriculture. All under Heaven benefited, and he achieved merit. Emperor Shun said: 'Qi, when the black-haired people first suffered famine, you, Houji, sowed the timely hundred grains.' He enfeoffed Qi at Tai, titled him Houji, and established the Ji clan as a separate surname. Houji's rise occurred during the time of Yao Tang, Yu, and Xia; all possessed excellent virtue.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0017",
          "zh": "后稷卒，子不窋立。",
          "translations": []
        },
        {
          "id": "s0018",
          "zh": "不窋末年，夏后氏政衰，去稷不務，不窋以失其官而犇戎狄之間。",
          "translations": []
        },
        {
          "id": "s0019",
          "zh": "不窋卒，子鞠立。",
          "translations": []
        },
        {
          "id": "s0020",
          "zh": "鞠卒，子公劉立。",
          "translations": []
        },
        {
          "id": "s0021",
          "zh": "公劉雖在戎狄之間，復修后稷之業，務耕種，行地宜，自漆、沮度渭，取材用，行者有資，居者有畜積，民賴其慶。",
          "translations": []
        },
        {
          "id": "s0022",
          "zh": "百姓懷之，多徙而保歸焉。",
          "translations": []
        },
        {
          "id": "s0023",
          "zh": "周道之興自此始，故詩人歌樂思其德。",
          "translations": []
        },
        {
          "id": "s0024",
          "zh": "公劉卒，子慶節立，國於豳。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Houji died, and his son Bu Ku succeeded him. In Bu Ku's later years, the Xia royal house's governance declined. They abandoned the office of Houji and neglected its duties. Bu Ku lost his position and fled among the Rong and Di barbarians. Bu Ku died, and his son Ju succeeded him. Ju died, and his son Gong Liu succeeded him. Although Gong Liu lived among the Rong and Di barbarians, he revived the work of Houji. He devoted himself to farming and planting, practiced what was suitable for the land, crossed the Wei River from Qi and Ju, gathered timber for use. Travelers had provisions, residents had stores - the people relied on his blessings. The common people cherished him; many migrated and sought refuge by returning to him. The rise of Zhou civilization began from this, which is why poets sang joyfully, thinking of his virtue. Gong Liu died, and his son Qing Jie succeeded him, establishing the state at Bin.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0025",
          "zh": "慶節卒，子皇仆立。",
          "translations": []
        },
        {
          "id": "s0026",
          "zh": "皇仆卒，子差弗立。",
          "translations": []
        },
        {
          "id": "s0027",
          "zh": "差弗卒，子毀隃立。",
          "translations": []
        },
        {
          "id": "s0028",
          "zh": "毀隃卒，子公非立。",
          "translations": []
        },
        {
          "id": "s0029",
          "zh": "公非卒，子高圉立。",
          "translations": []
        },
        {
          "id": "s0030",
          "zh": "高圉卒，子亞圉立。",
          "translations": []
        },
        {
          "id": "s0031",
          "zh": "亞圉卒，子公叔祖類立。",
          "translations": []
        },
        {
          "id": "s0032",
          "zh": "公叔祖類卒，子古公亶父立。",
          "translations": []
        },
        {
          "id": "s0033",
          "zh": "古公亶父復修后稷、公劉之業，積德行義，國人皆戴之。",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "薰育戎狄攻之，欲得財物，予之。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "已復攻，欲得地與民。",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "民皆怒，欲戰。",
          "translations": []
        },
        {
          "id": "s0037",
          "zh": "古公曰：「有民立君，將以利之。",
          "translations": []
        },
        {
          "id": "s0038",
          "zh": "今戎狄所為攻戰，以吾地與民。",
          "translations": []
        },
        {
          "id": "s0039",
          "zh": "民之在我，與其在彼，何異。",
          "translations": []
        },
        {
          "id": "s0040",
          "zh": "民欲以我故戰，殺人父子而君之，予不忍為。」",
          "translations": []
        },
        {
          "id": "s0041",
          "zh": "乃與私屬遂去豳，度漆、沮，踰梁山，止於岐下。",
          "translations": []
        },
        {
          "id": "s0042",
          "zh": "豳人舉國扶老攜弱，盡復歸古公於岐下。",
          "translations": []
        },
        {
          "id": "s0043",
          "zh": "及他旁國聞古公仁，亦多歸之。",
          "translations": []
        },
        {
          "id": "s0044",
          "zh": "於是古公乃貶戎狄之俗，而營筑城郭室屋，而邑別居之。",
          "translations": []
        },
        {
          "id": "s0045",
          "zh": "作五官有司。",
          "translations": []
        },
        {
          "id": "s0046",
          "zh": "民皆歌樂之，頌其德。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Qing Jie died, and his son Huang Pu succeeded him. Huang Pu died, and his son Cha Fu succeeded him. Cha Fu died, and his son Hou Zhu succeeded him. Hou Zhu died, and his son Gong Bo succeeded him. Gong Bo died, and his son Tai Wang succeeded him. Tai Wang died, and his son Ya Yu succeeded him. Ya Yu died, and his son Gong Shu Zu Lei succeeded him. Gong Shu Zu Lei died, and his son Gu Gong Dan Fu succeeded him. Gu Gong Dan Fu revived the work of Houji and Gong Liu, accumulated virtue and practiced righteousness - all the people of the state revered him. The Xunyu Rong and Di barbarians attacked him, desiring wealth and goods, so he gave them what they wanted. Afterward they attacked again, desiring to obtain land and people. The people were all furious and wished to fight. Gu Gong said: 'A ruler is established to benefit the people. Now the Rong and Di barbarians attack and fight to take our land and people. What difference does it make whether the people are with me or with them? The people wish to fight on my account, killing fathers and sons to make me their ruler - I cannot bear to do this.' He departed Bin with his closest followers, crossed the Qi and Ju rivers, climbed over Mount Liang, and stopped at the base of Mount Qi. The entire population of Bin, supporting the elderly and carrying the young, all returned and gathered around Gu Gong at the base of Mount Qi. When the neighboring states heard of Gu Gong's benevolence, many of them also came to join him. Thus Gu Gong abandoned the customs of the Rong and Di barbarians, and built walled cities, houses, and rooms, organizing the people into separate settlements. He established the five offices and their officials. The people all sang joyfully of him, praising his virtue.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0047",
          "zh": "古公有長子曰太伯，次曰虞仲。",
          "translations": []
        },
        {
          "id": "s0048",
          "zh": "太姜生少子季歷，季歷娶太任，皆賢婦人，生昌，有聖瑞。",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "古公曰：「我世當有興者，其在昌乎？」",
          "translations": []
        },
        {
          "id": "s0050",
          "zh": "長子太伯、虞仲知古公欲立季歷以傳昌，乃二人亡如荊蠻，文身斷髪，以讓季歷。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Gu Gong had an eldest son named Tai Bo, and a second son named Yu Zhong. Tai Jiang gave birth to a youngest son Ji Li. Ji Li married Tai Ren - both were virtuous women. They gave birth to Chang, who possessed sacred omens. Gu Gong said: 'Our line will one day rise to greatness. Could it be with Chang?' The eldest son Tai Bo and second son Yu Zhong knew Gu Gong wished to establish Ji Li so that Chang would inherit the throne. The two fled to the Jing barbarians, tattooed their bodies and cut their hair, yielding the throne to Ji Li.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0051",
          "zh": "古公卒，季歷立，是為公季。",
          "translations": []
        },
        {
          "id": "s0052",
          "zh": "公季修古公遺道，篤於行義，諸侯順之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Gu Gong died, and Ji Li succeeded him, known as Gong Ji. Gong Ji followed Gu Gong's teachings, was devoted to practicing righteousness, and the feudal lords submitted to him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "公季卒，子昌立，是為西伯。",
          "translations": []
        },
        {
          "id": "s0054",
          "zh": "西伯曰文王，遵后稷、公劉之業，則古公、公季之法，篤仁，敬老，慈少。",
          "translations": []
        },
        {
          "id": "s0055",
          "zh": "禮下賢者，日中不暇食以待士，士以此多歸之。",
          "translations": []
        },
        {
          "id": "s0056",
          "zh": "伯夷、叔齊在孤竹，聞西伯善養老，盍往歸之。",
          "translations": []
        },
        {
          "id": "s0057",
          "zh": "太顛、閎夭、散宜生、鬻子、辛甲大夫之徒皆往歸之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Gong Ji died, and his son Chang succeeded him, known as Xi Bo. Xi Bo came to be called King Wen. He followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, and loved the young. He treated worthies with courtesy; at noon he had no time to eat while waiting for scholars. Scholars therefore came to him in great numbers. Bo Yi and Shu Qi were in Guzhu. They heard that Xi Bo was good at caring for the elderly and came to join him. Taidian, Hongyao, San Yisheng, Yuzi, Xiahou Dafu, and others all came to join him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "崇侯虎譖西伯於殷紂曰：「西伯積善累德，諸侯皆向之，將不利於帝。」",
          "translations": []
        },
        {
          "id": "s0059",
          "zh": "帝紂乃囚西伯於羑里。",
          "translations": []
        },
        {
          "id": "s0060",
          "zh": "閎夭之徒患之。",
          "translations": []
        },
        {
          "id": "s0061",
          "zh": "乃求有莘氏美女，驪戎之文馬，有熊九駟，他奇怪物，因殷嬖臣費仲而獻之紂。",
          "translations": []
        },
        {
          "id": "s0062",
          "zh": "紂大說，曰：「此一物足以釋西伯，況其多乎！」",
          "translations": []
        },
        {
          "id": "s0063",
          "zh": "乃赦西伯，賜之弓矢斧鉞，使西伯得征伐。",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "曰：「譖西伯者，崇侯虎也。」",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "西伯乃獻洛西之地，以請紂去炮格之刑。",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "紂許之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Chonghou Hu slandered Xi Bo to King Zhou of Yin: 'Xi Bo accumulates virtue and goodness. All the feudal lords turn to him - this will be disadvantageous to Your Majesty.' King Zhou therefore imprisoned Xi Bo at Youli. Hongyao and his companions were troubled by this. They sought beautiful women from the Youshen clan, patterned horses from the Lirong barbarians, nine teams of bears, and other strange treasures. Through the Yin favorite Fei Zhong, they presented them to King Zhou. King Zhou was greatly pleased and said: 'Even one of these treasures would be enough to release Xi Bo, let alone so many!' He therefore pardoned Xi Bo, granted him bows, arrows, axes, and battle-axes, allowing Xi Bo to campaign against others. He said: 'The one who slandered Xi Bo was Chonghou Hu.' Xi Bo then offered the land west of the Luo River to request that King Zhou abolish the punishment of burning at the stake. King Zhou agreed to this.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "西伯陰行善，諸侯皆來決平。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "於是虞、芮之人有獄不能決，乃如周。",
          "translations": []
        },
        {
          "id": "s0069",
          "zh": "入界，耕者皆讓畔，民俗皆讓長。",
          "translations": []
        },
        {
          "id": "s0070",
          "zh": "虞、芮之人未見西伯，皆慚，相謂曰：「吾所爭，周人所恥，何往為，秖取辱耳。」",
          "translations": []
        },
        {
          "id": "s0071",
          "zh": "遂還，俱讓而去。",
          "translations": []
        },
        {
          "id": "s0072",
          "zh": "諸侯聞之，曰「西伯蓋受命之君」。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Xi Bo secretly practiced goodness, and all the feudal lords came to him for judgments and settlements. Thus, when the people of Yu and Rui had a dispute they could not resolve, they went to Zhou. Upon entering Zhou territory, the farmers all yielded their fields to one another, and the people yielded precedence to their elders. The people of Yu and Rui, before even seeing Xi Bo, were ashamed. They said to each other: 'What we fight over, the Zhou people consider shameful. Why go there? We'd only bring humiliation on ourselves.' They therefore returned, each yielding to the other as they departed. When the feudal lords heard of this, they said: 'Xi Bo is indeed a lord who has received the mandate.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "明年，伐犬戎。",
          "translations": []
        },
        {
          "id": "s0074",
          "zh": "明年，伐密須。",
          "translations": []
        },
        {
          "id": "s0075",
          "zh": "明年，敗耆國。",
          "translations": []
        },
        {
          "id": "s0076",
          "zh": "殷之祖伊聞之，懼，以告帝紂。",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "紂曰：「不有天命乎？",
          "translations": []
        },
        {
          "id": "s0078",
          "zh": "是何能為！」",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "明年，伐邘。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "明年，伐崇侯虎。",
          "translations": []
        },
        {
          "id": "s0081",
          "zh": "而作豐邑，自岐下而徙都豐。",
          "translations": []
        },
        {
          "id": "s0082",
          "zh": "明年，西伯崩，太子發立，是為武王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, he attacked the Quanrong. The next year, he attacked Mi Xu. The next year, he defeated the state of Qi. When Zu Yi of Yin heard of this, he was afraid and reported it to King Zhou. King Zhou said: 'Is there not the Heavenly Mandate? What can they possibly do!' The next year, he attacked Tang. The next year, he attacked Chonghou Hu. He built the city of Feng and moved the capital from below Mount Qi to Feng. The next year, Xi Bo died, and Crown Prince Fa succeeded him, known as King Wu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0083",
          "zh": "西伯蓋即位五十年。",
          "translations": []
        },
        {
          "id": "s0084",
          "zh": "其囚羑里，蓋益易之八卦為六十四卦。",
          "translations": []
        },
        {
          "id": "s0085",
          "zh": "詩人道西伯，蓋受命之年稱王而斷虞芮之訟。",
          "translations": []
        },
        {
          "id": "s0086",
          "zh": "後十年而崩，謚為文王。",
          "translations": []
        },
        {
          "id": "s0087",
          "zh": "改法度，制正朔矣。",
          "translations": []
        },
        {
          "id": "s0088",
          "zh": "追尊古公為太王，公季為王季：蓋王瑞自太王興。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Xi Bo had reigned for fifty years. During his imprisonment at Youli, he expanded the Changes from eight trigrams to sixty-four hexagrams. The poets record that Xi Bo, in the year he received the mandate, was called king and judged the dispute between Yu and Rui. Ten years later he died and was posthumously titled King Wen. He reformed the laws and established the calendar. He posthumously honored Gu Gong as Tai Wang and Gong Ji as Wang Ji: indeed, the kingly omens began with Tai Wang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0089",
          "zh": "武王即位，太公望為師，周公旦為輔，召公、畢公之徒左右王，師修文王緒業。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When King Wu ascended the throne, Tai Gong Wang served as his master strategist, Zhou Gong Dan as his assistant, and the Duke of Shao, Duke of Bi, and others stood by the king's side. They continued to build on King Wen's legacy.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "九年，武王上祭于畢。",
          "translations": []
        },
        {
          "id": "s0091",
          "zh": "東觀兵，至于盟津。",
          "translations": []
        },
        {
          "id": "s0092",
          "zh": "為文王木主，載以車，中軍。",
          "translations": []
        },
        {
          "id": "s0093",
          "zh": "武王自稱太子發，言奉文王以伐，不敢自專。",
          "translations": []
        },
        {
          "id": "s0094",
          "zh": "乃告司馬、司徒、司空、諸節：「齊栗，信哉！",
          "translations": []
        },
        {
          "id": "s0095",
          "zh": "予無知，以先祖有德臣，小子受先功，畢立賞罰，以定其功。」",
          "translations": []
        },
        {
          "id": "s0096",
          "zh": "遂興師。",
          "translations": []
        },
        {
          "id": "s0097",
          "zh": "師尚父號曰：「總爾眾庶，與爾舟楫，後至者斬。」",
          "translations": []
        },
        {
          "id": "s0098",
          "zh": "武王渡河，中流，白魚躍入王舟中，武王俯取以祭。",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "既渡，有火自上復于下，至于王屋，流為烏，其色赤，其聲魄云。",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "是時，諸侯不期而會盟津者八百諸侯。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "諸侯皆曰：「紂可伐矣。」",
          "translations": []
        },
        {
          "id": "s0102",
          "zh": "武王曰：「女未知天命，未可也。」",
          "translations": []
        },
        {
          "id": "s0103",
          "zh": "乃還師歸。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the ninth year, King Wu offered sacrifices at Bi. He reviewed the troops to the east, reaching Mengjin. He made a wooden spirit tablet for King Wen, loaded it on a carriage, and placed it in the center of the army. King Wu called himself Crown Prince Fa, saying he was carrying out King Wen's will in the campaign, not daring to act on his own authority. He addressed the Minister of War, Minister of Education, Minister of Works, and all officers: 'Be orderly and respectful, be trustworthy!' 'I am inexperienced, but my ancestors had worthy ministers. I, the young one, receive their previous achievements. I will fully establish rewards and punishments to settle their merits.' Thus he raised the army. Master Shangfu shouted: 'Gather your multitudes with boats and oars - those who arrive late will be executed!' King Wu crossed the Yellow River; in mid-stream, a white fish leaped into the king's boat. King Wu bent down, took it, and offered it as a sacrifice. After crossing, fire descended from above to below, reaching Wangwu Mountain, flowing into crows whose color was red, whose sound was like thunder. At this time, eight hundred feudal lords gathered at Mengjin without prior appointment. All the feudal lords said: 'King Zhou can be attacked.' King Wu said: 'You do not know the Heavenly Mandate yet. It is not yet time.' Thus he returned the army home.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "居二年，聞紂昏亂暴虐滋甚，殺王子比干，囚箕子。",
          "translations": []
        },
        {
          "id": "s0105",
          "zh": "太師疵、少師彊抱其樂器而奔周。",
          "translations": []
        },
        {
          "id": "s0106",
          "zh": "於是武王遍告諸侯曰：「殷有重罪，不可以不畢伐。」",
          "translations": []
        },
        {
          "id": "s0107",
          "zh": "乃遵文王，遂率戎車三百乘，虎賁三千人，甲士四萬五千人，以東伐紂。",
          "translations": []
        },
        {
          "id": "s0108",
          "zh": "十一年十二月戊午，師畢渡盟津，諸侯咸會。",
          "translations": []
        },
        {
          "id": "s0109",
          "zh": "曰：「孳孳無怠！」",
          "translations": []
        },
        {
          "id": "s0110",
          "zh": "武王乃作太誓，告于眾庶：「今殷王紂乃用其婦人之言，自絕于天，毀壞其三正，離逖其王父母弟，乃斷棄其先祖之樂，乃為淫聲，用變亂正聲，怡說婦人。",
          "translations": []
        },
        {
          "id": "s0111",
          "zh": "故今予發維共行天罰。",
          "translations": []
        },
        {
          "id": "s0112",
          "zh": "勉哉夫子，不可再，不可三！」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Two years passed, and he heard that King Zhou's confusion and tyranny had grown even worse - he had killed Prince Bi Gan and imprisoned Ji Zi. The Grand Music Master Chi and Junior Music Master Qiang embraced their musical instruments and fled to Zhou. Thus King Wu announced to all the feudal lords: 'Yin has grave crimes; we cannot but attack them completely.' He followed King Wen's will and led 300 war chariots, 3,000 tiger warriors, and 45,000 armored soldiers to attack King Zhou to the east. In the eleventh year, twelfth month, wuwu day, the entire army crossed Mengjin, and all the feudal lords assembled. He said: 'Be diligent without slackening!' King Wu made the Great Oath and announced to the multitudes: 'Now the Yin king Zhou uses the words of his women, cuts himself off from Heaven, destroys his three chief ministers, separates himself from his royal parents and brothers, discards his ancestors' music, makes licentious sounds, uses them to change and confuse the proper sounds, and delights in women.' Therefore now I, Fa, will jointly execute Heaven's punishment.' Strive, gentlemen! This cannot be done twice, cannot be done three times!'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0114",
          "zh": "二月甲子昧爽，武王朝至于商郊牧野，乃誓。",
          "translations": []
        },
        {
          "id": "s0115",
          "zh": "武王左杖黃鉞，右秉白旄，以麾。",
          "translations": []
        },
        {
          "id": "s0116",
          "zh": "曰：「遠矣西土之人！」",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "武王曰：「嗟！",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "我有國冢君，司徒、司馬、司空，亞旅、師氏，千夫長、百夫長，及庸、蜀、羌、髳、微、纑、彭、濮人，稱爾戈，比爾干，立爾矛，予其誓。」",
          "translations": []
        },
        {
          "id": "s0119",
          "zh": "王曰：「古人有言『牝雞無晨。",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "牝雞之晨，惟家之索』。",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "今殷王紂維婦人言是用，自棄其先祖肆祀不答，昏棄其家國，遺其王父母弟不用，乃維四方之多罪逋逃是崇是長，是信是使，俾暴虐于百姓，以姦軌于商國。",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "今予發維共行天之罰。",
          "translations": []
        },
        {
          "id": "s0123",
          "zh": "今日之事，不過六步七步，乃止齊焉，夫子勉哉！",
          "translations": []
        },
        {
          "id": "s0124",
          "zh": "不過於四伐五伐六伐七伐，乃止齊焉，勉哉夫子！",
          "translations": []
        },
        {
          "id": "s0125",
          "zh": "尚桓桓，如虎如羆，如豺如離，于商郊，不御克奔，以役西土，勉哉夫子！",
          "translations": []
        },
        {
          "id": "s0126",
          "zh": "爾所不勉，其于爾身有戮。」",
          "translations": []
        },
        {
          "id": "s0127",
          "zh": "誓已，諸侯兵會者車四千乘，陳師牧野。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the second month, on jiazi day at dawn, King Wu arrived at the Shang suburb of Muye and made his oath. King Wu held the yellow battle-axe in his left hand and the white yak-tail banner in his right, using them to direct his forces. He said: 'How distant are the people of the western lands!' King Wu said: 'Alas! I have the great lords of states, the Ministers of Education, War, and Works, the subordinate officers and commanders, captains of a thousand and captains of a hundred, and the people of Yong, Shu, Qiang, Mao, Wei, Lu, Peng, and Pu. Raise your spears, array your shields, set your lances - I will make my oath.' The king said: 'The ancients had a saying: \"The hen does not crow at dawn.\" If the hen crows at dawn, it brings ruin to the family.\"' Now the Yin king Zhou uses only the words of women, abandons his ancestors' generous sacrifices without response, carelessly abandons his state and family, neglects his royal parents and brothers without employing them, but honors and promotes the many criminals and fugitives from the four directions, trusts and employs them, causing violence and oppression to the common people, bringing chaos and rebellion to the Shang state.' Now I, Fa, will jointly execute Heaven's punishment.' Today's battle will be decided in six steps, seven steps - then we will stop and rally. Strive, gentlemen!' No more than four strikes, five strikes, six strikes, seven strikes - then stop and rally. Strive, gentlemen!' Be stern and resolute, like tigers and bears, like wolves and leopards, here in the Shang suburbs. Do not resist those who submit, do not pursue those who flee, to serve the western lands. Strive, gentlemen!' If you do not strive, punishment will fall upon your persons.' After the oath, the feudal lords' assembled forces numbered 4,000 chariots, drawn up in battle array at Muye.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0128",
          "zh": "帝紂聞武王來，亦發兵七十萬人距武王。",
          "translations": []
        },
        {
          "id": "s0129",
          "zh": "武王使師尚父與百夫致師，以大卒馳帝紂師。",
          "translations": []
        },
        {
          "id": "s0130",
          "zh": "紂師雖眾，皆無戰之心，心欲武王亟入。",
          "translations": []
        },
        {
          "id": "s0131",
          "zh": "紂師皆倒兵以戰，以開武王。",
          "translations": []
        },
        {
          "id": "s0132",
          "zh": "武王馳之，紂兵皆崩畔紂。",
          "translations": []
        },
        {
          "id": "s0133",
          "zh": "紂走，反入登于鹿臺之上，蒙衣其殊玉，自燔于火而死。",
          "translations": []
        },
        {
          "id": "s0134",
          "zh": "武王持大白旗以麾諸侯，諸侯畢拜武王，武王乃揖諸侯，諸侯畢從。",
          "translations": []
        },
        {
          "id": "s0135",
          "zh": "武王至商國，商國百姓咸待於郊。",
          "translations": []
        },
        {
          "id": "s0136",
          "zh": "於是武王使群臣告語商百姓曰：「上天降休！」",
          "translations": []
        },
        {
          "id": "s0137",
          "zh": "商人皆再拜稽首，武王亦答拜。",
          "translations": []
        },
        {
          "id": "s0138",
          "zh": "遂入，至紂死所。",
          "translations": []
        },
        {
          "id": "s0139",
          "zh": "武王自射之，三發而後下車，以輕劍擊之，以黃鉞斬紂頭，縣大白之旗。",
          "translations": []
        },
        {
          "id": "s0140",
          "zh": "已而至紂之嬖妾二女，二女皆經自殺。",
          "translations": []
        },
        {
          "id": "s0141",
          "zh": "武王又射三發，擊以劍，斬以玄鉞，縣其頭小白之旗。",
          "translations": []
        },
        {
          "id": "s0142",
          "zh": "武王已乃出復軍。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When King Zhou heard that King Wu was coming, he also sent out 700,000 men to oppose King Wu. King Wu sent Master Shangfu and the captains of a hundred to lead the advance, charging the main force against King Zhou's army. Though King Zhou's army was numerous, none had the will to fight; their hearts wished for King Wu to enter quickly. King Zhou's troops all turned their weapons around to fight, opening the way for King Wu. King Wu charged forward, and King Zhou's troops all collapsed and turned against him. King Zhou fled, returned and ascended the Deer Tower, covered himself with his precious jades, and burned himself to death in the fire. King Wu held the great white banner to direct the feudal lords; all the lords bowed to King Wu, then King Wu bowed to the lords, and all the lords followed him. King Wu arrived at the Shang capital, and all the common people of Shang waited for him in the suburbs. Thus King Wu sent his ministers to announce to the Shang common people: 'Heaven has sent down blessing!' The Shang people all bowed twice with heads to the ground; King Wu also returned their bows. Thus he entered the palace and went to where King Zhou had died. King Wu himself shot at him, three arrows, then dismounted, struck him with a light sword, decapitated him with the yellow battle-axe, and hung his head from the great white banner. Then he came to King Zhou's two favored concubines; both women had hanged themselves. King Wu shot them three times each, struck them with his sword, decapitated them with the black battle-axe, and hung their heads from the small white banner. King Wu then went out to return to his army.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0143",
          "zh": "其明日，除道，修社及商紂宮。",
          "translations": []
        },
        {
          "id": "s0144",
          "zh": "及期，百夫荷罕旗以先驅。",
          "translations": []
        },
        {
          "id": "s0145",
          "zh": "武王弟叔振鐸奉陳常車，周公旦把大鉞，畢公把小鉞，以夾武王。",
          "translations": []
        },
        {
          "id": "s0146",
          "zh": "散宜生、太顛、閎夭皆執劍以衛武王。",
          "translations": []
        },
        {
          "id": "s0147",
          "zh": "既入，立于社南大卒之左，［左］右畢從。",
          "translations": []
        },
        {
          "id": "s0148",
          "zh": "毛叔鄭奉明水，衛康叔封布茲，召公奭贊采，師尚父牽牲。",
          "translations": []
        },
        {
          "id": "s0149",
          "zh": "尹佚筴祝曰：「殷之末孫季紂，殄廢先王明德，侮蔑神祇不祀，昏暴商邑百姓，其章顯聞于天皇上帝。」",
          "translations": []
        },
        {
          "id": "s0150",
          "zh": "於是武王再拜稽首，曰：「膺更大命，革殷，受天明命。」",
          "translations": []
        },
        {
          "id": "s0151",
          "zh": "武王又再拜稽首，乃出。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next day, he cleared the roads and repaired the altars and King Zhou's palace. When the time came, the captains of a hundred carried the rare banner to lead the way. King Wu's younger brother Uncle Zhen Duo held the regular chariot, Zhou Gong Dan grasped the great battle-axe, Bi Gong grasped the small battle-axe, flanking King Wu on both sides. San Yisheng, Tai Dian, and Hong Yao all held swords to guard King Wu. When they entered, they stood south of the altar, to the left of the great army, with followers on both sides. Mao Shu Zheng presented the clear water, Wei Kang Shu spread the rushes, Shao Gong Shi recited the liturgy, and Master Shangfu led the sacrificial animal. Yin Yi beat the drum and made the invocation: 'Yin's last descendant, Ji Zhou, has extinguished and abandoned the enlightened virtue of the former kings, insulted and neglected the gods without sacrifice, tyrannized over the people of Shang, and his crimes are clearly heard by the Heavenly Sovereign.' Thus King Wu bowed twice with head to ground and said: 'I receive this great mandate, to overthrow Yin and accept Heaven's enlightened command.' King Wu again bowed twice with head to ground, then departed.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0152",
          "zh": "封商紂子祿父殷之餘民。",
          "translations": []
        },
        {
          "id": "s0153",
          "zh": "武王為殷初定未集，乃使其弟管叔鮮、蔡叔度相祿父治殷。",
          "translations": []
        },
        {
          "id": "s0154",
          "zh": "已而命召公釋箕子之囚。",
          "translations": []
        },
        {
          "id": "s0155",
          "zh": "命畢公釋百姓之囚，表商容之閭。",
          "translations": []
        },
        {
          "id": "s0156",
          "zh": "命南宮括散鹿臺之財，發鉅橋之粟，以振貧弱萌隸。",
          "translations": []
        },
        {
          "id": "s0157",
          "zh": "命南宮括、史佚展九鼎保玉。",
          "translations": []
        },
        {
          "id": "s0158",
          "zh": "命閎夭封比干之墓。",
          "translations": []
        },
        {
          "id": "s0159",
          "zh": "命宗祝享祠于軍。",
          "translations": []
        },
        {
          "id": "s0160",
          "zh": "乃罷兵西歸。",
          "translations": []
        },
        {
          "id": "s0161",
          "zh": "行狩，記政事，作武成。",
          "translations": []
        },
        {
          "id": "s0162",
          "zh": "封諸侯，班賜宗彝，作分殷之器物。",
          "translations": []
        },
        {
          "id": "s0163",
          "zh": "武王追思先聖王，乃褒封神農之後於焦，黃帝之後於祝，帝堯之後於薊，帝舜之後於陳，大禹之後於杞。",
          "translations": []
        },
        {
          "id": "s0164",
          "zh": "於是封功臣謀士，而師尚父為首封。",
          "translations": []
        },
        {
          "id": "s0165",
          "zh": "封尚父於營丘，曰齊。",
          "translations": []
        },
        {
          "id": "s0166",
          "zh": "封弟周公旦於曲阜，曰魯。",
          "translations": []
        },
        {
          "id": "s0167",
          "zh": "封召公奭於燕。",
          "translations": []
        },
        {
          "id": "s0168",
          "zh": "封弟叔鮮於管，弟叔度於蔡。",
          "translations": []
        },
        {
          "id": "s0169",
          "zh": "餘各以次受封。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He enfeoffed King Zhou's son Lu Fu with the remaining Yin people. Since Yin had just been conquered and was not yet settled, King Wu sent his younger brothers Guan Shu Xian and Cai Shu Du to assist Lu Fu in governing Yin. Then he commanded Shao Gong to release Ji Zi from prison. He commanded Bi Gong to release the prisoners of the common people and honor Shang Rong's neighborhood. He commanded Nan Gong Kuo to distribute the treasures of the Deer Tower and open the granaries of Ju Qiao to relieve the poor, weak, widows, and orphans. He commanded Nan Gong Kuo and Shi Yi to display the Nine Tripods and the precious jade. He commanded Hong Yao to honor Bi Gan's tomb. He commanded the ancestral priests to offer sacrifices in the army. Thus he disbanded the army and returned west. He went hunting, recorded governmental affairs, and composed the 'Completion of the War.' He enfeoffed the feudal lords, distributed ancestral vessels, and made the ritual objects for dividing Yin. King Wu, reflecting on the ancient sage kings, honored and enfeoffed the descendants of Shen Nong at Jiao, Huang Di at Zhu, Emperor Yao at Ji, Emperor Shun at Chen, and Great Yu at Qi. Thus he enfeoffed the meritorious officials and counselors, with Master Shangfu receiving the first enfeoffment. He enfeoffed Shangfu at Yingqiu, calling it Qi. He enfeoffed his younger brother Zhou Gong Dan at Qufu, calling it Lu. He enfeoffed Shao Gong Shi at Yan. He enfeoffed his younger brother Shu Xian at Guan and his younger brother Shu Du at Cai. The others each received enfeoffments in order.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0170",
          "zh": "武王徵九牧之君，登豳之阜，以望商邑。",
          "translations": []
        },
        {
          "id": "s0171",
          "zh": "武王至于周，自夜不寐。",
          "translations": []
        },
        {
          "id": "s0172",
          "zh": "周公旦即王所，曰：「曷為不寐？」",
          "translations": []
        },
        {
          "id": "s0173",
          "zh": "王曰：「告女：維天不饗殷，自發未生於今六十年，麋鹿在牧，蜚鴻滿野。",
          "translations": []
        },
        {
          "id": "s0174",
          "zh": "天不享殷，乃今有成。",
          "translations": []
        },
        {
          "id": "s0175",
          "zh": "維天建殷，其登名民三百六十夫，不顯亦不賓滅，以至今。",
          "translations": []
        },
        {
          "id": "s0176",
          "zh": "我未定天保，何暇寐！」",
          "translations": []
        },
        {
          "id": "s0177",
          "zh": "王曰：「定天保，依天室，悉求夫惡，貶從殷王受。",
          "translations": []
        },
        {
          "id": "s0178",
          "zh": "日夜勞來定我西土，我維顯服，及德方明。",
          "translations": []
        },
        {
          "id": "s0179",
          "zh": "自洛汭延于伊汭，居易毋固，其有夏之居。",
          "translations": []
        },
        {
          "id": "s0180",
          "zh": "我南望三涂，北望嶽鄙，顧詹有河，粵詹雒、伊，毋遠天室。」",
          "translations": []
        },
        {
          "id": "s0181",
          "zh": "營周居于雒邑而後去。",
          "translations": []
        },
        {
          "id": "s0182",
          "zh": "縱馬於華山之陽，放牛於桃林之虛；",
          "translations": []
        },
        {
          "id": "s0183",
          "zh": "偃干戈，振兵釋旅：示天下不復用也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Wu summoned the lords of the nine provinces, ascended the hill of Bin, and gazed upon the city of Shang. King Wu arrived at Zhou, and from that night he could not sleep. The Duke of Zhou approached the king's quarters and said: 'Why can you not sleep?' The king said: 'I tell you: Heaven no longer accepts offerings from Yin. From the time Fa was born until now, sixty years have passed. Deer roam in the pastures, wild geese fill the fields. Heaven does not accept Yin's offerings, and now success has come.' Heaven established Yin, raising up worthy men numbering 360, but they were neither illustrious nor submissive to extinction, lasting until now.' I have not yet secured Heaven's protection - how can I sleep!' The king said: 'To secure Heaven's protection, rely on the heavenly abode, seek out all the evil ones, demote those who followed King Zhou of Yin. Day and night work to secure my western lands. I will be illustrious and submissive, and virtue will shine forth. From the Luo bend extending to the Yi bend, dwell peacefully without stubbornness, possessing the dwelling of Xia.' I look south to Santu, north to the borders of Mount Yue, see the Yellow River, and also the Luo and Yi rivers, not far from the heavenly abode.' He built the Zhou settlement at Luoyi and then departed. He let horses run free on the southern slopes of Mount Hua, released oxen in the wilderness of Taolin; Laid down weapons and spears, rested the troops and dismissed the armies: showing the world they would not be used again.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0184",
          "zh": "武王已克殷，後二年，問箕子殷所以亡。",
          "translations": []
        },
        {
          "id": "s0185",
          "zh": "箕子不忍言殷惡，以存亡國宜告。",
          "translations": []
        },
        {
          "id": "s0186",
          "zh": "武王亦醜，故問以天道。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Wu had already conquered Yin; two years later, he asked Ji Zi why Yin had perished. Ji Zi could not bear to speak of Yin's evils, so spoke of the principles for the preservation and destruction of states. King Wu also considered it shameful, so asked about the Way of Heaven.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0187",
          "zh": "武王病。",
          "translations": []
        },
        {
          "id": "s0188",
          "zh": "天下未集，群公懼，穆卜，周公乃祓齋，自為質，欲代武王，武王有瘳。",
          "translations": []
        },
        {
          "id": "s0189",
          "zh": "後而崩，太子誦代立，是為成王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Wu fell ill. The world was not yet settled, the nobles were afraid. They divined with the tortoise shell, and the Duke of Zhou purified himself and fasted, offered himself as hostage, wishing to take King Wu's place. King Wu recovered. Later he died, and Crown Prince Song succeeded him, known as King Cheng.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "成王少，周初定天下，周公恐諸侯畔周，公乃攝行政當國。",
          "translations": []
        },
        {
          "id": "s0191",
          "zh": "管叔、蔡叔群弟疑周公，與武庚作亂，畔周。",
          "translations": []
        },
        {
          "id": "s0192",
          "zh": "周公奉成王命，伐誅武庚、管叔，放蔡叔。",
          "translations": []
        },
        {
          "id": "s0193",
          "zh": "以微子開代殷後，國於宋。",
          "translations": []
        },
        {
          "id": "s0194",
          "zh": "頗收殷餘民，以封武王少弟封為衛康叔。",
          "translations": []
        },
        {
          "id": "s0195",
          "zh": "晉唐叔得嘉穀，獻之成王，成王以歸周公于兵所。",
          "translations": []
        },
        {
          "id": "s0196",
          "zh": "周公受禾東土，魯天子之命。",
          "translations": []
        },
        {
          "id": "s0197",
          "zh": "初，管、蔡畔周，周公討之，三年而畢定，故初作大誥，次作微子之命，次歸禾，次嘉禾，次康誥、酒誥、梓材，其事在周公之篇。",
          "translations": []
        },
        {
          "id": "s0198",
          "zh": "周公行政七年，成王長，周公反政成王，北面就群臣之位。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Cheng was young, Zhou had just pacified the world. The Duke of Zhou feared the feudal lords might rebel against Zhou, so he acted as regent and administered the government. Guan Shu, Cai Shu, and the other brothers suspected the Duke of Zhou, and together with Wu Geng they rebelled against Zhou. The Duke of Zhou, carrying King Cheng's command, attacked and executed Wu Geng and Guan Shu, and exiled Cai Shu. He established Wei Zi Kai as the successor to Yin, with the state of Song. He gathered many of the remaining Yin people and enfeoffed King Wu's younger brother Feng as Wei Kang Shu. Jin Tang Shu obtained excellent grain and presented it to King Cheng. King Cheng sent it to the Duke of Zhou at his military camp. The Duke of Zhou received the grain in the eastern lands, receiving the Son of Heaven's command at Lu. At first, Guan Shu and Cai Shu rebelled against Zhou. The Duke of Zhou campaigned against them, and in three years it was completely pacified. Therefore he first made the Great Announcement, then the Command to Wei Zi, then the Return of Grain, then the Excellent Grain, then the Announcement to Kang, the Wine Prohibition, and the Timber Materials. These matters are in the Duke of Zhou's chapter. The Duke of Zhou administered the government for seven years. When King Cheng grew up, the Duke of Zhou returned the government to King Cheng and took his place among the ministers, facing north.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0199",
          "zh": "成王在豐，使召公復營洛邑，如武王之意。",
          "translations": []
        },
        {
          "id": "s0200",
          "zh": "周公復卜申視，卒營筑，居九鼎焉。",
          "translations": []
        },
        {
          "id": "s0201",
          "zh": "曰：「此天下之中，四方入貢道里均。」",
          "translations": []
        },
        {
          "id": "s0202",
          "zh": "作召誥、洛誥。",
          "translations": []
        },
        {
          "id": "s0203",
          "zh": "成王既遷殷遺民，周公以王命告，作多士、無佚。",
          "translations": []
        },
        {
          "id": "s0204",
          "zh": "召公為保，周公為師，東伐淮夷，殘奄，遷其君薄泵。",
          "translations": []
        },
        {
          "id": "s0205",
          "zh": "成王自奄歸，在宗周，作多方。",
          "translations": []
        },
        {
          "id": "s0206",
          "zh": "既絀殷命，襲淮夷，歸在豐，作周官。",
          "translations": []
        },
        {
          "id": "s0207",
          "zh": "興正禮樂，度制於是改，而民和睦，頌聲興。",
          "translations": []
        },
        {
          "id": "s0208",
          "zh": "成王既伐東夷，息慎來賀，王賜榮伯作賄息慎之命。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Cheng was at Feng, and he sent Shao Gong to rebuild Luoyi, following King Wu's intentions. The Duke of Zhou again divined and inspected, and finally built and fortified it, placing the Nine Tripods there. He said: 'This is the center of the world; the distances for tribute from the four directions are equal.' He made the Announcement of Shao and the Announcement of Luo. After King Cheng moved the remaining Yin people, the Duke of Zhou announced with the king's command, making the Many Officers and the No Sloth. Shao Gong served as protector, the Duke of Zhou as master strategist. They attacked east against the Huai Yi, destroyed Yan, and moved their ruler to Bo Peng. King Cheng returned from Yan and was at Zongzhou, making the Many Regions. After ending the Yin mandate and attacking the Huai Yi, he returned to Feng and made the Zhou Officials. He promoted correct rites and music, and the measurements and regulations were thereby reformed. The people were harmonious, and the songs of praise arose. After King Cheng attacked the eastern Yi, the Xi Shen came to congratulate. The king commanded Rong Bo to make the Command with Gifts to Xi Shen.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0209",
          "zh": "成王將崩，懼太子釗之不任，乃命召公、畢公率諸侯以相太子而立之。",
          "translations": []
        },
        {
          "id": "s0210",
          "zh": "成王既崩，二公率諸侯，以太子釗見於先王廟，申告以文王、武王之所以為王業之不易，務在節儉，毋多欲，以篤信臨之，作顧命。",
          "translations": []
        },
        {
          "id": "s0211",
          "zh": "太子釗遂立，是為康王。",
          "translations": []
        },
        {
          "id": "s0212",
          "zh": "康王即位，遍告諸侯，宣告以文武之業以申之，作《康誥》。",
          "translations": []
        },
        {
          "id": "s0213",
          "zh": "故成康之際，天下安寧，刑錯四十餘年不用。",
          "translations": []
        },
        {
          "id": "s0214",
          "zh": "康王命作策畢公分居里，成周郊，作《畢命》。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Cheng was about to die and feared that Crown Prince Zhao might not be capable, so he commanded Shao Gong and Bi Gong to lead the feudal lords to assist the crown prince and establish him. After King Cheng died, the two nobles led the feudal lords and presented Crown Prince Zhao at the ancestral temple, solemnly declaring that the kingly enterprise of King Wen and King Wu was not easy to maintain, emphasizing frugality and few desires, to govern with sincere faith. They made the Testamentary Charge. Crown Prince Zhao thus ascended the throne, known as King Kang. King Kang ascended the throne and announced to all the feudal lords, declaring the enterprise of King Wen and King Wu to confirm it, making the Announcement to Kang. Therefore during the reigns of King Cheng and King Kang, the world was peaceful, and the punishments were set aside for over forty years without being used. King Kang commanded to make a document for Bi Gong to divide the residences in the suburbs of Chengzhou, making the Command to Bi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0215",
          "zh": "康王卒，子昭王瑕立。",
          "translations": []
        },
        {
          "id": "s0216",
          "zh": "昭王之時，王道微缺。",
          "translations": []
        },
        {
          "id": "s0217",
          "zh": "昭王南巡狩不返，卒於江上。",
          "translations": []
        },
        {
          "id": "s0218",
          "zh": "其卒不赴告，諱之也。",
          "translations": []
        },
        {
          "id": "s0219",
          "zh": "立昭王子滿，是為穆王。",
          "translations": []
        },
        {
          "id": "s0220",
          "zh": "穆王即位，春秋已五十矣。",
          "translations": []
        },
        {
          "id": "s0221",
          "zh": "王道衰微，穆王閔文武之道缺，乃命伯臩申誡太仆國之政，作臩命。",
          "translations": []
        },
        {
          "id": "s0222",
          "zh": "復寧。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Kang died, his son King Zhao Xia ascended. During King Zhao's time, the king's way was slightly deficient. King Zhao toured the south and did not return, died on the Yangtze River. His death was not announced, they concealed it. King Zhao's son Man ascended, known as King Mu. King Mu ascended the throne, his age was already fifty years. The king's way declined, King Mu grieved that the way of King Wen and King Wu was deficient, so he commanded Bo Jian to declare the policies to the Grand Master of the state, making the Command to Jian. Again peaceful.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0223",
          "zh": "穆王將征犬戎，祭公謀父諫曰：「不可。",
          "translations": []
        },
        {
          "id": "s0224",
          "zh": "先王燿德不觀兵。",
          "translations": []
        },
        {
          "id": "s0225",
          "zh": "夫兵戢而時動，動則威，觀則玩，玩則無震。",
          "translations": []
        },
        {
          "id": "s0226",
          "zh": "是故周文公之頌曰：『載戢干戈，載櫜弓矢，我求懿德，肆于時夏，允王保之。』",
          "translations": []
        },
        {
          "id": "s0227",
          "zh": "先王之於民也，茂正其德而厚其性，阜其財求而利其器用，明利害之鄉，以文修之，使之務利而辟害，懷德而畏威，故能保世以滋大。",
          "translations": []
        },
        {
          "id": "s0228",
          "zh": "昔我先王世后稷以服事虞、夏。",
          "translations": []
        },
        {
          "id": "s0229",
          "zh": "及夏之衰也，棄稷不務，我先王不窋用失其官，而自竄於戎狄之閒。",
          "translations": []
        },
        {
          "id": "s0230",
          "zh": "不敢怠業，時序其德，遵修其緒，修其訓典，朝夕恪勤，守以敦篤，奉以忠信。",
          "translations": []
        },
        {
          "id": "s0231",
          "zh": "奕世載德，不忝前人。",
          "translations": []
        },
        {
          "id": "s0232",
          "zh": "至于文王、武王，昭前之光明而加之以慈和，事神保民，無不欣喜。",
          "translations": []
        },
        {
          "id": "s0233",
          "zh": "商王帝辛大惡于民，庶民不忍，訢載武王，以致戎于商牧。",
          "translations": []
        },
        {
          "id": "s0234",
          "zh": "是故先王非務武也，勸恤民隱而除其害也。",
          "translations": []
        },
        {
          "id": "s0235",
          "zh": "夫先王之制，邦內甸服，邦外侯服，侯衛賓服，夷蠻要服，戎翟荒服。",
          "translations": []
        },
        {
          "id": "s0236",
          "zh": "甸服者祭，侯服者祀，賓服者享，要服者貢，荒服者王。",
          "translations": []
        },
        {
          "id": "s0237",
          "zh": "日祭，月祀，時享，歲貢，終王。",
          "translations": []
        },
        {
          "id": "s0238",
          "zh": "先王之順祀也，有不祭則修意，有不祀則修言，有不享則修文，有不貢則修名，有不王則修德，序成而有不至則修刑。",
          "translations": []
        },
        {
          "id": "s0239",
          "zh": "於是有刑不祭，伐不祀，征不享，讓不貢，告不王。",
          "translations": []
        },
        {
          "id": "s0240",
          "zh": "於是有刑罰之辟，有攻伐之兵，有征討之備，有威讓之命，有文告之辭。",
          "translations": []
        },
        {
          "id": "s0241",
          "zh": "布令陳辭而有不至，則增修於德，無勤民於遠。",
          "translations": []
        },
        {
          "id": "s0242",
          "zh": "是以近無不聽，遠無不服。",
          "translations": []
        },
        {
          "id": "s0243",
          "zh": "今自大畢、伯士之終也，犬戎氏以其職來王，天子曰『予必以不享征之，且觀之兵』，無乃廢先王之訓，而王幾頓乎？",
          "translations": []
        },
        {
          "id": "s0244",
          "zh": "吾聞犬戎樹敦，率舊德而守終純固，其有以御我矣。」",
          "translations": []
        },
        {
          "id": "s0245",
          "zh": "王遂征之，得四白狼四白鹿以歸。",
          "translations": []
        },
        {
          "id": "s0246",
          "zh": "自是荒服者不至。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Mu was about to campaign against the Quanrong, Ji Gong Moufu advised: 'It is not permissible. The former kings displayed virtue, not reviewed troops.' Weapons are stored and move at the right time; when they move they inspire awe, when reviewed they become playthings, when playthings they have no shock. Therefore the hymn of Zhou Wen Gong says: 'We store spears and halberds, we sheath bows and arrows. I seek excellent virtue, extend it to Xia, truly the king protects it.' The former kings toward the people cultivated and corrected their virtue and thickened their nature, enriched their wealth-seeking and benefited their implements, clarified the directions of benefit and harm, and cultured them to reform, causing them to pursue benefit and avoid harm, embrace virtue and fear authority, thus able to preserve the generations and grow great. Formerly our former kings served Yu and Xia by succeeding Hou Ji. When Xia declined, they abandoned agriculture and did not attend to it. Our former king Bu Ku lost his office because of this, and hid himself among the Rong and Di. They dared not neglect the enterprise, ordered their virtue in sequence, followed and repaired their legacy, repaired their teachings and statutes, morning and evening respectfully diligent, guarded with sincerity and solidity, served with loyalty and faith. Through generations they carried virtue, not disgracing their ancestors. Until King Wen and King Wu, they illuminated the previous brightness and added kindness and harmony, served the spirits and protected the people, all were joyful. The Shang king Di Xin greatly harmed the people, the common people could not bear it, united with King Wu, to bring troops to the Shang pasture. Therefore the former kings did not pursue military matters, but encouraged care for the people's hardships and removed their harms. The former kings' system: within the state dian service, outside the state hou service, hou wei bin service, yi man yao service, rong di huang service. Dian service offers sacrifice, hou service offers worship, bin service offers tribute, yao service offers contribution, huang service offers kingly visits. Daily sacrifice, monthly worship, seasonal tribute, yearly contribution, lifetime kingly visits. The former kings' orderly sacrifices: if not sacrificed then cultivate intention, if not worshipped then cultivate speech, if not enjoyed then cultivate culture, if not contributed then cultivate reputation, if not visited then cultivate virtue, if the sequence is complete but not reached then cultivate punishment. Thus there are punishments for not sacrificing, attacks for not worshipping, campaigns for not enjoying, reprimands for not contributing, announcements for not visiting. Thus there are statutes for punishment, troops for attack, preparations for campaigns, commands for intimidation, and words for announcements. If commands are issued and announcements made but not obeyed, then increase cultivation of virtue, do not weary the people with distant campaigns. Thus the near obey without exception, the far submit without exception. Now since the end of Da Bi and Bo Shi, the Quanrong have come to serve the king with their duties. The Son of Heaven said: 'I must campaign against them for not enjoying tribute, and moreover observe their troops.' Is this not abandoning the former kings' teachings, causing the king's affairs to falter?' 'I have heard that the Quanrong plant virtue, follow old virtues and maintain pure firmness to the end, they have means to resist us.' The king then campaigned against them, obtained four white wolves and four white deer and returned. From this time the distant subjects did not come.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0247",
          "zh": "諸侯有不睦者，甫侯言於王，作修刑辟。",
          "translations": []
        },
        {
          "id": "s0248",
          "zh": "王曰：「吁，來！",
          "translations": []
        },
        {
          "id": "s0249",
          "zh": "有國有土，告汝祥刑。",
          "translations": []
        },
        {
          "id": "s0250",
          "zh": "在今爾安百姓，何擇非其人，何敬非其刑，何居非其宜與？",
          "translations": []
        },
        {
          "id": "s0251",
          "zh": "兩造具備，師聽五辭。",
          "translations": []
        },
        {
          "id": "s0252",
          "zh": "五辭簡信，正於五刑。",
          "translations": []
        },
        {
          "id": "s0253",
          "zh": "五刑不簡，正於五罰。",
          "translations": []
        },
        {
          "id": "s0254",
          "zh": "五罰不服，正於五過。",
          "translations": []
        },
        {
          "id": "s0255",
          "zh": "五過之疵，官獄內獄，閱實其罪，惟鈞其過。",
          "translations": []
        },
        {
          "id": "s0256",
          "zh": "五刑之疑有赦，五罰之疑有赦，其審克之。",
          "translations": []
        },
        {
          "id": "s0257",
          "zh": "簡信有眾，惟訊有稽。",
          "translations": []
        },
        {
          "id": "s0258",
          "zh": "無簡不疑，共嚴天威。",
          "translations": []
        },
        {
          "id": "s0259",
          "zh": "黥辟疑赦，其罰百率，閱實其罪。",
          "translations": []
        },
        {
          "id": "s0260",
          "zh": "劓辟疑赦，其罰倍灑，閱實其罪。",
          "translations": []
        },
        {
          "id": "s0261",
          "zh": "臏辟疑赦，其罰倍差，閱實其罪。",
          "translations": []
        },
        {
          "id": "s0262",
          "zh": "宮辟疑赦，其罰五百率，閱實其罪。",
          "translations": []
        },
        {
          "id": "s0263",
          "zh": "大辟疑赦，其罰千率，閱實其罪。",
          "translations": []
        },
        {
          "id": "s0264",
          "zh": "墨罰之屬千，劓罰之屬千，臏罰之屬五百，宮罰之屬三百，大辟之罰其屬二百：五刑之屬三千。」",
          "translations": []
        },
        {
          "id": "s0265",
          "zh": "命曰甫刑。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When feudal lords were not harmonious, Fu Hou spoke to the king, making the Statute for Cultivating Punishments. The king said: 'Ah, come!' You who have states and territories, I announce to you the auspicious punishments. Now you pacify the common people, what is there to choose if not the right person, what to respect if not the right punishment, what to dwell on if not what is appropriate?' Both parties are present, the judge hears the five statements. The five statements are straightforward and trustworthy, correct with the five punishments. If the five punishments are not straightforward, correct with the five fines. If the five fines are not accepted, correct with the five errors. The defects of the five errors, official prisons and inner prisons, examine the reality of their crimes, only balance their errors. If the five punishments have doubts there is amnesty, if the five fines have doubts there is amnesty, investigate and overcome them. If straightforward and trustworthy there are multitudes, only interrogation has records. Without straightforwardness there is no doubt, together awe the heavenly majesty. If tattoo punishment has doubtful amnesty, its fine is one hundred rates, examine the reality of their crime. If nose-cutting punishment has doubtful amnesty, its fine is double the scattered, examine the reality of their crime. If knee-capping punishment has doubtful amnesty, its fine is double the difference, examine the reality of their crime. If castration punishment has doubtful amnesty, its fine is five hundred rates, examine the reality of their crime. If death punishment has doubtful amnesty, its fine is one thousand rates, examine the reality of their crime. Tattoo fines belong to one thousand, nose-cutting fines belong to one thousand, knee-capping fines belong to five hundred, castration fines belong to three hundred, death fines belong to two hundred: the five punishments belong to three thousand.' It was commanded to be called Fu Punishment.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0266",
          "zh": "穆王立五十五年，崩，子共王繄扈立。",
          "translations": []
        },
        {
          "id": "s0267",
          "zh": "共王游於涇上，密康公從，有三女奔之。",
          "translations": []
        },
        {
          "id": "s0268",
          "zh": "其母曰：「必致之王。",
          "translations": []
        },
        {
          "id": "s0269",
          "zh": "夫獸三為群，人三為眾，女三為粲。",
          "translations": []
        },
        {
          "id": "s0270",
          "zh": "王田不取群，公行不下眾，王御不參一族。",
          "translations": []
        },
        {
          "id": "s0271",
          "zh": "夫粲，美之物也。",
          "translations": []
        },
        {
          "id": "s0272",
          "zh": "眾以美物歸女，而何德以堪之？",
          "translations": []
        },
        {
          "id": "s0273",
          "zh": "王猶不堪，況爾之小醜乎！",
          "translations": []
        },
        {
          "id": "s0274",
          "zh": "小醜備物，終必亡。」",
          "translations": []
        },
        {
          "id": "s0275",
          "zh": "康公不獻，一年，共王滅密。",
          "translations": []
        },
        {
          "id": "s0276",
          "zh": "共王崩，子懿王艱立。",
          "translations": []
        },
        {
          "id": "s0277",
          "zh": "懿王之時，王室遂衰，詩人作刺。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Mu reigned fifty-five years, died, his son King Gong Yi Hu ascended. King Gong toured on the Jing River, Mi Kang Gong followed, there were three women who fled to him. Their mother said: 'You must present them to the king. For beasts three make a herd, for people three make a multitude, for women three make splendor. The king when hunting does not take a herd, the duke when traveling does not bring a multitude, the king when receiving does not involve one clan. Now splendor is a beautiful thing. The multitudes present beautiful objects to you, but what virtue do you have to receive them? The king still cannot bear them, how much less can you with your petty ugliness! Petty ugliness possessing beautiful objects will ultimately perish.' Kang Gong did not present them, after one year, King Gong destroyed Mi. King Gong died, his son King Yi Jian ascended. During King Yi's time, the royal house declined, poets made satirical poems.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0278",
          "zh": "懿王崩，共王弟辟方立，是為孝王。",
          "translations": []
        },
        {
          "id": "s0279",
          "zh": "孝王崩，諸侯復立懿王太子燮，是為夷王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Yi died, King Gong's younger brother Pi Fang ascended, known as King Xiao. King Xiao died, the feudal lords again established King Yi's crown prince Xie, known as King Yi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0280",
          "zh": "夷王崩，子厲王胡立。",
          "translations": []
        },
        {
          "id": "s0281",
          "zh": "厲王即位三十年，好利，近榮夷公。",
          "translations": []
        },
        {
          "id": "s0282",
          "zh": "大夫芮良夫諫厲王曰：「王室其將卑乎？",
          "translations": []
        },
        {
          "id": "s0283",
          "zh": "夫榮公好專利而不知大難。",
          "translations": []
        },
        {
          "id": "s0284",
          "zh": "夫利，百物之所生也，天地之所載也，而有專之，其害多矣。",
          "translations": []
        },
        {
          "id": "s0285",
          "zh": "天地百物皆將取焉，何可專也？",
          "translations": []
        },
        {
          "id": "s0286",
          "zh": "所怒甚多，不備大難。",
          "translations": []
        },
        {
          "id": "s0287",
          "zh": "以是教王，王其能久乎？",
          "translations": []
        },
        {
          "id": "s0288",
          "zh": "夫王人者，將導利而布之上下者也。",
          "translations": []
        },
        {
          "id": "s0289",
          "zh": "使神人百物無不得極，猶日怵惕懼怨之來也。",
          "translations": []
        },
        {
          "id": "s0290",
          "zh": "故《頌》曰『思文后稷，克配彼天，立我蒸民，莫匪爾極』。",
          "translations": []
        },
        {
          "id": "s0291",
          "zh": "大雅曰『陳錫載周』。",
          "translations": []
        },
        {
          "id": "s0292",
          "zh": "是不布利而懼難乎，故能載周以至于今。",
          "translations": []
        },
        {
          "id": "s0293",
          "zh": "今王學專利，其可乎？",
          "translations": []
        },
        {
          "id": "s0294",
          "zh": "匹夫專利，猶謂之盜，王而行之，其歸鮮矣。",
          "translations": []
        },
        {
          "id": "s0295",
          "zh": "榮公若用，周必敗也。」",
          "translations": []
        },
        {
          "id": "s0296",
          "zh": "厲王不聽，卒以榮公為卿士，用事。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Yi died, his son King Li Hu ascended. King Li ascended the throne for thirty years, loved profit, drew close to Rong Yi Gong. The grand master Rui Liangfu advised King Li: 'Will the royal house become base? Rong Gong loves to monopolize profit and does not know great disaster. Profit is what all things are born from, what heaven and earth carry, yet someone monopolizes it, its harms are many. Heaven and earth and all things will all take from it, how can it be monopolized? Those angered are very many, not prepared for great disaster. With this I teach the king, can the king last long?' Now one who is king will guide profit and distribute it to superiors and inferiors. Cause spirits, people, and all things to each obtain their utmost, yet daily fearful and apprehensive of resentment coming. Therefore the Hymn says: 'Think of the cultured Hou Ji, able to match that heaven, establish our numerous people, none not your utmost.' The Greater Odes say: 'Display and bestow upon Zhou.' Is this not distributing profit and fearing disaster? Therefore they could carry Zhou to the present day. Now the king learns to monopolize profit, is this permissible? A common man monopolizes profit, and is still called a thief; if the king does it, his followers will be few. If Rong Gong is employed, Zhou will certainly fail.' King Li did not listen, and ultimately made Rong Gong the chief minister, who handled affairs.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0297",
          "zh": "王行暴虐侈傲，國人謗王。",
          "translations": []
        },
        {
          "id": "s0298",
          "zh": "召公諫曰：「民不堪命矣。」",
          "translations": []
        },
        {
          "id": "s0299",
          "zh": "王怒，得衛巫，使監謗者，以告則殺之。",
          "translations": []
        },
        {
          "id": "s0300",
          "zh": "其謗鮮矣，諸侯不朝。",
          "translations": []
        },
        {
          "id": "s0301",
          "zh": "三十四年，王益嚴，國人莫敢言，道路以目。",
          "translations": []
        },
        {
          "id": "s0302",
          "zh": "厲王喜，告召公曰：「吾能弭謗矣，乃不敢言。」",
          "translations": []
        },
        {
          "id": "s0303",
          "zh": "召公曰：「是鄣之也。",
          "translations": []
        },
        {
          "id": "s0304",
          "zh": "防民之口，甚於防水。",
          "translations": []
        },
        {
          "id": "s0305",
          "zh": "水壅而潰，傷人必多，民亦如之。",
          "translations": []
        },
        {
          "id": "s0306",
          "zh": "是故為水者決之使導，為民者宣之使言。",
          "translations": []
        },
        {
          "id": "s0307",
          "zh": "故天子聽政，使公卿至於列士獻詩，瞽獻曲，史獻書，師箴，瞍賦，矇誦，百工諫，庶人傳語，近臣盡規，親戚補察，瞽史教誨，耆艾修之，而後王斟酌焉，是以事行而不悖。",
          "translations": []
        },
        {
          "id": "s0308",
          "zh": "民之有口也，猶土之有山川也，財用於是乎出：猶其有原隰衍沃也，衣食於是乎生。",
          "translations": []
        },
        {
          "id": "s0309",
          "zh": "口之宣言也，善敗於是乎興。",
          "translations": []
        },
        {
          "id": "s0310",
          "zh": "行善而備敗，所以產財用衣食者也。",
          "translations": []
        },
        {
          "id": "s0311",
          "zh": "夫民慮之於心而宣之於口，成而行之。",
          "translations": []
        },
        {
          "id": "s0312",
          "zh": "若壅其口，其與能幾何？」",
          "translations": []
        },
        {
          "id": "s0313",
          "zh": "王不聽。",
          "translations": []
        },
        {
          "id": "s0314",
          "zh": "於是國莫敢出言，三年，乃相與畔，襲厲王。",
          "translations": []
        },
        {
          "id": "s0315",
          "zh": "厲王出奔於彘。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The king acted tyrannically, extravagantly, and arrogantly; the people of the capital slandered the king. Shao Gong advised: 'The people cannot bear the commands anymore.' The king was angry, obtained a shaman from Wei, made him monitor those who slandered, and if reported, killed them. Slander became rare, but the feudal lords did not come to court. In the thirty-fourth year, the king became even more severe; the people of the capital dared not speak, they communicated with their eyes on the roads. King Li was pleased, told Shao Gong: 'I have been able to stop slander; now they dare not speak.' Shao Gong said: 'This is damming it up. Blocking the people's mouths is worse than blocking water. Water that is dammed up and bursts will injure many people; the people are the same. Therefore for water one opens it to guide it, for the people one opens them to make them speak. Therefore when the Son of Heaven hears government, he causes the nobles and ministers down to the ranked scholars to present poems, the blind musicians to present songs, the historians to present books, the masters to remonstrate, the blind to recite, the sighted blind to chant, the hundred craftsmen to remonstrate, the common people to transmit words, close ministers to give full advice, relatives to supplement and examine, blind officials and historians to teach and admonish, elders to correct it, and then the king considers it, which is why affairs proceed without error. The people's having mouths is like the earth having mountains and rivers - wealth comes out from them; like having plains, marshes, plains, and fertile lands - clothing and food are born from them. The mouths' open declarations - good and bad arise from this. Practice good and prepare for failure, this is what produces wealth, implements, clothing, and food. Now the people consider it in their hearts and declare it with their mouths, complete it and carry it out. If you dam up their mouths, how long can it last?' The king did not listen. Thus no one in the state dared to speak out. After three years, they united in rebellion and attacked King Li. King Li fled to Zhi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0316",
          "zh": "厲王太子靜匿召公之家，國人聞之，乃圍之。",
          "translations": []
        },
        {
          "id": "s0317",
          "zh": "召公曰：「昔吾驟諫王，王不從，以及此難也。",
          "translations": []
        },
        {
          "id": "s0318",
          "zh": "今殺王太子，王其以我為讎而懟怒乎？",
          "translations": []
        },
        {
          "id": "s0319",
          "zh": "夫事君者，險而不讎懟，怨而不怒，況事王乎！」",
          "translations": []
        },
        {
          "id": "s0320",
          "zh": "乃以其子代王太子，太子竟得脫。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Li's crown prince Jing hid in Shao Gong's house. The people of the capital heard of it and surrounded it. Shao Gong said: 'Formerly I repeatedly advised the king, but the king did not listen, and thus we have come to this disaster. Now if we kill the king's crown prince, will the king consider me an enemy and be resentful and angry? Those who serve a lord face danger without becoming enemies or resentful, harbor resentment without anger, how much more so when serving a king!' Thus he substituted his own son for the king's crown prince, and the crown prince ultimately escaped.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0321",
          "zh": "召公、周公二相行政，號曰「共和」。",
          "translations": []
        },
        {
          "id": "s0322",
          "zh": "共和十四年，厲王死于彘。",
          "translations": []
        },
        {
          "id": "s0323",
          "zh": "太子靜長於召公家，二相乃共立之為王，是為宣王。",
          "translations": []
        },
        {
          "id": "s0324",
          "zh": "宣王即位，二相輔之，修政，法文、武、成、康之遺風，諸侯復宗周。",
          "translations": []
        },
        {
          "id": "s0325",
          "zh": "十二年，魯武公來朝。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Shao Gong and Zhou Gong, the two prime ministers, administered the government, called it 'Gonghe.' In the fourteenth year of Gonghe, King Li died at Zhi. Crown prince Jing grew up in Shao Gong's house, and the two prime ministers together established him as king, known as King Xuan. King Xuan ascended the throne, the two prime ministers assisted him, reformed the government, followed the legacy of King Wen, King Wu, King Cheng, and King Kang, and the feudal lords again took Zhou as their center. In the twelfth year, Lu Wu Gong came to court.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0326",
          "zh": "宣王不修籍於千畝，虢文公諫曰不可，王弗聽。",
          "translations": []
        },
        {
          "id": "s0327",
          "zh": "三十九年，戰于千畝，王師敗績于姜氏之戎。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Xuan did not repair the boundaries at Qianmu. Guo Wen Gong advised that it was not permissible, but the king did not listen. In the thirty-ninth year, he fought at Qianmu, and the king's army suffered a great defeat at the hands of the Jiang Rong.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0328",
          "zh": "宣王既亡南國之師，乃料民於太原。",
          "translations": []
        },
        {
          "id": "s0329",
          "zh": "仲山甫諫曰：「民不可料也。」",
          "translations": []
        },
        {
          "id": "s0330",
          "zh": "宣王不聽，卒料民。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After King Xuan lost the army of the southern states, he took a census of the people at Taiyuan. Zhong Shanfu advised: 'The people cannot be counted.' King Xuan did not listen, and ultimately took the census of the people.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0331",
          "zh": "四十六年，宣王崩，子幽王宮湦立。",
          "translations": []
        },
        {
          "id": "s0332",
          "zh": "幽王二年，西周三川皆震。",
          "translations": []
        },
        {
          "id": "s0333",
          "zh": "伯陽甫曰：「周將亡矣。",
          "translations": []
        },
        {
          "id": "s0334",
          "zh": "夫天地之氣，不失其序；",
          "translations": []
        },
        {
          "id": "s0335",
          "zh": "若過其序，民亂之也。",
          "translations": []
        },
        {
          "id": "s0336",
          "zh": "陽伏而不能出，陰迫而不能蒸，於是有地震。",
          "translations": []
        },
        {
          "id": "s0337",
          "zh": "今三川實震，是陽失其所而填陰也。",
          "translations": []
        },
        {
          "id": "s0338",
          "zh": "陽失而在陰，原必塞；",
          "translations": []
        },
        {
          "id": "s0339",
          "zh": "原塞，國必亡。",
          "translations": []
        },
        {
          "id": "s0340",
          "zh": "夫水土演而民用也。",
          "translations": []
        },
        {
          "id": "s0341",
          "zh": "土無所演，民乏財用，不亡何待！",
          "translations": []
        },
        {
          "id": "s0342",
          "zh": "昔伊、洛竭而夏亡，河竭而商亡。",
          "translations": []
        },
        {
          "id": "s0343",
          "zh": "今周德若二代之季矣，其川原又塞，塞必竭。",
          "translations": []
        },
        {
          "id": "s0344",
          "zh": "夫國必依山川，山崩川竭，亡國之徵也。",
          "translations": []
        },
        {
          "id": "s0345",
          "zh": "川竭必山崩。",
          "translations": []
        },
        {
          "id": "s0346",
          "zh": "若國亡不過十年，數之紀也。",
          "translations": []
        },
        {
          "id": "s0347",
          "zh": "天之所棄，不過其紀。」",
          "translations": []
        },
        {
          "id": "s0348",
          "zh": "是歲也，三川竭，岐山崩。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the forty-sixth year, King Xuan died, his son King You Gong Shen ascended. In King You's second year, the three rivers of Western Zhou all shook. Bo Yangfu said: 'Zhou will perish. The qi of heaven and earth do not lose their order; If they lose their order, it is because the people are in chaos. Yang is suppressed and cannot emerge, yin presses and cannot rise, therefore there are earthquakes. Now the three rivers are shaking, this is yang losing its place and being filled by yin. Yang is lost and yin prevails, the sources must be blocked; Sources blocked, the state must perish.' Water and earth spread out and the people use them. Earth has nowhere to spread, the people lack wealth and implements, if it does not perish, what is it waiting for!' Formerly when the Yi and Luo dried up, Xia perished; when the Yellow River dried up, Shang perished. Now Zhou virtue is like the end of the two dynasties, its rivers and sources are blocked again, blocked must dry up. A state must rely on mountains and rivers; mountains collapse and rivers dry up are signs of a perishing state. Rivers dry up, mountains must collapse.' If the state perishes it will not be more than ten years, the period of numbers.' What heaven has abandoned does not exceed its period.' In this year, the three rivers dried up, Mount Qi collapsed.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0349",
          "zh": "三年，幽王嬖愛褒姒。",
          "translations": []
        },
        {
          "id": "s0350",
          "zh": "褒姒生子伯服，幽王欲廢太子。",
          "translations": []
        },
        {
          "id": "s0351",
          "zh": "太子母申侯女，而為后。",
          "translations": []
        },
        {
          "id": "s0352",
          "zh": "後幽王得褒姒，愛之，欲廢申后，并去太子宜臼，以褒姒為后，以伯服為太子。",
          "translations": []
        },
        {
          "id": "s0353",
          "zh": "周太史伯陽讀史記曰：「周亡矣。」",
          "translations": []
        },
        {
          "id": "s0354",
          "zh": "昔自夏后氏之衰也，有二神龍止於夏帝庭而言曰：「余，褒之二君。」",
          "translations": []
        },
        {
          "id": "s0355",
          "zh": "夏帝卜殺之與去之與止之，莫吉。",
          "translations": []
        },
        {
          "id": "s0356",
          "zh": "卜請其漦而藏之，乃吉。",
          "translations": []
        },
        {
          "id": "s0357",
          "zh": "於是布幣而策告之，龍亡而漦在，櫝而去之。",
          "translations": []
        },
        {
          "id": "s0358",
          "zh": "夏亡，傳此器殷。",
          "translations": []
        },
        {
          "id": "s0359",
          "zh": "殷亡，又傳此器周。",
          "translations": []
        },
        {
          "id": "s0360",
          "zh": "比三代，莫敢發之，至厲王之末，發而觀之。",
          "translations": []
        },
        {
          "id": "s0361",
          "zh": "漦流于庭，不可除。",
          "translations": []
        },
        {
          "id": "s0362",
          "zh": "厲王使婦人裸而譟之。",
          "translations": []
        },
        {
          "id": "s0363",
          "zh": "漦化為玄黿，以入王後宮。",
          "translations": []
        },
        {
          "id": "s0364",
          "zh": "後宮之童妾既齔而遭之，既笄而孕，無夫而生子，懼而棄之。",
          "translations": []
        },
        {
          "id": "s0365",
          "zh": "宣王之時童女謠曰：「厭弧箕服，實亡周國。」",
          "translations": []
        },
        {
          "id": "s0366",
          "zh": "於是宣王聞之，有夫婦賣是器者，宣王使執而戮之。",
          "translations": []
        },
        {
          "id": "s0367",
          "zh": "逃於道，而見鄉者後宮童妾所棄妖子出於路者，聞其夜啼，哀而收之，夫婦遂亡，奔於褒。",
          "translations": []
        },
        {
          "id": "s0368",
          "zh": "褒人有罪，請入童妾所棄女子者於王以贖罪。",
          "translations": []
        },
        {
          "id": "s0369",
          "zh": "棄女子出於褒，是為褒姒。",
          "translations": []
        },
        {
          "id": "s0370",
          "zh": "當幽王三年，王之後宮見而愛之，生子伯服，竟廢申后及太子，以褒姒為后，伯服為太子。",
          "translations": []
        },
        {
          "id": "s0371",
          "zh": "太史伯陽曰：「禍成矣，無可奈何！」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third year, King You doted on Bao Si. Bao Si gave birth to a son Bo Fu, King You wanted to depose the crown prince. The crown prince's mother was Shen Hou's daughter and was queen. Later King You obtained Bao Si, loved her, wished to depose Shen Hou and remove the crown prince Yi Jiu, making Bao Si queen and Bo Fu crown prince. Zhou Grand Historian Bo Yang read the historical records and said: 'Zhou has perished.' Formerly when the Xia Hou clan declined, two spirit dragons stopped in the Xia emperor's court and spoke saying: 'We are the two lords of Bao.' The Xia emperor divined killing them, driving them away, or letting them stay, none were auspicious. He divined requesting their saliva and storing it, and it was auspicious. Thus he spread silks and informed them with a bamboo slip, the dragons departed but the saliva remained, he stored it in a box and sent it away. Xia perished, this vessel was transmitted to Yin. Yin perished, and this vessel was again transmitted to Zhou. Throughout these three dynasties, no one dared open it, until the end of King Li's reign, when he opened and viewed it. The saliva flowed in the courtyard, and could not be removed. King Li made women strip naked and shout at it. The saliva transformed into a black turtle, which entered the king's rear palace. A young maid in the rear palace encountered it after losing her milk teeth, became pregnant after her capping ceremony, gave birth to a son without a husband, was frightened and abandoned it. During King Xuan's time a young girl sang a rhyme: 'The curved bow and winnowing basket will destroy Zhou.' King Xuan heard this, and there was a couple selling this vessel, King Xuan had them seized and executed. They escaped on the road and saw a village woman who was the rear palace maid's abandoned demonic child lying on the road, heard its night crying, pitied it and took it, the couple then fled and ran to Bao. The people of Bao committed a crime, requested to present the maid's abandoned girl to the king to redeem their crime. The abandoned girl came from Bao, this was Bao Si. In King You's third year, the women of the king's rear palace saw and loved her, she gave birth to a son Bo Fu, and ultimately deposed Shen Hou and the crown prince, making Bao Si queen and Bo Fu crown prince. Grand Historian Bo Yang said: 'The calamity is complete, there is nothing that can be done!'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0373",
          "zh": "褒姒不好笑，幽王欲其笑萬方，故不笑。",
          "translations": []
        },
        {
          "id": "s0374",
          "zh": "幽王為烽燧大鼓，有寇至則舉烽火。",
          "translations": []
        },
        {
          "id": "s0375",
          "zh": "諸侯悉至，至而無寇，褒姒乃大笑。",
          "translations": []
        },
        {
          "id": "s0376",
          "zh": "幽王說之，為數舉烽火。",
          "translations": []
        },
        {
          "id": "s0377",
          "zh": "其後不信，諸侯益亦不至。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Bao Si did not like to laugh, King You wished her to laugh at any cost, therefore she did not laugh. King You made beacon fires and great drums, when invaders came they would light the beacons. All the feudal lords arrived, arrived but there were no invaders, Bao Si then laughed greatly. King You was delighted, and repeatedly lit the beacon fires. Afterward it was not trusted, the feudal lords increasingly also did not come.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0378",
          "zh": "幽王以虢石父為卿，用事，國人皆怨。",
          "translations": []
        },
        {
          "id": "s0379",
          "zh": "石父為人佞巧善諛好利，王用之。",
          "translations": []
        },
        {
          "id": "s0380",
          "zh": "又廢申后，去太子也。",
          "translations": []
        },
        {
          "id": "s0381",
          "zh": "申侯怒，與繒、西夷犬戎攻幽王。",
          "translations": []
        },
        {
          "id": "s0382",
          "zh": "幽王舉烽火徵兵，兵莫至。",
          "translations": []
        },
        {
          "id": "s0383",
          "zh": "遂殺幽王驪山下，虜褒姒，盡取周賂而去。",
          "translations": []
        },
        {
          "id": "s0384",
          "zh": "於是諸侯乃即申侯而共立故幽王太子宜臼，是為平王，以奉周祀。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King You made Guo Shi Fu a minister, he handled affairs, the people of the capital all resented him. Shi Fu was a person who was sycophantic, clever, good at flattery, and greedy for profit, the king employed him. He again deposed Shen Hou, removed the crown prince. Shen Hou was angry, with Zeng and the western barbarians the Quanrong attacked King You. King You lit the beacon fires to summon troops, but no troops arrived. Thus they killed King You at the foot of Li Mountain, captured Bao Si, took all Zhou's treasures and left. Therefore the feudal lords went to Shen Hou and together established the former King You's crown prince Yi Jiu, this was King Ping, to continue the Zhou sacrifices.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0385",
          "zh": "平王立，東遷于雒邑，辟戎寇。",
          "translations": []
        },
        {
          "id": "s0386",
          "zh": "平王之時，周室衰微，諸侯彊并弱，齊、楚、秦、晉始大，政由方伯。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Ping ascended, moved east to Luoyi, to avoid the Rong invaders. In King Ping's time, the Zhou house declined and weakened, the feudal lords strong annexed the weak, Qi, Chu, Qin, Jin began to grow great, government was by the regional lords.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0387",
          "zh": "四十九年，魯隱公即位。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-ninth year, Duke Yin of Lu ascended.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "五十一年，平王崩，太子洩父蚤死，立其子林，是為桓王。",
          "translations": []
        },
        {
          "id": "s0389",
          "zh": "桓王，平王孫也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifty-first year, King Ping died, crown prince Xie Fu died early, established his son Lin, this was King Huan. King Huan was King Ping's grandson.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0390",
          "zh": "桓王三年，鄭莊公朝，桓王不禮。",
          "translations": []
        },
        {
          "id": "s0391",
          "zh": "五年，鄭怨，與魯易許田。",
          "translations": []
        },
        {
          "id": "s0392",
          "zh": "許田，天子之用事太山田也。",
          "translations": []
        },
        {
          "id": "s0393",
          "zh": "八年，魯殺隱公，立桓公。",
          "translations": []
        },
        {
          "id": "s0394",
          "zh": "十三年，伐鄭，鄭射傷桓王，桓王去歸。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Huan's third year, Zheng Zhuang Gong came to court, King Huan was discourteous. Fifth year, Zheng resented it, exchanged Xu fields with Lu. Xu field was the field where the Son of Heaven performed rituals to Mount Tai. Eighth year, Lu killed Duke Yin and established Duke Huan. Thirteenth year, he attacked Zheng. Zheng shot and wounded King Huan, King Huan left and returned.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0395",
          "zh": "二十三年，桓王崩，子莊王佗立。",
          "translations": []
        },
        {
          "id": "s0396",
          "zh": "莊王四年，周公黑肩欲殺莊王而立王子克。",
          "translations": []
        },
        {
          "id": "s0397",
          "zh": "辛伯告王，王殺周公。",
          "translations": []
        },
        {
          "id": "s0398",
          "zh": "王子克奔燕。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-third year, King Huan died, his son King Zhuang Tuo ascended. King Zhuang's fourth year, Zhou Gong Hei Jian wished to kill King Zhuang and establish Prince Ke. Xin Bo informed the king, the king killed Zhou Gong. Prince Ke fled to Yan.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0399",
          "zh": "十五年，莊王崩，子釐王胡齊立。",
          "translations": []
        },
        {
          "id": "s0400",
          "zh": "釐王三年，齊桓公始霸。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifteenth year, King Zhuang died, his son King Xi Hu Qi ascended. King Xi's third year, Duke Huan of Qi first became hegemon.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0401",
          "zh": "五年，釐王崩，子惠王閬立。",
          "translations": []
        },
        {
          "id": "s0402",
          "zh": "惠王二年。",
          "translations": []
        },
        {
          "id": "s0403",
          "zh": "初，莊王嬖姬姚，生子穨，穨有寵。",
          "translations": []
        },
        {
          "id": "s0404",
          "zh": "及惠王即位，奪其大臣以為囿，故大夫邊伯等五人作亂，謀召燕、衛師，伐惠王。",
          "translations": []
        },
        {
          "id": "s0405",
          "zh": "惠王犇溫，已居鄭之櫟。",
          "translations": []
        },
        {
          "id": "s0406",
          "zh": "立釐王弟穨為王。",
          "translations": []
        },
        {
          "id": "s0407",
          "zh": "樂及徧舞，鄭、虢君怒。",
          "translations": []
        },
        {
          "id": "s0408",
          "zh": "四年，鄭與虢君伐殺王穨，復入惠王。",
          "translations": []
        },
        {
          "id": "s0409",
          "zh": "惠王十年，賜齊桓公為伯。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifth year, King Xi died, his son King Hui Lang ascended. King Hui's second year. At first, King Zhuang favored consort Yao, she gave birth to a son Kui, Kui was favored. When King Hui ascended, he took away his minister's park to make it his own preserve, therefore the ministers Bian Bo and four others rebelled, plotting to summon Yan and Wei armies to attack King Hui. King Hui fled to Wen, then resided at Zheng's Li. They established King Xi's younger brother Kui as king. They made music and danced everywhere, the lords of Zheng and Guo were angry. Fourth year, Zheng and Guo's lords attacked and killed King Kui, restored King Hui. King Hui's tenth year, he granted Duke Huan of Qi to be the overlord.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0410",
          "zh": "二十五年，惠王崩，子襄王鄭立。",
          "translations": []
        },
        {
          "id": "s0411",
          "zh": "襄王母蚤死，後母曰惠后。",
          "translations": []
        },
        {
          "id": "s0412",
          "zh": "惠后生叔帶，有寵於惠王，襄王畏之。",
          "translations": []
        },
        {
          "id": "s0413",
          "zh": "三年，叔帶與戎、翟謀伐襄王，襄王欲誅叔帶，叔帶奔齊。",
          "translations": []
        },
        {
          "id": "s0414",
          "zh": "齊桓公使管仲平戎于周，使隰朋平戎于晉。",
          "translations": []
        },
        {
          "id": "s0415",
          "zh": "王以上卿禮管仲。",
          "translations": []
        },
        {
          "id": "s0416",
          "zh": "管仲辭曰：「臣賤有司也，有天子之二守國、高在。",
          "translations": []
        },
        {
          "id": "s0417",
          "zh": "若節春秋來承王命，何以禮焉。",
          "translations": []
        },
        {
          "id": "s0418",
          "zh": "陪臣敢辭。」",
          "translations": []
        },
        {
          "id": "s0419",
          "zh": "王曰：「舅氏，余嘉乃勳，毋逆朕命。」",
          "translations": []
        },
        {
          "id": "s0420",
          "zh": "管仲卒受下卿之禮而還。",
          "translations": []
        },
        {
          "id": "s0421",
          "zh": "九年，齊桓公卒。",
          "translations": []
        },
        {
          "id": "s0422",
          "zh": "十二年，叔帶復歸于周。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-fifth year, King Hui died, his son King Xiang Zheng ascended. King Xiang's mother died early, his stepmother was called Hui Hou. Hui Hou gave birth to Shu Dai, who was favored by King Hui, King Xiang feared him. Third year, Shu Dai plotted with the Rong and Di to attack King Xiang, King Xiang wished to execute Shu Dai, Shu Dai fled to Qi. Duke Huan of Qi sent Guan Zhong to pacify the Rong at Zhou, sent Xi Peng to pacify the Rong at Jin. The king treated Guan Zhong with the rites of an upper minister. Guan Zhong declined saying: 'Your servant is a lowly official, there are the Son of Heaven's two guardians Guo and Gao. If they come in spring and autumn to receive the king's commands, how can they be treated like this? A subject of a subject dares to decline.' The king said: 'Uncle, I commend your achievements, do not oppose Our command.' Guan Zhong ultimately accepted the rites of a lower minister and returned. Ninth year, Duke Huan of Qi died. Twelfth year, Shu Dai returned again to Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0423",
          "zh": "十三年，鄭伐滑，王使游孫、伯服請滑，鄭人囚之。",
          "translations": []
        },
        {
          "id": "s0424",
          "zh": "鄭文公怨惠王之入不與厲公爵，又怨襄王之與衛滑，故囚伯服。",
          "translations": []
        },
        {
          "id": "s0425",
          "zh": "王怒，將以翟伐鄭。",
          "translations": []
        },
        {
          "id": "s0426",
          "zh": "富辰諫曰：「凡我周之東徙，晉、鄭焉依。",
          "translations": []
        },
        {
          "id": "s0427",
          "zh": "子穨之亂，又鄭之由定，今以小怨棄之！」",
          "translations": []
        },
        {
          "id": "s0428",
          "zh": "王不聽。",
          "translations": []
        },
        {
          "id": "s0429",
          "zh": "十五年，王降翟師以伐鄭。",
          "translations": []
        },
        {
          "id": "s0430",
          "zh": "王德翟人，將以其女為后。",
          "translations": []
        },
        {
          "id": "s0431",
          "zh": "富辰諫曰：「平、桓、莊、惠皆受鄭勞，王棄親親翟，不可從。」",
          "translations": []
        },
        {
          "id": "s0432",
          "zh": "王不聽。",
          "translations": []
        },
        {
          "id": "s0433",
          "zh": "十六年，王絀翟后，翟人來誅，殺譚伯。",
          "translations": []
        },
        {
          "id": "s0434",
          "zh": "富辰曰：「吾數諫不從。",
          "translations": []
        },
        {
          "id": "s0435",
          "zh": "如是不出，王以我為懟乎？」",
          "translations": []
        },
        {
          "id": "s0436",
          "zh": "乃以其屬死之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirteenth year, Zheng attacked Hua, the king sent You Sun and Bo Fu to plead with Hua, the Zheng people imprisoned them. Zheng Wen Gong resented King Hui's restoration not giving him Duke Li's rank, and resented King Xiang giving Hua to Wei, therefore imprisoned Bo Fu. The king was angry, intended to attack Zheng with Di forces. Fu Chen advised: 'In all our Zhou eastward move, Jin and Zheng are what we rely on. The rebellion of Zi Kui was also settled by Zheng, now to abandon them over a small grudge!' The king did not listen. Fifteenth year, the king led Di troops to attack Zheng. The king favored the Di people, intended to take their daughter as queen. Fu Chen advised: 'Ping, Huan, Zhuang, Hui all received service from Zheng, if the king abandons his relatives and favors Di, it cannot be followed.' The king did not listen. Sixteenth year, the king deposed the Di queen, the Di people came to attack, killed Tan Bo. Fu Chen said: 'I have advised many times and you did not follow. If I do not leave now, will the king consider me resentful?' He died with his followers.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0437",
          "zh": "初，惠后欲立王子帶，故以黨開翟人，翟人遂入周。",
          "translations": []
        },
        {
          "id": "s0438",
          "zh": "襄王出奔鄭，鄭居王于汜。",
          "translations": []
        },
        {
          "id": "s0439",
          "zh": "子帶立為王，取襄王所絀翟后與居溫。",
          "translations": []
        },
        {
          "id": "s0440",
          "zh": "十七年，襄王告急于晉，晉文公納王而誅叔帶。",
          "translations": []
        },
        {
          "id": "s0441",
          "zh": "襄王乃賜晉文公珪鬯弓矢，為伯，以河內地與晉。",
          "translations": []
        },
        {
          "id": "s0442",
          "zh": "二十年，晉文公召襄王，襄王會之河陽、踐土，諸侯畢朝，書諱曰「天王狩于河陽」。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At first, Hui Hou wished to establish Prince Dai, therefore through her faction she opened the way for the Di people, the Di people thus entered Zhou. King Xiang fled to Zheng, Zheng housed the king at Si. Zi Dai established himself as king, took the Di queen whom King Xiang had deposed and lived with her at Wen. Seventeenth year, King Xiang appealed urgently to Jin, Duke Wen of Jin received the king and executed Shu Dai. King Xiang then granted Duke Wen of Jin the jade tablet, sacrificial wine, bow and arrows, made him hegemon, and gave the land within the Yellow River to Jin. Twentieth year, Duke Wen of Jin summoned King Xiang, King Xiang met him at Heyang and Jiantu, all the feudal lords attended court, the record euphemistically says 'The Heavenly King hunted at Heyang.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0443",
          "zh": "二十四年，晉文公卒。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-fourth year, Duke Wen of Jin died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0444",
          "zh": "三十一年，秦穆公卒。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-first year, Duke Mu of Qin died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0445",
          "zh": "三十二年，襄王崩，子頃王壬臣立。",
          "translations": []
        },
        {
          "id": "s0446",
          "zh": "頃王六年，崩，子匡王班立。",
          "translations": []
        },
        {
          "id": "s0447",
          "zh": "匡王六年，崩，弟瑜立，是為定王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-second year, King Xiang died, his son King Qing Renchen ascended. King Qing's sixth year, he died, his son King Kuang Ban ascended. King Kuang's sixth year, he died, his younger brother Yu ascended, this was King Ding.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0448",
          "zh": "定王元年，楚莊王伐陸渾之戎，次洛，使人問九鼎。",
          "translations": []
        },
        {
          "id": "s0449",
          "zh": "王使王孫滿應設以辭，楚兵乃去。",
          "translations": []
        },
        {
          "id": "s0450",
          "zh": "十年，楚莊王圍鄭，鄭伯降，已而復之。",
          "translations": []
        },
        {
          "id": "s0451",
          "zh": "十六年，楚莊王卒。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Ding's first year, King Zhuang of Chu attacked the Rong of Luhun, camped at Luo, sent someone to inquire about the Nine Tripods. The king sent Wangsun Man to respond with elaborate words, the Chu army then departed. Tenth year, King Zhuang of Chu besieged Zheng, the Lord of Zheng surrendered, afterward he released him. Sixteenth year, King Zhuang of Chu died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0452",
          "zh": "二十一年，定王崩，子簡王夷立。",
          "translations": []
        },
        {
          "id": "s0453",
          "zh": "簡王十三年，晉殺其君厲公，迎子周於周，立為悼公。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-first year, King Ding died, his son King Jian Yi ascended. King Jian's thirteenth year, Jin killed their lord Duke Li, welcomed Zi Zhou from Zhou, established him as Duke Dao.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0454",
          "zh": "十四年，簡王崩，子靈王泄心立。",
          "translations": []
        },
        {
          "id": "s0455",
          "zh": "靈王二十四年，齊崔杼弒其君莊公。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fourteenth year, King Jian died, his son King Ling Xie Xin ascended. King Ling's twenty-fourth year, Qi's Cui Zhu assassinated their lord Duke Zhuang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0456",
          "zh": "二十七年，靈王崩，子景王貴立。",
          "translations": []
        },
        {
          "id": "s0457",
          "zh": "景王十八年，后太子聖而蚤卒。",
          "translations": []
        },
        {
          "id": "s0458",
          "zh": "二十年，景王愛子朝，欲立之，會崩，子丐之黨與爭立，國人立長子猛為王，子朝攻殺猛。",
          "translations": []
        },
        {
          "id": "s0459",
          "zh": "猛為悼王。",
          "translations": []
        },
        {
          "id": "s0460",
          "zh": "晉人攻子朝而立丐，是為敬王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-seventh year, King Ling died, his son King Jing Gui ascended. King Jing's eighteenth year, the queen's crown prince Sheng died young. Twentieth year, King Jing loved his son Zhao, wished to establish him, but died, Zi Kai's faction contended for the throne, the people of the capital established the eldest son Meng as king, Zi Zhao attacked and killed Meng. Meng became King Dao. The Jin people attacked Zi Zhao and established Kai, this was King Jing.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0461",
          "zh": "敬王元年，晉人入敬王，子朝自立，敬王不得入，居澤。",
          "translations": []
        },
        {
          "id": "s0462",
          "zh": "四年，晉率諸侯入敬王于周，子朝為臣，諸侯城周。",
          "translations": []
        },
        {
          "id": "s0463",
          "zh": "十六年，子朝之徒復作亂，敬王奔于晉。",
          "translations": []
        },
        {
          "id": "s0464",
          "zh": "十七年，晉定公遂入敬王于周。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Jing's first year, the Jin people brought in King Jing, Zi Zhao established himself, King Jing could not enter, resided at Ze. Fourth year, Jin led the feudal lords to bring King Jing into Zhou, Zi Zhao became a subject, the feudal lords fortified Zhou. Sixteenth year, Zi Zhao's followers again rebelled, King Jing fled to Jin. Seventeenth year, Duke Ding of Jin ultimately brought King Jing into Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0465",
          "zh": "三十九年，齊田常殺其君簡公。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-ninth year, Qi's Tian Chang killed their lord Duke Jian.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0466",
          "zh": "四十一年，楚滅陳。",
          "translations": []
        },
        {
          "id": "s0467",
          "zh": "孔子卒。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-first year, Chu extinguished Chen. Confucius died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0468",
          "zh": "四十二年，敬王崩，子元王仁立。",
          "translations": []
        },
        {
          "id": "s0469",
          "zh": "元王八年，崩，子定王介立。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-second year, King Jing died, his son King Yuan Ren ascended. King Yuan's eighth year, he died, his son King Ding Jie ascended.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0470",
          "zh": "定王十六年，三晉滅智伯，分有其地。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Ding's sixteenth year, the Three Jin extinguished Zhi Bo, divided and possessed his lands.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0471",
          "zh": "二十八年，定王崩，長子去疾立，是為哀王。",
          "translations": []
        },
        {
          "id": "s0472",
          "zh": "哀王立三月，弟叔襲殺哀王而自立，是為思王。",
          "translations": []
        },
        {
          "id": "s0473",
          "zh": "思王立五月，少弟嵬攻殺思王而自立，是為考王。",
          "translations": []
        },
        {
          "id": "s0474",
          "zh": "此三王皆定王之子。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-eighth year, King Ding died, his eldest son Qu Ji ascended, this was King Ai. King Ai ascended for three months, his younger brother Shu attacked and killed King Ai and established himself, this was King Si. King Si ascended for five months, his youngest brother Wei attacked and killed King Si and established himself, this was King Kao. These three kings were all sons of King Ding.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0475",
          "zh": "考王十五年，崩，子威烈王午立。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Kao's fifteenth year, he died, his son King Wei Lie Wu ascended.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0476",
          "zh": "考王封其弟于河南，是為桓公，以續周公之官職。",
          "translations": []
        },
        {
          "id": "s0477",
          "zh": "桓公卒，子威公代立。",
          "translations": []
        },
        {
          "id": "s0478",
          "zh": "威公卒，子惠公代立，乃封其少子於鞏以奉王，號東周惠公。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Kao enfeoffed his younger brother in Henan, this was Duke Huan, to continue the Zhou Gong's official duties. Duke Huan died, his son Duke Wei succeeded. Duke Wei died, his son Duke Hui succeeded, then enfeoffed his youngest son at Gong to serve the king, styled Eastern Zhou Hui Gong.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0479",
          "zh": "威烈王二十三年，九鼎震。",
          "translations": []
        },
        {
          "id": "s0480",
          "zh": "命韓、魏、趙為諸侯。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Wei Lie's twenty-third year, the Nine Tripods shook. Commanded Han, Wei, Zhao to be feudal lords.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0481",
          "zh": "二十四年，崩，子安王驕立。",
          "translations": []
        },
        {
          "id": "s0482",
          "zh": "是歲盜殺楚聲王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-fourth year, he died, his son King An Jiao ascended. This year robbers killed Chu Sheng Wang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0483",
          "zh": "安王立二十六年，崩，子烈王喜立。",
          "translations": []
        },
        {
          "id": "s0484",
          "zh": "烈王二年，周太史儋見秦獻公曰：「始周與秦國合而別，別五百載復合，合十七歲而霸王者出焉。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King An ascended for twenty-six years, died, his son King Lie Xi ascended. King Lie's second year, Zhou Grand Historian Dan saw Qin Xian Gong and said: 'Originally Zhou and Qin were united then separated, separated five hundred years then reunited, united seventeen years and a hegemon-king will emerge.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0486",
          "zh": "十年，烈王崩，弟扁立，是為顯王。",
          "translations": []
        },
        {
          "id": "s0487",
          "zh": "顯王五年，賀秦獻公，獻公稱伯。",
          "translations": []
        },
        {
          "id": "s0488",
          "zh": "九年，致文武胙於秦孝公。",
          "translations": []
        },
        {
          "id": "s0489",
          "zh": "二十五年，秦會諸侯於周。",
          "translations": []
        },
        {
          "id": "s0490",
          "zh": "二十六年，周致伯於秦孝公。",
          "translations": []
        },
        {
          "id": "s0491",
          "zh": "三十三年，賀秦惠王。",
          "translations": []
        },
        {
          "id": "s0492",
          "zh": "三十五年，致文武胙於秦惠王。",
          "translations": []
        },
        {
          "id": "s0493",
          "zh": "四十四年，秦惠王稱王。",
          "translations": []
        },
        {
          "id": "s0494",
          "zh": "其後諸侯皆為王。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Tenth year, King Lie died, his younger brother Bian ascended, this was King Xian. King Xian's fifth year, congratulated Qin Xian Gong, Xian Gong was styled hegemon. Ninth year, sent the sacrifices of Wen and Wu to Qin Xiao Gong. Twenty-fifth year, Qin assembled the feudal lords at Zhou. Twenty-sixth year, Zhou granted the title of hegemon to Qin Xiao Gong. Thirty-third year, congratulated Qin Hui Wang. Thirty-fifth year, sent the sacrifices of Wen and Wu to Qin Hui Wang. Forty-fourth year, Qin Hui Wang styled himself king. Thereafter all the feudal lords became kings.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0495",
          "zh": "四十八年，顯王崩，子慎靚王定立。",
          "translations": []
        },
        {
          "id": "s0496",
          "zh": "慎靚王立六年，崩，子赧王延立。",
          "translations": []
        },
        {
          "id": "s0497",
          "zh": "王赧時東西周分治。",
          "translations": []
        },
        {
          "id": "s0498",
          "zh": "王赧徙都西周。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-eighth year, King Xian died, his son King Shenjing Ding ascended. King Shenjing ascended for six years, died, his son King Nan Yan ascended. During King Nan's time, Eastern and Western Zhou were governed separately. King Nan moved his capital to Western Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0499",
          "zh": "西周武公之共太子死，有五庶子，毋適立。",
          "translations": []
        },
        {
          "id": "s0500",
          "zh": "司馬翦謂楚王曰：「不如以地資公子咎，為請太子。」",
          "translations": []
        },
        {
          "id": "s0501",
          "zh": "左成曰：「不可。",
          "translations": []
        },
        {
          "id": "s0502",
          "zh": "周不聽，是公之知困而交疏於周也。",
          "translations": []
        },
        {
          "id": "s0503",
          "zh": "不如請周君孰欲立，以微告翦，翦請令楚（賀）［資］之以地。」",
          "translations": []
        },
        {
          "id": "s0504",
          "zh": "果立公子咎為太子。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Western Zhou Wu Gong's heir apparent died, there were five concubine-born sons, none was established as heir. Sima Qian said to the Chu king: 'It would be better to provide territory to Prince Jiu, to request he be made crown prince.' Zuo Cheng said: 'It is not permissible. If Zhou does not listen, this is the duke knowing difficulty and becoming estranged from Zhou. It would be better to ask which Zhou lord wishes to be established, secretly inform Qian, have Qian request that Chu provide him with territory.' Indeed established Prince Jiu as crown prince.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0505",
          "zh": "八年，秦攻宜陽，楚救之。",
          "translations": []
        },
        {
          "id": "s0506",
          "zh": "而楚以周為秦故，將伐之。",
          "translations": []
        },
        {
          "id": "s0507",
          "zh": "蘇代為周說楚王曰：「何以周為秦之禍也？",
          "translations": []
        },
        {
          "id": "s0508",
          "zh": "言周之為秦甚於楚者，欲令周入秦也，故謂『周秦』也。",
          "translations": []
        },
        {
          "id": "s0509",
          "zh": "周知其不可解，必入於秦，此為秦取周之精者也。",
          "translations": []
        },
        {
          "id": "s0510",
          "zh": "為王計者，周於秦因善之，不於秦亦言善之，以疏之於秦。",
          "translations": []
        },
        {
          "id": "s0511",
          "zh": "周絕於秦，必入於郢矣。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Eighth year, Qin attacked Yi Yang, Chu rescued it. But Chu, because of Zhou being allied with Qin, was about to attack it. Su Dai spoke for Zhou to the Chu king saying: 'Why consider Zhou to be Qin's ally? Those who say Zhou is closer to Qin than to Chu wish to make Zhou submit to Qin, therefore they call it 'Zhou-Qin alliance.' Zhou knows this alliance cannot be broken, must submit to Qin, this is providing Qin with the means to take Zhou's essence. For the king's benefit, Zhou should maintain good relations with Qin whether allied with Qin or not, to distance it from Qin. If Zhou breaks with Qin, it must submit to Ying.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0513",
          "zh": "秦借道兩周之閒，將以伐韓，周恐借之畏於韓，不借畏於秦。",
          "translations": []
        },
        {
          "id": "s0514",
          "zh": "史厭謂周君曰：「何不令人謂韓公叔曰『秦之敢絕周而伐韓者，信東周也。",
          "translations": []
        },
        {
          "id": "s0515",
          "zh": "公何不與周地，發質使之楚』？",
          "translations": []
        },
        {
          "id": "s0516",
          "zh": "秦必疑楚不信周，是韓不伐也。",
          "translations": []
        },
        {
          "id": "s0517",
          "zh": "又謂秦曰『韓彊與周地，將以疑周於秦也，周不敢不受』。",
          "translations": []
        },
        {
          "id": "s0518",
          "zh": "秦必無辭而令周不受，是受地於韓而聽於秦。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Qin requested passage between the two Zhous, intending to attack Han, Zhou feared lending passage would offend Han, not lending would offend Qin. Shi Yan said to the Zhou lord: 'Why not have someone tell Han Gong Shu: 'Qin's daring to cut off Zhou and attack Han is because it trusts Eastern Zhou. Why not give Zhou territory, send hostages to make them go to Chu'? Qin will surely suspect Chu and not trust Zhou, thus Han will not be attacked. Also tell Qin: 'Han is strong and giving Zhou territory will sow suspicion of Zhou in Qin, Zhou will not dare refuse.' Qin will surely have no excuse and make Zhou not accept, thus receiving territory from Han while obeying Qin.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0520",
          "zh": "秦召西周君，西周君惡往，故令人謂韓王曰：「秦召西周君，將以使攻王之南陽也，王何不出兵於南陽？",
          "translations": []
        },
        {
          "id": "s0521",
          "zh": "周君將以為辭於秦。",
          "translations": []
        },
        {
          "id": "s0522",
          "zh": "周君不入秦，秦必不敢踰河而攻南陽矣。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Qin summoned the Western Zhou lord, the Western Zhou lord disliked going, so had someone tell the Han king: 'Qin is summoning the Western Zhou lord to make him attack your Nanyang, why not send troops to Nanyang? The Zhou lord will use this as an excuse to Qin. If the Zhou lord does not go to Qin, Qin will surely not dare cross the river to attack Nanyang.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0524",
          "zh": "東周與西周戰，韓救西周。",
          "translations": []
        },
        {
          "id": "s0525",
          "zh": "或為東周說韓王曰：「西周故天子之國，多名器重寶。",
          "translations": []
        },
        {
          "id": "s0526",
          "zh": "王案兵毋出，可以德東周，而西周之寶必可以盡矣。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Eastern Zhou fought with Western Zhou, Han rescued Western Zhou. Someone spoke for Eastern Zhou to the Han king: 'Western Zhou was formerly the Son of Heaven's country, has many famous vessels and heavy treasures. If your majesty holds back troops and does not go out, you can gain favor with Eastern Zhou, and Western Zhou's treasures can surely all be obtained.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0528",
          "zh": "王赧謂成君。",
          "translations": []
        },
        {
          "id": "s0529",
          "zh": "楚圍雍氏，韓徵甲與粟於東周，東周君恐，召蘇代而告之。",
          "translations": []
        },
        {
          "id": "s0530",
          "zh": "代曰：「君何患於是。",
          "translations": []
        },
        {
          "id": "s0531",
          "zh": "臣能使韓毋徵甲與粟於周，又能為君得高都。」",
          "translations": []
        },
        {
          "id": "s0532",
          "zh": "周君曰：「子茍能，請以國聽子。」",
          "translations": []
        },
        {
          "id": "s0533",
          "zh": "代見韓相國曰：「楚圍雍氏，期三月也，今五月不能拔，是楚病也。",
          "translations": []
        },
        {
          "id": "s0534",
          "zh": "今相國乃徵甲與粟於周，是告楚病也。」",
          "translations": []
        },
        {
          "id": "s0535",
          "zh": "韓相國曰：「善。",
          "translations": []
        },
        {
          "id": "s0536",
          "zh": "使者已行矣。」",
          "translations": []
        },
        {
          "id": "s0537",
          "zh": "代曰：「何不與周高都？」",
          "translations": []
        },
        {
          "id": "s0538",
          "zh": "韓相國大怒曰：「吾毋徵甲與粟於周亦已多矣，何故與周高都也？」",
          "translations": []
        },
        {
          "id": "s0539",
          "zh": "代曰：「與周高都，是周折而入於韓也，秦聞之必大怒忿周，即不通周使，是以獘高都得完周也。",
          "translations": []
        },
        {
          "id": "s0540",
          "zh": "曷為不與？」",
          "translations": []
        },
        {
          "id": "s0541",
          "zh": "相國曰：「善。」",
          "translations": []
        },
        {
          "id": "s0542",
          "zh": "果與周高都。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "King Nan spoke to the Cheng lord. Chu besieged Yong Shi, Han demanded armor and grain from Eastern Zhou, the Eastern Zhou lord was afraid, summoned Su Dai and told him. Dai said: 'My lord, why worry about this. Your servant can make Han not demand armor and grain from Zhou, and can also obtain Gao Du for my lord.' The Zhou lord said: 'If you can do this, I will let the state listen to you.' Dai met the Han prime minister and said: 'Chu has besieged Yong Shi for three months, now five months and cannot take it, this shows Chu is weak. Now if the prime minister demands armor and grain from Zhou, this is revealing Chu's weakness.' The Han prime minister said: 'Good. The envoy has already been sent.' Dai said: 'Why not give Gao Du to Zhou?' The Han prime minister was greatly angered and said: 'I have already done much by not demanding armor and grain from Zhou, why should I give Gao Du to Zhou?' Dai said: 'Giving Gao Du to Zhou is making Zhou bend and enter Han's embrace. Qin hearing this will surely be greatly angered and resent Zhou, then will not pass Zhou envoys, thus exhausting Gao Du to preserve Zhou. Why not give it?' The prime minister said: 'Good.' Indeed gave Gao Du to Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0543",
          "zh": "三十四年，蘇厲謂周君曰：「秦破韓、魏，撲師武，北取趙藺、離石者，皆白起也。",
          "translations": []
        },
        {
          "id": "s0544",
          "zh": "是善用兵，又有天命。",
          "translations": []
        },
        {
          "id": "s0545",
          "zh": "今又將兵出塞攻梁，梁破則周危矣。",
          "translations": []
        },
        {
          "id": "s0546",
          "zh": "君何不令人說白起乎？",
          "translations": []
        },
        {
          "id": "s0547",
          "zh": "曰『楚有養由基者，善射者也。",
          "translations": []
        },
        {
          "id": "s0548",
          "zh": "去柳葉百步而射之，百發而百中之。",
          "translations": []
        },
        {
          "id": "s0549",
          "zh": "左右觀者數千人，皆曰善射。",
          "translations": []
        },
        {
          "id": "s0550",
          "zh": "有一夫立其旁，曰「善，可教射矣」。",
          "translations": []
        },
        {
          "id": "s0551",
          "zh": "養由基怒，釋弓搤劍，曰「客安能教我射乎」？",
          "translations": []
        },
        {
          "id": "s0552",
          "zh": "客曰「非吾能教子支左詘右也。",
          "translations": []
        },
        {
          "id": "s0553",
          "zh": "夫去柳葉百步而射之，百發而百中之，不以善息，少焉氣衰力倦，弓撥矢鉤，一發不中者，百發盡息」。",
          "translations": []
        },
        {
          "id": "s0554",
          "zh": "今破韓、魏，撲師武，北取趙藺、離石者，公之功多矣。",
          "translations": []
        },
        {
          "id": "s0555",
          "zh": "今又將兵出塞，過兩周，倍韓，攻梁，一舉不得，前功盡棄。",
          "translations": []
        },
        {
          "id": "s0556",
          "zh": "公不如稱病而無出』。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-fourth year, Su Li said to the Zhou lord: 'Qin's defeats of Han and Wei, routing Shi Wu, northern capture of Zhao's Lin and Li Shi, all were Bai Qi. He is skilled at using troops, and also has the Mandate of Heaven. Now he is leading troops out of the passes to attack Liang, if Liang is broken then Zhou will be in danger. Why not have someone persuade Bai Qi? Say 'Chu has Yang You Ji, who is a skilled archer. From a hundred paces shoot the willow leaf, a hundred shots all hit it. The spectators on left and right numbered several thousand, all said he was skilled at shooting. There was one man standing beside him, said 'Good, he can be taught archery.' Yang You Ji was angry, put down his bow and grasped his sword, said 'How can you guest teach me archery?' The guest said 'It is not that I can teach you to brace left and bend right. From a hundred paces shoot the willow leaf, a hundred shots all hit it, if you do not rest with skill, soon qi declines and strength tires, bow deflects arrow hooks, one shot misses and the hundred shots are all wasted.' Now defeating Han and Wei, routing Shi Wu, northern capture of Zhao's Lin and Li Shi, your merit is already great. Now again leading troops out of the passes, passing the two Zhous, betraying Han, attacking Liang, if one battle is not won, previous merits are all abandoned. You should feign illness and not go out.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0558",
          "zh": "四十二年，秦破華陽約。",
          "translations": []
        },
        {
          "id": "s0559",
          "zh": "馬犯謂周君曰：「請令梁城周。」",
          "translations": []
        },
        {
          "id": "s0560",
          "zh": "乃謂梁王曰：「周王病若死，則犯必死矣。",
          "translations": []
        },
        {
          "id": "s0561",
          "zh": "犯請以九鼎自入於王，王受九鼎而圖犯。」",
          "translations": []
        },
        {
          "id": "s0562",
          "zh": "梁王曰：「善。」",
          "translations": []
        },
        {
          "id": "s0563",
          "zh": "遂與之卒，言戍周。",
          "translations": []
        },
        {
          "id": "s0564",
          "zh": "因謂秦王曰：「梁非戍周也，將伐周也。",
          "translations": []
        },
        {
          "id": "s0565",
          "zh": "王試出兵境以觀之。」",
          "translations": []
        },
        {
          "id": "s0566",
          "zh": "秦果出兵。",
          "translations": []
        },
        {
          "id": "s0567",
          "zh": "又謂梁王曰：「周王病甚矣，犯請後可而復之。",
          "translations": []
        },
        {
          "id": "s0568",
          "zh": "今王使卒之周，諸侯皆生心，後舉事且不信。",
          "translations": []
        },
        {
          "id": "s0569",
          "zh": "不若令卒為周城，以匿事端。」",
          "translations": []
        },
        {
          "id": "s0570",
          "zh": "梁王曰：「善。」",
          "translations": []
        },
        {
          "id": "s0571",
          "zh": "遂使城周。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-second year, Qin broke the Hua Yang covenant. Ma Fan said to the Zhou lord: 'Please have Liang defend Zhou.' Then said to the Liang king: 'If the Zhou king becomes ill or dies, then Fan will surely die. Fan requests to personally enter with the Nine Tripods to your majesty, your majesty accepts the Nine Tripods and plots against Fan.' The Liang king said: 'Good.' Then gave him troops, saying they were garrisoning Zhou. Then said to the Qin king: 'Liang is not garrisoning Zhou, they are about to attack Zhou. Your majesty should try sending troops to the border to observe it.' Qin indeed sent out troops. Again said to the Liang king: 'The Zhou king is gravely ill, Fan requests to go later and return. Now if your majesty sends troops to Zhou, the feudal lords will all have doubts, future undertakings will lack credibility. It would be better to have the troops build walls for Zhou, to conceal the start of affairs.' The Liang king said: 'Good.' Then had them build walls for Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0572",
          "zh": "四十五年，周君之秦客謂周（最）［聚］曰：「公不若譽秦王之孝，因以應為太后養地，秦王必喜，是公有秦交。",
          "translations": []
        },
        {
          "id": "s0573",
          "zh": "交善，周君必以為公功。",
          "translations": []
        },
        {
          "id": "s0574",
          "zh": "交惡，勸周君入秦者必有罪矣。」",
          "translations": []
        },
        {
          "id": "s0575",
          "zh": "秦攻周，而周聚謂秦王曰：「為王計者不攻周。",
          "translations": []
        },
        {
          "id": "s0576",
          "zh": "攻周，實不足以利，聲畏天下。",
          "translations": []
        },
        {
          "id": "s0577",
          "zh": "天下以聲畏秦，必東合於齊。",
          "translations": []
        },
        {
          "id": "s0578",
          "zh": "兵獘於周。",
          "translations": []
        },
        {
          "id": "s0579",
          "zh": "合天下於齊，則秦不王矣。",
          "translations": []
        },
        {
          "id": "s0580",
          "zh": "天下欲獘秦，勸王攻周。",
          "translations": []
        },
        {
          "id": "s0581",
          "zh": "秦與天下獘，則令不行矣。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Forty-fifth year, a Zhou guest in Qin said to Zhou Ji: 'My lord should praise the Qin king's filial piety, and offer Ying as land to support the Queen Dowager, the Qin king will surely be pleased, this gives my lord Qin connections. If relations are good, the Zhou lord will surely consider it my lord's achievement. If relations sour, those who advised the Zhou lord to enter Qin will surely be guilty.' Qin attacked Zhou, but Zhou Ji said to the Qin king: 'For your majesty's benefit, do not attack Zhou. Attacking Zhou, in reality does not provide sufficient benefit, but creates the reputation of fearing all under heaven. All under heaven, fearing Qin because of this reputation, will surely unite eastward with Qi. Troops exhausted at Zhou. Uniting all under heaven with Qi, then Qin cannot become king. All under heaven wishing to exhaust Qin, advise your majesty to attack Zhou. Qin exhausting itself with all under heaven, then commands will not be carried out.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0583",
          "zh": "五十八年，三晉距秦。",
          "translations": []
        },
        {
          "id": "s0584",
          "zh": "周令其相國之秦，以秦之輕也，還其行。",
          "translations": []
        },
        {
          "id": "s0585",
          "zh": "客謂相國曰：「秦之輕重未可知也。",
          "translations": []
        },
        {
          "id": "s0586",
          "zh": "秦欲知三國之情。",
          "translations": []
        },
        {
          "id": "s0587",
          "zh": "公不如急見秦王曰『請為王聽東方之變』，秦王必重公。",
          "translations": []
        },
        {
          "id": "s0588",
          "zh": "重公，是秦重周，周以取秦也；",
          "translations": []
        },
        {
          "id": "s0589",
          "zh": "齊重，則固有周聚以收齊：是周常不失重國之交也。」",
          "translations": []
        },
        {
          "id": "s0590",
          "zh": "秦信周，發兵攻三晉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifty-eighth year, the Three Jin resisted Qin. Zhou ordered its prime minister to go to Qin, because Qin was treating it lightly, he returned without going. A guest said to the prime minister: 'Qin's attitude of light or heavy cannot be known. Qin wished to know the three states' situation. My lord should urgently meet the Qin king and say 'I request to listen to the eastern changes for your majesty,' the Qin king will surely value my lord. Valuing my lord means Qin values Zhou, Zhou can thereby take Qin; If Qi values Zhou, then Zhou Ji can certainly use this to win Qi: this is Zhou never losing important states' alliances.' Qin trusted Zhou, sent troops to attack the Three Jin.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0591",
          "zh": "五十九年，秦取韓陽城負黍，西周恐，倍秦，與諸侯約從，將天下銳師出伊闕攻秦，令秦無得通陽城。",
          "translations": []
        },
        {
          "id": "s0592",
          "zh": "秦昭王怒，使將軍摎攻西周。",
          "translations": []
        },
        {
          "id": "s0593",
          "zh": "西周君犇秦，頓首受罪，盡獻其邑三十六，口三萬。",
          "translations": []
        },
        {
          "id": "s0594",
          "zh": "秦受其獻，歸其君於周。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifty-ninth year, Qin took Han's Yangcheng and Fu Shu, Western Zhou feared, betrayed Qin, allied with the feudal lords in a covenant, led the world's elite troops out of Yi Que to attack Qin, preventing Qin from passing through Yangcheng. Qin Zhao Wang was angry, sent General Liu to attack Western Zhou. The Western Zhou lord fled to Qin, kowtowed and accepted punishment, completely offered his thirty-six cities, thirty thousand people. Qin accepted his offerings, returned his lord to Zhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0595",
          "zh": "周君、王赧卒，周民遂東亡。",
          "translations": []
        },
        {
          "id": "s0596",
          "zh": "秦取九鼎寶器，而遷西周公於憚狐。",
          "translations": []
        },
        {
          "id": "s0597",
          "zh": "後七歲，秦莊襄王滅東（西）周。",
          "translations": []
        },
        {
          "id": "s0598",
          "zh": "東西周皆入于秦，周既不祀。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Zhou lord and King Nan died, Zhou people then fled east. Qin took the nine tripods and precious vessels, and moved the Western Zhou duke to Danhu. Seven years later, Qin Zhuang Xiang Wang destroyed Eastern Zhou. Eastern and Western Zhou both entered Qin, Zhou no longer performed sacrifices.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0599",
          "zh": "太史公曰：學者皆稱周伐紂，居洛邑，綜其實不然。",
          "translations": []
        },
        {
          "id": "s0600",
          "zh": "武王營之，成王使召公卜居，居九鼎焉，而周復都豐、鎬。",
          "translations": []
        },
        {
          "id": "s0601",
          "zh": "至犬戎敗幽王，周乃東徙于洛邑。",
          "translations": []
        },
        {
          "id": "s0602",
          "zh": "所謂「周公葬（我）［於］畢」，畢在鎬東南杜中。",
          "translations": []
        },
        {
          "id": "s0603",
          "zh": "秦滅周。",
          "translations": []
        },
        {
          "id": "s0604",
          "zh": "漢興九十有餘載，天子將封泰山，東巡狩至河南，求周苗裔，封其後嘉三十里地，號曰周子南君，比列侯，以奉其先祭祀。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Grand Historian says: Scholars all claim Zhou attacked Zhou and resided in Luoyi, but comprehensively it was not so. King Wu planned it, King Cheng sent Shao Gong to divine the site, placed the nine tripods there, and Zhou again made its capital at Feng and Hao. Until the Quanrong defeated King You, Zhou then moved east to Luoyi. What is called 'Zhou Gong buried me at Bi', Bi is in the Du midst southeast of Hao. Qin extinguished Zhou. After Han arose, ninety-some years passed, the Son of Heaven was about to seal Taishan, toured east to Henan, sought Zhou descendants, enfeoffed their posterity Jia with thirty li of land, titled Zhou Zi Nan Jun, ranked as liehou, to continue their ancestral sacrifices.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}