{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "010",
    "url": "https://chinesenotes.com/shiji/shiji010.html",
    "title": {
      "zh": "孝文本紀",
      "en": "Annals of the Xiaowen Emperor",
      "raw": "《孝文本紀》 Annals of the Xiaowen Emperor"
    },
    "sentenceCount": 328,
    "translatedCount": 328,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:32.221Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝文皇帝，高祖中子也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Xiaowen was Gaozu's middle son.",
              "idiomatic": "Emperor Xiaowen was Gaozu's middle son.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "高祖十一年春，已破陳豨軍，定代地，立為代王，都中都。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the spring of Gaozu's eleventh year, after defeating Chen Xi's army and pacifying the Dai region, he was established as King of Dai with his capital at Zhongdu.",
              "idiomatic": "in the spring of Gaozu's eleventh year, after defeating Chen Xi's army and pacifying the Dai region, he was established as King of Dai with his capital at Zhongdu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "太后薄氏子。",
          "translations": [
            {
              "lang": "en",
              "literal": "He was the son of Empress Dowager Bo.",
              "idiomatic": "he was the son of Empress Dowager Bo.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "即位十七年，高后八年七月，高后崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "He ascended the throne in the seventeenth year of his reign. In the seventh month of Empress Gao's eighth year, Empress Gao passed away.",
              "idiomatic": "he ascended the throne in the seventeenth year of his reign. in the seventh month of Empress Gao's eighth year, Empress Gao passed away.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "九月，諸呂呂產等欲為亂，以危劉氏，大臣共誅之，謀召立代王，事在呂后語中。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the ninth month, the Lü clansmen led by Lü Chan plotted rebellion to endanger the Liu clan. The ministers executed them together and plotted to summon and establish the King of Dai. This matter is detailed in the Lü Empress Dowager's biography.",
              "idiomatic": "in the ninth month, the Lü clansmen led by Lü Chan plotted rebellion to endanger the Liu clan. the ministers executed them together and plotted to summon and establish the King of Dai. this matter is detailed in the Lü Empress Dowager's biography.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Xiaowen was Gaozu's middle son. In the spring of Gaozu's eleventh year, after defeating Chen Xi's army and pacifying the Dai region, he was established as King of Dai with his capital at Zhongdu. He was the son of Empress Dowager Bo. He ascended the throne in the seventeenth year of his reign. In the seventh month of Empress Gao's eighth year, Empress Gao passed away. In the ninth month, the Lü clansmen led by Lü Chan plotted rebellion to endanger the Liu clan. The ministers executed them together and plotted to summon and establish the King of Dai. This matter is detailed in the Lü Empress Dowager's biography.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0006",
          "zh": "丞相陳平、太尉周勃等使人迎代王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor Chen Ping, Grand Marshal Zhou Bo, and others sent people to welcome the King of Dai.",
              "idiomatic": "Chancellor Chen Ping, Grand Marshal Zhou Bo, and others sent people to welcome the King of Dai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "代王問左右郎中令張武等。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Dai consulted with his attendants including Chamberlain for Attendants Zhang Wu.",
              "idiomatic": "the King of Dai consulted with his attendants including Chamberlain for Attendants Zhang Wu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "張武等議曰：「漢大臣皆故高帝時大將，習兵，多謀詐，此其屬意非止此也，特畏高帝、呂太后威耳。",
          "translations": [
            {
              "lang": "en",
              "literal": "Zhang Wu etc. discussed said: 'Han ministers all former Gao Di time great generals, practiced in arms, many stratagems and deceits, this their intentions not stop here also, especially feared Gao Di, Lu Empress Dowager awe only.",
              "idiomatic": "Zhang Wu and the others discussed: 'The Han ministers are all great generals from the time of Emperor Gao. They are experienced in warfare and full of stratagems. Their intentions go beyond this - they only fear the awe-inspiring presence of Emperor Gao and Empress Dowager Lü.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "今已誅諸呂，新啑血京師，此以迎大王為名，實不可信。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now that the Lü clansmen have been executed and fresh blood stains the capital, their claim to welcome Your Majesty is just a pretense and cannot be trusted.",
              "idiomatic": "Now that the Lü clansmen have been executed and fresh blood stains the capital, their claim to welcome your Majesty is just a pretense and cannot be trusted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "願大王稱疾毋往，以觀其變。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Wish great king claim illness do not go, to observe their changes.'",
              "idiomatic": "We urge Your Majesty to feign illness and not go, so we can observe how the situation develops.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "中尉宋昌進曰：「群臣之議皆非也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Commandant Song Chang advanced said: 'The various ministers' discussions all wrong also.",
              "idiomatic": "Commandant Song Chang stepped forward and said: 'All the ministers' discussions are wrong.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "夫秦失其政，諸侯豪桀并起，人人自以為得之者以萬數，然卒踐天子之位者，劉氏也，天下絕望，一矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "When Qin lost its mandate, feudal lords and outstanding men rose up together. Tens of thousands considered themselves worthy of the throne, yet in the end it was the Liu clan who ascended the imperial position. The realm had lost all hope - that was the first reason.",
              "idiomatic": "when Qin lost its mandate, feudal lords and outstanding men rose up together. Tens of thousands considered themselves worthy of the throne, yet in the end it was the Liu clan who ascended the imperial position. the realm had lost all hope - that was the first reason.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "高帝封王子弟，地犬牙相制，此所謂盤石之宗也，天下服其彊，二矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Gao enfeoffed his sons and brothers with interlocking territories that controlled each other like interlocking dog teeth. This was what is called an unshakeable clan foundation. The realm submitted to its power - that was the second reason.",
              "idiomatic": "Emperor Gao enfeoffed his sons and brothers with interlocking territories that controlled each other like interlocking dog teeth. this was what is called an unshakeable clan foundation. the realm submitted to its power - that was the second reason.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "漢興，除秦苛政，約法令，施德惠，人人自安，難動搖，三矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "When the Han arose, they eliminated Qin's harsh rule, simplified the laws and commands, and bestowed virtue and favor. Everyone lived in peace and was difficult to unsettle - that was the third reason.",
              "idiomatic": "when the Han arose, they eliminated Qin's harsh rule, simplified the laws and commands, and bestowed virtue and favor. Everyone lived in peace and was difficult to unsettle - that was the third reason.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "夫以呂太后之嚴，立諸呂為三王，擅權專制，然而太尉以一節入北軍，一呼士皆左袒，為劉氏，叛諸呂，卒以滅之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Despite Empress Dowager Lü's strict rule and her establishment of three Lü kings who monopolized power, the Grand Marshal entered the Northern Army with just one tally. With one shout, all the soldiers bared their left arms for the Liu clan, rebelled against the Lü clan, and finally destroyed them.",
              "idiomatic": "Despite Empress Dowager Lü's strict rule and her establishment of three Lü kings who monopolized power, the Grand Marshal entered the northern Army with just one tally. With one shout, all the soldiers bared their left arms for the Liu clan, rebelled against the Lü clan, and finally destroyed them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "此乃天授，非人力也。",
          "translations": [
            {
              "lang": "en",
              "literal": "This was Heaven's gift, not achieved through human effort.",
              "idiomatic": "this was heaven's gift, not achieved through human effort.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "今大臣雖欲為變，百姓弗為使，其黨寧能專一邪？",
          "translations": [
            {
              "lang": "en",
              "literal": "Now ministers although desire to make change, common people not for them make, their faction how able unified question?",
              "idiomatic": "Now even if the ministers wanted to rebel, the common people would not follow them. How could their faction remain united?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "方今內有朱虛、東牟之親，外畏吳、楚、淮南、瑯邪、齊、代之彊。",
          "translations": [
            {
              "lang": "en",
              "literal": "At present, internally we have the support of relatives in Zhuxu and Dongmou, externally we fear the strength of Wu, Chu, Huainan, Langye, Qi, and Dai.",
              "idiomatic": "At present, internally we have the support of relatives in Zhuxu and Dongmou, externally we fear the strength of Wu, Chu, Huainan, Langye, Qi, and Dai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "方今高帝子獨淮南王與大王，大王又長，賢聖仁孝，聞於天下，故大臣因天下之心而欲迎立大王，大王勿疑也。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Present time Gao Di sons only Huainan King and great king, great king moreover elder, worthy sage benevolent filial, heard throughout realm, therefore ministers follow realm heart and desire welcome establish great king, great king do not doubt also.'",
              "idiomatic": "Among Emperor Gao's surviving sons, only the King of Huainan and Your Majesty remain. Your Majesty is also the elder, and your worthiness, wisdom, benevolence, and filial piety are renowned throughout the realm. Therefore, the ministers, following the will of the people, wish to welcome and establish Your Majesty. Your Majesty should have no doubts.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "代王報太后計之，猶與未定。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Dai reported to Empress Dowager Bo and consulted her about it, but they were still undecided.",
              "idiomatic": "the King of Dai reported to Empress Dowager Bo and consulted her about it, but they were still undecided.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "卜之龜，卦兆得大橫。",
          "translations": [
            {
              "lang": "en",
              "literal": "They divined with a turtle shell and obtained the hexagram 'Great Horizontal.'",
              "idiomatic": "they divined with a turtle shell and obtained the hexagram 'Great Horizontal.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "占曰：「大橫庚庚，余為天王，夏啟以光。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Divination said: 'Great horizontal geng geng, I become Heaven King, Xia Qi with light.'",
              "idiomatic": "The divination said: 'Great horizontal, geng geng - I shall become the Heavenly King, like Xia Qi shining with light.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "代王曰：「寡人固已為王矣，又何王？」",
          "translations": [
            {
              "lang": "en",
              "literal": "Dai King said: 'I already solidly am king already, again what king?'",
              "idiomatic": "The King of Dai said: 'I am already a king. What other king could this mean?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "卜人曰：「所謂天王者乃天子。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Diviner said: 'So-called Heaven King namely Son of Heaven.'",
              "idiomatic": "The diviner said: 'The so-called Heavenly King refers to the Son of Heaven.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "於是代王乃遣太后弟薄昭往見絳侯，絳侯等具為昭言所以迎立王意。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon the King of Dai dispatched Empress Dowager Bo's younger brother Bo Zhao to see the Marquis of Jiang. The Marquis of Jiang and others fully explained to Bo Zhao the reasons for welcoming and establishing the king.",
              "idiomatic": "thereupon the King of Dai dispatched Empress Dowager Bo's younger brother Bo Zhao to see the Marquis of Jiang. the Marquis of Jiang and others fully explained to Bo Zhao the reasons for welcoming and establishing the king.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "薄昭還報曰：「信矣，毋可疑者。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Bo Zhao returned reported said: 'Trustworthy already, no can doubt ones.'",
              "idiomatic": "Bo Zhao returned and reported: 'It's trustworthy. There should be no doubts.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "代王乃笑謂宋昌曰：「果如公言。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Dai King then laughed told Song Chang said: 'Indeed like gentleman words.'",
              "idiomatic": "The King of Dai then laughed and told Song Chang: 'Indeed, just as you said.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "乃命宋昌參乘，張武等六人乘傳詣長安。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then ordered Song Chang ride as attendant, Zhang Wu etc. six people ride relay carriages go to Chang'an.",
              "idiomatic": "He then ordered Song Chang to ride as his chariot attendant, and Zhang Wu and five others to ride relay carriages to Chang'an.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "至高陵休止，而使宋昌先馳之長安觀變。",
          "translations": [
            {
              "lang": "en",
              "literal": "Reached Gaoling rested stopped, and made Song Chang first gallop to Chang'an observe changes.",
              "idiomatic": "They reached Gaoling and rested there, while sending Song Chang ahead to gallop to Chang'an and observe the situation.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Chancellor Chen Ping, Grand Marshal Zhou Bo, and others sent people to welcome the King of Dai. The King of Dai consulted with his attendants including Chamberlain for Attendants Zhang Wu. Zhang Wu and the others discussed: 'The Han ministers are all great generals from the time of Emperor Gao. They are experienced in warfare and full of stratagems. Their intentions go beyond this - they only fear the awe-inspiring presence of Emperor Gao and Empress Dowager Lü.' Now that the Lü clansmen have been executed and fresh blood stains the capital, their claim to welcome Your Majesty is just a pretense and cannot be trusted. We urge Your Majesty to feign illness and not go, so we can observe how the situation develops.' Commandant Song Chang stepped forward and said: 'All the ministers' discussions are wrong. When Qin lost its mandate, feudal lords and outstanding men rose up together. Tens of thousands considered themselves worthy of the throne, yet in the end it was the Liu clan who ascended the imperial position. The realm had lost all hope - that was the first reason. Emperor Gao enfeoffed his sons and brothers with interlocking territories that controlled each other like interlocking dog teeth. This was what is called an unshakeable clan foundation. The realm submitted to its power - that was the second reason. When the Han arose, they eliminated Qin's harsh rule, simplified the laws and commands, and bestowed virtue and favor. Everyone lived in peace and was difficult to unsettle - that was the third reason. Despite Empress Dowager Lü's strict rule and her establishment of three Lü kings who monopolized power, the Grand Marshal entered the Northern Army with just one tally. With one shout, all the soldiers bared their left arms for the Liu clan, rebelled against the Lü clan, and finally destroyed them. This was Heaven's gift, not achieved through human effort. Now even if the ministers wanted to rebel, the common people would not follow them. How could their faction remain united? At present, internally we have the support of relatives in Zhuxu and Dongmou, externally we fear the strength of Wu, Chu, Huainan, Langye, Qi, and Dai. Among Emperor Gao's surviving sons, only the King of Huainan and Your Majesty remain. Your Majesty is also the elder, and your worthiness, wisdom, benevolence, and filial piety are renowned throughout the realm. Therefore, the ministers, following the will of the people, wish to welcome and establish Your Majesty. Your Majesty should have no doubts.' The King of Dai reported to Empress Dowager Bo and consulted her about it, but they were still undecided. They divined with a turtle shell and obtained the hexagram 'Great Horizontal.' The divination said: 'Great horizontal, geng geng - I shall become the Heavenly King, like Xia Qi shining with light.' The King of Dai said: 'I am already a king. What other king could this mean?' The diviner said: 'The so-called Heavenly King refers to the Son of Heaven.' Thereupon the King of Dai dispatched Empress Dowager Bo's younger brother Bo Zhao to see the Marquis of Jiang. The Marquis of Jiang and others fully explained to Bo Zhao the reasons for welcoming and establishing the king. Bo Zhao returned and reported: 'It's trustworthy. There should be no doubts.' The King of Dai then laughed and told Song Chang: 'Indeed, just as you said.' He then ordered Song Chang to ride as his chariot attendant, and Zhang Wu and five others to ride relay carriages to Chang'an. They reached Gaoling and rested there, while sending Song Chang ahead to gallop to Chang'an and observe the situation.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0030",
          "zh": "昌至渭橋，丞相以下皆迎。",
          "translations": [
            {
              "lang": "en",
              "literal": "When Chang reached the Wei Bridge, the Chancellor and all below him came to welcome him.",
              "idiomatic": "when Chang reached the wei Bridge, the Chancellor and all below him came to welcome him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "宋昌還報。",
          "translations": [
            {
              "lang": "en",
              "literal": "Song Chang returned and reported.",
              "idiomatic": "song Chang returned and reported.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "代王馳至渭橋，群臣拜謁稱臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Dai galloped to the Wei Bridge, where the ministers bowed in audience and addressed him as minister.",
              "idiomatic": "the King of Dai galloped to the wei Bridge, where the ministers bowed in audience and addressed him as minister.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "代王下車拜。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Dai descended from his chariot and bowed.",
              "idiomatic": "the King of Dai descended from his chariot and bowed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "太尉勃進曰：「願請閒言。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand Marshal Bo advanced said: 'Wish request private words.'",
              "idiomatic": "Grand Marshal Bo stepped forward and said: 'I wish to speak with you privately.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "宋昌曰：「所言公，公言之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Song Chang said: 'What spoken public, gentleman speak it.",
              "idiomatic": "Song Chang said: 'If it's a public matter, speak it openly.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "所言私，王者不受私。」",
          "translations": [
            {
              "lang": "en",
              "literal": "What spoken private, king ones not receive private.'",
              "idiomatic": "If it's a private matter, kings do not accept private communications.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "太尉乃跪上天子璽符。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Grand Marshal then knelt and presented the imperial seal and tally.",
              "idiomatic": "the Grand Marshal then knelt and presented the imperial seal and tally.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "代王謝曰：「至代邸而議之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Dai King declined said: 'Reach Dai residence then discuss it.'",
              "idiomatic": "The King of Dai declined and said: 'We will discuss it when we reach the Dai residence.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "遂馳入代邸。",
          "translations": [
            {
              "lang": "en",
              "literal": "He then galloped into the Dai residence.",
              "idiomatic": "he then galloped into the Dai residence.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "群臣從至。",
          "translations": [
            {
              "lang": "en",
              "literal": "The ministers followed and arrived.",
              "idiomatic": "the ministers followed and arrived.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "丞相陳平、太尉周勃、大將軍陳武、御史大夫張蒼、宗正劉郢、朱虛侯劉章、東牟侯劉興居、典客劉揭皆再拜言曰：「子弘等皆非孝惠帝子，不當奉宗廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor Chen Ping, Grand Marshal Zhou Bo, General-in-Chief Chen Wu, Grandee Secretary Zhang Cang, Imperial Clan Administrator Liu Ying, Marquis Zhu Xu Liu Zhang, Marquis Dong Mou Liu Xingju, Court Guests Receptionist Liu Jie all twice bowed spoke said: 'Zi Hong etc. all not Xiao Hui Emperor sons, not proper to serve ancestral temple.",
              "idiomatic": "Chancellor Chen Ping, Grand Marshal Zhou Bo, General-in-Chief Chen Wu, Grandee Secretary Zhang Cang, Imperial Clan Administrator Liu Ying, Marquis Zhu Xu Liu Zhang, Marquis Dong Mou Liu Xingju, and Court Guests Receptionist Liu Jie all bowed twice and said: 'Zi Hong and the others are not sons of Emperor Xiaohui and should not serve at the ancestral temple.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "臣謹請（與）陰安侯列侯頃王后與瑯邪王、宗室、大臣、列侯、吏二千石議曰：『大王高帝長子，宜為高帝嗣。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Ministers respectfully request (with) Yin'an Marquis various marquises Queen Dowager of King Qing and Langye King, imperial clan, ministers, various marquises, officials of two thousand shi discussed said: 'Great king Gao Di eldest son, suitable to be Gao Di successor.'",
              "idiomatic": "We ministers respectfully request to discuss with the Marquis of Yin'an, the various marquises, the Queen Dowager of King Qing, the King of Langye, the imperial clan, ministers, marquises, and officials of 2,000 shi, who have said: 'Your Majesty is Emperor Gao's eldest son and should succeed Emperor Gao.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "願大王即天子位。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Wish great king immediately Son of Heaven position.'",
              "idiomatic": "We wish Your Majesty to immediately ascend the imperial throne.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "代王曰：「奉高帝宗廟，重事也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dai King said: 'Serve Gao Di ancestral temple, heavy matter also.",
              "idiomatic": "The King of Dai said: 'Serving at Emperor Gao's ancestral temple is a grave matter.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "寡人不佞，不足以稱宗廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "I am untalented and insufficient to serve at the ancestral temple.",
              "idiomatic": "i am untalented and insufficient to serve at the ancestral temple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "願請楚王計宜者，寡人不敢當。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Wish request Chu King plan suitable ones, I not dare accept.'",
              "idiomatic": "I wish to request that the King of Chu be consulted on what is appropriate. I do not dare to accept.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "群臣皆伏固請。",
          "translations": [
            {
              "lang": "en",
              "literal": "All the ministers prostrated themselves and firmly requested.",
              "idiomatic": "All the ministers prostrated themselves and firmly requested.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "代王西鄉讓者三，南鄉讓者再。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Dai declined three times while facing west, and declined twice while facing south.",
              "idiomatic": "the King of Dai declined three times while facing west, and declined twice while facing south.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "丞相平等皆曰：「臣伏計之，大王奉高帝宗廟最宜稱，雖天下諸侯萬民以為宜。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor Ping etc. all said: 'Ministers prostrated considered it, great king serve Gao Di ancestral temple most suitable worthy, although realm feudal lords ten thousand people consider suitable.",
              "idiomatic": "Chancellor Ping and the others all said: 'We ministers have carefully considered it. Your Majesty serving at Emperor Gao's ancestral temple is most suitable and worthy. Even all the feudal lords and people of the realm consider it appropriate.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "臣等為宗廟社稷計，不敢忽。",
          "translations": [
            {
              "lang": "en",
              "literal": "We ministers, for the sake of the ancestral temple and the state, dare not be negligent.",
              "idiomatic": "we ministers, for the sake of the ancestral temple and the state, dare not be negligent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "願大王幸聽臣等。",
          "translations": [
            {
              "lang": "en",
              "literal": "We wish Your Majesty would graciously listen to us ministers.",
              "idiomatic": "we wish your Majesty would graciously listen to us ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "臣謹奉天子璽符再拜上。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Ministers respectfully present Son of Heaven seal tally twice bow offer.'",
              "idiomatic": "We ministers respectfully present the imperial seal and tally, bowing twice in offering.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "代王曰：「宗室將相王列侯以為莫宜寡人，寡人不敢辭。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Dai King said: 'Imperial clan generals chancellors kings marquises consider none suitable I, I not dare decline.'",
              "idiomatic": "The King of Dai said: 'If the imperial clan, generals, chancellors, kings, and marquises all consider me the most suitable, I dare not decline.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "遂即天子位。",
          "translations": [
            {
              "lang": "en",
              "literal": "He then immediately ascended the imperial throne.",
              "idiomatic": "he then immediately ascended the imperial throne.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Chang reached the Wei Bridge, the Chancellor and all below him came to welcome him. Song Chang returned and reported. The King of Dai galloped to the Wei Bridge, where the ministers bowed in audience and addressed him as minister. The King of Dai descended from his chariot and bowed. Grand Marshal Bo stepped forward and said: 'I wish to speak with you privately.' Song Chang said: 'If it's a public matter, speak it openly. If it's a private matter, kings do not accept private communications.' The Grand Marshal then knelt and presented the imperial seal and tally. The King of Dai declined and said: 'We will discuss it when we reach the Dai residence.' He then galloped into the Dai residence. The ministers followed and arrived. Chancellor Chen Ping, Grand Marshal Zhou Bo, General-in-Chief Chen Wu, Grandee Secretary Zhang Cang, Imperial Clan Administrator Liu Ying, Marquis Zhu Xu Liu Zhang, Marquis Dong Mou Liu Xingju, and Court Guests Receptionist Liu Jie all bowed twice and said: 'Zi Hong and the others are not sons of Emperor Xiaohui and should not serve at the ancestral temple.' We ministers respectfully request to discuss with the Marquis of Yin'an, the various marquises, the Queen Dowager of King Qing, the King of Langye, the imperial clan, ministers, marquises, and officials of 2,000 shi, who have said: 'Your Majesty is Emperor Gao's eldest son and should succeed Emperor Gao.' We wish Your Majesty to immediately ascend the imperial throne.' The King of Dai said: 'Serving at Emperor Gao's ancestral temple is a grave matter. I am untalented and insufficient to serve at the ancestral temple. I wish to request that the King of Chu be consulted on what is appropriate. I do not dare to accept.' All the ministers prostrated themselves and firmly requested. The King of Dai declined three times while facing west, and declined twice while facing south. Chancellor Ping and the others all said: 'We ministers have carefully considered it. Your Majesty serving at Emperor Gao's ancestral temple is most suitable and worthy. Even all the feudal lords and people of the realm consider it appropriate. We ministers, for the sake of the ancestral temple and the state, dare not be negligent. We wish Your Majesty would graciously listen to us ministers. We ministers respectfully present the imperial seal and tally, bowing twice in offering.' The King of Dai said: 'If the imperial clan, generals, chancellors, kings, and marquises all consider me the most suitable, I dare not decline.' He then immediately ascended the imperial throne.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "群臣以禮次侍。",
          "translations": [
            {
              "lang": "en",
              "literal": "The ministers attended in proper ritual order.",
              "idiomatic": "the ministers attended in proper ritual order.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "乃使太仆嬰與東牟侯興居清宮，奉天子法駕，迎于代邸。",
          "translations": [
            {
              "lang": "en",
              "literal": "He then ordered Grand Coachman Ying and Marquis Dong Mou Xingju to clear the palace and bring the imperial ceremonial carriage to welcome him at the Dai residence.",
              "idiomatic": "he then ordered Grand Coachman Ying and Marquis Dong Mou Xingju to clear the palace and bring the imperial ceremonial carriage to welcome him at the Dai residence.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "皇帝即日夕入未央宮。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor entered Weiyang Palace that very evening.",
              "idiomatic": "the emperor entered weiyang Palace that very evening.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "乃夜拜宋昌為衛將軍，鎮撫南北軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "That night he appointed Song Chang as Guard General to pacify and control the northern and southern armies.",
              "idiomatic": "that night he appointed song Chang as Guard General to pacify and control the northern and southern armies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "以張武為郎中令，行殿中。",
          "translations": [
            {
              "lang": "en",
              "literal": "He appointed Zhang Wu as Chamberlain for Attendants to manage palace affairs.",
              "idiomatic": "he appointed Zhang Wu as Chamberlain for Attendants to manage palace affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "還坐前殿。",
          "translations": [
            {
              "lang": "en",
              "literal": "He returned and sat in the front hall.",
              "idiomatic": "he returned and sat in the front hall.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "於是夜下詔書曰：「閒者諸呂用事擅權，謀為大逆，欲以危劉氏宗廟，賴將相列侯宗室大臣誅之，皆伏其辜。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon night issued edict said: 'Recently various Lu handled affairs monopolized power, plotted great rebellion, desired to endanger Liu clan ancestral temple, relied on generals chancellors marquises imperial clan ministers executed them, all submitted to their punishment.",
              "idiomatic": "That night he issued an edict saying: 'Recently the Lü clansmen handled affairs and monopolized power. They plotted great rebellion to endanger the Liu clan ancestral temple. Thanks to the generals, chancellors, marquises, imperial clan, and ministers who executed them, they all received their just punishment.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "朕初即位，其赦天下，賜民爵一級，女子百戶牛酒，酺五日。」",
          "translations": [
            {
              "lang": "en",
              "literal": "I initially ascended throne, let there be amnesty throughout realm, grant people nobility rank one level, women hundred households ox wine, drinking parties five days.'",
              "idiomatic": "Since I have just ascended the throne, let there be a general amnesty throughout the realm. Grant the people one level of nobility rank, and women in every hundred households oxen and wine. Hold drinking celebrations for five days.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The ministers attended in proper ritual order. He then ordered Grand Coachman Ying and Marquis Dong Mou Xingju to clear the palace and bring the imperial ceremonial carriage to welcome him at the Dai residence. The emperor entered Weiyang Palace that very evening. That night he appointed Song Chang as Guard General to pacify and control the northern and southern armies. He appointed Zhang Wu as Chamberlain for Attendants to manage palace affairs. He returned and sat in the front hall. That night he issued an edict saying: 'Recently the Lü clansmen handled affairs and monopolized power. They plotted great rebellion to endanger the Liu clan ancestral temple. Thanks to the generals, chancellors, marquises, imperial clan, and ministers who executed them, they all received their just punishment. Since I have just ascended the throne, let there be a general amnesty throughout the realm. Grant the people one level of nobility rank, and women in every hundred households oxen and wine. Hold drinking celebrations for five days.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0064",
          "zh": "辛亥，皇帝即阼，謁高廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the xinhai day, the emperor ascended the throne and paid respects at the Gao ancestral temple.",
              "idiomatic": "On the xinhai day, the emperor ascended the throne and paid respects at the Gao ancestral temple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "右丞相平徙為左丞相，太尉勃為右丞相，大將軍灌嬰為太尉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Right Chancellor Ping was moved to Left Chancellor, Grand Marshal Bo became Right Chancellor, and General-in-Chief Guan Ying became Grand Marshal.",
              "idiomatic": "Right Chancellor Ping was moved to Left Chancellor, Grand Marshal Bo became Right Chancellor, and General-in-Chief Guan Ying became Grand Marshal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "諸呂所奪齊楚故地，皆復與之。",
          "translations": [
            {
              "lang": "en",
              "literal": "All the lands previously seized from Qi and Chu by the Lü clansmen were restored to them.",
              "idiomatic": "All the lands previously seized from Qi and Chu by the Lü clansmen were restored to them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the xinhai day, the emperor ascended the throne and paid respects at the Gao ancestral temple. Right Chancellor Ping was moved to Left Chancellor, Grand Marshal Bo became Right Chancellor, and General-in-Chief Guan Ying became Grand Marshal. All the lands previously seized from Qi and Chu by the Lü clansmen were restored to them.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "壬子，遣車騎將軍薄昭迎皇太后於代。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the renzi day, he dispatched Chariot Cavalry General Bo Zhao to welcome the Empress Dowager from Dai.",
              "idiomatic": "On the renzi day, he dispatched Chariot Cavalry General Bo Zhao to welcome the Empress Dowager from Dai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "皇帝曰：「呂產自置為相國，呂祿為上將軍，擅矯遣灌將軍嬰將兵擊齊，欲代劉氏，嬰留滎陽弗擊，與諸侯合謀以誅呂氏。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Lu Chan self appointed as Chancellor, Lu Lu as Supreme General, arbitrarily forged orders dispatched Guan General Ying lead troops attack Qi, desired to replace Liu clan, Ying stayed Xingyang not attack, with feudal lords jointly plotted to execute Lu clan.",
              "idiomatic": "The emperor said: 'Lü Chan appointed himself Chancellor and Lü Lu as Supreme General. They arbitrarily forged orders to dispatch General Guan Ying with troops to attack Qi, intending to replace the Liu clan. Ying stayed at Xingyang and did not attack, joining with the feudal lords in plotting to execute the Lü clan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "呂產欲為不善，丞相陳平與太尉周勃謀奪呂產等軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "Lü Chan intended to do evil, so Chancellor Chen Ping and Grand Marshal Zhou Bo plotted to seize Lü Chan and the others' army.",
              "idiomatic": "Lü Chan intended to do evil, so Chancellor Chen Ping and Grand Marshal Zhou Bo plotted to seize Lü Chan and the others' army.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "朱虛侯劉章首先捕呂產等。",
          "translations": [
            {
              "lang": "en",
              "literal": "Marquis Zhu Xu Liu Zhang was the first to capture Lü Chan and the others.",
              "idiomatic": "Marquis Zhu Xu Liu Zhang was the first to capture Lü Chan and the others.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "太尉身率襄平侯通持節承詔入北軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Grand Marshal personally led Marquis Xiangping Tong, holding the imperial tally and edict, into the Northern Army.",
              "idiomatic": "the Grand Marshal personally led Marquis Xiangping Tong, holding the imperial tally and edict, into the northern Army.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "典客劉揭身奪趙王呂祿印。",
          "translations": [
            {
              "lang": "en",
              "literal": "Court Guests Receptionist Liu Jie personally seized the seal of King Zhao Lü Lu.",
              "idiomatic": "Court Guests Receptionist Liu Jie personally seized the seal of King Zhao Lü Lu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "益封太尉勃萬戶，賜金五千斤。",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand Marshal Bo was additionally enfeoffed with ten thousand households and granted five thousand jin of gold.",
              "idiomatic": "Grand Marshal Bo was additionally enfeoffed with ten thousand households and granted five thousand jin of gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "丞相陳平、灌將軍嬰邑各三千戶，金二千斤。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor Chen Ping and General Guan Ying each received fiefs of three thousand households and two thousand jin of gold.",
              "idiomatic": "Chancellor Chen Ping and General Guan Ying each received fiefs of three thousand households and two thousand jin of gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "朱虛侯劉章、襄平侯通、東牟侯劉興居邑各二千戶，金千斤。",
          "translations": [
            {
              "lang": "en",
              "literal": "Marquis Zhu Xu Liu Zhang, Marquis Xiangping Tong, and Marquis Dong Mou Liu Xingju each received fiefs of two thousand households and one thousand jin of gold.",
              "idiomatic": "Marquis Zhu Xu Liu Zhang, Marquis Xiangping Tong, and Marquis Dong Mou Liu Xingju each received fiefs of two thousand households and one thousand jin of gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "封典客揭為陽信侯，賜金千斤。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Enfeoffed Court Guests Receptionist Jie as Yangxin Marquis, granted gold thousand jin.'",
              "idiomatic": "Court Guests Receptionist Jie was enfeoffed as Marquis of Yangxin and granted one thousand jin of gold.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the renzi day, he dispatched Chariot Cavalry General Bo Zhao to welcome the Empress Dowager from Dai. The emperor said: 'Lü Chan appointed himself Chancellor and Lü Lu as Supreme General. They arbitrarily forged orders to dispatch General Guan Ying with troops to attack Qi, intending to replace the Liu clan. Ying stayed at Xingyang and did not attack, joining with the feudal lords in plotting to execute the Lü clan. Lü Chan intended to do evil, so Chancellor Chen Ping and Grand Marshal Zhou Bo plotted to seize Lü Chan and the others' army. Marquis Zhu Xu Liu Zhang was the first to capture Lü Chan and the others. The Grand Marshal personally led Marquis Xiangping Tong, holding the imperial tally and edict, into the Northern Army. Court Guests Receptionist Liu Jie personally seized the seal of King Zhao Lü Lu. Grand Marshal Bo was additionally enfeoffed with ten thousand households and granted five thousand jin of gold. Chancellor Chen Ping and General Guan Ying each received fiefs of three thousand households and two thousand jin of gold. Marquis Zhu Xu Liu Zhang, Marquis Xiangping Tong, and Marquis Dong Mou Liu Xingju each received fiefs of two thousand households and one thousand jin of gold. Court Guests Receptionist Jie was enfeoffed as Marquis of Yangxin and granted one thousand jin of gold.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0078",
          "zh": "十二月，上曰：「法者，治之正也，所以禁暴而率善人也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month, emperor said: 'Law ones, governance proper also, that by which prohibit violence and lead good people.",
              "idiomatic": "In the twelfth month, the emperor said: 'Laws are the foundation of governance, that by which we prohibit violence and guide good people.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "今犯法已論，而使毋罪之父母妻子同產坐之，及為收帑，朕甚不取。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now when someone violates the law and has already been judged, yet we cause their innocent parents, wives, children, and siblings to suffer for it, and even confiscate their property - this I greatly reject.",
              "idiomatic": "Now when someone violates the law and has already been judged, yet we cause their innocent parents, wives, children, and siblings to suffer for it, and even confiscate their property - this i greatly reject.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "其議之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let discuss it.'",
              "idiomatic": "Let this be discussed.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "有司皆曰：「民不能自治，故為法以禁之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials all said: 'People cannot self govern, therefore establish law to prohibit it.",
              "idiomatic": "The officials all said: 'The people cannot govern themselves, therefore laws are established to prohibit wrongdoing.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "相坐坐收，所以累其心，使重犯法，所從來遠矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Joint liability and confiscation are what burden their minds and make them dread violating the law. This practice has come from far back.",
              "idiomatic": "Joint liability and confiscation are what burden their minds and make them dread violating the law. this practice has come from far back.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "如故便。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Like former convenient.'",
              "idiomatic": "Keep it as before for convenience.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "上曰：「朕聞法正則民愨，罪當則民從。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'I heard law upright then people trust, punishment fitting then people follow.",
              "idiomatic": "The emperor said: 'I have heard that when laws are upright, the people trust them; when punishments fit the crime, the people follow.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "且夫牧民而導之善者，吏也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover, those who shepherd the people and guide them toward goodness are the officials.",
              "idiomatic": "Moreover, those who shepherd the people and guide them toward goodness are the officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "其既不能導，又以不正之法罪之，是反害於民為暴者也。",
          "translations": [
            {
              "lang": "en",
              "literal": "If they cannot guide the people, yet punish them with unjust laws, this instead harms the people and becomes violence against them.",
              "idiomatic": "if they cannot guide the people, yet punish them with unjust laws, this instead harms the people and becomes violence against them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "何以禁之？",
          "translations": [
            {
              "lang": "en",
              "literal": "What by prohibit it?",
              "idiomatic": "How then can we prohibit wrongdoing?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "朕未見其便，其孰計之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "I not seen its convenience, let who plan it.'",
              "idiomatic": "I do not see the benefit in this. Let someone reconsider it.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "有司皆曰：「陛下加大惠，德甚盛，非臣等所及也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials all said: 'Your Majesty increases great favor, virtue very abundant, not ministers etc. what reach also.",
              "idiomatic": "The officials all said: 'Your Majesty bestows great favor and virtue in abundance, beyond what we ministers can attain.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "請奉詔書，除收帑諸相坐律令。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Request follow edict, eliminate confiscate property various joint liability law commands.'",
              "idiomatic": "We request to follow the edict and eliminate the laws regarding confiscation of property and various joint liability statutes.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the twelfth month, the emperor said: 'Laws are the foundation of governance, that by which we prohibit violence and guide good people. Now when someone violates the law and has already been judged, yet we cause their innocent parents, wives, children, and siblings to suffer for it, and even confiscate their property - this I greatly reject. Let this be discussed.' The officials all said: 'The people cannot govern themselves, therefore laws are established to prohibit wrongdoing. Joint liability and confiscation are what burden their minds and make them dread violating the law. This practice has come from far back. Keep it as before for convenience.' The emperor said: 'I have heard that when laws are upright, the people trust them; when punishments fit the crime, the people follow. Moreover, those who shepherd the people and guide them toward goodness are the officials. If they cannot guide the people, yet punish them with unjust laws, this instead harms the people and becomes violence against them. How then can we prohibit wrongdoing? I do not see the benefit in this. Let someone reconsider it.' The officials all said: 'Your Majesty bestows great favor and virtue in abundance, beyond what we ministers can attain. We request to follow the edict and eliminate the laws regarding confiscation of property and various joint liability statutes.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0092",
          "zh": "正月，有司言曰：「蚤建太子，所以尊宗廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "First month, officials spoke said: 'Early establish Crown Prince, that by which honor ancestral temple.",
              "idiomatic": "In the first month, the officials said: 'Establishing the Crown Prince early is what honors the ancestral temple.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "請立太子。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Request establish Crown Prince.'",
              "idiomatic": "We request to establish a Crown Prince.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "上曰：「朕既不德，上帝神明未歆享，天下人民未有嗛志。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'I already lacking virtue, Supreme Thearch spirits not pleased enjoyed, realm people not have satisfied will.",
              "idiomatic": "The emperor said: 'I am already lacking in virtue. The Supreme Thearch and spirits are not pleased with my offerings, and the people of the realm are not yet content.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "今縱不能博求天下賢聖有德之人而禪天下焉，而曰豫建太子，是重吾不德也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now even if I cannot extensively seek worthy and sage virtuous people throughout the realm and yield the throne to them, yet to say we should early establish a Crown Prince - this would only add to my lack of virtue.",
              "idiomatic": "Now even if i cannot extensively seek worthy and sage virtuous people throughout the realm and yield the throne to them, yet to say we should early establish a Crown Prince - this would only add to my lack of virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "謂天下何？",
          "translations": [
            {
              "lang": "en",
              "literal": "Tell realm what?",
              "idiomatic": "What would we say to the realm?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "其安之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let settle it.'",
              "idiomatic": "Let it rest.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "有司曰：「豫建太子，所以重宗廟社稷，不忘天下也。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials said: 'Advance establish Crown Prince, that by which weight ancestral temple state altars, not forget realm also.'",
              "idiomatic": "The officials said: 'Establishing the Crown Prince in advance is what gives weight to the ancestral temple and the state, and does not forget the realm.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "上曰：「楚王，季父也，春秋高，閱天下之義理多矣，明於國家之大體。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Chu King, youngest uncle also, years high, seen realm righteousness principles many already, clear about state great structure.",
              "idiomatic": "The emperor said: 'The King of Chu is my youngest uncle. He is advanced in years and has seen much of the realm's principles of righteousness. He understands the great structure of the state.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "吳王於朕，兄也，惠仁以好德。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Wu is my brother, benevolent and kind, loving virtue.",
              "idiomatic": "the King of Wu is my brother, benevolent and kind, loving virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "淮南王，弟也，秉德以陪朕。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Huainan is my younger brother, grasping virtue to accompany me.",
              "idiomatic": "the King of Huainan is my younger brother, grasping virtue to accompany me.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "豈為不豫哉！",
          "translations": [
            {
              "lang": "en",
              "literal": "How for not prepare question!",
              "idiomatic": "How could this not be preparation!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "諸侯王宗室昆弟有功臣，多賢及有德義者，若舉有德以陪朕之不能終，是社稷之靈，天下之福也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Among the feudal kings and imperial clansmen brothers who are meritorious ministers, many are worthy and possess virtue and righteousness. If we raise one with virtue to accompany my inability to complete my duties, this would be the spirit of the state altars and the fortune of the realm.",
              "idiomatic": "Among the feudal kings and imperial clansmen brothers who are meritorious ministers, many are worthy and possess virtue and righteousness. if we raise one with virtue to accompany my inability to complete my duties, this would be the spirit of the state altars and the fortune of the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "今不選舉焉，而曰必子，人其以朕為忘賢有德者而專於子，非所以憂天下也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now if we do not select and elect worthy people, yet say we must choose a son, people would consider me to have forgotten the worthy and virtuous and to be devoted only to my son - this is not how to care for the realm.",
              "idiomatic": "Now if we do not select and elect worthy people, yet say we must choose a son, people would consider me to have forgotten the worthy and virtuous and to be devoted only to my son - this is not how to care for the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "朕甚不取也。」",
          "translations": [
            {
              "lang": "en",
              "literal": "I very not take also.'",
              "idiomatic": "I greatly reject this.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "有司皆固請曰：「古者殷周有國，治安皆千餘歲，古之有天下者莫長焉，用此道也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials all firmly requested said: 'Ancient ones Yin Zhou possessed state, peaceful governance all thousand remaining years, ancient ones possessed realm none longer there, used this way also.",
              "idiomatic": "The officials all firmly requested saying: 'In ancient times, the Yin and Zhou dynasties possessed their states, and their peaceful governance lasted over a thousand years. No one in ancient times who possessed the realm lasted longer than they did, because they used this method.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "立嗣必子，所從來遠矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Establishing a successor must be a son - this practice has come from far back.",
              "idiomatic": "Establishing a successor must be a son - this practice has come from far back.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "高帝親率士大夫，始平天下，建諸侯，為帝者太祖。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Gao personally led the scholar-officials, began pacifying the realm, established the feudal lords - he became the great ancestor for emperors.",
              "idiomatic": "Emperor Gao personally led the scholar-officials, began pacifying the realm, established the feudal lords - he became the great ancestor for emperors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "諸侯王及列侯始受國者皆亦為其國祖。",
          "translations": [
            {
              "lang": "en",
              "literal": "The feudal kings and marquises who first received their states all also became the ancestors of their states.",
              "idiomatic": "the feudal kings and marquises who first received their states all also became the ancestors of their states.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "子孫繼嗣，世世弗絕，天下之大義也，故高帝設之以撫海內。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sons and grandsons succeeding in inheritance, continuing through generations without interruption - this is the great righteousness of the realm. Therefore Emperor Gao established this to pacify all within the seas.",
              "idiomatic": "sons and grandsons succeeding in inheritance, continuing through generations without interruption - this is the great righteousness of the realm. therefore Emperor Gao established this to pacify all within the seas.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "今釋宜建而更選於諸侯及宗室，非高帝之志也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now to abandon what should be established and instead select from among the feudal lords and imperial clan - this is not Emperor Gao's intention.",
              "idiomatic": "Now to abandon what should be established and instead select from among the feudal lords and imperial clan - this is not Emperor Gao's intention.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "更議不宜。",
          "translations": [
            {
              "lang": "en",
              "literal": "They discussed changing it but found it unsuitable.",
              "idiomatic": "they discussed changing it but found it unsuitable.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "子某最長，純厚慈仁，請建以為太子。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Son certain eldest, pure thick benevolent kind, request establish as Crown Prince.'",
              "idiomatic": "A certain son is the eldest, pure and thick, benevolent and kind. We request to establish him as Crown Prince.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "上乃許之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor then permitted it.",
              "idiomatic": "the emperor then permitted it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "因賜天下民當代父後者爵各一級封將軍薄昭為軹侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thus he granted the people of the realm who should succeed their fathers as heirs one level of nobility each, and enfeoffed General Bo Zhao as Marquis of Zhi.",
              "idiomatic": "Thus he granted the people of the realm who should succeed their fathers as heirs one level of nobility each, and enfeoffed General Bo Zhao as Marquis of Zhi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first month, the officials said: 'Establishing the Crown Prince early is what honors the ancestral temple. We request to establish a Crown Prince.' The emperor said: 'I am already lacking in virtue. The Supreme Thearch and spirits are not pleased with my offerings, and the people of the realm are not yet content. Now even if I cannot extensively seek worthy and sage virtuous people throughout the realm and yield the throne to them, yet to say we should early establish a Crown Prince - this would only add to my lack of virtue. What would we say to the realm? Let it rest.' The officials said: 'Establishing the Crown Prince in advance is what gives weight to the ancestral temple and the state, and does not forget the realm.' The emperor said: 'The King of Chu is my youngest uncle. He is advanced in years and has seen much of the realm's principles of righteousness. He understands the great structure of the state. The King of Wu is my brother, benevolent and kind, loving virtue. The King of Huainan is my younger brother, grasping virtue to accompany me. How could this not be preparation! Among the feudal kings and imperial clansmen brothers who are meritorious ministers, many are worthy and possess virtue and righteousness. If we raise one with virtue to accompany my inability to complete my duties, this would be the spirit of the state altars and the fortune of the realm. Now if we do not select and elect worthy people, yet say we must choose a son, people would consider me to have forgotten the worthy and virtuous and to be devoted only to my son - this is not how to care for the realm. I greatly reject this.' The officials all firmly requested saying: 'In ancient times, the Yin and Zhou dynasties possessed their states, and their peaceful governance lasted over a thousand years. No one in ancient times who possessed the realm lasted longer than they did, because they used this method. Establishing a successor must be a son - this practice has come from far back. Emperor Gao personally led the scholar-officials, began pacifying the realm, established the feudal lords - he became the great ancestor for emperors. The feudal kings and marquises who first received their states all also became the ancestors of their states. Sons and grandsons succeeding in inheritance, continuing through generations without interruption - this is the great righteousness of the realm. Therefore Emperor Gao established this to pacify all within the seas. Now to abandon what should be established and instead select from among the feudal lords and imperial clan - this is not Emperor Gao's intention. They discussed changing it but found it unsuitable. A certain son is the eldest, pure and thick, benevolent and kind. We request to establish him as Crown Prince.' The emperor then permitted it. Thus he granted the people of the realm who should succeed their fathers as heirs one level of nobility each, and enfeoffed General Bo Zhao as Marquis of Zhi.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "三月，有司請立皇后。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the third month, the officials requested to establish an Empress.",
              "idiomatic": "in the third month, the officials requested to establish an Empress.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "薄太后曰：「諸侯皆同姓，立太子母為皇后。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Bo Empress Dowager said: 'Feudal lords all same surname, establish Crown Prince mother as Empress.'",
              "idiomatic": "Empress Dowager Bo said: 'All the feudal lords have the same surname. Establish the Crown Prince's mother as Empress.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "皇后姓竇氏。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Empress was of the Dou clan.",
              "idiomatic": "the Empress was of the Dou clan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "上為立后故，賜天下鰥寡孤獨窮困及年八十已上孤兒九歲已下布帛米肉各有數。",
          "translations": [
            {
              "lang": "en",
              "literal": "Because of establishing the Empress, the emperor granted the realm's widowers, widows, orphans, the solitary, the poor, the distressed, and those eighty years and above, and orphans nine years and below, silk, grain, rice, and meat each in appropriate amounts.",
              "idiomatic": "Because of establishing the Empress, the emperor granted the realm's widowers, widows, orphans, the solitary, the poor, the distressed, and those eighty years and above, and orphans nine years and below, silk, grain, rice, and meat each in appropriate amounts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "上從代來，初即位，施德惠天下，填撫諸侯四夷皆洽驩，乃循從代來功臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor came from Dai. Initially ascending the throne, he applied virtue and favor throughout the realm, filling and pacifying the feudal lords and four barbarians who were all harmonious and happy. Then he followed up with the meritorious ministers who came from Dai.",
              "idiomatic": "the emperor came from Dai. initially ascending the throne, he applied virtue and favor throughout the realm, filling and pacifying the feudal lords and four barbarians who were all harmonious and happy. then he followed up with the meritorious ministers who came from Dai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "上曰：「方大臣之誅諸呂迎朕，朕狐疑，皆止朕，唯中尉宋昌勸朕，朕以得保奉宗廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'When ministers executed various Lu welcomed me, I hesitant doubtful, all stopped me, only Commandant Song Chang urged me, I thus able protect serve ancestral temple.",
              "idiomatic": "The emperor said: 'When the ministers executed the Lü clansmen and welcomed me, I was hesitant and doubtful. They all tried to stop me, but only Commandant Song Chang urged me on. Thus I was able to protect and serve at the ancestral temple.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "已尊昌為衛將軍，其封昌為壯武侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "I have already honored Chang as Guard General, and now I enfeoff him as Marquis of Zhuangwu.",
              "idiomatic": "i have already honored Chang as Guard General, and now i enfeoff him as Marquis of Zhuangwu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "諸從朕六人，官皆至九卿。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Various followed me six people, offices all reached nine ministers.'",
              "idiomatic": "The six people who followed me shall all have offices reaching the nine ministers.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, the officials requested to establish an Empress. Empress Dowager Bo said: 'All the feudal lords have the same surname. Establish the Crown Prince's mother as Empress.' The Empress was of the Dou clan. Because of establishing the Empress, the emperor granted the realm's widowers, widows, orphans, the solitary, the poor, the distressed, and those eighty years and above, and orphans nine years and below, silk, grain, rice, and meat each in appropriate amounts. The emperor came from Dai. Initially ascending the throne, he applied virtue and favor throughout the realm, filling and pacifying the feudal lords and four barbarians who were all harmonious and happy. Then he followed up with the meritorious ministers who came from Dai. The emperor said: 'When the ministers executed the Lü clansmen and welcomed me, I was hesitant and doubtful. They all tried to stop me, but only Commandant Song Chang urged me on. Thus I was able to protect and serve at the ancestral temple. I have already honored Chang as Guard General, and now I enfeoff him as Marquis of Zhuangwu. The six people who followed me shall all have offices reaching the nine ministers.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "上曰：「列侯從高帝入蜀、漢中者六十八人皆益封各三百戶，故吏二千石以上從高帝潁川守尊等十人食邑六百戶，淮陽守申徒嘉等十人五百戶，衛尉定等十人四百戶。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Marquises followed Gao Di entered Shu, Hanzhong ones sixty eight people all additionally enfeoffed each three hundred households, former officials two thousand shi above followed Gao Di Yingchuan Governor Zun etc. ten people food fiefs six hundred households, Huaiyang Governor Shen Tu Jia etc. ten people five hundred households, Guard Captain Ding etc. ten people four hundred households.",
              "idiomatic": "The emperor said: 'The sixty-eight marquises who followed Emperor Gao into Shu and Hanzhong shall all receive additional enfeoffments of three hundred households each. The former officials of 2,000 shi and above who followed Emperor Gao - Yingchuan Governor Zun and nine others shall receive food fiefs of six hundred households; Huaiyang Governor Shen Tu Jia and nine others shall receive five hundred households; Guard Captain Ding and nine others shall receive four hundred households.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "封淮南王舅父趙兼為周陽侯，齊王舅父駟鈞為清郭侯。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Enfeoffed Huainan King maternal uncle Zhao Jian as Zhouyang Hou, Qi King maternal uncle Si Jun as Qingguo Hou.'",
              "idiomatic": "Enfeoff the Huainan King's maternal uncle Zhao Jian as Marquis of Zhouyang, and the Qi King's maternal uncle Si Jun as Marquis of Qingguo.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "秋，封故常山丞相蔡兼為樊侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "In autumn, he enfeoffed the former Chancellor of Changshan, Cai Jian, as Marquis of Fan.",
              "idiomatic": "in autumn, he enfeoffed the former Chancellor of Changshan, Cai Jian, as Marquis of Fan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'The sixty-eight marquises who followed Emperor Gao into Shu and Hanzhong shall all receive additional enfeoffments of three hundred households each. The former officials of 2,000 shi and above who followed Emperor Gao - Yingchuan Governor Zun and nine others shall receive food fiefs of six hundred households; Huaiyang Governor Shen Tu Jia and nine others shall receive five hundred households; Guard Captain Ding and nine others shall receive four hundred households. Enfeoff the Huainan King's maternal uncle Zhao Jian as Marquis of Zhouyang, and the Qi King's maternal uncle Si Jun as Marquis of Qingguo.' In autumn, he enfeoffed the former Chancellor of Changshan, Cai Jian, as Marquis of Fan.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0128",
          "zh": "人或說右丞相曰：「君本誅諸呂，迎代王，今又矜其功，受上賞，處尊位，禍且及身。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Person or persuaded Right Chancellor said: 'You originally executed various Lu, welcomed Dai King, now again boast their merit, receive supreme reward, occupy honored position, calamity moreover reach body.'",
              "idiomatic": "Someone persuaded the Right Chancellor saying: 'You originally executed the Lü clansmen and welcomed the King of Dai. Now you boast of your merit again, receive the supreme rewards, and occupy an honored position - calamity will soon reach you.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "右丞相勃乃謝病免罷，左丞相平專為丞相。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Right Chancellor Bo then declined on grounds of illness and resigned from office. Left Chancellor Ping exclusively became Chancellor.",
              "idiomatic": "the Right Chancellor Bo then declined on grounds of illness and resigned from office. Left Chancellor Ping exclusively became Chancellor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Someone persuaded the Right Chancellor saying: 'You originally executed the Lü clansmen and welcomed the King of Dai. Now you boast of your merit again, receive the supreme rewards, and occupy an honored position - calamity will soon reach you.' The Right Chancellor Bo then declined on grounds of illness and resigned from office. Left Chancellor Ping exclusively became Chancellor.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0130",
          "zh": "二年十月，丞相平卒，復以絳侯勃為丞相。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the tenth month of the second year, Chancellor Ping died, and the Marquis of Jiang, Bo, was again made Chancellor.",
              "idiomatic": "in the tenth month of the second year, Chancellor Ping died, and the Marquis of Jiang, Bo, was again made Chancellor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "上曰：「朕聞古者諸侯建國千餘（歲），各守其地，以時入貢，民不勞苦，上下驩欣，靡有遺德。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'I heard ancient ones feudal lords established states thousand remaining (years), each guarded their lands, timely entered tribute, people not toil bitter, superiors inferiors harmonious happy, none had remaining virtue.",
              "idiomatic": "The emperor said: 'I have heard that in ancient times, feudal lords established their states for over a thousand years. Each guarded their own territory, entered tribute at the proper times, the people did not toil bitterly, superiors and inferiors were harmonious and happy, with no virtue left unfulfilled.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "今列侯多居長安，邑遠，吏卒給輸費苦，而列侯亦無由教馴其民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now marquises mostly resided Chang'an, fiefs distant, officials soldiers supplied transported expense bitter, yet marquises also no way teach tame their people.",
              "idiomatic": "Now the marquises mostly reside in Chang'an, their fiefs are distant, the officials and soldiers suffer bitterly from the expense of supplying and transporting goods, and the marquises also have no way to teach and tame their people.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "其令列侯之國，為吏及詔所止者，遣太子。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let command marquises go to their states, those stopped by officials and edicts, send crown princes.'",
              "idiomatic": "Let the marquises be commanded to go to their states. Those who are stopped by officials or edicts shall send their crown princes.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the tenth month of the second year, Chancellor Ping died, and the Marquis of Jiang, Bo, was again made Chancellor. The emperor said: 'I have heard that in ancient times, feudal lords established their states for over a thousand years. Each guarded their own territory, entered tribute at the proper times, the people did not toil bitterly, superiors and inferiors were harmonious and happy, with no virtue left unfulfilled. Now the marquises mostly reside in Chang'an, their fiefs are distant, the officials and soldiers suffer bitterly from the expense of supplying and transporting goods, and the marquises also have no way to teach and tame their people. Let the marquises be commanded to go to their states. Those who are stopped by officials or edicts shall send their crown princes.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "十一月晦，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the last day of the eleventh month, there was a solar eclipse.",
              "idiomatic": "On the last day of the eleventh month, there was a solar eclipse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "十二月望，日又食。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the full moon of the twelfth month, the sun was eclipsed again.",
              "idiomatic": "On the full moon of the twelfth month, the sun was eclipsed again.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "上曰：「朕聞之，天生蒸民，為之置君以養治之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'I heard it, Heaven gave birth to the multitude people, for them established rulers to nourish govern them.",
              "idiomatic": "The emperor said: 'I have heard that Heaven gave birth to the multitude of people, and established rulers for them to nourish and govern them.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "人主不德，布政不均，則天示之以菑，以誡不治。",
          "translations": [
            {
              "lang": "en",
              "literal": "If the ruler is not virtuous and governance is unevenly distributed, then Heaven shows calamities to warn against poor governance.",
              "idiomatic": "if the ruler is not virtuous and governance is unevenly distributed, then heaven shows calamities to warn against poor governance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "乃十一月晦，日有食之，適見于天，菑孰大焉！",
          "translations": [
            {
              "lang": "en",
              "literal": "Then eleventh month last day, sun had eclipse of it, just appeared in heaven, calamity what great there!",
              "idiomatic": "Then on the last day of the eleventh month, there was a solar eclipse, just appearing in the heavens - what greater calamity could there be!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "朕獲保宗廟，以微眇之身託于兆民君王之上，天下治亂，在朕一人，唯二三執政猶吾股肱也。",
          "translations": [
            {
              "lang": "en",
              "literal": "I have obtained protection of the ancestral temple, with my tiny and insignificant body entrusted above the myriad people as their monarch and king. The order and disorder of the realm lies with me alone. Only the two or three administrators are still like my limbs.",
              "idiomatic": "i have obtained protection of the ancestral temple, with my tiny and insignificant body entrusted above the myriad people as their monarch and king. the order and disorder of the realm lies with me alone. Only the two or three administrators are still like my limbs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "朕下不能理育群生，上以累三光之明，其不德大矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Below I cannot govern and nurture all living beings; above I burden the brightness of the three luminaries. My lack of virtue is great indeed.",
              "idiomatic": "Below i cannot govern and nurture all living beings; above i burden the brightness of the three luminaries. my lack of virtue is great indeed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "令至，其悉思朕之過失，及知見思之所不及，匄以告朕。",
          "translations": [
            {
              "lang": "en",
              "literal": "When this command reaches you, think deeply about all my faults, and about what I know, see, and think that falls short. I beg you to inform me of them.",
              "idiomatic": "when this command reaches you, think deeply about all my faults, and about what i know, see, and think that falls short. i beg you to inform me of them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "及舉賢良方正能直言極諫者，以匡朕之不逮。",
          "translations": [
            {
              "lang": "en",
              "literal": "And raise those who are worthy, good, and upright, able to speak directly and remonstrate forcefully, to assist my shortcomings.",
              "idiomatic": "and raise those who are worthy, good, and upright, able to speak directly and remonstrate forcefully, to assist my shortcomings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "因各飭其任職，務省繇費以便民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thus each should rectify their appointed duties, striving to reduce corvee expenses to benefit the people.",
              "idiomatic": "Thus each should rectify their appointed duties, striving to reduce corvee expenses to benefit the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "朕既不能遠德，故憪然念外人之有非，是以設備未息。",
          "translations": [
            {
              "lang": "en",
              "literal": "Since I cannot achieve far-reaching virtue, I anxiously consider that foreigners may have wrongdoing, therefore defensive preparations have not ceased.",
              "idiomatic": "Since i cannot achieve far-reaching virtue, i anxiously consider that foreigners may have wrongdoing, therefore defensive preparations have not ceased.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "今縱不能罷邊屯戍，而又飭兵厚衛，其罷衛將軍軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now even if we cannot dismiss the border garrisons, yet moreover preparing troops and heavy guards - let the Guard General's army be dismissed.",
              "idiomatic": "Now even if we cannot dismiss the border garrisons, yet moreover preparing troops and heavy guards - let the Guard General's army be dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "太仆見馬遺財足，餘皆以給傳置。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand Coachman saw horses remaining wealth sufficient, remainder all used to supply relay stations.'",
              "idiomatic": "The Grand Coachman saw that the horses had sufficient remaining wealth, and all the remainder was used to supply the relay stations.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the last day of the eleventh month, there was a solar eclipse. On the full moon of the twelfth month, the sun was eclipsed again. The emperor said: 'I have heard that Heaven gave birth to the multitude of people, and established rulers for them to nourish and govern them. If the ruler is not virtuous and governance is unevenly distributed, then Heaven shows calamities to warn against poor governance. Then on the last day of the eleventh month, there was a solar eclipse, just appearing in the heavens - what greater calamity could there be! I have obtained protection of the ancestral temple, with my tiny and insignificant body entrusted above the myriad people as their monarch and king. The order and disorder of the realm lies with me alone. Only the two or three administrators are still like my limbs. Below I cannot govern and nurture all living beings; above I burden the brightness of the three luminaries. My lack of virtue is great indeed. When this command reaches you, think deeply about all my faults, and about what I know, see, and think that falls short. I beg you to inform me of them. And raise those who are worthy, good, and upright, able to speak directly and remonstrate forcefully, to assist my shortcomings. Thus each should rectify their appointed duties, striving to reduce corvee expenses to benefit the people. Since I cannot achieve far-reaching virtue, I anxiously consider that foreigners may have wrongdoing, therefore defensive preparations have not ceased. Now even if we cannot dismiss the border garrisons, yet moreover preparing troops and heavy guards - let the Guard General's army be dismissed. The Grand Coachman saw that the horses had sufficient remaining wealth, and all the remainder was used to supply the relay stations.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "正月，上曰：「農，天下之本，其開籍田，朕親率耕，以給宗廟粢盛。」",
          "translations": [
            {
              "lang": "en",
              "literal": "First month, emperor said: 'Agriculture, realm foundation, let open ritual fields, I personally lead plowing, to provide ancestral temple grain offerings.'",
              "idiomatic": "In the first month, the emperor said: 'Agriculture is the foundation of the realm. Let the ritual fields be opened. I will personally lead the plowing to provide grain offerings for the ancestral temple.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first month, the emperor said: 'Agriculture is the foundation of the realm. Let the ritual fields be opened. I will personally lead the plowing to provide grain offerings for the ancestral temple.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0151",
          "zh": "三月，有司請立皇子為諸侯王。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the third month, the officials requested to establish imperial sons as feudal kings.",
              "idiomatic": "in the third month, the officials requested to establish imperial sons as feudal kings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "上曰：「趙幽王幽死，朕甚憐之，已立其長子遂為趙王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Zhao You King imprisoned died, I very pity him, already established his eldest son Sui as Zhao King.",
              "idiomatic": "The emperor said: 'King You of Zhao died in imprisonment. I greatly pity him. I have already established his eldest son Sui as King of Zhao.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "遂弟辟彊及齊悼惠王子朱虛侯章、東牟侯興居有功，可王。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Sui younger brother Pi Qiang and Qi Dao Hui King sons Zhu Xu Hou Zhang, Dong Mou Hou Xingju have merit, can king.'",
              "idiomatic": "Sui's younger brother Pi Qiang, and the sons of King Dao Hui of Qi - Marquis Zhu Xu Zhang and Marquis Dong Mou Xingju - have merit and can be kings.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "乃立趙幽王少子辟彊為河閒王，以齊劇郡立朱虛侯為城陽王，立東牟侯為濟北王，皇子武為代王，子參為太原王，子揖為梁王。",
          "translations": [
            {
              "lang": "en",
              "literal": "He then established Zhao You King's youngest son Pi Qiang as King of Hejian, established the Marquis of Zhu Xu as King of Chengyang using difficult Qi commanderies, established the Marquis of Dong Mou as King of Jibei, imperial son Wu as King of Dai, son Shen as King of Taiyuan, and son Yi as King of Liang.",
              "idiomatic": "he then established Zhao you King's youngest son Pi Qiang as King of hejian, established the Marquis of Zhu Xu as King of Chengyang using difficult Qi commanderies, established the Marquis of Dong Mou as King of Jibei, imperial son Wu as King of Dai, son shen as King of Taiyuan, and son Yi as King of Liang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, the officials requested to establish imperial sons as feudal kings. The emperor said: 'King You of Zhao died in imprisonment. I greatly pity him. I have already established his eldest son Sui as King of Zhao. Sui's younger brother Pi Qiang, and the sons of King Dao Hui of Qi - Marquis Zhu Xu Zhang and Marquis Dong Mou Xingju - have merit and can be kings.' He then established Zhao You King's youngest son Pi Qiang as King of Hejian, established the Marquis of Zhu Xu as King of Chengyang using difficult Qi commanderies, established the Marquis of Dong Mou as King of Jibei, imperial son Wu as King of Dai, son Shen as King of Taiyuan, and son Yi as King of Liang.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0155",
          "zh": "上曰：「古之治天下，朝有進善之旌，誹謗之木，所以通治道而來諫者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Ancient governing realm, court had advance goodness banners, criticize slander wood, that by which open governance way and attract remonstrate ones.",
              "idiomatic": "The emperor said: 'In ancient times governing the realm, the court had banners for advancing goodness and wood for criticizing slander, that by which the way of governance was opened and remonstrators were attracted.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "今法有誹謗妖言之罪，是使眾臣不敢盡情，而上無由聞過失也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now the laws have crimes for criticizing slander and strange words, this causes the many ministers not to dare express their feelings fully, and those above have no way to hear about faults.",
              "idiomatic": "Now the laws have crimes for criticizing slander and strange words, this causes the many ministers not to dare express their feelings fully, and those above have no way to hear about faults.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "將何以來遠方之賢良？",
          "translations": [
            {
              "lang": "en",
              "literal": "Will what by attract distant places worthy good ones?",
              "idiomatic": "How will we attract the worthy and good from distant places?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "其除之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let it be eliminated.",
              "idiomatic": "Let it be eliminated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "民或祝詛上以相約結而後相謾，吏以為大逆，其有他言，而吏又以為誹謗。",
          "translations": [
            {
              "lang": "en",
              "literal": "People sometimes curse the emperor to mutually covenant and bind, then deceive each other. Officials consider this great rebellion. If they have other words, officials also consider it criticizing slander.",
              "idiomatic": "People sometimes curse the emperor to mutually covenant and bind, then deceive each other. Officials consider this great rebellion. if they have other words, officials also consider it criticizing slander.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "此細民之愚無知抵死，朕甚不取。",
          "translations": [
            {
              "lang": "en",
              "literal": "This is the foolish ignorance of the small people who resist to the death. I greatly reject this.",
              "idiomatic": "this is the foolish ignorance of the small people who resist to the death. i greatly reject this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "自今以來，有犯此者勿聽治。」",
          "translations": [
            {
              "lang": "en",
              "literal": "From today on, have violate this ones do not listen govern.'",
              "idiomatic": "From now on, do not listen to or govern those who violate this.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'In ancient times governing the realm, the court had banners for advancing goodness and wood for criticizing slander, that by which the way of governance was opened and remonstrators were attracted. Now the laws have crimes for criticizing slander and strange words, this causes the many ministers not to dare express their feelings fully, and those above have no way to hear about faults. How will we attract the worthy and good from distant places? Let it be eliminated. People sometimes curse the emperor to mutually covenant and bind, then deceive each other. Officials consider this great rebellion. If they have other words, officials also consider it criticizing slander. This is the foolish ignorance of the small people who resist to the death. I greatly reject this. From now on, do not listen to or govern those who violate this.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0163",
          "zh": "九月，初與郡國守相為銅虎符、竹使符。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the ninth month, for the first time, copper tiger tallies and bamboo envoy tallies were made for the governors and chancellors of the commanderies and states.",
              "idiomatic": "in the ninth month, for the first time, copper tiger tallies and bamboo envoy tallies were made for the governors and chancellors of the commanderies and states.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the ninth month, for the first time, copper tiger tallies and bamboo envoy tallies were made for the governors and chancellors of the commanderies and states.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0164",
          "zh": "三年十月丁酉晦，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the dingyou day, the last day of the tenth month of the third year, there was a solar eclipse.",
              "idiomatic": "On the dingyou day, the last day of the tenth month of the third year, there was a solar eclipse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "十一月，上曰：「前日（計）［詔］遣列侯之國，或辭未行。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, emperor said: 'Previous days (plan) [edict] sent marquises to their states, or declined not gone.",
              "idiomatic": "In the eleventh month, the emperor said: 'Previously the edict sent the marquises to their states, but some declined and have not gone.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "丞相朕之所重，其為朕率列侯之國。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor I what valued, let for me lead marquises to states.'",
              "idiomatic": "The Chancellor is one I value highly. Let him lead the marquises to their states for me.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "絳侯勃免丞相就國，以太尉潁陰侯嬰為丞相。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Marquis of Jiang, Bo, was dismissed from Chancellor and went to his state. The Grand Marshal, Marquis Yingyin, Ying, became Chancellor.",
              "idiomatic": "the Marquis of Jiang, Bo, was dismissed from Chancellor and went to his state. the Grand Marshal, Marquis Yingyin, Ying, became Chancellor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "罷太尉官，屬丞相。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dismiss the Grand Marshal office, attach it to the Chancellor.",
              "idiomatic": "Dismiss the Grand Marshal office, attach it to the Chancellor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "四月，城陽王章薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the fourth month, King Zhang of Chengyang died.",
              "idiomatic": "in the fourth month, King Zhang of Chengyang died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "淮南王長與從者魏敬殺辟陽侯審食其。",
          "translations": [
            {
              "lang": "en",
              "literal": "Huainan King Chang, together with his follower Wei Jing, killed the Marquis of Puyang, Shen Shiqi.",
              "idiomatic": "Huainan King Chang, together with his follower wei Jing, killed the Marquis of Puyang, shen Shiqi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the dingyou day, the last day of the tenth month of the third year, there was a solar eclipse. In the eleventh month, the emperor said: 'Previously the edict sent the marquises to their states, but some declined and have not gone. The Chancellor is one I value highly. Let him lead the marquises to their states for me.' The Marquis of Jiang, Bo, was dismissed from Chancellor and went to his state. The Grand Marshal, Marquis Yingyin, Ying, became Chancellor. Dismiss the Grand Marshal office, attach it to the Chancellor. In the fourth month, King Zhang of Chengyang died. Huainan King Chang, together with his follower Wei Jing, killed the Marquis of Puyang, Shen Shiqi.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0171",
          "zh": "五月，匈奴入北地，居河南為寇。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the fifth month, the Xiongnu entered Beidi and resided south of the river as bandits.",
              "idiomatic": "in the fifth month, the Xiongnu entered Beidi and resided south of the river as bandits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "帝初幸甘泉。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor first visited Ganquan.",
              "idiomatic": "the emperor first visited Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "六月，帝曰：「漢與匈奴約為昆弟，毋使害邊境，所以輸遺匈奴甚厚。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, emperor said: 'Han with Xiongnu agreed as brothers, not let harm border regions, therefore tribute sent Xiongnu very generous.",
              "idiomatic": "In the sixth month, the emperor said: 'Han and the Xiongnu agreed to be brothers, not to let harm come to the border regions, therefore the tribute sent to the Xiongnu has been very generous.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "今右賢王離其國，將眾居河南降地，非常故，往來近塞，捕殺吏卒，驅保塞蠻夷，令不得居其故，陵轢邊吏，入盜，甚敖無道，非約也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now the Right Wise King has left his state, led his crowd to reside in the surrendered lands south of the river, not for constant reasons. They come and go near the passes, capture and kill officials and soldiers, drive and protect the barbarians and Yi at the passes, make them unable to reside in their old places, insult border officials, enter and steal - very arrogant and without principle, not in accord with the agreement.",
              "idiomatic": "Now the Right Wise King has left his state, led his crowd to reside in the surrendered lands south of the river, not for constant reasons. they come and go near the passes, capture and kill officials and soldiers, drive and protect the barbarians and Yi at the passes, make them unable to reside in their old places, insult border officials, enter and steal - very arrogant and without principle, not in accord with the agreement.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "其發邊吏騎八萬五千詣高奴，遣丞相潁陰侯灌嬰擊匈奴。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let dispatch border officials cavalry eighty five thousand go to Gaonu, sent Chancellor Yingyin Hou Guan Ying attack Xiongnu.'",
              "idiomatic": "Let border officials dispatch 85,000 cavalry to Gaonu, and send Chancellor Marquis Yingyin Guan Ying to attack the Xiongnu.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "匈奴去，發中尉材官屬衛將軍軍長安。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xiongnu left, dispatched Commandant skilled officers attached Guard General stationed Chang'an.",
              "idiomatic": "The Xiongnu left, so skilled officers from the Commandant were dispatched and attached to the Guard General's army stationed at Chang'an.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth month, the Xiongnu entered Beidi and resided south of the river as bandits. The emperor first visited Ganquan. In the sixth month, the emperor said: 'Han and the Xiongnu agreed to be brothers, not to let harm come to the border regions, therefore the tribute sent to the Xiongnu has been very generous. Now the Right Wise King has left his state, led his crowd to reside in the surrendered lands south of the river, not for constant reasons. They come and go near the passes, capture and kill officials and soldiers, drive and protect the barbarians and Yi at the passes, make them unable to reside in their old places, insult border officials, enter and steal - very arrogant and without principle, not in accord with the agreement. Let border officials dispatch 85,000 cavalry to Gaonu, and send Chancellor Marquis Yingyin Guan Ying to attack the Xiongnu.' The Xiongnu left, so skilled officers from the Commandant were dispatched and attached to the Guard General's army stationed at Chang'an.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0177",
          "zh": "辛卯，帝自甘泉之高奴，因幸太原，見故群臣，皆賜之。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the xinmao day, the emperor went from Ganquan to Gaonu, then visited Taiyuan, where he saw the former ministers and granted them all gifts.",
              "idiomatic": "On the xinmao day, the emperor went from Ganquan to Gaonu, then visited Taiyuan, where he saw the former ministers and granted them all gifts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "舉功行賞，諸民里賜牛酒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Merit was recognized and rewards given, with various villages and hamlets granted oxen and wine.",
              "idiomatic": "Merit was recognized and rewards given, with various villages and hamlets granted oxen and wine.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "復晉陽中都民三歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Restored the people of Jinyang and Zhongdu for three years.",
              "idiomatic": "Restored the people of Jinyang and Zhongdu for three years.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "留游太原十餘日。",
          "translations": [
            {
              "lang": "en",
              "literal": "Stayed touring in Taiyuan for over ten days.",
              "idiomatic": "Stayed touring in Taiyuan for over ten days.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the xinmao day, the emperor went from Ganquan to Gaonu, then visited Taiyuan, where he saw the former ministers and granted them all gifts. Merit was recognized and rewards given, with various villages and hamlets granted oxen and wine. Restored the people of Jinyang and Zhongdu for three years. Stayed touring in Taiyuan for over ten days.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0181",
          "zh": "濟北王興居聞帝之代，欲往擊胡，乃反，發兵欲襲滎陽。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jibei King Xingju heard of the emperor's succession, desired to go attack the Hu, then rebelled, raising troops desiring to attack Xingyang.",
              "idiomatic": "Jibei King Xingju heard of the emperor's succession, desired to go attack the Hu, then rebelled, raising troops desiring to attack Xingyang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "於是詔罷丞相兵，遣棘蒲侯陳武為大將軍，將十萬往擊之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon an edict dismissed the Chancellor's troops and dispatched the Marquis of Jipu, Chen Wu, as General-in-Chief, leading 100,000 troops to attack them.",
              "idiomatic": "thereupon an edict dismissed the Chancellor's troops and dispatched the Marquis of Jipu, Chen Wu, as General-in-Chief, leading 100,000 troops to attack them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "祁侯賀為將軍，軍滎陽。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Marquis of Qi, He, became general and was stationed at Xingyang.",
              "idiomatic": "the Marquis of Qi, he, became general and was stationed at Xingyang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "七月辛亥，帝自太原至長安。",
          "translations": [
            {
              "lang": "en",
              "literal": "Seventh month Xinhai, emperor from Taiyuan to Chang'an.",
              "idiomatic": "On the xinhai day of the seventh month, the emperor went from Taiyuan to Chang'an.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "乃詔有司曰：「濟北王背德反上，詿誤吏民，為大逆。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then edict officials said: 'Jibei King turned virtue rebelled emperor, deceived misled officials people, became great rebellion.",
              "idiomatic": "Then an edict to the officials said: 'The King of Jibei has turned his back on virtue and rebelled against the emperor, deceiving and misleading officials and people, committing great rebellion.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "濟北吏民兵未至先自定，及以軍地邑降者，皆赦之，復官爵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jibei officials, people, and troops who settled themselves before the army arrived, and those who surrendered with army lands and towns, shall all be pardoned and have their offices and nobility restored.",
              "idiomatic": "Jibei officials, people, and troops who settled themselves before the army arrived, and those who surrendered with army lands and towns, shall all be pardoned and have their offices and nobility restored.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "與王興居去來，亦赦之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "With king Xingju come and go, also pardon them.'",
              "idiomatic": "Those who came and went with King Xingju shall also be pardoned.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "八月，破濟北軍，虜其王。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the eighth month, the Jibei army was defeated and their king captured.",
              "idiomatic": "in the eighth month, the Jibei army was defeated and their king captured.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "赦濟北諸吏民與王反者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Pardon all the officials and people of Jibei who rebelled with the king.",
              "idiomatic": "Pardon all the officials and people of Jibei who rebelled with the king.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Jibei King Xingju heard of the emperor's succession, desired to go attack the Hu, then rebelled, raising troops desiring to attack Xingyang. Thereupon an edict dismissed the Chancellor's troops and dispatched the Marquis of Jipu, Chen Wu, as General-in-Chief, leading 100,000 troops to attack them. The Marquis of Qi, He, became general and was stationed at Xingyang. On the xinhai day of the seventh month, the emperor went from Taiyuan to Chang'an. Then an edict to the officials said: 'The King of Jibei has turned his back on virtue and rebelled against the emperor, deceiving and misleading officials and people, committing great rebellion. Jibei officials, people, and troops who settled themselves before the army arrived, and those who surrendered with army lands and towns, shall all be pardoned and have their offices and nobility restored. Those who came and went with King Xingju shall also be pardoned.' In the eighth month, the Jibei army was defeated and their king captured. Pardon all the officials and people of Jibei who rebelled with the king.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "六年，有司言淮南王長廢先帝法，不聽天子詔，居處毋度，出入擬於天子，擅為法令，與棘蒲侯太子奇謀反，遣人使閩越及匈奴，發其兵，欲以危宗廟社稷。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the sixth year, officials reported that King Chang of Huainan abolished the laws of the former emperor, did not listen to the Son of Heaven's edicts, lived without restraint, entered and exited imitating the Son of Heaven, monopolized making laws and commands, plotted rebellion with the Marquis of Jipu's Crown Prince Qi, sent envoys to Minyue and the Xiongnu, raised their troops, desiring to endanger the ancestral temple and state altars.",
              "idiomatic": "in the sixth year, officials reported that King Chang of Huainan abolished the laws of the former emperor, did not listen to the son of heaven's edicts, lived without restraint, entered and exited imitating the son of heaven, monopolized making laws and commands, plotted rebellion with the Marquis of Jipu's Crown Prince Qi, sent envoys to Minyue and the Xiongnu, raised their troops, desiring to endanger the ancestral temple and state altars.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "群臣議，皆曰「長當棄市」帝不忍致法於王，赦其罪，廢勿王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ministers discussed, all said 'Chang should be executed in market' emperor not bear apply law to king, pardoned his crime, deposed do not king.",
              "idiomatic": "The ministers discussed and all said 'Chang should be executed in the marketplace.' The emperor could not bear to apply the law to the king, so he pardoned his crime and deposed him without making him king.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "群臣請處王蜀嚴道、邛都，帝許之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The ministers requested to place the king in Shu at Yandao and Qiongdu. The emperor permitted it.",
              "idiomatic": "the ministers requested to place the king in Shu at Yandao and Qiongdu. the emperor permitted it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "長未到處所，行病死，上憐之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chang had not yet arrived at the place when he died of illness while traveling. The emperor pitied him.",
              "idiomatic": "Chang had not yet arrived at the place when he died of illness while traveling. the emperor pitied him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "後十六年，追尊淮南王長謚為厲王，立其子三人為淮南王、衡山王、廬江王。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the sixteenth year later, King Chang of Huainan was posthumously honored with the posthumous name of Li King, and his three sons were established as King of Huainan, King of Hengshan, and King of Lujiang.",
              "idiomatic": "in the sixteenth year later, King Chang of Huainan was posthumously honored with the posthumous name of Li King, and his three sons were established as King of Huainan, King of hengshan, and King of Lujiang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixth year, officials reported that King Chang of Huainan abolished the laws of the former emperor, did not listen to the Son of Heaven's edicts, lived without restraint, entered and exited imitating the Son of Heaven, monopolized making laws and commands, plotted rebellion with the Marquis of Jipu's Crown Prince Qi, sent envoys to Minyue and the Xiongnu, raised their troops, desiring to endanger the ancestral temple and state altars. The ministers discussed and all said 'Chang should be executed in the marketplace.' The emperor could not bear to apply the law to the king, so he pardoned his crime and deposed him without making him king. The ministers requested to place the king in Shu at Yandao and Qiongdu. The emperor permitted it. Chang had not yet arrived at the place when he died of illness while traveling. The emperor pitied him. In the sixteenth year later, King Chang of Huainan was posthumously honored with the posthumous name of Li King, and his three sons were established as King of Huainan, King of Hengshan, and King of Lujiang.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0195",
          "zh": "十三年夏，上曰：「蓋聞天道禍自怨起而福繇德興。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thirteenth year summer, emperor said: 'Indeed heard heaven way calamity from resentment arises yet fortune by virtue rises.",
              "idiomatic": "In the summer of the thirteenth year, the emperor said: 'Indeed I have heard that in the way of heaven, calamity arises from resentment while fortune rises through virtue.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "百官之非，宜由朕躬。",
          "translations": [
            {
              "lang": "en",
              "literal": "The faults of the hundred officials should come from my person.",
              "idiomatic": "the faults of the hundred officials should come from my person.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "今祕祝之官移過于下，以彰吾之不德，朕甚不取。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now the officials of secret blessings shift the blame to those below, to manifest my lack of virtue. I greatly reject this.",
              "idiomatic": "Now the officials of secret blessings shift the blame to those below, to manifest my lack of virtue. i greatly reject this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "其除之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let eliminate them.'",
              "idiomatic": "Let them be eliminated.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the summer of the thirteenth year, the emperor said: 'Indeed I have heard that in the way of heaven, calamity arises from resentment while fortune rises through virtue. The faults of the hundred officials should come from my person. Now the officials of secret blessings shift the blame to those below, to manifest my lack of virtue. I greatly reject this. Let them be eliminated.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0200",
          "zh": "五月，齊太倉令淳于公有罪當刑，詔獄逮徙系長安。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Qi Grand Granary Superintendent Chunyu Gong had crime should punishment, imperial prison arrest exile imprison Chang'an.",
              "idiomatic": "In the fifth month, Grand Granary Superintendent Chunyu Gong of Qi had committed a crime and should be punished. The imperial prison arrested him, exiled him, and imprisoned him in Chang'an.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "太倉公無男，有女五人。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Grand Granary Duke had no sons, but had five daughters.",
              "idiomatic": "the Grand Granary Duke had no sons, but had five daughters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "太倉公將行會逮，罵其女曰：「生子不生男，有緩急非有益也！」",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand Granary Duke about to go meet arrest, cursed his daughters said: 'Give birth to children not give birth to males, have emergency not beneficial also!'",
              "idiomatic": "As the Grand Granary Duke was about to leave to meet his arrest, he cursed his daughters saying: 'You gave birth to children but not males. In an emergency they are not beneficial!'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "其少女緹縈自傷泣，乃隨其父至長安，上書曰：「妾父為吏，齊中皆稱其廉平，今坐法當刑。",
          "translations": [
            {
              "lang": "en",
              "literal": "His youngest daughter Tiying self harmed wept, then followed her father to Chang'an, submitted memorial said: 'My father served as official, all in Qi praised his incorruptible fairness, now violated law should punishment.",
              "idiomatic": "His youngest daughter, Tiying, wept in self-pity and followed her father to Chang'an. She submitted a memorial saying: 'My father served as an official, and all in Qi praised his incorruptible fairness. Now he has violated the law and should be punished.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "妾傷夫死者不可復生，刑者不可復屬，雖復欲改過自新，其道無由也。",
          "translations": [
            {
              "lang": "en",
              "literal": "I grieve that the dead cannot live again, and those punished cannot be restored. Though one wishes to change faults and renew oneself, there is no path to do so.",
              "idiomatic": "i grieve that the dead cannot live again, and those punished cannot be restored. though one wishes to change faults and renew oneself, there is no path to do so.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "妾願沒入為官婢，贖父刑罪，使得自新。」",
          "translations": [
            {
              "lang": "en",
              "literal": "I wish enter as official maidservant, redeem father punishment crime, enable him renew self.'",
              "idiomatic": "I wish to become an official maidservant to redeem my father's punishment and crime, enabling him to renew himself.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "書奏天子，天子憐悲其意，乃下詔曰：「蓋聞有虞氏之時，畫衣冠異章服以為僇，而民不犯。",
          "translations": [
            {
              "lang": "en",
              "literal": "Memorial submitted to Son of Heaven, Son of Heaven pitied sympathized their intention, then issued edict said: 'Indeed heard Youyu clan time, painted clothes hats different patterns robes as punishment, yet people not violate.",
              "idiomatic": "The memorial was submitted to the Son of Heaven. The Son of Heaven pitied and sympathized with their intention, then issued an edict saying: 'Indeed I have heard that in the time of the Youyu clan, painted clothes and hats with different patterns were used as punishment, yet the people did not violate.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "何則？",
          "translations": [
            {
              "lang": "en",
              "literal": "What then?",
              "idiomatic": "Why was that?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "至治也。",
          "translations": [
            {
              "lang": "en",
              "literal": "It was supreme governance.",
              "idiomatic": "it was supreme governance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "今法有肉刑三，而姦不止，其咎安在？",
          "translations": [
            {
              "lang": "en",
              "literal": "Now laws have flesh punishments three, yet adultery not stop, its blame where in?",
              "idiomatic": "Now the laws have three flesh punishments, yet adultery does not stop. Where does the blame lie?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "非乃朕德薄而教不明歟？",
          "translations": [
            {
              "lang": "en",
              "literal": "Not then my virtue thin yet teachings not clear question?",
              "idiomatic": "Is it not that my virtue is thin and my teachings are unclear?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "吾甚自愧。",
          "translations": [
            {
              "lang": "en",
              "literal": "I am greatly ashamed of myself.",
              "idiomatic": "i am greatly ashamed of myself.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "故夫馴道不純而愚民陷焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Therefore indeed, when the way of taming is not pure, foolish people fall into it.",
              "idiomatic": "therefore indeed, when the way of taming is not pure, foolish people fall into it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "《詩》曰『愷悌君子，民之父母』。",
          "translations": [
            {
              "lang": "en",
              "literal": "'Odes' says 'Kind amiable gentleman, people's parents'.",
              "idiomatic": "The Odes say: 'The kind and amiable gentleman is the parent of the people.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "今人有過，教未施而刑加焉？",
          "translations": [
            {
              "lang": "en",
              "literal": "Now people have faults, teaching not yet applied yet punishment added question?",
              "idiomatic": "Now when people have faults, teaching has not yet been applied but punishment is added?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "或欲改行為善而道毋由也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Some wish to change their conduct and be good, but there is no path to do so.",
              "idiomatic": "some wish to change their conduct and be good, but there is no path to do so.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "朕甚憐之。",
          "translations": [
            {
              "lang": "en",
              "literal": "I greatly pity them.",
              "idiomatic": "i greatly pity them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "夫刑至斷支體，刻肌膚，終身不息，何其楚痛而不德也，豈稱為民父母之意哉！",
          "translations": [
            {
              "lang": "en",
              "literal": "Indeed punishments reaching sever limbs bodies, carve skin flesh, lifetime not cease, how their painful suffering and lacking virtue also, how match being people parents intention!",
              "idiomatic": "Indeed punishments reaching the severing of limbs and bodies, carving skin and flesh, never ceasing for a lifetime - how painfully suffering and lacking in virtue! How does this match the intention of being parents to the people!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "其除肉刑。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let eliminate flesh punishments.'",
              "idiomatic": "Let flesh punishments be eliminated.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifth month, Grand Granary Superintendent Chunyu Gong of Qi had committed a crime and should be punished. The imperial prison arrested him, exiled him, and imprisoned him in Chang'an. The Grand Granary Duke had no sons, but had five daughters. As the Grand Granary Duke was about to leave to meet his arrest, he cursed his daughters saying: 'You gave birth to children but not males. In an emergency they are not beneficial!' His youngest daughter, Tiying, wept in self-pity and followed her father to Chang'an. She submitted a memorial saying: 'My father served as an official, and all in Qi praised his incorruptible fairness. Now he has violated the law and should be punished. I grieve that the dead cannot live again, and those punished cannot be restored. Though one wishes to change faults and renew oneself, there is no path to do so. I wish to become an official maidservant to redeem my father's punishment and crime, enabling him to renew himself.' The memorial was submitted to the Son of Heaven. The Son of Heaven pitied and sympathized with their intention, then issued an edict saying: 'Indeed I have heard that in the time of the Youyu clan, painted clothes and hats with different patterns were used as punishment, yet the people did not violate. Why was that? It was supreme governance. Now the laws have three flesh punishments, yet adultery does not stop. Where does the blame lie? Is it not that my virtue is thin and my teachings are unclear? I am greatly ashamed of myself. Therefore indeed, when the way of taming is not pure, foolish people fall into it. The Odes say: 'The kind and amiable gentleman is the parent of the people.' Now when people have faults, teaching has not yet been applied but punishment is added? Some wish to change their conduct and be good, but there is no path to do so. I greatly pity them. Indeed punishments reaching the severing of limbs and bodies, carving skin and flesh, never ceasing for a lifetime - how painfully suffering and lacking in virtue! How does this match the intention of being parents to the people! Let flesh punishments be eliminated.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "上曰：「農，天下之本，務莫大焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Agriculture, realm foundation, affairs none greater than this.",
              "idiomatic": "The emperor said: 'Agriculture is the foundation of the realm, no affair is greater than this.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "今勤身從事而有租稅之賦，是為本末者毋以異，其於勸農之道未備。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now they diligently personally engage in affairs yet have rent and tax impositions. This makes no difference between root and tip. Its way of encouraging agriculture is not complete.",
              "idiomatic": "Now they diligently personally engage in affairs yet have rent and tax impositions. this makes no difference between root and tip. its way of encouraging agriculture is not complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "其除田之租稅。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let eliminate fields rent taxes.'",
              "idiomatic": "Let the rent taxes on fields be eliminated.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'Agriculture is the foundation of the realm, no affair is greater than this. Now they diligently personally engage in affairs yet have rent and tax impositions. This makes no difference between root and tip. Its way of encouraging agriculture is not complete. Let the rent taxes on fields be eliminated.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0224",
          "zh": "十四年冬，匈奴謀入邊為寇，攻朝那塞，殺北地都尉卬。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the winter of the fourteenth year, the Xiongnu planned to enter the border as bandits, attacked the Zhaona pass, and killed the Beidi Commandant Ang.",
              "idiomatic": "in the winter of the fourteenth year, the Xiongnu planned to enter the border as bandits, attacked the Zhaona pass, and killed the Beidi Commandant Ang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "上乃遣三將軍軍隴西、北地、上郡，中尉周舍為衛將軍，郎中令張武為車騎將軍，軍渭北，車千乘，騎卒十萬。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor then dispatched three generals to be stationed in Longxi, Beidi, and Shangjun. The Commandant Zhou She became Guard General, the Chamberlain for Attendants Zhang Wu became Chariot Cavalry General, stationed north of the Wei River, with a thousand teams of chariots and one hundred thousand cavalry soldiers.",
              "idiomatic": "the emperor then dispatched three generals to be stationed in Longxi, Beidi, and Shangjun. the Commandant Zhou she became Guard General, the Chamberlain for Attendants Zhang Wu became Chariot Cavalry General, stationed north of the wei River, with a thousand teams of chariots and one hundred thousand cavalry soldiers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "帝親自勞軍，勒兵申教令，賜軍吏卒。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor personally encouraged the army, restrained the troops while explaining the teachings and commands, and granted gifts to the army officials and soldiers.",
              "idiomatic": "the emperor personally encouraged the army, restrained the troops while explaining the teachings and commands, and granted gifts to the army officials and soldiers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "帝欲自將擊匈奴，群臣諫，皆不聽。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor desired to personally lead the attack on the Xiongnu. The ministers remonstrated, but he listened to none of them.",
              "idiomatic": "the emperor desired to personally lead the attack on the Xiongnu. the ministers remonstrated, but he listened to none of them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "皇太后固要帝，帝乃止。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Empress Dowager firmly detained the emperor, so he then stopped.",
              "idiomatic": "the Empress Dowager firmly detained the emperor, so he then stopped.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "於是以東陽侯張相如為大將軍，成侯赤為內史，欒布為將軍，擊匈奴。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon the Marquis of Dongyang Zhang Xiangru was made General-in-Chief, the Marquis of Cheng Chi was made Interior Minister, Luan Bu was made general, and they attacked the Xiongnu.",
              "idiomatic": "thereupon the Marquis of Dongyang Zhang Xiangru was made General-in-Chief, the Marquis of Cheng Chi was made interior Minister, Luan Bu was made general, and they attacked the Xiongnu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "匈奴遁走。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Xiongnu fled and escaped.",
              "idiomatic": "the Xiongnu fled and escaped.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the winter of the fourteenth year, the Xiongnu planned to enter the border as bandits, attacked the Zhaona pass, and killed the Beidi Commandant Ang. The emperor then dispatched three generals to be stationed in Longxi, Beidi, and Shangjun. The Commandant Zhou She became Guard General, the Chamberlain for Attendants Zhang Wu became Chariot Cavalry General, stationed north of the Wei River, with a thousand teams of chariots and one hundred thousand cavalry soldiers. The emperor personally encouraged the army, restrained the troops while explaining the teachings and commands, and granted gifts to the army officials and soldiers. The emperor desired to personally lead the attack on the Xiongnu. The ministers remonstrated, but he listened to none of them. The Empress Dowager firmly detained the emperor, so he then stopped. Thereupon the Marquis of Dongyang Zhang Xiangru was made General-in-Chief, the Marquis of Cheng Chi was made Interior Minister, Luan Bu was made general, and they attacked the Xiongnu. The Xiongnu fled and escaped.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0231",
          "zh": "春，上曰：「朕獲執犧牲珪幣以事上帝宗廟，十四年于今，歷日（縣）［綿］長，以不敏不明而久撫臨天下，朕甚自愧。",
          "translations": [
            {
              "lang": "en",
              "literal": "Spring, emperor said: 'I obtain hold sacrificial animals jade currency to serve Supreme Thearch ancestral temples, fourteen years until now, calendar days continuous long, with not clever not clear yet long pacify oversee realm, I very self ashamed.",
              "idiomatic": "In spring, the emperor said: 'I obtain to hold sacrificial animals and jade currency to serve the Supreme Thearch and ancestral temples. Fourteen years until now, the calendar days have been continuously long. With my lack of cleverness and clarity, I have long pacified and overseen the realm. I am greatly ashamed of myself.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "其廣增諸祀墠場珪幣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the various sacrificial altars and fields be broadly increased with jade currency.",
              "idiomatic": "Let the various sacrificial altars and fields be broadly increased with jade currency.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "昔先王遠施不求其報，望祀不祈其福，右賢左戚，先民後己，至明之極也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Former kings extended their kindness far without seeking repayment, performed distant sacrifices without praying for fortune, honored the worthy and placed relatives to the left, put the people first and themselves last - this was the utmost of enlightenment.",
              "idiomatic": "former kings extended their kindness far without seeking repayment, performed distant sacrifices without praying for fortune, honored the worthy and placed relatives to the left, put the people first and themselves last - this was the utmost of enlightenment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "今吾聞祠官祝釐，皆歸福朕躬，不為百姓，朕甚愧之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now I hear that the sacrifice officials' blessings and ceremonies all direct fortune to my person, not for the people. I am greatly ashamed of this.",
              "idiomatic": "Now i hear that the sacrifice officials' blessings and ceremonies all direct fortune to my person, not for the people. i am greatly ashamed of this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "夫以朕不德，而躬享獨美其福，百姓不與焉，是重吾不德。",
          "translations": [
            {
              "lang": "en",
              "literal": "Indeed, with my lack of virtue, I personally enjoy and monopolize their fortune while the people do not participate in it. This adds weight to my lack of virtue.",
              "idiomatic": "indeed, with my lack of virtue, i personally enjoy and monopolize their fortune while the people do not participate in it. this adds weight to my lack of virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "其令祠官致敬，毋有所祈。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let command sacrifice officials express respect, do not have prayers.'",
              "idiomatic": "Let the sacrifice officials express respect without making any prayers.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In spring, the emperor said: 'I obtain to hold sacrificial animals and jade currency to serve the Supreme Thearch and ancestral temples. Fourteen years until now, the calendar days have been continuously long. With my lack of cleverness and clarity, I have long pacified and overseen the realm. I am greatly ashamed of myself. Let the various sacrificial altars and fields be broadly increased with jade currency. Former kings extended their kindness far without seeking repayment, performed distant sacrifices without praying for fortune, honored the worthy and placed relatives to the left, put the people first and themselves last - this was the utmost of enlightenment. Now I hear that the sacrifice officials' blessings and ceremonies all direct fortune to my person, not for the people. I am greatly ashamed of this. Indeed, with my lack of virtue, I personally enjoy and monopolize their fortune while the people do not participate in it. This adds weight to my lack of virtue. Let the sacrifice officials express respect without making any prayers.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "是時北平侯張蒼為丞相，方明律歷。",
          "translations": [
            {
              "lang": "en",
              "literal": "At this time, the Marquis of Beiping, Zhang Cang, was Chancellor, just clarifying the laws and calendars.",
              "idiomatic": "At this time, the Marquis of Beiping, Zhang Cang, was Chancellor, just clarifying the laws and calendars.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "魯人公孫臣上書陳終始傳五德事，言方今土德時，土德應黃龍見，當改正朔服色制度。",
          "translations": [
            {
              "lang": "en",
              "literal": "The man from Lu, Gongsun Chen, submitted a memorial explaining the transmission of the five virtues from beginning to end, saying that now is the time of earth virtue, and earth virtue should be marked by the appearance of a yellow dragon, with reforms to the calendar, clothing colors, and institutions.",
              "idiomatic": "the man from Lu, Gongsun Chen, submitted a memorial explaining the transmission of the five virtues from beginning to end, saying that now is the time of earth virtue, and earth virtue should be marked by the appearance of a yellow dragon, with reforms to the calendar, clothing colors, and institutions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "天子下其事與丞相議。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Son of Heaven sent this matter down to be discussed with the Chancellor.",
              "idiomatic": "the son of heaven sent this matter down to be discussed with the Chancellor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "丞相推以為今水德，始明正十月上黑事，以為其言非是，請罷之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Chancellor calculated and considered that now is the time of water virtue, beginning with the bright correction in the tenth month and ascending black matters, and considered his words incorrect, requesting to dismiss him.",
              "idiomatic": "the Chancellor calculated and considered that now is the time of water virtue, beginning with the bright correction in the tenth month and ascending black matters, and considered his words incorrect, requesting to dismiss him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At this time, the Marquis of Beiping, Zhang Cang, was Chancellor, just clarifying the laws and calendars. The man from Lu, Gongsun Chen, submitted a memorial explaining the transmission of the five virtues from beginning to end, saying that now is the time of earth virtue, and earth virtue should be marked by the appearance of a yellow dragon, with reforms to the calendar, clothing colors, and institutions. The Son of Heaven sent this matter down to be discussed with the Chancellor. The Chancellor calculated and considered that now is the time of water virtue, beginning with the bright correction in the tenth month and ascending black matters, and considered his words incorrect, requesting to dismiss him.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0242",
          "zh": "十五年，黃龍見成紀，天子乃復召魯公孫臣，以為博士，申明土德事。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the fifteenth year, a yellow dragon appeared at Chengji. The Son of Heaven then summoned Gongsun Chen of Lu again, made him an erudite, and had him clearly explain the matters of earth virtue.",
              "idiomatic": "in the fifteenth year, a yellow dragon appeared at Chengji. the son of heaven then summoned Gongsun Chen of Lu again, made him an erudite, and had him clearly explain the matters of earth virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "於是上乃下詔曰：「有異物之神見于成紀，無害於民，歲以有年。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon emperor then issued edict said: 'Have strange object spirit appeared at Chengji, no harm to people, year with bountiful harvest.",
              "idiomatic": "Thereupon the emperor issued an edict saying: 'A spirit of strange objects has appeared at Chengji, causing no harm to the people, and the year has brought bountiful harvests.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "朕親郊祀上帝諸神。",
          "translations": [
            {
              "lang": "en",
              "literal": "I personally performed suburban sacrifices to the Supreme Thearch and various spirits.",
              "idiomatic": "i personally performed suburban sacrifices to the Supreme thearch and various spirits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "禮官議，毋諱以勞朕。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Ritual officials discuss, do not avoid to tire me.'",
              "idiomatic": "Let the ritual officials discuss this, without avoiding tiring me.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "有司禮官皆曰：「古者天子夏躬親禮祀上帝於郊，故曰郊。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials ritual officials all said: 'Ancient ones Son of Heaven summer personally ceremony sacrificed Supreme Thearch at suburbs, therefore called suburbs.'",
              "idiomatic": "The officials and ritual officials all said: 'In ancient times, the Son of Heaven in summer personally performed the ceremony sacrificing to the Supreme Thearch in the suburbs, therefore it is called the suburbs.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "於是天子始幸雍，郊見五帝，以孟夏四月答禮焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon the Son of Heaven began visiting Yong, performing suburban appearances to the Five Emperors, responding with ceremonies in the fourth month of early summer.",
              "idiomatic": "thereupon the son of heaven began visiting Yong, performing suburban appearances to the Five Emperors, responding with ceremonies in the fourth month of early summer.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "趙人新垣平以望氣見，因說上設立渭陽五廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "The man from Zhao, Xinyuan Ping, appeared by observing qi, and thus persuaded the emperor to establish the five temples of Weiyang.",
              "idiomatic": "the man from Zhao, Xinyuan Ping, appeared by observing qi, and thus persuaded the emperor to establish the five temples of weiyang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "欲出周鼎，當有玉英見。",
          "translations": [
            {
              "lang": "en",
              "literal": "He desired to bring out the Zhou tripod, saying that jade splendor should appear.",
              "idiomatic": "he desired to bring out the Zhou tripod, saying that jade splendor should appear.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fifteenth year, a yellow dragon appeared at Chengji. The Son of Heaven then summoned Gongsun Chen of Lu again, made him an erudite, and had him clearly explain the matters of earth virtue. Thereupon the emperor issued an edict saying: 'A spirit of strange objects has appeared at Chengji, causing no harm to the people, and the year has brought bountiful harvests. I personally performed suburban sacrifices to the Supreme Thearch and various spirits. Let the ritual officials discuss this, without avoiding tiring me.' The officials and ritual officials all said: 'In ancient times, the Son of Heaven in summer personally performed the ceremony sacrificing to the Supreme Thearch in the suburbs, therefore it is called the suburbs.' Thereupon the Son of Heaven began visiting Yong, performing suburban appearances to the Five Emperors, responding with ceremonies in the fourth month of early summer. The man from Zhao, Xinyuan Ping, appeared by observing qi, and thus persuaded the emperor to establish the five temples of Weiyang. He desired to bring out the Zhou tripod, saying that jade splendor should appear.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "十六年，上親郊見渭陽五帝廟，亦以夏答禮而尚赤。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the sixteenth year, the emperor personally performed suburban appearances at the Weiyang Five Emperors temples, also responding with summer ceremonies while honoring red.",
              "idiomatic": "in the sixteenth year, the emperor personally performed suburban appearances at the weiyang Five Emperors temples, also responding with summer ceremonies while honoring red.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the sixteenth year, the emperor personally performed suburban appearances at the Weiyang Five Emperors temples, also responding with summer ceremonies while honoring red.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0251",
          "zh": "十七年，得玉杯，刻曰「人主延壽」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Seventeenth year, obtained jade cup, engraved said 'Ruler extends longevity'.",
              "idiomatic": "In the seventeenth year, he obtained a jade cup, engraved with 'The ruler extends longevity.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "於是天子始更為元年，令天下大酺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon the Son of Heaven began changing it to the first year, and commanded great drinking parties throughout the realm.",
              "idiomatic": "thereupon the son of heaven began changing it to the first year, and commanded great drinking parties throughout the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "其歲，新垣平事覺，夷三族。",
          "translations": [
            {
              "lang": "en",
              "literal": "That year, Xinyuan Ping's affair was discovered, and his three clans were exterminated.",
              "idiomatic": "that year, Xinyuan Ping's affair was discovered, and his three clans were exterminated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the seventeenth year, he obtained a jade cup, engraved with 'The ruler extends longevity.' Thereupon the Son of Heaven began changing it to the first year, and commanded great drinking parties throughout the realm. That year, Xinyuan Ping's affair was discovered, and his three clans were exterminated.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0254",
          "zh": "後二年，上曰：「朕既不明，不能遠德，是以使方外之國或不寧息。",
          "translations": [
            {
              "lang": "en",
              "literal": "Later second year, emperor said: 'I already not clear, cannot reach far virtue, therefore caused beyond borders countries or not peaceful rest.",
              "idiomatic": "In the second year later, the emperor said: 'I am already unenlightened and cannot reach far with virtue, therefore causing countries beyond the borders to sometimes not be peaceful and at rest.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "夫四荒之外不安其生，封畿之內勤勞不處，二者之咎，皆自於朕之德薄而不能遠達也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Indeed, outside the four wastes their lives are not peaceful, within the enfeoffed domains there is toil without dwelling. The blame for these two things all comes from my thin virtue and inability to reach far.",
              "idiomatic": "indeed, outside the four wastes their lives are not peaceful, within the enfeoffed domains there is toil without dwelling. the blame for these two things all comes from my thin virtue and inability to reach far.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "閒者累年，匈奴并暴邊境，多殺吏民，邊臣兵吏又不能諭吾內志，以重吾不德也。",
          "translations": [
            {
              "lang": "en",
              "literal": "In recent accumulated years, the Xiongnu have together been violent in the border regions, killing many officials and people. Moreover, the border ministers and army officials cannot explain my inner will, adding weight to my lack of virtue.",
              "idiomatic": "in recent accumulated years, the Xiongnu have together been violent in the border regions, killing many officials and people. Moreover, the border ministers and army officials cannot explain my inner will, adding weight to my lack of virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "夫久結難連兵，中外之國將何以自寧？",
          "translations": [
            {
              "lang": "en",
              "literal": "Indeed long enmity difficult connect troops, inner outer countries will what by self peaceful?",
              "idiomatic": "Indeed, with long enmity it is difficult to connect troops. How will the countries within and without find peace for themselves?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "今朕夙興夜寐，勤勞天下，憂苦萬民，為之怛惕不安，未嘗一日忘於心，故遣使者冠蓋相望，結軼於道，以諭朕意於單于。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now I rise early and sleep late, diligently toiling for the realm and worrying bitterly for the ten thousand people, pained and anxious for them, never forgetting it for even one day from my heart. Therefore I have dispatched envoys whose official caps and canopies are seen one after another, with chariots joined on the road, to explain my intentions to the Chanyu.",
              "idiomatic": "Now i rise early and sleep late, diligently toiling for the realm and worrying bitterly for the ten thousand people, pained and anxious for them, never forgetting it for even one day from my heart. therefore i have dispatched envoys whose official caps and canopies are seen one after another, with chariots joined on the road, to explain my intentions to the Chanyu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "今單于反古之道，計社稷之安，便萬民之利，親與朕俱棄細過，偕之大道，結兄弟之義，以全天下元元之民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now if the Chanyu returns to the ancient way, plans for the peace of the state altars, benefits the profit of the ten thousand people, personally with me together abandons small faults, goes together to the great way, ties the righteousness of brothers, to complete the ordinary people of the realm.",
              "idiomatic": "Now if the Chanyu returns to the ancient way, plans for the peace of the state altars, benefits the profit of the ten thousand people, personally with me together abandons small faults, goes together to the great way, ties the righteousness of brothers, to complete the ordinary people of the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "和親已定，始于今年。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Peaceful kinship already established, begins from this year.'",
              "idiomatic": "Peaceful kinship has already been established, beginning from this year.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the second year later, the emperor said: 'I am already unenlightened and cannot reach far with virtue, therefore causing countries beyond the borders to sometimes not be peaceful and at rest. Indeed, outside the four wastes their lives are not peaceful, within the enfeoffed domains there is toil without dwelling. The blame for these two things all comes from my thin virtue and inability to reach far. In recent accumulated years, the Xiongnu have together been violent in the border regions, killing many officials and people. Moreover, the border ministers and army officials cannot explain my inner will, adding weight to my lack of virtue. Indeed, with long enmity it is difficult to connect troops. How will the countries within and without find peace for themselves? Now I rise early and sleep late, diligently toiling for the realm and worrying bitterly for the ten thousand people, pained and anxious for them, never forgetting it for even one day from my heart. Therefore I have dispatched envoys whose official caps and canopies are seen one after another, with chariots joined on the road, to explain my intentions to the Chanyu. Now if the Chanyu returns to the ancient way, plans for the peace of the state altars, benefits the profit of the ten thousand people, personally with me together abandons small faults, goes together to the great way, ties the righteousness of brothers, to complete the ordinary people of the realm. Peaceful kinship has already been established, beginning from this year.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0262",
          "zh": "後六年冬，匈奴三萬人入上郡，三萬人入雲中。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the winter of the sixth year later, the Xiongnu sent 30,000 people into Shangjun and 30,000 people into Yunzhong.",
              "idiomatic": "in the winter of the sixth year later, the Xiongnu sent 30,000 people into Shangjun and 30,000 people into Yunzhong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "以中大夫令勉為車騎將軍，軍飛狐；",
          "translations": [
            {
              "lang": "en",
              "literal": "With Palace Attendant Ling Mian as Chariot Cavalry General, stationed Feihu;",
              "idiomatic": "Palace Attendant Ling Mian was made Chariot Cavalry General, stationed at Feihu;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "故楚相蘇意為將軍，軍句注；",
          "translations": [
            {
              "lang": "en",
              "literal": "Former Chu Chancellor Su Yi as general, stationed Gouzhu;",
              "idiomatic": "Former Chu Chancellor Su Yi was made general, stationed at Gouzhu;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "將軍張武屯北地；",
          "translations": [
            {
              "lang": "en",
              "literal": "General Zhang Wu garrisoned Beidi;",
              "idiomatic": "General Zhang Wu was garrisoned in Beidi;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "河內守周亞夫為將軍，居細柳；",
          "translations": [
            {
              "lang": "en",
              "literal": "Henei Governor Zhou Yafu as general, resided Xiliu;",
              "idiomatic": "Henei Governor Zhou Yafu was made general, stationed at Xiliu;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "宗正劉禮為將軍，居霸上；",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial Clan Administrator Liu Li as general, resided Bashang;",
              "idiomatic": "Imperial Clan Administrator Liu Li was made general, stationed at Bashang;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "祝茲侯軍棘門：以備胡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Zhuzi Hou garrisoned Jimen: to prepare for Hu.",
              "idiomatic": "The Marquis of Zhuzi was garrisoned at Jimen to prepare for the Hu.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "數月，胡人去，亦罷。",
          "translations": [
            {
              "lang": "en",
              "literal": "After several months, the Hu people left, and they were also dismissed.",
              "idiomatic": "After several months, the Hu people left, and they were also dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the winter of the sixth year later, the Xiongnu sent 30,000 people into Shangjun and 30,000 people into Yunzhong. Palace Attendant Ling Mian was made Chariot Cavalry General, stationed at Feihu; Former Chu Chancellor Su Yi was made general, stationed at Gouzhu; General Zhang Wu was garrisoned in Beidi; Henei Governor Zhou Yafu was made general, stationed at Xiliu; Imperial Clan Administrator Liu Li was made general, stationed at Bashang; The Marquis of Zhuzi was garrisoned at Jimen to prepare for the Hu. After several months, the Hu people left, and they were also dismissed.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0270",
          "zh": "天下旱，蝗。",
          "translations": [
            {
              "lang": "en",
              "literal": "There was drought throughout the realm, with locusts.",
              "idiomatic": "there was drought throughout the realm, with locusts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "帝加惠：令諸侯毋入貢，弛山澤，減諸服御狗馬，損郎吏員，發倉庾以振貧民，民得賣爵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor added favor: commanded feudal lords do not enter tribute, relaxed mountains marshes, reduced various clothing chariot dogs horses, decreased attendant officials number, issued granaries to relieve poor people, people able sell nobility.",
              "idiomatic": "The emperor added favors: commanded the feudal lords not to enter tribute, relaxed the mountains and marshes, reduced various clothing, chariots, dogs, and horses, decreased the number of attendant officials, issued from granaries to relieve the poor people, and allowed the people to sell nobility.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "There was drought throughout the realm, with locusts. The emperor added favors: commanded the feudal lords not to enter tribute, relaxed the mountains and marshes, reduced various clothing, chariots, dogs, and horses, decreased the number of attendant officials, issued from granaries to relieve the poor people, and allowed the people to sell nobility.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0272",
          "zh": "孝文帝從代來，即位二十三年，宮室苑囿狗馬服御無所增益，有不便，輒弛以利民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Xiaowen came from Dai and ascended the throne. For twenty-three years, he did not increase or add anything to palace chambers, gardens, enclosures, dogs, horses, clothing, or chariots. If there was anything inconvenient, he then relaxed it to benefit the people.",
              "idiomatic": "Emperor Xiaowen came from Dai and ascended the throne. for twenty-three years, he did not increase or add anything to palace chambers, gardens, enclosures, dogs, horses, clothing, or chariots. if there was anything inconvenient, he then relaxed it to benefit the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "嘗欲作露臺，召匠計之，直百金。",
          "translations": [
            {
              "lang": "en",
              "literal": "Once he wished to make an open terrace. He summoned craftsmen to calculate it, and it would cost a hundred gold.",
              "idiomatic": "Once he wished to make an open terrace. he summoned craftsmen to calculate it, and it would cost a hundred gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "上曰：「百金中民十家之產，吾奉先帝宮室，常恐羞之，何以臺為！」",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Hundred gold equals middle people ten families property, I maintain former emperor palace chambers, constantly fear shame it, what use terrace for!'",
              "idiomatic": "The emperor said: 'A hundred gold equals the property of ten middle-class families. I maintain the former emperor's palace chambers and constantly fear shaming them. What use is there for a terrace!'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "上常衣綈衣，所幸慎夫人，令衣不得曳地，幃帳不得文繡，以示敦樸，為天下先。",
          "translations": [
            {
              "lang": "en",
              "literal": "The emperor constantly wore silk clothing. His favored Lady Shen was commanded that her clothing not drag on the ground, and curtains and canopies not have patterned embroidery, to show simple plainness and be first in the realm.",
              "idiomatic": "the emperor constantly wore silk clothing. his favored Lady shen was commanded that her clothing not drag on the ground, and curtains and canopies not have patterned embroidery, to show simple plainness and be first in the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "治霸陵皆以瓦器，不得以金銀銅錫為飾，不治墳，欲為省，毋煩民。",
          "translations": [
            {
              "lang": "en",
              "literal": "He managed Baling all with tile vessels, not permitting gold, silver, copper, or tin as decoration, and did not manage the tomb, wishing to be frugal and not trouble the people.",
              "idiomatic": "he managed Baling all with tile vessels, not permitting gold, silver, copper, or tin as decoration, and did not manage the tomb, wishing to be frugal and not trouble the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "南越王尉佗自立為武帝，然上召貴尉佗兄弟，以德報之，佗遂去帝稱臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Nanyue, Wei Tuo, established himself as Martial Emperor. However, the emperor summoned and honored Wei Tuo's brothers, repaying them with virtue. Tuo then removed the emperor title and became a minister.",
              "idiomatic": "the King of Nanyue, wei Tuo, established himself as Martial Emperor. however, the emperor summoned and honored wei Tuo's brothers, repaying them with virtue. Tuo then removed the emperor title and became a minister.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "與匈奴和親，匈奴背約入盜，然令邊備守，不發兵深入，惡煩苦百姓。",
          "translations": [
            {
              "lang": "en",
              "literal": "He had peaceful kinship with the Xiongnu, but the Xiongnu violated the agreement and entered to raid. However, he commanded border preparations and defense, not dispatching troops to penetrate deeply, hating to trouble and embitter the people.",
              "idiomatic": "he had peaceful kinship with the Xiongnu, but the Xiongnu violated the agreement and entered to raid. however, he commanded border preparations and defense, not dispatching troops to penetrate deeply, hating to trouble and embitter the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "吳王詐病不朝，就賜几杖。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King of Wu feigned illness and did not come to court, so he was granted a table and cane.",
              "idiomatic": "the King of Wu feigned illness and did not come to court, so he was granted a table and cane.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "群臣如袁盎等稱說雖切，常假借用之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ministers like Yuan Ang and others gave admonitions that were urgent, but he constantly borrowed and used them.",
              "idiomatic": "Ministers like Yuan Ang and others gave admonitions that were urgent, but he constantly borrowed and used them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "群臣如張武等受賂遺金錢，覺，上乃發御府金錢賜之，以愧其心，弗下吏。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ministers like Zhang Wu and others received bribes and gave gold and money. When discovered, the emperor issued gold and money from the imperial treasury and granted it to them, to shame their hearts, and did not send them to the judicial officials.",
              "idiomatic": "Ministers like Zhang Wu and others received bribes and gave gold and money. when discovered, the emperor issued gold and money from the imperial treasury and granted it to them, to shame their hearts, and did not send them to the judicial officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "專務以德化民，是以海內殷富，興於禮義。",
          "translations": [
            {
              "lang": "en",
              "literal": "He was specially devoted to using virtue to transform the people, therefore within the seas there was flourishing and richness, arising from ritual and righteousness.",
              "idiomatic": "he was specially devoted to using virtue to transform the people, therefore within the seas there was flourishing and richness, arising from ritual and righteousness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Xiaowen came from Dai and ascended the throne. For twenty-three years, he did not increase or add anything to palace chambers, gardens, enclosures, dogs, horses, clothing, or chariots. If there was anything inconvenient, he then relaxed it to benefit the people. Once he wished to make an open terrace. He summoned craftsmen to calculate it, and it would cost a hundred gold. The emperor said: 'A hundred gold equals the property of ten middle-class families. I maintain the former emperor's palace chambers and constantly fear shaming them. What use is there for a terrace!' The emperor constantly wore silk clothing. His favored Lady Shen was commanded that her clothing not drag on the ground, and curtains and canopies not have patterned embroidery, to show simple plainness and be first in the realm. He managed Baling all with tile vessels, not permitting gold, silver, copper, or tin as decoration, and did not manage the tomb, wishing to be frugal and not trouble the people. The King of Nanyue, Wei Tuo, established himself as Martial Emperor. However, the emperor summoned and honored Wei Tuo's brothers, repaying them with virtue. Tuo then removed the emperor title and became a minister. He had peaceful kinship with the Xiongnu, but the Xiongnu violated the agreement and entered to raid. However, he commanded border preparations and defense, not dispatching troops to penetrate deeply, hating to trouble and embitter the people. The King of Wu feigned illness and did not come to court, so he was granted a table and cane. Ministers like Yuan Ang and others gave admonitions that were urgent, but he constantly borrowed and used them. Ministers like Zhang Wu and others received bribes and gave gold and money. When discovered, the emperor issued gold and money from the imperial treasury and granted it to them, to shame their hearts, and did not send them to the judicial officials. He was specially devoted to using virtue to transform the people, therefore within the seas there was flourishing and richness, arising from ritual and righteousness.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0283",
          "zh": "後七年六月己亥，帝崩於未央宮。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the jihai day of the sixth month of the seventh year later, the emperor collapsed at Weiyang Palace.",
              "idiomatic": "in the jihai day of the sixth month of the seventh year later, the emperor collapsed at weiyang Palace.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "遺詔曰：「朕聞蓋天下萬物之萌生，靡不有死。",
          "translations": [
            {
              "lang": "en",
              "literal": "Last will edict said: 'I heard indeed realm ten thousand things sprouting growing, none not have death.",
              "idiomatic": "The last will edict said: 'I have heard that indeed in the realm, the sprouting and growing of the ten thousand things, none do not have death.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "死者天地之理，物之自然者，奚可甚哀。",
          "translations": [
            {
              "lang": "en",
              "literal": "Death is the principle of heaven and earth, the natural course of things. Why should one mourn excessively?",
              "idiomatic": "Death is the principle of heaven and earth, the natural course of things. why should one mourn excessively?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "當今之時，世咸嘉生而惡死，厚葬以破業，重服以傷生，吾甚不取。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the current time, the world all praises life and hates death, using thick burials to break livelihoods, heavy mourning to harm life. I greatly reject this.",
              "idiomatic": "in the current time, the world all praises life and hates death, using thick burials to break livelihoods, heavy mourning to harm life. i greatly reject this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "且朕既不德，無以佐百姓；",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover I already lacking virtue, nothing to assist hundred surnames;",
              "idiomatic": "Moreover, since I am already lacking in virtue, I have nothing with which to assist the people;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "今崩，又使重服久臨，以離寒暑之數，哀人之父子，傷長幼之志，損其飲食，絕鬼神之祭祀，以重吾不德也，謂天下何！",
          "translations": [
            {
              "lang": "en",
              "literal": "Now collapse, moreover make heavy mourning long preside, to separate cold hot calculations, mourn people fathers sons, harm elders young ones will, damage their eating drinking, cut off ghosts spirits sacrifices, to add weight to my lacking virtue also, tell realm what!",
              "idiomatic": "Now if I collapse, moreover causing heavy mourning to preside for a long time, separating from the calculations of cold and heat, mourning people's fathers and sons, harming the will of elders and youths, damaging their eating and drinking, cutting off sacrifices to ghosts and spirits - this would add weight to my lack of virtue. What would I say to the realm!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "朕獲保宗廟，以眇眇之身託于天下君王之上，二十有餘年矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "I have obtained protection of the ancestral temple, with my tiny body entrusted above the realm's monarchs and kings, for over twenty years now.",
              "idiomatic": "i have obtained protection of the ancestral temple, with my tiny body entrusted above the realm's monarchs and kings, for over twenty years now.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "賴天地之靈，社稷之福，方內安寧，靡有兵革。",
          "translations": [
            {
              "lang": "en",
              "literal": "Relying on the spirit of heaven and earth, the fortune of the state altars, within the borders there is peace and calm, with no weapons or armor.",
              "idiomatic": "Relying on the spirit of heaven and earth, the fortune of the state altars, within the borders there is peace and calm, with no weapons or armor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "朕既不敏，常畏過行，以羞先帝之遺德；",
          "translations": [
            {
              "lang": "en",
              "literal": "I already not clever, constantly fear mistaken conduct, to shame former emperor remaining virtue;",
              "idiomatic": "Since I am already not clever, I constantly fear mistaken conduct, which would shame the remaining virtue of the former emperor;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "維年之久長，懼于不終。",
          "translations": [
            {
              "lang": "en",
              "literal": "Only fearing that the long duration of years would not reach an end.",
              "idiomatic": "Only fearing that the long duration of years would not reach an end.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "今乃幸以天年，得復供養于高廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now then fortunate with heaven's years, I am able to again serve and nourish at the high temple.",
              "idiomatic": "Now then fortunate with heaven's years, i am able to again serve and nourish at the high temple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "朕之不明與嘉之，其奚哀悲之有！",
          "translations": [
            {
              "lang": "en",
              "literal": "My lacking clarity and praise it, what mourning sorrow have!",
              "idiomatic": "My lack of clarity and praise for it - what mourning and sorrow is there!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0295",
          "zh": "其令天下吏民，令到出臨三日，皆釋服。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the officials and people of the realm be commanded: when the command arrives, go attend for three days, then all release from mourning.",
              "idiomatic": "Let the officials and people of the realm be commanded: when the command arrives, go attend for three days, then all release from mourning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "毋禁取婦嫁女祠祀飲酒食肉者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Do not prohibit those taking wives, marrying daughters, performing sacrifices, drinking wine, or eating meat.",
              "idiomatic": "Do not prohibit those taking wives, marrying daughters, performing sacrifices, drinking wine, or eating meat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "自當給喪事服臨者，皆無踐。",
          "translations": [
            {
              "lang": "en",
              "literal": "Those who should provide funeral affairs and mourning attendance, all should not tread.",
              "idiomatic": "those who should provide funeral affairs and mourning attendance, all should not tread.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "绖帶無過三寸，毋布車及兵器，毋發民男女哭臨宮殿。",
          "translations": [
            {
              "lang": "en",
              "literal": "Mourning bands should not exceed three inches. Do not spread chariots and weapons. Do not mobilize the people's males and females to cry and attend at the palace halls.",
              "idiomatic": "Mourning bands should not exceed three inches. Do not spread chariots and weapons. Do not mobilize the people's males and females to cry and attend at the palace halls.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "宮殿中當臨者，皆以旦夕各十五舉聲，禮畢罷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Those who should attend in the palace halls should all raise their voices fifteen times each morning and evening. When the ceremony is finished, cease.",
              "idiomatic": "those who should attend in the palace halls should all raise their voices fifteen times each morning and evening. when the ceremony is finished, cease.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "非旦夕臨時，禁毋得擅哭。",
          "translations": [
            {
              "lang": "en",
              "literal": "Not for morning and evening temporary occasions, prohibit arbitrarily crying.",
              "idiomatic": "Not for morning and evening temporary occasions, prohibit arbitrarily crying.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "已下，服大紅十五日，小紅十四日，纖七日，釋服。",
          "translations": [
            {
              "lang": "en",
              "literal": "Below that, wear great red for fifteen days, small red for fourteen days, thin mourning for seven days, then release from mourning.",
              "idiomatic": "Below that, wear great red for fifteen days, small red for fourteen days, thin mourning for seven days, then release from mourning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "佗不在令中者，皆以此令比率從事。",
          "translations": [
            {
              "lang": "en",
              "literal": "For others not included in this command, all shall conduct affairs proportionally according to this command.",
              "idiomatic": "for others not included in this command, all shall conduct affairs proportionally according to this command.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "布告天下，使明知朕意。",
          "translations": [
            {
              "lang": "en",
              "literal": "Proclaim it to the realm, so that they clearly know my intention.",
              "idiomatic": "Proclaim it to the realm, so that they clearly know my intention.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "霸陵山川因其故，毋有所改。",
          "translations": [
            {
              "lang": "en",
              "literal": "The mountains and rivers of Baling shall follow their old course, with no changes.",
              "idiomatic": "the mountains and rivers of Baling shall follow their old course, with no changes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "歸夫人以下至少使。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Return ladies below at least envoys.'",
              "idiomatic": "Return the ladies below to at least envoys.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "令中尉亞夫為車騎將軍，屬國悍為將屯將軍，郎中令武為復土將軍，發近縣見卒萬六千人，發內史卒萬五千人，藏郭穿復土屬將軍武。",
          "translations": [
            {
              "lang": "en",
              "literal": "Command the Commandant Yafu to be Chariot Cavalry General, Dependent States Han to be Garrison General, Chamberlain for Attendants Wu to be Rebury General, dispatch sixteen thousand present soldiers from nearby counties, dispatch fifteen thousand soldiers from the Interior Minister, bury the excavated outer city walls and rebury them belonging to General Wu.",
              "idiomatic": "Command the Commandant Yafu to be Chariot Cavalry General, Dependent States Han to be Garrison General, Chamberlain for Attendants Wu to be Rebury General, dispatch sixteen thousand present soldiers from nearby counties, dispatch fifteen thousand soldiers from the interior Minister, bury the excavated outer city walls and rebury them belonging to General Wu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the jihai day of the sixth month of the seventh year later, the emperor collapsed at Weiyang Palace. The last will edict said: 'I have heard that indeed in the realm, the sprouting and growing of the ten thousand things, none do not have death. Death is the principle of heaven and earth, the natural course of things. Why should one mourn excessively? In the current time, the world all praises life and hates death, using thick burials to break livelihoods, heavy mourning to harm life. I greatly reject this. Moreover, since I am already lacking in virtue, I have nothing with which to assist the people; Now if I collapse, moreover causing heavy mourning to preside for a long time, separating from the calculations of cold and heat, mourning people's fathers and sons, harming the will of elders and youths, damaging their eating and drinking, cutting off sacrifices to ghosts and spirits - this would add weight to my lack of virtue. What would I say to the realm! I have obtained protection of the ancestral temple, with my tiny body entrusted above the realm's monarchs and kings, for over twenty years now. Relying on the spirit of heaven and earth, the fortune of the state altars, within the borders there is peace and calm, with no weapons or armor. Since I am already not clever, I constantly fear mistaken conduct, which would shame the remaining virtue of the former emperor; Only fearing that the long duration of years would not reach an end. Now then fortunate with heaven's years, I am able to again serve and nourish at the high temple. My lack of clarity and praise for it - what mourning and sorrow is there! Let the officials and people of the realm be commanded: when the command arrives, go attend for three days, then all release from mourning. Do not prohibit those taking wives, marrying daughters, performing sacrifices, drinking wine, or eating meat. Those who should provide funeral affairs and mourning attendance, all should not tread. Mourning bands should not exceed three inches. Do not spread chariots and weapons. Do not mobilize the people's males and females to cry and attend at the palace halls. Those who should attend in the palace halls should all raise their voices fifteen times each morning and evening. When the ceremony is finished, cease. Not for morning and evening temporary occasions, prohibit arbitrarily crying. Below that, wear great red for fifteen days, small red for fourteen days, thin mourning for seven days, then release from mourning. For others not included in this command, all shall conduct affairs proportionally according to this command. Proclaim it to the realm, so that they clearly know my intention. The mountains and rivers of Baling shall follow their old course, with no changes. Return the ladies below to at least envoys.' Command the Commandant Yafu to be Chariot Cavalry General, Dependent States Han to be Garrison General, Chamberlain for Attendants Wu to be Rebury General, dispatch sixteen thousand present soldiers from nearby counties, dispatch fifteen thousand soldiers from the Interior Minister, bury the excavated outer city walls and rebury them belonging to General Wu.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0307",
          "zh": "乙巳，群臣皆頓首上尊號曰孝文皇帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the yisi day, all the ministers bowed their heads and offered the honored title 'Emperor Xiaowen.'",
              "idiomatic": "On the yisi day, all the ministers bowed their heads and offered the honored title 'Emperor Xiaowen.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the yisi day, all the ministers bowed their heads and offered the honored title 'Emperor Xiaowen.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0308",
          "zh": "太子即位于高廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "The crown prince ascended the throne at the high temple.",
              "idiomatic": "the crown prince ascended the throne at the high temple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "丁未，襲號曰皇帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "On the dingwei day, he inherited the title of emperor.",
              "idiomatic": "On the dingwei day, he inherited the title of emperor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince ascended the throne at the high temple. On the dingwei day, he inherited the title of emperor.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0310",
          "zh": "孝景皇帝元年十月，制詔御史：「蓋聞古者祖有功而宗有德，制禮樂各有由。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing emperor first year tenth month, imperial edict to Censor: 'Indeed heard ancient ones ancestor have merit yet progenitor have virtue, established rites music each have origin.",
              "idiomatic": "In the tenth month of the first year of Emperor Xiaojing, an imperial edict to the Censor: 'Indeed I have heard that in ancient times, the ancestor had merit while the progenitor had virtue, and the establishment of rites and music each had their origins.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "聞歌者，所以發德也；",
          "translations": [
            {
              "lang": "en",
              "literal": "Songs heard, that which manifests virtue also;",
              "idiomatic": "Songs that are heard are that which manifests virtue;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "舞者，所以明功也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dances that are performed are that which clarifies merit.",
              "idiomatic": "Dances that are performed are that which clarifies merit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "高廟酎，奏武德、文始、五行之舞。",
          "translations": [
            {
              "lang": "en",
              "literal": "For the autumn sacrifice at the High Temple, perform the dances of Martial Virtue, Literary Beginning, and Five Phases.",
              "idiomatic": "for the autumn sacrifice at the High Temple, perform the dances of Martial Virtue, Literary Beginning, and Five Phases.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "孝惠廟酎，奏文始、五行之舞。",
          "translations": [
            {
              "lang": "en",
              "literal": "For the autumn sacrifice at the Filial Hui Temple, perform the dances of Literary Beginning and Five Phases.",
              "idiomatic": "for the autumn sacrifice at the Filial Hui Temple, perform the dances of Literary Beginning and Five Phases.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "孝文皇帝臨天下，通關梁，不異遠方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Xiaowen faced the realm, opened the passes and bridges, treating distant places no differently.",
              "idiomatic": "Emperor Xiaowen faced the realm, opened the passes and bridges, treating distant places no differently.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "除誹謗，去肉刑，賞賜長老，收恤孤獨，以育群生。",
          "translations": [
            {
              "lang": "en",
              "literal": "He eliminated slander, removed flesh punishments, rewarded and granted to elders, gathered and comforted orphans and widows, to nurture all living beings.",
              "idiomatic": "he eliminated slander, removed flesh punishments, rewarded and granted to elders, gathered and comforted orphans and widows, to nurture all living beings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "減嗜欲，不受獻，不私其利也。",
          "translations": [
            {
              "lang": "en",
              "literal": "He reduced his desires, did not accept tributes, and did not privately take their profits.",
              "idiomatic": "he reduced his desires, did not accept tributes, and did not privately take their profits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "罪人不帑，不誅無罪。",
          "translations": [
            {
              "lang": "en",
              "literal": "He punished criminals without implicating their families, and did not execute the innocent.",
              "idiomatic": "he punished criminals without implicating their families, and did not execute the innocent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "除（肉）［宮］刑，出美人，重絕人之世。",
          "translations": [
            {
              "lang": "en",
              "literal": "He eliminated palace punishments, released beautiful women, and valued not cutting off people's lineages.",
              "idiomatic": "he eliminated palace punishments, released beautiful women, and valued not cutting off people's lineages.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "朕既不敏，不能識。",
          "translations": [
            {
              "lang": "en",
              "literal": "I am already not clever and cannot recognize this.",
              "idiomatic": "i am already not clever and cannot recognize this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "此皆上古之所不及，而孝文皇帝親行之。",
          "translations": [
            {
              "lang": "en",
              "literal": "These were all not reached in high antiquity, yet Emperor Xiaowen personally performed them.",
              "idiomatic": "these were all not reached in high antiquity, yet Emperor Xiaowen personally performed them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "德厚侔天地，利澤施四海，靡不獲福焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "His virtue was as thick as heaven and earth, his beneficial moisture extended to the four seas, and none did not obtain fortune therein.",
              "idiomatic": "his virtue was as thick as heaven and earth, his beneficial moisture extended to the four seas, and none did not obtain fortune therein.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "明象乎日月，而廟樂不稱。",
          "translations": [
            {
              "lang": "en",
              "literal": "His bright image was like the sun and moon, yet the temple music did not match.",
              "idiomatic": "his bright image was like the sun and moon, yet the temple music did not match.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0324",
          "zh": "朕甚懼焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "I greatly fear this.",
              "idiomatic": "i greatly fear this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "其為孝文皇帝廟為昭德之舞，以明休德。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let there be made for Emperor Xiaowen's temple the Bright Virtue dance, to clarify flourishing virtue.",
              "idiomatic": "Let there be made for Emperor Xiaowen's temple the Bright Virtue dance, to clarify flourishing virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "然後祖宗之功德著於竹帛，施于萬世，永永無窮，朕甚嘉之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then the merits and virtue of the ancestors will be manifest on bamboo and silk, extending to ten thousand generations, eternally endless. I greatly praise this.",
              "idiomatic": "then the merits and virtue of the ancestors will be manifest on bamboo and silk, extending to ten thousand generations, eternally endless. i greatly praise this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "其與丞相、列侯、中二千石、禮官具為禮儀奏。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let with Chancellor, marquises, middle two thousand stones, ritual officials together make ritual ceremonies memorial.'",
              "idiomatic": "Let it be done together with the Chancellor, marquises, middle two thousand stones, and ritual officials to make the ritual ceremonies memorial.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "丞相臣嘉等言：「陛下永思孝道，立昭德之舞以明孝文皇帝之盛德。",
          "translations": [
            {
              "lang": "en",
              "literal": "Chancellor minister Jia etc. said: 'Your Majesty eternally thinks filial way, establishes Bright Virtue dance to clarify Filial Wen emperor great virtue.",
              "idiomatic": "Chancellor minister Jia and others said: 'Your Majesty eternally contemplates the way of filial piety, establishes the Bright Virtue dance to clarify Emperor Xiaowen's great virtue.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "皆臣嘉等愚所不及。",
          "translations": [
            {
              "lang": "en",
              "literal": "All of this is beyond what we foolish ministers Jia and others can reach.",
              "idiomatic": "All of this is beyond what we foolish ministers Jia and others can reach.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "臣謹議：世功莫大於高皇帝，德莫盛於孝文皇帝，高皇廟宜為帝者太祖之廟，孝文皇帝廟宜為帝者太宗之廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Minister respectfully discusses: generation achievements none greater than High emperor, virtue none more flourishing than Filial Wen emperor, High emperor temple should be emperors Grand Ancestor temple, Filial Wen emperor temple should be emperors Grand Progenitor temple.",
              "idiomatic": "We ministers respectfully discuss: among the achievements of generations, none are greater than the High Emperor's; among virtues, none are more flourishing than Emperor Xiaowen's. The High Emperor's temple should be the Grand Ancestor temple for emperors, and Emperor Xiaowen's temple should be the Grand Progenitor temple for emperors.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "天子宜世世獻祖宗之廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Son of Heaven should generation after generation offer sacrifices at the temples of the ancestors.",
              "idiomatic": "the son of heaven should generation after generation offer sacrifices at the temples of the ancestors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "郡國諸侯宜各為孝文皇帝立太宗之廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "The feudal lords of the commanderies and states should each establish a Grand Progenitor temple for Emperor Xiaowen.",
              "idiomatic": "the feudal lords of the commanderies and states should each establish a Grand Progenitor temple for Emperor Xiaowen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "諸侯王列侯使者侍祠天子，歲獻祖宗之廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "The envoys of the feudal lord kings and marquises shall attend the sacrifices of the Son of Heaven, and annually offer at the temples of the ancestors.",
              "idiomatic": "The envoys of the feudal lord kings and marquises shall attend the emperor's sacrifices and make annual offerings at the ancestral temples.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "請著之竹帛，宣布天下。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Request manifest it bamboo silk, announce proclaim realm.'",
              "idiomatic": "We request that it be manifest on bamboo and silk, and announced and proclaimed to the realm.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "制曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial decree said: 'Approved.'",
              "idiomatic": "The imperial decree said: 'Approved.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the tenth month of the first year of Emperor Xiaojing, an imperial edict to the Censor: 'Indeed I have heard that in ancient times, the ancestor had merit while the progenitor had virtue, and the establishment of rites and music each had their origins. Songs that are heard are that which manifests virtue; Dances that are performed are that which clarifies merit. For the autumn sacrifice at the High Temple, perform the dances of Martial Virtue, Literary Beginning, and Five Phases. For the autumn sacrifice at the Filial Hui Temple, perform the dances of Literary Beginning and Five Phases. Emperor Xiaowen faced the realm, opened the passes and bridges, treating distant places no differently. He eliminated slander, removed flesh punishments, rewarded and granted to elders, gathered and comforted orphans and widows, to nurture all living beings. He reduced his desires, did not accept tributes, and did not privately take their profits. He punished criminals without implicating their families, and did not execute the innocent. He eliminated palace punishments, released beautiful women, and valued not cutting off people's lineages. I am already not clever and cannot recognize this. These were all not reached in high antiquity, yet Emperor Xiaowen personally performed them. His virtue was as thick as heaven and earth, his beneficial moisture extended to the four seas, and none did not obtain fortune therein. His bright image was like the sun and moon, yet the temple music did not match. I greatly fear this. Let there be made for Emperor Xiaowen's temple the Bright Virtue dance, to clarify flourishing virtue. Then the merits and virtue of the ancestors will be manifest on bamboo and silk, extending to ten thousand generations, eternally endless. I greatly praise this. Let it be done together with the Chancellor, marquises, middle two thousand stones, and ritual officials to make the ritual ceremonies memorial.' Chancellor minister Jia and others said: 'Your Majesty eternally contemplates the way of filial piety, establishes the Bright Virtue dance to clarify Emperor Xiaowen's great virtue. All of this is beyond what we foolish ministers Jia and others can reach. We ministers respectfully discuss: among the achievements of generations, none are greater than the High Emperor's; among virtues, none are more flourishing than Emperor Xiaowen's. The High Emperor's temple should be the Grand Ancestor temple for emperors, and Emperor Xiaowen's temple should be the Grand Progenitor temple for emperors. The Son of Heaven should generation after generation offer sacrifices at the temples of the ancestors. The feudal lords of the commanderies and states should each establish a Grand Progenitor temple for Emperor Xiaowen. The envoys of the feudal lord kings and marquises shall attend the sacrifices of the Son of Heaven, and annually offer at the temples of the ancestors. We request that it be manifest on bamboo and silk, and announced and proclaimed to the realm.' The imperial decree said: 'Approved.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0337",
          "zh": "太史公曰：孔子言「必世然後仁。",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand Historian said: Confucius spoke 'Must generations then benevolent.",
              "idiomatic": "The Grand Historian said: Confucius spoke, 'Only after generations can there be benevolence.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "善人之治國百年，亦可以勝殘去殺」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Good person governing country hundred years, also can overcome cruel eliminate killing.'",
              "idiomatic": "A good person governing the country for a hundred years can also overcome cruelty and eliminate killing.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "誠哉是言！",
          "translations": [
            {
              "lang": "en",
              "literal": "Truly indeed this saying!",
              "idiomatic": "Truly indeed is this saying!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "漢興，至孝文四十有餘載，德至盛也。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Han rose, and by Emperor Xiaowen's time for over forty years, virtue reached its utmost flourishing.",
              "idiomatic": "Since the Han dynasty arose, over forty years had passed by Emperor Xiaowen's time, and virtue had reached its greatest flourishing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "廩廩鄉改正服封禪矣，謙讓未成於今。",
          "translations": [
            {
              "lang": "en",
              "literal": "The full village had already reformed the calendar and clothing for the feng and shan sacrifices, but modest yielding was not accomplished until now.",
              "idiomatic": "The nation had already reformed the calendar and clothing for the feng and shan sacrifices, but his modest yielding was not accomplished until now.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "嗚呼，豈不仁哉！",
          "translations": [
            {
              "lang": "en",
              "literal": "Alas, how not benevolent also!",
              "idiomatic": "Alas, how benevolent he was!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Grand Historian said: Confucius spoke, 'Only after generations can there be benevolence. A good person governing the country for a hundred years can also overcome cruelty and eliminate killing.' Truly indeed is this saying! The Han rose, and by Emperor Xiaowen's time for over forty years, virtue reached its utmost flourishing. The full village had already reformed the calendar and clothing for the feng and shan sacrifices, but modest yielding was not accomplished until now. Alas, how benevolent he was!",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    }
  ]
}