{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "012",
    "url": "https://chinesenotes.com/shiji/shiji012.html",
    "title": {
      "zh": "《孝武本紀》 Annals of the Xiaowu Emperor",
      "en": null,
      "raw": "《孝武本紀》 Annals of the Xiaowu Emperor"
    },
    "sentenceCount": 418,
    "translatedCount": 418,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:34.877Z",
    "translators": [
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 52,
        "sentences": 418
      }
    ],
    "citation": "Translation: Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝武皇帝者，孝景中子也。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Wu was the middle son of Emperor Jing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "母曰王太后。",
          "translations": [
            {
              "lang": "en",
              "text": "His mother was Empress Wang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "孝景四年，以皇子為膠東王。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Jing ascended the throne in the fourth year, established him as King of Jiaodong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Jing ascended the throne in the seventh year, deposed Crown Prince Li as Linjiang King, established Jiaodong King as crown prince.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "孝景十六年崩，太子即位，為孝武皇帝。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Jing died in the sixteenth year, the crown prince ascended the throne as Emperor Wu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "孝武皇帝初即位，尤敬鬼神之祀。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor Wu initially ascended the throne, especially respected the sacrifices to ghosts and spirits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor Wu was the middle son of Emperor Jing. His mother was Empress Wang. Emperor Jing ascended the throne in the fourth year, established him as King of Jiaodong. Emperor Jing ascended the throne in the seventh year, deposed Crown Prince Li as Linjiang King, established Jiaodong King as crown prince. Emperor Jing died in the sixteenth year, the crown prince ascended the throne as Emperor Wu. Emperor Wu initially ascended the throne, especially respected the sacrifices to ghosts and spirits.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0007",
          "zh": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
          "translations": [
            {
              "lang": "en",
              "text": "In the first year, the Han had already risen over sixty years, the world was peaceful and secure, the scholars and nobles all hoped the emperor would perform the Feng and Shan sacrifices and change the calendar and degrees.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "And the emperor tended toward Confucian learning, recruited worthy and upright, Zhao Wan, Wang Zang and others became nobles through literature, wished to discuss ancient matters to establish the Mingtang south of the city, to receive feudal lords there.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "草巡狩封禪改歷服色事未就。",
          "translations": [
            {
              "lang": "en",
              "text": "Drafting the matters of patrolling and hunting, Feng and Shan sacrifices, changing the calendar, clothes, colors had not yet been completed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。",
          "translations": [
            {
              "lang": "en",
              "text": "It happened that Empress Dowager Dou practiced the teachings of Huang-Lao, disliked Confucian learning, had people secretly obtain Zhao Wan and others' cases of taking bribes and favoritism, summoned and investigated Wan and Zang, Wan and Zang committed suicide, all the things they had started were abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In the first year, the Han had already risen over sixty years, the world was peaceful and secure, the scholars and nobles all hoped the emperor would perform the Feng and Shan sacrifices and change the calendar and degrees. And the emperor tended toward Confucian learning, recruited worthy and upright, Zhao Wan, Wang Zang and others became nobles through literature, wished to discuss ancient matters to establish the Mingtang south of the city, to receive feudal lords there. Drafting the matters of patrolling and hunting, Feng and Shan sacrifices, changing the calendar, clothes, colors had not yet been completed. It happened that Empress Dowager Dou practiced the teachings of Huang-Lao, disliked Confucian learning, had people secretly obtain Zhao Wan and others' cases of taking bribes and favoritism, summoned and investigated Wan and Zang, Wan and Zang committed suicide, all the things they had started were abolished.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "後六年，竇太后崩。",
          "translations": [
            {
              "lang": "en",
              "text": "After six years, Empress Dowager Dou died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "其明年，上徵文學之士公孫弘等。",
          "translations": [
            {
              "lang": "en",
              "text": "In the next year, the emperor summoned literary scholars Gongsun Hong and others.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After six years, Empress Dowager Dou died. In the next year, the emperor summoned literary scholars Gongsun Hong and others.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "明年，上初至雍，郊見五畤。",
          "translations": [
            {
              "lang": "en",
              "text": "In the next year, the emperor first went to Yong, offered sacrifices seeing the five altars.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "後常三歲一郊。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards, regularly once every three years offered sacrifices.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "是時上求神君，捨之上林中蹄氏觀。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time the emperor sought the divine lord, placed him in the Houshi Pavilion of Shanglin Gardens.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
          "translations": [
            {
              "lang": "en",
              "text": "The divine lord was a woman from Changling, who died grieving for her child, thus saw spirits in the former residences of her husband.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "宛若祠之其室，民多往祠。",
          "translations": [
            {
              "lang": "en",
              "text": "The residences of her husband sacrificed to her, the people greatly went to sacrifice.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "平原君往祠，其後子孫以尊顯。",
          "translations": [
            {
              "lang": "en",
              "text": "The Pingyuan Lord went to sacrifice, his descendants afterwards became eminent through honor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
          "translations": [
            {
              "lang": "en",
              "text": "And when Emperor Wu ascended the throne, he richly honored and placed sacrifices in the inner court, heard his words, but did not see his person.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In the next year, the emperor first went to Yong, offered sacrifices seeing the five altars. Afterwards, regularly once every three years offered sacrifices. At this time the emperor sought the divine lord, placed him in the Houshi Pavilion of Shanglin Gardens. The divine lord was a woman from Changling, who died grieving for her child, thus saw spirits in the former residences of her husband. The residences of her husband sacrificed to her, the people greatly went to sacrifice. The Pingyuan Lord went to sacrifice, his descendants afterwards became eminent through honor. And when Emperor Wu ascended the throne, he richly honored and placed sacrifices in the inner court, heard his words, but did not see his person.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0020",
          "zh": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time Li Shaojun also appeared before the emperor through sacrificing to the stove, grain way, and avoiding old age methods, the emperor honored him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "少君者，故深澤侯入以主方。",
          "translations": [
            {
              "lang": "en",
              "text": "Shaojun was a former descendant of the Marquis of Shenze, who served as an official.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "匿其年及所生長，常自謂七十，能使物，卻老。",
          "translations": [
            {
              "lang": "en",
              "text": "He concealed his age and birthplace, always claimed to be seventy, could make things, avoid old age.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "其游以方遍諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "He traveled with his methods among the feudal lords.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "無妻子。",
          "translations": [
            {
              "lang": "en",
              "text": "Had no wife or children.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
          "translations": [
            {
              "lang": "en",
              "text": "People heard he could make things and not die, moreover gave him money and goods, constantly more than enough gold and silk clothes food.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
          "translations": [
            {
              "lang": "en",
              "text": "People all considered him not managing property yet wealthy, moreover did not know what he lived on, became even more convinced, contended to serve him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "少君資好方，善為巧發奇中。",
          "translations": [
            {
              "lang": "en",
              "text": "Shaojun was good at methods, skillful at making extraordinary things strike the mark.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
          "translations": [
            {
              "lang": "en",
              "text": "Once drank with the Marquis of Wuan, among the guests was a ninety-year-old man, Shaojun said he had shot with his grandfather's place, the old man as a child had followed his grandfather and knew the place, one table all astonished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "少君見上，上有故銅器，問少君。",
          "translations": [
            {
              "lang": "en",
              "text": "Shaojun saw the emperor, the emperor had an ancient bronze vessel, asked Shaojun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "少君曰：「此器齊桓公十年陳於柏寢。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shaojun said: 'This vessel was offered in the tenth year of Duke Huan of Qi.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "已而案其刻，果齊桓公器。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards, checked its engraving, indeed Duke Huan of Qi's vessel.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "一宮盡駭，以少君為神，數百歲人也。",
          "translations": [
            {
              "lang": "en",
              "text": "One palace all terrified, considered Shaojun a divine being, several hundred years old person.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "At this time Li Shaojun also appeared before the emperor through sacrificing to the stove, grain way, and avoiding old age methods, the emperor honored him. Shaojun was a former descendant of the Marquis of Shenze, who served as an official. He concealed his age and birthplace, always claimed to be seventy, could make things, avoid old age. He traveled with his methods among the feudal lords. Had no wife or children. People heard he could make things and not die, moreover gave him money and goods, constantly more than enough gold and silk clothes food. People all considered him not managing property yet wealthy, moreover did not know what he lived on, became even more convinced, contended to serve him. Shaojun was good at methods, skillful at making extraordinary things strike the mark. Once drank with the Marquis of Wuan, among the guests was a ninety-year-old man, Shaojun said he had shot with his grandfather's place, the old man as a child had followed his grandfather and knew the place, one table all astonished. Shaojun saw the emperor, the emperor had an ancient bronze vessel, asked Shaojun. Shaojun said: 'This vessel was offered in the tenth year of Duke Huan of Qi.' Afterwards, checked its engraving, indeed Duke Huan of Qi's vessel. One palace all terrified, considered Shaojun a divine being, several hundred years old person.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
          "translations": [
            {
              "lang": "en",
              "text": "Shaojun spoke to the emperor saying: 'Sacrificing to the stove brings things, bringing things and cinnabar can be transformed into gold, gold made into drinking vessels then increases longevity, increasing longevity and the Penglai immortals in the sea can be seen, seeing them to perform Feng and Shan then does not die, the Yellow Emperor is like this.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
          "translations": [
            {
              "lang": "en",
              "text": "He said: 'I once traveled on the sea, saw Anqi Sheng, ate dates from him, large as melons.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "安期生僊者，通蓬萊中，合則見人，不合則隱。」",
          "translations": [
            {
              "lang": "en",
              "text": "Anqi Sheng was an immortal, communicated with Penglai, when united then seen by people, when not united then hidden.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the emperor began to personally sacrifice to the stove, and sent fangshi into the sea to seek Penglai Anqi Sheng and the like, and matters transformed cinnabar and such into gold began.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Shaojun spoke to the emperor saying: 'Sacrificing to the stove brings things, bringing things and cinnabar can be transformed into gold, gold made into drinking vessels then increases longevity, increasing longevity and the Penglai immortals in the sea can be seen, seeing them to perform Feng and Shan then does not die, the Yellow Emperor is like this.' He said: 'I once traveled on the sea, saw Anqi Sheng, ate dates from him, large as melons.' Anqi Sheng was an immortal, communicated with Penglai, when united then seen by people, when not united then hidden. Thereupon the emperor began to personally sacrifice to the stove, and sent fangshi into the sea to seek Penglai Anqi Sheng and the like, and matters transformed cinnabar and such into gold began.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "居久之，李少君病死。",
          "translations": [
            {
              "lang": "en",
              "text": "After a long time, Li Shaojun fell ill and died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "天子以為化去不死也，而使黃錘史寬舒受其方。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor considered him to have transformed and gone, not dead, and had Huang Hammer official Kuan Shu receive his methods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Seeking Penglai Anqi Sheng could not be obtained, and the fangshi of Yan and Qi between the seas more imitated each other, again spoke of divine matters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After a long time, Li Shaojun fell ill and died. The emperor considered him to have transformed and gone, not dead, and had Huang Hammer official Kuan Shu receive his methods. Seeking Penglai Anqi Sheng could not be obtained, and the fangshi of Yan and Qi between the seas more imitated each other, again spoke of divine matters.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
          "translations": [
            {
              "lang": "en",
              "text": "The man from Bo, Bo Jiyi, memorialized sacrificing to Taiyi by one method, saying: 'Heavenly gods honor Taiyi, Taiyi's assistant is called the five emperors.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ancient kings with spring and autumn sacrificed to Taiyi in the southeast suburb, used great livestock tools, seven days, made altar opened eight paths for ghosts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the emperor ordered the Supreme Scribe establish his sacrifice in the southeast suburb of Chang'an, constantly honored sacrifice as Jiyi's method.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards people submitted memorials saying 'Ancient kings three years used great livestock tools sacrificed to gods three: heaven one, earth one, Taiyi one'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor approved, ordered the Supreme Scribe lead sacrifice to Jiyi's Taiyi altar above, as his method.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards people again submitted memorials saying 'Ancient kings constantly with spring and autumn redeemed sacrifices, sacrificed to the Yellow Emperor used one owl broken mirror; sacrificed to the underworld sheep used sheep; sacrificed to horse travel used one azure stallion; sacrificed to Taiyi, Gaoshan mountain lord, earth long used cattle; sacrificed to Wuyi lord used dried fish; sacrificed to yin yang messengers used one cattle'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "冥羊用羊；",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered sacrifice officials lead as their method, and sacrificed at Jiyi's Taiyi altar side.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "祠馬行用一青牡馬；",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards the emperor's gardens had a white deer, used its skin as currency, to respond to auspicious omens, made white gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "泰一、皋山山君、地長用牛；",
          "translations": [
            {
              "lang": "en",
              "text": "In the next year, sacrificed at Yong, obtained a one-horned beast, like a deer.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "武夷君用乾魚；",
          "translations": [
            {
              "lang": "en",
              "text": "The officials said: 'Your Majesty solemnly performed suburban sacrifices, heaven bestowed reward, gave one-horned beast, probably a unicorn.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "陰陽使者以一牛」。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon added one cattle to burn at the five altars.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "令祠官領之如其方，而祠於忌泰一壇旁。",
          "translations": [
            {
              "lang": "en",
              "text": "Granted white gold to the feudal lords, to respond to symbols fitting heaven and earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The man from Bo, Bo Jiyi, memorialized sacrificing to Taiyi by one method, saying: 'Heavenly gods honor Taiyi, Taiyi's assistant is called the five emperors.' Ancient kings with spring and autumn sacrificed to Taiyi in the southeast suburb, used great livestock tools, seven days, made altar opened eight paths for ghosts. Thereupon the emperor ordered the Supreme Scribe establish his sacrifice in the southeast suburb of Chang'an, constantly honored sacrifice as Jiyi's method. Afterwards people submitted memorials saying 'Ancient kings three years used great livestock tools sacrificed to gods three: heaven one, earth one, Taiyi one'. The emperor approved, ordered the Supreme Scribe lead sacrifice to Jiyi's Taiyi altar above, as his method. Afterwards people again submitted memorials saying 'Ancient kings constantly with spring and autumn redeemed sacrifices, sacrificed to the Yellow Emperor used one owl broken mirror; sacrificed to the underworld sheep used sheep; sacrificed to horse travel used one azure stallion; sacrificed to Taiyi, Gaoshan mountain lord, earth long used cattle; sacrificed to Wuyi lord used dried fish; sacrificed to yin yang messengers used one cattle'. Ordered sacrifice officials lead as their method, and sacrificed at Jiyi's Taiyi altar side. Afterwards the emperor's gardens had a white deer, used its skin as currency, to respond to auspicious omens, made white gold. In the next year, sacrificed at Yong, obtained a one-horned beast, like a deer. The officials said: 'Your Majesty solemnly performed suburban sacrifices, heaven bestowed reward, gave one-horned beast, probably a unicorn.' Thereupon added one cattle to burn at the five altars. Granted white gold to the feudal lords, to respond to symbols fitting heaven and earth.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "其後，天子苑有白鹿，以其皮為幣，以發瑞應，造白金焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Then Jibei King considered the emperor about to perform Feng and Shan, submitted a memorial offering Mount Tai and its surrounding counties.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Then Jibei King considered the emperor about to perform Feng and Shan, submitted a memorial offering Mount Tai and its surrounding counties.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "其明年，郊雍，獲一角獸，若麃然。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor received it, compensated with other counties.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」",
          "translations": [
            {
              "lang": "en",
              "text": "Changshan King had crimes, moved, the emperor enfeoffed his younger brother at Zhending, to continue the former king's sacrifices, and made Changshan a commandery.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "於是以薦五畤，畤加一牛以燎。",
          "translations": [
            {
              "lang": "en",
              "text": "Then the five peaks all were in the emperor's commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "賜諸侯白金，以風符應合于天地。",
          "translations": [
            {
              "lang": "en",
              "text": "In the next year, the man from Qi Shao Weng appeared before the emperor with ghost and spirit methods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The emperor received it, compensated with other counties. Changshan King had crimes, moved, the emperor enfeoffed his younger brother at Zhending, to continue the former king's sacrifices, and made Changshan a commandery. Then the five peaks all were in the emperor's commanderies. In the next year, the man from Qi Shao Weng appeared before the emperor with ghost and spirit methods.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "於是濟北王以為天子且封禪，乃上書獻泰山及其旁邑。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor had a favored Lady Wang, the lady died, Shao Weng with his methods at night caused Lady Wang and the stove ghost to appear, the emperor from within the curtains saw them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "天子受之，更以他縣償之。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon then appointed Shao Weng as Literary General, rewards very many, treated him with guest rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。",
          "translations": [
            {
              "lang": "en",
              "text": "Literary General said: 'The emperor wishes to communicate with spirits, the palace chambers and clothes do not resemble spirits, spirit objects will not arrive.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "然後五嶽皆在天子之郡。",
          "translations": [
            {
              "lang": "en",
              "text": "Then made cloud air carriage, and each chose auspicious days drove carriages to avoid evil ghosts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The emperor had a favored Lady Wang, the lady died, Shao Weng with his methods at night caused Lady Wang and the stove ghost to appear, the emperor from within the curtains saw them. Thereupon then appointed Shao Weng as Literary General, rewards very many, treated him with guest rites. Literary General said: 'The emperor wishes to communicate with spirits, the palace chambers and clothes do not resemble spirits, spirit objects will not arrive.' Then made cloud air carriage, and each chose auspicious days drove carriages to avoid evil ghosts.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "其明年，齊人少翁以鬼神方見上。",
          "translations": [
            {
              "lang": "en",
              "text": "Also made Ganquan Palace, in the middle made terrace rooms, painted heaven, earth, Taiyi various gods, and placed sacrificial tools to bring heavenly gods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。",
          "translations": [
            {
              "lang": "en",
              "text": "After more than a year, his methods increasingly declined, spirits did not arrive.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。",
          "translations": [
            {
              "lang": "en",
              "text": "Then made a cloth book fed to cattle, pretended not to know, said this cattle's belly had a strange thing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」",
          "translations": [
            {
              "lang": "en",
              "text": "Killed and examined it, obtained the book, the book spoke of his strange matters, the emperor suspected it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。",
          "translations": [
            {
              "lang": "en",
              "text": "Had someone recognize his handwriting, asked the person, indeed was forged book.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon executed Literary General while concealing it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "居歲餘，其方益衰，神不至。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards then again made Bai Liang, copper pillars, immortal person palm them and such.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。",
          "translations": [
            {
              "lang": "en",
              "text": "Literary General died the next year, the emperor fell ill at Ding Lake severely, witch doctors all were sent, could not be healed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "殺而視之，得書，書言其怪，天子疑之。",
          "translations": [
            {
              "lang": "en",
              "text": "You Shui Gen said: 'In Shangjun there is a witch, fell ill and ghosts descended.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "有識其手書，問之人，果（為）［偽］書。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor summoned and placed sacrifices at Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "於是誅文成將軍而隱之。",
          "translations": [
            {
              "lang": "en",
              "text": "And when ill, had people ask the divine lord.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Also made Ganquan Palace, in the middle made terrace rooms, painted heaven, earth, Taiyi various gods, and placed sacrificial tools to bring heavenly gods. After more than a year, his methods increasingly declined, spirits did not arrive. Then made a cloth book fed to cattle, pretended not to know, said this cattle's belly had a strange thing. Killed and examined it, obtained the book, the book spoke of his strange matters, the emperor suspected it. Had someone recognize his handwriting, asked the person, indeed was forged book. Thereupon executed Literary General while concealing it. Afterwards then again made Bai Liang, copper pillars, immortal person palm them and such. Literary General died the next year, the emperor fell ill at Ding Lake severely, witch doctors all were sent, could not be healed. You Shui Gen said: 'In Shangjun there is a witch, fell ill and ghosts descended.' The emperor summoned and placed sacrifices at Ganquan. And when ill, had people ask the divine lord.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "其後則又作柏梁、銅柱、承露僊人掌之屬矣。",
          "translations": [
            {
              "lang": "en",
              "text": "The divine lord said: 'The emperor has no worry about illness.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The divine lord said: 'The emperor has no worry about illness.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "文成死明年，天子病鼎湖甚，巫醫無所不致，（至）不愈。",
          "translations": [
            {
              "lang": "en",
              "text": "The illness will slightly recover, strongly with me meet at Ganquan.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "游水發根乃言曰：「上郡有巫，病而鬼下之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the illness recovered, then visited Ganquan, the illness completely well.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "上召置祠之甘泉。",
          "translations": [
            {
              "lang": "en",
              "text": "Great pardon the world, established Shou Palace divine lord.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "及病，使人問神君。",
          "translations": [
            {
              "lang": "en",
              "text": "The divine lord most noble was Taiyi, his assistants were called Da Jin, Si Ming and the like, all followed him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "神君言曰：「天子毋憂病。",
          "translations": [
            {
              "lang": "en",
              "text": "Could not be seen, heard his sound, equal to speaking with people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "病少愈，彊與我會甘泉。」",
          "translations": [
            {
              "lang": "en",
              "text": "Sometimes went, sometimes came, when came the wind whirled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "於是病愈，遂幸甘泉，病良已。",
          "translations": [
            {
              "lang": "en",
              "text": "Lived in chambers and curtains.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "大赦天下，置壽宮神君。",
          "translations": [
            {
              "lang": "en",
              "text": "Sometimes spoke by day, but often by night.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor purified, then entered.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "非可得見，聞其音，與人言等。",
          "translations": [
            {
              "lang": "en",
              "text": "Because the witch acted as host, controlled diet.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "時去時來，來則風肅然也。",
          "translations": [
            {
              "lang": "en",
              "text": "What he desired spoke and went down.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "居室帷中。",
          "translations": [
            {
              "lang": "en",
              "text": "Also established Shou Palace, Beigong, spread feather flags, set sacrificial tools, to honor the divine lord with rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "時晝言，然常以夜。",
          "translations": [
            {
              "lang": "en",
              "text": "The divine lord's words, the emperor had people receive and record his words, named it 'painting method'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "天子祓，然後入。",
          "translations": [
            {
              "lang": "en",
              "text": "His words were common knowledge among the world, had no extraordinary strangeness, yet the emperor alone delighted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "因巫為主人，關飲食。",
          "translations": [
            {
              "lang": "en",
              "text": "His matters were secret, the world did not know.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "所欲者言行下。",
          "translations": [
            {
              "lang": "en",
              "text": "After three years, the officials said Yuan should be named with heavenly omens, not with one two numbers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "又置壽宮、北宮，張羽旗，設供具，以禮神君。",
          "translations": [
            {
              "lang": "en",
              "text": "One yuan said 'Build Yuan', two yuan with long star said 'Yuan Guang', three yuan with suburban one-horned beast said 'Yuan Shou' and so on.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "神君所言，上使人受書其言，命之曰「畫法」。",
          "translations": [
            {
              "lang": "en",
              "text": "In the next year winter, the emperor offered sacrifices at Yong, discussed saying: 'Now I personally offer sacrifices to heaven, but after earth there is no sacrifice, the rites are not answered.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。",
          "translations": [
            {
              "lang": "en",
              "text": "The officials and Taishi Gong, sacrifice official Kuan Shu and others discussed: 'Heaven and earth sacrificial victims are curled horns, now your majesty personally sacrifices to Houtu, Houtu should be at a round altar of five in the marshes for five altars, altar one yellow calf great livestock tools, after sacrifice all buried, and from sacrifice clothes wore yellow.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "其事祕，世莫知也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the emperor went east, first established Houtu sacrifice at the Fen River bend above, as Kuan Shu and others discussed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The illness will slightly recover, strongly with me meet at Ganquan.' Thereupon the illness recovered, then visited Ganquan, the illness completely well. Great pardon the world, established Shou Palace divine lord. The divine lord most noble was Taiyi, his assistants were called Da Jin, Si Ming and the like, all followed him. Could not be seen, heard his sound, equal to speaking with people. Sometimes went, sometimes came, when came the wind whirled. Lived in chambers and curtains. Sometimes spoke by day, but often by night. The emperor purified, then entered. Because the witch acted as host, controlled diet. What he desired spoke and went down. Also established Shou Palace, Beigong, spread feather flags, set sacrificial tools, to honor the divine lord with rites. The divine lord's words, the emperor had people receive and record his words, named it 'painting method'. His words were common knowledge among the world, had no extraordinary strangeness, yet the emperor alone delighted. His matters were secret, the world did not know. After three years, the officials said Yuan should be named with heavenly omens, not with one two numbers. One yuan said 'Build Yuan', two yuan with long star said 'Yuan Guang', three yuan with suburban one-horned beast said 'Yuan Shou' and so on. In the next year winter, the emperor offered sacrifices at Yong, discussed saying: 'Now I personally offer sacrifices to heaven, but after earth there is no sacrifice, the rites are not answered.' The officials and Taishi Gong, sacrifice official Kuan Shu and others discussed: 'Heaven and earth sacrificial victims are curled horns, now your majesty personally sacrifices to Houtu, Houtu should be at a round altar of five in the marshes for five altars, altar one yellow calf great livestock tools, after sacrifice all buried, and from sacrifice clothes wore yellow.' Thereupon the emperor went east, first established Houtu sacrifice at the Fen River bend above, as Kuan Shu and others discussed.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0093",
          "zh": "其後三年，有司言元宜以天瑞命，不宜以一二數。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor personally looked and bowed like heaven's rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "一元曰建元，二元以長星曰元光，三元以郊得一角獸曰元狩云。",
          "translations": [
            {
              "lang": "en",
              "text": "Rites finished, the emperor went to Chengyang and returned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The emperor personally looked and bowed like heaven's rites. Rites finished, the emperor went to Chengyang and returned.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0095",
          "zh": "其明年冬，天子郊雍，議曰：「今上帝朕親郊，而後土毋祀，則禮不答也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Passed Luoyang, issued edict saying: 'Three dynasties are distant, far away hard to preserve.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。",
          "translations": [
            {
              "lang": "en",
              "text": "With thirty li land enfeoff Zhou descendants as Zhou Zi Nan Jun, to honor former king's sacrifices.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」",
          "translations": [
            {
              "lang": "en",
              "text": "This year, the emperor first patrolled the commanderies and counties, approached Mount Tai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。",
          "translations": [
            {
              "lang": "en",
              "text": "In spring, Yuecheng Marquis submitted memorial about Luan Da.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "上親望拜，如上帝禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Luan Da, Jiaodong palace person, formerly together with Literary General studied, then became Jiaodong King servant of rare things.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "禮畢，天子遂至滎陽而還。",
          "translations": [
            {
              "lang": "en",
              "text": "And Yuecheng Marquis' sister was Kang Wang's queen, had no son.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "過雒陽，下詔曰：「三代邈絕，遠矣難存。",
          "translations": [
            {
              "lang": "en",
              "text": "Kang Wang died, other consort's son established as king.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "其以三十里地封周後為周子南君，以奉先王祀焉。」",
          "translations": [
            {
              "lang": "en",
              "text": "And Kang Queen had lewd conduct, with the king did not get along, endangered each other with law.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "是歲，天子始巡郡縣，侵尋於泰山矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Kang Queen heard Literary General already died, wished to flatter the emperor herself, sent Luan Da through Yuecheng Marquis to seek to see and speak of methods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Passed Luoyang, issued edict saying: 'Three dynasties are distant, far away hard to preserve.' With thirty li land enfeoff Zhou descendants as Zhou Zi Nan Jun, to honor former king's sacrifices. This year, the emperor first patrolled the commanderies and counties, approached Mount Tai. In spring, Yuecheng Marquis submitted memorial about Luan Da. Luan Da, Jiaodong palace person, formerly together with Literary General studied, then became Jiaodong King servant of rare things. And Yuecheng Marquis' sister was Kang Wang's queen, had no son. Kang Wang died, other consort's son established as king. And Kang Queen had lewd conduct, with the king did not get along, endangered each other with law. Kang Queen heard Literary General already died, wished to flatter the emperor herself, sent Luan Da through Yuecheng Marquis to seek to see and speak of methods.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "其春，樂成侯上書言欒大。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor had executed Literary General, afterwards regretted his early death, missed his methods not complete, and saw Luan Da, greatly delighted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。",
          "translations": [
            {
              "lang": "en",
              "text": "Da was a person long and beautiful, spoke many strategies, dared to speak greatly, treated not doubtfully.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "而樂成侯姊為康王后，毋子。",
          "translations": [
            {
              "lang": "en",
              "text": "Da said: 'I often come and go on the sea, saw Anqi, Menmen and the like.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "康王死，他姬子立為王。",
          "translations": [
            {
              "lang": "en",
              "text": "Feared I was lowly, did not believe me.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "而康后有淫行，與王不相中（得），相危以法。",
          "translations": [
            {
              "lang": "en",
              "text": "Also said 'Kang Wang was a feudal lord, not worth giving methods.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。",
          "translations": [
            {
              "lang": "en",
              "text": "I often spoke to Kang Wang, Kang Wang also did not use me.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。",
          "translations": [
            {
              "lang": "en",
              "text": "My teacher said: \"Gold can be made, and the Yellow River can be blocked, immortal medicine can be obtained, immortals can be brought.\"",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "大為人長美，言多方略，而敢為大言，處之不疑。",
          "translations": [
            {
              "lang": "en",
              "text": "I feared imitating Literary General, then fangshi all covered their mouths, dared not speak of methods!'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "大言曰：「臣嘗往來海中，見安期、羨門之屬。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor said: 'Literary General ate horse liver and died.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "顧以為臣賤，不信臣。",
          "translations": [
            {
              "lang": "en",
              "text": "You truly can cultivate his methods, I have no love for it!'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "又以為康王諸侯耳，不足予方。",
          "translations": [
            {
              "lang": "en",
              "text": "Da said: 'My teacher was not seeking people, people sought him.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "臣數言康王，康王又不用臣。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor must desire to bring him, then honor his envoys, let have relatives, treat with guest rites, do not belittle, make each wear his trusted seal, then can make communicate with divine people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』",
          "translations": [
            {
              "lang": "en",
              "text": "Divine people still willing or unwilling.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "臣恐效文成，則方士皆掩口，惡敢言方哉！」",
          "translations": [
            {
              "lang": "en",
              "text": "Will honor his envoys, then can bring.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "上曰：「文成食馬肝死耳。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the emperor made first verify small methods, fighting flags, flags touched each other.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "子誠能修其方，我何愛乎！」",
          "translations": [
            {
              "lang": "en",
              "text": "At this time the emperor worried about Yellow River flooding, and gold not made, appointed Da as Five Profits General.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "大曰：「臣師非有求人，人者求之。",
          "translations": [
            {
              "lang": "en",
              "text": "After more than a month, obtained four gold seals, wore Heaven's Earth General, Big General, Great General, Heaven's Way General seals.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。",
          "translations": [
            {
              "lang": "en",
              "text": "Edict Imperial Secretary: 'Formerly Yu dredged nine rivers, cut four seas.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "神人尚肯邪不邪。",
          "translations": [
            {
              "lang": "en",
              "text": "Recently Yellow River overflowed Gaolu, dikes not ceased.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "致尊其使，然後可致也。」",
          "translations": [
            {
              "lang": "en",
              "text": "I govern the world twenty-eight years, heaven if bestowed I earth then great pass.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "於是上使先驗小方，鬬旗，旗自相觸擊。",
          "translations": [
            {
              "lang": "en",
              "text": "Gan says 'flying dragon', 'gradually to Ban', hoped somewhat with it.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The emperor had executed Literary General, afterwards regretted his early death, missed his methods not complete, and saw Luan Da, greatly delighted. Da was a person long and beautiful, spoke many strategies, dared to speak greatly, treated not doubtfully. Da said: 'I often come and go on the sea, saw Anqi, Menmen and the like.' Feared I was lowly, did not believe me.' Also said 'Kang Wang was a feudal lord, not worth giving methods.' I often spoke to Kang Wang, Kang Wang also did not use me. My teacher said: \"Gold can be made, and the Yellow River can be blocked, immortal medicine can be obtained, immortals can be brought.\" I feared imitating Literary General, then fangshi all covered their mouths, dared not speak of methods!' The emperor said: 'Literary General ate horse liver and died.' You truly can cultivate his methods, I have no love for it!' Da said: 'My teacher was not seeking people, people sought him.' The emperor must desire to bring him, then honor his envoys, let have relatives, treat with guest rites, do not belittle, make each wear his trusted seal, then can make communicate with divine people. Divine people still willing or unwilling.' Will honor his envoys, then can bring.' Thereupon the emperor made first verify small methods, fighting flags, flags touched each other. At this time the emperor worried about Yellow River flooding, and gold not made, appointed Da as Five Profits General. After more than a month, obtained four gold seals, wore Heaven's Earth General, Big General, Great General, Heaven's Way General seals. Edict Imperial Secretary: 'Formerly Yu dredged nine rivers, cut four seas.' Recently Yellow River overflowed Gaolu, dikes not ceased.' I govern the world twenty-eight years, heaven if bestowed I earth then great pass.' Gan says 'flying dragon', 'gradually to Ban', hoped somewhat with it.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "是時上方憂河決，而黃金不就，乃拜大為五利將軍。",
          "translations": [
            {
              "lang": "en",
              "text": "With two thousand households enfeoff earth general Da as Yue Tong Marquis.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。",
          "translations": [
            {
              "lang": "en",
              "text": "Granted noble's house, concubines one thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "制詔御史：「昔禹疏九江，決四瀆。",
          "translations": [
            {
              "lang": "en",
              "text": "Imperial carriage gave away chariots carriages curtains accounts utensils to fill his house.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "閒者河溢皋陸，隄繇不息。",
          "translations": [
            {
              "lang": "en",
              "text": "Also married Changchang Princess to him, gave gold ten thousand jin, changed his county name to Dangli Princess.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "朕臨天下二十有八年，天若遺朕士而大通焉。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor personally went to Five Profits' house.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Envoys visited what given, connected on the roads.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "其以二千戶封地士將軍大為樂通侯。」",
          "translations": [
            {
              "lang": "en",
              "text": "From Da's main subordinates and generals below, all set wine in his house, offered gifts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "賜列侯甲第，僮千人。",
          "translations": [
            {
              "lang": "en",
              "text": "Then the emperor again engraved jade seal saying 'Heaven's Way General', sent envoys wore feather clothes, night stood on white reed above, Five Profits General also wore feather clothes, stood on white reed above received seal, to show not subject.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "乘輿斥車馬帷帳器物以充其家。",
          "translations": [
            {
              "lang": "en",
              "text": "And wearing 'Heaven's Way', moreover for emperor paved way to heavenly gods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。",
          "translations": [
            {
              "lang": "en",
              "text": "Then Five Profits often night sacrificed in his house, wished to bring down spirits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "天子親如五利之第。",
          "translations": [
            {
              "lang": "en",
              "text": "Spirits did not arrive and hundred ghosts gathered, yet could somewhat make them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "使者存問所給，連屬於道。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards prepared travel, east entered sea, sought his teacher.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "自大主將相以下，皆置酒其家，獻遺之。",
          "translations": [
            {
              "lang": "en",
              "text": "Da saw several months, wore six seals, noble shook the world, and Yan Qi between the seas none not grasped and claimed had forbidden methods, could divine immortals.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。",
          "translations": [
            {
              "lang": "en",
              "text": "In summer sixth month, Fenyin witch Jin for common people sacrificed Wei bend Houtu beside camp, saw earth like hook shape, dug examined obtained tripod.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "而佩「天道」者，且為天子道天神也。",
          "translations": [
            {
              "lang": "en",
              "text": "Tripod greatly different from common tripods, pattern engraved without inscription, strange it, reported to officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "於是五利常夜祠其家，欲以下神。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials reported Hedong governor Sheng, Sheng reported to emperor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "神未至而百鬼集矣，然頗能使之。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor sent envoys verified Jin obtained tripod without fraud, then with rites offered sacrifice, welcomed tripod to Ganquan, followed travel, above offered it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "其後治裝行，東入海，求其師云。",
          "translations": [
            {
              "lang": "en",
              "text": "To Zhongshan, warmed food, had yellow cloud cover above.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "大見數月，佩六印，貴振天下，而海上燕齊之閒，莫不搤捥而自言有禁方，能神僊矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Had deer pass, emperor personally shot it, because sacrificed to cloud.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "With two thousand households enfeoff earth general Da as Yue Tong Marquis.' Granted noble's house, concubines one thousand. Imperial carriage gave away chariots carriages curtains accounts utensils to fill his house. Also married Changchang Princess to him, gave gold ten thousand jin, changed his county name to Dangli Princess. The emperor personally went to Five Profits' house. Envoys visited what given, connected on the roads. From Da's main subordinates and generals below, all set wine in his house, offered gifts. Then the emperor again engraved jade seal saying 'Heaven's Way General', sent envoys wore feather clothes, night stood on white reed above, Five Profits General also wore feather clothes, stood on white reed above received seal, to show not subject. And wearing 'Heaven's Way', moreover for emperor paved way to heavenly gods. Then Five Profits often night sacrificed in his house, wished to bring down spirits. Spirits did not arrive and hundred ghosts gathered, yet could somewhat make them. Afterwards prepared travel, east entered sea, sought his teacher. Da saw several months, wore six seals, noble shook the world, and Yan Qi between the seas none not grasped and claimed had forbidden methods, could divine immortals. In summer sixth month, Fenyin witch Jin for common people sacrificed Wei bend Houtu beside camp, saw earth like hook shape, dug examined obtained tripod. Tripod greatly different from common tripods, pattern engraved without inscription, strange it, reported to officials. Officials reported Hedong governor Sheng, Sheng reported to emperor. The emperor sent envoys verified Jin obtained tripod without fraud, then with rites offered sacrifice, welcomed tripod to Ganquan, followed travel, above offered it. To Zhongshan, warmed food, had yellow cloud cover above. Had deer pass, emperor personally shot it, because sacrificed to cloud.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "其夏六月中，汾陰巫錦為民祠魏脽后土營旁，見地如鉤狀，掊視得鼎。",
          "translations": [
            {
              "lang": "en",
              "text": "To Chang'an, dukes and ministers all discussed requesting honor precious tripod.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor said: 'Recently Yellow River overflowed, years several not harvested, thus patrolled sacrificed Houtu, prayed for people to grow grain.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "吏告河東太守勝，勝以聞。",
          "translations": [
            {
              "lang": "en",
              "text": "This year plentiful not yet had report, tripod for what came?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。",
          "translations": [
            {
              "lang": "en",
              "text": "The officials all said: 'Heard formerly great emperor rose divine tripod one, one was one unification, heaven and earth myriad things' final end.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "至中山，晏溫，有黃雲蓋焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor made precious tripod three, resembled heaven man earth.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "有麃過，上自射之，因以祭雲。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu received nine shepherds' metal, cast nine tripods, all once cooked for emperor ghosts gods.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "至長安，公卿大夫皆議請尊寶鼎。",
          "translations": [
            {
              "lang": "en",
              "text": "Met sage then rose, moved to Xia Shang.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhou virtue declined, Song's society lost, tripods then sank and not seen.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "今年豐廡未有報，鼎曷為出哉？」",
          "translations": [
            {
              "lang": "en",
              "text": "Ode says 'from hall to base, from sheep to cattle; tripod cauldron and ding, not worry not fear, whose good fortune'.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now tripod came to Ganquan, luster dragon changed, sustained good fortune without end.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "黃帝作寶鼎三，象天地人也。",
          "translations": [
            {
              "lang": "en",
              "text": "Joined this Zhongshan, had yellow white clouds descend cover, if beasts as symbol, bow arrow multiplied shot, gathered altar below, reported sacrifice great feast.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。",
          "translations": [
            {
              "lang": "en",
              "text": "Received then emperor's heart knew its intention and fitted virtue.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "遭聖則興，遷于夏商。",
          "translations": [
            {
              "lang": "en",
              "text": "Tripod should be seen at ancestral temple, stored in imperial court, to fit bright response.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "周德衰，宋之社亡，鼎乃淪伏而不見。",
          "translations": [
            {
              "lang": "en",
              "text": "Edict said: 'Approved.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "頌云『自堂徂基，自羊徂牛；",
          "translations": [
            {
              "lang": "en",
              "text": "Those entering sea seeking Penglai spoke Penglai not far, yet could not reach, probably did not see its vapors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "鼐鼎及鼒，不虞不驁，胡考之休』。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor then sent hope vapors assistant Hou observed its vapors clouds.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "今鼎至甘泉，光潤龍變，承休無疆。",
          "translations": [
            {
              "lang": "en",
              "text": "This autumn, emperor visited Yong, and offered sacrifices.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。",
          "translations": [
            {
              "lang": "en",
              "text": "Or said 'Five Emperors, Taiyi's assistants.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "惟受命而帝者心知其意而合德焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Should establish Taiyi and emperor personally offer sacrifices to him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "鼎宜見於祖禰，藏於帝廷，以合明應。」",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor doubted undecided.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "制曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "text": "The man from Qi Gongsun Qing said: 'This year obtained precious tripod, its winter Xinsi new moon dawn winter solstice, equal to Yellow Emperor time.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "To Chang'an, dukes and ministers all discussed requesting honor precious tripod. The emperor said: 'Recently Yellow River overflowed, years several not harvested, thus patrolled sacrificed Houtu, prayed for people to grow grain.' This year plentiful not yet had report, tripod for what came?' The officials all said: 'Heard formerly great emperor rose divine tripod one, one was one unification, heaven and earth myriad things' final end.' Yellow Emperor made precious tripod three, resembled heaven man earth.' Yu received nine shepherds' metal, cast nine tripods, all once cooked for emperor ghosts gods.' Met sage then rose, moved to Xia Shang.' Zhou virtue declined, Song's society lost, tripods then sank and not seen.' Ode says 'from hall to base, from sheep to cattle; tripod cauldron and ding, not worry not fear, whose good fortune'.' Now tripod came to Ganquan, luster dragon changed, sustained good fortune without end.' Joined this Zhongshan, had yellow white clouds descend cover, if beasts as symbol, bow arrow multiplied shot, gathered altar below, reported sacrifice great feast.' Received then emperor's heart knew its intention and fitted virtue.' Tripod should be seen at ancestral temple, stored in imperial court, to fit bright response.' Edict said: 'Approved.' Those entering sea seeking Penglai spoke Penglai not far, yet could not reach, probably did not see its vapors. The emperor then sent hope vapors assistant Hou observed its vapors clouds. This autumn, emperor visited Yong, and offered sacrifices. Or said 'Five Emperors, Taiyi's assistants.' Should establish Taiyi and emperor personally offer sacrifices to him. The emperor doubted undecided. The man from Qi Gongsun Qing said: 'This year obtained precious tripod, its winter Xinsi new moon dawn winter solstice, equal to Yellow Emperor time.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0166",
          "zh": "入海求蓬萊者，言蓬萊不遠，而不能至者，殆不見其氣。",
          "translations": [
            {
              "lang": "en",
              "text": "Qu replied: 'Emperor obtained divine omen, this year Ji Chou new moon dawn winter solstice, obtained heaven's order, ended and began again.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "上乃遣望氣佐侯其氣雲。",
          "translations": [
            {
              "lang": "en",
              "text": "Then Yellow Emperor welcomed day pushed omen, after led twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Qu replied: 'Emperor obtained divine omen, this year Ji Chou new moon dawn winter solstice, obtained heaven's order, ended and began again.' Then Yellow Emperor welcomed day pushed omen, after led twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0168",
          "zh": "其秋，上幸雍，且郊。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor ascended to heaven.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "或曰「五帝，泰一之佐也。",
          "translations": [
            {
              "lang": "en",
              "text": "Qing wished to present it accordingly.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "宜立泰一而上親郊之」。",
          "translations": [
            {
              "lang": "en",
              "text": "What was loyal examined his book not orthodox, suspected his wild book, apologized saying: 'Precious tripod matter already decided, moreover what to do!'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "上疑未定。",
          "translations": [
            {
              "lang": "en",
              "text": "Qing through favored person presented it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor greatly delighted, summoned asked Qing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。",
          "translations": [
            {
              "lang": "en",
              "text": "Replied saying: 'Received this book Shen Gong, Shen Gong already died.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor said: 'Shen Gong what person?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。",
          "translations": [
            {
              "lang": "en",
              "text": "Qing said: 'Shen Gong, Qi person.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "黃帝僊登于天。」",
          "translations": [
            {
              "lang": "en",
              "text": "With Anqi Sheng communicated, received Yellow Emperor words, no book, only this tripod book.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "卿因所忠欲奏之。",
          "translations": [
            {
              "lang": "en",
              "text": "Said 'Han rose again when Yellow Emperor time.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」",
          "translations": [
            {
              "lang": "en",
              "text": "Han holy in high emperor's grandson and great-grandson.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "卿因嬖人奏之。",
          "translations": [
            {
              "lang": "en",
              "text": "Precious tripod came out and communicated with spirits, performed Feng Shan.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "上大說，召問卿。",
          "translations": [
            {
              "lang": "en",
              "text": "Feng Shan seven twelve kings, only Yellow Emperor ascended Mount Tai Feng.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "對曰：「受此書申功，申功已死。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shen Gong said: 'Han lord also should ascend Feng, ascend Feng then can ascend heaven immortally.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "上曰：「申功何人也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor time ten thousand feudal lords, yet divine spirits Feng place seven thousand.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "卿曰：「申功，齊人也。",
          "translations": [
            {
              "lang": "en",
              "text": "World famous mountains eight, and three in Man Yi, five in central states.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "與安期生通，受黃帝言，無書，獨有此鼎書。",
          "translations": [
            {
              "lang": "en",
              "text": "Central states Hua Shan, Shou Shan, Tai Shi, Mount Tai, Donglai, this five mountains Yellow Emperor often toured, with spirits met.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "曰『漢興復當黃帝之時。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor and fought and learned immortals.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "漢之聖者在高祖之孫且曾孫也。",
          "translations": [
            {
              "lang": "en",
              "text": "Suffered people not his way, then beheaded cut non ghosts spirits.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "寶鼎出而與神通，封禪。",
          "translations": [
            {
              "lang": "en",
              "text": "One hundred more years then obtained communicate with spirits.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "封禪七十二王，唯黃帝得上泰山封』。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor offered sacrifices at Yong to heaven emperor, stayed three months.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "申功曰：『漢主亦當上封，上封則能僊登天矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Guiyu Qu numbered great swan, died buried Yong, hence swan tomb is.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "黃帝時萬諸侯，而神靈之封居七千。",
          "translations": [
            {
              "lang": "en",
              "text": "His later at Yellow Emperor connected ten thousand spirits bright court.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "天下名山八，而三在蠻夷，五在中國。",
          "translations": [
            {
              "lang": "en",
              "text": "Bright court was Ganquan.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。",
          "translations": [
            {
              "lang": "en",
              "text": "So-called cold gate was valley mouth.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "黃帝且戰且學僊。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor gathered Shou Shan copper, cast tripod Jing Shan below.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "患百姓非其道，乃斷斬非鬼神者。",
          "translations": [
            {
              "lang": "en",
              "text": "Tripod finished, had dragon hung beard lowered welcomed Yellow Emperor.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "百餘歲然後得與神通。",
          "translations": [
            {
              "lang": "en",
              "text": "Yellow Emperor rode on, group ministers back palace from rode dragon seventy more people, went up.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "黃帝郊雍上帝，宿三月。",
          "translations": [
            {
              "lang": "en",
              "text": "Remaining small ministers could not go up, all held dragon beard, dragon beard pulled, fell Yellow Emperor's bow.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "鬼臾區號大鴻，死葬雍，故鴻冢是也。",
          "translations": [
            {
              "lang": "en",
              "text": "People gazed Yellow Emperor already gone up heaven, embraced his bow and dragon beard wailed.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "其後於黃帝接萬靈明廷。",
          "translations": [
            {
              "lang": "en",
              "text": "Hence later generations because named its place Ding Lake, his bow called Wu Hao.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "明廷者，甘泉也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon the emperor said: 'Alas!'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "所謂寒門者，谷口也。",
          "translations": [
            {
              "lang": "en",
              "text": "My truly obtain like Yellow Emperor, I regard abandoning wife children as removing shoes.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "黃帝采首山銅，鑄鼎荊山下。",
          "translations": [
            {
              "lang": "en",
              "text": "Appointed Qing as lang, east sent to await spirits at Tai Shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "鼎既成，有龍垂胡髯下迎黃帝。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor went to Yong, to Longxi, west ascended Kongtong, visited Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered sacrifice officials Kuan Shu and others prepared Taiyi sacrifice altar, altar imitated Bo Ji Taiyi altar, altar three levels.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。",
          "translations": [
            {
              "lang": "en",
              "text": "Five Emperors altars surrounded lived below, Yellow Emperor southwest, except eight paths ghost way.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。",
          "translations": [
            {
              "lang": "en",
              "text": "Taiyi used as Yong one altar objects, and added sweet dates dried meat and such, killed one black cattle as sacrificial stand livestock tools.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "故後世因名其處曰鼎湖，其弓曰烏號。』」",
          "translations": [
            {
              "lang": "en",
              "text": "And Five Emperors alone had sacrificial stand sweet wine advanced.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "於是天子曰：「嗟乎！",
          "translations": [
            {
              "lang": "en",
              "text": "Its below four directions earth for satiation food group gods from and Big Dipper.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "吾誠得如黃帝，吾視去妻子如脫屣耳。」",
          "translations": [
            {
              "lang": "en",
              "text": "After sacrificed, remaining all burned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "乃拜卿為郎，東使候神於太室。",
          "translations": [
            {
              "lang": "en",
              "text": "Its cattle color white, deer in middle, pig in deer, water and soaked it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yellow Emperor ascended to heaven.' Qing wished to present it accordingly. What was loyal examined his book not orthodox, suspected his wild book, apologized saying: 'Precious tripod matter already decided, moreover what to do!' Qing through favored person presented it. The emperor greatly delighted, summoned asked Qing. Replied saying: 'Received this book Shen Gong, Shen Gong already died.' The emperor said: 'Shen Gong what person?' Qing said: 'Shen Gong, Qi person.' With Anqi Sheng communicated, received Yellow Emperor words, no book, only this tripod book.' Said 'Han rose again when Yellow Emperor time.' Han holy in high emperor's grandson and great-grandson.' Precious tripod came out and communicated with spirits, performed Feng Shan.' Feng Shan seven twelve kings, only Yellow Emperor ascended Mount Tai Feng.' Shen Gong said: 'Han lord also should ascend Feng, ascend Feng then can ascend heaven immortally.' Yellow Emperor time ten thousand feudal lords, yet divine spirits Feng place seven thousand.' World famous mountains eight, and three in Man Yi, five in central states.' Central states Hua Shan, Shou Shan, Tai Shi, Mount Tai, Donglai, this five mountains Yellow Emperor often toured, with spirits met.' Yellow Emperor and fought and learned immortals.' Suffered people not his way, then beheaded cut non ghosts spirits.' One hundred more years then obtained communicate with spirits.' Yellow Emperor offered sacrifices at Yong to heaven emperor, stayed three months.' Guiyu Qu numbered great swan, died buried Yong, hence swan tomb is.' His later at Yellow Emperor connected ten thousand spirits bright court.' Bright court was Ganquan.' So-called cold gate was valley mouth.' Yellow Emperor gathered Shou Shan copper, cast tripod Jing Shan below.' Tripod finished, had dragon hung beard lowered welcomed Yellow Emperor.' Yellow Emperor rode on, group ministers back palace from rode dragon seventy more people, went up.' Remaining small ministers could not go up, all held dragon beard, dragon beard pulled, fell Yellow Emperor's bow.' People gazed Yellow Emperor already gone up heaven, embraced his bow and dragon beard wailed.' Hence later generations because named its place Ding Lake, his bow called Wu Hao.' Thereupon the emperor said: 'Alas!' My truly obtain like Yellow Emperor, I regard abandoning wife children as removing shoes.' Appointed Qing as lang, east sent to await spirits at Tai Shi. The emperor went to Yong, to Longxi, west ascended Kongtong, visited Ganquan. Ordered sacrifice officials Kuan Shu and others prepared Taiyi sacrifice altar, altar imitated Bo Ji Taiyi altar, altar three levels. Five Emperors altars surrounded lived below, Yellow Emperor southwest, except eight paths ghost way. Taiyi used as Yong one altar objects, and added sweet dates dried meat and such, killed one black cattle as sacrificial stand livestock tools. And Five Emperors alone had sacrificial stand sweet wine advanced. Its below four directions earth for satiation food group gods from and Big Dipper. After sacrificed, remaining all burned. Its cattle color white, deer in middle, pig in deer, water and soaked it.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0210",
          "zh": "上遂郊雍，至隴西，西登空桐，幸甘泉。",
          "translations": [
            {
              "lang": "en",
              "text": "Sacrificed sun with cattle, sacrificed moon with sheep pig special.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。",
          "translations": [
            {
              "lang": "en",
              "text": "Taiyi sacrificer priest then wore purple and embroidered.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。",
          "translations": [
            {
              "lang": "en",
              "text": "Five Emperors each as their color, sun red, moon white.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。",
          "translations": [
            {
              "lang": "en",
              "text": "Eleventh month Xinsi new moon dawn winter solstice, emperor began offered sacrifices bowed to Taiyi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "而五帝獨有俎豆醴進。",
          "translations": [
            {
              "lang": "en",
              "text": "Dawn bowed sun, dusk bowed moon, then saluted; saw Taiyi like Yong rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "其下四方地，為餟食群神從者及北斗云。",
          "translations": [
            {
              "lang": "en",
              "text": "His feast sacrifice said: 'Heaven again bestowed emperor Taiyuan divine omen, new moon and new moon, ended and began again, emperor respectfully bowed saw.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "已祠，胙餘皆燎之。",
          "translations": [
            {
              "lang": "en",
              "text": "And wore yellow above.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "其牛色白，鹿居其中，彘在鹿中，水而洎之。",
          "translations": [
            {
              "lang": "en",
              "text": "His sacrifice listed fire full altar, altar side cooked boiled had utensils.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "祭日以牛，祭月以羊彘特。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said 'sacrifice had light above'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "泰一祝宰則衣紫及繡。",
          "translations": [
            {
              "lang": "en",
              "text": "Dukes and ministers said 'emperor began offered sacrifices saw Taiyi Yunyang, officials presented jade good livestock offered sacrifice.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "五帝各如其色，日赤，月白。",
          "translations": [
            {
              "lang": "en",
              "text": "This night had beautiful light, and day, yellow air went up connected heaven.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Sacrificed sun with cattle, sacrificed moon with sheep pig special. Taiyi sacrificer priest then wore purple and embroidered. Five Emperors each as their color, sun red, moon white. Eleventh month Xinsi new moon dawn winter solstice, emperor began offered sacrifices bowed to Taiyi. Dawn bowed sun, dusk bowed moon, then saluted; saw Taiyi like Yong rites. His feast sacrifice said: 'Heaven again bestowed emperor Taiyuan divine omen, new moon and new moon, ended and began again, emperor respectfully bowed saw.' And wore yellow above. His sacrifice listed fire full altar, altar side cooked boiled had utensils. Officials said 'sacrifice had light above'. Dukes and ministers said 'emperor began offered sacrifices saw Taiyi Yunyang, officials presented jade good livestock offered sacrifice.' This night had beautiful light, and day, yellow air went up connected heaven.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0221",
          "zh": "十一月辛已朔旦冬至，昧爽，天子始郊拜泰一。",
          "translations": [
            {
              "lang": "en",
              "text": "Taishi Gong, sacrifice official Kuan Shu and others said: 'Divine spirits good fortune blessing prosperity auspicious omens, should because this land light domain established Tai altar to manifest response.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "朝朝日，夕夕月，則揖；",
          "translations": [
            {
              "lang": "en",
              "text": "Made Supreme Scribe lead, autumn and winter between sacrificed.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "而見泰一如雍禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Three years emperor one offered sacrifices saw.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」",
          "translations": [
            {
              "lang": "en",
              "text": "This autumn, for attacking Nanyue, announced prayed Taiyi, with mule painted banner day moon Big Dipper ascended dragon, to resemble heaven one three stars, named 'spirit banner'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "而衣上黃。",
          "translations": [
            {
              "lang": "en",
              "text": "For troops prayed, then Taishi held to point attacked country.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "其祠列火滿壇，壇旁烹炊具。",
          "translations": [
            {
              "lang": "en",
              "text": "And Five Profits General dared not enter sea, went to Mount Tai sacrificed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "有司云「祠上有光焉」。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor sent people secretly followed verified, solid no seen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。",
          "translations": [
            {
              "lang": "en",
              "text": "Five Profits falsely said saw his teacher, his methods all not corresponded.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "是夜有美光，及晝，黃氣上屬天。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor then executed Five Profits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。",
          "translations": [
            {
              "lang": "en",
              "text": "This winter, Gongsun Qing awaited spirits Henan, saw immortal traces Gou Shi city on, had thing like pheasant, came and went city on.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "令太祝領，（祀）［秋］及臘閒祠。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor personally visited Gou Shi city viewed traces.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "三歲天子一郊見。」",
          "translations": [
            {
              "lang": "en",
              "text": "Asked Qing: 'Did not imitate Wen Cheng, Five Profits?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Taishi Gong, sacrifice official Kuan Shu and others said: 'Divine spirits good fortune blessing prosperity auspicious omens, should because this land light domain established Tai altar to manifest response.' Made Supreme Scribe lead, autumn and winter between sacrificed.' Three years emperor one offered sacrifices saw.' This autumn, for attacking Nanyue, announced prayed Taiyi, with mule painted banner day moon Big Dipper ascended dragon, to resemble heaven one three stars, named 'spirit banner'. For troops prayed, then Taishi held to point attacked country. And Five Profits General dared not enter sea, went to Mount Tai sacrificed. Emperor sent people secretly followed verified, solid no seen. Five Profits falsely said saw his teacher, his methods all not corresponded. Emperor then executed Five Profits. This winter, Gongsun Qing awaited spirits Henan, saw immortal traces Gou Shi city on, had thing like pheasant, came and went city on. Emperor personally visited Gou Shi city viewed traces. Asked Qing: 'Did not imitate Wen Cheng, Five Profits?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0234",
          "zh": "其秋，為伐南越，告禱泰一，以牡荊畫幡日月北斗登龍，以象天一三星，為泰一鋒，名曰「靈旗」。",
          "translations": [
            {
              "lang": "en",
              "text": "Their way not slightly wide false, spirits not come.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "為兵禱，則太史奉以指所伐國。",
          "translations": [
            {
              "lang": "en",
              "text": "Said divine matters, matters like absurd far, accumulated years then can obtain.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "而五利將軍使不敢入海，之泰山祠。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon commanderies states each except roads, repaired palaces observatories famous mountains spirits sacrifices hoped lucky.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "上使人微隨驗，實無所見。",
          "translations": [
            {
              "lang": "en",
              "text": "This year, already extinguished Nanyue, emperor had favored minister Li Yanyan with good sound saw.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "五利妄言見其師，其方盡，多不讎。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor good him, below dukes and ministers discussed, said: 'People sacrifices still have drum dance music, now suburban sacrifices and no music, how fitting?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "上乃誅五利。",
          "translations": [
            {
              "lang": "en",
              "text": "Dukes and ministers said: 'Ancient sacrificed heaven earth all had music, while divine spirits could be honored with rites.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Their way not slightly wide false, spirits not come.' Said divine matters, matters like absurd far, accumulated years then can obtain.' Thereupon commanderies states each except roads, repaired palaces observatories famous mountains spirits sacrifices hoped lucky. This year, already extinguished Nanyue, emperor had favored minister Li Yanyan with good sound saw. Emperor good him, below dukes and ministers discussed, said: 'People sacrifices still have drum dance music, now suburban sacrifices and no music, how fitting?' Dukes and ministers said: 'Ancient sacrificed heaven earth all had music, while divine spirits could be honored with rites.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0240",
          "zh": "其冬，公孫卿候神河南，見僊人跡緱氏城上，有物若雉，往來城上。",
          "translations": [
            {
              "lang": "en",
              "text": "Or said: 'Tai Emperor made Su Nu drum fifty stringed lute, grieved, emperor forbade not stop, hence broke his lute as twenty five strings.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "天子親幸緱氏城視跡。",
          "translations": [
            {
              "lang": "en",
              "text": "Thereupon extinguished Nanyue, prayed sacrificed Taiyi, Houtu, began used music dance, moreover summoned song children, made twenty five strings and konghou lute from this began.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "問卿：「得毋效文成、五利乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "His next year winter, emperor discussed saying: 'Ancient first shook arms marshes traveled, then performed Feng Shan.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "卿曰：「僊者非有求人主，人主求之。",
          "translations": [
            {
              "lang": "en",
              "text": "Then went north patrolled Shuofang, restrained soldiers over ten thousand, returned sacrificed Yellow Emperor tomb Qiaoshan, exercised soldiers Xu Ru.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "其道非少寬假，神不來。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor said: 'I heard Yellow Emperor not die, now has tomb, what is?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "言神事，事如迂誕，積以歲乃可致。」",
          "translations": [
            {
              "lang": "en",
              "text": "Or replied: 'Yellow Emperor already ascended heaven, group ministers buried his clothes hat.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "於是郡國各除道，繕治宮觀名山神祠所，以望幸矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Then to Ganquan, wished use matter Mount Tai first similar sacrificed Taiyi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Or said: 'Tai Emperor made Su Nu drum fifty stringed lute, grieved, emperor forbade not stop, hence broke his lute as twenty five strings.' Thereupon extinguished Nanyue, prayed sacrificed Taiyi, Houtu, began used music dance, moreover summoned song children, made twenty five strings and konghou lute from this began. His next year winter, emperor discussed saying: 'Ancient first shook arms marshes traveled, then performed Feng Shan.' Then went north patrolled Shuofang, restrained soldiers over ten thousand, returned sacrificed Yellow Emperor tomb Qiaoshan, exercised soldiers Xu Ru. Emperor said: 'I heard Yellow Emperor not die, now has tomb, what is?' Or replied: 'Yellow Emperor already ascended heaven, group ministers buried his clothes hat.' Then to Ganquan, wished use matter Mount Tai first similar sacrificed Taiyi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0247",
          "zh": "其年，既滅南越，上有嬖臣李延年以好音見。",
          "translations": [
            {
              "lang": "en",
              "text": "From obtained precious tripod, emperor with dukes and ministers scholars discussed Feng Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Feng Shan used rare far apart, not know its rites ceremony, while group scholars gathered Feng Shan Shangshu, Zhou Guan, Wang Zhi hope sacrifice shooting cow matters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」",
          "translations": [
            {
              "lang": "en",
              "text": "Qi man Ding Gong ninety more years, said: 'Feng is unite not die name.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor must desire ascend, gradually ascend then no wind rain, ascended Feng.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "於是塞南越，禱祠泰一、后土，始用樂舞，益召歌兒，作二十五弦及箜篌瑟自此起。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor upon ordered group scholars studied shooting cow, drafted Feng Shan rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "From obtained precious tripod, emperor with dukes and ministers scholars discussed Feng Shan. Feng Shan used rare far apart, not know its rites ceremony, while group scholars gathered Feng Shan Shangshu, Zhou Guan, Wang Zhi hope sacrifice shooting cow matters. Qi man Ding Gong ninety more years, said: 'Feng is unite not die name.' Emperor must desire ascend, gradually ascend then no wind rain, ascended Feng.' Emperor upon ordered group scholars studied shooting cow, drafted Feng Shan rites.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0252",
          "zh": "其來年冬，上議曰：「古者先振兵澤旅，然後封禪。」",
          "translations": [
            {
              "lang": "en",
              "text": "Several years, to about go.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor already heard Gongsun Qing and fangshi words, Yellow Emperor above performed Feng Shan, all brought strange things communicated with spirits, wished imitated Yellow Emperor tried connected immortal people Penglai earth high world compared virtue to nine kings, while much gathered Confucian learning to civilize it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "上曰：「吾聞黃帝不死，今有冢，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Group scholars already could not clearly explain Feng Shan matters, moreover constrained by poetry books ancient literature dared not gallop.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor made Feng sacrifice utensils showed group scholars, group scholars or said 'not same as ancient', Xu Qian again said 'Grand Scribe various scholars performed rites not good as Lu', Zhou Ba belonged to picture Feng matters, then emperor demoted Qian, Ba, altogether dismissed group scholars not used.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "即至甘泉，為且用事泰山，先類祠泰一。",
          "translations": [
            {
              "lang": "en",
              "text": "Third month, went east to Gou Shi, rites ascended central peak Tai Shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Several years, to about go. Emperor already heard Gongsun Qing and fangshi words, Yellow Emperor above performed Feng Shan, all brought strange things communicated with spirits, wished imitated Yellow Emperor tried connected immortal people Penglai earth high world compared virtue to nine kings, while much gathered Confucian learning to civilize it. Group scholars already could not clearly explain Feng Shan matters, moreover constrained by poetry books ancient literature dared not gallop. Emperor made Feng sacrifice utensils showed group scholars, group scholars or said 'not same as ancient', Xu Qian again said 'Grand Scribe various scholars performed rites not good as Lu', Zhou Ba belonged to picture Feng matters, then emperor demoted Qian, Ba, altogether dismissed group scholars not used. Third month, went east to Gou Shi, rites ascended central peak Tai Shi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "自得寶鼎，上與公卿諸生議封禪。",
          "translations": [
            {
              "lang": "en",
              "text": "From officials in mountain below heard if spoke 'ten thousand years'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。",
          "translations": [
            {
              "lang": "en",
              "text": "Asked emperor, emperor not speak; asked below, below not speak.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "齊人丁公年九十餘，曰：「封者，合不死之名也。",
          "translations": [
            {
              "lang": "en",
              "text": "Then with three hundred households enfeoffed Tai Shi honored sacrifice, named Chonggao county.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "秦皇帝不得上封。",
          "translations": [
            {
              "lang": "en",
              "text": "East ascended Mount Tai, mountain grass trees leaves not born, made people ascended stone stood Mount Tai peak.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "陛下必欲上，稍上即無風雨，遂上封矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor went east patrolled sea, rites sacrificed eight gods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "上於是乃令諸儒習射牛，草封禪儀。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi people ascended book spoke divine strange extraordinary methods with ten thousand numbers, yet none verified.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "數年，至且行。",
          "translations": [
            {
              "lang": "en",
              "text": "Moreover sent ships, ordered spoke sea divine mountains many thousand people sought Penglai divine people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。",
          "translations": [
            {
              "lang": "en",
              "text": "Gongsun Qing held tally constantly first awaited famous mountains, to Donglai, said night saw person, long several zhang, approached then not seen, saw his traces very large, resembled bird beast.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。",
          "translations": [
            {
              "lang": "en",
              "text": "Group ministers had said saw old father led dog, said 'I want see great duke', suddenly not seen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "上為封祠器示群儒，群儒或曰「不與古同」，徐偃又曰「太常諸生行禮不如魯善」，周霸屬圖封事，於是上絀偃、霸，盡罷諸儒弗用。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor saw great traces, not believed, and group ministers had said old father, then greatly considered immortal person.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "From officials in mountain below heard if spoke 'ten thousand years'. Asked emperor, emperor not speak; asked below, below not speak. Then with three hundred households enfeoffed Tai Shi honored sacrifice, named Chonggao county. East ascended Mount Tai, mountain grass trees leaves not born, made people ascended stone stood Mount Tai peak. Emperor went east patrolled sea, rites sacrificed eight gods. Qi people ascended book spoke divine strange extraordinary methods with ten thousand numbers, yet none verified. Moreover sent ships, ordered spoke sea divine mountains many thousand people sought Penglai divine people. Gongsun Qing held tally constantly first awaited famous mountains, to Donglai, said night saw person, long several zhang, approached then not seen, saw his traces very large, resembled bird beast. Group ministers had said saw old father led dog, said 'I want see great duke', suddenly not seen. Emperor saw great traces, not believed, and group ministers had said old father, then greatly considered immortal person.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0267",
          "zh": "三月，遂東幸緱氏，禮登中嶽太室。",
          "translations": [
            {
              "lang": "en",
              "text": "Lodged stayed sea, with fangshi carriage and between sent sought immortal people thousand numbers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "從官在山下聞若有言「萬歲」云。",
          "translations": [
            {
              "lang": "en",
              "text": "Fourth month, returned to Fenggao.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "問上，上不言；",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor thought group scholars and fangshi spoke Feng Shan each different, not orthodox, hard implement.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "問下，下不言。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor to Liangfu, rites sacrificed earth lord.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "於是以三百戶封太室奉祠，命曰崇高邑。",
          "translations": [
            {
              "lang": "en",
              "text": "On Yimao day, ordered attendants Confucianists skin hat ribbon, shot cow performed matters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "東上泰山，山之草木葉未生，乃令人上石立之泰山顛。",
          "translations": [
            {
              "lang": "en",
              "text": "Feng Mount Tai below east side, like suburban sacrificed Taiyi rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Lodged stayed sea, with fangshi carriage and between sent sought immortal people thousand numbers. Fourth month, returned to Fenggao. Emperor thought group scholars and fangshi spoke Feng Shan each different, not orthodox, hard implement. Emperor to Liangfu, rites sacrificed earth lord. On Yimao day, ordered attendants Confucianists skin hat ribbon, shot cow performed matters. Feng Mount Tai below east side, like suburban sacrificed Taiyi rites.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0273",
          "zh": "上遂東巡海上，行禮祠八神。",
          "translations": [
            {
              "lang": "en",
              "text": "Feng wide two zhang, high nine chi, its below then had jade book, book secret.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "齊人之上疏言神怪奇方者以萬數，然無驗者。",
          "translations": [
            {
              "lang": "en",
              "text": "Rites finished, emperor alone with attendants carriage Hou ascended Mount Tai, also had Feng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "乃益發船，令言海中神山者數千人求蓬萊神人。",
          "translations": [
            {
              "lang": "en",
              "text": "Its matters all forbidden.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。",
          "translations": [
            {
              "lang": "en",
              "text": "Next day, descended Yin path.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。",
          "translations": [
            {
              "lang": "en",
              "text": "On Bingyin day, Shan Mount Tai below northwest Xu Ran mountain, like sacrificed Houtu rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor all personally bowed saw, wore yellow above all used music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "宿留海上，與方士傳車及閒使求僊人以千數。",
          "translations": [
            {
              "lang": "en",
              "text": "Yangtze Huai between one thatch three backs for divine mat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Feng wide two zhang, high nine chi, its below then had jade book, book secret. Rites finished, emperor alone with attendants carriage Hou ascended Mount Tai, also had Feng. Its matters all forbidden. Next day, descended Yin path. On Bingyin day, Shan Mount Tai below northwest Xu Ran mountain, like sacrificed Houtu rites. Emperor all personally bowed saw, wore yellow above all used music. Yangtze Huai between one thatch three backs for divine mat.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0280",
          "zh": "四月，還至奉高。",
          "translations": [
            {
              "lang": "en",
              "text": "Five colors earth added mixed Feng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "上念諸儒及方士言封禪人人殊，不經，難施行。",
          "translations": [
            {
              "lang": "en",
              "text": "Far sent foreign strange beasts flying birds and white pheasants various things, somewhat added sacrificed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "天子至梁父，禮祠地主。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhi旄 cattle rhinoceros elephant the like not used.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "乙卯，令侍中儒者皮弁薦紳，射牛行事。",
          "translations": [
            {
              "lang": "en",
              "text": "All to Mount Tai then went.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "封泰山下東方，如郊祠泰一之禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Feng Shan sacrificed, its night if had light, day had white cloud rose Feng in.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor from Feng Shan returned, sat bright hall, group ministers again ascended long life.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。",
          "translations": [
            {
              "lang": "en",
              "text": "Then edict Imperial Secretary: 'I with minute body undertake supreme, tremble feared not bear.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "其事皆禁。",
          "translations": [
            {
              "lang": "en",
              "text": "Virtue thin unclear rites music.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "明日，下陰道。",
          "translations": [
            {
              "lang": "en",
              "text": "Sacrificed Taiyi, if had image light, minced like had hoped, depended on strange things, wished stop dared not, ascended Feng Mount Tai, to Liangfu, after Shan Xu Ran.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Renewed, good with officials people began anew, granted people hundred households cattle one wine ten stone, added year eighty widowed orphaned cloth twenty feet.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "天子皆親拜見，衣上黃而盡用樂焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Re Bo, Fenggao, Snake Hill, Lucheng, without paid this year rent.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "江淮閒一茅三脊為神藉。",
          "translations": [
            {
              "lang": "en",
              "text": "Its pardon world, as Yimao pardon order.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "五色土益雜封。",
          "translations": [
            {
              "lang": "en",
              "text": "Travel passed without had re construction.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。",
          "translations": [
            {
              "lang": "en",
              "text": "Matters in two years before, all not listen govern.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "兕旄牛犀象之屬弗用。",
          "translations": [
            {
              "lang": "en",
              "text": "Also issued edict said: 'Ancient emperor five years one patrolled, used matter Mount Tai, feudal lords had court stay ground.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0295",
          "zh": "皆至泰山然後去。",
          "translations": [
            {
              "lang": "en",
              "text": "Its ordered feudal lords each repaired Mount Tai below.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "封禪祠，其夜若有光，晝有白雲起封中。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor already performed Feng Shan Mount Tai, no wind rain disaster, and fangshi again said Penglai various divine mountains if could obtain, then emperor delighted hoped meet it, went east to sea hoped meet Penglai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Five colors earth added mixed Feng. Far sent foreign strange beasts flying birds and white pheasants various things, somewhat added sacrificed. Zhi旄 cattle rhinoceros elephant the like not used. All to Mount Tai then went. Feng Shan sacrificed, its night if had light, day had white cloud rose Feng in. Emperor from Feng Shan returned, sat bright hall, group ministers again ascended long life. Then edict Imperial Secretary: 'I with minute body undertake supreme, tremble feared not bear.' Virtue thin unclear rites music.' Sacrificed Taiyi, if had image light, minced like had hoped, depended on strange things, wished stop dared not, ascended Feng Mount Tai, to Liangfu, after Shan Xu Ran.' Renewed, good with officials people began anew, granted people hundred households cattle one wine ten stone, added year eighty widowed orphaned cloth twenty feet.' Re Bo, Fenggao, Snake Hill, Lucheng, without paid this year rent.' Its pardon world, as Yimao pardon order.' Travel passed without had re construction.' Matters in two years before, all not listen govern.' Also issued edict said: 'Ancient emperor five years one patrolled, used matter Mount Tai, feudal lords had court stay ground.' Its ordered feudal lords each repaired Mount Tai below.' Emperor already performed Feng Shan Mount Tai, no wind rain disaster, and fangshi again said Penglai various divine mountains if could obtain, then emperor delighted hoped meet it, went east to sea hoped meet Penglai.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0297",
          "zh": "天子從封禪還，坐明堂，群臣更上壽。",
          "translations": [
            {
              "lang": "en",
              "text": "Feng carriage Hou sudden illness, one day died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor went to go, and sea, north to Zhishi, patrolled from Liaoxi, traversed north border to Jiuyuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "維德菲薄，不明于禮樂。",
          "translations": [
            {
              "lang": "en",
              "text": "Fifth month, returned to Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said precious tripod came as Yuan Ding, with this year as Yuan Feng first year.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。",
          "translations": [
            {
              "lang": "en",
              "text": "Its autumn, had star brushed east well.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "復博、奉高、蛇丘、歷城，毋出今年租稅。",
          "translations": [
            {
              "lang": "en",
              "text": "After ten more days, had star brushed three able.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "其赦天下，如乙卯赦令。",
          "translations": [
            {
              "lang": "en",
              "text": "Hope vapors Wang Shuo said: 'Waited alone saw its star came out like gourd, ate moment again entered.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "行所過毋有復作。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said: 'Emperor established Han Feng Shan, heaven its repaid virtue star cloud.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "事在二年前，皆勿聽治。」",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year winter, suburban Yong five emperors, returned bowed sacrificed Taiyi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。",
          "translations": [
            {
              "lang": "en",
              "text": "Feasted said: 'Virtue star shone extended, its dimension good fortune auspicious.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "其令諸侯各治邸泰山下。」",
          "translations": [
            {
              "lang": "en",
              "text": "Longevity star again came out, deep shone bright.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Feng carriage Hou sudden illness, one day died. Emperor went to go, and sea, north to Zhishi, patrolled from Liaoxi, traversed north border to Jiuyuan. Fifth month, returned to Ganquan. Officials said precious tripod came as Yuan Ding, with this year as Yuan Feng first year. Its autumn, had star brushed east well. After ten more days, had star brushed three able. Hope vapors Wang Shuo said: 'Waited alone saw its star came out like gourd, ate moment again entered.' Officials said: 'Emperor established Han Feng Shan, heaven its repaid virtue star cloud.' Its next year winter, suburban Yong five emperors, returned bowed sacrificed Taiyi. Feasted said: 'Virtue star shone extended, its dimension good fortune auspicious.' Longevity star again came out, deep shone bright.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0309",
          "zh": "天子既已封禪泰山，無風雨菑，而方士更言蓬萊諸神山若將可得，於是上欣然庶幾遇之，乃復東至海上望，冀遇蓬萊焉。",
          "translations": [
            {
              "lang": "en",
              "text": "And wore yellow above.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "奉車子侯暴病，一日死。",
          "translations": [
            {
              "lang": "en",
              "text": "Its spring, Gongsun Qing said saw divine person Donglai mountain, if 'saw emperor'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor to Gou Shi city, bowed Qing as Zhongda Fu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "五月，返至甘泉。",
          "translations": [
            {
              "lang": "en",
              "text": "Went to Donglai, lodged stayed several days, no seen, saw great person traces.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "有司言寶鼎出為元鼎，以今年為元封元年。",
          "translations": [
            {
              "lang": "en",
              "text": "Again sent fangshi sought divine strange gathered fungus medicine thousand numbers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "And wore yellow above. Its spring, Gongsun Qing said saw divine person Donglai mountain, if 'saw emperor'. Emperor to Gou Shi city, bowed Qing as Zhongda Fu. Went to Donglai, lodged stayed several days, no seen, saw great person traces. Again sent fangshi sought divine strange gathered fungus medicine thousand numbers.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0314",
          "zh": "其秋，有星茀于東井。",
          "translations": [
            {
              "lang": "en",
              "text": "This year drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "後十餘日，有星茀于三能。",
          "translations": [
            {
              "lang": "en",
              "text": "Then emperor already came out no name, prayed ten thousand li sand, passed sacrificed Mount Tai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」",
          "translations": [
            {
              "lang": "en",
              "text": "Returned to Hulu, personally supervised blocked Yellow River, stayed two days, sank sacrificed went.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "有司言曰：「陛下建漢家封禪，天其報德星雲。」",
          "translations": [
            {
              "lang": "en",
              "text": "Sent two envoys led soldiers blocked Yellow River, Yellow River moved two canals, recovered Yu's old traces.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "This year drought. Then emperor already came out no name, prayed ten thousand li sand, passed sacrificed Mount Tai. Returned to Hulu, personally supervised blocked Yellow River, stayed two days, sank sacrificed went. Sent two envoys led soldiers blocked Yellow River, Yellow River moved two canals, recovered Yu's old traces.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0319",
          "zh": "其來年冬，郊雍五帝，還，拜祝祠泰一。",
          "translations": [
            {
              "lang": "en",
              "text": "Formerly Dong'ou king honored ghosts, longevity to one hundred sixty years.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "贊饗曰：「德星昭衍，厥維休祥。",
          "translations": [
            {
              "lang": "en",
              "text": "Later generations lax, hence declined weakened.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "壽星仍出，淵耀光明。",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered Yue witches established Yue prayers, calmed platform no altar, also sacrificed heaven god hundred ghosts, and used chicken divination.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "信星昭見，皇帝敬拜泰祝之饗。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor believed it, Yue prayers chicken divination from this began used.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Formerly Dong'ou king honored ghosts, longevity to one hundred sixty years.' Later generations lax, hence declined weakened.' Ordered Yue witches established Yue prayers, calmed platform no altar, also sacrificed heaven god hundred ghosts, and used chicken divination. Emperor believed it, Yue prayers chicken divination from this began used.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0324",
          "zh": "其春，公孫卿言見神人東萊山，若云「見天子」。",
          "translations": [
            {
              "lang": "en",
              "text": "Now emperor can make pavilion like Gou Shi city, placed dried meat dates, divine people should be able brought.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "天子於是幸緱氏城，拜卿為中大夫。",
          "translations": [
            {
              "lang": "en",
              "text": "And immortals good tower residence.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "遂至東萊，宿留之數日，毋所見，見大人跡。",
          "translations": [
            {
              "lang": "en",
              "text": "Then emperor ordered Chang'an then made flying eaves Gui pavilion, Ganquan then made Yi Shou pavilion, made Qing held tally set tools awaited divine people, made Tongtian stage, placed sacrifice tools its below, wished attract divine immortal kind.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "復遣方士求神怪采芝藥以千數。",
          "translations": [
            {
              "lang": "en",
              "text": "Then Ganquan changed front hall, began broadened various palace chambers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "是歲旱。",
          "translations": [
            {
              "lang": "en",
              "text": "Summer, had fungus born hall defense inner.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "於是天子既出毋名，乃禱萬里沙，過祠泰山。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor for blocked Yellow River, rose Tongtian stage, if had light clouds, issued edict said: 'Ganquan defense born fungus nine stems, pardon world, no had re construction.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "還至瓠子，自臨塞決河，留二日，沈祠而去。",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year, attacked Goguryeo.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "使二卿將卒塞決河，河徙二渠，復禹之故跡焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Summer, drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Now emperor can make pavilion like Gou Shi city, placed dried meat dates, divine people should be able brought.' And immortals good tower residence.' Then emperor ordered Chang'an then made flying eaves Gui pavilion, Ganquan then made Yi Shou pavilion, made Qing held tally set tools awaited divine people, made Tongtian stage, placed sacrifice tools its below, wished attract divine immortal kind. Then Ganquan changed front hall, began broadened various palace chambers. Summer, had fungus born hall defense inner. Emperor for blocked Yellow River, rose Tongtian stage, if had light clouds, issued edict said: 'Ganquan defense born fungus nine stems, pardon world, no had re construction.' Its next year, attacked Goguryeo. Summer, drought.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0332",
          "zh": "是時既滅南越，越人勇之乃言「越人俗信鬼，而其祠皆見鬼，數有效。",
          "translations": [
            {
              "lang": "en",
              "text": "Gongsun Qing said: 'Yellow Emperor time performed Feng then heaven drought, dry Feng three years.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "昔東甌王敬鬼，壽至百六十歲。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor issued edict said: 'Heaven drought, intention dry Feng?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "後世謾怠，故衰秏」。",
          "translations": [
            {
              "lang": "en",
              "text": "Its ordered world honored sacrificed spirit star.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year, emperor suburban Yong, through Hui back road, patrolled it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "上信之，越祠雞卜始用焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Spring, to Mingze, from west river returned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gongsun Qing said: 'Yellow Emperor time performed Feng then heaven drought, dry Feng three years.' Emperor issued edict said: 'Heaven drought, intention dry Feng?' Its ordered world honored sacrificed spirit star.' Its next year, emperor suburban Yong, through Hui back road, patrolled it. Spring, to Mingze, from west river returned.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0337",
          "zh": "公孫卿曰：「僊人可見，而上往常遽，以故不見。",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year winter, emperor patrolled south commandery, to Jiangling east.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。",
          "translations": [
            {
              "lang": "en",
              "text": "Ascended rites submerged heaven pillar mountain, honored said Nanyue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "且僊人好樓居。」",
          "translations": [
            {
              "lang": "en",
              "text": "Floated Yangtze, from Xunyang came out Congyang, passed Pengli, sacrificed its name mountains rivers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。",
          "translations": [
            {
              "lang": "en",
              "text": "North to Langye, and sea.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "於是甘泉更置前殿，始廣諸宮室。",
          "translations": [
            {
              "lang": "en",
              "text": "Fourth month, to Fenggao repaired Feng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "夏，有芝生殿防內中。",
          "translations": [
            {
              "lang": "en",
              "text": "Early, emperor Feng Mount Tai, Mount Tai east north foot ancient had bright hall place, place dangerous not flat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "天子為塞河，興通天臺，若有光雲，乃下詔曰：「甘泉防生芝九莖，赦天下，毋有復作。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor wished treated bright hall Fenggao side, not clear its structure.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Its next year winter, emperor patrolled south commandery, to Jiangling east. Ascended rites submerged heaven pillar mountain, honored said Nanyue. Floated Yangtze, from Xunyang came out Congyang, passed Pengli, sacrificed its name mountains rivers. North to Langye, and sea. Fourth month, to Fenggao repaired Feng. Early, emperor Feng Mount Tai, Mount Tai east north foot ancient had bright hall place, place dangerous not flat. Emperor wished treated bright hall Fenggao side, not clear its structure.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0345",
          "zh": "其明年，伐朝鮮。",
          "translations": [
            {
              "lang": "en",
              "text": "Bright hall picture middle had one hall, four sides no walls, with thatch covered, through water, round palace wall as compound way, upper had tower, from southwest entered, named Kunlun, emperor from it entered, bowed sacrificed heaven emperor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "夏，旱。",
          "translations": [
            {
              "lang": "en",
              "text": "Then emperor ordered Fenggao made bright hall Wen above, like belt picture.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "公孫卿曰：「黃帝時封則天旱，乾封三年。」",
          "translations": [
            {
              "lang": "en",
              "text": "And five years repaired Feng, sacrificed Taiyi, five emperors at bright hall upper seat, ordered high emperor sacrificed seat opposite it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "上乃下詔曰：「天旱，意乾封乎？",
          "translations": [
            {
              "lang": "en",
              "text": "Sacrificed Houtu at lower house, with twenty great livestock.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "其令天下尊祠靈星焉。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor from Kunlun way entered, began bowed bright hall like suburban rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Bright hall picture middle had one hall, four sides no walls, with thatch covered, through water, round palace wall as compound way, upper had tower, from southwest entered, named Kunlun, emperor from it entered, bowed sacrificed heaven emperor. Then emperor ordered Fenggao made bright hall Wen above, like belt picture. And five years repaired Feng, sacrificed Taiyi, five emperors at bright hall upper seat, ordered high emperor sacrificed seat opposite it. Sacrificed Houtu at lower house, with twenty great livestock. Emperor from Kunlun way entered, began bowed bright hall like suburban rites.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0351",
          "zh": "其明年，上郊雍，通回中道，巡之。",
          "translations": [
            {
              "lang": "en",
              "text": "And emperor again ascended Mount Tai, had secret sacrifice its peak.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "春，至鳴澤，從西河歸。",
          "translations": [
            {
              "lang": "en",
              "text": "And Mount Tai below sacrificed five emperors, each as their direction, Yellow Emperor and Red Emperor, and officials attended sacrificed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "And emperor again ascended Mount Tai, had secret sacrifice its peak. And Mount Tai below sacrificed five emperors, each as their direction, Yellow Emperor and Red Emperor, and officials attended sacrificed.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0353",
          "zh": "其明年冬，上巡南郡，至江陵而東。",
          "translations": [
            {
              "lang": "en",
              "text": "Mount Tai upper raised fire, below all responded it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "登禮潛之天柱山，號曰南嶽。",
          "translations": [
            {
              "lang": "en",
              "text": "Its later two years, eleventh month Jiazi new moon dawn winter solstice, pushed calendar with this system.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor personally to Mount Tai, with eleventh month Jiazi new moon dawn winter solstice day sacrificed heaven emperor bright hall, each repaired Feng Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "北至瑯邪，并海上。",
          "translations": [
            {
              "lang": "en",
              "text": "Its feasted said: 'Heaven increased bestowed emperor Taiyuan divine omen, week and repeated, ended and began again.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0357",
          "zh": "四月中，至奉高修封焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor respectfully bowed Taiyi.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Mount Tai upper raised fire, below all responded it. Its later two years, eleventh month Jiazi new moon dawn winter solstice, pushed calendar with this system. Emperor personally to Mount Tai, with eleventh month Jiazi new moon dawn winter solstice day sacrificed heaven emperor bright hall, each repaired Feng Shan. Its feasted said: 'Heaven increased bestowed emperor Taiyuan divine omen, week and repeated, ended and began again.' Emperor respectfully bowed Taiyi.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0358",
          "zh": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
          "translations": [
            {
              "lang": "en",
              "text": "East to sea, examined entered sea and fangshi sought divine verified none, yet increased sent, hoped encounter it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "上欲治明堂奉高旁，未曉其制度。",
          "translations": [
            {
              "lang": "en",
              "text": "Eleventh month Yiyou, Bailiang disaster.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "濟南人公玊帶上黃帝時明堂圖。",
          "translations": [
            {
              "lang": "en",
              "text": "Twelfth month Jiawu new moon, emperor personally Shan Gaoli, sacrificed Houtu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0361",
          "zh": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Viewed Bohai, wished sacrifice Penglai kind, hoped to special court.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "於是上令奉高作明堂汶上，如帶圖。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor returned, with Bailiang disaster reason, court received account Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。",
          "translations": [
            {
              "lang": "en",
              "text": "Gongsun Qing said: 'Yellow Emperor approached green spirit platform, twelve days burned, Yellow Emperor made bright court.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0364",
          "zh": "祠后土於下房，以二十太牢。",
          "translations": [
            {
              "lang": "en",
              "text": "Bright court, Ganquan.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0365",
          "zh": "天子從昆侖道入，始拜明堂如郊禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Fangshi many said ancient emperor king had capital Ganquan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0366",
          "zh": "禮畢，燎堂下。",
          "translations": [
            {
              "lang": "en",
              "text": "Its later emperor again court feudal lords Ganquan, Ganquan made feudal lords lodges.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0367",
          "zh": "而上又上泰山，有祕祠其顛。",
          "translations": [
            {
              "lang": "en",
              "text": "Yong admonished said: 'Yue customs have fire disaster, repeat rise house must with big, used overcome it.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Then made Jianzhang palace, measured as thousand gates ten thousand households.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "泰山上舉火，下悉應之。",
          "translations": [
            {
              "lang": "en",
              "text": "Front hall measured high not Weiyang, its east Fengque, high over twenty zhang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "East to sea, examined entered sea and fangshi sought divine verified none, yet increased sent, hoped encounter it. Eleventh month Yiyou, Bailiang disaster. Twelfth month Jiawu new moon, emperor personally Shan Gaoli, sacrificed Houtu. Viewed Bohai, wished sacrifice Penglai kind, hoped to special court. Emperor returned, with Bailiang disaster reason, court received account Ganquan. Gongsun Qing said: 'Yellow Emperor approached green spirit platform, twelve days burned, Yellow Emperor made bright court.' Bright court, Ganquan.' Fangshi many said ancient emperor king had capital Ganquan. Its later emperor again court feudal lords Ganquan, Ganquan made feudal lords lodges. Yong admonished said: 'Yue customs have fire disaster, repeat rise house must with big, used overcome it.' Then made Jianzhang palace, measured as thousand gates ten thousand households. Front hall measured high not Weiyang, its east Fengque, high over twenty zhang.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0370",
          "zh": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
          "translations": [
            {
              "lang": "en",
              "text": "Its west Tangzhong, several ten li tiger circle.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。",
          "translations": [
            {
              "lang": "en",
              "text": "Its north treated big pool, gradual platform high over twenty zhang, named Taiye pool, middle had Penglai, Fangzhang, Yingzhou, Hulu, resembled sea divine mountain turtle fish kind.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0372",
          "zh": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。",
          "translations": [
            {
              "lang": "en",
              "text": "Its south had Yutang, Bi men, big bird kind.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "皇帝敬拜泰一。」",
          "translations": [
            {
              "lang": "en",
              "text": "Established divine bright tower, Jinggan building, measured fifty over zhang, carriage way mutually connected.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。",
          "translations": [
            {
              "lang": "en",
              "text": "Summer, Han changed calendar, with first month as year head, while color upper yellow, official name changed seals with five characters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Its west Tangzhong, several ten li tiger circle. Its north treated big pool, gradual platform high over twenty zhang, named Taiye pool, middle had Penglai, Fangzhang, Yingzhou, Hulu, resembled sea divine mountain turtle fish kind. Its south had Yutang, Bi men, big bird kind. Established divine bright tower, Jinggan building, measured fifty over zhang, carriage way mutually connected. Summer, Han changed calendar, with first month as year head, while color upper yellow, official name changed seals with five characters.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0375",
          "zh": "十一月乙酉，柏梁災。",
          "translations": [
            {
              "lang": "en",
              "text": "Because too first year.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0376",
          "zh": "十二月甲午朔，上親禪高里，祠后土。",
          "translations": [
            {
              "lang": "en",
              "text": "This year, west attacked Dayuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0377",
          "zh": "臨渤海，將以望祠蓬萊之屬，冀至殊庭焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Locusts great arose.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Because too first year. This year, west attacked Dayuan. Locusts great arose.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0378",
          "zh": "上還，以柏梁災故，朝受計甘泉。",
          "translations": [
            {
              "lang": "en",
              "text": "Ding wife, Luoyang Yu Chu and others with methods sacrificed cursed Xiongnu, Dayuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0379",
          "zh": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year, officials said Yong five altars no livestock mature fragrance not prepared.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0380",
          "zh": "明庭，甘泉也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered sacrifice officials advanced altar calves livestock tools, five colors food what overcome, and with wood horse replaced foal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0381",
          "zh": "方士多言古帝王有都甘泉者。",
          "translations": [
            {
              "lang": "en",
              "text": "Only five emperors used foal, walked close suburban used foal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0382",
          "zh": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
          "translations": [
            {
              "lang": "en",
              "text": "And various famous mountains rivers used foal places, all with wood horse replaced.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0383",
          "zh": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Walked over, then used foal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "於是作建章宮，度為千門萬戶。",
          "translations": [
            {
              "lang": "en",
              "text": "Other rites as old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0385",
          "zh": "前殿度高未央，其東則鳳闕，高二十餘丈。",
          "translations": [
            {
              "lang": "en",
              "text": "Its next year, east patrolled sea, examined divine immortal kind, not had verification.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "其西則唐中，數十里虎圈。",
          "translations": [
            {
              "lang": "en",
              "text": "Fangshi said 'Yellow Emperor time made five cities twelve towers, to await divine people at Zhi period, named welcome year'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0387",
          "zh": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor approved made as method, named Ming Nian.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0388",
          "zh": "其南有玉堂、璧門、大鳥之屬。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor personally rites sacrificed heaven emperor, wore yellow above.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "乃立神明臺、井幹樓，度五十餘丈，輦道相屬焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Gong Tu said: 'Yellow Emperor time though Feng Mount Tai, yet after travel, Feng Ju ordered Yellow Emperor Feng east Mount Tai, Shan Fan Shan united symbols, then not died.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Ding wife, Luoyang Yu Chu and others with methods sacrificed cursed Xiongnu, Dayuan. Its next year, officials said Yong five altars no livestock mature fragrance not prepared. Ordered sacrifice officials advanced altar calves livestock tools, five colors food what overcome, and with wood horse replaced foal. Only five emperors used foal, walked close suburban used foal. And various famous mountains rivers used foal places, all with wood horse replaced. Walked over, then used foal. Other rites as old. Its next year, east patrolled sea, examined divine immortal kind, not had verification. Fangshi said 'Yellow Emperor time made five cities twelve towers, to await divine people at Zhi period, named welcome year'. Emperor approved made as method, named Ming Nian. Emperor personally rites sacrificed heaven emperor, wore yellow above. Gong Tu said: 'Yellow Emperor time though Feng Mount Tai, yet after travel, Feng Ju ordered Yellow Emperor Feng east Mount Tai, Shan Fan Shan united symbols, then not died.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0390",
          "zh": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor already ordered set sacrifice tools, to east Mount Tai, east Mount Tai low small, not match its voice, ordered sacrifice officials rites honored it, not Feng Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "因為太初元年。",
          "translations": [
            {
              "lang": "en",
              "text": "Its later ordered belt honored sacrifice awaited divine matters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0392",
          "zh": "是歲，西伐大宛。",
          "translations": [
            {
              "lang": "en",
              "text": "Summer, went Mount Tai, repaired five years rites as before, added Shan sacrifice Shique.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0393",
          "zh": "蝗大起。",
          "translations": [
            {
              "lang": "en",
              "text": "Shique, Mount Tai below foot south side, fangshi many said this immortal gate, hence emperor personally Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor already ordered set sacrifice tools, to east Mount Tai, east Mount Tai low small, not match its voice, ordered sacrifice officials rites honored it, not Feng Shan. Its later ordered belt honored sacrifice awaited divine matters. Summer, went Mount Tai, repaired five years rites as before, added Shan sacrifice Shique. Shique, Mount Tai below foot south side, fangshi many said this immortal gate, hence emperor personally Shan. Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0395",
          "zh": "其明年，有司言雍五畤無牢熟具，芬芳不備。",
          "translations": [
            {
              "lang": "en",
              "text": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "獨五帝用駒，行親郊用駒。",
          "translations": [
            {
              "lang": "en",
              "text": "Altogether six sacrifices, all Supreme Scribe led.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0398",
          "zh": "及諸名山川用駒者，悉以木禺馬代。",
          "translations": [
            {
              "lang": "en",
              "text": "To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0399",
          "zh": "行過，乃用駒。",
          "translations": [
            {
              "lang": "en",
              "text": "Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0400",
          "zh": "他禮如故。",
          "translations": [
            {
              "lang": "en",
              "text": "Other sacrifices all as its old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng. Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites. Altogether six sacrifices, all Supreme Scribe led. To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended. Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led. Other sacrifices all as its old.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0401",
          "zh": "其明年，東巡海上，考神僊之屬，未有驗者。",
          "translations": [
            {
              "lang": "en",
              "text": "Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0402",
          "zh": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。",
          "translations": [
            {
              "lang": "en",
              "text": "And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0403",
          "zh": "上許作之如方，名曰明年。",
          "translations": [
            {
              "lang": "en",
              "text": "And Gongsun Qing awaited divine, still with great person traces solved, no its effect.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0404",
          "zh": "上親禮祠上帝，衣上黃焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas. And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification. And Gongsun Qing awaited divine, still with great person traces solved, no its effect. Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0405",
          "zh": "公玊帶曰：「黃帝時雖封泰山，然風后、封鉅、岐伯令黃帝封東泰山，禪凡山合符，然後不死焉。」",
          "translations": [
            {
              "lang": "en",
              "text": "From this after, fangshi spoke sacrifice divine many, yet its effect could see.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0406",
          "zh": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0407",
          "zh": "其後令帶奉祠候神物。",
          "translations": [
            {
              "lang": "en",
              "text": "Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0408",
          "zh": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。",
          "translations": [
            {
              "lang": "en",
              "text": "After have gentleman, can view it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0409",
          "zh": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。",
          "translations": [
            {
              "lang": "en",
              "text": "To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "From this after, fangshi spoke sacrifice divine many, yet its effect could see. Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan. Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside. After have gentleman, can view it. To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0410",
          "zh": "其後五年，復至泰山修封，還過祭常山。",
          "translations": [
            {
              "lang": "en",
              "text": "Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0411",
          "zh": "今天子所興祠，泰一、后土，三年親郊祠，建漢家封禪，五年一修封。",
          "translations": [
            {
              "lang": "en",
              "text": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0412",
          "zh": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0413",
          "zh": "凡六祠，皆太祝領之。",
          "translations": [
            {
              "lang": "en",
              "text": "Altogether six sacrifices, all Supreme Scribe led.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0414",
          "zh": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。",
          "translations": [
            {
              "lang": "en",
              "text": "To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0415",
          "zh": "方士所興祠，各自主，其人終則已，祠官弗主。",
          "translations": [
            {
              "lang": "en",
              "text": "Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0416",
          "zh": "他祠皆如其故。",
          "translations": [
            {
              "lang": "en",
              "text": "Other sacrifices all as its old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0417",
          "zh": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0418",
          "zh": "而方士之候祠神人，入海求蓬萊，終無有驗。",
          "translations": [
            {
              "lang": "en",
              "text": "And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0419",
          "zh": "而公孫卿之候神者，猶以大人跡為解，無其效。",
          "translations": [
            {
              "lang": "en",
              "text": "And Gongsun Qing awaited divine, still with great person traces solved, no its effect.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0420",
          "zh": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0421",
          "zh": "自此之後，方士言祠神者彌眾，然其效可睹矣。",
          "translations": [
            {
              "lang": "en",
              "text": "From this after, fangshi spoke sacrifice divine many, yet its effect could see.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng. Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites. Altogether six sacrifices, all Supreme Scribe led. To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended. Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led. Other sacrifices all as its old. Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas. And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification. And Gongsun Qing awaited divine, still with great person traces solved, no its effect. Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true. From this after, fangshi spoke sacrifice divine many, yet its effect could see.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0422",
          "zh": "太史公曰：余從巡祭天地諸神名山川而封禪焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0423",
          "zh": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。",
          "translations": [
            {
              "lang": "en",
              "text": "Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0424",
          "zh": "後有君子，得以覽焉。",
          "translations": [
            {
              "lang": "en",
              "text": "After have gentleman, can view it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0425",
          "zh": "至若俎豆珪幣之詳，獻酬之禮，則有司存焉。",
          "translations": [
            {
              "lang": "en",
              "text": "To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan. Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside. After have gentleman, can view it. To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}