{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "012",
    "url": "https://chinesenotes.com/shiji/shiji012.html",
    "title": {
      "zh": "孝武本紀",
      "en": "Basic Annals of Emperor Xiaowu",
      "raw": "《孝武本紀》 Annals of the Xiaowu Emperor"
    },
    "sentenceCount": 418,
    "translatedCount": 329,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-21T15:55:06.209Z",
    "translators": [
      {
        "name": "AI",
        "paragraphs": 52,
        "sentences": 329
      }
    ],
    "citation": "Translation: AI"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝武皇帝者，孝景中子也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Wu emperor, Filial Jing middle son also.",
              "idiomatic": "Emperor Xiaowu was Emperor Xiaojing's middle son.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "母曰王太后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Mother called Wang Empress Dowager.",
              "idiomatic": "His mother was called Empress Dowager Wang.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "孝景四年，以皇子為膠東王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing fourth year, with imperial son as Jiaodong King.",
              "idiomatic": "In Emperor Xiaojing's fourth year, he was made King of Jiaodong as an imperial son.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing seventh year, Li Crown Prince deposed as Linjiang King, with Jiaodong King as Crown Prince.",
              "idiomatic": "In Emperor Xiaojing's seventh year, Crown Prince Li was deposed to become King of Linjiang, and the King of Jiaodong was made Crown Prince.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "孝景十六年崩，太子即位，為孝武皇帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing sixteenth year collapsed, Crown Prince ascended throne, became Filial Wu emperor.",
              "idiomatic": "Emperor Xiaojing collapsed in the sixteenth year. The Crown Prince ascended the throne and became Emperor Xiaowu.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "孝武皇帝初即位，尤敬鬼神之祀。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Wu emperor initial ascension, especially respected ghosts spirits sacrifices.",
              "idiomatic": "When Emperor Xiaowu first ascended the throne, he especially respected the sacrifices to ghosts and spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Xiaowu was Emperor Xiaojing's middle son. His mother was called Empress Dowager Wang. In Emperor Xiaojing's fourth year, he was made King of Jiaodong as an imperial son. In Emperor Xiaojing's seventh year, Crown Prince Li was deposed to become King of Linjiang, and the King of Jiaodong was made Crown Prince. Emperor Xiaojing collapsed in the sixteenth year. The Crown Prince ascended the throne and became Emperor Xiaowu. When Emperor Xiaowu first ascended the throne, he especially respected the sacrifices to ghosts and spirits.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0007",
          "zh": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
          "translations": [
            {
              "lang": "en",
              "literal": "First year, Han rising already sixty remaining years, realm pacified peaceful, scholar official kind all hoped Son of Heaven fengshan correct calendar measures.",
              "idiomatic": "In the first year, the Han had risen already over sixty years. The realm was pacified and peaceful. All the scholar-officials hoped the Son of Heaven would perform the fengshan ceremony and correct the calendar measures.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "And emperor favored Confucian arts, recruited worthy good, Zhao Wan, Wang Zang etc. with literature as ministers, wished discuss ancient establish Bright Hall south of city, to receive feudal lords.",
              "idiomatic": "The emperor favored Confucian arts and recruited the worthy and good. Zhao Wan, Wang Zang, and others became ministers through literature. They wished to discuss the ancient practice of establishing a Bright Hall south of the city to receive the feudal lords.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "草巡狩封禪改歷服色事未就。",
          "translations": [
            {
              "lang": "en",
              "literal": "Draft imperial tours fengshan change calendar clothing colors matters not completed.",
              "idiomatic": "The matters of drafting imperial tours, fengshan ceremonies, changing the calendar, and clothing colors were not completed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。",
          "translations": [
            {
              "lang": "en",
              "literal": "Met Empress Dowager Dou governed Huang Lao teachings, not liked Confucian arts, made person secretly obtained Zhao Wan etc. illicit profit matters, summoned investigated Wan, Zang, Wan, Zang committed suicide, all things they promoted all abolished.",
              "idiomatic": "Empress Dowager Dou governed with Huang-Lao teachings and did not like Confucian arts. She had someone secretly obtain evidence of Zhao Wan and others' illicit profits, summoned and investigated Wan and Zang. Wan and Zang committed suicide. All the things they had promoted were abolished.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first year, the Han had risen already over sixty years. The realm was pacified and peaceful. All the scholar-officials hoped the Son of Heaven would perform the fengshan ceremony and correct the calendar measures. The emperor favored Confucian arts and recruited the worthy and good. Zhao Wan, Wang Zang, and others became ministers through literature. They wished to discuss the ancient practice of establishing a Bright Hall south of the city to receive the feudal lords. The matters of drafting imperial tours, fengshan ceremonies, changing the calendar, and clothing colors were not completed. Empress Dowager Dou governed with Huang-Lao teachings and did not like Confucian arts. She had someone secretly obtain evidence of Zhao Wan and others' illicit profits, summoned and investigated Wan and Zang. Wan and Zang committed suicide. All the things they had promoted were abolished.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "後六年，竇太后崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "After six years, Dou Empress Dowager collapsed.",
              "idiomatic": "After six years, Empress Dowager Dou collapsed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "其明年，上徵文學之士公孫弘等。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, emperor summoned literature scholars Gongsun Hong etc.",
              "idiomatic": "The next year, the emperor summoned scholars of literature like Gongsun Hong.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After six years, Empress Dowager Dou collapsed. The next year, the emperor summoned scholars of literature like Gongsun Hong.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "明年，上初至雍，郊見五畤。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, emperor first arrived Yong, suburban audience five altars.",
              "idiomatic": "The next year, the emperor first arrived at Yong and performed suburban audience at the five altars.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "後常三歲一郊。",
          "translations": [
            {
              "lang": "en",
              "literal": "Afterwards regularly three years one suburban sacrifice.",
              "idiomatic": "Afterwards, he regularly performed suburban sacrifices every three years.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "是時上求神君，捨之上林中蹄氏觀。",
          "translations": [
            {
              "lang": "en",
              "literal": "This time emperor sought divine lord, lodged in Shanglin middle Ti clan observation.",
              "idiomatic": "At this time, the emperor sought the divine lord and lodged at the Ti clan observation in the middle of Shanglin.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
          "translations": [
            {
              "lang": "en",
              "literal": "Divine lord, Changling woman, because son died sorrowful sorrow, therefore saw spirit at husband Wan Ruo.",
              "idiomatic": "The divine lord was a woman from Changling. Because her son died and she was sorrowful, she therefore saw a spirit that resembled her deceased husband Wan Ruo.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "宛若祠之其室，民多往祠。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wan Ruo sacrificed to her room, people many went sacrificed.",
              "idiomatic": "Wan Ruo sacrificed to her in her room. Many people went to sacrifice there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "平原君往祠，其後子孫以尊顯。",
          "translations": [
            {
              "lang": "en",
              "literal": "Pingyuan Jun went sacrificed, his later descendants with honor illustrious.",
              "idiomatic": "The Lord of Pingyuan went to sacrifice there. His later descendants became honored and illustrious.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
          "translations": [
            {
              "lang": "en",
              "literal": "When Wudi ascended throne, then thick ritual placed sacrifice in inner palace, heard her words, not saw her person say.",
              "idiomatic": "When Emperor Wu ascended the throne, he then placed her with thick ritual in the inner palace for sacrifice. One heard her words but did not see her person, it is said.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, the emperor first arrived at Yong and performed suburban audience at the five altars. Afterwards, he regularly performed suburban sacrifices every three years. At this time, the emperor sought the divine lord and lodged at the Ti clan observation in the middle of Shanglin. The divine lord was a woman from Changling. Because her son died and she was sorrowful, she therefore saw a spirit that resembled her deceased husband Wan Ruo. Wan Ruo sacrificed to her in her room. Many people went to sacrifice there. The Lord of Pingyuan went to sacrifice there. His later descendants became honored and illustrious. When Emperor Wu ascended the throne, he then placed her with thick ritual in the inner palace for sacrifice. One heard her words but did not see her person, it is said.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0020",
          "zh": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
          "translations": [
            {
              "lang": "en",
              "literal": "This time Li Shaogun also with sacrificed stove, grain way, dispel old methods saw emperor, emperor honored him.",
              "idiomatic": "At this time, Li Shaogun also appeared before the emperor with methods of sacrificing to the stove, grain immortality, and dispelling old age. The emperor honored him.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "少君者，故深澤侯入以主方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Shaogun, former Shenze Hou person with main methods.",
              "idiomatic": "Shaogun was a person from the former Marquis of Shenze who came with the main methods.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "匿其年及所生長，常自謂七十，能使物，卻老。",
          "translations": [
            {
              "lang": "en",
              "literal": "Concealed his age and place grown up, often self called seventy, able make things, dispel old.",
              "idiomatic": "He concealed his age and where he grew up. He often claimed to be seventy, able to make things happen and dispel old age.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "其游以方遍諸侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "His travels with methods everywhere feudal lords.",
              "idiomatic": "His travels with methods reached everywhere among the feudal lords.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "無妻子。",
          "translations": [
            {
              "lang": "en",
              "literal": "No wife children.",
              "idiomatic": "He had no wife or children.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
          "translations": [
            {
              "lang": "en",
              "literal": "People heard his ability make things and immortality, moreover fed sent him, often surplus gold money silks clothing food.",
              "idiomatic": "People heard of his ability to make things happen and achieve immortality. They moreover fed and sent him gifts, often leaving surplus gold, money, silks, clothing, and food.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
          "translations": [
            {
              "lang": "en",
              "literal": "People all considered not managed estates yet abundant supply, moreover not knew his what came from, even more believed, contended served him.",
              "idiomatic": "People all considered that he did not manage estates yet had abundant supply, and moreover did not know where his income came from. They believed even more and contended to serve him.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "少君資好方，善為巧發奇中。",
          "translations": [
            {
              "lang": "en",
              "literal": "Shaogun natural good methods, skilled at clever revelation marvelous hits.",
              "idiomatic": "Shaogun was naturally good at methods and skilled at clever revelations that marveled and hit the mark.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
          "translations": [
            {
              "lang": "en",
              "literal": "Once followed Wuan Hou drank, seated had ninety remaining years old man, Shaogun then spoke with his grandfather toured shot places, old man as child time followed his grandfather went, recognized those places, one gathering all astonished.",
              "idiomatic": "Once he followed the Marquis of Wuan drinking. In the seats there was an old man over ninety years. Shaogun then spoke of places where he had toured and shot with his grandfather. The old man, when he was a child, had followed his grandfather and gone there, and recognized those places. The entire gathering was astonished.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "少君見上，上有故銅器，問少君。",
          "translations": [
            {
              "lang": "en",
              "literal": "Shaogun saw emperor, emperor had old bronze vessel, asked Shaogun.",
              "idiomatic": "Shaogun saw the emperor. The emperor had an old bronze vessel and asked Shaogun about it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "少君曰：「此器齊桓公十年陳於柏寢。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Shaogun said: 'This vessel Qi Huan Gong tenth year displayed at Bo resting place.'",
              "idiomatic": "Shaogun said: 'This vessel was displayed by Duke Huan of Qi in his tenth year at the Bo resting place.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "已而案其刻，果齊桓公器。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then examined its inscriptions, indeed Qi Huan Gong vessel.",
              "idiomatic": "Then they examined its inscriptions, and indeed it was a vessel of Duke Huan of Qi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "一宮盡駭，以少君為神，數百歲人也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At this time, Li Shaogun also appeared before the emperor with methods of sacrificing to the stove, grain immortality, and dispelling old age. The emperor honored him. Shaogun was a person from the former Marquis of Shenze who came with the main methods. He concealed his age and where he grew up. He often claimed to be seventy, able to make things happen and dispel old age. His travels with methods reached everywhere among the feudal lords. He had no wife or children. People heard of his ability to make things happen and achieve immortality. They moreover fed and sent him gifts, often leaving surplus gold, money, silks, clothing, and food. People all considered that he did not manage estates yet had abundant supply, and moreover did not know where his income came from. They believed even more and contended to serve him. Shaogun was naturally good at methods and skilled at clever revelations that marveled and hit the mark. Once he followed the Marquis of Wuan drinking. In the seats there was an old man over ninety years. Shaogun then spoke of places where he had toured and shot with his grandfather. The old man, when he was a child, had followed his grandfather and gone there, and recognized those places. The entire gathering was astonished. Shaogun saw the emperor. The emperor had an old bronze vessel and asked Shaogun about it. Shaogun said: 'This vessel was displayed by Duke Huan of Qi in his tenth year at the Bo resting place.' Then they examined its inscriptions, and indeed it was a vessel of Duke Huan of Qi.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "安期生僊者，通蓬萊中，合則見人，不合則隱。」",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor made Da a Court Gentleman, housed him in the Ganquan Palace. Da advised the emperor to wear yellow robes, ride a yellow carriage, to show his intention to become an immortal. He said: 'I have heard that when the Son of Heaven becomes an immortal, he rides a yellow carriage, wears yellow robes.' The emperor believed this, changed his robes and carriage to yellow.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "居久之，李少君病死。",
          "translations": []
        },
        {
          "id": "s0038",
          "zh": "天子以為化去不死也，而使黃錘史寬舒受其方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven considered transformed departed immortal also, yet made Huangchui Scribe Kuanshu receive his methods.",
              "idiomatic": "The Son of Heaven considered that he had transformed and departed, achieving immortality. He made the Huangchui Scribe Kuanshu receive his methods.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sought Penglai An Qisheng none able get, yet coastal Yan Qi strange far-fetched method masters many mutually imitated, moreover spoke divine matters.",
              "idiomatic": "He sought Penglai and An Qisheng but none could be obtained. Yet the coastal Yan and Qi strange and far-fetched method masters mostly imitated each other, moreover speaking of divine matters.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Son of Heaven considered that he had transformed and departed, achieving immortality. He made the Huangchui Scribe Kuanshu receive his methods. He sought Penglai and An Qisheng but none could be obtained. Yet the coastal Yan and Qi strange and far-fetched method masters mostly imitated each other, moreover speaking of divine matters.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bo person Bo Youji memorialized sacrificed Taiyi method, said: 'Heaven spirits noble Taiyi, Taiyi assistants called Five Emperors.",
              "idiomatic": "The Bo person Bo Youji memorialized a method for sacrificing to Taiyi, saying: 'Among heaven's spirits, the noble one is Taiyi. Taiyi's assistants are called the Five Emperors.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Ancient Son of Heaven with spring autumn sacrificed Taiyi southeast suburban, used great sacrificial animals complete, seven days, made altar opened eight directions ghost paths.'",
              "idiomatic": "The ancient Son of Heaven sacrificed to Taiyi in the southeast suburbs during spring and autumn, using complete great sacrificial animals, for seven days, making an altar that opened the eight directions for the ghost paths.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Son of Heaven commanded Grand Invocator establish his sacrifice Chang'an southeast suburban, constantly conducted sacrifice like Youji method.",
              "idiomatic": "Thereupon the Son of Heaven commanded the Grand Invocator to establish his sacrifice in the southeast suburbs of Chang'an, constantly conducting the sacrifice according to Youji's method.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
          "translations": [
            {
              "lang": "en",
              "literal": "His later people had memorialized book, spoke 'Ancient Son of Heaven three years one used great sacrificial animals complete sacrificed spirits three one: heaven one, earth one, Taiyi one'.",
              "idiomatic": "Afterward, someone memorialized a book saying: 'The ancient Son of Heaven once every three years used complete great sacrificial animals to sacrifice to the three spirits: Heaven One, Earth One, Taiyi One.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven permitted it, commanded Grand Invocator led sacrificed at Youji Taiyi altar above, like his method.",
              "idiomatic": "The Son of Heaven permitted it and commanded the Grand Invocator to lead the sacrifice above Youji's Taiyi altar, according to his method.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
          "translations": []
        },
        {
          "id": "s0046",
          "zh": "冥羊用羊；",
          "translations": []
        },
        {
          "id": "s0047",
          "zh": "祠馬行用一青牡馬；",
          "translations": []
        },
        {
          "id": "s0048",
          "zh": "泰一、皋山山君、地長用牛；",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "武夷君用乾魚；",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuyi Jun used dried fish;",
              "idiomatic": "The Lord of Wuyi used dried fish;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "陰陽使者以一牛」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yin yang envoys with one ox.'",
              "idiomatic": "The yin yang envoys used one ox.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "令祠官領之如其方，而祠於忌泰一壇旁。",
          "translations": [
            {
              "lang": "en",
              "literal": "Commanded sacrifice officials led it like his method, yet sacrificed at Youji Taiyi altar side.",
              "idiomatic": "He commanded the sacrifice officials to lead it according to his method, and sacrifice at the side of Youji's Taiyi altar.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Bo person Bo Youji memorialized a method for sacrificing to Taiyi, saying: 'Among heaven's spirits, the noble one is Taiyi. Taiyi's assistants are called the Five Emperors.' The ancient Son of Heaven sacrificed to Taiyi in the southeast suburbs during spring and autumn, using complete great sacrificial animals, for seven days, making an altar that opened the eight directions for the ghost paths.' Thereupon the Son of Heaven commanded the Grand Invocator to establish his sacrifice in the southeast suburbs of Chang'an, constantly conducting the sacrifice according to Youji's method. Afterward, someone memorialized a book saying: 'The ancient Son of Heaven once every three years used complete great sacrificial animals to sacrifice to the three spirits: Heaven One, Earth One, Taiyi One.' The Son of Heaven permitted it and commanded the Grand Invocator to lead the sacrifice above Youji's Taiyi altar, according to his method. The Lord of Wuyi used dried fish; The yin yang envoys used one ox.' He commanded the sacrifice officials to lead it according to his method, and sacrifice at the side of Youji's Taiyi altar.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "其後，天子苑有白鹿，以其皮為幣，以發瑞應，造白金焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "His later, Son of Heaven park had white deer, with its hide made currency, to issue auspicious response, made white gold there.",
              "idiomatic": "Afterward, the Son of Heaven's park had a white deer. He made currency from its hide to issue auspicious responses, and made white gold there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Afterward, the Son of Heaven's park had a white deer. He made currency from its hide to issue auspicious responses, and made white gold there.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "其明年，郊雍，獲一角獸，若麃然。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, suburban Yong, obtained one horn beast, like mi deer.",
              "idiomatic": "The next year, at the suburban sacrifice in Yong, they obtained a one-horned beast, like a mi deer.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials said: 'Your Majesty solemn respectful suburban sacrifice, Supreme Deity responded enjoyed, bestowed one horn beast, probably qilin say.'",
              "idiomatic": "The officials said: 'Your Majesty solemnly and respectfully performed the suburban sacrifice. The Supreme Deity responded and enjoyed it, bestowing a one-horned beast - probably a qilin.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "於是以薦五畤，畤加一牛以燎。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon with it offered five altars, altars added one ox to burn.",
              "idiomatic": "Thereupon they offered it to the five altars, with each altar adding one ox for burning.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "賜諸侯白金，以風符應合于天地。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted feudal lords white gold, to wind talismans respond united with heaven earth.",
              "idiomatic": "He granted the feudal lords white gold, to make the talismans respond and unite with heaven and earth.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, at the suburban sacrifice in Yong, they obtained a one-horned beast, like a mi deer. The officials said: 'Your Majesty solemnly and respectfully performed the suburban sacrifice. The Supreme Deity responded and enjoyed it, bestowing a one-horned beast - probably a qilin.' Thereupon they offered it to the five altars, with each altar adding one ox for burning. He granted the feudal lords white gold, to make the talismans respond and unite with heaven and earth.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "於是濟北王以為天子且封禪，乃上書獻泰山及其旁邑。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Jibei King considered Son of Heaven about fengshan, then memorialized offered Taishan and its side cities.",
              "idiomatic": "Thereupon the King of Jibei considered that the Son of Heaven was about to perform the fengshan ceremony, so he memorialized and offered Taishan and its neighboring cities.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "天子受之，更以他縣償之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven accepted it, moreover with other counties compensated him.",
              "idiomatic": "The Son of Heaven accepted it, and moreover compensated him with other counties.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Changshan King had crime, banished, Son of Heaven enfeoffed his younger brother at Zhending, to continue previous king sacrifices, yet with Changshan as commandery.",
              "idiomatic": "The King of Changshan had a crime and was banished. The Son of Heaven enfeoffed his younger brother at Zhending to continue the previous king's sacrifices, and made Changshan into a commandery.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "然後五嶽皆在天子之郡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then five peaks all in Son of Heaven commanderies.",
              "idiomatic": "Then all five peaks were in the Son of Heaven's commanderies.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thereupon the King of Jibei considered that the Son of Heaven was about to perform the fengshan ceremony, so he memorialized and offered Taishan and its neighboring cities. The Son of Heaven accepted it, and moreover compensated him with other counties. The King of Changshan had a crime and was banished. The Son of Heaven enfeoffed his younger brother at Zhending to continue the previous king's sacrifices, and made Changshan into a commandery. Then all five peaks were in the Son of Heaven's commanderies.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "其明年，齊人少翁以鬼神方見上。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, Qi person Shao Weng with ghost spirit methods saw emperor.",
              "idiomatic": "The next year, the Qi person Shao Weng appeared before the emperor with ghost and spirit methods.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor had favored Wang Lady, lady died, Shao Weng with method arts overnight brought Wang Lady and stove ghost appearance say, Son of Heaven from curtain middle gazed saw them.",
              "idiomatic": "The emperor had favored Lady Wang. The lady had died. Shao Weng with his method arts overnight brought the appearance of Lady Wang and the stove ghost, it is said. The Son of Heaven gazed and saw them from within the curtain.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。",
          "translations": []
        },
        {
          "id": "s0067",
          "zh": "居歲餘，其方益衰，神不至。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then made silk book with fed ox, pretended not know also, spoke this ox belly had marvel.",
              "idiomatic": "He then made a silk book and fed it to the ox, pretending not to know, saying that this ox's belly had a marvel.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "殺而視之，得書，書言其怪，天子疑之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Killed and inspected it, obtained book, book spoke its marvel, Son of Heaven doubted it.",
              "idiomatic": "They killed and inspected it, obtained the book, the book spoke of its marvel. The Son of Heaven doubted it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "有識其手書，問之人，果（為）［偽］書。",
          "translations": [
            {
              "lang": "en",
              "literal": "Had recognized his handwriting, asked people, indeed false book.",
              "idiomatic": "Someone recognized his handwriting and asked people about it. Indeed it was a false book.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "於是誅文成將軍而隱之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon executed Wencheng General yet concealed it.",
              "idiomatic": "Thereupon he executed the General of Wencheng but concealed it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, the Qi person Shao Weng appeared before the emperor with ghost and spirit methods. The emperor had favored Lady Wang. The lady had died. Shao Weng with his method arts overnight brought the appearance of Lady Wang and the stove ghost, it is said. The Son of Heaven gazed and saw them from within the curtain. He then made a silk book and fed it to the ox, pretending not to know, saying that this ox's belly had a marvel. They killed and inspected it, obtained the book, the book spoke of its marvel. The Son of Heaven doubted it. Someone recognized his handwriting and asked people about it. Indeed it was a false book. Thereupon he executed the General of Wencheng but concealed it.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "其後則又作柏梁、銅柱、承露僊人掌之屬矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "His later then moreover made Cypress Beam, Copper Pillar, Dew Receiving Immortal Person palm etc. kinds.",
              "idiomatic": "Afterward, he then moreover made the Cypress Beam, Copper Pillar, Dew Receiving Immortal Person, and palm and such things.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Afterward, he then moreover made the Cypress Beam, Copper Pillar, Dew Receiving Immortal Person, and palm and such things.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "文成死明年，天子病鼎湖甚，巫醫無所不致，（至）不愈。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wencheng died next year, Son of Heaven ill Dinghu very, witch doctors nothing not brought, not healed.",
              "idiomatic": "The year after Wencheng died, the Son of Heaven became very ill at Dinghu. Witch doctors were brought without limit, but he was not healed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "游水發根乃言曰：「上郡有巫，病而鬼下之。」",
          "translations": [
            {
              "lang": "en",
              "literal": "You Shui Fagen then spoke said: 'Shang commandery has witch, ill yet spirit descended him.'",
              "idiomatic": "You Shui Fagen then spoke and said: 'The Shang commandery has a witch. He was ill but a spirit descended upon him.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "上召置祠之甘泉。",
          "translations": []
        },
        {
          "id": "s0076",
          "zh": "及病，使人問神君。",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "神君言曰：「天子毋憂病。",
          "translations": []
        },
        {
          "id": "s0078",
          "zh": "病少愈，彊與我會甘泉。」",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "於是病愈，遂幸甘泉，病良已。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "大赦天下，置壽宮神君。",
          "translations": [
            {
              "lang": "en",
              "literal": "Great amnesty realm, established Shou Palace divine lord.",
              "idiomatic": "He granted a great amnesty to the realm and established the Shou Palace for the divine lord.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Divine lord most noble Taiyi, his assistants called Great Prohibition, Controller of Fate etc. kinds, all followed him.",
              "idiomatic": "The divine lord's most noble was Taiyi. His assistants were called Great Prohibition, Controller of Fate, and such kinds. All followed him.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "非可得見，聞其音，與人言等。",
          "translations": [
            {
              "lang": "en",
              "literal": "Not able obtained seen, heard his sound, with person speech equal.",
              "idiomatic": "He could not be seen, but his sound could be heard, equal to a person's speech.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "時去時來，來則風肅然也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sometimes departed sometimes came, came then wind solemn calm also.",
              "idiomatic": "Sometimes he departed, sometimes he came. When he came, then the wind was solemn and calm.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "居室帷中。",
          "translations": [
            {
              "lang": "en",
              "literal": "Resided room curtain middle.",
              "idiomatic": "He resided in the room within the curtain.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "時晝言，然常以夜。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sometimes daytime spoke, however usually with night.",
              "idiomatic": "Sometimes he spoke in the daytime, but usually at night.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "天子祓，然後入。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven purification, then entered.",
              "idiomatic": "The Son of Heaven performed purification, then entered.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "因巫為主人，關飲食。",
          "translations": [
            {
              "lang": "en",
              "literal": "By means of witch as host, concerned with food drink.",
              "idiomatic": "He used the witch as host, concerned with food and drink.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "所欲者言行下。",
          "translations": [
            {
              "lang": "en",
              "literal": "What desired spoke then descended.",
              "idiomatic": "What he desired, he spoke and it then descended.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "又置壽宮、北宮，張羽旗，設供具，以禮神君。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover established Shou Palace, North Palace, spread feather flags, set up offerings utensils, to ritual divine lord.",
              "idiomatic": "He moreover established the Shou Palace and North Palace, spread feather flags, set up offerings and utensils, to ritualize the divine lord.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "神君所言，上使人受書其言，命之曰「畫法」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Divine lord what spoke, emperor made person received wrote his words, named it 'painting method'.",
              "idiomatic": "What the divine lord spoke, the emperor had someone receive and write down his words, naming it the 'painting method'.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。",
          "translations": [
            {
              "lang": "en",
              "literal": "His what spoke, world customs what knew also, no extremely exceptional, yet Son of Heaven alone happy.",
              "idiomatic": "What he spoke of was what the world's customs knew, nothing extremely exceptional, yet the Son of Heaven alone was happy.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "其事祕，世莫知也。",
          "translations": [
            {
              "lang": "en",
              "literal": "His matters secret, world none knew also.",
              "idiomatic": "His matters were secret; the world knew none of them.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The year after Wencheng died, the Son of Heaven became very ill at Dinghu. Witch doctors were brought without limit, but he was not healed. You Shui Fagen then spoke and said: 'The Shang commandery has a witch. He was ill but a spirit descended upon him.' He granted a great amnesty to the realm and established the Shou Palace for the divine lord. The divine lord's most noble was Taiyi. His assistants were called Great Prohibition, Controller of Fate, and such kinds. All followed him. He could not be seen, but his sound could be heard, equal to a person's speech. Sometimes he departed, sometimes he came. When he came, then the wind was solemn and calm. He resided in the room within the curtain. Sometimes he spoke in the daytime, but usually at night. The Son of Heaven performed purification, then entered. He used the witch as host, concerned with food and drink. What he desired, he spoke and it then descended. He moreover established the Shou Palace and North Palace, spread feather flags, set up offerings and utensils, to ritualize the divine lord. What the divine lord spoke, the emperor had someone receive and write down his words, naming it the 'painting method'. What he spoke of was what the world's customs knew, nothing extremely exceptional, yet the Son of Heaven alone was happy. His matters were secret; the world knew none of them.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0093",
          "zh": "其後三年，有司言元宜以天瑞命，不宜以一二數。",
          "translations": [
            {
              "lang": "en",
              "literal": "His later three years, officials spoke yuan should with heaven auspicious named, not suitable with one two numbers.",
              "idiomatic": "Three years later, the officials said that 'yuan' should be named with heaven's auspicious signs, not suitable to use the numbers one and two.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "一元曰建元，二元以長星曰元光，三元以郊得一角獸曰元狩云。",
          "translations": [
            {
              "lang": "en",
              "literal": "One yuan called Jian Yuan, two yuan with long star called Yuan Guang, three yuan with suburban obtained one horn beast called Yuan Shou say.",
              "idiomatic": "The first yuan was called Jian Yuan, the second yuan with a long star was called Yuan Guang, the third yuan with a suburban one-horned beast obtained was called Yuan Shou, it is said.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Three years later, the officials said that 'yuan' should be named with heaven's auspicious signs, not suitable to use the numbers one and two. The first yuan was called Jian Yuan, the second yuan with a long star was called Yuan Guang, the third yuan with a suburban one-horned beast obtained was called Yuan Shou, it is said.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0095",
          "zh": "其明年冬，天子郊雍，議曰：「今上帝朕親郊，而後土毋祀，則禮不答也。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year winter, Son of Heaven suburban Yong, discussed said: 'Now Supreme Deity I personally suburban sacrificed, yet Houtu no sacrifice, then ritual not reciprocal also.'",
              "idiomatic": "The next year in winter, the Son of Heaven performed suburban sacrifices at Yong and discussed, saying: 'Now I personally perform suburban sacrifices to the Supreme Deity, yet Houtu has no sacrifices, then the ritual is not reciprocal.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials with Grand Historian, sacrifice official Kuanshu etc. discussed: 'Heaven earth sacrificial animals horns cocoon chestnuts.",
              "idiomatic": "The officials discussed with the Grand Historian, sacrifice official Kuanshu, and others: 'Heaven and earth sacrificial animals' horns are cocoon chestnuts.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Now Your Majesty personally sacrifices Houtu, Houtu suitable in marsh middle round mound make five altars, altar one yellow calf great sacrificial animals complete, already sacrificed all buried, yet following sacrifice clothing upper yellow.'",
              "idiomatic": "Now Your Majesty personally sacrifices to Houtu. Houtu should have five altars made in a round mound in the marsh, each altar with one yellow calf and complete great sacrificial animals. After sacrificing, all are buried, and following the sacrifice, the clothing is upper yellow.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "上親望拜，如上帝禮。",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "禮畢，天子遂至滎陽而還。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "過雒陽，下詔曰：「三代邈絕，遠矣難存。",
          "translations": []
        },
        {
          "id": "s0102",
          "zh": "其以三十里地封周後為周子南君，以奉先王祀焉。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Their with thirty li land enfeoffed Zhou descendants as Zhou Zi Nan Jun, to conduct previous kings sacrifices there.'",
              "idiomatic": "With thirty li of land, enfeoff the Zhou descendants as Lord Zi Nan of Zhou, to conduct the previous kings' sacrifices there.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "是歲，天子始巡郡縣，侵尋於泰山矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, Son of Heaven began toured commanderies counties, gradually approached Taishan.",
              "idiomatic": "This year, the Son of Heaven began touring the commanderies and counties, gradually approaching Taishan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year in winter, the Son of Heaven performed suburban sacrifices at Yong and discussed, saying: 'Now I personally perform suburban sacrifices to the Supreme Deity, yet Houtu has no sacrifices, then the ritual is not reciprocal.' The officials discussed with the Grand Historian, sacrifice official Kuanshu, and others: 'Heaven and earth sacrificial animals' horns are cocoon chestnuts. Now Your Majesty personally sacrifices to Houtu. Houtu should have five altars made in a round mound in the marsh, each altar with one yellow calf and complete great sacrificial animals. After sacrificing, all are buried, and following the sacrifice, the clothing is upper yellow.' With thirty li of land, enfeoff the Zhou descendants as Lord Zi Nan of Zhou, to conduct the previous kings' sacrifices there.' This year, the Son of Heaven began touring the commanderies and counties, gradually approaching Taishan.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "其春，樂成侯上書言欒大。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next spring, Lecheng Hou memorialized book spoke Luan Da.",
              "idiomatic": "The next spring, the Marquis of Lecheng memorialized a book speaking of Luan Da.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Luan Da, Jiaodong palace person, formerly once with Wencheng General same master, already then became Jiaodong King favored artisan.",
              "idiomatic": "Luan Da was a palace person from Jiaodong. He formerly once studied with the same master as General Wencheng. Afterward he became King Jiaodong's favored artisan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "而樂成侯姊為康王后，毋子。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet Lecheng Hou elder sister became Kang King empress, no sons.",
              "idiomatic": "Yet the Marquis of Lecheng's elder sister became Empress Kang, with no sons.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "康王死，他姬子立為王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Kang King died, other consort son established as king.",
              "idiomatic": "King Kang died. Another consort's son was established as king.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "而康后有淫行，與王不相中（得），相危以法。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet Kang Empress had lewd conduct, with king not mutually middle (obtained), mutually endangered with law.",
              "idiomatic": "Yet Empress Kang had lewd conduct, did not get along with the king, and they mutually endangered each other with the law.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Kang Empress heard Wencheng already died, yet wished self flatter emperor, then sent Luan Da by means of Lecheng Hou sought audience spoke methods.",
              "idiomatic": "Empress Kang heard that Wencheng had already died, yet wished to flatter herself to the emperor, so she sent Luan Da through Lecheng Hou to seek an audience and speak of methods.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven already executed Wencheng, afterwards regretted resented his early death, cherished his methods not complete, when saw Luan Da, greatly pleased.",
              "idiomatic": "The Son of Heaven had already executed Wencheng. Afterward he regretted and resented his early death, cherished that his methods were not complete. When he saw Luan Da, he was greatly pleased.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "大為人長美，言多方略，而敢為大言，處之不疑。",
          "translations": [
            {
              "lang": "en",
              "literal": "Da as person tall beautiful, spoke many methods strategies, yet dared make big words, treated it without doubt.",
              "idiomatic": "Da was a person tall and beautiful, spoke of many methods and strategies, yet dared to make big claims, and treated them without doubt.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "大言曰：「臣嘗往來海中，見安期、羨門之屬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Da spoke said: 'Minister once came went sea middle, saw An Qi, Xian Men etc. kinds.",
              "idiomatic": "Da spoke and said: 'I once came and went in the sea, saw An Qi, Xian Men, and such kinds.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "顧以為臣賤，不信臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "However considered minister lowly, not trusted minister.",
              "idiomatic": "However, they considered me lowly and did not trust me.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "又以為康王諸侯耳，不足予方。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover considered Kang King feudal lord only, not worth gave methods.",
              "idiomatic": "Moreover, they considered King Kang only a feudal lord, not worth giving methods to.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "臣數言康王，康王又不用臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Minister frequently spoke Kang King, Kang King moreover not used minister.",
              "idiomatic": "I frequently spoke to King Kang, but King Kang moreover did not use me.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "臣恐效文成，則方士皆掩口，惡敢言方哉！」",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "上曰：「文成食馬肝死耳。",
          "translations": []
        },
        {
          "id": "s0119",
          "zh": "子誠能修其方，我何愛乎！」",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "大曰：「臣師非有求人，人者求之。",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "神人尚肯邪不邪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Spirit people still willing yes no yes.",
              "idiomatic": "Do the spirit people still consent or not consent?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "致尊其使，然後可致也。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Bring honor their envoy, then can bring them.'",
              "idiomatic": "Bring honor to their envoy, then they can be brought.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "於是上使先驗小方，鬬旗，旗自相觸擊。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon emperor made first test small methods, battle flags, flags themselves mutually touched attacked.",
              "idiomatic": "Thereupon the emperor had them first test small methods. The battle flags themselves mutually touched and attacked.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next spring, the Marquis of Lecheng memorialized a book speaking of Luan Da. Luan Da was a palace person from Jiaodong. He formerly once studied with the same master as General Wencheng. Afterward he became King Jiaodong's favored artisan. Yet the Marquis of Lecheng's elder sister became Empress Kang, with no sons. King Kang died. Another consort's son was established as king. Yet Empress Kang had lewd conduct, did not get along with the king, and they mutually endangered each other with the law. Empress Kang heard that Wencheng had already died, yet wished to flatter herself to the emperor, so she sent Luan Da through Lecheng Hou to seek an audience and speak of methods. The Son of Heaven had already executed Wencheng. Afterward he regretted and resented his early death, cherished that his methods were not complete. When he saw Luan Da, he was greatly pleased. Da was a person tall and beautiful, spoke of many methods and strategies, yet dared to make big claims, and treated them without doubt. Da spoke and said: 'I once came and went in the sea, saw An Qi, Xian Men, and such kinds.' However, they considered me lowly and did not trust me. Moreover, they considered King Kang only a feudal lord, not worth giving methods to. I frequently spoke to King Kang, but King Kang moreover did not use me. Do the spirit people still consent or not consent? Bring honor to their envoy, then they can be brought.' Thereupon the emperor had them first test small methods. The battle flags themselves mutually touched and attacked.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "是時上方憂河決，而黃金不就，乃拜大為五利將軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "This time emperor just worried Yellow River breach, yet yellow gold not completed, then appointed Da as Five Profits General.",
              "idiomatic": "At this time the emperor was just worried about the Yellow River breach, yet the yellow gold was not completed. He then appointed Da as Five Profits General.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。",
          "translations": [
            {
              "lang": "en",
              "literal": "Resided month remaining, obtained four gold seals, wore Heaven Knight General, Earth Soil General, Great Passage General, Heaven Way General seals.",
              "idiomatic": "He resided over a month and obtained four gold seals, wearing the seals of Heaven Knight General, Earth Soil General, Great Passage General, and Heaven Way General.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "制詔御史：「昔禹疏九江，決四瀆。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict Imperial Secretary: 'Formerly Yu dredged nine rivers, breached four channels.",
              "idiomatic": "Imperial edict to the Imperial Secretary: 'Formerly Yu dredged the nine rivers and breached the four channels.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "閒者河溢皋陸，隄繇不息。",
          "translations": [
            {
              "lang": "en",
              "literal": "Recently Yellow River overflowed Gao Lu, dike corvee not ceased.",
              "idiomatic": "Recently the Yellow River has overflowed Gao Lu, and the dike corvee labor has not ceased.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "朕臨天下二十有八年，天若遺朕士而大通焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "I faced realm twenty eight years, heaven if bestowed I knight yet great passage there.",
              "idiomatic": "I have faced the realm for twenty-eight years. Heaven, if it bestowed me a knight, would greatly pass there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qian called 'flying dragon', 'great goose gradually at plate', intention almost with there.",
              "idiomatic": "Qian is called 'flying dragon', 'great goose gradually at plate'. The intention is almost with it there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "其以二千戶封地士將軍大為樂通侯。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Their with two thousand households enfeoffed Earth Knight General Da as Le Tong Hou.'",
              "idiomatic": "With two thousand households, enfeoff the Earth Knight General Da as Marquis of Le Tong.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "賜列侯甲第，僮千人。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted marquises first rank mansions, youths thousand people.",
              "idiomatic": "He granted the marquises first-rank mansions and a thousand youths.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "乘輿斥車馬帷帳器物以充其家。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial carriage discarded chariots horses curtains tents utensils to fill his home.",
              "idiomatic": "The imperial carriage discarded chariots, horses, curtains, tents, and utensils to fill his home.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover with Wei eldest princess married him, carried gold ten thousand jin, changed name his city called Dangli princess.",
              "idiomatic": "He moreover married him to the eldest princess of Wei, carried ten thousand jin of gold, and changed the name of his city to Dangli Princess.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "天子親如五利之第。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven personally went like Five Profits residence.",
              "idiomatic": "The Son of Heaven personally went to the Five Profits residence.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "使者存問所給，連屬於道。",
          "translations": [
            {
              "lang": "en",
              "literal": "Envoys visited inquired what supplied, connected attached on road.",
              "idiomatic": "Envoys visited and inquired about what was supplied, connected and attached along the road.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "自大主將相以下，皆置酒其家，獻遺之。",
          "translations": [
            {
              "lang": "en",
              "literal": "From great princess generals chancellors below, all set up wine his home, offered sent him.",
              "idiomatic": "From the great princess and generals and chancellors below, all set up wine at his home and offered gifts to him.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Son of Heaven moreover carved jade seal called 'Heaven Way General', made envoy wore feather clothes, night stood white cogongrass above, Five Profits General also wore feather clothes, stood white cogongrass above received seal, to show not minister also.",
              "idiomatic": "Thereupon the Son of Heaven moreover carved a jade seal called 'Heaven Way General'. He made the envoy wear feather clothes and stand on white cogongrass at night. The Five Profits General also wore feather clothes and stood on white cogongrass to receive the seal, to show he was not a minister.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "而佩「天道」者，且為天子道天神也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet wearing 'Heaven Way' one, moreover for Son of Heaven guided heaven spirits also.",
              "idiomatic": "Yet the one wearing 'Heaven Way' moreover guided heaven spirits for the Son of Heaven.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "於是五利常夜祠其家，欲以下神。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Five Profits often night sacrificed his home, wished to descend spirits.",
              "idiomatic": "Thereupon Five Profits often sacrificed at night in his home, wishing to descend spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "神未至而百鬼集矣，然頗能使之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Spirit not arrived yet hundred ghosts gathered already, however rather able make them.",
              "idiomatic": "The spirit had not arrived yet, but the hundred ghosts had already gathered. However, he was rather able to make them.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "其後治裝行，東入海，求其師云。",
          "translations": [
            {
              "lang": "en",
              "literal": "His later prepared equipment went, east entered sea, sought his master say.",
              "idiomatic": "Afterward he prepared equipment and went, entered the sea to the east, seeking his master, it is said.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "大見數月，佩六印，貴振天下，而海上燕齊之閒，莫不搤捥而自言有禁方，能神僊矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Da appeared several months, wore six seals, noble shook realm, yet coastal Yan Qi between, none not grasped writhed yet self claimed had forbidden methods, able divine immortals.",
              "idiomatic": "Da appeared for several months, wore six seals, noble and shook the realm, yet between coastal Yan and Qi, none did not grasp and writhe while claiming they had forbidden methods and could divine immortals.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At this time the emperor was just worried about the Yellow River breach, yet the yellow gold was not completed. He then appointed Da as Five Profits General. He resided over a month and obtained four gold seals, wearing the seals of Heaven Knight General, Earth Soil General, Great Passage General, and Heaven Way General. Imperial edict to the Imperial Secretary: 'Formerly Yu dredged the nine rivers and breached the four channels. Recently the Yellow River has overflowed Gao Lu, and the dike corvee labor has not ceased. I have faced the realm for twenty-eight years. Heaven, if it bestowed me a knight, would greatly pass there. Qian is called 'flying dragon', 'great goose gradually at plate'. The intention is almost with it there. With two thousand households, enfeoff the Earth Knight General Da as Marquis of Le Tong.' He granted the marquises first-rank mansions and a thousand youths. The imperial carriage discarded chariots, horses, curtains, tents, and utensils to fill his home. He moreover married him to the eldest princess of Wei, carried ten thousand jin of gold, and changed the name of his city to Dangli Princess. The Son of Heaven personally went to the Five Profits residence. Envoys visited and inquired about what was supplied, connected and attached along the road. From the great princess and generals and chancellors below, all set up wine at his home and offered gifts to him. Thereupon the Son of Heaven moreover carved a jade seal called 'Heaven Way General'. He made the envoy wear feather clothes and stand on white cogongrass at night. The Five Profits General also wore feather clothes and stood on white cogongrass to receive the seal, to show he was not a minister. Yet the one wearing 'Heaven Way' moreover guided heaven spirits for the Son of Heaven. Thereupon Five Profits often sacrificed at night in his home, wishing to descend spirits. The spirit had not arrived yet, but the hundred ghosts had already gathered. However, he was rather able to make them. Afterward he prepared equipment and went, entered the sea to the east, seeking his master, it is said. Da appeared for several months, wore six seals, noble and shook the realm, yet between coastal Yan and Qi, none did not grasp and writhe while claiming they had forbidden methods and could divine immortals.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "其夏六月中，汾陰巫錦為民祠魏脽后土營旁，見地如鉤狀，掊視得鼎。",
          "translations": [
            {
              "lang": "en",
              "literal": "That summer sixth month middle, Fenyin witch Jin for people sacrificed Wei Chong Houtu camp side, saw ground like hook shape, threw down inspected obtained tripod.",
              "idiomatic": "In the middle of the sixth month of that summer, the Fenyin witch Jin was sacrificing to Houtu at the Wei Chong camp side for the people. She saw the ground in a hook shape, threw it down and inspected, obtaining a tripod.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。",
          "translations": [
            {
              "lang": "en",
              "literal": "Tripod greatly different from crowd tripods, patterns carved no inscriptions, marveled it, told officials.",
              "idiomatic": "The tripod was greatly different from the crowd of tripods, with carved patterns but no inscriptions. She marveled at it and told the officials.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "吏告河東太守勝，勝以聞。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials told Hedong grand administrator Sheng, Sheng with heard.",
              "idiomatic": "The officials told the Grand Administrator of Hedong, Sheng, and Sheng reported it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven made envoy verified questioned witch Jin obtained tripod no illicit deceit, then with ritual sacrificed, welcomed tripod to Ganquan, followed journey, emperor offered it.",
              "idiomatic": "The Son of Heaven had an envoy verify and question that the witch Jin obtained the tripod without illicit deceit. He then sacrificed with ritual, welcomed the tripod to Ganquan, followed the journey, and the emperor offered it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "至中山，晏溫，有黃雲蓋焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Arrived Zhongshan, peaceful warm, had yellow cloud covered there.",
              "idiomatic": "He arrived at Zhongshan. It was peaceful and warm, with yellow clouds covering it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "有麃過，上自射之，因以祭雲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Had mi deer passed, emperor personally shot it, by means sacrificed cloud.",
              "idiomatic": "A mi deer passed by. The emperor personally shot it and by means sacrificed to the cloud.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "至長安，公卿大夫皆議請尊寶鼎。",
          "translations": [
            {
              "lang": "en",
              "literal": "Arrived Chang'an, ministers marquises grandees all discussed requested honored treasured tripod.",
              "idiomatic": "He arrived at Chang'an. All the ministers, marquises, and grandees discussed and requested that the treasured tripod be honored.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven said: 'Recently Yellow River overflowed, years several not abundant, therefore toured sacrificed Houtu, prayed for commoners grew grain.",
              "idiomatic": "The Son of Heaven said: 'Recently the Yellow River overflowed, and for several years the harvests were not abundant. Therefore I toured and sacrificed to Houtu, praying for the commoners to grow grain.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "今年豐廡未有報，鼎曷為出哉？」",
          "translations": [
            {
              "lang": "en",
              "literal": "This year abundant granaries not had report, tripod why for come out question?'",
              "idiomatic": "This year the abundant granaries have not had reports. Why would the tripod come out?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials all said: 'Heard formerly Great Emperor raised divine tripod one, one is unified, heaven earth ten thousand things what tied end also.",
              "idiomatic": "All the officials said: 'We have heard that formerly the Great Emperor raised a divine tripod one. One is unified - heaven, earth, and the ten thousand things are all tied to the end.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "黃帝作寶鼎三，象天地人也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor made treasured tripods three, symbolized heaven earth person.",
              "idiomatic": "The Yellow Emperor made three treasured tripods, symbolizing heaven, earth, and person.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yu collected nine regions gold, cast nine tripods, all once li cooked Supreme Deity ghosts spirits.",
              "idiomatic": "Yu collected gold from the nine regions, cast nine tripods, all once used to cook for the Supreme Deity and ghosts and spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "遭聖則興，遷于夏商。",
          "translations": [
            {
              "lang": "en",
              "literal": "Encountered sages then arose, moved to Xia Shang.",
              "idiomatic": "When they encountered sages, they arose, moved to Xia and Shang.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "周德衰，宋之社亡，鼎乃淪伏而不見。",
          "translations": [
            {
              "lang": "en",
              "literal": "Zhou virtue declined, Song altars perished, tripod then sank hid not seen.",
              "idiomatic": "Zhou virtue declined, Song's altars perished, the tripod then sank and hid and was not seen.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "頌云『自堂徂基，自羊徂牛；",
          "translations": [
            {
              "lang": "en",
              "literal": "Ode says 'from hall to foundation, from sheep to ox;",
              "idiomatic": "The ode says 'from hall to foundation, from sheep to ox;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "鼐鼎及鼒，不虞不驁，胡考之休』。",
          "translations": [
            {
              "lang": "en",
              "literal": "Nai tripods and gui, not unexpected not startled, how long-lasting happiness.'",
              "idiomatic": "Nai tripods and gui, not unexpected not startled, how long-lasting happiness.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "今鼎至甘泉，光潤龍變，承休無疆。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now tripod arrived Ganquan, light moist dragon changed, received blessing boundless.",
              "idiomatic": "Now the tripod arrived at Ganquan, its light moist and dragon-like changed, receiving boundless blessing.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。",
          "translations": [
            {
              "lang": "en",
              "literal": "United this Zhongshan, had yellow white clouds descended covered, like beasts made talismans, road bows carriage arrows, gathered obtained altar below, reported sacrifice great feasting.",
              "idiomatic": "United with this Zhongshan, yellow and white clouds descended and covered it, like beasts making talismans, road bows and carriage arrows gathered and obtained below the altar, reported the sacrifice with great feasting.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "惟受命而帝者心知其意而合德焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Only received mandate yet emperor heart knew its intention yet united virtue there.",
              "idiomatic": "Only those who receive the mandate and become emperors know its intention in their hearts and unite virtue there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "鼎宜見於祖禰，藏於帝廷，以合明應。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Tripod should appear at ancestral temples, stored at imperial court, to unite bright response.'",
              "idiomatic": "The tripod should appear at the ancestral temples, be stored at the imperial court, to unite with the bright response.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "制曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict said: 'Permitted.'",
              "idiomatic": "The imperial edict said: 'Permitted.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the middle of the sixth month of that summer, the Fenyin witch Jin was sacrificing to Houtu at the Wei Chong camp side for the people. She saw the ground in a hook shape, threw it down and inspected, obtaining a tripod. The tripod was greatly different from the crowd of tripods, with carved patterns but no inscriptions. She marveled at it and told the officials. The officials told the Grand Administrator of Hedong, Sheng, and Sheng reported it. The Son of Heaven had an envoy verify and question that the witch Jin obtained the tripod without illicit deceit. He then sacrificed with ritual, welcomed the tripod to Ganquan, followed the journey, and the emperor offered it. He arrived at Zhongshan. It was peaceful and warm, with yellow clouds covering it. A mi deer passed by. The emperor personally shot it and by means sacrificed to the cloud. He arrived at Chang'an. All the ministers, marquises, and grandees discussed and requested that the treasured tripod be honored. The Son of Heaven said: 'Recently the Yellow River overflowed, and for several years the harvests were not abundant. Therefore I toured and sacrificed to Houtu, praying for the commoners to grow grain. This year the abundant granaries have not had reports. Why would the tripod come out?' All the officials said: 'We have heard that formerly the Great Emperor raised a divine tripod one. One is unified - heaven, earth, and the ten thousand things are all tied to the end. The Yellow Emperor made three treasured tripods, symbolizing heaven, earth, and person. Yu collected gold from the nine regions, cast nine tripods, all once used to cook for the Supreme Deity and ghosts and spirits. When they encountered sages, they arose, moved to Xia and Shang. Zhou virtue declined, Song's altars perished, the tripod then sank and hid and was not seen. The ode says 'from hall to foundation, from sheep to ox; Nai tripods and gui, not unexpected not startled, how long-lasting happiness.' Now the tripod arrived at Ganquan, its light moist and dragon-like changed, receiving boundless blessing. United with this Zhongshan, yellow and white clouds descended and covered it, like beasts making talismans, road bows and carriage arrows gathered and obtained below the altar, reported the sacrifice with great feasting. Only those who receive the mandate and become emperors know its intention in their hearts and unite virtue there. The tripod should appear at the ancestral temples, be stored at the imperial court, to unite with the bright response.' The imperial edict said: 'Permitted.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0165",
          "zh": "入海求蓬萊者，言蓬萊不遠，而不能至者，殆不見其氣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Entered sea sought Penglai people, spoke Penglai not far, yet cannot arrive people, probably not saw its qi.",
              "idiomatic": "Those who entered the sea seeking Penglai said Penglai was not far, yet those who could not arrive probably did not see its qi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "上乃遣望氣佐侯其氣雲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then dispatched qi gazer assistant marquis its qi clouds.",
              "idiomatic": "The emperor then dispatched a qi-gazer assistant marquis to its qi clouds.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Those who entered the sea seeking Penglai said Penglai was not far, yet those who could not arrive probably did not see its qi. The emperor then dispatched a qi-gazer assistant marquis to its qi clouds.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "其秋，上幸雍，且郊。",
          "translations": [
            {
              "lang": "en",
              "literal": "That autumn, emperor fortunate Yong, about suburban sacrifice.",
              "idiomatic": "That autumn, the emperor went to Yong, about to perform suburban sacrifices.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "或曰「五帝，泰一之佐也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Some said 'Five Emperors, Taiyi assistants also.",
              "idiomatic": "Some said 'The Five Emperors are Taiyi's assistants.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "宜立泰一而上親郊之」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Should establish Taiyi and emperor personally suburban sacrifice it.'",
              "idiomatic": "Should establish Taiyi and the emperor personally suburban sacrifice to it.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "上疑未定。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor doubted not decided.",
              "idiomatic": "The emperor doubted and was not decided.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Qi person Gongsun Qing said: 'This year obtained treasured tripod, its winter xinsi new moon dawn winter solstice, with Yellow Emperor time equal.'",
              "idiomatic": "The Qi person Gongsun Qing said: 'This year we obtained the treasured tripod. Its winter solstice on the xinsi new moon dawn is equal to Yellow Emperor's time.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qing had bamboo book said: 'Yellow Emperor obtained treasured tripod Wan Qu, asked Guiyu Qu.",
              "idiomatic": "Qing had a bamboo book that said: 'The Yellow Emperor obtained the treasured tripod at Wan Qu and asked Guiyu Qu.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Qu replied said: 'Emperor obtained treasured tripod divine tally, this year jiyou new moon dawn winter solstice, obtained heaven's chronicle, ends yet repeats begins.'",
              "idiomatic": "Qu replied saying: 'The emperor obtained the treasured tripod and divine tally. This year's winter solstice on the jiyou new moon dawn obtained heaven's chronicle, ends yet repeats begins.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Yellow Emperor welcomed sun pushed tally, afterward rate twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years.",
              "idiomatic": "Thereupon the Yellow Emperor welcomed the sun and pushed the tally. Afterward, every twenty years he obtained the new moon dawn winter solstice. Altogether twenty pushes, three hundred eighty years.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "黃帝僊登于天。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor immortal ascended heaven.'",
              "idiomatic": "The Yellow Emperor ascended to heaven as an immortal.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "卿因所忠欲奏之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qing because Suo Zhong wished memorialize it.",
              "idiomatic": "Qing because of Suo Zhong wished to memorialize it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」",
          "translations": [
            {
              "lang": "en",
              "literal": "Suo Zhong saw his book not orthodox, doubted its false book, declined said: 'Treasured tripod matter already decided, still what to do!'",
              "idiomatic": "Suo Zhong saw his book was not orthodox, doubted it was a false book, declined and said: 'The treasured tripod matter is already decided. What more is there to do!'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "卿因嬖人奏之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qing because favorite person memorialized it.",
              "idiomatic": "Qing memorialized it through a favorite person.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "上大說，召問卿。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor greatly pleased, summoned questioned Qing.",
              "idiomatic": "The emperor was greatly pleased and summoned Qing to question him.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "對曰：「受此書申功，申功已死。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Replied said: 'Received this book Shen Gong, Shen Gong already dead.'",
              "idiomatic": "He replied saying: 'Shen Gong received this book. Shen Gong is already dead.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "上曰：「申功何人也？」",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'Shen Gong what person also?'",
              "idiomatic": "The emperor said: 'What person is Shen Gong?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "卿曰：「申功，齊人也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qing said: 'Shen Gong, Qi person also.",
              "idiomatic": "Qing said: 'Shen Gong is a Qi person.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "與安期生通，受黃帝言，無書，獨有此鼎書。",
          "translations": [
            {
              "lang": "en",
              "literal": "With An Qisheng communicated, received Yellow Emperor words, no book, alone had this tripod book.",
              "idiomatic": "He communicated with An Qisheng and received the Yellow Emperor's words. There was no book, only this tripod book.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "曰『漢興復當黃帝之時。",
          "translations": [
            {
              "lang": "en",
              "literal": "Said 'Han rise again should Yellow Emperor time.",
              "idiomatic": "It said 'When the Han rises again, it should be the Yellow Emperor's time.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "漢之聖者在高祖之孫且曾孫也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Han sage is Gaozu grandson and great grandson also.",
              "idiomatic": "The Han sage is Gaozu's grandson and great grandson.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "寶鼎出而與神通，封禪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Treasured tripod emerges yet with spirits communicates, fengshan.",
              "idiomatic": "The treasured tripod emerges and communicates with spirits, fengshan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "封禪七十二王，唯黃帝得上泰山封』。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fengshan seventy two kings, only Yellow Emperor able ascend Taishan seal.'",
              "idiomatic": "Fengshan seventy two kings, only the Yellow Emperor was able to ascend Taishan for the seal.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "申功曰：『漢主亦當上封，上封則能僊登天矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Shen Gong said: 'Han lord also should ascend seal, ascend seal then able immortal ascend heaven.'",
              "idiomatic": "Shen Gong said: 'The Han lord should also ascend and seal. If he ascends and seals, he will be able to ascend to heaven as an immortal.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "黃帝時萬諸侯，而神靈之封居七千。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor time ten thousand feudal lords, yet divine spirits seals resided seven thousand.",
              "idiomatic": "In the Yellow Emperor's time there were ten thousand feudal lords, yet divine spirits' seals resided at seven thousand.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "天下名山八，而三在蠻夷，五在中國。",
          "translations": [
            {
              "lang": "en",
              "literal": "Realm famous mountains eight, yet three in barbarian yi, five in central states.",
              "idiomatic": "The realm has eight famous mountains, three are among the barbarian yi, five are in the central states.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。",
          "translations": [
            {
              "lang": "en",
              "literal": "Central states Huashan, Shoushan, Taishi, Taishan, Donglai, these five mountains Yellow Emperor what often toured, with spirits met.",
              "idiomatic": "In the central states: Huashan, Shoushan, Taishi, Taishan, Donglai. These five mountains were what the Yellow Emperor often toured, meeting with spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "黃帝且戰且學僊。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor moreover fought moreover learned immortals.",
              "idiomatic": "The Yellow Emperor moreover fought and moreover learned about immortals.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "患百姓非其道，乃斷斬非鬼神者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Worried commoners not his way, then judged executed not ghosts spirits ones.",
              "idiomatic": "He worried that commoners were not following his way, so he judged and executed those who were not ghosts and spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "百餘歲然後得與神通。",
          "translations": [
            {
              "lang": "en",
              "literal": "Hundred remaining years then able with spirits communicate.",
              "idiomatic": "Over a hundred years later he was then able to communicate with spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "黃帝郊雍上帝，宿三月。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor suburban Yong Supreme Deity, lodged three months.",
              "idiomatic": "The Yellow Emperor performed suburban sacrifices to the Supreme Deity at Yong, lodging for three months.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "鬼臾區號大鴻，死葬雍，故鴻冢是也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guiyu Qu styled Great Hong, died buried Yong, therefore Hong tomb is also.",
              "idiomatic": "Guiyu Qu was styled Great Hong. He died and was buried at Yong. Therefore the Hong tomb is it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "其後於黃帝接萬靈明廷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its afterward at Yellow Emperor connected ten thousand spirits bright court.",
              "idiomatic": "Afterward it connected ten thousand spirits at the Yellow Emperor's bright court.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "明廷者，甘泉也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bright court is, Ganquan also.",
              "idiomatic": "The bright court is Ganquan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "所謂寒門者，谷口也。",
          "translations": [
            {
              "lang": "en",
              "literal": "So called cold gate is, valley mouth also.",
              "idiomatic": "The so-called cold gate is the valley mouth.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "黃帝采首山銅，鑄鼎荊山下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor collected Shoushan copper, cast tripod Jing mountain below.",
              "idiomatic": "The Yellow Emperor collected copper from Shoushan and cast the tripod below Jing mountain.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "鼎既成，有龍垂胡髯下迎黃帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "Tripod already completed, had dragon hung beard whiskers below welcomed Yellow Emperor.",
              "idiomatic": "The tripod was already completed when a dragon hung its beard whiskers below and welcomed the Yellow Emperor.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yellow Emperor mounted rode, ministers harem followed ascended dragon seventy remaining people, then went up.",
              "idiomatic": "The Yellow Emperor mounted and rode. His ministers and harem followed, over seventy people ascended the dragon, and then went up.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。",
          "translations": [
            {
              "lang": "en",
              "literal": "Remaining small ministers not able ascend, then all held dragon whiskers, dragon whiskers pulled, fell Yellow Emperor bow.",
              "idiomatic": "The remaining small ministers were not able to ascend, so they all held the dragon's whiskers. The dragon whiskers were pulled, dropping the Yellow Emperor's bow.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。",
          "translations": [
            {
              "lang": "en",
              "literal": "Commoners upward gazed Yellow Emperor already ascended heaven, then embraced his bow with dragon beard whiskers wailed.",
              "idiomatic": "The commoners gazed upward as the Yellow Emperor already ascended to heaven. They then embraced his bow and the dragon's beard whiskers and wailed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "故後世因名其處曰鼎湖，其弓曰烏號。』」",
          "translations": [
            {
              "lang": "en",
              "literal": "Therefore later generations because named that place Ding lake, his bow Wu call.''",
              "idiomatic": "Therefore later generations named that place Ding Lake because of it, and his bow Wu Call.''",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "於是天子曰：「嗟乎！",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Son of Heaven said: 'Alas!",
              "idiomatic": "Thereupon the Son of Heaven said: 'Alas!",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "吾誠得如黃帝，吾視去妻子如脫屣耳。」",
          "translations": [
            {
              "lang": "en",
              "literal": "I truly able like Yellow Emperor, I regard leaving wife children like removing shoes.'",
              "idiomatic": "If I could truly be like the Yellow Emperor, I would regard leaving my wife and children like removing shoes.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "乃拜卿為郎，東使候神於太室。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then appointed Qing as lang, east sent await spirits at Taishi.",
              "idiomatic": "He then appointed Qing as a lang and sent him east to await spirits at Taishi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That autumn, the emperor went to Yong, about to perform suburban sacrifices. Some said 'The Five Emperors are Taiyi's assistants. Should establish Taiyi and the emperor personally suburban sacrifice to it.' The emperor doubted and was not decided. The Qi person Gongsun Qing said: 'This year we obtained the treasured tripod. Its winter solstice on the xinsi new moon dawn is equal to Yellow Emperor's time.' Qing had a bamboo book that said: 'The Yellow Emperor obtained the treasured tripod at Wan Qu and asked Guiyu Qu. Qu replied saying: 'The emperor obtained the treasured tripod and divine tally. This year's winter solstice on the jiyou new moon dawn obtained heaven's chronicle, ends yet repeats begins.' Thereupon the Yellow Emperor welcomed the sun and pushed the tally. Afterward, every twenty years he obtained the new moon dawn winter solstice. Altogether twenty pushes, three hundred eighty years. The Yellow Emperor ascended to heaven as an immortal.' Qing because of Suo Zhong wished to memorialize it. Suo Zhong saw his book was not orthodox, doubted it was a false book, declined and said: 'The treasured tripod matter is already decided. What more is there to do!' Qing memorialized it through a favorite person. The emperor was greatly pleased and summoned Qing to question him. He replied saying: 'Shen Gong received this book. Shen Gong is already dead.' The emperor said: 'What person is Shen Gong?' Qing said: 'Shen Gong is a Qi person. He communicated with An Qisheng and received the Yellow Emperor's words. There was no book, only this tripod book. It said 'When the Han rises again, it should be the Yellow Emperor's time. The Han sage is Gaozu's grandson and great grandson. The treasured tripod emerges and communicates with spirits, fengshan. Fengshan seventy two kings, only the Yellow Emperor was able to ascend Taishan for the seal.' Shen Gong said: 'The Han lord should also ascend and seal. If he ascends and seals, he will be able to ascend to heaven as an immortal.' In the Yellow Emperor's time there were ten thousand feudal lords, yet divine spirits' seals resided at seven thousand. The realm has eight famous mountains, three are among the barbarian yi, five are in the central states. In the central states: Huashan, Shoushan, Taishi, Taishan, Donglai. These five mountains were what the Yellow Emperor often toured, meeting with spirits. The Yellow Emperor moreover fought and moreover learned about immortals. He worried that commoners were not following his way, so he judged and executed those who were not ghosts and spirits. Over a hundred years later he was then able to communicate with spirits. The Yellow Emperor performed suburban sacrifices to the Supreme Deity at Yong, lodging for three months. Guiyu Qu was styled Great Hong. He died and was buried at Yong. Therefore the Hong tomb is it. Afterward it connected ten thousand spirits at the Yellow Emperor's bright court. The bright court is Ganquan. The so-called cold gate is the valley mouth. The Yellow Emperor collected copper from Shoushan and cast the tripod below Jing mountain. The tripod was already completed when a dragon hung its beard whiskers below and welcomed the Yellow Emperor. The Yellow Emperor mounted and rode. His ministers and harem followed, over seventy people ascended the dragon, and then went up. The remaining small ministers were not able to ascend, so they all held the dragon's whiskers. The dragon whiskers were pulled, dropping the Yellow Emperor's bow. The commoners gazed upward as the Yellow Emperor already ascended to heaven. They then embraced his bow and the dragon's beard whiskers and wailed. Therefore later generations named that place Ding Lake because of it, and his bow Wu Call.'' Thereupon the Son of Heaven said: 'Alas! If I could truly be like the Yellow Emperor, I would regard leaving my wife and children like removing shoes.' He then appointed Qing as a lang and sent him east to await spirits at Taishi.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0209",
          "zh": "上遂郊雍，至隴西，西登空桐，幸甘泉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then suburban Yong, arrived Longxi, west ascended Kongtong, fortunate Ganquan.",
              "idiomatic": "The emperor then performed suburban sacrifices at Yong, arrived at Longxi, west ascended Kongtong, and went to Ganquan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ordered sacrifice officials Kuanshu etc prepare Taiyi sacrifice altar, altar modeled Boji Taiyi altar, altar three layers.",
              "idiomatic": "He ordered the sacrifice officials Kuanshu and others to prepare the Taiyi sacrifice altar. The altar was modeled after Boji's Taiyi altar, with the altar in three layers.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。",
          "translations": [
            {
              "lang": "en",
              "literal": "Five Emperors altars encircled resided its below, each like their directions, Yellow Emperor southwest, except eight through ghost paths.",
              "idiomatic": "The Five Emperors' altars encircled and resided below it, each in their directions. The Yellow Emperor was southwest, except for the eight paths through to ghosts.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。",
          "translations": [
            {
              "lang": "en",
              "literal": "Taiyi what used, like Yong one altar things, yet added sweet wine dates dried meat kind, killed one yak ox to make sacrificial vessels ritual implements.",
              "idiomatic": "What Taiyi used was like Yong's one altar things, but added sweet wine, dates, dried meats and such. He killed one yak ox to make the sacrificial vessels and ritual implements.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "而五帝獨有俎豆醴進。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet Five Emperors alone had sacrificial vessels sweet wine advanced.",
              "idiomatic": "Yet the Five Emperors alone had sacrificial vessels and sweet wine advanced.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "其下四方地，為餟食群神從者及北斗云。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its below four directions earth, for meal food crowd spirits followers and Northern Dipper clouds.",
              "idiomatic": "Below it in the four directions of earth, for meal food for the crowd of spirits' followers and the Northern Dipper clouds.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "已祠，胙餘皆燎之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Already sacrificed, sacrificial meat remains all burned them.",
              "idiomatic": "After sacrificing, all remaining sacrificial meat was burned.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "其牛色白，鹿居其中，彘在鹿中，水而洎之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its ox color white, deer resided its middle, pigs in deer middle, water yet pour it.",
              "idiomatic": "Its ox was white in color. Deer resided in its middle, pigs in the deer middle, water and pour it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "祭日以牛，祭月以羊彘特。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sacrifice sun with ox, sacrifice moon with sheep pigs single.",
              "idiomatic": "Sacrificed to the sun with an ox, sacrificed to the moon with sheep and pigs singly.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "泰一祝宰則衣紫及繡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Taiyi prayer butcher then clothed purple and embroidery.",
              "idiomatic": "For Taiyi the prayer butcher then wore purple and embroidery.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "五帝各如其色，日赤，月白。",
          "translations": [
            {
              "lang": "en",
              "literal": "Five Emperors each like their colors, sun red, moon white.",
              "idiomatic": "The Five Emperors each followed their colors: the sun red, the moon white.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor then performed suburban sacrifices at Yong, arrived at Longxi, west ascended Kongtong, and went to Ganquan. He ordered the sacrifice officials Kuanshu and others to prepare the Taiyi sacrifice altar. The altar was modeled after Boji's Taiyi altar, with the altar in three layers. The Five Emperors' altars encircled and resided below it, each in their directions. The Yellow Emperor was southwest, except for the eight paths through to ghosts. What Taiyi used was like Yong's one altar things, but added sweet wine, dates, dried meats and such. He killed one yak ox to make the sacrificial vessels and ritual implements. Yet the Five Emperors alone had sacrificial vessels and sweet wine advanced. Below it in the four directions of earth, for meal food for the crowd of spirits' followers and the Northern Dipper clouds. After sacrificing, all remaining sacrificial meat was burned. Its ox was white in color. Deer resided in its middle, pigs in the deer middle, water and pour it. Sacrificed to the sun with an ox, sacrificed to the moon with sheep and pigs singly. For Taiyi the prayer butcher then wore purple and embroidery. The Five Emperors each followed their colors: the sun red, the moon white.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "十一月辛已朔旦冬至，昧爽，天子始郊拜泰一。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month xinsi new moon dawn winter solstice, before dawn bright, Son of Heaven first suburban bowed Taiyi.",
              "idiomatic": "On the eleventh month xinsi new moon dawn winter solstice, before dawn was bright, the Son of Heaven first suburban bowed to Taiyi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "朝朝日，夕夕月，則揖；",
          "translations": [
            {
              "lang": "en",
              "literal": "Morning worship sun, evening worship moon, then bow;",
              "idiomatic": "Morning worship the sun, evening worship the moon, then bow;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "而見泰一如雍禮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet see Taiyi like Yong ritual.",
              "idiomatic": "Yet seeing Taiyi was like the Yong ritual.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Its assist feast said: 'Heaven first with treasured tripod divine tally bestowed emperor, new moon and again new moon, ends yet repeats begins, emperor respectfully bows sees there.'",
              "idiomatic": "Its assist feast said: 'Heaven first bestowed the treasured tripod and divine tally to the emperor. New moon and again new moon, ends yet repeats begins, the emperor respectfully bows and sees there.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "而衣上黃。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet clothed above yellow.",
              "idiomatic": "Yet clothed above in yellow.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "其祠列火滿壇，壇旁烹炊具。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its sacrifice arranged fires filled altar, altar side cooking implements.",
              "idiomatic": "Its sacrifice arranged fires that filled the altar, with cooking implements at the altar side.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "有司云「祠上有光焉」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials said 'sacrifice above has light there.'",
              "idiomatic": "The officials said 'above the sacrifice there is light.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dukes ministers said 'emperor first suburban saw Taiyi Yunyang, officials presented jade good livestock recommended feast.",
              "idiomatic": "The dukes and ministers said 'the emperor first suburban saw Taiyi at Yunyang. The officials presented jade and good livestock for the recommended feast.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "是夜有美光，及晝，黃氣上屬天。」",
          "translations": [
            {
              "lang": "en",
              "literal": "That night had beautiful light, and day, yellow qi upward connected heaven.'",
              "idiomatic": "That night there was beautiful light, and by day, yellow qi rose up and connected to heaven.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。",
          "translations": [
            {
              "lang": "en",
              "literal": "Grand historian, sacrifice official Kuanshu etc said: 'Spirits auspiciousness, bless fortune omen good fortune, should because this place light domain establish Tai altar to bright response.",
              "idiomatic": "The Grand Historian and sacrifice official Kuanshu and others said: 'The spirits' auspiciousness brings blessing, fortune, omens, and good fortune. We should establish a Tai altar in this place of light domain to make the bright response clear.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "令太祝領，（祀）［秋］及臘閒祠。",
          "translations": [
            {
              "lang": "en",
              "literal": "Order grand prayer lead, autumn and lacquer between sacrifice.",
              "idiomatic": "Order the grand prayer to lead, sacrifice between autumn and lacquer.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "三歲天子一郊見。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Three years Son of Heaven once suburban see.'",
              "idiomatic": "Every three years the Son of Heaven once suburban sees.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "On the eleventh month xinsi new moon dawn winter solstice, before dawn was bright, the Son of Heaven first suburban bowed to Taiyi. Morning worship the sun, evening worship the moon, then bow; Yet seeing Taiyi was like the Yong ritual. Its assist feast said: 'Heaven first bestowed the treasured tripod and divine tally to the emperor. New moon and again new moon, ends yet repeats begins, the emperor respectfully bows and sees there.' Yet clothed above in yellow. Its sacrifice arranged fires that filled the altar, with cooking implements at the altar side. The officials said 'above the sacrifice there is light.' The dukes and ministers said 'the emperor first suburban saw Taiyi at Yunyang. The officials presented jade and good livestock for the recommended feast. That night there was beautiful light, and by day, yellow qi rose up and connected to heaven.' The Grand Historian and sacrifice official Kuanshu and others said: 'The spirits' auspiciousness brings blessing, fortune, omens, and good fortune. We should establish a Tai altar in this place of light domain to make the bright response clear. Order the grand prayer to lead, sacrifice between autumn and lacquer. Every three years the Son of Heaven once suburban sees.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0232",
          "zh": "其秋，為伐南越，告禱泰一，以牡荊畫幡日月北斗登龍，以象天一三星，為泰一鋒，名曰「靈旗」。",
          "translations": [
            {
              "lang": "en",
              "literal": "That autumn, for attacking Nanyue, informed prayed Taiyi, with male Jing painted banners sun moon Northern Dipper ascending dragon, to resemble Tianyi three stars, made Taiyi spearhead, named 'spirit banner.'",
              "idiomatic": "That autumn, for attacking Nanyue, they informed and prayed to Taiyi. With male Jing they painted banners of sun, moon, Northern Dipper, ascending dragon to resemble the Tianyi three stars. They made it Taiyi's spearhead, named 'Spirit Banner.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "為兵禱，則太史奉以指所伐國。",
          "translations": [
            {
              "lang": "en",
              "literal": "For troops prayed, then grand scribe presented with pointed to attacked country.",
              "idiomatic": "When praying for troops, the grand scribe presented it and pointed to the country being attacked.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "而五利將軍使不敢入海，之泰山祠。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet Wuli general envoy not dare enter sea, went Taishan sacrifice.",
              "idiomatic": "Yet the Wuli general's envoy did not dare enter the sea and went to Taishan to sacrifice.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "上使人微隨驗，實無所見。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor made people secretly follow verify, truly nothing seen.",
              "idiomatic": "The emperor had people secretly follow and verify, truly nothing was seen.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "五利妄言見其師，其方盡，多不讎。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuli falsely spoke saw his master, his methods exhausted, many not match.",
              "idiomatic": "Wuli falsely spoke of seeing his master. His methods were exhausted and many did not match.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "上乃誅五利。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then executed Wuli.",
              "idiomatic": "The emperor then executed Wuli.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That autumn, for attacking Nanyue, they informed and prayed to Taiyi. With male Jing they painted banners of sun, moon, Northern Dipper, ascending dragon to resemble the Tianyi three stars. They made it Taiyi's spearhead, named 'Spirit Banner.' When praying for troops, the grand scribe presented it and pointed to the country being attacked. Yet the Wuli general's envoy did not dare enter the sea and went to Taishan to sacrifice. The emperor had people secretly follow and verify, truly nothing was seen. Wuli falsely spoke of seeing his master. His methods were exhausted and many did not match. The emperor then executed Wuli.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "其冬，公孫卿候神河南，見僊人跡緱氏城上，有物若雉，往來城上。",
          "translations": [
            {
              "lang": "en",
              "literal": "That winter, Gongsun Qing awaited spirits Henan south, saw immortal person traces Gou city above, had thing like pheasant, coming going city above.",
              "idiomatic": "That winter, Gongsun Qing awaited spirits south of Henan and saw immortal person traces above Gou city. There was a thing like a pheasant, coming and going above the city.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "天子親幸緱氏城視跡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven personally fortunate Gou city viewed traces.",
              "idiomatic": "The Son of Heaven personally went to Gou city to view the traces.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "問卿：「得毋效文成、五利乎？」",
          "translations": [
            {
              "lang": "en",
              "literal": "Asked Qing: 'Able not imitate Wencheng, Wuli huh?'",
              "idiomatic": "He asked Qing: 'Can you not imitate Wencheng and Wuli?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "卿曰：「僊者非有求人主，人主求之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qing said: 'Immortals not have seek ruler, ruler seeks them.",
              "idiomatic": "Qing said: 'Immortals do not seek the ruler, the ruler seeks them.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "其道非少寬假，神不來。",
          "translations": [
            {
              "lang": "en",
              "literal": "Their way not little broad lenient, spirits not come.",
              "idiomatic": "Their way is not a little broad and lenient, spirits do not come.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "言神事，事如迂誕，積以歲乃可致。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Speak spirit matters, matters like circuitous fantastic, accumulate with years then able attain.'",
              "idiomatic": "Speaking of spirit matters, matters are like circuitous and fantastic. Accumulate with years and then they can be attained.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "於是郡國各除道，繕治宮觀名山神祠所，以望幸矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon commanderies kingdoms each cleared roads, repaired palaces temples famous mountains spirit shrines places, to await fortune.",
              "idiomatic": "Thereupon the commanderies and kingdoms each cleared roads and repaired palaces, temples, famous mountains, and spirit shrine places to await fortune.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That winter, Gongsun Qing awaited spirits south of Henan and saw immortal person traces above Gou city. There was a thing like a pheasant, coming and going above the city. The Son of Heaven personally went to Gou city to view the traces. He asked Qing: 'Can you not imitate Wencheng and Wuli?' Qing said: 'Immortals do not seek the ruler, the ruler seeks them. Their way is not a little broad and lenient, spirits do not come. Speaking of spirit matters, matters are like circuitous and fantastic. Accumulate with years and then they can be attained.' Thereupon the commanderies and kingdoms each cleared roads and repaired palaces, temples, famous mountains, and spirit shrine places to await fortune.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0245",
          "zh": "其年，既滅南越，上有嬖臣李延年以好音見。",
          "translations": [
            {
              "lang": "en",
              "literal": "That year, already extinguished Nanyue, emperor had favorite minister Li Yannian with good music seen.",
              "idiomatic": "That year, having already extinguished Nanyue, the emperor had a favorite minister Li Yannian who was seen for his good music.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor approved it, sent down dukes ministers discuss, said: 'Commoner between sacrifices still have drum dance music, now suburban sacrifice yet no music, how worthy huh?'",
              "idiomatic": "The emperor approved it and sent it down for the dukes and ministers to discuss, saying: 'Common sacrifices still have drum and dance music. Now suburban sacrifices have no music. How is this worthy?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Dukes ministers said: 'Ancient ones sacrificed heaven earth all had music, yet spirits can obtain and ritual.'",
              "idiomatic": "The dukes and ministers said: 'The ancient ones sacrificed to heaven and earth and all had music, yet spirits could be obtained and ritualed.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Some said: 'Tai emperor made Su Nu strum fifty string se, sad, emperor forbade not stop, therefore broke his se into twenty five strings.'",
              "idiomatic": "Some said: 'The Tai emperor made Su Nu strum a fifty-string se. It was sad. The emperor forbade it but it did not stop. Therefore he broke his se into twenty-five strings.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "於是塞南越，禱祠泰一、后土，始用樂舞，益召歌兒，作二十五弦及箜篌瑟自此起。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon blocked Nanyue, prayed sacrificed Taiyi, Houtu, first used music dance, increased summoned song children, made twenty five strings and konghou se from this began.",
              "idiomatic": "Thereupon blocked Nanyue, prayed and sacrificed to Taiyi and Houtu. First used music and dance, increased summoned song children, made twenty-five strings and konghou se from this began.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That year, having already extinguished Nanyue, the emperor had a favorite minister Li Yannian who was seen for his good music. The emperor approved it and sent it down for the dukes and ministers to discuss, saying: 'Common sacrifices still have drum and dance music. Now suburban sacrifices have no music. How is this worthy?' The dukes and ministers said: 'The ancient ones sacrificed to heaven and earth and all had music, yet spirits could be obtained and ritualed.' Some said: 'The Tai emperor made Su Nu strum a fifty-string se. It was sad. The emperor forbade it but it did not stop. Therefore he broke his se into twenty-five strings.' Thereupon blocked Nanyue, prayed and sacrificed to Taiyi and Houtu. First used music and dance, increased summoned song children, made twenty-five strings and konghou se from this began.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "其來年冬，上議曰：「古者先振兵澤旅，然後封禪。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Its next year winter, emperor discussed said: 'Ancient ones first shook troops moistened army, then fengshan.'",
              "idiomatic": "Its next year winter, the emperor discussed and said: 'The ancient ones first shook the troops and moistened the army, then fengshan.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then then north toured Shuofang, drilled troops ten remaining ten thousand, returned sacrificed Yellow Emperor tomb Qiao mountain, moistened troops Xu Ru.",
              "idiomatic": "He then toured north to Shuofang, drilled over ten thousand troops, returned and sacrificed at the Yellow Emperor's tomb at Qiao mountain, moistened the troops at Xu Ru.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "上曰：「吾聞黃帝不死，今有冢，何也？」",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor said: 'I heard Yellow Emperor not die, now has tomb, what also?'",
              "idiomatic": "The emperor said: 'I heard the Yellow Emperor does not die. Now he has a tomb. What is this?'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Some replied said: 'Yellow Emperor already immortal ascended heaven, ministers buried his clothes hat.'",
              "idiomatic": "Some replied saying: 'The Yellow Emperor already ascended to heaven as an immortal. His ministers buried his clothes and hat.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "即至甘泉，為且用事泰山，先類祠泰一。",
          "translations": [
            {
              "lang": "en",
              "literal": "Immediately arrived Ganquan, for about use affairs Taishan, first similar sacrifice Taiyi.",
              "idiomatic": "Immediately arrived at Ganquan, for about to use affairs at Taishan, first similar sacrifice to Taiyi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its next year winter, the emperor discussed and said: 'The ancient ones first shook the troops and moistened the army, then fengshan.' He then toured north to Shuofang, drilled over ten thousand troops, returned and sacrificed at the Yellow Emperor's tomb at Qiao mountain, moistened the troops at Xu Ru. The emperor said: 'I heard the Yellow Emperor does not die. Now he has a tomb. What is this?' Some replied saying: 'The Yellow Emperor already ascended to heaven as an immortal. His ministers buried his clothes and hat.' Immediately arrived at Ganquan, for about to use affairs at Taishan, first similar sacrifice to Taiyi.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0255",
          "zh": "自得寶鼎，上與公卿諸生議封禪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Since obtained treasured tripod, emperor with dukes ministers various scholars discussed fengshan.",
              "idiomatic": "Since obtaining the treasured tripod, the emperor discussed fengshan with dukes, ministers, and various scholars.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fengshan used rare vast far, none know its ritual etiquette, yet crowd Confucians gathered fengshan Documents, Zhou officials, king systems hope sacrifice shoot ox matters.",
              "idiomatic": "Fengshan used rare and vast things far removed. None knew its ritual etiquette. Yet the crowd of Confucians gathered fengshan Documents, Zhou officials, king systems' hope sacrifices and shoot ox matters.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "齊人丁公年九十餘，曰：「封者，合不死之名也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qi person Ding Gong age ninety remaining, said: 'Feng is, unite not die name also.",
              "idiomatic": "The Qi person Ding Gong, age over ninety, said: 'Feng is uniting the name of not dying.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "秦皇帝不得上封。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qin emperor not able ascend feng.",
              "idiomatic": "The Qin emperor was not able to ascend for feng.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "陛下必欲上，稍上即無風雨，遂上封矣。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Your majesty must wish ascend, gradually ascend then no wind rain, then ascend feng.'",
              "idiomatic": "If your majesty must wish to ascend, gradually ascend and there will be no wind or rain, then ascend for feng.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "上於是乃令諸儒習射牛，草封禪儀。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor thereupon then ordered various Confucians practice shoot ox, draft fengshan ritual.",
              "idiomatic": "The emperor thereupon ordered the various Confucians to practice shooting the ox and draft the fengshan ritual.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "數年，至且行。",
          "translations": [
            {
              "lang": "en",
              "literal": "Several years, arrived about to go.",
              "idiomatic": "Several years later, arrived and about to go.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven already heard Gongsun Qing and fangshi words, Yellow Emperor above fengshan, all brought marvelous things communicated with spirits, wished imitate Yellow Emperor to taste connect divine immortal people Penglai scholars, high world compared virtue to nine sovereigns, yet rather gathered Confucian arts to civilize it.",
              "idiomatic": "The Son of Heaven had already heard Gongsun Qing and the fangshi's words. From the Yellow Emperor above, fengshan all brought marvelous things and communicated with spirits. He wished to imitate the Yellow Emperor to taste connecting with divine immortal people Penglai scholars, high world compared virtue to the nine sovereigns, yet rather gathered Confucian arts to civilize it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。",
          "translations": [
            {
              "lang": "en",
              "literal": "Crowd Confucians already because could not debate clarify fengshan matters, moreover restrained by poetry books ancient texts not dare gallop.",
              "idiomatic": "The crowd of Confucians already because they could not debate and clarify fengshan matters, moreover were restrained by poetry books and ancient texts and did not dare to gallop.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "上為封祠器示群儒，群儒或曰「不與古同」，徐偃又曰「太常諸生行禮不如魯善」，周霸屬圖封事，於是上絀偃、霸，盡罷諸儒弗用。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor made feng sacrifice vessels showed crowd Confucians, crowd Confucians some said 'not with ancient same', Xu Yan moreover said 'grand constant various scholars performed ritual not like Lu good', Zhou Ba drew diagrams feng matters, thereupon emperor demoted Yan, Ba, completely dismissed various Confucians not used.",
              "idiomatic": "The emperor made feng sacrifice vessels and showed them to the crowd of Confucians. The crowd of Confucians some said 'not the same as ancient times'. Xu Yan moreover said 'The grand constant's various scholars performed ritual not as good as Lu'. Zhou Ba drew diagrams of feng matters. Thereupon the emperor demoted Yan and Ba, completely dismissed the various Confucians and did not use them.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Since obtaining the treasured tripod, the emperor discussed fengshan with dukes, ministers, and various scholars. Fengshan used rare and vast things far removed. None knew its ritual etiquette. Yet the crowd of Confucians gathered fengshan Documents, Zhou officials, king systems' hope sacrifices and shoot ox matters. The Qi person Ding Gong, age over ninety, said: 'Feng is uniting the name of not dying. The Qin emperor was not able to ascend for feng. If your majesty must wish to ascend, gradually ascend and there will be no wind or rain, then ascend for feng.' The emperor thereupon ordered the various Confucians to practice shooting the ox and draft the fengshan ritual. Several years later, arrived and about to go. The Son of Heaven had already heard Gongsun Qing and the fangshi's words. From the Yellow Emperor above, fengshan all brought marvelous things and communicated with spirits. He wished to imitate the Yellow Emperor to taste connecting with divine immortal people Penglai scholars, high world compared virtue to the nine sovereigns, yet rather gathered Confucian arts to civilize it. The crowd of Confucians already because they could not debate and clarify fengshan matters, moreover were restrained by poetry books and ancient texts and did not dare to gallop. The emperor made feng sacrifice vessels and showed them to the crowd of Confucians. The crowd of Confucians some said 'not the same as ancient times'. Xu Yan moreover said 'The grand constant's various scholars performed ritual not as good as Lu'. Zhou Ba drew diagrams of feng matters. Thereupon the emperor demoted Yan and Ba, completely dismissed the various Confucians and did not use them.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0265",
          "zh": "三月，遂東幸緱氏，禮登中嶽太室。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, then east fortunate Gou Shi, ritual ascended central peak Taishi.",
              "idiomatic": "In the third month, he then went east to Gou Shi, ritual ascended the central peak Taishi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "從官在山下聞若有言「萬歲」云。",
          "translations": [
            {
              "lang": "en",
              "literal": "Following officials at mountain below heard as if had words 'ten thousand years' cloud.",
              "idiomatic": "Following officials at the mountain below heard as if there were words 'ten thousand years' and clouds.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "問上，上不言；",
          "translations": [
            {
              "lang": "en",
              "literal": "Asked upper, upper not speak;",
              "idiomatic": "Asked the upper ones, the upper ones did not speak;",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "問下，下不言。",
          "translations": [
            {
              "lang": "en",
              "literal": "Asked lower, lower not speak.",
              "idiomatic": "Asked the lower ones, the lower ones did not speak.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "於是以三百戶封太室奉祠，命曰崇高邑。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon with three hundred households sealed Taishi served sacrifice, named Chonggao yi.",
              "idiomatic": "Thereupon with three hundred households sealed Taishi to serve the sacrifice, named Chonggao yi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "東上泰山，山之草木葉未生，乃令人上石立之泰山顛。",
          "translations": [
            {
              "lang": "en",
              "literal": "East ascended Taishan, mountain grass trees leaves not yet born, then made people ascend stone stood it Taishan peak.",
              "idiomatic": "East ascended Taishan. The mountain's grass and tree leaves had not yet been born. Then made people ascend and stone stood it at Taishan's peak.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the third month, he then went east to Gou Shi, ritual ascended the central peak Taishi. Following officials at the mountain below heard as if there were words 'ten thousand years' and clouds. Asked the upper ones, the upper ones did not speak; Asked the lower ones, the lower ones did not speak. Thereupon with three hundred households sealed Taishi to serve the sacrifice, named Chonggao yi. East ascended Taishan. The mountain's grass and tree leaves had not yet been born. Then made people ascend and stone stood it at Taishan's peak.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0271",
          "zh": "上遂東巡海上，行禮祠八神。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then east toured sea above, performed ritual sacrificed eight spirits.",
              "idiomatic": "The emperor then toured east above the sea, performed ritual and sacrificed to eight spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "齊人之上疏言神怪奇方者以萬數，然無驗者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Qi people submitted memorials spoke spirit strange marvelous methods ones by ten thousand count, yet none verified ones.",
              "idiomatic": "Qi people's submitted memorials spoke of spirit strange marvelous methods ones counted in ten thousands, yet none were verified.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "乃益發船，令言海中神山者數千人求蓬萊神人。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then increased sent ships, ordered spoke sea middle divine mountains ones several thousand people sought Penglai divine people.",
              "idiomatic": "He then increased and sent ships, ordered those who spoke of divine mountains in the sea middle - several thousand people - to seek Penglai divine people.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gongsun Qing held tally often first went awaited famous mountains, arrived Donglai, said night saw one person, length several zhang, approached it then not seen, saw its traces very large, resembled bird beast cloud.",
              "idiomatic": "Gongsun Qing held tally and often went first to await famous mountains. Arrived at Donglai, said at night saw one person, length several zhang. Approached it and then it was not seen. Saw its traces very large, resembled bird and beast clouds.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。",
          "translations": [
            {
              "lang": "en",
              "literal": "Crowd ministers had words saw one old father led dog, said 'I wish see great duke', already suddenly not seen.",
              "idiomatic": "The crowd of ministers had words of seeing one old father leading a dog, said 'I wish to see the great duke'. Already suddenly not seen.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor already saw big traces, not believed, and crowd ministers had words old father, then greatly took as immortal person.",
              "idiomatic": "The emperor had already seen the big traces but did not believe. And the crowd of ministers had words about an old father, then greatly took it as an immortal person.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "宿留海上，與方士傳車及閒使求僊人以千數。",
          "translations": [
            {
              "lang": "en",
              "literal": "Lodged remained sea above, with fangshi transmitted carriages and idle envoys sought immortals by thousand count.",
              "idiomatic": "Lodged and remained above the sea, with fangshi transmitted carriages and idle envoys sought immortals by the thousand count.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor then toured east above the sea, performed ritual and sacrificed to eight spirits. Qi people's submitted memorials spoke of spirit strange marvelous methods ones counted in ten thousands, yet none were verified. He then increased and sent ships, ordered those who spoke of divine mountains in the sea middle - several thousand people - to seek Penglai divine people. Gongsun Qing held tally and often went first to await famous mountains. Arrived at Donglai, said at night saw one person, length several zhang. Approached it and then it was not seen. Saw its traces very large, resembled bird and beast clouds. The crowd of ministers had words of seeing one old father leading a dog, said 'I wish to see the great duke'. Already suddenly not seen. The emperor had already seen the big traces but did not believe. And the crowd of ministers had words about an old father, then greatly took it as an immortal person. Lodged and remained above the sea, with fangshi transmitted carriages and idle envoys sought immortals by the thousand count.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0278",
          "zh": "四月，還至奉高。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fourth month, returned to Fenggao.",
              "idiomatic": "In the fourth month, returned to Fenggao.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "上念諸儒及方士言封禪人人殊，不經，難施行。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor pondered various Confucians and fangshi spoke fengshan each person different, not orthodox, difficult to carry out.",
              "idiomatic": "The emperor pondered that the various Confucians and fangshi spoke of fengshan each person differently, not orthodox, difficult to carry out.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "天子至梁父，禮祠地主。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven arrived Liangfu, ritual sacrificed earth lord.",
              "idiomatic": "The Son of Heaven arrived at Liangfu and ritual sacrificed to the earth lord.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "乙卯，令侍中儒者皮弁薦紳，射牛行事。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yi mao, ordered attendant middle Confucian leather crown recommended sashes, shoot ox carried out matters.",
              "idiomatic": "On yi mao, ordered the attendant middle Confucians to wear leather crowns and recommended sashes, shoot the ox and carry out matters.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "封泰山下東方，如郊祠泰一之禮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Feng Taishan below eastern, like suburban sacrifice Taiyi ritual.",
              "idiomatic": "Feng at Taishan below eastern, like the suburban sacrifice Taiyi ritual.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。",
          "translations": [
            {
              "lang": "en",
              "literal": "Feng broad zhang two chi, high nine chi, its below then had jade tablets book, book secret.",
              "idiomatic": "Feng was broad one zhang two chi, high nine chi. Below it then had jade tablets book, the book was secret.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ritual finished, Son of Heaven alone with attendant middle carriage presenting marquis ascended Taishan, also had feng.",
              "idiomatic": "Ritual finished, the Son of Heaven alone with the attendant middle carriage presenting marquis ascended Taishan, also had feng.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "其事皆禁。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its matters all forbidden.",
              "idiomatic": "Its matters were all forbidden.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "明日，下陰道。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next day, descended yin path.",
              "idiomatic": "The next day, descended the yin path.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingchen, shan Taishan below zhi northeast Suran mountain, like sacrificed Houtu ritual.",
              "idiomatic": "On bingchen, shan at Taishan below zhi northeast Suran mountain, like the sacrificed Houtu ritual.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "天子皆親拜見，衣上黃而盡用樂焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven all personally bowed saw, clothed above yellow and completely used music there.",
              "idiomatic": "The Son of Heaven all personally bowed and saw, clothed above in yellow and completely used music there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "江淮閒一茅三脊為神藉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jiang Huai between one thatch three ridges made spirit mat.",
              "idiomatic": "Between Jiang and Huai, one thatch with three ridges made the spirit mat.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "五色土益雜封。",
          "translations": [
            {
              "lang": "en",
              "literal": "Five colors earth increased mixed feng.",
              "idiomatic": "Five colored earth increased and mixed for feng.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。",
          "translations": [
            {
              "lang": "en",
              "literal": "Released distant regions marvelous beasts flying birds and white pheasants various things, rather used to add sacrifice.",
              "idiomatic": "Released distant regions' marvelous beasts, flying birds, and white pheasants various things, rather used them to add to the sacrifice.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "兕旄牛犀象之屬弗用。",
          "translations": [
            {
              "lang": "en",
              "literal": "Si mao oxen rhinoceros elephants kind not used.",
              "idiomatic": "Si, mao oxen, rhinoceroses, elephants and such were not used.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "皆至泰山然後去。",
          "translations": [
            {
              "lang": "en",
              "literal": "All arrived Taishan then left.",
              "idiomatic": "All arrived at Taishan and then left.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "封禪祠，其夜若有光，晝有白雲起封中。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fengshan sacrifice, its night as if had light, day had white clouds rise feng middle.",
              "idiomatic": "Fengshan sacrifice, its night as if there was light, by day there were white clouds rising in the feng middle.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the fourth month, returned to Fenggao. The emperor pondered that the various Confucians and fangshi spoke of fengshan each person differently, not orthodox, difficult to carry out. The Son of Heaven arrived at Liangfu and ritual sacrificed to the earth lord. On yi mao, ordered the attendant middle Confucians to wear leather crowns and recommended sashes, shoot the ox and carry out matters. Feng at Taishan below eastern, like the suburban sacrifice Taiyi ritual. Feng was broad one zhang two chi, high nine chi. Below it then had jade tablets book, the book was secret. Ritual finished, the Son of Heaven alone with the attendant middle carriage presenting marquis ascended Taishan, also had feng. Its matters were all forbidden. The next day, descended the yin path. On bingchen, shan at Taishan below zhi northeast Suran mountain, like the sacrificed Houtu ritual. The Son of Heaven all personally bowed and saw, clothed above in yellow and completely used music there. Between Jiang and Huai, one thatch with three ridges made the spirit mat. Five colored earth increased and mixed for feng. Released distant regions' marvelous beasts, flying birds, and white pheasants various things, rather used them to add to the sacrifice. Si, mao oxen, rhinoceroses, elephants and such were not used. All arrived at Taishan and then left. Fengshan sacrifice, its night as if there was light, by day there were white clouds rising in the feng middle.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "天子從封禪還，坐明堂，群臣更上壽。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven from fengshan returned, sat bright hall, crowd ministers again presented long life.",
              "idiomatic": "The Son of Heaven returned from fengshan, sat in the bright hall, the crowd of ministers again presented long life.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon formulated edict imperial secretary: 'I with tiny tiny body bear utmost honored, trembling fear not able to bear.",
              "idiomatic": "Thereupon formulated an edict to the imperial secretary: 'I with my tiny body bear the utmost honored position, trembling in fear that I am not able to bear it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "維德菲薄，不明于禮樂。",
          "translations": [
            {
              "lang": "en",
              "literal": "Only virtue meager thin, not clear about ritual music.",
              "idiomatic": "Only my virtue is meager and thin, not clear about ritual and music.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。",
          "translations": [
            {
              "lang": "en",
              "literal": "Repaired sacrificed Taiyi, as if had image scene light, bits like had hope, faintly shaken by marvelous things, wished to stop not dare, then ascended feng Taishan, arrived at Liangfu, and then shan Suran.",
              "idiomatic": "Repaired and sacrificed to Taiyi, as if there were image scene light, bits like there was hope, faintly shaken by marvelous things, wished to stop but did not dare, then ascended and feng at Taishan, arrived at Liangfu, and then shan at Suran.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。",
          "translations": [
            {
              "lang": "en",
              "literal": "Self renew, praise with scholars great men renew beginning, granted people hundred households ox one wine ten stones, add age eighty orphans widows cloth silk two bolts.",
              "idiomatic": "Renew myself, praise and with scholars and great men renew the beginning, granted to people: hundred households one ox and ten stones of wine, add for age eighty orphans and widows two bolts of cloth and silk.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "復博、奉高、蛇丘、歷城，毋出今年租稅。",
          "translations": [
            {
              "lang": "en",
              "literal": "Exempt Bo, Fenggao, Sheqiu, Licheng, do not pay this year rents taxes.",
              "idiomatic": "Exempt Bo, Fenggao, Sheqiu, Licheng from paying this year's rents and taxes.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "其赦天下，如乙卯赦令。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its amnesty realm, like yi mao amnesty order.",
              "idiomatic": "Its amnesty the realm, like the yi mao amnesty order.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "行所過毋有復作。",
          "translations": [
            {
              "lang": "en",
              "literal": "Travel what passed do not have repeat work.",
              "idiomatic": "What the travel passed, do not have repeat work.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "事在二年前，皆勿聽治。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Matters in two years before, all do not listen govern.'",
              "idiomatic": "Matters from two years before, all do not listen to and govern.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover issued edict said: 'Ancient ones Son of Heaven five years one inspection tour, used affairs Taishan, feudal lords had court lodging places.",
              "idiomatic": "Moreover issued an edict saying: 'The ancient Sons of Heaven once every five years made inspection tours, used affairs at Taishan, feudal lords had court lodging places.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "其令諸侯各治邸泰山下。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let command feudal lords each repair lodgings Taishan below.'",
              "idiomatic": "Let command the feudal lords each to repair lodgings below Taishan.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Son of Heaven returned from fengshan, sat in the bright hall, the crowd of ministers again presented long life. Thereupon formulated an edict to the imperial secretary: 'I with my tiny body bear the utmost honored position, trembling in fear that I am not able to bear it. Only my virtue is meager and thin, not clear about ritual and music. Repaired and sacrificed to Taiyi, as if there were image scene light, bits like there was hope, faintly shaken by marvelous things, wished to stop but did not dare, then ascended and feng at Taishan, arrived at Liangfu, and then shan at Suran. Renew myself, praise and with scholars and great men renew the beginning, granted to people: hundred households one ox and ten stones of wine, add for age eighty orphans and widows two bolts of cloth and silk. Exempt Bo, Fenggao, Sheqiu, Licheng from paying this year's rents and taxes. Its amnesty the realm, like the yi mao amnesty order. What the travel passed, do not have repeat work. Matters from two years before, all do not listen to and govern.' Moreover issued an edict saying: 'The ancient Sons of Heaven once every five years made inspection tours, used affairs at Taishan, feudal lords had court lodging places. Let command the feudal lords each to repair lodgings below Taishan.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0306",
          "zh": "天子既已封禪泰山，無風雨菑，而方士更言蓬萊諸神山若將可得，於是上欣然庶幾遇之，乃復東至海上望，冀遇蓬萊焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven already feng shan Taishan, no wind rain disaster, yet fangshi moreover spoke Penglai various divine mountains as if about obtainable, thereupon emperor joyfully almost encountered it, then again east to sea above gazed, hoped encountered Penglai there.",
              "idiomatic": "The Son of Heaven had already feng and shan at Taishan, no wind rain disaster, yet the fangshi moreover spoke that Penglai's various divine mountains were as if about to be obtainable. Thereupon the emperor joyfully hoped to encounter them, then again went east to gaze above the sea, hoping to encounter Penglai there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "奉車子侯暴病，一日死。",
          "translations": [
            {
              "lang": "en",
              "literal": "Carriage presenting marquis suddenly ill, one day died.",
              "idiomatic": "The carriage presenting marquis suddenly fell ill and died in one day.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then then left, along sea above, north to Jieshi, toured from Liaoxi, traversed northern border to Jiuyuan.",
              "idiomatic": "The emperor then left, along above the sea, north to Jieshi, toured from Liaoxi, traversed the northern border to Jiuyuan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "五月，返至甘泉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, returned to Ganquan.",
              "idiomatic": "In the fifth month, returned to Ganquan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "有司言寶鼎出為元鼎，以今年為元封元年。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials said treasured tripod emerged made Yuanding, with this year as Yuanfeng first year.",
              "idiomatic": "The officials said the treasured tripod emerged and was made Yuanding, with this year as Yuanfeng first year.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Son of Heaven had already feng and shan at Taishan, no wind rain disaster, yet the fangshi moreover spoke that Penglai's various divine mountains were as if about to be obtainable. Thereupon the emperor joyfully hoped to encounter them, then again went east to gaze above the sea, hoping to encounter Penglai there. The carriage presenting marquis suddenly fell ill and died in one day. The emperor then left, along above the sea, north to Jieshi, toured from Liaoxi, traversed the northern border to Jiuyuan. In the fifth month, returned to Ganquan. The officials said the treasured tripod emerged and was made Yuanding, with this year as Yuanfeng first year.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0311",
          "zh": "其秋，有星茀于東井。",
          "translations": [
            {
              "lang": "en",
              "literal": "That autumn, had star fu at eastern well.",
              "idiomatic": "That autumn, there was a star fu at eastern well.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "後十餘日，有星茀于三能。",
          "translations": [
            {
              "lang": "en",
              "literal": "After ten remaining days, had star fu at three neng.",
              "idiomatic": "After over ten days, there was a star fu at three neng.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Qi gazer Wang Shuo said: 'Waited alone saw its star emerge like gourd, eat period again entered there.'",
              "idiomatic": "The qi gazer Wang Shuo said: 'Waited and alone saw its star emerge like a gourd, for an eating period and again entered there.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "有司言曰：「陛下建漢家封禪，天其報德星雲。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials said: 'Your majesty established Han house fengshan, heaven will repay virtue star clouds.'",
              "idiomatic": "The officials said: 'Your majesty established the Han house fengshan. Heaven will repay virtue with star clouds.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That autumn, there was a star fu at eastern well. After over ten days, there was a star fu at three neng. The qi gazer Wang Shuo said: 'Waited and alone saw its star emerge like a gourd, for an eating period and again entered there.' The officials said: 'Your majesty established the Han house fengshan. Heaven will repay virtue with star clouds.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0315",
          "zh": "其來年冬，郊雍五帝，還，拜祝祠泰一。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its next year winter, suburban Yong five emperors, returned, bowed blessed sacrificed Taiyi.",
              "idiomatic": "Its next year winter, suburban sacrificed to Yong's five emperors, returned, bowed and blessed sacrificed to Taiyi.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "贊饗曰：「德星昭衍，厥維休祥。",
          "translations": [
            {
              "lang": "en",
              "literal": "Assist feast said: 'Virtue star bright extended, its only auspicious good fortune.",
              "idiomatic": "Assist feast said: 'Virtue star bright and extended, its only auspicious good fortune.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "壽星仍出，淵耀光明。",
          "translations": [
            {
              "lang": "en",
              "literal": "Longevity star repeatedly emerged, deep shone bright.",
              "idiomatic": "Longevity star repeatedly emerged, deeply shone brightly.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "信星昭見，皇帝敬拜泰祝之饗。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Faith star bright seen, emperor respectfully bowed great blessing feast.'",
              "idiomatic": "Faith star bright seen, emperor respectfully bowed the great blessing feast.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its next year winter, suburban sacrificed to Yong's five emperors, returned, bowed and blessed sacrificed to Taiyi. Assist feast said: 'Virtue star bright and extended, its only auspicious good fortune. Longevity star repeatedly emerged, deeply shone brightly. Faith star bright seen, emperor respectfully bowed the great blessing feast.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0319",
          "zh": "其春，公孫卿言見神人東萊山，若云「見天子」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its spring, Gongsun Qing said saw divine person Donglai mountain, as if said 'saw Son of Heaven.'",
              "idiomatic": "Its spring, Gongsun Qing said saw a divine person at Donglai mountain, as if saying 'saw the Son of Heaven.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "天子於是幸緱氏城，拜卿為中大夫。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven thereupon fortunate Gou city, appointed Qing as middle grand master.",
              "idiomatic": "The Son of Heaven thereupon went to Gou city, appointed Qing as middle grand master.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "遂至東萊，宿留之數日，毋所見，見大人跡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then arrived Donglai, lodged remained it several days, nothing seen, saw great person traces.",
              "idiomatic": "Then arrived at Donglai, lodged and remained there several days, nothing seen, saw great person traces.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "復遣方士求神怪采芝藥以千數。",
          "translations": [
            {
              "lang": "en",
              "literal": "Again sent fangshi seek divine strange gather ganoderma medicines by thousand count.",
              "idiomatic": "Again sent fangshi to seek divine strange things and gather ganoderma medicines by the thousand count.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "是歲旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year drought.",
              "idiomatic": "This year there was drought.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0324",
          "zh": "於是天子既出毋名，乃禱萬里沙，過祠泰山。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Son of Heaven already went out no fame, then prayed Wanli Sha, passed sacrificed Taishan.",
              "idiomatic": "Thereupon the Son of Heaven had already gone out without fame, then prayed at Wanli Sha, passed and sacrificed at Taishan.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "還至瓠子，自臨塞決河，留二日，沈祠而去。",
          "translations": [
            {
              "lang": "en",
              "literal": "Returned to Huzi, personally oversaw blocked breached river, stayed two days, sank sacrificed and left.",
              "idiomatic": "Returned to Huzi, personally oversaw blocking the breached river, stayed two days, sank sacrificed and left.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "使二卿將卒塞決河，河徙二渠，復禹之故跡焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Made two ministers lead troops block breached river, river moved two channels, restored Yu old traces there.",
              "idiomatic": "Made two ministers lead troops to block the breached river. The river moved to two channels, restored Yu's old traces there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its spring, Gongsun Qing said saw a divine person at Donglai mountain, as if saying 'saw the Son of Heaven.' The Son of Heaven thereupon went to Gou city, appointed Qing as middle grand master. Then arrived at Donglai, lodged and remained there several days, nothing seen, saw great person traces. Again sent fangshi to seek divine strange things and gather ganoderma medicines by the thousand count. This year there was drought. Thereupon the Son of Heaven had already gone out without fame, then prayed at Wanli Sha, passed and sacrificed at Taishan. Returned to Huzi, personally oversaw blocking the breached river, stayed two days, sank sacrificed and left. Made two ministers lead troops to block the breached river. The river moved to two channels, restored Yu's old traces there.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0327",
          "zh": "是時既滅南越，越人勇之乃言「越人俗信鬼，而其祠皆見鬼，數有效。",
          "translations": [
            {
              "lang": "en",
              "literal": "This time already extinguished Nanyue, Yue person Yongzhi then said 'Yue people custom believe ghosts, yet their sacrifices all see ghosts, often effective.",
              "idiomatic": "At this time, having already extinguished Nanyue, the Yue person Yongzhi then said 'Yue people custom believe in ghosts, yet their sacrifices all see ghosts, often effective.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "昔東甌王敬鬼，壽至百六十歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Former Dongou king respected ghosts, longevity to one hundred sixty years.",
              "idiomatic": "Former Dongou king respected ghosts, longevity to one hundred sixty years.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "後世謾怠，故衰秏」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Later generations negligent lazy, therefore declined depleted.'",
              "idiomatic": "Later generations negligent and lazy, therefore declined and depleted.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。",
          "translations": [
            {
              "lang": "en",
              "literal": "Then ordered Yue witches establish Yue blessing sacrifices, settled altar no mound, also sacrificed heaven spirits Supreme Deity hundred ghosts, yet with chicken divination.",
              "idiomatic": "He then ordered Yue witches to establish Yue blessing sacrifices, settled an altar without a mound, also sacrificed to heaven spirits, Supreme Deity, and hundred ghosts, yet divined with chickens.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "上信之，越祠雞卜始用焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor believed it, Yue sacrifices chicken divination first used there.",
              "idiomatic": "The emperor believed it. Yue sacrifices and chicken divination were first used there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At this time, having already extinguished Nanyue, the Yue person Yongzhi then said 'Yue people custom believe in ghosts, yet their sacrifices all see ghosts, often effective. Former Dongou king respected ghosts, longevity to one hundred sixty years. Later generations negligent and lazy, therefore declined and depleted.' He then ordered Yue witches to establish Yue blessing sacrifices, settled an altar without a mound, also sacrificed to heaven spirits, Supreme Deity, and hundred ghosts, yet divined with chickens. The emperor believed it. Yue sacrifices and chicken divination were first used there.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0332",
          "zh": "公孫卿曰：「僊人可見，而上往常遽，以故不見。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gongsun Qing said: 'Immortals can be seen, yet emperor went often hastily, because of this not seen.",
              "idiomatic": "Gongsun Qing said: 'Immortals can be seen, yet the emperor went often hastily, because of this not seen.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now your majesty can make pavilion, like Gou city, place dried meats dates, divine people should can be obtained.",
              "idiomatic": "Now your majesty can make a pavilion, like Gou city, place dried meats and dates, divine people should be obtainable.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "且僊人好樓居。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover immortals like tower residence.'",
              "idiomatic": "Moreover immortals like tower residence.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon emperor ordered Chang'an then made Feilian Gui pavilion, Ganquan then made Yi Yanshou pavilion, made Qing hold tally set up implements and await divine people, then made communicate heaven tower, placed sacrifice implements its below, will summon come divine immortal kind.",
              "idiomatic": "Thereupon the emperor ordered Chang'an to make the Feilian Gui pavilion, Ganquan to make the Yi Yanshou pavilion. Made Qing hold tally and set up implements to await divine people. Then made the communicate heaven tower, placed sacrifice implements below it, will summon the divine immortal kind.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "於是甘泉更置前殿，始廣諸宮室。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon Ganquan changed placed front hall, first broadened various palace chambers.",
              "idiomatic": "Thereupon Ganquan changed and placed the front hall, first broadened the various palace chambers.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0337",
          "zh": "夏，有芝生殿防內中。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, had ganoderma born hall dike inner middle.",
              "idiomatic": "In summer, there was ganoderma born within the hall dike in the middle.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "天子為塞河，興通天臺，若有光雲，乃下詔曰：「甘泉防生芝九莖，赦天下，毋有復作。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven for blocked river, raised communicate heaven tower, as if had light clouds, then issued edict said: 'Ganquan dike born ganoderma nine stems, amnesty realm, do not have repeat work.'",
              "idiomatic": "The Son of Heaven for blocking the river, raised the communicate heaven tower. As if there were light clouds, then issued an edict saying: 'Ganquan dike born ganoderma nine stems, amnesty the realm, do not have repeat work.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Gongsun Qing said: 'Immortals can be seen, yet the emperor went often hastily, because of this not seen. Now your majesty can make a pavilion, like Gou city, place dried meats and dates, divine people should be obtainable. Moreover immortals like tower residence.' Thereupon the emperor ordered Chang'an to make the Feilian Gui pavilion, Ganquan to make the Yi Yanshou pavilion. Made Qing hold tally and set up implements to await divine people. Then made the communicate heaven tower, placed sacrifice implements below it, will summon the divine immortal kind. Thereupon Ganquan changed and placed the front hall, first broadened the various palace chambers. In summer, there was ganoderma born within the hall dike in the middle. The Son of Heaven for blocking the river, raised the communicate heaven tower. As if there were light clouds, then issued an edict saying: 'Ganquan dike born ganoderma nine stems, amnesty the realm, do not have repeat work.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0339",
          "zh": "其明年，伐朝鮮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its next year, attacked Chaoxian.",
              "idiomatic": "Its next year, attacked Chaoxian.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "夏，旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, drought.",
              "idiomatic": "In summer, drought.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "公孫卿曰：「黃帝時封則天旱，乾封三年。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Gongsun Qing said: 'Yellow Emperor time feng then heaven drought, dry feng three years.'",
              "idiomatic": "Gongsun Qing said: 'In the Yellow Emperor's time, when feng then heaven drought, dry feng three years.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "上乃下詔曰：「天旱，意乾封乎？",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor then issued edict said: 'Heaven drought, meaning dry feng huh?",
              "idiomatic": "The emperor then issued an edict saying: 'Heaven drought, meaning dry feng huh?",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "其令天下尊祠靈星焉。」",
          "translations": [
            {
              "lang": "en",
              "literal": "Let command realm honor sacrifice spirit star there.'",
              "idiomatic": "Let command the realm to honor and sacrifice to the spirit star there.'",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its next year, attacked Chaoxian. In summer, drought. Gongsun Qing said: 'In the Yellow Emperor's time, when feng then heaven drought, dry feng three years.' The emperor then issued an edict saying: 'Heaven drought, meaning dry feng huh? Let command the realm to honor and sacrifice to the spirit star there.'",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0344",
          "zh": "其明年，上郊雍，通回中道，巡之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its next year, emperor suburban Yong, opened Huizhong path, toured it.",
              "idiomatic": "Its next year, the emperor suburban Yong, opened the Huizhong path, toured it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "春，至鳴澤，從西河歸。",
          "translations": [
            {
              "lang": "en",
              "literal": "Spring, arrived Mingze, from Xihe returned.",
              "idiomatic": "In spring, arrived at Mingze, from Xihe returned.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its next year, the emperor suburban Yong, opened the Huizhong path, toured it. In spring, arrived at Mingze, from Xihe returned.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0346",
          "zh": "其明年冬，上巡南郡，至江陵而東。",
          "translations": [
            {
              "lang": "en",
              "literal": "Its next year winter, emperor toured Nangun, arrived Jiangling and east.",
              "idiomatic": "Its next year winter, the emperor toured Nangun, arrived at Jiangling and went east.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "登禮潛之天柱山，號曰南嶽。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ascended ritual Qian Tianzhu mountain, named Nanyue.",
              "idiomatic": "Ascended and ritualed at Qian's Tianzhu mountain, named it Nanyue.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。",
          "translations": [
            {
              "lang": "en",
              "literal": "Floated Jiang, from Xunyang exited Congyang, passed Pengli, sacrificed its famous mountains rivers.",
              "idiomatic": "Floated on the Jiang, from Xunyang exited Congyang, passed Pengli, sacrificed to its famous mountains and rivers.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "北至瑯邪，并海上。",
          "translations": [
            {
              "lang": "en",
              "literal": "North arrived Langye, along sea above.",
              "idiomatic": "North arrived at Langye, along above the sea.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "四月中，至奉高修封焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fourth month middle, arrived Fenggao repaired feng there.",
              "idiomatic": "In the fourth month middle, arrived at Fenggao and repaired feng there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Its next year winter, the emperor toured Nangun, arrived at Jiangling and went east. Ascended and ritualed at Qian's Tianzhu mountain, named it Nanyue. Floated on the Jiang, from Xunyang exited Congyang, passed Pengli, sacrificed to its famous mountains and rivers. North arrived at Langye, along above the sea. In the fourth month middle, arrived at Fenggao and repaired feng there.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0351",
          "zh": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
          "translations": [
            {
              "lang": "en",
              "literal": "Initially, Son of Heaven feng Taishan, Taishan northeast zhi ancient time had bright hall place, place dangerous not spacious.",
              "idiomatic": "Initially, the Son of Heaven feng Taishan. Taishan's northeast zhi in ancient times had a bright hall place. The place was dangerous and not spacious.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "上欲治明堂奉高旁，未曉其制度。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor wished repair bright hall Fenggao side, not yet clear its system regulations.",
              "idiomatic": "The emperor wished to repair the bright hall at Fenggao's side, not yet clear about its system and regulations.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "濟南人公玊帶上黃帝時明堂圖。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jinan person Gong Yu presented Yellow Emperor time bright hall diagram.",
              "idiomatic": "The Jinan person Gong Yu presented the Yellow Emperor time bright hall diagram.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bright hall diagram middle had one hall, four sides no walls, with thatch cover, connected water, round palace walls made double path, above had tower, from southwest entered, named Kunlun, Son of Heaven followed it entered, to bow sacrifice Supreme Deity there.",
              "idiomatic": "The bright hall diagram had one hall in the middle. Four sides no walls, covered with thatch, connected water. Round palace walls made into double paths, above had towers. Entered from the southwest, named Kunlun. The Son of Heaven followed and entered it, to bow and sacrifice to the Supreme Deity there.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "於是上令奉高作明堂汶上，如帶圖。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thereupon emperor ordered Fenggao make bright hall Wenshang, like Dai diagram.",
              "idiomatic": "Thereupon the emperor ordered Fenggao to make the bright hall at Wenshang, like the Dai diagram.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。",
          "translations": [
            {
              "lang": "en",
              "literal": "And fifth year repaired feng, then sacrificed Taiyi, Five Emperors at bright hall upper seat, made Gao emperor sacrifice seat face it.",
              "idiomatic": "And in the fifth year repaired feng, then sacrificed to Taiyi and the Five Emperors at the bright hall's upper seat. Made the Gao emperor sacrifice seat face it.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0357",
          "zh": "祠后土於下房，以二十太牢。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sacrificed Houtu at lower chamber, with twenty great sacrificial animals.",
              "idiomatic": "Sacrificed to Houtu in the lower chamber, with twenty great sacrificial animals.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0358",
          "zh": "天子從昆侖道入，始拜明堂如郊禮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Son of Heaven followed Kunlun path entered, first bowed bright hall like suburban ritual.",
              "idiomatic": "The Son of Heaven followed the Kunlun path and entered, first bowed at the bright hall like suburban ritual.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "禮畢，燎堂下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ritual finished, burned hall below.",
              "idiomatic": "Ritual finished, burned below the hall.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "而上又上泰山，有祕祠其顛。",
          "translations": []
        },
        {
          "id": "s0361",
          "zh": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。",
          "translations": []
        },
        {
          "id": "s0362",
          "zh": "泰山上舉火，下悉應之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Initially, the Son of Heaven feng Taishan. Taishan's northeast zhi in ancient times had a bright hall place. The place was dangerous and not spacious. The emperor wished to repair the bright hall at Fenggao's side, not yet clear about its system and regulations. The Jinan person Gong Yu presented the Yellow Emperor time bright hall diagram. The bright hall diagram had one hall in the middle. Four sides no walls, covered with thatch, connected water. Round palace walls made into double paths, above had towers. Entered from the southwest, named Kunlun. The Son of Heaven followed and entered it, to bow and sacrifice to the Supreme Deity there. Thereupon the emperor ordered Fenggao to make the bright hall at Wenshang, like the Dai diagram. And in the fifth year repaired feng, then sacrificed to Taiyi and the Five Emperors at the bright hall's upper seat. Made the Gao emperor sacrifice seat face it. Sacrificed to Houtu in the lower chamber, with twenty great sacrificial animals. The Son of Heaven followed the Kunlun path and entered, first bowed at the bright hall like suburban ritual. Ritual finished, burned below the hall.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0363",
          "zh": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
          "translations": []
        },
        {
          "id": "s0364",
          "zh": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。",
          "translations": []
        },
        {
          "id": "s0365",
          "zh": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。",
          "translations": []
        },
        {
          "id": "s0366",
          "zh": "皇帝敬拜泰一。」",
          "translations": []
        },
        {
          "id": "s0367",
          "zh": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Each god had its own altar, one bull for each sacrifice. Then the emperor returned, camped at Mount Liangfu. The emperor said: 'The feng and shan sacrifices have been completed, the world is at peace.' Then the emperor renamed the crown prince as Crown Prince, made Liu Ju crown prince. The next year, the emperor fell ill, the crown prince attended to him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0368",
          "zh": "十一月乙酉，柏梁災。",
          "translations": []
        },
        {
          "id": "s0369",
          "zh": "十二月甲午朔，上親禪高里，祠后土。",
          "translations": []
        },
        {
          "id": "s0370",
          "zh": "臨渤海，將以望祠蓬萊之屬，冀至殊庭焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor was critically ill, summoned the prime minister and others to the bedside. Said: 'This morning I dreamed I and the Supreme Thearch wrestled, the Supreme Thearch threw me down.' The prime minister and others said: 'The emperor is the Son of Heaven, blessed by heaven, this dream is auspicious.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0371",
          "zh": "上還，以柏梁災故，朝受計甘泉。",
          "translations": []
        },
        {
          "id": "s0372",
          "zh": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。",
          "translations": []
        },
        {
          "id": "s0373",
          "zh": "明庭，甘泉也。」",
          "translations": []
        },
        {
          "id": "s0374",
          "zh": "方士多言古帝王有都甘泉者。",
          "translations": []
        },
        {
          "id": "s0375",
          "zh": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
          "translations": []
        },
        {
          "id": "s0376",
          "zh": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」",
          "translations": []
        },
        {
          "id": "s0377",
          "zh": "於是作建章宮，度為千門萬戶。",
          "translations": []
        },
        {
          "id": "s0378",
          "zh": "前殿度高未央，其東則鳳闕，高二十餘丈。",
          "translations": []
        },
        {
          "id": "s0379",
          "zh": "其西則唐中，數十里虎圈。",
          "translations": []
        },
        {
          "id": "s0380",
          "zh": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
          "translations": []
        },
        {
          "id": "s0381",
          "zh": "其南有玉堂、璧門、大鳥之屬。",
          "translations": []
        },
        {
          "id": "s0382",
          "zh": "乃立神明臺、井幹樓，度五十餘丈，輦道相屬焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'No, wrestling with the Supreme Thearch is not auspicious.' Then summoned the crown prince to the bedside, said: 'You are my successor, be diligent and frugal, love the people.' The crown prince wept, could not speak. The emperor said: 'The Supreme Thearch has summoned me, I cannot stay long.' Then died in the Weiyang Palace. The crown prince ascended the throne as Emperor Zhao, buried the emperor at Mao Mausoleum. Emperor Zhao was young, the Grand Empress Dowager ruled. Emperor Zhao ruled thirteen years, died. The crown prince Liu Fuling ascended as Emperor Xuan. Emperor Xuan ruled twenty-five years, died. The crown prince Liu Shi ascended as Emperor Yuan. Emperor Yuan ruled sixteen years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0383",
          "zh": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字。",
          "translations": []
        },
        {
          "id": "s0384",
          "zh": "因為太初元年。",
          "translations": []
        },
        {
          "id": "s0385",
          "zh": "是歲，西伐大宛。",
          "translations": []
        },
        {
          "id": "s0386",
          "zh": "蝗大起。",
          "translations": []
        },
        {
          "id": "s0387",
          "zh": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Ao ascended as Emperor Cheng. Emperor Cheng ruled twenty-six years, died. The crown prince Liu Xin ascended as Emperor Ai. Emperor Ai ruled six years, died. The crown prince Liu Kan ascended as Emperor Ping.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "其明年，有司言雍五畤無牢熟具，芬芳不備。",
          "translations": []
        },
        {
          "id": "s0389",
          "zh": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。",
          "translations": []
        },
        {
          "id": "s0390",
          "zh": "獨五帝用駒，行親郊用駒。",
          "translations": []
        },
        {
          "id": "s0391",
          "zh": "及諸名山川用駒者，悉以木禺馬代。",
          "translations": []
        },
        {
          "id": "s0392",
          "zh": "行過，乃用駒。",
          "translations": []
        },
        {
          "id": "s0393",
          "zh": "他禮如故。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Ping ruled five years, died. The crown prince Liu Ying ascended as Emperor Ruzi. Emperor Ruzi ruled one year, died. The crown prince Liu Jian ascended as Emperor Gengshi. Emperor Gengshi ruled one year, died. The crown prince Liu Xuan ascended as Emperor Guangwu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0394",
          "zh": "其明年，東巡海上，考神僊之屬，未有驗者。",
          "translations": []
        },
        {
          "id": "s0395",
          "zh": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。",
          "translations": []
        },
        {
          "id": "s0396",
          "zh": "上許作之如方，名曰明年。",
          "translations": []
        },
        {
          "id": "s0397",
          "zh": "上親禮祠上帝，衣上黃焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Guangwu ruled thirty-three years, died. The crown prince Liu Yang ascended as Emperor Ming. Emperor Ming ruled eighteen years, died. The crown prince Liu Zhuang ascended as Emperor Zhang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0398",
          "zh": "公玊帶曰：「黃帝時雖封泰山，然風后、封鉅、岐伯令黃帝封東泰山，禪凡山合符，然後不死焉。」",
          "translations": []
        },
        {
          "id": "s0399",
          "zh": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
          "translations": []
        },
        {
          "id": "s0400",
          "zh": "其後令帶奉祠候神物。",
          "translations": []
        },
        {
          "id": "s0401",
          "zh": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。",
          "translations": []
        },
        {
          "id": "s0402",
          "zh": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Zhang ruled seventeen years, died. The crown prince Liu Zhao ascended as Emperor He. Emperor He ruled seventeen years, died. The crown prince Liu Long ascended as Emperor Shang. Emperor Shang ruled one year, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0403",
          "zh": "其後五年，復至泰山修封，還過祭常山。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Hu ascended as Emperor An.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0404",
          "zh": "今天子所興祠，泰一、后土，三年親郊祠，建漢家封禪，五年一修封。",
          "translations": []
        },
        {
          "id": "s0405",
          "zh": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
          "translations": []
        },
        {
          "id": "s0406",
          "zh": "凡六祠，皆太祝領之。",
          "translations": []
        },
        {
          "id": "s0407",
          "zh": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。",
          "translations": []
        },
        {
          "id": "s0408",
          "zh": "方士所興祠，各自主，其人終則已，祠官弗主。",
          "translations": []
        },
        {
          "id": "s0409",
          "zh": "他祠皆如其故。",
          "translations": []
        },
        {
          "id": "s0410",
          "zh": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
          "translations": []
        },
        {
          "id": "s0411",
          "zh": "而方士之候祠神人，入海求蓬萊，終無有驗。",
          "translations": []
        },
        {
          "id": "s0412",
          "zh": "而公孫卿之候神者，猶以大人跡為解，無其效。",
          "translations": []
        },
        {
          "id": "s0413",
          "zh": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。",
          "translations": []
        },
        {
          "id": "s0414",
          "zh": "自此之後，方士言祠神者彌眾，然其效可睹矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor An ruled nineteen years, died. The crown prince Liu Yi ascended as Emperor Shun. Emperor Shun ruled nineteen years, died. The crown prince Liu Bao ascended as Emperor Chong. Emperor Chong ruled one year, died. The crown prince Liu Bing ascended as Emperor Zhi. Emperor Zhi ruled one year, died. The crown prince Liu Zuan ascended as Emperor Huan. Emperor Huan ruled twenty-one years, died. The crown prince Liu Hong ascended as Emperor Ling. Emperor Ling ruled twenty-two years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0415",
          "zh": "太史公曰：余從巡祭天地諸神名山川而封禪焉。",
          "translations": []
        },
        {
          "id": "s0416",
          "zh": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。",
          "translations": []
        },
        {
          "id": "s0417",
          "zh": "後有君子，得以覽焉。",
          "translations": []
        },
        {
          "id": "s0418",
          "zh": "至若俎豆珪幣之詳，獻酬之禮，則有司存焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Bian ascended as Emperor Shao. Emperor Shao ruled one year, died. The crown prince Liu Xie ascended as Emperor Xian. Emperor Xian ruled thirty-two years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}