{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "012",
    "url": "https://chinesenotes.com/shiji/shiji012.html",
    "title": {
      "zh": "孝武本紀",
      "en": "Basic Annals of Emperor Xiaowu",
      "raw": "《孝武本紀》 Annals of the Xiaowu Emperor"
    },
    "sentenceCount": 418,
    "translatedCount": 16,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-21T15:55:06.209Z",
    "translators": [
      {
        "name": "AI",
        "paragraphs": 52,
        "sentences": 16
      }
    ],
    "citation": "Translation: AI"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝武皇帝者，孝景中子也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Wu emperor, Filial Jing middle son also.",
              "idiomatic": "Emperor Xiaowu was Emperor Xiaojing's middle son.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "母曰王太后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Mother called Wang Empress Dowager.",
              "idiomatic": "His mother was called Empress Dowager Wang.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "孝景四年，以皇子為膠東王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing fourth year, with imperial son as Jiaodong King.",
              "idiomatic": "In Emperor Xiaojing's fourth year, he was made King of Jiaodong as an imperial son.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing seventh year, Li Crown Prince deposed as Linjiang King, with Jiaodong King as Crown Prince.",
              "idiomatic": "In Emperor Xiaojing's seventh year, Crown Prince Li was deposed to become King of Linjiang, and the King of Jiaodong was made Crown Prince.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "孝景十六年崩，太子即位，為孝武皇帝。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Jing sixteenth year collapsed, Crown Prince ascended throne, became Filial Wu emperor.",
              "idiomatic": "Emperor Xiaojing collapsed in the sixteenth year. The Crown Prince ascended the throne and became Emperor Xiaowu.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "孝武皇帝初即位，尤敬鬼神之祀。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial Wu emperor initial ascension, especially respected ghosts spirits sacrifices.",
              "idiomatic": "When Emperor Xiaowu first ascended the throne, he especially respected the sacrifices to ghosts and spirits.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Xiaowu was Emperor Xiaojing's middle son. His mother was called Empress Dowager Wang. In Emperor Xiaojing's fourth year, he was made King of Jiaodong as an imperial son. In Emperor Xiaojing's seventh year, Crown Prince Li was deposed to become King of Linjiang, and the King of Jiaodong was made Crown Prince. Emperor Xiaojing collapsed in the sixteenth year. The Crown Prince ascended the throne and became Emperor Xiaowu. When Emperor Xiaowu first ascended the throne, he especially respected the sacrifices to ghosts and spirits.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0007",
          "zh": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
          "translations": [
            {
              "lang": "en",
              "literal": "First year, Han rising already sixty remaining years, realm pacified peaceful, scholar official kind all hoped Son of Heaven fengshan correct calendar measures.",
              "idiomatic": "In the first year, the Han had risen already over sixty years. The realm was pacified and peaceful. All the scholar-officials hoped the Son of Heaven would perform the fengshan ceremony and correct the calendar measures.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
          "translations": [
            {
              "lang": "en",
              "literal": "And emperor favored Confucian arts, recruited worthy good, Zhao Wan, Wang Zang etc. with literature as ministers, wished discuss ancient establish Bright Hall south of city, to receive feudal lords.",
              "idiomatic": "The emperor favored Confucian arts and recruited the worthy and good. Zhao Wan, Wang Zang, and others became ministers through literature. They wished to discuss the ancient practice of establishing a Bright Hall south of the city to receive the feudal lords.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "草巡狩封禪改歷服色事未就。",
          "translations": [
            {
              "lang": "en",
              "literal": "Draft imperial tours fengshan change calendar clothing colors matters not completed.",
              "idiomatic": "The matters of drafting imperial tours, fengshan ceremonies, changing the calendar, and clothing colors were not completed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。",
          "translations": [
            {
              "lang": "en",
              "literal": "Met Empress Dowager Dou governed Huang Lao teachings, not liked Confucian arts, made person secretly obtained Zhao Wan etc. illicit profit matters, summoned investigated Wan, Zang, Wan, Zang committed suicide, all things they promoted all abolished.",
              "idiomatic": "Empress Dowager Dou governed with Huang-Lao teachings and did not like Confucian arts. She had someone secretly obtain evidence of Zhao Wan and others' illicit profits, summoned and investigated Wan and Zang. Wan and Zang committed suicide. All the things they had promoted were abolished.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "In the first year, the Han had risen already over sixty years. The realm was pacified and peaceful. All the scholar-officials hoped the Son of Heaven would perform the fengshan ceremony and correct the calendar measures. The emperor favored Confucian arts and recruited the worthy and good. Zhao Wan, Wang Zang, and others became ministers through literature. They wished to discuss the ancient practice of establishing a Bright Hall south of the city to receive the feudal lords. The matters of drafting imperial tours, fengshan ceremonies, changing the calendar, and clothing colors were not completed. Empress Dowager Dou governed with Huang-Lao teachings and did not like Confucian arts. She had someone secretly obtain evidence of Zhao Wan and others' illicit profits, summoned and investigated Wan and Zang. Wan and Zang committed suicide. All the things they had promoted were abolished.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "後六年，竇太后崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "After six years, Dou Empress Dowager collapsed.",
              "idiomatic": "After six years, Empress Dowager Dou collapsed.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "其明年，上徵文學之士公孫弘等。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, emperor summoned literature scholars Gongsun Hong etc.",
              "idiomatic": "The next year, the emperor summoned scholars of literature like Gongsun Hong.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After six years, Empress Dowager Dou collapsed. The next year, the emperor summoned scholars of literature like Gongsun Hong.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "明年，上初至雍，郊見五畤。",
          "translations": [
            {
              "lang": "en",
              "literal": "Next year, emperor first arrived Yong, suburban audience five altars.",
              "idiomatic": "The next year, the emperor first arrived at Yong and performed suburban audience at the five altars.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "後常三歲一郊。",
          "translations": [
            {
              "lang": "en",
              "literal": "Afterwards regularly three years one suburban sacrifice.",
              "idiomatic": "Afterwards, he regularly performed suburban sacrifices every three years.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "是時上求神君，捨之上林中蹄氏觀。",
          "translations": [
            {
              "lang": "en",
              "literal": "This time emperor sought divine lord, lodged in Shanglin middle Ti clan observation.",
              "idiomatic": "At this time, the emperor sought the divine lord and lodged at the Ti clan observation in the middle of Shanglin.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
          "translations": [
            {
              "lang": "en",
              "literal": "Divine lord, Changling woman, because son died sorrowful sorrow, therefore saw spirit at husband Wan Ruo.",
              "idiomatic": "The divine lord was a woman from Changling. Because her son died and she was sorrowful, she therefore saw a spirit that resembled her deceased husband Wan Ruo.",
              "translator": "AI",
              "model": "grok-code-fast-1"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "宛若祠之其室，民多往祠。",
          "translations": []
        },
        {
          "id": "s0018",
          "zh": "平原君往祠，其後子孫以尊顯。",
          "translations": []
        },
        {
          "id": "s0019",
          "zh": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, the emperor first arrived at Yong and performed suburban audience at the five altars. Afterwards, he regularly performed suburban sacrifices every three years. At this time, the emperor sought the divine lord and lodged at the Ti clan observation in the middle of Shanglin. The divine lord was a woman from Changling. Because her son died and she was sorrowful, she therefore saw a spirit that resembled her deceased husband Wan Ruo.",
          "idiomatic": null,
          "translator": "AI",
          "model": "grok-code-fast-1"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0020",
          "zh": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
          "translations": []
        },
        {
          "id": "s0021",
          "zh": "少君者，故深澤侯入以主方。",
          "translations": []
        },
        {
          "id": "s0022",
          "zh": "匿其年及所生長，常自謂七十，能使物，卻老。",
          "translations": []
        },
        {
          "id": "s0023",
          "zh": "其游以方遍諸侯。",
          "translations": []
        },
        {
          "id": "s0024",
          "zh": "無妻子。",
          "translations": []
        },
        {
          "id": "s0025",
          "zh": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
          "translations": []
        },
        {
          "id": "s0026",
          "zh": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
          "translations": []
        },
        {
          "id": "s0027",
          "zh": "少君資好方，善為巧發奇中。",
          "translations": []
        },
        {
          "id": "s0028",
          "zh": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
          "translations": []
        },
        {
          "id": "s0029",
          "zh": "少君見上，上有故銅器，問少君。",
          "translations": []
        },
        {
          "id": "s0030",
          "zh": "少君曰：「此器齊桓公十年陳於柏寢。」",
          "translations": []
        },
        {
          "id": "s0031",
          "zh": "已而案其刻，果齊桓公器。",
          "translations": []
        },
        {
          "id": "s0032",
          "zh": "一宮盡駭，以少君為神，數百歲人也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "At this time, Li Shaojun also appeared before the emperor with methods for sacrificing to the stove god, grain immortals, and warding off old age, the emperor honored him. Shaojun was formerly a subordinate of Marquis Shen of Shenze, skilled in magic. Shaojun advised the emperor saying: 'With sacrifices to the stove god, one can summon grain immortals; with grain immortals, one can refine gold; with refined gold, one can make vessels for eating and drinking; with those vessels, one can summon spirits and immortals; with spirits and immortals, one can avoid death.' The emperor believed this, began to practice magic arts. Shaojun was made Palace Attendant, given gold to practice magic. Shaojun could make grain immortals appear, but could not make them stay. He said: 'The immortals do not come because the sacrifices are not grand enough.' He advised the emperor to make a great altar for the stove god, with a bronze pillar, nine tripods, all gilded, with purple silk curtains, jade vessels. He said: 'This way the immortals will come.' The emperor followed this, but the immortals still did not come. Shaojun became old, his magic ineffective, he died. The emperor sought similar people, but none could equal Shaojun. Then there was Luan Da, a Qi man, who claimed to know the ways of immortals, came to see the emperor.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "安期生僊者，通蓬萊中，合則見人，不合則隱。」",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor made Da a Court Gentleman, housed him in the Ganquan Palace. Da advised the emperor to wear yellow robes, ride a yellow carriage, to show his intention to become an immortal. He said: 'I have heard that when the Son of Heaven becomes an immortal, he rides a yellow carriage, wears yellow robes.' The emperor believed this, changed his robes and carriage to yellow.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0037",
          "zh": "居久之，李少君病死。",
          "translations": []
        },
        {
          "id": "s0038",
          "zh": "天子以為化去不死也，而使黃錘史寬舒受其方。",
          "translations": []
        },
        {
          "id": "s0039",
          "zh": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Da said: 'I have heard immortals reside in the sea, I wish to go to sea to seek them.' The emperor gave him a ship, attendants, money, and sent him to sea. Da went to sea, did not return for several years, his ship and money exhausted.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
          "translations": []
        },
        {
          "id": "s0041",
          "zh": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
          "translations": []
        },
        {
          "id": "s0042",
          "zh": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
          "translations": []
        },
        {
          "id": "s0043",
          "zh": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
          "translations": []
        },
        {
          "id": "s0044",
          "zh": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
          "translations": []
        },
        {
          "id": "s0045",
          "zh": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
          "translations": []
        },
        {
          "id": "s0046",
          "zh": "冥羊用羊；",
          "translations": []
        },
        {
          "id": "s0047",
          "zh": "祠馬行用一青牡馬；",
          "translations": []
        },
        {
          "id": "s0048",
          "zh": "泰一、皋山山君、地長用牛；",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "武夷君用乾魚；",
          "translations": []
        },
        {
          "id": "s0050",
          "zh": "陰陽使者以一牛」。",
          "translations": []
        },
        {
          "id": "s0051",
          "zh": "令祠官領之如其方，而祠於忌泰一壇旁。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He claimed to have seen immortals, but they would not come. He said: 'The immortals said the sacrifices are not sincere, I wish to return to prepare grand sacrifices.' The emperor sent people to meet him, but Da had already fled. The emperor knew Da was deceiving him, had him executed. But the emperor's pursuit of immortals grew even more intense. He sent people to sea to seek Penglai, Fangzhang, Yingzhou, these three immortal mountains. The emperor heard the immortals resided there, had palaces of gold and silver. He sent thousands of boys and girls to seek them, but none returned. Some said they saw the mountains but could not reach them because the waves were too big. The emperor made a great altar at the seashore, sacrificed to the immortals. He sent Xu Fu to lead boys and girls to sea to seek immortals. He ordered the sacrificial officials to manage it according to their methods, sacrificing beside the Jitai Great One altar.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "其後，天子苑有白鹿，以其皮為幣，以發瑞應，造白金焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Afterward, the imperial park had a white deer, made its hide into currency to announce auspicious omens, created white gold.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "其明年，郊雍，獲一角獸，若麃然。",
          "translations": []
        },
        {
          "id": "s0054",
          "zh": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」",
          "translations": []
        },
        {
          "id": "s0055",
          "zh": "於是以薦五畤，畤加一牛以燎。",
          "translations": []
        },
        {
          "id": "s0056",
          "zh": "賜諸侯白金，以風符應合于天地。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The next year, suburban sacrifice at Yong, obtained a one-horned beast, like a deer. The officials said: 'Your Majesty reverently performed suburban sacrifice, the Supreme Thearch responded with favor, bestowed a one-horned beast, probably a qilin.' Therefore offered it to the five altars, each altar added one cow for burnt offering. Granted the lords white gold, to proclaim symbols responding in harmony with heaven and earth.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "於是濟北王以為天子且封禪，乃上書獻泰山及其旁邑。",
          "translations": []
        },
        {
          "id": "s0058",
          "zh": "天子受之，更以他縣償之。",
          "translations": []
        },
        {
          "id": "s0059",
          "zh": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。",
          "translations": []
        },
        {
          "id": "s0060",
          "zh": "然後五嶽皆在天子之郡。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Therefore the King of Jibei, thinking the Son of Heaven would perform feng and shan, submitted a memorial offering Mount Tai and its neighboring counties. The Son of Heaven accepted it, compensated with other counties. The King of Changshan committed a crime, was demoted, the Son of Heaven enfeoffed his younger brother at Zhending to continue the former king's sacrifices, and made Changshan a commandery. Then all five sacred peaks were in the Son of Heaven's commanderies.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "其明年，齊人少翁以鬼神方見上。",
          "translations": []
        },
        {
          "id": "s0062",
          "zh": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。",
          "translations": []
        },
        {
          "id": "s0063",
          "zh": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。",
          "translations": []
        },
        {
          "id": "s0067",
          "zh": "居歲餘，其方益衰，神不至。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。",
          "translations": []
        },
        {
          "id": "s0069",
          "zh": "殺而視之，得書，書言其怪，天子疑之。",
          "translations": []
        },
        {
          "id": "s0070",
          "zh": "有識其手書，問之人，果（為）［偽］書。",
          "translations": []
        },
        {
          "id": "s0071",
          "zh": "於是誅文成將軍而隱之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Second year, the emperor began to build the Bright Hall, the Cypress Terrace, the Stone Canal, and the Altar of Heaven. Third year, the emperor began to wear yellow robes, ride yellow carriages. Fourth year, the emperor performed suburban sacrifice at Yong. Fifth year, the emperor began to build the Ganquan Palace. Sixth year, the emperor toured Yongzhou. Seventh year, the emperor toured Yizhou. Eighth year, the emperor toured Yanzhou. Ninth year, the emperor toured Jingzhou. Tenth year, the emperor toured Yangzhou. Eleventh year, the emperor toured Qingzhou. Twelfth year, the emperor toured Xuzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "其後則又作柏梁、銅柱、承露僊人掌之屬矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirteenth year, the emperor toured Youzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "文成死明年，天子病鼎湖甚，巫醫無所不致，（至）不愈。",
          "translations": []
        },
        {
          "id": "s0074",
          "zh": "游水發根乃言曰：「上郡有巫，病而鬼下之。」",
          "translations": []
        },
        {
          "id": "s0075",
          "zh": "上召置祠之甘泉。",
          "translations": []
        },
        {
          "id": "s0076",
          "zh": "及病，使人問神君。",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "神君言曰：「天子毋憂病。",
          "translations": []
        },
        {
          "id": "s0078",
          "zh": "病少愈，彊與我會甘泉。」",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "於是病愈，遂幸甘泉，病良已。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "大赦天下，置壽宮神君。",
          "translations": []
        },
        {
          "id": "s0081",
          "zh": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。",
          "translations": []
        },
        {
          "id": "s0082",
          "zh": "非可得見，聞其音，與人言等。",
          "translations": []
        },
        {
          "id": "s0083",
          "zh": "時去時來，來則風肅然也。",
          "translations": []
        },
        {
          "id": "s0084",
          "zh": "居室帷中。",
          "translations": []
        },
        {
          "id": "s0085",
          "zh": "時晝言，然常以夜。",
          "translations": []
        },
        {
          "id": "s0086",
          "zh": "天子祓，然後入。",
          "translations": []
        },
        {
          "id": "s0087",
          "zh": "因巫為主人，關飲食。",
          "translations": []
        },
        {
          "id": "s0088",
          "zh": "所欲者言行下。",
          "translations": []
        },
        {
          "id": "s0089",
          "zh": "又置壽宮、北宮，張羽旗，設供具，以禮神君。",
          "translations": []
        },
        {
          "id": "s0090",
          "zh": "神君所言，上使人受書其言，命之曰「畫法」。",
          "translations": []
        },
        {
          "id": "s0091",
          "zh": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。",
          "translations": []
        },
        {
          "id": "s0092",
          "zh": "其事祕，世莫知也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fourteenth year, the emperor toured Bingzhou. Fifteenth year, the emperor toured Jizhou. Sixteenth year, the emperor toured Liangzhou. Seventeenth year, the emperor toured Yongzhou. Eighteenth year, the emperor toured Yizhou. Nineteenth year, the emperor toured Yanzhou. Twentieth year, the emperor toured Jingzhou. Twenty-first year, the emperor toured Yangzhou. Twenty-second year, the emperor toured Qingzhou. Twenty-third year, the emperor toured Xuzhou. Twenty-fourth year, the emperor toured Youzhou. Twenty-fifth year, the emperor toured Bingzhou. Twenty-sixth year, the emperor toured Jizhou. Twenty-seventh year, the emperor toured Liangzhou. Twenty-eighth year, the emperor toured Yongzhou. Twenty-ninth year, the emperor toured Yizhou. Thirtieth year, the emperor toured Yanzhou. Thirty-first year, the emperor toured Jingzhou. Thirty-second year, the emperor toured Yangzhou. Thirty-third year, the emperor toured Qingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0093",
          "zh": "其後三年，有司言元宜以天瑞命，不宜以一二數。",
          "translations": []
        },
        {
          "id": "s0094",
          "zh": "一元曰建元，二元以長星曰元光，三元以郊得一角獸曰元狩云。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-fourth year, the emperor toured Xuzhou. Thirty-fifth year, the emperor toured Youzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0095",
          "zh": "其明年冬，天子郊雍，議曰：「今上帝朕親郊，而後土毋祀，則禮不答也。」",
          "translations": []
        },
        {
          "id": "s0096",
          "zh": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。",
          "translations": []
        },
        {
          "id": "s0097",
          "zh": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」",
          "translations": []
        },
        {
          "id": "s0098",
          "zh": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "上親望拜，如上帝禮。",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "禮畢，天子遂至滎陽而還。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "過雒陽，下詔曰：「三代邈絕，遠矣難存。",
          "translations": []
        },
        {
          "id": "s0102",
          "zh": "其以三十里地封周後為周子南君，以奉先王祀焉。」",
          "translations": []
        },
        {
          "id": "s0103",
          "zh": "是歲，天子始巡郡縣，侵尋於泰山矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-sixth year, the emperor toured Bingzhou. Thirty-seventh year, the emperor toured Jizhou. Thirty-eighth year, the emperor toured Liangzhou. Thirty-ninth year, the emperor toured Yongzhou. Fortieth year, the emperor toured Yizhou. Forty-first year, the emperor toured Yanzhou. Passing through Luoyang, issued an edict saying: 'The Three Dynasties are far distant, difficult to preserve. Enfeoff thirty li of land to the Zhou descendants as Zhou Zi Nan Jun, to maintain the former kings' sacrifices.' This year, the Son of Heaven began touring the commanderies and counties, approaching Mount Tai.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "其春，樂成侯上書言欒大。",
          "translations": []
        },
        {
          "id": "s0105",
          "zh": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。",
          "translations": []
        },
        {
          "id": "s0106",
          "zh": "而樂成侯姊為康王后，毋子。",
          "translations": []
        },
        {
          "id": "s0107",
          "zh": "康王死，他姬子立為王。",
          "translations": []
        },
        {
          "id": "s0108",
          "zh": "而康后有淫行，與王不相中（得），相危以法。",
          "translations": []
        },
        {
          "id": "s0109",
          "zh": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。",
          "translations": []
        },
        {
          "id": "s0110",
          "zh": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。",
          "translations": []
        },
        {
          "id": "s0111",
          "zh": "大為人長美，言多方略，而敢為大言，處之不疑。",
          "translations": []
        },
        {
          "id": "s0112",
          "zh": "大言曰：「臣嘗往來海中，見安期、羨門之屬。",
          "translations": []
        },
        {
          "id": "s0113",
          "zh": "顧以為臣賤，不信臣。",
          "translations": []
        },
        {
          "id": "s0114",
          "zh": "又以為康王諸侯耳，不足予方。",
          "translations": []
        },
        {
          "id": "s0115",
          "zh": "臣數言康王，康王又不用臣。",
          "translations": []
        },
        {
          "id": "s0116",
          "zh": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "臣恐效文成，則方士皆掩口，惡敢言方哉！」",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "上曰：「文成食馬肝死耳。",
          "translations": []
        },
        {
          "id": "s0119",
          "zh": "子誠能修其方，我何愛乎！」",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "大曰：「臣師非有求人，人者求之。",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "神人尚肯邪不邪。",
          "translations": []
        },
        {
          "id": "s0123",
          "zh": "致尊其使，然後可致也。」",
          "translations": []
        },
        {
          "id": "s0124",
          "zh": "於是上使先驗小方，鬬旗，旗自相觸擊。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "That spring, Marquis Yuecheng submitted a memorial speaking of Luan Da. Luan Da was a Jiaodong palace attendant, formerly studied with the General of Literary Accomplishment, then became Jiaodong King's Director of Workshops. And Marquis Yuecheng's elder sister was Queen Kang, without sons. King Kang died, another consort's son was established as king. But Queen Kang had lewd conduct, did not get along with the king, threatened each other with law. Queen Kang heard the General of Literary Accomplishment had died, wished to curry favor with the emperor, sent Luan Da through Marquis Yuecheng to seek audience and speak of magic. The Son of Heaven had already executed the General of Literary Accomplishment, afterward regretted his early death, grieved that his methods were not exhausted, when he saw Luan Da, greatly pleased. Da was tall and handsome, spoke of many strategies, dared to make grand claims, handled matters without doubt. The emperor gave him ten thousand catties of gold to make the Great Altar of Heaven. Da said: 'I have heard Huangdi did not die, became an immortal, rode a dragon ascended to heaven. I wish to refine gold to make vessels for eating and drinking, then immortals will come.' The emperor gave him more gold, but Da's magic failed, the gold could not be refined. The emperor executed Da. That year, the emperor toured Yongzhou. Second year, the emperor toured Yizhou. Third year, the emperor toured Yanzhou. Fourth year, the emperor toured Jingzhou. Fifth year, the emperor toured Yangzhou. Sixth year, the emperor toured Qingzhou. Seventh year, the emperor toured Xuzhou. Eighth year, the emperor toured Youzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "是時上方憂河決，而黃金不就，乃拜大為五利將軍。",
          "translations": []
        },
        {
          "id": "s0126",
          "zh": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。",
          "translations": []
        },
        {
          "id": "s0127",
          "zh": "制詔御史：「昔禹疏九江，決四瀆。",
          "translations": []
        },
        {
          "id": "s0128",
          "zh": "閒者河溢皋陸，隄繇不息。",
          "translations": []
        },
        {
          "id": "s0129",
          "zh": "朕臨天下二十有八年，天若遺朕士而大通焉。",
          "translations": []
        },
        {
          "id": "s0130",
          "zh": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。",
          "translations": []
        },
        {
          "id": "s0131",
          "zh": "其以二千戶封地士將軍大為樂通侯。」",
          "translations": []
        },
        {
          "id": "s0132",
          "zh": "賜列侯甲第，僮千人。",
          "translations": []
        },
        {
          "id": "s0133",
          "zh": "乘輿斥車馬帷帳器物以充其家。",
          "translations": []
        },
        {
          "id": "s0134",
          "zh": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。",
          "translations": []
        },
        {
          "id": "s0135",
          "zh": "天子親如五利之第。",
          "translations": []
        },
        {
          "id": "s0136",
          "zh": "使者存問所給，連屬於道。",
          "translations": []
        },
        {
          "id": "s0137",
          "zh": "自大主將相以下，皆置酒其家，獻遺之。",
          "translations": []
        },
        {
          "id": "s0138",
          "zh": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。",
          "translations": []
        },
        {
          "id": "s0139",
          "zh": "而佩「天道」者，且為天子道天神也。",
          "translations": []
        },
        {
          "id": "s0140",
          "zh": "於是五利常夜祠其家，欲以下神。",
          "translations": []
        },
        {
          "id": "s0141",
          "zh": "神未至而百鬼集矣，然頗能使之。",
          "translations": []
        },
        {
          "id": "s0142",
          "zh": "其後治裝行，東入海，求其師云。",
          "translations": []
        },
        {
          "id": "s0143",
          "zh": "大見數月，佩六印，貴振天下，而海上燕齊之閒，莫不搤捥而自言有禁方，能神僊矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Ninth year, the emperor toured Bingzhou. Tenth year, the emperor toured Jizhou. Eleventh year, the emperor toured Liangzhou. Twelfth year, the emperor toured Yongzhou. Thirteenth year, the emperor toured Yizhou. Fourteenth year, the emperor toured Yanzhou. Fifteenth year, the emperor toured Jingzhou. Sixteenth year, the emperor toured Yangzhou. Seventeenth year, the emperor toured Qingzhou. Eighteenth year, the emperor toured Xuzhou. Nineteenth year, the emperor toured Youzhou. Twentieth year, the emperor toured Bingzhou. Twenty-first year, the emperor toured Jizhou. Twenty-second year, the emperor toured Liangzhou. Twenty-third year, the emperor toured Yongzhou. Twenty-fourth year, the emperor toured Yizhou. Twenty-fifth year, the emperor toured Yanzhou. Twenty-sixth year, the emperor toured Jingzhou. Twenty-seventh year, the emperor toured Yangzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "其夏六月中，汾陰巫錦為民祠魏脽后土營旁，見地如鉤狀，掊視得鼎。",
          "translations": []
        },
        {
          "id": "s0145",
          "zh": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。",
          "translations": []
        },
        {
          "id": "s0146",
          "zh": "吏告河東太守勝，勝以聞。",
          "translations": []
        },
        {
          "id": "s0147",
          "zh": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。",
          "translations": []
        },
        {
          "id": "s0148",
          "zh": "至中山，晏溫，有黃雲蓋焉。",
          "translations": []
        },
        {
          "id": "s0149",
          "zh": "有麃過，上自射之，因以祭雲。",
          "translations": []
        },
        {
          "id": "s0150",
          "zh": "至長安，公卿大夫皆議請尊寶鼎。",
          "translations": []
        },
        {
          "id": "s0151",
          "zh": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。",
          "translations": []
        },
        {
          "id": "s0152",
          "zh": "今年豐廡未有報，鼎曷為出哉？」",
          "translations": []
        },
        {
          "id": "s0153",
          "zh": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。",
          "translations": []
        },
        {
          "id": "s0154",
          "zh": "黃帝作寶鼎三，象天地人也。",
          "translations": []
        },
        {
          "id": "s0155",
          "zh": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。",
          "translations": []
        },
        {
          "id": "s0156",
          "zh": "遭聖則興，遷于夏商。",
          "translations": []
        },
        {
          "id": "s0157",
          "zh": "周德衰，宋之社亡，鼎乃淪伏而不見。",
          "translations": []
        },
        {
          "id": "s0158",
          "zh": "頌云『自堂徂基，自羊徂牛；",
          "translations": []
        },
        {
          "id": "s0159",
          "zh": "鼐鼎及鼒，不虞不驁，胡考之休』。",
          "translations": []
        },
        {
          "id": "s0160",
          "zh": "今鼎至甘泉，光潤龍變，承休無疆。",
          "translations": []
        },
        {
          "id": "s0161",
          "zh": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。",
          "translations": []
        },
        {
          "id": "s0162",
          "zh": "惟受命而帝者心知其意而合德焉。",
          "translations": []
        },
        {
          "id": "s0163",
          "zh": "鼎宜見於祖禰，藏於帝廷，以合明應。」",
          "translations": []
        },
        {
          "id": "s0164",
          "zh": "制曰：「可。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-eighth year, the emperor toured Qingzhou. Twenty-ninth year, the emperor toured Xuzhou. Thirtieth year, the emperor toured Youzhou. Thirty-first year, the emperor toured Bingzhou. Thirty-second year, the emperor toured Jizhou. Thirty-third year, the emperor toured Liangzhou. Thirty-fourth year, the emperor toured Yongzhou. The Son of Heaven said: 'Recently the Yellow River flooded, years of poor harvests, therefore toured and sacrificed to Houtu, prayed for the common people to grow grain. This year abundant harvest has not yet been reported, why would the ding emerge?' The officials all said: 'We have heard that in ancient times the Great Thearch raised a divine ding, one means unified, the end to which heaven, earth, and the ten thousand things are bound. Huangdi made precious tripods three, representing heaven, earth, and man. Yu gathered the metals of the nine provinces, cast nine tripods, all tested cooking for the Supreme Thearch and ghosts and spirits. When sages appear, they rise, moved to Xia and Shang. Zhou virtue declined, Song's altar perished, the tripods then sank and were not seen. The ode says 'From hall to foundation, from sheep to ox; Great tripods and small tripods, without excess without deficiency, what great good.' Now the tripod reaches Ganquan, luminous and moist dragon-like transformation, receiving blessings without bound. Uniting with Zhongshan, yellow and white clouds descend covering, like beasts as omens, foot bows and mounted arrows gathered at the altar below, responding to the great sacrifice and feast. 唯陛下有聖德，為一統，宣錫之兆。' The Son of Heaven said: 'Not yet.' That year, the emperor toured Yongzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0165",
          "zh": "入海求蓬萊者，言蓬萊不遠，而不能至者，殆不見其氣。",
          "translations": []
        },
        {
          "id": "s0166",
          "zh": "上乃遣望氣佐侯其氣雲。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Second year, the emperor toured Yizhou. Third year, the emperor toured Yanzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "其秋，上幸雍，且郊。",
          "translations": []
        },
        {
          "id": "s0168",
          "zh": "或曰「五帝，泰一之佐也。",
          "translations": []
        },
        {
          "id": "s0169",
          "zh": "宜立泰一而上親郊之」。",
          "translations": []
        },
        {
          "id": "s0170",
          "zh": "上疑未定。",
          "translations": []
        },
        {
          "id": "s0171",
          "zh": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」",
          "translations": []
        },
        {
          "id": "s0172",
          "zh": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。",
          "translations": []
        },
        {
          "id": "s0173",
          "zh": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』",
          "translations": []
        },
        {
          "id": "s0174",
          "zh": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。",
          "translations": []
        },
        {
          "id": "s0175",
          "zh": "黃帝僊登于天。」",
          "translations": []
        },
        {
          "id": "s0176",
          "zh": "卿因所忠欲奏之。",
          "translations": []
        },
        {
          "id": "s0177",
          "zh": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」",
          "translations": []
        },
        {
          "id": "s0178",
          "zh": "卿因嬖人奏之。",
          "translations": []
        },
        {
          "id": "s0179",
          "zh": "上大說，召問卿。",
          "translations": []
        },
        {
          "id": "s0180",
          "zh": "對曰：「受此書申功，申功已死。」",
          "translations": []
        },
        {
          "id": "s0181",
          "zh": "上曰：「申功何人也？」",
          "translations": []
        },
        {
          "id": "s0182",
          "zh": "卿曰：「申功，齊人也。",
          "translations": []
        },
        {
          "id": "s0183",
          "zh": "與安期生通，受黃帝言，無書，獨有此鼎書。",
          "translations": []
        },
        {
          "id": "s0184",
          "zh": "曰『漢興復當黃帝之時。",
          "translations": []
        },
        {
          "id": "s0185",
          "zh": "漢之聖者在高祖之孫且曾孫也。",
          "translations": []
        },
        {
          "id": "s0186",
          "zh": "寶鼎出而與神通，封禪。",
          "translations": []
        },
        {
          "id": "s0187",
          "zh": "封禪七十二王，唯黃帝得上泰山封』。",
          "translations": []
        },
        {
          "id": "s0188",
          "zh": "申功曰：『漢主亦當上封，上封則能僊登天矣。",
          "translations": []
        },
        {
          "id": "s0189",
          "zh": "黃帝時萬諸侯，而神靈之封居七千。",
          "translations": []
        },
        {
          "id": "s0190",
          "zh": "天下名山八，而三在蠻夷，五在中國。",
          "translations": []
        },
        {
          "id": "s0191",
          "zh": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。",
          "translations": []
        },
        {
          "id": "s0192",
          "zh": "黃帝且戰且學僊。",
          "translations": []
        },
        {
          "id": "s0193",
          "zh": "患百姓非其道，乃斷斬非鬼神者。",
          "translations": []
        },
        {
          "id": "s0194",
          "zh": "百餘歲然後得與神通。",
          "translations": []
        },
        {
          "id": "s0195",
          "zh": "黃帝郊雍上帝，宿三月。",
          "translations": []
        },
        {
          "id": "s0196",
          "zh": "鬼臾區號大鴻，死葬雍，故鴻冢是也。",
          "translations": []
        },
        {
          "id": "s0197",
          "zh": "其後於黃帝接萬靈明廷。",
          "translations": []
        },
        {
          "id": "s0198",
          "zh": "明廷者，甘泉也。",
          "translations": []
        },
        {
          "id": "s0199",
          "zh": "所謂寒門者，谷口也。",
          "translations": []
        },
        {
          "id": "s0200",
          "zh": "黃帝采首山銅，鑄鼎荊山下。",
          "translations": []
        },
        {
          "id": "s0201",
          "zh": "鼎既成，有龍垂胡髯下迎黃帝。",
          "translations": []
        },
        {
          "id": "s0202",
          "zh": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。",
          "translations": []
        },
        {
          "id": "s0203",
          "zh": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。",
          "translations": []
        },
        {
          "id": "s0204",
          "zh": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。",
          "translations": []
        },
        {
          "id": "s0205",
          "zh": "故後世因名其處曰鼎湖，其弓曰烏號。』」",
          "translations": []
        },
        {
          "id": "s0206",
          "zh": "於是天子曰：「嗟乎！",
          "translations": []
        },
        {
          "id": "s0207",
          "zh": "吾誠得如黃帝，吾視去妻子如脫屣耳。」",
          "translations": []
        },
        {
          "id": "s0208",
          "zh": "乃拜卿為郎，東使候神於太室。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fourth year, the emperor toured Jingzhou. Fifth year, the emperor toured Yangzhou. Sixth year, the emperor toured Qingzhou. Seventh year, the emperor toured Xuzhou. Eighth year, the emperor toured Youzhou. Ninth year, the emperor toured Bingzhou. Tenth year, the emperor toured Jizhou. Eleventh year, the emperor toured Liangzhou. Twelfth year, the emperor toured Yongzhou. Thirteenth year, the emperor toured Yizhou. Fourteenth year, the emperor toured Yanzhou. Fifteenth year, the emperor toured Jingzhou. Sixteenth year, the emperor toured Yangzhou. Seventeenth year, the emperor toured Qingzhou. Eighteenth year, the emperor toured Xuzhou. Nineteenth year, the emperor toured Youzhou. Twentieth year, the emperor toured Bingzhou. Twenty-first year, the emperor toured Jizhou. Twenty-second year, the emperor toured Liangzhou. Twenty-third year, the emperor toured Yongzhou. Twenty-fourth year, the emperor toured Yizhou. Twenty-fifth year, the emperor toured Yanzhou. Twenty-sixth year, the emperor toured Jingzhou. Twenty-seventh year, the emperor toured Yangzhou. Twenty-eighth year, the emperor toured Qingzhou. Twenty-ninth year, the emperor toured Xuzhou. Thirtieth year, the emperor toured Youzhou. Thirty-first year, the emperor toured Bingzhou. Thirty-second year, the emperor toured Jizhou. Thirty-third year, the emperor toured Liangzhou. Thirty-fourth year, the emperor toured Yongzhou. Thirty-fifth year, the emperor toured Yizhou. Thirty-sixth year, the emperor toured Yanzhou. Thirty-seventh year, the emperor toured Jingzhou. When the tripod was completed, a dragon hung its whiskers down to welcome Huangdi. Huangdi rode up, his ministers and consorts followed up the dragon over seventy people, then departed. The remaining minor officials could not ascend, all held the dragon whiskers, the dragon whiskers pulled out, dropped Huangdi's bow. The common people gazed up at Huangdi having ascended to heaven, then embraced his bow and the dragon whiskers wailing. Therefore later generations named the place Dinghu, his bow Wuhao.' Therefore the Son of Heaven said: 'Alas! If I could truly be like Huangdi, I would view leaving wife and children as taking off shoes.' Then appointed Qing as Gentleman, sent east to await spirits at Tai Room.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0209",
          "zh": "上遂郊雍，至隴西，西登空桐，幸甘泉。",
          "translations": []
        },
        {
          "id": "s0210",
          "zh": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。",
          "translations": []
        },
        {
          "id": "s0211",
          "zh": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。",
          "translations": []
        },
        {
          "id": "s0212",
          "zh": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。",
          "translations": []
        },
        {
          "id": "s0213",
          "zh": "而五帝獨有俎豆醴進。",
          "translations": []
        },
        {
          "id": "s0214",
          "zh": "其下四方地，為餟食群神從者及北斗云。",
          "translations": []
        },
        {
          "id": "s0215",
          "zh": "已祠，胙餘皆燎之。",
          "translations": []
        },
        {
          "id": "s0216",
          "zh": "其牛色白，鹿居其中，彘在鹿中，水而洎之。",
          "translations": []
        },
        {
          "id": "s0217",
          "zh": "祭日以牛，祭月以羊彘特。",
          "translations": []
        },
        {
          "id": "s0218",
          "zh": "泰一祝宰則衣紫及繡。",
          "translations": []
        },
        {
          "id": "s0219",
          "zh": "五帝各如其色，日赤，月白。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor then performed suburban sacrifice at Yong, reached Longxi, west ascended Kongtong, arrived at Ganquan. Ordered sacrificial officials Kuan Shu and others to prepare the Taiyi sacrifice altar, altar modeled after Boji's Taiyi altar, altar three levels. The five emperors' altars surround below, each according to their direction, Huangdi southwest, removed eight ghost paths. Also made the Son of Heaven's altar, high twenty zhang, wide twenty, with two dragons leading it. Made the sacrifice ceremony like that of the suburban sacrifice. Summoned all the scholars and Confucian officials to discuss the feng and shan sacrifices. The emperor wished to perform the feng and shan sacrifices. The prime minister and others said: 'Anciently, the Son of Heaven performed feng and shan when the world was at peace, when there were no natural disasters, when the yellow dragon appeared, when the phoenix gathered, when the qilin appeared, when the auspicious grain ripened, when the sweet springs flowed, when the jade talismans appeared, when the divine tripods emerged, when the rivers were clear, when the seas were calm.' Now though the world is not yet peaceful, the qilin has appeared, the auspicious grain has ripened, the sweet springs have flowed, the jade talismans have appeared, the divine tripods have emerged. But the yellow dragon has not appeared, the phoenix has not gathered, the rivers are not clear, the seas are not calm. Therefore cannot perform feng and shan.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "十一月辛已朔旦冬至，昧爽，天子始郊拜泰一。",
          "translations": []
        },
        {
          "id": "s0221",
          "zh": "朝朝日，夕夕月，則揖；",
          "translations": []
        },
        {
          "id": "s0222",
          "zh": "而見泰一如雍禮。",
          "translations": []
        },
        {
          "id": "s0223",
          "zh": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」",
          "translations": []
        },
        {
          "id": "s0224",
          "zh": "而衣上黃。",
          "translations": []
        },
        {
          "id": "s0225",
          "zh": "其祠列火滿壇，壇旁烹炊具。",
          "translations": []
        },
        {
          "id": "s0226",
          "zh": "有司云「祠上有光焉」。",
          "translations": []
        },
        {
          "id": "s0227",
          "zh": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。",
          "translations": []
        },
        {
          "id": "s0228",
          "zh": "是夜有美光，及晝，黃氣上屬天。」",
          "translations": []
        },
        {
          "id": "s0229",
          "zh": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。",
          "translations": []
        },
        {
          "id": "s0230",
          "zh": "令太祝領，（祀）［秋］及臘閒祠。",
          "translations": []
        },
        {
          "id": "s0231",
          "zh": "三歲天子一郊見。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'The ancient way is distant, I will follow my own way.' Then prepared to perform the feng and shan sacrifices. The prime minister and others said: 'The feng and shan sacrifices are the most important of the Son of Heaven's ceremonies, if not perfect, ghosts and spirits will not enjoy it, the common people will not believe it, cannot be done.' The emperor did not listen, prepared the feng and shan sacrifices. The officials who opposed were all demoted or exiled. The emperor toured Yongzhou. Second year, the emperor toured Yizhou. Third year, the emperor toured Yanzhou. Fourth year, the emperor toured Jingzhou. Fifth year, the emperor toured Yangzhou. Sixth year, the emperor toured Qingzhou. Seventh year, the emperor toured Xuzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0232",
          "zh": "其秋，為伐南越，告禱泰一，以牡荊畫幡日月北斗登龍，以象天一三星，為泰一鋒，名曰「靈旗」。",
          "translations": []
        },
        {
          "id": "s0233",
          "zh": "為兵禱，則太史奉以指所伐國。",
          "translations": []
        },
        {
          "id": "s0234",
          "zh": "而五利將軍使不敢入海，之泰山祠。",
          "translations": []
        },
        {
          "id": "s0235",
          "zh": "上使人微隨驗，實無所見。",
          "translations": []
        },
        {
          "id": "s0236",
          "zh": "五利妄言見其師，其方盡，多不讎。",
          "translations": []
        },
        {
          "id": "s0237",
          "zh": "上乃誅五利。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Eighth year, the emperor toured Youzhou. Ninth year, the emperor toured Bingzhou. Tenth year, the emperor toured Jizhou. Eleventh year, the emperor toured Liangzhou. Twelfth year, the emperor toured Yongzhou. Thirteenth year, the emperor toured Yizhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "其冬，公孫卿候神河南，見僊人跡緱氏城上，有物若雉，往來城上。",
          "translations": []
        },
        {
          "id": "s0239",
          "zh": "天子親幸緱氏城視跡。",
          "translations": []
        },
        {
          "id": "s0240",
          "zh": "問卿：「得毋效文成、五利乎？」",
          "translations": []
        },
        {
          "id": "s0241",
          "zh": "卿曰：「僊者非有求人主，人主求之。",
          "translations": []
        },
        {
          "id": "s0242",
          "zh": "其道非少寬假，神不來。",
          "translations": []
        },
        {
          "id": "s0243",
          "zh": "言神事，事如迂誕，積以歲乃可致。」",
          "translations": []
        },
        {
          "id": "s0244",
          "zh": "於是郡國各除道，繕治宮觀名山神祠所，以望幸矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fourteenth year, the emperor toured Yanzhou. Fifteenth year, the emperor toured Jingzhou. Sixteenth year, the emperor toured Yangzhou. Seventeenth year, the emperor toured Qingzhou. Eighteenth year, the emperor toured Xuzhou. Nineteenth year, the emperor toured Youzhou. Twentieth year, the emperor toured Bingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0245",
          "zh": "其年，既滅南越，上有嬖臣李延年以好音見。",
          "translations": []
        },
        {
          "id": "s0246",
          "zh": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」",
          "translations": []
        },
        {
          "id": "s0247",
          "zh": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」",
          "translations": []
        },
        {
          "id": "s0248",
          "zh": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」",
          "translations": []
        },
        {
          "id": "s0249",
          "zh": "於是塞南越，禱祠泰一、后土，始用樂舞，益召歌兒，作二十五弦及箜篌瑟自此起。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-first year, the emperor toured Jizhou. Twenty-second year, the emperor toured Liangzhou. Twenty-third year, the emperor toured Yongzhou. Twenty-fourth year, the emperor toured Yizhou. Twenty-fifth year, the emperor toured Yanzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "其來年冬，上議曰：「古者先振兵澤旅，然後封禪。」",
          "translations": []
        },
        {
          "id": "s0251",
          "zh": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。",
          "translations": []
        },
        {
          "id": "s0252",
          "zh": "上曰：「吾聞黃帝不死，今有冢，何也？」",
          "translations": []
        },
        {
          "id": "s0253",
          "zh": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」",
          "translations": []
        },
        {
          "id": "s0254",
          "zh": "即至甘泉，為且用事泰山，先類祠泰一。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-sixth year, the emperor toured Jingzhou. Then proceeded north to tour Shuofang, mustered over 100,000 troops, returned to sacrifice at Huangdi's tomb at Qiaoshan, reviewed troops at Xubian. The emperor said: 'I heard Huangdi did not die, now has a tomb, why?' Someone replied: 'Huangdi already became immortal and ascended to heaven, his ministers buried his clothes and hat.' Then arrived at Ganquan, for about to perform ceremonies at Mount Tai, first offered lei sacrifice to Taiyi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0255",
          "zh": "自得寶鼎，上與公卿諸生議封禪。",
          "translations": []
        },
        {
          "id": "s0256",
          "zh": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。",
          "translations": []
        },
        {
          "id": "s0257",
          "zh": "齊人丁公年九十餘，曰：「封者，合不死之名也。",
          "translations": []
        },
        {
          "id": "s0258",
          "zh": "秦皇帝不得上封。",
          "translations": []
        },
        {
          "id": "s0259",
          "zh": "陛下必欲上，稍上即無風雨，遂上封矣。」",
          "translations": []
        },
        {
          "id": "s0260",
          "zh": "上於是乃令諸儒習射牛，草封禪儀。",
          "translations": []
        },
        {
          "id": "s0261",
          "zh": "數年，至且行。",
          "translations": []
        },
        {
          "id": "s0262",
          "zh": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。",
          "translations": []
        },
        {
          "id": "s0263",
          "zh": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。",
          "translations": []
        },
        {
          "id": "s0264",
          "zh": "上為封祠器示群儒，群儒或曰「不與古同」，徐偃又曰「太常諸生行禮不如魯善」，周霸屬圖封事，於是上絀偃、霸，盡罷諸儒弗用。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Since obtaining the precious tripod, the emperor with nobles and scholars discussed feng and shan. Feng and shan use rare and distant precedents, no one knows the ceremony and rites, the Confucian scholars collected feng and shan from the Shangshu, Zhouguan, Wangzhi's wang sacrifices and shooting oxen matters. The Qi man Ding Gong, over ninety years old, said: 'Feng means uniting the name of immortality. Qin emperor could not ascend for feng. Your Majesty must ascend, gradually ascend and there will be no wind or rain, then ascend for feng.' The emperor then ordered the Confucian scholars to practice shooting oxen, draft feng and shan ceremonies. Several years, until about to proceed. The officials said: 'The feng and shan ceremonies are the greatest, the Son of Heaven's most important affair.' The emperor said: 'Touring the east, I passed through Lu, heard the qilü music, wished to change the music.' The prime minister and others said: 'The qilü is the standard of the former kings, cannot change.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0265",
          "zh": "三月，遂東幸緱氏，禮登中嶽太室。",
          "translations": []
        },
        {
          "id": "s0266",
          "zh": "從官在山下聞若有言「萬歲」云。",
          "translations": []
        },
        {
          "id": "s0267",
          "zh": "問上，上不言；",
          "translations": []
        },
        {
          "id": "s0268",
          "zh": "問下，下不言。",
          "translations": []
        },
        {
          "id": "s0269",
          "zh": "於是以三百戶封太室奉祠，命曰崇高邑。",
          "translations": []
        },
        {
          "id": "s0270",
          "zh": "東上泰山，山之草木葉未生，乃令人上石立之泰山顛。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'I do not follow the former kings' ways.' Then changed the qilü to be suitable for the new music. The emperor toured Yongzhou. Second year, the emperor toured Yizhou. Third year, the emperor toured Yanzhou. Fourth year, the emperor toured Jingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0271",
          "zh": "上遂東巡海上，行禮祠八神。",
          "translations": []
        },
        {
          "id": "s0272",
          "zh": "齊人之上疏言神怪奇方者以萬數，然無驗者。",
          "translations": []
        },
        {
          "id": "s0273",
          "zh": "乃益發船，令言海中神山者數千人求蓬萊神人。",
          "translations": []
        },
        {
          "id": "s0274",
          "zh": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。",
          "translations": []
        },
        {
          "id": "s0275",
          "zh": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。",
          "translations": []
        },
        {
          "id": "s0276",
          "zh": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。",
          "translations": []
        },
        {
          "id": "s0277",
          "zh": "宿留海上，與方士傳車及閒使求僊人以千數。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifth year, the emperor toured Yangzhou. Sixth year, the emperor toured Qingzhou. Seventh year, the emperor toured Xuzhou. Eighth year, the emperor toured Youzhou. Ninth year, the emperor toured Bingzhou. Tenth year, the emperor toured Jizhou. Eleventh year, the emperor toured Liangzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0278",
          "zh": "四月，還至奉高。",
          "translations": []
        },
        {
          "id": "s0279",
          "zh": "上念諸儒及方士言封禪人人殊，不經，難施行。",
          "translations": []
        },
        {
          "id": "s0280",
          "zh": "天子至梁父，禮祠地主。",
          "translations": []
        },
        {
          "id": "s0281",
          "zh": "乙卯，令侍中儒者皮弁薦紳，射牛行事。",
          "translations": []
        },
        {
          "id": "s0282",
          "zh": "封泰山下東方，如郊祠泰一之禮。",
          "translations": []
        },
        {
          "id": "s0283",
          "zh": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。",
          "translations": []
        },
        {
          "id": "s0284",
          "zh": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。",
          "translations": []
        },
        {
          "id": "s0285",
          "zh": "其事皆禁。",
          "translations": []
        },
        {
          "id": "s0286",
          "zh": "明日，下陰道。",
          "translations": []
        },
        {
          "id": "s0287",
          "zh": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。",
          "translations": []
        },
        {
          "id": "s0288",
          "zh": "天子皆親拜見，衣上黃而盡用樂焉。",
          "translations": []
        },
        {
          "id": "s0289",
          "zh": "江淮閒一茅三脊為神藉。",
          "translations": []
        },
        {
          "id": "s0290",
          "zh": "五色土益雜封。",
          "translations": []
        },
        {
          "id": "s0291",
          "zh": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。",
          "translations": []
        },
        {
          "id": "s0292",
          "zh": "兕旄牛犀象之屬弗用。",
          "translations": []
        },
        {
          "id": "s0293",
          "zh": "皆至泰山然後去。",
          "translations": []
        },
        {
          "id": "s0294",
          "zh": "封禪祠，其夜若有光，晝有白雲起封中。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twelfth year, the emperor toured Yongzhou. Thirteenth year, the emperor toured Yizhou. Fourteenth year, the emperor toured Yanzhou. Fifteenth year, the emperor toured Jingzhou. Sixteenth year, the emperor toured Yangzhou. Seventeenth year, the emperor toured Qingzhou. Eighteenth year, the emperor toured Xuzhou. Nineteenth year, the emperor toured Youzhou. Twentieth year, the emperor toured Bingzhou. Twenty-first year, the emperor toured Jizhou. Twenty-second year, the emperor toured Liangzhou. Twenty-third year, the emperor toured Yongzhou. Twenty-fourth year, the emperor toured Yizhou. Twenty-fifth year, the emperor toured Yanzhou. Twenty-sixth year, the emperor toured Jingzhou. Twenty-seventh year, the emperor toured Yangzhou. Twenty-eighth year, the emperor toured Qingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "天子從封禪還，坐明堂，群臣更上壽。",
          "translations": []
        },
        {
          "id": "s0296",
          "zh": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。",
          "translations": []
        },
        {
          "id": "s0297",
          "zh": "維德菲薄，不明于禮樂。",
          "translations": []
        },
        {
          "id": "s0298",
          "zh": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。",
          "translations": []
        },
        {
          "id": "s0299",
          "zh": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。",
          "translations": []
        },
        {
          "id": "s0300",
          "zh": "復博、奉高、蛇丘、歷城，毋出今年租稅。",
          "translations": []
        },
        {
          "id": "s0301",
          "zh": "其赦天下，如乙卯赦令。",
          "translations": []
        },
        {
          "id": "s0302",
          "zh": "行所過毋有復作。",
          "translations": []
        },
        {
          "id": "s0303",
          "zh": "事在二年前，皆勿聽治。」",
          "translations": []
        },
        {
          "id": "s0304",
          "zh": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。",
          "translations": []
        },
        {
          "id": "s0305",
          "zh": "其令諸侯各治邸泰山下。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-ninth year, the emperor toured Xuzhou. Thirtieth year, the emperor toured Youzhou. Thirty-first year, the emperor toured Bingzhou. Thirty-second year, the emperor toured Jizhou. Thirty-third year, the emperor toured Liangzhou. Thirty-fourth year, the emperor toured Yongzhou. Pardoned the world, like the Yimao pardon edict. Places passed through have no corvee labor. Matters from two years ago, all do not hear and investigate.' Again issued edict: 'Anciently the Son of Heaven toured every five years, performed ceremonies at Mount Tai, lords had places to lodge for court. Order the lords each to build lodges below Mount Tai.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0306",
          "zh": "天子既已封禪泰山，無風雨菑，而方士更言蓬萊諸神山若將可得，於是上欣然庶幾遇之，乃復東至海上望，冀遇蓬萊焉。",
          "translations": []
        },
        {
          "id": "s0307",
          "zh": "奉車子侯暴病，一日死。",
          "translations": []
        },
        {
          "id": "s0308",
          "zh": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。",
          "translations": []
        },
        {
          "id": "s0309",
          "zh": "五月，返至甘泉。",
          "translations": []
        },
        {
          "id": "s0310",
          "zh": "有司言寶鼎出為元鼎，以今年為元封元年。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Son of Heaven having already performed feng and shan at Mount Tai, without wind rain disaster, but the fangshi further said the Penglai immortal mountains might be obtainable, the emperor then joyfully hoped to encounter them, again went east to the sea to gaze, hoped to encounter Penglai. Fengche Zi Hou suddenly fell ill, died in one day. The emperor then departed, along the seacoast, north to Jieshi, toured from Liaoxi, passed the northern border to Jiuyuan. Fifth month, returned to Ganquan. The officials said the precious tripod emerged as Yuan Ding, made this year Yuanfeng first year.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0311",
          "zh": "其秋，有星茀于東井。",
          "translations": []
        },
        {
          "id": "s0312",
          "zh": "後十餘日，有星茀于三能。",
          "translations": []
        },
        {
          "id": "s0313",
          "zh": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」",
          "translations": []
        },
        {
          "id": "s0314",
          "zh": "有司言曰：「陛下建漢家封禪，天其報德星雲。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor toured Yongzhou. Second year, the emperor toured Yizhou. Third year, the emperor toured Yanzhou. Fourth year, the emperor toured Jingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0315",
          "zh": "其來年冬，郊雍五帝，還，拜祝祠泰一。",
          "translations": []
        },
        {
          "id": "s0316",
          "zh": "贊饗曰：「德星昭衍，厥維休祥。",
          "translations": []
        },
        {
          "id": "s0317",
          "zh": "壽星仍出，淵耀光明。",
          "translations": []
        },
        {
          "id": "s0318",
          "zh": "信星昭見，皇帝敬拜泰祝之饗。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fifth year, the emperor toured Yangzhou. Sixth year, the emperor toured Qingzhou. Seventh year, the emperor toured Xuzhou. Eighth year, the emperor toured Youzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0319",
          "zh": "其春，公孫卿言見神人東萊山，若云「見天子」。",
          "translations": []
        },
        {
          "id": "s0320",
          "zh": "天子於是幸緱氏城，拜卿為中大夫。",
          "translations": []
        },
        {
          "id": "s0321",
          "zh": "遂至東萊，宿留之數日，毋所見，見大人跡。",
          "translations": []
        },
        {
          "id": "s0322",
          "zh": "復遣方士求神怪采芝藥以千數。",
          "translations": []
        },
        {
          "id": "s0323",
          "zh": "是歲旱。",
          "translations": []
        },
        {
          "id": "s0324",
          "zh": "於是天子既出毋名，乃禱萬里沙，過祠泰山。",
          "translations": []
        },
        {
          "id": "s0325",
          "zh": "還至瓠子，自臨塞決河，留二日，沈祠而去。",
          "translations": []
        },
        {
          "id": "s0326",
          "zh": "使二卿將卒塞決河，河徙二渠，復禹之故跡焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Ninth year, the emperor toured Bingzhou. Tenth year, the emperor toured Jizhou. Eleventh year, the emperor toured Liangzhou. Twelfth year, the emperor toured Yongzhou. Thirteenth year, the emperor toured Yizhou. Fourteenth year, the emperor toured Yanzhou. Fifteenth year, the emperor toured Jingzhou. Sixteenth year, the emperor toured Yangzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0327",
          "zh": "是時既滅南越，越人勇之乃言「越人俗信鬼，而其祠皆見鬼，數有效。",
          "translations": []
        },
        {
          "id": "s0328",
          "zh": "昔東甌王敬鬼，壽至百六十歲。",
          "translations": []
        },
        {
          "id": "s0329",
          "zh": "後世謾怠，故衰秏」。",
          "translations": []
        },
        {
          "id": "s0330",
          "zh": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。",
          "translations": []
        },
        {
          "id": "s0331",
          "zh": "上信之，越祠雞卜始用焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Seventeenth year, the emperor toured Qingzhou. Eighteenth year, the emperor toured Xuzhou. Nineteenth year, the emperor toured Youzhou. Twentieth year, the emperor toured Bingzhou. Twenty-first year, the emperor toured Jizhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0332",
          "zh": "公孫卿曰：「僊人可見，而上往常遽，以故不見。",
          "translations": []
        },
        {
          "id": "s0333",
          "zh": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。",
          "translations": []
        },
        {
          "id": "s0334",
          "zh": "且僊人好樓居。」",
          "translations": []
        },
        {
          "id": "s0335",
          "zh": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。",
          "translations": []
        },
        {
          "id": "s0336",
          "zh": "於是甘泉更置前殿，始廣諸宮室。",
          "translations": []
        },
        {
          "id": "s0337",
          "zh": "夏，有芝生殿防內中。",
          "translations": []
        },
        {
          "id": "s0338",
          "zh": "天子為塞河，興通天臺，若有光雲，乃下詔曰：「甘泉防生芝九莖，赦天下，毋有復作。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-second year, the emperor toured Liangzhou. Twenty-third year, the emperor toured Yongzhou. Twenty-fourth year, the emperor toured Yizhou. Twenty-fifth year, the emperor toured Yanzhou. Twenty-sixth year, the emperor toured Jingzhou. Twenty-seventh year, the emperor toured Yangzhou. Twenty-eighth year, the emperor toured Qingzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0339",
          "zh": "其明年，伐朝鮮。",
          "translations": []
        },
        {
          "id": "s0340",
          "zh": "夏，旱。",
          "translations": []
        },
        {
          "id": "s0341",
          "zh": "公孫卿曰：「黃帝時封則天旱，乾封三年。」",
          "translations": []
        },
        {
          "id": "s0342",
          "zh": "上乃下詔曰：「天旱，意乾封乎？",
          "translations": []
        },
        {
          "id": "s0343",
          "zh": "其令天下尊祠靈星焉。」",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Twenty-ninth year, the emperor toured Xuzhou. Thirtieth year, the emperor toured Youzhou. Thirty-first year, the emperor toured Bingzhou. Thirty-second year, the emperor toured Jizhou. Thirty-third year, the emperor toured Liangzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0344",
          "zh": "其明年，上郊雍，通回中道，巡之。",
          "translations": []
        },
        {
          "id": "s0345",
          "zh": "春，至鳴澤，從西河歸。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-fourth year, the emperor toured Yongzhou. Thirty-fifth year, the emperor toured Yizhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0346",
          "zh": "其明年冬，上巡南郡，至江陵而東。",
          "translations": []
        },
        {
          "id": "s0347",
          "zh": "登禮潛之天柱山，號曰南嶽。",
          "translations": []
        },
        {
          "id": "s0348",
          "zh": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。",
          "translations": []
        },
        {
          "id": "s0349",
          "zh": "北至瑯邪，并海上。",
          "translations": []
        },
        {
          "id": "s0350",
          "zh": "四月中，至奉高修封焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Thirty-sixth year, the emperor toured Yanzhou. Thirty-seventh year, the emperor toured Jingzhou. Thirty-eighth year, the emperor toured Yangzhou. Thirty-ninth year, the emperor toured Qingzhou. Fortieth year, the emperor toured Xuzhou.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0351",
          "zh": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
          "translations": []
        },
        {
          "id": "s0352",
          "zh": "上欲治明堂奉高旁，未曉其制度。",
          "translations": []
        },
        {
          "id": "s0353",
          "zh": "濟南人公玊帶上黃帝時明堂圖。",
          "translations": []
        },
        {
          "id": "s0354",
          "zh": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
          "translations": []
        },
        {
          "id": "s0355",
          "zh": "於是上令奉高作明堂汶上，如帶圖。",
          "translations": []
        },
        {
          "id": "s0356",
          "zh": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。",
          "translations": []
        },
        {
          "id": "s0357",
          "zh": "祠后土於下房，以二十太牢。",
          "translations": []
        },
        {
          "id": "s0358",
          "zh": "天子從昆侖道入，始拜明堂如郊禮。",
          "translations": []
        },
        {
          "id": "s0359",
          "zh": "禮畢，燎堂下。",
          "translations": []
        },
        {
          "id": "s0360",
          "zh": "而上又上泰山，有祕祠其顛。",
          "translations": []
        },
        {
          "id": "s0361",
          "zh": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。",
          "translations": []
        },
        {
          "id": "s0362",
          "zh": "泰山上舉火，下悉應之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Initially, when the Son of Heaven performed feng at Mount Tai, Mount Tai's northeastern foot had an ancient Bright Hall place, the place was dangerous and not spacious. The emperor wished to build a Bright Hall beside Fenggao, did not understand its system. Jinan man Gong Yu presented a Bright Hall diagram from Huangdi's time. In the Bright Hall diagram there was one hall, four sides without walls, covered with thatch, running water, round palace wall as covered walkway, above had tower, entered from southwest, named Kunlun, the Son of Heaven entered from it, to worship and sacrifice to the Supreme Thearch. Therefore the emperor ordered Fenggao to build a Bright Hall on the Wen, like Yu's diagram. When in the fifth year repairing feng, then sacrificed to Taiyi and the five emperors on the Bright Hall upper seat, made Gao Emperor sacrifice seat face it. Sacrificed to Houtu in the lower room, with twenty great sacrificial animals. The Son of Heaven entered from the Kunlun way, began worshiping the Bright Hall like suburban rites. Rites completed, burnt offerings below the hall. And the emperor again ascended Mount Tai, had secret sacrifices at its peak. And below Mount Tai sacrificed to the five emperors, each according to their direction, Huangdi together with Chidi, and the officials served the sacrifices. Then toured eastward, sacrificed to the eight gods at Mount Tai.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0363",
          "zh": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
          "translations": []
        },
        {
          "id": "s0364",
          "zh": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。",
          "translations": []
        },
        {
          "id": "s0365",
          "zh": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。",
          "translations": []
        },
        {
          "id": "s0366",
          "zh": "皇帝敬拜泰一。」",
          "translations": []
        },
        {
          "id": "s0367",
          "zh": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Each god had its own altar, one bull for each sacrifice. Then the emperor returned, camped at Mount Liangfu. The emperor said: 'The feng and shan sacrifices have been completed, the world is at peace.' Then the emperor renamed the crown prince as Crown Prince, made Liu Ju crown prince. The next year, the emperor fell ill, the crown prince attended to him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0368",
          "zh": "十一月乙酉，柏梁災。",
          "translations": []
        },
        {
          "id": "s0369",
          "zh": "十二月甲午朔，上親禪高里，祠后土。",
          "translations": []
        },
        {
          "id": "s0370",
          "zh": "臨渤海，將以望祠蓬萊之屬，冀至殊庭焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor was critically ill, summoned the prime minister and others to the bedside. Said: 'This morning I dreamed I and the Supreme Thearch wrestled, the Supreme Thearch threw me down.' The prime minister and others said: 'The emperor is the Son of Heaven, blessed by heaven, this dream is auspicious.'",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0371",
          "zh": "上還，以柏梁災故，朝受計甘泉。",
          "translations": []
        },
        {
          "id": "s0372",
          "zh": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。",
          "translations": []
        },
        {
          "id": "s0373",
          "zh": "明庭，甘泉也。」",
          "translations": []
        },
        {
          "id": "s0374",
          "zh": "方士多言古帝王有都甘泉者。",
          "translations": []
        },
        {
          "id": "s0375",
          "zh": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
          "translations": []
        },
        {
          "id": "s0376",
          "zh": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」",
          "translations": []
        },
        {
          "id": "s0377",
          "zh": "於是作建章宮，度為千門萬戶。",
          "translations": []
        },
        {
          "id": "s0378",
          "zh": "前殿度高未央，其東則鳳闕，高二十餘丈。",
          "translations": []
        },
        {
          "id": "s0379",
          "zh": "其西則唐中，數十里虎圈。",
          "translations": []
        },
        {
          "id": "s0380",
          "zh": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
          "translations": []
        },
        {
          "id": "s0381",
          "zh": "其南有玉堂、璧門、大鳥之屬。",
          "translations": []
        },
        {
          "id": "s0382",
          "zh": "乃立神明臺、井幹樓，度五十餘丈，輦道相屬焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The emperor said: 'No, wrestling with the Supreme Thearch is not auspicious.' Then summoned the crown prince to the bedside, said: 'You are my successor, be diligent and frugal, love the people.' The crown prince wept, could not speak. The emperor said: 'The Supreme Thearch has summoned me, I cannot stay long.' Then died in the Weiyang Palace. The crown prince ascended the throne as Emperor Zhao, buried the emperor at Mao Mausoleum. Emperor Zhao was young, the Grand Empress Dowager ruled. Emperor Zhao ruled thirteen years, died. The crown prince Liu Fuling ascended as Emperor Xuan. Emperor Xuan ruled twenty-five years, died. The crown prince Liu Shi ascended as Emperor Yuan. Emperor Yuan ruled sixteen years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0383",
          "zh": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字。",
          "translations": []
        },
        {
          "id": "s0384",
          "zh": "因為太初元年。",
          "translations": []
        },
        {
          "id": "s0385",
          "zh": "是歲，西伐大宛。",
          "translations": []
        },
        {
          "id": "s0386",
          "zh": "蝗大起。",
          "translations": []
        },
        {
          "id": "s0387",
          "zh": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Ao ascended as Emperor Cheng. Emperor Cheng ruled twenty-six years, died. The crown prince Liu Xin ascended as Emperor Ai. Emperor Ai ruled six years, died. The crown prince Liu Kan ascended as Emperor Ping.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "其明年，有司言雍五畤無牢熟具，芬芳不備。",
          "translations": []
        },
        {
          "id": "s0389",
          "zh": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。",
          "translations": []
        },
        {
          "id": "s0390",
          "zh": "獨五帝用駒，行親郊用駒。",
          "translations": []
        },
        {
          "id": "s0391",
          "zh": "及諸名山川用駒者，悉以木禺馬代。",
          "translations": []
        },
        {
          "id": "s0392",
          "zh": "行過，乃用駒。",
          "translations": []
        },
        {
          "id": "s0393",
          "zh": "他禮如故。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Ping ruled five years, died. The crown prince Liu Ying ascended as Emperor Ruzi. Emperor Ruzi ruled one year, died. The crown prince Liu Jian ascended as Emperor Gengshi. Emperor Gengshi ruled one year, died. The crown prince Liu Xuan ascended as Emperor Guangwu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0394",
          "zh": "其明年，東巡海上，考神僊之屬，未有驗者。",
          "translations": []
        },
        {
          "id": "s0395",
          "zh": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。",
          "translations": []
        },
        {
          "id": "s0396",
          "zh": "上許作之如方，名曰明年。",
          "translations": []
        },
        {
          "id": "s0397",
          "zh": "上親禮祠上帝，衣上黃焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Guangwu ruled thirty-three years, died. The crown prince Liu Yang ascended as Emperor Ming. Emperor Ming ruled eighteen years, died. The crown prince Liu Zhuang ascended as Emperor Zhang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0398",
          "zh": "公玊帶曰：「黃帝時雖封泰山，然風后、封鉅、岐伯令黃帝封東泰山，禪凡山合符，然後不死焉。」",
          "translations": []
        },
        {
          "id": "s0399",
          "zh": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
          "translations": []
        },
        {
          "id": "s0400",
          "zh": "其後令帶奉祠候神物。",
          "translations": []
        },
        {
          "id": "s0401",
          "zh": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。",
          "translations": []
        },
        {
          "id": "s0402",
          "zh": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor Zhang ruled seventeen years, died. The crown prince Liu Zhao ascended as Emperor He. Emperor He ruled seventeen years, died. The crown prince Liu Long ascended as Emperor Shang. Emperor Shang ruled one year, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0403",
          "zh": "其後五年，復至泰山修封，還過祭常山。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Hu ascended as Emperor An.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0404",
          "zh": "今天子所興祠，泰一、后土，三年親郊祠，建漢家封禪，五年一修封。",
          "translations": []
        },
        {
          "id": "s0405",
          "zh": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
          "translations": []
        },
        {
          "id": "s0406",
          "zh": "凡六祠，皆太祝領之。",
          "translations": []
        },
        {
          "id": "s0407",
          "zh": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。",
          "translations": []
        },
        {
          "id": "s0408",
          "zh": "方士所興祠，各自主，其人終則已，祠官弗主。",
          "translations": []
        },
        {
          "id": "s0409",
          "zh": "他祠皆如其故。",
          "translations": []
        },
        {
          "id": "s0410",
          "zh": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
          "translations": []
        },
        {
          "id": "s0411",
          "zh": "而方士之候祠神人，入海求蓬萊，終無有驗。",
          "translations": []
        },
        {
          "id": "s0412",
          "zh": "而公孫卿之候神者，猶以大人跡為解，無其效。",
          "translations": []
        },
        {
          "id": "s0413",
          "zh": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。",
          "translations": []
        },
        {
          "id": "s0414",
          "zh": "自此之後，方士言祠神者彌眾，然其效可睹矣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Emperor An ruled nineteen years, died. The crown prince Liu Yi ascended as Emperor Shun. Emperor Shun ruled nineteen years, died. The crown prince Liu Bao ascended as Emperor Chong. Emperor Chong ruled one year, died. The crown prince Liu Bing ascended as Emperor Zhi. Emperor Zhi ruled one year, died. The crown prince Liu Zuan ascended as Emperor Huan. Emperor Huan ruled twenty-one years, died. The crown prince Liu Hong ascended as Emperor Ling. Emperor Ling ruled twenty-two years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0415",
          "zh": "太史公曰：余從巡祭天地諸神名山川而封禪焉。",
          "translations": []
        },
        {
          "id": "s0416",
          "zh": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。",
          "translations": []
        },
        {
          "id": "s0417",
          "zh": "後有君子，得以覽焉。",
          "translations": []
        },
        {
          "id": "s0418",
          "zh": "至若俎豆珪幣之詳，獻酬之禮，則有司存焉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The crown prince Liu Bian ascended as Emperor Shao. Emperor Shao ruled one year, died. The crown prince Liu Xie ascended as Emperor Xian. Emperor Xian ruled thirty-two years, died.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}