{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "023",
    "url": "https://chinesenotes.com/shiji/shiji023.html",
    "title": {
      "zh": "書‧禮書",
      "en": "Treatises - Rites",
      "raw": "《書‧禮書》 Treatises - Rites"
    },
    "sentenceCount": 155,
    "translatedCount": 45,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:48.896Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "太史公曰：洋洋美德乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grand Historian says: Vast and beautiful virtue!",
              "idiomatic": "The Grand Historian says: How vast and beautiful is this virtue!"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "宰制萬物，役使群眾，豈人力也哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Controlling ten thousand things, employing the multitudes, how is it human power?",
              "idiomatic": "To control the ten thousand things and employ the multitudes—how could this be accomplished by human power alone?"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "余至大行禮官，觀三代損益，乃知緣人情而制禮，依人性而作儀，其所由來尚矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I went to the Grand Procession rites official, observed the Three Dynasties' additions and subtractions, then knew that rites are established following human feelings, instruments are made relying on human nature, their origins have been ancient.",
              "idiomatic": "I went to the Grand Procession rites official and observed the additions and subtractions of the Three Dynasties. Only then did I understand that rites are established following human feelings, and instruments are made relying on human nature. The origins of these practices are truly ancient."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian said: How vast and beautiful is virtue! To control all things and employ the multitudes, how can this be done by human strength alone? I came to the Grand Ceremonial Office and observed the gains and losses of the Three Dynasties, and thus knew that rites are established according to human feelings, and ceremonies are made according to human nature—their origins are ancient indeed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "人道經緯萬端，規矩無所不貫，誘進以仁義，束縛以刑罰，故德厚者位尊，祿重者寵榮，所以總一海內而整齊萬民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Human way weaves ten thousand ends, rules and squares penetrate everything, entice forward with benevolence righteousness, bind with punishments, therefore virtue thick ones position honored, emolument heavy ones favor glorious, thus unifying the realm within the seas and orderly arranging the ten thousand people.",
              "idiomatic": "The human way weaves together ten thousand threads, and rules and standards penetrate everything. People are enticed forward with benevolence and righteousness, and bound by punishments. Therefore, those of thick virtue hold honored positions, and those with heavy emoluments enjoy glorious favor. This is how to unify the realm within the seas and bring orderly arrangement to the ten thousand people."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "人體安駕乘，為之金輿錯衡以繁其飾；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Human body at ease riding driving, for it gold carriage inlaid yoke to multiply its ornaments;",
              "idiomatic": "The human body finds ease in riding and driving, so for it there are gold carriages with inlaid yokes to multiply their ornaments."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "目好五色，為之黼黻文章以表其能；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Eyes fond of five colors, for them embroidered patterned textiles to display their ability;",
              "idiomatic": "The eyes are fond of the five colors, so for them there are embroidered and patterned textiles to display their abilities."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "耳樂鐘磬，為之調諧八音以蕩其心；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ears enjoy bells chimes, for them tuned harmonious eight sounds to stir their hearts;",
              "idiomatic": "The ears enjoy bells and chimes, so for them there are tuned and harmonious eight sounds to stir their hearts."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "口甘五味，為之庶羞酸咸以致其美；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Mouth sweetens five flavors, for it many delicacies sour salty to bring their beauty;",
              "idiomatic": "The mouth savors the five flavors, so for it there are many delicacies—sour and salty—to bring out their beauty."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "情好珍善，為之琢磨圭璧以通其意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Emotions fond of precious good, for them polished jade tablets to communicate their intent.",
              "idiomatic": "The emotions are fond of precious and good things, so for them there are polished jade tablets to communicate their intent."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "故大路越席，皮弁布裳，朱弦洞越，大羹玄酒，所以防其淫侈，救其彫敝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore great carriage rush mats, leather caps cloth skirts, vermilion strings resonant zithers, great broth clear wine, thus to prevent their licentious extravagance, save their carved decay.",
              "idiomatic": "Therefore, there are great carriages with rush mats, leather caps with cloth skirts, vermilion strings on resonant zithers, and great broth with clear wine. These are used to prevent licentious extravagance and save the people from carved decay."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "是以君臣朝廷尊卑貴賤之序，下及黎庶車輿衣服宮室飲食嫁娶喪祭之分，事有宜適，物有節文。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore ruler minister court honored lowly noble base sequence, down to black-haired people carriages clothing palaces rooms food marriage funeral sacrifice divisions, matters have suitable adaptations, things have regulated patterns.",
              "idiomatic": "Therefore, there is the sequence of ruler and minister in the court—of honored and lowly, noble and base—extending down to the black-haired people with their divisions of carriages, clothing, palaces, rooms, food, marriage, funeral, and sacrifice. Matters have suitable adaptations, and things have regulated patterns."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "仲尼曰：「褅自既灌而往者，吾不欲觀之矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhong Ni said: \"The di sacrifice from after the libation onward, I do not wish to observe it.\"",
              "idiomatic": "Zhongni said: 'As for the di sacrifice, from after the libation onward, I do not wish to observe it.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The way of man has myriad aspects, and regulations penetrate everything; guiding forward with benevolence and righteousness, restraining with punishments, thus those with thick virtue have honored positions, those with heavy salaries have honored glory, so as to unify the empire and regulate the myriad people. The human body delights in riding carriages, so for it they make golden carriages with inlaid yokes to enrich its adornment; The eyes delight in the five colors, so for them they make embroidered patterns and designs to display their ability; The ears delight in bells and chimes, so for them they tune the eight sounds to move their hearts; The mouth delights in the five flavors, so for it they prepare many delicacies of sour and salty to bring their beauty; The emotions delight in treasures and goodness, so for them they polish jade disks to communicate their intentions. Therefore the great chariot and reed mat, the leather bonnet and cloth robe, the vermilion strings and penetrating tones, the great broth and plain wine—these serve to prevent licentious extravagance and save from decay. Thus the order of ruler and minister, court and official, honored and humble, noble and base, extending down to the common people, carriages and clothing, palaces and chambers, food and drink, marriage and burial, mourning and sacrifice—each matter has what is suitable, each thing has regulated form. Confucius said: 'For the sacrifice at the ancestral temple, once the libation has been poured, I no longer wish to watch it.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0014",
          "zh": "周衰，禮廢樂壞，大小相踰，管仲之家，兼備三歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhou declined, rites abandoned music ruined, great small mutually overstepped, Guan Zhong's household, combined prepared three returns.",
              "idiomatic": "When the Zhou declined, rites were abandoned and music was ruined. Great and small overstepped each other. Guan Zhong's household combined and prepared the three returns."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "循法守正者見侮於世，奢溢僭差者謂之顯榮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Following law guarding upright ones seen insulted by the world, extravagant overflowing presumptuous differing ones called manifest glory.",
              "idiomatic": "Those who follow the law and guard uprightness are insulted by the world, while those who are extravagant, overflowing, presumptuous, and differing are called manifest glory."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "自子夏，門人之高弟也，猶云「出見紛華盛麗而說，入聞夫子之道而樂，二者心戰，未能自決」，而況中庸以下，漸漬於失教，被服於成俗乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Even Zi Xia, disciples' high disciple, still said \"Going out seeing variegated splendor flourishing beauty and pleased, entering hearing Master Dao and happy, two things heart battle, unable self-decide\", moreover middle ordinary and below, gradually immersed in lost teaching, clothed in established customs?",
              "idiomatic": "Even Zi Xia, the highest disciple among the disciples, still said: 'Going out I see variegated splendor and flourishing beauty and am pleased; entering I hear the Master's Dao and am happy. These two things battle in my heart, and I cannot decide for myself.' How much more so for those of middle and ordinary ability and below, who are gradually immersed in lost teaching and clothed in established customs?"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "孔子曰「必也正名」，於衛所居不合。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Confucius said \"It must be rectifying names\", at Wei his residence not harmonious.",
              "idiomatic": "Confucius said: 'It must be rectifying names.' His residence in the state of Wei was not harmonious."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "仲尼沒後，受業之徒沈湮而不舉，或適齊、楚，或入河海，豈不痛哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhong Ni passed away after, received teachings disciples sunken submerged not raised, some went to Qi, Chu, some entered rivers seas, how not painful!",
              "idiomatic": "After Zhongni passed away, his disciples who received his teachings sank into obscurity and were not raised up. Some went to Qi and Chu, others entered the rivers and seas. How could this not be painful!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Zhou declined, rites were abandoned and music corrupted, great and small overstepped each other; Guan Zhong's household possessed the three returns in combination. Those who followed the law and maintained correctness were insulted by the world, those who were extravagant and presumptuous were called glorious. Even Zi Xia, the most eminent disciple of the disciples, still said 'Going out I see the splendor and magnificence and am pleased, coming in I hear the Master's way and am joyful—these two battle in my heart, I cannot decide myself', and moreover those of mediocre capacity and below, gradually soaked in lost teachings, clothed in established customs—what then? Confucius said 'It is essential to correct names', but in Wei his dwelling was not in accord. After Confucius passed away, his disciples who received his teachings sank into obscurity and were not raised up; some went to Qi or Chu, some entered the rivers and seas—how painful it is!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0019",
          "zh": "至秦有天下，悉內六國禮儀，采擇其善，雖不合聖制，其尊君抑臣，朝廷濟濟，依古以來。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Until Qin possessed the realm, entirely took in six states' rites ceremonies, selected their good, though not matching sage system, their honoring ruler suppressing minister, court flourishing flourishing, following ancient since.",
              "idiomatic": "When Qin possessed the realm, it entirely took in the rites and ceremonies of the six states, selecting what was good from them. Though they did not match the sage system, they honored the ruler and suppressed ministers, and the court was flourishing and orderly, following ancient practices."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "至于高祖，光有四海，叔孫通頗有所增益減損，大抵皆襲秦故。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "As for Gaozu, illuminated possessed four seas, Shusun Tong considerably had additions subtractions, generally all followed Qin old.",
              "idiomatic": "As for Gaozu, who illuminated and possessed the four seas, Shusun Tong made considerable additions and subtractions, but generally all followed the old Qin practices."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "自天子稱號下至佐僚及宮室官名，少所變改。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "From Son of Heaven titles down to assistants and palace room official names, little changed.",
              "idiomatic": "From the Son of Heaven's titles down to assistants and palace room official names, little was changed."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "孝文即位，有司議欲定儀禮，孝文好道家之學，以為繁禮飾貌，無益於治，躬化謂何耳，故罷去之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Filial Wen ascended throne, officials discussed wished establish ceremony rites, Filial Wen fond Daoist learning, considered elaborate rites decorated appearances, no benefit to governing, personal transformation what ear, therefore dismissed them.",
              "idiomatic": "When Filial Wen ascended the throne, the officials discussed and wished to establish ceremony and rites. But Filial Wen was fond of Daoist learning and considered that elaborate rites and decorated appearances were of no benefit to governing—what mattered was personal transformation—so he dismissed them."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "孝景時，御史大夫晁錯明於世務刑名，數干諫孝景曰：「諸侯藩輔，臣子一例，古今之制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Filial Jing time, Imperial Secretary Chun Cuo clear about worldly affairs penal names, several times earnestly admonished Filial Jing saying: \"Feudal lords screen auxiliaries, minister sons one precedent, ancient present system also.\"",
              "idiomatic": "During Filial Jing's time, Imperial Secretary Chao Cuo was clear about worldly affairs and penal names. He several times earnestly admonished Filial Jing, saying: 'The feudal lords are screens and auxiliaries, minister and sons are one precedent—this is the system of ancient and present times.'"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "今大國專治異政，不稟京師，恐不可傳後。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now great states monopolize governance different administration, not report capital, fear cannot transmit posterity.\"",
              "idiomatic": "'Now the great states monopolize governance with different administrations and do not report to the capital. I fear this cannot be transmitted to posterity.'"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "孝景用其計，而六國畔逆，以錯首名，天子誅錯以解難。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Filial Jing used his plan, then six states rebelled rebelled, with Cuo first named, Son of Heaven executed Cuo to resolve difficulty.",
              "idiomatic": "Filial Jing used his plan, and then the six states rebelled. With Cuo named first, the Son of Heaven executed Cuo to resolve the difficulty."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "事在袁盎語中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Matter in Yuan'ang words midst.",
              "idiomatic": "The matter is in the midst of Yuan Ang's words."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "是後官者養交安祿而已，莫敢復議。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "After this officials nourished connections secured stipends only, none dared again discuss.",
              "idiomatic": "After this, officials only nourished connections and secured their stipends. None dared discuss the matter again."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Qin possessed the empire, it took in all the rites and ceremonies of the six states, selecting their good points; although not in accord with the sage's system, it honored the ruler and suppressed ministers, the court was orderly, following ancient ways. Coming to Gaozu, he possessed the four seas, Shu Sun Tong considerably added to and reduced them, but on the whole they all inherited Qin's old ways. From the emperor's title downward to aides and officials and palace and office names, few were changed. When Filial Wen ascended the throne, the officials discussed wanting to establish ceremonial rites; Filial Wen delighted in Daoist learning, considering elaborate rites and adorned appearances useless for governance, how could personal transformation be done?—thus he dismissed it. In Filial Jing's time, Imperial Secretary Chun Cuo was clear about worldly affairs and legalist names, repeatedly remonstrated Filial Jing saying: 'The nobles are bulwarks, ministers and sons are one example, this is the system of ancient and modern times. Now the great states monopolize different governance, not receiving from the capital, I fear it cannot be transmitted to posterity.' Filial Jing used his plan, and the six states rebelled in defiance, with Cuo as the first named, the Son of Heaven executed Cuo to resolve the difficulty. The matter is in Yuan Ang's biography. After this, officials nourished connections and secured salaries, none dared discuss again.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "今上即位，招致儒術之士，令共定儀，十餘年不就。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Present Majesty ascended throne, summoned Confucian arts scholars, ordered together establish ceremonies, ten several years not completed.",
              "idiomatic": "When the present Majesty ascended the throne, he summoned scholars of Confucian arts and ordered them to together establish ceremonies. After more than ten years, it was not completed."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "或言古者太平，萬民和喜，瑞應辨至，乃采風俗，定制作。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Some said ancient ones great peace, ten thousand people harmonious happy, auspicious responses clearly arrived, then collected customs, established creations.",
              "idiomatic": "Some said that in ancient times, when there was great peace and the ten thousand people were harmonious and happy, and auspicious responses clearly arrived, then customs were collected and creations established."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "上聞之，制詔御史曰：「蓋受命而王，各有所由興，殊路而同歸，謂因民而作，追俗為制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Above heard it, formulated edict imperial secretary saying: \"Probably received mandate became king, each had origin arose, different roads same return, means following people made, pursuing customs as system also.\"",
              "idiomatic": "The emperor heard this and formulated an edict to the imperial secretary, saying: 'Probably those who received the mandate and became kings each had their origin of rising. Though by different roads, they return to the same place. This means following the people to make things, and pursuing customs as the system.'"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "議者咸稱太古，百姓何望？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Discussers all praised great antiquity, common people what hope?",
              "idiomatic": "The discussers all praise great antiquity—what hope do the common people have?"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "漢亦一家之事，典法不傳，謂子孫何？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Han also one family's matter, classical laws not transmitted, what tell descendants?",
              "idiomatic": "The Han is also the matter of one family. If the classical laws are not transmitted, what will we tell our descendants?"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "化隆者閎博，治淺者褊狹，可不勉與！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Transformation flourishing ones vast broad, governance shallow ones narrow cramped, can not strive with them!\"",
              "idiomatic": "Those whose transformations flourish are vast and broad; those whose governance is shallow are narrow and cramped. Can we not strive to join the former!\""
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "乃以太初之元改正朔，易服色，封太山，定宗廟百官之儀，以為典常，垂之於後云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then with Tai Chu's origin corrected calendar, changed garment colors, sealed Taishan, established ancestral temple hundred officials' ceremonies, as classical constant, handed down to posterity cloud.",
              "idiomatic": "Then, using the origin of Tai Chu, they corrected the calendar, changed the garment colors, conducted the Feng sacrifice at Mount Tai, and established the ceremonies for the ancestral temple and the hundred officials, making them the classical constants to be handed down to posterity."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Now when the present emperor ascended, he summoned Confucian scholars, ordered them to jointly establish ceremonies, over ten years not completed. Some said in ancient times when there was great peace, the myriad people were harmonious and joyful, auspicious responses clearly arrived, then they gathered customs, established the system of making. The emperor heard this, issued an edict to the Imperial Secretary saying: 'Receiving the mandate and becoming king, each has its origin for rising, different paths but same destination, called following the people and making, pursuing customs to establish the system. The discussers all praise great antiquity—what do the common people hope for? Han is also one family's matter, classical laws not transmitted—what to tell descendants? Those with flourishing transformation are broad and expansive, those with shallow governance are narrow and petty—can we not strive for it!' Thus with the Tai Chu era they corrected the calendar, changed the robe colors, sealed Mount Tai, established the ancestral temple and hundred officials' ceremonies, to serve as eternal standards, handing them down to posterity.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "禮由人起。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Rites from people arise.",
              "idiomatic": "Rites arise from people."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "人生有欲，欲而不得則不能無忿，忿而無度量則爭，爭則亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Human life has desires, desire and not obtain then cannot without resentment, resentment and without measure then contend, contend then chaos.",
              "idiomatic": "The human condition involves desires. If desires are not fulfilled, one cannot be without resentment. If resentment has no measure, then there is contention. If there is contention, then there is chaos."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "先王惡其亂，故制禮義以養人之欲，給人之求，使欲不窮於物，物不屈於欲，二者相待而長，是禮之所起也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Former kings hated their chaos, therefore established rites righteousness to nourish people's desires, supply people's requests, make desires not exhaust in things, things not bend to desires, two things mutually await and grow, this is rites' origin.",
              "idiomatic": "The former kings hated this chaos, so they established rites and righteousness to nourish people's desires and supply their requests, ensuring that desires do not exhaust things and things do not bend to desires. The two mutually await and grow—this is the origin of rites."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "故禮者養也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore rites are nourishment.",
              "idiomatic": "Therefore, rites are nourishment."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "稻粱五味，所以養口也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Rice millet five flavors, thus nourish mouth also;",
              "idiomatic": "Rice and millet with the five flavors thus nourish the mouth."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "椒蘭芬茝，所以養鼻也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Pepper orchid fragrant chai, thus nourish nose also;",
              "idiomatic": "Pepper, orchid, fragrant herbs, and chai thus nourish the nose."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "鐘鼓管弦，所以養耳也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Bells drums pipes strings, thus nourish ears also;",
              "idiomatic": "Bells, drums, pipes, and strings thus nourish the ears."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "刻鏤文章，所以養目也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Carved engraved patterns writings, thus nourish eyes also;",
              "idiomatic": "Carved and engraved patterns and writings thus nourish the eyes."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "疏房床笫几席，所以養體也：故禮者養也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Spacious rooms beds mats tables mats, thus nourish body also: therefore rites are nourishment.",
              "idiomatic": "Spacious rooms, beds, mats, tables, and seating mats thus nourish the body. Therefore, rites are nourishment."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Rites arise from people. People are born with desires; desiring but not obtaining cannot but cause resentment, resentment without measure leads to contention, contention leads to disorder. The former kings hated this disorder, thus established rites and righteousness to nourish people's desires, supply people's needs, make desires not exhaust things, things not bend to desires—the two support each other and grow, this is where rites arise. Thus rites are nourishment. Rice and millet, the five flavors—these nourish the mouth; Pepper and orchids, fragrant iris—these nourish the nose; Bells and drums, pipes and strings—these nourish the ears; Carved and inlaid designs—these nourish the eyes; Spacious chambers, beds and mats, tables and mats—these nourish the body: thus rites are nourishment.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "君子既得其養，又好其辨也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Superior man already obtained its nourishment, moreover likes its distinction.",
              "idiomatic": "The gentleman has already obtained its nourishment, and moreover likes its distinction."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "所謂辨者，貴賤有等，長少有差，貧富輕重皆有稱也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "What is called distinction, noble base have ranks, elder younger have differences, poor rich light heavy all have proportion.",
              "idiomatic": "What is called distinction means that the noble and the base have ranks, the elder and the younger have differences, and the poor and the rich, the light and the heavy all have their proper proportions."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "故天子大路越席，所以養體也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Son of Heaven great carriage rush mats, thus nourish body also;",
              "idiomatic": "Therefore, the Son of Heaven's great carriage with rush mats thus nourishes the body."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "側載臭茝，所以養鼻也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Side loaded fragrant chai, thus nourish nose also;"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "前有錯衡，所以養目也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Front has inlaid yoke, thus nourish eyes also;"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "和鸞之聲，步中武象，驟中韶濩，所以養耳也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Harmonious luan sound, walking matches Wu image, galloping matches Shao Hu, thus nourish ears also;"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "龍旂九斿，所以養信也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dragon banner nine streamers, thus nourish trustworthiness also;"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "寢兕持虎，鮫韅彌龍，所以養威也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Reclining rhinoceros grasping tiger, shark boots dragon-embroidered, thus nourish awe also."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "故大路之馬，必信至教順，然後乘之，所以養安也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore great carriage's horses, must trustworthy arrive trained obedient, then ride them, thus nourish security also."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "孰知夫［士］出死要節之所以養生也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who knows that shi exiting death demanding integrity reason for nourishing life."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "孰知夫輕費用之所以養財也，孰知夫恭敬辭讓之所以養安也，孰知夫禮義文理之所以養情也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who knows that light expenditure reason for nourishing wealth, who knows that respectful yielding reason for nourishing security, who knows that rites righteousness pattern principle reason for nourishing feelings."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The gentleman having obtained his nourishment, moreover delights in its distinctions. What are called distinctions: noble and base have ranks, elder and younger have differences, rich and poor, light and heavy all have their proper measure. Thus the emperor's great chariot and reed mat nourish the body; Carrying fragrant iris on the side nourishes the nose; Having inlaid yokes in front nourishes the eyes; The harmonious bell sounds, steps accord with Wu and Xiang, gallops accord with Shao and Hua—these nourish the ears; The dragon banner with nine streamers nourishes trust; Sleeping rhinoceros holding tiger, shark skin dragon scales—so nourish awe. Thus the great chariot's horses must be trustworthy, utmost trained obedient, then ride them—so nourish security. Who knows that scholars going to death for integrity is the means to nourish life. Who knows that light expenditure is the means to nourish wealth, who knows that respectful yielding is the means to nourish security, who knows that rites righteousness pattern principle is the means to nourish emotion.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "人茍生之為見，若者必死；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Person if birth's as seen, such ones must die;"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "茍利之為見，若者必害；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If profit's as seen, such ones must harm;"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "怠惰之為安，若者必危；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Indolent lazy as security, such ones must danger;"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "情勝之為安，若者必滅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emotions victory as security, such ones must extinction."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "故聖人一之於禮義，則兩得之矣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore sages unify at rites righteousness, then both obtain them;"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "一之於情性，則兩失之矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Unify at emotions nature, then both lose them."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "故儒者將使人兩得之者也，墨者將使人兩失之者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Confucian scholars will make people both obtain them, Mohist scholars will make people both lose them."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "是儒墨之分。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This is Confucian Mohist division."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "People if living as their view, those will certainly die; If profit as their view, those will certainly harm; If laziness as security, those will certainly danger; If emotion prevailing as security, those will certainly perish. Thus sages unify it in rites righteousness, then obtain both; Unify it in emotion nature, then lose both. Thus Confucianists will make people obtain both, Mohists will make people lose both. This is the division between Confucians and Mohists.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "治辨之極也，彊固之本也，威行之道也，功名之總也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Order distinction's extreme, strong solid foundation, awe implementation way, merit fame summary."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "王公由之，所以一天下，臣諸侯也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Kings dukes follow it, thus unify realm, make ministers of feudal lords;"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "弗由之，所以捐社稷也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Not follow it, thus abandon altars grain."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "故堅革利兵不足以為勝，高城深池不足以為固，嚴令繁刑不足以為威。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore tough armor sharp weapons insufficient for victory, high walls deep moats insufficient for security, strict orders numerous punishments insufficient for awe."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "由其道則行，不由其道則廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Follow its way then proceed, not follow its way then abandon."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "楚人鮫革犀兕，所以為甲，堅如金石；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Chu people shark hide rhinoceros buffalo, thus make armor, hard like metal stone;"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "宛之鉅鐵施，鉆如蜂蠆，輕利剽遫，卒如熛風。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Wan great iron spears, sharp like bee scorpion, light advantageous swift speedy, troops like blazing wind."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "然而兵殆於垂涉，唐昧死焉；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "However troops endangered at Chui She, Tang Mei died there;"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "莊蹻起，楚分而為四參。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhuang Qiao arose, Chu divided became four portions."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "是豈無堅革利兵哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This how without tough armor sharp weapons?"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Their way of controlling them not its way therefore."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "汝潁以為險，江漢以為池，阻之以鄧林，緣之以方城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ru Ying as danger, Jiang Han as moat, blocked by Deng forest, bordered by Fang city."
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "然而秦師至鄢郢，舉若振槁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "However Qin armies reached Yan Ying, took like shaking withered."
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "是豈無固塞險阻哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This how without solid barriers dangerous obstacles?"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Their way of controlling them not its way therefore."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "紂剖比干，囚箕子，為炮格，刑殺無辜，時臣下懔然，莫必其命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Zhou cut open Bi Gan, imprisoned Ji Zi, made pao ge, punished killed innocent, time ministers below fearful, none certain their fate."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "然而周師至，而令不行乎下，不能用其民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "However Zhou armies arrived, yet commands not proceed below, cannot use their people."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "是豈令不嚴，刑不陖哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "This how commands not strict, punishments not numerous?"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "其所以統之者非其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Their way of controlling them not its way therefore."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The extreme of governing distinctions, the root of strength and firmness, the way of awesome conduct, the summation of merit and fame. Kings and nobles follow it, thus unify the empire, make the nobles ministers; Do not follow it, thus abandon the altars of soil and grain. Thus strong armor sharp weapons insufficient for victory, high walls deep moats insufficient for security, strict commands numerous punishments insufficient for awe. Follow its way then proceed, do not follow its way then fail. Chu people shark skin rhinoceros leather, made into armor, hard as metal stone; Wan great iron weapons, sharp as wasp sting, light swift nimble, troops like blazing wind. Yet troops in danger at Chu She, Tang Mei died there; Zhuang Qiao arose, Chu divided into four parts. Is this not having strong armor sharp weapons? The way they controlled it was not correct, thus. Ru Ying as danger, Jiang Han as moat, blocked by Deng forest, edged by Fang city. Yet Qin troops reached Yan Ying, captured like shaking withered grass. Is this not having secure barriers and dangers? The way they controlled it was not correct, thus. Zhou dismembered Bi Gan, imprisoned Ji Zi, made roasting frames, punished and killed the innocent, ministers at the time trembled, none certain of their lives. Yet Zhou troops arrived, and commands did not run below, could not use their people. Is this not commands not strict, punishments not severe? The way they controlled it was not correct, thus.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "古者之兵，戈矛弓矢而已，然而敵國不待試而詘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Ancient ones' weapons, dagger-axes spears bows arrows only, however enemy states not wait test and submit."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "城郭不集，溝池不掘，固塞不樹，機變不張，然而國晏然不畏外而固者，無他故焉，明道而均分之，時使而誠愛之，則下應之如景響。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Walls cities not gathered, moats pools not dug, solid barriers not planted, stratagems changes not displayed, however state peaceful not fear external secure, no other reason, clarify way evenly distribute them, timely employ sincerely love them, then below respond like shadow echo."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "有不由命者，然後俟之以刑，則民知罪矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Have not follow commands, then wait with punishments, then people know crime."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "故刑一人而天下服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Therefore punish one person and realm submits."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "罪人不尤其上，知罪之在己也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Criminal people not blame superiors, know crime in themselves."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "是故刑罰省而威行如流，無他故焉，由其道故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Therefore punishments few awe flows like stream, no other reason, by its way therefore."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "故由其道則行，不由其道則廢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Therefore follow its way then proceed, not follow its way then abandon."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "古者帝堯之治天下也，蓋殺一人刑二人而天下治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Ancient Emperor Yao governed realm, probably killed one person punished two persons and realm governed."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "傳曰「威厲而不試，刑措而不用」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Tradition says \"Awe severe not tested, punishments set aside not used\"."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ancient times' weapons, halberds spears bows arrows only, yet enemy states without testing submitted. City walls not gathered, moats not dug, barriers not planted, mechanisms not spread, yet states peacefully not fearing outside and secure—nothing other reason, enlightened way and equal division, timely employment and sincere love, then below responds like echo to shadow. Have those not following commands, then await with punishment, then people know crime. Thus punish one person and empire submits. The criminal does not blame superiors, knows crime is in oneself. Thus punishments few and awe flows like water, nothing other reason, by its way thus. Thus follow its way then proceed, do not follow its way then fail. Ancient times when Emperor Yao governed the empire, executed one person punished two and empire governed. Tradition says 'awesome but not tested, punishments set aside and not used'.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0091",
          "zh": "天地者，生之本也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "reviewed": true,
              "literal": "Heaven earth, life root;"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "先祖者，類之本也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Forefathers, kind root;"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "君師者，治之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Lord teacher, governance root."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "無天地惡生？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Without heaven earth hate life?"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "無先祖惡出？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Without forefathers hate birth?"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "無君師惡治？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Without lord teacher hate governance?"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "三者偏亡，則無安人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Three things partially lost, then no secure people."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "故禮，上事天，下事地，尊先祖而隆君師，是禮之三本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore rites, above serve heaven, below serve earth, honor forefathers elevate lord teacher, this rites' three roots."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Heaven and earth are the root of life; Forefathers are the root of kind; Ruler and teacher are the root of governance. Without heaven and earth who dislikes life? Without forefathers who dislikes birth? Without ruler teacher who dislikes governance? If these three are partially lost, then no secure people. Thus rites serve heaven above, serve earth below, honor forefathers and flourish ruler teacher—this is rites' three roots.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "故王者天太祖，諸侯不敢懷，大夫士有常宗，所以辨貴賤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore kings regard heaven great ancestor, feudal lords not dare harbor, grandees scholars have constant ancestor, thus distinguish noble base."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "貴賤治，得之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Noble base ordered, obtain root."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus kings take heaven as great ancestor, nobles dare not harbor, grandees scholars have constant ancestral temple, so distinguish noble base. Noble and base are governed, this obtains their root.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "郊疇乎天子，社至乎諸侯，函及士大夫，所以辨尊者事尊，卑者事卑，宜鉅者鉅，宜小者小。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Suburban sacrifice to Son of Heaven, altar sacrifice to feudal lords, include down to grandees scholars, thus distinguish honored serve honored, lowly serve lowly, suitable great great, suitable small small."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The suburban fields reach to the Son of Heaven, the altars reach to the nobles, the enclosures extend to the scholars and grandees, so as to distinguish those who honor serve the honored, the lowly serve the lowly, those suitable for great have greatness, those suitable for small have smallness.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "故有天下者事七世，有一國者事五世，有五乘之地者事三世，有三乘之地者事二世，有特牲而食者不得立宗廟，所以辨積厚者流澤廣，積薄者流澤狹也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore possess realm serve seven generations, possess one state serve five generations, possess five chariot land serve three generations, possess three chariot land serve two generations, have special sacrifice eat not obtain establish ancestral temple, thus distinguish accumulation thick flow grace broad, accumulation thin flow grace narrow."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus those who possess the empire serve seven generations, those who possess one state serve five generations, those who possess five chariot lands serve three generations, those who possess three chariot lands serve two generations, those who have special victims and eat cannot establish ancestral temples, so as to distinguish those with thick accumulation have broad flowing favor, those with thin accumulation have narrow flowing favor.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "大饗上玄尊，俎上腥魚，先大羹，貴食飲之本也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great feast above mysterious honor, stand above raw fish, first great broth, noble food drink root."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great feast honors the supreme cup, the stands have raw fish, precede with great broth—honoring the root of food and drink.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "大饗上玄尊而用薄酒，食先黍稷而飯稻粱，祭嚌先大羹而飽庶羞，貴本而親用也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great feast above mysterious honor use thin wine, food first millet panicled millet rice polished rice, sacrifice taste first great broth satiate many delicacies, noble root intimate use."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "貴本之謂文，親用之謂理，兩者合而成文，以歸太一，是謂大隆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Noble root called pattern, intimate use called principle, two combine become pattern, to return great one, this called great flourishing."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great feast honors the supreme cup but uses thin wine, food precedes millet and grain but rice with rice and millet, sacrifice bites precede great broth but sate with many delicacies—honoring the root but being close to use. Honoring the root is called pattern, being close to use is called principle, the two combine to form pattern, to return to the great one, this is called great flourishing.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "故尊之上玄尊也，俎之上腥魚也，豆之先大羹，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore honor above mysterious honor, stand above raw fish, bowl first great broth, one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Thus the supreme cup above the cups, raw fish above the stands, great broth first in the dishes—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "利爵弗啐也，成事俎弗嘗也，三侑之弗食也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Beneficial wine not sip, completed affairs stand not taste, three toasts not eat."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Profitable cups are not sipped, completed matter stands are not tasted, the three toasts are not eaten.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "大昏之未廢齊也，大廟之未內尸也，始絕之未小斂，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great marriage not yet abolish fast, great temple not yet enter corpse, beginning mourning not yet small dressing, one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great marriage has not yet dismissed the fasting hut, the great temple has not yet entered the corpse, beginning mourning has not yet small dressing—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "大路之素幬也，郊之麻絻，喪服之先散麻，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great carriage plain canopy, suburban hemp cap, mourning garments first scattered hemp, one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The great chariot's plain canopy, the suburban hemp headbands, mourning garments first loose hemp—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0110",
          "zh": "三年哭之不反也，清廟之歌一倡而三嘆，縣一鐘尚拊膈，朱弦而通越，一也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Three years weeping not return, pure temple song one lead three sigh, hang one bell still pat frame, vermilion strings pass zither, one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Three years of weeping do not return, pure temple songs one begins and three sigh, hanging one bell still strikes the frame, vermilion strings and penetrating tones—it is one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0111",
          "zh": "凡禮始乎脫，成乎文，終乎稅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All rites begin with removal, complete with pattern, end with return."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "故至備，情文俱盡；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore utmost preparation, feelings patterns both exhausted;"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "其次，情文代勝；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Next, feelings patterns alternate victory;"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "其下，復情以歸太一。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Below that, return feelings to return great one."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "All rites begin with simplicity, are completed with pattern, end with relaxation. Thus in utmost completeness, emotion and pattern are both exhausted; Next, emotion and pattern alternately prevail; Below this, return to emotion to go to the great one.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "天地以合，日月以明，四時以序，星辰以行，江河以流，萬物以昌，好惡以節，喜怒以當。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Heaven earth thus unite, sun moon thus bright, four seasons thus ordered, stars constellations thus move, rivers thus flow, ten thousand things thus flourish, likes dislikes thus regulated, joy anger thus appropriate."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "以為下則順，以為上則明。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Use as below then compliant, use as above then clear."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Heaven and earth combine thereby, sun and moon are bright thereby, the four seasons are ordered thereby, stars and constellations move thereby, rivers and streams flow thereby, the myriad things flourish thereby, likes and dislikes are regulated thereby, joy and anger are appropriate thereby. Using it below then follows, using it above then is enlightened.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0117",
          "zh": "太史公曰：至矣哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Grand Historian says: Utmost!"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "立隆以為極，而天下莫之能益損也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Establish flourishing as extreme, and realm none able increase decrease it."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "本末相順，終始相應，至文有以辨，至察有以說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Root tip mutually compliant, end beginning mutually respond, utmost pattern has to distinguish, utmost discernment has to explain."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "天下從之者治，不從者亂；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Realm follow it ordered, not follow chaotic;"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "從之者安，不從者危。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Follow it secure, not follow dangerous."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "小人不能則也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Small people cannot follow it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian said: How supreme! Established flourishing as the extreme, and the empire cannot add to or diminish it. Root and branch are mutually compliant, beginning and end correspond, utmost pattern has distinctions, utmost examination has explanations. The empire follows it and is ordered, does not follow it and is chaotic; Follows it and is peaceful, does not follow it and is endangered. Small men cannot emulate it.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "禮之貌誠深矣，堅白同異之察，入焉而弱。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rites appearance truly deep, hard white same different discernment, enter therein weak."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "其貌誠大矣，擅作典制褊陋之說，入焉而望。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Its appearance truly great, monopolize make standards narrow petty theories, enter therein gaze."
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "其貌誠高矣，暴慢恣睢，輕俗以為高之屬，入焉而隊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Its appearance truly high, violent arrogant unrestrained, despise customs as high category, enter therein fall."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "故繩誠陳，則不可欺以曲直；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore cord truly displayed, then cannot cheat with crooked straight;"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "衡誠縣，則不可欺以輕重；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Balance truly hung, then cannot cheat with light heavy;"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "規矩誠錯，則不可欺以方員；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Compass square truly set, then cannot cheat with square round;"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "君子審禮，則不可欺以詐偽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Superior man examines rites, then cannot cheat with deceit falsehood."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "故繩者，直之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore cord is straight utmost;"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "衡者，平之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Balance is level utmost;"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "規矩者，方員之至也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Compass square is square round utmost;"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "禮者，人道之極也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Rites are human way extreme."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "然而不法禮者不足禮，謂之無方之民；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "However not model rites insufficient rites, called directionless people;"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "法禮足禮，謂之有方之士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Model rites sufficient rites, called directed scholars."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "禮之中，能思索，謂之能慮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ritual midst, able ponder, called able consider;"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "能慮勿易，謂之能固。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Able consider not change, called able firm."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "能慮能固，加好之焉，聖矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Able consider able firm, add like it there, sage."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "天者，高之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Heaven is high extreme;"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "地者，下之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Earth is low extreme;"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "日月者，明之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Sun moon are brightness extreme;"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "無窮者，廣大之極也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Infinite is vast great extreme;"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "聖人者，道之極也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Sages are way extreme."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The appearance of rites is truly profound, the examination of hard white same different enters it and weakens. Its appearance is truly great, the sayings of monopolizing creation of systems and narrow pettiness enter it and are daunted. Its appearance is truly lofty, the violent rude unrestrained types who lightly regard customs as lofty enter it and collapse. Thus when the cord is truly set out, it cannot be deceived with straight and crooked; When the balance is truly hung, it cannot be deceived with light and heavy; When compass and square are truly applied, it cannot be deceived with square and round; The gentleman examines rites, cannot be deceived with fraud and falsehood. Thus the cord is the utmost of straightness; The balance is the utmost of levelness; Compass and square are the utmost of squareness and roundness; Rites are the extreme of the human way. Yet those who do not follow rites are insufficient in rites, called people without direction; Those who follow rites and suffice in rites are called scholars with direction. Among rites, those who can contemplate are called able to consider; Able to consider and not change are called able to be firm. Able to consider and able to be firm, moreover delight in it—sages. Heaven is the extreme of height; Earth is the extreme of lowness; Sun and moon are the extreme of brightness; The infinite is the extreme of vastness; Sages are the extreme of the way.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0144",
          "zh": "以財物為用，以貴賤為文，以多少為異，以隆殺為要。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Use wealth things as use, use noble base as pattern, use many few as different, use flourishing decline as essential."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "文貌繁，情欲省，禮之隆也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Pattern appearance abundant, feelings desires frugal, rites flourishing;"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "文貌省，情欲繁，禮之殺也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Pattern appearance frugal, feelings desires abundant, rites decline;"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "文貌情欲相為內外表裏，并行而雜，禮之中流也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Pattern appearance feelings desires mutually as inner outer surface lining, proceed together mixed, rites middle flow."
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "君子上致其隆，下盡其殺，而中處其中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gentleman above reach its flourishing, below exhaust its decline, middle dwell in middle."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "步驟馳騁廣騖不外，是以君子之性守宮庭也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Steps paces gallop race broad unrestrained not outside, therefore gentleman nature guards palace court."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "人域是域，士君子也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Human domain this domain, scholar gentleman."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "外是，民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Outside this, common people."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "於是中焉，房皇周浹，曲［直］得其次序，聖人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thus middle there, chamber grand complete cycle, curved straight obtain their sequence, sage person."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "故厚者，禮之積也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore thick is rites accumulation;"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "大者，禮之廣也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Great is rites breadth;"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "高者，禮之隆也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "High is rites flourishing;"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "明者，禮之盡也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bright is rites exhaustion."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Using wealth and goods for use, using noble and base as pattern, using many and few as distinction, using flourishing and diminishing as essentials. Pattern appearance elaborate, emotion desires few—this is rites' flourishing; Pattern appearance few, emotion desires elaborate—this is rites' diminishing; Pattern appearance and emotion desires mutually inside outside, surface lining, proceed together and mixed—this is rites' middle flow. The gentleman above reaches its flourishing, below exhausts its diminishing, and in the middle dwells in its middle. Steps and gallops, rushing extensively do not go outside, thus the gentleman's nature guards the palace courtyard. This domain is domain, scholar gentlemen. Outside this, the common people. Thus in the middle, vast and encompassing, straight obtains its sequence—sages. Thus thickness is rites' accumulation; Greatness is rites' breadth; Loftiness is rites' flourishing; Brightness is rites' exhaustion.",
          "idiomatic": null
        }
      ]
    }
  ]
}