{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "024",
    "url": "https://chinesenotes.com/shiji/shiji024.html",
    "title": {
      "zh": "《樂書》 Music",
      "en": null,
      "raw": "《樂書》 Music"
    },
    "sentenceCount": 490,
    "translatedCount": 490,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:50.440Z",
    "translators": [
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 67,
        "sentences": 490
      }
    ],
    "citation": "Translation: Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "太史公曰：余每讀虞書，至於君臣相敕，維是几安，而股肱不良，萬事墮壞，未嘗不流涕也。",
          "translations": [
            {
              "lang": "en",
              "text": "The Grand Historian said: Whenever I read the Book of Yu, I cannot help but weep when I reach the passage where ruler and minister admonish each other to maintain stability, yet if the limbs are unfit, all affairs decline and collapse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "成王作頌，推己懲艾，悲彼家難，可不謂戰戰恐懼，善守善終哉？",
          "translations": [
            {
              "lang": "en",
              "text": "King Cheng composed the Odes, examining himself to correct his faults, grieving the misfortunes of his family—can this not be called trembling with fear, skilled at guarding and completing well?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "君子不為約則修德，滿則棄禮，佚能思初，安能惟始，沐浴膏澤而歌詠勤苦，非大德誰能如斯！",
          "translations": [
            {
              "lang": "en",
              "text": "The gentleman cultivates virtue in poverty, abandons ritual when full; in leisure he thinks of beginnings, in peace he remembers origins; bathing in rich favors yet singing of hardships—who but one of great virtue could be like this!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "傳曰「治定功成，禮樂乃興」。",
          "translations": [
            {
              "lang": "en",
              "text": "The tradition says: 'When order is established and merit achieved, rites and music then flourish.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "海內人道益深，其德益至，所樂者益異。",
          "translations": [
            {
              "lang": "en",
              "text": "Within the empire, human relationships grow deeper, virtue grows more perfect, and what people delight in grows more refined.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "滿而不損則溢，盈而不持則傾。",
          "translations": [
            {
              "lang": "en",
              "text": "When full without diminishing, it overflows; when replete without holding, it topples.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "凡作樂者，所以節樂。",
          "translations": [
            {
              "lang": "en",
              "text": "All who make music do so in order to regulate pleasure.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "君子以謙退為禮，以損減為樂，樂其如此也。",
          "translations": [
            {
              "lang": "en",
              "text": "The gentleman takes humility and withdrawal as ritual, takes moderation as music, and delights in it being thus.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "以為州異國殊，情習不同，故博采風俗，協比聲律，以補短移化，助流政教。",
          "translations": [
            {
              "lang": "en",
              "text": "Considering that provinces differ and states are distinct, that feelings and customs are not the same, thus broadly gathering local customs, coordinating and comparing tones and melodies, to supplement deficiencies and shift transformations, assist in flowing governance and education.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "天子躬於明堂臨觀，而萬民咸蕩滌邪穢，斟酌飽滿，以飾厥性。",
          "translations": [
            {
              "lang": "en",
              "text": "The Son of Heaven personally at the Bright Hall oversees and observes, while all the people wash away evil impurities, measuring what is appropriate and full, to adorn their nature.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "故云雅頌之音理而民正，嘄噭之聲興而士奮，鄭衛之曲動而心淫。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus it is said that ya and song sounds when well-ordered then people are correct, clear and loud sounds when arise then scholars are aroused, Zheng and Wei tunes when move then hearts become licentious.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "及其調和諧合，鳥獸盡感，而況懷五常，含好惡，自然之勢也？",
          "translations": [
            {
              "lang": "en",
              "text": "When it reaches harmonious blending, birds and beasts are all affected, and moreover those embracing the five constants, containing likes and dislikes—is this not the natural tendency?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Grand Historian said: Whenever I read the Yu Shu, coming to where ruler and minister mutually admonish, only thus securing stability, yet if the limbs are not good, all affairs decline and collapse, I never fail to shed tears. King Cheng made the Odes, reflecting on himself to punish and correct, grieving the family difficulties—can this not be called trembling in fear, good at guarding and good at completing? The gentleman when in poverty then cultivates virtue, when full then abandons ritual, in leisure able to think of beginnings, in peace able to remember origins, bathing in rich favor yet singing of hardships, who but great virtue could be like this! The tradition says 'When governance is settled and merit complete, rites and music then flourish'. Within the seas human ways grow deeper, their virtue grows more perfect, what they delight in grows more refined. Full without diminishing then overflows, replete without holding then topples. All who make music do so in order to regulate joy. The gentleman takes humility and withdrawal as ritual, takes diminishing as music, delights in it being thus. Considering that provinces differ and states are distinct, feelings and customs are not the same, thus broadly gathering customs, coordinating and comparing tones and melodies, to supplement deficiencies and shift transformations, assist in flowing governance and teaching. The Son of Heaven personally at the Bright Hall oversees and observes, while the myriad people all wash away evil impurities, measuring fullness, to adorn their nature. Thus it is said that ya and song sounds when well-ordered then people are correct, clear and loud sounds when arise then scholars are aroused, Zheng and Wei tunes when move then hearts become licentious. When it reaches harmonious blending, birds and beasts are all affected, and moreover those embracing the five constants, containing likes and dislikes, is the natural tendency?",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "治道虧缺而鄭音興起，封君世辟，名顯鄰州，爭以相高。",
          "translations": [
            {
              "lang": "en",
              "text": "When the way of governance is deficient, Zheng sounds arise; feudal lords with hereditary officials, names illustrious in neighboring provinces, contend to outdo each other.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "自仲尼不能與齊優遂容於魯，雖退正樂以誘世，作五章以剌時，猶莫之化。",
          "translations": [
            {
              "lang": "en",
              "text": "Since Confucius could not tolerate the Qi actor Su in Lu, though he withdrew to correct music to guide the age, made five chapters to criticize the times, still none were transformed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "陵遲以至六國，流沔沈佚，遂往不返，卒於喪身滅宗，并國於秦。",
          "translations": [
            {
              "lang": "en",
              "text": "Declining until the six states, flowing and sinking into dissipation, going without return, finally losing life and destroying clan, states annexed by Qin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The way of governance deficient and Zheng sounds arise, feudal lords hereditary officials, names illustrious in neighboring provinces, contend to outdo each other. Since Confucius could not tolerate the Qi actor Su in Lu, though he withdrew to correct music to guide the age, made five chapters to criticize the times, still none were transformed. Declining until the six states, flowing and sinking into dissipation, going without return, finally losing life and destroying clan, states annexed by Qin.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0016",
          "zh": "秦二世尤以為娛。",
          "translations": [
            {
              "lang": "en",
              "text": "Qin Ershi especially took it as entertainment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "丞相李斯進諫曰：「放棄詩書，極意聲色，祖伊所以懼也；",
          "translations": [
            {
              "lang": "en",
              "text": "Chancellor Li Si advanced remonstrance saying: 'Abandoning poetry and books, exhausting intent on sounds and colors—this is what Zu Yi feared;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "輕積細過，恣心長夜，紂所以亡也。」",
          "translations": [
            {
              "lang": "en",
              "text": "lightly accumulating small errors, indulging heart in long nights—this is why Zhou perished.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "趙高曰：「五帝、三王樂各殊名，示不相襲。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhao Gao said: 'The five emperors and three kings' music each had different names, showing they did not copy each other.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "上自朝廷，下至人民，得以接歡喜，合殷勤，非此和說不通，解澤不流，亦各一世之化，度時之樂，何必華山之騄耳而後行遠乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Above from the court, below to the people, able to connect happiness and joy, unite diligence and care; without this harmonious delight does not penetrate, grace and favor does not flow; each is one age's transformation, timely music—why must it be Huashan swift horses before going far?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "二世然之。",
          "translations": [
            {
              "lang": "en",
              "text": "Ershi approved this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Qin Ershi especially took it as entertainment. Chancellor Li Si advanced remonstrance saying: 'Abandoning poetry and books, exhausting intent on sounds and colors, this is what Zu Yi feared; Lightly accumulating small errors, indulging heart in long nights, this is why Zhou perished.' Zhao Gao said: 'The five emperors and three kings' music each had different names, showing they did not copy each other. Above from the court, below to the people, able to connect happiness and joy, unite diligence and care, without this harmonious delight does not penetrate, grace and favor does not flow, each is one age's transformation, timely music, why must it be Huashan swift horses before going far?' Ershi approved this.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "高祖過沛詩三侯之章，令小兒歌之。",
          "translations": [
            {
              "lang": "en",
              "text": "Gaozu passed through Pei, sang the 'Three Marquis of Pei' poem, ordered children to sing it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "高祖崩，令沛得以四時歌儛宗廟。",
          "translations": [
            {
              "lang": "en",
              "text": "Gaozu passed away, ordered Pei to be able to sing and dance at the ancestral temple in the four seasons.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "孝惠、孝文、孝景無所增更，於樂府習常肄舊而已。",
          "translations": [
            {
              "lang": "en",
              "text": "Filial Hui, Filial Wen, Filial Jing made no additions or changes; at the Music Bureau they only practiced the constant and rehearsed the old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gaozu passed through Pei, sang the 'Three Marquis of Pei' poem, ordered children to sing it. Gaozu passed away, ordered Pei to be able to sing and dance at the ancestral temple in the four seasons. Filial Hui, Filial Wen, Filial Jing made no additions or changes, at the Music Bureau only practiced the constant and rehearsed the old.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0025",
          "zh": "至今上即位，作十九章，令侍中李延年次序其聲，拜為協律都尉。",
          "translations": [
            {
              "lang": "en",
              "text": "Until the present emperor ascended, made nineteen chapters, ordered Attendant in Emperor's Presence Li Yannian to arrange their sounds, appointed as Harmonizing Pitch Chief Commandant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "通一經之士不能獨知其辭，皆集會五經家，相與共講習讀之，乃能通知其意，多爾雅之文。",
          "translations": [
            {
              "lang": "en",
              "text": "Those who master one classic cannot alone know their words; all gather the five classics scholars, mutually discuss and study read them, then can fully understand their meaning—much elegant and correct literature.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Until the present emperor ascended, made nineteen chapters, ordered Attendant in Emperor's Presence Li Yannian to arrange their sounds, appointed as Harmonizing Pitch Chief Commandant. Those who master one classic cannot alone know their words, all gather the five classics scholars, mutually discuss and study read them, then can fully understand their meaning, much elegant and correct literature.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "漢家常以正月上辛祠太一甘泉，以昏時夜祠，到明而終。",
          "translations": [
            {
              "lang": "en",
              "text": "The Han house constantly in the first month upper xin sacrifices Taiyi at Ganquan, sacrifices at night dusk time, until dawn ends.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "常有流星經於祠壇上。",
          "translations": [
            {
              "lang": "en",
              "text": "Constantly has shooting stars passing over the sacrifice altar.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "使僮男僮女七十人俱歌。",
          "translations": [
            {
              "lang": "en",
              "text": "Makes young boys and girls seventy people all sing together.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "春歌青陽，夏歌朱明，秋歌西暤，冬歌玄冥。",
          "translations": [
            {
              "lang": "en",
              "text": "Spring sings Qingyang, summer sings Zhuming, autumn sings Xihao, winter sings Xuanming.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "世多有，故不論。",
          "translations": [
            {
              "lang": "en",
              "text": "The world has many such, thus not discussed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Han house constantly in the first month upper xin sacrifices Taiyi at Ganquan, sacrifices at night dusk time, until dawn ends. Constantly has shooting stars passing over the sacrifice altar. Makes young boys and girls seventy people all sing together. Spring sings Qingyang, summer sings Zhuming, autumn sings Xihao, winter sings Xuanming. The world has many such, thus not discussed.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "又嘗得神馬渥洼水中，復次以為太一之歌。",
          "translations": [
            {
              "lang": "en",
              "text": "Also once obtained divine horse in Wo Wo waters, moreover composed as Taiyi song.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "歌曲曰：「太一貢兮天馬下，霑赤汗兮沫流赭。",
          "translations": [
            {
              "lang": "en",
              "text": "The song lyrics say: 'Taiyi contributes, heavenly horse descends; stained red sweat, froth flows crimson.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "騁容與兮跇萬里，今安匹兮龍為友。」",
          "translations": [
            {
              "lang": "en",
              "text": "Gallop leisurely, stride ten thousand li; now peacefully matched, dragon as friend.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "後伐大宛得千里馬，馬名蒲梢，次作以為歌。",
          "translations": [
            {
              "lang": "en",
              "text": "Later conquered Dawan obtained thousand li horse, horse named Pu Shao, moreover composed as song.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "歌詩曰：「天馬來兮從西極，經萬里兮歸有德。",
          "translations": [
            {
              "lang": "en",
              "text": "Song poem says: 'Heavenly horse comes from western extreme; traverses ten thousand li, returns to virtuous.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "承靈威兮降外國，涉流沙兮四夷服。」",
          "translations": [
            {
              "lang": "en",
              "text": "Receives spiritual might, descends foreign states; crosses flowing sands, four barbarians submit.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "中尉汲黯進曰：「凡王者作樂，上以承祖宗，下以化兆民。",
          "translations": [
            {
              "lang": "en",
              "text": "Commandant Ji An advanced saying: 'All who make music: above to receive ancestors, below to transform the myriad people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "今陛下得馬，詩以為歌，協於宗廟，先帝百姓豈能知其音邪？」",
          "translations": [
            {
              "lang": "en",
              "text": "Now Your Majesty obtains horse, makes poem into song, harmonious at ancestral temple—former emperors and common people, how can they know its sound?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "上默然不說。",
          "translations": [
            {
              "lang": "en",
              "text": "The emperor was silently displeased.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "丞相公孫弘曰：「黯誹謗聖制，當族。」",
          "translations": [
            {
              "lang": "en",
              "text": "Chancellor Gongsun Hong said: 'An slanders and defames the sage's system, should be exterminated.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Also once obtained divine horse in Wo Wo waters, moreover composed as Taiyi song. The song lyrics say: 'Taiyi contributes, heavenly horse descends, stained red sweat, froth flows crimson. Gallop leisurely, stride ten thousand li, now peacefully matched, dragon as friend.' Later conquered Dawan obtained thousand li horse, horse named Pu Shao, moreover composed as song. Song poem says: 'Heavenly horse comes from western extreme, traverses ten thousand li returns to virtuous. Receives spiritual might descends foreign states, crosses flowing sands four barbarians submit.' Commandant Ji An advanced saying: 'All who make music, above to receive ancestors, below to transform the myriad people. Now Your Majesty obtains horse, makes poem into song, harmonious at ancestral temple, former emperors and common people how can they know its sound?' The emperor was silently displeased. Chancellor Gongsun Hong said: 'An slanders and defames the sage's system, should be exterminated.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "凡音之起，由人心生也。",
          "translations": [
            {
              "lang": "en",
              "text": "All sounds arise from human heart born.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "人心之動，物使之然也。",
          "translations": [
            {
              "lang": "en",
              "text": "Human heart's movement, things cause it thus.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "感於物而動，故形於聲；",
          "translations": [
            {
              "lang": "en",
              "text": "Affected by things and move, thus take form in sound;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "聲相應，故生變；",
          "translations": [
            {
              "lang": "en",
              "text": "sounds respond each other, thus produce change;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "變成方，謂之音；",
          "translations": [
            {
              "lang": "en",
              "text": "change becomes pattern, called tone;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "比音而樂之，及干戚羽旄，謂之樂也。",
          "translations": [
            {
              "lang": "en",
              "text": "compare tones and delight in them, with shields axes feathers banners, called music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "樂者，音之所由生也，其本在人心感於物也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is what sound is born from; its root is human heart affected by things.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "是故其哀心感者，其聲噍以殺；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus those whose grieving heart is affected, their sound urgent and subdued;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "其樂心感者，其聲啴以緩；",
          "translations": [
            {
              "lang": "en",
              "text": "Those whose joyful heart is affected, their sound broad and slow;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "其喜心感者，其聲發以散；",
          "translations": [
            {
              "lang": "en",
              "text": "Those whose joyful hearts are moved produce sounds that issue forth and disperse;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "其怒心感者，其聲麤以厲；",
          "translations": [
            {
              "lang": "en",
              "text": "Those whose angry hearts are moved produce sounds that are coarse and fierce;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "其敬心感者，其聲直以廉；",
          "translations": [
            {
              "lang": "en",
              "text": "Those whose respectful hearts are moved produce sounds that are straight and upright;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "其愛心感者，其聲和以柔。",
          "translations": [
            {
              "lang": "en",
              "text": "Those whose loving hearts are moved produce sounds that are harmonious and soft.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "六者非性也，感於物而後動，是故先王慎所以感之。",
          "translations": [
            {
              "lang": "en",
              "text": "These six are not innate human nature; they arise from external stimuli. Therefore, the former kings were careful about what could affect people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "故禮以導其志，樂以和其聲，政以壹其行，刑以防其姦。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus ritual guides the will, music harmonizes the voice, governance unites conduct, and punishments guard against evil.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "禮樂刑政，其極一也，所以同民心而出治道也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual, music, punishments, and governance all share one ultimate principle: to unite people's hearts and establish the way of governance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "All sounds arise from human heart born. Human heart's movement, things cause it thus. Affected by things and move, thus take form in sound; Sounds respond each other, thus produce change; Change becomes pattern, called tone; Compare tones and delight in them, with shields axes feathers banners, called music. Music is what sound is born from, its root is human heart affected by things. Thus those whose grieving heart is affected, their sound urgent and subdued; Those whose joyful heart is affected, their sound broad and slow; Those whose joyful heart is affected, their sound issuing and dispersing; Those whose angry heart is affected, their sound coarse and fierce; Those whose respectful heart is affected, their sound straight and upright; Those whose loving heart is affected, their sound harmonious and soft. These six are not nature, affected by things then move, thus former kings careful about what affects them. Thus ritual guides their will, music harmonizes their sound, governance unites their conduct, punishments guard their evil. Ritual music punishments governance, their ultimate is one, what unites people's hearts and brings forth governance way.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0059",
          "zh": "凡音者，生人心者也。",
          "translations": [
            {
              "lang": "en",
              "text": "All sounds originate from the human heart.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "情動於中，故形於聲，聲成文謂之音。",
          "translations": [
            {
              "lang": "en",
              "text": "Emotions move within us, taking form as sound; sounds form patterns, which are called tones.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "是故治世之音安以樂，其正和；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus in well-governed ages, sounds are peaceful and joyful, their harmony correct. In chaotic ages, sounds are resentful and angry, their harmony perverse. In fallen states, sounds are mournful and anxious, their people distressed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "亂世之音怨以怒，其正乖；",
          "translations": [
            {
              "lang": "en",
              "text": "The way of sound connects with what is correct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "亡國之音哀以思，其民困。",
          "translations": [
            {
              "lang": "en",
              "text": "Gong represents the ruler, shang represents ministers, jue represents the people, zhi represents affairs, yu represents things.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "聲音之道，與正通矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When these five are not in disorder, there are no melancholic sounds.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "宮為君，商為臣，角為民，徵為事，羽為物。",
          "translations": [
            {
              "lang": "en",
              "text": "When gong is disordered, it becomes wild—its ruler arrogant. When shang is disordered, it becomes harsh—its ministers ruined. When jue is disordered, it becomes worried—its people resentful. When zhi is disordered, it becomes mournful—its affairs laborious. When yu is disordered, it becomes dangerous—its wealth depleted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "五者不亂，則無惉懘之音矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When all five are disordered and mutually encroaching, it is called laxity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "宮亂則荒，其君驕；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the state's extinction comes without warning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "商亂則搥，其臣壞；",
          "translations": [
            {
              "lang": "en",
              "text": "Zheng and Wei sounds are the sounds of chaotic ages, comparable to laxity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "角亂則憂，其民怨；",
          "translations": [
            {
              "lang": "en",
              "text": "Sounds from the Mulberry Interval and above Pu are the sounds of fallen states: their governance scattered, their people flowing away, deceiving superiors while practicing private schemes that cannot be stopped.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "徵亂則哀，其事勤；",
          "translations": [
            {
              "lang": "en",
              "text": "When zhi is disordered, it becomes mournful—its affairs laborious;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "羽亂則危，其財匱。",
          "translations": [
            {
              "lang": "en",
              "text": "When yu is disordered, it becomes dangerous—its wealth depleted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "五者皆亂，迭相陵，謂之慢。",
          "translations": [
            {
              "lang": "en",
              "text": "When all five are disordered, mutually encroaching, it is called laxity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "如此則國之滅亡無日矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the state's extinction comes without warning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "鄭衛之音，亂世之音也，比於慢矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Zheng and Wei sounds are the sounds of chaotic ages, comparable to laxity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "桑閒濮上之音，亡國之音也，其政散，其民流，誣上行私而不可止。",
          "translations": [
            {
              "lang": "en",
              "text": "Sounds from the Mulberry Interval and above Pu are the sounds of fallen states: their governance scattered, their people flowing away, deceiving superiors while practicing private schemes that cannot be stopped.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "All sounds are what are born from human heart. Emotion moves within, thus takes form in sound, sound forms pattern called tone. Thus well-governed age's sound peaceful with joy, its correctness harmonious; Chaotic age's sound resentful with anger, its correctness contrary; Perished state's sound mournful with thought, its people distressed. Sound's way connects with correctness. Gong for ruler, shang for minister, jue for people, zhi for affairs, yu for things. Five not chaotic, then no melancholic sound. Gong chaotic then wild, its ruler arrogant; Shang chaotic then harsh, its ministers ruined; Jue chaotic then worried, its people resentful; Zhi chaotic then mournful, its affairs laborious; Yu chaotic then dangerous, its wealth depleted. Five all chaotic, mutually encroaching, called lax. Thus then state's extinction without day. Zheng Wei sounds are chaotic age's sounds, compare to lax. Mulberry interval Pu above sounds are perished state's sounds, their governance scattered, their people flowing, deceiving superiors practicing private cannot stop.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "凡音者，生於人心者也；",
          "translations": [
            {
              "lang": "en",
              "text": "All sounds originate from the human heart;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "樂者，通於倫理者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music connects with the categories and principles of human relationships.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "是故知聲而不知音者，禽獸是也；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus those who know sound but not tone are like birds and beasts;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "知音而不知樂者，眾庶是也。",
          "translations": [
            {
              "lang": "en",
              "text": "Those who know tone but not music are like the common people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "唯君子為能知樂。",
          "translations": [
            {
              "lang": "en",
              "text": "Only the gentleman can truly know music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "是故審聲以知音，審音以知樂，審樂以知政，而治道備矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus one examines sound to understand tone, examines tone to understand music, examines music to understand governance—then the way of governance is complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "是故不知聲者不可與言音，不知音者不可與言樂知樂則幾於禮矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus those who do not know sound cannot discuss tone with them, those who do not know tone cannot discuss music with them. Those who know music approach an understanding of ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "禮樂皆得，謂之有德。",
          "translations": [
            {
              "lang": "en",
              "text": "When both ritual and music are obtained, this is called having virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "德者得也。",
          "translations": [
            {
              "lang": "en",
              "text": "Virtue means obtaining what is right.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "是故樂之隆，非極音也；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music's flourishing does not mean extreme sounds;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "食饗之禮，非極味也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual feasting does not mean extreme flavors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "清廟之瑟，朱弦而疏越，一倡而三嘆，有遺音者矣。",
          "translations": [
            {
              "lang": "en",
              "text": "The zither in the Pure Temple has cinnabar-red strings and sparse bridges. One begins the chant, three respond with sighs—here are lingering sounds.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "大饗之禮，尚玄酒而俎腥魚，大羹不和，有遺味者矣。",
          "translations": [
            {
              "lang": "en",
              "text": "The great feast ritual honors dark wine, stands hold raw fish, and great broth is not mixed—here are lingering flavors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "是故先王之制禮樂也，非以極口腹耳目之欲也，將以教民平好惡而反人道之正也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings, in formulating ritual and music, did not seek to exhaust the desires of mouths, bellies, ears, eyes, and bodies. Rather, they sought to teach people to balance their likes and dislikes, and return to the correct way of humanity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "All sounds born from human heart; Music connects to categories principles. Thus knowing sound but not knowing tone are birds beasts; Knowing tone but not knowing music are common people. Only gentleman can know music. Thus examine sound to know tone, examine tone to know music, examine music to know governance, then governance way complete. Thus not knowing sound cannot speak tone with, not knowing tone cannot speak music with knowing music then approaches ritual. Ritual music both obtained, called having virtue. Virtue is obtaining. Thus music's flourishing not extreme sound; Feasting ritual not extreme flavor. Pure temple's zither, cinnabar strings sparse bridges, one chant three sighs, has remaining sound. Great feast ritual, honors dark wine stands raw fish, great broth not mixed, has remaining flavor. Thus former kings' formulating ritual music, not to exhaust mouth belly ears eyes desires, will teach people balance likes dislikes return human way's correctness.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "人生而靜，天之性也；",
          "translations": [
            {
              "lang": "en",
              "text": "Human beings are born quiet—this is Heaven's nature;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "感於物而動，性之頌也。",
          "translations": [
            {
              "lang": "en",
              "text": "Being affected by external things and moving—this is human endowment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "物至知知，然後好惡形焉。",
          "translations": [
            {
              "lang": "en",
              "text": "When things arrive, knowledge knows them, and only then do likes and dislikes take form.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "好惡無節於內，知誘於外，不能反己，天理滅矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When likes and dislikes have no measure within, and knowledge is lured by externals, one cannot return to the self—Heaven's principle is extinguished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "夫物之感人無窮，而人之好惡無節，則是物至而人化物也。",
          "translations": [
            {
              "lang": "en",
              "text": "When external things affect people without limit, and people's likes and dislikes have no measure, then things arrive and people transform to follow things.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "人化物也者，滅天理而窮人欲者也。",
          "translations": [
            {
              "lang": "en",
              "text": "When people transform to follow things, Heaven's principle is extinguished and human desires exhaust themselves.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "於是有悖逆詐偽之心，有淫佚作亂之事。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus arise perverse rebellious hearts, fraudulent false thoughts, licentious dissipated actions, and rebellious disorders.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "是故彊者脅弱，眾者暴寡，知者詐愚，勇者苦怯，疾病不養，老幼孤寡不得其所，此大亂之道也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the strong coerce the weak, the many bully the few, the knowledgeable deceive the ignorant, the brave oppress the cowardly; the sick are not nurtured, the old, young, orphans, and widows do not get their proper place—this is the way of great chaos.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "是故先王制禮樂，人為之節：衰麻哭泣，所以節喪紀也；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings formulated ritual and music to provide measures for people: hemp mourning garments and weeping—these measure mourning rituals;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "鐘鼓干戚，所以和安樂也；",
          "translations": [
            {
              "lang": "en",
              "text": "Bells, drums, shields, and axes—these harmonize peaceful joys;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "婚姻冠笄，所以別男女也；",
          "translations": [
            {
              "lang": "en",
              "text": "Marriage ceremonies and capping ceremonies—these distinguish male and female;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "射鄉食饗，所以正交接也。",
          "translations": [
            {
              "lang": "en",
              "text": "Archery rituals and feasting ceremonies—these correct social intercourse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "禮節民心，樂和民聲，政以行之，刑以防之。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual regulates people's hearts, music harmonizes people's voices, governance implements them, punishments guard against them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "禮樂刑政四達而不悖，則王道備矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual, music, punishments, and governance—the four reach without contradiction, then the way of the king is complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Human born quiet, heaven's nature; Affected by things move, nature's endowment. Things arrive knowledge knows, then likes dislikes take form. Likes dislikes without measure within, knowledge lured without, cannot return self, heaven principle extinguished. Things affecting people without limit, people's likes dislikes without measure, then things arrive people transform to things. People transform to things, extinguish heaven principle exhaust human desires. Thus have perverse rebellious fraudulent false hearts, have licentious dissipated rebellious matters. Thus strong coerce weak, many bully few, knowledgeable deceive ignorant, brave oppress cowardly, sick not nurtured, old young orphans widows not get their place, this great chaos way. Thus former kings formulated ritual music, people make measure: mourning hemp weeping, what measures mourning records; Bells drums shields axes, what harmonize peaceful joy; Marriage and capping ceremonies, these to distinguish male and female; Archery at village, eating feasts, these to correct intercourse. Ritual regulates people's hearts, music harmonizes people's sounds, governance implements it, punishments guard it. Ritual music punishments governance four reach without contradiction, then the kingly way is complete.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0104",
          "zh": "樂者為同，禮者為異。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is for uniting what is the same, ritual is for distinguishing what is different.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "同則相親，異則相敬。",
          "translations": [
            {
              "lang": "en",
              "text": "What is the same then mutually draws close, what is different then mutually respects.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "樂勝則流，禮勝則離。",
          "translations": [
            {
              "lang": "en",
              "text": "When music prevails it becomes licentious, when ritual prevails it becomes distant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "合情飾貌者，禮樂之事也。",
          "translations": [
            {
              "lang": "en",
              "text": "Combining emotion and adorning appearance—these are the matters of ritual and music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "禮義立，則貴賤等矣；",
          "translations": [
            {
              "lang": "en",
              "text": "When ritual righteousness is established, noble and base have their ranks;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "樂文同，則上下和矣；",
          "translations": [
            {
              "lang": "en",
              "text": "When music culture is the same, high and low are harmonious;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "好惡著，則賢不肖別矣；",
          "translations": [
            {
              "lang": "en",
              "text": "When likes and dislikes are manifest, worthy and unworthy are distinguished;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "刑禁暴，爵舉賢，則政均矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When punishments prohibit violence and titles promote the worthy, governance is equal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "仁以愛之，義以正之，如此則民治行矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Benevolence loves them, righteousness corrects them—thus the people proceed in orderly fashion.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is for sameness, ritual is for difference. Same then mutually close, different then mutually respectful. Music prevails then flows, ritual prevails then separates. Combining emotion adorning appearance—these are ritual and music's matters. Ritual righteousness established, then noble base have ranks; Music culture same, then high low harmonious; Likes dislikes manifest, then worthy unworthy distinguished; Punishments prohibit violence, titles promote worthy, then governance equal. Benevolence to love them, righteousness to correct them, thus then people orderly proceed.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0113",
          "zh": "樂由中出，禮自外作。",
          "translations": [
            {
              "lang": "en",
              "text": "Music issues from within, ritual is made from without.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "樂由中出，故靜；",
          "translations": [
            {
              "lang": "en",
              "text": "Music issues from within, thus it is quiet;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "禮自外作，故文。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual is made from without, thus it is patterned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "大樂必易，大禮必簡。",
          "translations": [
            {
              "lang": "en",
              "text": "Great music must be easy, great ritual must be simple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "樂至則無怨，禮至則不爭。",
          "translations": [
            {
              "lang": "en",
              "text": "When music reaches its goal, there is no resentment; when ritual reaches its goal, there is no contention.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "揖讓而治天下者，禮樂之謂也。",
          "translations": [
            {
              "lang": "en",
              "text": "Yielding and declining to govern the world—these are what is called ritual and music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "暴民不作，諸侯賓服，兵革不試，五刑不用，百姓無患，天子不怒，如此則樂達矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When violent people do not arise, nobles submit as guests, weapons are not tested, the five punishments are not used, the common people have no worries, the Son of Heaven has no anger—thus music reaches its complete expression.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "合父子之親，明長幼之序，以敬四海之內。",
          "translations": [
            {
              "lang": "en",
              "text": "It unites father-son closeness, clarifies elder-younger order, to respect all within the four seas.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "天子如此，則禮行矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When the Son of Heaven does this, then ritual proceeds properly.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music comes from within, ritual made from without. Music comes from within, thus quiet; Ritual made from without, thus patterned. Great music must be easy, great ritual must be simple. Music reaches then no resentment, ritual reaches then no contention. Yielding and declining govern the world—these are called ritual and music. Violent people do not arise, nobles become guests and submit, weapons not tested, five punishments not used, common people without worry, Son of Heaven not angry, thus then music reaches completion. Unites father son closeness, clarifies elder younger order, to respect within the four seas. Son of Heaven thus, then ritual proceeds.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "大樂與天地同和，大禮與天地同節。",
          "translations": [
            {
              "lang": "en",
              "text": "Great music harmonizes with heaven and earth, great ritual measures with heaven and earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "和，故百物不失；",
          "translations": [
            {
              "lang": "en",
              "text": "Harmony—thus the ten thousand things are not lost;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "節，故祀天祭地。",
          "translations": [
            {
              "lang": "en",
              "text": "Measure—thus one sacrifices to heaven and worships earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "明則有禮樂，幽則有鬼神，如此則四海之內合敬同愛矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When bright, there is ritual and music; when dark, there are ghosts and spirits—thus all within the four seas unite in respect and share love.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "禮者，殊事合敬者也；",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual unites different matters in respect;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "樂者，異文合愛者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music unites different patterns in love.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "禮樂之情同，故明王以相沿也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual and music share the same emotion, thus enlightened kings follow one another.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "故事與時并，名與功偕。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus matters continue with time, names accompany merit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "故鐘鼓管磬羽籥干戚，樂之器也；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus bells, drums, pipes, chimes, feathers, flutes, shields, and axes are music's instruments;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "詘信俯仰級兆舒疾，樂之文也。",
          "translations": [
            {
              "lang": "en",
              "text": "Bending, stretching, bowing, rising, stepping, pausing, slowing, and quickening are music's patterns.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "簠簋俎豆制度文章，禮之器也；",
          "translations": [
            {
              "lang": "en",
              "text": "Fu vessels, gui vessels, zu stands, dou vessels, systems, and patterns are ritual's instruments;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "升降上下周旋裼襲，禮之文也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ascending, descending, high, low, turning, halting, baring arms, and covering them are ritual's patterns.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "故知禮樂之情者能作，識禮樂之文者能術。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus one who knows ritual and music's emotion can compose, one who recognizes ritual and music's patterns can arrange.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "作者之謂聖，術者之謂明。",
          "translations": [
            {
              "lang": "en",
              "text": "The composer is called sage, the arranger is called enlightened.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "明聖者，術作之謂也。",
          "translations": [
            {
              "lang": "en",
              "text": "Enlightened sage—the arranger and composer are thus called.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Great music with heaven earth same harmony, great ritual with heaven earth same measure. Harmony, thus hundred things not lost; Measure, thus sacrifice heaven worship earth. Bright then has ritual music, dark then has ghosts spirits, thus within four seas united respect same love. Ritual is different matters unite respect; Music is different patterns unite love. Ritual music's emotion same, thus enlightened kings mutually follow. Thus matters with time together, names with merit accompany. Thus bells drums pipes chimes feathers flutes shields axes, music's instruments; Bend stretch bow rise step marks slow fast, music's patterns. Fu gui zu dou systems patterns, ritual's instruments; Ascend descend high low turn about bare clothed, ritual's patterns. Thus knowing ritual music's emotion can compose, recognizing ritual music's patterns can arrange. Composer called sage, arranger called enlightened. Enlightened sage is arranger composer called.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0137",
          "zh": "樂者，天地之和也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is heaven and earth's harmony;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "禮者，天地之序也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual is heaven and earth's order.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "和，故百物皆化；",
          "translations": [
            {
              "lang": "en",
              "text": "Harmony—thus the ten thousand things all transform;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "序，故群物皆別。",
          "translations": [
            {
              "lang": "en",
              "text": "Order—thus the various groups are all distinguished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "樂由天作，禮以地制。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is made by heaven, ritual is formulated by earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "過制則亂，過作則暴。",
          "translations": [
            {
              "lang": "en",
              "text": "Exceeding formulation becomes chaotic, exceeding making becomes violent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "明於天地，然後能興禮樂也。",
          "translations": [
            {
              "lang": "en",
              "text": "When clear about heaven and earth, then one can flourish ritual and music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "論倫無患，樂之情也；",
          "translations": [
            {
              "lang": "en",
              "text": "Discussing categories without worry—this is music's emotion;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "欣喜驩愛，樂之（容）［官］也。",
          "translations": [
            {
              "lang": "en",
              "text": "Joyful, happy, loving—this is music's appearance;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "中正無邪，禮之質也；",
          "translations": [
            {
              "lang": "en",
              "text": "Central, correct, without deviation—this is ritual's substance;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "莊敬恭順，禮之制也。",
          "translations": [
            {
              "lang": "en",
              "text": "Solemn, respectful, reverent, compliant—this is ritual's formulation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "若夫禮樂之施於金石，越於聲音，用於宗廟社稷，事于山川鬼神，則此所以與民同也。",
          "translations": [
            {
              "lang": "en",
              "text": "As for the application of ritual and music to metal and stone, surpassing in sounds, used at ancestral temples and altars, matters at mountains and rivers, ghosts and spirits—thus it unites with the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is heaven earth's harmony; Ritual is heaven earth's order. Harmony, thus hundred things all transform; Order, thus group things all distinguished. Music by heaven made, ritual by earth formulated. Exceed formulation then chaotic, exceed making then violent. Clear about heaven earth, then able to flourish ritual music. Discussing categories without worry, music's emotion; Joyful happy loving, music's appearance; Central correct without deviation, ritual's substance; Solemn respectful reverent compliant, ritual's formulation. As for ritual music's application to metal stone, surpassing in sounds, used at ancestral temples altars, matters at mountains rivers ghosts spirits, then this is what unites with people.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "王者功成作樂，治定制禮。",
          "translations": [
            {
              "lang": "en",
              "text": "When kings achieve merit and make music, when governance is settled and ritual is formulated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "其功大者其樂備，其治辨者其禮具。",
          "translations": [
            {
              "lang": "en",
              "text": "When merit is great, music is complete; when governance is clear, ritual is complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "干戚之舞，非備樂也；",
          "translations": [
            {
              "lang": "en",
              "text": "Shield and axe dances are not complete music;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "亨孰而祀，非達禮也。",
          "translations": [
            {
              "lang": "en",
              "text": "Cooking and sacrificing is not the full expression of ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "五帝殊時，不相沿樂；",
          "translations": [
            {
              "lang": "en",
              "text": "The five emperors had different times, not following each other's music;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "三王異世，不相襲禮。",
          "translations": [
            {
              "lang": "en",
              "text": "The three kings had different ages, not copying each other's ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "樂極則憂，禮粗則偏矣。",
          "translations": [
            {
              "lang": "en",
              "text": "When music is extreme it leads to worry, when ritual is coarse it leads to bias.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "及夫敦樂而無憂，禮備而不偏者，其唯大聖乎？",
          "translations": [
            {
              "lang": "en",
              "text": "To reach music that is abundant without worry, ritual that is complete without bias—perhaps only the great sage can do this?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "天高地下，萬物散殊，而禮制行也；",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven is high, earth is low, the ten thousand things are scattered and distinct, yet ritual's system proceeds;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "流而不息，合同而化，而樂興也。",
          "translations": [
            {
              "lang": "en",
              "text": "Flowing without cessation, uniting and transforming—thus music arises.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "春作夏長，仁也；",
          "translations": [
            {
              "lang": "en",
              "text": "Spring works, summer grows—this is benevolence;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "秋斂冬藏，義也。",
          "translations": [
            {
              "lang": "en",
              "text": "Autumn gathers, winter stores—this is righteousness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "仁近於樂，義近於禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Benevolence is close to music, righteousness is close to ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "樂者敦和，率神而從天；",
          "translations": [
            {
              "lang": "en",
              "text": "Music with thick harmony leads spirits and follows heaven;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "禮者辨宜，居鬼而從地。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual distinguishes what is proper, resides with ghosts and follows earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "故聖人作樂以應天，作禮以配地。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus sages make music to respond to heaven, make ritual to match earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "禮樂明備，天地官矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual and music are clearly complete, heaven and earth are officiated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kings merit complete make music, governance settled formulate ritual. Merit great then music complete, governance clear then ritual complete. Shields axes dance not complete music; Cook sacrifice not reach ritual. Five emperors different times, not follow music; Three kings different ages, not copy ritual. Music extreme then worry, ritual coarse then biased. Reach thick music without worry, ritual complete without bias, perhaps only great sage? Heaven high earth low, ten thousand things scattered distinct, ritual system proceeds; Flowing without stopping, uniting transforming, music arises. Spring works summer grows, benevolence; Autumn gathers winter stores, righteousness. Benevolence close to music, righteousness close to ritual. Music thick harmony, leads spirits follows heaven; Ritual distinguishes proper, resides ghosts follows earth. Thus sage makes music to respond heaven, makes ritual to match earth. Ritual music clear complete, heaven earth official.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0166",
          "zh": "天尊地卑，君臣定矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven is honored, earth is lowly, ruler and minister are settled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "高卑已陳，貴賤位矣。",
          "translations": [
            {
              "lang": "en",
              "text": "High and low are already displayed, noble and base are positioned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "動靜有常，小大殊矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Movement and stillness have constants, small and large are distinct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "方以類聚，物以群分，則性命不同矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Square forms gather by category, things divide by group, thus life natures are different.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "在天成象，在地成形，如此則禮者天地之別也。",
          "translations": [
            {
              "lang": "en",
              "text": "In heaven forming images, on earth forming shapes—thus ritual is heaven and earth's distinction.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "地氣上隮，天氣下降，陰陽相摩，天地相蕩，鼓之以雷霆，奮之以風雨，動之以四時，煖之以日月，而百［物］化興焉，如此則樂者天地之和也。",
          "translations": [
            {
              "lang": "en",
              "text": "Earth qi rises upward, heaven qi descends downward, yin and yang mutually rub, heaven and earth mutually surge; drumming with thunder, rousing with wind and rain, moving with the four seasons, warming with sun and moon—thus the ten thousand things' transformation and flourishing arise; thus music is heaven and earth's harmony.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Heaven honored earth lowly, ruler minister settled. High low already displayed, noble base positioned. Movement stillness constant, small large distinct. Square by category gathers, things by group divides, then life nature different. In heaven forms image, on earth forms shape, thus ritual heaven earth's distinction. Earth qi upward rises, heaven qi downward descends, yin yang mutually rub, heaven earth mutually surge, drum with thunder, rouse with wind rain, move with four seasons, warm with sun moon, hundred things transformation arises, thus music heaven earth's harmony.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0172",
          "zh": "化不時則不生，男女無別則亂登，此天地之情也。",
          "translations": [
            {
              "lang": "en",
              "text": "When transformation is not timely, things do not come into being; when male and female have no distinction, chaotic ascension occurs—this is heaven and earth's emotion.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "及夫禮樂之極乎天而蟠乎地，行乎陰陽而通乎鬼神，窮高極遠而測深厚，樂著太始而禮居成物。",
          "translations": [
            {
              "lang": "en",
              "text": "Reaching ritual and music's extreme, coiling with heaven, spreading over earth, proceeding through yin and yang, connecting with ghosts and spirits; exhausting high and extreme, far and measuring, deep and thick—music manifests the great beginning, ritual resides in completed things.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "著不息者天也，著不動者地也。",
          "translations": [
            {
              "lang": "en",
              "text": "Manifesting what does not cease is heaven, manifesting what does not move is earth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "一動一靜者，天地之閒也。",
          "translations": [
            {
              "lang": "en",
              "text": "One moving, one still—heaven and earth's interval.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "故聖人曰「禮云樂云」。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the sage says: 'Ritual! Music!'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Transformation not timely then not born, male female no distinction then chaotic ascension, this heaven earth's emotion. Reach ritual music's extreme heaven coil earth, proceed yin yang connect ghosts spirits, exhaust high extreme far measure deep thick, music manifests great beginning ritual resides complete things. Manifest not stopping heaven, manifest not moving earth. One moving one still, heaven earth's between. Thus sage says 'ritual ah music ah'.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0177",
          "zh": "昔者舜作五弦之琴，以歌南風；",
          "translations": [
            {
              "lang": "en",
              "text": "Formerly Shun made a five-stringed zither, sang 'Southern Wind';",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "夔始作樂，以賞諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Kui began making music, to reward the nobles.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "故天子之為樂也，以賞諸侯之有德者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the Son of Heaven makes music to reward nobles who have virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "德盛而教尊，五穀時孰，然後賞之以樂。",
          "translations": [
            {
              "lang": "en",
              "text": "When virtue flourishes and teaching is honored, the five grains ripen in season—then reward with music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "故其治民勞者，其舞行級遠；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus when governing makes people toil, the dance rows and steps are far;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "其治民佚者，其舞行級短。",
          "translations": [
            {
              "lang": "en",
              "text": "When governing makes people at ease, the dance rows and steps are short.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "故觀其舞而知其德，聞其謚而知其行。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus observe the dance to know virtue, hear the posthumous titles to know conduct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "大章，章之也；",
          "translations": [
            {
              "lang": "en",
              "text": "Great Chapter—chapter it;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "咸池，備也；",
          "translations": [
            {
              "lang": "en",
              "text": "Xian Pond—complete it;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "韶，繼也；",
          "translations": [
            {
              "lang": "en",
              "text": "Shao—continue it;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "夏，大也；",
          "translations": [
            {
              "lang": "en",
              "text": "Xia—great it;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "殷周之樂盡也。",
          "translations": [
            {
              "lang": "en",
              "text": "Yin and Zhou's music are exhausted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Formerly Shun made five string zither, sang southern wind; Kui began making music, to reward nobles. Thus Son of Heaven makes music, to reward nobles having virtue. Virtue flourishing teaching honored, five grains timely ripe, then reward with music. Thus governing people laborious, dance rows step far; Governing people leisurely, dance rows step short. Thus observe dance know virtue, hear posthumous know conduct. Great chapter, chapter it; Xian chi, complete; Shao, continue; Xia, great; Yin Zhou music exhausted.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0189",
          "zh": "天地之道，寒暑不時則疾，風雨不節則饑。",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven and earth's way: when cold and heat are not timely, illness arises; when wind and rain are not measured, famine arises.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "教者，民之寒暑也，教不時則傷世。",
          "translations": [
            {
              "lang": "en",
              "text": "Teaching is people's cold and heat; when teaching is not timely, it harms the age.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "事者，民之風雨也，事不節則無功。",
          "translations": [
            {
              "lang": "en",
              "text": "Matters are people's wind and rain; when matters are not measured, no merit is achieved.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "然則先王之為樂也，以法治也，善則行象德矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings made music with governance as the standard: when good, proceed to imitate virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "夫豢豕為酒，非以為禍也；",
          "translations": [
            {
              "lang": "en",
              "text": "Fattening pigs to make wine is not done to cause calamity;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "而獄訟益煩，則酒之流生禍也。",
          "translations": [
            {
              "lang": "en",
              "text": "Yet when lawsuits increasingly frequent, then wine's flow produces calamity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "是故先王因為酒禮，一獻之禮，賓主百拜，終日飲酒而不得醉焉，此先王之所以備酒禍也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings established wine rituals: the ritual of one offering, with guest and host making a hundred bows, drinking all day without becoming drunk—this is how the former kings guarded against wine's calamity.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "故酒食者，所以合歡也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus wine and food serve to unite joys.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Heaven earth's way, cold heat not timely then illness, wind rain not measured then famine. Teaching people's cold heat, teaching not timely then harm age. Matters people's wind rain, matters not measured then no merit. Thus former kings made music, with law govern, good then proceed imitate virtue. Fatten pig make wine, not for calamity; Lawsuits increasingly frequent, then wine's flow produces calamity. Thus former kings because wine ritual, one offering ritual, guest host hundred bows, all day drink wine not get drunk, this former kings' preparing wine calamity. Thus wine food what unites joy.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0197",
          "zh": "樂者，所以象德也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music serves to imitate virtue;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "禮者，所以閉淫也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual serves to close licentiousness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "是故先王有大事，必有禮以哀之；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings had great matters, and must have ritual to mourn them;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "有大福，必有禮以樂之：哀樂之分，皆以禮終。",
          "translations": [
            {
              "lang": "en",
              "text": "They had great blessings, and must have ritual to delight in them. Mourning and delight's division—all end with ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music what imitates virtue; Ritual is what closes licentiousness. Thus former kings had great matters, must have ritual to grieve them; Had great blessings, must have ritual to delight them: grief delight's division, all end with ritual.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0201",
          "zh": "樂也者，施也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is application;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "禮也者，報也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual is response.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "樂，樂其所自生；",
          "translations": [
            {
              "lang": "en",
              "text": "Music delights in what it itself produces;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "而禮，反其所自始。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual returns to what it itself began.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "樂章德，禮報情反始也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music displays virtue, ritual responds to emotion and returns to beginnings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "所謂大路者，天子之輿也；",
          "translations": [
            {
              "lang": "en",
              "text": "What is called the Great Road is the Son of Heaven's carriage;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "龍旂九旒，天子之旌也；",
          "translations": [
            {
              "lang": "en",
              "text": "The dragon banner with nine streamers is the Son of Heaven's banner;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "青黑緣者，天子之葆龜也；",
          "translations": [
            {
              "lang": "en",
              "text": "The blue-black bordered canopy and tortoise chariot are the Son of Heaven's emblems;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "從之以牛羊之群，則所以贈諸侯也。",
          "translations": [
            {
              "lang": "en",
              "text": "Followed by herds of oxen and sheep—thus it is presented to the nobles.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is application; Ritual is response. Music delights what it self produces; Ritual returns to what it self began. Music displays virtue, ritual responds to emotion returns to beginning. What is called great road is Son of Heaven's carriage; Dragon banner nine streamers, Son of Heaven's banner; Blue black bordered, Son of Heaven's canopy tortoise; Followed by herds of oxen sheep, then this is to present to nobles.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0210",
          "zh": "樂也者，情之不可變者也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is emotion that cannot be changed;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "禮也者，理之不可易者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual is principle that cannot be altered.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "樂統同，禮別異，禮樂之說貫乎人情矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Music unites what is the same, ritual distinguishes what is different—ritual and music's explanation penetrates human emotion.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "窮本知變，樂之情也；",
          "translations": [
            {
              "lang": "en",
              "text": "Exhaust the source to know change—this is music's emotion;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "著誠去偽，禮之經也。",
          "translations": [
            {
              "lang": "en",
              "text": "Manifest sincerity, remove falsity—this is ritual's canon.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "禮樂順天地之誠，達神明之德，降興上下之神，而凝是精粗之體，領父子君臣之節。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual and music follow heaven and earth's sincerity, reach the spirits' virtue, descend and raise the high and low spirits, condense the fine and coarse bodies, lead the sections of father, son, ruler, and minister.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is emotion that cannot be changed; Ritual is principle that cannot be altered. Music unites same, ritual distinguishes different, ritual music's explanation penetrates human emotion. Exhaust source know change, music's emotion; Manifest sincerity remove falsity, ritual's canon. Ritual music follows heaven earth's sincerity, reaches spirits' virtue, descends raises high low spirits, condenses fine coarse bodies, leads father son ruler minister sections.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "是故大人舉禮樂，則天地將為昭焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus when great men raise ritual and music, heaven and earth will illuminate.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "天地欣合，陰陽相得，煦嫗覆育萬物，然後草木茂，區萌達，羽翮奮，角觡生，蟄蟲昭穌，羽者嫗伏，毛者孕鬻，胎生者不殰而卵生者不殈，則樂之道歸焉耳。",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven and earth unite in joy, yin and yang mutually obtain, warming and brooding to cover and nurture the ten thousand things; then grass and trees flourish, district sprouts reach, winged creatures exert their wings, horned creatures grow their antlers, hibernating insects clearly revive, feathered ones brood and lie, furred ones become pregnant and nourish, womb-born do not abort, egg-born do not break—thus music's way returns there.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Thus great man raises ritual music, then heaven earth will illuminate. Heaven earth joyful unite, yin yang mutually obtain, warm brood cover nurture ten thousand things, then grass wood flourish, district sprouts reach, feathers wings exert, horns antlers grow, hibernating insects clearly revive, feathered ones brood lie, furred ones pregnant nourish, womb born not abort and egg born not break, then music's way returns there.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0218",
          "zh": "樂者，非謂黃鐘大呂弦歌干揚也，樂之末節也，故童者舞之；",
          "translations": [
            {
              "lang": "en",
              "text": "Music does not mean yellow bells, great lü, string songs, shield lifting—these are music's minor sections, thus children dance to them;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "布筵席，陳樽俎，列籩豆，以升降為禮者，禮之末節也，故有司掌之。",
          "translations": [
            {
              "lang": "en",
              "text": "Spreading mats and seats, arranging pitchers and stands, arranging baskets and beans, with ascending and descending as ritual—these are ritual's minor sections, thus officials manage them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "樂師辯乎聲詩，故北面而弦；",
          "translations": [
            {
              "lang": "en",
              "text": "The music master distinguishes sounds and poems, thus faces north and plays strings;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "宗祝辯乎宗廟之禮，故後尸；",
          "translations": [
            {
              "lang": "en",
              "text": "The ancestral priest distinguishes ancestral temple rituals, thus stands behind the corpse;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "商祝辯乎喪禮，故後主人。",
          "translations": [
            {
              "lang": "en",
              "text": "The funeral priest distinguishes mourning rituals, thus stands behind the master.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "是故德成而上，藝成而下；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus virtue when complete is above, arts when complete are below;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "行成而先，事成而後。",
          "translations": [
            {
              "lang": "en",
              "text": "Conduct when complete is first, matters when complete are after.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "是故先王有上有下，有先有後，然後可以有制於天下也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the former kings had above and below, had first and after—then they could establish regulation over the world.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is not meaning yellow bell great lü string songs shield lift—these are music's minor sections, thus children dance them; Spread mats seats, arrange pitchers stands, arrange baskets beans, with ascending descending as ritual—these are ritual's minor sections, thus officials manage them. Music master distinguishes sounds poems, thus north facing strings; Ancestral priest distinguishes ancestral temple ritual, thus behind corpse; Funeral priest distinguishes mourning ritual, thus behind master. Thus virtue complete then above, arts complete then below; Conduct complete then first, matters complete then after. Thus former kings had above below, had first after, then can have regulation over the world.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0226",
          "zh": "樂者，聖人之所樂也，而可以善民心。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is what sages delight in, and can improve people's hearts.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "其感人深，其風移俗易，故先王著其教焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Its influence is deep, its wind shifts customs with ease—thus former kings established their teachings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is what sages delight in, and can improve people's hearts. Its affecting people deep, its wind shifts customs easily, thus former kings established their teaching.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0228",
          "zh": "夫人有血氣心知之性，而無哀樂喜怒之常，應感起物而動，然後心術形焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Man has blood and qi, heart and knowing nature, without the constants of grief, joy, anger, and happiness. Responding to stimuli, they arise from things and move—then the heart's methods take form.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "是故志微焦衰之音作，而民思憂；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus subtle worried declining sounds arise, and people think of sorrow;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "啴緩慢易繁文簡節之音作，而民康樂；",
          "translations": [
            {
              "lang": "en",
              "text": "Broad relaxed slow easy ornate simple sounds arise, and people are peaceful and happy;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "粗厲猛起奮末廣賁之音作，而民剛毅；",
          "translations": [
            {
              "lang": "en",
              "text": "Coarse fierce vigorous rising exerting end broad flourishing sounds arise, and people are firm and resolute;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "廉直經正莊誠之音作，而民肅敬；",
          "translations": [
            {
              "lang": "en",
              "text": "Upright straight regular correct solemn sincere sounds arise, and people are solemn and respectful;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "寬裕肉好順成和動之音作，而民慈愛；",
          "translations": [
            {
              "lang": "en",
              "text": "Broad generous flesh good compliant complete harmonious moving sounds arise, and people are benevolent and loving;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "流辟邪散狄成滌濫之音作，而民淫亂。",
          "translations": [
            {
              "lang": "en",
              "text": "Flowing deviant evil scattered isolated complete washed overflowing sounds arise, and people are licentious and chaotic.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Man has blood qi heart knowing nature, without grief joy anger happiness constants, responding to stimulation arises from things and moves, then heart methods take form. Thus subtle worried declining sounds made, people think worry; Broad relaxed slow easy ornate simple sounds made, people peaceful happy; Coarse fierce vigorous rising exerting end broad flourishing sounds made, people firm resolute; Upright straight regular correct solemn sincere sounds made, people solemn respectful; Broad generous flesh good compliant complete harmonious moving sounds made, people benevolent loving; Flowing deviant evil scattered isolated complete washed overflowing sounds made, people licentious chaotic.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "是故先王本之情性，稽之度數，制之禮義，合生氣之和，道五常之行，使之陽而不散，陰而不密，剛氣不怒，柔氣不懾，四暢交於中而發作於外，皆安其位而不相奪也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus former kings based on emotion and nature, examined measurements and numbers, formulated ritual and righteousness, combined life qi harmony, guided the five constants' conduct, made them yang without dispersing, yin without dense, firm qi not angry, soft qi not fearful, four flows cross in center and issue outside—all settle their positions without mutually seizing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "然後立之學等，廣其節奏，省其文采，以繩德厚也。",
          "translations": [
            {
              "lang": "en",
              "text": "Then established learning grades, broadened rhythms, reduced patterns, to rope virtue and make it thick.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "類小大之稱，比終始之序，以象事行，使親疏貴賤長幼男女之理皆形見於樂：故曰「樂觀其深矣」。",
          "translations": [
            {
              "lang": "en",
              "text": "Compare small and large proportions, match end and beginning order, to resemble matters and conduct—make close and distant, noble and base, elder and young, male and female principles all visibly appear in music. Thus it is said: 'Observe music's depth.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Thus former kings based on emotion nature, examined measurements numbers, formulated ritual righteousness, combined life qi harmony, guided five constants conduct, made them yang without dispersing, yin without dense, firm qi not angry, soft qi not fearful, four flows cross in center and issue outside, all settle their positions without mutually seizing. Then established learning grades, broadened their rhythms, reduced their patterns, to rope virtue make thick. Compare small large proportions, match end beginning order, to resemble matters conduct, make close distant noble base elder young male female principles all visibly appear in music: thus says 'music observe its deep'.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "土敝則草木不長，水煩則魚鱉不大，氣衰則生物不育，世亂則禮廢而樂淫。",
          "translations": [
            {
              "lang": "en",
              "text": "When soil is exhausted, grass and trees do not grow; when water is troubled, fish and turtles do not become large; when qi declines, living things do not flourish; when the age is chaotic, ritual wastes and music becomes licentious.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "是故其聲哀而不莊，樂而不安，慢易以犯節，流湎以忘本。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus its sound is mournful without solemnity, happy without calm, lax and easy violating measure, flowing and drowning forgetting the root.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "廣則容姦。",
          "translations": [
            {
              "lang": "en",
              "text": "When broad, it contains evil.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "狹則思欲，感滌蕩之氣而滅平和之德，是以君子賤之也。",
          "translations": [
            {
              "lang": "en",
              "text": "When narrow, it arouses desires; affected by washed and wandering qi, it extinguishes peaceful virtue—thus gentlemen despise it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Soil exhausted then grass wood not grow, water troubled then fish turtles not large, qi declining then living things not nurtured, age chaotic then ritual wastes music licentious. Thus its sound grieving without solemnity, happy without calm, lax easy violating measure, flowing drowning forgetting root. Broad then contains evil. Narrow then thinks desires, affected by washed wandering qi extinguishes peaceful virtue, thus gentlemen despise it.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0242",
          "zh": "凡姦聲感人而逆氣應之，逆氣成象而淫樂興焉。",
          "translations": [
            {
              "lang": "en",
              "text": "All evil sounds affect people, perverse qi responds, perverse qi forms images, licentious music arises.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "正聲感人而順氣應之，順氣成象而和樂興焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Correct sounds affect people, compliant qi responds, compliant qi forms images, harmonious music arises.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "倡和有應，回邪曲直各歸其分，而萬物之理以類相動也。",
          "translations": [
            {
              "lang": "en",
              "text": "Lead and harmony have response, crooked and straight each return to their division, the ten thousand things' principle moves by category mutually.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "All evil sounds affect people perverse qi responds, perverse qi forms image licentious music arises. Correct sounds affect people compliant qi responds, compliant qi forms image harmonious music arises. Lead harmony have response, return crooked straight each return their division, ten thousand things principle by category mutually move.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0245",
          "zh": "是故君子反情以和其志，比類以成其行。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the gentleman returns emotion to harmonize will, compares categories to complete conduct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "姦聲亂色不留聰明，淫樂廢禮不接於心術，惰慢邪辟之氣不設於身體，使耳目鼻口心知百體皆由順正，以行其義。",
          "translations": [
            {
              "lang": "en",
              "text": "Evil sounds make chaotic colors not remain in clear wisdom, licentious music wastes ritual not connecting to heart methods, lazy lax deviant perverse qi not established in body—make ears, eyes, nose, mouth, heart, knowing, hundred bodies all follow orderly correct, to proceed with righteousness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "然後發以聲音，文以琴瑟，動以干戚，飾以羽旄，從以簫管，奮至德之光，動四氣之和，以著萬物之理。",
          "translations": [
            {
              "lang": "en",
              "text": "Then issue with sounds, pattern with zither and se, move with shields and axes, adorn with feathers and banners, follow with flutes and pipes, arouse great virtue's light, move four qi harmony, manifest ten thousand things' principle.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "是故清明象天，廣大象地，終始象四時，周旋象風雨；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus clear brightness imitates heaven, vast greatness imitates earth, end and beginning imitate four seasons, turning imitates wind and rain;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "五色成文而不亂，八風從律而不姦，百度得數而有常；",
          "translations": [
            {
              "lang": "en",
              "text": "Five colors form patterns without confusion, eight winds follow pitch without evil, hundred measures get numbers with constant;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "小大相成，終始相生，倡和清濁，代相為經。",
          "translations": [
            {
              "lang": "en",
              "text": "Small and large mutually complete, end and beginning mutually produce, lead harmony clear turbid, alternate mutually as pattern.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "故樂行而倫清，耳目聰明，血氣和平，移風易俗，天下皆寧。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music proceeds, categories become clear, ears and eyes gain wisdom, blood and qi become peaceful, shift wind and change customs, all under heaven become peaceful.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "故曰「樂者樂也」。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus it is said: 'Music is delight.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "君子樂得其道，小人樂得其欲。",
          "translations": [
            {
              "lang": "en",
              "text": "The gentleman delights in getting the way, the small person delights in getting desires.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "以道制欲，則樂而不亂；",
          "translations": [
            {
              "lang": "en",
              "text": "With way controlling desires, then delight without chaos;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "以欲忘道，則惑而不樂。",
          "translations": [
            {
              "lang": "en",
              "text": "With desires forgetting way, then confusion without delight.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "是故君子反情以和其志，廣樂以成其教，樂行而民鄉方，可以觀德矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus the gentleman returns emotion to harmonize will, broadens music to complete teaching, music proceeds and people turn toward direction, can observe virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Thus gentleman returns emotion to harmonize his will, compares categories to complete his conduct. Evil sounds chaotic colors not remain clear wisdom, licentious music wastes ritual not connect to heart methods, lazy lax deviant perverse qi not established in body, make ears eyes nose mouth heart knowing hundred bodies all follow orderly correct, to proceed their righteousness. Then issue with sounds, pattern with zither se, move with shields axes, adorn with feathers banners, follow with flutes pipes, rouse great virtue's light, move four qi harmony, manifest ten thousand things principle. Thus clear bright imitates heaven, vast great imitates earth, end beginning imitates four seasons, turning imitates wind rain; Five colors form pattern not chaotic, eight winds follow pitch not evil, hundred measures get number have constant; Small large mutually complete, end beginning mutually produce, lead harmony clear turbid, alternate mutually as warp. Thus music proceeds categories clear, ears eyes clear wisdom, blood qi peaceful, shift wind change customs, world all peaceful. Thus says 'music is delight'. Gentleman delights get way, small person delights get desires. With way control desires, then delight without chaos; With desires forget way, then confused without delight. Thus gentleman returns emotion harmonizes will, broadens music completes teaching, music proceeds people turn to direction, can observe virtue.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "德者，性之端也；",
          "translations": [
            {
              "lang": "en",
              "text": "Virtue is nature's beginning;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "樂者，德之華也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is virtue's flower;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "金石絲竹，樂之器也。",
          "translations": [
            {
              "lang": "en",
              "text": "Metal, stone, silk, bamboo—these are music's instruments.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "詩，言其志也；",
          "translations": [
            {
              "lang": "en",
              "text": "Poems speak of the will;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "歌，詠其聲也；",
          "translations": [
            {
              "lang": "en",
              "text": "Songs chant the voice;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "舞，動其容也：三者本乎心，然後樂氣從之。",
          "translations": [
            {
              "lang": "en",
              "text": "Dances move appearances: these three originate from the heart, then music's qi follows.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "是故情深而文明，氣盛而化神，和順積中而英華發外，唯樂不可以為偽。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus emotion when deep is patterned and bright, qi when flourishing transforms the spirit, harmonious compliance accumulates in center, brilliant flowers issue outside—only music cannot be false.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Virtue nature's beginning; Music virtue's flower; Metal stone silk bamboo, music's instruments. Poem speaks will; Song chants sound; Dance moves appearance: three base on heart, then music qi follows. Thus emotion deep patterned bright, qi flourishing transforms spirit, harmonious compliant accumulates center brilliant flower issues outside, only music cannot be false.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0264",
          "zh": "樂者，心之動也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is the heart's movement;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "聲者，樂之象也；",
          "translations": [
            {
              "lang": "en",
              "text": "Sound is music's image;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "文采節奏，聲之飾也。",
          "translations": [
            {
              "lang": "en",
              "text": "Patterns, rhythms—these are sound's adornments.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "君子動其本，樂其象，然後治其飾。",
          "translations": [
            {
              "lang": "en",
              "text": "The gentleman moves the root, delights in the image, then governs the adornments.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "是故先鼓以警戒，三步以見方，再始以著往，復亂以飭歸，奮疾而不拔，（也）極幽而不隱。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus first drum to alert and caution, three steps to see the square, twice begin to manifest going, repeat chaos to arrange return, arouse fast without pulling out, reach profound without hiding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "獨樂其志，不厭其道；",
          "translations": [
            {
              "lang": "en",
              "text": "Alone delight in the will, not weary of the way;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "備舉其道，不私其欲。",
          "translations": [
            {
              "lang": "en",
              "text": "Complete raise the way, not private with desires.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "是以情見而義立，樂終而德尊；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus emotion seen, righteousness established, music ended, virtue honored;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "君子以好善，小人以息過：故曰「生民之道，樂為大焉」。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman with delight in goodness, small person with ceasing errors—thus it is said: 'The living people's way, music is great.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music heart's movement; Sound music's image; Patterns rhythms, sound's adornment. Gentleman moves root, delights image, then governs adornment. Thus first drum to alert caution, three steps to see square, twice begin to manifest going, repeat chaos to arrange return, rouse fast not pull out, reach profound not hide. Alone delight will, not weary way; Complete raise way, not private desires. Thus emotion seen righteousness established, music ends virtue honored; Gentleman with like good, small person with rest errors: thus says 'living people way, music great'.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0273",
          "zh": "君子曰：禮樂不可以斯須去身。",
          "translations": [
            {
              "lang": "en",
              "text": "The gentleman says: ritual and music cannot be separated from the body for a moment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "致樂以治心，則易直子諒之心油然生矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Apply music to govern the heart, then easy, straight, filial, sincere hearts naturally arise.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "易直子諒之心生則樂，樂則安，安則久，久則天，天則神。",
          "translations": [
            {
              "lang": "en",
              "text": "Easy, straight, filial, sincere hearts arise, then delight; delight, then calm; calm, then lasting; lasting, then heaven; heaven, then spirit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "天則不言而信，神則不怒而威。",
          "translations": [
            {
              "lang": "en",
              "text": "Heaven, then not speaking yet trustworthy; spirit, then not angry yet awe-inspiring.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "致樂，以治心者也；",
          "translations": [
            {
              "lang": "en",
              "text": "Apply music to govern the heart;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "致禮，以治躬者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Apply ritual to govern the person.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "治躬則莊敬，莊敬則嚴威。",
          "translations": [
            {
              "lang": "en",
              "text": "Govern the person, then solemn and respectful; solemn and respectful, then strict and awe-inspiring.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "心中斯須不和不樂，而鄙詐之心入之矣；",
          "translations": [
            {
              "lang": "en",
              "text": "Heart for a moment not harmonious, not delightful, vulgar deceitful heart enters;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "外貌斯須不莊不敬，而慢易之心入之矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Outer appearance for a moment not solemn, not respectful, lax easy heart enters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "故樂也者，動於內者也；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music moves within;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "禮也者，動於外者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual moves without.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "樂極和，禮極順。",
          "translations": [
            {
              "lang": "en",
              "text": "Music when extreme is harmony, ritual when extreme is compliance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "內和而外順，則民瞻其顏色而弗與爭也，望其容貌而民不生易慢焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Inner harmony, outer compliance, then people gaze at countenances without contending, look at appearances, people do not give birth to lax disrespect.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "德煇動乎內而民莫不承聽，理發乎外而民莫不承順，故曰「知禮樂之道，舉而錯之天下無難矣」。",
          "translations": [
            {
              "lang": "en",
              "text": "Virtue's radiance moves within, people none not accept and listen; principle issues without, people none not accept and comply. Thus it is said: 'Know ritual music's way, raise and apply it, no difficulty in the world.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Gentleman says: ritual music cannot moment leave body. Apply music to govern heart, then easy straight filial sincere heart naturally born. Easy straight filial sincere heart born then delight, delight then calm, calm then lasting, lasting then heaven, heaven then spirit. Heaven then not speak trustworthy, spirit then not angry awe-inspiring. Apply music to govern heart; Apply ritual to govern person. Govern person then solemn respectful, solemn respectful then strict awe. Heart moment not harmonious not delightful, vulgar deceitful heart enters; Outer appearance moment not solemn not respectful, lax easy heart enters. Thus music moves within; Ritual moves without. Music extreme harmony, ritual extreme compliance. Inner harmony outer compliance, then people gaze face not contend, look appearance people not born lax disrespect. Virtue radiance moves within people none not accept listen, principle issues without people none not accept comply, thus says 'know ritual music way, raise apply world no difficulty'.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0287",
          "zh": "樂也者，動於內者也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music moves within;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "禮也者，動於外者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual moves without.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "故禮主其謙，樂主其盈。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus ritual masters humility, music masters fullness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "禮謙而進，以進為文；",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual humble advances, advances as pattern;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "樂盈而反，以反為文。",
          "translations": [
            {
              "lang": "en",
              "text": "Music full returns, returns as pattern.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "禮謙而不進，則銷；",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual humble without advancing, then melts;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "樂盈而不反，則放。",
          "translations": [
            {
              "lang": "en",
              "text": "Music full without returning, then dissipates.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "故禮有報而樂有反。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus ritual has response, music has return.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0295",
          "zh": "禮得其報則樂，樂得其反則安。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual gets response then delights, music gets return then calms.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "禮之報，樂之反，其義一也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual's response, music's return—their meaning is one.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music moves within; Ritual moves without. Thus ritual masters humility, music masters fullness. Ritual humble advances, with advance as pattern; Music full returns, with return as pattern. Ritual humble not advance, then melts; Music full not return, then dissipates. Thus ritual has response music has return. Ritual gets response then delight, music gets return then calm. Ritual's response, music's return, their meaning is one.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0297",
          "zh": "夫樂者樂也，人情之所不能免也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is delight, human emotion's inescapable thing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "樂必發諸聲音，形於動靜，人道也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music must issue from sounds, form in movement and stillness, the human way.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "聲音動靜，性術之變，盡於此矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Sounds, movement, stillness—nature's method changes, exhausts herein.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "故人不能無樂，樂不能無形。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus man cannot be without music, music cannot be without form.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "形而不為道，不能無亂。",
          "translations": [
            {
              "lang": "en",
              "text": "Form without guidance, cannot be without chaos.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "先王惡其亂，故制雅頌之聲以道之，使其聲足以樂而不流，使其文足以綸而不息，使其曲直繁省廉肉節奏，足以感動人之善心而已矣，不使放心邪氣得接焉，是先王立樂之方也。",
          "translations": [
            {
              "lang": "en",
              "text": "Former kings hated its chaos, thus formulated ya and song sounds to guide it, made sound sufficient to delight without licentiousness, made pattern sufficient to weave without cessation, made straight crooked ornate simple upright fleshy rhythms sufficient to move people's good hearts only, not made carefree evil qi connect—thus former kings established music's method.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "是故樂在宗廟之中，君臣上下同聽之，則莫不和敬；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music in ancestral temple midst, ruler minister high low together listen, none not harmonious respectful;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "在族長鄉里之中，長幼同聽之，則莫不和順；",
          "translations": [
            {
              "lang": "en",
              "text": "In clan elder village midst, elder young together listen, none not harmonious compliant;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "在閨門之內，父子兄弟同聽之，則莫不和親。",
          "translations": [
            {
              "lang": "en",
              "text": "In inner chambers within, father son brothers together listen, none not harmonious close.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "故樂者，審一以定和，比物以飾節，節奏合以成文，所以合和父子君臣，附親萬民也，是先王立樂之方也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music examines one to settle harmony, compares things to adorn measure, rhythm combines to form pattern, unites harmony father son ruler minister, attaches closeness myriad people—this is former kings established music's method.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "故聽其雅頌之聲，志意得廣焉；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus listen to ya song sounds, will intent broadens;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "執其干戚，習其俯仰詘信，容貌得莊焉；",
          "translations": [
            {
              "lang": "en",
              "text": "Hold shields axes, practice bowing rising bending stretching, appearance becomes solemn;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "行其綴兆，要其節奏，行列得正焉，進退得齊焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Perform connected marks, grasp rhythms, ranks become correct, advance retreat become orderly.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "故樂者天地之齊，中和之紀，人情之所不能免也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus music is heaven earth's equal, central harmony's record, human emotion's inescapable thing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is delight, human emotion's what cannot be avoided. Music must issue from sounds, take form in movement stillness, human way. Sounds movement stillness, nature method's change, exhausts in this. Thus man cannot without music, music cannot without form. Form without being guided, cannot without chaos. Former kings hated its chaos, thus formulated ya song sounds to guide it, make its sound sufficient to delight without flowing, make its pattern sufficient to weave without stopping, make its straight crooked ornate simple upright fleshy rhythms, sufficient to move people's good hearts only, not make carefree evil qi connect, this is former kings established music's method. Thus music in ancestral temple midst, ruler minister high low together listen it, then none not harmonious respectful; In clan elder village midst, elder young together listen it, then none not harmonious compliant; In inner chambers within, father son brothers together listen it, then none not harmonious close. Thus music examines one to settle harmony, compares things to adorn measure, rhythm combines to form pattern, what unites harmony father son ruler minister, attaches closeness myriad people, this is former kings established music's method. Thus listen its ya song sounds, will intent gets broad; Hold its shields axes, practice its bowing rising bending stretching, appearance gets solemn; Perform its connected marks, grasp its rhythms, ranks get correct, advance retreat get orderly. Thus music is heaven earth's equal, central harmony's record, human emotion's what cannot be avoided.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0311",
          "zh": "夫樂者，先王之所以飾喜也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music is former kings' decoration of happiness;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "軍旅鈇鉞者，先王之所以飾怒也。",
          "translations": [
            {
              "lang": "en",
              "text": "Military campaigns with axe and halberd are former kings' decoration of anger.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "故先王之喜怒皆得其齊矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus former kings' happiness anger all got their equalization.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "喜則天下和之，怒則暴亂者畏之。",
          "translations": [
            {
              "lang": "en",
              "text": "Happy then world harmonizes it, angry then violent chaotic fear it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "先王之道禮樂可謂盛矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Former kings' way of ritual music can be called flourishing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music is former kings' what decorates happiness; Military campaigns axe halberds are former kings' what decorates anger. Thus former kings' happiness anger all got their equal. Happy then world harmonizes it, angry then violent chaotic fear it. Former kings' way ritual music can be called flourishing.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0316",
          "zh": "魏文侯問於子夏曰：「吾端冕而聽古樂則唯恐臥，聽鄭衛之音則不知倦。",
          "translations": [
            {
              "lang": "en",
              "text": "Wei Marquis Wen asked Master Zi Xia saying: 'I put on cap and robe and listen to ancient music, then fear lying down; listen to Zheng Wei sounds, then not know weariness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "敢問古樂之如彼，何也？",
          "translations": [
            {
              "lang": "en",
              "text": "Dare ask ancient music like that, why?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "新樂之如此，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "New music like this, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Wei Wen Hou asked Zi Xia saying: 'I put on cap robe and listen ancient music then fear lying down, listen Zheng Wei sounds then not know weariness. Dare ask ancient music like that, why? New music like this, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0320",
          "zh": "子夏答曰：「今夫古樂，進旅而退旅，和正以廣，弦匏笙簧合守拊鼓，始奏以文，止亂以武，治亂以相，訊疾以雅。",
          "translations": [
            {
              "lang": "en",
              "text": "Zi Xia answered saying: 'Now ancient music advances rows retreats rows, harmonious correct broad, strings gourds sheng reeds together guard beat drum, begins with pattern stops chaos with martial, governs chaos with minister, hurries fast with ya.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "君子於是語，於是道古，修身及家，平均天下：此古樂之發也。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman therein speaks, therein guides ancient, cultivates self reaches family, equalizes world—this is ancient music's arising.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "今夫新樂，進俯退俯，姦聲以淫，溺而不止，及優侏儒，獶雜子女，不知父子。",
          "translations": [
            {
              "lang": "en",
              "text": "Now new music advances bent retreats bent, evil sounds licentious, drowns without stopping, reaches actors dwarfs, mixed with women children, not knowing father son.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "樂終不可以語，不可以道古：此新樂之發也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music ends cannot speak, cannot guide ancient—this is new music's arising.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0324",
          "zh": "今君之所問者樂也，所好者音也。",
          "translations": [
            {
              "lang": "en",
              "text": "Now lord asks is music, likes is sound.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "夫樂之與音，相近而不同。」",
          "translations": [
            {
              "lang": "en",
              "text": "Music and sound close but different.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Zi Xia answered saying: 'Now ancient music advances rows retreats rows, harmonious correct broad, strings gourds sheng reeds together guard beat drum, begins with pattern stops chaos with martial, governs chaos with minister, hurries fast with ya. Gentleman here speaks, here guides ancient, cultivates self reaches family, equalizes world: this ancient music's issuing. Now new music advances bent retreats bent, evil sounds licentious, drowns without stopping, reaches actors dwarfs, mixed with women children, not know father son. Music ends cannot speak, cannot guide ancient: this new music's issuing. Now lord's what asks is music, what likes is sound. Music and sound are close but different.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0327",
          "zh": "文侯曰：「敢問如何？」",
          "translations": [
            {
              "lang": "en",
              "text": "Wen Marquis said: 'Dare ask how?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Wen Hou said: 'Dare ask how?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0329",
          "zh": "子夏答曰：「夫古者天地順而四時當，民有德而五穀昌，疾疢不作而無祅祥，此之謂大當。",
          "translations": [
            {
              "lang": "en",
              "text": "Zi Xia answered saying: 'Ancient heaven earth compliant, four seasons proper, people had virtue, five grains prosperous, illnesses not arising without ominous portents—this called great proper.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "然後聖人作為父子君臣以為之紀綱，紀綱既正，天下大定，天下大定，然後正六律，和五聲，弦歌詩頌，此之謂德音，德音之謂樂。",
          "translations": [
            {
              "lang": "en",
              "text": "Then sage made father son ruler minister as framework, framework already correct, world greatly settled, world greatly settled, then correct six pitches, harmonize five sounds, string song poem praise—this called virtue sound, virtue sound called music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "《詩》曰：『莫其德音，其德克明，克明克類，克長克君。",
          "translations": [
            {
              "lang": "en",
              "text": "Odes say: 'None their virtue sound, virtue can bright, can bright can categorize, can long can rule.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "王此大邦，克順克俾。",
          "translations": [
            {
              "lang": "en",
              "text": "King this great state, can compliant can aid.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "俾於文王，其德靡悔。",
          "translations": [
            {
              "lang": "en",
              "text": "Aid to Wen Wang, virtue not regret.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "既受帝祉，施于孫子。』",
          "translations": [
            {
              "lang": "en",
              "text": "Already received emperor's blessings, bestowed on grandson children.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "此之謂也。",
          "translations": [
            {
              "lang": "en",
              "text": "This meaning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "今君之所好者，其溺音與？」",
          "translations": [
            {
              "lang": "en",
              "text": "Now lord likes drowning sound?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Zi Xia answered saying: 'Ancient heaven earth compliant four seasons proper, people had virtue five grains prosperous, illnesses not arise without ominous portents, this called great proper. Then sage made father son ruler minister as framework, framework already correct, world greatly settled, world greatly settled, then correct six pitches, harmonize five sounds, string song poem praise, this called virtue sound, virtue sound called music. Odes say: 'None his virtue sound, his virtue can bright, can bright can categorize, can grow can rule. King this great state, can compliant can aid. Aid to Wen Wang, his virtue not regret. Already received emperor blessings, bestowed on grandsons children.' This what means. Now lord's what likes is drowning sound?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0338",
          "zh": "文侯曰：「敢問溺音者何從出也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Wen Marquis said: 'Dare ask drowning sound from where arises?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Wen Hou said: 'Dare ask drowning sound from where issues?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0340",
          "zh": "子夏答曰：「鄭音好濫淫志，宋音燕女溺志，衛音趣數煩志，齊音驁辟驕志，四者皆淫於色而害於德，是以祭祀不用也。",
          "translations": [
            {
              "lang": "en",
              "text": "Zi Xia answered saying: 'Zheng sound likes overflowing licentious will, Song sound Yan woman drowning will, Wei sound hasty frequent troubling will, Qi sound haughty deviant proud will, four all licentious in color harm virtue, thus sacrifices not use.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "《詩》曰：『肅雍和鳴，先祖是聽。』",
          "translations": [
            {
              "lang": "en",
              "text": "Odes say: 'Solemn harmonious chirping, ancestors listen.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "夫肅肅，敬也；",
          "translations": [
            {
              "lang": "en",
              "text": "Solemn, respectful;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "雍雍，和也。",
          "translations": [
            {
              "lang": "en",
              "text": "Harmonious, harmonious.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0344",
          "zh": "夫敬以和，何事不行？",
          "translations": [
            {
              "lang": "en",
              "text": "Respectful with harmonious, what matter not proceeds?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "為人君者，謹其所好惡而已矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Ruler carefully likes dislikes only.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "君好之則臣為之，上行之則民從之。",
          "translations": [
            {
              "lang": "en",
              "text": "Lord likes then minister does, above acts then people follow.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "《詩》曰：『誘民孔易』，此之謂也。",
          "translations": [
            {
              "lang": "en",
              "text": "Odes say: 'Guide people very easy', this meaning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "然後聖人作為鞉鼓椌楬壎篪，此六者，德音之音也。",
          "translations": [
            {
              "lang": "en",
              "text": "Then sage made frame drum wooden clapper xun chi, these six virtue sound's sounds.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "然後鐘磬竽瑟以和之，干戚旄狄以舞之。",
          "translations": [
            {
              "lang": "en",
              "text": "Then bells chimes yu se harmonize them, shields axes plumes banners dance them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "此所以祭先王之廟也，所以獻醻酳酢也，所以官序貴賤各得其宜也，此所以示後世有尊卑長幼序也。",
          "translations": [
            {
              "lang": "en",
              "text": "This so sacrifices former kings' temples, so offers toasts pledges, so officials order noble base each get proper, this so shows later generations have honored lowly elder young order.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "鐘聲鏗，鏗以立號，號以立橫，橫以立武。",
          "translations": [
            {
              "lang": "en",
              "text": "Bell sound clang, clang establishes signal, signal establishes horizontal, horizontal establishes martial.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "君子聽鐘聲則思武臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman hears bell sound then thinks martial ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "石聲硁，硁以立別，別以致死。",
          "translations": [
            {
              "lang": "en",
              "text": "Stone sound qing, qing establishes distinction, distinction reaches death.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "君子聽磬聲則思死封疆之臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman hears chime sound then thinks die defending borders ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "絲聲哀，哀以立廉，廉以立志。",
          "translations": [
            {
              "lang": "en",
              "text": "Silk sound mournful, mournful establishes purity, purity establishes will.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "君子聽琴瑟之聲則思志義之臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman hears zither se sounds then thinks righteous ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0357",
          "zh": "竹聲濫，濫以立會，會以聚眾。",
          "translations": [
            {
              "lang": "en",
              "text": "Bamboo sound overflowing, overflowing establishes assembly, assembly gathers crowd.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0358",
          "zh": "君子聽竽笙簫管之聲則思畜聚之臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman hears yu sheng xiao pipe sounds then thinks gathering ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "鼓鼙之聲讙，讙以立動，動以進眾。",
          "translations": [
            {
              "lang": "en",
              "text": "Drum beat sounds clamor, clamor establishes movement, movement advances crowd.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "君子聽鼓鼙之聲則思將帥之臣。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman hears drum beat sounds then thinks generals ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0361",
          "zh": "君子之聽音，非聽其鏗鎗而已也，彼亦有所合之也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman's listening to sounds, not just listening to clang clang, they also have what combines.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Zi Xia answered saying: 'Zheng sound likes overflowing licentious will, Song sound Yan woman drowning will, Wei sound hasty frequent troubling will, Qi sound haughty deviant proud will, four all licentious in color harm virtue, thus sacrifices not use. Odes say: 'Solemn harmonious chirping, ancestors listen.' Solemn, respectful; Harmonious, harmonious. Respectful with harmonious, what matter not proceed? Being ruler, careful his likes dislikes only. Lord likes then minister does, above acts then people follow. Odes say: 'Guide people very easy', this what means. Then sage made frame drum wooden clapper xun chi, these six virtue sound's sounds. Then bells chimes yu se to harmonize them, shields axes plumes banners to dance them. This what sacrifices former kings' temples, what offers toasts pledges, what officials order noble base each get proper, this what shows later generations have honored lowly elder young order. Bell sound clang, clang to establish signal, signal to establish horizontal, horizontal to establish martial. Gentleman hears bell sound then thinks martial ministers. Stone sound qing, qing to establish distinction, distinction to reach death. Gentleman hears chime sound then thinks die defending borders ministers. Silk sound mournful, mournful to establish purity, purity to establish will. Gentleman hears zither se sounds then thinks righteous ministers. Bamboo sound overflowing, overflowing to establish assembly, assembly to gather crowd. Gentleman hears yu sheng xiao pipe sounds then thinks gathering ministers. Drum beat sounds clamor, clamor to establish movement, movement to advance crowd. Gentleman hears drum beat sounds then thinks generals ministers. Gentleman's listening to sounds, not just listening to clang clang, they also have what combines.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0363",
          "zh": "賓牟賈侍坐於孔子，孔子與之言，及樂，曰：「夫武之備戒之已久，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Bin Mu Jia attended sitting with Confucius, Confucius spoke with them, reached music, said: 'Wu's preparation caution already long, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Bin Mu Jia attended sitting with Confucius, Confucius spoke with them, reached music, said: 'Wu's preparation caution already long, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0365",
          "zh": "答曰：「病不得其眾也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Fear not getting the multitude.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Fear not getting the multitude.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0367",
          "zh": "「永嘆之，淫液之，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "'Prolonged sighing, excessive flowing, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "'Prolonged sighing, excessive flowing, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0369",
          "zh": "答曰：「恐不逮事也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Fear not reaching affairs.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Fear not reaching affairs.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0371",
          "zh": "「發揚蹈厲之已蚤，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "'Rouse raise stamp fierce already early, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "'Rouse raise stamp fierce already early, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0373",
          "zh": "答曰：「及時事也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Reach timely affairs.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Reach timely affairs.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0375",
          "zh": "「武坐致右憲左，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "'Wu sit attain right marshal left, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "'Wu sit attain right marshal left, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0377",
          "zh": "答曰：「非武坐也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Not Wu sit.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Not Wu sit.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0379",
          "zh": "「聲淫及商，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "'Sound excessive reach shang, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "'Sound excessive reach shang, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0381",
          "zh": "答曰：「非武音也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Not Wu sound.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Not Wu sound.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0383",
          "zh": "子曰：「若非武音，則何音也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Master said: 'If not Wu sound, then what sound?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Master said: 'If not Wu sound, then what sound?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0385",
          "zh": "答曰：「有司失其傳也。",
          "translations": [
            {
              "lang": "en",
              "text": "Answered saying: 'Officials lost transmission.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "如非有司失其傳，則武王之志荒矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "If not officials lost transmission, then Wu Wang's will neglected.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Answered saying: 'Officials lost transmission. If not officials lost transmission, then Wu Wang's will neglected.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "子曰：「唯丘之聞諸萇弘，亦若吾子之言是也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Master said: 'Only Qiu heard from Chang Hong, also like son's words.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Master said: 'Only Qiu heard from Chang Hong, also like my son's words.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0390",
          "zh": "賓牟賈起，免席而請曰：「夫武之備戒之已久，則既聞命矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Bin Mu Jia rose, left seat requested saying: 'Wu's preparation caution already long, then already heard command.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "敢問遲之遲而又久，何也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Dare ask slow's slow moreover long, why?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Bin Mu Jia rose, left seat requested saying: 'Wu's preparation caution already long, then already heard command. Dare ask slow's slow moreover long, why?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0393",
          "zh": "子曰：「居，吾語汝。",
          "translations": [
            {
              "lang": "en",
              "text": "Master said: 'Sit, I tell you.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "夫樂者，象成者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music is what imitates completion.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0395",
          "zh": "總干而山立，武王之事也；",
          "translations": [
            {
              "lang": "en",
              "text": "Hold shields stand mountain, Wu Wang's affair;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "發揚蹈厲，太公之志也；",
          "translations": [
            {
              "lang": "en",
              "text": "Rouse raise stamp fierce, Tai Gong's will;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "武亂皆坐，周召之治也。",
          "translations": [
            {
              "lang": "en",
              "text": "Wu chaos all sit, Zhou Zhao's governance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0398",
          "zh": "且夫武，始而北出，再成而滅商，三成而南，四成而南國是疆，五成而分陜，周公左，召公右，六成復綴，以崇天子，夾振之而四伐，盛（振）威於中國也。",
          "translations": [
            {
              "lang": "en",
              "text": "Moreover Wu, begins north out, twice complete extinguish Shang, three complete south, four complete south states boundary, five complete divide Sha, Zhou Gong left, Zhao Gong right, six complete again connect, honor Son of Heaven, flank shake four attack, flourish awe in central states.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0399",
          "zh": "分夾而進，事蚤濟也。",
          "translations": [
            {
              "lang": "en",
              "text": "Divide flank advance, affairs early complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0400",
          "zh": "久立於綴，以待諸侯之至也。",
          "translations": [
            {
              "lang": "en",
              "text": "Long stand at connect, wait nobles' arrival.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0401",
          "zh": "且夫女獨未聞牧野之語乎？",
          "translations": [
            {
              "lang": "en",
              "text": "Moreover alone not heard Mu Ye's words?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0402",
          "zh": "武王克殷反商，未及下車，而封黃帝之後於薊，封帝堯之後於祝，封帝舜之後於陳；",
          "translations": [
            {
              "lang": "en",
              "text": "Wu Wang conquered Yin returned Shang, not yet alighted carriage, enfeoffed Yellow Emperor's descendants at Ji, enfeoffed Emperor Yao's descendants at Zhu, enfeoffed Emperor Shun's descendants at Chen;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0403",
          "zh": "下車而封夏后氏之後於杞，封殷之後於宋，封王子比干之墓，釋箕子之囚，使之行商容而復其位。",
          "translations": [
            {
              "lang": "en",
              "text": "Alighted carriage enfeoffed Xia Hou's descendants at Qi, enfeoffed Yin's descendants at Song, enfeoffed Prince Bi Gan tomb, released Ji Zi prisoner, made walk Shang Rong restore position.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0404",
          "zh": "庶民弛政，庶士倍祿。",
          "translations": [
            {
              "lang": "en",
              "text": "Common people relaxed governance, common scholars doubled salary.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0405",
          "zh": "濟河而西，馬散華山之陽而弗復乘；",
          "translations": [
            {
              "lang": "en",
              "text": "Crossed river west, horses scattered Hua Mountain yang not again ride;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0406",
          "zh": "牛散桃林之野而不復服；",
          "translations": [
            {
              "lang": "en",
              "text": "Oxen scattered Tao Lin wild not again use;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0407",
          "zh": "車甲弢而藏之府庫而弗復用；",
          "translations": [
            {
              "lang": "en",
              "text": "Chariots armor covered stored armory not again use;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0408",
          "zh": "倒載干戈，苞之以虎皮；",
          "translations": [
            {
              "lang": "en",
              "text": "Inverted loaded spears halberds, wrapped tiger skins;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0409",
          "zh": "將率之士，使為諸侯，名之曰『建櫜』：然後天下知武王之不復用兵也。",
          "translations": [
            {
              "lang": "en",
              "text": "Generals soldiers, made nobles, named 'build quiver': world knew Wu Wang not again use troops.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0410",
          "zh": "散軍而郊射，左射貍首，右射騶虞，而貫革之射息也；",
          "translations": [
            {
              "lang": "en",
              "text": "Disbanded army suburban archery, left shoot li shou, right shoot zou yu, penetrate leather shooting ceased;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0411",
          "zh": "裨冕搢笏，而虎賁之士稅劍也；",
          "translations": [
            {
              "lang": "en",
              "text": "Wore caps inserted tablets, tiger brave scholars removed swords;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0412",
          "zh": "祀乎明堂，而民知孝；",
          "translations": [
            {
              "lang": "en",
              "text": "Sacrificed Bright Hall, people knew filial;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0413",
          "zh": "朝覲，然後諸侯知所以臣；",
          "translations": [
            {
              "lang": "en",
              "text": "Court audience, nobles knew minister way;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0414",
          "zh": "耕藉，然後諸侯知所以敬：五者天下之大教也。",
          "translations": [
            {
              "lang": "en",
              "text": "Plowing ceremony, nobles know respect: five world's great teachings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0415",
          "zh": "食三老五更於太學，天子袒而割牲，執醬而饋，執爵而酳，冕而總干，所以教諸侯之悌也。",
          "translations": [
            {
              "lang": "en",
              "text": "Feed three elders five seniors at great academy, Son of Heaven bares arms cuts meat, holds sauce feeds, holds goblet toasts, capped totals shield, teaches nobles' respect.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0416",
          "zh": "若此，則周道四達，禮樂交通，則夫武之遲久，不亦宜乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Like this, Zhou way four reaches, ritual music intercommunicates, Wu's delay long, proper?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Master said: 'Sit, I tell you. Music is what imitates completion. Hold shields stand mountain, Wu Wang's affair; Rouse raise stamp fierce, Tai Gong's will; Wu chaos all sit, Zhou Zhao's governance. Moreover Wu, begins north out, twice complete extinguish Shang, three complete south, four complete south states boundary, five complete divide Sha, Zhou Gong left, Zhao Gong right, six complete again connect, to honor Son of Heaven, flank shake four attack, flourish awe in central states. Divide flank advance, affairs early complete. Long stand at connect, to wait nobles' arrival. Moreover you alone not heard Mu Ye's words? Wu Wang conquered Yin returned Shang, not yet alighted carriage, enfeoffed Yellow Emperor's descendants at Ji, enfeoffed Emperor Yao's descendants at Zhu, enfeoffed Emperor Shun's descendants at Chen; Alighted carriage enfeoffed Xia Hou's descendants at Qi, enfeoffed Yin's descendants at Song, enfeoffed Prince Bi Gan tomb, released Ji Zi prisoner, made him walk Shang Rong restore position. Common people relaxed governance, common scholars doubled salary. Crossed river west, horses scattered Hua Mountain yang not again ride; Oxen scattered Tao Lin wild not again use; Chariots armor covered stored armory not again use; Inverted loaded spears halberds, wrapped tiger skins; Generals soldiers, made nobles, named 'build quiver': then world knew Wu Wang not again use troops. Disbanded army suburban archery, left shoot li shou, right shoot zou yu, penetrate leather shooting ceased; Wore caps inserted tablets, tiger brave scholars removed swords; Sacrificed Bright Hall, people knew filial; Court audience, then nobles knew minister way; Plowing ceremony, then nobles know what to respect: five the world's great teachings. Feed three elders five seniors at great academy, Son of Heaven bares arms cuts meat, holds sauce feeds, holds goblet toasts, capped totals shield, what teaches nobles' respect. Like this, then Zhou way four reaches, ritual music intercommunicates, then Wu's delay long, not also proper?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0418",
          "zh": "子貢見師乙而問焉，曰：「賜聞聲歌各有宜也，如賜者宜何歌也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Zi Gong saw Music Master Yi asked saying: 'Gong heard voice song each has suitable, like Gong suitable what song?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Zi Gong saw Music Master Yi and asked saying: 'Gong heard voice song each has suitable, like Gong suitable what song?'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0420",
          "zh": "師乙曰：「乙，賤工也，何足以問所宜。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Yi said: 'Yi humble artisan, how sufficient ask suitable.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0421",
          "zh": "請誦其所聞，而吾子自執焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Please recite heard, son self choose.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0422",
          "zh": "寬而靜，柔而正者宜歌頌；",
          "translations": [
            {
              "lang": "en",
              "text": "Broad quiet, soft correct suitable sing song;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0423",
          "zh": "廣大而靜，疏達而信者宜歌大雅；",
          "translations": [
            {
              "lang": "en",
              "text": "Vast great quiet, sparse penetrating trustworthy suitable sing great ya;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0424",
          "zh": "恭儉而好禮者宜歌小雅；",
          "translations": [
            {
              "lang": "en",
              "text": "Respectful frugal good ritual suitable sing small ya;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0425",
          "zh": "正直清廉而謙者宜歌風；",
          "translations": [
            {
              "lang": "en",
              "text": "Upright straight pure frugal modest suitable sing feng;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0426",
          "zh": "肆直而慈愛者宜歌商；",
          "translations": [
            {
              "lang": "en",
              "text": "Unrestrained straight benevolent loving suitable sing shang;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0427",
          "zh": "溫良而能斷者宜歌齊。",
          "translations": [
            {
              "lang": "en",
              "text": "Gentle good able decide suitable sing qi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0428",
          "zh": "夫歌者，直己而陳德；",
          "translations": [
            {
              "lang": "en",
              "text": "Song expresses self virtue;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0429",
          "zh": "動己而天地應焉，四時和焉，星辰理焉，萬物育焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Moves self heaven earth responds, four seasons harmonize, stars order, things nurture.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0430",
          "zh": "故商者，五帝之遺聲也，商人志之，故謂之商；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus shang five emperors' remaining sound, Shang people remembered, called shang;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0431",
          "zh": "齊者，三代之遺聲也，齊人志之，故謂之齊。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi three dynasties' remaining sound, Qi people remembered, called qi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0432",
          "zh": "明乎商之詩者，臨事而屢斷；",
          "translations": [
            {
              "lang": "en",
              "text": "Clear shang's poems, facing matters repeatedly decide;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0433",
          "zh": "明乎齊之詩者，見利而讓也。",
          "translations": [
            {
              "lang": "en",
              "text": "Clear qi poems, see benefit yield.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0434",
          "zh": "臨事而屢斷，勇也；",
          "translations": [
            {
              "lang": "en",
              "text": "Facing matters repeatedly decide, brave;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0435",
          "zh": "見利而讓，義也。",
          "translations": [
            {
              "lang": "en",
              "text": "See benefit yield, righteous.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0436",
          "zh": "有勇有義，非歌孰能保此？",
          "translations": [
            {
              "lang": "en",
              "text": "Have brave have righteous, not song who preserve?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0437",
          "zh": "故歌者，上如抗，下如隊，曲如折，止如槁木，居中矩，句中鉤，累累乎殷如貫珠。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus song raise, team, bent break, stop withered wood, dwell center square, phrases center hook, continuous stringing pearls.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0438",
          "zh": "故歌之為言也，長言之也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus song's meaning, prolong speak.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0439",
          "zh": "說之，故言之；",
          "translations": [
            {
              "lang": "en",
              "text": "Persuade speak;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0440",
          "zh": "言之不足，故長言之；",
          "translations": [
            {
              "lang": "en",
              "text": "Speak insufficient prolong speak;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0441",
          "zh": "長言之不足，故嗟嘆之；",
          "translations": [
            {
              "lang": "en",
              "text": "Prolong speak insufficient sigh lament;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0442",
          "zh": "嗟嘆之不足，故不知手之舞之足之蹈之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Sigh lament insufficient not know hand dance foot stamp.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0443",
          "zh": "子貢問樂。",
          "translations": [
            {
              "lang": "en",
              "text": "Zi Gong asked music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Music Master Yi said: 'Yi is humble artisan, how sufficient to ask suitable. Please recite what heard, my son self choose. Broad quiet, soft correct suitable sing song; Vast great quiet, sparse penetrating trustworthy suitable sing great ya; Respectful frugal good ritual suitable sing small ya; Upright straight pure frugal modest suitable sing feng; Unrestrained straight benevolent loving suitable sing shang; Gentle good able decide suitable sing qi. Song expresses self virtue; Moves self heaven earth responds, four seasons harmonize, stars order, things nurture. Thus shang is five emperors' remaining sound, Shang people remembered it, thus called shang; Qi is three dynasties' remaining sound, Qi people remembered it, thus called qi. Clear about shang's poems, facing matters repeatedly decide; Clear about qi poems, see benefit yield. Facing matters repeatedly decide, brave; See benefit yield, righteous. Have brave have righteous, not song who can preserve this? Thus song's like raise, like team, bent like break, stop like withered wood, dwell center square, phrases center hook, continuous like stringing pearls. Thus song's meaning, prolong speak. Persuade thus speak; Speak insufficient thus prolong speak; Prolong speak insufficient thus sigh lament; Sigh lament insufficient thus not know hand dance foot stamp.' Zi Gong asked about music.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0444",
          "zh": "凡音由於人心，天之與人有以相通，如景之象形，響之應聲。",
          "translations": [
            {
              "lang": "en",
              "text": "All sounds originate human heart, heaven man connection, shadow resembles form, echo responds sound.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0445",
          "zh": "故為善者天報之以福，為惡者天與之以殃，其自然者也。",
          "translations": [
            {
              "lang": "en",
              "text": "Do good heaven repays blessing, do evil heaven gives calamity, natural.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "All sounds originate from human heart, heaven and man have connection, like shadow resembles form, echo responds sound. Thus do good heaven repays with blessing, do evil heaven gives calamity, its natural.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0446",
          "zh": "故舜彈五弦之琴，歌南風之詩而天下治；",
          "translations": [
            {
              "lang": "en",
              "text": "Thus Shun played five string zither, sang southern wind poem world governed;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0447",
          "zh": "紂為朝歌北鄙之音，身死國亡。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhou made morning song north suburb sounds, body died state perished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0448",
          "zh": "舜之道何弘也？",
          "translations": [
            {
              "lang": "en",
              "text": "Shun's way broad?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0449",
          "zh": "紂之道何隘也？",
          "translations": [
            {
              "lang": "en",
              "text": "Zhou's way narrow?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0450",
          "zh": "夫南風之詩者生長之音也，舜樂好之，樂與天地同意，得萬國之驩心，故天下治也。",
          "translations": [
            {
              "lang": "en",
              "text": "Southern wind poem growth sound, Shun delighted liked, delight heaven earth same intent, got ten thousand states' happy hearts, world governed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0451",
          "zh": "夫朝歌者不時也，北者敗也，鄙者陋也，紂樂好之，與萬國殊心，諸侯不附，百姓不親，天下畔之，故身死國亡。",
          "translations": [
            {
              "lang": "en",
              "text": "Morning song untimely, north defeat, suburb vulgar, Zhou delighted liked, ten thousand states different hearts, nobles not attach, common people not close, world rebelled, body died state perished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Thus Shun played five string zither, sang southern wind poem world governed; Zhou made morning song northern suburb sounds, body died state perished. Shun's way how broad? Zhou's way how narrow? Southern wind poem is growth sound, Shun delighted liked it, delight with heaven earth same intent, got ten thousand states' happy hearts, thus world governed. Morning song untimely, northern defeat, suburb vulgar, Zhou delighted liked it, with ten thousand states different hearts, nobles not attach, common people not close, world rebelled against him, thus body died state perished.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0452",
          "zh": "而衛靈公之時，將之晉，至於濮水之上舍。",
          "translations": [
            {
              "lang": "en",
              "text": "Wei Ling Gong time, going Jin, reached Pu water above lodged.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0453",
          "zh": "夜半時聞鼓琴聲，問左右，皆對曰「不聞」。",
          "translations": [
            {
              "lang": "en",
              "text": "Night half heard drum zither sound, asked left right, answered not hear.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0454",
          "zh": "乃召師涓曰：「吾聞鼓琴音，問左右，皆不聞。",
          "translations": [
            {
              "lang": "en",
              "text": "Summoned Music Master Juan saying: 'Heard drum zither sound, asked left right, not hear.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0455",
          "zh": "其狀似鬼神，為我聽而寫之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Appearance like ghosts spirits, listen transcribe.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0456",
          "zh": "師涓曰：「諾。」",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Juan said: 'Yes.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0457",
          "zh": "因端坐援琴，聽而寫之。",
          "translations": [
            {
              "lang": "en",
              "text": "Sat straight took zither, listened transcribed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0458",
          "zh": "明日，曰：「臣得之矣，然未習也，請宿習之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Next day said: 'Minister got, not practiced, stay practice.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0459",
          "zh": "靈公曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ling Gong said: 'Acceptable.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0460",
          "zh": "因復宿。",
          "translations": [
            {
              "lang": "en",
              "text": "Again stayed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0461",
          "zh": "明日，報曰：「習矣。」",
          "translations": [
            {
              "lang": "en",
              "text": "Next day reported: 'Practiced.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0462",
          "zh": "即去之晉，見晉平公。",
          "translations": [
            {
              "lang": "en",
              "text": "Went Jin, saw Jin Ping Gong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0463",
          "zh": "平公置酒於施惠之臺。",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong set wine Shi Hui terrace.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0464",
          "zh": "酒酣，靈公曰：「今者來，聞新聲，請奏之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Wine mellow, Ling Gong said: 'Come, heard new sound, play.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0465",
          "zh": "平公曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Acceptable.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0466",
          "zh": "即令師涓坐師曠旁，援琴鼓之。",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered Music Master Juan sit Music Master Kuang side, took zither drummed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0467",
          "zh": "未終，師曠撫而止之曰：「此亡國之聲也，不可遂。」",
          "translations": [
            {
              "lang": "en",
              "text": "Not finished, Music Master Kuang stroked stopped saying: 'Perished state's sound, cannot continue.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0468",
          "zh": "平公曰：「何道出？」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Know?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0469",
          "zh": "師曠曰：「師延所作也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang said: 'Music Master Yan made.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0470",
          "zh": "與紂為靡靡之樂，武王伐紂，師延東走，自投濮水之中，故聞此聲必於濮水之上，先聞此聲者國削。」",
          "translations": [
            {
              "lang": "en",
              "text": "Zhou decadent music, Wu Wang attacked Zhou, Music Master Yan east fled, self-threw Pu water midst, hear sound must Pu water above, first hear sound state reduced.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0471",
          "zh": "平公曰：「寡人所好者音也，願遂聞之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Delight sound, wish continue hear.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0472",
          "zh": "師涓鼓而終之。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Juan drummed finished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Wei Ling Gong time, going to Jin, reached Pu water above lodged. Night half heard drum zither sound, asked left right, all answered 'not hear'. Then summoned Music Master Juan saying: 'I heard drum zither sound, asked left right, all not hear. Its appearance like ghosts spirits, for me listen transcribe it.' Music Master Juan said: 'Yes.' Thus sat straight took zither, listened transcribed. Next day said: 'Minister got it, but not practiced, please stay practice.' Ling Gong said: 'Acceptable.' Thus again stayed. Next day reported: 'Practiced.' Then went Jin, saw Jin Ping Gong. Ping Gong set wine at Shi Hui terrace. Wine mellow, Ling Gong said: 'Now come, heard new sound, please play it.' Ping Gong said: 'Acceptable.' Then ordered Music Master Juan sit Music Master Kuang side, took zither drummed it. Not finished, Music Master Kuang stroked stopped saying: 'This perished state's sound, cannot continue.' Ping Gong said: 'How know?' Music Master Kuang said: 'Music Master Yan made. With Zhou made decadent music, Wu Wang attacked Zhou, Music Master Yan east fled, self-threw Pu water midst, thus hear this sound must at Pu water above, first hear this sound state reduced.' Ping Gong said: 'I delight sound, wish continue hear.' Music Master Juan drummed finished.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0473",
          "zh": "平公曰：「音無此最悲乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Sound sorrowful?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0474",
          "zh": "師曠曰：「有。」",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang said: 'Has.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0475",
          "zh": "平公曰：「可得聞乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Hear?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0476",
          "zh": "師曠曰：「君德義薄，不可以聽之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang said: 'Lord virtue righteousness thin, cannot listen.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0477",
          "zh": "平公曰：「寡人所好者音也，願聞之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Delight sound, wish hear.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0478",
          "zh": "師曠不得已，援琴而鼓之。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang no choice, took zither drummed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0479",
          "zh": "一奏之，有玄鶴二八集乎廊門；",
          "translations": [
            {
              "lang": "en",
              "text": "One play, black cranes twenty-eight gathered corridor gate;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0480",
          "zh": "再奏之，延頸而鳴，舒翼而舞。",
          "translations": [
            {
              "lang": "en",
              "text": "Two play, extended necks cried, spread wings danced.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Ping Gong said: 'Sound no more sorrowful?' Music Master Kuang said: 'Has.' Ping Gong said: 'Can hear?' Music Master Kuang said: 'Lord virtue righteousness thin, cannot listen.' Ping Gong said: 'I delight sound, wish hear.' Music Master Kuang had no choice, took zither drummed. One play, had black cranes twenty-eight gathered corridor gate; Two play, extended necks cried, spread wings danced.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0481",
          "zh": "平公大喜，起而為師曠壽。",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong greatly happy, rose toasted Music Master Kuang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0482",
          "zh": "反坐，問曰：「音無此最悲乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Returned sat, asked: 'Sound sorrowful?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0483",
          "zh": "師曠曰：「有。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang said: 'Has.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0484",
          "zh": "昔者黃帝以大合鬼神，今君德義薄，不足以聽之，聽之將敗。」",
          "translations": [
            {
              "lang": "en",
              "text": "Former Yellow Emperor great united ghosts spirits, lord virtue righteousness thin, insufficient listen, listen defeat.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0485",
          "zh": "平公曰：「寡人老矣，所好者音也，願遂聞之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong said: 'Old, delight sound, wish continue hear.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0486",
          "zh": "師曠不得已，援琴而鼓之。",
          "translations": [
            {
              "lang": "en",
              "text": "Music Master Kuang no choice, took zither drummed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0487",
          "zh": "一奏之，有白雲從西北起；",
          "translations": [
            {
              "lang": "en",
              "text": "One play, white clouds northwest rise;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0488",
          "zh": "再奏之，大風至而雨隨之，飛廊瓦，左右皆奔走。",
          "translations": [
            {
              "lang": "en",
              "text": "Two play, great wind arrived rain followed, flew corridor tiles, left right fled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0489",
          "zh": "平公恐懼，伏於廊屋之閒。",
          "translations": [
            {
              "lang": "en",
              "text": "Ping Gong feared, prostrated corridor room between.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0490",
          "zh": "晉國大旱，赤地三年。",
          "translations": [
            {
              "lang": "en",
              "text": "Jin state great drought, red earth three years.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Ping Gong greatly happy, rose toasted Music Master Kuang. Returned sat, asked: 'Sound no more sorrowful?' Music Master Kuang said: 'Has. Former Yellow Emperor with great united ghosts spirits, now lord virtue righteousness thin, insufficient listen, listen will defeat.' Ping Gong said: 'I old, delight sound, wish continue hear.' Music Master Kuang had no choice, took zither drummed. One play, had white clouds from northwest rise; Two play, great wind arrived rain followed, flew corridor tiles, left right all fled. Ping Gong feared, prostrated corridor room between. Jin state great drought, red earth three years.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0491",
          "zh": "聽者或吉或凶。",
          "translations": [
            {
              "lang": "en",
              "text": "Listeners auspicious inauspicious.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0492",
          "zh": "夫樂不可妄興也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music cannot recklessly arise.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Listeners or auspicious or inauspicious. Music cannot recklessly arise.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0493",
          "zh": "太史公曰：夫上古明王舉樂者，非以娛心自樂，快意恣欲，將欲為治也。",
          "translations": [
            {
              "lang": "en",
              "text": "Grand Historian said: Ancient enlightened kings raised music, not entertain heart delight, satisfy desires indulge wishes, govern.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0494",
          "zh": "正教者皆始於音，音正而行正。",
          "translations": [
            {
              "lang": "en",
              "text": "Correct teaching begin sound, sound correct conduct correct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0495",
          "zh": "故音樂者，所以動蕩血脈，通流精神而和正心也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music moves shakes blood vessels, penetrates flows spirit harmonizes corrects heart.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0496",
          "zh": "故宮動脾而和正聖，商動肺而和正義，角動肝而和正仁，徵動心而和正禮，羽動腎而和正智。",
          "translations": [
            {
              "lang": "en",
              "text": "Gong moves spleen harmonizes corrects sage, shang moves lung harmonizes corrects righteousness, jue moves liver harmonizes corrects benevolence, zhi moves heart harmonizes corrects ritual, yu moves kidney harmonizes corrects wisdom.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0497",
          "zh": "故樂所以內輔正心而外異貴賤也；",
          "translations": [
            {
              "lang": "en",
              "text": "Music assists correct heart externally distinguishes noble base;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0498",
          "zh": "上以事宗廟，下以變化黎庶也。",
          "translations": [
            {
              "lang": "en",
              "text": "Above serves ancestral temples, below transforms common people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0499",
          "zh": "琴長八尺一寸，正度也。",
          "translations": [
            {
              "lang": "en",
              "text": "Zither long eight chi one cun, correct measure.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0500",
          "zh": "弦大者為宮，而居中央，君也。",
          "translations": [
            {
              "lang": "en",
              "text": "Strings large gong, dwells central, ruler;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0501",
          "zh": "商張右傍，其餘大小相次，不失其次序，則君臣之位正矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Shang string right side, others large small order, not lose order, ruler minister positions correct.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0502",
          "zh": "故聞宮音，使人溫舒而廣大；",
          "translations": [
            {
              "lang": "en",
              "text": "Hear gong sound, person warm comfortable broad great;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0503",
          "zh": "聞商音，使人方正而好義；",
          "translations": [
            {
              "lang": "en",
              "text": "Hear shang sound, person square correct good righteousness;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0504",
          "zh": "聞角音，使人惻隱而愛人；",
          "translations": [
            {
              "lang": "en",
              "text": "Hear jue sound, person compassionate loving people;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0505",
          "zh": "聞徵音，使人樂善而好施；",
          "translations": [
            {
              "lang": "en",
              "text": "Hear zhi sound, person joyful good bestowing;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0506",
          "zh": "聞羽音，使人整齊而好禮。",
          "translations": [
            {
              "lang": "en",
              "text": "Hear yu sound, person orderly good ritual.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0507",
          "zh": "夫禮由外入，樂自內出。",
          "translations": [
            {
              "lang": "en",
              "text": "Ritual outside enters, music within issues.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0508",
          "zh": "故君子不可須臾離禮，須臾離禮則暴慢之行窮外；",
          "translations": [
            {
              "lang": "en",
              "text": "Gentleman moment leave ritual, moment leave ritual violent lax conduct exhausts outside;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0509",
          "zh": "不可須臾離樂，須臾離樂則姦邪之行窮內。",
          "translations": [
            {
              "lang": "en",
              "text": "Moment leave music, moment leave music evil deviant conduct exhausts inside.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0510",
          "zh": "故樂音者，君子之所養義也。",
          "translations": [
            {
              "lang": "en",
              "text": "Music sounds, gentleman's nurtures righteousness.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0511",
          "zh": "夫古者，天子諸侯聽鐘磬未嘗離於庭，卿大夫聽琴瑟之音未嘗離於前，所以養行義而防淫佚也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ancient, Son of Heaven nobles heard bells chimes left court, ministers scholars heard zither se sounds left front, nurtures conduct righteousness prevents licentious dissipation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0512",
          "zh": "夫淫佚生於無禮，故聖王使人耳聞雅頌之音，目視威儀之禮，足行恭敬之容，口言仁義之道。",
          "translations": [
            {
              "lang": "en",
              "text": "Licentious dissipation born no ritual, sages make people ears hear ya song sounds, eyes see awe-inspiring ritual forms, feet walk respectful appearances, mouths speak benevolent righteous ways.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0513",
          "zh": "故君子終日言而邪辟無由入也。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus gentleman all day speaks yet evil deviation has no way to enter.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Grand Historian said: Ancient enlightened kings raised music, not to entertain heart self-delight, satisfy desires indulge wishes, will govern. Correct teaching all begin from sound, sound correct conduct correct. Thus music what moves shakes blood vessels, penetrates flows spirit harmonizes corrects heart. Thus gong moves spleen harmonizes corrects sage, shang moves lung harmonizes corrects righteousness, jue moves liver harmonizes corrects benevolence, zhi moves heart harmonizes corrects ritual, yu moves kidney harmonizes corrects wisdom. Thus music what internally assists correct heart externally distinguishes noble base; Above serves ancestral temples, below transforms common people. Zither long eight chi one cun, correct measure. Strings large for gong, dwells central, ruler. Shang stretches right side, others large small in order, not lose order, then ruler minister positions correct. Thus hear gong sound, makes person warm comfortable broad great; Hear shang sound, makes person square correct good righteousness; Hear jue sound, makes person compassionate loving people; Hear zhi sound, makes person joyful good bestowing; Hear yu sound, makes person orderly good ritual. Ritual from outside enters, music from within issues. Thus gentleman cannot moment leave ritual, moment leave ritual then violent lax conduct exhausts outside; Cannot moment leave music, moment leave music then evil deviant conduct exhausts inside. Thus music sounds, gentleman's what nurtures righteousness. Ancient, Son of Heaven nobles heard bells chimes never left court, ministers scholars heard zither se sounds never left front, what nurtures conduct righteousness prevents licentious dissipation. Licentious dissipation born from no ritual, thus sages make people ears hear ya song sounds, eyes see awe-inspiring ritual forms, feet walk respectful appearances, mouths speak benevolent righteous ways. Thus gentleman all day speaks yet evil deviation has no way to enter.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}