{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "030",
    "url": "https://chinesenotes.com/shiji/shiji030.html",
    "title": {
      "zh": "平準書",
      "en": "Equalization",
      "raw": "《平準書》 Equalization"
    },
    "sentenceCount": 286,
    "translatedCount": 286,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:57:58.820Z",
    "translators": [
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 50,
        "sentences": 286
      }
    ],
    "citation": "Translation: Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "漢興，接秦之獘，丈夫從軍旅，老弱轉糧馕，作業劇而財匱，自天子不能具鈞駟，而將相或乘牛車，齊民無藏蓋。",
          "translations": [
            {
              "lang": "en",
              "text": "When Han arose, following Qin's exhaustion, men served in the military, the old and weak transported provisions, labor was intense and wealth scarce. Even the emperor could not provide matched horses for his carriage, while generals and chancellors sometimes rode ox-carts, and the common people had no stored wealth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "於是為秦錢重難用，更令民鑄錢，一黃金一斤，約法省禁。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore they changed Qin's heavy and difficult money, ordering the people to cast money, one jin of gold equaling one piece, establishing laws with simplified prohibitions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "而不軌逐利之民，蓄積餘業以稽市物，物踴騰糶，米至石萬錢，馬一匹則百金。",
          "translations": [
            {
              "lang": "en",
              "text": "But lawless profit-seeking people accumulated surplus goods to manipulate market prices, goods soared in price, rice reached ten thousand cash per shi, a horse cost one hundred jin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "When Han arose, following Qin's exhaustion, men served in the military, the old and weak transported provisions, labor was intense and wealth scarce. Even the emperor could not provide matched horses for his carriage, while generals and chancellors sometimes rode ox-carts, and the common people had no stored wealth. Therefore they changed Qin's heavy and difficult money, ordering the people to cast money, one jin of gold equaling one piece, establishing laws with simplified prohibitions. But lawless profit-seeking people accumulated surplus goods to manipulate market prices, goods soared in price, rice reached ten thousand cash per shi, a horse cost one hundred jin.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "天下已平，高祖乃令賈人不得衣絲乘車，重租稅以困辱之。",
          "translations": [
            {
              "lang": "en",
              "text": "When the realm was pacified, Gaozu ordered merchants not to wear silk or ride carriages, heavily taxing them to distress and humiliate them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "孝惠、高后時，為天下初定，復弛商賈之律，然市井之子孫亦不得仕宦為吏。",
          "translations": [
            {
              "lang": "en",
              "text": "During Emperor Hui and Empress Dowager Gao's time, as the realm was initially settled, they relaxed the laws against merchants and traders, but market children and descendants also could not serve as officials or clerks.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "量吏祿，度官用，以賦於民。",
          "translations": [
            {
              "lang": "en",
              "text": "They measured officials' salaries, assessed government expenses, and levied taxes on the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "而山川園池市井租稅之入，自天子以至于封君湯沐邑，皆各為私奉養焉，不領於天下之經費。",
          "translations": [
            {
              "lang": "en",
              "text": "Mountain, river, garden, pool, and market tax revenues, from the emperor down to the enfeoffed lords' bathing cities, each maintained their own private support, not overseen by the realm's regular expenses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "漕轉山東粟，以給中都官，歲不過數十萬石。",
          "translations": [
            {
              "lang": "en",
              "text": "They transported Shandong grain to supply the capital officials, yearly not exceeding several tens of thousands of shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "When the realm was pacified, Gaozu ordered merchants not to wear silk or ride carriages, heavily taxing them to distress and humiliate them. During Emperor Hui and Empress Dowager Gao's time, as the realm was initially settled, they relaxed the laws against merchants and traders, but market children and descendants also could not serve as officials or clerks. They measured officials' salaries, assessed government expenses, and levied taxes on the people. Mountain, river, garden, pool, and market tax revenues, from the emperor down to the enfeoffed lords' bathing cities, each maintained their own private support, not overseen by the realm's regular expenses. They transported Shandong grain to supply the capital officials, yearly not exceeding several tens of thousands of shi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "至孝文時，莢錢益多，輕，乃更鑄四銖錢，其文為「半兩」，令民縱得自鑄錢。",
          "translations": [
            {
              "lang": "en",
              "text": "By Emperor Wen's time, Jia money increased greatly, becoming light, so they recast four zhu money, its inscription 'half liang', allowing people to freely cast money themselves.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "故吳諸侯也，以即山鑄錢，富埒天子，其後卒以叛逆。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore Wu, a feudal lord, by casting money at the mountains, became as rich as the emperor, afterward finally rebelled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "鄧通，大夫也，以鑄錢財過王者。",
          "translations": [
            {
              "lang": "en",
              "text": "Deng Tong, a grand master, became richer than kings through casting money.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "故吳、鄧氏錢布天下，而鑄錢之禁生焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore Wu and Deng money circulated throughout the realm, and money-casting prohibitions arose.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "By Emperor Wen's time, Jia money increased greatly, becoming light, so they recast four zhu money, its inscription 'half liang', allowing people to freely cast money themselves. Therefore Wu, a feudal lord, by casting money at the mountains, became as rich as the emperor, afterward finally rebelled. Deng Tong, a grand master, became richer than kings through casting money. Therefore Wu and Deng money circulated throughout the realm, and money-casting prohibitions arose.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "匈奴數侵盜北邊，屯戍者多，邊粟不足給食當食者。",
          "translations": [
            {
              "lang": "en",
              "text": "The Xiongnu frequently invaded and plundered the northern borders, garrison troops were many, border grain insufficient to supply those who should eat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "於是募民能輸及轉粟於邊者拜爵，爵得至大庶長。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore they recruited people who could transport and deliver grain to the borders to grant nobility titles, nobility reaching great commoner.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Xiongnu frequently invaded and plundered the northern borders, garrison troops were many, border grain insufficient to supply those who should eat. Therefore they recruited people who could transport and deliver grain to the borders to grant nobility titles, nobility reaching great commoner.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0015",
          "zh": "孝景時，上郡以西旱，亦復修賣爵令，而賤其價以招民；",
          "translations": [
            {
              "lang": "en",
              "text": "During Emperor Jing's time, Shangjun and west suffered drought, also revived the sell nobility order, reducing prices to attract people;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "及徒復作，得輸粟縣官以除罪。",
          "translations": [
            {
              "lang": "en",
              "text": "and those who migrated and worked could deliver grain to county officials to erase crimes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "益造苑馬以廣用，而宮室列觀輿馬益增修矣。",
          "translations": [
            {
              "lang": "en",
              "text": "They increasingly created park horses to expand use, while palace chambers and viewing towers, carriages and horses increased repairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "During Emperor Jing's time, Shangjun and west suffered drought, also revived the sell nobility order, reducing prices to attract people; and those who migrated and worked could deliver grain to county officials to erase crimes. They increasingly created park horses to expand use, while palace chambers and viewing towers, carriages and horses increased repairs.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "至今上即位數歲，漢興七十餘年之閒，國家無事，非遇水旱之災，民則人給家足，都鄙廩庾皆滿，而府庫餘貨財。",
          "translations": [
            {
              "lang": "en",
              "text": "Until the present emperor ascended the throne several years, in the seventy plus years since Han arose, the state had no affairs, not encountering water or drought disasters, people had sufficient households, cities and countryside granaries were all full, government treasuries had surplus goods and wealth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "京師之錢累巨萬，貫朽而不可校。",
          "translations": [
            {
              "lang": "en",
              "text": "Capital money accumulated in vast tens of thousands, strings rotted and could not be counted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "太倉之粟陳陳相因，充溢露積於外，至腐敗不可食。",
          "translations": [
            {
              "lang": "en",
              "text": "Great granary grain piled layer upon layer, overflowing and exposed outside, rotting until inedible.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "眾庶街巷有馬，阡陌之閒成群，而乘字牝者儐而不得聚會。",
          "translations": [
            {
              "lang": "en",
              "text": "Common people in streets and lanes had horses, on paths between fields in groups, those riding castrated horses could not gather.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "守閭閻者食粱肉，為吏者長子孫，居官者以為姓號。",
          "translations": [
            {
              "lang": "en",
              "text": "Gate guards ate fine grain and meat, officials' sons and grandsons grew up, those in office took it as clan names.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "故人人自愛而重犯法，先行義而後絀恥辱焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore people naturally cherished themselves and feared breaking laws, practiced righteousness before worrying about shame and disgrace.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "當此之時，網疏而民富，役財驕溢，或至兼并豪黨之徒，以武斷於鄉曲。",
          "translations": [
            {
              "lang": "en",
              "text": "During this time, the net was loose and people rich, wealth overflowed with arrogance, some even became powerful bullies who arbitrarily decided in villages.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "宗室有土公卿大夫以下，爭于奢侈，室廬輿服僭于上，無限度。",
          "translations": [
            {
              "lang": "en",
              "text": "Imperial clan members from dukes, ministers, grand masters downward competed in luxury, chambers, carriages, clothing exceeded superiors, without limits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "物盛而衰，固其變也。",
          "translations": [
            {
              "lang": "en",
              "text": "Things flourish then decline, naturally their change.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Until the present emperor ascended the throne several years, in the seventy plus years since Han arose, the state had no affairs, not encountering water or drought disasters, people had sufficient households, cities and countryside granaries were all full, government treasuries had surplus goods and wealth. Capital money accumulated in vast tens of thousands, strings rotted and could not be counted. Great granary grain piled layer upon layer, overflowing and exposed outside, rotting until inedible. Common people in streets and lanes had horses, on paths between fields in groups, those riding castrated horses could not gather. Gate guards ate fine grain and meat, officials' sons and grandsons grew up, those in office took it as clan names. Therefore people naturally cherished themselves and feared breaking laws, practiced righteousness before worrying about shame and disgrace. During this time, the net was loose and people rich, wealth overflowed with arrogance, some even became powerful bullies who arbitrarily decided in villages. Imperial clan members from dukes, ministers, grand masters downward competed in luxury, chambers, carriages, clothing exceeded superiors, without limits. Things flourish then decline, naturally their change.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0027",
          "zh": "自是之後，嚴助、朱買臣等招來東甌，事兩越，江淮之閒蕭然煩費矣。",
          "translations": [
            {
              "lang": "en",
              "text": "From this after, Yan Xu, Zhu Mai Chen and others summoned Dong Ou, handled two Yue affairs, Jiang Huai region became desolate and troubled with expenses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "唐蒙、司馬相如開路西南夷，鑿山通道千餘里，以廣巴蜀，巴蜀之民罷焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Tang Meng, Sima Xiangru opened roads to southwestern barbarians, chiseled mountains to open paths over a thousand li, to expand Ba Shu, Ba Shu people were exhausted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "彭吳賈滅朝鮮，置滄海之郡，則燕齊之閒靡然發動。",
          "translations": [
            {
              "lang": "en",
              "text": "Peng Wu Jia extinguished Chaoxian, established Cang Hai commandery, then Yan Qi region became active with mobilization.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "及王恢設謀馬邑，匈奴絕和親，侵擾北邊，兵連而不解，天下苦其勞，而干戈日滋。",
          "translations": [
            {
              "lang": "en",
              "text": "When Wang Hui devised the Mai Yi strategy, Xiongnu cut off friendly relations, invaded and disturbed northern borders, wars connected without resolution, the realm suffered their labor, weapons increased daily.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "行者齎，居者送，中外騷擾而相奉，百姓抏獘以巧法，財賂衰秏而不贍。",
          "translations": [
            {
              "lang": "en",
              "text": "Travelers carried provisions, residents sent off, inside and outside disturbed mutually supporting, people wearied to death using clever laws, bribes depleted without sufficiency.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "入物者補官，出貨者除罪，選舉陵遲，廉恥相冒，武力進用，法嚴令具。",
          "translations": [
            {
              "lang": "en",
              "text": "Those bringing goods supplemented officials, those giving wealth erased crimes, selection declined, integrity and shame deceived each other, military strength advanced in use, laws strict and orders complete.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "興利之臣自此始也。",
          "translations": [
            {
              "lang": "en",
              "text": "Profit-making ministers began from this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "From this after, Yan Xu, Zhu Mai Chen and others summoned Dong Ou, handled two Yue affairs, Jiang Huai region became desolate and troubled with expenses. Tang Meng, Sima Xiangru opened roads to southwestern barbarians, chiseled mountains to open paths over a thousand li, to expand Ba Shu, Ba Shu people were exhausted. Peng Wu Jia extinguished Chaoxian, established Cang Hai commandery, then Yan Qi region became active with mobilization. When Wang Hui devised the Mai Yi strategy, Xiongnu cut off friendly relations, invaded and disturbed northern borders, wars connected without resolution, the realm suffered their labor, weapons increased daily. Travelers carried provisions, residents sent off, inside and outside disturbed mutually supporting, people wearied to death using clever laws, bribes depleted without sufficiency. Those bringing goods supplemented officials, those giving wealth erased crimes, selection declined, integrity and shame deceived each other, military strength advanced in use, laws strict and orders complete. Profit-making ministers began from this.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "其後漢將歲以數萬騎出擊胡，及車騎將軍衛青取匈奴河南地，筑朔方。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterward Han generals yearly went out with tens of thousands of cavalry to attack Hu, and chariot cavalry general Wei Qing took Xiongnu Henan land, built Shuofang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "當是時，漢通西南夷道，作者數萬人，千里負擔饋糧，率十餘鐘致一石，散幣於邛僰以集之。",
          "translations": [
            {
              "lang": "en",
              "text": "During this time, Han opened southwestern barbarian roads, workers tens of thousands, thousand li carrying burdens feeding grain, rate over ten zhong delivered one shi, scattered currency among Qiong Bo to gather them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "數歲道不通，蠻夷因以數攻，吏發兵誅之。",
          "translations": [
            {
              "lang": "en",
              "text": "Several years road not passable, barbarians then frequently attacked, officials sent troops to punish them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "悉巴蜀租賦不足以更之，乃募豪民田南夷，入粟縣官，而內受錢於都內。",
          "translations": [
            {
              "lang": "en",
              "text": "All Ba Shu taxes insufficient to replace them, so recruited rich people to farm southern barbarians, deliver grain to county officials, while receiving money from capital internally.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "東至滄海之郡，人徒之費擬於南夷。",
          "translations": [
            {
              "lang": "en",
              "text": "East to Cang Hai commandery, people transport expenses compared to southern barbarians.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "又興十萬餘人筑衛朔方，轉漕甚遼遠，自山東咸被其勞，費數十百巨萬，府庫益虛。",
          "translations": [
            {
              "lang": "en",
              "text": "Also raised over one hundred thousand to build guard Shuofang, transport very distant, from Shandong all suffered their labor, expenses tens to hundreds of vast millions, treasuries increasingly empty.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "乃募民能入奴婢得以終身復，為郎增秩，及入羊為郎，始於此。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore recruited people who could enter slave girls to get lifelong exemption, for gentleman increased rank, and entering sheep for gentleman, began from this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Afterward Han generals yearly went out with tens of thousands of cavalry to attack Hu, and chariot cavalry general Wei Qing took Xiongnu Henan land, built Shuofang. During this time, Han opened southwestern barbarian roads, workers tens of thousands, thousand li carrying burdens feeding grain, rate over ten zhong delivered one shi, scattered currency among Qiong Bo to gather them. Several years road not passable, barbarians then frequently attacked, officials sent troops to punish them. All Ba Shu taxes insufficient to replace them, so recruited rich people to farm southern barbarians, deliver grain to county officials, while receiving money from capital internally. East to Cang Hai commandery, people transport expenses compared to southern barbarians. Also raised over one hundred thousand to build guard Shuofang, transport very distant, from Shandong all suffered their labor, expenses tens to hundreds of vast millions, treasuries increasingly empty. Therefore recruited people who could enter slave girls to get lifelong exemption, for gentleman increased rank, and entering sheep for gentleman, began from this.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "其後四年，而漢遣大將將六將軍，軍十餘萬，擊右賢王，獲首虜萬五千級。",
          "translations": [
            {
              "lang": "en",
              "text": "After four years, Han sent great general leading six generals, army over one hundred thousand, attacked Right Wise King, captured heads and captives fifteen thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "明年，大將軍將六將軍仍再出擊胡，得首虜萬九千級。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, great general led six generals again went out to attack Hu, got heads and captives nineteen thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "捕斬首虜之士受賜黃金二十餘萬斤，虜數萬人皆得厚賞，衣食仰給縣官；",
          "translations": [
            {
              "lang": "en",
              "text": "Soldiers who captured and beheaded received reward gold over twenty thousand jin, tens of thousands captives all got rich rewards, clothing and food dependent on county officials;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "而漢軍之士馬死者十餘萬，兵甲之財轉漕之費不與焉。",
          "translations": [
            {
              "lang": "en",
              "text": "while Han army soldiers and horses dead over one hundred thousand, weapons and armor property transport expenses not included.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "於是大農陳藏錢經秏，賦稅既竭，猶不足以奉戰士。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore great agronomist Chen Cang money exhausted, taxes already depleted, still insufficient to support warriors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "有司言：「天子曰『朕聞五帝之教不相復而治，禹湯之法不同道而王，所由殊路，而建德一也。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said: 'The emperor said 'I heard the five emperors' teachings not repeated but governed, Yu and Tang's methods different paths but became kings, origins different roads, but establishing virtue one.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "北邊未安，朕甚悼之。",
          "translations": [
            {
              "lang": "en",
              "text": "Northern border not peaceful, I greatly lament it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "日者，大將軍攻匈奴，斬首虜萬九千級，留蹛無所食。",
          "translations": [
            {
              "lang": "en",
              "text": "Recently, great general attacked Xiongnu, beheaded captives nineteen thousand, remaining captives no food to eat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "議令民得買爵及贖禁錮免減罪』。",
          "translations": [
            {
              "lang": "en",
              "text": "Discuss ordering people to buy nobility and redeem forbidden imprisoned reduce crimes.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "請置賞官，命曰武功爵。",
          "translations": [
            {
              "lang": "en",
              "text": "Please establish reward officials, named martial merit nobility.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "級十七萬，凡直三十餘萬金。",
          "translations": [
            {
              "lang": "en",
              "text": "Seventeen levels, altogether worth over thirty thousand jin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "諸買武功爵官首者試補吏，先除；",
          "translations": [
            {
              "lang": "en",
              "text": "Those who buy martial merit nobility official heads may try to supplement clerks, first removed;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "千夫如五大夫；",
          "translations": [
            {
              "lang": "en",
              "text": "thousand man like five great men;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "其有罪又減二等；",
          "translations": [
            {
              "lang": "en",
              "text": "those with crimes again reduce two grades;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "爵得至樂卿：以顯軍功。」",
          "translations": [
            {
              "lang": "en",
              "text": "nobility reaches music minister: to display military merit.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "軍功多用越等，大者封侯卿大夫，小者郎吏。",
          "translations": [
            {
              "lang": "en",
              "text": "Military merit much used skipping grades, great ones enfeoffed as marquises ministers grand masters, small ones gentlemen officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "吏道雜而多端，則官職秏廢。",
          "translations": [
            {
              "lang": "en",
              "text": "Official path mixed and many branches, then official positions wasted and abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After four years, Han sent great general leading six generals, army over one hundred thousand, attacked Right Wise King, captured heads and captives fifteen thousand. Next year, great general led six generals again went out to attack Hu, got heads and captives nineteen thousand. Soldiers who captured and beheaded received reward gold over twenty thousand jin, tens of thousands captives all got rich rewards, clothing and food dependent on county officials; while Han army soldiers and horses dead over one hundred thousand, weapons and armor property transport expenses not included. Therefore great agronomist Chen Cang money exhausted, taxes already depleted, still insufficient to support warriors. Officials said: 'The emperor said 'I heard the five emperors' teachings not repeated but governed, Yu and Tang's methods different paths but became kings, origins different roads, but establishing virtue one.' Northern border not peaceful, I greatly lament it. Recently, great general attacked Xiongnu, beheaded captives nineteen thousand, remaining captives no food to eat. Discuss ordering people to buy nobility and redeem forbidden imprisoned reduce crimes.' Please establish reward officials, named martial merit nobility. Seventeen levels, altogether worth over thirty thousand jin. Those who buy martial merit nobility official heads may try to supplement clerks, first removed; thousand man like five great men; those with crimes again reduce two grades; nobility reaches music minister: to display military merit.' Military merit much used skipping grades, great ones enfeoffed as marquises ministers grand masters, small ones gentlemen officials. Official path mixed and many branches, then official positions wasted and abolished.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0058",
          "zh": "自公孫弘以春秋之義繩臣下取漢相，張湯用唆文決理為廷尉，於是見知之法生，而廢格沮誹窮治之獄用矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Since Gongsun Hong used Spring and Autumn principles to bind subjects becoming Han chancellor, Zhang Tang used harsh writing to decide cases as court judge, then the knowing law arose, and blocking hindering slandering thorough investigation prisons used.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "其明年，淮南、衡山、江都王謀反跡見，而公卿尋端治之，竟其黨與，而坐死者數萬人，長吏益慘急而法令明察。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, Huainan, Hengshan, Jiangdu kings rebellion traces appeared, ministers and nobles sought origins to govern them, exhausted their parties and accomplices, those sentenced to death several tens of thousands, senior officials increasingly cruel urgent and laws clear discerning.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Since Gongsun Hong used Spring and Autumn principles to bind subjects becoming Han chancellor, Zhang Tang used harsh writing to decide cases as court judge, then the knowing law arose, and blocking hindering slandering thorough investigation prisons used. Next year, Huainan, Hengshan, Jiangdu kings rebellion traces appeared, ministers and nobles sought origins to govern them, exhausted their parties and accomplices, those sentenced to death several tens of thousands, senior officials increasingly cruel urgent and laws clear discerning.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "當是之時，招尊方正賢良文學之士，或至公卿大夫。",
          "translations": [
            {
              "lang": "en",
              "text": "During this time, they honored upright, good, worthy, excellent literature scholars, some reaching ministers and grand masters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "公孫弘以漢相，布被，食不重味，為天下先。",
          "translations": [
            {
              "lang": "en",
              "text": "Gongsun Hong as Han chancellor, cloth quilt, did not eat repeated flavors, was first in the realm.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "然無益於俗，稍騖於功利矣。",
          "translations": [
            {
              "lang": "en",
              "text": "But no benefit to customs, gradually moved toward profit and benefit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "During this time, they honored upright, good, worthy, excellent literature scholars, some reaching ministers and grand masters. Gongsun Hong as Han chancellor, cloth quilt, did not eat repeated flavors, was first in the realm. But no benefit to customs, gradually moved toward profit and benefit.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "其明年，驃騎仍再出擊胡，獲首四萬。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, cavalry general again went out to attack Hu, captured heads forty thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "其秋，渾邪王率數萬之眾來降，於是漢發車二萬乘迎之。",
          "translations": [
            {
              "lang": "en",
              "text": "That autumn, Hunye King led tens of thousands to surrender, Han sent two thousand carriages to welcome them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "既至，受賞，賜及有功之士。",
          "translations": [
            {
              "lang": "en",
              "text": "When arrived, received rewards, granted to meritorious soldiers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "是歲費凡百餘巨萬。",
          "translations": [
            {
              "lang": "en",
              "text": "This year expenses altogether over one hundred vast millions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, cavalry general again went out to attack Hu, captured heads forty thousand. That autumn, Hunye King led tens of thousands to surrender, Han sent two thousand carriages to welcome them. When arrived, received rewards, granted to meritorious soldiers. This year expenses altogether over one hundred vast millions.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "初，先是往十餘歲河決觀，梁楚之地固已數困，而緣河之郡隄塞河，輒決壞，費不可勝計。",
          "translations": [
            {
              "lang": "en",
              "text": "Initially, previously over ten years ago Yellow River breached Guan, Liang Chu lands already repeatedly troubled, while Yellow River border commanderies built dikes to block river, frequently breached and ruined, expenses countless.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "其後番系欲省底柱之漕，穿汾、河渠以為溉田，作者數萬人；",
          "translations": [
            {
              "lang": "en",
              "text": "Afterward Fan Xi wished to save Dizhu transport, dug Fen, Yellow River canal for irrigation fields, workers tens of thousands;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "鄭當時為渭漕渠回遠，鑿直渠自長安至華陰，作者數萬人；",
          "translations": [
            {
              "lang": "en",
              "text": "Zheng Dang Shi for Wei transport canal winding far, chiseled straight canal from Chang'an to Huayin, workers tens of thousands;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "朔方亦穿渠，作者數萬人：各歷二三期，功未就，費亦各巨萬十數。",
          "translations": [
            {
              "lang": "en",
              "text": "Shuofang also dug canal, workers tens of thousands: each took two three periods, work not completed, expenses also each vast millions tens.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Initially, previously over ten years ago Yellow River breached Guan, Liang Chu lands already repeatedly troubled, while Yellow River border commanderies built dikes to block river, frequently breached and ruined, expenses countless. Afterward Fan Xi wished to save Dizhu transport, dug Fen, Yellow River canal for irrigation fields, workers tens of thousands; Zheng Dang Shi for Wei transport canal winding far, chiseled straight canal from Chang'an to Huayin, workers tens of thousands; Shuofang also dug canal, workers tens of thousands: each took two three periods, work not completed, expenses also each vast millions tens.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "天子為伐胡，盛養馬，馬之來食長安者數萬匹，卒牽掌者關中不足，乃調旁近郡。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor for attacking Hu, abundantly raised horses, horses coming to eat in Chang'an tens of thousands, soldiers leading holding insufficient in Guanzhong, then transferred nearby commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "而胡降者皆衣食縣官，縣官不給，天子乃損膳，解乘輿駟，出御府禁藏以贍之。",
          "translations": [
            {
              "lang": "en",
              "text": "Hu surrenders all clothed fed by county officials, county officials not sufficient, emperor then reduced meals, released carriage horses, took imperial storehouse forbidden treasures to support them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor for attacking Hu, abundantly raised horses, horses coming to eat in Chang'an tens of thousands, soldiers leading holding insufficient in Guanzhong, then transferred nearby commanderies. Hu surrenders all clothed fed by county officials, county officials not sufficient, emperor then reduced meals, released carriage horses, took imperial storehouse forbidden treasures to support them.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "其明年，山東被水菑，民多饑乏，於是天子遣使者虛郡國倉廥以振貧民。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, Shandong suffered water disasters, people many hungry lacking, emperor sent envoys to empty commandery kingdom granaries to relieve poor people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "猶不足，又募豪富人相貸假。",
          "translations": [
            {
              "lang": "en",
              "text": "Still insufficient, also recruited rich powerful people to lend to each other.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "尚不能相救，乃徙貧民於關以西，及充朔方以南新秦中，七十餘萬口，衣食皆仰給縣官。",
          "translations": [
            {
              "lang": "en",
              "text": "Still could not mutually save, then moved poor people to passes west, and filled Shuofang south new Qinzhong, seventy plus thousand mouths, clothing food all dependent on county officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "數歲，假予產業，使者分部護之，冠蓋相望。",
          "translations": [
            {
              "lang": "en",
              "text": "Several years, loaned property, envoys divided areas to protect them, official carriages mutually visible.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "其費以億計，不可勝數。",
          "translations": [
            {
              "lang": "en",
              "text": "Expenses counted in hundreds of millions, countless.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "於是縣官大空。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore county officials greatly empty.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, Shandong suffered water disasters, people many hungry lacking, emperor sent envoys to empty commandery kingdom granaries to relieve poor people. Still insufficient, also recruited rich powerful people to lend to each other. Still could not mutually save, then moved poor people to passes west, and filled Shuofang south new Qinzhong, seventy plus thousand mouths, clothing food all dependent on county officials. Several years, loaned property, envoys divided areas to protect them, official carriages mutually visible. Expenses counted in hundreds of millions, countless. Therefore county officials greatly empty.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "而富商大賈或蹛財役貧，轉轂百數，廢居居邑，封君皆低首仰給。",
          "translations": [
            {
              "lang": "en",
              "text": "Rich merchants and great traders sometimes hoarded wealth to exploit poor, circulated hundreds of carriages, abandoned residences in cities, enfeoffed lords all bowed heads dependent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "冶鑄煮鹽，財或累萬金，而不佐國家之急，黎民重困。",
          "translations": [
            {
              "lang": "en",
              "text": "Smelting casting boiling salt, wealth sometimes accumulated ten thousand jin, but not aided state's emergencies, common people heavily troubled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "於是天子與公卿議，更錢造幣以贍用，而摧浮淫并兼之徒。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor with ministers discussed, change money make currency to support expenses, and break floating extravagant monopoly followers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "是時禁苑有白鹿而少府多銀錫。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time forbidden park had white deer and lesser treasury had much silver tin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "自孝文更造四銖錢，至是歲四十餘年，從建元以來，用少，縣官往往即多銅山而鑄錢，民亦閒盜鑄錢，不可勝數。",
          "translations": [
            {
              "lang": "en",
              "text": "Since Emperor Wen recast four zhu money, to this year over forty years, from Jian Yuan since, used little, county officials often took many copper mountains to cast money, people also secretly stole cast money, countless.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "錢益多而輕，物益少而貴。",
          "translations": [
            {
              "lang": "en",
              "text": "Money increasingly many and light, goods increasingly few and expensive.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "有司言曰：「古者皮幣，諸侯以聘享。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said: 'Ancient leather currency, feudal lords used for visits and offerings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "金有三等，黃金為上，白金為中，赤金為下。",
          "translations": [
            {
              "lang": "en",
              "text": "Gold has three grades, yellow gold upper, white gold middle, red gold lower.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "今半兩錢法重四銖，而姦或盜摩錢裏取鋊，錢益輕薄而物貴，則遠方用幣煩費不省。」",
          "translations": [
            {
              "lang": "en",
              "text": "Now half liang money law heavy four zhu, but evil sometimes steal grind money inside take filings, money increasingly light thin and goods expensive, then distant places using currency troublesome expensive not saving.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "乃以白鹿皮方尺，緣以藻繢，為皮幣，直四十萬。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore used white deer skin one square foot, edged with algae embroidery, as leather currency, worth forty thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "王侯宗室朝覲聘享，必以皮幣薦璧，然後得行。",
          "translations": [
            {
              "lang": "en",
              "text": "Kings marquises imperial clan morning audiences visit offerings, must use leather currency present jade, then could proceed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Rich merchants and great traders sometimes hoarded wealth to exploit poor, circulated hundreds of carriages, abandoned residences in cities, enfeoffed lords all bowed heads dependent. Smelting casting boiling salt, wealth sometimes accumulated ten thousand jin, but not aided state's emergencies, common people heavily troubled. Therefore emperor with ministers discussed, change money make currency to support expenses, and break floating extravagant monopoly followers. At this time forbidden park had white deer and lesser treasury had much silver tin. Since Emperor Wen recast four zhu money, to this year over forty years, from Jian Yuan since, used little, county officials often took many copper mountains to cast money, people also secretly stole cast money, countless. Money increasingly many and light, goods increasingly few and expensive. Officials said: 'Ancient leather currency, feudal lords used for visits and offerings. Gold has three grades, yellow gold upper, white gold middle, red gold lower. Now half liang money law heavy four zhu, but evil sometimes steal grind money inside take filings, money increasingly light thin and goods expensive, then distant places using currency troublesome expensive not saving.' Therefore used white deer skin one square foot, edged with algae embroidery, as leather currency, worth forty thousand. Kings marquises imperial clan morning audiences visit offerings, must use leather currency present jade, then could proceed.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "又造銀錫為白金。",
          "translations": [
            {
              "lang": "en",
              "text": "Also made silver tin as white gold.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "以為天用莫如龍，地用莫如馬，人用莫如龜，故白金三品：其一曰重八兩，圜之，其文龍，名曰「白選」，直三千；",
          "translations": [
            {
              "lang": "en",
              "text": "Considering heaven use nothing like dragon, earth use nothing like horse, person use nothing like turtle, therefore white gold three grades: first said heavy eight liang, round it, its pattern dragon, named 'white selection', worth three thousand;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "二曰以重差小，方之，其文馬，直五百；",
          "translations": [
            {
              "lang": "en",
              "text": "second with weight somewhat small, square it, its pattern horse, worth five hundred;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "三曰復小，撱之，其文龜，直三百。",
          "translations": [
            {
              "lang": "en",
              "text": "third again small, oval it, its pattern turtle, worth three hundred.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "令縣官銷半兩錢，更鑄三銖錢，文如其重。",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered county officials melt half liang money, recast three zhu money, inscription like its weight.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "盜鑄諸金錢罪皆死，而吏民之盜鑄白金者不可勝數。",
          "translations": [
            {
              "lang": "en",
              "text": "Stealing casting various gold money crimes all death, but officials people's stealing casting white gold countless.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Also made silver tin as white gold. Considering heaven use nothing like dragon, earth use nothing like horse, person use nothing like turtle, therefore white gold three grades: first said heavy eight liang, round it, its pattern dragon, named 'white selection', worth three thousand; second with weight somewhat small, square it, its pattern horse, worth five hundred; third again small, oval it, its pattern turtle, worth three hundred. Ordered county officials melt half liang money, recast three zhu money, inscription like its weight. Stealing casting various gold money crimes all death, but officials people's stealing casting white gold countless.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0096",
          "zh": "於是以東郭咸陽、孔僅為大農丞，領鹽鐵事；",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore appointed Dong Guo Xian Yang, Kong Jin as great agronomist vice, overseeing salt iron affairs;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "桑弘羊以計算用事，侍中。",
          "translations": [
            {
              "lang": "en",
              "text": "Sang Hong Yang with calculations managed affairs, attendant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "咸陽，齊之大煮鹽，孔僅，南陽大冶，皆致生累千金，故鄭當時進言之。",
          "translations": [
            {
              "lang": "en",
              "text": "Xian Yang, Qi's great salt boiler, Kong Jin, Nanyang great smelter, both achieved wealth accumulated thousand jin, therefore Zheng Dang Shi recommended them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "弘羊，雒陽賈人子，以心計，年十三侍中。",
          "translations": [
            {
              "lang": "en",
              "text": "Hong Yang, Luoyang merchant son, with mental calculation, age thirteen attendant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "故三人言利事析秋豪矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore these three spoke of profit matters splitting autumn hairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Therefore appointed Dong Guo Xian Yang, Kong Jin as great agronomist vice, overseeing salt iron affairs; Sang Hong Yang with calculations managed affairs, attendant. Xian Yang, Qi's great salt boiler, Kong Jin, Nanyang great smelter, both achieved wealth accumulated thousand jin, therefore Zheng Dang Shi recommended them. Hong Yang, Luoyang merchant son, with mental calculation, age thirteen attendant. Therefore these three spoke of profit matters splitting autumn hairs.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "法既益嚴，吏多廢免。",
          "translations": [
            {
              "lang": "en",
              "text": "Laws increasingly strict, officials many dismissed removed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "兵革數動，民多買復及五大夫，徵發之士益鮮。",
          "translations": [
            {
              "lang": "en",
              "text": "Weapons and armor frequently moved, people many bought exemption and five great men, conscripted soldiers increasingly few.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "於是除千夫五大夫為吏，不欲者出馬；",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore exempted thousand man five great men as officials, those not wanting paid horses;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "故吏皆（通）適令伐棘上林，作昆明池。",
          "translations": [
            {
              "lang": "en",
              "text": "old officials all suited orders to cut brambles in Shanglin, made Kunming Pool.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Laws increasingly strict, officials many dismissed removed. Weapons and armor frequently moved, people many bought exemption and five great men, conscripted soldiers increasingly few. Therefore exempted thousand man five great men as officials, those not wanting paid horses; old officials all suited orders to cut brambles in Shanglin, made Kunming Pool.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0105",
          "zh": "其明年，大將軍、驃騎大出擊胡，得首虜八九萬級，賞賜五十萬金，漢軍馬死者十餘萬匹，轉漕車甲之費不與焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, great general, cavalry general greatly went out to attack Hu, got heads captives eighty nine thousand, rewards fifty thousand jin, Han army horses dead over ten thousand, transport carriages armor expenses not included.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "是時財匱，戰士頗不得祿矣。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time wealth scarce, warriors considerably could not get salaries.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, great general, cavalry general greatly went out to attack Hu, got heads captives eighty nine thousand, rewards fifty thousand jin, Han army horses dead over ten thousand, transport carriages armor expenses not included. At this time wealth scarce, warriors considerably could not get salaries.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "有司言三銖錢輕，易姦詐，乃更請諸郡國鑄五銖錢，周郭其下，令不可磨取鋊焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Officials said three zhu money light, easy for evil fraud, then requested various commanderies kingdoms cast five zhu money, rimmed below it, made unable to grind take filings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Officials said three zhu money light, easy for evil fraud, then requested various commanderies kingdoms cast five zhu money, rimmed below it, made unable to grind take filings.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "大農上鹽鐵丞孔僅、咸陽言：「山海，天地之藏也，皆宜屬少府，陛下不私，以屬大農佐賦。",
          "translations": [
            {
              "lang": "en",
              "text": "Great agronomist memorialed salt iron vice Kong Jin, Xian Yang said: 'Mountains seas, heaven earth's stores, all should belong to lesser treasury, Your Majesty not private, gave to great agronomist to assist taxes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "願募民自給費，因官器作煮鹽，官與牢盆。",
          "translations": [
            {
              "lang": "en",
              "text": "Wish recruit people self provide expenses, use official tools to boil salt, officials give boiler basins.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "浮食奇民欲擅管山海之貨，以致富羨，役利細民。",
          "translations": [
            {
              "lang": "en",
              "text": "Floating eating strange people wish to monopolize mountains seas goods, to become rich and abundant, exploit benefit small people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "其沮事之議，不可勝聽。",
          "translations": [
            {
              "lang": "en",
              "text": "Their blocking affairs discussions, cannot all listen.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "敢私鑄鐵器煮鹽者，釱左趾，沒入其器物。",
          "translations": [
            {
              "lang": "en",
              "text": "Daring privately cast iron tools boil salt, brand left foot, confiscate their tools objects.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "郡不出鐵者，置小鐵官，便屬在所縣。」",
          "translations": [
            {
              "lang": "en",
              "text": "Commanderies not producing iron, establish small iron officials, convenient belonging to local counties.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "使孔僅、東郭咸陽乘傳舉行天下鹽鐵，作官府，除故鹽鐵家富者為吏。",
          "translations": [
            {
              "lang": "en",
              "text": "Sent Kong Jin, Dong Guo Xian Yang riding post to tour realm salt iron, made official offices, dismissed old salt iron rich as officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "吏道益雜，不選，而多賈人矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Official path increasingly mixed, not selected, many merchants.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Great agronomist memorialed salt iron vice Kong Jin, Xian Yang said: 'Mountains seas, heaven earth's stores, all should belong to lesser treasury, Your Majesty not private, gave to great agronomist to assist taxes. Wish recruit people self provide expenses, use official tools to boil salt, officials give boiler basins. Floating eating strange people wish to monopolize mountains seas goods, to become rich and abundant, exploit benefit small people. Their blocking affairs discussions, cannot all listen. Daring privately cast iron tools boil salt, brand left foot, confiscate their tools objects. Commanderies not producing iron, establish small iron officials, convenient belonging to local counties.' Sent Kong Jin, Dong Guo Xian Yang riding post to tour realm salt iron, made official offices, dismissed old salt iron rich as officials. Official path increasingly mixed, not selected, many merchants.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "商賈以幣之變，多積貨逐利。",
          "translations": [
            {
              "lang": "en",
              "text": "Merchants with currency changes, much accumulated goods pursued profit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "於是公卿言：「郡國頗被菑害，貧民無產業者，募徙廣饒之地。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore ministers said: 'Commanderies kingdoms rather suffered disasters, poor people without property, recruit move to broad fertile lands.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "陛下損膳省用，出禁錢以振元元，寬貸賦，而民不齊出於南畝，商賈滋眾。",
          "translations": [
            {
              "lang": "en",
              "text": "Your Majesty reduced meals saved use, took forbidden money to relieve the people, relaxed loans taxes, but people not equally went out to southern fields, merchants increasingly many.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "貧者畜積無有，皆仰縣官。",
          "translations": [
            {
              "lang": "en",
              "text": "Poor accumulated nothing, all dependent on county officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "異時算軺車賈人緡錢皆有差，請算如故。",
          "translations": [
            {
              "lang": "en",
              "text": "Different times taxed carriages merchants strings money all had differences, please tax as before.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "諸賈人末作貰貸賣買，居邑稽諸物，及商以取利者，雖無市籍，各以其物自占，率緡錢二千而一算。",
          "translations": [
            {
              "lang": "en",
              "text": "Various merchants retail borrowed lent bought sold, resided in cities hoarded various goods, merchants taking profit, though no market registration, each with their goods self declared, rate string money two thousand one tax.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "諸作有租及鑄，率緡錢四千一算。",
          "translations": [
            {
              "lang": "en",
              "text": "Various craftsmen rented and cast, rate string money four thousand one tax.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "非吏比者三老、北邊騎士，軺車以一算；",
          "translations": [
            {
              "lang": "en",
              "text": "Non-officials like three elders, northern border cavalry, carriages one tax;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "商賈人軺車二算；",
          "translations": [
            {
              "lang": "en",
              "text": "merchant carriages two taxes;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "船五丈以上一算。",
          "translations": [
            {
              "lang": "en",
              "text": "boats five zhang above one tax.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "匿不自占，占不悉，戍邊一歲，沒入緡錢。",
          "translations": [
            {
              "lang": "en",
              "text": "Concealed not self declared, declared not complete, garrison border one year, confiscate string money.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "有能告者，以其半畀之。",
          "translations": [
            {
              "lang": "en",
              "text": "Those able to report, give half to them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "賈人有市籍者，及其家屬，皆無得籍名田，以便農。",
          "translations": [
            {
              "lang": "en",
              "text": "Merchants with market registration, and their families, all cannot register named fields, to benefit farmers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "敢犯令，沒入田僮。」",
          "translations": [
            {
              "lang": "en",
              "text": "Daring violate order, confiscate fields slaves.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Merchants with currency changes, much accumulated goods pursued profit. Therefore ministers said: 'Commanderies kingdoms rather suffered disasters, poor people without property, recruit move to broad fertile lands. Your Majesty reduced meals saved use, took forbidden money to relieve the people, relaxed loans taxes, but people not equally went out to southern fields, merchants increasingly many. Poor accumulated nothing, all dependent on county officials. Different times taxed carriages merchants strings money all had differences, please tax as before. Various merchants retail borrowed lent bought sold, resided in cities hoarded various goods, merchants taking profit, though no market registration, each with their goods self declared, rate string money two thousand one tax. Various craftsmen rented and cast, rate string money four thousand one tax. Non-officials like three elders, northern border cavalry, carriages one tax; merchant carriages two taxes; boats five zhang above one tax. Concealed not self declared, declared not complete, garrison border one year, confiscate string money. Those able to report, give half to them. Merchants with market registration, and their families, all cannot register named fields, to benefit farmers. Daring violate order, confiscate fields slaves.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0131",
          "zh": "天子乃思卜式之言，召拜式為中郎，爵左庶長，賜田十頃，布告天下，使明知之。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor then thought of Bu Shi's words, summoned appointed Shi as central gentleman, nobility left commoner, granted ten qing fields, cloth announced realm, made clear known.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor then thought of Bu Shi's words, summoned appointed Shi as central gentleman, nobility left commoner, granted ten qing fields, cloth announced realm, made clear known.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0132",
          "zh": "初，卜式者，河南人也，以田畜為事。",
          "translations": [
            {
              "lang": "en",
              "text": "Initially, Bu Shi, Henan person, took farming livestock as occupation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "親死，式有少弟，弟壯，式脫身出分，獨取畜羊百餘，田宅財物盡予弟。",
          "translations": [
            {
              "lang": "en",
              "text": "Parents died, Shi had young brother, brother grown, Shi stripped body went out divided, alone took hundred plus sheep, fields houses wealth all gave to brother.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "式入山牧十餘歲，羊致千餘頭，買田宅。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi entered mountains pastured over ten years, sheep reached thousand plus heads, bought fields houses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "而其弟盡破其業，式輒復分予弟者數矣。",
          "translations": [
            {
              "lang": "en",
              "text": "His brother completely ruined his occupation, Shi then again divided gave to brother several times.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "是時漢方數使將擊匈奴，卜式上書，願輸家之半縣官助邊。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time Han just frequently sent generals to attack Xiongnu, Bu Shi memorialed, wished to deliver half his family to county officials aid border.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "天子使使問式：「欲官乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor sent envoy asked Shi: 'Wish official position?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "式曰：「臣少牧，不習仕宦，不願也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shi said: 'Minister young pastured, not practiced serving officials, not wish.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "使問曰：「家豈有冤，欲言事乎？」",
          "translations": [
            {
              "lang": "en",
              "text": "Envoy asked: 'Family perhaps has grievance, wish speak affairs?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "式曰：「臣生與人無分爭。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi said: 'Minister born with people no divided disputes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "式邑人貧者貸之，不善者教順之，所居人皆從式，式何故見冤於人！",
          "translations": [
            {
              "lang": "en",
              "text": "Shi city people poor lent to them, not good taught to follow, resided people all followed Shi, Shi why seen grievance by people!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "無所欲言也。」",
          "translations": [
            {
              "lang": "en",
              "text": "No wish to speak.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "使者曰：「茍如此，子何欲而然？」",
          "translations": [
            {
              "lang": "en",
              "text": "Envoy said: 'If so, why do this?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "式曰：「天子誅匈奴，愚以為賢者宜死節於邊，有財者宜輸委，如此而匈奴可滅也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shi said: 'Emperor punishes Xiongnu, foolish consider worthy should die section at border, having wealth should deliver property, thus Xiongnu can extinguish.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "使者具其言入以聞。",
          "translations": [
            {
              "lang": "en",
              "text": "Envoy complete his words entered to report.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "天子以語丞相弘。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor spoke to chancellor Hong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "弘曰：「此非人情。",
          "translations": [
            {
              "lang": "en",
              "text": "Hong said: 'This not human feeling.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "不軌之臣，不可以為化而亂法，願陛下勿許。」",
          "translations": [
            {
              "lang": "en",
              "text": "Unruly minister, cannot for transformation and disorder laws, wish Your Majesty not permit.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "於是上久不報式，數歲，乃罷式。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor long not replied Shi, several years, then dismissed Shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "式歸，復田牧。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi returned, again farmed pastured.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "歲餘，會軍數出，渾邪王等降，縣官費眾，倉府空。",
          "translations": [
            {
              "lang": "en",
              "text": "Year plus, met army frequently out, Hunye King etc. surrendered, county officials expenses many, storehouses empty.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "其明年，貧民大徙，皆仰給縣官，無以盡贍。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, poor people greatly moved, all dependent on county officials, no way to completely support.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "卜式持錢二十萬予河南守，以給徙民。",
          "translations": [
            {
              "lang": "en",
              "text": "Bu Shi held twenty thousand money gave to Henan governor, to supply moved people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "河南上富人助貧人者籍，天子見卜式名，識之，曰「是固前而欲輸其家半助邊」，乃賜式外繇四百人。",
          "translations": [
            {
              "lang": "en",
              "text": "Henan memorialed rich people helping poor registers, emperor saw Bu Shi name, recognized it, said 'this solid formerly wished to deliver half family aid border', then granted Shi outer labor four hundred people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "式又盡復予縣官。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi again completely returned to county officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "是時富豪皆爭匿財，唯式尤欲輸之助費。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time rich powerful all competed to hide wealth, only Shi especially wished to deliver to aid expenses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "天子於是以式終長者，故尊顯以風百姓。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor therefore took Shi as finally elder, honored displayed to encourage the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Initially, Bu Shi, Henan person, took farming livestock as occupation. Parents died, Shi had young brother, brother grown, Shi stripped body went out divided, alone took hundred plus sheep, fields houses wealth all gave to brother. Shi entered mountains pastured over ten years, sheep reached thousand plus heads, bought fields houses. His brother completely ruined his occupation, Shi then again divided gave to brother several times. At this time Han just frequently sent generals to attack Xiongnu, Bu Shi memorialed, wished to deliver half his family to county officials aid border. Emperor sent envoy asked Shi: 'Wish official position?' Shi said: 'Minister young pastured, not practiced serving officials, not wish.' Envoy asked: 'Family perhaps has grievance, wish speak affairs?' Shi said: 'Minister born with people no divided disputes. Shi city people poor lent to them, not good taught to follow, resided people all followed Shi, Shi why seen grievance by people! No wish to speak.' Envoy said: 'If so, why do this?' Shi said: 'Emperor punishes Xiongnu, foolish consider worthy should die section at border, having wealth should deliver property, thus Xiongnu can extinguish.' Envoy complete his words entered to report. Emperor spoke to chancellor Hong. Hong said: 'This not human feeling. Unruly minister, cannot for transformation and disorder laws, wish Your Majesty not permit.' Therefore emperor long not replied Shi, several years, then dismissed Shi. Shi returned, again farmed pastured. Year plus, met army frequently out, Hunye King etc. surrendered, county officials expenses many, storehouses empty. Next year, poor people greatly moved, all dependent on county officials, no way to completely support. Bu Shi held twenty thousand money gave to Henan governor, to supply moved people. Henan memorialed rich people helping poor registers, emperor saw Bu Shi name, recognized it, said 'this solid formerly wished to deliver half family aid border', then granted Shi outer labor four hundred people. Shi again completely returned to county officials. At this time rich powerful all competed to hide wealth, only Shi especially wished to deliver to aid expenses. Emperor therefore took Shi as finally elder, honored displayed to encourage the people.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0158",
          "zh": "初，式不願為郎。",
          "translations": [
            {
              "lang": "en",
              "text": "Initially, Shi not wish to be gentleman.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "上曰：「吾有羊上林中，欲令子牧之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor said: 'I have sheep in Shanglin, wish make you pasture them.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "式乃拜為郎，布衣屩而牧羊。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi then appointed as gentleman, cloth clothes straw sandals pastured sheep.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "歲餘，羊肥息。",
          "translations": [
            {
              "lang": "en",
              "text": "Year plus, sheep fat increased.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "上過見其羊，善之。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor passed saw his sheep, praised them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "式曰：「非獨羊也，治民亦猶是也。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi said: 'Not only sheep, governing people also like this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "以時起居；",
          "translations": [
            {
              "lang": "en",
              "text": "With timing rise rest;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "惡者輒斥去，毋令敗群。」",
          "translations": [
            {
              "lang": "en",
              "text": "bad then expel remove, not let ruin group.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "上以式為奇，拜為緱氏令試之，緱氏便之。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor took Shi as strange, appointed as Gou Shi magistrate tested him, Gou Shi benefited.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "遷為成皋令，將漕最。",
          "translations": [
            {
              "lang": "en",
              "text": "Promoted to Chenggao magistrate, transport most excellent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "上以為式樸忠，拜為齊王太傅。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor considered Shi simple loyal, appointed as Qi King great tutor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Initially, Shi not wish to be gentleman. Emperor said: 'I have sheep in Shanglin, wish make you pasture them.' Shi then appointed as gentleman, cloth clothes straw sandals pastured sheep. Year plus, sheep fat increased. Emperor passed saw his sheep, praised them. Shi said: 'Not only sheep, governing people also like this. With timing rise rest; bad then expel remove, not let ruin group.' Emperor took Shi as strange, appointed as Gou Shi magistrate tested him, Gou Shi benefited. Promoted to Chenggao magistrate, transport most excellent. Emperor considered Shi simple loyal, appointed as Qi King great tutor.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0169",
          "zh": "而孔僅之使天下鑄作器，三年中拜為大農，列於九卿。",
          "translations": [
            {
              "lang": "en",
              "text": "Kong Jin's sent realm to cast make utensils, three years appointed as great agronomist, ranked among nine ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "而桑弘羊為大農丞，筦諸會計事，稍稍置均輸以通貨物矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Sang Hong Yang as great agronomist vice, managed various accounting affairs, gradually established equal transport to circulate goods.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Kong Jin's sent realm to cast make utensils, three years appointed as great agronomist, ranked among nine ministers. Sang Hong Yang as great agronomist vice, managed various accounting affairs, gradually established equal transport to circulate goods.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0171",
          "zh": "始令吏得入穀補官，郎至六百石。",
          "translations": [
            {
              "lang": "en",
              "text": "Began ordered officials able enter grain supplement officials, gentlemen to six hundred shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Began ordered officials able enter grain supplement officials, gentlemen to six hundred shi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0172",
          "zh": "自造白金五銖錢後五歲，赦吏民之坐盜鑄金錢死者數十萬人。",
          "translations": [
            {
              "lang": "en",
              "text": "From making white gold five zhu money after five years, pardoned officials people sentenced stealing cast gold money death several tens of thousands.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "其不發覺相殺者，不可勝計。",
          "translations": [
            {
              "lang": "en",
              "text": "Those not discovered mutually killed, countless.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "赦自出者百餘萬人。",
          "translations": [
            {
              "lang": "en",
              "text": "Pardoned self coming out over one hundred thousand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "然不能半自出，天下大抵無慮皆鑄金錢矣。",
          "translations": [
            {
              "lang": "en",
              "text": "But could not half self come out, realm generally no worry all cast gold money.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "犯者眾，吏不能盡誅取，於是遣博士褚大、徐偃等分曹循行郡國，舉兼并之徒守相為（吏）［利］者。",
          "translations": [
            {
              "lang": "en",
              "text": "Violators many, officials could not exhaust punish take, sent doctor Chu Da, Xu Yan etc. divided groups tour commanderies kingdoms, raised monopoly followers governors officials taking profit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "而御史大夫張湯方隆貴用事，減宣、杜周等為中丞，義縱、尹齊、王溫舒等用慘急刻深為九卿，而直指夏蘭之屬始出矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Censor-in-chief Zhang Tang just honored used affairs, reduced Xuan, Du Zhou etc. as central vice, Yi Zong, Yin Qi, Wang Wen Shu etc. used cruel urgent harsh deep as nine ministers, direct finger Xia Lan etc. began emerge.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "From making white gold five zhu money after five years, pardoned officials people sentenced stealing cast gold money death several tens of thousands. Those not discovered mutually killed, countless. Pardoned self coming out over one hundred thousand. But could not half self come out, realm generally no worry all cast gold money. Violators many, officials could not exhaust punish take, sent doctor Chu Da, Xu Yan etc. divided groups tour commanderies kingdoms, raised monopoly followers governors officials taking profit. Censor-in-chief Zhang Tang just honored used affairs, reduced Xuan, Du Zhou etc. as central vice, Yi Zong, Yin Qi, Wang Wen Shu etc. used cruel urgent harsh deep as nine ministers, direct finger Xia Lan etc. began emerge.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0178",
          "zh": "而大農顏異誅。",
          "translations": [
            {
              "lang": "en",
              "text": "Great agronomist Yan Yi executed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "初，異為濟南亭長，以廉直稍遷至九卿。",
          "translations": [
            {
              "lang": "en",
              "text": "Initially, Yi as Jinan pavilion chief, with integrity straight gradually promoted to nine ministers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "上與張湯既造白鹿皮幣，問異。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor with Zhang Tang made white deer skin currency, asked Yi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "異曰：「今王侯朝賀以蒼璧，直數千，而其皮薦反四十萬，本末不相稱。」",
          "translations": [
            {
              "lang": "en",
              "text": "Yi said: 'Now kings marquises morning congratulations with blue jade, worth several thousand, their skin mats instead forty thousand, root tip not matching.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "天子不說。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor not pleased.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "張湯又與異有卻，及有人告異以它議，事下張湯治異。",
          "translations": [
            {
              "lang": "en",
              "text": "Zhang Tang moreover with Yi had grudge, when someone accused Yi with other discussions, matter sent Zhang Tang govern Yi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "異與客語，客語初令下有不便者，異不應，微反脣。",
          "translations": [
            {
              "lang": "en",
              "text": "Yi spoke with guest, guest spoke initial order down had inconvenient, Yi not respond, slightly curled lips.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "湯奏當異九卿見令不便，不入言而腹誹，論死。",
          "translations": [
            {
              "lang": "en",
              "text": "Tang memorialed should Yi nine ministers seeing order inconvenient, not enter speak but abdominal slander, sentenced death.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "自是之後，有腹誹之法（以此）［比］，而公卿大夫多諂諛取容矣。",
          "translations": [
            {
              "lang": "en",
              "text": "From this after, had abdominal slander law, ministers grand masters many flattered sought favor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Great agronomist Yan Yi executed. Initially, Yi as Jinan pavilion chief, with integrity straight gradually promoted to nine ministers. Emperor with Zhang Tang made white deer skin currency, asked Yi. Yi said: 'Now kings marquises morning congratulations with blue jade, worth several thousand, their skin mats instead forty thousand, root tip not matching.' Emperor not pleased. Zhang Tang moreover with Yi had grudge, when someone accused Yi with other discussions, matter sent Zhang Tang govern Yi. Yi spoke with guest, guest spoke initial order down had inconvenient, Yi not respond, slightly curled lips. Tang memorialed should Yi nine ministers seeing order inconvenient, not enter speak but abdominal slander, sentenced death. From this after, had abdominal slander law, ministers grand masters many flattered sought favor.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0187",
          "zh": "天子既下緡錢令而尊卜式，百姓終莫分財佐縣官，於是（楊可）告緡錢縱矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor having issued string money order and honored Bu Shi, people finally not divided wealth aided county officials, then Yang Ke informed string money released.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Emperor having issued string money order and honored Bu Shi, people finally not divided wealth aided county officials, then Yang Ke informed string money released.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0188",
          "zh": "郡國多姦鑄錢，錢多輕，而公卿請令京師鑄鐘官赤側，一當五，賦官用非赤側不得行。",
          "translations": [
            {
              "lang": "en",
              "text": "Commanderies kingdoms many evil cast money, money many light, ministers requested order capital cast bell official red side, one equal five, assigned official use not red side not able proceed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "白金稍賤，民不寶用，縣官以令禁之，無益。",
          "translations": [
            {
              "lang": "en",
              "text": "White gold gradually cheap, people not treasured used, county officials with orders prohibited, no benefit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "歲餘，白金終廢不行。",
          "translations": [
            {
              "lang": "en",
              "text": "Year plus, white gold finally abolished not proceeded.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Commanderies kingdoms many evil cast money, money many light, ministers requested order capital cast bell official red side, one equal five, assigned official use not red side not able proceed. White gold gradually cheap, people not treasured used, county officials with orders prohibited, no benefit. Year plus, white gold finally abolished not proceeded.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0191",
          "zh": "是歲也，張湯死而民不思。",
          "translations": [
            {
              "lang": "en",
              "text": "This year, Zhang Tang died but people not thought of him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "This year, Zhang Tang died but people not thought of him.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0192",
          "zh": "其後二歲，赤側錢賤，民巧法用之，不便，又廢。",
          "translations": [
            {
              "lang": "en",
              "text": "After two years, red side money cheap, people clever law used it, inconvenient, again abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "於是悉禁郡國無鑄錢，專令上林三官鑄。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore completely prohibited commanderies kingdoms no cast money, specially ordered Shanglin three officials cast.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "錢既多，而令天下非三官錢不得行，諸郡國所前鑄錢皆廢銷之，輸其銅三官。",
          "translations": [
            {
              "lang": "en",
              "text": "Money already many, ordered realm not three officials money not able proceed, various commanderies kingdoms previous cast money all abolished melted, transported their copper to three officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "而民之鑄錢益少，計其費不能相當，唯真工大姦乃盜為之。",
          "translations": [
            {
              "lang": "en",
              "text": "People casting money increasingly few, calculated expenses could not match, only true craftsmen great evil then stole made it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "After two years, red side money cheap, people clever law used it, inconvenient, again abolished. Therefore completely prohibited commanderies kingdoms no cast money, specially ordered Shanglin three officials cast. Money already many, ordered realm not three officials money not able proceed, various commanderies kingdoms previous cast money all abolished melted, transported their copper to three officials. People casting money increasingly few, calculated expenses could not match, only true craftsmen great evil then stole made it.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0196",
          "zh": "卜式相齊，而楊可告緡遍天下，中家以上大抵皆遇告。",
          "translations": [
            {
              "lang": "en",
              "text": "Bu Shi chancellor Qi, Yang Ke informed string money throughout realm, middle families above generally all encountered information.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "杜周治之，獄少反者。",
          "translations": [
            {
              "lang": "en",
              "text": "Du Zhou governed them, prisons few reversed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "乃分遣御史廷尉正監分曹往，即治郡國緡錢，得民財物以億計，奴婢以千萬數，田大縣數百頃，小縣百餘頃，宅亦如之。",
          "translations": [
            {
              "lang": "en",
              "text": "Then divided sent censor court judge supervisors divided groups went, immediately governed commanderies kingdoms string money, got people wealth goods counted in hundreds of millions, slaves girls thousand million number, fields large counties several hundred qing, small counties hundred plus qing, residences also like.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "於是商賈中家以上大率破，民偷甘食好衣，不事畜藏之產業，而縣官有鹽鐵緡錢之故，用益饒矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore merchants middle families above generally broke, people secretly sweet food good clothing, not engaged in storing wealth property, county officials from salt iron string money reason, use increasingly abundant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Bu Shi chancellor Qi, Yang Ke informed string money throughout realm, middle families above generally all encountered information. Du Zhou governed them, prisons few reversed. Then divided sent censor court judge supervisors divided groups went, immediately governed commanderies kingdoms string money, got people wealth goods counted in hundreds of millions, slaves girls thousand million number, fields large counties several hundred qing, small counties hundred plus qing, residences also like. Therefore merchants middle families above generally broke, people secretly sweet food good clothing, not engaged in storing wealth property, county officials from salt iron string money reason, use increasingly abundant.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0200",
          "zh": "益廣關，置左右輔。",
          "translations": [
            {
              "lang": "en",
              "text": "Additionally widened passes, established left right auxiliaries.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Additionally widened passes, established left right auxiliaries.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0201",
          "zh": "初，大農筦鹽鐵官布多，置水衡，欲以主鹽鐵；",
          "translations": [
            {
              "lang": "en",
              "text": "Initially, great agronomist managed salt iron officials spread many, established water balance, wished to oversee salt iron;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "及楊可告緡錢，上林財物眾，乃令水衡主上林。",
          "translations": [
            {
              "lang": "en",
              "text": "when Yang Ke informed string money, Shanglin wealth goods many, ordered water balance oversee Shanglin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "上林既充滿，益廣。",
          "translations": [
            {
              "lang": "en",
              "text": "Shanglin already full, additionally widened.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "是時越欲與漢用船戰逐，乃大修昆明池，列觀環之。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time Yue wished with Han use ships battle pursue, greatly repaired Kunming Pool, viewing towers surrounded it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "治樓船，高十餘丈，旗幟加其上，甚壯。",
          "translations": [
            {
              "lang": "en",
              "text": "Made tower ships, high ten plus zhang, banners flags added above, very grand.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "於是天子感之，乃作柏梁臺，高數十丈。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor moved by it, made Bai Liang Terrace, high several tens zhang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "宮室之修，由此日麗。",
          "translations": [
            {
              "lang": "en",
              "text": "Palace chambers repair, from this daily beautiful.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Initially, great agronomist managed salt iron officials spread many, established water balance, wished to oversee salt iron; when Yang Ke informed string money, Shanglin wealth goods many, ordered water balance oversee Shanglin. Shanglin already full, additionally widened. At this time Yue wished with Han use ships battle pursue, greatly repaired Kunming Pool, viewing towers surrounded it. Made tower ships, high ten plus zhang, banners flags added above, very grand. Therefore emperor moved by it, made Bai Liang Terrace, high several tens zhang. Palace chambers repair, from this daily beautiful.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0208",
          "zh": "乃分緡錢諸官，而水衡、少府、大農、太仆各置農官，往往即郡縣比沒入田田之。",
          "translations": [
            {
              "lang": "en",
              "text": "Then divided string money various officials, water balance, lesser treasury, great agronomist, great stable each established farm officials, often near commanderies counties seized entered fields field them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "其沒入奴婢，分諸苑養狗馬禽獸，及與諸官。",
          "translations": [
            {
              "lang": "en",
              "text": "Their confiscated slaves girls, divided various parks raise dogs horses birds beasts, and with various officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "諸官益雜置多，徒奴婢眾，而下河漕度四百萬石，及官自糴乃足。",
          "translations": [
            {
              "lang": "en",
              "text": "Various officials increasingly mixed established many, convict slaves girls many, lower river transport passed four million shi, officials self bought then sufficient.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Then divided string money various officials, water balance, lesser treasury, great agronomist, great stable each established farm officials, often near commanderies counties seized entered fields field them. Their confiscated slaves girls, divided various parks raise dogs horses birds beasts, and with various officials. Various officials increasingly mixed established many, convict slaves girls many, lower river transport passed four million shi, officials self bought then sufficient.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0211",
          "zh": "所忠言：「世家子弟富人或鬬雞走狗馬，弋獵博戲，亂齊民。」",
          "translations": [
            {
              "lang": "en",
              "text": "Shou Zhong said: 'World families sons rich people or fight chickens run dogs horses, hawk hunt gamble play, disorder proper people.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "乃徵諸犯令，相引數千人，命曰「株送徒」。",
          "translations": [
            {
              "lang": "en",
              "text": "Then conscripted various violators order, mutually implicated several thousand, named 'root send convicts'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "入財者得補郎，郎選衰矣。",
          "translations": [
            {
              "lang": "en",
              "text": "Entering wealth got supplement gentlemen, gentlemen selection declined.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Shou Zhong said: 'World families sons rich people or fight chickens run dogs horses, hawk hunt gamble play, disorder proper people.' Then conscripted various violators order, mutually implicated several thousand, named 'root send convicts'. Entering wealth got supplement gentlemen, gentlemen selection declined.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0214",
          "zh": "是時山東被河菑，及歲不登數年，人或相食，方一二千里。",
          "translations": [
            {
              "lang": "en",
              "text": "At this time Shandong suffered river disasters, years not bountiful several years, people mutually ate each other, side one two thousand li.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "天子憐之，詔曰：「江南火耕水耨，令饑民得流就食江淮閒，欲留，留處。」",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor pitied them, edict: 'Jiangnan fire farm water weed, order famine people able flow go eat between Yangtze Huai, wish stay, stay place.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "遣使冠蓋相屬於道，護之，下巴蜀粟以振之。",
          "translations": [
            {
              "lang": "en",
              "text": "Sent envoys official carriages mutually connected on road, protected them, sent down Ba Shu grain to relieve them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "At this time Shandong suffered river disasters, years not bountiful several years, people mutually ate each other, side one two thousand li. Emperor pitied them, edict: 'Jiangnan fire farm water weed, order famine people able flow go eat between Yangtze Huai, wish stay, stay place.' Sent envoys official carriages mutually connected on road, protected them, sent down Ba Shu grain to relieve them.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0217",
          "zh": "其明年，天子始巡郡國。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, emperor began tour commanderies kingdoms.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "東度河，河東守不意行至，不辨，自殺。",
          "translations": [
            {
              "lang": "en",
              "text": "East crossed Yellow River, Hedong governor not expected travel arrived, not prepared, committed suicide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "行西踰隴，隴西守以行往卒，天子從官不得食，隴西守自殺。",
          "translations": [
            {
              "lang": "en",
              "text": "Went west passed Long, Longxi governor with travel toward troops, emperor following officials could not eat, Longxi governor committed suicide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "於是上北出蕭關，從數萬騎，獵新秦中，以勒邊兵而歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor north out Xiao Pass, followed tens of thousands cavalry, hunted new Qinzhong, to restrain border troops and return.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "新秦中或千里無亭徼，於是誅北地太守以下，而令民得畜牧邊縣，官假馬母，三歲而歸，及息什一，以除告緡，用充仞新秦中。",
          "translations": [
            {
              "lang": "en",
              "text": "New Qinzhong some thousand li no pavilion outpost, executed north land governor below, ordered people able raise livestock border counties, officials loaned mare mothers, three years return, and interest ten percent, to eliminate inform string money, use fill inhabit new Qinzhong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, emperor began tour commanderies kingdoms. East crossed Yellow River, Hedong governor not expected travel arrived, not prepared, committed suicide. Went west passed Long, Longxi governor with travel toward troops, emperor following officials could not eat, Longxi governor committed suicide. Therefore emperor north out Xiao Pass, followed tens of thousands cavalry, hunted new Qinzhong, to restrain border troops and return. New Qinzhong some thousand li no pavilion outpost, executed north land governor below, ordered people able raise livestock border counties, officials loaned mare mothers, three years return, and interest ten percent, to eliminate inform string money, use fill inhabit new Qinzhong.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0222",
          "zh": "既得寶鼎，立后土、太一祠，公卿議封禪事，而天下郡國皆豫治道橋，繕故宮，及當馳道縣，縣治官儲，設供具，而望以待幸。",
          "translations": [
            {
              "lang": "en",
              "text": "Having obtained precious ding, established Hou Tu, Tai Yi sacrifices, ministers discussed feng shan affairs, realm commanderies kingdoms all prepared treat roads bridges, repaired old palaces, to current relay road counties, counties prepared official stores, set up supplies, gazed to await fortunate.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Having obtained precious ding, established Hou Tu, Tai Yi sacrifices, ministers discussed feng shan affairs, realm commanderies kingdoms all prepared treat roads bridges, repaired old palaces, to current relay road counties, counties prepared official stores, set up supplies, gazed to await fortunate.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0223",
          "zh": "其明年，南越反，西羌侵邊為桀。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, Nanyue rebelled, western Qiang invaded borders as bandits.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "於是天子為山東不贍，赦天下［囚］，因南方樓船卒二十餘萬人擊南越，數萬人發三河以西騎擊西羌，又數萬人度河筑令居。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor for Shandong not sufficient, pardoned realm prisoners, took southern tower ship troops over twenty thousand attacked Nanyue, several thousand sent Sanhe west cavalry attacked western Qiang, again several thousand crossed Yellow River built Ling Ju.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "初置張掖、酒泉郡，而上郡、朔方、西河、河西開田官，斥塞卒六十萬人戍田之。",
          "translations": [
            {
              "lang": "en",
              "text": "Initially established Zhangye, Jiuquan commanderies, Shangjun, Shuofang, Xihe, Hexi opened field officials, drove border troops sixty thousand garrison field them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "中國繕道餽糧，遠者三千，近者千餘里，皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "text": "China repaired roads sent grain, far three thousand, near thousand plus li, all dependent on great agronomist.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "邊兵不足，乃發武庫工官兵器以贍之。",
          "translations": [
            {
              "lang": "en",
              "text": "Border troops insufficient, took military warehouse artisan official weapons to support them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "車騎馬乏絕，縣官錢少，買馬難得，乃著令，令封君以下至三百石以上吏，以差出牝馬天下亭，亭有畜牸馬，歲課息。",
          "translations": [
            {
              "lang": "en",
              "text": "Chariots cavalry horses exhausted, county official money few, buy horses difficult obtain, issued order, ordered enfeoffed lords below to three hundred shi above officials, by grade send mares realm pavilions, pavilions have raise mares, yearly assess interest.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, Nanyue rebelled, western Qiang invaded borders as bandits. Therefore emperor for Shandong not sufficient, pardoned realm prisoners, took southern tower ship troops over twenty thousand attacked Nanyue, several thousand sent Sanhe west cavalry attacked western Qiang, again several thousand crossed Yellow River built Ling Ju. Initially established Zhangye, Jiuquan commanderies, Shangjun, Shuofang, Xihe, Hexi opened field officials, drove border troops sixty thousand garrison field them. China repaired roads sent grain, far three thousand, near thousand plus li, all dependent on great agronomist. Border troops insufficient, took military warehouse artisan official weapons to support them. Chariots cavalry horses exhausted, county official money few, buy horses difficult obtain, issued order, ordered enfeoffed lords below to three hundred shi above officials, by grade send mares realm pavilions, pavilions have raise mares, yearly assess interest.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0229",
          "zh": "齊相卜式上書曰：「臣聞主憂臣辱。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi chancellor Bu Shi memorialed: 'Minister heard lord worries minister disgraces.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "南越反，臣願父子與齊習船者往死之。」",
          "translations": [
            {
              "lang": "en",
              "text": "Nanyue rebels, minister wishes father son with Qi practice ships go die them.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "天子下詔曰：「卜式雖躬耕牧，不以為利，有餘輒助縣官之用。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor issued edict: 'Bu Shi though personally farms pastures, not for profit, surplus then aids county officials use.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "今天下不幸有急，而式奮願父子死之，雖未戰，可謂義形於內。",
          "translations": [
            {
              "lang": "en",
              "text": "Now realm unfortunately has emergency, Shi arouses wishes father son die it, though not fought, can call righteousness shaped within.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "賜爵關內侯，金六十斤，田十頃。」",
          "translations": [
            {
              "lang": "en",
              "text": "Granted nobility Guan Nei Hou, gold sixty jin, fields ten qing.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "布告天下，天下莫應。",
          "translations": [
            {
              "lang": "en",
              "text": "Cloth announced realm, realm none responded.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "列侯以百數，皆莫求從軍擊羌、越。",
          "translations": [
            {
              "lang": "en",
              "text": "Marquises counted in hundreds, all not sought from army attack Qiang, Yue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "至酎，少府省金，而列侯坐酎金失侯者百餘人。",
          "translations": [
            {
              "lang": "en",
              "text": "To wine offering, lesser treasury reduced gold, marquises sat wine gold lost marquis over one hundred people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "乃拜式為御史大夫。",
          "translations": [
            {
              "lang": "en",
              "text": "Appointed Shi as censor-in-chief.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Qi chancellor Bu Shi memorialed: 'Minister heard lord worries minister disgraces. Nanyue rebels, minister wishes father son with Qi practice ships go die them.' Emperor issued edict: 'Bu Shi though personally farms pastures, not for profit, surplus then aids county officials use. Now realm unfortunately has emergency, Shi arouses wishes father son die it, though not fought, can call righteousness shaped within. Granted nobility Guan Nei Hou, gold sixty jin, fields ten qing.' Cloth announced realm, realm none responded. Marquises counted in hundreds, all not sought from army attack Qiang, Yue. To wine offering, lesser treasury reduced gold, marquises sat wine gold lost marquis over one hundred people. Appointed Shi as censor-in-chief.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "式既在位，見郡國多不便縣官作鹽鐵，鐵器苦惡，賈貴，或彊令民賣買之。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi already in position, saw commanderies kingdoms many inconvenient county officials make salt iron, iron utensils bitter bad, merchants expensive, or forced ordered people buy sell them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "而船有算，商者少，物貴，乃因孔僅言船算事。",
          "translations": [
            {
              "lang": "en",
              "text": "Boats had tax, merchants few, goods expensive, took Kong Jin speak boat tax affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "上由是不悅卜式。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor from this not pleased Bu Shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Shi already in position, saw commanderies kingdoms many inconvenient county officials make salt iron, iron utensils bitter bad, merchants expensive, or forced ordered people buy sell them. Boats had tax, merchants few, goods expensive, took Kong Jin speak boat tax affairs. Emperor from this not pleased Bu Shi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0241",
          "zh": "漢連兵三歲，誅羌，滅南越，番禺以西至蜀南者置初郡十七，且以其故俗治，毋賦稅。",
          "translations": [
            {
              "lang": "en",
              "text": "Han connected troops three years, punished Qiang, extinguished Nanyue, Panyu west to Shu south established initial commanderies seventeen, moreover with their old customs governed, no taxes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "南陽、漢中以往郡，各以地比給初郡吏卒奉食幣物，傳車馬被具。",
          "translations": [
            {
              "lang": "en",
              "text": "Nanyang, Hanzhong past commanderies, each by land proportion supplied initial commanderies officials troops support food currency objects, relay carriages horses coverings equipment.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "而初郡時時小反，殺吏，漢發南方吏卒往誅之，閒歲萬餘人，費皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "text": "Initial commanderies often small rebelled, killed officials, Han sent southern officials troops go punish them, between years ten thousand plus people, expenses all dependent great agronomist.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "大農以均輸調鹽鐵助賦，故能贍之。",
          "translations": [
            {
              "lang": "en",
              "text": "Great agronomist with equal transport adjusted salt iron aided taxes, therefore could support them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "然兵所過縣，為以訾給毋乏而已，不敢言擅賦法矣。",
          "translations": [
            {
              "lang": "en",
              "text": "But troops passed counties, only with wealth supply no lacking, dared not speak privately tax laws.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Han connected troops three years, punished Qiang, extinguished Nanyue, Panyu west to Shu south established initial commanderies seventeen, moreover with their old customs governed, no taxes. Nanyang, Hanzhong past commanderies, each by land proportion supplied initial commanderies officials troops support food currency objects, relay carriages horses coverings equipment. Initial commanderies often small rebelled, killed officials, Han sent southern officials troops go punish them, between years ten thousand plus people, expenses all dependent great agronomist. Great agronomist with equal transport adjusted salt iron aided taxes, therefore could support them. But troops passed counties, only with wealth supply no lacking, dared not speak privately tax laws.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0246",
          "zh": "其明年，元封元年，卜式貶秩為太子太傅。",
          "translations": [
            {
              "lang": "en",
              "text": "Next year, Yuan Feng first year, Bu Shi demoted rank as crown prince great tutor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "而桑弘羊為治粟都尉，領大農，盡代僅筦天下鹽鐵。",
          "translations": [
            {
              "lang": "en",
              "text": "Sang Hong Yang as govern grain capital commander, led great agronomist, completely replaced Jin managed realm salt iron.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "弘羊以諸官各自市，相與爭，物故騰躍，而天下賦輸或不償其僦費，乃請置大農部丞數十人，分部主郡國，各往往縣置均輸鹽鐵官，令遠方各以其物貴時商賈所轉販者為賦，而相灌輸。",
          "translations": [
            {
              "lang": "en",
              "text": "Hong Yang because various officials each market themselves, mutually contended, goods therefore soared jumped, realm taxes transport or not repaid their hire expenses, requested establish great agronomist division vice several tens, divided divisions oversee commanderies kingdoms, each often counties established equal transport salt iron officials, ordered distant places each with their goods expensive time merchants traders transported sold as taxes, mutually irrigated transported.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "置平準于京師，都受天下委輸。",
          "translations": [
            {
              "lang": "en",
              "text": "Established equal standard in capital, all received realm consignments.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "召工官治車諸器，皆仰給大農。",
          "translations": [
            {
              "lang": "en",
              "text": "Summoned artisan officials make carriages various utensils, all dependent great agronomist.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "大農之諸官盡籠天下之貨物，貴即賣之，賤則買之。",
          "translations": [
            {
              "lang": "en",
              "text": "Great agronomist's various officials all caged realm goods objects, expensive then sold them, cheap then bought them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "如此，富商大賈無所牟大利，則反本，而萬物不得騰踴。",
          "translations": [
            {
              "lang": "en",
              "text": "Thus, rich merchants great traders no place seek great profit, then returned to fundamentals, ten thousand things not able soar jump.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "故抑天下物，名曰「平準」。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore suppressed realm goods, named 'equal standard'.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "天子以為然，許之。",
          "translations": [
            {
              "lang": "en",
              "text": "Emperor considered correct, permitted it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "於是天子北至朔方，東到太山，巡海上，并北邊以歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore emperor north to Shuofang, east to Tai Shan, toured sea, along northern border returned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "所過賞賜，用帛百餘萬匹，錢金以巨萬計，皆取足大農。",
          "translations": [
            {
              "lang": "en",
              "text": "Passed rewarded granted, used silk over one hundred thousand pieces, money gold counted vast millions, all took sufficient from great agronomist.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Next year, Yuan Feng first year, Bu Shi demoted rank as crown prince great tutor. Sang Hong Yang as govern grain capital commander, led great agronomist, completely replaced Jin managed realm salt iron. Hong Yang because various officials each market themselves, mutually contended, goods therefore soared jumped, realm taxes transport or not repaid their hire expenses, requested establish great agronomist division vice several tens, divided divisions oversee commanderies kingdoms, each often counties established equal transport salt iron officials, ordered distant places each with their goods expensive time merchants traders transported sold as taxes, mutually irrigated transported. Established equal standard in capital, all received realm consignments. Summoned artisan officials make carriages various utensils, all dependent great agronomist. Great agronomist's various officials all caged realm goods objects, expensive then sold them, cheap then bought them. Thus, rich merchants great traders no place seek great profit, then returned to fundamentals, ten thousand things not able soar jump. Therefore suppressed realm goods, named 'equal standard'. Emperor considered correct, permitted it. Therefore emperor north to Shuofang, east to Tai Shan, toured sea, along northern border returned. Passed rewarded granted, used silk over one hundred thousand pieces, money gold counted vast millions, all took sufficient from great agronomist.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "弘羊又請令吏得入粟補官，及罪人贖罪。",
          "translations": [
            {
              "lang": "en",
              "text": "Hong Yang moreover requested order officials able enter grain supplement officials, criminals redeem crimes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "令民能入粟甘泉各有差，以復終身，不告緡。",
          "translations": [
            {
              "lang": "en",
              "text": "Ordered people able enter grain Ganquan each have differences, to exempt lifetime, not inform string money.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "他郡各輸急處，而諸農各致粟，山東漕益歲六百萬石。",
          "translations": [
            {
              "lang": "en",
              "text": "Other commanderies each transported urgent places, various farmers each delivered grain, Shandong transport additionally yearly six million shi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "一歲之中，太倉、甘泉倉滿。",
          "translations": [
            {
              "lang": "en",
              "text": "One year within, great granary, Ganquan granary full.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "邊餘穀諸物均輸帛五百萬匹。",
          "translations": [
            {
              "lang": "en",
              "text": "Border surplus grain various goods equal transport silk five million pieces.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "民不益賦而天下用饒。",
          "translations": [
            {
              "lang": "en",
              "text": "People not increased taxes but realm use abundant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "於是弘羊賜爵左庶長，黃金再百斤焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore Hong Yang granted nobility left commoner, gold two hundred jin.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Hong Yang moreover requested order officials able enter grain supplement officials, criminals redeem crimes. Ordered people able enter grain Ganquan each have differences, to exempt lifetime, not inform string money. Other commanderies each transported urgent places, various farmers each delivered grain, Shandong transport additionally yearly six million shi. One year within, great granary, Ganquan granary full. Border surplus grain various goods equal transport silk five million pieces. People not increased taxes but realm use abundant. Therefore Hong Yang granted nobility left commoner, gold two hundred jin.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0264",
          "zh": "是歲小旱，上令官求雨，卜式言曰：「縣官當食租衣稅而已，今弘羊令吏坐市列肆，販物求利。",
          "translations": [
            {
              "lang": "en",
              "text": "This year small drought, emperor ordered officials seek rain, Bu Shi said: 'County officials should eat rents wear taxes only, now Hong Yang makes officials sit market rows stores, vend goods seek profit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "亨弘羊，天乃雨。」",
          "translations": [
            {
              "lang": "en",
              "text": "Cook Hong Yang, heaven then rains.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "This year small drought, emperor ordered officials seek rain, Bu Shi said: 'County officials should eat rents wear taxes only, now Hong Yang makes officials sit market rows stores, vend goods seek profit. Cook Hong Yang, heaven then rains.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0267",
          "zh": "太史公曰：農工商交易之路通，而龜貝金錢刀布之幣興焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Grand Historian says: Farmer craftsman merchant exchange roads connected, turtle shells cowries gold money knife cloth currency arose.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "所從來久遠，自高辛氏之前尚矣，靡得而記云。",
          "translations": [
            {
              "lang": "en",
              "text": "Source came long distant, from Gao Xin Shi before still, cannot obtain record.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "故書道唐虞之際，詩述殷周之世，安寧則長庠序，先本絀末，以禮義防于利；",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore Classic wrote Tang Yu time, Poetry described Yin Zhou age, peaceful then long schools, first fundamentals last branches, with rites righteousness defended against profit;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "事變多故而亦反是。",
          "translations": [
            {
              "lang": "en",
              "text": "affairs changed many troubles then also opposite.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "是以物盛則衰，時極而轉，一質一文，終始之變也。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore things flourish then decline, time extreme then turn, one substance one pattern, beginning end changes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "禹貢九州，各因其土地所宜，人民所多少而納職焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Yu Gong nine provinces, each followed their land suitable, people many few delivered duties.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "湯武承獘易變，使民不倦，各兢兢所以為治，而稍陵遲衰微。",
          "translations": [
            {
              "lang": "en",
              "text": "Tang Wu received exhaustion easily changed, made people not tired, each diligent so governed, gradually declined weakened.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "齊桓公用管仲之謀，通輕重之權，徼山海之業，以朝諸侯，用區區之齊顯成霸名。",
          "translations": [
            {
              "lang": "en",
              "text": "Qi Huan Gong used Guan Zhong strategy, passed light heavy authority, seized mountains seas occupations, to make feudal lords court, used small small Qi displayed completed hegemon name.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "魏用李克，盡地力，為彊君。",
          "translations": [
            {
              "lang": "en",
              "text": "Wei used Li Ke, exhausted land strength, became strong lord.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "自是以後，天下爭於戰國，貴詐力而賤仁義，先富有而後推讓。",
          "translations": [
            {
              "lang": "en",
              "text": "From this after, realm contended Warring States, honored deception force despised benevolence righteousness, first wealthy then yielded.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "故庶人之富者或累巨萬，而貧者或不厭糟糠；",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore common people rich sometimes accumulated vast millions, poor sometimes not satisfied chaff bran;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "有國彊者或并群小以臣諸侯，而弱國或絕祀而滅世。",
          "translations": [
            {
              "lang": "en",
              "text": "having country strong sometimes annexed small groups to subject feudal lords, weak countries sometimes cut sacrifices extinguished generations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "以至於秦，卒并海內。",
          "translations": [
            {
              "lang": "en",
              "text": "To Qin, finally unified within seas.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "虞夏之幣，金為三品，或黃，或白，或赤；",
          "translations": [
            {
              "lang": "en",
              "text": "Yu Xia currency, gold three grades, or yellow, or white, or red;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "或錢，或布，或刀，或龜貝。",
          "translations": [
            {
              "lang": "en",
              "text": "or money, or cloth, or knife, or turtle cowries.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "及至秦，中一國之幣為（三）［二］等，黃金以溢名，為上幣；",
          "translations": [
            {
              "lang": "en",
              "text": "To Qin, unified country's currency two grades, gold with overflow named, upper currency;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "銅錢識曰半兩，重如其文，為下幣。",
          "translations": [
            {
              "lang": "en",
              "text": "copper money marked half liang, heavy like inscription, lower currency.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "而珠玉、龜貝、銀錫之屬為器飾寶藏，不為幣。",
          "translations": [
            {
              "lang": "en",
              "text": "Pearl jade, turtle cowries, silver tin kinds as utensil decorations treasures storage, not currency.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "然各隨時而輕重無常。",
          "translations": [
            {
              "lang": "en",
              "text": "But each followed time light heavy no constant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "於是外攘夷狄，內興功業，海內之士力耕不足糧馕，女子紡績不足衣服。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore externally expelled barbarians, internally raised achievements, within seas scholars labored farmed insufficient food clothing, women spun wove insufficient clothing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "古者嘗竭天下之資財以奉其上，猶自以為不足也。",
          "translations": [
            {
              "lang": "en",
              "text": "Ancient often exhausted realm wealth to serve above, still self considered insufficient.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "無異故云，事勢之流，相激使然，曷足怪焉。",
          "translations": [
            {
              "lang": "en",
              "text": "No different so say, affairs trends flow, mutually stimulated made so, why sufficient strange.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Grand Historian says: Farmer craftsman merchant exchange roads connected, turtle shells cowries gold money knife cloth currency arose. Source came long distant, from Gao Xin Shi before still, cannot obtain record. Therefore Classic wrote Tang Yu time, Poetry described Yin Zhou age, peaceful then long schools, first fundamentals last branches, with rites righteousness defended against profit; affairs changed many troubles then also opposite. Therefore things flourish then decline, time extreme then turn, one substance one pattern, beginning end changes. Yu Gong nine provinces, each followed their land suitable, people many few delivered duties. Tang Wu received exhaustion easily changed, made people not tired, each diligent so governed, gradually declined weakened. Qi Huan Gong used Guan Zhong strategy, passed light heavy authority, seized mountains seas occupations, to make feudal lords court, used small small Qi displayed completed hegemon name. Wei used Li Ke, exhausted land strength, became strong lord. From this after, realm contended Warring States, honored deception force despised benevolence righteousness, first wealthy then yielded. Therefore common people rich sometimes accumulated vast millions, poor sometimes not satisfied chaff bran; having country strong sometimes annexed small groups to subject feudal lords, weak countries sometimes cut sacrifices extinguished generations. To Qin, finally unified within seas. Yu Xia currency, gold three grades, or yellow, or white, or red; or money, or cloth, or knife, or turtle cowries. To Qin, unified country's currency two grades, gold with overflow named, upper currency; copper money marked half liang, heavy like inscription, lower currency. Pearl jade, turtle cowries, silver tin kinds as utensil decorations treasures storage, not currency. But each followed time light heavy no constant. Therefore externally expelled barbarians, internally raised achievements, within seas scholars labored farmed insufficient food clothing, women spun wove insufficient clothing. Ancient often exhausted realm wealth to serve above, still self considered insufficient. No different so say, affairs trends flow, mutually stimulated made so, why sufficient strange.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}