{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "032",
    "url": "https://chinesenotes.com/shiji/shiji032.html",
    "title": {
      "zh": "齊太公世家",
      "en": "House of Duke Tai of Qi",
      "raw": "《齊太公世家》 House of Duke Tai of Qi"
    },
    "sentenceCount": 537,
    "translatedCount": 537,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:01.860Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "太公望呂尚者，東海上人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Grand Duke Wang Lü Shang was a man from the eastern seacoast.",
              "idiomatic": "The legendary strategist Jiang Ziya, known as Lü Shang, was a man from the eastern seaboard.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "其先祖嘗為四嶽，佐禹平水土甚有功。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His forebears had served as the Four Peaks officials and helped the legendary Yu control the great floods, earning considerable merit.",
              "idiomatic": "His forebears once served as the Four Peaks officials and assisted Yu in controlling the floods, earning great merit.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "虞夏之際封於呂，或封於申，姓姜氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "During the transition from Yu to Xia, they were enfeoffed at Lü, or sometimes at Shen, and bore the Jiang surname.",
              "idiomatic": "In the time between the Yu and Xia dynasties, his family was enfeoffed at Lü, or sometimes at Shen, and carried the Jiang surname.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "夏商之時，申、呂或封枝庶子孫，或為庶人，尚其後苗裔也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "During Xia and Shang times, the Shen and Lü lines were sometimes enfeoffed with cadet lineages, or became commoners; Lü Shang was among their later descendants.",
              "idiomatic": "During the Xia and Shang periods, some branches of the Shen and Lü families received minor enfeoffments, while others became ordinary people. Lü Shang was one of their later descendants.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "本姓姜氏，從其封姓，故曰呂尚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Their original surname was Jiang, but they took the name of their enfeoffment, thus he was called Lü Shang.",
              "idiomatic": "His family originally bore the Jiang surname, but they adopted the name of their fief, which is why he was known as Lü Shang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0006",
          "zh": "呂尚蓋嘗窮困，年老矣，以漁釣奸周西伯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lü Shang indeed once lived in poverty, grew old, and used fishing to spy on the Zhou Western Earl.",
              "idiomatic": "Lü Shang had fallen into poverty and grown old, but he used his fishing as a pretext to observe the Zhou Western Earl.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "西伯將出獵，卜之，曰「所獲非龍非彨非虎非羆；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Western Earl was about to go hunting and divined it, saying 'What will be obtained is neither dragon nor boar nor tiger nor bear;",
              "idiomatic": "Before going hunting, the Western Earl consulted the oracle, which said: 'What you will obtain is neither dragon nor wild boar nor tiger nor bear;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "所獲霸王之輔」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "what will be obtained is the hegemon king's assistant.'",
              "idiomatic": "what you will obtain is the assistant to a future hegemon king.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "於是周西伯獵，果遇太公於渭之陽，與語大說，曰：「自吾先君太公曰『當有聖人適周，周以興』。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore the Zhou Western Earl hunted, and indeed met the Grand Duke on the northern bank of the Wei, spoke with him and was greatly pleased, saying: 'From my ancestor the Grand Duke who said \"there should be a sage who comes to Zhou, and Zhou will rise through him.\"'",
              "idiomatic": "So the Zhou Western Earl went hunting and indeed encountered the Grand Duke on the north bank of the Wei River. After talking with him, he was delighted and said: 'My ancestor the Grand Duke once said, \"A sage will come to Zhou, and through him Zhou will flourish.\"'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "子真是邪？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Are you truly that one?",
              "idiomatic": "Are you that sage?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "吾太公望子久矣。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I, the Grand Duke, have been awaiting you for a long time.'",
              "idiomatic": "I have been waiting for you for a long time, Grand Duke.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "故號之曰「太公望」，載與俱歸，立為師。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore he named him 'Grand Duke Wang', loaded him in the carriage and returned together, established him as teacher.",
              "idiomatic": "Therefore he gave him the title 'Grand Duke Wang', had him ride in the carriage, and they returned together. He appointed him as his teacher.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "或曰，太公博聞，嘗事紂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some accounts say the Grand Duke was widely knowledgeable and had once served under King Zhou.",
              "idiomatic": "Some accounts say the Grand Duke was widely learned and had once served King Zhou.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "紂無道，去之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Zhou was tyrannical, so he abandoned him.",
              "idiomatic": "纣之暴虐，商民患之，夫公隱武斷而暴紂，紂不悅，殺之；夫公之妻，奔東海之濱而生太公。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "游說諸侯，無所遇，而卒西歸周西伯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He traveled among the feudal lords trying to persuade them, but found no one receptive, so he finally journeyed west to join the Zhou Western Earl.",
              "idiomatic": "King Zhou's tyranny oppressed the Shang people. The Grand Duke's father secretly opposed Zhou's tyranny. Zhou was displeased and executed him. The Grand Duke's mother fled to the eastern seacoast and gave birth to the Grand Duke.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "或曰，呂尚處士，隱海濱。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some say Lü Shang was a recluse, hid by the seacoast.",
              "idiomatic": "Other accounts say Lü Shang was a scholar in retirement who lived in seclusion by the sea.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "周西伯拘羑里，散宜生、閎夭素知而招呂尚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Zhou Western Earl was imprisoned in Youli, San Yisheng and Hong Yao had long known him and summoned Lü Shang.",
              "idiomatic": "When the Zhou Western Earl was imprisoned in Youli, San Yisheng and Hong Yao, who had long known Lü Shang, recruited him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "呂尚亦曰「吾聞西伯賢，又善養老，盍往焉」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lü Shang also said 'I have heard the Western Earl is worthy, and moreover good at caring for the elderly, why not go there.'",
              "idiomatic": "Lü Shang said: 'I have heard that the Western Earl is virtuous and treats elders well. Why not go to him?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "三人者為西伯求美女奇物，獻之於紂，以贖西伯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "These three men found beautiful women and precious treasures for the Western Earl and presented them to King Zhou as ransom for his release.",
              "idiomatic": "King Wen then took him in his carriage and returned together, appointing him as his teacher and giving him the title \"Tai Gong Wang.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "西伯得以出，反國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Western Earl was thereby freed and returned to his domain.",
              "idiomatic": "或曰：「呂尚其先祖嘗為四嶽，佐禹平水土有功，封於呂，後世為齊。」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "言呂尚所以事周雖異，然要之為文武師。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Speaking of how Lü Shang served Zhou, though the accounts differ, the essential point is that he became teacher to Wen and Wu.",
              "idiomatic": "Though the accounts of how Lü Shang came to serve Zhou vary, the important fact is that he became the teacher of both King Wen and King Wu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "周西伯昌之脫羑里歸，與呂尚陰謀修德以傾商政，其事多兵權與奇計，故後世之言兵及周之陰權皆宗太公為本謀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the Zhou Western Earl Chang escaped from Youli and returned, he secretly plotted with Lü Shang to cultivate virtue in order to undermine Shang governance. Their affairs were mostly military strategy and extraordinary plans, therefore later generations' discussions of military matters and Zhou's secret maneuvers all take the Grand Duke as the original strategist.",
              "idiomatic": "After King Wen's release from Youli prison, he secretly conspired with Lü Shang to promote virtue and undermine the Shang regime. Their plans involved much military strategy and clever tactics, which is why later discussions of warfare and Zhou's covert operations all trace their origins to the Grand Duke.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "周西伯政平，及斷虞芮之訟，而詩人稱西伯受命曰文王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Zhou Western Earl's governance was peaceful, and when he judged the dispute between Yu and Rui, the poets praised the Western Earl as receiving the mandate and called him King Wen.",
              "idiomatic": "King Wen's rule brought peace, and when he adjudicated the conflict between the states of Yu and Rui, the poets celebrated him as having received heaven's mandate, calling him King Wen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "伐崇、密須、犬夷，大作豐邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He conquered Chong, Mi Xu, and Quan Yi, and greatly expanded the city of Feng.",
              "idiomatic": "諸侯不期而會者八百諸侯，皆曰：「紂可伐矣。」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "天下三分，其二歸周者，太公之謀計居多。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The world was divided into three parts, and the two that went to Zhou were due to the Grand Duke's strategies.",
              "idiomatic": "The empire was divided into three parts, and Zhou gained control of two-thirds largely through the Grand Duke's strategic planning.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0026",
          "zh": "文王崩，武王即位。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Wen died, and King Wu succeeded him as king.",
              "idiomatic": "武王曰：「未可。」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "九年，欲修文王業，東伐以觀諸侯集否。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the ninth year, he wished to continue King Wen's enterprise, attacked east to observe whether the feudal lords would gather.",
              "idiomatic": "In his ninth year, King Wu wanted to carry on King Wen's legacy. He launched an eastern campaign to see if the other lords would rally to him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "師行，師尚父左杖黃鉞，右把白旄以誓，曰：「蒼兕蒼兕，總爾眾庶，與爾舟楫，後至者斬！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The army marched, Master Shangfu held the yellow axe in his left hand, grasped the white banner in his right to swear the oath, saying: 'Blue rhinoceros, blue rhinoceros, assemble your multitudes, I will give you boats and oars, those who arrive late will be executed!'",
              "idiomatic": "As the army advanced, Master Shangfu held a yellow axe in his left hand and a white banner in his right to administer the oath: 'Blue rhinoceros! Blue rhinoceros! Rally your troops! I provide boats and oars—whoever arrives late will be beheaded!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "遂至盟津。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They reached the Meng crossing.",
              "idiomatic": "He withdrew his troops and, together with the Grand Duke, composed the \"Yin Fu.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "諸侯不期而會者八百諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eight hundred feudal lords assembled there spontaneously, without any prior coordination.",
              "idiomatic": "Two years later, Zhou's madness grew worse. He killed his nephew Bi Gan, imprisoned Ji Zi, and King Wen died of grief.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "諸侯皆曰：「紂可伐也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All the feudal lords said: 'King Zhou can be attacked.'",
              "idiomatic": "All the lords declared: 'King Zhou must be overthrown.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "武王曰：「未可。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Wu said: 'Not yet possible.'",
              "idiomatic": "King Wu replied: 'The time is not yet right.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "還師，與太公作此太誓。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He ordered the army to withdraw and, together with the Grand Duke, composed the Great Oath.",
              "idiomatic": "武王觀兵孟津，諸侯不期而會者八百諸侯，皆曰：「可矣。」",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "居二年，紂殺王子比干，囚箕子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Two years passed, during which King Zhou executed his uncle Bi Gan and imprisoned his brother Ji Zi.",
              "idiomatic": "King Wu reviewed his troops at Meng Ford. The feudal lords who gathered without prior agreement numbered eight hundred. They all said: \"Now it is possible.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "武王將伐紂，卜龜兆，不吉，風雨暴至。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "As King Wu prepared to attack King Zhou, he consulted the oracle with turtle shells. The signs were unfavorable, and a violent storm suddenly broke out.",
              "idiomatic": "武王曰：「猶未可也。」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "群公盡懼，唯太公彊之勸武王，武王於是遂行。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All the nobles were terrified, but only the Grand Duke forcefully encouraged King Wu to continue. King Wu pressed on.",
              "idiomatic": "King Wu said: \"Still not yet.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "十一年正月甲子，誓於牧野，伐商紂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the jiazi day of the first month in his eleventh year, King Wu swore the oath at Muye Plain and attacked King Zhou of Shang.",
              "idiomatic": "還師，居二年，紂殺比干，紂愈淫亂不止。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "紂師敗績。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Zhou's army suffered complete defeat.",
              "idiomatic": "King Zhou's forces were utterly routed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "紂反走，登鹿臺，遂追斬紂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Zhou fled back to his palace, climbed the Deer Terrace, and was pursued and executed there.",
              "idiomatic": "於是武王與諸侯伐紂，戰於牧野，紂師倒戈以戰，以開武王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "明日，武王立于社，群公奉明水，衛康叔封布采席，師尚父牽牲，史佚策祝，以告神討紂之罪。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The next day, King Wu stood at the altar, the nobles presented pure water, Wei Kang Shu spread the ritual mat, Master Shangfu led the sacrificial animal, Shi Yi read the prayer, to inform the spirits of the punishment of King Zhou's crimes.",
              "idiomatic": "The next day, King Wu stood at the altar while the nobles presented consecrated water. The Duke of Wei spread the ritual mat, Master Shangfu led the sacrificial victim, and the historian read the prayer announcing to the gods the punishment of King Zhou's crimes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "散鹿臺之錢，發鉅橋之粟，以振貧民。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They distributed the treasure from the Deer Terrace and opened the granaries at Ju Bridge to aid the impoverished people.",
              "idiomatic": "武王馳之，紂走，入於宣室自燔而死。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "封比干墓，釋箕子囚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They sealed Bi Gan's tomb, released Ji Zi from prison.",
              "idiomatic": "They honored Bi Gan's grave and freed Ji Zi from captivity.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "遷九鼎，修周政，與天下更始。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They transported the Nine Cauldrons, reformed Zhou administration, and inaugurated a new era for the empire.",
              "idiomatic": "King Wu entered and went to where Zhou had died. He shot him from the left three times, then got down from his chariot and struck him with a light sword, decapitating Zhou with a yellow axe and hanging his head from a white banner.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "師尚父謀居多。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Master Shangfu's strategies were the majority.",
              "idiomatic": "Master Shangfu's strategic planning played the largest role.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0045",
          "zh": "於是武王已平商而王天下，封師尚父於齊營丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Having conquered Shang and become ruler of the world, King Wu enfeoffed Master Shangfu in the state of Qi at Yingqiu.",
              "idiomatic": "All the feudal lords bowed in homage. King Wu said: \"Alas! Are you all well? The Shang king's tyranny has reached its limit!\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "東就國，道宿行遲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He journeyed east to his new domain, stopping to rest along the way and traveling at a leisurely pace.",
              "idiomatic": "於是武王至周，營之為墟，祠后稷、喪記，然後還師周。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "逆旅之人曰：「吾聞時難得而易失。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The innkeeper said: 'I have heard opportunity is difficult to obtain and easy to lose.'",
              "idiomatic": "The innkeeper remarked: 'I\\'ve heard that opportunities are hard to come by but easy to miss.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "客寢甚安，殆非就國者也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The guest sleeps very peacefully, probably not one going to take a state.'",
              "idiomatic": "This guest sleeps so soundly—he doesn\\'t seem like someone rushing to claim a kingdom.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "太公聞之，夜衣而行，犁明至國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Grand Duke heard this criticism, dressed in the night and set out, arriving at his domain by morning light.",
              "idiomatic": "He enfeoffed Lu Shang at Qi, giving him the title King of Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "萊侯來伐，與之爭營丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Marquis of Lai launched an attack, disputing control of Yingqiu with him.",
              "idiomatic": "或曰：「武王封太公望於齊營丘，立為齊王，與之祝曰：『子小子受命於天，以爾為師，天下諸侯，莫非王事，辟土服遠，無不從服。』」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "營丘邊萊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yingqiu was adjacent to the state of Lai.",
              "idiomatic": "Some accounts say: \"King Wu enfeoffed Tai Gong Wang at Qi Ying Qiu, establishing him as King of Qi, and gave him this blessing: 'I, the young one, have received the mandate from Heaven. I appoint you as my teacher. All the feudal lords in the world are engaged in the king's affairs. In opening up lands and subduing distant places, none shall fail to submit.'\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "萊人，夷也，會紂之亂而周初定，未能集遠方，是以與太公爭國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Lai people were Yi barbarians. Taking advantage of King Zhou's chaos while Zhou was newly established and unable to gather the distant regions, therefore they contended with the Grand Duke for the state.",
              "idiomatic": "The people of Lai were barbarian Yi tribes. They took advantage of the chaos during King Zhou's reign and the early Zhou dynasty's inability to control distant territories, so they disputed the Grand Duke's claim to the state.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "太公至國，修政，因其俗，簡其禮，通商工之業，便魚鹽之利，而人民多歸齊，齊為大國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the Grand Duke arrived in his domain, he reformed the administration, respected local customs, simplified ceremonies, promoted trade and manufacturing, developed the fishing and salt industries, and attracted many people to Qi. Thus Qi became a major power.",
              "idiomatic": "When King Wu returned, he enfeoffed the Grand Duke at Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "及周成王少時，管蔡作亂，淮夷畔周，乃使召康公命太公曰：「東至海，西至河，南至穆陵，北至無棣，五侯九伯，實得征之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When King Cheng of Zhou was young, Guan and Cai rebelled, the Huai Yi rebelled against Zhou, therefore they sent Duke Zhao Kang to command the Grand Duke saying: 'East to the sea, west to the river, south to Mu Ling, north to Wu Di, the five marquises and nine earls, you truly may punish them.'",
              "idiomatic": "During King Cheng's minority, when the rebellious princes Guan and Cai caused trouble and the Huai Yi barbarians revolted against Zhou, the court sent Duke Zhao Kang to invest the Grand Duke with authority: 'From the eastern sea to the western Yellow River, from southern Mu Ling to northern Wu Di—you may punish the five marquises and nine earls as you see fit.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "齊由此得征伐，為大國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Through this, Qi gained the authority to wage war and became one of the great powers.",
              "idiomatic": "He gave him the title King of Qi and had him manage the eastern regions.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "都營丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The capital city was Yingqiu.",
              "idiomatic": "The Grand Duke went to Qi and implemented enlightened policies.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "蓋太公之卒百有餘年，子丁公呂伋立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Probably more than one hundred years after the Grand Duke's death, his son Ding Gong Lü Ji established himself.",
              "idiomatic": "About a century after the Grand Duke's death, his son Duke Ding (Lü Ji) ascended the throne.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "丁公卒，子乙公得立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Ding died, and his son Duke Yi (De) succeeded him.",
              "idiomatic": "He reformed the laws and selected capable officials.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "乙公卒，子癸公慈母立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Yi died, and his son Duke Gui (Ci Mu) succeeded him.",
              "idiomatic": "He encouraged farming and military training.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "癸公卒，子哀公不辰立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Gui died, and his son Duke Ai (Bu Chen) succeeded him.",
              "idiomatic": "Within a year, Qi became strong.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "哀公時，紀侯譖之周，周烹哀公而立其弟靜，是為胡公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "During Ai Gong's time, the Marquis of Ji slandered him to Zhou, Zhou boiled Ai Gong and established his younger brother Jing, this was Hu Gong.",
              "idiomatic": "During Duke Ai's reign, the Marquis of Ji slandered him to the Zhou court. The Zhou king had Duke Ai executed by boiling and installed his younger brother Jing as duke, who became Duke Hu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "胡公徙都薄泵，而當周夷王之時。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hu Gong moved the capital to Bo Beng, and it was during King Yi of Zhou's time.",
              "idiomatic": "Duke Hu relocated the capital to Bo Beng during the reign of King Yi of Zhou.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0063",
          "zh": "哀公之同母少弟山怨胡公，乃與其黨率營丘人襲攻殺胡公而自立，是為獻公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Gong's younger same-mother brother Shan resented Hu Gong, therefore with his partisans led Yingqiu people to suddenly attack and kill Hu Gong and establish himself, this was Xian Gong.",
              "idiomatic": "Duke Ai's younger uterine brother Shan harbored resentment toward Duke Hu. He allied with his supporters, led the people of Yingqiu in a surprise attack that killed Duke Hu, and usurped the throne as Duke Xian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "獻公元年，盡逐胡公子，因徙薄泵都，治臨菑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xian Gong first year, completely expelled Hu Gong's sons, therefore moved the Bo Beng capital, administered Linzi.",
              "idiomatic": "In Duke Xian's first year, he expelled all of Duke Hu's sons and relocated the capital from Bo Beng to Linzi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0065",
          "zh": "九年，獻公卒，子武公壽立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Nine years later, Duke Xian died and his son Duke Wu (Shou) succeeded him.",
              "idiomatic": "The Grand Duke lived to a great age.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "武公九年，周厲王出奔，居彘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Wu's ninth year, King Li of Zhou fled his capital and took refuge in Zhi.",
              "idiomatic": "He died in Qi and was buried there.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "十年，王室亂，大臣行政，號曰「共和」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth year, the royal house was chaotic, ministers administered government, called 'Republican.'",
              "idiomatic": "The following year, the Zhou court fell into chaos and ministers took over governance in what became known as the 'Republican' period.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "二十四年，周宣王初立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-fourth year, King Xuan of Zhou ascended the throne.",
              "idiomatic": "His descendants continued to rule Qi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0069",
          "zh": "二十六年，武公卒，子厲公無忌立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-six years later, Duke Wu died and his son Duke Li (Wu Ji) succeeded him.",
              "idiomatic": "The Jiang family maintained the state.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "厲公暴虐，故胡公子復入齊，齊人欲立之，乃與攻殺厲公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Li Gong was tyrannical, therefore Hu Gong's sons again entered Qi, Qi people wished to establish them, therefore together attacked and killed Li Gong.",
              "idiomatic": "Duke Li ruled tyrannically, so the sons of Duke Hu returned to Qi. The people of Qi wanted to install one of them as ruler, so they joined forces and assassinated Duke Li.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "胡公子亦戰死。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hu Gong's sons also died in battle.",
              "idiomatic": "Duke Hu's sons also perished in the fighting.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "齊人乃立厲公子赤為君，是為文公，而誅殺厲公者七十人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi people therefore established Li Gong's son Chi as ruler, this was Wen Gong, and executed seventy people who had killed Li Gong.",
              "idiomatic": "The people of Qi then installed Duke Li's son Chi as their ruler, who became Duke Wen. They also executed seventy men who had participated in Duke Li's assassination.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "文公十二年卒，子成公脫立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Wen died in his twelfth year, and his son Duke Cheng (Tuo) succeeded him.",
              "idiomatic": "Duke Ding of Qi succeeded Duke Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "成公九年卒，子莊公購立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Cheng died in his ninth year, and his son Duke Zhuang (Gou) succeeded him.",
              "idiomatic": "He was weak and incompetent.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "莊公二十四年，犬戎殺幽王，周東徙雒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Zhuang's twenty-fourth year, the Quan Rong barbarians killed King You of Zhou, forcing the Zhou court to relocate eastward to Luoyang.",
              "idiomatic": "The nobles grew powerful.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "秦始列為諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qin was officially recognized as one of the feudal states.",
              "idiomatic": "They controlled the government.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "五十六年，晉弒其君昭侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fifty-six years later, the state of Jin assassinated their ruler Duke Zhao.",
              "idiomatic": "Duke Ding was assassinated.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0078",
          "zh": "六十四年，莊公卒，子釐公祿甫立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sixty-four years later, Duke Zhuang died and his son Duke Xi (Lu Fu) succeeded him.",
              "idiomatic": "Duke Jian succeeded him.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "釐公九年，魯隱公初立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Xi's ninth year, Duke Yin of Lu ascended the throne.",
              "idiomatic": "He was also weak.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "十九年，魯桓公弒其兄隱公而自立為君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Nineteen years later, Duke Huan of Lu assassinated his brother Duke Yin and usurped the throne.",
              "idiomatic": "The nobles dominated.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0081",
          "zh": "二十五年，北戎伐齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-five years later, the northern Rong barbarians invaded Qi.",
              "idiomatic": "They deposed Duke Jian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "鄭使太子忽來救齊，齊欲妻之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zheng sent crown prince Hu to rescue Qi, Qi wished to marry him [to a princess].",
              "idiomatic": "Zheng sent their crown prince Hu to aid Qi, and Qi wanted to betroth a princess to him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "忽曰：「鄭小齊大，非我敵。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hu said: 'Zheng is small, Qi is large, not my match.'",
              "idiomatic": "Prince Hu replied: 'Zheng is small while Qi is large—we are no match for them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "遂辭之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He therefore politely refused.",
              "idiomatic": "Duke Ping succeeded Duke Jian.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "三十二年，釐公同母弟夷仲年死。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-second year, Xi Gong's same-mother younger brother Yi Zhong Nian died.",
              "idiomatic": "Thirty-two years later, Duke Xi's uterine younger brother Yi Zhong Nian died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "其子曰公孫無知，釐公愛之，令其秩服奉養比太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His son was named Gong Sun Wu Zhi. Duke Xi doted on him and granted him status, clothing, and maintenance equal to that of the crown prince.",
              "idiomatic": "He relied on Yan Zi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0087",
          "zh": "三十三年，釐公卒，太子諸兒立，是為襄公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thirty-three years later, Duke Xi died and the crown prince Zhu Er succeeded him as Duke Xiang.",
              "idiomatic": "Yan Zi was wise and loyal.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0088",
          "zh": "襄公元年，始為太子時，嘗與無知鬬，及立，絀無知秩服，無知怨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiang Gong first year, when he began as crown prince, once fought with Wu Zhi, and when established, reduced Wu Zhi's rank and clothing, Wu Zhi resented.",
              "idiomatic": "In Duke Xiang's first year: when he was crown prince, he once fought with Wu Zhi. Now that he was duke, he reduced Wu Zhi's status and privileges, causing Wu Zhi to harbor resentment.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0089",
          "zh": "四年，魯桓公與夫人如齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Four years later, Duke Huan of Lu traveled to Qi with his wife.",
              "idiomatic": "Under his guidance, Qi prospered.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "齊襄公故嘗私通魯夫人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Xiang Gong had previously illicitly communicated with Lu's wife.",
              "idiomatic": "Duke Xiang of Qi had previously been having an affair with Duke Huan's wife.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "魯夫人者，襄公女弟也，自釐公時嫁為魯桓公婦，及桓公來而襄公復通焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu's wife was Xiang Gong's younger sister, from Xi Gong's time married as Lu Huan Gong's wife, and when Huan Gong came, Xiang Gong again communicated with her.",
              "idiomatic": "Duke Huan's wife was actually Duke Xiang's younger sister. She had been married to Duke Huan during Duke Xi's reign, but Duke Xiang resumed the affair when Duke Huan visited.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "魯桓公知之，怒夫人，夫人以告齊襄公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan discovered the affair and confronted his wife in anger. She informed Duke Xiang of Qi.",
              "idiomatic": "Duke Ping died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "齊襄公與魯君飲，醉之，使力士彭生抱上魯君車，因拉殺魯桓公，桓公下車則死矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Xiang Gong drank with the Lu ruler, intoxicated him, had strongman Peng Sheng lift and put the Lu ruler on his carriage, then pulled and killed Lu Huan Gong; Huan Gong got off the carriage and died.",
              "idiomatic": "Duke Xiang of Qi hosted a banquet for Duke Huan of Lu and got him drunk. He ordered the strongman Peng Sheng to carry the intoxicated duke onto his carriage. Once aboard, Peng Sheng tore Duke Huan's body apart, killing him instantly.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "魯人以為讓，而齊襄公殺彭生以謝魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Lu were outraged, so Duke Xiang executed Peng Sheng to appease them.",
              "idiomatic": "Duke Xuan succeeded him.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0095",
          "zh": "八年，伐紀，紀遷去其邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eight years later, Qi attacked the state of Ji, forcing them to abandon their capital.",
              "idiomatic": "He was ambitious.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0096",
          "zh": "十二年，初，襄公使連稱、管至父戍葵丘，瓜時而往，及瓜而代。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twelve years later: initially, Duke Xiang sent Lian Cheng and Guan Zhi Fu to garrison Kui Qiu. They were to go at melon-planting time and be replaced at melon-harvesting time.",
              "idiomatic": "He expanded Qi's territory.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "往戍一歲，卒瓜時而公弗為發代。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They served a full year in garrison. When melon-harvesting time came, the duke failed to send replacements.",
              "idiomatic": "They served a full year in garrison duty. When melon season arrived, the duke failed to send replacements.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "或為請代，公弗許。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When they requested to be relieved, the duke refused.",
              "idiomatic": "When they requested relief, the duke refused.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "故此二人怒，因公孫無知謀作亂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This angered the two men, who conspired with Gong Sun Wu Zhi to start a rebellion.",
              "idiomatic": "Lian Cheng and Guan Zhi Fu became angry and, together with their troops, attacked and assassinated the duke along with Bing Yan, Bin Xu Wu, and Bing Xi in the palace at Kui Qiu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "連稱有從妹在公宮，無寵，使之閒襄公，曰「事成以女為無知夫人」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lian Cheng had a younger sister in the duke's palace, without favor, had her spy on Xiang Gong, said 'if the affair succeeds, I will make you Wu Zhi's wife.'",
              "idiomatic": "Lian Cheng had a younger sister in the duke's harem who was out of favor. He had her spy on Duke Xiang and promised: 'If our plot succeeds, I'll make you Gong Sun Wu Zhi's wife.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "冬十二月，襄公游姑棼，遂獵沛丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twelfth month of winter, Duke Xiang visited Gufen and went hunting at Pei Qiu.",
              "idiomatic": "The duke became angry and shot at it. The pig transformed into a person and stood wailing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "見彘，從者曰「彭生」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Saw a pig, attendants said 'Peng Sheng.'",
              "idiomatic": "He saw a pig, and his attendants exclaimed: 'It's Peng Sheng!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "公怒，射之，彘人立而啼。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The duke became furious and shot at it. The pig transformed into a person and stood wailing.",
              "idiomatic": "Upon returning, he had Fu, the keeper of his shoes, whipped three hundred times.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "公懼，墜車傷足，失屨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Terrified, the duke fell from his carriage, injuring his foot and losing his shoe.",
              "idiomatic": "The people of Qi killed Gong Sun Wu Zhi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "反而鞭主屨者茀三百。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upon returning, he had Fu, the keeper of his shoes, whipped three hundred times.",
              "idiomatic": "Zhu Er then fled from Lu to Qi, and the people of Qi established him as ruler, making him Duke Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "茀出宮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fu fled the palace.",
              "idiomatic": "In the first year of Duke Huan, spring, Lord Wu Zhi was touring Yong Lin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "而無知、連稱、管至父等聞公傷，乃遂率其眾襲宮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Zhi, Lian Cheng, Guan Zhi Fu, and their accomplices learned of the duke's injury and immediately led their followers in an attack on the palace.",
              "idiomatic": "A man from Yong Lin who had long harbored resentment against Wu Zhi attacked and killed him when he came to tour.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "逢主屨茀，茀曰：「且無入驚宮，驚宮未易入也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Encountered the master of shoes Fu, Fu said: 'Do not enter yet and alarm the palace, alarming the palace is not easy to enter.'",
              "idiomatic": "They encountered Fu, the keeper of the duke's shoes. Fu warned them: 'Don't rush in and alarm the palace—once alarmed, it won't be easy to enter.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "無知弗信，茀示之創，乃信之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Zhi was skeptical, but when Fu showed him his whip wounds, he believed the story.",
              "idiomatic": "Duke Huan welcomed him from Ju.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "待宮外，令茀先入。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They waited outside the palace and sent Fu in first.",
              "idiomatic": "Initially, when the Yong Lin man killed Wu Zhi, Duke Huan in his youth had often played with the Yong Lin man.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "茀先入，即匿襄公戶閒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fu entered first and immediately concealed Duke Xiang behind the palace doors.",
              "idiomatic": "His younger brother Xiao Bai fled to Ju, where Bao Shu served as his tutor.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "良久，無知等恐，遂入宮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After waiting a long time, Wu Zhi and his accomplices grew fearful and finally entered the palace.",
              "idiomatic": "From a young age, Xiao Bai valued the words of worthy ministers and listened to Bao Shu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "茀反與宮中及公之幸臣攻無知等，不勝，皆死。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fu turned and with the palace people and the duke's favored ministers attacked Wu Zhi and others, did not win, all died.",
              "idiomatic": "Fu turned on them and, together with the palace guards and the duke's favorite ministers, fought Wu Zhi and his group. They were defeated and all killed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "無知入宮，求公不得。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Zhi entered the palace but could not find the duke.",
              "idiomatic": "Xiao Bai feared that Duke Huan would kill him, so he fled to Ju.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "或見人足於戶閒，發視，乃襄公，遂弒之，而無知自立為齊君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Some saw a person's feet between the door leaves, opened and looked, it was Xiang Gong, therefore assassinated him, and Wu Zhi established himself as Qi ruler.",
              "idiomatic": "Someone noticed feet visible between the palace doors. They opened them and found Duke Xiang hidden there. They assassinated him, and Wu Zhi proclaimed himself ruler of Qi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "桓公元年春，齊君無知游於雍林。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the first year of Duke Huan's reign, the Qi ruler Wu Zhi went touring at Yong Lin.",
              "idiomatic": "Shu Ya said: \"Prince Jiu is my relative. If I don't kill him, I'll be disobeying orders.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "雍林人嘗有怨無知，及其往游，雍林人襲殺無知，告齊大夫曰：「無知弒襄公自立，臣謹行誅。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yong Lin people once had resentment toward Wu Zhi, and when he went touring, Yong Lin people suddenly killed Wu Zhi, told Qi grand officers saying: 'Wu Zhi assassinated Xiang Gong and established himself, your servant respectfully executed punishment.",
              "idiomatic": "The people of Yong Lin had long harbored resentment toward Wu Zhi. When he came touring, they ambushed and killed him. They informed the Qi ministers: 'Wu Zhi assassinated Duke Xiang and usurped the throne. We have respectfully executed him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "唯大夫更立公子之當立者，唯命是聽。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Only grand officers change and establish the duke's son who should be established, only your command is obeyed.'",
              "idiomatic": "Please install whichever of the duke's sons should rightfully rule—we will obey your command.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0120",
          "zh": "初，襄公之醉殺魯桓公，通其夫人，殺誅數不當，淫於婦人，數欺大臣，群弟恐禍及，故次弟糾奔魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially, Xiang Gong's drunk killing of Lu Huan Gong, communicating with his wife, killing and punishing frequently improper, licentious with women, frequently deceiving ministers, the group of younger brothers feared calamity would reach them, therefore second younger brother Jiu fled to Lu.",
              "idiomatic": "Originally: Duke Xiang had gotten drunk and killed Duke Huan of Lu, then had an affair with his wife. He executed people unjustly, was licentious with women, and frequently deceived his ministers. His younger brothers feared they would be next, so the second youngest, Prince Jiu, fled to Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "其母魯女也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His mother was from the state of Lu.",
              "idiomatic": "Your lordship should employ them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "管仲、召忽傅之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong and Zhao Hu served as his tutors.",
              "idiomatic": "Do not let the governance of the state fall into the hands of other clans.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "次弟小白奔莒，鮑叔傅之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The youngest brother, Prince Xiao Bai, fled to Ju, where Bao Shu served as his tutor.",
              "idiomatic": "Duke Huan said: \"The feudal lords are encroaching on us. Can Qi remain secure?\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "小白母，衛女也，有寵於釐公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiao Bai's mother was a Wei woman, had favor with Xi Gong.",
              "idiomatic": "Xiao Bai's mother was from Wei and was favored by Duke Xi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "小白自少好善大夫高傒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From a young age, Xiao Bai admired and befriended the minister Gao Xi.",
              "idiomatic": "Duke Huan therefore followed his advice and entrusted governance to Gao Xi and Guo Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "及雍林人殺無知，議立君，高、國先陰召小白於莒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After the Yong Lin people assassinated Wu Zhi, the ministers discussed who should be the new ruler. Gao Xi and Guo secretly summoned Xiao Bai from Ju first.",
              "idiomatic": "Duke Huan treated Guan Zhong with great courtesy, appointed him as minister, and entrusted him with governing the state.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "魯聞無知死，亦發兵送公子糾，而使管仲別將兵遮莒道，射中小白帶鉤。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu heard Wu Zhi dead, also raised troops to send Prince Jiu, and had Guan Zhong separately lead troops to block the Ju road, shot and hit Xiao Bai's belt hook.",
              "idiomatic": "When Lu learned of Wu Zhi's death, they also sent troops to escort Prince Jiu home. Guan Zhong led a separate force to ambush the road from Ju and shot Xiao Bai, hitting his belt buckle.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "小白詳死，管仲使人馳報魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xiao Bai pretended to be dead, and Guan Zhong sent messengers galloping back to Lu with the news.",
              "idiomatic": "Upon returning from Ju, the people of Lu wanted to kill him, but Guan Zhong said: \"No.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "魯送糾者行益遲，六日至齊，則小白已入，高傒立之，是為桓公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Lu escort for Prince Jiu proceeded very slowly. By the time they reached Qi six days later, Xiao Bai had already arrived. Gao Xi installed him as ruler, and he became Duke Huan.",
              "idiomatic": "This is a worthy prince of the world. Killing him would bring misfortune.\"",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0130",
          "zh": "桓公之中鉤，詳死以誤管仲，已而載溫車中馳行，亦有高、國內應，故得先入立，發兵距魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong's being hit by the hook, feigned death to mislead Guan Zhong, then loaded in warm carriage galloped away, also had Gao and Guo internal response, therefore could enter first and be established, raised troops to resist Lu.",
              "idiomatic": "Duke Huan had been hit by Guan Zhong's arrow, but he faked his death to deceive Guan Zhong. Then he was loaded into a warm carriage and raced away. He also had supporters among Gao Xi and Guo inside Qi, which allowed him to arrive first and claim the throne. He then raised troops to oppose Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "秋，與魯戰于乾時，魯兵敗走，齊兵掩絕魯歸道。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Autumn, fought with Lu at Gan Shi, Lu troops defeated and fled, Qi troops ambushed and cut off Lu's return road.",
              "idiomatic": "In autumn, Qi fought Lu at Gan Shi. The Lu army was defeated and fled, while Qi troops ambushed and blocked their retreat.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "齊遺魯書曰：「子糾兄弟，弗忍誅，請魯自殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi sent Lu a letter saying: 'Zi Jiu is my brother, I cannot bear to execute him, please Lu kill him yourselves.",
              "idiomatic": "Qi sent a letter to Lu: 'Prince Jiu is my brother—I cannot bear to execute him myself. Please have Lu kill him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "召忽、管仲讎也，請得而甘心醢之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Hu, Guan Zhong are enemies, please obtain them and satisfy the heart by mincing them.'",
              "idiomatic": "Zhao Hu and Guan Zhong are my enemies. Please hand them over so I can take my revenge by having them minced.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "不然，將圍魯。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If not, will besiege Lu.'",
              "idiomatic": "Otherwise, I will besiege Lu.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "魯人患之，遂殺子糾于笙瀆。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Lu leaders were alarmed and had Prince Jiu executed at Sheng Stream.",
              "idiomatic": "Duke Huan followed his advice and appointed Guan Zhong to govern.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "召忽自殺，管仲請囚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Hu committed suicide in loyalty to his prince, while Guan Zhong agreed to be imprisoned.",
              "idiomatic": "In the second year, Qi conquered Tan, and the Lord of Tan fled to Ju.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "桓公之立，發兵攻魯，心欲殺管仲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After becoming duke, Huan Gong attacked Lu and harbored the desire to kill Guan Zhong.",
              "idiomatic": "In the third year, Duke Huan of Lu assassinated Duke Yin and established himself as ruler.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "鮑叔牙曰：「臣幸得從君，君竟以立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Shu Ya said: 'Your servant fortunately got to follow you, you ultimately became established.",
              "idiomatic": "Bao Shu Ya said: 'I was fortunate to serve you, and you have now become duke.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "君之尊，臣無以增君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Your lordship's honor, your servant has nothing to add to your lordship.",
              "idiomatic": "Your position as duke is already secure—I cannot enhance it further.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "君將治齊，即高傒與叔牙足也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If you simply want to rule Qi well, then Gao Xi and I are enough for the task.",
              "idiomatic": "In the sixth year, Qi rescued Yan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "君且欲霸王，非管夷吾不可。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "But if you aspire to become the hegemon king, then you absolutely need Guan Zhong.'",
              "idiomatic": "In the seventh year, Qi formed an alliance with Zheng at Ke.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "夷吾所居國國重，不可失也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Wu wherever he resides, state by state becomes important, cannot be lost.'",
              "idiomatic": "Wherever Guan Zhong serves, that state becomes powerful. You cannot afford to lose such a talent.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "於是桓公從之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan accepted this advice.",
              "idiomatic": "In the ninth year, Qi attacked Wei and defeated the Wei army at Gui Di.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "乃詳為召管仲欲甘心，實欲用之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He pretended to summon Guan Zhong for execution, but actually intended to employ him.",
              "idiomatic": "In the tenth year, Qi attacked the Shan Rong.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "管仲知之，故請往。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong understood the true intent and agreed to come.",
              "idiomatic": "In the eleventh year, Zheng invaded Zhou. Zhou was afraid and appealed to Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "鮑叔牙迎受管仲，及堂阜而脫桎梏，齋祓而見桓公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Shu Ya went to receive Guan Zhong. When they reached Tang Hill, he removed Guan Zhong's shackles, had him purified, and presented him to Duke Huan.",
              "idiomatic": "In the twelfth year, Qi attacked Zheng.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "桓公厚禮以為大夫，任政。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan received him with great honor, appointed him as minister, and entrusted him with governing the state.",
              "idiomatic": "In the thirteenth year, Qi executed the Yong Lin man in the palace.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "桓公既得管仲，與鮑叔、隰朋、高傒修齊國政，連五家之兵，設輕重魚鹽之利，以贍貧窮，祿賢能，齊人皆說。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong having obtained Guan Zhong, with Bao Shu, Xi Peng, Gao Xi repaired Qi state governance, connected five families' troops, established light heavy fish salt profits, to support the poor, reward worthy and able, Qi people all were pleased.",
              "idiomatic": "After gaining Guan Zhong, Duke Huan worked with Bao Shu, Xi Peng, and Gao Xi to reform Qi's government. They organized the military forces of five noble families, established monopolies on salt and fish to generate revenue, supported the poor, rewarded the worthy and talented, and all the people of Qi were content.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0149",
          "zh": "二年，伐滅郯，郯子奔莒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the second year, Qi conquered the state of Tan, and the Lord of Tan fled to Ju.",
              "idiomatic": "In the fourteenth year, Qi rescued Xu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "初，桓公亡時，過郯，郯無禮，故伐之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Originally, when Duke Huan was fleeing as a refugee, he passed through Tan and was treated discourteously, which is why he now attacked them.",
              "idiomatic": "In the fifteenth year, Qi attacked Wei and defeated the Wei army at Zhuang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0151",
          "zh": "五年，伐魯，魯將師敗。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth year, Qi attacked Lu and defeated their army.",
              "idiomatic": "In the sixteenth year, Qi attacked Lu and defeated the Lu army at Lang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "魯莊公請獻遂邑以平，桓公許，與魯會柯而盟。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Zhuang of Lu offered to cede the city of Sui to make peace. Duke Huan agreed and met with Lu at Ke to conclude an alliance.",
              "idiomatic": "In the seventeenth year, Qi formed an alliance at You.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "魯將盟，曹沬以匕首劫桓公於壇上，曰：「反魯之侵地！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu was about to ally, Cao Mo with dagger hijacked Huan Gong on the altar, said: 'Return Lu's invaded territory!'",
              "idiomatic": "As the alliance ceremony was about to begin, Cao Mo held a dagger to Duke Huan on the altar platform and demanded: 'Return the territory you seized from Lu!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "桓公許之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan agreed.",
              "idiomatic": "In the eighteenth year, Qi rescued Song.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "已而曹沬去匕首，北面就臣位。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cao Mo then put away his dagger, turned north to face the altar, and took his place as a minister.",
              "idiomatic": "In the nineteenth year, Qi attacked Song.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "桓公後悔，欲無與魯地而殺曹沬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan immediately regretted his promise and wanted to renege on returning the territory and kill Cao Mo.",
              "idiomatic": "In the twentieth year, Qi attacked Lu and defeated the Lu army at Cheng.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "管仲曰：「夫劫許之而倍信殺之，愈一小快耳，而棄信於諸侯，失天下之援，不可。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong said: 'Being hijacked and permitted but then betraying trust and killing, is only a small satisfaction, but abandons trustworthiness among feudal lords, loses the world's support, cannot.'",
              "idiomatic": "Guan Zhong said: 'Though you were coerced into agreeing, to go back on your word and kill him would only provide momentary satisfaction. But it would destroy your credibility among the feudal lords and forfeit the support of the entire world. That would be disastrous.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "於是遂與曹沬三敗所亡地於魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan therefore honored his promise and returned to Lu three times the territory that had been lost.",
              "idiomatic": "In the twenty-first year, Qi formed an alliance at Tao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "諸侯聞之，皆信齊而欲附焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the other feudal lords heard of this, they all came to trust Qi and sought to ally with it.",
              "idiomatic": "In the twenty-second year, Qi attacked Wei and defeated the Wei army at Xin Zhu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "七年，諸侯會桓公於甄，而桓公於是始霸焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventh year, the feudal lords gathered to meet Duke Huan at Zhen, and this marked the beginning of his hegemony.",
              "idiomatic": "In the twenty-third year, Qi attacked Ju.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0161",
          "zh": "十四年，陳厲公子完，號敬仲，來奔齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Fourteenth year, Chen Li Gong's son Wan, styled Jing Zhong, came fleeing to Qi.",
              "idiomatic": "In the fourteenth year, Prince Wan of Chen (son of Duke Li of Chen), who was styled Jing Zhong, fled to Qi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "齊桓公欲以為卿，讓；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Huan Gong wished to make him minister, declined;",
              "idiomatic": "Duke Huan of Qi wanted to appoint him as a minister, but he politely declined.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "於是以為工正。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So Duke Huan appointed him as Director of Works instead.",
              "idiomatic": "In the twenty-fourth year, Qi attacked Lu and defeated the Lu army at An.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "田成子常之祖也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Cheng Zi Chang's ancestor.",
              "idiomatic": "He was the ancestor of Tian Chengzi Chang.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0165",
          "zh": "二十三年，山戎伐燕，燕告急於齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-third year, the Shanrong barbarians attacked Yan. Yan urgently appealed to Qi for help.",
              "idiomatic": "In the twenty-fifth year, Qi attacked Lu and defeated the Lu army at Qian Shi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "齊桓公救燕，遂伐山戎，至于孤竹而還。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan of Qi went to Yan's aid and then attacked the Shanrong, advancing all the way to Gu Zhu before returning.",
              "idiomatic": "In the twenty-sixth year, Qi formed an alliance with Song at Gou Du.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "燕莊公遂送桓公入齊境。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Zhuang of Yan then escorted Duke Huan all the way into Qi territory.",
              "idiomatic": "In the twenty-seventh year, Qi attacked Xu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "桓公曰：「非天子，諸侯相送不出境，吾不可以無禮於燕。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong said: 'Not being Son of Heaven, feudal lords escorting each other do not go beyond the border, I cannot be discourteous to Yan.'",
              "idiomatic": "Duke Huan said: 'Only the Son of Heaven is escorted beyond borders by other rulers. I cannot treat Yan discourteously by letting them escort me further.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "於是分溝割燕君所至與燕，命燕君復修召公之政，納貢于周，如成康之時。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore dug moat divided the Yan lord's reached place with Yan, commanded Yan lord again repair Zhao Gong's governance, submit tribute to Zhou, like Cheng Kang time.",
              "idiomatic": "Duke Huan therefore demarcated the territory with a ditch where the Yan lord had escorted him, and ordered the Yan lord to restore the governance of Duke Zhao and resume tribute payments to Zhou, just as in the time of Kings Cheng and Kang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "諸侯聞之，皆從齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the other feudal lords heard of this, they all submitted to Qi's leadership.",
              "idiomatic": "In the twenty-eighth year, Qi made peace with Chu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0171",
          "zh": "二十七年，魯湣公母曰哀姜，桓公女弟也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Twenty-seventh year, Lu Min Gong's mother called Ai Jiang, Huan Gong's younger sister.",
              "idiomatic": "In the twenty-seventh year: the mother of Duke Min of Lu was named Ai Jiang, and she was Duke Huan's younger sister.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "哀姜淫於魯公子慶父，慶父弒湣公，哀姜欲立慶父，魯人更立釐公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ai Jiang had an affair with Prince Qing Fu of Lu. Qing Fu assassinated Duke Min, and Ai Jiang wanted to install Qing Fu as ruler. But the Lu people instead installed Duke Xi.",
              "idiomatic": "In the twenty-ninth year, Qi formed an alliance with Zheng at Ke.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "桓公召哀姜，殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan summoned Ai Jiang and had her executed.",
              "idiomatic": "In the thirtieth year, Qi attacked Lu and defeated the Lu army at Ge.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0174",
          "zh": "二十八年，衛文公有狄亂，告急於齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-eighth year, Duke Wen of Wei suffered attacks from the Di barbarians and urgently appealed to Qi for help.",
              "idiomatic": "In the thirty-first year, Qi formed an alliance with Chu at Shao Ling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "齊率諸侯城楚丘而立衛君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi led the feudal lords in fortifying Chu Qiu and reinstalling the ruler of Wei.",
              "idiomatic": "Qi led the feudal lords in fortifying Chu Qiu and reinstalling the ruler of Wei.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0176",
          "zh": "二十九年，桓公與夫人蔡姬戲船中。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-ninth year, Duke Huan was amusing himself on a boat with his wife, Lady Cai Ji.",
              "idiomatic": "In the twenty-ninth year, Duke Huan was amusing himself on a boat with his wife, Lady Cai Ji.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "蔡姬習水，蕩公，公懼，止之，不止，出船，怒，歸蔡姬，弗絕。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lady Cai, who was used to boating, rocked the boat violently. The duke became frightened and told her to stop, but she wouldn't. He left the boat in anger and sent her back to Cai, but did not divorce her.",
              "idiomatic": "蔡姬蕩公，公懼，出墮水。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "蔡亦怒，嫁其女。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cai was also angered and married off their daughter (to someone else).",
              "idiomatic": "Lady Cai rocked the boat violently. The duke became frightened and jumped out, falling into the water.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "桓公聞而怒，興師往伐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Duke Huan heard this, he became furious and launched a military campaign against Cai.",
              "idiomatic": "潛於水中，從者曰：「吾君何在？」",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0180",
          "zh": "三十年春，齊桓公率諸侯伐蔡，蔡潰。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the thirtieth year, Duke Huan of Qi led the feudal lords in attacking Cai, and Cai was defeated.",
              "idiomatic": "He hid underwater. His attendants asked: \"Where is our lord?\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "遂伐楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then attacked Chu.",
              "idiomatic": "蔡姬曰：「何有吾君！」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "楚成王興師問曰：「何故涉吾地？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chu Cheng Wang raised troops asked: 'Why invade my territory?'",
              "idiomatic": "King Cheng of Chu mobilized his army and demanded: 'Why have you entered my territory?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "管仲對曰：「昔召康公命我先君太公曰：『五侯九伯，若實征之，以夾輔周室。』",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong replied: 'Formerly Zhao Kang Gong commanded my ancestor Grand Duke saying: \"Five marquises nine earls, you truly may punish them, to assist Zhou court on both sides.\"'",
              "idiomatic": "Guan Zhong replied: 'In former times, Duke Zhao Kang commanded my ancestor the Grand Duke: \"For the five marquises and nine earls, you may indeed punish them to support the Zhou court from both sides.\"'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "賜我先君履，東至海，西至河，南至穆陵，北至無棣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He granted my ancestor territory extending east to the sea, west to the Yellow River, south to Mu Ling, and north to Wu Di.'",
              "idiomatic": "The duke peeked out and said: \"I am here.\"",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "楚貢包茅不入，王祭不具，是以來責。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chu has failed to submit its tribute of bundled thatch, leaving the king's sacrifices incomplete. That is why we have come to demand it.'",
              "idiomatic": "左右曰：「姦哉！」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "昭王南征不復，是以來問。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Wang south campaign not return, this comes to inquire.'",
              "idiomatic": "King Zhao's southern expedition from which he never returned—that is what we have come to inquire about.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "楚王曰：「貢之不入，有之，寡人罪也，敢不共乎！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chu Wang said: 'Tribute not entering, there is that, I the person crime, dare not supply!",
              "idiomatic": "The Chu king said: 'As for the tribute not being submitted, that is indeed the case. I am guilty. How dare I not provide it!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "昭王之出不復，君其問之水濱。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Wang's departure not return, my lord may ask it of the riverside.'",
              "idiomatic": "As for King Zhao's expedition from which he never returned, your lordship may inquire of the river spirits.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "齊師進次于陘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Qi army advanced and camped at Xing.",
              "idiomatic": "三十年春，齊桓公欲封衞，燕人伐齊，齊桓公救燕，遂伐宋，因而封衞。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "夏，楚王使屈完將兵捍齊，齊師退次召陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In summer, the Chu king sent Qu Wan to lead troops against Qi. The Qi army retreated and camped at Zhao Ling.",
              "idiomatic": "In the spring of the thirtieth year, Duke Huan of Qi wanted to enfeoff land to Wei. The Yan people attacked Qi. Duke Huan rescued Yan, then attacked Song, and in the process enfeoffed land to Wei.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "桓公矜屈完以其眾。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan took pity on Qu Wan and his forces.",
              "idiomatic": "三十一年，齊桓公遷邢於夷儀，王命以為衛。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "屈完曰：「君以道則可；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qu Wan said: 'If my lord uses the Way, then it is acceptable;",
              "idiomatic": "Qu Wan said: 'If your lordship acts according to proper principles, then it is acceptable.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "若不，則楚方城以為城，江、漢以為溝，君安能進乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "if not, then Chu Fang Cheng as city, Jiang, Han as moat, my lord how can advance?'",
              "idiomatic": "If not, then Chu will use Fang Cheng as its walls and the Jiang and Han rivers as its moat. How could your lordship advance?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "乃與屈完盟而去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan therefore concluded an alliance with Qu Wan and withdrew.",
              "idiomatic": "In the thirty-second year, Duke Huan of Qi attacked the Shan Rong to rescue Yan, relocated Yan to Lin Hu, installed a ruler, and returned.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "過陳，陳袁濤涂詐齊，令出東方，覺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the way back through Chen, Chen's minister Yuan Tao Tu tried to deceive Qi by ordering them to exit through the eastern gate, but the deception was discovered.",
              "idiomatic": "三十三年，齊桓公伐蔡，蔡潰，遂伐楚，次于陘。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "秋，齊伐陳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In autumn, Qi attacked Chen.",
              "idiomatic": "In the thirty-third year, Duke Huan of Qi attacked Cai. Cai collapsed, so he attacked Chu, halting at Xing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "是歲，晉殺太子申生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "That same year, the state of Jin executed its crown prince Shen Sheng.",
              "idiomatic": "三十四年，齊桓公會諸侯於葵丘。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0198",
          "zh": "三十五年夏，會諸侯于葵丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In summer of the thirty-fifth year, Duke Huan assembled the feudal lords at Kui Qiu.",
              "idiomatic": "In the thirty-fourth year, Duke Huan of Qi assembled the feudal lords at Kui Qiu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "周襄王使宰孔賜桓公文武胙、彤弓矢、大路，命無拜。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Xiang of Zhou sent his prime minister Kong to grant Duke Huan the sacrificial meats of Kings Wen and Wu, a red bow and arrows, and a grand chariot, commanding that he need not bow in thanks.",
              "idiomatic": "三十五年，齊桓公會諸侯於葵丘，葵丘之會，諸侯來賀。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "桓公欲許之，管仲曰「不可」，乃下拜受賜。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong wished to permit it, Guan Zhong said 'cannot', therefore descended and bowed to receive the grant.",
              "idiomatic": "Duke Huan wanted to accept without bowing, but Guan Zhong said 'That cannot be done.' So Duke Huan descended from his dais, bowed, and received the gifts.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "秋，復會諸侯於葵丘，益有驕色。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In autumn, he again assembled the feudal lords at Kui Qiu, and showed increasing signs of arrogance.",
              "idiomatic": "三十六年，齊桓公欲兵之會，兵車之會也。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "周使宰孔會。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Zhou court sent its prime minister Kong to attend the assembly.",
              "idiomatic": "In the thirty-sixth year, Duke Huan of Qi wanted a military assembly - an assembly of armed forces.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "諸侯頗有叛者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Several of the feudal lords began to show signs of rebellion.",
              "idiomatic": "三十七年，齊桓公會諸侯於趙，立太子昭為君。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "晉侯病，後，遇宰孔。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Marquis of Jin fell ill. Later, he encountered Prime Minister Kong.",
              "idiomatic": "In the thirty-seventh year, Duke Huan of Qi assembled the feudal lords at Zhao and installed Crown Prince Zhao as ruler.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "宰孔曰：「齊侯驕矣，弟無行。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Prime minister Kong said: 'Qi Hou arrogant now, younger brother no conduct.'",
              "idiomatic": "Prime Minister Kong said: 'The Marquis of Qi has become arrogant. His younger brother has no moral standing.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "從之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He heeded this advice.",
              "idiomatic": "In the thirty-eighth year, Duke Huan of Qi assembled with Jin and Wei at Jian Tu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "是歲，晉獻公卒，裏克殺奚齊、卓子，秦穆公以夫人入公子夷吾為晉君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "That same year, Duke Xian of Jin died. Li Ke assassinated Xi Qi and Zhuo Zi. Duke Mu of Qin installed Prince Yi Wu as ruler of Jin, using his own daughter as the prince's wife.",
              "idiomatic": "三十九年，齊桓公會諸侯于葵丘。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "桓公於是討晉亂，至高梁，使隰朋立晉君，還。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan therefore intervened in Jin's disorder. He advanced to Gao Liang, had Xi Peng install a ruler for Jin, and then returned home.",
              "idiomatic": "In the thirty-ninth year, Duke Huan of Qi assembled the feudal lords at Kui Qiu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0209",
          "zh": "是時周室微，唯齊、楚、秦、晉為彊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, the Zhou royal house had grown weak. Only Qi, Chu, Qin, and Jin remained powerful.",
              "idiomatic": "四十一年，齊桓公卒。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "晉初與會，獻公死，國內亂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin had initially participated in the assemblies, but after Duke Xian's death, the state fell into internal disorder.",
              "idiomatic": "In the forty-first year, Duke Huan of Qi died.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "秦穆公辟遠，不與中國會盟。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Mu of Qin kept his distance and did not participate in the assemblies of the central states.",
              "idiomatic": "易牙、豎刁、開方相與作亂，逐群公子，殺群公子。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "楚成王初收荊蠻有之，夷狄自置。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Cheng of Chu had recently conquered the Jing Man barbarians and incorporated their lands, establishing himself as a Yi Di power.",
              "idiomatic": "Yi Ya, Shu Diao, and Kai Fang conspired together to create chaos. They drove out the various princes and killed the various princes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "唯獨齊為中國會盟，而桓公能宣其德，故諸侯賓會。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Only Qi consistently organized the assemblies of the central states. Duke Huan was able to demonstrate his virtue, so the feudal lords attended as honored guests.",
              "idiomatic": "公子昭奔宋。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "於是桓公稱曰：「寡人南伐至召陵，望熊山；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore Huan Gong declared: 'I the person south attacked reached Zhao Ling, gazed at Xiong Shan;",
              "idiomatic": "Duke Huan then declared: 'I campaigned south as far as Zhao Ling and gazed upon Xiong Mountain;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "北伐山戎、離枝、孤竹；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "north attacked Shan Rong, Li Zhi, Gu Zhu;",
              "idiomatic": "I campaigned north against the Shanrong, Li Zhi, and Gu Zhu;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "西伐大夏，涉流沙；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "west attacked Da Xia, crossed flowing sands;",
              "idiomatic": "I campaigned west against Da Xia, crossing the flowing sands;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "束馬懸車登太行，至卑耳山而還。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I bound my horses and suspended my chariots to climb Mount Taihang, reaching Mount Bei'er before returning.",
              "idiomatic": "宋襄公率諸侯伐齊，南至楚丘，以王命討之。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "諸侯莫違寡人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "None of the feudal lords have defied me.",
              "idiomatic": "齊孝公立。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "寡人兵車之會三，乘車之會六，九合諸侯，一匡天下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I have held three assemblies with war chariots and six with carriages. I have united the feudal lords nine times and rectified the world once.'",
              "idiomatic": "Duke Xiao of Qi was established.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "昔三代受命，有何以異於此乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Former three dynasties received mandate, had what different from this?",
              "idiomatic": "How do the Three Dynasties of old receiving the mandate differ from this?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "吾欲封泰山，禪梁父。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I wish feng Tai Shan, chan Liang Fu.'",
              "idiomatic": "I wish to perform the feng sacrifice on Mount Tai and the chan sacrifice at Liang Fu.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "管仲固諫，不聽；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong firmly advised, did not listen;",
              "idiomatic": "Guan Zhong strongly advised against it, but Duke Huan would not listen.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "乃說桓公以遠方珍怪物至乃得封，桓公乃止。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So Guan Zhong persuaded Duke Huan that the precious and strange objects from distant lands must arrive before the feng sacrifice could be performed. Duke Huan then abandoned the idea.",
              "idiomatic": "In the second year, the feudal lords fortified Chu Qiu.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": null,
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0224",
          "zh": "三十八年，周襄王弟帶與戎、翟合謀伐周，齊使管仲平戎於周。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the thirty-eighth year, Prince Dai (younger brother of King Xiang of Zhou) conspired with the Rong and Di barbarians to attack Zhou. Qi sent Guan Zhong to pacify the Rong barbarians on Zhou's behalf.",
              "idiomatic": "三年，齊孝公請諸侯城邢。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "周欲以上卿禮管仲，管仲頓首曰：「臣陪臣，安敢！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou wished with upper minister ceremony Guan Zhong, Guan Zhong knocked head said: 'Subject attendant minister, how dare!'",
              "idiomatic": "Zhou wished to receive Guan Zhong with the ceremony due an upper minister. Guan Zhong bowed his head to the ground and said: 'I am but a minister of a minister—how dare I accept such honor!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "三讓，乃受下卿禮以見。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After declining three times, he finally accepted the ceremony appropriate for a lower minister and was presented to the king.",
              "idiomatic": "四年，諸侯城邯鄲。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "三十九年，周襄王弟帶來奔齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the thirty-ninth year, Prince Dai (younger brother of King Xiang of Zhou) fled to Qi.",
              "idiomatic": "In the fourth year, the feudal lords fortified Han Dan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "齊使仲孫請王，為帶謝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi sent Zhong Sun to petition the king and apologize on Dai's behalf.",
              "idiomatic": "五年，齊孝公卒，子昭公潘立。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "襄王怒，弗聽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Xiang was furious and refused to listen.",
              "idiomatic": "In the fifth year, Duke Xiao of Qi died, and his son Duke Zhao Pan ascended.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0230",
          "zh": "四十一年，秦穆公虜晉惠公，復歸之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-first year, Duke Mu of Qin captured Duke Hui of Jin but then released him.",
              "idiomatic": "昭公之元年，七月，宋襄公及楚人伐齊，齊師敗績，獲齊侯。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "是歲，管仲、隰朋皆卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "That same year, both Guan Zhong and Xi Peng died.",
              "idiomatic": "In the first year of Duke Zhao, seventh month, Duke Xiang of Song and the Chu people attacked Qi. The Qi army suffered defeat, and the Marquis of Qi was captured.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "管仲病，桓公問曰：「群臣誰可相者？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong ill, Huan Gong asked: 'Among the ministers who can be chancellor?'",
              "idiomatic": "Guan Zhong fell ill. Duke Huan asked him: 'Which of my ministers is suitable to serve as chancellor?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "管仲曰：「知臣莫如君。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong said: 'Know ministers none like lord.'",
              "idiomatic": "Guan Zhong replied: 'No one knows your ministers better than you do, my lord.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "公曰：「易牙如何？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong said: 'Yi Ya how?'",
              "idiomatic": "The duke asked: 'What about Yi Ya?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "對曰：「殺子以適君，非人情，不可。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied: 'Killed son to please lord, not human feeling, cannot.'",
              "idiomatic": "Guan Zhong replied: 'He cooked his own son to please you. That's unnatural and unacceptable.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "公曰：「開方如何？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong said: 'Kai Fang how?'",
              "idiomatic": "The duke asked: 'What about Kai Fang?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "對曰：「倍親以適君，非人情，難近。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied: 'Abandoned parents to please lord, not human feeling, difficult to approach.'",
              "idiomatic": "Guan Zhong replied: 'He abandoned his parents to please you. That's unnatural and makes him dangerous to be around.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "公曰：「豎刀如何？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong said: 'Shu Dao how?'",
              "idiomatic": "The duke asked: 'What about Shu Dao?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "對曰：「自宮以適君，非人情，難親。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied: 'Self-castrated to please lord, not human feeling, difficult to be close to.'",
              "idiomatic": "Guan Zhong replied: 'He castrated himself to please you. That's unnatural and makes him dangerously untrustworthy.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "管仲死，而桓公不用管仲言，卒近用三子，三子專權。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guan Zhong died, and Huan Gong did not use Guan Zhong's words, finally approached and used three sons, three sons monopolized power.",
              "idiomatic": "After Guan Zhong's death, Duke Huan ignored his advice and grew close to these three treacherous favorites, allowing them to monopolize power.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0241",
          "zh": "四十二年，戎伐周，周告急於齊，齊令諸侯各發卒戍周。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-second year, the Rong barbarians attacked Zhou. Zhou urgently appealed to Qi, which ordered all the feudal lords to send troops to defend Zhou.",
              "idiomatic": "懿公之二年，春，宋伐齊，至衛。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "是歲，晉公子重耳來，桓公妻之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This year, Jin prince Chong Er came, Huan Gong married him [to a daughter].",
              "idiomatic": "That same year, Prince Chong Er of Jin arrived, and Duke Huan gave him one of his daughters in marriage.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "四十三年。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-third year:",
              "idiomatic": "In the third year, Song attacked Qi. The Qi army suffered defeat, and the people of Qi killed Duke Yi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "初，齊桓公之夫人三：曰王姬、徐姬、蔡姬，皆無子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Initially, Qi Huan Gong's wives three: called Wang Ji, Xu Ji, Cai Ji, all had no sons.",
              "idiomatic": "Originally, Duke Huan of Qi had three principal wives: Lady Wang, Lady Xu, and Lady Cai, but none had borne him sons.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "桓公好內，多內寵，如夫人者六人，長衛姬，生無詭；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong fond of women, many inner favorites, like wives six people, elder Wei Ji, gave birth Wu Gui;",
              "idiomatic": "Duke Huan was enamored with women and had many favorites in his harem. He had six concubines of wife-like status. The eldest, Lady Wei, bore him Wu Gui;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "少衛姬，生惠公元；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "younger Wei Ji, gave birth Hui Gong Yuan;",
              "idiomatic": "the younger Lady Wei bore him Hui Gong Yuan;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "鄭姬，生孝公昭；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zheng Ji, gave birth Xiao Gong Zhao;",
              "idiomatic": "Lady Zheng bore him Xiao Gong Zhao;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "葛嬴，生昭公潘；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ge Ying, gave birth Zhao Gong Pan;",
              "idiomatic": "Lady Ge bore him Zhao Gong Pan;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "密姬，生懿公商人；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Mi Ji, gave birth Yi Gong Shang Ren;",
              "idiomatic": "Lady Mi bore him Yi Gong Shang Ren;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "宋華子，生公子雍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lady Hua of Song bore him Prince Yong.",
              "idiomatic": "齊人共立惠公之子元，是為頃公。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "桓公與管仲屬孝公於宋襄公，以為太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Huan and Guan Zhong entrusted Duke Xiao to Duke Xiang of Song as a hostage, designating him as crown prince.",
              "idiomatic": "The people of Qi together established Duke Hui's son Yuan as Duke Qing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "雍巫有寵於衛共姬，因宦者豎刀以厚獻於桓公，亦有寵，桓公許之立無詭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The shaman Yong Wu was favored by Lady Wei. Through the eunuch Shu Dao, he made lavish gifts to Duke Huan and gained his favor. Duke Huan agreed to establish Wu Gui as heir.",
              "idiomatic": "頃公之元年，宋伐齊，齊人殺頃公。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "管仲卒，五公子皆求立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After Guan Zhong's death, all five of Duke Huan's sons vied for the throne.",
              "idiomatic": "In the first year of Duke Qing, Song attacked Qi, and the people of Qi killed Duke Qing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "冬十月乙亥，齊桓公卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the yi hai day of the tenth month in winter, Duke Huan of Qi died.",
              "idiomatic": "齊人共立頃公之子無野，是為靈公。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "易牙入，與豎刀因內寵殺群吏，而立公子無詭為君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Ya entered the palace and, together with Shu Dao, used the harem favorites to kill the chief officials and install Prince Wu Gui as ruler.",
              "idiomatic": "The people of Qi together established Duke Qing's son Wu Ye as Duke Ling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "太子昭奔宋。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Crown Prince Zhao fled to the state of Song.",
              "idiomatic": "靈公之元年，宋伐齊，齊人殺靈公。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "桓公病，五公子各樹黨爭立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "While Duke Huan lay ill, his five sons each built factions and fought to be named heir.",
              "idiomatic": "While Duke Huan lay ill, his five sons each built factions and fought to be named heir.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "及桓公卒，遂相攻，以故宮中空，莫敢棺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After Duke Huan's death, the factions attacked each other. The palace was deserted, and no one dared to prepare his coffin.",
              "idiomatic": "After Duke Huan's death, the factions attacked each other. The palace was deserted, and no one dared to prepare his coffin.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "桓公尸在床上六十七日，尸蟲出于戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong's corpse on bed sixty-seven days, corpse worms came out the door.",
              "idiomatic": "Duke Huan's body lay on the bed for sixty-seven days, with maggots crawling out through the door.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "十二月乙亥，無詭立，乃棺赴。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the yi hai day of the twelfth month, Wu Gui was installed as duke. Only then was the body coffined and the funeral procession begun.",
              "idiomatic": "Duke Huan's corpse lay on the bed for sixty-seven days, with corpse worms crawling out through the doorway.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "辛巳夜，斂殯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "That night (xin si), the body was dressed and placed in the coffin.",
              "idiomatic": "On the yi hai day of the twelfth month, at night, Duke Huan rose from his corpse and lay down with Yi Ya's head as his pillow.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0262",
          "zh": "桓公十有餘子，要其後立者五人：無詭立三月死，無謚；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Huan Gong ten plus sons, summarizing those later established five people: Wu Gui established three months died, no posthumous name;",
              "idiomatic": "Duke Huan had more than ten sons. In summary, five of them later became rulers: Wu Gui ruled for three months and died without a posthumous title;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "次孝公；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "next Xiao Gong;",
              "idiomatic": "next Duke Xiao;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "次昭公；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "next Zhao Gong;",
              "idiomatic": "next Duke Zhao;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "次懿公；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "next Yi Gong;",
              "idiomatic": "next Duke Yi;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "次惠公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "next Duke Hui.",
              "idiomatic": "桓公病而亂作，國人分散，六嬖各將其黨宮中而戰。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "孝公元年三月，宋襄公率諸侯兵送齊太子昭而伐齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the third month of Duke Xiao's first year, Duke Xiang of Song led the troops of the feudal lords to escort Prince Zhao of Qi and attack Qi.",
              "idiomatic": "When Duke Huan fell ill and chaos erupted, the people scattered. The six favored concubines each led their factions and fought in the palace.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "齊人恐，殺其君無詭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Qi, in fear, assassinated their ruler Wu Gui.",
              "idiomatic": "宋雍巫有寵於衛共姬，因宦者豎刀以厚獻于桓公，亦有寵，桓公許之立無詭。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "齊人將立太子昭，四公子之徒攻太子，太子走宋，宋遂與齊人四公子戰。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi people about to establish crown prince Zhao, four princes' followers attacked crown prince, crown prince fled Song, Song then with Qi people's four princes fought.",
              "idiomatic": "As the people of Qi were about to install Crown Prince Zhao, the followers of the four other princes attacked him. Zhao fled to Song, and Song then fought against the four Qi princes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "五月，宋敗齊四公子師而立太子昭，是為齊孝公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month, Song defeated the army of the four Qi princes and installed Crown Prince Zhao as ruler, who became Duke Xiao of Qi.",
              "idiomatic": "雍巫遂偵齊亂，便殺群公子。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "宋以桓公與管仲屬之太子，故來征之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Song acted because Duke Huan and Guan Zhong had entrusted Prince Zhao to Duke Xiang as crown prince, so they came to enforce this.",
              "idiomatic": "Yong Wu therefore watched for the chaos in Qi and took advantage to kill all the princes.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "以亂故，八月乃葬齊桓公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Due to the disorder, Duke Huan of Qi was not buried until the eighth month.",
              "idiomatic": "已殺孝公、潘父，獨殺公子無詭、公子雍及公孫婼、公孫強。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0273",
          "zh": "六年春，齊伐宋，以其不同盟于齊也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the sixth year, Qi attacked Song because Song had not allied with Qi.",
              "idiomatic": "He had already killed Duke Xiao and Pan Fu, but spared Prince Wu Gui, Prince Yong, and the grandsons Jiao and Qiang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "夏，宋襄公卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In summer, Duke Xiang of Song died.",
              "idiomatic": "雍巫曰：「同母者，歸之；不同母者，殺之。」",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "七年，晉文公立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventh year, Duke Wen of Jin ascended the throne.",
              "idiomatic": "Yong Wu said: \"Those of the same mother, send them away; those of different mothers, kill them.\"",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0276",
          "zh": "十年，孝公卒，孝公弟潘因衛公子開方殺孝公子而立潘，是為昭公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth year, Xiao Gong died, Xiao Gong's younger brother Pan relied on Wei prince Kai Fang killed Xiao Gong's son and established Pan, this was Zhao Gong.",
              "idiomatic": "In the tenth year, Duke Xiao died. His younger brother Pan, with the help of Prince Kai Fang of Wei, assassinated Duke Xiao's son and installed Pan as ruler, who became Duke Zhao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "昭公，桓公子也，其母曰葛嬴。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong, Huan Gong's son, his mother called Ge Ying.",
              "idiomatic": "Duke Zhao was a son of Duke Huan, and his mother was named Lady Ge.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0278",
          "zh": "昭公元年，晉文公敗楚於城濮，而會諸侯踐土，朝周，天子使晉稱伯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Zhao's first year, Duke Wen of Jin defeated Chu at the Battle of Chengpu, assembled the feudal lords at Jiantu, paid homage to the Zhou court, and the Son of Heaven granted Jin the title of overlord.",
              "idiomatic": "雍巫立無詭之子為君，是為襄王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "六年，翟侵齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth year, the Di barbarians invaded Qi.",
              "idiomatic": "Yong Wu established Wu Gui's son as ruler, making him King Xiang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "晉文公卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Wen of Jin died.",
              "idiomatic": "襄王元年，宋襄公率諸侯伐齊，齊師敗績，獲齊侯。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "秦兵敗於殽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qin forces were defeated at the Battle of Xiao.",
              "idiomatic": "In the first year of King Xiang, Duke Xiang of Song led the feudal lords to attack Qi. The Qi army suffered defeat, and the Marquis of Qi was captured.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "十二年，秦穆公卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twelfth year, Duke Mu of Qin died.",
              "idiomatic": "宋以衞公子買為質，齊求其赦。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0283",
          "zh": "十九年五月，昭公卒，子舍立為齊君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month of the nineteenth year, Duke Zhao died and his son She was installed as ruler of Qi.",
              "idiomatic": "Song held Prince Mai of Wei as hostage, and Qi sought his release.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "捨之母無寵於昭公，國人莫畏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "She's mother had no favor with Zhao Gong, state people none feared.",
              "idiomatic": "She's mother had no favor with Duke Zhao, so the people of the state had no respect for him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "昭公之弟商人以桓公死爭立而不得，陰交賢士，附愛百姓，百姓說。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Gong's younger brother Shang Ren because Huan Gong death contended for establishment but did not obtain, secretly befriended worthy scholars, attached and loved the common people, common people pleased.",
              "idiomatic": "Duke Zhao's younger brother Shang Ren had vied for the throne after Duke Huan's death but failed. He secretly cultivated relationships with worthy scholars and endeared himself to the common people, who were pleased with him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "及昭公卒，子舍立，孤弱，即與眾十月即墓上弒齊君舍，而商人自立，是為懿公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After Duke Zhao's death, his son She was installed as ruler, but he was isolated and weak. In the tenth month, Shang Ren led a crowd to assassinate Duke She on his father's tomb and installed himself as ruler, becoming Duke Yi.",
              "idiomatic": "齊人共立宋雍巫之弟為君，是為惠王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "懿公，桓公子也，其母曰密姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Gong, Huan Gong's son, his mother called Mi Ji.",
              "idiomatic": "Duke Yi was a son of Duke Huan, and his mother was named Lady Mi.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0288",
          "zh": "懿公四年春，初，懿公為公子時，與丙戎之父獵，爭獲不勝，及即位，斷丙戎父足，而使丙戎仆。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Gong fourth year spring, initially, Yi Gong as prince time, with Bing Rong's father hunted, contended for catch not win, and when ascended throne, cut off Bing Rong's father feet, and made Bing Rong serve.",
              "idiomatic": "In spring of Duke Yi's fourth year: originally, when Duke Yi was still a prince, he hunted with Bing Rong's father and lost a contest over a catch. After becoming duke, he had Bing Rong's father mutilated by cutting off his feet, and forced Bing Rong to serve as his attendant.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "庸職之妻好，公內之宮，使庸職驂乘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yong Zhi's wife beautiful, duke took her into palace, made Yong Zhi serve as secondary charioteer.",
              "idiomatic": "Yong Zhi's wife was beautiful, so the duke took her into his palace and made Yong Zhi serve as his secondary charioteer.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "五月，懿公游於申池，二人浴，戲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month, Duke Yi went touring at Shen Pool. The two men bathed there and played around.",
              "idiomatic": "二年，宋伐齊，齊人殺惠王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "職曰：「斷足子！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhi said: 'Cut feet son!'",
              "idiomatic": "Yong Zhi said: 'You son who cut off feet!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0292",
          "zh": "戎曰：「奪妻者！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rong said: 'Seize wife person!'",
              "idiomatic": "Bing Rong said: 'You who seized my wife!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "二人俱病此言，乃怨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Both men were enraged by these words and harbored deep resentment.",
              "idiomatic": "The people of Qi together established Song Yong Wu's son as ruler, making him King Qing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "謀與公游竹中，二人弒懿公車上，棄竹中而亡去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They conspired to accompany the duke on a tour of the bamboo grove. The two men assassinated Duke Yi right on his carriage, abandoned his body in the bamboo grove, and fled.",
              "idiomatic": "頃王元年，宋伐齊，齊人殺頃王。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "懿公之立，驕，民不附。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yi Gong's establishment, arrogant, people not attached.",
              "idiomatic": "During Duke Yi's reign, he was arrogant and the people did not support him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "齊人廢其子而迎公子元於衛，立之，是為惠公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Qi deposed Duke Yi's son and went to Wei to welcome Prince Yuan, installing him as ruler, who became Duke Hui.",
              "idiomatic": "齊人共立宋雍巫之弟為君，是為靈王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "惠公，桓公子也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Hui Gong, Huan Gong's son.",
              "idiomatic": "Duke Hui was a son of Duke Huan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "其母衛女，曰少衛姬，避齊亂，故在衛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His mother was a woman from Wei, called Younger Lady Wei. She had fled to Wei to avoid the chaos in Qi.",
              "idiomatic": "靈王元年，宋伐齊，齊人殺靈王。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0299",
          "zh": "惠公二年，長翟來，王子城父攻殺之，埋之於北門。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Hui's second year, the Changdi barbarians came. Wang Zi Cheng Fu attacked and killed them, burying the bodies at the north gate.",
              "idiomatic": "In the first year of King Ling, Song attacked Qi, and the people of Qi killed King Ling.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "晉趙穿弒其君靈公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Chuan of Jin assassinated his ruler Duke Ling.",
              "idiomatic": "齊人共立宋雍巫之子為君，是為莊王。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0301",
          "zh": "十年，惠公卒，子頃公無野立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the tenth year, Duke Hui died and his son Duke Qing (Wu Ye) succeeded him.",
              "idiomatic": "The people of Qi together established Song Yong Wu's son as ruler, making him King Zhuang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "初，崔杼有寵於惠公，惠公卒，高、國畏其偪也，逐之，崔杼奔衛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Originally, Cui Zhu was favored by Duke Hui. After Duke Hui's death, Gao Xi and Guo feared Cui Zhu's overbearing influence and drove him out. Cui Zhu fled to Wei.",
              "idiomatic": "莊王元年，宋伐齊，齊人殺莊王。",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0303",
          "zh": "頃公元年，楚莊王彊，伐陳；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Gong first year, Chu Zhuang Wang strong, attacked Chen;",
              "idiomatic": "In Duke Qing's first year, King Zhuang of Chu was powerful and attacked Chen;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "二年，圍鄭，鄭伯降，已復國鄭伯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second year, besieged Zheng, Zheng Bo surrendered, then restored Zheng Bo's state.",
              "idiomatic": "In the second year, Chu besieged Zheng. The Marquis of Zheng surrendered, but Chu then restored his state to him.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0305",
          "zh": "六年春，晉使郤克於齊，齊使夫人帷中而觀之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the sixth year, Jin sent Xi Ke as envoy to Qi. Qi had their consort observe him from behind a curtain.",
              "idiomatic": "The people of Qi together established Song Yong Wu's younger brother as ruler, making him King Jing.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "郤克上，夫人笑之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "As Xi Ke climbed the steps, the consort laughed at him.",
              "idiomatic": "景王元年，宋伐齊，齊人殺景王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "郤克曰：「不是報，不復涉河！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi Ke said: 'If not revenge, will not again cross river!'",
              "idiomatic": "Xi Ke declared: 'If I don't avenge this insult, I will never cross the Yellow River again!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "歸，請伐齊，晉侯弗許。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upon returning to Jin, Xi Ke requested permission to attack Qi, but the Marquis of Jin refused.",
              "idiomatic": "齊人共立宋雍巫之子為君，是為悼王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "齊使至晉，郤克執齊使者四人河內，殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Qi envoys arrived in Jin, Xi Ke seized four of them south of the Yellow River and executed them.",
              "idiomatic": "The people of Qi together established Song Yong Wu's son as ruler, making him King Dao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "八年。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighth year:",
              "idiomatic": "悼王元年，宋伐齊，齊人殺悼王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "晉伐齊，齊以公子彊質晉，晉兵去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin attacked Qi. Qi sent Prince Qiang as a hostage to Jin, and the Jin forces withdrew.",
              "idiomatic": "In the first year of King Dao, Song attacked Qi, and the people of Qi killed King Dao.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "十年春，齊伐魯、衛。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of the tenth year, Qi attacked Lu and Wei.",
              "idiomatic": "齊人共立宋雍巫之弟為君，是為簡王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "魯、衛大夫如晉請師，皆因郤克。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ministers from Lu and Wei went to Jin requesting military aid, and all approached Xi Ke.",
              "idiomatic": "The people of Qi together established Song Yong Wu's younger brother as ruler, making him King Jian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "晉使郤克以車八百乘為中軍將，士燮將上軍，欒書將下軍，以救魯、衛，伐齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin appointed Xi Ke as commander of the central army with 800 chariots, Shi Xie as commander of the upper army, and Luan Shu as commander of the lower army, to rescue Lu and Wei by attacking Qi.",
              "idiomatic": "簡王元年，宋伐齊，齊人殺簡王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "六月壬申，與齊侯兵合靡笄下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the ren shen day of the sixth month, the Jin forces joined battle with Duke Qing of Qi's army below Mi Ji Hill.",
              "idiomatic": "In the first year of King Jian, Song attacked Qi, and the people of Qi killed King Jian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "癸酉，陳于礱逄丑父為齊頃公右。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gui you, arrayed at Long, Pang Chou Fu as Qi Qing Gong's right.",
              "idiomatic": "On gui you, the battle lines formed at Long Hill, with Pang Chou Fu serving as Duke Qing of Qi's chariot driver.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "頃公曰：「馳之，破晉軍會食。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Gong said: 'Charge them, break Jin army will gather to eat.'",
              "idiomatic": "Duke Qing commanded: 'Charge! Break the Jin army and we'll dine together on the victory.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "射傷郤克，流血至履。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "An arrow wounded Xi Ke, and blood flowed down to his shoes.",
              "idiomatic": "平王元年，宋伐齊，齊人殺平王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "克欲還入壁，其御曰：「我始入，再傷，不敢言疾，恐懼士卒，願子忍之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ke wished to return enter fortifications, his charioteer said: 'I begin enter, twice wounded, dare not speak pain, fear terrify soldiers, wish you endure it.'",
              "idiomatic": "Xi Ke wanted to retreat into the fortifications, but his charioteer said: 'When we first entered battle, you were wounded twice. I didn't dare mention your pain, fearing it would demoralize the troops. Please endure it.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "遂復戰。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So they resumed fighting.",
              "idiomatic": "齊人共立宋雍巫之弟為君，是為宣王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "戰，齊急，丑父恐齊侯得，乃易處，頃公為右，車絓於木而止。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the heat of battle, the Qi forces were in dire straits. Chou Fu feared Duke Qing would be captured, so he switched positions with him, making the duke his charioteer. The chariot then caught on a tree and stopped.",
              "idiomatic": "The people of Qi together established Song Yong Wu's younger brother as ruler, making him King Xuan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "晉小將韓厥伏齊侯車前，曰「寡君使臣救魯、衛」，戲之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin young general Han Jue hid Qi Hou chariot front, said 'my lord sent minister rescue Lu, Wei', mocked him.",
              "idiomatic": "The young Jin general Han Jue hid in front of Duke Qing's chariot and taunted him: 'My lord sent me to rescue Lu and Wei,' and mocked him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "丑父使頃公下取飲，因得亡，脫去，入其軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chou Fu ordered Duke Qing to dismount and fetch water. While he was gone, Chou Fu escaped in the chariot and rejoined the Qi army.",
              "idiomatic": "In the first year of King Xuan, Song attacked Qi, and the people of Qi killed King Xuan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0324",
          "zh": "晉郤克欲殺丑父。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi Ke of Jin wanted to execute Chou Fu.",
              "idiomatic": "齊人共立宋雍巫之子為君，是為湣王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "丑父曰：「代君死而見僇，後人臣無忠其君者矣。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Chou Fu said: 'Substitute death for lord and be mutilated, later ministers none loyal to their lords.'",
              "idiomatic": "Chou Fu said: 'If I am executed for taking my lord's place in death, future ministers will have no reason to be loyal to their lords.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "克捨之，丑父遂得亡歸齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Xi Ke released him, and Chou Fu was able to escape back to Qi.",
              "idiomatic": "湣王元年，宋伐齊，齊人殺湣王。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "於是晉軍追齊至馬陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Jin army then pursued the Qi forces all the way to Ma Ling.",
              "idiomatic": "In the first year of King Min, Song attacked Qi, and the people of Qi killed King Min.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "齊侯請以寶器謝，不聽；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi Hou requested with precious vessels apologize, not listened;",
              "idiomatic": "Duke Qing of Qi offered precious vessels as compensation, but Jin refused.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "必得笑克者蕭桐叔子，令齊東畝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin demanded the woman who had laughed at Xi Ke—Xiao Tong Shu Zi—and also wanted Qi to cede its eastern territories.",
              "idiomatic": "The people of Qi together established Song Yong Wu's younger brother as ruler, making him King Xiang.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "對曰：「叔子，齊君母。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied: 'Shu Zi, Qi jun mother.",
              "idiomatic": "The Qi representative replied: 'Shu Zi is the mother of our ruler.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "齊君母亦猶晉君母，子安置之？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi jun mother also like Jin jun mother, son how place it?'",
              "idiomatic": "The mother of our ruler is just like the mother of your ruler. How would you handle it?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "且子以義伐而以暴為後，其可乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Moreover you with righteousness attack but with violence as consequence, can it?'",
              "idiomatic": "Moreover, you attacked us claiming righteous cause, but now follow up with violence. Is this acceptable?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "於是乃許，令反魯、衛之侵地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore then permitted, ordered return Lu, Wei's invaded lands.",
              "idiomatic": "Jin finally agreed and ordered the return of the territories taken from Lu and Wei.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0334",
          "zh": "十一年，晉初置六卿，賞鞌之功。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eleventh year, Jin first established the six ministerial houses, rewarding those who had served at the Battle of An.",
              "idiomatic": "王建元年，宋伐齊，齊人殺王建。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "齊頃公朝晉，欲尊王晉景公，晉景公不敢受，乃歸。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Qing of Qi went to Jin to pay homage and wanted to bestow royal honors on Duke Jing of Jin. Duke Jing did not dare accept them, so Duke Qing returned home.",
              "idiomatic": "In the first year of King Jian, Song attacked Qi, and the people of Qi killed King Jian.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "歸而頃公弛苑囿，薄賦斂，振孤問疾，虛積聚以救民，民亦大說。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Upon returning, Duke Qing opened up the royal gardens and parks, reduced taxes and levies, provided relief to orphans and visited the ill, and distributed grain reserves to aid the people. The people were greatly pleased.",
              "idiomatic": "齊人共立王建之子假為君，是為王假。",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0337",
          "zh": "厚禮諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He treated the feudal lords with generous courtesy.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "竟頃公卒，百姓附，諸侯不犯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Duke Qing finally died, the common people were devoted to him, and no feudal lord dared attack Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0339",
          "zh": "十七年，頃公卒，子靈公環立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventeenth year, Duke Qing died and his son Duke Ling (Huan) succeeded him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0340",
          "zh": "靈公九年，晉欒書弒其君厲公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Ling's ninth year, Luan Shu of Jin assassinated his ruler Duke Li.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "十年，晉悼公伐齊，齊令公子光質晉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the tenth year, Duke Dao of Jin attacked Qi, and Qi sent Prince Guang as a hostage to Jin.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "十九年，立子光為太子，高厚傅之，令會諸侯盟於鐘離。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the nineteenth year, Duke Ling established his son Guang as crown prince, with Gao Hou as his tutor, and ordered him to convene the feudal lords for an alliance at Zhong Li.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "二十七年，晉使中行獻子伐齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-seventh year, Jin sent Zhong Xing Xian Zi to attack Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0344",
          "zh": "齊師敗，靈公走入臨菑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Qi army was defeated, and Duke Ling fled into Linzi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "晏嬰止靈公，靈公弗從。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Ying tried to stop Duke Ling, but the duke refused.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "曰：「君亦無勇矣！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Said: 'Lord also no courage!'",
              "idiomatic": "Yan Ying said: 'My lord has no courage either!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "晉兵遂圍臨菑，臨菑城守不敢出，晉焚郭中而去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Jin troops then surrounded Linzi. The city defenders dared not sally forth, so Jin burned the suburbs and withdrew.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0348",
          "zh": "二十八年，初，靈公取魯女，生子光，以為太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-eighth year: originally, Duke Ling married a woman from Lu who bore him a son named Guang, whom he established as crown prince.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "仲姬，戎姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhong Ji and Rong Ji.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "戎姬嬖，仲姬生子牙，屬之戎姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rong Ji was favored, and when Zhong Ji gave birth to a son named Ya, she entrusted him to Rong Ji's care.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "戎姬請以為太子，公許之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rong Ji requested that Ya be established as crown prince, and the duke agreed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "仲姬曰：「不可。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhong Ji said: 'Cannot.",
              "idiomatic": "Zhong Ji said: 'This cannot be done.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "光之立，列於諸侯矣，今無故廢之，君必悔之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Guang's establishment, ranked among feudal lords, now without cause depose him, lord certainly regret it.'",
              "idiomatic": "Guang's status as crown prince is already recognized among the feudal lords. To depose him without cause—my lord will certainly regret this.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "公曰：「在我耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke said: 'In my ears.'",
              "idiomatic": "The duke replied: 'It's up to me.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "遂東太子光，使高厚傅牙為太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So Duke Ling exiled Crown Prince Guang to the east and had Gao Hou tutor Ya as the new crown prince.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "靈公疾，崔杼迎故太子光而立之，是為莊公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Duke Ling fell ill, Cui Zhu welcomed the former Crown Prince Guang back and installed him as ruler, who became Duke Zhuang.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0357",
          "zh": "莊公殺戎姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Zhuang executed Rong Ji.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0358",
          "zh": "五月壬辰，靈公卒，莊公即位，執太子牙於句竇之丘，殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the ren chen day of the fifth month, Duke Ling died. Duke Zhuang ascended the throne, seized the crown prince Ya at Gou Dou Hill, and executed him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "八月，崔杼殺高厚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighth month, Cui Zhu assassinated Gao Hou.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "晉聞齊亂，伐齊，至高唐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jin, hearing of the disorder in Qi, attacked Qi and reached Gao Tang.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0361",
          "zh": "莊公三年，晉大夫欒盈奔齊，莊公厚客待之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Zhuang's third year, the Jin minister Luan Ying fled to Qi, and Duke Zhuang generously entertained him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "晏嬰、田文子諫，公弗聽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Ying and Tian Wen Zi advised against it, but the duke refused to listen.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "四年，齊莊公使欒盈閒入晉曲沃為內應，以兵隨之，上太行，入孟門。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth year, Duke Zhuang of Qi sent Luan Ying to secretly enter Qu Wo in Jin as an internal ally, with Qi troops following. They ascended Tai Hang Mountain and entered Meng Gate.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0364",
          "zh": "欒盈敗，齊兵還，取朝歌。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Luan Ying was defeated, and the Qi troops retreated, capturing Zhao Ge on the way.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0365",
          "zh": "六年，初，棠公妻好，棠公死，崔杼取之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth year: originally, the wife of Duke Tang was beautiful. After Duke Tang died, Cui Zhu married her.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0366",
          "zh": "莊公通之，數如崔氏，以崔杼之冠賜人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhuang Gong had relations with her, frequently went to Cui family, with Cui Zhu's hat bestowed on people.",
              "idiomatic": "Duke Zhuang had an affair with her and frequently visited the Cui residence. He once gave away Cui Zhu's hat to someone else.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0367",
          "zh": "待者曰：「不可。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Attendant said: 'Cannot.'",
              "idiomatic": "An attendant said: 'This cannot be done.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "崔杼怒，因其伐晉，欲與晉合謀襲齊而不得閒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu was furious. He took advantage of Duke Zhuang's campaign against Jin to conspire with Jin to attack Qi, but could not find the right opportunity.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "莊公嘗笞宦者賈舉，賈舉復侍，為崔杼閒公以報怨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Zhuang had once flogged the eunuch Jia Ju. Jia Ju continued to serve and spied on the duke for Cui Zhu to avenge this grudge.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0370",
          "zh": "五月，莒子朝齊，齊以甲戌饗之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth month, the ruler of Ju paid homage to Qi. Qi hosted a banquet for him on jia xu day.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "崔杼稱病不視事。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu feigned illness and did not attend to official duties.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0372",
          "zh": "乙亥，公問崔杼病，遂從崔杼妻。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On yi hai day, the duke went to inquire about Cui Zhu's illness, and then went to see Cui Zhu's wife.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "崔杼妻入室，與崔杼自閉戶不出，公擁柱而歌。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu's wife entered the room and, together with Cui Zhu, locked themselves inside and did not come out. The duke embraced a pillar and sang.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "宦者賈舉遮公從官而入，閉門，崔杼之徒持兵從中起。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Eunuch Jia Ju blocked duke's following officials and entered, closed door, Cui Zhu's followers held weapons rose from within.",
              "idiomatic": "The eunuch Jia Ju blocked the duke's attendants from entering and closed the door. Cui Zhu's followers, armed with weapons, rose up from inside.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0375",
          "zh": "公登臺而請解，不許；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke ascended platform and requested release, not permitted;",
              "idiomatic": "The duke climbed onto a platform and pleaded to be released, but was refused.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0376",
          "zh": "請盟，不許；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Requested covenant, not permitted;",
              "idiomatic": "He requested to make a covenant, but was refused.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0377",
          "zh": "請自殺於廟，不許。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He requested to commit suicide in the ancestral temple, but was refused.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0378",
          "zh": "皆曰：「君之臣杼疾病，不能聽命。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All said: 'Lord's minister Zhu ill, cannot obey commands.",
              "idiomatic": "They all said: 'Your minister Zhu is ill and cannot obey commands.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0379",
          "zh": "近於公宮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He is confined near the ducal palace.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0380",
          "zh": "陪臣爭趣有淫者，不知二命。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Minister's followers contend hasten have licentious one, do not know two commands.'",
              "idiomatic": "His followers are contending and hastening because there is a licentious one among them. They do not know which of two commands to obey.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0381",
          "zh": "公踰墻，射中公股，公反墜，遂弒之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The duke tried to climb the wall to escape. An arrow struck his thigh, he fell back, and they assassinated him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0382",
          "zh": "晏嬰立崔杼門外，曰：「君為社稷死則死之，為社稷亡則亡之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Ying stood Cui Zhu gate outside, said: 'Lord for altars of soil and grain die then die for him, for altars of soil and grain flee then flee for him.",
              "idiomatic": "Yan Ying stood outside Cui Zhu's gate and declared: 'If the lord dies for the altars of soil and grain, then die for him. If he flees for the altars of soil and grain, then flee for him.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0383",
          "zh": "若為己死己亡，非其私暱，誰敢任之！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If for self die self flee, not his private favorites, who dares undertake it!'",
              "idiomatic": "But if he dies or flees for his own sake, who among those not his private favorites would dare to undertake such a task!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "門開而入，枕公尸而哭，三踴而出。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The gate opened and he entered. He pillowed the duke's corpse and wept, then leaped three times and departed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0385",
          "zh": "人謂崔杼：「必殺之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "People told Cui Zhu: 'Must kill him.'",
              "idiomatic": "People told Cui Zhu: 'You must kill him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "崔杼曰：「民之望也，捨之得民。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu said: 'People's hope, release him get people.'",
              "idiomatic": "Cui Zhu replied: 'He is the people's hope. Releasing him will win the people's favor.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "丁丑，崔杼立莊公異母弟杵臼，是為景公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On ding chou day, Cui Zhu installed Zhuang Gong's half-brother Chu Jiu as ruler, who became Duke Jing.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "景公母，魯叔孫宣伯女也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Jing's mother was the daughter of Shu Sun Xuan Bo of Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0390",
          "zh": "景公立，以崔杼為右相，慶封為左相。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Duke Jing ascended the throne, he appointed Cui Zhu as right chancellor and Qing Feng as left chancellor.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "二相恐亂起，乃與國人盟曰：「不與崔慶者死！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Two chancellors feared chaos arise, then with state people covenanted said: 'Not with Cui Qing participate die!'",
              "idiomatic": "The two chancellors, fearing that chaos would arise, made a covenant with the people of the state: 'Anyone who does not side with the Cui and Qing families shall die!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0392",
          "zh": "晏子仰天曰：「嬰所不（獲）唯忠於君利社稷者是從！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Zi gazed heaven said: 'Ying what not obtain only loyal to lord benefit altars of soil and grain follow!'",
              "idiomatic": "Yan Zi gazed at heaven and declared: 'I will follow only those who are loyal to the lord and benefit the altars of soil and grain!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0393",
          "zh": "不肯盟。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He refused to take the covenant.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "慶封欲殺晏子，崔杼曰：「忠臣也，捨之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Feng wished kill Yan Zi, Cui Zhu said: 'Loyal minister, release him.'",
              "idiomatic": "Qing Feng wanted to kill Yan Zi, but Cui Zhu said: 'He is a loyal minister. Let him go.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0395",
          "zh": "齊太史書曰「崔杼弒莊公」，崔杼殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi grand historian wrote said 'Cui Zhu assassinated Zhuang Gong', Cui Zhu killed him.",
              "idiomatic": "The grand historian of Qi wrote: 'Cui Zhu assassinated Duke Zhuang.' Cui Zhu had him killed.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "其弟復書，崔杼復殺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "His younger brother wrote the same thing, and Cui Zhu killed him too.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "少弟復書，崔杼乃捨之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The youngest brother wrote the same thing, and Cui Zhu finally let him go.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0398",
          "zh": "景公元年，初，崔杼生子成及彊，其母死，取東郭女，生明。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Jing's first year: originally, Cui Zhu had sons named Cheng and Qiang. Their mother died, so he married a woman from the Dong Guo family who bore him a son named Ming.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0399",
          "zh": "東郭女使其前夫子無咎與其弟偃相崔氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Dong Guo woman had her former husband Zi Wu Jiu and her younger brother Yan assist the Cui family.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0400",
          "zh": "成有罪，二相急治之，立明為太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Cheng committed a crime, the two chancellors severely punished him and established Ming as crown prince instead.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0401",
          "zh": "成請老於崔［杼］，崔杼許之，二相弗聽，曰：「崔，宗邑，不可。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng requested retire at Cui, Cui Zhu permitted it, two chancellors did not listen, said: 'Cui, ancestral city, cannot.'",
              "idiomatic": "Cheng requested to retire to Cui territory. Cui Zhu agreed, but the two chancellors refused, saying: 'Cui is an ancestral city. This cannot be allowed.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0402",
          "zh": "成、彊怒，告慶封。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng and Qiang, enraged, informed Qing Feng.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0403",
          "zh": "慶封與崔杼有郤，欲其敗也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Feng had enmity with Cui Zhu and wished for his downfall.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0404",
          "zh": "成、彊殺無咎、偃於崔杼家，家皆奔亡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng and Qiang killed Wu Jiu and Yan in Cui Zhu's residence. The entire household fled in panic.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0405",
          "zh": "崔杼怒，無人，使一宦者御，見慶封。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu was furious and had no attendants left. He had a single eunuch drive his chariot to see Qing Feng.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0406",
          "zh": "慶封曰：「請為子誅之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Feng said: 'Please for you execute them.'",
              "idiomatic": "Qing Feng said: 'I will execute them for you.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0407",
          "zh": "使崔杼仇盧蒲嫳攻崔氏，殺成、彊，盡滅崔氏，崔杼婦自殺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He sent Cui Zhu's enemy Lu Pu Xian to attack the Cui family, killing Cheng and Qiang and exterminating the entire Cui clan. Cui Zhu's wife committed suicide.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0408",
          "zh": "崔杼毋歸，亦自殺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cui Zhu had nowhere to return to and committed suicide as well.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0409",
          "zh": "慶封為相國，專權。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Feng became chancellor and monopolized power.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0410",
          "zh": "三年十月，慶封出獵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the tenth month of the third year, Qing Feng went out hunting.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0411",
          "zh": "初，慶封已殺崔杼，益驕，嗜酒好獵，不聽政令。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Originally, after Qing Feng killed Cui Zhu, he became increasingly arrogant, addicted to wine and hunting, and ignored government affairs.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0412",
          "zh": "慶舍用政，已有內郤。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing She administered the government but already had internal enmities.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0413",
          "zh": "田文子謂桓子曰：「亂將作。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Wen Zi told Juan Zi said: 'Chaos will arise.'",
              "idiomatic": "Tian Wen Zi told Juan Zi: 'Chaos is about to break out.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0414",
          "zh": "田、鮑、高、欒氏相與謀慶氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Tian, Bao, Gao, and Luan families conspired together against the Qing family.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0415",
          "zh": "慶舍發甲圍慶封宮，四家徒共擊破之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing She dispatched armored troops to surround Qing Feng's palace. The followers of the four families together attacked and broke through.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0416",
          "zh": "慶封還，不得入，奔魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qing Feng returned but could not enter his palace, so he fled to Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0417",
          "zh": "齊人讓魯，封奔吳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Qi reproached Lu for harboring him, so Qing Feng fled to Wu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0418",
          "zh": "吳與之朱方，聚其族而居之，富於在齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu granted him Zhu Fang, where he gathered his clan and settled. He became richer there than he had been in Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0419",
          "zh": "其秋，齊人徙葬莊公，僇崔杼尸於市以說眾。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "That autumn, the people of Qi moved and reburied Duke Zhuang, and mutilated Cui Zhu's corpse in the marketplace to please the crowd.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0420",
          "zh": "九年，景公使晏嬰之晉，與叔向私語曰：「齊政卒歸田氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ninth year, Jing Gong sent Yan Ying to Jin, privately spoke with Shu Xiang said: 'Qi government eventually will return to Tian family.",
              "idiomatic": "In the ninth year, Duke Jing sent Yan Ying to Jin. He privately spoke with Shu Xiang, saying: 'Qi government will eventually go to the Tian family.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0421",
          "zh": "田氏雖無大德，以公權私，有德於民，民愛之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian family although has no great virtue, uses public power for private, has virtue toward people, people love them.'",
              "idiomatic": "Although the Tian family has no great virtue, they use public power for private gain. They have shown kindness to the people, and the people love them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0422",
          "zh": "十二年，景公如晉，見平公，欲與伐燕。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twelfth year, Duke Jing went to Jin and met Duke Ping. He wanted to join in attacking Yan.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0423",
          "zh": "十八年，公復如晉，見昭公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighteenth year, the duke went to Jin again and met Duke Zhao.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0424",
          "zh": "二十六年，獵魯郊，因入魯，與晏嬰俱問魯禮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-sixth year, while hunting in Lu's suburbs, he entered Lu and, together with Yan Ying, inquired about Lu's rituals.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0425",
          "zh": "三十一年，魯昭公辟季氏難，奔齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the thirty-first year, Duke Zhao of Lu fled to Qi to escape difficulties with the Ji family.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0426",
          "zh": "齊欲以千社封之，子家止昭公，昭公乃請齊伐魯，取鄆以居昭公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qi wanted to grant him a thousand villages, but Zi Jia stopped Duke Zhao. Duke Zhao then requested that Qi attack Lu and take Yun for his residence.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0427",
          "zh": "三十二年，彗星見。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the thirty-second year, a comet appeared.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0428",
          "zh": "景公坐柏寢，嘆曰：「堂堂！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jing Gong sat in cypress chamber, sighed said: 'Majestic!",
              "idiomatic": "Duke Jing sat in the Cypress Chamber and sighed: 'How magnificent!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0429",
          "zh": "誰有此乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Who has this?'",
              "idiomatic": "Who will have this?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0430",
          "zh": "群臣皆泣，晏子笑，公怒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All the ministers wept, but Yan Zi laughed, which angered the duke.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0431",
          "zh": "晏子曰：「臣笑群臣諛甚。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Zi said: 'Minister laughs group ministers flatter extremely.'",
              "idiomatic": "Yan Zi said: 'I laugh because the ministers are flattering you excessively.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0432",
          "zh": "景公曰：「彗星出東北，當齊分野，寡人以為憂。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jing Gong said: 'Comet comes out northeast, corresponds to Qi star field, I regard as worry.'",
              "idiomatic": "Duke Jing said: 'The comet appears in the northeast, which corresponds to Qi's celestial region. I am worried about it.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0433",
          "zh": "晏子曰：「君高臺深池，賦斂如弗得，刑罰恐弗勝，茀星將出，彗星何懼乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Zi said: 'Lord high towers deep pools, tax levies as if not obtained, punishments fear not sufficient, Fu star about to appear, comet what fear?'",
              "idiomatic": "Yan Zi said: 'My lord has high towers and deep pools, exacts taxes as if they are never enough, and punishments that fear they are insufficient. The Fu star is about to appear—what is there to fear from a comet?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0434",
          "zh": "公曰：「可禳否？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke said: 'Can avert?'",
              "idiomatic": "The duke asked: 'Can it be averted?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0435",
          "zh": "晏子曰：「使神可祝而來，亦可禳而去也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Zi said: 'If spirits can be prayed to come, also can be averted to go.",
              "idiomatic": "Yan Zi said: 'If spirits can be summoned by prayer, they can also be driven away by rites.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0436",
          "zh": "百姓苦怨以萬數，而君令一人禳之，安能勝眾口乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Common people bitter resentment by ten thousands count, and lord orders one person avert it, how can overcome many mouths?'",
              "idiomatic": "The common people have bitter resentments numbering in the tens of thousands. If my lord orders one person to avert it, how can that overcome the voices of the multitude?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0437",
          "zh": "是時景公好治宮室，聚狗馬，奢侈，厚賦重刑，故晏子以此諫之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, Duke Jing loved building palaces, gathered dogs and horses, was extravagant, levied heavy taxes and severe punishments. Therefore Yan Zi admonished him with these words.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0438",
          "zh": "四十二年，吳王闔閭伐楚，入郢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-second year, King He Lu of Wu attacked Chu and entered Ying.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0439",
          "zh": "四十七年，魯陽虎攻其君，不勝，奔齊，請齊伐魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-seventh year, Yang Hu of Lu attacked his lord but failed. He fled to Qi and requested that Qi attack Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0440",
          "zh": "鮑子諫景公，乃囚陽虎。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Zi admonished Duke Jing, who then imprisoned Yang Hu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0441",
          "zh": "陽虎得亡，奔晉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yang Hu escaped and fled to Jin.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0442",
          "zh": "四十八年，與魯定公好會夾谷。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the forty-eighth year, Duke Jing met amicably with Duke Ding of Lu at Jia Gu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0443",
          "zh": "犁鉏曰：「孔丘知禮而怯，請令萊人為樂，因執魯君，可得志。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Li Chu said: 'Kong Qiu knows rites but cowardly, please order Lai people perform music, thereby seize Lu ruler, can obtain ambition.'",
              "idiomatic": "Li Chu said: 'Kong Qiu understands ritual but is cowardly. Please order the Lai people to perform music, then seize the Lu ruler—we can achieve our ambitions.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0444",
          "zh": "景公害孔丘相魯，懼其霸，故從犁鉏之計。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jing Gong resented Kong Qiu assisted Lu, feared his hegemony, therefore followed Li Chu's plan.",
              "idiomatic": "Duke Jing resented that Kong Qiu was assisting Lu and feared his potential for hegemony, so he followed Li Chu's plan.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0445",
          "zh": "方會，進萊樂，孔子歷階上，使有司執萊人斬之，以禮讓景公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "As the meeting began and the Lai music was performed, Kong Qiu ascended the steps and ordered officials to seize and execute the Lai performers, using ritual to reproach Duke Jing.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0446",
          "zh": "景公慚，乃歸魯侵地以謝，而罷去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Jing was ashamed, so he returned the invaded Lu territories as an apology and withdrew.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0447",
          "zh": "是歲，晏嬰卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This year, Yan Ying died.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0448",
          "zh": "五十五年，范、中行反其君於晉，晉攻之急，來請粟。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifty-fifth year, the Fan and Zhong Xing families rebelled against their lord in Jin. Jin attacked them fiercely, and they came requesting grain from Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0449",
          "zh": "田乞欲為亂，樹黨於逆臣，說景公曰：「范、中行數有德於齊，不可不救。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Qi wished for chaos, planted factions among rebellious ministers, persuaded Jing Gong said: 'Fan, Zhong Xing several times had virtue toward Qi, cannot not save.'",
              "idiomatic": "Tian Qi wanted to create chaos. He built factions among the rebellious ministers and persuaded Duke Jing: 'The Fan and Zhong Xing families have repeatedly shown kindness to Qi. We cannot fail to rescue them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0450",
          "zh": "及使乞救而輸之粟。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So Qi sent Tian Qi to rescue them and transported grain to the Fan and Zhong Xing families.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0451",
          "zh": "五十八年夏，景公夫人燕姬適子死。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In summer of the fifty-eighth year, Duke Jing's wife Lady Yan's legitimate son died.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0452",
          "zh": "景公寵妾芮姬生子荼，荼少，其母賤，無行，諸大夫恐其為嗣，乃言願擇諸子長賢者為太子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Jing's favored concubine Lady Rui gave birth to a son named Tu. Tu was young, his mother was lowly and immoral. The grand officers feared he would become heir, so they spoke of wishing to select the eldest and worthiest of Duke Jing's sons as crown prince.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0453",
          "zh": "景公老，惡言嗣事，又愛荼母，欲立之，憚發之口，乃謂諸大夫曰：「為樂耳，國何患無君乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Jing Gong old, hated speaking succession matters, moreover loved Tu's mother, wished establish him, dreaded opening mouth, therefore told various grand officers said: 'Just for pleasure, state what worry no ruler?'",
              "idiomatic": "Duke Jing was old and disliked speaking about succession. He also loved Tu's mother and wanted to establish Tu as heir, but he dreaded bringing it up. So he told the grand officers: 'This is just for amusement. Why worry that the state won't have a ruler?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0454",
          "zh": "秋，景公病，命國惠子、高昭子立少子荼為太子，逐群公子，遷之萊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In autumn, Duke Jing fell ill. He commanded Guo Hui Zi and Gao Zhao Zi to establish his youngest son Tu as crown prince, drove away all the other princes, and exiled them to Lai.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0455",
          "zh": "景公卒，太子荼立，是為晏孺子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Jing died, and Crown Prince Tu ascended the throne, becoming Yan Ruzi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0456",
          "zh": "冬，未葬，而群公子畏誅，皆出亡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In winter, before Duke Jing was even buried, all the princes fled in fear of execution.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0457",
          "zh": "荼諸異母兄公子壽、駒、黔奔衛，公子駔、陽生奔魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tu's various different mother elder brothers prince Shou, Ju, Qian fled to Wei, prince Zhu, Yang Sheng fled to Lu.",
              "idiomatic": "Tu's half-brothers—the princes Shou, Ju, and Qian—fled to Wei, while the princes Zhu and Yang Sheng fled to Lu.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0458",
          "zh": "萊人歌之曰：「景公死乎弗與埋，三軍事乎弗與謀，師乎師乎，胡黨之乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lai people sang it said: 'Jing Gong died not with bury, three armies matters not with plot, army army, why follow it?'",
              "idiomatic": "The people of Lai sang: 'Duke Jing died but we weren't involved in his burial. Military matters weren't discussed with us. Army, oh army, why should we follow you?'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0460",
          "zh": "晏孺子元年春，田乞偽事高、國者，每朝，乞驂乘，言曰：「子得君，大夫皆自危，欲謀作亂。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Ru Zi first year spring, Tian Qi falsely served Gao, Guo people, every court, Qi secondary chariot, said: 'You got ruler, grand officers all self-danger, wish plot make chaos.'",
              "idiomatic": "In spring of Yan Ruzi's first year, Tian Qi pretended to serve the Gao and Guo families. At every court session, he rode as secondary charioteer and said: 'You have the ruler, but all the grand officers feel endangered and want to plot rebellion.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0461",
          "zh": "又謂諸大夫曰：「高昭子可畏，及未發，先之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Again told various grand officers said: 'Gao Zhao Zi fearful, reach before not issued, strike first.'",
              "idiomatic": "He also told the grand officers: 'Gao Zhao Zi is dangerous. Before he acts, we should strike first.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0462",
          "zh": "大夫從之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The grand officers agreed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0463",
          "zh": "六月，田乞、鮑牧乃與大夫以兵入公宮，攻高昭子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the sixth month, Tian Qi and Bao Mu, together with the grand officers, entered the ducal palace with troops and attacked Gao Zhao Zi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0464",
          "zh": "昭子聞之，與國惠子救公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gao Zhao Zi heard of it and, together with Guo Hui Zi, went to rescue the duke.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0465",
          "zh": "公師敗，田乞之徒追之，國惠子奔莒，遂反殺高昭子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke troops defeated, Tian Qi's followers pursued them, Guo Hui Zi fled to Ju, then turned back killed Gao Zhao Zi.",
              "idiomatic": "The duke's forces were defeated. Tian Qi's followers pursued them. Guo Hui Zi fled to Ju, but they turned back and killed Gao Zhao Zi.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0466",
          "zh": "晏圉奔魯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yan Yu fled to Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0467",
          "zh": "八月，齊秉意茲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the eighth month, Qi seized Yi Zi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0468",
          "zh": "田乞敗二相，乃使人之魯召公子陽生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "After Tian Qi defeated the two chancellors, he sent people to Lu to summon Prince Yang Sheng.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0469",
          "zh": "陽生至齊，私匿田乞家。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yang Sheng arrived in Qi and secretly hid in Tian Qi's home.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0470",
          "zh": "十月戊子，田乞請諸大夫曰：「常之母有魚菽之祭，幸來會飲。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tenth month wu zi, Tian Qi invited various grand officers said: 'Chang's mother has fish bean sacrifice, fortunate come gather drink.'",
              "idiomatic": "On the wu zi day of the tenth month, Tian Qi invited all the grand officers: 'My wife has a fish and bean sacrifice. Please come join the drinking gathering.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0471",
          "zh": "會飲，田乞盛陽生橐中，置坐中央，發橐出陽生，曰：「此乃齊君矣！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gathered drinking, Tian Qi put Yang Sheng in bag, placed seat central, opened bag out Yang Sheng, said: 'This is Qi ruler!'",
              "idiomatic": "At the drinking gathering, Tian Qi hid Yang Sheng in a bag and placed it in the center of the seats. He opened the bag and Yang Sheng emerged, declaring: 'This is the ruler of Qi!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0472",
          "zh": "大夫皆伏謁。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All the grand officers prostrated themselves and greeted him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0473",
          "zh": "將與大夫盟而立之，鮑牧醉，乞誣大夫曰：「吾與鮑牧謀共立陽生。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "About to with grand officers covenant establish him, Bao Mu drunk, Qi slandered grand officers said: 'I with Bao Mu plotted together establish Yang Sheng.'",
              "idiomatic": "As they were about to make a covenant with the grand officers and establish him, Bao Mu got drunk. Tian Qi slandered him to the grand officers: 'Bao Mu and I plotted together to establish Yang Sheng.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0474",
          "zh": "鮑牧怒曰：「子忘景公之命乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Mu angry said: 'You forget Jing Gong's command?'",
              "idiomatic": "Bao Mu angrily said: 'Have you forgotten Duke Jing's command?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0475",
          "zh": "諸大夫相視欲悔，陽生前，頓首曰：「可則立之，否則已。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Various grand officers mutually looked wished regret, Yang Sheng forward, kowtowed said: 'Can then establish him, no then stop.'",
              "idiomatic": "The grand officers looked at each other and wanted to back out. Yang Sheng stepped forward and kowtowed: 'If you can accept me, then establish me as ruler. If not, then stop.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0476",
          "zh": "鮑牧恐禍起，乃復曰：「皆景公子也，何為不可！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Mu feared disaster arise, then again said: 'All Jing Gong sons, why cannot!'",
              "idiomatic": "Bao Mu feared disaster would arise, so he said: 'They are all sons of Duke Jing. Why not?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0477",
          "zh": "乃與盟，立陽生，是為悼公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They made a covenant and established Yang Sheng as ruler, who became Duke Dao.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0478",
          "zh": "悼公入宮，使人遷晏孺子於駘，殺之幕下，而逐孺子母芮子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Dao entered the palace and had people move Yan Ruzi to Dai, where he was killed beneath a tent. He also expelled Yan Ruzi's mother, Lady Rui.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0479",
          "zh": "芮子故賤而孺子少，故無權，國人輕之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lady Rui was originally of low status and Yan Ruzi was young, so he had no real authority. The people of the state despised him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0480",
          "zh": "悼公元年，齊伐魯，取讙、闡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Dao's first year, Qi attacked Lu and captured Huan and Chan.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0481",
          "zh": "初，陽生亡在魯，季康子以其妹妻之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Originally, when Yang Sheng was in exile in Lu, Ji Kang Zi married his younger sister to him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0482",
          "zh": "及歸即位，使迎之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When he returned and ascended the throne, he sent for her.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0483",
          "zh": "季姬與季魴侯通，言其情，魯弗敢與，故齊伐魯，竟迎季姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Ji was having an affair with Ji Pang Hou and spoke of their relationship. Lu dared not give her up, so Qi attacked Lu and finally retrieved Ji Ji.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0484",
          "zh": "季姬嬖，齊復歸魯侵地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ji Ji was favored, so Qi returned the lands it had taken from Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0485",
          "zh": "鮑子與悼公有郤，不善。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Zi had enmity with Duke Dao and relations were poor.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0486",
          "zh": "四年，吳、魯伐齊南方。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fourth year, Wu and Lu attacked Qi's southern territories.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0487",
          "zh": "鮑子弒悼公，赴于吳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Bao Zi assassinated Duke Dao and reported it to Wu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0488",
          "zh": "吳王夫差哭於軍門外三日，將從海入討齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "King Fu Chai of Wu wept outside the army gate for three days and was about to enter by sea to punish Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0489",
          "zh": "齊人敗之，吳師乃去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Qi defeated them, and the Wu troops withdrew.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0490",
          "zh": "晉趙鞅伐齊，至賴而去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhao Yang of Jin attacked Qi, reached Lai, and withdrew.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0491",
          "zh": "齊人共立悼公子壬，是為簡公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The people of Qi together established Dao Gong's son Ren as ruler, who became Duke Jian.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0492",
          "zh": "簡公四年春，初，簡公與父陽生俱在魯也，監止有寵焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In spring of Duke Jian's fourth year: originally, when Duke Jian and his father Yang Sheng were both in Lu, Jian Zhi was favored.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0493",
          "zh": "及即位，使為政。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When he ascended the throne, he put Jian Zhi in charge of government.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0494",
          "zh": "田成子憚之，驟顧於朝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Cheng Zi feared him and frequently looked back anxiously at court.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0495",
          "zh": "御鞅言簡公曰：「田、監不可并也，君其擇焉。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yu Yang spoke to Jian Gong said: 'Tian, Jian cannot exist together, lord should choose one.'",
              "idiomatic": "Yu Yang spoke to Duke Jian: 'Tian and Jian cannot coexist. My lord should choose between them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0496",
          "zh": "弗聽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He did not listen.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0497",
          "zh": "子我夕，田逆殺人，逢之，遂捕以入。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the evening, Zi Wo encountered Tian Ni who had killed someone. He captured him and brought him in.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0498",
          "zh": "田氏方睦，使囚病而遺守囚者酒，醉而殺守者，得亡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Tian family was harmonious. They made the prisoner feign illness and sent wine to the guard. When the guard got drunk, they killed him and escaped.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0499",
          "zh": "子我盟諸田於陳宗。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Wo made a covenant with the various Tian family members at Chen Zong.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0500",
          "zh": "初，田豹欲為子我臣，使公孫言豹，豹有喪而止。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Originally, Tian Bao wanted to serve as Zi Wo's minister. He had Gong Sun speak to Bao about it, but Bao had mourning obligations and declined.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0501",
          "zh": "後卒以為臣，幸於子我。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Later he finally became a minister and was favored by Zi Wo.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0502",
          "zh": "子我謂曰：「吾盡逐田氏而立女，可乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Wo told him said: 'I completely drive out Tian family and establish you, can?'",
              "idiomatic": "Zi Wo said to him: 'I will completely drive out the Tian family and establish you. Is that acceptable?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0503",
          "zh": "對曰：「我遠田氏矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Replied said: 'I distant from Tian family.'",
              "idiomatic": "He replied: 'I am distant from the Tian family.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0504",
          "zh": "且其違者不過數人，何盡逐焉！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Moreover those who oppose only several people, why completely drive out!'",
              "idiomatic": "Moreover, those who oppose you are only a few people. Why drive them all out?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0505",
          "zh": "遂告田氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So he informed the Tian family.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0506",
          "zh": "子行曰：「彼得君，弗先，必禍子。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Xing said: 'If he gets ruler, not first, certainly disaster you.'",
              "idiomatic": "Zi Xing said: 'If he gets the ruler first, it will certainly bring disaster to you.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0507",
          "zh": "子行舍於公宮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Xing took up residence in the ducal palace.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0508",
          "zh": "夏五月壬申，成子兄弟四乘如公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the ren shen day of the fifth month in summer, Cheng Zi and his three brothers went to the duke in four chariots.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0509",
          "zh": "子我在幄，出迎之，遂入，閉門。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Wo was in his tent. He came out to welcome them, then they entered and closed the door.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0510",
          "zh": "宦者御之，子行殺宦者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "An eunuch drove the chariot. Zi Xing killed the eunuch.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0511",
          "zh": "公與婦人飲酒於檀臺，成子遷諸寢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The duke was drinking wine with a woman on the Tan Platform when Cheng Zi moved them to the bedchamber.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0512",
          "zh": "公執戈將擊之，太史子餘曰：「非不利也，將除害也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke grasped spear about to strike him, Grand Historian Zi Yu said: 'Not disadvantage, about to remove harm.'",
              "idiomatic": "The duke grasped a spear and was about to strike him when Grand Historian Zi Yu said: 'This is not disadvantageous. He is about to remove a threat.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0513",
          "zh": "成子出舍于庫，聞公猶怒，將出，曰：「何所無君！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Zi came out lodged at treasury, heard duke still angry, about to leave, said: 'What place without ruler!'",
              "idiomatic": "Cheng Zi came out and took lodging at the treasury. Hearing that the duke was still angry, he was about to leave and said: 'What place doesn't have a ruler!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0514",
          "zh": "子行拔劍曰：「需，事之賊也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Xing drew sword said: 'Delay, affairs' thief.",
              "idiomatic": "Zi Xing drew his sword and said: 'Delay is the thief of affairs.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0515",
          "zh": "誰非田宗？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Who not Tian clan?",
              "idiomatic": "Who is not of the Tian clan?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0516",
          "zh": "所不殺子者有如田宗。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "What not kill you have like Tian clan.'",
              "idiomatic": "If I do not kill you, may the Tian clan be my witness.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0517",
          "zh": "乃止。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So he stopped.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0518",
          "zh": "子我歸，屬徒攻闈與大門，皆弗勝，乃出。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zi Wo returned and gathered his followers to attack the inner gate and main gate, but they could not prevail, so he left.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0519",
          "zh": "田氏追之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Tian family pursued him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0520",
          "zh": "豐丘人執子我以告，殺之郭關。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "People from Feng Qiu seized Zi Wo and reported it. He was killed at the outer gate.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0521",
          "zh": "成子將殺大陸子方，田逆請而免之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Zi was about to kill Da Lu Zi Fang, but Tian Ni interceded and spared him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0522",
          "zh": "以公命取車於道，出雍門。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On the duke's command, he took a chariot from the road and exited through Yong Gate.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0523",
          "zh": "田豹與之車，弗受，曰：「逆為余請，豹與余車，余有私焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Bao gave him chariot, did not accept, said: 'Ni requested for me, Bao gave me chariot, I have private relations.",
              "idiomatic": "Tian Bao offered him a chariot, but he refused, saying: 'Ni interceded for me, Bao gives me a chariot—I have private dealings with them.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0524",
          "zh": "事子我而有私於其讎，何以見魯、衛之士？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Serve Zi Wo and have private with his enemy, how to see Lu, Wei scholars?'",
              "idiomatic": "To serve Zi Wo yet have private dealings with his enemies—how can I face the scholars of Lu and Wei?'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0526",
          "zh": "庚辰，田常執簡公于俆州。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On geng chen day, Tian Chang seized Duke Jian at Xu Zhou.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0527",
          "zh": "公曰：「余蚤從御鞅言，不及此。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke said: 'I early followed Yu Yang words, not reach this.'",
              "idiomatic": "The duke said: 'If only I had followed Yu Yang's advice earlier, I would not have come to this.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0528",
          "zh": "甲午，田常弒簡公于俆州。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "On jia wu day, Tian Chang assassinated Duke Jian at Xu Zhou.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0529",
          "zh": "田常乃立簡公弟驁，是為平公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Chang then established Duke Jian's younger brother Ao as ruler, who became Duke Ping.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0530",
          "zh": "平公即位，田常相之，專齊之政，割齊安平以東為田氏封邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Duke Ping ascended the throne, Tian Chang became his chancellor, monopolized Qi's government, and divided the territory east of An Ping as the Tian family's fief.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0531",
          "zh": "平公八年，越滅吳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Ping's eighth year, Yue extinguished Wu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0532",
          "zh": "二十五年卒，子宣公積立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He died in the twenty-fifth year, and his son Duke Xuan (Ji) succeeded him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0533",
          "zh": "宣公五十一年卒，子康公貸立。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Duke Xuan died in his fifty-first year, and his son Duke Kang (Dai) succeeded him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0534",
          "zh": "田會反廩丘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tian Hui rebelled at Lin Qiu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0535",
          "zh": "康公二年，韓、魏、趙始列為諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In Duke Kang's second year, Han, Wei, and Zhao first became recognized as feudal lords.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0536",
          "zh": "十九年，田常曾孫田和始為諸侯，遷康公海濱。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the nineteenth year, Tian Chang's great-grandson Tian He became a feudal lord and relocated Duke Kang to the seaside.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0537",
          "zh": "二十六年，康公卒，呂氏遂絕其祀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the twenty-sixth year, Duke Kang died, and the Lu family line was extinguished.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0538",
          "zh": "田氏卒有齊國，為齊威王，彊於天下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Tian family finally possessed the state of Qi, becoming King Wei of Qi, powerful throughout the world.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0539",
          "zh": "太史公曰：吾適齊，自泰山屬之瑯邪，北被于海，膏壤二千里，其民闊達多匿知，其天性也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Historian said: I went to Qi, from Tai Shan connected to Lang Ya, north covered to sea, fertile soil two thousand li, its people broad-minded many concealed wisdom, their natural character.",
              "idiomatic": "The Grand Historian said: I traveled to Qi, from Mount Tai extending to Langya, northward reaching the sea, with fertile soil for two thousand li. Its people are broad-minded and conceal much wisdom—this is their natural character.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0540",
          "zh": "以太公之聖，建國本，桓公之盛，修善政，以為諸侯會盟，稱伯，不亦宜乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "With Tai Gong's sageliness, established state foundation, Huan Gong's flourishing, cultivated good government, to make feudal lords assemble ally, called hegemon, not also fitting?",
              "idiomatic": "With the sageliness of the Grand Duke establishing the state's foundation, and Duke Huan's flourishing cultivation of good government, enabling him to convene the feudal lords in alliance and be called hegemon—was this not fitting?",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0541",
          "zh": "洋洋哉，固大國之風也！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Vast ah, indeed great state's manner!",
              "idiomatic": "How vast! This is indeed the manner of a great state!",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    }
  ]
}