{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "049",
    "url": "https://chinesenotes.com/shiji/shiji049.html",
    "title": {
      "zh": "外戚世家",
      "en": "Houses of the External Relatives",
      "raw": "《外戚世家》 Houses of the External Relatives"
    },
    "sentenceCount": 285,
    "translatedCount": 285,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:28.533Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "自古受命帝王及繼體守文之君，非獨內德茂也，蓋亦有外戚之助焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Since ancient times, emperors and kings who received heaven's mandate, as well as those who inherited the throne and preserved established institutions, relied not only on their own flourishing virtue, but also received help from their maternal relatives.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "夏之興也以涂山，而桀之放也以末喜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Xia dynasty rose through Tushan, but Jie was banished because of Moyi.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "殷之興也以有娀，紂之殺也嬖妲己。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Yin dynasty rose through Youxiong, but Zhou was killed because of his doting on Daji.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "周之興也以姜原及大任，而幽王之禽也淫於褒姒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Zhou dynasty rose through Jiangyuan and Tai Ren, but King You was captured because of his debauchery with Baosi.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "故易基乾坤，詩始關雎，書美釐降，春秋譏不親迎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, the Book of Changes is founded on Qian and Kun, the Book of Odes begins with Guan Ju, the Book of Documents praises proper honors, and the Spring and Autumn Annals criticizes those who do not personally welcome their brides.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "夫婦之際，人道之大倫也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The bond between husband and wife is the greatest principle of human relationships.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "禮之用，唯婚姻為兢兢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Of all ritual applications, marriage alone requires the greatest caution.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "夫樂調而四時和，陰陽之變，萬物之統也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When music is well tuned, the four seasons harmonize—this governs the transformations of yin and yang and orders all things.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "可不慎與？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Can this not be done carefully?",
              "idiomatic": "Can this be done without care?"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "人能弘道，無如命何。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "People can broaden the Way, but can do nothing about fate.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "甚哉，妃匹之愛，君不能得之於臣，父不能得之於子，況卑下乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "How profound is the love between husband and wife! A ruler cannot obtain such devotion from his ministers, nor can a father obtain it from his sons—what hope then for those in inferior positions?",
              "idiomatic": "How profound is the love between husband and wife! A ruler cannot obtain such devotion from his ministers, nor can a father from his sons—what then of those in humble positions?"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "既驩合矣，或不能成子姓；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Even when a couple has joyfully united, they may not be able to produce offspring;",
              "idiomatic": "Even after joyful union, they may not produce offspring;"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "能成子姓矣，或不能要其終：豈非命也哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Even when they have produced offspring, they may not be able to enjoy a full life together. Is this not the working of fate?",
              "idiomatic": "Even having produced offspring, they may not share their full lives together. Is this not the work of fate?"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "孔子罕稱命，蓋難言之也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Confucius rarely spoke of fate, for it is difficult to discuss.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "非通幽明之變，惡能識乎性命哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Without penetrating the transformations between the dark and the bright, how can one understand the nature of life and fate?",
              "idiomatic": "Without penetrating the transformations between darkness and light, how can one understand the nature of life and fate?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Since ancient times, emperors and kings who received the mandate of heaven, as well as those who succeeded to the throne and maintained the established institutions, did not rely solely on their own virtuous character, but also received assistance from their maternal relatives. The Xia dynasty rose to power thanks to Tushan, but Jie was overthrown because of Moyi. The Yin dynasty rose to power thanks to Youxiong, but Zhou was killed because of his infatuation with Daji. The Zhou dynasty rose to power thanks to Jiangyuan and Tai Ren, but King You was captured because of his licentious affair with Baosi. Therefore, the Book of Changes takes Qian and Kun as its foundation, the Book of Odes begins with Guan Ju, the Book of Documents praises the proper bestowal of honors, and the Spring and Autumn Annals criticizes those who do not personally welcome their brides. The relationship between husband and wife is the greatest of human relationships. Of all the applications of ritual propriety, none requires such careful attention as marriage. When music is properly attuned, the four seasons harmonize, and this is the fundamental principle governing the transformations of yin and yang and the ordering of all things. How can this not be approached with the utmost care? Though a person may strive to broaden the Way, there is nothing they can do about fate. How profound is the love between husband and wife! A ruler cannot obtain such devotion from his ministers, nor can a father obtain it from his sons—what hope then for those in inferior positions? Even when a couple has joyfully united, they may not be able to produce offspring; Even when they have produced offspring, they may not be able to enjoy a full life together. Is this not the working of fate? Confucius rarely spoke of fate, for it is difficult to discuss. Without penetrating the transformations between the dark and the bright, how can one understand the nature of life and fate?",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0016",
          "zh": "太史公曰：秦以前尚略矣，其詳靡得而記焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Grand Historian says: The period before the Qin dynasty is rather sketchy in detail, and there is little that can be recorded with precision.",
              "idiomatic": "The Grand Historian says: The period before Qin is still rather sketchy, and its details cannot be recorded with precision."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "漢興，呂娥姁為高祖正后，男為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When the Han dynasty arose, Lü Ehu became Gaozu's principal wife and bore him a son who became the crown prince.",
              "idiomatic": "When Han arose, Lü Ehu became Gaozu's principal consort and bore him a son who became crown prince."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "及晚節色衰愛弛，而戚夫人有寵，其子如意幾代太子者數矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "In her later years, as her beauty faded and the emperor's affection waned, the imperial concubine Qi had his favor, and her son Ruyi came close to replacing the crown prince on several occasions.",
              "idiomatic": "In later years, as her beauty faded and his affection waned, Concubine Qi was favored, and her son Ruyi nearly replaced the crown prince several times."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "及高祖崩，呂后夷戚氏，誅趙王，而高祖後宮唯獨無寵疏遠者得無恙。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Gaozu passed away, Empress Lü exterminated the Qi clan and executed King Zhao, while among Gaozu's palace women, only those who were unloved and distant remained unharmed.",
              "idiomatic": "When Gaozu passed away, Empress Lü exterminated the Qi clan and executed King Zhao, while among Gaozu's palace women, only the unloved and distant remained unharmed."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian says: The period before the Qin dynasty is rather sketchy in detail, and there is little that can be recorded with precision. When the Han dynasty arose, Lü Ehu became Gaozu's principal wife and bore him a son who became the crown prince. In her later years, as her beauty faded and the emperor's affection waned, the imperial concubine Qi had his favor, and her son Ruyi came close to replacing the crown prince on several occasions. When Gaozu passed away, Empress Lü exterminated the Qi clan and executed King Zhao, while among Gaozu's palace women, only those who were unloved and distant remained unharmed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0020",
          "zh": "呂后長女為宣平侯張敖妻，敖女為孝惠皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Lü's eldest daughter became the wife of Marquis Xuanping Zhang Ao, and Ao's daughter became Empress Xiaohui.",
              "idiomatic": "Empress Lü's eldest daughter became wife to Marquis Xuanping Zhang Ao, and Ao's daughter became Empress Xiaohui."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "呂太后以重親故，欲其生子萬方，終無子，詐取後宮人子為子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Because of their close kinship, Empress Lü desired that the empress bear children by any means necessary. In the end, she bore no children, so she fraudulently took a son from one of the palace women and claimed him as her own.",
              "idiomatic": "Because of their close kinship, Empress Lü desired the empress bear children by any means. In the end bearing none, she fraudulently took a palace woman's son as her own."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "及孝惠帝崩，天下初定未久，繼嗣不明。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Xiaohui passed away, the realm had only recently been pacified, and the succession was unclear.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "於是貴外家，王諸呂以為輔，而以呂祿女為少帝后，欲連固根本牢甚，然無益也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, she honored her maternal relatives, enfeoffed the various Lü clansmen as kings to serve as supporters, and made Lü Lü's daughter the consort of the young emperor, wishing to firmly establish and strengthen their family foundation. However, it was of no avail.",
              "idiomatic": "Therefore she honored her maternal clan, enfeoffed the various Lü as kings as supporters, and made Lü Lü's daughter consort to the young emperor, wishing to firmly connect and strengthen their foundation. However, it was of no avail."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Lü's eldest daughter became the wife of Marquis Xuanping Zhang Ao, and Ao's daughter became Empress Xiaohui. Because of their close kinship, Empress Lü desired that the empress bear children by any means necessary. In the end, she bore no children, so she fraudulently took a son from one of the palace women and claimed him as her own. When Emperor Xiaohui passed away, the realm had only recently been pacified and the succession was unclear. Therefore, she honored her maternal relatives, enfeoffed the various Lü clansmen as kings to serve as supporters, and made Lü Lü's daughter the consort of the young emperor, wishing to firmly establish and strengthen their family foundation. However, it was of no avail.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "高后崩，合葬長陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Empress Gao passed away, she was buried alongside Gaozu in Changling.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "祿、產等懼誅，謀作亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lü Lü and Lü Chan and the others, fearing execution, plotted rebellion.",
              "idiomatic": "Lü Lü, Lü Chan and others, fearing execution, plotted rebellion."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "大臣征之，天誘其統，卒滅呂氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The ministers attacked them, and heaven brought disorder to their plans, finally exterminating the Lü clan.",
              "idiomatic": "The ministers attacked them, heaven disordered their plans, and finally exterminated the Lü clan."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "唯獨置孝惠皇后居北宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Only Empress Xiaohui was left dwelling in the Northern Palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "迎立代王，是為孝文帝，奉漢宗廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "They welcomed and established the King of Dai as Emperor Xiaowen, who maintained the Han ancestral temples.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "此豈非天邪？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Was this not the will of heaven?",
              "idiomatic": "Was this not heaven's will?"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "非天命孰能當之？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Who but heaven could have brought this about?",
              "idiomatic": "Who but heaven's mandate could accomplish this?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Empress Gao passed away, she was buried alongside Gaozu in Changling tomb. Lü Lü and Lü Chan and the others, fearing execution, plotted rebellion. The ministers attacked them, and heaven brought disorder to their plans, finally exterminating the Lü clan. Only Empress Xiaohui was left residing in the Northern Palace. They welcomed and established the King of Dai, who became Emperor Xiaowen, and he maintained the Han ancestral temples. Was this not the will of heaven? Who but heaven could have brought this about?",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "薄太后，父吳人，姓薄氏，秦時與故魏王宗家女魏媼通，生薄姬，而薄案死山陰，因葬焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Bo's father was from Wu, surnamed Bo. During the Qin dynasty, he had relations with Wei Fu, a woman from the clan of the former King of Wei, and she bore Empress Bo. Bo An died in Shanyin and was buried there.",
              "idiomatic": "Empress Bo's father was from Wu, surnamed Bo. During Qin times, he had relations with Wei Fu, a woman from the former King of Wei's clan, and she bore Empress Bo. Bo An died in Shanyin and was buried there."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Bo's father was from Wu, surnamed Bo. During the Qin dynasty, he had relations with Wei Fu, a woman from the clan of the former King of Wei, and she bore Empress Bo. Bo An died in Shanyin and was buried there.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "及諸侯畔秦，魏豹立為魏王，而魏媼內其女於魏宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When the feudal lords rebelled against Qin, Wei Bao established himself as King of Wei, and Wei Fu brought her daughter into the Wei palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "媼之許負所相，相薄姬，云當生天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wei Fu had Xu Fu divine for her, and Xu Fu divined for Empress Bo, saying she would bear a son who would become emperor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "是時項羽方與漢王相距滎陽，天下未有所定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At this time, Xiang Yu was contending with the Han king at Xingyang, and the realm had not yet been decided.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "豹初與漢擊楚，及聞許負言，心獨喜，因背漢而畔，中立，更與楚連和。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At first Bao had joined with Han to attack Chu, but when he heard Xu Fu's words, he was secretly delighted, so he betrayed Han and rebelled, taking a neutral position and instead allied with Chu.",
              "idiomatic": "At first Bao joined Han to attack Chu, but hearing Xu Fu's words, he secretly rejoiced, betrayed Han and rebelled, took a neutral stance, and allied with Chu instead."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "漢使曹參等擊虜魏王豹，以其國為郡，而薄姬輸織室。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han sent Cao Can and others to attack and capture King Wei Bao, making his state into a commandery, and sent Empress Bo to the weaving rooms.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "豹已死，漢王入織室，見薄姬有色，詔內後宮，歲餘不得幸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After Bao died, the Han king entered the weaving rooms, saw Empress Bo was beautiful, ordered her brought into the rear palace. For over a year she did not receive his favor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "始姬少時，與管夫人、趙子兒相愛，約曰：「先貴無相忘。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When the lady was young, she was close friends with Lady Guan and Zhao Zier, and they made a pact: 'Whoever becomes noble first must not forget the others.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "已而管夫人、趙子兒先幸漢王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Later, Lady Guan and Zhao Zier first received the Han king's favor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "漢王坐河南宮成皋臺，此兩美人相與笑薄姬初時約。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Han king was sitting in the Henan Palace on the Chenggao Tower when these two beauties laughed together about Empress Bo's earlier pact.",
              "idiomatic": "The Han king was sitting in the Henan Palace on Chenggao Tower when these two beauties laughed together about Empress Bo's earlier pact."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "漢王聞之，問其故，兩人具以實告漢王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Han king heard this and asked the reason, and the two women fully told him the truth.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "漢王心慘然，憐薄姬，是日召而幸之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Han king felt sorrowful and pitied Empress Bo, and that very day summoned and favored her.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "薄姬曰：「昨暮夜妾夢蒼龍據吾腹。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Bo said: 'Last night I dreamt that a green dragon coiled around my belly.'",
              "idiomatic": "Empress Bo said: 'Last night I dreamt a green dragon coiled around my belly.'"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "高帝曰：「此貴徵也，吾為女遂成之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Supreme Emperor said: 'This is an auspicious sign of nobility. I will fulfill it for you.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "一幸生男，是為代王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "From this one favor she bore a son, who became King of Dai.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "其後薄姬希見高祖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Afterward, Empress Bo rarely saw Gaozu.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When the feudal lords rebelled against Qin, Wei Bao established himself as King of Wei, and Wei Fu brought her daughter into the Wei palace. Wei Fu had Xu Fu divine for her, and Xu Fu divined for Empress Bo, saying she would bear a son who would become emperor. At this time, Xiang Yu was contending with the Han king at Xingyang, and the realm had not yet been decided. At first Bao had joined with Han to attack Chu, but when he heard Xu Fu's words, he was secretly delighted, so he betrayed Han and rebelled, taking a neutral position and instead allied with Chu. Han sent Cao Can and others to attack and capture King Wei Bao, making his state into a commandery, and Empress Bo was sent to the weaving rooms. After Bao died, the Han king entered the weaving rooms and, seeing that Empress Bo was beautiful, ordered her brought into the rear palace. For more than a year she did not receive his favor. When the lady was young, she was close friends with Lady Guan and Zhao Zier, and they made a pact: 'Whoever becomes noble first must not forget the others.' Later, Lady Guan and Zhao Zier first received the Han king's favor. The Han king was sitting in the Henan Palace on the Chenggao Tower when these two beauties laughed together about Empress Bo's earlier pact. The Han king heard this and asked the reason, and the two women told him the whole truth. The Han king felt sorrowful and pitied Empress Bo, and that very day summoned her and favored her. Empress Bo said: 'Last night I dreamt that a green dragon coiled around my belly.' The Supreme Emperor said: 'This is an auspicious sign of nobility. I will fulfill it for you.' From this one favor she bore a son, who became the King of Dai. Afterward, Empress Bo rarely saw Gaozu.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0047",
          "zh": "高祖崩，諸御幸姬戚夫人之屬，呂太后怒，皆幽之，不得出宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Gaozu passed away, Empress Lü was angry at all the favored consorts like Concubine Qi, and imprisoned them all so they could not leave the palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "而薄姬以希見故，得出，從子之代，為代王太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "But because Empress Bo was rarely seen, she was allowed to leave and follow her son to Dai, becoming Queen Dowager of Dai.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "太后弟薄昭從如代。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Queen Dowager's younger brother Bo Zhao followed her to Dai.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Gaozu passed away, Empress Lü was angry at all the favored consorts like Concubine Qi, and imprisoned them all so they could not leave the palace. But because Empress Bo was rarely seen, she was allowed to leave and follow her son to Dai, becoming the Queen Dowager of Dai. The Queen Dowager's younger brother Bo Zhao followed her to Dai.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0050",
          "zh": "代王立十七年，高后崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The King of Dai was established for seventeen years, then Empress Gao passed away.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "大臣議立後，疾外家呂氏彊，皆稱薄氏仁善，故迎代王，立為孝文皇帝，而太后改號曰皇太后，弟薄昭封為軹侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The ministers discussed establishing a successor, and were concerned about the powerful Lü maternal relatives, so they all praised the Bo clan's benevolence and goodness. Therefore, they welcomed the King of Dai and established him as Emperor Xiaowen, while the Queen Dowager changed her title to Empress Dowager, and her younger brother Bo Zhao was enfeoffed as Marquis of Zhi.",
              "idiomatic": "The ministers discussed establishing a successor, concerned about the powerful Lü maternal clan, all praising the Bo clan's benevolence and goodness. Therefore they welcomed the King of Dai and established him as Emperor Xiaowen, while the Queen Dowager changed her title to Empress Dowager, and her younger brother Bo Zhao was enfeoffed as Marquis of Zhi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The King of Dai was established for seventeen years, then Empress Gao passed away. The ministers discussed establishing a successor, and were concerned about the powerful Lü maternal relatives, so they all praised the Bo clan's benevolence and goodness. Therefore, they welcomed the King of Dai and established him as Emperor Xiaowen, while the Queen Dowager changed her title to Empress Dowager, and her younger brother Bo Zhao was enfeoffed as Marquis of Zhi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "薄太后母亦前死，葬櫟陽北。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Bo's mother had also died earlier and was buried north of Cuo Yang.",
              "idiomatic": "Empress Bo's mother had also died earlier and was buried north of Cuoyang."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "於是乃追尊薄案為靈文侯，會稽郡置園邑三百家，長丞已下吏奉守冢，寢廟上食祠如法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, they posthumously honored Bo An as Marquis Lingwen, established a funerary estate of 300 households in Kuaiji commandery, with officials from the estate director down to guard the tomb, and provided sacrifices in the resting temple according to ritual regulations.",
              "idiomatic": "Therefore they posthumously honored Bo An as Marquis Lingwen, established a funerary estate of 300 households in Kuaiji commandery, with officials from the director down to guard the tomb, and provided sacrifices in the resting temple according to ritual."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "而櫟陽北亦置靈文侯夫人園，如靈文侯園儀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "North of Cuo Yang they also established a funerary estate for Marquis Lingwen's wife, following the same procedures as Marquis Lingwen's estate.",
              "idiomatic": "North of Cuoyang they also established a funerary estate for Marquis Lingwen's wife, following the same procedures as Marquis Lingwen's estate."
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "薄太后以為母家魏王後，早失父母，其奉薄太后諸魏有力者，於是召復魏氏，［及尊］賞賜各以親疏受之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Bo considered her maternal family descendants of the King of Wei, having lost her parents early. Those from Wei who had diligently served Empress Bo were summoned, and the Wei clan was restored, with honors and rewards bestowed according to kinship closeness.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "薄氏侯者凡一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Altogether one person from the Bo clan became a marquis.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Bo's mother had also died earlier and was buried north of Cuo Yang. Therefore, they posthumously honored Bo An as Marquis Lingwen, established a funerary estate of 300 households in Kuaiji commandery, with officials from the estate director down to guard the tomb, and provided sacrifices in the resting temple according to ritual regulations. North of Cuo Yang they also established a funerary estate for Marquis Lingwen's wife, following the same procedures as Marquis Lingwen's estate. Empress Bo considered that her maternal family were descendants of the King of Wei, and that she had lost her parents early. Those from Wei who had served Empress Bo diligently were summoned, and the Wei clan was restored, with honors and rewards bestowed according to their closeness of kinship. Altogether one person from the Bo clan became a marquis.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "薄太后後文帝二年，以孝景帝前二年崩，葬南陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Bo passed away in the second year of Emperor Wen, corresponding to the second year before Emperor Jing's reign, and was buried at Nanling.",
              "idiomatic": "Empress Bo passed away in the second year of Emperor Wen (second year before Emperor Jing's reign), and was buried at Nanling."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "以呂后會葬長陵，故特自起陵，近孝文皇帝霸陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Because Empress Lü was buried alongside Gaozu in Changling, she specially built her own tomb nearby Emperor Xiaowen's Baliang tomb.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Bo passed away in the second year of Emperor Wen, corresponding to the second year before Emperor Jing's reign, and was buried at Nanling. Because Empress Lü was buried alongside Gaozu in Changling, she specially built her own tomb nearby Emperor Xiaowen's Baliang tomb.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0059",
          "zh": "竇太后，趙之清河觀津人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou was from Guanjin in Qinghe, Zhao.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "呂太后時，竇姬以良家子入宮侍太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "During Empress Lü's time, Dou Ji entered the palace as a daughter of a good family to serve the empress.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "太后出宮人以賜諸王，各五人，竇姬與在行中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress distributed palace women as gifts to the various kings, five each, and Dou Ji was among them.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "竇姬家在清河，欲如趙近家，請其主遣宦者吏：「必置我籍趙之伍中。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dou Ji's home was in Qinghe, and wanting to go to Zhao which was closer to home, she asked her supervisor to send a eunuch official: 'You must place my name in the Zhao group.'",
              "idiomatic": "Dou Ji's home was in Qinghe, wanting to go to Zhao which was closer to home, she asked her supervisor to send a eunuch official: 'You must place my name in the Zhao group.'"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "宦者忘之，誤置其籍代伍中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The eunuch forgot and mistakenly placed her name in the Dai group.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "籍奏，詔可，當行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The roster was submitted, the edict approved, and she was to depart.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "竇姬涕泣，怨其宦者，不欲往，相彊，乃肯行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dou Ji wept bitterly, resented the eunuch, did not want to go, but was forced and finally agreed to depart.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "至代，代王獨幸竇姬，生女嫖，後生兩男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When she arrived in Dai, the King of Dai exclusively favored Dou Ji, who bore a daughter named Piao, and later bore two sons.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "而代王王后生四男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The King of Dai's queen bore four sons.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "先代王未入立為帝而王后卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Before the King of Dai ascended to become emperor, the queen passed away.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "及代王立為帝，而王后所生四男更病死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When the King of Dai became emperor, the four sons born by the queen all subsequently died of illness.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "孝文帝立數月，公卿請立太子，而竇姬長男最長，立為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Several months after Emperor Xiaowen ascended the throne, the ministers requested establishing a crown prince, and since Dou Ji's eldest son was the oldest, he was established as crown prince.",
              "idiomatic": "Several months after Emperor Xiaowen ascended, the ministers requested establishing a crown prince, and since Dou Ji's eldest son was the oldest, he was established as crown prince."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "立竇姬為皇后，女嫖為長公主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dou Ji was established as empress, and her daughter Piao became the eldest princess.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "其明年，立少子武為代王，已而又徙梁，是為梁孝王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The following year, her youngest son Wu was established as King of Dai, but later moved to Liang, becoming King Xiaoxiao of Liang.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou was from Guanjin in Qinghe, Zhao. During Empress Lü's time, Dou Ji entered the palace as a daughter of a good family to serve the empress. The empress distributed palace women as gifts to the various kings, five each, and Dou Ji was among them. Dou Ji's home was in Qinghe, and wanting to go to Zhao which was closer to home, she asked her supervisor to send a eunuch official: 'You must place my name in the Zhao group.' The eunuch forgot and mistakenly placed her name in the Dai group. The roster was submitted, the edict approved, and she was to depart. Dou Ji wept bitterly, resented the eunuch, and did not want to go, but was forced and finally agreed to depart. When she arrived in Dai, the King of Dai exclusively favored Dou Ji, who bore a daughter named Piao, and later bore two sons. The King of Dai's queen bore four sons. Before the King of Dai ascended to become emperor, the queen passed away. When the King of Dai became emperor, the four sons born by the queen all subsequently died of illness. Several months after Emperor Xiaowen ascended the throne, the ministers requested establishing a crown prince, and since Dou Ji's eldest son was the oldest, he was established as crown prince. Dou Ji was established as empress, and her daughter Piao became the eldest princess. The following year, her youngest son Wu was established as King of Dai, but later was moved to Liang, becoming King Xiaoxiao of Liang.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0073",
          "zh": "竇皇后親蚤卒，葬觀津。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou's mother died early and was buried in Guanjin.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "於是薄太后乃詔有司，追尊竇后父為安成侯，母曰安成夫人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, Empress Bo issued an edict to the officials, posthumously honoring Empress Dou's father as Marquis Ancheng, and her mother as Lady Ancheng.",
              "idiomatic": "Therefore Empress Bo issued an edict to the officials, posthumously honoring Empress Dou's father as Marquis Ancheng, and her mother as Lady Ancheng."
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "令清河置園邑二百家，長丞奉守，比靈文園法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She ordered Qinghe to establish a funerary estate of 200 households, with officials to guard it, following the same procedures as the Lingwen estate.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou's mother died early and was buried in Guanjin. Therefore, Empress Bo issued an edict to the officials, posthumously honoring Empress Dou's father as Marquis Ancheng, and her mother as Lady Ancheng. She ordered Qinghe to establish a funerary estate of 200 households, with officials to guard it, following the same procedures as the Lingwen estate.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "竇皇后兄竇長君，弟曰竇廣國，字少君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou's elder brother was Dou Changjun, and her younger brother was Dou Guangguo, styled Shaogun.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "少君年四五歲時，家貧，為人所略賣，其家不知其處。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Shaogun was four or five years old, the family was poor, and he was abducted and sold by someone, his family not knowing where he was.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "傳十餘家，至宜陽，為其主入山作炭，（寒）［暮］臥岸下百餘人，岸崩，盡壓殺臥者，少君獨得脫，不死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He was passed through more than ten households, arriving at Yiyang, where he entered the mountains to make charcoal for his master. In the evening, more than a hundred people slept under a cliff, the cliff collapsed, killing all who slept there, but Shaogun alone escaped and survived.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "自卜數日當為侯，從其家之長安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He divined for himself that within several days he would become a marquis, and followed his master's household to Chang'an.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "聞竇皇后新立，家在觀津，姓竇氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He heard that Empress Dou had recently been established, that her home was in Guanjin, and that her surname was Dou.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "廣國去時雖小，識其縣名及姓，又常與其姊採桑墮，用為符信，上書自陳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Although Guangguo had been young when he left, he remembered the county name and surname, and often gathered mulberry fruits with his sister, using this as a token of recognition. He submitted a memorial presenting himself.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "竇皇后言之於文帝，召見，問之，具言其故，果是。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou spoke of this to Emperor Wen, who summoned him for an audience and questioned him. He fully explained the circumstances, and it was indeed true.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "又復問他何以為驗？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor asked again what other proof there was.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "對曰：「姊去我西時，與我決於傳舍中，丐沐沐我，請食飯我，乃去。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He replied: 'When my sister left me to go west, we parted in the relay station, she begged to wash me, washed me, begged to feed me, fed me, and then left.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "於是竇后持之而泣，泣涕交橫下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou held him and wept, tears streaming down.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "侍御左右皆伏地泣，助皇后悲哀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The attendants on the left and right all prostrated themselves and wept, sharing in the empress's sorrow.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "乃厚賜田宅金錢，封公昆弟，家於長安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He was richly rewarded with fields, residences, and money, and his brothers were enfeoffed, establishing their household in Chang'an.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou's elder brother was Dou Changjun, and her younger brother was Dou Guangguo, styled Shaogun. When Shaogun was four or five years old, the family was poor, and he was abducted and sold by someone, and his family did not know where he was. He was passed through more than ten households, arriving at Yiyang, where he entered the mountains to make charcoal for his master. In the evening, more than a hundred people slept under a cliff, the cliff collapsed, killing all who slept there, but Shaogun alone escaped and survived. He divined for himself that within several days he would become a marquis, and followed his master's household to Chang'an. He heard that Empress Dou had recently been established, that her home was in Guanjin, and that her surname was Dou. Although Guangguo had been young when he left, he remembered the name of the county and the surname, and he often gathered mulberry fruits with his sister, using this as a token of recognition. He submitted a memorial presenting himself. Empress Dou spoke of this to Emperor Wen, who summoned him for an audience and questioned him. He fully explained the circumstances, and it was indeed true. The emperor asked again what other proof there was. He replied: 'When my sister left me to go west, we parted in the relay station, she begged to wash me, washed me, begged to feed me, fed me, and then left.' Empress Dou held him and wept, tears streaming down. The attendants on the left and right all prostrated themselves and wept, sharing in the empress's sorrow. He was richly rewarded with fields, residences, and money, and his brothers were enfeoffed, establishing their household in Chang'an.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0088",
          "zh": "絳侯、灌將軍等曰：「吾屬不死，命乃且縣此兩人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Marquis Jiang and General Guan Ying and others said: 'If we had not died, fate would indeed hang on these two people.",
              "idiomatic": "Marquis Jiang and General Guan Ying and others said: 'If we had not died, fate would indeed hang on these two people.'"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "兩人所出微，不可不為擇師傅賓客，又復效呂氏大事也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "These two came from humble origins, so we must choose tutors and retainers for them, lest they repeat the great affair of the Lü clan.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "於是乃選長者士之有節行者與居。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore they selected elder scholars of integrity and good conduct to live with them.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "竇長君、少君由此為退讓君子，不敢以尊貴驕人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dou Changjun and Shaogun thereby became gentlemen of retirement and yielding, not daring to behave arrogantly because of their honored position.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Marquis Jiang and General Guan Ying and others said: 'If we had not died, fate would indeed hang on these two people. These two came from humble origins, so we must choose tutors and retainers for them, lest they repeat the great affair of the Lü clan.' Therefore, they selected elder scholars of integrity and good conduct to live with them. Dou Changjun and Shaogun thereby became gentlemen of retirement and yielding, not daring to behave arrogantly because of their honored position.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0092",
          "zh": "竇皇后病，失明。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou fell ill and lost her sight.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "文帝幸邯鄲慎夫人、尹姬，皆毋子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wen favored Lady Shen of Handan and Lady Yin Ji, but both were childless.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "孝文帝崩，孝景帝立，乃封廣國為章武侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Xiaowen passed away and Emperor Xiaojing ascended, Guangguo was enfeoffed as Marquis of Zhangwu.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "長君前死，封其子彭祖為南皮侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Changjun had died earlier, so his son Pengzu was enfeoffed as Marquis of Nanpi.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "吳楚反時，竇太后從昆弟子竇嬰，任俠自喜，將兵，以軍功為魏其侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "During the Wu-Chu rebellion, Empress Dou's nephew Dou Ying, who delighted in acting as a knight-errant, led troops and was enfeoffed as Marquis of Weiqi for his military merits.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "竇氏凡三人為侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Altogether three people from the Dou clan became marquises.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou fell ill and lost her sight. Emperor Wen favored Lady Shen of Handan and Lady Yin Ji, but both were childless. When Emperor Xiaowen passed away and Emperor Xiaojing ascended, Guangguo was enfeoffed as Marquis of Zhangwu. Changjun had died earlier, so his son Pengzu was enfeoffed as Marquis of Nanpi. During the Wu-Chu rebellion, Empress Dou's nephew Dou Ying, who delighted in acting as a knight-errant, led troops and was enfeoffed as Marquis of Weiqi for his military merits. Altogether three people from the Dou clan became marquises.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0098",
          "zh": "竇太后好黃帝、老子言，帝及太子諸竇不得不讀黃帝、老子，尊其術。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou favored the teachings of the Yellow Emperor and Laozi, so the emperor and crown prince and various Dous all had to study the Yellow Emperor and Laozi, honoring their teachings.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou favored the teachings of the Yellow Emperor and Laozi, so the emperor and the crown prince and the various Dous all had to study the Yellow Emperor and Laozi, honoring their teachings.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "竇太后後孝景帝六歲（建元六年）崩，合葬霸陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Dou passed away six years after Emperor Xiaojing (in the sixth year of Jianyuan), and was buried alongside him in Baliang tomb.",
              "idiomatic": "Empress Dou passed away six years after Emperor Xiaojing (sixth year of Jianyuan), and was buried alongside him in Baliang tomb."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "遺詔盡以東宮金錢財物賜長公主嫖。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Her testament directed that all the money, valuables, and property from the Eastern Palace be given to the eldest princess Piao.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Dou passed away six years after Emperor Xiaojing (in the sixth year of Jianyuan), and was buried alongside him in Baliang tomb. Her testament directed that all the money, valuables, and property from the Eastern Palace be given to the eldest princess Piao.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "王太后，槐裏人，母曰臧兒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Wang was from Huaili, her mother named Zang Er.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "臧兒者，故燕王臧荼孫也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zang Er was the granddaughter of the former King of Yan, Zang Shu.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "臧兒嫁為槐裏王仲妻，生男曰信，與兩女。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zang Er married Wang Zhong of Huaili as his wife, bearing a son named Xin and two daughters.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "而仲死，臧兒更嫁長陵田氏，生男蚡、勝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After Zhong died, Zang Er remarried a Tian clansman of Changling, bearing sons Fen and Sheng.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "臧兒長女嫁為金王孫婦，生一女矣，而臧兒卜筮之，曰兩女皆當貴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zang Er's eldest daughter married into the Jin family as Jin Wangsun's wife, and already bore a daughter, but Zang Er divined for them and said both daughters would be noble.",
              "idiomatic": "Zang Er's eldest daughter married Jin Wangsun as his wife and already bore a daughter, but Zang Er divined and said both daughters would be noble."
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "因欲奇兩女，乃奪金氏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore wishing to make the two daughters exceptional, she took them from the Jin family.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "金氏怒，不肯予決，乃內之太子宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Jin family was angry and refused to give her up, so she brought her into the crown prince's palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "太子幸愛之，生三女一男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The crown prince favored and loved her, bearing three daughters and one son.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "男方在身時，王美人夢日入其懷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "While the son was still in her womb, Lady Wang dreamt the sun entered her bosom.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "以告太子，太子曰：「此貴徵也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She told this to the crown prince, who said: \"This is an auspicious sign of nobility.\"",
              "idiomatic": "She told the crown prince, who said: 'This is an auspicious sign of nobility.'"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "未生而孝文帝崩，孝景帝即位，王夫人生男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Before the child was born, Emperor Xiaowen passed away, Emperor Xiaojing ascended, and Lady Wang bore a son.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Wang was from Huaili, and her mother was named Zang Er. Zang Er was the granddaughter of the former King of Yan, Zang Shu. Zang Er married Wang Zhong of Huaili as his wife, bearing a son named Xin, and two daughters. After Zhong died, Zang Er remarried a Tian clansman of Changling, bearing sons Fen and Sheng. Zang Er's eldest daughter married into the Jin family as Jin Wangsun's wife, and already bore a daughter, but Zang Er divined for them and said both daughters would be noble. Therefore, wishing to make her two daughters exceptional, she took the daughter back from the Jin family. The Jin family was angry and refused to give her up, so she brought her into the crown prince's palace. The crown prince favored and loved her, and she bore three daughters and one son. While the son was still in her womb, Lady Wang dreamt that the sun entered her bosom. She told this to the crown prince, who said: \"This is an auspicious sign of nobility.\" Before the child was born, Emperor Xiaowen passed away, Emperor Xiaojing ascended the throne, and Lady Wang bore a son.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0112",
          "zh": "先是臧兒又入其少女兒姁，兒姁生四男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Previously, Zang Er had also brought in her youngest daughter Er Xu, who bore four sons.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Previously, Zang Er had also brought in her youngest daughter Er Xu, who bore four sons.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0113",
          "zh": "景帝為太子時，薄太后以薄氏女為妃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Jing was crown prince, Empress Bo made a Bo family daughter his consort.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "及景帝立，立妃曰薄皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Jing ascended, he established the consort as Empress Bo.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "皇后毋子，毋寵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress had no children and received no favor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "薄太后崩，廢薄皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Empress Bo passed away, Empress Bo was deposed.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Emperor Jing was crown prince, Empress Bo made a Bo family daughter his consort. When Emperor Jing ascended, he established the consort as Empress Bo. The empress had no children and received no favor. When Empress Bo passed away, Empress Bo was deposed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0117",
          "zh": "景帝長男榮，其母栗姬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Jing's eldest son Rong had as his mother Lady Li.",
              "idiomatic": "Emperor Jing's eldest son Rong had Lady Li as his mother."
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "栗姬，齊人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li was from Qi.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "立榮為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Rong was established as crown prince.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "長公主嫖有女，欲予為妃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Eldest princess Piao had a daughter whom she wished to give as consort.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "栗姬妒，而景帝諸美人皆因長公主見景帝，得貴幸，皆過栗姬，栗姬日怨怒，謝長公主，不許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li was jealous, and all of Emperor Jing's beauties were introduced to Emperor Jing through the eldest princess and obtained honored favor, all surpassing Lady Li. Lady Li daily resented and was angry, declining the eldest princess, refusing permission.",
              "idiomatic": "Lady Li was jealous, and all Emperor Jing's beauties were introduced through the eldest princess and obtained honored favor, all surpassing Lady Li. Lady Li daily resented and was angry, declining the eldest princess and refusing permission."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "長公主欲予王夫人，王夫人許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The eldest princess wished to give her to Lady Wang, and Lady Wang agreed.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "長公主怒，而日讒栗姬短於景帝曰：「栗姬與諸貴夫人幸姬會，常使侍者祝唾其背，挾邪媚道。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The eldest princess was angry and daily slandered Lady Li's faults to Emperor Jing, saying: \"Lady Li meets with the various honored ladies and favored consorts, and constantly makes attendants curse and spit on their backs, practicing witchcraft and seductive arts.\"",
              "idiomatic": "The eldest princess was angry and daily slandered Lady Li's faults to Emperor Jing: 'Lady Li meets with the honored ladies and favored consorts, constantly making attendants curse and spit on their backs, practicing witchcraft and seductive arts.'"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "景帝以故望之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Because of this, Emperor Jing came to despise her.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Emperor Jing's eldest son Rong had as his mother Lady Li. Lady Li was from Qi. Rong was established as crown prince. The eldest princess Piao had a daughter whom she wished to give as consort. Lady Li was jealous, and all of Emperor Jing's beauties were introduced to Emperor Jing through the eldest princess and obtained honored favor, all surpassing Lady Li. Lady Li daily resented and was angry, declining the eldest princess, refusing permission. The eldest princess wished to give her to Lady Wang, and Lady Wang agreed. The eldest princess was angry and daily slandered Lady Li's faults to Emperor Jing, saying: \"Lady Li meets with the various honored ladies and favored consorts, and constantly makes attendants curse and spit on their backs, practicing witchcraft and seductive arts.\" Because of this, Emperor Jing came to despise her.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0125",
          "zh": "景帝嘗體不安，心不樂，屬諸子為王者於栗姬，曰：「百歲後，善視之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Once when Emperor Jing was physically unwell and unhappy in heart, he entrusted his sons who would become kings to Lady Li, saying: \"After a hundred years, care for them well.\"",
              "idiomatic": "Once when Emperor Jing was physically unwell and unhappy, he entrusted his sons who would become kings to Lady Li, saying: 'After a hundred years, care for them well.'"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "栗姬怒，不肯應，言不遜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li was angry, refused to respond, and spoke disrespectfully.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "景帝恚，心嗛之而未發也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Jing was angry, harbored resentment in his heart but did not yet act.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Once when Emperor Jing was physically unwell and unhappy in heart, he entrusted his sons who would become kings to Lady Li, saying: \"After a hundred years, care for them well.\" Lady Li was angry and refused to respond, speaking disrespectfully. Emperor Jing was furious, harbored resentment in his heart but did not yet act on it.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0128",
          "zh": "長公主日譽王夫人男之美，景帝亦賢之，又有曩者所夢日符，計未有所定。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The eldest princess daily praised the beauty of Lady Wang's son, and Emperor Jing also considered him worthy, moreover there was the previous dream of the sun as an omen, so his plans were not yet decided.",
              "idiomatic": "The eldest princess daily praised Lady Wang's son's beauty, Emperor Jing also considered him worthy, moreover there was the previous dream of the sun as omen, so his plans were not yet decided."
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "王夫人知帝望栗姬，因怒未解，陰使人趣大臣立栗姬為皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Wang knew the emperor despised Lady Li, and since his anger had not subsided, she secretly sent people to urge the ministers to establish Lady Li as empress.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "大行奏事畢，曰：「『子以母貴，母以子貴』，今太子母無號，宜立為皇后。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Chamberlain for Ceremonials, having finished reporting on affairs, said: 'The saying goes \"The son is honored because of the mother, the mother is honored because of the son.\" Now the crown prince's mother has no title, she should be established as empress.'",
              "idiomatic": "The Chamberlain for Ceremonials, having finished reporting, said: 'The saying goes \"The son is honored because of the mother, the mother because of the son.\" Now the crown prince's mother has no title, she should be established as empress.'"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "景帝怒曰：「是而所宜言邪！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Jing was angry and said: \"Is this something you should say!\"",
              "idiomatic": "Emperor Jing was angry and said: 'Is this something you should say!'"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "遂案誅大行，而廢太子為臨江王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He immediately investigated and executed the Chamberlain for Ceremonials, and deposed the crown prince to become King of Linjiang.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "栗姬愈恚恨，不得見，以憂死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li became even more resentful and furious, was not allowed to see him, and died of sorrow.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "卒立王夫人為皇后，其男為太子，封皇后兄信為蓋侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Finally Lady Wang was established as empress, her son as crown prince, and the empress's brother Xin was enfeoffed as Marquis of Gai.",
              "idiomatic": "Finally Lady Wang was established as empress, her son as crown prince, and the empress's brother Xin enfeoffed as Marquis of Gai."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The eldest princess daily praised the beauty of Lady Wang's son, and Emperor Jing also considered him worthy, moreover there was the previous dream of the sun as an omen, so his plans were not yet decided. Lady Wang knew the emperor despised Lady Li, and since his anger had not subsided, she secretly sent people to urge the ministers to establish Lady Li as empress. The Chamberlain for Ceremonials, having finished reporting on affairs, said: 'The saying goes \"The son is honored because of the mother, the mother is honored because of the son.\" Now the crown prince's mother has no title, she should be established as empress.' Emperor Jing was angry and said: \"Is this something you should say!\" He immediately investigated and executed the Chamberlain for Ceremonials, and deposed the crown prince to become King of Linjiang. Lady Li became even more resentful and furious, was not allowed to see him, and died of sorrow. Finally Lady Wang was established as empress, her son as crown prince, and the empress's brother Xin was enfeoffed as Marquis of Gai.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "景帝崩，太子襲號為皇帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Jing passed away, the crown prince succeeded to the throne as emperor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "尊皇太后母臧兒為平原君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Empress Dowager's mother Zang Er was honored as Lord of Pingyuan.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "封田蚡為武安侯，勝為周陽侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Fen was enfeoffed as Marquis of Wu'an, and Sheng as Marquis of Zhouyang.",
              "idiomatic": "Tian Fen was enfeoffed as Marquis of Wu'an, Sheng as Marquis of Zhouyang."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Emperor Jing passed away, the crown prince succeeded to the throne as emperor. The Empress Dowager's mother Zang Er was honored as Lord of Pingyuan. Tian Fen was enfeoffed as Marquis of Wu'an, and Sheng as Marquis of Zhouyang.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0138",
          "zh": "景帝十三男，一男為帝，十二男皆為王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Jing had thirteen sons: one became emperor, twelve became kings.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "而兒姁早卒，其四子皆為王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Er Xu died early, but her four sons all became kings.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "王太后長女號日平陽公主，次為南宮公主，次為林慮公主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Wang's eldest daughter was styled Princess Pingyang, the second Princess Nangong, the third Princess Linlü.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Emperor Jing had thirteen sons: one became emperor, twelve became kings. Er Xu died early, but her four sons all became kings. Empress Wang's eldest daughter was styled Princess Pingyang, the second Princess Nangong, the third Princess Linlü.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0141",
          "zh": "蓋侯信好酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Marquis Gai Xin was fond of wine.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "田蚡、勝貪，巧於文辭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Fen and Sheng were greedy, skillful with written compositions.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "王仲蚤死，葬槐裏，追尊為共侯，置園邑二百家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang Zhong died early and was buried in Huaili, posthumously honored as Marquis Gong, with a funerary estate of 200 households established.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "及平原君卒，從田氏葬長陵，置園比共侯園。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Lord Pingyuan passed away, she was buried with the Tian clan in Changling, with an estate comparable to Marquis Gong's estate.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "而王太后後孝景帝十六歲，以元朔四年崩，合葬陽陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Wang passed away sixteen years after Emperor Jing, in the fourth year of Yuanshuo, and was buried alongside him in Yangling.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "王太后家凡三人為侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Altogether three people from Empress Wang's family became marquises.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Marquis Gai Xin was fond of wine. Tian Fen and Sheng were greedy, skillful with written compositions. Wang Zhong died early and was buried in Huaili, posthumously honored as Marquis Gong, with a funerary estate of 200 households established. When Lord Pingyuan passed away, she was buried with the Tian clan in Changling, with an estate comparable to Marquis Gong's estate. Empress Wang passed away sixteen years after Emperor Jing, in the fourth year of Yuanshuo, and was buried alongside him in Yangling tomb. Altogether three people from Empress Wang's family became marquises.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0147",
          "zh": "衛皇后字子夫，生微矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Wei, styled Zifu, was born of humble origins.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "蓋其家號曰衛氏，出平陽侯邑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Her family was called the Wei clan, from the domain of Marquis Pingyang.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "子夫為平陽主謳者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zifu was a singer for Princess Pingyang.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "武帝初即位，數歲無子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Wu first ascended the throne, for several years he had no sons.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "平陽主求諸良家子女十餘人，飾置家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Princess Pingyang sought out more than ten daughters from good families, adorned them, and placed them in her household.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "武帝祓霸上還，因過平陽主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu performed the purification ritual at Bashang and returned, passing by Princess Pingyang's residence.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "主見所侍美人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The princess presented the beauties in her service.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "上弗說。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor was not pleased.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "既飲，謳者進，上望見，獨說衛子夫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After drinking, the singers came forward, and the emperor caught sight of them, but was particularly pleased with Wei Zifu alone.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "是日，武帝起更衣，子夫侍尚衣軒中，得幸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "That day, Emperor Wu rose to change his clothes, and Zifu attended him in the carriage for court robes, where she received his favor.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "上還坐，驩甚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor returned to his seat, extremely delighted.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "賜平陽主金千斤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He granted Princess Pingyang a thousand jin of gold.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "主因奏子夫奉送入宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The princess then memorialized to send Zifu into the palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "子夫上車，平陽主拊其背曰：「行矣，彊飯，勉之！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Zifu boarded the carriage, Princess Pingyang patted her back and said: \"Go now, eat well, exert yourself!",
              "idiomatic": "When Zifu boarded the carriage, Princess Pingyang patted her back and said: 'Go now, eat well, exert yourself!"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "即貴，無相忘。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When you become noble, do not forget me.\"",
              "idiomatic": "When you become noble, do not forget me.'"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "入宮歲餘，竟不復幸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She entered the palace for more than a year, but was never favored again.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "武帝擇宮人不中用者，斥出歸之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu selected palace women who were not useful and expelled them to return home.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "衛子夫得見，涕泣請出。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wei Zifu was able to be seen, wept and requested to leave.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "上憐之，復幸，遂有身，尊寵日隆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor pitied her, favored her again, and she became pregnant, her honored favor increasing daily.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "召其兄衛長君弟青為侍中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Summoned her brother Wei Changjun and younger brother Qing to serve as attendants.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "而子夫後大幸，有寵，凡生三女一男。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Later Zifu was greatly favored and had honor, altogether bearing three daughters and one son.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "男名據。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The son was named Ju.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Wei, styled Zifu, was born of humble origins. Her family was called the Wei clan, from the domain of Marquis Pingyang. Zifu was a singer for Princess Pingyang. When Emperor Wu first ascended the throne, for several years he had no sons. Princess Pingyang sought out more than ten daughters from good families, adorned them, and placed them in her household. Emperor Wu performed the purification ritual at Bashang and returned, passing by Princess Pingyang's residence. The princess presented the beauties in her service. The emperor was not pleased. After drinking, the singers came forward, and the emperor caught sight of them, but was particularly pleased with Wei Zifu alone. That day, Emperor Wu rose to change his clothes, and Zifu attended him in the carriage for court robes, where she received his favor. The emperor returned to his seat, extremely delighted. He granted Princess Pingyang a thousand jin of gold. The princess then memorialized to send Zifu into the palace. When Zifu boarded the carriage, Princess Pingyang patted her back and said: \"Go now, eat well, exert yourself! When you become noble, do not forget me.\" She entered the palace for more than a year, but was never favored again. Emperor Wu selected palace women who were not useful and expelled them to return home. Wei Zifu was able to be seen, wept and requested to leave. The emperor pitied her, favored her again, and she became pregnant, her honored favor increasing daily. He summoned her brother Wei Changjun and younger brother Qing to serve as attendants in the palace. Later Zifu was greatly favored and had honor, altogether bearing three daughters and one son. The son was named Ju.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0169",
          "zh": "初，上為太子時，娶長公主女為妃。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At first, when the emperor was crown prince, he married the eldest princess's daughter as his consort.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "立為帝，妃立為皇后，姓陳氏，無子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When he ascended as emperor, the consort was established as empress, surnamed Chen, and had no children.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "上之得為嗣，大長公主有力焉，以故陳皇后驕貴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The eldest princess had exerted great effort in the emperor's succession, therefore Empress Chen was arrogant and haughty.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "聞衛子夫大幸，恚，幾死者數矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When she heard that Wei Zifu was greatly favored, she was furious, nearly dying several times.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "上愈怒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor became even more angry.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "陳皇后挾婦人媚道，其事頗覺，於是廢陳皇后，而立衛子夫為皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Chen practiced women's seductive arts, and the matter became quite apparent, therefore Empress Chen was deposed, and Wei Zifu was established as empress.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "At first, when the emperor was crown prince, he married the eldest princess's daughter as his consort. When he ascended as emperor, the consort was established as empress, surnamed Chen, and had no children. The eldest princess had exerted great effort in the emperor's succession, therefore Empress Chen was arrogant and haughty. When she heard that Wei Zifu was greatly favored, she was furious, nearly dying several times. The emperor became even more angry. Empress Chen practiced women's seductive arts, and the matter became quite apparent, therefore Empress Chen was deposed, and Wei Zifu was established as empress.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0175",
          "zh": "陳皇后母大長公主，景帝姊也，數讓武帝姊平陽公主曰：「帝非我不得立，已而棄捐吾女，壹何不自喜而倍本乎！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Chen's mother was the eldest princess, Emperor Jing's sister, who frequently reproached Emperor Wu's sister Princess Pingyang, saying: \"The emperor could not have ascended without me, yet now he abandons and discards my daughter—why is he so displeased and turns against his roots!\"",
              "idiomatic": "Empress Chen's mother was the eldest princess, Emperor Jing's sister, who frequently reproached Emperor Wu's sister Princess Pingyang: 'The emperor could not have ascended without me, yet now he abandons and discards my daughter—why is he so displeased and turns against his roots!'"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "平陽公主曰：「用無子故廢耳。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Princess Pingyang said: \"She was deposed because she had no children.\"",
              "idiomatic": "Princess Pingyang said: 'She was deposed because she had no children.'"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "陳皇后求子，與醫錢凡九千萬，然竟無子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Chen sought a child, giving doctors altogether ninety million cash, but in the end had no child.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Empress Chen's mother was the eldest princess, Emperor Jing's sister, who frequently reproached Emperor Wu's sister Princess Pingyang, saying: \"The emperor could not have ascended without me, yet now he abandons and discards my daughter—why is he so displeased and turns against his roots!\" Princess Pingyang said: \"She was deposed because she had no children.\" Empress Chen sought a child, giving doctors altogether ninety million cash, but in the end had no child.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0178",
          "zh": "衛子夫已立為皇后，先是衛長君死，乃以衛青為將軍，擊胡有功，封為長平侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After Wei Zifu was established as empress, Wei Changjun had already died, so Wei Qing was made a general, achieved merit attacking the Xiongnu, and was enfeoffed as Marquis of Changping.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "青三子在襁褓中，皆封為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qing's three sons, still in swaddling clothes, were all enfeoffed as marquises.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "及衛皇后所謂姊衛少兒，少兒生子霍去病，以軍功封冠軍侯，號驃騎將軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "As for Empress Wei's so-called sister Wei Shaorer, Shaorer bore a son Huo Qubing, who for military merit was enfeoffed as Marquis of Guanju, and styled General Champion.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "青號大將軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qing was styled Grand General.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "立衛皇后子據為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Empress Wei's son Ju was established as crown prince.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "衛氏枝屬以軍功起家，五人為侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The Wei clan branches rose through military merit, five people became marquises.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "After Wei Zifu was established as empress, Wei Changjun had already died, so Wei Qing was made a general, achieved merit attacking the Xiongnu, and was enfeoffed as Marquis of Changping. Qing's three sons, still in swaddling clothes, were all enfeoffed as marquises. As for Empress Wei's so-called sister Wei Shaorer, Shaorer bore a son Huo Qubing, who for military merit was enfeoffed as Marquis of Guanju, and styled General Champion. Qing was styled Grand General. Empress Wei's son Ju was established as crown prince. The Wei clan branches rose through military merit, five people became marquises.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0184",
          "zh": "及衛后色衰，趙之王夫人幸，有子，為齊王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Empress Wei's beauty faded, Lady Wang of Zhao was favored, had a son who became King of Qi.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Empress Wei's beauty faded, Lady Wang of Zhao was favored, had a son who became King of Qi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0185",
          "zh": "王夫人蚤卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Wang died early.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "而中山李夫人有寵，有男一人，為昌邑王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li of Zhongshan was favored, had one son who became King of Changyi.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lady Wang died early. Lady Li of Zhongshan was favored, had one son who became King of Changyi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0187",
          "zh": "李夫人蚤卒，其兄李延年以音幸，號協律。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Li died early, her brother Li Yannian was favored for his music, styled Coordinator of Pitch Pipes.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "協律者，故倡也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Coordinator of Pitch Pipes was formerly a performer.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "兄弟皆坐姦，族。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The brothers were all executed for licentiousness, their clan exterminated.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "是時其長兄廣利為貳師將軍，伐大宛，不及誅，還，而上既夷李氏，後憐其家，乃封為海西侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At this time their eldest brother Guangli was General Ershi, attacked Dayuan, did not participate in the execution, returned, and the emperor, having already exterminated the Li clan, later pitied their family and enfeoffed him as Marquis of Haixi.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lady Li died early, her brother Li Yannian was favored for his music, styled Coordinator of Pitch Pipes. Coordinator of Pitch Pipes was formerly a performer. The brothers were all executed for licentiousness, their clan exterminated. At this time their eldest brother Guangli was General Ershi, attacked Dayuan, did not participate in the execution, returned, and the emperor, having already exterminated the Li clan, later pitied their family and enfeoffed him as Marquis of Haixi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0191",
          "zh": "他姬子二人為燕王、廣陵王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Other consorts' two sons became King of Yan and King of Guangling.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "其母無寵，以憂死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Their mothers had no favor and died of sorrow.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Other consorts' two sons became King of Yan and King of Guangling. Their mothers had no favor and died of sorrow.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0193",
          "zh": "及李夫人卒，則有尹婕妤之屬，更有寵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After Lady Li died, then there were the likes of Lady Yin the Pure Consort who were favored again.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "然皆以倡見，非王侯有土之士女，不可以配人主也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "However, they all gained favor through performance, not being daughters of kings or marquises with territory, which cannot be matched with the ruler.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "After Lady Li died, then there were the likes of Lady Yin the Pure Consort who were favored again. However, they all gained favor through performance, not being daughters of kings or marquises with territory, which cannot be matched with the ruler.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0195",
          "zh": "褚先生曰：臣為郎時，問習漢家故事者鐘離生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Master Chu says: When I was a court gentleman, I asked Zhongli Sheng, who was familiar with Han court precedents.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "曰：王太后在民閒時所生（子）［一］女者，父為金王孫。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He said: Empress Wang, when she was among the common people, bore one daughter, whose father was Jin Wangsun.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "王孫已死，景帝崩後，武帝已立，王太后獨在。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wangsun had already died, after Emperor Jing's passing, Emperor Wu had already ascended, Empress Wang was alone.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "而韓王孫名嫣素得幸武帝，承閒白言太后有女在長陵也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han Wangsun named Yan had long been favored by Emperor Wu, and taking advantage of a moment, informed him that the empress had a daughter in Changling.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "武帝曰：「何不蚤言！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu said: \"Why didn't you speak earlier!\"",
              "idiomatic": "Emperor Wu said: 'Why didn't you speak earlier!'"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "乃使使往先視之，在其家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He sent envoys to first inspect her, and she was in their home.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "武帝乃自往迎取之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu then personally went to welcome and take her.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "蹕道，先驅旄騎出橫城門，乘輿馳至長陵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Clearing the way, he first sent out the feathered cavalry from the Hengcheng Gate, and the imperial carriage galloped to Changling.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "當小市西入里，里門閉，暴開門，乘輿直入此里，通至金氏門外止，使武騎圍其宅，為其亡走，身自往取不得也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At the small market, west into the alley, the alley gate was closed, they forcibly opened the gate, the imperial carriage went straight into this alley, proceeding until stopping outside the Jin family's gate, ordering armed cavalry to surround their residence, fearing she would flee, personally going to fetch her so she could not escape.",
              "idiomatic": "At the small market, west into the alley, the alley gate was closed. They forcibly opened the gate, the imperial carriage went straight into this alley, proceeding until stopping outside the Jin family's gate. He ordered armed cavalry to surround their residence, fearing she would flee, personally going to fetch her so she could not escape."
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "即使左右群臣入呼求之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He then ordered the ministers on left and right to enter and call for her.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "家人驚恐，女亡匿內中床下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The family was alarmed and terrified, the girl fled and hid under the bed inside.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "扶持出門，令拜謁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "They supported her out the door and ordered her to make obeisance.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "武帝下車泣曰：「嚄！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu alighted from his carriage and wept, saying: \"Ah!",
              "idiomatic": "Emperor Wu alighted from his carriage and wept, saying: 'Ah!"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "大姊，何藏之深也！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Elder sister, why did you hide so deeply!\"",
              "idiomatic": "Elder sister, why did you hide so deeply!'"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "詔副車載之，迴車馳還，而直入長樂宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He ordered the secondary carriage to carry her, turned the carriage around and galloped back, going straight into Changlegong Palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "行詔門著引籍，通到謁太后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He issued orders to the gate officials to record her name and permit passage to audience with the empress dowager.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "太后曰：「帝倦矣，何從來？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress dowager said: \"The emperor is weary, where has he come from?\"",
              "idiomatic": "The empress dowager said: 'The emperor is weary, where has he come from?'"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "帝曰：「今者至長陵得臣姊，與俱來。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor said: \"Today I went to Changling and obtained my subject-sister, and have come together with her.\"",
              "idiomatic": "The emperor said: 'Today I went to Changling and obtained my subject-sister, and have come together with her.'"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "顧曰：「謁太后！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He turned and said: \"Audience with the empress dowager!\"",
              "idiomatic": "He turned and said: 'Audience with the empress dowager!'"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "太后曰：「女某邪？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress dowager said: \"Are you so-and-so's daughter?\"",
              "idiomatic": "The empress dowager said: 'Are you so-and-so's daughter?'"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "曰：「是也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She said: \"Yes.\"",
              "idiomatic": "She said: 'Yes.'"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "太后為下泣，女亦伏地泣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress dowager wept below, and the girl also prostrated herself and wept.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "武帝奉酒前為壽，奉錢千萬，奴婢三百人，公田百頃，甲第，以賜姊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu presented wine and toasted her longevity, bestowed ten million cash, three hundred slaves and maids, one hundred qing of public fields, and an armored residence, to grant to his sister.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "太后謝曰：「為帝費焉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The empress dowager declined, saying: \"This costs the emperor too much.\"",
              "idiomatic": "The empress dowager declined, saying: 'This costs the emperor too much.'"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "於是召平陽主、南宮主、林慮主三人俱來謁見姊，因號曰修成君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, he summoned Princess Pingyang, Princess Nangong, and Princess Linlü, the three of them, to come and audience with their sister, and thus styled her Lord Xiucheng.",
              "idiomatic": "Therefore he summoned Princess Pingyang, Princess Nangong, and Princess Linlü, the three of them, to come and audience with their sister, and thus styled her Lord Xiucheng."
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "有子男一人，女一人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She had one son and one daughter.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "男號為修成子仲，女為諸侯王王后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The son was styled Xiuchengzi Zhong, the daughter became queen consort to various feudal kings.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "此二子非劉氏，以故太后憐之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "These two children were not of the Liu clan, therefore the empress dowager pitied them.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "修成子仲驕恣，陵折吏民，皆患苦之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiuchengzi Zhong was arrogant and unrestrained, bullying officials and people, all suffered bitterly from him.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Master Chu says: When I was a court gentleman, I asked Zhongli Sheng, who was familiar with Han court precedents. He said: Empress Wang, when she was among the common people, bore one daughter, whose father was Jin Wangsun. Wangsun had already died, after Emperor Jing's passing, Emperor Wu had already ascended, Empress Wang was alone. Han Wangsun named Yan had long been favored by Emperor Wu, and taking advantage of a moment, informed him that the empress had a daughter in Changling. Emperor Wu said: \"Why didn't you speak earlier!\" He sent envoys to first inspect her, and she was in their home. Emperor Wu then personally went to welcome and take her. Clearing the way, first sending out the feathered cavalry from the Hengcheng Gate, the imperial carriage galloped to Changling. At the small market, west into the alley, the alley gate was closed, they forcibly opened the gate, the imperial carriage went straight into this alley, proceeding until stopping outside the Jin family's gate, ordering armed cavalry to surround their residence, fearing she would flee, personally going to fetch her so she could not escape. He then ordered the ministers on his left and right to enter and call for her. The family was alarmed and terrified, the girl fled and hid under the bed inside. They supported her out the door and ordered her to make obeisance. Emperor Wu alighted from his carriage and wept, saying: \"Ah! Elder sister, why did you hide so deeply!\" He ordered the secondary carriage to carry her, turned the carriage around and galloped back, going straight into Changlegong Palace. He issued orders to the gate officials to record her name and permit passage to audience with the empress dowager. The empress dowager said: \"The emperor is weary, where has he come from?\" The emperor said: \"Today I went to Changling and obtained my subject-sister, and have come together with her.\" He turned and said: \"Audience with the empress dowager!\" The empress dowager said: \"Are you so-and-so's daughter?\" She said: \"Yes.\" The empress dowager wept below, and the girl also prostrated herself and wept. Emperor Wu presented wine and toasted her longevity, bestowed ten million cash, three hundred slaves and maids, one hundred qing of public fields, and an armored residence, to grant to his sister. The empress dowager declined, saying: \"This costs the emperor too much.\" Therefore, he summoned Princess Pingyang, Princess Nangong, and Princess Linlü, the three of them, to come and audience with their sister, and thus styled her Lord Xiucheng. She had one son and one daughter. The son was styled Xiuchengzi Zhong, the daughter became queen consort to various feudal kings. These two children were not of the Liu clan, therefore the empress dowager pitied them. Xiuchengzi Zhong was arrogant and unrestrained, bullying officials and people, all suffered bitterly from him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0224",
          "zh": "衛子夫立為皇后，后弟衛青字仲卿，以大將軍封為長平侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wei Zifu was established as empress, her younger brother Wei Qing styled Zhongqing, as Grand General was enfeoffed as Marquis of Changping.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "四子，長子伉為侯世子，侯世子常侍中，貴幸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He had four sons: the eldest son Kang became heir to the marquisate, the heir to the marquisate often served in attendance, honored and favored.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "其三弟皆封為侯，各千三百戶，一曰陰安侯，二曰發干侯，三曰宜春侯，貴震天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His three younger brothers were all enfeoffed as marquises, each with thirteen hundred households: one called Marquis of Yin'an, two called Marquis of Fagan, three called Marquis of Yichun, their honor shook the realm.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "天下歌之曰：「生男無喜，生女無怒，獨不見衛子夫霸天下！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The realm sang of it, saying: \"No joy in bearing sons, no anger in bearing daughters, don't you see Wei Zifu dominating the realm!\"",
              "idiomatic": "The realm sang of it, saying: 'No joy in bearing sons, no anger in bearing daughters, don't you see Wei Zifu dominating the realm!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Wei Zifu was established as empress, her younger brother Wei Qing styled Zhongqing, as Grand General was enfeoffed as Marquis of Changping. He had four sons: the eldest son Kang became heir to the marquisate, the heir to the marquisate often served in attendance, honored and favored. His three younger brothers were all enfeoffed as marquises, each with thirteen hundred households: one called Marquis of Yin'an, two called Marquis of Fagan, three called Marquis of Yichun, their honor shook the realm. The realm sang of it, saying: \"No joy in bearing sons, no anger in bearing daughters, don't you see Wei Zifu dominating the realm!\"",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0229",
          "zh": "是時平陽主寡居，當用列侯尚主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At this time Princess Pingyang lived as a widow, and should marry a marquis to become princess consort.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "主與左右議長安中列侯可為夫者，皆言大將軍可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The princess discussed with her attendants which marquises in Chang'an could become her husband, and all said the Grand General could.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "主笑曰：「此出吾家，常使令騎從我出入耳，柰何用為夫乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The princess laughed and said: \"This man came from my household, he always rode as an escort following me in and out, how could I take him as husband?\"",
              "idiomatic": "The princess laughed and said: 'This man came from my household, he always rode as an escort following me in and out, how could I take him as husband?'"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "左右侍御者曰：「今大將軍姊為皇后，三子為侯，富貴振動天下，主何以易之乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The attendants serving on the left and right said: \"Now the Grand General's sister is empress, his three sons are marquises, their wealth and honor shake the realm—princess, what could you exchange for this?\"",
              "idiomatic": "The attendants serving on the left and right said: 'Now the Grand General's sister is empress, his three sons are marquises, their wealth and honor shake the realm—princess, what could you exchange for this?'"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "於是主乃許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore the princess agreed to it.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "言之皇后，令白之武帝，乃詔衛將軍尚平陽公主焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She spoke of it to the empress, who informed Emperor Wu, and he issued an edict that General Wei should marry Princess Pingyang.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "At this time Princess Pingyang lived as a widow, and should marry a marquis to become princess consort. The princess discussed with her attendants which marquises in Chang'an could become her husband, and all said the Grand General could. The princess laughed and said: \"This man came from my household, he always rode as an escort following me in and out, how could I take him as husband?\" The attendants serving on the left and right said: \"Now the Grand General's sister is empress, his three sons are marquises, their wealth and honor shake the realm—princess, what could you exchange for this?\" Therefore the princess agreed to it. She spoke of it to the empress, who informed Emperor Wu, and he issued an edict that General Wei should marry Princess Pingyang.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "褚先生曰：丈夫龍變。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Master Chu says: A husband undergoes dragon transformation.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "傳曰：「蛇化為龍，不變其文；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The tradition says: \"When a snake transforms into a dragon, it does not change its patterns;",
              "idiomatic": "The tradition says: 'When a snake transforms into a dragon, it does not change its patterns;"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "家化為國，不變其姓。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When a family transforms into a state, it does not change its surname.\"",
              "idiomatic": "When a family transforms into a state, it does not change its surname.'"
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "丈夫當時富貴，百惡滅除，光耀榮華，貧賤之時何足累之哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When a husband at the time achieves wealth and honor, all evils are eliminated, brilliance and glory flourish—what burden is poverty and lowliness!",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Master Chu says: A husband undergoes dragon transformation. The tradition says: \"When a snake transforms into a dragon, it does not change its patterns; When a family transforms into a state, it does not change its surname.\" When a husband at the time achieves wealth and honor, all evils are eliminated, brilliance and glory flourish—what burden is poverty and lowliness!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0239",
          "zh": "武帝時，幸夫人尹婕妤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "During Emperor Wu's time, Lady Yin the Pure Consort was favored.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "邢夫人號娙娥，眾人謂之「娙何」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Xing was styled Jiao'e, people called her \"Jiao He.\"",
              "idiomatic": "Lady Xing was styled Jiao'e, people called her 'Jiao He.'"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "娙何秩比中二千石，容華秩比二千石，婕妤秩比列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Jiao He ranked equivalent to middle two thousand piculs, Ronghua ranked equivalent to two thousand piculs, Pure Consort ranked equivalent to marquises.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "常從婕妤遷為皇后。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "It was customary to promote from Pure Consort to empress.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "During Emperor Wu's time, Lady Yin the Pure Consort was favored. Lady Xing was styled Jiao'e, people called her \"Jiao He.\" Jiao He ranked equivalent to middle two thousand piculs, Ronghua ranked equivalent to two thousand piculs, Pure Consort ranked equivalent to marquises. It was customary to promote from Pure Consort to empress.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "尹夫人與邢夫人同時并幸，有詔不得相見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Yin and Lady Xing were favored at the same time, with an edict that they should not meet each other.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "尹夫人自請武帝，願望見邢夫人，帝許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Yin personally requested Emperor Wu, wishing to see Lady Xing, and the emperor permitted it.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "即令他夫人飾，從御者數十人，為邢夫人來前。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "He immediately ordered another lady to be adorned, with several dozen carriage attendants, to come forward as Lady Xing.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "尹夫人前見之，曰：「此非邢夫人身也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Yin came forward and saw her, saying: \"This is not Lady Xing's body.\"",
              "idiomatic": "Lady Yin came forward and saw her, saying: 'This is not Lady Xing's body.'"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "帝曰：「何以言之？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor said: \"How do you know?\"",
              "idiomatic": "The emperor said: 'How do you know?'"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "對曰：「視其身貌形狀，不足以當人主矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She replied: \"Looking at her body, appearance, and form, they are insufficient to match the ruler.\"",
              "idiomatic": "She replied: 'Looking at her body, appearance, and form, they are insufficient to match the ruler.'"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "於是帝乃詔使邢夫人衣故衣，獨身來前。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore the emperor issued an edict ordering Lady Xing to wear her old clothes and come forward alone.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "尹夫人望見之，曰：「此真是也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Yin gazed upon her and said: \"This is truly she.\"",
              "idiomatic": "Lady Yin gazed upon her and said: 'This is truly she.'"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "於是乃低頭俛而泣，自痛其不如也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore she lowered her head and wept, pained that she herself was inferior.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "諺曰：「美女入室，惡女之仇。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The proverb says: \"When a beautiful woman enters the household, she becomes the enemy of ugly women.\"",
              "idiomatic": "The proverb says: 'When a beautiful woman enters the household, she becomes the enemy of ugly women.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lady Yin and Lady Xing were favored at the same time, with an edict that they should not meet each other. Lady Yin personally requested Emperor Wu, wishing to see Lady Xing, and the emperor permitted it. He immediately ordered another lady to be adorned, with several dozen carriage attendants, to come forward as Lady Xing. Lady Yin came forward and saw her, saying: \"This is not Lady Xing's body.\" The emperor said: \"How do you know?\" She replied: \"Looking at her body, appearance, and form, they are insufficient to match the ruler.\" Therefore the emperor issued an edict ordering Lady Xing to wear her old clothes and come forward alone. Lady Yin gazed upon her and said: \"This is truly she.\" Therefore she lowered her head and wept, pained that she herself was inferior. The proverb says: \"When a beautiful woman enters the household, she becomes the enemy of ugly women.\"",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0254",
          "zh": "褚先生曰：浴不必江海，要之去垢；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Master Chu says: Bathing need not be in the Jiang or Hai rivers, the important thing is to remove filth;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "馬不必騏驥，要之善走；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Horses need not be Qiji steeds, the important thing is that they run well;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "士不必賢世，要之知道；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Scholars need not be worthy of the age, what matters is knowing the Way;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "女不必貴種，要之貞好。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Women need not be of noble birth, what matters is being chaste and good.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "傳曰：「女無美惡，入室見妒；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The tradition says: \"Women, regardless of beauty or ugliness, when they enter the household are envied;",
              "idiomatic": "The tradition says: 'Women, regardless of beauty or ugliness, when they enter the household are envied;"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "士無賢不肖，入朝見嫉。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Scholars, regardless of worthiness or unworthiness, when they enter court are resented.\"",
              "idiomatic": "Scholars, regardless of worthiness or unworthiness, when they enter court are resented.'"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "美女者，惡女之仇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Beautiful women are the enemies of ugly women.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "豈不然哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Is this not so?",
              "idiomatic": "Is this not so!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Master Chu says: Bathing need not be in the Jiang or Hai rivers, the important thing is to remove filth; Horses need not be Qiji steeds, the important thing is that they run well; Scholars need not be worthy of their age, the important thing is that they know the Way; Women need not be of noble birth, the important thing is that they are chaste and good. The tradition says: \"Women, regardless of beauty or ugliness, when they enter the household are envied; Scholars, regardless of worthiness or unworthiness, when they enter court are resented.\" Beautiful women are the enemies of ugly women. Is this not so?",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0262",
          "zh": "鉤弋夫人姓趙氏，河閒人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lady Gouyi was surnamed Zhao, from Hejian.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "得幸武帝，生子一人，昭帝是也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "She received Emperor Wu's favor and bore one son, who was Emperor Zhao.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "武帝年七十，乃生昭帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu was seventy years old when he fathered Emperor Zhao.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "昭帝立時，年五歲耳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "When Emperor Zhao ascended, he was only five years old.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lady Gouyi was surnamed Zhao, from Hejian. She received Emperor Wu's favor and bore one son, who was Emperor Zhao. Emperor Wu was seventy years old when he fathered Emperor Zhao. When Emperor Zhao ascended, he was only five years old.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0266",
          "zh": "衛太子廢後，未復立太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "After the Wei crown prince was deposed, no crown prince was re-established.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "而燕王旦上書，願歸國入宿衛。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "King Yan Dan submitted a memorial, wishing to return to his state and enter the palace guard.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "武帝怒，立斬其使者於北闕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Emperor Wu was angry and immediately executed his envoy at the Northern Gate.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "After the Wei crown prince was deposed, no crown prince was re-established. King Yan Dan submitted a memorial, wishing to return to his state and enter the palace guard. Emperor Wu was angry and immediately executed his envoy at the Northern Gate.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0269",
          "zh": "上居甘泉宮，召畫工圖畫周公負成王也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor resided in Ganquan Palace and summoned painters to depict the Duke of Zhou carrying King Cheng.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "於是左右群臣知武帝意欲立少子也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore the ministers on his left and right knew Emperor Wu intended to establish his younger son.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "後數日，帝譴責鉤弋夫人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Several days later, the emperor reproached Lady Gouyi.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "夫人脫簪珥叩頭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The lady removed her hairpins and earrings and knocked her head.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "帝曰：「引持去，送掖庭獄！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor said: \"Lead her away and send her to the Rear Court Prison!\"",
              "idiomatic": "The emperor said: 'Lead her away and send her to the Rear Court Prison!'"
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "夫人還顧，帝曰：「趣行，女不得活！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The lady looked back, and the emperor said: \"Hurry and go, you will not live!\"",
              "idiomatic": "The lady looked back, and the emperor said: 'Hurry and go, you will not live!'"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "夫人死雲陽宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The lady died in Yunyang Palace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "時暴風揚塵，百姓感傷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "At the time violent winds raised dust, and the people were sorrowful.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "使者夜持棺往葬之，封識其處。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Envoys carried the coffin at night to bury her, sealing and marking the place.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "其後帝閒居，問左右曰：「人言云何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Afterward, when the emperor was at leisure, he asked those on his left and right: \"What do people say?\"",
              "idiomatic": "Afterward, when the emperor was at leisure, he asked those on his left and right: 'What do people say?'"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "左右對曰：「人言且立其子，何去其母乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Those on his left and right replied: \"People say he will establish his son, so why did he kill his mother?\"",
              "idiomatic": "Those on his left and right replied: 'People say he will establish his son, so why did he kill his mother?'"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "帝曰：「然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "The emperor said: \"Yes.",
              "idiomatic": "The emperor said: 'Yes."
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "是非兒曹愚人所知也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "These are matters that you children and foolish people do not understand.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "往古國家所以亂也，由主少母壯也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "In ancient times states became disordered because the ruler was young and the mother was strong.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "女主獨居驕蹇，淫亂自恣，莫能禁也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Female rulers living alone become arrogant and stubborn, indulging in licentious disorder, with none able to restrain them.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "女不聞呂后邪？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Have you not heard of Empress Lü?\"",
              "idiomatic": "Have you not heard of Empress Lü?'"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "故諸為武帝生子者，無男女，其母無不譴死，豈可謂非賢聖哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore, all who bore sons for Emperor Wu, regardless of male or female children, their mothers without exception were reproached to death—can this be said not to be worthy and sage-like!",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "昭然遠見，為後世計慮，固非淺聞愚儒之所及也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Clearly seeing far ahead, planning for future generations, this is indeed beyond what shallow scholars and foolish Confucians can attain.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "謚為「武」，豈虛哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His posthumous title was \"Wu\"—how could it be in vain!",
              "idiomatic": "His posthumous title was 'Wu'—how could it be in vain!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The emperor resided in Ganquan Palace and summoned painters to depict the Duke of Zhou carrying King Cheng. Therefore the ministers on his left and right knew Emperor Wu intended to establish his younger son. Several days later, the emperor reproached Lady Gouyi. The lady removed her hairpins and earrings and knocked her head. The emperor said: \"Lead her away and send her to the Rear Court Prison!\" The lady looked back, and the emperor said: \"Hurry and go, you will not live!\" The lady died in Yunyang Palace. At the time violent winds raised dust, and the people were sorrowful. Envoys carried the coffin at night to bury her, sealing and marking the place. Afterward, when the emperor was at leisure, he asked those on his left and right: \"What do people say?\" Those on his left and right replied: \"People say he will establish his son, so why did he kill his mother?\" The emperor said: \"Yes. These are matters that you children and foolish people do not understand. In ancient times states became disordered because the ruler was young and the mother was strong. Female rulers living alone become arrogant and stubborn, indulging in licentious disorder, with none able to restrain them. Have you not heard of Empress Lü?\" Therefore, all who bore sons for Emperor Wu, regardless of male or female children, their mothers without exception were reproached to death—can this be said not to be worthy and sage-like! Clearly seeing far ahead, planning for future generations, this is indeed beyond what shallow scholars and foolish Confucians can attain. His posthumous title was \"Wu\"—how could it be in vain!",
          "idiomatic": null
        }
      ]
    }
  ]
}