{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "060",
    "url": "https://chinesenotes.com/shiji/shiji060.html",
    "title": {
      "zh": "三王世家",
      "en": "House of the Three Kings",
      "raw": "《三王世家》 House of the Three Kings"
    },
    "sentenceCount": 244,
    "translatedCount": 244,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:42.947Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "「大司馬臣去病昧死再拜上疏皇帝陛下：陛下過聽，使臣去病待罪行閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Grand Marshal subject Qubing, risking death, bows twice and submits memorial to Emperor Your Majesty: Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "宜專邊塞之思慮，暴骸中野無以報，乃敢惟他議以干用事者，誠見陛下憂勞天下，哀憐百姓以自忘，虧膳貶樂，損郎員。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "皇子賴天，能勝衣趨拜，至今無號位師傅官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "陛下恭讓不恤，群臣私望，不敢越職而言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "臣竊不勝犬馬心，昧死願陛下詔有司，因盛夏吉時定皇子位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "唯陛下幸察。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Only may Your Majesty be so gracious as to examine this."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "臣去病昧死再拜以聞皇帝陛下。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subject Qubing risks death, bows twice, to inform Emperor Your Majesty.'"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "三月乙亥，御史臣光守尚書令奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Third month, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat memorialized at Weiyang Palace."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "制曰：「下御史。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Send to the Censor.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "'Grand Marshal subject Qubing, risking death, bows twice and submits memorial to Emperor Your Majesty: Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored. I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants. The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials. Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties. Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions. Only may Your Majesty be so gracious as to examine this. Subject Qubing risks death, bows twice, to inform Emperor Your Majesty.' Third month, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat memorialized at Weiyang Palace. Imperial command: 'Send to the Censor.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0011",
          "zh": "六年三月戊申朔，乙亥，御史臣光守尚書令、丞非，下御史書到，言：丞相臣青翟、御史大夫臣湯、太常臣充、大行令臣息、太子少傅臣安行宗正事昧死上言：大司馬去病上疏曰：『陛下過聽，使臣去病待罪行閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Year 6, third month, day wu-shen first day, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat and Aide Fei, sent the censor memorial, saying: Chancellor subject Qing Que, Censor-in-Chief subject Tang, Grand Master of Ceremonies subject Chong, Grand Herald subject Xi, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan, risking death submit: Grand Marshal Qubing submitted memorial saying: 'Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "宜專邊塞之思慮，暴骸中野無以報，乃敢惟他議以干用事者，誠見陛下憂勞天下，哀憐百姓以自忘，虧膳貶樂，損郎員。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "皇子賴天，能勝衣趨拜，至今無號位師傅官。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "陛下恭讓不恤，群臣私望，不敢越職而言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "臣竊不勝犬馬心，昧死願陛下詔有司，因盛夏吉時定皇子位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "唯願陛下幸察。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Only may Your Majesty be so gracious as to examine this.'"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "制曰『下御史』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Send to the Censor.'"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "臣謹與中二千石、二千石臣賀等議：古者裂地立國，并建諸侯以承天于，所以尊宗廟重社稷也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects respectfully with the central two thousand shi and two thousand shi subject He and others discuss: In ancient times, territory was divided to establish states, establishing feudal lords together to receive heaven's mandate, thus to honor the ancestral temple and weight the altars of soil and grain."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "今臣去病上疏，不忘其職，因以宣恩，乃道天子卑讓自貶以勞天下，慮皇子未有號位。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now subject Qubing submits memorial, does not forget his duty, thus proclaims benevolence, moreover states the Son of Heaven's humble yielding and self-deprecation to labor for the world, concerned the imperial sons have no titles."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "臣青翟、臣湯等宜奉義遵職，愚憧而不逮事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects Qing Que, Tang and others should uphold righteousness and follow duty, foolishly dull and not up to affairs."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "方今盛夏吉時，臣青翟、臣湯等昧死請立皇子臣閎、臣旦、臣胥為諸侯王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now is the auspicious summer season, subjects Qing Que, Tang and others risking death request to establish imperial sons subject Hong, subject Dan, subject Xu as feudal kings."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "昧死請所立國名。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Risking death request the names of the states to establish.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Year 6, third month, day wu-shen first day, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat and Aide Fei, sent the censor memorial, saying: Chancellor subject Qing Que, Censor-in-Chief subject Tang, Grand Master of Ceremonies subject Chong, Grand Herald subject Xi, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan, risking death submit: Grand Marshal Qubing submitted memorial saying: 'Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored. I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants. The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials. Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties. Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions. Only may Your Majesty be so gracious as to examine this.' Imperial command: 'Send to the Censor.' Subjects respectfully with the central two thousand shi and two thousand shi subject He and others discuss: In ancient times, territory was divided to establish states, establishing feudal lords together to receive heaven's mandate, thus to honor the ancestral temple and weight the altars of soil and grain. Now subject Qubing submits memorial, does not forget his duty, thus proclaims benevolence, moreover states the Son of Heaven's humble yielding and self-deprecation to labor for the world, concerned the imperial sons have no titles. Subjects Qing Que, Tang and others should uphold righteousness and follow duty, foolishly dull and not up to affairs. Now is the auspicious summer season, subjects Qing Que, Tang and others risking death request to establish imperial sons subject Hong, subject Dan, subject Xu as feudal kings. Risking death request the names of the states to establish.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "制曰：「蓋聞周封八百，姬姓并列，或子、男、附庸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'I have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, some were viscounts, barons, or dependencies."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "禮『支子不祭』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The rites say 'branch sons do not sacrifice'."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "云并建諸侯所以重社稷，朕無聞焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Saying establishing feudal lords together is to weight the altars of soil and grain, I have not heard this."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "且天非為君生民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover heaven does not give birth to the people for the ruler's sake."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "朕之不德，海內未洽，乃以未教成者彊君連城，即股肱何勸？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My lack of virtue, the realm within the seas is not yet harmonious, yet to force those not yet educated to rule connected cities, then what encouragement for the limbs and bones?"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "其更議以列侯家之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Have them discuss again to establish them as marquises.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Imperial command: 'I have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, some were viscounts, barons, or dependencies. The rites say 'branch sons do not sacrifice'. Saying establishing feudal lords together is to weight the altars of soil and grain, I have not heard this. Moreover heaven does not give birth to the people for the ruler's sake. My lack of virtue, the realm within the seas is not yet harmonious, yet to force those not yet educated to rule connected cities, then what encouragement for the limbs and bones? Have them discuss again to establish them as marquises.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "三月丙子，奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Third month, day bing-zi, memorialized at Weiyang Palace."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "「丞相臣青翟、御史大夫臣湯昧死言：臣謹與列侯臣嬰齊、中二千石二千石臣賀、諫大夫博士臣安等議曰：伏聞周封八百，姬姓并列，奉承天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects respectfully with Marquis subject Ying Qi, central two thousand shi and two thousand shi subject He, Remonstrance Official and Erudite subject An and others discuss: We have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, supporting the Son of Heaven."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "康叔以祖考顯，而伯禽以周公立，咸為建國諸侯，以相傅為輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Kang Shu attained prominence through his ancestors, while Bo Qin was established by the Duke of Zhou, both became feudal lords of states, to mutually assist as help."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "百官奉憲，各遵其職，而國統備矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The hundred officials uphold the constitution, each follows their duty, and the state system is complete."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "竊以為并建諸侯所以重社稷者，四海諸侯各以其職奉貢祭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "We secretly consider that establishing feudal lords together to weight the altars of soil and grain means the feudal lords of the four seas each offer tribute and sacrifices according to their duties."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "支子不得奉祭宗祖，禮也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Branch sons may not offer sacrifices to the ancestral temple, this is ritual."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "封建使守藩國，帝王所以扶德施化。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Feudalism causes them to guard the border states, this is how emperors support virtue and spread civilization."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "陛下奉承天統，明開聖緒，尊賢顯功，興滅繼絕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty upholds heaven's mandate, clearly opens the holy succession, honors the worthy and displays merit, revives the extinguished and continues the broken."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "續蕭文終之後於酂，褒厲群臣平津侯等。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Continues the line of Xiao Wen Zhong at Ju, rewards and encourages ministers like Pingjin Marquis and others."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "昭六親之序，明天施之屬，使諸侯王封君得推私恩分子弟戶邑，錫號尊建百有餘國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Illuminates the order of the six relatives, makes clear the relationships of heaven's grace, causes feudal kings and enfeoffed lords to extend private benevolence to divide household and townships to younger brothers and sons, bestow titles and honorably establish over one hundred countries."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "而家皇子為列侯，則尊卑相踰，列位失序，不可以垂統於萬世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet to make the imperial sons marquises, then noble and base are confused, positions lose order, cannot be passed down to ten thousand generations."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "臣請立臣閎、臣旦、臣胥為諸侯王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects request to establish subjects Hong, Dan, Xu as feudal kings.'"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "三月丙子，奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Third month, day bing-zi, memorialized at Weiyang Palace."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Third month, day bing-zi, memorialized at Weiyang Palace. 'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects respectfully with Marquis subject Ying Qi, central two thousand shi and two thousand shi subject He, Remonstrance Official and Erudite subject An and others discuss: We have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, supporting the Son of Heaven. Kang Shu attained prominence through his ancestors, while Bo Qin was established by the Duke of Zhou, both became feudal lords of states, to mutually assist as help. The hundred officials uphold the constitution, each follows their duty, and the state system is complete. We secretly consider that establishing feudal lords together to weight the altars of soil and grain means the feudal lords of the four seas each offer tribute and sacrifices according to their duties. Branch sons may not offer sacrifices to the ancestral temple, this is ritual. Feudalism causes them to guard the border states, this is how emperors support virtue and spread civilization. Your Majesty upholds heaven's mandate, clearly opens the holy succession, honors the worthy and displays merit, revives the extinguished and continues the broken. Continues the line of Xiao Wen Zhong at Ju, rewards and encourages ministers like Pingjin Marquis and others. Illuminates the order of the six relatives, makes clear the relationships of heaven's grace, causes feudal kings and enfeoffed lords to extend private benevolence to divide household and townships to younger brothers and sons, bestow titles and honorably establish over one hundred countries. Yet to make the imperial sons marquises, then noble and base are confused, positions lose order, cannot be passed down to ten thousand generations. Subjects request to establish subjects Hong, Dan, Xu as feudal kings.' Third month, day bing-zi, memorialized at Weiyang Palace.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "制曰：「康叔親屬有十而獨尊者，褒有德也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "周公祭天命郊，故魯有白牡、騂剛之牲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "群公不毛，賢不肖差也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The various dukes had no hair, distinguishing worthy and unworthy."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "『高山仰之，景行向之』，朕甚慕焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'High mountains are looked up to, brilliant conduct is followed', I greatly admire this."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "所以抑未成，家以列侯可。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore I suppress the immature, establishing them as marquises is acceptable.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue. The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals. The various dukes had no hair, distinguishing worthy and unworthy. 'High mountains are looked up to, brilliant conduct is followed', I greatly admire this. Therefore I suppress the immature, establishing them as marquises is acceptable.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0050",
          "zh": "四月戊寅，奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fourth month, day wu-yin, memorialized at Weiyang Palace."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "「丞相臣青翟、御史大夫臣湯昧死言：臣青翟等與列侯、吏二千石、諫大夫、博士臣慶等議：昧死奏請立皇子為諸侯王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects Qing Que and others with marquises, officials of two thousand shi, remonstrance officials, erudites subject Qing and others discuss: Risking death memorialize requesting to establish imperial sons as feudal kings."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "制曰：『康叔親屬有十而獨尊者，褒有德也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "周公祭天命郊，故魯有白牡、騂剛之牲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "群公不毛，賢不肖差也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The various dukes had no hair, distinguishing worthy and unworthy."
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "「高山仰之，景行向之」，朕甚慕焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'High mountains are looked up to, brilliant conduct is followed', I greatly admire this."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "所以抑未成，家以列侯可。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore I suppress the immature, establishing them as marquises is acceptable.'"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "臣青翟、臣湯、博士臣將行等伏聞康叔親屬有十，武王繼體，周公輔成王，其八人皆以祖考之尊建為大國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects Qing Que, Tang, Erudite subject Jiang Xing and others have heard that Kang Shu had ten relatives, King Wu succeeded to the throne, Duke of Zhou assisted King Cheng, eight of them were established as great states by the honor of their ancestors."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "康叔之年幼，周公在三公之位，而伯禽據國於魯，蓋爵命之時，未至成人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Kang Shu was young in years, Duke of Zhou held the position of one of the three dukes, yet Bo Qin held the state at Lu, probably at the time of receiving the title, they had not yet reached adulthood."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "康叔後捍祿父之難，伯禽殄淮夷之亂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Later Kang Shu defended against the disaster of Lu Fu, Bo Qin extinguished the rebellion of the Huai Yi."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "昔五帝異制，周爵五等，春秋三等，皆因時而序尊卑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In ancient times the Five Emperors had different systems, Zhou had five ranks, Spring and Autumn had three ranks, all ordered noble and base according to the times."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "高皇帝撥亂世反諸正，昭至德，定海內，封建諸侯，爵位二等。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao Emperor brought order to the chaotic world and returned to correctness, displayed supreme virtue, pacified within the seas, enfeoffed feudal lords, with two ranks of nobility."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "皇子或在繦緥而立為諸侯王，奉承天子，為萬世法則，不可易。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial sons sometimes were established as feudal kings while still in swaddling clothes, supporting the Son of Heaven, as a model for ten thousand generations, cannot be changed."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "陛下躬親仁義，體行聖德，表裏文武。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty personally practices benevolence and righteousness, embodies and practices holy virtue, both inside and outside civil and martial."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "顯慈孝之行，廣賢能之路。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Displays the conduct of filial piety, broadens the path for the worthy and able."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "內褒有德，外討彊暴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Within praising virtue, without attacking the strong and violent."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "極臨北海，西（湊）［溱］月氏，匈奴、西域，舉國奉師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Reached the Northern Sea, west to the Yuezhi, Xiongnu and Western Regions, the entire state supports the army."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "輿械之費，不賦於民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The costs of chariots and weapons, not levied from the people."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "虛御府之藏以賞元戎，開禁倉以振貧窮，減戍卒之半。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Emptied the imperial storehouse to reward the chief warriors, opened forbidden granaries to relieve the poor, reduced garrison troops by half."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "百蠻之君，靡不鄉風，承流稱意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The rulers of the hundred barbarian tribes, none do not face the wind, following the current and fulfilling intentions."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "遠方殊俗，重譯而朝，澤及方外。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Distant regions with different customs come to court through multiple translations, benevolence extends beyond the borders."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "故珍獸至，嘉穀興，天應甚彰。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus precious beasts arrive, auspicious grains flourish, heaven's response is very clear."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "今諸侯支子封至諸侯王，而家皇子為列侯，臣青翟、臣湯等竊伏孰計之，皆以為尊卑失序，使天下失望，不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now feudal lords' branch sons are enfeoffed as feudal kings, yet to make imperial sons marquises, subjects Qing Que, Tang and others secretly and prostrate consider it, all think noble and base lose order, causing the world to lose hope, cannot."
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "臣請立臣閎、臣旦、臣胥為諸侯王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects request to establish subjects Hong, Dan, Xu as feudal kings.'"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "四月癸未，奏未央宮，留中不下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fourth month, day gui-wei, memorialized at Weiyang Palace, kept in the palace not sent down."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Fourth month, day wu-yin, memorialized at Weiyang Palace. 'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects Qing Que and others with marquises, officials of two thousand shi, remonstrance officials, erudites subject Qing and others discuss: Risking death memorialize requesting to establish imperial sons as feudal kings. Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue. The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals. The various dukes had no hair, distinguishing worthy and unworthy. 'High mountains are looked up to, brilliant conduct is followed', I greatly admire this. Therefore I suppress the immature, establishing them as marquises is acceptable.' Subjects Qing Que, Tang, Erudite subject Jiang Xing and others have heard that Kang Shu had ten relatives, King Wu succeeded to the throne, Duke of Zhou assisted King Cheng, eight of them were established as great states by the honor of their ancestors. Kang Shu was young in years, Duke of Zhou held the position of one of the three dukes, yet Bo Qin held the state at Lu, probably at the time of receiving the title, they had not yet reached adulthood. Later Kang Shu defended against the disaster of Lu Fu, Bo Qin extinguished the rebellion of the Huai Yi. In ancient times the Five Emperors had different systems, Zhou had five ranks, Spring and Autumn had three ranks, all ordered noble and base according to the times. Gao Emperor brought order to the chaotic world and returned to correctness, displayed supreme virtue, pacified within the seas, enfeoffed feudal lords, with two ranks of nobility. Imperial sons sometimes were established as feudal kings while still in swaddling clothes, supporting the Son of Heaven, as a model for ten thousand generations, cannot be changed. Your Majesty personally practices benevolence and righteousness, embodies and practices holy virtue, both inside and outside civil and martial. Displays the conduct of filial piety, broadens the path for the worthy and able. Within praising virtue, without attacking the strong and violent. Reached the Northern Sea, west to the Yuezhi, Xiongnu and Western Regions, the entire state supports the army. The costs of chariots and weapons, not levied from the people. Emptied the imperial storehouse to reward the chief warriors, opened forbidden granaries to relieve the poor, reduced garrison troops by half. The rulers of the hundred barbarian tribes, none do not face the wind, following the current and fulfilling intentions. Distant regions with different customs come to court through multiple translations, benevolence extends beyond the borders. Thus precious beasts arrive, auspicious grains flourish, heaven's response is very clear. Now feudal lords' branch sons are enfeoffed as feudal kings, yet to make imperial sons marquises, subjects Qing Que, Tang and others secretly and prostrate consider it, all think noble and base lose order, causing the world to lose hope, cannot. Subjects request to establish subjects Hong, Dan, Xu as feudal kings.' Fourth month, day gui-wei, memorialized at Weiyang Palace, kept in the palace not sent down.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "「丞相臣青翟、太仆臣賀、行御史大夫事太常臣充、太子少傅臣安行宗正事昧死言：臣青翟等前奏大司馬臣去病上疏言，皇子未有號位，臣謹與御史大夫臣湯、中二千石、二千石、諫大夫、博士臣慶等昧死請立皇子臣閎等為諸侯王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Chancellor subject Qing Que, Grand Coachman subject He, acting as Censor-in-Chief Grand Master of Ceremonies subject Chong, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan risking death speak: Subjects Qing Que and others previously memorialized Grand Marshal subject Qubing submitted memorial saying imperial sons have no titles, subjects respectfully with Censor-in-Chief subject Tang, central two thousand shi, two thousand shi, remonstrance officials, erudites subject Qing and others risking death request to establish imperial sons subject Hong and others as feudal kings."
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "陛下讓文武，躬自切，及皇子未教。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty yields civil and martial, personally frugal, including imperial sons not educated."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "群臣之議，儒者稱其術，或誖其心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The ministers' discussions, Confucian scholars praise their methods, some contradict their hearts."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "陛下固辭弗許，家皇子為列侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your Majesty firmly declined not permitting, established imperial sons as marquises."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "臣青翟等竊與列侯臣壽成等二十七人議，皆曰以為尊卑失序。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects Qing Que and others secretly with Marquis subject Shou Cheng and twenty-seven others discuss, all say noble and base lose order."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "高皇帝建天下，為漢太祖，王子孫，廣支輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao Emperor established the world, as Han Taizu, enfeoffed sons and grandsons, broadened branches as auxiliaries."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "先帝法則弗改，所以宣至尊也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Previous emperor's regulations not changed, thus to proclaim supreme honor."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "臣請令史官擇吉日，具禮儀上，御史奏輿地圖，他皆如前故事。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subjects request to command the historians to choose an auspicious day, prepare ceremonies and submit, Censor memorializes territory maps, all else as previous precedents.'"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "制曰：「可。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Acceptable.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "'Chancellor subject Qing Que, Grand Coachman subject He, acting as Censor-in-Chief Grand Master of Ceremonies subject Chong, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan risking death speak: Subjects Qing Que and others previously memorialized Grand Marshal subject Qubing submitted memorial saying imperial sons have no titles, subjects respectfully with Censor-in-Chief subject Tang, central two thousand shi, two thousand shi, remonstrance officials, erudites subject Qing and others risking death request to establish imperial sons subject Hong and others as feudal kings. Your Majesty yields civil and martial, personally frugal, including imperial sons not educated. The ministers' discussions, Confucian scholars praise their methods, some contradict their hearts. Your Majesty firmly declined not permitting, established imperial sons as marquises. Subjects Qing Que and others secretly with Marquis subject Shou Cheng and twenty-seven others discuss, all say noble and base lose order. Gao Emperor established the world, as Han Taizu, enfeoffed sons and grandsons, broadened branches as auxiliaries. Previous emperor's regulations not changed, thus to proclaim supreme honor. Subjects request to command the historians to choose an auspicious day, prepare ceremonies and submit, Censor memorializes territory maps, all else as previous precedents.' Imperial command: 'Acceptable.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "四月丙申，奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fourth month, day bing-shen, memorialized at Weiyang Palace."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "「太仆臣賀行御史大夫事昧死言：太常臣充言卜入四月二十八日乙巳，可立諸侯王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Grand Coachman subject He acting as Censor-in-Chief risking death speaks: Grand Master of Ceremonies subject Chong says the divination entered fourth month twenty-eighth day yi-si, acceptable to establish feudal kings."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "臣昧死奏輿地圖，請所立國名。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subject risking death memorializes territory maps, requests the names of states to establish."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "禮儀別奏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ceremonies to be memorialized separately."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "臣昧死請。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Subject risking death requests.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Fourth month, day bing-shen, memorialized at Weiyang Palace. 'Grand Coachman subject He acting as Censor-in-Chief risking death speaks: Grand Master of Ceremonies subject Chong says the divination entered fourth month twenty-eighth day yi-si, acceptable to establish feudal kings. Subject risking death memorializes territory maps, requests the names of states to establish. Ceremonies to be memorialized separately. Subject risking death requests.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0091",
          "zh": "制曰：「立皇子閎為齊王，旦為燕王，胥為廣陵王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Imperial command: 'Establish imperial son Hong as King of Qi, Dan as King of Yan, Xu as King of Guangling.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Imperial command: 'Establish imperial son Hong as King of Qi, Dan as King of Yan, Xu as King of Guangling.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0093",
          "zh": "四月丁酉，奏未央宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fourth month, day ding-you, memorialized at Weiyang Palace."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "六年四月戊寅朔，癸卯，御史大夫湯下丞相，丞相下中二千石，二千石下郡太守、諸侯相，丞書從事下當用者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Year 6, fourth month, day wu-yin first day, day gui-mao, Censor-in-Chief Tang sent to Chancellor, Chancellor sent to central two thousand shi, two thousand shi sent to commandery governors and feudal chancellors, chancellor documents sent to those who should use them."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "如律令。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As per regulations and commands."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Fourth month, day ding-you, memorialized at Weiyang Palace. Year 6, fourth month, day wu-yin first day, day gui-mao, Censor-in-Chief Tang sent to Chancellor, Chancellor sent to central two thousand shi, two thousand shi sent to commandery governors and feudal chancellors, chancellor documents sent to those who should use them. As per regulations and commands.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0096",
          "zh": "「維六年四月乙巳，皇帝使御史大夫湯廟立子閎為齊王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Hong as King of Qi in the ancestral temple."
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "曰：於戲，小子閎，受茲青社！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Saying: Ah, young son Hong, receive this blue altar!"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "朕承祖考，維稽古建爾國家，封于東土，世為漢藩輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the eastern lands, generation after generation as Han's border auxiliary."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "於戲念哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah, remember this!"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "抱朕之詔，惟命不于常。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Cherish my command, the mandate is not constant."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "人之好德，克明顯光。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People who love virtue can clearly shine brightly."
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "義之不圖，俾君子怠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Righteousness not planned for, causes the worthy to be indolent."
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "悉爾心，允執其中，天祿永終。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Use all your heart, faithfully hold to the center, heaven's favor will forever end."
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "厥有愆不臧，乃凶于而國，害于爾躬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If there are faults not good, then disaster to your state, harm to your person."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "於戲，保國艾民，可不敬與！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah, protect the state and cherish the people, can you not be respectful!"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "王其戒之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King, take heed of this.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Hong as King of Qi in the ancestral temple. Saying: Ah, young son Hong, receive this blue altar! I succeed the ancestors, examining antiquity establish your state, enfeoff in the eastern lands, generation after generation as Han's border auxiliary. Ah, remember this! Cherish my command, the mandate is not constant. People who love virtue can clearly shine brightly. Righteousness not planned for, causes the worthy to be indolent. Use all your heart, faithfully hold to the center, heaven's favor will forever end. If there are faults not good, then disaster to your state, harm to your person. Ah, protect the state and cherish the people, can you not be respectful! King, take heed of this.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "右齊王策。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Above is King of Qi's charter."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Above is King of Qi's charter.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "「維六年四月乙巳，皇帝使御史大夫湯廟立子旦為燕王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Dan as King of Yan in the ancestral temple."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "曰：於戲，小子旦，受茲玄社！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Saying: Ah, young son Dan, receive this black altar!"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "朕承祖考，維稽古，建爾國家，封于北土，世為漢藩輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the northern lands, generation after generation as Han's border auxiliary."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "於戲！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah!"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "葷粥氏虐老獸心，侵犯寇盜，加以姦巧邊萌。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Hun You clan cruel aged beast heart, invading as bandits and thieves, moreover treacherous at the border settlements."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "於戲！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah!"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "朕命將率徂征厥罪，萬夫長，千夫長，三十有二君皆來，降期奔師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered and fled the army."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "葷粥徙域，北州以綏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hun You moved their territory, northern provinces thus pacified."
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "悉爾心，毋作怨，毋卹德，毋乃廢備。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Use all your heart, do not create resentment, do not pity virtue, do not then neglect preparations."
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "非教士不得從徵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Non-educated men may not follow the expedition."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "於戲，保國艾民，可不敬與！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah, protect the state and cherish the people, can you not be respectful!"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "王其戒之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King, take heed of this.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Dan as King of Yan in the ancestral temple. Saying: Ah, young son Dan, receive this black altar! I succeed the ancestors, examining antiquity establish your state, enfeoff in the northern lands, generation after generation as Han's border auxiliary. Ah! The Hun You clan cruel aged beast heart, invading as bandits and thieves, moreover treacherous at the border settlements. Ah! I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered and fled the army. Hun You moved their territory, northern provinces thus pacified. Use all your heart, do not create resentment, do not pity virtue, do not then neglect preparations. Non-educated men may not follow the expedition. Ah, protect the state and cherish the people, can you not be respectful! King, take heed of this.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "右燕王策。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Above is King of Yan's charter."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Above is King of Yan's charter.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "「維六年四月乙巳，皇帝使御史大夫湯廟立子胥為廣陵王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Xu as King of Guangling in the ancestral temple."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "曰：於戲，小子胥，受茲赤社！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Saying: Ah, young son Xu, receive this red altar!"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "朕承祖考，維稽古建爾國家，封于南土，世為漢藩輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the southern lands, generation after generation as Han's border auxiliary."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "古人有言曰：『大江之南，五湖之閒，其人輕心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ancient people have said: 'South of the great river, between the five lakes, their people are light-hearted."
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "楊州保疆，三代要服，不及以政。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yang province guards the borders, three dynasties' important territory, not reached by administration.'"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "於戲！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah!"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "悉爾心，戰戰兢兢，乃惠乃順，毋侗好軼，毋邇宵人，維法維則。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Use all your heart, be cautious and fearful, be benevolent and compliant, do not be ignorant and fond of excess, do not approach villains, follow law and rules."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "《書》云：『臣不作威，不作福，靡有後羞。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Book says: 'Ministers do not create awe, do not create blessings, there will be no later shame.'"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "於戲，保國艾民，可不敬與！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ah, protect the state and cherish the people, can you not be respectful!"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "王其戒之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King, take heed of this.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Xu as King of Guangling in the ancestral temple. Saying: Ah, young son Xu, receive this red altar! I succeed the ancestors, examining antiquity establish your state, enfeoff in the southern lands, generation after generation as Han's border auxiliary. Ancient people have said: 'South of the great river, between the five lakes, their people are light-hearted. Yang province guards the borders, three dynasties' important territory, not reached by administration.' Ah! Use all your heart, be cautious and fearful, be benevolent and compliant, do not be ignorant and fond of excess, do not approach villains, follow law and rules. The Book says: 'Ministers do not create awe, do not create blessings, there will be no later shame.' Ah, protect the state and cherish the people, can you not be respectful! King, take heed of this.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0134",
          "zh": "右廣陵王策。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Above is King of Guangling's charter."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Above is King of Guangling's charter.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "太史公曰：古人有言曰「愛之欲其富，親之欲其貴」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Grand Historian says: Ancient people have said 'Love them wish them rich, be close wish them noble'."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "故王者壃土建國，封立子弟，所以褒親親，序骨肉，尊先祖，貴支體，廣同姓於天下也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore kings pile earth and establish states, enfeoff and establish sons and younger brothers, thus to praise close relatives, order flesh and blood, honor ancestors, value branches and limbs, spread same surname throughout the world."
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "是以形勢彊而王室安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore the situation is strong and the royal house secure."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "自古至今，所由來久矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From ancient times to now, what has come from this is long established."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "非有異也，故弗論箸也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "No difference, therefore not discussed and recorded."
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "燕齊之事，無足采者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yan and Qi matters have nothing worth collecting."
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "然封立三王，天子恭讓，群臣守義，文辭爛然，甚可觀也，是以附之世家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "However establishing the three kings, the Son of Heaven is respectfully modest, ministers uphold righteousness, the literary style is brilliant, very worthy of observation, therefore attached to the hereditary houses."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The Grand Historian says: Ancient people have said 'Love them wish them rich, be close wish them noble'. Therefore kings pile earth and establish states, enfeoff and establish sons and younger brothers, thus to praise close relatives, order flesh and blood, honor ancestors, value branches and limbs, spread same surname throughout the world. Therefore the situation is strong and the royal house secure. From ancient times to now, what has come from this is long established. No difference, therefore not discussed and recorded. Yan and Qi matters have nothing worth collecting. However establishing the three kings, the Son of Heaven is respectfully modest, ministers uphold righteousness, the literary style is brilliant, very worthy of observation, therefore attached to the hereditary houses.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0142",
          "zh": "褚先生曰：臣幸得以文學為侍郎，好覽觀太史公之列傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Chu says: Subject fortunately became a literary attendant, likes to view and observe the Grand Historian's biographies."
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "傳中稱三王世家文辭可觀，求其世家終不能得。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The biographies mention the Three Kings hereditary house literary style worthy of observation, sought its hereditary house ultimately could not obtain."
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "竊從長老好故事者取其封策書，編列其事而傳之，令後世得觀賢主之指意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Secretly from elders who love precedents took their enfeoffment charter writings, arranged and transmitted their matters, causing later generations to observe the wise ruler's intentions."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Master Chu says: Subject fortunately became a literary attendant, likes to view and observe the Grand Historian's biographies. The biographies mention the Three Kings hereditary house literary style worthy of observation, sought its hereditary house ultimately could not obtain. Secretly from elders who love precedents took their enfeoffment charter writings, arranged and transmitted their matters, causing later generations to observe the wise ruler's intentions.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0145",
          "zh": "蓋聞孝武帝之時，同日而俱拜三子為王：封一子於齊，一子於廣陵，一子於燕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I have heard that in Xiaowu Emperor's time, on the same day all three sons were appointed as kings: enfeoffed one son in Qi, one son in Guangling, one son in Yan."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "各因子才力智能，及土地之剛柔，人民之輕重，為作策以申戒之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Each according to the son's talent strength intelligence, and the land's hardness softness, people's lightness heaviness, made charters to earnestly warn them."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "謂王：「世為漢藩輔，保國治民，可不敬與！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Telling the kings: 'Generation after generation as Han's border auxiliaries, protect the state govern the people, can you not be respectful!"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "王其戒之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Kings, take heed of this.'"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "夫賢主所作，固非淺聞者所能知，非博聞彊記君子者所不能究竟其意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "What wise rulers make, certainly not what shallow learners can know, not what broad learning strong memory gentlemen cannot thoroughly understand the intent."
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "至其次序分絕，文字之上下，簡之參差長短，皆有意，人莫之能知。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Even the sequence divisions and breaks, the up and down of writing, the uneven lengths of slips, all have meaning, people cannot know it."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "謹論次其真草詔書，編于左方。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Respectfully arranged their true draft edicts, compiled on the left side."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "令覽者自通其意而解說之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Cause viewers to connect their meaning and explain it themselves."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "I have heard that in Xiaowu Emperor's time, on the same day all three sons were appointed as kings: enfeoffed one son in Qi, one son in Guangling, one son in Yan. Each according to the son's talent strength intelligence, and the land's hardness softness, people's lightness heaviness, made charters to earnestly warn them. Telling the kings: 'Generation after generation as Han's border auxiliaries, protect the state govern the people, can you not be respectful! Kings, take heed of this.' What wise rulers make, certainly not what shallow learners can know, not what broad learning strong memory gentlemen cannot thoroughly understand the intent. Even the sequence divisions and breaks, the up and down of writing, the uneven lengths of slips, all have meaning, people cannot know it. Respectfully arranged their true draft edicts, compiled on the left side. Cause viewers to connect their meaning and explain it themselves.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0153",
          "zh": "王夫人者，趙人也，與衛夫人并幸武帝，而生子閎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang was a woman of Zhao, together with Lady Wei both favored by Wudi, and bore son Hong."
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "閎且立為王時，其母病，武帝自臨問之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Hong was about to be established as king, his mother was ill, Wudi personally visited and asked her."
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "曰：「子當為王，欲安所置之？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Saying: 'Son should become king, where do you wish to place him?'"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "王夫人曰：「陛下在，妾又何等可言者。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang said: 'Your Majesty is alive, what else can subject wife say.'"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "帝曰：「雖然，意所欲，欲於何所王之？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The emperor said: 'Although this, what is your intention, in what place do you wish to make him king?'"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "王夫人曰：「願置之雒陽。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang said: 'Wish to place him in Luoyang.'"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "武帝曰：「雒陽有武庫敖倉，天下衝阸，漢國之大都也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wudi said: 'Luoyang has the armory and Ao granary, world's thoroughfare, Han's great capital."
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "先帝以來，無子王於雒陽者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From previous emperors, no son has been made king in Luoyang."
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "去雒陽，餘盡可。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Except Luoyang, the rest are all acceptable.'"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "王夫人不應。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang did not respond."
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "武帝曰：「關東之國無大於齊者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wudi said: 'Among the Guandong states none is greater than Qi."
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "齊東負海而城郭大，古時獨臨菑中十萬戶，天下膏腴地莫盛於齊者矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qi east faces the sea with great city walls, in ancient times Linzi alone had 100,000 households, the world's fertile lands none more prosperous than Qi.'"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "王夫人以手擊頭，謝曰：「幸甚。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang struck her head with her hand, thanked saying: 'Very fortunate.'"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "王夫人死而帝痛之，使使者拜之曰：「皇帝謹使使太中大夫明奉璧一，賜夫人為齊王太后。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Wang died and the emperor grieved for her, sent envoys to confer saying: 'The Emperor respectfully sends Grand Palace Attendant Ming to present one jade disk, granting Lady to be Queen Mother of King of Qi.'"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "子閎王齊，年少，無有子，立，不幸早死，國絕，為郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son Hong ruled Qi, young, had no sons, established, unfortunately died early, kingdom extinguished, became a commandery."
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "天下稱齊不宜王云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The world says Qi is not suitable for kings."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Lady Wang was a woman of Zhao, together with Lady Wei both favored by Wudi, and bore son Hong. When Hong was about to be established as king, his mother was ill, Wudi personally visited and asked her. Saying: 'Son should become king, where do you wish to place him?' Lady Wang said: 'Your Majesty is alive, what else can subject wife say.' The emperor said: 'Although this, what is your intention, in what place do you wish to make him king?' Lady Wang said: 'Wish to place him in Luoyang.' Wudi said: 'Luoyang has the armory and Ao granary, world's thoroughfare, Han's great capital. From previous emperors, no son has been made king in Luoyang. Except Luoyang, the rest are all acceptable.' Lady Wang did not respond. Wudi said: 'Among the Guandong states none is greater than Qi. Qi east faces the sea with great city walls, in ancient times Linzi alone had 100,000 households, the world's fertile lands none more prosperous than Qi.' Lady Wang struck her head with her hand, thanked saying: 'Very fortunate.' Lady Wang died and the emperor grieved for her, sent envoys to confer saying: 'The Emperor respectfully sends Grand Palace Attendant Ming to present one jade disk, granting Lady to be Queen Mother of King of Qi.' Son Hong ruled Qi, young, had no sons, established, unfortunately died early, kingdom extinguished, became a commandery. The world says Qi is not suitable for kings.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0169",
          "zh": "所謂「受此土」者，諸侯王始封者必受土於天子之社，歸立之以為國社，以歲時祠之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "What is called 'receive this earth' means feudal kings first enfeoffed must receive earth at the Son of Heaven's altar, return and establish it as the state altar, sacrifice to it seasonally."
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "春秋大傳曰：「天子之國有泰社。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Spring and Autumn Grand Tradition says: 'The Son of Heaven's state has the Great Altar."
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "東方青，南方赤，西方白，北方黑，上方黃。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "East blue, south red, west white, north black, above yellow.'"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "故將封於東方者取青土，封於南方者取赤土，封於西方者取白土，封於北方者取黑土，封於上方者取黃土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore those to be enfeoffed in the east take blue earth, enfeoffed in the south take red earth, enfeoffed in the west take white earth, enfeoffed in the north take black earth, enfeoffed above take yellow earth."
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "各取其色物，裹以白茅，封以為社。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Each takes their color objects, wrapped in white thatch, enfeoff as altar."
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "此始受封於天子者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This is those first receiving enfeoffment from the Son of Heaven."
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "此之為主土。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This is called ruling earth."
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "主土者，立社而奉之也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ruling earth means establishing altar and honoring it."
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "「朕承祖考」，祖者先也，考者父也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'I succeed ancestors and fathers', ancestors mean predecessors, fathers mean fathers."
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "「維稽古」，維者度也，念也，稽者當也，當順古之道也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Examining antiquity', examining means measuring, thinking, examining means matching, matching to follow ancient ways."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "What is called 'receive this earth' means feudal kings first enfeoffed must receive earth at the Son of Heaven's altar, return and establish it as the state altar, sacrifice to it seasonally. Spring and Autumn Grand Tradition says: 'The Son of Heaven's state has the Great Altar. East blue, south red, west white, north black, above yellow.' Therefore those to be enfeoffed in the east take blue earth, enfeoffed in the south take red earth, enfeoffed in the west take white earth, enfeoffed in the north take black earth, enfeoffed above take yellow earth. Each takes their color objects, wrapped in white thatch, enfeoff as altar. This is those first receiving enfeoffment from the Son of Heaven. This is called ruling earth. Ruling earth means establishing altar and honoring it. 'I succeed ancestors and fathers', ancestors mean predecessors, fathers mean fathers. 'Examining antiquity', examining means measuring, thinking, examining means matching, matching to follow ancient ways.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0179",
          "zh": "齊地多變詐，不習於禮義，故戒之曰「恭朕之詔，唯命不可為常。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qi land has much deceit and deception, not accustomed to rites and righteousness, therefore warned saying 'Cherish my edict, the mandate cannot be constant."
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "人之好德，能明顯光。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People who love virtue can clearly shine brightly."
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "不圖於義，使君子怠慢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Not planning for righteousness causes the worthy to be indolent."
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "悉若心，信執其中，天祿長終。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Use all your heart, faithfully hold to the center, heaven's favor will long end."
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "有過不善，乃凶于而國，而害于若身」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If there are faults not good, then disaster to your state, harm to your person.'"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "齊王之國，左右維持以禮義，不幸中年早夭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qi's rule, left and right maintained with rites and righteousness, unfortunately died young in middle age."
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "然全身無過，如其策意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "However kept body without faults, as the charter intended."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Qi land has much deceit and deception, not accustomed to rites and righteousness, therefore warned saying 'Cherish my edict, the mandate cannot be constant. People who love virtue can clearly shine brightly. Not planning for righteousness causes the worthy to be indolent. Use all your heart, faithfully hold to the center, heaven's favor will long end. If there are faults not good, then disaster to your state, harm to your person.' The King of Qi's rule, left and right maintained with rites and righteousness, unfortunately died young in middle age. However kept body without faults, as the charter intended.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0186",
          "zh": "傳曰「青采出於藍，而質青於藍」者，教使然也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The tradition says 'Blue comes from indigo but is bluer than indigo', teaching makes it so."
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "遠哉賢主，昭然獨見：誡齊王以慎內；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Far indeed the wise ruler, clearly seeing alone: warned King of Qi to be careful within;"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "誡燕王以無作怨，無修德；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "warned King of Yan not to create resentment, not to cultivate virtue;"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "誡廣陵王以慎外，無作威與福。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "warned King of Guangling to be careful without, not to create awe and blessings."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "The tradition says 'Blue comes from indigo but is bluer than indigo', teaching makes it so. Far indeed the wise ruler, clearly seeing alone: warned King of Qi to be careful within; warned King of Yan not to create resentment, not to cultivate virtue; warned King of Guangling to be careful without, not to create awe and blessings.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "夫廣陵在吳越之地，其民精而輕，故誡之曰「江湖之閒，其人輕心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Guangling is in Wu and Yue lands, their people are clever and light, therefore warned saying 'Between the rivers and lakes, their people are light-hearted."
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "楊州葆疆，三代之時，迫要使從中國俗服，不大及以政教，以意御之而已。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yang province guards borders, in Three Dynasties time, compelled to make follow Central States customs and clothing, not greatly reaching with governance and teaching, only control with intention."
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "無侗好佚，無邇宵人，維法是則。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Do not be ignorant fond of leisure, do not approach villains, follow law as rule."
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "無長好佚樂馳騁弋獵淫康，而近小人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Do not long love leisure pleasure racing hunting indulgence, and approach small men."
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "常念法度，則無羞辱矣」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Always think of law and standards, then there will be no shame and humiliation.'"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "三江、五湖有魚鹽之利，銅山之富，天下所仰。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The three rivers and five lakes have fish and salt profits, copper mountain wealth, what the world looks up to."
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "故誡之曰「臣不作福」者，勿使行財幣，厚賞賜，以立聲譽，為四方所歸也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore warned saying 'ministers do not create blessings' means do not let them circulate wealth and currency, give thick rewards, to establish reputation, become what four directions return to."
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "又曰「臣不作威」者，勿使因輕以倍義也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Also saying 'ministers do not create awe' means do not let them because of lightness double righteousness."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Now Guangling is in Wu and Yue lands, their people are clever and light, therefore warned saying 'Between the rivers and lakes, their people are light-hearted. Yang province guards borders, in Three Dynasties time, compelled to make follow Central States customs and clothing, not greatly reaching with governance and teaching, only control with intention. Do not be ignorant fond of leisure, do not approach villains, follow law as rule. Do not long love leisure pleasure racing hunting indulgence, and approach small men. Always think of law and standards, then there will be no shame and humiliation.' The three rivers and five lakes have fish and salt profits, copper mountain wealth, what the world looks up to. Therefore warned saying 'ministers do not create blessings' means do not let them circulate wealth and currency, give thick rewards, to establish reputation, become what four directions return to. Also saying 'ministers do not create awe' means do not let them because of lightness double righteousness.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0198",
          "zh": "會孝武帝崩，孝昭帝初立，先朝廣陵王胥，厚賞賜金錢財幣，直三千餘萬，益地百里，邑萬戶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Xiaowu Emperor passed away, Xiao Zhao Emperor first established, first summoned King Xu of Guangling, thickly rewarded gold money wealth currency, worth over 30 million, increased land 100 li, townships 10,000 households."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Xiaowu Emperor passed away, Xiao Zhao Emperor first established, first summoned King Xu of Guangling, thickly rewarded gold money wealth currency, worth over 30 million, increased land 100 li, townships 10,000 households.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0199",
          "zh": "會昭帝崩，宣帝初立，緣恩行義，以本始元年中，裂漢地，盡以封廣陵王胥四子：一子為朝陽侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Zhao Emperor passed away, Xuan Emperor first established, following benevolence practicing righteousness, in Benshi first year middle, split Han territory, all to enfeoff King Xu of Guangling's four sons: one son as Chaoyang Marquis;"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "一子為平曲侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "one son as Pingqu Marquis;"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "一子為南利侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "one son as Nanli Marquis;"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "最愛少子弘，立以為高密王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "most loved youngest son Hong, established as King of Gaomi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Zhao Emperor passed away, Xuan Emperor first established, following benevolence practicing righteousness, in Benshi first year middle, split Han territory, all to enfeoff King Xu of Guangling's four sons: one son as Chaoyang Marquis; one son as Pingqu Marquis; one son as Nanli Marquis; most loved youngest son Hong, established as King of Gaomi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0203",
          "zh": "其後胥果作威福，通楚王使者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Afterwards Xu indeed created awe and blessings, communicated with King of Chu's envoys."
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "楚王宣言曰：「我先元王，高帝少弟也，封三十二城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King of Chu openly declared: 'My ancestor King Yuan, Gao Emperor's younger brother, enfeoffed 32 cities."
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "今地邑益少，我欲與廣陵王共發兵云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now land and townships increasingly few, I wish to together with King Xu of Guangling raise troops.'"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "［立］廣陵王為上，我復王楚三十二城，如元王時。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Establish King Xu of Guangling as supreme, I again rule Chu 32 cities, like King Yuan time.'"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "事發覺，公卿有司請行罰誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Matter discovered, dukes and ministers officials requested to carry out punishment and execution."
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "天子以骨肉之故，不忍致法於胥，下詔書無治廣陵王，獨誅首惡楚王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son of Heaven because of flesh and blood, could not bear to apply law to Xu, issued edict not to punish King Xu of Guangling, alone execute chief evil King of Chu."
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "傳曰「蓬生麻中，不扶自直；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tradition says 'puff growing among hemp, without support straightens itself;"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "白沙在泥中，與之皆黑」者，土地教化使之然也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "white sand in mud, with it all black', land and civilization make it so."
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "其後胥復祝詛謀反，自殺，國除。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Afterwards Xu again cursed and plotted rebellion, committed suicide, kingdom abolished."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Afterwards Xu indeed created awe and blessings, communicated with King of Chu's envoys. King of Chu openly declared: 'My ancestor King Yuan, Gao Emperor's younger brother, enfeoffed 32 cities. Now land and townships increasingly few, I wish to together with King Xu of Guangling raise troops.' Establish King Xu of Guangling as supreme, I again rule Chu 32 cities, like King Yuan time.' Matter discovered, dukes and ministers officials requested to carry out punishment and execution. Son of Heaven because of flesh and blood, could not bear to apply law to Xu, issued edict not to punish King Xu of Guangling, alone execute chief evil King of Chu. Tradition says 'puff growing among hemp, without support straightens itself; white sand in mud, with it all black', land and civilization make it so. Afterwards Xu again cursed and plotted rebellion, committed suicide, kingdom abolished.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0212",
          "zh": "燕土墝埆，北迫匈奴，其人民勇而少慮，故誡之曰「葷粥氏無有孝行而禽獸心，以竊盜侵犯邊民。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yan land is uneven and barren, north presses Xiongnu, their people brave but little thought, therefore warned saying 'Xiongnu clan has no filial conduct but beast heart, with theft invades border people."
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "朕詔將軍往征其罪，萬夫長，千夫長，三十有二君皆來，降旗奔師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered banners fled army."
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "葷粥徙域遠處，北州以安矣」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xiongnu moved territory far away, northern provinces thus pacified.'"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "「悉若心，無作怨」者，勿使從俗以怨望也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Use all your heart, do not create resentment' means do not let them follow customs to resent and hope."
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "「無俷德」者，勿使（上）［王］背德也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Do not pity virtue' means do not let king turn back on virtue."
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "「無廢備」者，無乏武備，常備匈奴也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Do not neglect preparations' means do not lack martial preparations, constantly prepare for Xiongnu."
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "「非教士不得從徵」者，言非習禮義不得在於側也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "'Non-educated men may not follow expedition' means non-accustomed to rites and righteousness may not be at the side."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yan land is uneven and barren, north presses Xiongnu, their people brave but little thought, therefore warned saying 'Xiongnu clan has no filial conduct but beast heart, with theft invades border people. I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered banners fled army. Xiongnu moved territory far away, northern provinces thus pacified.' 'Use all your heart, do not create resentment' means do not let them follow customs to resent and hope. 'Do not pity virtue' means do not let king turn back on virtue. 'Do not neglect preparations' means do not lack martial preparations, constantly prepare for Xiongnu. 'Non-educated men may not follow expedition' means non-accustomed to rites and righteousness may not be at the side.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0219",
          "zh": "會武帝年老長，而太子不幸薨，未有所立，而旦使來上書，請身入宿衛於長安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Wudi grew old, and the crown prince unfortunately died, not yet established successor, yet Dan sent to submit memorial, requesting personally enter guard duty in Chang'an."
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "孝武見其書，擊地，怒曰：「生子當置之齊魯禮義之鄉，乃置之燕趙，果有爭心，不讓之端見矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Xiaowu seeing his memorial, struck ground, angry saying: 'Giving birth to son should place in Qi Lu rites and righteousness lands, yet placed in Yan Zhao, indeed has contending heart, unyielding beginning appears.'"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "於是使使即斬其使者於闕下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus sent envoys immediately behead his envoy at the palace gate."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Wudi grew old, and the crown prince unfortunately died, not yet established successor, yet Dan sent to submit memorial, requesting personally enter guard duty in Chang'an. Xiaowu seeing his memorial, struck ground, angry saying: 'Giving birth to son should place in Qi Lu rites and righteousness lands, yet placed in Yan Zhao, indeed has contending heart, unyielding beginning appears.' Thus sent envoys immediately behead his envoy at the palace gate.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0222",
          "zh": "會武帝崩，昭帝初立，旦果作怨而望大臣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Wudi passed away, Zhao Emperor first established, Dan indeed created resentment and hoped from ministers."
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "自以長子當立，與齊王子劉澤等謀為叛逆，出言曰：「我安得弟在者！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Considering himself eldest son should establish, with Qi king's son Liu Ze and others plotted rebellion, spoke saying: 'How can I have younger brother alive!"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "今立者乃大將軍子也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now established is the Grand General's son.'"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "欲發兵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wished to raise troops."
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "事發覺，當誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Matter discovered, should be executed."
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "昭帝緣恩寬忍，抑案不揚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Emperor following benevolence tolerant, suppressed case not publicized."
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "公卿使大臣請，遣宗正與太中大夫公戶滿意、御史二人，偕往使燕，風喻之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dukes and ministers had ministers request, sent Chamberlain for the Imperial Clan and Grand Palace Attendant Gong Hu Man Yi, two censors, together go as envoys to Yan, indirectly admonish him."
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "到燕，各異日，更見責王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Arrived in Yan, each different day, alternately saw and reproached the king."
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "宗正者，主宗室諸劉屬籍，先見王，為列陳道昭帝實武帝子狀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chamberlain for the Imperial Clan, manages imperial clan various Liu genealogy, first saw king, listed and explained Zhao Emperor truly Wudi's son situation."
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "侍御史乃復見王，責之以正法，問：「王欲發兵罪名明白，當坐之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Attendant Censor then again saw king, reproached with proper law, asked: 'King wishes to raise troops crime name clear, should condemn him."
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "漢家有正法，王犯纖介小罪過，即行法直斷耳，安能寬王。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han house has proper law, king commits tiny small offense, immediately carries out law straight judgment, how can pardon king.'"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "驚動以文法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shocked and moved with statutes and laws."
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "王意益下，心恐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King's intent increasingly lowered, heart feared."
            }
          ]
        },
        {
          "id": "s0235",
          "zh": "公戶滿意習於經術，最後見王，稱引古今通義，國家大禮，文章爾雅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gong Hu Man Yi versed in classics, last saw king, cited ancient and modern universal principles, state great rites, writings elegant and proper."
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "謂王曰：「古者天子必內有異姓大夫，所以正骨肉也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Told king: 'Anciently Son of Heaven must have different surname officials within, thus to correct flesh and blood;"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "外有同姓大夫，所以正異族也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "without have same surname officials, thus to correct different clans."
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "周公輔成王，誅其兩弟，故治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Duke of Zhou assisted King Cheng, executed his two younger brothers, thus orderly."
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "武帝在時，尚能寬王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wudi in his time, still could pardon king."
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "今昭帝始立，年幼，富於春秋，未臨政，委任大臣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Zhao Emperor first established, year young, rich in springtime, not yet administering government, entrusts ministers."
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "古者誅罰不阿親戚，故天下治。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Anciently executions and punishments did not favor relatives, thus world orderly."
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "方今大臣輔政，奉法直行，無敢所阿，恐不能寬王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now ministers assist government, follow law straight action, none dare favor, fear cannot pardon king."
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "王可自謹，無自令身死國滅，為天下笑。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King can be careful himself, not cause body die kingdom extinguish, become world's laughter.'"
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "於是燕王旦乃恐懼服罪，叩頭謝過。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus King Dan of Yan then feared and submitted to crime, kowtowed apologized for offense."
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "大臣欲和合骨肉，難傷之以法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ministers wished to harmonize flesh and blood, difficult to harm with law."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "When Wudi passed away, Zhao Emperor first established, Dan indeed created resentment and hoped from ministers. Considering himself eldest son should establish, with Qi king's son Liu Ze and others plotted rebellion, spoke saying: 'How can I have younger brother alive! Now established is the Grand General's son.' Wished to raise troops. Matter discovered, should be executed. Zhao Emperor following benevolence tolerant, suppressed case not publicized. Dukes and ministers had ministers request, sent Chamberlain for the Imperial Clan and Grand Palace Attendant Gong Hu Man Yi, two censors, together go as envoys to Yan, indirectly admonish him. Arrived in Yan, each different day, alternately saw and reproached the king. Chamberlain for the Imperial Clan, manages imperial clan various Liu genealogy, first saw king, listed and explained Zhao Emperor truly Wudi's son situation. Attendant Censor then again saw king, reproached with proper law, asked: 'King wishes to raise troops crime name clear, should condemn him. Han house has proper law, king commits tiny small offense, immediately carries out law straight judgment, how can pardon king.' Shocked and moved with statutes and laws. King's intent increasingly lowered, heart feared. Gong Hu Man Yi versed in classics, last saw king, cited ancient and modern universal principles, state great rites, writings elegant and proper. Told king: 'Anciently Son of Heaven must have different surname officials within, thus to correct flesh and blood; without have same surname officials, thus to correct different clans. Duke of Zhou assisted King Cheng, executed his two younger brothers, thus orderly. Wudi in his time, still could pardon king. Now Zhao Emperor first established, year young, rich in springtime, not yet administering government, entrusts ministers. Anciently executions and punishments did not favor relatives, thus world orderly. Now ministers assist government, follow law straight action, none dare favor, fear cannot pardon king. King can be careful himself, not cause body die kingdom extinguish, become world's laughter.' Thus King Dan of Yan then feared and submitted to crime, kowtowed apologized for offense. Ministers wished to harmonize flesh and blood, difficult to harm with law.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0246",
          "zh": "其後旦復與左將軍上官桀等謀反，宣言曰「我次太子，太子不在，我當立，大臣共抑我」云云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Afterwards Dan again with Left General Shangguan Jie and others plotted rebellion, declared 'I am next crown prince, crown prince not present, I should establish, ministers together suppress me' and so on."
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "大將軍光輔政，與公卿大臣議曰：「燕王旦不改過悔正，行惡不變。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Grand General Guang assisted government, with dukes and ministers discussed: 'King Dan of Yan does not change error repent righteousness, practices evil unchanging.'"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "於是修法直斷，行罰誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus followed law straight judgment, carried out punishment execution."
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "旦自殺，國除，如其策指。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dan committed suicide, kingdom abolished, as the charter indicated."
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "有司請誅旦妻子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Officials requested to execute Dan's wife and children."
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "孝昭以骨肉之親，不忍致法，寬赦旦妻子，免為庶人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiao Zhao because of flesh and blood closeness, could not bear to apply law, generously pardoned Dan's wife and children, demoted to commoners."
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "傳曰「蘭根與白芷，漸之滫中，君子不近，庶人不服」者，所以漸然也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tradition says 'orchid root and angelica, soaked in brine, worthy men do not approach, common men do not wear', this is why it is so."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Afterwards Dan again with Left General Shangguan Jie and others plotted rebellion, declared 'I am next crown prince, crown prince not present, I should establish, ministers together suppress me' and so on. Grand General Guang assisted government, with dukes and ministers discussed: 'King Dan of Yan does not change error repent righteousness, practices evil unchanging.' Thus followed law straight judgment, carried out punishment execution. Dan committed suicide, kingdom abolished, as the charter indicated. Officials requested to execute Dan's wife and children. Xiao Zhao because of flesh and blood closeness, could not bear to apply law, generously pardoned Dan's wife and children, demoted to commoners. Tradition says 'orchid root and angelica, soaked in brine, worthy men do not approach, common men do not wear', this is why it is so.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0253",
          "zh": "宣帝初立，推恩宣德，以本始元年中盡復封燕王旦兩子：一子為安定侯；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xuan Emperor first established, extended benevolence proclaimed virtue, in Benshi first year middle all restored enfeoffment of King Dan of Yan's two sons: one son as An Ding Marquis;"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "立燕故太子建為廣陽王，以奉燕王祭祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "established Yan's former crown prince Jian as King of Guangyang, to carry out Yan king's sacrifices."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Xuan Emperor first established, extended benevolence proclaimed virtue, in Benshi first year middle all restored enfeoffment of King Dan of Yan's two sons: one son as An Ding Marquis; established Yan's former crown prince Jian as King of Guangyang, to carry out Yan king's sacrifices.",
          "idiomatic": null
        }
      ]
    }
  ]
}