{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "062",
    "url": "https://chinesenotes.com/shiji/shiji062.html",
    "title": {
      "zh": "管晏列傳",
      "en": "Biographies of Guan and Yan",
      "raw": "《管晏列傳》 Biographies of Guan and Yan"
    },
    "sentenceCount": 71,
    "translatedCount": 71,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:58:44.623Z",
    "translators": [
      {
        "name": "Garrett M. Petersen (2025)",
        "paragraphs": 12,
        "sentences": 71
      }
    ],
    "citation": "Translation: Garrett M. Petersen (2025)"
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "管仲夷吾者，潁上人也。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong, whose courtesy name was Yi Wu, was a man of Ying Shang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "少時常與鮑叔牙游，鮑叔知其賢。",
          "translations": [
            {
              "lang": "en",
              "text": "In his youth he often traveled with Bao Shu Ya, Bao Shu knew his worth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "管仲貧困，常欺鮑叔，鮑叔終善遇之，不以為言。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong was impoverished, often deceived Bao Shu, Bao Shu in the end treated him well, did not take it amiss.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "已而鮑叔事齊公子小白，管仲事公子糾。",
          "translations": [
            {
              "lang": "en",
              "text": "Soon after Bao Shu served Qi prince Xiao Bai, Guan Zhong served prince Jiu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "及小白立為桓公，公子糾死，管仲囚焉。",
          "translations": [
            {
              "lang": "en",
              "text": "When Xiao Bai established as Duke Huan, prince Jiu died, Guan Zhong was imprisoned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "鮑叔遂進管仲。",
          "translations": [
            {
              "lang": "en",
              "text": "Bao Shu then recommended Guan Zhong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "管仲既用，任政於齊，齊桓公以霸，九合諸侯，一匡天下，管仲之謀也。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong having been employed, took charge of government in Qi, Duke Huan of Qi became hegemon, nine times assembled the feudal lords, once set the world in order, it was Guan Zhong's strategy.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Guan Zhong, whose courtesy name was Yi Wu, was a man of Ying Shang. In his youth he often traveled with Bao Shu Ya, Bao Shu knew his worth. Guan Zhong was impoverished, often deceived Bao Shu, Bao Shu in the end treated him well, did not take it amiss. Soon after Bao Shu served Qi prince Xiao Bai, Guan Zhong served prince Jiu. When Xiao Bai established as Duke Huan, prince Jiu died, Guan Zhong was imprisoned. Bao Shu then recommended Guan Zhong. Guan Zhong having been employed, took charge of government in Qi, Duke Huan of Qi became hegemon, nine times assembled the feudal lords, once set the world in order, it was Guan Zhong's strategy.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "管仲曰：「吾始困時，嘗與鮑叔賈，分財利多自與，鮑叔不以我為貪，知我貧也。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong said: 'When I first was in difficulty, I once traded with Bao Shu, divided profits took much for myself, Bao Shu did not consider me greedy, knew I was poor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "吾嘗為鮑叔謀事而更窮困，鮑叔不以我為愚，知時有利不利也。",
          "translations": [
            {
              "lang": "en",
              "text": "I once planned affairs for Bao Shu and became even more impoverished, Bao Shu did not consider me foolish, knew there are times of advantage and disadvantage.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "吾嘗三仕三見逐於君，鮑叔不以我為不肖，知我不遭時也。",
          "translations": [
            {
              "lang": "en",
              "text": "I once served three times and three times was dismissed by lords, Bao Shu did not consider me unworthy, knew I did not meet the times.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "吾嘗三戰三走，鮑叔不以我怯，知我有老母也。",
          "translations": [
            {
              "lang": "en",
              "text": "I once fought three times and fled three times, Bao Shu did not consider me cowardly, knew I had an aged mother.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "公子糾敗，召忽死之，吾幽囚受辱，鮑叔不以我為無恥，知我不羞小睗而恥功名不顯于天下也。",
          "translations": [
            {
              "lang": "en",
              "text": "Prince Jiu was defeated, Zhao Hu died for him, I was imprisoned and humiliated, Bao Shu did not consider me shameless, knew I was not ashamed of small humiliations but ashamed that merit and fame would not be displayed in the world.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "生我者父母，知我者鮑子也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Those who gave birth to me are my parents, the one who knows me is Bao Zi.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Guan Zhong said: 'When I first was in difficulty, I once traded with Bao Shu, divided profits took much for myself, Bao Shu did not consider me greedy, knew I was poor. I once planned affairs for Bao Shu and became even more impoverished, Bao Shu did not consider me foolish, knew there are times of advantage and disadvantage. I once served three times and three times was dismissed by lords, Bao Shu did not consider me unworthy, knew I did not meet the times. I once fought three times and fled three times, Bao Shu did not consider me cowardly, knew I had an aged mother. Prince Jiu was defeated, Zhao Hu died for him, I was imprisoned and humiliated, Bao Shu did not consider me shameless, knew I was not ashamed of small humiliations but ashamed that merit and fame would not be displayed in the world.' Those who gave birth to me are my parents, the one who knows me is Bao Zi.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0015",
          "zh": "鮑叔既進管仲，以身下之。",
          "translations": [
            {
              "lang": "en",
              "text": "Bao Shu having recommended Guan Zhong, humbled himself below him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "子孫世祿於齊，有封邑者十餘世，常為名大夫。",
          "translations": [
            {
              "lang": "en",
              "text": "His descendants received hereditary stipends in Qi, those with fiefs numbered over ten generations, always were famous grand officers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "天下不多管仲之賢而多鮑叔能知人也。",
          "translations": [
            {
              "lang": "en",
              "text": "The world does not praise Guan Zhong's worthiness so much as praises Bao Shu's ability to recognize people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Bao Shu having recommended Guan Zhong, humbled himself below him. His descendants received hereditary stipends in Qi, those with fiefs numbered over ten generations, always were famous grand officers. The world does not praise Guan Zhong's worthiness so much as praises Bao Shu's ability to recognize people.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "管仲既任政相齊，以區區之齊在海濱，通貨積財，富國彊兵，與俗同好惡。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong having taken charge of government as prime minister of Qi, with tiny Qi by the seacoast, circulated wealth accumulated riches, enriched the state strengthened the army, shared likes and dislikes with the customs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "故其稱曰：「倉廩實而知禮節，衣食足而知榮辱，上服度則六親固。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore his saying: 'Granaries full then know ritual and propriety, clothing and food sufficient then know honor and shame, superiors observe standards then the six relatives are secure.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "四維不張，國乃滅亡。",
          "translations": [
            {
              "lang": "en",
              "text": "The four cardinal principles not upheld, the state then perishes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "下令如流水之原，令順民心。」",
          "translations": [
            {
              "lang": "en",
              "text": "Issue orders like the source of flowing water, orders follow the people's hearts.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "故論卑而易行。",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore the principles are lowly and easy to implement.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "俗之所欲，因而予之；",
          "translations": [
            {
              "lang": "en",
              "text": "What the customs desire, therefore grant it;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "俗之所否，因而去之。",
          "translations": [
            {
              "lang": "en",
              "text": "what the customs reject, therefore remove it.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Guan Zhong having taken charge of government as prime minister of Qi, with tiny Qi by the seacoast, circulated wealth accumulated riches, enriched the state strengthened the army, shared likes and dislikes with the customs. Therefore his saying: 'Granaries full then know ritual and propriety, clothing and food sufficient then know honor and shame, superiors observe standards then the six relatives are secure. The four cardinal principles not upheld, the state then perishes. Issue orders like the source of flowing water, orders follow the people's hearts.' Therefore the principles are lowly and easy to implement. What the customs desire, therefore grant it; what the customs reject, therefore remove it.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0025",
          "zh": "其為政也，善因禍而為福，轉敗而為功。",
          "translations": [
            {
              "lang": "en",
              "text": "In his governance, he was good at turning calamity into fortune, converting defeat into success.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "貴輕重，慎權衡。",
          "translations": [
            {
              "lang": "en",
              "text": "Valued balancing light and heavy, was careful with weights and measures.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "桓公實怒少姬，南襲蔡，管仲因而伐楚，責包茅不入貢於周室。",
          "translations": [
            {
              "lang": "en",
              "text": "Duke Huan truly angry at Shao Ji, south attacked Cai, Guan Zhong therefore attacked Chu, blamed them for not contributing bundled thatch to the Zhou court.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "桓公實北征山戎，而管仲因而令燕修召公之政。",
          "translations": [
            {
              "lang": "en",
              "text": "Duke Huan truly north campaigned against the Shan Rong, yet Guan Zhong therefore commanded Yan to restore Duke Shao's governance.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "於柯之會，桓公欲背曹沫之約，管仲因而信之，諸侯由是歸齊。",
          "translations": [
            {
              "lang": "en",
              "text": "At the Kui meeting, Duke Huan wished to renege on Cao Mo's agreement, Guan Zhong therefore kept faith with it, the feudal lords therefore turned to Qi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "故曰：「知與之為取，政之寶也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Therefore said: 'Knowing that giving is taking, is the treasure of governance.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "In his governance, he was good at turning calamity into fortune, converting defeat into success. Valued balancing light and heavy, was careful with weights and measures. Duke Huan truly angry at Shao Ji, south attacked Cai, Guan Zhong therefore attacked Chu, blamed them for not contributing bundled thatch to the Zhou court. Duke Huan truly north campaigned against the Shan Rong, yet Guan Zhong therefore commanded Yan to restore Duke Shao's governance. At the Kui meeting, Duke Huan wished to renege on Cao Mo's agreement, Guan Zhong therefore kept faith with it, the feudal lords therefore turned to Qi. Therefore said: 'Knowing that giving is taking, is the treasure of governance.'",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0032",
          "zh": "管仲富擬於公室，有三歸、反坫，齊人不以為侈。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong's wealth equaled the ducal house, had three wives' quarters and return stands, the people of Qi did not consider it extravagant.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "管仲卒，齊國遵其政，常彊於諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong died, Qi state followed his governance, constantly strong among the feudal lords.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "後百餘年而有晏子焉。",
          "translations": [
            {
              "lang": "en",
              "text": "Over a hundred years later there was Yan Zi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Guan Zhong's wealth equaled the ducal house, had three wives' quarters and return stands, the people of Qi did not consider it extravagant. Guan Zhong died, Qi state followed his governance, constantly strong among the feudal lords. Over a hundred years later there was Yan Zi.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "晏平仲嬰者，萊之夷維人也。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Ping Zhong Ying was a man of Yi Wei in Lai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "事齊靈公、莊公、景公，以節儉力行重於齊。",
          "translations": [
            {
              "lang": "en",
              "text": "Served Duke Ling, Duke Zhuang, Duke Jing of Qi, with frugality and diligent conduct was honored in Qi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "既相齊，食不重肉，妾不衣帛。",
          "translations": [
            {
              "lang": "en",
              "text": "Having become prime minister of Qi, did not eat meat twice, concubines did not wear silk.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "其在朝，君語及之，即危言；",
          "translations": [
            {
              "lang": "en",
              "text": "When in court, if the lord's words touched on it, then spoke dangerously;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "語不及之，即危行。",
          "translations": [
            {
              "lang": "en",
              "text": "if words did not touch on it, then acted dangerously.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "國有道，即順命；",
          "translations": [
            {
              "lang": "en",
              "text": "If the state had the way, then obeyed commands;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "無道，即衡命。",
          "translations": [
            {
              "lang": "en",
              "text": "if without the way, then balanced commands.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "以此三世顯名於諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "With this made famous name among the feudal lords for three generations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yan Ping Zhong Ying was a man of Yi Wei in Lai. Served Duke Ling, Duke Zhuang, Duke Jing of Qi, with frugality and diligent conduct was honored in Qi. Having become prime minister of Qi, did not eat meat twice, concubines did not wear silk. When in court, if the lord's words touched on it, then spoke dangerously; if words did not touch on it, then acted dangerously. If the state had the way, then obeyed commands; if without the way, then balanced commands. With this made famous name among the feudal lords for three generations.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "越石父賢，在縲紲中。",
          "translations": [
            {
              "lang": "en",
              "text": "Yue Shi Fu was worthy, in fetters and handcuffs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "晏子出，遭之涂，解左驂贖之，載歸。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zi went out, encountered him on the road, unyoked the left trace horse to redeem him, carried him home.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "弗謝，入閨。",
          "translations": [
            {
              "lang": "en",
              "text": "Did not thank him, entered the inner chambers.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "久之，越石父請絕。",
          "translations": [
            {
              "lang": "en",
              "text": "After a long time, Yue Shi Fu requested to break off relations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "晏子懼然，攝衣冠謝曰：「嬰雖不仁，免子於緦何子求絕之速也？」",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zi fearfully adjusted his clothing and cap apologized saying: 'Ying though unbenevolent, saved you from hempen bonds, why do you seek to break off so quickly?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "石父曰：「不然。",
          "translations": [
            {
              "lang": "en",
              "text": "Shi Fu said: 'Not so.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "吾聞君子詘於不知己而信於知己者。",
          "translations": [
            {
              "lang": "en",
              "text": "I have heard that gentlemen bend to those who do not know them but extend faith to those who know them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "方吾在縲紲中，彼不知我也。",
          "translations": [
            {
              "lang": "en",
              "text": "When I was in fetters and handcuffs, they did not know me.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "夫子既已感寤而贖我，是知己；",
          "translations": [
            {
              "lang": "en",
              "text": "Master having already been moved and redeemed me, this is knowing me;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "知己而無禮，固不如在縲紲之中。」",
          "translations": [
            {
              "lang": "en",
              "text": "knowing me yet without ritual, certainly not as good as being in fetters and handcuffs.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "晏子於是延入為上客。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zi then invited him in as honored guest.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Yue Shi Fu was worthy, in fetters and handcuffs. Yan Zi went out, encountered him on the road, unyoked the left trace horse to redeem him, carried him home. Did not thank him, entered the inner chambers. After a long time, Yue Shi Fu requested to break off relations. Yan Zi fearfully adjusted his clothing and cap apologized saying: 'Ying though unbenevolent, saved you from hempen bonds, why do you seek to break off so quickly?' Shi Fu said: 'Not so. I have heard that gentlemen bend to those who do not know them but extend faith to those who know them. When I was in fetters and handcuffs, they did not know me. Master having already been moved and redeemed me, this is knowing me; knowing me yet without ritual, certainly not as good as being in fetters and handcuffs.' Yan Zi then invited him in as honored guest.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0054",
          "zh": "晏子為齊相，出，其御之妻從門閒而闚其夫。",
          "translations": [
            {
              "lang": "en",
              "text": "When Yan Zi was prime minister of Qi, going out, his charioteer's wife peeked at her husband from the gate.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "其夫為相御，擁大蓋，策駟馬，意氣揚揚甚自得也。",
          "translations": [
            {
              "lang": "en",
              "text": "Her husband drove the prime minister's chariot, held the large canopy, whipped the four horses, spirit and energy soaring very self-satisfied.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "既而歸，其妻請去。",
          "translations": [
            {
              "lang": "en",
              "text": "Having returned home, his wife requested to leave.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "夫問其故。",
          "translations": [
            {
              "lang": "en",
              "text": "The husband asked the reason.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "妻曰：「晏子長不滿六尺，身相齊國，名顯諸侯。",
          "translations": [
            {
              "lang": "en",
              "text": "The wife said: 'Yan Zi height not full six feet, personally prime minister of Qi state, name illustrious among feudal lords.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "今者妾觀其出，志念深矣，常有以自下者。",
          "translations": [
            {
              "lang": "en",
              "text": "Now when I observed his going out, his thoughts and reflections were deep, constantly had ways to humble himself.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "今子長八尺，乃為人仆御，然子之意自以為足，妾是以求去也。」",
          "translations": [
            {
              "lang": "en",
              "text": "Now you are eight feet tall, yet serve as another's charioteer, yet your intentions consider yourself sufficient, therefore I request to leave.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "其後夫自抑損。",
          "translations": [
            {
              "lang": "en",
              "text": "Afterwards the husband humbled himself.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "晏子怪而問之，御以實對。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zi was surprised and asked him, the charioteer told the truth.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "晏子薦以為大夫。",
          "translations": [
            {
              "lang": "en",
              "text": "Yan Zi recommended him as grand officer.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "When Yan Zi was prime minister of Qi, going out, his charioteer's wife peeked at her husband from the gate. Her husband drove the prime minister's chariot, held the large canopy, whipped the four horses, spirit and energy soaring very self-satisfied. Having returned home, his wife requested to leave. The husband asked the reason. The wife said: 'Yan Zi height not full six feet, personally prime minister of Qi state, name illustrious among feudal lords. Now when I observed his going out, his thoughts and reflections were deep, constantly had ways to humble himself. Now you are eight feet tall, yet serve as another's charioteer, yet your intentions consider yourself sufficient, therefore I request to leave.' Afterwards the husband humbled himself. Yan Zi was surprised and asked him, the charioteer told the truth. Yan Zi recommended him as grand officer.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0064",
          "zh": "太史公曰：吾讀管氏牧民、山高、乘馬、輕重、九府，及晏子春秋，詳哉其言之也。",
          "translations": [
            {
              "lang": "en",
              "text": "The Grand Historian says: I read the Guan clan's Shepherding the People, Mountain Height, Cavalry, Light and Heavy, Nine Treasuries, and Yan Zi's Spring and Autumn, detailed indeed are their words.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "既見其著書，欲觀其行事，故次其傳。",
          "translations": [
            {
              "lang": "en",
              "text": "Having seen their written books, wished to observe their conduct, therefore arranged their biographies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "至其書，世多有之，是以不論，論其軼事。",
          "translations": [
            {
              "lang": "en",
              "text": "As for their books, the world has many of them, therefore do not discuss, discuss their scattered affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "The Grand Historian says: I read the Guan clan's Shepherding the People, Mountain Height, Cavalry, Light and Heavy, Nine Treasuries, and Yan Zi's Spring and Autumn, detailed indeed are their words. Having seen their written books, wished to observe their conduct, therefore arranged their biographies. As for their books, the world has many of them, therefore do not discuss, discuss their scattered affairs.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "管仲世所謂賢臣，然孔子小之。",
          "translations": [
            {
              "lang": "en",
              "text": "Guan Zhong the world calls a worthy minister, yet Confucius belittled him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "豈以為周道衰微，桓公既賢，而不勉之至王，乃稱霸哉？",
          "translations": [
            {
              "lang": "en",
              "text": "Was it because the Zhou way declined, Duke Huan being worthy, yet did not encourage him to reach kingship, but only became hegemon?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "語曰「將順其美，匡救其惡，故上下能相親也」。",
          "translations": [
            {
              "lang": "en",
              "text": "The saying: 'Promote what is good in them, correct what is evil, therefore superiors and inferiors can be close.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "豈管仲之謂乎？",
          "translations": [
            {
              "lang": "en",
              "text": "Is this not speaking of Guan Zhong?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "Guan Zhong the world calls a worthy minister, yet Confucius belittled him. Was it because the Zhou way declined, Duke Huan being worthy, yet did not encourage him to reach kingship, but only became hegemon? The saying: 'Promote what is good in them, correct what is evil, therefore superiors and inferiors can be close.' Is this not speaking of Guan Zhong?",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "方晏子伏莊公尸哭之，成禮然後去，豈所謂「見義不為無勇」者邪？",
          "translations": [
            {
              "lang": "en",
              "text": "When Yan Zi lay on Duke Zhuang's corpse weeping for him, completed the rites then left, is this not what is called 'seeing righteousness and not acting is without courage'?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "至其諫說，犯君之顏，此所謂「進思盡忠，退思補過」者哉！",
          "translations": [
            {
              "lang": "en",
              "text": "As for his remonstrations and persuasions, offending the lord's countenance, this is what is called 'advancing think of exhausting loyalty, retiring think of supplementing faults'!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "假令晏子而在，余雖為之執鞭，所忻慕焉。",
          "translations": [
            {
              "lang": "en",
              "text": "If Yan Zi were still alive, I though holding his whip for him, would be joyful and admiring.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "text": "When Yan Zi lay on Duke Zhuang's corpse weeping for him, completed the rites then left, is this not what is called 'seeing righteousness and not acting is without courage'? As for his remonstrations and persuasions, offending the lord's countenance, this is what is called 'advancing think of exhausting loyalty, retiring think of supplementing faults'! If Yan Zi were still alive, I though holding his whip for him, would be joyful and admiring.",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}