{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "076",
    "url": "https://chinesenotes.com/shiji/shiji076.html",
    "title": {
      "zh": "平原君虞卿列傳",
      "en": "Biographies of Lord Pingyuan and Yu Qing",
      "raw": "《平原君虞卿列傳》 Biographies of Lord Pingyuan and Yu Qing"
    },
    "sentenceCount": 220,
    "translatedCount": 220,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:00.995Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "平原君趙勝者，趙之諸公子也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun Zhao Sheng, Zhao various duke son.",
              "idiomatic": "Lord Pingyuan, Zhao Sheng, was one of the noble scions of Zhao.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "諸子中勝最賢，喜賓客，賓客蓋至者數千人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Various son middle Sheng most worthy, happy guests, guests cover arrive several thousand people.",
              "idiomatic": "Among the noble scions, Sheng was the most worthy. He delighted in guests, and the number of guests who came to him reached several thousand.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "平原君相趙惠文王及孝成王，三去相，三復位，封於東武城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun chancellor Zhao Hui Wen Wang and Xiao Cheng Wang, three leave chancellor, three restore position, enfeoff at east Wu city.",
              "idiomatic": "Lord Pingyuan served as chancellor to Kings Huiwen and Xiaocheng of Zhao. Three times he resigned the chancellorship, three times he was restored to office, and he was enfeoffed at Dongwu City.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun Zhao Sheng, Zhao various duke son. Various son middle Sheng most worthy, happy guests, guests cover arrive several thousand people. Ping Yuan Jun chancellor Zhao Hui Wen Wang and Xiao Cheng Wang, three leave chancellor, three restore position, enfeoff at east Wu city.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "平原君家樓臨民家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun house building face common people house.",
              "idiomatic": "Lord Pingyuan's house tower overlooked a commoner's home.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "民家有躄者，槃散行汲。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Common people house have cripple, plate spread walk draw water.",
              "idiomatic": "In the commoner's home lived a crippled man who, with his knees spread apart, crawled to draw water.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "平原君美人居樓上，臨見，大笑之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun beauty dwell building up, face see, greatly laugh him.",
              "idiomatic": "Lord Pingyuan's concubine was dwelling in the tower above, looked down and saw him, and burst out laughing.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "明日，躄者至平原君門，請曰：「臣聞君之喜士，士不遠千里而至者，以君能貴士而賤妾也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tomorrow, cripple arrive Ping Yuan Jun gate, request: Minister hear jun happy scholar, scholar not far thousand li arrive, with jun can noble scholar cheap concubine.",
              "idiomatic": "The next day, the crippled man came to Lord Pingyuan's gate and made this request: 'I have heard that Your Lordship delights in worthy men. Worthy men travel thousands of li without hesitation to reach you, because you honor the worthy and humble the unworthy.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "臣不幸有罷癃之病，而君之後宮臨而笑臣，臣願得笑臣者頭。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Minister unfortunate have tired lame illness, jun rear palace face laugh minister, minister wish obtain laugh minister head.",
              "idiomatic": "Alas, I suffer from a debilitating illness. Yet one of Your Lordship's concubines looked down upon me and laughed. I wish to have the head of the one who laughed at me.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "平原君笑應曰：「諾。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun laugh respond: Yes.",
              "idiomatic": "Lord Pingyuan laughed and replied, 'Very well.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "躄者去，平原君笑曰：「觀此豎子，乃欲以一笑之故殺吾美人，不亦甚乎！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Cripple go, Ping Yuan Jun laugh: View this young child, then wish with one laugh reason kill my beauty, not also extreme!",
              "idiomatic": "The crippled man departed, and Lord Pingyuan laughed, saying: 'Look at this wretched fellow! He wants to kill my beautiful concubine just because of a single laugh. Isn't this going too far!'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "終不殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Finally not kill.",
              "idiomatic": "In the end, he did not kill her.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "居歲餘，賓客門下舍人稍稍引去者過半。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Dwell year more, guests gate below house person gradually leave over half.",
              "idiomatic": "More than a year passed, and gradually more than half of the retainers in his household had departed.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "平原君怪之，曰：「勝所以待諸君者未嘗敢失禮，而去者何多也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun strange, say: Sheng so wait various jun not dare lose ritual, leave why many?",
              "idiomatic": "Lord Pingyuan was puzzled and said: 'I, Sheng, have never dared to treat you gentlemen discourteously. Why have so many departed?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "門下一人前對曰：「以君之不殺笑躄者，以君為愛色而賤士，士即去耳。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gate below one person before answer: With jun not kill laugh cripple, with jun love color cheap scholar, scholar then leave.",
              "idiomatic": "One of his retainers stepped forward and replied: 'Because Your Lordship did not kill the concubine who laughed at the cripple, they think you value beauty over worth. The worthy men have departed.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "於是平原君乃斬笑躄者美人頭，自造門進躄者，因謝焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then Ping Yuan Jun then behead laugh cripple beauty head, self make gate advance cripple, because apologize.",
              "idiomatic": "Thereupon Lord Pingyuan had the concubine who laughed at the cripple beheaded. He personally went to the gate and invited the cripple in, then apologized to him.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "其後門下乃復稍稍來。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After gate below then again gradually come.",
              "idiomatic": "Afterward, his retainers gradually began to return once more.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "是時齊有孟嘗，魏有信陵，楚有春申，故爭相傾以待士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This time Qi have Meng Chang, Wei have Xin Ling, Chu have Chun Shen, therefore strive mutually incline treat scholar.",
              "idiomatic": "At this time, Qi had Lord Mengchang, Wei had Lord Xinling, and Chu had Lord Chunshen. Thus they vied with one another to attract worthy men with generous treatment.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun house building face common people house. Common people house have cripple, plate spread walk draw water. Ping Yuan Jun beauty dwell building up, face see, greatly laugh him. Tomorrow, cripple arrive Ping Yuan Jun gate, request: Minister hear jun happy scholar, scholar not far thousand li arrive, with jun can noble scholar cheap concubine. Minister unfortunate have tired lame illness, jun rear palace face laugh minister, minister wish obtain laugh minister head. Ping Yuan Jun laugh respond: Yes. Cripple go, Ping Yuan Jun laugh: View this young child, then wish with one laugh reason kill my beauty, not also extreme! Finally not kill. Dwell year more, guests gate below house person gradually leave over half. Ping Yuan Jun strange, say: Sheng so wait various jun not dare lose ritual, leave why many? Gate below one person before answer: With jun not kill laugh cripple, with jun love color cheap scholar, scholar then leave. Then Ping Yuan Jun then behead laugh cripple beauty head, self make gate advance cripple, because apologize. After gate below then again gradually come. This time Qi have Meng Chang, Wei have Xin Ling, Chu have Chun Shen, therefore strive mutually incline treat scholar.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0018",
          "zh": "秦之圍邯鄲，趙使平原君求救，合從於楚，約與食客門下有勇力文武備具者二十人偕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin surround Han Dan, Zhao make Ping Yuan Jun seek save, unite vertical at Chu, about with eat guests gate below have brave force literary martial complete twenty people together.",
              "idiomatic": "When Qin besieged Handan, Zhao sent Lord Pingyuan to seek aid. He allied with Chu and brought along twenty of his retainers who possessed both martial valor and literary accomplishment.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "平原君曰：「使文能取勝，則善矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Make literary can take win, then good.",
              "idiomatic": "Lord Pingyuan said: 'If diplomacy can secure victory, that would be excellent.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "文不能取勝，則歃血於華屋之下，必得定從而還。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Literary cannot take win, then shed blood at Hua Wu below, must obtain fix vertical return.",
              "idiomatic": "If diplomacy cannot prevail, then we shall perform the blood oath beneath the ornate hall and secure a firm alliance before returning.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "士不外索，取於食客門下足矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Scholar not outer seek, take at eat guests gate below sufficient.",
              "idiomatic": "We shall not seek worthy men from outside; those among my retainers will suffice.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "得十九人，餘無可取者，無以滿二十人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Obtain nineteen people, remain none can take, no fill twenty people.",
              "idiomatic": "They obtained nineteen men, but there were no others worthy of selection, so they could not fill the twentieth position.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "門下有毛遂者，前，自贊於平原君曰：「遂聞君將合從於楚，約與食客門下二十人偕，不外索。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gate below have Mao Sui, before, self praise at Ping Yuan Jun: Sui hear jun will unite vertical at Chu, about with eat guests gate below twenty people together, not outer seek.",
              "idiomatic": "Among his retainers was a man named Mao Sui. He stepped forward and recommended himself to Lord Pingyuan, saying: 'I, Sui, have heard that Your Lordship will form a vertical alliance with Chu, bringing along twenty of your retainers, seeking none from outside.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "今少一人，願君即以遂備員而行矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now few one person, wish jun then with Sui complete member go.",
              "idiomatic": "Now you lack one man. I wish Your Lordship would immediately include me, Sui, to complete the number and depart.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "平原君曰：「先生處勝之門下幾年於此矣？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Mister dwell Sheng gate below several year here?",
              "idiomatic": "Lord Pingyuan said: 'Sir, how many years have you been dwelling in my household?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "毛遂曰：「三年於此矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui say: Three year here.",
              "idiomatic": "Mao Sui replied: 'Three years now.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "平原君曰：「夫賢士之處世也，譬若錐之處囊中，其末立見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Worthy scholar dwell world, like awl dwell bag middle, its point immediately see.",
              "idiomatic": "Lord Pingyuan said: 'Truly, when a worthy man dwells in the world, it is like an awl placed in a bag - its point immediately becomes visible.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "今先生處勝之門下三年於此矣，左右未有所稱誦，勝未有所聞，是先生無所有也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now mister dwell Sheng gate below three year here, left right not have praise recite, Sheng not have hear, is mister no all.",
              "idiomatic": "Now you have dwelt in my household for three years, yet no one on my left or right has ever praised or quoted you. I have never heard of you. This means you have no talent at all.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "先生不能，先生留。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mister cannot, mister stay.",
              "idiomatic": "If you cannot do it, sir, then stay behind.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "毛遂曰：「臣乃今日請處囊中耳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui say: Minister then today request dwell bag middle.",
              "idiomatic": "Mao Sui replied: 'Your servant is only today requesting to be placed in the bag.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "使遂蚤得處囊中，乃穎脫而出，非特其末見而已。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Make Sui early obtain dwell bag middle, then tip emerge out, not only its point see only.",
              "idiomatic": "If I had been placed in the bag earlier, I would have burst forth like the tip of an awl - not merely showing its point, but protruding completely.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "平原君竟與毛遂偕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun finally with Mao Sui together.",
              "idiomatic": "In the end, Lord Pingyuan brought Mao Sui along.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "十九人相與目笑之而未廢也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nineteen people mutually eye laugh yet not abandon.",
              "idiomatic": "The nineteen others exchanged glances and smiled at him, but did not reject him.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Qin surround Han Dan, Zhao make Ping Yuan Jun seek save, unite vertical at Chu, about with eat guests gate below have brave force literary martial complete twenty people together. Ping Yuan Jun say: Make literary can take win, then good. Literary cannot take win, then shed blood at Hua Wu below, must obtain fix vertical return. Scholar not outer seek, take at eat guests gate below sufficient. Obtain nineteen people, remain none can take, no fill twenty people. Gate below have Mao Sui, before, self praise at Ping Yuan Jun: Sui hear jun will unite vertical at Chu, about with eat guests gate below twenty people together, not outer seek. Now few one person, wish jun then with Sui complete member go. Ping Yuan Jun say: Mister dwell Sheng gate below several year here? Mao Sui say: Three year here. Ping Yuan Jun say: Worthy scholar dwell world, like awl dwell bag middle, its point immediately see. Now mister dwell Sheng gate below three year here, left right not have praise recite, Sheng not have hear, is mister no all. Mister cannot, mister stay. Mao Sui say: Minister then today request dwell bag middle. Make Sui early obtain dwell bag middle, then tip emerge out, not only its point see only. Ping Yuan Jun finally with Mao Sui together. Nineteen people mutually eye laugh yet not abandon.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "毛遂比至楚，與十九人論議，十九人皆服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui wait arrive Chu, with nineteen people discuss argue, nineteen people all submit.",
              "idiomatic": "When Mao Sui arrived in Chu, he debated with the nineteen others, and all nineteen submitted to him.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "平原君與楚合從，言其利害，日出而言之，日中不決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun with Chu unite vertical, speak its profit harm, day out speak, day middle not decide.",
              "idiomatic": "Lord Pingyuan negotiated the vertical alliance with Chu, discussing its advantages and disadvantages. They began speaking at sunrise, but by noon had reached no decision.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "十九人謂毛遂曰：「先生上。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Nineteen people tell Mao Sui: Mister ascend.",
              "idiomatic": "The nineteen others said to Mao Sui: 'Sir, you go up.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "毛遂按劍歷階而上，謂平原君曰：「從之利害，兩言而決耳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui press sword climb steps ascend, tell Ping Yuan Jun: Vertical profit harm, two words decide.",
              "idiomatic": "Mao Sui, gripping his sword, ascended the steps one by one and said to Lord Pingyuan: 'The advantages and disadvantages of this alliance can be decided in two sentences.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "今日出而言從，日中不決，何也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Today out speak vertical, day middle not decide, why?",
              "idiomatic": "We began speaking of the alliance at sunrise, yet by noon we have reached no decision. Why is this?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "楚王謂平原君曰：「客何為者也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wang tell Ping Yuan Jun: Guest what do?",
              "idiomatic": "The King of Chu said to Lord Pingyuan: 'Who is this guest?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "平原君曰：「是勝之舍人也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Is Sheng house person.",
              "idiomatic": "Lord Pingyuan replied: 'He is one of my retainers.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "楚王叱曰：「胡不下！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wang scold: Why not descend!",
              "idiomatic": "The King of Chu rebuked him: 'Why don't you get down!",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "吾乃與而君言，汝何為者也！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I with your jun speak, you what do!",
              "idiomatic": "I am speaking with your lord. What business do you have here!'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "毛遂按劍而前曰：「王之所以叱遂者，以楚國之眾也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui press sword before: Wang so scold Sui, with Chu country crowd.",
              "idiomatic": "Mao Sui advanced, gripping his sword, and said: 'Your Majesty rebukes me because of Chu's great multitude.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "今十步之內，王不得恃楚國之眾也，王之命縣於遂手。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now ten step inside, wang not can rely Chu country crowd, wang life hang at Sui hand.",
              "idiomatic": "Within these ten paces, Your Majesty cannot rely on Chu's multitude. Your life hangs by my hand.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "吾君在前，叱者何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My jun in front, scold what?",
              "idiomatic": "My lord stands before you. Why do you rebuke me?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "且遂聞湯以七十里之地王天下，文王以百里之壤而臣諸侯，豈其士卒眾多哉，誠能據其勢而奮其威。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover Sui hear Tang with seventy li land wang world, Wen Wang with hundred li soil minister feudal lords, how their soldiers many, truly can occupy their power rouse their might.",
              "idiomatic": "Moreover, I have heard that Tang became king of the world with seventy li of land, and King Wen made the feudal lords his subjects with a hundred li of territory. Was it because they had many soldiers? It was because they knew how to seize the moment and exert their authority.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "今楚地方五千里，持戟百萬，此霸王之資也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Chu place five thousand li, hold halberd hundred thousand, this hegemon wang capital.",
              "idiomatic": "Now Chu place five thousand li, hold halwasrd hundred thousand, this hegemon wang capital."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "以楚之彊，天下弗能當。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "With Chu strong, world not can match.",
              "idiomatic": "With Chu strong, world did not could match."
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "白起，小豎子耳，率數萬之眾，興師以與楚戰，一戰而舉鄢郢，再戰而燒夷陵，三戰而辱王之先人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Bai Qi, small young child, lead several thousand crowd, raise troops with Chu battle, one battle take Yan Ying, two battle burn Yi Ling, three battle insult wang ancestor.",
              "idiomatic": "Bai Qi, small young child, lead several thousand crowd, raise troops and Chu battle, one battle take Yan Ying, two battle burn Yi Ling, three battle insult wang ancestor."
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "此百世之怨而趙之所羞，而王弗知惡焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This hundred generation grudge Zhao shame, wang not know hate.",
              "idiomatic": "This hundred generation grudge Zhao shame, wang did not know hate."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "合從者為楚，非為趙也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Unite vertical for Chu, not for Zhao.",
              "idiomatic": "Unite vertical for Chu, did not for Zhao."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "吾君在前，叱者何也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My jun in front, scold what?",
              "idiomatic": "My lord stands before you. Why do you rebuke me?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "楚王曰：「唯唯，誠若先生之言，謹奉社稷而以從。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wang say: Yes yes, truly if mister words, respectfully offer state altars for vertical.",
              "idiomatic": "Chu King said: Yes yes, truly if mister words, respectfully offer state altars for vertical."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "毛遂曰：「從定乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui say: Vertical fix?",
              "idiomatic": "Mao Sui said: Vertical fix?"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "楚王曰：「定矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wang say: Fix.",
              "idiomatic": "Chu King said: Fix."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "毛遂謂楚王之左右曰：「取雞狗馬之血來。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui tell Chu Wang left right: Take chicken dog horse blood come.",
              "idiomatic": "Mao Sui tell Chu King left right: Take chicken dog horse blood come."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "毛遂奉銅槃而跪進之楚王曰：「王當歃血而定從，次者吾君，次者遂。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui hold copper plate kneel advance Chu Wang: Wang when shed blood fix vertical, next my jun, next Sui.",
              "idiomatic": "Mao Sui hold copper plate kneel advance Chu King: King when shed blood fix vertical, next my jun, next Sui."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "遂定從於殿上。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sui fix vertical at hall up.",
              "idiomatic": "Sui secured the alliance right there in the hall.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "毛遂左手持槃血而右手招十九人曰：「公相與歃此血於堂下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Sui left hand hold plate blood right hand call nineteen people: Gong mutually shed this blood at hall below.",
              "idiomatic": "Mao Sui left hand hold plate blood right hand call nineteen people: Gong mutually shed this blood at hall waslow."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "公等錄錄，所謂因人成事者也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gong equal equal, so called follow person complete affairs.",
              "idiomatic": "You gentlemen are mediocre - what is called achieving things by following others.'",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Mao Sui wait arrive Chu, with nineteen people discuss argue, nineteen people all submit. Ping Yuan Jun with Chu unite vertical, speak its profit harm, day out speak, day middle not decide. Nineteen people tell Mao Sui: Mister ascend. Mao Sui press sword climb steps ascend, tell Ping Yuan Jun: Vertical profit harm, two words decide. Today out speak vertical, day middle not decide, why? Chu Wang tell Ping Yuan Jun: Guest what do? Ping Yuan Jun say: Is Sheng house person. Chu Wang scold: Why not descend! I with your jun speak, you what do! Mao Sui press sword before: Wang so scold Sui, with Chu country crowd. Now ten step inside, wang not can rely Chu country crowd, wang life hang at Sui hand. My jun in front, scold what? Moreover Sui hear Tang with seventy li land wang world, Wen Wang with hundred li soil minister feudal lords, how their soldiers many, truly can occupy their power rouse their might. Now Chu place five thousand li, hold halberd hundred thousand, this hegemon wang capital. With Chu strong, world not can match. Bai Qi, small young child, lead several thousand crowd, raise troops with Chu battle, one battle take Yan Ying, two battle burn Yi Ling, three battle insult wang ancestor. This hundred generation grudge Zhao shame, wang not know hate. Unite vertical for Chu, not for Zhao. My jun in front, scold what? Chu Wang say: Yes yes, truly if mister words, respectfully offer state altars for vertical. Mao Sui say: Vertical fix? Chu Wang say: Fix. Mao Sui tell Chu Wang left right: Take chicken dog horse blood come. Mao Sui hold copper plate kneel advance Chu Wang: Wang when shed blood fix vertical, next my jun, next Sui. Sui fix vertical at hall up. Mao Sui left hand hold plate blood right hand call nineteen people: Gong mutually shed this blood at hall below. Gong equal equal, so called follow person complete affairs.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0062",
          "zh": "平原君已定從而歸，歸至於趙，曰：「勝不敢復相士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun already fix vertical return, return arrive Zhao, say: Sheng not dare again match scholar.",
              "idiomatic": "Ping Yuan Lord already fix vertical return, return arrive Zhao, said: Sheng did not dare again match scholar."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "勝相士多者千人，寡者百數，自以為不失天下之士，今乃於毛先生而失之也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sheng match scholar many thousand people, few hundred number, self consider not lose world scholar, now then at Mao mister lose.",
              "idiomatic": "Sheng match scholar many thousand people, few hundred numwasr, self consider did not lose world scholar, now then at Mao mister lose."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "毛先生一至楚，而使趙重於九鼎大呂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao mister one arrive Chu, make Zhao heavy nine tripods big bell.",
              "idiomatic": "Mao mister one arrive Chu, made Zhao heavy nine tripods big wasll."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "毛先生以三寸之舌，彊於百萬之師。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao mister with three cun tongue, strong hundred thousand army.",
              "idiomatic": "Mao mister and three cun tongue, strong hundred thousand army."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "勝不敢復相士。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Sheng not dare again match scholar.",
              "idiomatic": "Sheng did not dare again match scholar."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "遂以為上客。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then with as upper guest.",
              "idiomatic": "Then and as upper guest."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun already fix vertical return, return arrive Zhao, say: Sheng not dare again match scholar. Sheng match scholar many thousand people, few hundred number, self consider not lose world scholar, now then at Mao mister lose. Mao mister one arrive Chu, make Zhao heavy nine tripods big bell. Mao mister with three cun tongue, strong hundred thousand army. Sheng not dare again match scholar. Then with as upper guest.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "平原君既返趙，楚使春申君將兵赴救趙，魏信陵君亦矯奪晉鄙軍往救趙，皆未至。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun already return Zhao, Chu make Chun Shen Jun lead troops hasten save Zhao, Wei Xin Ling Jun also false steal Jin Bi army go save Zhao, all not arrive.",
              "idiomatic": "Ping Yuan Lord already return Zhao, Chu made Chun Shen Lord lead troops hasten save Zhao, Wei Xin Ling Lord also false steal Jin Bi army go save Zhao, all did not arrive."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "秦急圍邯鄲，邯鄲急，且降，平原君甚患之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin urgent surround Han Dan, Han Dan urgent, and surrender, Ping Yuan Jun very worried.",
              "idiomatic": "Qin urgent surround Han Dan, Han Dan urgent, and surrender, Ping Yuan Lord very worried."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "邯鄲傳舍吏子李同說平原君曰：「君不憂趙亡邪？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Han Dan guest house officer son Li Tong advise Ping Yuan Jun: Jun not worry Zhao perish?",
              "idiomatic": "Li Tong, the son of a relay station officer in Handan, advised Lord Pingyuan, saying: 'My lord, do you not worry about Zhao's destruction?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "平原君曰：「趙亡則勝為虜，何為不憂乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Zhao perish then Sheng be captive, what not worry?",
              "idiomatic": "Ping Yuan Lord said: Zhao perish then Sheng was captive, what did not worry?"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "李同曰：「邯鄲之民，炊骨易子而食，可謂急矣，而君之後宮以百數，婢妾被綺縠，餘粱肉，而民褐衣不完，糟糠不厭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Tong say: Han Dan people, cook bone exchange child eat, can call urgent, yet jun rear palace with hundred number, maid concubine wear silk satin, remain fine grain meat, yet people coarse cloth not complete, bran chaff not satiated.",
              "idiomatic": "Li Tong said: 'The people of Handan are cooking bones and trading children for food - this can truly be called desperate. Yet Your Lordship's rear palace numbers in the hundreds, your concubines are clothed in silk and satin, and you have surplus fine grains and meats. Meanwhile the people wear incomplete coarse garments and are not sated even with bran and husks.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "民困兵盡，或剡木為矛矢，而君器物鐘磬自若。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "People tired troops exhaust, or sharpen wood make spear arrow, yet jun vessels bells chimes self as before.",
              "idiomatic": "The people are exhausted and the troops depleted - some are even sharpening wood to make spears and arrows. Yet Your Lordship's vessels, bells, and chimes remain just as they were.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "使秦破趙，君安得有此？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Make Qin break Zhao, jun how obtain this?",
              "idiomatic": "If Qin destroys Zhao, how will you obtain these things?"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "使趙得全，君何患無有？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Make Zhao obtain complete, jun what worry no have?",
              "idiomatic": "Make Zhao obtain complete, jun what worry no had?"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "今君誠能令夫人以下編於士卒之閒，分功而作，家之所有盡散以饗士，士方其危苦之時，易德耳。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now jun truly can make wife below weave at soldiers interval, divide labor work, family all scatter feast scholar, scholar when their danger bitter time, easy virtue.",
              "idiomatic": "Now jun truly could made wife waslow weave at soldiers interval, divide labor work, family all scatter feast scholar, scholar when their danger bitter time, easy virtue."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "於是平原君從之，得敢死之士三千人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then Ping Yuan Jun from it, obtain dare die scholar three thousand people.",
              "idiomatic": "Then Ping Yuan Lord from it, obtain dare die scholar three thousand people."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "李同遂與三千人赴秦軍，秦軍為之卻三十里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Tong then with three thousand people hasten Qin army, Qin army for retreat thirty li.",
              "idiomatic": "Li Tong then and three thousand people hasten Qin army, Qin army for retreat thirty li."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "亦會楚、魏救至，秦兵遂罷，邯鄲復存。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Also meet Chu Wei save arrive, Qin troops then stop, Han Dan again exist.",
              "idiomatic": "Just then the Chu and Wei rescue forces arrived, and the Qin troops withdrew, allowing Handan to survive once more."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "李同戰死，封其父為李侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Tong battle die, enfeoff his father as Li Hou.",
              "idiomatic": "Li Tong died in battle, and his father was enfeoffed as Marquis Li."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun already return Zhao, Chu make Chun Shen Jun lead troops hasten save Zhao, Wei Xin Ling Jun also false steal Jin Bi army go save Zhao, all not arrive. Qin urgent surround Han Dan, Han Dan urgent, and surrender, Ping Yuan Jun very worried. Han Dan guest house officer son Li Tong advise Ping Yuan Jun: Jun not worry Zhao perish? Ping Yuan Jun say: Zhao perish then Sheng be captive, what not worry? Li Tong say: Han Dan people, cook bone exchange child eat, can call urgent, yet jun rear palace with hundred number, maid concubine wear silk satin, remain fine grain meat, yet people coarse cloth not complete, bran chaff not satiated. People tired troops exhaust, or sharpen wood make spear arrow, yet jun vessels bells chimes self as before. Make Qin break Zhao, jun how obtain this? Make Zhao obtain complete, jun what worry no have? Now jun truly can make wife below weave at soldiers interval, divide labor work, family all scatter feast scholar, scholar when their danger bitter time, easy virtue. Then Ping Yuan Jun from it, obtain dare die scholar three thousand people. Li Tong then with three thousand people hasten Qin army, Qin army for retreat thirty li. Also meet Chu Wei save arrive, Qin troops then stop, Han Dan again exist. Li Tong battle die, enfeoff his father as Li Hou.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0081",
          "zh": "虞卿欲以信陵君之存邯鄲為平原君請封。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing wish with Xin Ling Jun save Han Dan for Ping Yuan Jun request enfeoff.",
              "idiomatic": "Yu Qing wish and Xin Ling Lord save Han Dan for Ping Yuan Lord request enfeoff."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "公孫龍聞之，夜駕見平原君曰：「龍聞虞卿欲以信陵君之存邯鄲為君請封，有之乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gong Sun Long hear, night drive see Ping Yuan Jun: Long hear Yu Qing wish with Xin Ling Jun save Han Dan for jun request enfeoff, have?",
              "idiomatic": "Gong Sun Long hear, night drive see Ping Yuan Lord: Long hear Yu Qing wish and Xin Ling Lord save Han Dan for jun request enfeoff, had?"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "平原君曰：「然。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun say: Correct.",
              "idiomatic": "Ping Yuan Lord said: Correct."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "龍曰：「此甚不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Long say: This very not can.",
              "idiomatic": "Long said: 'This is quite impossible.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "且王舉君而相趙者，非以君之智能為趙國無有也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover wang raise jun chancellor Zhao, not with jun intelligence ability for Zhao country none.",
              "idiomatic": "Moreover wang raise jun chancellor Zhao, did not and jun intelligence ability for Zhao country none."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "割東武城而封君者，非以君為有功也，而以國人無勳，乃以君為親戚故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Divide east Wu city enfeoff jun, not with jun have merit, with country people no achievement, then with jun close relative reason.",
              "idiomatic": "Divide east Wu city enfeoff jun, did not and jun had merit, and country people no achievement, then and jun close relative reason."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "君受相印不辭無能，割地不言無功者，亦自以為親戚故也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jun receive chancellor seal not decline no ability, divide land not speak no merit, also self with close relative reason.",
              "idiomatic": "Lord receive chancellor seal did not decline no ability, divide land did not speak no merit, also self and close relative reason."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "今信陵君存邯鄲而請封，是親戚受城而國人計功也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Xin Ling Jun save Han Dan request enfeoff, is close relative receive city country people count merit.",
              "idiomatic": "Now Xin Ling Lord save Han Dan request enfeoff, is close relative receive city country people count merit."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "此甚不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This very not can.",
              "idiomatic": "This very did not could."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "且虞卿操其兩權，事成，操右券以責；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover Yu Qing grasp its two power, affair complete, grasp right contract demand;",
              "idiomatic": "Yu Qing moreover grasped its two points of power - affairs were complete; he grasped the right contract and made demands."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "事不成，以虛名德君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "affair not complete, with empty name virtue jun.",
              "idiomatic": "affair did not complete, and empty name virtue jun."
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "君必勿聽也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jun certainly not listen.",
              "idiomatic": "Lord certainly did not listen."
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "平原君遂不聽虞卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun then not listen Yu Qing.",
              "idiomatic": "Ping Yuan Lord then did not listen Yu Qing."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yu Qing wish with Xin Ling Jun save Han Dan for Ping Yuan Jun request enfeoff. Gong Sun Long hear, night drive see Ping Yuan Jun: Long hear Yu Qing wish with Xin Ling Jun save Han Dan for jun request enfeoff, have? Ping Yuan Jun say: Correct. Long say: This very not can. Moreover wang raise jun chancellor Zhao, not with jun intelligence ability for Zhao country none. Divide east Wu city enfeoff jun, not with jun have merit, with country people no achievement, then with jun close relative reason. Jun receive chancellor seal not decline no ability, divide land not speak no merit, also self with close relative reason. Now Xin Ling Jun save Han Dan request enfeoff, is close relative receive city country people count merit. This very not can. Moreover Yu Qing grasp its two power, affair complete, grasp right contract demand; affair not complete, with empty name virtue jun. Jun certainly not listen. Ping Yuan Jun then not listen Yu Qing.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0094",
          "zh": "平原君以趙孝成王十五年卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun with Zhao Xiao Cheng Wang fifteen year die.",
              "idiomatic": "Ping Yuan Lord and Zhao Xiao Cheng King fifteen year die."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "子孫代，後竟與趙俱亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Son grandson succeed, after finally with Zhao together perish.",
              "idiomatic": "Son grandson succeed, after finally and Zhao together perish."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun with Zhao Xiao Cheng Wang fifteen year die. Son grandson succeed, after finally with Zhao together perish.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0096",
          "zh": "平原君厚待公孫龍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ping Yuan Jun thick treat Gong Sun Long.",
              "idiomatic": "Ping Yuan Lord thick treat Gong Sun Long."
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "公孫龍善為堅白之辯，及鄒衍過趙言至道，乃絀公孫龍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gong Sun Long good make firm white same different debate, reach Zou Yan pass Zhao speak arrive way, then demote Gong Sun Long.",
              "idiomatic": "Gong Sun Long good made firm white same different debate, reach Zou Yan pass Zhao speak arrive way, then demote Gong Sun Long."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Ping Yuan Jun thick treat Gong Sun Long. Gong Sun Long good make firm white same different debate, reach Zou Yan pass Zhao speak arrive way, then demote Gong Sun Long.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0098",
          "zh": "虞卿者，游說之士也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing, travel speak scholar.",
              "idiomatic": "Yu Qing traveled and spoke as a wandering scholar."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "躡蹻檐簦說趙孝成王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Step shoe hat advise Zhao Xiao Cheng Wang.",
              "idiomatic": "Step shoe hat advise Zhao Xiao Cheng King."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "一見，賜黃金百鎰，白璧一雙；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "One see, grant gold hundred yi, white jade one pair;",
              "idiomatic": "At first sight, he granted a hundred yi of gold and a pair of white jade discs."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "再見，為趙上卿，故號為虞卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Again see, for Zhao upper qing, therefore number as Yu Qing.",
              "idiomatic": "Again see, for Zhao upper qing, therefore numwasr as Yu Qing."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yu Qing, travel speak scholar. Step shoe hat advise Zhao Xiao Cheng Wang. One see, grant gold hundred yi, white jade one pair; Again see, for Zhao upper qing, therefore number as Yu Qing.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "秦趙戰於長平，趙不勝，亡一都尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin Zhao battle at Chang Ping, Zhao not win, perish one du wei.",
              "idiomatic": "Qin Zhao battle at Chang Ping, Zhao did not win, perish one du wei."
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "趙王召樓昌與虞卿曰：「軍戰不勝，尉復死，寡人使束甲而趨之，何如？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Wang summon Lou Chang with Yu Qing: Army battle not win, wei again die, my person make bind armor hasten it, how?",
              "idiomatic": "Zhao King summon Lou Chang and Yu Qing: Army battle did not win, wei again die, my person made bind armor hasten it, how?"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "樓昌曰：「無益也，不如發重使為媾。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lou Chang say: No benefit, not as send heavy envoy peace.",
              "idiomatic": "Lou Chang said: No wasnefit, did not as send heavy envoy peace."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "虞卿曰：「昌言媾者，以為不媾軍必破也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing say: Chang speak peace, consider not peace army certainly break.",
              "idiomatic": "Yu Qing said: Chang speak peace, consider did not peace army certainly break."
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "而制媾者在秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet control peace at Qin.",
              "idiomatic": "Yet he controlled the peace negotiations with Qin."
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "且王之論秦也，欲破趙之軍乎，不邪？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover wang discuss Qin, wish break Zhao army, not?",
              "idiomatic": "Moreover wang discuss Qin, wish break Zhao army, did not?"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "王曰：「秦不遺餘力矣，必且欲破趙軍。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang say: Qin not spare remain strength, certainly wish break Zhao army.",
              "idiomatic": "King said: Qin did not spare remain strength, certainly wish break Zhao army."
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "虞卿曰：「王聽臣，發使出重寶以附楚、魏，楚、魏欲得王之重寶，必內吾使。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing say: Wang listen minister, send envoy emerge heavy treasure attach Chu Wei, Chu Wei wish obtain wang heavy treasure, certainly inner our envoy.",
              "idiomatic": "Yu Qing said: King listen minister, send envoy emerge heavy treasure attach Chu Wei, Chu Wei wish obtain wang heavy treasure, certainly inner our envoy."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "趙使入楚、魏，秦必疑天下之合從，且必恐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao envoy enter Chu Wei, Qin certainly suspect world unite vertical, moreover certainly fear.",
              "idiomatic": "If Zhao sends envoys to Chu and Wei, Qin will certainly suspect that the world is uniting against them, and moreover will certainly be afraid."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "如此，則媾乃可為也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Like this, then peace then can make.",
              "idiomatic": "Like this, then peace then could made."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "趙王不聽，與平陽君為媾，發鄭朱入秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Wang not listen, with Ping Yang Jun peace, send Zheng Zhu enter Qin.",
              "idiomatic": "Zhao King did not listen, and Ping Yang Lord peace, send Zheng Zhu enter Qin."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "秦內之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin inner him.",
              "idiomatic": "Qin took him in."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "趙王召虞卿曰：「寡人使平陽君為媾於秦，秦已內鄭朱矣，卿之為奚如？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Wang summon Yu Qing: My person make Ping Yang Jun peace at Qin, Qin already inner Zheng Zhu, qing for what like?",
              "idiomatic": "Zhao King summon Yu Qing: My person made Ping Yang Lord peace at Qin, Qin already inner Zheng Zhu, qing for what like?"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "虞卿對曰：「王不得媾，軍必破矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing answer: Wang not obtain peace, army certainly break.",
              "idiomatic": "Yu Qing answer: King did not obtain peace, army certainly break."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "天下賀戰者皆在秦矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "World celebrate battle all at Qin.",
              "idiomatic": "All those in the world who celebrate victories are now on Qin's side.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "鄭朱，貴人也，入秦，秦王與應侯必顯重以示天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zheng Zhu, noble person, enter Qin, Qin Wang with Ying Hou certainly bright heavy show world.",
              "idiomatic": "Zheng Zhu, noble person, enter Qin, Qin King and Ying Hou certainly bright heavy show world."
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "楚、魏以趙為媾，必不救王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chu Wei with Zhao peace, certainly not save wang.",
              "idiomatic": "Chu Wei and Zhao peace, certainly did not save wang."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "秦知天下不救王，則媾不可得成也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin know world not save wang, then peace not can complete.",
              "idiomatic": "Qin know world did not save wang, then peace did not could complete."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "應侯果顯鄭朱以示天下賀戰勝者，終不肯媾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ying Hou indeed bright Zheng Zhu show world celebrate battle win, finally not willing peace.",
              "idiomatic": "Ying Hou indeed bright Zheng Zhu show world celebrate battle win, finally did not willing peace."
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "長平大敗，遂圍邯鄲，為天下笑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chang Ping great defeat, then surround Han Dan, for world laugh.",
              "idiomatic": "After the great defeat at Changping, they then besieged Handan, becoming the laughingstock of the world."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Qin Zhao battle at Chang Ping, Zhao not win, perish one du wei. Zhao Wang summon Lou Chang with Yu Qing: Army battle not win, wei again die, my person make bind armor hasten it, how? Lou Chang say: No benefit, not as send heavy envoy peace. Yu Qing say: Chang speak peace, consider not peace army certainly break. Yet control peace at Qin. Moreover wang discuss Qin, wish break Zhao army, not? Wang say: Qin not spare remain strength, certainly wish break Zhao army. Yu Qing say: Wang listen minister, send envoy emerge heavy treasure attach Chu Wei, Chu Wei wish obtain wang heavy treasure, certainly inner our envoy. Zhao envoy enter Chu Wei, Qin certainly suspect world unite vertical, moreover certainly fear. Like this, then peace then can make. Zhao Wang not listen, with Ping Yang Jun peace, send Zheng Zhu enter Qin. Qin inner him. Zhao Wang summon Yu Qing: My person make Ping Yang Jun peace at Qin, Qin already inner Zheng Zhu, qing for what like? Yu Qing answer: Wang not obtain peace, army certainly break. World celebrate battle all at Qin. Zheng Zhu, noble person, enter Qin, Qin Wang with Ying Hou certainly bright heavy show world. Chu Wei with Zhao peace, certainly not save wang. Qin know world not save wang, then peace not can complete. Ying Hou indeed bright Zheng Zhu show world celebrate battle win, finally not willing peace. Chang Ping great defeat, then surround Han Dan, for world laugh.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "秦既解邯鄲圍，而趙王入朝，使趙郝約事於秦，割六縣而媾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin already relieve Han Dan surround, Zhao Wang enter court, make Zhao Hao bind affairs at Qin, divide six counties peace.",
              "idiomatic": "Qin already relieve Han Dan surround, Zhao King enter court, made Zhao Hao bind affairs at Qin, divide six counties peace."
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "虞卿謂趙王曰：「秦之攻王也，倦而歸乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing tell Zhao Wang: Qin attack wang, tired return?",
              "idiomatic": "Yu Qing tell Zhao King: Qin attack wang, tired return?"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "王以其力尚能進，愛王而弗攻乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang with its strength still can advance, love wang not attack?",
              "idiomatic": "King and its strength still could advance, love wang did not attack?"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "王曰：「秦之攻我也，不遺餘力矣，必以倦而歸也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang say: Qin attack I, not spare remain strength, certainly with tired return.",
              "idiomatic": "King said: Qin attack I, did not spare remain strength, certainly and tired return."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "虞卿曰：「秦以其力攻其所不能取，倦而歸，王又以其力之所不能取以送之，是助秦自攻也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing say: Qin with its strength attack its not can take, tired return, wang again with its strength not can take send it, is help Qin self attack.",
              "idiomatic": "Yu Qing said: Qin and its strength attack its did not could take, tired return, wang again and its strength did not could take send it, is help Qin self attack."
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "來年秦復攻王，王無救矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next year Qin again attack wang, wang no save.",
              "idiomatic": "The next year Qin attacked the king again, and the king had no rescue."
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "王以虞卿之言趙郝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang with Yu Qing words tell Zhao Hao.",
              "idiomatic": "King and Yu Qing words tell Zhao Hao."
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "趙郝曰：「虞卿誠能盡秦力之所至乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Hao say: Yu Qing truly can exhaust Qin strength arrive place?",
              "idiomatic": "Zhao Hao said: Yu Qing truly could exhaust Qin strength arrive place?"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "誠知秦力之所不能進，此彈丸之地弗予，令秦來年復攻王，王得無割其內而媾乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Truly know Qin strength not can advance, this pellet ball land not give, make Qin next year again attack wang, wang obtain not divide its inner peace?",
              "idiomatic": "Truly know Qin strength did not could advance, this pellet ball land did not give, made Qin next year again attack wang, wang obtain did not divide its inner peace?"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "王曰：「請聽子割，子能必使來年秦之不復攻我乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang say: Please listen son divide, son can certainly make next year Qin not again attack I?",
              "idiomatic": "King said: Please listen son divide, son could certainly made next year Qin did not again attack I?"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "趙郝對曰：「此非臣之所敢任也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Hao answer: This not minister dare take responsibility.",
              "idiomatic": "Zhao Hao answer: This did not minister dare take responsibility."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "他日三晉之交於秦，相善也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Other day three Jin friendship at Qin, mutually good.",
              "idiomatic": "On another day, the three Jin states had friendly relations with Qin and treated each other well."
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "今秦善韓、魏而攻王，王之所以事秦必不如韓、魏也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Qin good Han Wei attack wang, wang so serve Qin certainly not like Han Wei.",
              "idiomatic": "Now Qin good Han Wei attack wang, wang so serve Qin certainly did not like Han Wei."
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "今臣為足下解負親之攻，開關通幣，齊交韓、魏，至來年而王獨取饱於秦，此王之所以事秦必在韓、魏之後也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now minister for foot below relieve negative close attack, open pass through currency, Qi connect Han Wei, to next year wang alone take satiated at Qin, this wang so serve Qin certainly after Han Wei.",
              "idiomatic": "Now minister for foot waslow relieve negative close attack, open pass through currency, Qi connect Han Wei, to next year wang alone take satiated at Qin, this wang so serve Qin certainly after Han Wei."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "此非臣之所敢任也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This not minister dare take responsibility.",
              "idiomatic": "This did not minister dare take responsibility."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Qin already relieve Han Dan surround, Zhao Wang enter court, make Zhao Hao bind affairs at Qin, divide six counties peace. Yu Qing tell Zhao Wang: Qin attack wang, tired return? Wang with its strength still can advance, love wang not attack? Wang say: Qin attack I, not spare remain strength, certainly with tired return. Yu Qing say: Qin with its strength attack its not can take, tired return, wang again with its strength not can take send it, is help Qin self attack. Next year Qin again attack wang, wang no save. Wang with Yu Qing words tell Zhao Hao. Zhao Hao say: Yu Qing truly can exhaust Qin strength arrive place? Truly know Qin strength not can advance, this pellet ball land not give, make Qin next year again attack wang, wang obtain not divide its inner peace? Wang say: Please listen son divide, son can certainly make next year Qin not again attack I? Zhao Hao answer: This not minister dare take responsibility. Other day three Jin friendship at Qin, mutually good. Now Qin good Han Wei attack wang, wang so serve Qin certainly not like Han Wei. Now minister for foot below relieve negative close attack, open pass through currency, Qi connect Han Wei, to next year wang alone take satiated at Qin, this wang so serve Qin certainly after Han Wei. This not minister dare take responsibility.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0138",
          "zh": "王以告虞卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wang with tell Yu Qing.",
              "idiomatic": "King and tell Yu Qing."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "虞卿對曰：「郝言『不媾，來年秦復攻王，王得無割其內而媾乎』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yu Qing answer: Hao speak not peace, next year Qin again attack wang, wang obtain not divide its inner peace.",
              "idiomatic": "Yu Qing answer: Hao speak did not peace, next year Qin again attack wang, wang obtain did not divide its inner peace."
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "今媾，郝又以不能必秦之不復攻也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now peace, Hao again with cannot certainly Qin not again attack.",
              "idiomatic": "Now peace, Hao again and coulddid not certainly Qin did not again attack."
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "今雖割六城，何益！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now though divide six cities, what benefit!",
              "idiomatic": "Now though divide six cities, what wasnefit!"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "來年復攻，又割其力之所不能取而媾，此自盡之術也，不如無媾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next year again attack, again divide its strength not can take peace, this self exhaust art, not as no peace.",
              "idiomatic": "Next year again attack, again divide its strength did not could take peace, this self exhaust art, did not as no peace."
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "秦雖善攻，不能取六縣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin though good attack, cannot take six counties;",
              "idiomatic": "Qin though good attack, coulddid not take six counties;"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "趙雖不能守，終不失六城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao though cannot guard, finally not lose six cities.",
              "idiomatic": "Zhao though coulddid not guard, finally did not lose six cities."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "秦倦而歸，兵必罷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin tired return, troops certainly stop.",
              "idiomatic": "Qin will grow weary and return, and their troops will certainly stop."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "我以六城收天下以攻罷秦，是我失之於天下而取償於秦也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I with six cities collect world attack stop Qin, is I lose at world take repay at Qin.",
              "idiomatic": "I and six cities collect world attack stop Qin, is I lose at world take repay at Qin."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "吾國尚利，孰與坐而割地，自弱以彊秦哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My country still profit, who with sit divide land, self weak strong Qin!",
              "idiomatic": "My country still profit, who and sit divide land, self weak strong Qin!"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "今郝曰『秦善韓、魏而攻趙者，必（以為韓魏不救趙也而王之軍必孤有以）王之事秦不如韓、魏也』，是使王歲以六城事秦也，即坐而城盡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Hao say Qin good Han Wei attack Zhao, certainly consider Han Wei not save Zhao wang army certainly alone have with wang serve Qin not like Han Wei, is make wang year with six cities serve Qin, then sit city exhaust.",
              "idiomatic": "Now Hao say Qin good Han Wei attack Zhao, certainly consider Han Wei did not save Zhao wang army certainly alone had and wang serve Qin did not like Han Wei, is made wang year and six cities serve Qin, then sit city exhaust."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "來年秦復求割地，王將與之乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Next year Qin again seek divide land, wang will give?",
              "idiomatic": "The next year Qin will again seek to divide our lands - will Your Majesty give it to them?"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "弗與，是棄前功而挑秦禍也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Not give, is abandon before merit provoke Qin calamity;",
              "idiomatic": "Not give, is abandon wasfore merit provoke Qin calamity;"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "與之，則無地而給之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Give it, then no land give it.",
              "idiomatic": "If you give it, then there will be no land left to give."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "語曰『彊者善攻，弱者不能守』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Say strong good attack, weak not can guard.",
              "idiomatic": "Say strong good attack, weak did not could guard."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "今坐而聽秦，秦兵不獘而多得地，是彊秦而弱趙也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now sit listen Qin, Qin troops not tired many obtain land, is strong Qin weak Zhao.",
              "idiomatic": "If we now sit idly and allow Qin to act, their troops will not tire and they will gain much territory. This strengthens Qin while weakening Zhao.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "以益彊之秦而割愈弱之趙，其計故不止矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With increase strong Qin divide more weak Zhao, its plan certainly not stop.",
              "idiomatic": "To cede territory to an increasingly strong Qin from an ever-weakening Zhao - their ambitions will certainly not stop there.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "且王之地有盡而秦之求無已，以有盡之地而給無已之求，其勢必無趙矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover wang land have exhaust yet Qin seek no stop, with have exhaust land give no stop seek, its power certainly no Zhao.",
              "idiomatic": "Moreover, Your Majesty's territory is finite while Qin's demands are endless. To satisfy endless demands with finite territory - this situation will certainly lead to the destruction of Zhao.'",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Wang with tell Yu Qing. Yu Qing answer: Hao speak not peace, next year Qin again attack wang, wang obtain not divide its inner peace. Now peace, Hao again with cannot certainly Qin not again attack. Now though divide six cities, what benefit! Next year again attack, again divide its strength not can take peace, this self exhaust art, not as no peace. Qin though good attack, cannot take six counties; Zhao though cannot guard, finally not lose six cities. Qin tired return, troops certainly stop. I with six cities collect world attack stop Qin, is I lose at world take repay at Qin. My country still profit, who with sit divide land, self weak strong Qin! Now Hao say Qin good Han Wei attack Zhao, certainly consider Han Wei not save Zhao wang army certainly alone have with wang serve Qin not like Han Wei, is make wang year with six cities serve Qin, then sit city exhaust. Next year Qin again seek divide land, wang will give? Not give, is abandon before merit provoke Qin calamity; Give it, then no land give it. Say strong good attack, weak not can guard. Now sit listen Qin, Qin troops not tired many obtain land, is strong Qin weak Zhao. With increase strong Qin divide more weak Zhao, its plan certainly not stop. Moreover wang land have exhaust yet Qin seek no stop, with have exhaust land give no stop seek, its power certainly no Zhao.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "趙王計未定，樓緩從秦來，趙王與樓緩計之，曰：「予秦地（何）如毋予，孰吉？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao Wang plan not fix, Lou Huan from Qin come, Zhao Wang with Lou Huan plan, say: Give Qin land how like not give, who auspicious?",
              "idiomatic": "King Zhao's plans were not yet decided when Lou Huan arrived from Qin. The king consulted with Lou Huan, asking: 'Which is better - to cede territory to Qin or not to cede it?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "緩辭讓曰：「此非臣之所能知也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Huan decline yield: This not minister can know.",
              "idiomatic": "Lou Huan politely declined, saying: 'This is not something this minister can presume to know.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "王曰：「雖然，試言公之私。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: Although, try speak jun private.",
              "idiomatic": "The king said: 'Nevertheless, try telling me your personal opinion.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "樓緩對曰：「王亦聞夫公甫文伯母乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lou Huan answer: Wang also hear Gong Fu Wen Bo mother?",
              "idiomatic": "Lou Huan replied: 'Has Your Majesty also heard about the mother of Gongfu Wenbo?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "公甫文伯仕於魯，病死，女子為自殺於房中者二人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gong Fu Wen Bo serve at Lu, illness die, woman for self kill at room middle two people.",
              "idiomatic": "Gongfu Wenbo served in Lu. When he died of illness, two women killed themselves in mourning in his chambers.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "其母聞之，弗哭也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His mother hear, not cry.",
              "idiomatic": "When his mother heard this, she did not weep.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "其相室曰：『焉有子死而弗哭者乎？』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His assistant room say: How have son die not cry?",
              "idiomatic": "Her chamberlain said: 'How can there be a mother who does not weep when her son dies?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "其母曰：『孔子，賢人也，逐於魯，而是人不隨也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "His mother say: Confucius, worthy person, pursue at Lu, yet this person not follow.",
              "idiomatic": "His mother said: 'Confucius was a worthy man, exiled from Lu, yet this man did not follow him.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "今死而婦人為之自殺者二人，若是者必其於長者薄而於婦人厚也。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now die yet woman for self kill two people, like this certainly its at elder thin at woman thick.",
              "idiomatic": "Now that he is dead, two women have killed themselves for him. Someone like this must have been disrespectful to his elders but overly fond of women.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "故從母言之，是為賢母；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore from mother speak, is worthy mother;",
              "idiomatic": "Therefore, judging from the mother's perspective, she is a worthy mother;",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "從妻言之，是必不免為妒妻。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "From wife speak, certainly not avoid be jealous wife.",
              "idiomatic": "but judging from the wives' perspective, she was inevitably a jealous wife.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "故其言一也，言者異則人心變矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore its words one, speaker different then person heart change.",
              "idiomatic": "Thus the same words, when spoken by different people, change people's hearts.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "今臣新從秦來而言勿予，則非計也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now minister new from Qin come speak not give, then not plan;",
              "idiomatic": "Now I have just arrived from Qin and if I advise against ceding territory, it would not be proper strategy;",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "言予之，恐王以臣為為秦也：故不敢對。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Speak give, fear wang with minister for Qin: Therefore not dare answer.",
              "idiomatic": "if I advise in favor of ceding it, Your Majesty might think I am acting for Qin's benefit. Therefore I dare not answer.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "使臣得為大王計，不如予之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Make minister obtain for great wang plan, not as give.",
              "idiomatic": "If I may be allowed to plan for Your Great Majesty, it would be better to cede the territory.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "王曰：「諾。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: Yes.",
              "idiomatic": "The king said: 'Very well.'",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Zhao Wang plan not fix, Lou Huan from Qin come, Zhao Wang with Lou Huan plan, say: Give Qin land how like not give, who auspicious? Huan decline yield: This not minister can know. Wang say: Although, try speak jun private. Lou Huan answer: Wang also hear Gong Fu Wen Bo mother? Gong Fu Wen Bo serve at Lu, illness die, woman for self kill at room middle two people. His mother hear, not cry. His assistant room say: How have son die not cry? His mother say: Confucius, worthy person, pursue at Lu, yet this person not follow. Now die yet woman for self kill two people, like this certainly its at elder thin at woman thick. Therefore from mother speak, is worthy mother; From wife speak, certainly not avoid be jealous wife. Therefore its words one, speaker different then person heart change. Now minister new from Qin come speak not give, then not plan; Speak give, fear wang with minister for Qin: Therefore not dare answer. Make minister obtain for great wang plan, not as give. Wang say: Yes.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0174",
          "zh": "虞卿聞之，入見王曰：「此飾說也，王慎勿予！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing hear, enter see wang: This decorate speak, wang careful not give!",
              "idiomatic": "When Yu Qing heard this, he entered and saw the king, saying: 'This is deceptive talk! Your Majesty must be careful not to cede territory!'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "樓緩聞之，往見王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lou Huan hear, go see wang.",
              "idiomatic": "When Lou Huan heard this, he went to see the king.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "王又以虞卿之言告樓緩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang again with Yu Qing words tell Lou Huan.",
              "idiomatic": "The king again told Lou Huan what Yu Qing had said.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "樓緩對曰：「不然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lou Huan answer: Not so.",
              "idiomatic": "Lou Huan replied: 'Not so.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "虞卿得其一，不得其二。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing obtain its one, not obtain its two.",
              "idiomatic": "Yu Qing has grasped one aspect but missed the other two.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "夫秦趙構難而天下皆說，何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qin Zhao construct difficulty yet world all pleased, why?",
              "idiomatic": "When Qin and Zhao become embroiled in conflict, why is the whole world pleased?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "曰『吾且因彊而乘弱矣』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Say I and because strong ride weak.",
              "idiomatic": "They say: 'I can take advantage of the strong to prey upon the weak.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "今趙兵困於秦，天下之賀戰勝者則必盡在於秦矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now Zhao troops tired at Qin, world celebrate battle win then certainly all at Qin.",
              "idiomatic": "Now Zhao's troops are exhausted by Qin, so all those in the world who celebrate victory will certainly side with Qin.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "故不如亟割地為和，以疑天下而慰秦之心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore not as urgent divide land peace, to doubt world comfort Qin heart.",
              "idiomatic": "Therefore it would be better to urgently cede territory for peace, to sow doubt in the world and soothe Qin's ambitions.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "不然，天下將因秦之（彊）怒，乘趙之獘，瓜分之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Not so, world will because Qin strong anger, ride Zhao tired, melon divide it.",
              "idiomatic": "Otherwise, the world will take advantage of Qin's fury and Zhao's exhaustion to carve it up like a melon.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "趙且亡，何秦之圖乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao and perish, what Qin scheme!",
              "idiomatic": "Zhao will soon perish - what will Qin gain from that?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "故曰虞卿得其一，不得其二。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore say Yu Qing obtain its one, not obtain its two.",
              "idiomatic": "Therefore I say Yu Qing has grasped one aspect but missed the other two.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "願王以此決之，勿復計也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wish wang with this decide, not again plan.",
              "idiomatic": "I wish Your Majesty to decide based on this, and not deliberate further.'",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yu Qing hear, enter see wang: This decorate speak, wang careful not give! Lou Huan hear, go see wang. Wang again with Yu Qing words tell Lou Huan. Lou Huan answer: Not so. Yu Qing obtain its one, not obtain its two. Qin Zhao construct difficulty yet world all pleased, why? Say I and because strong ride weak. Now Zhao troops tired at Qin, world celebrate battle win then certainly all at Qin. Therefore not as urgent divide land peace, to doubt world comfort Qin heart. Not so, world will because Qin strong anger, ride Zhao tired, melon divide it. Zhao and perish, what Qin scheme! Therefore say Yu Qing obtain its one, not obtain its two. Wish wang with this decide, not again plan.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0188",
          "zh": "虞卿聞之，往見王曰：「危哉樓子之所以為秦者，是愈疑天下，而何慰秦之心哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing hear, go see wang: Danger Lou Zi so for Qin, is more doubt world, yet what comfort Qin heart!",
              "idiomatic": "When Yu Qing heard this, he went to see the king, saying: 'How dangerous! The way Lou Zi acts for Qin only increases the world's suspicions. How can this soothe Qin's ambitions?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "獨不言其示天下弱乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Alone not speak its show world weak?",
              "idiomatic": "Does he not speak of how this shows weakness to the world?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "且臣言勿予者，非固勿予而已也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover minister speak not give, not solid not give only.",
              "idiomatic": "Moreover, when I advised against ceding territory, it was not merely to refuse for refusal's sake.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "秦索六城於王，而王以六城賂齊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qin seek six cities at wang, wang with six cities bribe Qi.",
              "idiomatic": "Qin demands six cities from Your Majesty, but Your Majesty can use those six cities to bribe Qi.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "齊，秦之深讎也，得王之六城，并力西擊秦，齊之聽王，不待辭之畢也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi, Qin deep enemy, obtain wang six cities, together strength west attack Qin, Qi listen wang, not wait words finish.",
              "idiomatic": "Qi is Qin's bitter enemy. If Qi obtains Your Majesty's six cities, they will join forces to attack Qin from the west. Qi will heed Your Majesty's commands without waiting for the words to be fully spoken.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "則是王失之於齊而取償於秦也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then wang lose at Qi take repay at Qin, Qi Zhao deep enemy can report, show world have can do.",
              "idiomatic": "Thus Your Majesty loses to Qi but gains compensation from Qin.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0194",
          "zh": "而齊、趙之深讎可以報矣，而示天下有能為也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang with this issue sound, troops not spy at border, minister see Qin heavy bribe arrive Zhao return peace at wang.",
              "idiomatic": "Qi and Zhao's deep enmity can be avenged, and it will show the world that you have the ability to accomplish things.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "王以此發聲，兵未窺於境，臣見秦之重賂至趙而反媾於王也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "From Qin peace, Han Wei hear, certainly all heavy wang;",
              "idiomatic": "If Your Majesty issues this proclamation, even before troops spy across the borders, I foresee Qin sending heavy bribes to Zhao and returning to make peace with Your Majesty.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "從秦為媾，韓、魏聞之，必盡重王；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Heavy wang, certainly emerge heavy treasure first wang.",
              "idiomatic": "If peace is made with Qin, when Han and Wei hear of it, they will certainly all honor Your Majesty;",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "重王，必出重寶以先於王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then wang one raise tie three countries close, with Qin easy way.",
              "idiomatic": "in honoring Your Majesty, they will certainly send precious treasures to arrive before the others.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "則是王一舉而結三國之親，而與秦易道也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then wang one raise tie three countries close, with Qin easy way.",
              "idiomatic": "Thus with one action Your Majesty forms close ties with three states, and makes the path to Qin easy.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "趙王曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then make Yu Qing east see Qi Wang, with plan Qin.",
              "idiomatic": "King Zhao said: 'Excellent.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "則使虞卿東見齊王，與之謀秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing not return, Qin messenger already at Zhao.",
              "idiomatic": "Then he sent Yu Qing east to see the King of Qi and plot against Qin.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "虞卿未返，秦使者已在趙矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Lou Huan hear, flee go.",
              "idiomatic": "Yu Qing had not yet returned when Qin's envoy was already in Zhao.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "樓緩聞之，亡去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao then enfeoff Yu Qing with one city.",
              "idiomatic": "When Lou Huan heard this, he fled.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "趙於是封虞卿以一城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dwell moment, Wei request for vertical.",
              "idiomatic": "Zhao then enfeoffed Yu Qing with one city.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Yu Qing hear, go see wang: Danger Lou Zi so for Qin, is more doubt world, yet what comfort Qin heart! Alone not speak its show world weak? Moreover minister speak not give, not solid not give only. Qin seek six cities at wang, wang with six cities bribe Qi. Qi, Qin deep enemy, obtain wang six cities, together strength west attack Qin, Qi listen wang, not wait words finish. Then wang lose at Qi take repay at Qin, Qi Zhao deep enemy can report, show world have can do. Wang with this issue sound, troops not spy at border, minister see Qin heavy bribe arrive Zhao return peace at wang. From Qin peace, Han Wei hear, certainly all heavy wang; Heavy wang, certainly emerge heavy treasure first wang. Then wang one raise tie three countries close, with Qin easy way. Then wang one raise tie three countries close, with Qin easy way. Then make Yu Qing east see Qi Wang, with plan Qin. Yu Qing not return, Qin messenger already at Zhao. Lou Huan hear, flee go. Zhao then enfeoff Yu Qing with one city. Dwell moment, Wei request for vertical.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0204",
          "zh": "居頃之，而魏請為從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao Xiao Cheng Wang summon Yu Qing plan.",
              "idiomatic": "After a short time, Wei requested to form a vertical alliance.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "趙孝成王召虞卿謀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical.",
              "idiomatic": "King Xiaocheng of Zhao summoned Yu Qing to consult with him.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "過平原君，平原君曰：「願卿之論從也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical alliance.",
              "idiomatic": "Passing by Lord Pingyuan's residence, Lord Pingyuan said: 'I wish to hear your views on the alliance.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "虞卿入見王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing enter see wang.",
              "idiomatic": "Yu Qing entered and saw the king.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "王曰：「魏請為從。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: Wei request for vertical alliance.",
              "idiomatic": "The king said: 'Wei requests to form a vertical alliance.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "對曰：「魏過。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Answer: Wei wrong.",
              "idiomatic": "Yu Qing replied: 'Wei is mistaken.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "王曰：「寡人固未之許。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: My person solid not permit it.",
              "idiomatic": "The king said: 'I certainly have not permitted it.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0211",
          "zh": "對曰：「王過。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Answer: Wang wrong.",
              "idiomatic": "Yu Qing replied: 'Your Majesty is mistaken.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "王曰：「魏請從，卿曰魏過，寡人未之許，又曰寡人過，然則從終不可乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: Wei request vertical alliance, qing say Wei wrong, my person not permit it, again say my person wrong, then vertical alliance finally cannot?",
              "idiomatic": "The king said: 'Wei requests a vertical alliance. You say Wei is wrong. I have not permitted it, yet you say I am wrong. Then is a vertical alliance finally impossible?'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "對曰：「臣聞小國之與大國從事也，有利則大國受其福，有敗則小國受其禍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Answer: Minister hear small country with big country do affairs, have profit then big country receive its blessing, have defeat then small country receive its calamity.",
              "idiomatic": "Yu Qing replied: 'I have heard that when small states deal with large states, if there is profit then the large state receives the blessing, if there is defeat then the small state receives the calamity.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "今魏以小國請其禍，而王以大國辭其福，臣故曰王過，魏亦過。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now Wei with small country request its calamity, wang with big country decline its blessing, minister therefore say wang wrong, Wei also wrong.",
              "idiomatic": "Now Wei, as a small state, requests its own calamity, while Your Majesty, as a large state, declines its blessing. Therefore I say Your Majesty is wrong, and Wei is also wrong.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "竊以為從便。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Secret think vertical alliance convenient.",
              "idiomatic": "I humbly believe that forming the alliance would be advantageous.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "王曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wang say: Good.",
              "idiomatic": "The king said: 'Excellent.'",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "乃合魏為從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then unite Wei for vertical alliance.",
              "idiomatic": "Then they united with Wei in a vertical alliance.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Zhao Xiao Cheng Wang summon Yu Qing plan. Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical. Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical. Wang say: Wei request for vertical. Answer: Wei wrong. Wang say: My person solid not permit. Answer: Wang wrong. Answer: Wang wrong. Answer: Minister hear small country with big country do affairs, have profit then big country accept its blessing, have defeat then small country accept its calamity. Now Wei with small country request its calamity, wang with big country decline its blessing, minister therefore say wang wrong, Wei also wrong. Now Wei with small country request its calamity, wang with big country decline its blessing, minister therefore say wang wrong, Wei also wrong. Wang say: Good. Then unite Wei for vertical. Then unite Wei for vertical.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0218",
          "zh": "虞卿既以魏齊之故，不重萬戶侯卿相之印，與魏齊閒行，卒去趙，困於梁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing already because Wei Qi matter, not value ten thousand household marquis chancellor seal, with Wei Qi walk in secret, finally leave Zhao, distressed at Liang.",
              "idiomatic": "Yu Qing, because of Wei Qi's matter, did not value the seal of a marquis of ten thousand households or the position of chancellor. He secretly traveled with Wei Qi, finally left Zhao, and was distressed in Liang.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "魏齊已死，不得意，乃著書，上採春秋，下觀近世，曰節義、稱號、揣摩、政謀，凡八篇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wei Qi already die, not obtain intention, then write book, up collect Chun Qiu, down observe near world, say section righteousness, name number, measure probe, govern strategy, altogether eight scrolls.",
              "idiomatic": "After Wei Qi died and Yu Qing did not achieve his ambitions, he wrote a book, drawing from the Spring and Autumn Annals above and observing the recent world below, entitled Sections on Righteousness, Appellations, Assessment, and Political Strategy, in all eight scrolls.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0220",
          "zh": "以刺譏國家得失，世傳之曰虞氏春秋。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "With criticize mock states gain loss, world transmit it call Yu Shi Chun Qiu.",
              "idiomatic": "It criticized and satirized the gains and losses of states, and the world transmitted it as the Yu Family Spring and Autumn Annals.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Wei Qi already die, not obtain intention, then write book, up collect Chun Qiu, down observe near world, say section righteousness, name number, measure probe, govern strategy, altogether eight scrolls. Wei Qi already die, not obtain intention, then write book, up collect Chun Qiu, down observe near world, say section righteousness, name number, measure probe, govern strategy, altogether eight scrolls. Grand Historian say: Ping Yuan Jun, light light muddy age good duke son, yet not see big body.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0221",
          "zh": "太史公曰：平原君，翩翩濁世之佳公子也，然未睹大體。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grand Historian say: Ping Yuan Jun, graceful graceful muddy world good noble son, yet not see big body.",
              "idiomatic": "The Grand Historian says: Lord Pingyuan was a fine nobleman of graceful bearing in this troubled age, yet he did not perceive the larger picture.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "鄙語曰「利令智昏」，平原君貪馮亭邪說，使趙陷長平兵四十餘萬眾，邯鄲幾亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Low saying: Profit make intelligence dim, Ping Yuan Jun greedy Feng Ting evil speech, make Zhao trap Chang Ping troops forty more ten thousand crowd, Han Dan almost perish.",
              "idiomatic": "As the vulgar saying goes, 'Profit blinds the intellect.' Lord Pingyuan, greedy for Feng Ting's treacherous advice, caused Zhao to lose 400,000 troops at Changping, bringing Handan to the brink of destruction.",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "虞卿料事揣情，為趙畫策，何其工也！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yu Qing measure affairs probe emotion, for Zhao draw strategy, what its skillful!",
              "idiomatic": "Yu Qing assessed situations and gauged feelings, devising strategies for Zhao - how skillful he was!",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "及不忍魏齊，卒困於大梁，庸夫且知其不可，況賢人乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Reach not endure Wei Qi, finally distressed at big Liang, common man and know its not can, more worthy person?",
              "idiomatic": "When he could not bear to abandon Wei Qi and ended up distressed in Daliang - even a common fellow would know this was impossible, how much more so a worthy man?",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "然虞卿非窮愁，亦不能著書以自見於後世云。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Yet Yu Qing not poor sorrow, also not can write book self see at later world cloud.",
              "idiomatic": "Yet if Yu Qing had not been impoverished and sorrowful, he could not have written his book to make himself known to later generations.",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5",
          "literal": "Low speak: Profit make intelligence dim, Ping Yuan Jun greedy Feng Ting evil speak, make Zhao trap Chang Ping troops forty more ten thousand crowd, Han Dan almost perish. Yu Qing measure affairs probe emotion, for Zhao draw strategy, what its skillful! Reach not endure Wei Qi, finally distressed at big Liang, common man and know its not can, more worthy person? Yet Yu Qing not poor sorrow, also not can write book self see at later world. Yet Yu Qing not poor sorrow, also not can write book self see at later world cloud.",
          "idiomatic": null
        }
      ]
    }
  ]
}