{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "077",
    "url": "https://chinesenotes.com/shiji/shiji077.html",
    "title": {
      "zh": "魏公子列傳",
      "en": "Biographiy of the prince of Wei",
      "raw": "《魏公子列傳》 Biographiy of the prince of Wei"
    },
    "sentenceCount": 157,
    "translatedCount": 157,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:01.987Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "魏公子無忌者，魏昭王子少子而魏安釐王異母弟也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lord Xinling Wuji was King Zhao of Wei's youngest son and King Anli's half-brother.",
              "idiomatic": "Lord Xinling Wuji was the youngest son of King Zhao of Wei and the half-brother of King Anli of Wei."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "昭王薨，安釐王即位，封公子為信陵君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After King Zhao's death, King Anli ascended the throne and enfeoffed his brother as Lord Xinling.",
              "idiomatic": "When King Zhao died and King Anli ascended the throne, he enfeoffed the prince as Lord Xinling."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "是時范睢亡魏相秦，以怨魏齊故，秦兵圍大梁，破魏華陽下軍，走芒卯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time, Fan Sui had fled from Wei to serve as Chancellor of Qin, bearing resentment toward Wei Qi. Qin troops besieged Daliang, defeated Wei's army at Huayang, and routed Mang Mao.",
              "idiomatic": "At this time, Fan Sui had fled Wei to become Chancellor of Qin, driven by resentment toward Wei Qi. Qin forces besieged Daliang, crushed Wei's army at Huayang, and sent Mang Mao fleeing in defeat."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "魏王及公子患之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Both the King of Wei and the prince were deeply concerned.",
              "idiomatic": "The King of Wei and the prince were both deeply troubled by this."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0005",
          "zh": "公子為人仁而下士，士無賢不肖皆謙而禮交之，不敢以其富貴驕士。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince was naturally benevolent and respectful toward scholars. He treated all of them—worthy and unworthy alike—with humility and courtesy, never letting his wealth and status make him arrogant.",
              "idiomatic": "The prince was benevolent by nature and deferential toward scholars. Regardless of whether they were worthy or unworthy, he treated all with humility and courtesy, never allowing his wealth and nobility to make him arrogant toward them."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "士以此方數千里爭往歸之，致食客三千人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Word of this spread, and scholars from a thousand li around competed to join his service, bringing his total retainers to three thousand.",
              "idiomatic": "Because of this, scholars from regions several thousand li around vied with one another to come and serve him, swelling his retainers to three thousand men."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "當是時，諸侯以公子賢，多客，不敢加兵謀魏十餘年。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "During this period, the other lords considered the prince both virtuous and well-protected by his many retainers, and dared not attack or plot against Wei for over a decade.",
              "idiomatic": "At this time, the feudal lords considered the prince worthy and well-attended by retainers, so they did not dare attack or plot against Wei for more than ten years."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "公子與魏王博，而北境傳舉烽，言「趙寇至，且入界」。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince was playing liubo with the King of Wei when a messenger from the northern border lit the beacon, reporting: 'Zhao invaders are approaching and about to enter our territory.'",
              "idiomatic": "The prince was playing liubo with the King of Wei when a messenger from the northern border lit the beacon fires, reporting: 'Zhao invaders are approaching and about to cross our border.'"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "魏王釋博，欲召大臣謀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei put aside his game and wished to consult his ministers.",
              "idiomatic": "The King of Wei set down his game pieces and wished to summon his ministers for consultation."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "公子止王曰：「趙王田獵耳，非為寇也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince stopped the king and said: 'The King of Zhao is only hunting, not invading.'",
              "idiomatic": "The prince restrained the king and said: 'The King of Zhao is merely hunting, not invading.'"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "復博如故。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They picked up the game again as before.",
              "idiomatic": "They resumed their game as before."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "王恐，心不在博。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The king was frightened, and his thoughts were far from the game.",
              "idiomatic": "The king was fearful, his mind not on the game."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "居頃，復從北方來傳言曰：「趙王獵耳，非為寇也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After a short while, another messenger came from the north saying: 'The King of Zhao is only hunting, not invading.'",
              "idiomatic": "After a short while, another messenger came from the north saying: 'The King of Zhao is only hunting, not invading.'"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "魏王大驚，曰：「公子何以知之？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei was greatly astonished and said: 'How did you know this, my prince?'",
              "idiomatic": "The King of Wei was greatly astonished and said: 'How did you know this?'"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "公子曰：「臣之客有能深得趙王陰事者，趙王所為，客輒以報臣，臣以此知之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince replied: 'I have retainers who can obtain detailed information about the King of Zhao's private affairs. Whatever the King of Zhao does, my retainers immediately report it to me. This is how I know.'",
              "idiomatic": "The prince replied: 'Among my retainers there are those who can obtain detailed knowledge of the King of Zhao's private affairs. Whatever the King of Zhao does, my retainers immediately report to me. This is how I know.'"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "是後魏王畏公子之賢能，不敢任公子以國政。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After this, the King of Wei feared the prince's worthiness and abilities, and did not dare entrust him with governance of the state.",
              "idiomatic": "After this, the King of Wei feared the prince's wisdom and abilities, and did not dare entrust him with the governance of the state."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0017",
          "zh": "魏有隱士曰侯嬴，年七十，家貧，為大梁夷門監者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wei had a reclusive scholar named Hou Ying, aged seventy, poor in circumstances, who served as the gatekeeper of Daliang's Yi Gate.",
              "idiomatic": "There was a reclusive scholar in Wei named Hou Ying, seventy years old, living in poverty, who served as gatekeeper of the Yi Gate in Daliang."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "公子聞之，往請，欲厚遺之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince heard of him and went to invite him, wishing to bestow generous gifts upon him.",
              "idiomatic": "The prince heard of him and went to invite him, intending to give him generous gifts."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "不肯受，曰：「臣修身絜行數十年，終不以監門困故而受公子財。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He refused to accept, saying: 'I have cultivated my character and maintained purity in conduct for decades. I will never accept the prince's wealth just because of my poverty as a gatekeeper.'",
              "idiomatic": "He refused to accept, saying: 'For decades I have cultivated my character and maintained pure conduct. I will never accept the prince's wealth merely because poverty afflicts me as a gatekeeper.'"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "公子於是乃置酒大會賓客。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon the prince prepared wine and held a great gathering of his retainers.",
              "idiomatic": "Thereupon the prince prepared wine and hosted a grand gathering for his retainers."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "坐定，公子從車騎，虛左，自迎夷門侯生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When all were seated, the prince took his chariot and retinue, leaving the honored left seat empty, and personally went to welcome Master Hou of the Yi Gate.",
              "idiomatic": "Once everyone was seated, the prince took his chariot and escort, left the honored left seat empty, and personally went to welcome Master Hou from the Yi Gate."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "侯生攝敝衣冠，直上載公子上坐，不讓，欲以觀公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou adjusted his worn robes and cap, ascended directly and took the prince's upper seat without yielding, wishing to observe the prince's demeanor.",
              "idiomatic": "Master Hou straightened his worn robes and cap, ascended directly to take the prince's seat of honor without yielding, wishing to observe the prince's reaction."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "公子執轡愈恭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince held the reins with even greater deference.",
              "idiomatic": "The prince held the reins with even greater deference."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "侯生又謂公子曰：「臣有客在市屠中，願枉車騎過之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou then said to the prince: 'I have a friend among the butchers in the market. I wish you would trouble your chariot and retinue to pass by there.'",
              "idiomatic": "Master Hou then said to the prince: 'I have a friend among the butchers in the market. I hope you would be willing to have your chariot and escort pass by there.'"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "公子引車入市，侯生下見其客朱亥，俾倪故久立，與其客語，微察公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince drove his chariot into the market. Master Hou got down to see his friend Zhu Hai, deliberately standing for a long time while talking with his friend, carefully observing the prince's demeanor.",
              "idiomatic": "The prince drove his chariot into the market. Master Hou got down to visit his friend Zhu Hai, deliberately lingering in conversation to carefully observe the prince's demeanor."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "公子顏色愈和。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince's expression grew even more harmonious.",
              "idiomatic": "The prince's expression grew even more composed."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "當是時，魏將相宗室賓客滿堂，待公子舉酒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time, Wei's generals, ministers, royal clansmen, and guests filled the hall, waiting for the prince to raise his wine cup.",
              "idiomatic": "At this moment, Wei's generals, ministers, royal clansmen, and guests filled the hall, waiting for the prince to raise his wine cup."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "市人皆觀公子執轡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "All the people in the market watched the prince holding the reins.",
              "idiomatic": "All the people in the market watched the prince holding the reins."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "從騎皆竊罵侯生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "His escort attendants all secretly cursed Master Hou.",
              "idiomatic": "His escort attendants all secretly cursed Master Hou."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "侯生視公子色終不變，乃謝客就車。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Master Hou saw that the prince's expression remained unchanged to the end, he then took leave of his guest and boarded the chariot.",
              "idiomatic": "When Master Hou saw that the prince's expression remained unchanged throughout, he then took leave of his friend and boarded the chariot."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "至家，公子引侯生坐上坐，遍贊賓客，賓客皆驚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When they arrived home, the prince led Master Hou to the seat of honor, introduced him to all the guests, and the guests were all astonished.",
              "idiomatic": "Upon arriving home, the prince seated Master Hou in the place of honor and introduced him to all the guests, who were astonished."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "酒酣，公子起，為壽侯生前。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the wine flowed freely, the prince rose and offered a toast to Master Hou.",
              "idiomatic": "As the wine flowed freely, the prince rose and offered a toast before Master Hou."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "侯生因謂公子曰：「今日嬴之為公子亦足矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou then said to the prince: 'Today Ying has done enough for the prince.",
              "idiomatic": "Master Hou then said to the prince: 'Today Ying has done enough for you, my prince."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "嬴乃夷門抱關者也，而公子親枉車騎，自迎嬴於眾人廣坐之中，不宜有所過，今公子故過之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ying is merely the gatekeeper of the Yi Gate, yet the prince personally troubled his chariot and escort to welcome Ying from among the great gathering of people. It would not be fitting to have any shortcomings, yet the prince has deliberately exceeded proper bounds.",
              "idiomatic": "Ying is merely the gatekeeper of the Yi Gate, yet the prince personally troubled his chariot and escort to welcome me from among the great gathering of people. It would not be fitting to have any shortcomings, yet the prince has deliberately exceeded proper bounds."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "然嬴欲就公子之名，故久立公子車騎市中，過客以觀公子，公子愈恭。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "However, Ying wished to benefit from the prince's reputation, so I deliberately kept the prince's chariot and escort standing long in the market, letting passersby observe the prince, and the prince grew even more deferential.",
              "idiomatic": "However, Ying wished to benefit from the prince's reputation, so I deliberately kept the prince's chariot and escort standing long in the market, letting passersby observe the prince—and the prince grew even more deferential."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "市人皆以嬴為小人，而以公子為長者能下士也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "All the people in the market considered Ying a petty man, but considered the prince a noble person who could humble himself before scholars.'",
              "idiomatic": "All the people in the market considered Ying a petty man, but the prince a noble gentleman who could humble himself before scholars.'"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "於是罷酒，侯生遂為上客。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon the drinking ended, and Master Hou became a premier retainer.",
              "idiomatic": "Thereupon the drinking ended, and Master Hou became a premier retainer."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0038",
          "zh": "侯生謂公子曰：「臣所過屠者朱亥，此子賢者，世莫能知，故隱屠閒耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou said to the prince: 'The butcher I visited, Zhu Hai, is a worthy man. The world does not know his worth, so he hides among the butchers.'",
              "idiomatic": "Master Hou said to the prince: 'The butcher I visited, Zhu Hai, is a worthy man. The world cannot recognize his worth, so he hides among the butchers.'"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "公子往數請之，朱亥故不復謝，公子怪之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince went several times to invite him, but Zhu Hai deliberately did not respond. The prince found this strange.",
              "idiomatic": "The prince went several times to invite him, but Zhu Hai deliberately did not respond. The prince found this puzzling."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "魏安釐王二十年，秦昭王已破趙長平軍，又進兵圍邯鄲。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the twentieth year of King Anli of Wei, King Zhao of Qin had already defeated Zhao's army at Changping, and then advanced troops to besiege Handan.",
              "idiomatic": "In the twentieth year of King Anli of Wei, King Zhao of Qin had already defeated Zhao's army at Changping and then advanced his troops to besiege Handan."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "公子姊為趙惠文王弟平原君夫人，數遺魏王及公子書，請救於魏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince's elder sister was the wife of Lord Pingyuan, younger brother of King Huiwen of Zhao. She repeatedly sent letters to the King of Wei and the prince, requesting rescue from Wei.",
              "idiomatic": "The prince's elder sister was the wife of Lord Pingyuan, younger brother of King Huiwen of Zhao. She repeatedly sent letters to the King of Wei and the prince requesting rescue from Wei."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "魏王使將軍晉鄙將十萬眾救趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei sent General Jin Bi to lead a force of one hundred thousand to rescue Zhao.",
              "idiomatic": "The King of Wei sent General Jin Bi with a hundred thousand troops to rescue Zhao."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "秦王使使者告魏王曰：「吾攻趙旦暮且下，而諸侯敢救者，已拔趙，必移兵先擊之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qin sent an envoy to tell the King of Wei: 'I am attacking Zhao and will take it in a matter of days. Any feudal lord who dares rescue them—I will first destroy Zhao, then shift my troops to attack them.'",
              "idiomatic": "The King of Qin sent an envoy to tell the King of Wei: 'I am attacking Zhao and will take it any day now. Any feudal lord who dares to rescue them—I will first destroy Zhao, then shift my troops to attack them.'"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "魏王恐，使人止晉鄙，留軍壁鄴，名為救趙，實持兩端以觀望。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei was fearful, so he sent someone to stop Jin Bi, leaving the army encamped at Ye. In name it was to rescue Zhao, but in reality he sat on the fence, waiting to see what would happen.",
              "idiomatic": "The King of Wei was frightened, so he sent someone to halt Jin Bi, leaving the army encamped at Ye. In name it was to rescue Zhao, but in truth he hedged his bets and waited to see the outcome."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "平原君使者冠蓋相屬於魏，讓魏公子曰：「勝所以自附為婚姻者，以公子之高義，為能急人之困。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lord Pingyuan's envoys came one after another to Wei, reproaching the prince of Wei: 'The reason I allied myself in marriage with you was because of your noble righteousness, that you could relieve the distress of others.",
              "idiomatic": "Lord Pingyuan's envoys arrived in Wei one after another, upbraiding the prince of Wei: 'The reason I allied myself with you through marriage was because of your noble righteousness, your ability to relieve others' distress."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "今邯鄲旦暮降秦而魏救不至，安在公子能急人之困也！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Handan is about to surrender to Qin and Wei's rescue has not arrived. Where is the prince's ability to relieve others' distress!",
              "idiomatic": "Now Handan is about to fall to Qin and Wei's rescue has not come. Where is the prince's famed ability to relieve others' distress!"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "且公子縱輕勝，棄之降秦，獨不憐公子姊邪？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, even if the prince disdains me and abandons me to surrender to Qin, does he not pity his own sister?'",
              "idiomatic": "Moreover, even if the prince disdains me and abandons me to surrender to Qin, does he not pity his own elder sister?'"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "公子患之，數請魏王，及賓客辯士說王萬端。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince was deeply troubled and repeatedly petitioned the King of Wei, while his retainers and skilled debaters tried every possible argument to persuade the king.",
              "idiomatic": "The prince was deeply troubled and repeatedly petitioned the King of Wei, while his retainers and skilled debaters tried every possible persuasion on the king."
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "魏王畏秦，終不聽公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei, paralyzed by fear of Qin, ultimately refused to listen to the prince.",
              "idiomatic": "The King of Wei, terrified of Qin, ultimately refused to listen to the prince."
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "公子自度終不能得之於王，計不獨生而令趙亡，乃請賓客，約車騎百餘乘，欲以客往赴秦軍，與趙俱死。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince calculated that he would ultimately not obtain approval from the king, and resolved not to survive alone while allowing Zhao to perish. He therefore gathered his retainers and assembled over a hundred chariots and cavalry, intending to lead his retainers to confront the Qin army and die together with Zhao.",
              "idiomatic": "The prince calculated that he would never obtain the king's approval, and resolved not to survive alone while Zhao perished. He therefore gathered his retainers and assembled over a hundred chariots and cavalry, intending to lead his retainers against the Qin army and die together with Zhao."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0051",
          "zh": "行過夷門，見侯生，具告所以欲死秦軍狀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "On the way, passing through the Yi Gate, he saw Master Hou and fully explained his intention to die fighting the Qin army.",
              "idiomatic": "On the way, passing through the Yi Gate, he saw Master Hou and fully explained his intention to die fighting the Qin army."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "辭決而行，侯生曰：「公子勉之矣，老臣不能從。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Taking his leave and about to depart, Master Hou said: 'Do your best, my prince. This old minister cannot accompany you.'",
              "idiomatic": "Taking his leave and about to depart, Master Hou said: 'Do your best, my prince. This old minister cannot follow you.'"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "公子行數里，心不快，曰：「吾所以待侯生者備矣，天下莫不聞，今吾且死而侯生曾無一言半辭送我，我豈有所失哉？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince traveled several li, but his heart was uneasy. He said: 'My treatment of Master Hou has been complete, known throughout the world. Now I am about to die, yet Master Hou has not even sent me off with a single word or half a phrase. Have I perhaps done something wrong?'",
              "idiomatic": "The prince traveled several li, but his heart was uneasy. He said: 'My treatment of Master Hou has been exemplary, known throughout the world. Now I am about to die, yet Master Hou has not sent me off with even a single word or half a phrase. Have I perhaps done something wrong?'"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "復引車還，問侯生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He turned his chariot around again and questioned Master Hou.",
              "idiomatic": "He turned his chariot around again and questioned Master Hou."
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "侯生笑曰：「臣固知公子之還也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou smiled and said: 'I knew all along that the prince would return.'",
              "idiomatic": "Master Hou smiled and said: 'I knew all along that the prince would return.'"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "曰：「公子喜士，名聞天下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He said: 'The prince loves scholars, and his name is known throughout the world.",
              "idiomatic": "He said: 'The prince loves scholars, and his name is known throughout the world."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "今有難，無他端而欲赴秦軍，譬若以肉投餒虎，何功之有哉？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now that there is danger, without any other plan you wish to confront the Qin army. This is like throwing meat to a starving tiger—what achievement will there be?",
              "idiomatic": "Now that there is danger, without any other strategy you wish to confront the Qin army. This is like throwing meat to a starving tiger—what achievement will there be?"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "尚安事客？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Why bother with retainers?",
              "idiomatic": "Why bother maintaining retainers?"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "然公子遇臣厚，公子往而臣不送，以是知公子恨之復返也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "However, the prince has treated me generously. If the prince had gone and I had not sent him off, I knew the prince would resent it and return.'",
              "idiomatic": "However, the prince has treated me generously. If the prince had gone and I had not sent him off, I knew the prince would resent it and return.'"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "公子再拜，因問。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince bowed twice and then asked.",
              "idiomatic": "The prince bowed twice and then inquired."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "侯生乃屏人閒語，曰：「嬴聞晉鄙之兵符常在王臥內，而如姬最幸，出入王臥內，力能竊之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou then dismissed the others and spoke privately, saying: 'Ying has heard that General Jin Bi's army tally is always kept in the king's bedchamber, and Lady Ruji is most favored, able to enter and leave the king's bedchamber at will. She has the ability to steal it.",
              "idiomatic": "Master Hou then dismissed the others and spoke privately, saying: 'I have heard that General Jin Bi's army tally is always kept in the king's bedchamber, and Lady Ruji is most favored, able to enter and leave the king's bedchamber at will. She has the ability to steal it."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "嬴聞如姬父為人所殺，如姬資之三年，自王以下欲求報其父仇，莫能得。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Ying has heard that Lady Ruji's father was killed by someone, and Lady Ruji has been seeking revenge for three years. From the king downward, all have tried to find the killer for her, but none could succeed.",
              "idiomatic": "I have heard that Lady Ruji's father was killed by someone, and Lady Ruji has been seeking revenge for three years. From the king downward, all have tried to find the killer for her, but none could succeed."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "如姬為公子泣，公子使客斬其仇頭，敬進如姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Ruji wept before the prince, and the prince sent retainers to behead her enemy, presenting the head to her with great respect.",
              "idiomatic": "Lady Ruji wept before the prince, and the prince sent retainers to behead her enemy, presenting the head to her with great ceremony."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "如姬之欲為公子死，無所辭，顧未有路耳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Ruji wishes to die for the prince, and would refuse nothing. She merely lacks the opportunity.",
              "idiomatic": "Lady Ruji wishes to die for the prince, and would refuse nothing. She merely lacks the opportunity."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "公子誠一開口請如姬，如姬必許諾，則得虎符奪晉鄙軍，北救趙而西卻秦，此五霸之伐也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If the prince truly opens his mouth and asks Lady Ruji, she will certainly agree. Then you can obtain the tiger tally, seize General Jin Bi's army, rescue Zhao to the north and repel Qin to the west. This will be the campaign of the Five Hegemons.'",
              "idiomatic": "If the prince truly opens his mouth and asks Lady Ruji, she will certainly agree. Then you can obtain the tiger tally, seize General Jin Bi's army, rescue Zhao to the north and repel Qin to the west. This will be a campaign worthy of the Five Hegemons.'"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "公子從其計，請如姬。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince followed his plan and asked Lady Ruji.",
              "idiomatic": "The prince followed his plan and asked Lady Ruji."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "如姬果盜晉鄙兵符與公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lady Ruji indeed stole General Jin Bi's army tally and gave it to the prince.",
              "idiomatic": "Lady Ruji indeed stole General Jin Bi's army tally and gave it to the prince."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0068",
          "zh": "公子行，侯生曰：「將在外，主令有所不受，以便國家。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As the prince departed, Master Hou said: 'A general in the field may disregard the sovereign's orders when it benefits the state.",
              "idiomatic": "As the prince departed, Master Hou said: 'A general in the field may disregard the sovereign's orders when it benefits the state."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "公子即合符，而晉鄙不授公子兵而復請之，事必危矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If the prince immediately matches the tally, but General Jin Bi does not hand over the army to the prince and instead consults the king again, the matter will certainly be endangered.",
              "idiomatic": "If the prince immediately matches the tally, but General Jin Bi does not hand over the army to the prince and instead consults the king again, the matter will certainly be endangered."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "臣客屠者朱亥可與俱，此人力士。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Among my retainers, the butcher Zhu Hai can accompany you. He is a man of extraordinary strength.",
              "idiomatic": "Among my retainers, the butcher Zhu Hai can accompany you. He is a man of extraordinary strength."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "晉鄙聽，大善；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If Jin Bi obeys, that would be excellent;",
              "idiomatic": "If Jin Bi obeys, that would be excellent;"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "不聽，可使擊之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "if he does not obey, you can have Zhu Hai strike him down.'",
              "idiomatic": "if he does not obey, you can have Zhu Hai strike him down.'"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "於是公子泣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon the prince wept.",
              "idiomatic": "Thereupon the prince wept."
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "侯生曰：「公子畏死邪？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou said: 'Is the prince afraid of death?",
              "idiomatic": "Master Hou said: 'Is the prince afraid of death?"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "何泣也？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Why do you weep?'",
              "idiomatic": "Why do you weep?'"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "公子曰：「晉鄙嚄唶宿將，往恐不聽，必當殺之，是以泣耳，豈畏死哉？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince said: 'General Jin Bi is a veteran general of great prestige. I fear he will not obey when I go, and I will certainly have to kill him. That is why I weep. How could it be that I fear death?'",
              "idiomatic": "The prince said: 'General Jin Bi is a grizzled veteran commander. I fear he won't obey my orders when I arrive, and I'll have to kill him. That's why I'm weeping. How could I be afraid of death?'"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "於是公子請朱亥。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon the prince invited Zhu Hai.",
              "idiomatic": "So the prince invited Zhu Hai."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "朱亥笑曰：「臣乃市井鼓刀屠者，而公子親數存之，所以不報謝者，以為小禮無所用。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhu Hai smiled and said: 'I am merely a butcher wielding my knife in the marketplace, yet the prince has personally visited me several times. The reason I have not responded is that I considered small courtesies pointless.",
              "idiomatic": "Zhu Hai smiled and said: 'I'm just a butcher swinging my cleaver in the marketplace, yet the prince has personally come to see me several times. The reason I haven't replied is that I thought small gestures were unnecessary."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "今公子有急，此乃臣效命之秋也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now that the prince is in dire straits, this is the time for me to give my life.'",
              "idiomatic": "Now that the prince faces grave danger, this is my moment to sacrifice myself.'"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "遂與公子俱。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon he accompanied the prince.",
              "idiomatic": "So he went with the prince."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "公子過謝侯生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince passed by to take leave of Master Hou.",
              "idiomatic": "The prince stopped by to bid farewell to Master Hou."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "侯生曰：「臣宜從，老不能。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Master Hou said: 'I should accompany you, but I am too old.",
              "idiomatic": "Master Hou said: 'I ought to go with you, but I'm too old."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "請數公子行日，以至晉鄙軍之日，北鄉自剄，以送公子。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Please count the days of the prince's journey, and on the day he reaches General Jin Bi's army, I will face north and cut my own throat to send the prince off.'",
              "idiomatic": "Please count the days of your journey, and on the day you reach General Jin Bi's army, I will face north and slit my throat to see you off.'"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "公子遂行。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince thereupon departed.",
              "idiomatic": "The prince set out."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "至鄴，矯魏王令代晉鄙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Reaching Ye, he forged an order from the King of Wei to replace General Jin Bi.",
              "idiomatic": "When they reached Ye, he forged a command from the King of Wei ordering Jin Bi's replacement."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "晉鄙合符，疑之，舉手視公子曰：「今吾擁十萬之眾，屯於境上，國之重任，今單車來代之，何如哉？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Jin Bi matched the tally but was suspicious. He raised his hand and looked at the prince, saying: 'Now I command a hundred thousand troops encamped at the border, a heavy responsibility for the state. You come with a single chariot to replace me. What do you think of this?'",
              "idiomatic": "Jin Bi verified the tally but remained suspicious. He raised his hand and stared at the prince, saying: 'I command a hundred thousand troops stationed at the frontier—a critical responsibility for the state. You arrive with just a single chariot to take my place. What am I to make of this?'"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "欲無聽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He wished not to obey.",
              "idiomatic": "He intended to refuse."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "朱亥袖四十斤鐵椎，椎殺晉鄙，公子遂將晉鄙軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhu Hai concealed a forty-jin iron hammer in his sleeve and used it to strike down Jin Bi. The prince thereupon took command of Jin Bi's army.",
              "idiomatic": "Zhu Hai had hidden a forty-jin iron mace in his sleeve and used it to kill Jin Bi. The prince then assumed command of Jin Bi's army."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "勒兵下令軍中曰：「父子俱在軍中，父歸；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He reined in the troops and issued orders in the army: 'If father and son are both in the army, the father shall return home;",
              "idiomatic": "He rallied the troops and issued orders throughout the army: 'If both father and son are serving, the father shall return home;"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "兄弟俱在軍中，兄歸；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "if brothers are both in the army, the elder brother shall return home;",
              "idiomatic": "if both brothers are serving, the elder shall return home;"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "獨子無兄弟，歸養。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "if a man has only one son with no siblings, he shall return home to care for his parents.'",
              "idiomatic": "if a man has an only son with no brothers, he shall return home to care for his parents.'"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "得選兵八萬人，進兵擊秦軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He selected eight thousand elite troops and advanced to attack the Qin army.",
              "idiomatic": "He picked eight thousand of the best troops and marched against the Qin army."
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "秦軍解去，遂救邯鄲，存趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Qin army withdrew, and thus Handan was rescued and Zhao preserved.",
              "idiomatic": "The Qin army retreated, and Handan was saved, preserving Zhao."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "趙王及平原君自迎公子於界，平原君負ゆ矢為公子先引。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Zhao and Lord Pingyuan personally welcomed the prince at the border, with Lord Pingyuan carrying the crossbow and leading the way.",
              "idiomatic": "The King of Zhao and Lord Pingyuan came personally to welcome the prince at the border, with Lord Pingyuan carrying a crossbow and leading the procession."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "趙王再拜曰：「自古賢人未有及公子者也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Zhao bowed twice and said: 'Since ancient times, no worthy man has ever surpassed the prince.'",
              "idiomatic": "The King of Zhao bowed twice and said: 'Through all of history, no worthy man has ever equaled the prince.'"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "當此之時，平原君不敢自比於人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time, Lord Pingyuan did not dare compare himself to others.",
              "idiomatic": "At this moment, Lord Pingyuan dared not compare himself with anyone else."
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "公子與侯生決，至軍，侯生果北鄉自剄。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince took leave of Master Hou, and upon reaching the army, Master Hou indeed faced north and cut his own throat.",
              "idiomatic": "The prince bade farewell to Master Hou, and upon arriving at the army, Master Hou indeed faced north and slit his throat."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0098",
          "zh": "魏王怒公子之盜其兵符，矯殺晉鄙，公子亦自知也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei was furious that the prince had stolen his army tally and forged orders to kill Jin Bi, and the prince was well aware of this.",
              "idiomatic": "The King of Wei was enraged that the prince had stolen his army tally and forged orders to execute Jin Bi, and the prince knew it full well."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "已卻秦存趙，使將將其軍歸魏，而公子獨與客留趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Having already driven back Qin and preserved Zhao, he sent a general to lead the army back to Wei, while the prince alone remained in Zhao with his retainers.",
              "idiomatic": "Having repelled Qin and saved Zhao, he sent a general to lead the army back to Wei, while the prince stayed behind in Zhao with only his retainers."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "趙孝成王德公子之矯奪晉鄙兵而存趙，乃與平原君計，以五城封公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King Xiaocheng of Zhao, grateful that the prince had forged orders to seize Jin Bi's army and save Zhao, consulted with Lord Pingyuan and enfeoffed the prince with five cities.",
              "idiomatic": "King Xiaocheng of Zhao, grateful that the prince had forged orders to seize Jin Bi's army and save Zhao, consulted with Lord Pingyuan and granted the prince fiefdom over five cities."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "公子聞之，意驕矜而有自功之色。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the prince heard this, his heart grew arrogant and showed a self-satisfied expression.",
              "idiomatic": "When the prince heard this, pride swelled in his heart and showed on his face."
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "客有說公子曰：「物有不可忘，或有不可不忘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "One of his retainers advised the prince: 'Some things should not be forgotten, and others should not be remembered.",
              "idiomatic": "One of his retainers advised the prince: 'Some things must not be forgotten, and others must not be remembered."
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "夫人有德於公子，公子不可忘也；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If someone has shown kindness to the prince, the prince should not forget it;",
              "idiomatic": "If someone has shown kindness to you, my prince, you must not forget it;"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "公子有德於人，願公子忘之也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "if the prince has shown kindness to someone, I hope the prince will forget it.",
              "idiomatic": "if you, my prince, have shown kindness to someone, I hope you will forget it."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "且矯魏王令，奪晉鄙兵以救趙，於趙則有功矣，於魏則未為忠臣也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, forging the King of Wei's orders and seizing Jin Bi's army to save Zhao—toward Zhao this was meritorious, but toward Wei it was not the conduct of a loyal minister.'",
              "idiomatic": "Moreover, forging the King of Wei's orders and seizing Jin Bi's army to save Zhao—this brought merit to Zhao, but toward Wei it was not the act of a loyal minister.'"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "公子乃自驕而功之，竊為公子不取也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince then took pride in this and credited it to his own merit. I secretly thought this inappropriate for the prince.'",
              "idiomatic": "The prince grew proud and took credit for the achievement. I secretly considered this unbecoming for him.'"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "於是公子立自責，似若無所容者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon the prince immediately reproached himself, as if he could find no place to hide.",
              "idiomatic": "Thereupon the prince immediately reproached himself, as if he had nowhere to hide in shame."
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "趙王埽除自迎，執主人之禮，引公子就西階。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Zhao swept clean the hall and personally welcomed him, performing the rites of a host and leading the prince to the western steps.",
              "idiomatic": "The King of Zhao swept and cleaned the hall himself to welcome the prince, performed the rites of a host, and led the prince to the western steps."
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "公子側行辭讓，從東階上。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince walked sideways in refusal, ascending by the eastern steps.",
              "idiomatic": "The prince walked sideways in humble refusal, ascending by the eastern steps."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "自言罪過，以負於魏，無功於趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He spoke of his own guilt, saying he had wronged Wei and had no merit toward Zhao.",
              "idiomatic": "He spoke of his own offenses, saying he had betrayed Wei and brought no benefit to Zhao."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "趙王侍酒至暮，口不忍獻五城，以公子退讓也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Zhao served wine until evening, and could not bring himself to offer the five cities, because of the prince's humility.",
              "idiomatic": "The King of Zhao served wine until evening fell, but could not bring himself to offer the five cities because of the prince's modesty."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "公子竟留趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the end, the prince remained in Zhao.",
              "idiomatic": "In the end, the prince stayed in Zhao."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "趙王以鄗為公子湯沐邑，魏亦復以信陵奉公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Zhao granted Xiang as the prince's bathing city, and Wei also restored Xinling to support the prince.",
              "idiomatic": "The King of Zhao granted Xiang as the prince's fief for bathing revenues, and Wei also restored Xinling to provide for the prince."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "公子留趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince remained in Zhao.",
              "idiomatic": "The prince remained in Zhao."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "公子聞趙有處士毛公藏於博徒，薛公藏於賣漿家，公子欲見兩人，兩人自匿不肯見公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince heard that Zhao had reclusive scholars: Mao Gong hiding among the gamblers, Xue Gong hiding among the wine sellers. The prince wished to meet these two men, but they hid themselves and refused to see the prince.",
              "idiomatic": "The prince heard that Zhao had two reclusive scholars: Mao Gong hiding among gamblers, Xue Gong hiding among wine sellers. The prince wished to meet them, but they concealed themselves and refused to see him."
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "公子聞所在，乃閒步往從此兩人游，甚歡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the prince learned their whereabouts, he strolled casually to visit these two men and associate with them, finding great pleasure in it.",
              "idiomatic": "When the prince learned where they were, he strolled casually to visit these two men and spend time with them, finding great joy in their company."
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "平原君聞之，謂其夫人曰：「始吾聞夫人弟公子天下無雙，今吾聞之，乃妄從博徒賣漿者游，公子妄人耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Lord Pingyuan heard this, he said to his wife: 'At first I heard that your younger brother the prince was unmatched in the world. Now I hear he casually associates with gamblers and wine sellers. The prince is merely a fool.'",
              "idiomatic": "When Lord Pingyuan heard this, he said to his wife: 'At first I heard that your younger brother the prince was peerless in the world. Now I hear he casually associates with gamblers and wine sellers. The prince is just a madman.'"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "夫人以告公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The lady told this to the prince.",
              "idiomatic": "His sister told this to the prince."
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "公子乃謝夫人去，曰：「始吾聞平原君賢，故負魏王而救趙，以稱平原君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince then took leave of the lady and departed, saying: 'At first I heard that Lord Pingyuan was worthy, so I betrayed the King of Wei and saved Zhao to match Lord Pingyuan.",
              "idiomatic": "The prince then took leave of his sister and departed, saying: 'At first I heard that Lord Pingyuan was worthy, so I betrayed the King of Wei and saved Zhao to live up to Lord Pingyuan."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "平原君之游，徒豪舉耳，不求士也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lord Pingyuan's associations are merely the extravagant gestures of a nobleman, not the seeking of true scholars.'",
              "idiomatic": "Lord Pingyuan's associations are merely the extravagant displays of a wealthy lord, not the true seeking of scholars.'"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "無忌自在大梁時，常聞此兩人賢，至趙，恐不得見。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Wuji, while he was still in Daliang, had often heard that these two men were worthy. When he arrived in Zhao, he feared he would not be able to meet them.",
              "idiomatic": "While still in Daliang, I often heard these two men were worthy scholars. When I arrived in Zhao, I feared I would never meet them."
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "以無忌從之游，尚恐其不我欲也，今平原君乃以為羞，其不足從游。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That Wuji would associate with them, I still feared they might not want me. Now Lord Pingyuan considers it shameful—their worthiness is not worth associating with.'",
              "idiomatic": "That I would seek their company, I still feared they might reject me. Now Lord Pingyuan considers it shameful—their worthiness is not worth pursuing.'"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "乃裝為去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He then prepared to leave.",
              "idiomatic": "He then packed to leave."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "夫人具以語平原君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The lady fully explained this to Lord Pingyuan.",
              "idiomatic": "His sister fully explained this to Lord Pingyuan."
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "平原君乃免冠謝，固留公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lord Pingyuan then removed his cap in apology and firmly urged the prince to stay.",
              "idiomatic": "Lord Pingyuan then removed his cap in apology and insisted that the prince stay."
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "平原君門下聞之，半去平原君歸公子，天下士復往歸公子，公子傾平原君客。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Lord Pingyuan's retainers heard this, half of them left Lord Pingyuan and went to the prince. Scholars from throughout the world again came to serve the prince, and the prince eclipsed Lord Pingyuan's retainers.",
              "idiomatic": "When Lord Pingyuan's retainers heard this, half left him to join the prince. Scholars from throughout the world once again came to serve the prince, and the prince overshadowed Lord Pingyuan's following."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0127",
          "zh": "公子留趙十年不歸。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince remained in Zhao for ten years without returning.",
              "idiomatic": "The prince stayed in Zhao for ten years without returning home."
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "秦聞公子在趙，日夜出兵東伐魏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin, hearing that the prince was in Zhao, day and night sent troops east to attack Wei.",
              "idiomatic": "Qin, learning that the prince was in Zhao, sent troops east to attack Wei day and night."
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "魏王患之，使使往請公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei was troubled by this and sent envoys to invite the prince back.",
              "idiomatic": "The King of Wei was deeply concerned and sent envoys to invite the prince back."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "公子恐其怒之，乃誡門下：「有敢為魏王使通者，死。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince feared the king's anger, so he warned his retainers: 'Anyone who dares to act as intermediary for the King of Wei's envoys will be put to death.'",
              "idiomatic": "The prince feared the king's wrath, so he warned his retainers: 'Anyone who dares to communicate with the King of Wei's envoys will be executed.'"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "賓客皆背魏之趙，莫敢勸公子歸。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "His retainers all turned their backs on Wei and sided with Zhao, and none dared urge the prince to return.",
              "idiomatic": "His retainers all abandoned Wei for Zhao, and none dared advise the prince to return."
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "毛公、薛公兩人往見公子曰：「公子所以重於趙，名聞諸侯者，徒以有魏也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Mao Gong and Xue Gong went to see the prince and said: 'The reason the prince is honored in Zhao and famous among the feudal lords is merely because he has Wei.",
              "idiomatic": "Mao Gong and Xue Gong went to see the prince and said: 'The reason the prince is honored in Zhao and renowned among the feudal lords is simply because he has Wei as his base."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "今秦攻魏，魏急而公子不恤，使秦破大梁而夷先王之宗廟，公子當何面目立天下乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Qin attacks Wei, Wei is in dire straits but the prince does not care. If Qin destroys Daliang and razes the ancestral temples of the former kings, with what face will the prince stand in the world?'",
              "idiomatic": "Now Qin attacks Wei, and Wei is in desperate straits, yet the prince shows no concern. If Qin destroys Daliang and razes the ancestral temples of the former kings, with what face will the prince stand before the world?'"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "語未及卒，公子立變色，告車趣駕歸救魏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Their words were not yet finished when the prince's face changed color. He ordered his chariot harnessed quickly to return and save Wei.",
              "idiomatic": "Their words were not yet finished when the prince's face changed color. He ordered his chariot harnessed quickly and returned to save Wei."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "魏王見公子，相與泣，而以上將軍印授公子，公子遂將。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei saw the prince, and they wept together. The king then bestowed the seal of General-in-Chief upon the prince, and the prince took command.",
              "idiomatic": "The King of Wei saw the prince, and they wept together. The king bestowed the seal of General-in-Chief upon the prince, and the prince took command."
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "魏安釐王三十年，公子使使遍告諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the thirtieth year of King Anli of Wei, the prince sent envoys to inform all the feudal lords.",
              "idiomatic": "In the thirtieth year of King Anli of Wei, the prince sent envoys to notify all the feudal lords."
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "諸侯聞公子將，各遣將將兵救魏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the feudal lords heard that the prince was commanding, each sent generals with troops to rescue Wei.",
              "idiomatic": "When the feudal lords heard the prince was in command, each sent generals leading troops to rescue Wei."
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "公子率五國之兵破秦軍於河外，走蒙驁。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince led the troops of five states and defeated the Qin army north of the Yellow River, routing Meng Ao.",
              "idiomatic": "The prince led troops from five states and defeated the Qin army north of the Yellow River, sending Meng Ao fleeing in defeat."
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "遂乘勝逐秦軍至函谷關，抑秦兵，秦兵不敢出。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He then pressed the advantage and pursued the Qin army to the Hangu Pass, containing Qin forces so they dared not emerge.",
              "idiomatic": "He then pressed his advantage and pursued the Qin army to the Hangu Pass, pinning down Qin forces so they dared not emerge."
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "當是時，公子威振天下，諸侯之客進兵法，公子皆名之，故世俗稱魏公子兵法。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "At this time, the prince's prestige shook the world. When retainers of the feudal lords presented military treatises, the prince titled them all, hence the common saying 'The Prince of Wei's Military Treatises.'",
              "idiomatic": "At this time, the prince's prestige shook the world. When retainers of the feudal lords presented military treatises to him, the prince titled them all, hence the popular saying 'The Prince of Wei's Military Treatises.'"
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0141",
          "zh": "秦王患之，乃行金萬斤於魏，求晉鄙客，令毀公子於魏王曰：「公子亡在外十年矣，今為魏將，諸侯將皆屬，諸侯徒聞魏公子，不聞魏王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qin was troubled by this, so he sent ten thousand jin of gold to Wei to buy Jin Bi's retainers, ordering them to slander the prince to the King of Wei: 'The prince has been in exile for ten years. Now that he is commander of Wei's army, all the generals of the feudal lords subordinate themselves to him. The feudal lords only know of the Prince of Wei, not the King of Wei.",
              "idiomatic": "The King of Qin was troubled by this, so he sent ten thousand jin of gold to Wei to bribe Jin Bi's retainers, ordering them to slander the prince to the King of Wei: 'The prince has been in exile for ten years. Now that he commands Wei's army, all the generals of the feudal lords subordinate themselves to him. The feudal lords know only the Prince of Wei, not the King of Wei."
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "公子亦欲因此時定南面而王，諸侯畏公子之威，方欲共立之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince also wishes to use this opportunity to establish himself as king facing south. The feudal lords fear the prince's might and are about to jointly establish him as king.'",
              "idiomatic": "The prince also wishes to use this opportunity to establish himself as king. The feudal lords fear the prince's might and are about to jointly enthrone him.'"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "秦數使反閒，偽賀公子得立為魏王未也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin repeatedly sent double agents, falsely congratulating the prince on his imminent establishment as King of Wei.",
              "idiomatic": "Qin repeatedly sent double agents, falsely congratulating the prince on his impending enthronement as King of Wei."
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "魏王日聞其毀，不能不信，後果使人代公子將。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Wei heard these slanders day after day and could not help but believe them. Later he indeed sent someone to replace the prince as commander.",
              "idiomatic": "The King of Wei heard these slanders day after day and could not help but believe them. Later he indeed sent someone to replace the prince as commander."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "公子自知再以毀廢，乃謝病不朝，與賓客為長夜飲，飲醇酒，多近婦女。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The prince knew he had been dismissed again through slander, so he pleaded illness and did not attend court. He drank with his retainers through the long nights, drinking strong wine and keeping many women close.",
              "idiomatic": "The prince knew he had been dismissed again through slander, so he pleaded illness and ceased attending court. He drank with his retainers through the long nights, consuming strong wine and keeping many women near."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "日夜為樂飲者四歲，竟病酒而卒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "For four years he indulged in pleasure and drinking day and night, and finally died from alcohol-related illness.",
              "idiomatic": "For four years he indulged in pleasure and drinking day and night, and finally died from drink-related illness."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "其歲，魏安釐王亦薨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In that year, King Anli of Wei also died.",
              "idiomatic": "In that year, King Anli of Wei also passed away."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "秦聞公子死，使蒙驁攻魏，拔二十城，初置東郡。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin, hearing of the prince's death, sent Meng Ao to attack Wei, capturing twenty cities and establishing the Eastern Commandery for the first time.",
              "idiomatic": "Qin, learning of the prince's death, sent Meng Ao to attack Wei, capturing twenty cities and establishing the Eastern Commandery for the first time."
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "其後秦稍蠶食魏，十八歲而虜魏王，屠大梁。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereafter Qin gradually encroached upon Wei, and after eighteen years captured the King of Wei and massacred Daliang.",
              "idiomatic": "Thereafter Qin gradually nibbled away at Wei, and after eighteen years captured the King of Wei and slaughtered Daliang."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0150",
          "zh": "高祖始微少時，數聞公子賢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When Gaozu was still humble and young, he often heard that the prince was worthy.",
              "idiomatic": "When Gaozu was still of humble and lowly station, he often heard that the prince was worthy."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "及即天子位，每過大梁，常祠公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When he ascended the imperial throne, whenever he passed through Daliang, he would always offer sacrifices to the prince.",
              "idiomatic": "When he ascended the imperial throne, whenever he passed through Daliang, he would always make offerings to the prince."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "高祖十二年，從擊黥布還，為公子置守冢五家，世世歲以四時奉祠公子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the twelfth year of Gaozu's reign, upon returning from the campaign against Qing Bu, he established five families to tend the prince's tomb, with each generation offering seasonal sacrifices to the prince.",
              "idiomatic": "In the twelfth year of Gaozu's reign, upon returning from the campaign against Qing Bu, he established five families to guard the prince's tomb, with each generation offering seasonal sacrifices to the prince year after year."
            }
          ]
        }
      ],
      "translations": []
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0153",
          "zh": "太史公曰：吾過大梁之墟，求問其所謂夷門。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Grand Historian says: I passed through the ruins of Daliang and inquired about what was called the Yi Gate.",
              "idiomatic": "The Grand Historian says: I passed through the ruins of Daliang and asked about what was called the Yi Gate."
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "夷門者，城之東門也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Yi Gate is the city's east gate.",
              "idiomatic": "The Yi Gate is the city's eastern gate."
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "天下諸公子亦有喜士者矣，然信陵君之接巖穴隱者，不恥下交，有以也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Though the world's princes also have those who love scholars, Lord Xinling's reception of hermits from rocky caves, not ashamed to associate with inferiors, has good reason.",
              "idiomatic": "Though other princes in the world also delight in worthy men, Lord Xinling's willingness to receive recluses from mountain caves and not disdain humble associations has its reasons."
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "名冠諸侯，不虛耳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "His name crowns the feudal lords, not in vain.",
              "idiomatic": "His reputation stands above all the feudal lords—and justly so."
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "高祖每過之而令民奉祠不絕也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Whenever Gaozu passed through, he commanded the people to maintain the sacrifices without interruption.",
              "idiomatic": "Whenever Gaozu passed through, he commanded the people to maintain the sacrifices without interruption."
            }
          ]
        }
      ],
      "translations": []
    }
  ]
}