{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "087",
    "url": "https://chinesenotes.com/shiji/shiji087.html",
    "title": {
      "zh": "李斯列傳",
      "en": "Biography of Li Si",
      "raw": "《李斯列傳》 Biography of Li Si"
    },
    "sentenceCount": 409,
    "translatedCount": 409,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:13.789Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "李斯者，楚上蔡人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si was a man of Shangcai in Chu."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "年少時，為郡小吏，見吏舍廁中鼠食不絜，近人犬，數驚恐之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When young, he served as a minor official in the commandery, saw that rats in the office latrine ate unclean things, being near people and dogs, were frequently startled and frightened by them."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "斯入倉，觀倉中鼠，食積粟，居大廡之下，不見人犬之憂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si entered the granary, observed that the rats there ate stored grain, dwelt beneath the great eaves, did not see worries about people and dogs."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "於是李斯乃嘆曰：「人之賢不肖譬如鼠矣，在所自處耳！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon Li Si sighed and said: 'People's worthiness or unworthiness is like rats - it depends on where they place themselves!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Li Si was a person from Shangcai in Chu. Young time, was county petty official, saw official residence toilet rat eat unclean things, near people dogs, repeatedly frightened by them. Si entered granary, observed granary rats, eat stored grain, dwell great house below, not see people dogs worry. Thus Li Si then sighed: 'Person's worthy unworthy like rats, in where self-place!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0006",
          "zh": "乃從荀卿學帝王之術。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Then he studied the arts of rulership under Xun Qing."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "學已成，度楚王不足事，而六國皆弱，無可為建功者，欲西入秦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Studies already complete, he assessed that the King of Chu was not worth serving, and the six states were all weak, with none offering opportunity to establish merit, desired to go west to enter Qin."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "辭於荀卿曰：「斯聞得時無怠，今萬乘方爭時，游者主事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He took leave of Xun Qing, saying: 'I have heard that when opportunity comes, one must not delay. Now is the time when ten-thousand chariot states are contending, and itinerant persuaders hold the reins of affairs.'"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "今秦王欲吞天下，稱帝而治，此布衣馳騖之時而游說者之秋也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now the King of Qin wishes to swallow the world, establish himself as emperor and govern - this is the time for commoners to gallop forward and the season for persuaders to roam."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "處卑賤之位而計不為者，此禽鹿視肉，人面而能閒行者耳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those who remain in lowly positions and do not plot action are like birds and deer that see meat but wear human faces while being able to stroll idly."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "故詬莫大於卑賤，而悲莫甚於窮困。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore, no disgrace is greater than lowly status, and no sorrow is deeper than poverty and hardship."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "久處卑賤之位，困苦之地，非世而惡利，自託於無為，此非士之情也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "To long dwell in lowly positions and places of hardship, to reject the world and despise profit, to entrust oneself to inaction - this is not the nature of a gentleman."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "故斯將西說秦王矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore, I will go west to persuade the King of Qin.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus followed Xun Qing study emperor king methods. Study already complete, measured Chu king not sufficient serve, six states all weak, no can establish merit, wished west enter Qin. Took leave Xun Qing: 'Si heard get time no lazy, now ten thousand chariot contending time, travelers master affairs. Now Qin king wishes swallow world, call emperor govern, this common clothes gallop time wandering persuaders autumn. Dwell low base position plan not do, this bird deer see meat, person face can leisurely walk. Thus curse none greater low base, sorrow none more poor distress. Long dwell low base position, poor distress place, not world evil profit, self-entrust no action, this not scholar sentiment. Thus Si will west persuade Qin king.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0015",
          "zh": "至秦，會莊襄王卒，李斯乃求為秦相文信侯呂不韋舍人；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Arriving in Qin, he encountered the death of King Zhuangxiang, so Li Si sought to become a retainer of Lü Buwei, Chancellor of Qin and Marquis Wenxin;"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "不韋賢之，任以為郎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Lü Buwei valued him, appointed him as a gentleman-attendant."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "李斯因以得說，說秦王曰：「胥人者，去其幾也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si thus gained opportunity to speak, spoke to the King of Qin, saying: 'As for ferrymen, they remove the oars.'"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "成大功者，在因瑕釁而遂忍之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those who achieve great deeds do so by exploiting weaknesses and seeing ruthlessness through to completion."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "昔者秦穆公之霸，終不東并六國者，何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In former times, when Duke Mu of Qin achieved hegemony, why did he ultimately not annex the six eastern states to the east?"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "諸侯尚眾，周德未衰，故五伯迭興，更尊周室。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The feudal lords were still numerous, the Zhou virtue had not yet declined, therefore the Five Hegemons rose in succession, taking turns to honor the Zhou house."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "自秦孝公以來，周室卑微，諸侯相兼，關東為六國，秦之乘勝役諸侯，蓋六世矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Since Duke Xiao of Qin, the Zhou house has been humble, the feudal lords have annexed each other, east of the passes they became six states, Qin has been victorious over and made the feudal lords serve it, for six generations now."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "今諸侯服秦，譬若郡縣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now the feudal lords submit to Qin, like prefectures and counties."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "夫以秦之彊，大王之賢，由灶上騷除，足以滅諸侯，成帝業，為天下一統，此萬世之一時也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "With Qin's strength and Your Majesty's wisdom, sweeping away the feudal lords would be as easy as brushing dust from a stove, sufficient to destroy the feudal lords, complete the imperial enterprise, unify the world under one rule—this is a once-in-ten-thousand-generations opportunity."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "今怠而不急就，諸侯復彊，相聚約從，雖有黃帝之賢，不能并也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now if we delay and do not quickly seize it, the feudal lords will grow strong again, gather together in alliances, even with the wisdom of the Yellow Emperor, we cannot annex them.'"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "秦王乃拜斯為長史，聽其計，陰遣謀士齎持金玉以游說諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qin then appointed Li Si as Chief Clerk, listened to his plans, secretly dispatched counselors bearing gold and jade to persuade the feudal lords."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "諸侯名士可下以財者，厚遺結之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "For the famous scholars of the feudal lords who could be brought down with wealth, he richly gifted them and bound them to Qin;"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "不肯者，利劍刺之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those who refused, he had assassinated with sharp swords."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "離其君臣之計，秦王乃使其良將隨其後。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After sowing discord in their ruler-minister relationships, the King of Qin sent his good generals to follow up."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "秦王拜斯為客卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qin appointed Li Si as Guest Minister."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Reached Qin, met Zhuangxiang Wang died, Li Si then sought be Qin chancellor Wenxin Hou Lü Buwei retainer; Buwei considered worthy, employed as lang. Li Si thus got persuade, persuaded Qin king: 'Wait person, remove their sprouts. Complete great merit, in take advantage flaws continue bear. Former Qin Mu Gong hegemony, end not east unite six states, why? Feudal lords still many, Zhou virtue not decline, thus five hegemons alternated rise, more honored Zhou room. Self Qin Xiao Gong since, Zhou room low small, feudal lords mutually annexed, pass east six states, Qin take victory serve feudal lords, cover six generations. Now feudal lords submit Qin, like prefecture county. With Qin strong, great king worthy, by stove sweep away, sufficient extinguish feudal lords, complete emperor enterprise, make world unite, this ten thousand generations one time. Now lazy not urgently pursue, feudal lords again strong, mutually gather alliance, though have Yellow Emperor worthiness, cannot unite.' Qin king then appointed Si long shi, listened his plan, secretly sent strategists carry hold gold jade wandering persuade feudal lords. Feudal lords famous scholars can lower with wealth, thick gifts bind them; Not willing, sharp sword stab them. Separate their lord minister plans, Qin king then made his good generals follow after. Qin king appointed Si guest minister.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0030",
          "zh": "會韓人鄭國來閒秦，以作注溉渠，已而覺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "It happened that Zheng Guo from Han came to sow discord in Qin by proposing to build an irrigation canal, but afterward this was discovered."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "秦宗室大臣皆言秦王曰：「諸侯人來事秦者，大抵為其主游閒於秦耳，請一切逐客。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "All the Qin nobles and ministers spoke to the King of Qin: 'People from the feudal states who come to serve Qin generally do so as spies for their lords in Qin, we request to expel all such guests.'"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "李斯議亦在逐中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si's name was also included among those to be expelled."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "斯乃上書曰：",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si then submitted a memorial saying:"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Met Han person Zheng Guo come spy Qin, to make irrigation canal, afterward aware. Qin clan chamber ministers all spoke Qin king: 'Feudal lords people come serve Qin, generally for their lord wandering spy Qin, please all expel guests.' Li Si discussion also in expel among. Si then submitted letter:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "臣聞吏議逐客，竊以為過矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I have heard that the officials are discussing expelling the guests, and I privately consider it a mistake."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "昔繆公求士，西取由余於戎，東得百里奚於宛，迎蹇叔於宋，來丕豹、公孫支於晉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In former times, Duke Mu sought worthy men, taking You Yu from the Rong in the west, obtaining Baili Xi from Wan in the east, welcoming Jian Shu from Song, bringing Pi Bao and Gongsun Zhi from Jin."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "此五子者，不產於秦，而繆公用之，并國二十，遂霸西戎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "These five men were not produced in Qin, but Duke Mu employed them, annexed twenty states, and achieved hegemony over the Western Rong."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "孝公用商鞅之法，移風易俗，民以殷盛，國以富彊，百姓樂用，諸侯親服，獲楚、魏之師，舉地千里，至今治彊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Duke Xiao employed Shang Yang's laws, transformed customs and mores, the people became prosperous and numerous, the state wealthy and strong, the common people gladly served, the feudal lords submitted willingly, defeated the armies of Chu and Wei, gained a thousand li of territory, and to this day remains orderly and strong."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "惠王用張儀之計，拔三川之地，西并巴、蜀，北收上郡，南取漢中，包九夷，制鄢、郢，東據成皋之險，割膏腴之壤，遂散六國之從，使之西面事秦，功施到今。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King Hui employed Zhang Yi's strategies, seized the lands of the Three Rivers, annexed Ba and Shu to the west, took Shangjun to the north, seized Hanzhong to the south, encompassed the Nine Yi tribes, controlled Yan and Ying, occupied the strategic pass at Chenggao to the east, carved out fertile lands, thereby breaking up the alliances of the six states, making them face west and serve Qin, benefits extending to the present day."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "昭王得范睢，廢穰侯，逐華陽，彊公室，杜私門，蠶食諸侯，使秦成帝業。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "King Zhao obtained Fan Sui, deposed the Marquis of Rang, expelled the Lord of Huayang, strengthened the royal court, blocked private influence, gradually encroached on the feudal lords, enabling Qin to complete the imperial enterprise."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "此四君者，皆以客之功。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "These four rulers all achieved success through guests."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "由此觀之，客何負於秦哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "From this perspective, what harm have guests done to Qin?"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "向使四君卻客而不內，疏士而不用，是使國無富利之實而秦無彊大之名也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If those four rulers had rejected guests and not admitted them, distanced themselves from worthy men and not employed them, this would have left the state without substantial wealth and prosperity, and Qin without its reputation for strength and greatness."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Minister heard officials discuss expel guests, secretly considered wrong. Former Mu Gong sought scholars, west took You Yu from Rong, east got Baili Xi from Wan, welcomed Jian Shu from Song, came Pi Bao, Gongsun Zhi from Jin. These five persons, not born in Qin, yet Mu Gong used them, united twenty states, thus hegemoned west Rong. Xiao Gong used Shang Yang methods, moved customs changed habits, people with flourishing prosperous, state with rich strong, hundred surnames happy use, feudal lords intimate submit, obtained Chu, Wei armies, took land thousand li, to now govern strong. Hui Wang used Zhang Yi plan, pulled three streams land, west united Ba, Shu, north took Shang commandery, south took Han middle, included nine Yi, controlled Yan, Ying, east occupied Cheng Gao dangers, cut fertile rich soil, thus scattered six states alliance, made them west face serve Qin, merit extended to now. Zhao Wang got Fan Sui, abolished Rang Hou, expelled Hua Yang, strengthened public chamber, blocked private gates, nibbled feudal lords, made Qin complete emperor enterprise. These four lords, all with guests merit. From this see, guests what owe Qin! If made four lords reject guests not admit, distant scholars not use, this made state no rich profit substance yet Qin no strong great name.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "今陛下致昆山之玉，有隨、和之寶，垂明月之珠，服太阿之劍，乘纖離之馬，建翠鳳之旗，樹靈鼉之鼓。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Your Majesty has obtained jade from Mount Kun, possesses the treasures of Sui and He, hangs moon-bright pearls, wears the Tai'e sword, rides the Xianli horses, flies banners with kingfisher-feathered phoenixes, sets up drums with spirit-alligator skins."
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "此數寶者，秦不生一焉，而陛下說之，何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "None of these several treasures are produced in Qin, yet Your Majesty delights in them. Why is that?"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "必秦國之所生然後可，則是夜光之璧不飾朝廷，犀象之器不為玩好，鄭、衛之女不充後宮，而駿良駃騠不實外廄，江南金錫不為用，西蜀丹青不為采。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If it must be that only what is produced in Qin is acceptable, then luminous jade would not adorn the court, rhinoceros and ivory vessels would not be made into luxuries, women from Zheng and Wei would not fill the rear palace, fine horses like the Julu would not fill the outer stables, gold and tin from south of the Jiang would not be used, cinnabar and azurite from Western Shu would not be gathered."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "所以飾後宮充下陳娛心意說耳目者，必出於秦然後可，則是宛珠之簪，傅璣之珥，阿縞之衣，錦繡之飾不進於前，而隨俗雅化佳冶窈窕趙女不立於側也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If it must be that only what comes from Qin is acceptable for adorning the rear palace, filling the lower ranks, delighting the heart, and pleasing the eyes, then pearl hairpins from Wan, jade earrings from Fu, gossamer robes from A, embroidered decorations would not be presented at court, and the elegant, refined, beautiful, slender women of Zhao who follow customs would not stand at the side."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "夫擊甕叩缶彈箏搏髀，而歌呼嗚嗚快耳（目）者，真秦之聲也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Striking jars, tapping pots, plucking zithers, slapping thighs, and singing with calls of 'wu wu' to delight the ears—these are truly Qin's sounds;"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "鄭、衛、桑閒、昭、虞、武、象者，異國之樂也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zheng, Wei, Sangjian, Zhao, Yu, Wu, Xiang—these are the musics of different states."
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "今棄擊甕叩缶而就鄭衛，退彈箏而取昭虞，若是者何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now abandoning striking jars and tapping pots to approach Zheng and Wei, retreating from plucking zithers to take Zhao and Yu—why is this?"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "快意當前，適觀而已矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "It is simply that pleasure is before one, and one takes what is suitable for viewing."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "今取人則不然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now in taking people, it is not like this."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "不問可否，不論曲直，非秦者去，為客者逐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Without asking whether suitable or not, without discussing right or wrong, if not Qin-born, they go, if guests, they are expelled."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "然則是所重者在乎色樂珠玉，而所輕者在乎人民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thus what is valued is beauty, music, pearls, and jade, while what is slighted is the people."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "此非所以跨海內制諸侯之術也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This is not the way to stride across the realm and control the feudal lords."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Now Your Majesty brings Kun mountain jade, has Sui, He treasures, hangs bright moon pearls, wears Tai E sword, rides slender li horses, establishes kingfisher phoenix flags, sets spirit crocodile drums. These several treasures, Qin not produce one, yet Your Majesty delights them, why? Must Qin state produced then can, then night light jade not adorn court, rhinoceros elephant vessels not for playthings, Zheng, Wei girls not fill rear palace, swift good dun horses not fill outer stables, Jiangnan gold tin not for use, west Shu cinnabar blue not for gather. What adorn rear palace fill lower ranks please heart intent delight ears eyes, must from Qin then can, then Wan pearl hairpins, Fu jewel earrings, A plain clothes, brocade embroidery ornaments not advance front, follow customs refined transformation fine beautiful secluded lovely Zhao girls not stand side. Beat jars strike pots pluck zheng slap thighs, sing call wu wu please ears eyes, true Qin sounds; Zheng, Wei, Sang Jian, Zhao, Yu, Wu, Xiang, different states music. Now abandon beat jars strike pots approach Zheng Wei, retreat pluck zheng take Zhao Yu, like this why? Pleasure before, suitable view already. Now take people then not so. Not ask can cannot, not discuss curved straight, not Qin leave, guest expel. Then this what valued in color music pearl jade, what light in people. This not what stride within control feudal lords method.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "臣聞地廣者粟多，國大者人眾，兵彊則士勇。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I have heard that broad lands have abundant grain, large states have numerous people, strong armies have brave soldiers."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "是以太山不讓土壤，故能成其大；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore Mount Tai does not reject soil, thus it can achieve its greatness;"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "河海不擇細流，故能就其深；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Rivers and seas do not choose small streams, thus they can achieve their depth;"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "王者不卻眾庶，故能明其德。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "True kings do not reject the multitudes, thus they can manifest their virtue."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "是以地無四方，民無異國，四時充美，鬼神降福，此五帝、三王之所以無敵也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore lands have no four directions (boundaries), people have no foreign countries, the four seasons are abundantly beautiful, spirits and gods send down blessings—this is why the Five Emperors and Three Kings were invincible."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "今乃棄黔首以資敵國，卻賓客以業諸侯，使天下之士退而不敢西向，裹足不入秦，此所謂「藉寇兵而齎盜糧」者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now instead you abandon the black-headed people to enrich enemy states, reject guests to strengthen the feudal lords, causing the scholars of the world to retreat and not dare to face west, to wrap their feet and not enter Qin—this is what is called 'lending weapons to bandits and giving provisions to robbers.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Minister heard land broad grain many, state great person many, troops strong then scholars brave. Thus Tai mountain not reject soil, thus can complete its great; River sea not choose fine streams, thus can reach its deep; Kings not reject masses, thus can clarify their virtue. Thus land no four directions, people no different states, four seasons full beautiful, ghosts gods descend fortune, this five emperors, three kings why no enemy. Now abandon black heads to aid enemy states, reject guests to enrich feudal lords, make world scholars retreat not dare west face, wrap feet not enter Qin, this called 'borrow bandit troops give robber grain'.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0061",
          "zh": "夫物不產於秦，可寶者多；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Things not produced in Qin that can be treasured are many;"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "士不產於秦，而願忠者眾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Scholars not produced in Qin, but those willing to be loyal are numerous."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "今逐客以資敵國，損民以益讎，內自虛而外樹怨於諸侯，求國無危，不可得也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now expelling guests enriches enemy states, harming the people to benefit enemies, internally weakening ourselves while externally creating resentment among the feudal lords—seeking safety for the state, it cannot be obtained."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Things not produce in Qin, can treasure many; Scholars not produce in Qin, wish loyal many. Now expel guests to aid enemy states, harm people to benefit enemies, inner self empty outer plant resentment in feudal lords, seek state no danger, cannot obtain.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0064",
          "zh": "秦王乃除逐客之令，復李斯官，卒用其計謀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The King of Qin then abolished the order to expel guests, restored Li Si's office, and in the end adopted his strategies."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "官至廷尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He rose in office to become Superintendent of Trials."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "二十餘年，竟并天下，尊主為皇帝，以斯為丞相。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "After more than twenty years, he ultimately unified the world, honored his lord as emperor, and made Li Si chancellor."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "夷郡縣城，銷其兵刃，示不復用。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He razed the city walls of the commanderies and counties, melted down their weapons, showing they would not be used again."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "使秦無尺土之封，不立子弟為王，功臣為諸侯者，使後無戰攻之患。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He caused Qin to have no inch of enfeoffed land, not establishing sons and younger brothers as kings, nor meritorious ministers as feudal lords, so that later there would be no troubles of warfare and attack."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Qin king then abolished expel guests order, restored Li Si office, finally used his plans. Office to court wei. Twenty plus years, finally united world, honored lord as emperor, with Si as chancellor. Leveled commandery county cities, melted their weapons, showed not use again. Made Qin no chi soil fiefs, not establish sons brothers as kings, merit ministers as feudal lords, made later no war attack worries.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0069",
          "zh": "始皇三十四年，置酒咸陽宮，博士仆射周青臣等頌始皇威德。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the thirty-fourth year of the First Emperor, he held a banquet in the Xianyang Palace, and the Doctor Assistant Commander Zhou Qingchen and others praised the First Emperor's might and virtue."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "齊人淳于越進諫曰：「臣聞之，殷周之王千餘歲，封子弟功臣自為支輔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The man from Qi, Chunyu Yue, advanced to remonstrate, saying: 'I have heard that the kings of Yin and Zhou lasted more than a thousand years by enfeoffing sons, younger brothers, and meritorious ministers as their supporting pillars.'"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "今陛下有海內，而子弟為匹夫，卒有田常、六卿之患，臣無輔弼，何以相救哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Your Majesty possesses the entire realm, yet your sons and younger brothers are commoners. If suddenly there should be troubles like those of Tian Chang and the Six Ministers, I have no supporting pillars—how would I save the situation?"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "事不師古而能長久者，非所聞也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Affairs that do not take antiquity as teacher and yet can endure long—such things I have not heard of."
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "今青臣等又面諛以重陛下過，非忠臣也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Zhou Qingchen and the others flatter you to your face to compound Your Majesty's errors—they are not loyal ministers.'"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "始皇下其議丞相。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The First Emperor sent this debate down to the chancellor."
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "丞相謬其說，絀其辭，乃上書曰：「古者天下散亂，莫能相一，是以諸侯并作，語皆道古以害今，飾虛言以亂實，人善其所私學，以非上所建立。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The chancellor considered his words mistaken and his arguments flawed, then submitted a memorial saying: 'In ancient times the world was scattered and chaotic, none could unify it, therefore the feudal lords arose together. Their words all cited antiquity to harm the present, embellished empty talk to confound reality, people praised their private studies to criticize what the ruler had established.'"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "今陛下并有天下，別白黑而定一尊；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Your Majesty has unified the world, distinguished black from white and established singular authority;"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "而私學乃相與非法教之制，聞令下，即各以其私學議之，入則心非，出則巷議，非主以為名，異趣以為高，率群下以造謗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Yet private scholars mutually criticize the laws and teachings, and when they hear orders issued, each uses their private studies to debate them. When they enter, they harbor dissent in their hearts; when they leave, they discuss in the lanes. They take opposing the ruler as their reputation, consider different pursuits as lofty, and lead the masses below in creating slander."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "如此不禁，則主勢降乎上，黨與成乎下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If not prohibited like this, then the ruler's authority will decline above, and factions will form below."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "禁之便。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Prohibiting them is advantageous."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "臣請諸有文學詩書百家語者，蠲除去之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I request that all who possess literature, poetry, books, and the words of the hundred schools be exempted and removed."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "令到滿三十日弗去，黥為城旦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the order arrives, if within thirty days they do not depart, tattoo them and make them serve as city wall laborers."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "所不去者，醫藥卜筮種樹之書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Those not to be removed are books on medicine, divination, agriculture, and planting."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "若有欲學者，以吏為師。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If there are those who wish to study, they shall take officials as teachers.'"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "始皇可其議，收去詩書百家之語以愚百姓，使天下無以古非今。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The First Emperor approved his proposal, collected and removed the poetry, books, and words of the hundred schools to make the common people ignorant, so that the world would have no means to criticize the present using antiquity."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "明法度，定律令，皆以始皇起。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He clarified the legal codes, established the statutes, all beginning with the First Emperor."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "同文書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He unified the written script."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "治離宮別館，周遍天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He built detached palaces and separate mansions, spread throughout the empire."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "明年，又巡狩，外攘四夷，斯皆有力焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The next year, he again toured the provinces, externally repelled the four barbarian tribes—Li Si had strength in all these."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang thirty-fourth year, set wine Xianyang palace, erudite chief Zhou Qingchen etc. praised Shi Huang might virtue. Qi person Chun Yu Yue advanced admonish: 'Minister heard, Yin Zhou kings thousand plus years, enfeoffed sons brothers merit ministers self as branch support. Now Your Majesty has within seas, yet sons brothers as common men, suddenly have Tian Chang, six ministers worry, minister no assist correct, how rescue! Affairs not model ancient can long lasting, not heard. Now Qingchen etc. again face flatter to heavy Your Majesty error, not loyal ministers.' Shi Huang sent his discussion to chancellor. Chancellor considered wrong his words, demoted his speech, then submitted letter: 'Ancient world scattered chaotic, none could unite, thus feudal lords parallel rise, words all spoke ancient to harm now, adorned empty words to confuse real, people praised their private learning, to oppose above established. Now Your Majesty united has world, distinguished black white determined one honor; Yet private learning then mutually oppose not teach regulations, hear order down, then each with their private learning discuss, enter then heart oppose, exit then alley discuss, oppose lord make name, different paths make high, lead group below to make slander. Like this not prohibit, then lord power descend above, factions form below. Prohibit convenient. Minister request all have literature poetry books hundred schools speech, eliminate remove them. Order arrive full thirty days not go, tattoo city labor. What not go, medicine divination planting trees books. If have wish study, with officials as teachers.' Shi Huang approved his discussion, collected removed poetry books hundred schools speech to make foolish hundred surnames, made world no with ancient oppose now. Clarified law degrees, determined statutes orders, all with Shi Huang begin. Unified writing. Managed separate palaces guest halls, encircled world. Next year, again toured inspect, outer repelled four Yi, Si all had strength.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0089",
          "zh": "斯長男由為三川守，諸男皆尚秦公主，女悉嫁秦諸公子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si's eldest son You became governor of Sanchuan, his various sons all married Qin princesses, his daughters all married Qin princes."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "三川守李由告歸咸陽，李斯置酒於家，百官長皆前為壽，門廷車騎以千數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Sanchuan governor Li You reported his return to Xianyang, Li Si held a banquet at home, all the heads of the hundred officials came forward to toast him, carriages and riders at the gate and court numbered in the thousands."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "李斯喟然而嘆曰：「嗟乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si sighed deeply and said: 'Alas!"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "吾聞之荀卿曰『物禁大盛』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I heard Master Xun say 'Things are prohibited when they become too prosperous.'"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "夫斯乃上蔡布衣，閭巷之黔首，上不知其駑下，遂擢至此。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now I, Li Si, am a commoner from Shangcai, a black-headed commoner from the lanes and alleys. The emperor did not know my inferiority, and thus promoted me to this position."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "當今人臣之位無居臣上者，可謂富貴極矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Among the positions of ministers today, none surpass mine. This can be called the extreme of wealth and honor."
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "物極則衰，吾未知所稅駕也！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When things reach their extreme, they decline. I do not know where I shall stop!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Si eldest son You as three streams guard, various sons all married Qin princesses, girls all married Qin various princes. Three streams guard Li You reported return Xianyang, Li Si set wine at home, hundred officials elders all front toast longevity, gate court chariots horses thousand number. Li Si sighed deeply: 'Alas! I heard Xun Qing say 'things prohibit great flourishing'. That Si was Shangcai common clothes, alley black heads, above not know his inferior below, thus promoted to this. Current person minister position none dwell minister above, can call rich noble extreme. Things extreme then decline, I not know where stop.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0097",
          "zh": "始皇三十七年十月，行出游會稽，并海上，北抵瑯邪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "In the thirty-seventh year of the First Emperor, tenth month, he traveled out to tour Kuaiji, followed the seacoast, and went north to Langye."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "丞相斯、中車府令趙高兼行符璽令事，皆從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Chancellor Li Si and the Commander of the Central Chariot Bureau Zhao Gao concurrently acted as directors of the tally and seal affairs, all accompanied him."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "始皇有二十餘子，長子扶蘇以數直諫上，上使監兵上郡，蒙恬為將。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The First Emperor had more than twenty sons. The eldest son Fusu, because he frequently remonstrated frankly with the emperor, was sent to oversee the troops in Shangjun, with Meng Tian as general."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "少子胡亥愛，請從，上許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The youngest son Hu Hai was beloved, requested to accompany him, and the emperor permitted it."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "餘子莫從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The remaining sons did not accompany him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang thirty-seventh year tenth month, traveled out tour Kuaiji, along sea, north reached Langye. Chancellor Si, middle chariot bureau commander Zhao Gao concurrently administered tally seal affairs, all followed. Shi Huang had twenty plus sons, eldest son Fu Su because repeatedly straightforward admonished above, above made supervise troops Shang commandery, Meng Tian as general. Youngest son Hu Hai loved, requested follow, above permitted. Other sons none followed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "其年七月，始皇帝至沙丘，病甚，令趙高為書賜公子扶蘇曰：「以兵屬蒙恬，與喪會咸陽而葬。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "That year in the seventh month, the First Emperor reached Shaqiu, and his illness became severe. He commanded Zhao Gao to write an edict granting to Prince Fusu: 'Entrust the troops to Meng Tian, and meet with the funeral procession at Xianyang for burial.'"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "書已封，未授使者，始皇崩。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The letter was already sealed, but not yet given to the messenger, when the First Emperor died."
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "書及璽皆在趙高所，獨子胡亥、丞相李斯、趙高及幸宦者五六人知始皇崩，餘群臣皆莫知也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The letter and seal were both in Zhao Gao's possession. Only the son Hu Hai, Chancellor Li Si, Zhao Gao, and five or six favored eunuchs knew of the First Emperor's death. The remaining ministers all did not know."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "李斯以為上在外崩，無真太子，故祕之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si considered that the emperor had died abroad, there was no true crown prince, therefore he kept it secret."
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "置始皇居輼輬車中，百官奏事上食如故，宦者輒從輼輬車中可諸奏事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They placed the First Emperor's body in a closed carriage, and the hundred officials presented memorials and offered food as usual. The eunuchs would from within the closed carriage approve all the memorials."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "That year seventh month, Shi Huang reached Shaqiu, illness grave, commanded Zhao Gao write grant crown prince Fu Su: 'Give troops to Meng Tian, with funeral meet Xianyang bury.' Letter already sealed, not given envoy, Shi Huang collapsed. Letter and seal all in Zhao Gao place, only son Hu Hai, chancellor Li Si, Zhao Gao and favored eunuchs five six persons knew Shi Huang collapsed, other ministers all not know. Li Si considered above outside collapsed, no true crown prince, thus secret it. Placed Shi Huang in feather canopy carriage middle, hundred officials presented affairs offered food as before, eunuchs from feather canopy carriage middle approved various presented affairs.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0107",
          "zh": "趙高因留所賜扶蘇璽書，而謂公子胡亥曰：「上崩，無詔封王諸子而獨賜長子書。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Gao therefore detained the sealed letter granting to Fusu, and said to Prince Hu Hai: 'The emperor has died, and there is no edict enfeoffing the other sons as kings, but only a letter granting to the eldest son.'"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "長子至，即立為皇帝，而子無尺寸之地，為之柰何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "When the eldest son arrives, he will immediately be established as emperor, and you will have no territory the size of a foot. What can be done about this?'"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "胡亥曰：「固也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hu Hai said: 'Indeed.'"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "吾聞之，明君知臣，明父知子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I have heard that enlightened rulers understand their ministers, enlightened fathers understand their sons."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "父捐命，不封諸子，何可言者！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "My father gave his life without enfeoffing the other sons—what can be said about this!'"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "趙高曰：「不然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Gao said: 'Not so.'"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "方今天下之權，存亡在子與高及丞相耳，願子圖之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Currently the power over the empire's fate lies with you, Gao, and the chancellor. I hope you will plan it."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "且夫臣人與見臣於人，制人與見制於人，豈可同日道哉！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, to serve others versus having others serve you, to control others versus being controlled by others—how can these be mentioned on the same day!'"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "胡亥曰：「廢兄而立弟，是不義也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hu Hai said: 'To depose the elder brother and establish the younger brother is unrighteous;'"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "不奉父詔而畏死，是不孝也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "not to follow the father's edict but to fear death is unfilial;"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "能薄而材谫，彊因人之功，是不能也：三者逆德，天下不服，身殆傾危，社稷不血食。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "with meager abilities and shallow talent, to forcibly seize another's achievement is incapable. These three violate virtue, the world will not submit, my person will be in peril and danger, the altars of soil and grain will not receive sacrifices.'"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "高曰：「臣聞湯、武殺其主，天下稱義焉，不為不忠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'I have heard that Tang and Wu killed their lords, yet the world called it righteous, not disloyal.'"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "衛君殺其父，而衛國載其德，孔子著之，不為不孝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Lord of Wei killed his father, yet Wei recorded his virtue, Confucius wrote about it, not calling it unfilial."
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "夫大行不小謹，盛德不辭讓，鄉曲各有宜而百官不同功。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Great deeds do not observe petty cautions, abundant virtue does not decline offers, villages and hamlets each have what is suitable while the hundred officials have different merits."
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "故顧小而忘大，後必有害；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore, to consider the small and forget the great will later bring harm;"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "狐疑猶豫，後必有悔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "to be indecisive and hesitant will later bring regret."
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "斷而敢行，鬼神避之，後有成功。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "to be decisive and dare to act will cause ghosts and spirits to avoid it, and later achieve success."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "願子遂之！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I hope you will carry it through!'"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "胡亥喟然嘆曰：「今大行未發，喪禮未終，豈宜以此事干丞相哉！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hu Hai sighed deeply and said: 'Now the great funeral procession has not departed, the mourning rites have not concluded, how can it be appropriate to trouble the chancellor with this matter!'"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "趙高曰：「時乎時乎，閒不及謀！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Gao said: 'Time! Time! There is no leisure for deliberation!'"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "贏糧躍馬，唯恐後時！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Pack the provisions, spur the horses, fearing only to be too late!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zhao Gao thus detained granted Fu Su seal letter, told crown prince Hu Hai: 'Above collapsed, no decree seal kings various sons yet alone grant eldest son letter. Eldest son arrive, then establish as emperor, you no chi soil land, do what?' Hu Hai said: 'Certainly. I heard, enlightened lord knows ministers, enlightened father knows sons. Father abandons life, not enfeoff various sons, what speak!' Zhao Gao said: 'Not so. Now world power, exist perish in you and Gao and chancellor, wish you plan. Moreover minister person with see minister by person, control person with see controlled by person, how same day speak!' Hu Hai said: 'Abolish elder brother establish younger brother, not righteous; Not follow father decree fear death, not filial; Ability thin materials shallow, strong take others merit, not able: three reverse virtue, world not submit, body danger incline peril, state altars not blood food.' Gao said: 'I heard Tang, Wu killed their lords, world called righteous, not not loyal. Wei lord killed his father, Wei state carried his virtue, Confucius wrote it, not not filial. Great conduct not small careful, flourishing virtue not decline yield, village quarter each has suitable hundred officials different merit. Thus look small forget great, after must harm; Fox doubt hesitate, after must regret. Decide dare act, ghosts gods avoid it, after have success. Wish you follow it!' Hu Hai sighed deeply: 'Now great conduct not issued, mourning ritual not end, how suitable with this affair bother chancellor!' Zhao Gao said: 'Time time, interval not reach plan! Winnow grain leap horse, only fear after time!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "胡亥既然高之言，高曰：「不與丞相謀，恐事不能成，臣請為子與丞相謀之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Hu Hai having already accepted Gao's words, Gao said: 'If we do not consult with the chancellor, I fear the matter cannot succeed. I request to consult with the chancellor on your behalf.'"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "高乃謂丞相斯曰：「上崩，賜長子書，與喪會咸陽而立為嗣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao then said to Chancellor Li Si: 'The emperor has passed away, and granted the eldest son an edict to meet the funeral procession at Xianyang and be established as heir.'"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "書未行，今上崩，未有知者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The edict has not been sent. Now the emperor has died, and no one knows yet."
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "所賜長子書及符璽皆在胡亥所，定太子在君侯與高之口耳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The edict granted to the eldest son and the tallies and seals are all in Hu Hai's possession. The determination of the crown prince lies in the mouths of you, my lord, and Gao."
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "事將何如？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "How shall this matter proceed?'"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "斯曰：「安得亡國之言！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si said: 'How can there be words that would destroy the state!'"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "此非人臣所當議也！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This is not something ministers should discuss!'"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "高曰：「君侯自料能孰與蒙恬？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'My lord, assess yourself—who can compare with Meng Tian?'"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "功高孰與蒙恬？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Whose merit is higher than Meng Tian's?"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "謀遠不失孰與蒙恬？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Whose plans are more far-reaching and unfailing than Meng Tian's?"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "無怨於天下孰與蒙恬？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who has fewer grievances from the world than Meng Tian?"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "長子舊而信之孰與蒙恬？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Who is more long-serving and trusted than Meng Tian?'"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "斯曰：「此五者皆不及蒙恬，而君責之何深也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si said: 'In all five of these, I am inferior to Meng Tian, yet why does my lord reproach me so deeply?'"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "高曰：「高固內官之廝役也，幸得以刀筆之文進入秦宮，管事二十餘年，未嘗見秦免罷丞相功臣有封及二世者也，卒皆以誅亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'I am originally a menial servant of the inner palace. Fortunately, through my writing on bamboo slips I entered the Qin palace and have managed affairs for more than twenty years. I have never seen Qin dismiss chancellors or meritorious ministers who were enfeoffed and passed it to the second generation. In the end, they all perished through execution.'"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "皇帝二十餘子，皆君之所知。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The emperor's more than twenty sons are all known to you, my lord."
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "長子剛毅而武勇，信人而奮士，即位必用蒙恬為丞相，君侯終不懷通侯之印歸於鄉里，明矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The eldest son is firm and resolute with martial courage, trusts people and inspires soldiers. Once enthroned, he will certainly appoint Meng Tian as chancellor. It is clear that you, my lord, will never be able to retire to your hometown bearing the seal of a noble marquess."
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "高受詔教習胡亥，使學以法事數年矣，未嘗見過失。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I, Gao, received the emperor's command to teach and guide Hu Hai, having him study legal affairs for several years. I have never seen any faults in him."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "慈仁篤厚，輕財重士，辯於心而詘於口，盡禮敬士，秦之諸子未有及此者，可以為嗣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "He is compassionate and humane, sincere and generous, values wealth lightly but scholars highly, is discerning in thought but reserved in speech, exhausts the rites in respecting scholars. Among Qin's various sons, none surpass him. He can be the heir."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "君計而定之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "You, my lord, deliberate and decide it.'"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "斯曰：「君其反位！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si said: 'You, my lord, return to your position!'"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "斯奉主之詔，聽天之命，何慮之可定也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I, Li Si, obey the ruler's edict and heed Heaven's mandate. What plans can I determine?'"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "高曰：「安可危也，危可安也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'Safety can be turned to danger, danger can be turned to safety.'"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "安危不定，何以貴聖？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If safety and danger are not fixed, how can one value wisdom?'"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "斯曰：「斯，上蔡閭巷布衣也，上幸擢為丞相，封為通侯，子孫皆至尊位重祿者，故將以存亡安危屬臣也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si said: 'I, Li Si, am a commoner from the alleys of Shangcai. The emperor fortunately promoted me to chancellor, enfeoffed me as a noble marquess, and my sons and grandsons all attained honored positions and heavy salaries. Therefore he entrusted the state's survival and safety to me.'"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "豈可負哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "How can I betray this!'"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "夫忠臣不避死而庶幾，孝子不勤勞而見危，人臣各守其職而已矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Loyal ministers do not avoid death but do their best, filial sons do not toil but face danger. Ministers each guard their office, that is all.'"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "君其勿復言，將令斯得罪。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "You, my lord, speak no more of this, lest it cause me, Li Si, to commit a crime.'"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "高曰：「蓋聞聖人遷徙無常，就變而從時，見末而知本，觀指而睹歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'I have heard that sages do not have fixed migrations, they adapt to change and follow the times, see the end and know the beginning, observe the finger and perceive the direction.'"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "物固有之，安得常法哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Things naturally have this, how can there be constant laws!'"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "方今天下之權命懸於胡亥，高能得志焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Currently the empire's power and fate hang on Hu Hai. I, Gao, can fulfill my ambitions through this."
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "且夫從外制中謂之惑，從下制上謂之賊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, to have the outer control the inner is called confusion, to have the lower control the upper is called treason."
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "故秋霜降者草花落，水搖動者萬物作，此必然之效也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Therefore when autumn frost falls, grass and flowers wither; when water is disturbed, ten thousand things arise. This is the inevitable effect."
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "君何見之晚？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Why has my lord seen this so late?'"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "斯曰：「吾聞晉易太子，三世不安；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si said: 'I have heard that when Jin changed its crown prince, three generations had no peace;'"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "齊桓兄弟爭位，身死為戮；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Duke Huan of Qi's brothers contended for the throne, he died and his corpse was exposed;"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "紂殺親戚，不聽諫者，國為丘墟，遂危社稷：三者逆天，宗廟不血食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhou killed his relatives and did not listen to remonstrators, his state became ruins, and thus endangered the altars of soil and grain. These three went against Heaven, and the ancestral temples received no sacrifices.'"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "斯其猶人哉，安足為謀！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Am I, Li Si, still a human? How can I participate in such plans!'"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "高曰：「上下合同，可以長久；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'When superiors and inferiors are united, it can endure long;'"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "中外若一，事無表裏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "when inner and outer are as one, affairs have no front or back.'"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "君聽臣之計，即長有封侯，世世稱孤，必有喬松之壽，孔、墨之智。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "If my lord listens to my plan, you will forever have the enfeoffment of a marquess, generation after generation be called 'my lord,' certainly have the longevity of the tallest pine, the wisdom of Confucius and Mozi.'"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "今釋此而不從，禍及子孫，足以為寒心。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now if you abandon this and do not follow, disaster will reach your descendants, sufficient to make one's heart grow cold.'"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "善者因禍為福，君何處焉？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The wise turn calamity into fortune. My lord, what position will you take?'"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "斯乃仰天而嘆，垂淚太息曰：「嗟乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Li Si then gazed up at heaven and sighed, shedding tears and heaving deep sighs: 'Alas!'"
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "獨遭亂世，既以不能死，安託命哉！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Alone I have encountered this chaotic age. Since I cannot die, to whom can I entrust my fate!'"
            }
          ]
        },
        {
          "id": "s0173",
          "zh": "於是斯乃聽高。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon Li Si listened to Gao."
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "高乃報胡亥曰：「臣請奉太子之明命以報丞相，丞相斯敢不奉令！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao then reported to Hu Hai: 'I request to carry the enlightened command of the crown prince to inform the chancellor. Chancellor Li Si dares not disobey the order!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Hu Hai already like Gao words, Gao said: 'Not with chancellor plan, fear affair cannot complete, minister request for you with chancellor plan.' Gao then told chancellor Si: 'Above collapsed, granted eldest son letter, with funeral meet Xianyang establish as heir. Letter not issued, now above collapsed, none have know. What granted eldest son letter and tally seal all in Hu Hai place, decide crown prince in lord marquis and Gao mouth. Affair will how?' Si said: 'How get perished state words! This not person minister should discuss!' Gao said: 'Lord marquis self-measure can compare Meng Tian? Merit high compare Meng Tian? Plan far not lose compare Meng Tian? No resentment in world compare Meng Tian? Eldest son old faithful compare Meng Tian?' Si said: 'These five all not reach Meng Tian, lord blame why deep?' Gao said: 'Gao certainly inner official menial, fortunately with knife pen writing enter Qin palace, manage affairs twenty plus years, not tasted see Qin dismiss chancellor merit ministers have seal to second generation, finally all with execution perished. Emperor twenty plus sons, all lord know. Eldest son firm resolute martial brave, trust people encourage scholars, ascend position must use Meng Tian as chancellor, lord marquis end not carry marquis seal return home village, clear. Gao received decree teach practice Hu Hai, made study laws affairs several years, not tasted see fault. Benevolent kind sincere thick, light wealth heavy scholars, sharp at heart yield at mouth, exhaust ritual respect scholars, Qin various sons none reach this, can be heir. Lord plan decide it.' Si said: 'You return position! Si follow lord decree, listen heaven fate, what plan can decide?' Gao said: 'Safe can danger, danger can safe. Safe danger not decided, how value sage?' Si said: 'Si, Shangcai alley common clothes, above fortunately promoted chancellor, enfeoffed marquis, sons grandsons all noble position heavy salary, thus will with exist perish safe danger entrust minister. How can betray! Loyal minister not avoid death hope nearly, filial son not toil see danger, person ministers each guard their duty already.' You not again speak, will make Si get crime.' Gao said: 'I heard sage people move not constant, follow change from time, see end know beginning, observe finger see return. Things certainly have, how get constant method! Now world power fate hang on Hu Hai, Gao can get will. Moreover from outside control inside called confused, from below control above called thief. Thus autumn frost descend grass flowers fall, water shake move myriad things arise, this inevitable effect. Lord why see late?' Si said: 'I heard Jin change crown prince, three generations not peaceful; Qi Huan brothers contend position, body die executed; Zhou kill relatives, not listen admonishers, state become hill ruins, thus danger state altars: three reverse heaven, ancestral temples not blood food. Si also person, how sufficient plan!' Gao said: 'Above below unite, can long lasting; Inside outside like one, affairs no surface inside. Lord listen minister plan, then long have enfeoff marquis, generations call duke, must have Qiao Song longevity, Kong, Mo wisdom. Now release this not follow, calamity reach sons grandsons, sufficient make cold heart. Good take calamity make fortune, lord where place?' Si then face heaven sigh, hang tears great sigh: 'Alas! Alone encounter chaotic world, already cannot die, where entrust fate!' Thus Si then listened Gao. Gao then reported Hu Hai: 'Minister request follow crown prince bright command report chancellor, chancellor Si dare not follow order!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0176",
          "zh": "於是乃相與謀，詐為受始皇詔丞相，立子胡亥為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Thereupon they conspired together, falsely claiming to receive the First Emperor's edict to the chancellor, establishing Prince Hu Hai as crown prince."
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "更為書賜長子扶蘇曰：「朕巡天下，禱祠名山諸神以延壽命。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They made another letter granting to the eldest son Fusu: 'I tour the world, praying and sacrificing to the various gods of the famous mountains to extend my lifespan.'"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "今扶蘇與將軍蒙恬將師數十萬以屯邊，十有餘年矣，不能進而前，士卒多秏，無尺寸之功，乃反數上書直言誹謗我所為，以不得罷歸為太子，日夜怨望。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Fusu and General Meng Tian lead several hundred thousand troops stationed at the border, more than ten years already, cannot advance forward, soldiers largely depleted, no achievement the size of an inch, instead repeatedly submit memorials speaking frankly and slandering my actions, resenting that he cannot return and become crown prince, day and night filled with resentment.'"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "扶蘇為人子不孝，其賜劍以自裁！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fusu as a son is unfilial. Grant him a sword to commit suicide!'"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "將軍恬與扶蘇居外，不匡正，宜知其謀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "General Tian, together with Fusu abroad, does not correct him, should know his plots.'"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "為人臣不忠，其賜死，以兵屬裨將王離。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As a minister he is disloyal. Grant him death, entrust the troops to deputy general Wang Li.'"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "封其書以皇帝璽，遣胡亥客奉書賜扶蘇於上郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They sealed the letter with the emperor's seal and sent one of Hu Hai's retainers to carry the letter and grant it to Fusu in Shangjun."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus then mutually planned, falsely as receive Shi Huang decree chancellor, establish son Hu Hai as crown prince. Again made letter grant eldest son Fu Su: 'I tour world, pray sacrifice famous mountains various gods to extend life. Now Fu Su with general Meng Tian lead troops several ten thousand garrison border, ten plus years, cannot advance forward, soldiers much expend, no chi merit, instead repeatedly submit letter straightforward speak slander what I do, with cannot dismiss return be crown prince, day night resentful. Fu Su as person son not filial, grant sword self-suicide! General Tian with Fu Su dwell outside, not correct, should know his plot. As person minister not loyal, grant death, give troops to deputy general Wang Li.' Sealed his letter with emperor seal, sent Hu Hai guest present letter grant Fu Su at Shang commandery.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0183",
          "zh": "使者至，發書，扶蘇泣，入內舍，欲自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The messenger arrived, opened the letter. Fusu wept, entered his inner chambers, wished to commit suicide."
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "蒙恬止扶蘇曰：「陛下居外，未立太子，使臣將三十萬眾守邊，公子為監，此天下重任也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Meng Tian stopped Fusu, saying: 'The emperor is abroad, has not yet established a crown prince, sent me to lead three hundred thousand troops to guard the border, with the prince as supervisor. This is a heavy responsibility for the empire.'"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "今一使者來，即自殺，安知其非詐？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now one messenger comes, and immediately commits suicide. How do we know it is not a forgery?'"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "請復請，復請而後死，未暮也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Let me make another request. After making another request, then I will die. It is not yet too late.'"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "使者數趣之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The messenger repeatedly urged him."
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "扶蘇為人仁，謂蒙恬曰：「父而賜子死，尚安復請！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fusu was a humane person, said to Meng Tian: 'If a father grants a son death, how can he make another request!'"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "即自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Immediately he committed suicide."
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "蒙恬不肯死，使者即以屬吏，系於陽周。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Meng Tian refused to die, so the messenger handed him over to the local officials and imprisoned him at Yangzhou."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Envoy arrived, opened letter, Fu Su wept, entered inner lodge, wished suicide. Meng Tian stopped Fu Su: 'Your Majesty dwells outside, not established crown prince, made minister lead thirty thousand crowd guard border, crown prince supervise, this world heavy responsibility. Now one envoy come, then suicide, how know not false? Please again request, again request then die, not late.' Envoy repeatedly urged. Fu Su person benevolent, told Meng Tian: 'Father grant son death, still what request!' Then suicide. Meng Tian not willing die, envoy then gave to officials, imprisoned at Yang Zhou.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0191",
          "zh": "使者還報，胡亥、斯、高大喜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The messenger returned and reported. Hu Hai, Li Si, and Gao were greatly pleased."
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "至咸陽，發喪，太子立為二世皇帝。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They arrived at Xianyang, held the funeral, and the crown prince was established as the Second Emperor."
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "以趙高為郎中令，常侍中用事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "They appointed Zhao Gao as Commander of the Gentlemen-in-Attendance, who constantly attended in the inner chambers and handled affairs."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Envoy returned reported, Hu Hai, Si, Gao greatly pleased. Reached Xianyang, issued mourning, crown prince established as Second Emperor. With Zhao Gao as langzhong commander, constantly serve middle manage affairs.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0194",
          "zh": "二世燕居，乃召高與謀事，謂曰：「夫人生居世閒也，譬猶騁六驥過決隙也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Second Emperor was in private quarters, then summoned Gao to consult on affairs, saying: 'Human life dwelling in the world is like racing six fine horses through a narrow gap.'"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "吾既已臨天下矣，欲悉耳目之所好，窮心志之所樂，以安宗廟而樂萬姓，長有天下，終吾年壽，其道可乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I have now assumed rule over the world. I wish to exhaust all that delights the ears and eyes, exhaust all that pleases the heart and will, to secure the ancestral temples and bring joy to the myriad people, to possess the world forever and complete my lifespan. Is this way acceptable?'"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "高曰：「此賢主之所能行也，而昏亂主之所禁也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Gao said: 'This is what enlightened rulers can do, but what benighted and chaotic rulers prohibit.'"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "臣請言之，不敢避斧鉞之誅，願陛下少留意焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "I request to speak of it, not daring to avoid the punishment of axe and battle-axe, I hope Your Majesty will pay slight attention."
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "夫沙丘之謀，諸公子及大臣皆疑焉，而諸公子盡帝兄，大臣又先帝之所置也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "As for the Shaqiu plot, all the princes and ministers suspect it, and all the princes are the emperor's elder brothers, while the ministers were appointed by the previous emperor."
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "今陛下初立，此其屬意怏怏皆不服，恐為變。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Your Majesty has just ascended the throne, their intentions are discontented and all are not submissive, I fear they will rebel."
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "且蒙恬已死，蒙毅將兵居外，臣戰戰栗栗，唯恐不終。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, although Meng Tian is dead, Meng Yi commands troops abroad. I tremble with fear, fearing I will not survive to the end."
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "且陛下安得為此樂乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Moreover, how can Your Majesty indulge in such pleasures?'"
            }
          ]
        },
        {
          "id": "s0202",
          "zh": "二世曰：「為之柰何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "The Second Emperor said: 'What can be done about it?'"
            }
          ]
        },
        {
          "id": "s0203",
          "zh": "趙高曰：「嚴法而刻刑，令有罪者相坐誅，至收族，滅大臣而遠骨肉；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Zhao Gao said: 'Strict laws and severe punishments, so that those with crimes implicate and execute each other, even to confiscating the entire clan. Eliminate the great ministers and distance the flesh and blood relatives;'"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "貧者富之，賤者貴之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "enrich the poor, ennoble the lowly.'"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "盡除去先帝之故臣，更置陛下之所親信者近之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Completely remove all the previous emperor's old ministers, and place those whom Your Majesty personally trusts close by.'"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "此則陰德歸陛下，害除而姦謀塞，群臣莫不被潤澤，蒙厚德，陛下則高枕肆志寵樂矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "This way secret virtue will accrue to Your Majesty, harm will be eliminated and treacherous plots blocked, all ministers will receive benefits and enjoy Your Majesty's abundant favor, and Your Majesty can rest easy and indulge in pleasures to your heart's content.'"
            }
          ]
        },
        {
          "id": "s0207",
          "zh": "計莫出於此。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "No plan surpasses this.'"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "二世然高之言，乃更為法律。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor approved Gao's words, and changed the laws accordingly."
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "於是群臣諸公子有罪，輒下高，令鞠治之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon whenever ministers or princes committed crimes, they were sent down to Gao, who was ordered to investigate and punish them."
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "殺大臣蒙毅等，公子十二人僇死咸陽市，十公主僇死於杜，財物入於縣官，相連坐者不可勝數。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He executed great ministers like Meng Yi, had twelve princes publicly executed in Xianyang marketplace, ten princesses publicly executed at Du, their wealth and property confiscated into the public treasury, those implicated in the purge numbered beyond counting."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Second Emperor secluded feast, then summoned Gao with plan affairs, told: 'Person life dwell world between, like gallop six steeds pass crack. I already oversee world, wish exhaust ears eyes what like, exhaust heart will what happy, to pacify ancestral temples happy myriad surnames, long have world, end my year life, its way can?' Gao said: 'This worthy lord can do, yet confused chaotic lord prohibit. Minister request speak, dare not avoid axe punishment, wish Your Majesty little attentive. That Shaqiu plot, various crown princes and ministers all doubt, various crown princes all emperor brothers, ministers again previous emperor placed. Now Your Majesty initial establish, their intent resentful all not submit, fear become change. Moreover Meng Tian already dead, Meng Yi lead troops dwell outside, minister tremble tremble, only fear not end. Moreover Your Majesty how get do this happy?' Second Emperor said: 'Do what?' Zhao Gao said: 'Strict law harsh punishment, make have crime mutually sit execute, reach confiscate clan, exterminate ministers far relatives; Poor make rich, base make noble. Completely eliminate remove previous emperor old ministers, again place Your Majesty close trusted near them.' This then hidden virtue returns to Your Majesty, harm removed and treacherous plots blocked, ministers none not covered in favor, receive thick virtue, Your Majesty then high pillow free will indulge pleasure. Plan none better than this.' Second Emperor approved Zhao Gao's words, then changed to make laws. Thus ministers various crown princes have crime, immediately sent to Gao, commanded investigate treat them. Killed ministers Meng Yi etc., crown princes twelve executed die Xianyang market, ten princesses executed die at Du, wealth property entered county official, mutually connected punished cannot count.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0211",
          "zh": "公子高欲奔，恐收族，乃上書曰：「先帝無恙時，臣入則賜食，出則乘輿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Prince Gao wished to flee, but fearing the confiscation of his clan, he submitted a memorial saying: 'When the previous emperor was in good health, when I entered he granted me food, when I departed he granted me carriages.'"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "御府之衣，臣得賜之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Clothing from the imperial wardrobe, I received as grants;"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "中廄之寶馬，臣得賜之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Precious horses from the imperial stables, I received as grants.'"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "臣當從死而不能，為人子不孝，為人臣不忠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "I ought to have followed in death but could not, as a son I am unfilial, as a minister I am disloyal.'"
            }
          ]
        },
        {
          "id": "s0215",
          "zh": "不忠者無名以立於世，臣請從死，願葬酈山之足。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The disloyal have no reputation to stand on in the world. I request to follow in death, and wish to be buried at the foot of Mount Li.'"
            }
          ]
        },
        {
          "id": "s0216",
          "zh": "唯上幸哀憐之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "I only hope that Your Majesty will mercifully pity me.'"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "書上，胡亥大說，召趙高而示之，曰：「此可謂急乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The memorial was presented, Hu Hai was greatly pleased, summoned Zhao Gao and showed it to him, saying: 'Can this be considered urgent?'"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "趙高曰：「人臣當憂死而不暇，何變之得謀！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao said: 'A minister should be worried about death and have no leisure—what rebellion can he plot!'"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "胡亥可其書，賜錢十萬以葬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Hu Hai approved his memorial and granted one hundred thousand cash for burial."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Crown prince Gao wished flee, feared confiscate clan, then submitted letter said: 'Previous emperor without illness time, minister enter then granted food, exit then ride carriage. Imperial storehouse clothes, minister got granted; Middle stable treasure horses, minister got granted. Minister should follow die yet cannot, as person son not filial, as person minister not loyal. Not loyal no name to stand in world, minister request follow die, wish bury Li mountain foot. Only above fortunately pity it.' Letter submitted, Hu Hai greatly pleased, summoned Zhao Gao showed it, said: 'This can call urgent?' Zhao Gao said: 'Person minister should worry die not leisure, what change get plot!' Hu Hai approved his letter, granted money ten thousand to bury.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "法令誅罰日益刻深，群臣人人自危，欲畔者眾。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The laws and punishments grew increasingly harsh and severe, all ministers were in personal danger, those wishing to rebel were many."
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "又作阿房之宮，治直［道］、馳道，賦斂愈重，戍傜無已。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He also built the Epang Palace, constructed the direct roads and imperial highways, taxes and levies grew heavier, military service and corvée labor never ceased."
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "於是楚戍卒陳勝、吳廣等乃作亂，起於山東，傑俊相立，自置為侯王，叛秦，兵至鴻門而卻。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon the Chu garrison soldiers Chen Sheng, Wu Guang, and others rebelled, rising in the east, outstanding talents established each other, set themselves up as marquises and kings, rebelled against Qin, their troops reached Hongmen but then retreated."
            }
          ]
        },
        {
          "id": "s0223",
          "zh": "李斯數欲請閒諫，二世不許。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si repeatedly wished to request private audience to remonstrate, but the Second Emperor did not permit it."
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "而二世責問李斯曰：「吾有私議而有所聞於韓子也，曰『堯之有天下也，堂高三尺，采椽不斲，茅茨不翦，雖逆旅之宿不勤於此矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor interrogated Li Si, saying: 'I have private discussions and have heard from Master Han that 'When Yao possessed the world, his hall was three chi high, the rafters were unhewn mulberry wood, the thatched roof was untrimmed, even the lodging of a traveler was not more uncomfortable than this.'"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "冬日鹿裘，夏日葛衣，粢糲之食，藜藿之羹，飯土匭，啜土鉶，雖監門之養不觳於此矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "In winter he wore deer hide robes, in summer hemp garments, ate coarse grain food and wild vegetable broth, ate from earthenware bowls, drank from earthenware cups—even the provisions of a gatekeeper were not coarser than this.'"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "禹鑿龍門，通大夏，疏九河，曲九防，決渟水致之海，而股無胈，脛無毛，手足胼胝，面目黎黑，遂以死于外，葬於會稽，臣虜之勞不烈於此矣』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Yu excavated Dragon Gate, opened Great Xia, dredged the nine rivers, curved nine dikes, drained stagnant waters to the sea, yet his thighs had no flesh, his shins no hair, his hands and feet were calloused, his face and eyes blackened, and thus he died abroad, buried at Kuaiji—even the labor of captives and slaves was not more intense than this.'"
            }
          ]
        },
        {
          "id": "s0227",
          "zh": "然則夫所貴於有天下者，豈欲苦形勞神，身處逆旅之宿，口食監門之養，手持臣虜之作哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then what is valued in possessing the world—is it to torment the body and exhaust the spirit, dwell in traveler's lodgings, eat gatekeeper's provisions, perform the labor of captives and slaves?"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "此不肖人之所勉也，非賢者之所務也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This is what unworthy people strive for, not what worthy people pursue."
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "彼賢人之有天下也，專用天下適己而已矣，此所貴於有天下也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When worthy people possess the world, they exclusively use the world to suit themselves—that is what is valued in possessing the world."
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "夫所謂賢人者，必能安天下而治萬民，今身且不能利，將惡能治天下哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "As for what is called a worthy person, they must be able to pacify the world and govern the multitudes. Now if they cannot even benefit themselves, how can they govern the world!'"
            }
          ]
        },
        {
          "id": "s0231",
          "zh": "笔吾願賜志廣欲，長享天下而無害，為之柰何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Fulfill my wishes for broad desires, long enjoyment of the world without harm—what can be done about it?'"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "李斯子由為三川守，群盜吳廣等西略地，過去弗能禁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si's son You served as governor of Sanchuan. The bandits Wu Guang and others advanced west seizing territory, passing through without being stopped."
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "章邯以破逐廣等兵，使者覆案三川相屬，誚讓斯居三公位，如何令盜如此。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhang Han with troops that defeated and pursued Guang and others, messengers successively investigated Sanchuan, reproached Li Si for holding the position of one of the Three Excellencies, how could he allow bandits to be like this."
            }
          ]
        },
        {
          "id": "s0234",
          "zh": "李斯恐懼，重爵祿，不知所出，乃阿二世意，欲求容，以書對曰：",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si was fearful and treasured his noble rank and salary, not knowing what to do, so he flattered the Second Emperor's intentions, desiring to gain favor, and replied in a memorial saying:"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Laws orders punish execute increasingly harsh deep, ministers people self-dangerous, wished rebel many. Again built Epang palace, managed direct roads, galloping roads, taxes levies increasingly heavy, garrison labor without end. Thus Chu garrison soldiers Chen Sheng, Wu Guang etc. then made chaos, rose from east of mountains, outstanding talented mutually established, self-appointed as marquises kings, rebelled Qin, troops reached Hongmen then retreated. Li Si several times wished request leisure admonish, Second Emperor not permitted. Yet Second Emperor blamed questioned Li Si said: 'I have private discussion and have heard from Han Zi, said 'Yao's having world, hall high three chi, colored rafters not carved, thatched roof not trimmed, though traveler inn stay not more diligent than this. Winter wear deer fur, summer wear hemp clothes, coarse grain food, smartweed mallow soup, eat clay jar, drink clay bowl, though gatekeeper nourishment not poorer than this. Yu dug Longmen, connected Da Xia, dredged nine rivers, curved nine dikes, decided stagnant water led to sea, thigh no flesh, shin no hair, hands feet calloused, face eyes darkened, thus died outside, buried at Kuaiji, minister captive labor not fiercer than this.' Yet then what valued in having world, how wish bitter form labor spirit, body place traveler inn stay, mouth eat gatekeeper nourishment, hand hold minister captive work? This unworthy person what strive, not worthy person what manage. That worthy person having world, monopolize use world suit self already, this what valued in having world. That called worthy person, must can pacify world govern myriad people, now body moreover cannot benefit, will how can govern world! Pen I wish grant will broad desires, long enjoy world without harm, do what?' Li Si son You as three rivers guard, crowd bandits Wu Guang etc. west seize land, passed not could prohibit. Zhang Han with broken pursued Guang etc. troops, envoys repeatedly examined three rivers mutually connected, blamed reproached Si occupy three dukes position, how make bandits like this. Li Si feared frightened, heavy nobility salary, not know where out, then flattered Second Emperor intent, wished seek favor, with letter replied said:",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "夫賢主者，必且能全道而行督責之術者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "As for worthy rulers, they must be able to preserve the Way and practice the techniques of supervision and accountability."
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "督責之，則臣不敢不竭能以徇其主矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When supervised and held accountable, ministers dare not fail to exhaust their abilities in service to their lord."
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "此臣主之分定，上下之義明，則天下賢不肖莫敢不盡力竭任以徇其君矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When the divisions between minister and lord are fixed, and the righteousness of superior and inferior is clear, then all the worthy and unworthy in the world dare not fail to exhaust their strength and fulfill their duties in service to their ruler."
            }
          ]
        },
        {
          "id": "s0238",
          "zh": "是故主獨制於天下而無所制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore the lord alone controls the world and is controlled by nothing."
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "能窮樂之極矣，賢明之主也，可不察焉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He can exhaust the extremes of pleasure. He is a worthy and enlightened ruler—how can this not be examined!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Worthy lord, must moreover can complete way execute supervise responsibility method. Supervise responsibility them, then ministers dare not not exhaust ability to follow their lord. This minister lord division decided, above below righteousness clear, then world worthy unworthy none dare not exhaust strength exhaust duty to follow their ruler. Thus lord alone controls world without controlled. Can exhaust pleasure extreme, worthy enlightened lord, can not examine!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0240",
          "zh": "故《申子》曰「有天下而不恣睢，命之曰以天下為桎梏」者，無他焉，不能督責，而顧以其身勞於天下之民，若堯、禹然，故謂之「桎梏」也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Master Shen said 'To possess the world without indulging in pleasures is called making the world one's fetters'—there is no other reason than this: one cannot supervise and hold accountable, but instead personally labors for the people of the world, like Yao and Yu, therefore it is called 'fetters.'"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "夫不能修申、韓之明術，行督責之道，專以天下自適也，而徒務苦形勞神，以身徇百姓，則是黔首之役，非畜天下者也，何足貴哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If one cannot cultivate the enlightened techniques of Shen and Han, practice the way of supervision and accountability, but exclusively uses the world to suit oneself, while merely striving to torment the body and exhaust the spirit, serving the common people with one's person, then this is the servant of the black-headed people, not the possessor of the world—what is there to value in this!"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "夫以人徇己，則己貴而人賤；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When people serve oneself, then oneself is noble and people are base;"
            }
          ]
        },
        {
          "id": "s0243",
          "zh": "以己徇人，則己賤而人貴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "when one serves people, then oneself is base and people are noble."
            }
          ]
        },
        {
          "id": "s0244",
          "zh": "故徇人者賤，而人所徇者貴，自古及今，未有不然者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore those who serve others are base, while those served by others are noble—from ancient times to the present, there has never been otherwise."
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "凡古之所為尊賢者，為其貴也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All the ways of antiquity honored the worthy because they were noble;"
            }
          ]
        },
        {
          "id": "s0246",
          "zh": "而所為惡不肖者，為其賤也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "while what was done to condemn the unworthy was because they were base."
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "而堯、禹以身徇天下者也，因隨而尊之，則亦失所為尊賢之心矣，夫可謂大繆矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "But Yao and Yu served the world with their persons. If we follow along and honor them, then we also lose the true heart of honoring the worthy. This can be called a great error."
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "謂之為「桎梏」，不亦宜乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "To call it 'fetters' is not appropriate?"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "不能督責之過也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "It is the error of not being able to supervise and hold accountable."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus Shen Zi said 'have world not indulge wantonly, name it make world fetters' , no other, cannot supervise responsibility, yet look with body labor at world people, like Yao, Yu, thus called 'fetters'. Cannot cultivate Shen, Han clear method, execute supervise responsibility way, monopolize make world suit self, yet vainly manage bitter form labor spirit, with body follow hundred surnames, then is black heads servitude, not rear world, what sufficient value! With person follow self, then self noble person base; With self follow person, then self base person noble. Thus follow person base, person what followed noble, self ancient to now, not have not so. All ancient what make honor worthy, for their noble; What make hate unworthy, for their base. Yet Yao, Yu with body follow world, because follow honor them, then also lose what make honor worthy heart, can call great wrong. Call as 'fetters', not also suitable? Cannot supervise responsibility excess.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "故韓子曰：「慈母有敗子而嚴家無格虜」者，何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Master Han said: 'A kind mother has spoiled sons while a strict household has no recalcitrant slaves'—why is this?"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "則能罰之加焉必也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then the ability to apply punishment is essential."
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "故商君之法，刑棄灰於道者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore in Lord Shang's laws, those who throw ashes in the road are punished."
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "夫棄灰，薄罪也，而被刑，重罰也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now throwing ashes is a minor offense, but receiving punishment is a severe penalty."
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "彼唯明主為能深督輕罪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Only enlightened rulers can deeply supervise minor offenses."
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "夫罪輕且督深，而況有重罪乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If minor offenses are supervised so deeply, how much more so for serious crimes?"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "故民不敢犯也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore the people dare not offend."
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "是故韓子曰「布帛尋常，庸人不釋，鑠金百溢，盜跖不搏」者，非庸人之心重，尋常之利深，而盜跖之欲淺也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Master Han said 'Silk fabrics eight feet long, ordinary people will not release; melted gold a hundred yi, Dao Zhi will not snatch'—this is not because ordinary people's hearts are heavy, the profit of eight feet deep, and Dao Zhi's desires shallow;"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "又不以盜跖之行，為輕百鎰之重也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "nor because they consider Dao Zhi's conduct to be light compared to a hundred yi in weight."
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "搏必隨手刑，則盜跖不搏百鎰；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If snatching is certainly followed by punishment, then Dao Zhi will not snatch a hundred yi;"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "而罰不必行也，則庸人不釋尋常。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "but if punishment is not necessarily applied, then ordinary people will not release eight feet of silk."
            }
          ]
        },
        {
          "id": "s0261",
          "zh": "是故城高五丈，而樓季不輕犯也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore a city wall five zhang high, and Lou Ji will not lightly offend it;"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "泰山之高百仞，而跛羊牧其上。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Mount Tai's height one hundred ren, yet lame sheep graze upon it."
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "夫樓季也而難五丈之限，豈跛羊也而易百仞之高哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now Lou Ji finds difficulty in a five zhang limit, how can lame sheep find it easy to climb one hundred ren in height?"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "峭塹之勢異也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The configuration of steep and deep differs."
            }
          ]
        },
        {
          "id": "s0265",
          "zh": "明主聖王之所以能久處尊位，長執重勢，而獨擅天下之利者，非有異道也，能獨斷而審督責，必深罰，故天下不敢犯也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The reason enlightened rulers and sage kings can long occupy honored positions, perpetually hold weighty authority, and monopolize the world's advantages is not because they have different ways, but because they can make sole decisions and carefully supervise and hold accountable, certainly impose deep punishments, therefore the world dares not offend."
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "今不務所以不犯，而事慈母之所以敗子也，則亦不察於聖人之論矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now if one does not strive for what prevents offenses, but practices what kind mothers do that spoils sons, then one also fails to examine the discussions of the sages."
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "夫不能行聖人之術，則舍為天下役何事哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If one cannot practice the sages' techniques, then what else is there besides becoming the servant of the world?"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "可不哀邪！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Is this not lamentable!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus Han Zi said: 'Benevolent mother have defeated son strict family no disobedient servants' , why? Then can punish add must. Thus Shang Jun method, punish abandon ash on road. Abandon ash, thin crime, yet suffer punish, heavy penalty. They only enlightened lord can deep supervise light crime. Crime light moreover supervise deep, moreover have heavy crime? Thus people dare not offend. Thus Han Zi said 'silk cloth eight chi, common person not release, melt gold hundred yi, Dao Zhi not grab' , not common person heart heavy, eight chi profit deep, Dao Zhi desire shallow; Again not consider Dao Zhi conduct as light hundred jin heavy. Grab must follow hand punish, then Dao Zhi not grab hundred jin; Punish not must execute, then common person not release eight chi. Thus city high five zhang, Lou Ji not lightly offend; Tai mountain high hundred ren, lame sheep herd above. Lou Ji moreover difficult five zhang limit, how lame sheep easy hundred ren high? Steep moat situation different. Enlightened lord sage king what can long dwell honored position, long hold heavy power, alone monopolize world profit, not have different way, can alone decide examine supervise responsibility, must deep punish, thus world dare not offend. Now not manage so not offend, yet do benevolent mother what defeat son, then also not examine sage person discussion. Cannot execute sage person method, then abandon be world servitude what affair! Can not sorrow!",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0269",
          "zh": "且夫儉節仁義之人立於朝，則荒肆之樂輟矣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, if frugal, principled, and righteous people stand in court, then wanton and unrestrained pleasures will cease;"
            }
          ]
        },
        {
          "id": "s0270",
          "zh": "諫說論理之臣閒於側，則流漫之志詘矣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "if remonstrating and reasoning ministers stand at the side, then dissipated intentions will be thwarted;"
            }
          ]
        },
        {
          "id": "s0271",
          "zh": "烈士死節之行顯於世，則淫康之虞廢矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "if the conduct of fierce warriors dying for righteousness becomes prominent in the world, then concerns for licentious ease will be abolished."
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "故明主能外此三者，而獨操主術以制聽從之臣，而修其明法，故身尊而勢重也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore enlightened rulers can exclude these three things, and alone wield the ruler's techniques to control obedient ministers, and cultivate their clear laws, therefore their persons are honored and their authority weighty."
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "凡賢主者，必將能拂世磨俗，而廢其所惡，立其所欲，故生則有尊重之勢，死則有賢明之謚也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All worthy rulers must be able to go against the world and reform customs, abolish what they hate and establish what they desire, therefore in life they have respected authority, in death they have wise posthumous names."
            }
          ]
        },
        {
          "id": "s0274",
          "zh": "是以明君獨斷，故權不在臣也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore enlightened rulers make sole decisions, thus authority is not in the ministers."
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "然後能滅仁義之涂，掩馳說之口，困烈士之行，塞聰揜明，內獨視聽，故外不可傾以仁義烈士之行，而內不可奪以諫說忿爭之辯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then they can extinguish the paths of benevolence and righteousness, silence the mouths of glib persuaders, frustrate the conduct of fierce warriors, block hearing and blind vision, internally monopolize seeing and hearing, therefore externally they cannot be toppled by the conduct of benevolent and righteous fierce warriors, and internally they cannot be deprived by the arguments of remonstrating and contentious disputants."
            }
          ]
        },
        {
          "id": "s0276",
          "zh": "故能犖然獨行恣睢之心而莫之敢逆。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore they can clearly and alone follow their arrogant hearts and none dare oppose them."
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "若此然後可謂能明申、韓之術，而修商君之法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Only like this can one be said to understand the techniques of Shen and Han, and cultivate Lord Shang's laws."
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "法修術明而天下亂者，未之聞也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Laws cultivated and techniques clear yet the world chaotic—such a thing has not been heard of."
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "故曰「王道約而易操」也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore it is said 'The king's way is concise and easy to wield.'"
            }
          ]
        },
        {
          "id": "s0280",
          "zh": "唯明主為能行之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Only enlightened rulers can practice it."
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "若此則謂督責之誠，則臣無邪，臣無邪則天下安，天下安則主嚴尊，主嚴尊則督責必，督責必則所求得，所求得則國家富，國家富則君樂豐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Like this is called the sincerity of supervision and accountability, then ministers have no deviousness, ministers have no deviousness then the world is peaceful, the world peaceful then the ruler is sternly honored, the ruler sternly honored then supervision and accountability is certain, supervision and accountability certain then what is sought is obtained, what is sought obtained then the state is wealthy, the state wealthy then the ruler's pleasures are abundant."
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "故督責之術設，則所欲無不得矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore when the techniques of supervision and accountability are established, then nothing desired cannot be obtained."
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "群臣百姓救過不給，何變之敢圖？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All ministers and common people, saving their faults is not enough—what rebellion would they dare plot?"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "若此則帝道備，而可謂能明君臣之術矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Like this then the imperial way is complete, and can be called understanding the techniques of ruler and minister."
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "雖申、韓復生，不能加也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Even if Shen and Han were reborn, they could not add to it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Moreover frugal moderate benevolent righteous person stand in court, then wild unrestrained pleasure stop; Admonish speak discuss principle ministers at side, then unrestrained will yield; Fierce scholars die integrity conduct appear in world, then licentious peaceful worry abandon. Thus enlightened lord can exclude these three, alone grasp lord method to control listen follow ministers, cultivate clear law, thus body honored power heavy. All worthy lord, must will can brush world polish customs, abandon what hate, establish what desire, thus alive have respected power, dead have worthy enlightened posthumous title. Thus enlightened ruler alone decide, thus power not in ministers. Then can extinguish benevolent righteous path, block gallop speak mouth, distress fierce scholars conduct, block hearing cover clear, inner alone see hear, thus outside cannot incline with benevolent righteous fierce scholars conduct, inner cannot seize with admonish speak resent contend eloquence. Thus can brightly alone act indulge wantonly heart not dare oppose. Like this then can call able clear Shen, Han method, cultivate Shang Jun law. Law cultivate method clear yet world chaos, not heard. Thus said 'king way concise easy grasp'. Only enlightened lord can execute. Like this then call supervise responsibility sincerity, then ministers no evil, ministers no evil then world peaceful, world peaceful then lord strict honored, lord strict honored then supervise responsibility certain, supervise responsibility certain then what seek obtain, what seek obtain then state rich, state rich then lord happy abundant. Thus supervise responsibility method established, then what desire none not obtain. Ministers hundred surnames save excess not sufficient, what change dare plot? Like this then emperor way complete, can call able clear ruler minister method. Though Shen, Han revive, cannot add.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0286",
          "zh": "書奏，二世悅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The memorial was presented, the Second Emperor was pleased."
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "於是行督責益嚴，稅民深者為明吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon supervision and accountability were carried out even more strictly, those who taxed the people deeply were considered enlightened officials."
            }
          ]
        },
        {
          "id": "s0288",
          "zh": "二世曰：「若此則可謂能督責矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor said: 'Like this can be called able to supervise and hold accountable.'"
            }
          ]
        },
        {
          "id": "s0289",
          "zh": "刑者相半於道，而死人日成積於市。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The punished made up half those on the roads, while corpses daily piled up in the markets."
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "殺人眾者為忠臣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Those who killed many were considered loyal ministers."
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "二世曰：「若此則可謂能督責矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor said: 'Like this can be called able to supervise and hold accountable.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Letter submitted, Second Emperor pleased. Thus execute supervise responsibility increasingly strict, tax people deep called clear official. Second Emperor said: 'Like this then can call able supervise responsibility.' Punished mutually half on road, dead people daily piled in market. Kill people many called loyal minister. Second Emperor said: 'Like this then can call able supervise responsibility.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0293",
          "zh": "初，趙高為郎中令，所殺及報私怨眾多，恐大臣入朝奏事毀惡之，乃說二世曰：「天子所以貴者，但以聞聲，群臣莫得見其面，故號曰『朕』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Initially, when Zhao Gao was Commander of the Gentlemen-in-Attendance, those he killed and those he took private revenge on were numerous. Fearing that ministers entering court to present memorials would slander and criticize him, he persuaded the Second Emperor saying: 'What makes the Son of Heaven noble is merely that his voice is heard, all ministers do not get to see his face, therefore he is called 'I the One.''"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "且陛下富於春秋，未必盡通諸事，今坐朝廷，譴舉有不當者，則見短於大臣，非所以示神明於天下也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, Your Majesty is rich in youth, not necessarily fully versed in all affairs. Now sitting in court, if reprimands and promotions are improper, then shortcomings will be seen by ministers, not the way to display divine wisdom to the world."
            }
          ]
        },
        {
          "id": "s0295",
          "zh": "且陛下深拱禁中，與臣及侍中習法者待事，事來有以揆之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, Your Majesty deeply withdraws within the forbidden palace, with me and the attendants versed in law waiting on affairs, when matters come they can be measured against it."
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "如此則大臣不敢奏疑事，天下稱聖主矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Like this then ministers dare not present doubtful matters, the world will call the ruler a sage.'"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "二世用其計，乃不坐朝廷見大臣，居禁中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor adopted his plan, and no longer sat in court to see ministers, dwelling in the inner palace."
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "趙高常侍中用事，事皆決於趙高。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao constantly attended in the inner chambers handling affairs, all matters were decided by Zhao Gao."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Initially, Zhao Gao as langzhong commander, what killed and repaid private enmity many, feared ministers enter court memorial affairs slander hate him, then persuaded Second Emperor said: 'Emperor what noble, only with hear sound, ministers none get see face, thus number 'Zhen'. Moreover Your Majesty rich in youth, not must all understand various affairs, now sit court, dispatch raise have improper, then seen short by ministers, not what show divine clear to world. Moreover Your Majesty deep bow forbidden middle, with minister and serving middle practice law wait affairs, affairs come have to measure. Like this then ministers dare not memorial doubtful affairs, world praise sage lord.' Second Emperor used his plan, then not sit court see ministers, dwell forbidden middle. Zhao Gao constantly serve middle manage affairs, affairs all decided by Zhao Gao.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0299",
          "zh": "高聞李斯以為言，乃見丞相曰：「關東群盜多，今上急益發繇治阿房宮，聚狗馬無用之物。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao heard that Li Si had words about this, then saw the chancellor and said: 'Bandits in the east are numerous, now the emperor urgently increases the levies to build the Epang Palace, gathering dogs, horses, and useless things.'"
            }
          ]
        },
        {
          "id": "s0300",
          "zh": "臣欲諫，為位賤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "I wish to remonstrate, but my position is lowly.'"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "此真君侯之事，君何不諫？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This is truly the affair of my lord, why does my lord not remonstrate?'"
            }
          ]
        },
        {
          "id": "s0302",
          "zh": "李斯曰：「固也，吾欲言之久矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si said: 'Indeed, I have long wished to speak of it.'"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "今時上不坐朝廷，上居深宮，吾有所言者，不可傳也，欲見無閒。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now the emperor does not sit in court, the emperor dwells in the deep palace. What I have to say cannot be transmitted, I wish to see him but there is no opportunity.'"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "趙高謂曰：「君誠能諫，請為君候上閒語君。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao said to him: 'If my lord truly can remonstrate, I request to wait for the emperor's leisure and speak to him for my lord.'"
            }
          ]
        },
        {
          "id": "s0305",
          "zh": "於是趙高待二世方燕樂，婦女居前，使人告丞相：「上方閒，可奏事。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon Zhao Gao waited until the Second Emperor was indulging in feasting and pleasure, with women before him, then sent someone to tell the chancellor: 'The emperor is now at leisure, memorials can be presented.'"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "丞相至宮門上謁，如此者三。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The chancellor came to the palace gate and made his petition, like this three times."
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "二世怒曰：「吾常多閒日，丞相不來。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor angrily said: 'I often have many idle days, yet the chancellor does not come.'"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "吾方燕私，丞相輒來請事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When I am indulging in private feasting, the chancellor immediately comes to request affairs.'"
            }
          ]
        },
        {
          "id": "s0309",
          "zh": "丞相豈少我哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Does the chancellor think little of me?'"
            }
          ]
        },
        {
          "id": "s0310",
          "zh": "且固我哉？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "And moreover, does he take me for granted?'"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "趙高因曰：「如此殆矣！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao then said: 'This is dangerous!'"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "夫沙丘之謀，丞相與焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "As for the Shaqiu plot, the chancellor was involved in it.'"
            }
          ]
        },
        {
          "id": "s0313",
          "zh": "今陛下已立為帝，而丞相貴不益，此其意亦望裂地而王矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now Your Majesty has been established as emperor, yet the chancellor's nobility has not increased. His intentions also hope to carve out land and become a king.'"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "且陛下不問臣，臣不敢言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, if Your Majesty does not ask me, I dare not speak.'"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "丞相長男李由為三川守，楚盜陳勝等皆丞相傍縣之子，以故楚盜公行，過三川，城守不肯擊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The chancellor's eldest son Li You is governor of Sanchuan. The Chu bandits Chen Sheng and others are all sons of counties adjacent to the chancellor's. For this reason the Chu bandits roam openly, passing through Sanchuan, the city guards refuse to attack.'"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "高聞其文書相往來，未得其審，故未敢以聞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "I, Gao, have heard that letters pass back and forth between them, but have not obtained the details, therefore I have not dared to report it.'"
            }
          ]
        },
        {
          "id": "s0317",
          "zh": "且丞相居外，權重於陛下。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, the chancellor resides abroad, his authority is heavier than Your Majesty's.'"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "二世以為然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor considered it so."
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "欲案丞相，恐其不審，乃使人案驗三川守與盜通狀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Wishing to investigate the chancellor, fearing it might not be accurate, he sent people to investigate the situation of the Sanchuan governor colluding with bandits."
            }
          ]
        },
        {
          "id": "s0320",
          "zh": "李斯聞之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si heard of it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Gao heard Li Si with speak, then saw chancellor said: 'Pass east crowd bandits many, now above urgent increase send corvee treat Epang palace, gather dogs horses useless things. Minister wish admonish, position base. This true lord marquis affair, lord why not admonish?' Li Si said: 'Certainly, I wish speak long. Now time above not sit court, above dwell deep palace, I have speak, cannot transmit, wish see no interval.' Zhao Gao told: 'Lord truly can admonish, please for lord wait above leisure speak lord.' Thus Zhao Gao waited Second Emperor just feast pleasure, women dwell front, made person tell chancellor: 'Above just leisure, can memorial affairs.' Chancellor to palace gate above audience, like this three times. Second Emperor angered said: 'I often many leisure days, chancellor not come. I just feast private, chancellor immediately come request affairs. Chancellor how little me? Moreover firmly mock me?' Zhao Gao thus said: 'Like this dangerous! That Shaqiu plot, chancellor with participate. Now Your Majesty already established as emperor, yet chancellor noble not increase, this his intent also hope split land become king. Moreover Your Majesty not ask minister, minister dare not speak. Chancellor eldest son Li You as three rivers guard, Chu bandits Chen Sheng etc. all chancellor side county sons, thus Chu bandits public act, pass three rivers, city guard not willing attack. Gao heard their letters mutually go come, not obtain its truth, thus not dare with hear. Moreover chancellor dwell outside, power heavy over Your Majesty.' Second Emperor considered correct. Wished investigate chancellor, feared not careful, then made person investigate verify three rivers guard with bandits communicate situation. Li Si heard.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0321",
          "zh": "是時二世在甘泉，方作觳抵優俳之觀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "At this time the Second Emperor was at Ganquan, just then performing the spectacle of jar-striking, thigh-slapping, actors, and jesters."
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "李斯不得見，因上書言趙高之短曰：「臣聞之，臣疑其君，無不危國；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si was unable to gain an audience, therefore he submitted a memorial speaking of Zhao Gao's faults, saying: 'I have heard that when ministers suspect their ruler, none fail to endanger the state;'"
            }
          ]
        },
        {
          "id": "s0323",
          "zh": "妾疑其夫，無不危家。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "when concubines suspect their husbands, none fail to endanger the family.'"
            }
          ]
        },
        {
          "id": "s0324",
          "zh": "今有大臣於陛下擅利擅害，與陛下無異，此甚不便。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now there is a great minister who monopolizes benefit and harm toward Your Majesty, no different from Your Majesty himself. This is extremely inconvenient.'"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "昔者司城子罕相宋，身行刑罰，以威行之，朞年遂劫其君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "In former times, Si Cheng Zi Han served as chancellor of Song. He personally administered punishments, ruling through terror. Within a year he usurped his lord.'"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "田常為簡公臣，爵列無敵於國，私家之富與公家均，布惠施德，下得百姓，上得群臣，陰取齊國，殺宰予於庭，即弒簡公於朝，遂有齊國。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Tian Chang served as minister to Duke Jian of Qi. His noble rank was unequaled in the state, his private wealth equaled the public treasury. He spread favors and bestowed kindness, winning the common people below and the ministers above. He secretly seized Qi, killed Zai Yu in the court, then assassinated Duke Jian in the audience hall, and thus possessed Qi.'"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "此天下所明知也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This is clearly known throughout the world.'"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "今高有邪佚之志，危反之行，如子罕相宋也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now Gao has the ambitions of deviance and licentiousness, the conduct of peril and rebellion, like Zi Han serving as chancellor of Song;'"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "私家之富，若田氏之於齊也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "his private wealth, like the Tian family's in Qi.'"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "兼行田常、子罕之逆道而劫陛下之威信，其志若韓玘為韓安相也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He combines the rebellious ways of Tian Chang and Zi Han to usurp Your Majesty's authority and credibility. His ambitions are like Han Kui serving as chancellor for Marquis An of Han.'"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "陛下不圖，臣恐其為變也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If Your Majesty does not plan for this, I fear he will rebel.'"
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "二世曰：「何哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor said: 'What?'"
            }
          ]
        },
        {
          "id": "s0333",
          "zh": "夫高，故宦人也，然不為安肆志，不以危易心，絜行修善，自使至此，以忠得進，以信守位，朕實賢之，而君疑之，何也？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao is originally a eunuch, yet he did not indulge his ambitions in safety, did not change his heart in danger, purified his conduct and cultivated goodness, thus advancing himself to this position. He advanced through loyalty, guards his position through trustworthiness. I truly consider him worthy, yet you suspect him. Why is this?'"
            }
          ]
        },
        {
          "id": "s0334",
          "zh": "且朕少失先人，無所識知，不習治民，而君又老，恐與天下絕矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, I lost my father early, know nothing of affairs, am not practiced in governing the people, and you are old. I fear being cut off from the world.'"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "朕非屬趙君，當誰任哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If I do not entrust myself to Lord Zhao, to whom should I entrust myself?'"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "且趙君為人精廉彊力，下知人情，上能適朕，君其勿疑。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, Lord Zhao is a man of refined integrity and strong ability, understands human affairs below, and can accommodate me above. You should not suspect him.'"
            }
          ]
        },
        {
          "id": "s0337",
          "zh": "李斯曰：「不然。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si said: 'Not so.'"
            }
          ]
        },
        {
          "id": "s0338",
          "zh": "夫高，故賤人也，無識於理，貪欲無厭，求利不止，列勢次主，求欲無窮，臣故曰殆。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao is originally a base person, without understanding of principle, greedy desires without satisfaction, seeking profit without cease, ranked in power next to the ruler, seeking desires without limit. I therefore said he is dangerous.'"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "二世已前信趙高，恐李斯殺之，乃私告趙高。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "The Second Emperor had already trusted Zhao Gao before, feared Li Si would kill him, therefore secretly told Zhao Gao."
            }
          ]
        },
        {
          "id": "s0340",
          "zh": "高曰：「丞相所患者獨高，高已死，丞相即欲為田常所為。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao said: 'The chancellor fears only Gao. If Gao were dead, the chancellor would immediately do what Tian Chang did.'"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "於是二世曰：「其以李斯屬郎中令！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon the Second Emperor said: 'Entrust Li Si to the Commander of the Gentlemen-in-Attendance!'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "At time Second Emperor at Gan Quan, just make hub di excellent pai of view. Li Si could not see, thus submitted letter speak Zhao Gao short: 'Minister heard, minister doubt his lord, none not danger state; Concubine doubt her husband, none not danger family. Now have great minister at Your Majesty monopolize benefit monopolize harm, with Your Majesty no different, this very inconvenient. Former Si Cheng Zi Han as Song chancellor, body execute punishment, with might execute, one year then kidnap his lord. Tian Chang as Jian Gong minister, rank column without enemy in state, private family rich with public family equal, spread favor apply virtue, below get hundred surnames, above get ministers, secretly take Qi state, kill Zai Yu at court, then assassinated Jian Gong at court, thus had Qi state. This world all clearly know. Now Gao have evil licentious will, danger rebel conduct, like Zi Han as Song chancellor; Private family rich, like Tian clan at Qi. Combined execute Tian Chang, Zi Han reverse way kidnap Your Majesty might trust, his will like Han Wei as Han An chancellor. Your Majesty not plan, minister fear his become change.' Second Emperor said: 'What? Gao, former eunuch person, yet not for safe unrestrained intent, not with danger change heart, pure conduct cultivate good, self make to this, with loyal get advance, with trust guard position, I truly consider worthy, yet lord doubt, why? Moreover I young lose previous person, no know identify, not practice govern people, yet lord again old, fear with world cut. I not entrust Zhao Jun, should who employ? Moreover Zhao Jun as person refined clean strong force, below know people feeling, above can suit me, lord not doubt.' Li Si said: 'Not so. Gao, former base person, no know reason, greedy desire no sate, seek profit not stop, arrange power next lord, seek desire no end, minister thus said dangerous.' Second Emperor already front trust Zhao Gao, fear Li Si kill him, thus secretly told Zhao Gao. Gao said: 'Chancellor what fear only Gao, Gao already dead, chancellor then wish do Tian Chang what.' Thus Second Emperor said: 'Then with Li Si entrust langzhong commander!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0343",
          "zh": "趙高案治李斯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao investigated and punished Li Si."
            }
          ]
        },
        {
          "id": "s0344",
          "zh": "李斯拘執束縛，居囹圄中，仰天而嘆曰：「嗟乎，悲夫！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si was arrested and bound, dwelling in prison, gazing up at heaven and sighing: 'Alas, how sad!'"
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "不道之君，何可為計哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "For an unprincipled ruler, what plans can be made!"
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "昔者桀殺關龍逢，紂殺王子比干，吳王夫差殺伍子胥。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "In former times Jie killed Guan Longfeng, Zhou killed Prince Bigan, King Fuchai of Wu killed Wu Zixu.'"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "此三臣者，豈不忠哉，然而不免於死，身死而所忠者非也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "These three ministers, were they not loyal? Yet they could not avoid death, dying for what they were loyal to was wrong.'"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "今吾智不及三子，而二世之無道過於桀、紂、夫差，吾以忠死，宜矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now my wisdom does not match these three men, yet the Second Emperor's lack of principle exceeds Jie, Zhou, and Fuchai. That I die for loyalty is fitting.'"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "且二世之治豈不亂哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover, is not the Second Emperor's governance chaotic!'"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "日者夷其兄弟而自立也，殺忠臣而貴賤人，作為阿房之宮，賦斂天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Recently he slaughtered his brothers and established himself, killed loyal ministers and honored base people, built the Epang Palace, levied taxes on the world.'"
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "吾非不諫也，而不吾聽也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "It is not that I did not remonstrate, but he did not listen to me.'"
            }
          ]
        },
        {
          "id": "s0352",
          "zh": "凡古聖王，飲食有節，車器有數，宮室有度，出令造事，加費而無益於民利者禁，故能長久治安。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All ancient sage kings had moderation in food and drink, limits on carriages and utensils, measurements for palaces, issued commands and created affairs, prohibited expenditures that added cost without benefiting the people's interests, therefore they could endure long in peace and security.'"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "今行逆於昆弟，不顧其咎；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now he acts contrary to his brothers, does not consider the blame;"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "侵殺忠臣，不思其殃；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He invades and kills loyal ministers, does not think of the calamity;"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "大為宮室，厚賦天下，不愛其費：三者已行，天下不聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "He greatly builds palaces, heavily taxes the world, does not cherish the expense: these three things are already done, the world will not obey."
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "今反者已有天下之半矣，而心尚未寤也，而以趙高為佐，吾必見寇至咸陽，麋鹿游於朝也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now the rebels already have half of the world, yet his heart has not yet awakened, and he takes Zhao Gao as assistant, I will surely see bandits reach Xianyang, deer roam in the court."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zhao Gao investigate treat Li Si. Li Si constrained grasped bound, dwell prison middle, face heaven sigh: 'Alas, sorrow! Not way lord, how can plan! Former Jie kill Guan Long Feng, Zhou kill Wang Zi Bi Gan, Wu Wang Fu Cha kill Wu Zi Xu. These three ministers, how not loyal, yet not avoid die, body die yet what loyal not correct. Now my wisdom not reach three sons, yet Second Emperor no way over Jie, Zhou, Fu Cha, I with loyal die, suitable. Moreover Second Emperor govern how not chaos! Previously exterminate his brothers self establish, kill loyal ministers honor base people, make Epang palace, tax levy world. I not not admonish, yet not listen me. All ancient sage kings, eat drink have limit, chariot vessels have number, palace rooms have degree, issue order make affairs, add expense without benefit people profit prohibit, thus can long lasting peaceful govern. Now act reverse to brothers, not consider guilt; Invade kill loyal ministers, not think calamity; Great make palace rooms, thick tax world, not love expense: three already execute, world not listen. Now oppose already have world half, yet heart not yet awaken, yet with Zhao Gao as assistant, I must see bandit reach Xianyang, deer roam court.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0358",
          "zh": "於是二世乃使高案丞相獄，治罪，責斯與子由謀反狀，皆收捕宗族賓客。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon the Second Emperor made Gao investigate the Chancellor prison, prosecute the crime, blame Si and Ziyou for plotting rebellion appearances, all arrested clan and guests."
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "趙高治斯，榜掠千餘，不勝痛，自誣服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao interrogated Si, whipped more than a thousand times, could not bear the pain, falsely confessed himself."
            }
          ]
        },
        {
          "id": "s0360",
          "zh": "斯所以不死者，自負其辯，有功，實無反心，幸得上書自陳，幸二世之寤而赦之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "What Si relied on to not die was relying on his eloquence, having merit, truly having no rebellious heart, luckily able to memorialize and explain himself, luckily the Second Emperor would awaken and pardon him."
            }
          ]
        },
        {
          "id": "s0361",
          "zh": "李斯乃從獄中上書曰：「臣為丞相治民，三十餘年矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si then from prison memorialized saying: 'Your servant as Chancellor governing the people, more than thirty years already."
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "逮秦地之陜隘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Reached Qin territory's narrowness."
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "先王之時秦地不過千里，兵數十萬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "In the former kings' time Qin territory did not exceed a thousand li, troops several hundred thousand."
            }
          ]
        },
        {
          "id": "s0364",
          "zh": "臣盡薄材，謹奉法令，陰行謀臣，資之金玉，使游說諸侯，陰修甲兵，飾政教，官鬬士，尊功臣，盛其爵祿，故終以脅韓弱魏，破燕、趙，夷齊、楚，卒兼六國，虜其王，立秦為天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Your servant exhausted meager talent, respectfully obeyed laws and commands, secretly dispatched strategists, provided them gold and jade, made them persuade the feudal lords, secretly repaired armor and weapons, embellished government and teachings, appointed warriors, honored meritorious ministers, increased their ranks and emoluments, therefore finally intimidated Han weakened Wei, broke Yan Zhao, leveled Qi Chu, finally united the six states, captured their kings, established Qin as Son of Heaven."
            }
          ]
        },
        {
          "id": "s0365",
          "zh": "罪一矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime one already."
            }
          ]
        },
        {
          "id": "s0366",
          "zh": "地非不廣，又北逐胡、貉，南定百越，以見秦之彊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Territory not not broad, moreover north drove out Xiongnu Malgal, south pacified Baiyue, to show Qin's strength."
            }
          ]
        },
        {
          "id": "s0367",
          "zh": "罪二矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime two already."
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "尊大臣，盛其爵位，以固其親。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Honored great ministers, increased their ranks and positions, to solidify their closeness."
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "罪三矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime three already."
            }
          ]
        },
        {
          "id": "s0370",
          "zh": "立社稷，修宗廟，以明主之賢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Established the altars of soil and grain, repaired the ancestral temple, to clarify the ruler's virtue."
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "罪四矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime four already."
            }
          ]
        },
        {
          "id": "s0372",
          "zh": "更剋畫，平斗斛度量文章，布之天下，以樹秦之名。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Further delineated, leveled dou peck measures weights standards writings, spread them throughout the world, to establish Qin's reputation."
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "罪五矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime five already."
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "治馳道，興游觀，以見主之得意。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Built imperial highways, raised pleasure palaces, to show the ruler's satisfaction."
            }
          ]
        },
        {
          "id": "s0375",
          "zh": "罪六矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime six already."
            }
          ]
        },
        {
          "id": "s0376",
          "zh": "緩刑罰，薄賦斂，以遂主得眾之心，萬民戴主，死而不忘。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Relaxed punishments, lightened taxes and levies, to fulfill the ruler's desire to win the people's hearts, the myriad people cherish the ruler, die without forgetting."
            }
          ]
        },
        {
          "id": "s0377",
          "zh": "罪七矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crime seven already."
            }
          ]
        },
        {
          "id": "s0378",
          "zh": "若斯之為臣者，罪足以死固久矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Such as this serving as minister, crimes sufficient to die certainly long already."
            }
          ]
        },
        {
          "id": "s0379",
          "zh": "上幸盡其能力，乃得至今，願陛下察之！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Your Majesty fortunately exhausted his abilities, only then reached today, wish Your Majesty investigate it!"
            }
          ]
        },
        {
          "id": "s0380",
          "zh": "書上，趙高使吏棄去不奏，曰：「囚安得上書！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Memorial presented, Zhao Gao made clerk discard it not present, said: 'How can prisoner memorialize!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Thus Second Emperor made Gao investigate chancellor prison, treat crime, blame Si with son You plot rebel situation, all seize capture clan guests. Zhao Gao treat Si, beat lash thousand plus, not endure pain, self falsely confess. Si what not die, self bear his eloquence, have merit, truly no rebel heart, fortunate get submit letter self state, fortunate Second Emperor awaken pardon. Li Si then from prison middle submit letter: 'Minister as chancellor govern people, thirty plus years. Reach Qin land narrow narrow. Previous king time Qin land not over thousand li, troops several ten thousand. Minister exhaust thin talent, respectfully follow law orders, secretly execute plot ministers, provide gold jade, make wander persuade feudal lords, secretly cultivate armor troops, adorn government teaching, manage fight scholars, honor merit ministers, flourish their rank salary, thus finally with threaten Han weaken Wei, break Yan, Zhao, level Qi, Chu, finally unite six states, capture their kings, establish Qin as emperor. Crime one. Land not not broad, again north pursue Hu, Mo, south decide hundred Yue, to see Qin strong. Crime two. Honor ministers, flourish their rank position, to solidify close. Crime three. Establish state altars, cultivate ancestral temples, to clarify lord worthy. Crime four. Change carve draw, level dou hu measure amount writings, spread world, to establish Qin name. Crime five. Treat gallop roads, raise tour views, to see lord get intent. Crime six. Relax punishment, thin tax levy, to follow lord get crowd heart, myriad people wear lord, die not forget. Crime seven. Like Si as minister, crime sufficient die certainly long. Above fortunate exhaust ability, then get to now, wish Your Majesty examine!' Letter submitted, Zhao Gao made officials discard not present, said: 'Prisoner how can submit letter!'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0382",
          "zh": "趙高使其客十餘輩詐為御史、謁者、侍中，更往覆訊斯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao made his retainers more than ten fake as imperial secretaries, introducers, palace attendants, repeatedly go verify interrogate Si."
            }
          ]
        },
        {
          "id": "s0383",
          "zh": "斯更以其實對，輒使人復榜之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Si again with his actual reply, then made people again beat him."
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "後二世使人驗斯，斯以為如前，終不敢更言，辭服。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Later the Second Emperor sent people verify Si, Si thought as before, ultimately dared not change words, pleaded guilty."
            }
          ]
        },
        {
          "id": "s0385",
          "zh": "奏當上，二世喜曰：「微趙君，幾為丞相所賣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Memorial presented above, Second Emperor happy said: 'Without Lord Zhao, almost deceived by Chancellor.'"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "及二世所使案三川之守至，則項梁已擊殺之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When the Second Emperor's envoy sent to investigate Sanchuan's governor arrived, then Xiang Liang already struck and killed him."
            }
          ]
        },
        {
          "id": "s0387",
          "zh": "使者來，會丞相下吏，趙高皆妄為反辭。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Envoy came, met Chancellor subordinate officials, Zhao Gao all falsely made rebellion statements."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zhao Gao made his guests ten plus falsely as imperial secretaries, ye zhe, serving middle, again go repeat question Si. Si again with truth reply, immediately made person again beat. After Second Emperor made person verify Si, Si considered like front, end dare not again speak, words confess. Present when upper, Second Emperor pleased said: 'Without Zhao Jun, almost sold by chancellor.' When Second Emperor made investigate three rivers guard arrive, then Xiang Liang already attacked kill him. Envoy come, meet chancellor send officials, Zhao Gao all falsely made rebel words.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0388",
          "zh": "二世二年七月，具斯五刑，論腰斬咸陽市。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor second year seventh month, subjected Si to five punishments, sentenced to waist beheading Xianyang marketplace."
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "斯出獄，與其中子俱執，顧謂其中子曰：「吾欲與若復牽黃犬俱出上蔡東門逐狡兔，豈可得乎！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Si exited prison, with his middle son both seized, turned to tell his middle son said: 'I wish with you again lead yellow dog together exit Shangcai east gate chase cunning rabbit, how can obtain!'"
            }
          ]
        },
        {
          "id": "s0390",
          "zh": "遂父子相哭，而夷三族。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then father and son mutually wept, and exterminated three clans."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Second Emperor second year seventh month, prepare Si five punishments, judge waist behead Xianyang market. Si exit prison, with middle son both grasped, look back told middle son: 'I wish with you again lead yellow dog together exit Shangcai east gate chase cunning rabbit, how can obtain!' Thus father son mutually cry, exterminate three clans.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0391",
          "zh": "李斯已死，二世拜趙高為中丞相，事無大小輒決於高。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Li Si already dead, Second Emperor appointed Zhao Gao as Chief Chancellor, matters regardless of size all decided by Gao."
            }
          ]
        },
        {
          "id": "s0392",
          "zh": "高自知權重，乃獻鹿，謂之馬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao himself knew authority heavy, then presented deer, called it horse."
            }
          ]
        },
        {
          "id": "s0393",
          "zh": "二世問左右：「此乃鹿也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor asked attendants: 'This is deer?'"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "左右皆曰「馬也」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Attendants all said 'horse also'."
            }
          ]
        },
        {
          "id": "s0395",
          "zh": "二世驚，自以為惑，乃召太卜，令卦之，太卜曰：「陛下春秋郊祀，奉宗廟鬼神，齋戒不明，故至于此。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor startled, himself thought confused, then summoned Grand Diviner, ordered divine it, Grand Diviner said: 'Your Majesty spring autumn suburban sacrifices, serve ancestral temple spirits deities, fasting purification not clear, therefore reached this."
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "可依盛德而明齋戒。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Can rely on flourishing virtue and clarify fasting purification.'"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "於是乃入上林齋戒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon then entered Shanglin to fast and purify."
            }
          ]
        },
        {
          "id": "s0398",
          "zh": "日游弋獵，有行人入上林中，二世自射殺之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Daily roamed shooting hunting, had traveler enter Shanglin midst, Second Emperor personally shot killed him."
            }
          ]
        },
        {
          "id": "s0399",
          "zh": "趙高教其女婿咸陽令閻樂劾不知何人賊殺人移上林。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao instructed his son-in-law Xianyang magistrate Yan Le impeach not know what person bandit killed person moved to Shanglin."
            }
          ]
        },
        {
          "id": "s0400",
          "zh": "高乃諫二世曰：「天子無故賊殺不辜人，此上帝之禁也，鬼神不享，天且降殃，當遠避宮以禳之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao then admonished Second Emperor said: 'Son of Heaven without cause bandit kills innocent person, this Supreme Lord's prohibition, spirits deities not accept offerings, Heaven moreover will descend calamity, should distant avoid palace to exorcise it.'"
            }
          ]
        },
        {
          "id": "s0401",
          "zh": "二世乃出居望夷之宮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor then exited resided Wangyi Palace."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Li Si already dead, Second Emperor appoint Zhao Gao as middle chancellor, affairs no small big immediately decided by Gao. Gao self know power heavy, then offered deer, called horse. Second Emperor asked left right: 'This deer?' Left right all said 'horse'. Second Emperor startled, self considered confused, then summoned grand diviner, commanded divine, grand diviner said: 'Your Majesty spring autumn suburban sacrifice, serve ancestral temples ghosts gods, fast not clear, thus to this. Can rely flourishing virtue clear fast.' Thus then enter Shanglin fast. Day tour shoot hunt, had traveler enter Shanglin middle, Second Emperor self shoot kill him. Zhao Gao taught his son-in-law Xianyang commander Yan Le impeach not know what person thief kill person shift Shanglin. Gao then admonished Second Emperor: 'Emperor without reason thief kill innocent person, this heaven forbid, ghosts gods not enjoy, heaven will descend calamity, should far avoid palace to avoid.' Second Emperor then exit dwell Wang Yi palace.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0402",
          "zh": "留三日，趙高詐詔衛士，令士皆素服持兵內鄉，入告二世曰：「山東群盜兵大至！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Remained three days, Zhao Gao falsely decreed guards, ordered soldiers all plain clothes held weapons inward facing, entered reported Second Emperor said: 'Eastern mountains group bandits troops greatly arrive!'"
            }
          ]
        },
        {
          "id": "s0403",
          "zh": "二世上觀而見之，恐懼，高既因劫令自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor ascended observed and saw them, fearful, Gao then because coerced ordered suicide."
            }
          ]
        },
        {
          "id": "s0404",
          "zh": "引璽而佩之，左右百官莫從；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Pulled seal and wore it, attendants officials none followed;"
            }
          ]
        },
        {
          "id": "s0405",
          "zh": "上殿，殿欲壞者三。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ascended hall, hall wished to collapse three times."
            }
          ]
        },
        {
          "id": "s0406",
          "zh": "高自知天弗與，群臣弗許，乃召始皇弟，授之璽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao himself knew Heaven not with, ministers not permitted, then summoned First Emperor younger brother, gave him seal."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Stay three days, Zhao Gao falsely decree guards, commanded scholars all plain clothes hold weapons inner face, enter tell Second Emperor: 'East mountains crowd bandits troops big arrive!' Second Emperor ascend observe see, fear frightened, Gao already because kidnap commanded suicide. Pull seal hang, left right hundred officials none follow; Ascend hall, hall wish collapse three. Gao self know heaven not give, ministers not permit, then summoned Shi Huang younger brother, gave seal.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0407",
          "zh": "子嬰既位，患之，乃稱疾不聽事，與宦者韓談及其子謀殺高。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ziying already enthroned, worried about it, then claimed illness not attended affairs, with eunuch Han Tan and his son plotted kill Gao."
            }
          ]
        },
        {
          "id": "s0408",
          "zh": "高上謁，請病，因召入，令韓談刺殺之，夷其三族。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao ascended audience, inquired illness, because summoned entered, ordered Han Tan stab kill him, exterminated his three clans."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zi Ying already position, worried, then called illness not listen affairs, with eunuch Han Tan and son plan kill Gao. Gao ascend audience, request illness, because summoned enter, commanded Han Tan stab kill, exterminate three clans.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0409",
          "zh": "子嬰立三月，沛公兵從武關入，至咸陽，群臣百官皆畔，不適。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ziying enthroned three months, Duke of Pei troops from Wuguan entered, arrived Xianyang, ministers officials all rebelled, not suitable."
            }
          ]
        },
        {
          "id": "s0410",
          "zh": "子嬰與妻子自系其頸以組，降軹道旁。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ziying with wife children themselves tied their necks with cord, surrendered beside Zhidao."
            }
          ]
        },
        {
          "id": "s0411",
          "zh": "沛公因以屬吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Duke of Pei therefore with subordinate officials."
            }
          ]
        },
        {
          "id": "s0412",
          "zh": "項王至而斬之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Xiang King arrived and beheaded him."
            }
          ]
        },
        {
          "id": "s0413",
          "zh": "遂以亡天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then therefore lost the world."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zi Ying establish three months, Pei Gong troops from Wu Guan enter, reach Xianyang, ministers hundred officials all rebel, not proper. Zi Ying with wife children self tie neck with cord, surrender Zhi Dao side. Pei Gong because give to officials. Xiang Wang arrive then behead. Thus with lose world.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0414",
          "zh": "太史公曰：李斯以閭閻歷諸侯，入事秦，因以瑕釁，以輔始皇，卒成帝業，斯為三公，可謂尊用矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Grand Historian said: Li Si from humble gate passed through feudal lords, entered served Qin, because with flaw dispute, assisted First Emperor, finally completed imperial enterprise, Si became Three Dukes, can be called honored employed."
            }
          ]
        },
        {
          "id": "s0415",
          "zh": "斯知六藝之歸，不務明政以補主上之缺，持爵祿之重，阿順茍合，嚴威酷刑，聽高邪說，廢適立庶。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Si knew Six Arts' purpose, not devoted enlightened government to supplement ruler's deficiencies, held rank emolument's weight, flattered complied casually united, severe authority cruel punishments, listened Gao's wicked words, discarded legitimate established concubine's son."
            }
          ]
        },
        {
          "id": "s0416",
          "zh": "諸侯已畔，斯乃欲諫爭，不亦末乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Feudal lords already rebelled, Si then wished remonstrate dispute, not also late!"
            }
          ]
        },
        {
          "id": "s0417",
          "zh": "人皆以斯極忠而被五刑死，察其本，乃與俗議之異。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "People all take Si extremely loyal yet suffered five punishments died, examine its root, then with common opinion different."
            }
          ]
        },
        {
          "id": "s0418",
          "zh": "不然，斯之功且與周、召列矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Not so, Si's merit moreover with Zhou Shao ranked."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Grand Historian said: Li Si with alley door through feudal lords, enter serve Qin, take advantage flaws, assist Shi Huang, finally complete emperor enterprise, Si as three dukes, can call honored used. Si know six arts return, not manage clear government supplement lord above deficiency, hold rank salary heavy, flatter follow casual match, strict might cruel punishment, listen Gao evil speech, abolish proper establish concubine. Feudal lords already rebel, Si then wish admonish contend, not also late! People all consider Si extreme loyal yet suffer five punishments die, examine its root, then with vulgar discuss different. Not so, Si merit moreover with Zhou, Zhao listed.",
          "idiomatic": null
        }
      ]
    }
  ]
}