{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "088",
    "url": "https://chinesenotes.com/shiji/shiji088.html",
    "title": {
      "zh": "蒙恬列傳",
      "en": "Biography of Meng Tian",
      "raw": "《蒙恬列傳》 Biography of Meng Tian"
    },
    "sentenceCount": 100,
    "translatedCount": 100,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:14.654Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "蒙恬者，其先齊人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Meng Tian, his ancestors were Qi people.",
              "idiomatic": "Meng Tian's ancestors were from the state of Qi."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "恬大父蒙驁，自齊事秦昭王，官至上卿。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Tian grandfather Meng Ao, from Qi served Qin Zhao King, official position reached High Minister.",
              "idiomatic": "Meng Tian's grandfather was Meng Ao, who left Qi to serve King Zhao of Qin and rose to the position of High Minister."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "秦莊襄王元年，蒙驁為秦將，伐韓，取成皋、滎陽，作置三川郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Qin Zhuangxiang King first year, Meng Ao as Qin general, attacked Han, took Chenggao Yingyang, established set up Sanchuan commandery.",
              "idiomatic": "In the first year of King Zhuangxiang of Qin, Meng Ao served as a Qin general, attacked Han, captured Chenggao and Yingyang, and established the Sanchuan commandery."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "二年，蒙驁攻趙，取三十七城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Second year, Meng Ao attacked Zhao, took thirty-seven cities.",
              "idiomatic": "In the second year, Meng Ao attacked Zhao and captured thirty-seven cities."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "始皇三年，蒙驁攻韓，取十三城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shihuang third year, Meng Ao attacked Han, took thirteen cities.",
              "idiomatic": "In the third year of the First Emperor, Meng Ao attacked Han and captured thirteen cities."
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "五年，蒙驁攻魏，取二十城，作置東郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Fifth year, Meng Ao attacked Wei, took twenty cities, established set up Dong commandery.",
              "idiomatic": "In the fifth year, Meng Ao attacked Wei, captured twenty cities, and established the Dong commandery."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "始皇七年，蒙驁卒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Shihuang seventh year, Meng Ao died.",
              "idiomatic": "In the seventh year of the First Emperor, Meng Ao died."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "驁子曰武，武子曰恬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ao son called Wu, Wu son called Tian.",
              "idiomatic": "Meng Ao's son was called Wu, and Wu's son was called Tian."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "恬嘗書獄典文學。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Tian once studied penal law classics literature.",
              "idiomatic": "Meng Tian once studied the classics of penal law and literature."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "始皇二十三年，蒙武為秦裨將軍，與王翦攻楚，大破之，殺項燕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang twenty-third year, Meng Wu as Qin secondary general, with Wang Jian attacked Chu, greatly broke it, killed Xiang Yan.",
              "idiomatic": "In the twenty-third year of the First Emperor, Meng Wu served as a Qin lieutenant general and, together with Wang Jian, attacked Chu, decisively defeating them and killing Xiang Yan."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "二十四年，蒙武攻楚，虜楚王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Twenty-fourth year, Meng Wu attacked Chu, captured Chu king.",
              "idiomatic": "In the twenty-fourth year, Meng Wu attacked Chu and captured the king of Chu."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "蒙恬弟毅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Meng Tian younger brother Yi.",
              "idiomatic": "Meng Tian's younger brother was Yi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Meng Tian, his ancestor Qi person. Tian grandfather Meng Ao, from Qi served Qin Zhao Wang, office to upper minister. Qin Zhuangxiang Wang first year, Meng Ao as Qin general, attacked Han, took Chenggao, Xingyang, established three rivers commandery. Second year, Meng Ao attacked Zhao, took thirty seven cities. Shi Huang third year, Meng Ao attacked Han, took thirteen cities. Fifth year, Meng Ao attacked Wei, took twenty cities, established Dong commandery. Shi Huang seventh year, Meng Ao died. Ao son called Wu, Wu son called Tian. Tian once studied prison law literature. Shi Huang twenty-third year, Meng Wu as Qin deputy general, with Wang Jian attacked Chu, greatly broke it, killed Xiang Yan. Twenty-fourth year, Meng Wu attacked Chu, captured Chu king. Meng Tian younger brother Yi.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0013",
          "zh": "始皇二十六年，蒙恬因家世得為秦將，攻齊，大破之，拜為內史。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang twenty-sixth year, Meng Tian because family background obtained as Qin general, attacked Qi, greatly broke it, appointed as Interior Minister.",
              "idiomatic": "In the twenty-sixth year of the First Emperor, Meng Tian, owing to his family's military background, was appointed a Qin general, attacked Qi, decisively defeated them, and was appointed Interior Minister."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "秦已并天下，乃使蒙恬將三十萬眾北逐戎狄，收河南。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Qin already united world, then made Meng Tian lead three hundred thousand multitude north drive Rong Di, recover Henan.",
              "idiomatic": "After Qin had unified the empire, the emperor sent Meng Tian to lead three hundred thousand troops north to drive back the Rong and Di barbarians and recover the lands south of the Yellow River."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "筑長城，因地形，用制險塞，起臨洮，至遼東，延袤萬餘里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Built long wall, according to terrain, using strategic dangerous passes, started Lintao, to Liaodong, extended ten thousand more li.",
              "idiomatic": "He built the Great Wall, following the terrain and utilizing strategic passes, starting from Lintao and extending to Liaodong, spanning more than ten thousand li."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "於是渡河，據陽山，逶蛇而北。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Thereupon crossed river, occupied Yang Mountain, winding snake-like northward.",
              "idiomatic": "Thereupon he crossed the Yellow River, occupied Yang Mountain, and advanced northward in a winding path."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "暴師於外十餘年，居上郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Exposed troops abroad more than ten years, resided Shang commandery.",
              "idiomatic": "He kept his troops exposed to the elements abroad for more than ten years, stationed in the Shang commandery."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "是時蒙恬威振匈奴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "At this time Meng Tian awe shook Xiongnu.",
              "idiomatic": "At this time, Meng Tian's might shook the Xiongnu."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "始皇甚尊寵蒙氏，信任賢之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang greatly honored favored Meng clan, trusted regarded them worthy.",
              "idiomatic": "The First Emperor greatly honored and favored the Meng clan, trusting and regarding them as worthy."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "而親近蒙毅，位至上卿，出則參乘，入則御前。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "And drew close to Meng Yi, position reached High Minister, going out then rode as chariot companion, entering then before imperial presence.",
              "idiomatic": "He drew close to Meng Yi, who rose to the position of High Minister; when going out, Yi rode as his chariot companion; when entering, he appeared before the imperial presence."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "恬任外事而毅常為內謀，名為忠信，故雖諸將相莫敢與之爭焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Tian took charge of external affairs while Yi constantly served as internal counselor, named loyal trustworthy, therefore although various generals ministers none dared contend with them.",
              "idiomatic": "Meng Tian took charge of external military affairs while Meng Yi constantly served as internal counselor; they were renowned for their loyalty and trustworthiness, so although there were various generals and ministers, none dared contend with them."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang twenty-sixth year, Meng Tian because family background got as Qin general, attacked Qi, greatly broke it, appointed as inner shi. Qin already united world, then made Meng Tian lead thirty thousand crowd north pursue Rong Di, took Henan. Built long wall, according to terrain, used control dangerous passes, rose Lintao, to Liaodong, extended ten thousand plus li. Thus crossed river, occupied Yang mountain, winding snake north. Exposed troops outside ten plus years, dwelt Shang commandery. At time Meng Tian might shook Xiongnu. Shi Huang much honored favored Meng clan, trusted considered worthy them. Yet personally close Meng Yi, position to upper minister, out then accompany chariot, enter then before throne. Tian in charge outer affairs yet Yi constantly as inner plans, named loyal trustworthy, thus though various generals chancellors none dared contend with them.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "趙高者，諸趙疏遠屬也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao, various Zhao distant relation also.",
              "idiomatic": "Zhao Gao was a distant relation of the Zhao royal family."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "趙高昆弟數人，皆生隱宮，其母被刑僇，世世卑賤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao brothers several people, all born hidden palace, their mother suffered punishment execution, generation generation lowly base.",
              "idiomatic": "Zhao Gao and his several brothers were all born in the hidden palace; their mother suffered punishment and execution, and their family remained lowly and base for generations."
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "秦王聞高彊力，通於獄法，舉以為中車府令。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Qin King heard Gao strong powerful, versed in prison law, raised appointed as Commander of Central Chariot Bureau.",
              "idiomatic": "The King of Qin heard that Zhao Gao was strong and capable, well-versed in penal law, and appointed him Commander of the Central Chariot Bureau."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "高既私事公子胡亥，喻之決獄。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao already privately served Prince Hu Hai, instructed him decide prison cases.",
              "idiomatic": "Zhao Gao privately served Prince Hu Hai and instructed him in deciding legal cases."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "高有大罪，秦王令蒙毅法治之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao had great crime, Qin King ordered Meng Yi govern law handle it.",
              "idiomatic": "Zhao Gao committed a grave crime, and the King of Qin ordered Meng Yi to handle the case according to law."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "毅不敢阿法，當高罪死，除其宦籍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Yi dared not bend law, judged Gao crime death, removed his eunuch registry.",
              "idiomatic": "Meng Yi dared not bend the law and judged Zhao Gao's crime to be punishable by death, removing him from the eunuch registry."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "帝以高之敦於事也，赦之，復其官爵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Emperor because Gao earnest in affairs, pardoned him, restored his official rank.",
              "idiomatic": "Because Zhao Gao was earnest in his duties, the emperor pardoned him and restored his official rank."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zhao Gao, various Zhao distant branch. Zhao Gao brothers several persons, all born hidden palace, mother suffered punishment executed, generations low base. Qin king heard Gao strong forceful, versed in prison law, raised as middle chariot bureau commander. Gao already privately served crown prince Hu Hai, taught decide cases. Gao had great crime, Qin king commanded Meng Yi govern treat it. Yi dared not bend law, should Gao crime die, removed his eunuch register. Emperor because Gao devoted to affairs, pardoned him, restored his office rank.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0029",
          "zh": "始皇欲游天下，道九原，直抵甘泉，乃使蒙恬通道，自九原抵甘泉，塹山堙谷，千八百里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang wished tour world, road Jiuyuan, directly reach Ganquan, then made Meng Tian open road, from Jiuyuan reach Ganquan, trenched mountains filled valleys, thousand eight hundred li.",
              "idiomatic": "The First Emperor wished to tour the empire and planned a road from Jiuyuan that would go directly to Ganquan. He ordered Meng Tian to build the road from Jiuyuan to Ganquan, trenching through mountains and filling in valleys for a distance of 1,800 li."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "道未就。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Road not yet completed.",
              "idiomatic": "The road was not yet completed."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang wished tour world, road Jiu Yuan, straight reach Gan Quan, then made Meng Tian open road, from Jiu Yuan to Gan Quan, trench mountains fill valleys, thousand eight hundred li. Road not completed.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "始皇三十七年冬，行出游會稽，并海上，北走瑯邪。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang thirty-seventh year winter, traveled out toured Kuaiji, followed seacoast, north went Langye.",
              "idiomatic": "In the winter of the First Emperor's thirty-seventh year, he set out on a tour of Kuaiji, followed the seacoast, and went north to Langye."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "道病，使蒙毅還禱山川，未反。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "On road fell ill, made Meng Yi return pray mountains rivers, not yet returned.",
              "idiomatic": "He fell ill along the way and sent Meng Yi back to pray to the mountains and rivers; Yi had not yet returned."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang thirty-seventh year winter, traveled out tour Kuaiji, along sea, north went Langye. Road sick, made Meng Yi return pray mountains rivers, not returned.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "始皇至沙丘崩，祕之，群臣莫知。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Shihuang arrived Shaqiu collapsed, kept secret, ministers none knew.",
              "idiomatic": "The First Emperor arrived at Shaqiu and collapsed; they kept it secret, and none of the ministers knew."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "是時丞相李斯、公子胡亥、中車府令趙高常從。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "At this time Chancellor Li Si, Prince Hu Hai, Commander of Central Chariot Bureau Zhao Gao constantly accompanied.",
              "idiomatic": "At this time, Chancellor Li Si, Prince Hu Hai, and Commander of the Central Chariot Bureau Zhao Gao were constantly in attendance."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "高雅得幸於胡亥，欲立之，又怨蒙毅法治之而不為己也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Gao usually obtained favor with Hu Hai, wished establish him, moreover resented Meng Yi governed law handled him and not for self.",
              "idiomatic": "Zhao Gao had long enjoyed Prince Hu Hai's favor and wished to establish him as heir; moreover, he resented Meng Yi for having handled his legal case according to law rather than favoring him."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "因有賊心，乃與丞相李斯、公子胡亥陰謀，立胡亥為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore had treacherous heart, then with Chancellor Li Si, Prince Hu Hai secretly plotted, establish Hu Hai as Crown Prince.",
              "idiomatic": "Therefore harboring treacherous intentions, he secretly plotted with Chancellor Li Si and Prince Hu Hai to establish Hu Hai as Crown Prince."
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "太子已立，遣使者以罪賜公子扶蘇、蒙恬死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Crown Prince already established, sent envoy with crime granted Prince Fusu, Meng Tian death.",
              "idiomatic": "Once the Crown Prince was established, they sent an envoy to order Prince Fusu and Meng Tian to commit suicide on charges of crimes."
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "扶蘇已死，蒙恬疑而復請之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Fusu already died, Meng Tian doubted and again requested verification.",
              "idiomatic": "Fusu had already died, but Meng Tian doubted the order and requested verification again."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "使者以蒙恬屬吏，更置。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Envoy with Meng Tian belonged officials, changed placed.",
              "idiomatic": "The envoy turned Meng Tian over to the judicial officials and had him imprisoned."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "胡亥以李斯舍人為護軍。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Hu Hai with Li Si retainer made Protector General.",
              "idiomatic": "Hu Hai appointed one of Li Si's retainers as Protector General."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "使者還報，胡亥已聞扶蘇死，即欲釋蒙恬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Envoy returned reported, Hu Hai already heard Fusu died, immediately wished release Meng Tian.",
              "idiomatic": "When the envoy returned and reported, Hu Hai had already heard of Fusu's death and immediately wished to release Meng Tian."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "趙高恐蒙氏復貴而用事，怨之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Gao feared Meng clan again noble and handle affairs, resented them.",
              "idiomatic": "Zhao Gao feared that the Meng clan would regain their nobility and return to power, and resented them for it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Shi Huang reached Shaqiu collapsed, secret it, ministers none knew. At time chancellor Li Si, crown prince Hu Hai, middle chariot bureau commander Zhao Gao constantly followed. Gao usually got favored by Hu Hai, wished establish him, again resented Meng Yi governed treated him not for self. Because had thief heart, then with chancellor Li Si, crown prince Hu Hai secretly plotted, established Hu Hai as crown prince. Crown prince already established, sent envoy with crime granted crown prince Fu Su, Meng Tian die. Fu Su already died, Meng Tian doubted yet again requested it. Envoy with Meng Tian gave officials, changed placed. Hu Hai with Li Si retainer as protect army. Envoy returned reported, Hu Hai already heard Fu Su died, then wished release Meng Tian. Zhao Gao feared Meng clan again noble employ affairs, resented them.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0043",
          "zh": "毅還至，趙高因為胡亥忠計，欲以滅蒙氏，乃言曰：「臣聞先帝欲舉賢立太子久矣，而毅諫曰『不可』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Yi returned arrived, Zhao Gao therefore for Hu Hai loyal plan, wished with extinguish Meng clan, then spoke said: 'Your servant heard Former Emperor wished select worthy establish Crown Prince long already, but Yi remonstrated said 'cannot'.'",
              "idiomatic": "When Meng Yi returned, Zhao Gao devised a loyal plan for Hu Hai to destroy the Meng clan. He said: 'Your servant has heard that the Former Emperor long wished to select a worthy heir as Crown Prince, but Meng Yi remonstrated saying 'It cannot be done.''"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "若知賢而俞弗立，則是不忠而惑主也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "If knew worthy but repeatedly not establish, then is disloyal and confused ruler.",
              "idiomatic": "If he knew who was worthy but repeatedly opposed establishing him, then this is disloyalty and misleading the ruler."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "以臣愚意，不若誅之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "With your servant foolish opinion, not if execute him.'",
              "idiomatic": "In your servant's foolish opinion, it would be better to execute him.'"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "胡亥聽而系蒙毅於代。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Hu Hai listened and bound Meng Yi at Dai.",
              "idiomatic": "Hu Hai listened to this advice and imprisoned Meng Yi in Dai commandery."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "前已囚蒙恬於陽周。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Previously already imprisoned Meng Tian at Yangzhou.",
              "idiomatic": "Meng Tian had previously been imprisoned in Yangzhou."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "喪至咸陽，已葬，太子立為二世皇帝，而趙高親近，日夜毀惡蒙氏，求其罪過，舉劾之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Funeral arrived Xianyang, already buried, Crown Prince established as Second Emperor, and Zhao Gao drew close, day night slandered vilified Meng clan, sought their crimes faults, raised impeached them.",
              "idiomatic": "When the funeral procession reached Xianyang and the burial was completed, the Crown Prince was established as the Second Emperor. Zhao Gao, who was now close to the throne, slandered and vilified the Meng clan day and night, seeking out their crimes and faults to impeach them."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Yi returned arrived, Zhao Gao because for Hu Hai loyal planned, wished extinguish Meng clan, then spoke: 'Minister heard previous emperor wished raise worthy establish crown prince long, yet Yi advised 'cannot'. If knew worthy yet deliberately not establish, then not loyal confused lord. With minister foolish intent, not equal execute him.' Hu Hai listened imprisoned Meng Yi at Dai. Before already imprisoned Meng Tian at Yang Zhou. Funeral reached Xianyang, already buried, crown prince established as Second Emperor, yet Zhao Gao close, day night slander hated Meng clan, sought their crimes faults, raised impeached them.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0049",
          "zh": "子嬰進諫曰：「臣聞故趙王遷殺其良臣李牧而用顏聚，燕王喜陰用荊軻之謀而倍秦之約，齊王建殺其故世忠臣而用后勝之議。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Ziying advanced remonstrated said: 'Your servant heard former Zhao King Qian killed his good minister Li Mu and used Yan Ju, Yan King Xi secretly used Jing Ke's plot and doubled Qin agreement, Qi King Jian killed his former generations loyal ministers and used Hou Sheng's counsel.'",
              "idiomatic": "Ziying advanced and remonstrated: 'Your servant has heard that the former King Qian of Zhao killed his excellent minister Li Mu and employed Yan Ju; King Xi of Yan secretly adopted Jing Ke's plot and broke his agreement with Qin; King Jian of Qi killed his long-serving loyal ministers and followed Hou Sheng's counsel.'"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "此三君者，皆各以變古者失其國而殃及其身。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "These three rulers, all each with changing ancient ways lost their states and calamity reached their persons.",
              "idiomatic": "These three rulers all lost their kingdoms and brought calamity upon themselves by abandoning ancient ways."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "今蒙氏，秦之大臣謀士也，而主欲一旦棄去之，臣竊以為不可。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Now Meng clan, Qin great ministers strategists, and ruler wishes once discard abandon them, your servant privately thinks cannot.",
              "idiomatic": "Now the Meng clan are Qin's great ministers and strategists, yet Your Majesty wishes to discard them in a single day. Your servant privately believes this cannot be done."
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "臣聞輕慮者不可以治國，獨智者不可以存君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "literal": "Your servant heard frivolous deliberators cannot govern state, sole wisdom cannot preserve ruler.",
              "idiomatic": "Your servant has heard that those who deliberate frivolously cannot govern a state, and those who rely on their wisdom alone cannot preserve their ruler."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "誅殺忠臣而立無節行之人，是內使群臣不相信而外使鬬士之意離也，臣竊以為不可。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Execute loyal ministers and establish without moral conduct persons, this internally makes ministers not trust and externally makes warriors' intentions separate, your servant privately thinks cannot.'",
              "idiomatic": "To execute loyal ministers and establish men without moral conduct—this will cause the ministers within to lose trust and the warriors without to become disaffected. Your servant privately believes this cannot be done.'"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Zi Ying advanced admonished: 'Minister heard former Zhao Wang Qian killed his worthy minister Li Mu yet used Yan Ju, Yan Wang Xi secretly used Jing Ke plan yet broke Qin alliance, Qi Wang Jian killed his former generation loyal minister yet used Hou Sheng discussion. These three lords, all each with change ancient lost their states calamity reached their bodies. Now Meng clan, Qin ministers strategists, yet lord wishes once abandon them, minister secretly considers cannot. Minister heard light consideration cannot govern state, sole wisdom cannot preserve lord. Execute kill loyal ministers establish without restraint conduct persons, this inner makes ministers not trust each other outer makes fighting scholars intent separate, minister secretly considers cannot.'",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "胡亥不聽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Hu Hai not listen.",
              "idiomatic": "Hu Hai did not listen."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "而遣御史曲宮乘傳之代，令蒙毅曰：「先主欲立太子而卿難之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "And sent imperial secretary Qu Gong ride relay to Dai, ordered Meng Yi said: 'Former ruler wished establish Crown Prince but you opposed it.'",
              "idiomatic": "He sent the imperial secretary Qu Gong by relay post to Dai commandery and ordered him to tell Meng Yi: 'The Former Emperor wished to establish a Crown Prince, but you opposed it.'"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "今丞相以卿為不忠，罪及其宗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now Chancellor takes you as disloyal, crime reaches your clan.",
              "idiomatic": "Now the Chancellor considers you disloyal, and the crime extends to your entire clan."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "朕不忍，乃賜卿死，亦甚幸矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "I not bear, then grant you death, also very fortunate.",
              "idiomatic": "I cannot bear to see this, so I grant you death—it is also very fortunate."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "卿其圖之！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "You consider it!'",
              "idiomatic": "You must consider this!'"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "毅對曰：「以臣不能得先主之意，則臣少宦，順幸沒世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Yi replied said: 'Because your servant could not obtain Former Ruler's intention, then your servant young officialed, complied fortunately died world.'",
              "idiomatic": "Meng Yi replied: 'If your servant could not understand the Former Emperor's intentions, then your servant served as a young official and fortunately complied until the end of his life.'"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "可謂知意矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Can be called knew intention.",
              "idiomatic": "This can be called understanding his intentions.'"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "以臣不知太子之能，則太子獨從，周旋天下，去諸公子絕遠，臣無所疑矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Because your servant did not know Crown Prince's ability, then Crown Prince alone followed, circulated world, went other princes extremely far, your servant had no doubts.",
              "idiomatic": "If your servant did not know the Crown Prince's abilities, then the fact that the Crown Prince alone accompanied the emperor and traveled throughout the world while staying far away from the other princes left your servant with no doubts.'"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "夫先主之舉用太子，數年之積也，臣乃何言之敢諫，何慮之敢謀！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Indeed Former Ruler's selection employment Crown Prince, several years accumulation, your servant then what words dared remonstrate, what considerations dared plan!",
              "idiomatic": "Indeed, the Former Emperor's selection and employment of the Crown Prince was built up over several years. How could your servant dare remonstrate with words or plan with considerations!'"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "非敢飾辭以避死也，為羞累先主之名，願大夫為慮焉，使臣得死情實。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Not dared embellish words to avoid death, for ashamed burdened Former Ruler's name, wish sir consider, make your servant able die true feelings.",
              "idiomatic": "I do not dare embellish my words to avoid death; I am ashamed to burden the Former Emperor's reputation. I wish you, sir, would consider this and allow your servant to die with true feelings.'"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "且夫順成全者，道之所貴也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Moreover indeed complying completing perfecting, Way's what valued;",
              "idiomatic": "Moreover, complying and bringing things to completion—that is what the Way values;"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "刑殺者，道之所卒也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Punishing killing, Way's what ended.",
              "idiomatic": "Punishing and killing—that is what the Way ends with."
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "昔者秦穆公殺三良而死，罪百里奚而非其罪也，故立號曰『繆』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Formerly Qin Mu Gong killed three good ministers and died, blamed Baili Xi and not his crime, therefore established title called 'Miu'.",
              "idiomatic": "Formerly, Duke Mu of Qin killed his three worthy ministers and died; he blamed Baili Xi when it was not his crime, which is why he was given the posthumous title 'Miu' (errant)."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "昭襄王殺武安君白起。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Zhao Xiang King killed Wuan Jun Bai Qi.",
              "idiomatic": "King Zhaoxiang killed the Lord of Wuan, Bai Qi."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "楚平王殺伍奢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Chu Ping King killed Wu She.",
              "idiomatic": "King Ping of Chu killed Wu She."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "吳王夫差殺伍子胥。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Wu King Fuchai killed Wu Zixu.",
              "idiomatic": "King Fuchai of Wu killed Wu Zixu."
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "此四君者，皆為大失，而天下非之，以其君為不明，以是籍於諸侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "These four rulers, all made great mistakes, and world condemned them, took their rulers as unenlightened, with this registered among feudal lords.",
              "idiomatic": "These four rulers all committed grave errors, and the world condemned them, considering their rulers unenlightened. Because of this, they were recorded among the feudal lords as failures."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "故曰『用道治者不殺無罪，而罰不加於無辜』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore said 'using Way governing not kill innocent, and punishment not add to guiltless'.",
              "idiomatic": "Therefore it is said: 'Those who govern by the Way do not kill the innocent, and punishment is not inflicted on the guiltless.'"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "唯大夫留心！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Only sir pay attention!'",
              "idiomatic": "I beg you, sir, to pay attention to this!'"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "使者知胡亥之意，不聽蒙毅之言，遂殺之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Envoy knew Hu Hai's intention, not listen Meng Yi's words, then killed him.",
              "idiomatic": "The envoy knew Hu Hai's intentions, did not listen to Meng Yi's words, and then killed him."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Hu Hai not listened. Yet sent imperial secretary Qu Gong by relay to Dai, commanded Meng Yi: 'Previous lord wished establish crown prince yet you opposed. Now chancellor considers you not loyal, crime reaches clan. I not bear, thus grant you die, also very fortunate. You consider it!' Yi replied: 'With minister cannot get previous lord intent, then minister young served, obediently favored to death. Can call knew intent. With minister not know crown prince ability, then crown prince alone followed, toured world, left various crown princes far distant, minister no doubt. Previous lord raised used crown prince, several years accumulation, minister how dared speak admonish, how dared plan consider! Not dared adorn words avoid death, for ashamed burden previous lord name, wish sir consider, make minister get die true feelings. Moreover complete perfect followers, way what valued; Punish kill, way what end. Former Qin Mu Gong killed three worthy died, blamed Baili Xi yet not his crime, thus established title 'Miu'. Zhao Wang killed Wu An Jun Bai Qi. Chu Ping Wang killed Wu She. Wu Wang Fu Cha killed Wu Zi Xu. These four lords, all great loss, world condemned them, considered their lords not enlightened, thus ridiculed among feudal lords. Thus said 'use way govern not kill innocent, punish not add to guiltless'. Only sir attentive!' Envoy knew Hu Hai intent, not listened Meng Yi words, thus killed him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "二世又遣使者之陽周，令蒙恬曰：「君之過多矣，而卿弟毅有大罪，法及內史。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Second Emperor again sent envoy to Yangzhou, ordered Meng Tian said: 'Your mistakes many already, and your younger brother Yi has great crime, law reaches Interior Minister.'",
              "idiomatic": "The Second Emperor again sent an envoy to Yangzhou and ordered him to tell Meng Tian: 'Your mistakes are already too many, and your younger brother Yi has committed a grave crime. The law extends to the Interior Minister.'"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "恬曰：「自吾先人，及至子孫，積功信於秦三世矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Tian said: 'From my ancestors, and to descendants, accumulated merit trustworthiness in Qin three generations already.'",
              "idiomatic": "Meng Tian said: 'From my ancestors down to my descendants, we have accumulated merit and trustworthiness for Qin over three generations.'"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "今臣將兵三十餘萬，身雖囚系，其勢足以倍畔，然自知必死而守義者，不敢辱先人之教，以不忘先主也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now your servant leads troops more than three hundred thousand, body though imprisoned bound, its power sufficient to double rebel, yet self knows must die but guards righteousness, dares not disgrace ancestors' teachings, to not forget Former Ruler.",
              "idiomatic": "Now your servant commands more than three hundred thousand troops. Though my body is imprisoned, my power is sufficient to rebel twice over. Yet knowing I must die, I still uphold righteousness and dare not disgrace my ancestors' teachings, so as not to forget the Former Emperor.'"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "昔周成王初立，未離襁緥周公旦負王以朝，卒定天下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Formerly Zhou Cheng King initially established, not yet left swaddling Zhou Gong Dan carried king to court, finally pacified world.",
              "idiomatic": "Formerly, when King Cheng of Zhou was first established on the throne, still in swaddling clothes, the Duke of Zhou carried the king to court and finally pacified the world."
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "及成王有病甚殆，公旦自揃其爪以沈於河，曰：『王未有識，是旦執事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When Cheng King had illness very precarious, Gong Dan self cut his nails to sink in river, said: 'King not yet have knowledge, this Dan manages affairs.'",
              "idiomatic": "When King Cheng fell gravely ill, the Duke personally cut his nails and cast them into the river, saying: 'The king has no knowledge yet; it is Dan who manages affairs.'"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "有罪殃，旦受其不祥。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Have crime calamity, Dan receive its misfortune.'",
              "idiomatic": "If there is crime and calamity, Dan will receive the misfortune.'"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "乃書而藏之記府，可謂信矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then wrote and stored it records office, can be called trustworthy.",
              "idiomatic": "He then wrote this down and stored it in the records office; this can be called trustworthy."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "及王能治國，有賊臣言：『周公旦欲為亂久矣，王若不備，必有大事。』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "When king able govern state, had treacherous minister speak: 'Zhou Gong Dan wished make rebellion long already, king if not prepare, must have great matter.'",
              "idiomatic": "When the king was able to govern the state, a treacherous minister said: 'The Duke of Zhou has long wished to rebel. If Your Majesty does not prepare, there will surely be great trouble.'"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "王乃大怒，周公旦走而奔於楚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "King then greatly angered, Zhou Gong Dan fled ran to Chu.",
              "idiomatic": "The king then became greatly enraged, and the Duke of Zhou fled to Chu."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "成王觀於記府，得周公旦沈書，乃流涕曰：『孰謂周公旦欲為亂乎！』",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Cheng King examined records office, obtained Zhou Gong Dan sunk writing, then shed tears said: 'Who said Zhou Gong Dan wished make rebellion!'",
              "idiomatic": "King Cheng examined the records office and found the Duke of Zhou's oath document, then wept and said: 'Who would claim that the Duke of Zhou wished to rebel!'"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "殺言之者而反周公旦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Killed the speaker and returned Zhou Gong Dan.",
              "idiomatic": "He executed the one who had spoken and recalled the Duke of Zhou."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "故《周書》曰『必參而伍之』。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Therefore Zhou Documents said 'must investigate and verify it'.",
              "idiomatic": "Therefore the Zhou Documents say: 'One must investigate and verify matters.'"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "今恬之宗，世無二心，而事卒如此，是必孽臣逆亂，內陵之道也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Now Tian's clan, generations without two minds, but matter finally like this, this must evil minister rebellious disorder, internal bullying way.",
              "idiomatic": "Now my clan has served for generations without divided loyalties, yet matters have ended like this. This must be the work of evil ministers causing rebellion and disorder, the way of internal bullying."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "夫成王失而復振則卒昌；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Indeed Cheng King erred but again rose then finally prospered;",
              "idiomatic": "Indeed, King Cheng erred but recovered and finally prospered;"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "桀殺關龍逢，紂殺王子比干而不悔，身死則國亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Jie killed Guan Longpeng, Zhou killed Prince Bigan and not repent, body died then state perished.",
              "idiomatic": "Jie killed Guan Longfeng, Zhou killed Prince Bigan and did not repent; when they died, their states perished."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "臣故曰過可振而諫可覺也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Your servant therefore said error can recover and remonstration can awaken.",
              "idiomatic": "Your servant therefore says that errors can be corrected and remonstration can bring awakening."
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "察於參伍，上聖之法也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Investigate in comparing verifying, supreme sage's method.",
              "idiomatic": "To investigate by comparing and verifying—that is the method of the supreme sage."
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "凡臣之言，非以求免於咎也，將以諫而死，願陛下為萬民思從道也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "All your servant's words, not to seek avoid blame, will remonstrate and die, wish Your Majesty for myriad people think follow Way.'",
              "idiomatic": "All your servant's words are not to seek avoidance of blame; I will remonstrate and die. I wish Your Majesty would consider following the Way for the sake of the myriad people.'"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "使者曰：「臣受詔行法於將軍，不敢以將軍言聞於上也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Envoy said: 'Your servant received decree execute law on general, dare not with general words report to above.'",
              "idiomatic": "The envoy said: 'Your servant received the decree to execute the law upon the general; I dare not report the general's words to the emperor.'"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "蒙恬喟然太息曰：「我何罪於天，無過而死乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Meng Tian sighed deeply said: 'I what crime against Heaven, without error die?'",
              "idiomatic": "Meng Tian sighed deeply and said: 'What crime have I committed against Heaven that I should die without having erred?'"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "良久，徐曰：「恬罪固當死矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Very long time, slowly said: 'Tian crime indeed should die.'",
              "idiomatic": "After a long time, he slowly said: 'My crime indeed deserves death.'"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "起臨洮屬之遼東，城塹萬餘里，此其中不能無絕地脈哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Started Lintao connected to Liaodong, walled trenched ten thousand more li, this among cannot without cut earth veins?",
              "idiomatic": "Starting from Lintao and extending to Liaodong, with walls and trenches spanning more than ten thousand li—how could this not have cut off the earth's veins?"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "此乃恬之罪也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "This is Tian's crime.'",
              "idiomatic": "This is my crime.'"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "乃吞藥自殺。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Then swallowed medicine suicide.",
              "idiomatic": "He then swallowed poison and committed suicide."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Second Emperor again sent envoy to Yang Zhou, commanded Meng Tian: 'Lord errors many, yet your younger brother Yi has great crime, law reaches inner shi.' Tian said: 'From my ancestors to sons grandsons, accumulated merit trust Qin three generations. Now minister leads troops thirty plus thousand, body though imprisoned bound, situation sufficient rebel, yet self know must die guard righteousness, dare not disgrace ancestors teaching, not forget previous lord. Former Zhou Cheng Wang initial establish, not left swaddling Zhou Gong Dan carried king court, finally settled world. When Cheng Wang had illness very grave, Gong Dan self cut his fingernails sank river, said: 'King not have knowledge, this Dan manages affairs. Have crime calamity, Dan receive not auspicious.' Then wrote stored record bureau, can call trustworthy. When king could govern state, had thief minister spoke: 'Zhou Gong Dan wished chaos long, king if not prepare, must have great affair.' King then greatly angered, Zhou Gong Dan fled ran to Chu. Cheng Wang viewed record bureau, got Zhou Gong Dan sank writing, then flowed tears said: 'Who said Zhou Gong Dan wished chaos!' Killed speaker returned Zhou Gong Dan. Thus Zhou Book said 'must check compare'. Now Tian clan, generations no two hearts, affairs finally like this, certainly evil ministers rebellious chaos, inner usurping way. Cheng Wang lost yet recovered then finally prospered; Jie killed Guan Long Feng, Zhou killed Wang Zi Bi Gan not regretted, body died then state perished. Minister thus said error can recover admonish can awaken. Examine check compare, upper sage method. All minister words, not to seek avoid blame, will admonish die, wish Your Majesty for myriad people consider follow way.' Envoy said: 'Minister received decree execute law on general, dare not with general words hear above.' Meng Tian sighed deeply: 'I what crime heaven, no error die?' Long time, slowly said: 'Tian crime certainly should die. Rose Lintao connected Liaodong, walled trenched ten thousand plus li, this among cannot no cut earth veins? This then Tian crime.' Thus swallowed medicine suicide.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "太史公曰：吾適北邊，自直道歸，行觀蒙恬所為秦筑長城亭障，塹山堙谷，通直道，固輕百姓力矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Grand Historian said: I went north border, from direct road returned, traveled observed Meng Tian made Qin build long wall watchtowers, trenched mountains filled valleys, opened direct road, indeed lightly used common people strength.",
              "idiomatic": "The Grand Historian remarks: I once went to the northern border and returned by the direct road. Along the way I observed what Meng Tian had built for Qin: the Great Wall and watchtowers, trenches through mountains and fills in valleys, the direct road. Indeed, he made light use of the people's strength."
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "夫秦之初滅諸侯，天下之心未定，痍傷者未瘳，而恬為名將，不以此時彊諫，振百姓之急，養老存孤，務修眾庶之和，而阿意興功，此其兄弟遇誅，不亦宜乎！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Indeed Qin initially extinguished feudal lords, world's heart not settled, wounded not healed, and Tian as famous general, not at this time strongly remonstrated, relieved common people's distress, cared aged preserved orphans, devoted repaired multitudes' harmony, but flattered pleased raised merit, this their brothers encountered execution, not also fitting!",
              "idiomatic": "Indeed, when Qin had just extinguished the feudal lords, the people's hearts were unsettled and the wounded had not yet healed. Yet Meng Tian, as a famous general, did not use this time to strongly remonstrate, relieve the people's distress, care for the aged and preserve orphans, and devote himself to cultivating harmony among the multitudes. Instead, he flattered his superiors and pursued merit. That he and his brother encountered execution—was this not fitting!"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "何乃罪地脈哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5",
              "reviewed": true,
              "literal": "Why then blame earth veins?",
              "idiomatic": "Why then blame the earth's veins?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "Grand Historian said: I went north border, from straight road returned, walked observed Meng Tian what for Qin built long wall beacon barriers, trenched mountains filled valleys, through straight road, indeed exhausted hundred surnames strength. Qin initial extinguished feudal lords, world heart not settled, wounded not healed, yet Tian as famous general, not with this time strong admonish, relieve hundred surnames urgency, nourish old store orphan, manage cultivate masses harmony, yet flattered intent raised merit, this his brothers met execution, not also suitable! Why then blame earth veins!",
          "idiomatic": null
        }
      ]
    }
  ]
}