{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han",
      "author": "Sima Qian",
      "authorChinese": "司馬遷"
    },
    "chapter": "091",
    "url": "https://chinesenotes.com/shiji/shiji091.html",
    "title": {
      "zh": "黥布列傳",
      "en": "Biography of Qing Bu",
      "raw": "《黥布列傳》 Biography of Qing Bu"
    },
    "sentenceCount": 172,
    "translatedCount": 172,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:17.793Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "黥布者，六人也，姓英氏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Qing Bu, his person Liu person, surname Ying clan.",
              "idiomatic": "Qing Bu was a man of Liu. His surname was Ying."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "秦時為布衣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Qin time made commoner.",
              "idiomatic": "During Qin times, he was a commoner."
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "少年，有客相之曰：「當刑而王。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Youth, had guest physiognomize him said: 'Should punished yet king.'",
              "idiomatic": "As a youth, a guest physiognomized him and said: 'You should suffer punishment but become king.'"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "及壯，坐法黥。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "When adult, violated law tattooed.",
              "idiomatic": "When he grew to adulthood, he violated the law and was tattooed."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "布欣然笑曰；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu joyfully laughed said;",
              "idiomatic": "Bu joyfully laughed and said;"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "「人相我當刑而王，幾是乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'Person physiognomized me should punished yet king, nearly this?'",
              "idiomatic": "'A person physiognomized me that I should be punished but become king—could this nearly be true?'"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "人有聞者，共俳笑之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "People had heard, together jested laughed at him.",
              "idiomatic": "Those who heard about it all jested and laughed at him."
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "布已論輸麗山，麗山之徒數十萬人，布皆與其徒長豪桀交通，乃率其曹偶，亡之江中為群盜。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu already adjudicated transported Lishan, Lishan followers several ten thousand persons, Bu all with their follower chiefs outstanding heroes intercourse, then led his comrades, fled to Yangtze middle made group bandits.",
              "idiomatic": "Bu had already been adjudicated and transported to Lishan. Lishan's followers numbered several hundred thousand. Bu associated with all their chief leaders and outstanding heroes, then led his comrades and fled to become bandits in the Yangtze region."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "陳勝之起也，布乃見番君，與其眾叛秦，聚兵數千人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chen Sheng uprising, Bu then saw Fan jun, with his multitude rebelled Qin, gathered troops several thousand persons.",
              "idiomatic": "When Chen Sheng rose in rebellion, Bu then saw Lord Fan and with his multitude rebelled against Qin, gathering several thousand troops."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "番君以其女妻之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Fan jun with his daughter married him.",
              "idiomatic": "Lord Fan married his daughter to him."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "章邯之滅陳勝，破呂臣軍，布乃引兵北擊秦左右校，破之清波，引兵而東。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Zhang Han extinguished Chen Sheng, broke Lu Chen army, Bu then led troops north attacked Qin left right colonels, broke them Qingbo, led troops east.",
              "idiomatic": "When Zhang Han extinguished Chen Sheng and broke Lu Chen's army, Bu then led troops north to attack Qin's left and right colonels, defeated them at Qingbo, and led his troops east."
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "聞項梁定江東會稽，涉江而西。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Heard Xiang Liang pacified Jiangdong Kuaiji, crossed Yangtze west.",
              "idiomatic": "He heard that Xiang Liang had pacified Jiangdong and Kuaiji, so he crossed the Yangtze and went west."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "陳嬰以項氏世為楚將，乃以兵屬項梁，渡淮南，英布、蒲將軍亦以兵屬項梁。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chen Ying because Xiang clan generations made Chu generals, then with troops belonged Xiang Liang, crossed Huainan, Ying Bu, Pu general also with troops belonged Xiang Liang.",
              "idiomatic": "Chen Ying, because the Xiang clan had for generations been Chu generals, then attached his troops to Xiang Liang. He crossed to the south of the Huai. Ying Bu and General Pu also attached their troops to Xiang Liang."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0014",
          "zh": "項梁涉淮而西，擊景駒、秦嘉等，布常冠軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Liang crossed Huai west, attacked Jing Ju, Qin Jia etc., Bu constantly led vanguard.",
              "idiomatic": "Xiang Liang crossed the Huai and went west, attacking Jing Ju, Qin Jia, and others. Bu constantly led the vanguard."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "項梁至薛，聞陳王定死，迺立楚懷王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Liang arrived Xue, heard Chen king certainly dead, then established Chu Huai king.",
              "idiomatic": "Xiang Liang arrived at Xue. Hearing that the King of Chen was certainly dead, he then established the King of Huai of Chu."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "項梁號為武信君，英布為當陽君。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Liang styled Wu Xin jun, Ying Bu as Dangyang jun.",
              "idiomatic": "Xiang Liang was styled Lord Wu Xin, Ying Bu as Lord Dangyang."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "項梁敗死定陶，懷王徙都彭城，諸將英布亦皆保聚彭城。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Liang defeated died Dingtao, Huai king moved capital Pengcheng, various generals Ying Bu also all defended gathered Pengcheng.",
              "idiomatic": "Xiang Liang was defeated and died at Dingtao. The King of Huai moved his capital to Pengcheng. The various generals, including Ying Bu, all defended and gathered at Pengcheng."
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "當是時，秦急圍趙，趙數使人請救。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "At this time, Qin urgently besieged Zhao, Zhao repeatedly sent persons requested rescue.",
              "idiomatic": "At this time, Qin urgently besieged Zhao, and Zhao repeatedly sent people requesting rescue."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "懷王使宋義為上將，范曾為末將，項籍為次將，英在、蒲將軍皆為將軍，悉屬宋義，北救趙。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Huai king sent Song Yi as supreme general, Fan Zeng as rear general, Xiang Ji as deputy general, Ying Zai, Pu general all as generals, all belonged Song Yi, north rescued Zhao.",
              "idiomatic": "The King of Huai sent Song Yi as supreme general, Fan Zeng as rear general, Xiang Ji as deputy general, Ying Zai and General Pu all as generals. They all belonged to Song Yi and went north to rescue Zhao."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "及項籍殺宋義於河上，懷王因立籍為上將軍，諸將皆屬項籍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "When Xiang Ji killed Song Yi at river upon, Huai king then established Ji as supreme general, various generals all belonged Xiang Ji.",
              "idiomatic": "When Xiang Ji killed Song Yi by the river, the King of Huai then established Ji as supreme general, and all the generals belonged to Xiang Ji."
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "項籍使布先渡河擊秦，布數有利，籍迺悉引兵涉河從之，遂破秦軍，降章邯等。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Ji made Bu first cross river attack Qin, Bu repeatedly had advantage, Ji then all led troops crossed river followed him, then broke Qin army, surrendered Zhang Han etc.",
              "idiomatic": "Xiang Ji made Bu cross the river first to attack Qin. Bu repeatedly had the advantage, so Ji then led all his troops across the river to follow him. They then broke the Qin army and Zhang Han and others surrendered."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "楚兵常勝，功冠諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu troops constantly victorious, merit crowned feudal lords.",
              "idiomatic": "The Chu troops were constantly victorious, their merit surpassing all the feudal lords."
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "諸侯兵皆以服屬楚者，以布數以少敗眾也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Feudal lords troops all thereby submitted belonged Chu, because Bu repeatedly with few defeated many.",
              "idiomatic": "The troops of the feudal lords all thereby submitted and belonged to Chu, because Bu repeatedly defeated many with few."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "項籍之引兵西至新安，又使布等夜擊阬章邯秦卒二十餘萬人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Ji led troops west arrived Xinan, again made Bu etc. night attacked massacred Zhang Han Qin soldiers twenty remaining ten thousand persons.",
              "idiomatic": "When Xiang Ji led troops west to Xinan, he again made Bu and others attack at night and massacre over two hundred thousand Qin soldiers of Zhang Han."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "至關，不得入，又使布等先從閒道破關下軍，遂得入，至咸陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Arrived pass, not able enter, again made Bu etc. first from hidden path broke pass lower army, then able enter, arrived Xianyang.",
              "idiomatic": "They arrived at the Pass but could not enter. He again made Bu and others first go by hidden paths to break the army defending the Pass, and they were then able to enter and arrive at Xianyang."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "布常為軍鋒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu constantly made army vanguard.",
              "idiomatic": "Bu constantly served as the army's vanguard."
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "項王封諸將，立布為九江王，都六。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang king enfeoffed various generals, established Bu as Jiu Jiang king, capital Liu.",
              "idiomatic": "The King of Xiang enfeoffed the various generals and established Bu as King of Jiujiang, with Liu as capital."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "漢元年四月，諸侯皆罷戲下，各就國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han first year fourth month, feudal lords all dismissed Xixia, each went to their countries.",
              "idiomatic": "In the fourth month of the first year of Han, all the feudal lords were dismissed from Xixia and each went to their own countries."
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "項氏立懷王為義帝，徙都長沙，乃陰令九江王布等行擊之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang clan established Huai king as Yi emperor, moved capital Changsha, then secretly ordered Jiu Jiang king Bu etc. go attack him.",
              "idiomatic": "The Xiang clan established the King of Huai as the Yi Emperor and moved his capital to Changsha. They then secretly ordered King Bu of Jiujiang and others to go attack him."
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "其八月，布使將擊義帝，追殺之郴縣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Its eighth month, Bu sent general attacked Yi emperor, pursued killed him Chen county.",
              "idiomatic": "In the eighth month, Bu sent a general to attack the Yi Emperor and pursued and killed him in Chen county."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "漢二年，齊王田榮畔楚，項王往擊齊，徵兵九江，九江王布稱病不往，遣將將數千人行。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han second year, Qi king Tian Rong rebelled Chu, Xiang king went attacked Qi, conscripted troops Jiujiang, Jiujiang king Bu claimed illness not went, sent general led several thousand persons went.",
              "idiomatic": "In the second year of Han, King Tian Rong of Qi rebelled against Chu. The King of Xiang went to attack Qi and conscripted troops from Jiujiang. King Bu of Jiujiang claimed illness and did not go, but sent a general who led several thousand men to go."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "漢之敗楚彭城，布又稱病不佐楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han defeated Chu Pengcheng, Bu again claimed illness not assisted Chu.",
              "idiomatic": "When Han defeated Chu at Pengcheng, Bu again claimed illness and did not assist Chu."
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "項王由此怨布，數使使者誚讓召布，布愈恐，不敢往。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang king therefrom resented Bu, repeatedly sent messengers rebuked summoned Bu, Bu increasingly feared, not dared go.",
              "idiomatic": "The King of Xiang resented Bu from this and repeatedly sent messengers to rebuke and summon Bu. Bu became increasingly fearful and did not dare go."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "項王方北憂齊、趙，西患漢，所與者獨九江王，又多布材，欲親用之，以故未擊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang king just north worried Qi, Zhao, west troubled Han, those with him only Jiujiang king, moreover valued Bu talent, wished personally use him, because of this not attacked.",
              "idiomatic": "The King of Xiang was just then worried about Qi and Zhao to the north and troubled by Han to the west. Those with him were only the King of Jiujiang. He moreover valued Bu's talent and wished to use him personally, which is why he had not attacked."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0035",
          "zh": "漢三年，漢王擊楚，大戰彭城，不利，出梁地，至虞，謂左右曰：「如彼等者，無足與計天下事。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han third year, Han king attacked Chu, great battle Pengcheng, unfavorable, exited Liang territory, arrived Yu, said attendants: 'Like those people, not worth with plan world affairs.'",
              "idiomatic": "In the third year of Han, the Han king attacked Chu. In a great battle at Pengcheng, he was unfavorable and exited Liang territory. Arriving at Yu, he said to his attendants: 'People like those are not worth planning world affairs with.'"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "謁者隨何進曰：「不審陛下所謂。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Courtier Sui He advanced said: 'Not understand Your Majesty what said.'",
              "idiomatic": "The courtier Sui He advanced and said: 'I do not understand what Your Majesty means.'"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "漢王曰：「孰能為我使淮南，令之發兵倍楚，留項王於齊數月，我之取天下可以百全。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han king said: 'Who can for me envoy Huainan, make him send troops double Chu, detain Xiang king in Qi several months, my taking world can be hundred complete.'",
              "idiomatic": "The Han king said: 'Who can go as my envoy to Huainan and make him send troops to double Chu's forces, detaining the King of Xiang in Qi for several months? My taking the world can then be one hundred percent secure.'"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "隨何曰：「臣請使之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He said: 'Subject request envoy it.'",
              "idiomatic": "Sui He said: 'I request to go as envoy.'"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "乃與二十人俱，使淮南。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Then with twenty persons together, envoyed Huainan.",
              "idiomatic": "He then went together with twenty persons as envoys to Huainan."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "至，因太宰主之，三日不得見。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Arrived, through grand steward hosted them, three days not able see.",
              "idiomatic": "Upon arrival, they were hosted through the grand steward but were not able to see the king for three days."
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "隨何因說太宰曰：「王之不見何，必以楚為彊，以漢為弱，此臣之所以為使。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He then persuaded grand steward said: 'King not see He, certainly because Chu strong, Han weak, this subject reason for envoy.",
              "idiomatic": "Sui He then persuaded the grand steward, saying: 'The king's not seeing He is certainly because he considers Chu strong and Han weak. This is why I have come as envoy.'"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "使何得見，言之而是邪，是大王所欲聞也；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Make He able see, speak it and correct, is great king what wish hear;",
              "idiomatic": "If He is allowed to see the king and what he says is correct, it is what the great king wishes to hear;"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "言之而非邪，使何等二十人伏斧質淮南市，以明王倍漢而與楚也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Speak it and wrong, make He etc. twenty persons lie under axe pledge Huainan market, to clarify king betrays Han and with Chu.'",
              "idiomatic": "If what he says is wrong, make He and the twenty others lie under the axe and pledge at the Huainan market, to clarify that the king betrays Han and allies with Chu.'"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "太宰乃言之王，王見之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Grand steward then spoke it king, king saw him.",
              "idiomatic": "The grand steward then spoke to the king, and the king saw him."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "隨何曰：「漢王使臣敬進書大王御者，竊怪大王與楚何親也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He said: 'Han king sent subject respectfully present letter great king chariot driver, secretly wonder great king with Chu how close.'",
              "idiomatic": "Sui He said: 'The Han king sent me to respectfully present a letter to the great king's chariot driver. I secretly wonder how close the great king is with Chu.'"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "淮南王曰：「寡人北鄉而臣事之。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Huainan king said: 'I person north face and minister serve him.'",
              "idiomatic": "The King of Huainan said: 'I face north and serve him as minister.'"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "隨何曰：「大王與項王俱列為諸侯，北鄉而臣事之，必以楚為彊，可以託國也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He said: 'Great king with Xiang king both listed as feudal lords, north face and minister serve him, certainly because Chu strong, can entrust country.",
              "idiomatic": "Sui He said: 'Your Majesty and the King of Xiang are both listed as feudal lords. Facing north and serving him as minister is certainly because Chu is strong and one can entrust the country to it.'"
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "項王伐齊，身負板筑，以為士卒先，大王宜悉淮南之眾，身自將之，為楚軍前鋒，今乃發四千人以助楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang king attacked Qi, personally carried carrying pole, made soldiers first, great king should all Huainan multitude, personally lead them, make Chu army vanguard, now then sent four thousand persons to assist Chu.",
              "idiomatic": "When the King of Xiang attacked Qi, he personally carried the carrying pole and went first as an example to the soldiers. Your Majesty should lead all of Huainan's multitude and personally command them as Chu's vanguard. Now you only send four thousand men to assist Chu.'"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "夫北面而臣事人者，固若是乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed north face and minister serve person, certainly like this?",
              "idiomatic": "Is this how one who faces north and serves as minister to another should act?'"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "夫漢王戰於彭城，項王未出齊也，大王宜騷淮南之兵渡淮，日夜會戰彭城下，大王撫萬人之眾，無一人渡淮者，垂拱而觀其孰勝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed Han king battled Pengcheng, Xiang king not yet out Qi, great king should mobilize Huainan troops cross Huai, day night assemble battle Pengcheng below, great king pacify ten thousand persons multitude, none one person cross Huai, hang arms observe their who victorious.",
              "idiomatic": "When the Han king battled at Pengcheng and the King of Xiang had not yet left Qi, Your Majesty should have mobilized Huainan's troops to cross the Huai and assemble for battle under Pengcheng. Your Majesty pacified a multitude of ten thousand, yet not one crossed the Huai. You hung up your arms and merely observed who would be victorious.'"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "夫託國於人者，固若是乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed entrust country to person, certainly like this?",
              "idiomatic": "Is this how one who entrusts his country to another should act?'"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "大王提空名以鄉楚，而欲厚自託，臣竊為大王不取也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Great king grasp empty name to face Chu, yet wish thickly self entrust, subject secretly for great king not take.",
              "idiomatic": "Your Majesty grasps an empty name and faces Chu, yet wishes to richly entrust yourself. I secretly do not approve for Your Majesty.'"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "然而大王不背楚者，以漢為弱也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "However great king not turn back Chu, because Han weak.",
              "idiomatic": "However, the reason Your Majesty does not turn away from Chu is because you consider Han weak.'"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "夫楚兵雖彊，天下負之以不義之名，以其背盟約而殺義帝也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed Chu troops though strong, world bears it with unrighteous name, because its betrayed covenant killed Yi emperor.",
              "idiomatic": "Though Chu's troops are strong, the world bears Chu with the name of unrighteousness because it betrayed the covenant and killed the Yi Emperor.'"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "然而楚王恃戰勝自彊，漢王收諸侯，還守成皋、滎陽，下蜀、漢之粟，深溝壁壘，分卒守徼乘塞，楚人還兵，閒以梁地，深入敵國八九百里，欲戰則不得，攻城則力不能，老弱轉糧千里之外；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "However Chu king relied victories self strong, Han king gathered feudal lords, returned defended Chenggao, Xingyang, transported Shu, Han grain, deep moats wall fortifications, divided troops guarded borders defended passes, Chu people returned troops, separated by Liang territory, deeply entered enemy country eight nine hundred li, wished battle then not able, attacked cities then strength not able, old weak transported grain thousand li outside;",
              "idiomatic": "However, the King of Chu relies on victories to consider himself strong. The Han king gathers the feudal lords and returns to defend Chenggao and Xingyang. He transports grain from Shu and Han, digs deep moats and builds strong fortifications, and divides troops to guard the borders and defend the passes. The Chu people return their troops but are separated by Liang territory. They deeply penetrate enemy territory eight or nine hundred li. They wish to battle but cannot, attack cities but lack the strength, and old and weak transport grain from a thousand li away.'"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "楚兵至滎陽、成皋，漢堅守而不動，進則不得攻，退則不得解。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu troops arrived Xingyang, Chenggao, Han firmly defended not moved, advance then not able attack, retreat then not able withdraw.",
              "idiomatic": "When Chu troops arrive at Xingyang and Chenggao, Han firmly defends and does not move. They advance but cannot attack, retreat but cannot withdraw.'"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "故曰楚兵不足恃也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Therefore said Chu troops not sufficient rely.",
              "idiomatic": "Therefore it is said that Chu's troops are not sufficient to rely on.'"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "使楚勝漢，則諸侯自危懼而相救。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Make Chu defeat Han, then feudal lords self endanger fear mutually rescue.",
              "idiomatic": "If Chu defeats Han, then the feudal lords will endanger themselves out of fear and mutually rescue each other.'"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "夫楚之彊，適足以致天下之兵耳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed Chu strong, just sufficient to bring world troops.",
              "idiomatic": "Chu's strength is just sufficient to bring the troops of the world against it.'"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "故楚不如漢，其勢易見也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Therefore Chu not as Han, its situation easy see.",
              "idiomatic": "Therefore Chu is not equal to Han; the situation is easy to see.'"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "今大王不與萬全之漢而自託於危亡之楚，臣竊為大王惑之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Now great king not ally ten thousand complete Han but self entrust dangerous perishing Chu, subject secretly for great king confused.",
              "idiomatic": "Now Your Majesty does not ally with the one-hundred-percent-secure Han but entrusts yourself to the dangerous and perishing Chu. I secretly am confused for Your Majesty.'"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "臣非以淮南之兵足以亡楚也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Subject not because Huainan troops sufficient perish Chu.",
              "idiomatic": "I do not say that Huainan's troops are sufficient to destroy Chu.'"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "夫大王發兵而倍楚，項王必留；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed great king send troops double Chu, Xiang king certainly stay;",
              "idiomatic": "If Your Majesty sends troops and turns against Chu, the King of Xiang will certainly stay;"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "留數月，漢之取天下可以萬全。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Stay several months, Han take world can ten thousand complete.",
              "idiomatic": "He will stay several months, and Han's taking the world can be one hundred percent secure.'"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "臣請與大王提劍而歸漢，漢王必裂地而封大王，又況淮南，淮南必大王有也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Subject request with great king grasp sword return Han, Han king certainly divide territory enfeoff great king, moreover Huainan, Huainan certainly great king have.",
              "idiomatic": "I request to grasp swords with Your Majesty and return to Han. The Han king will certainly divide territory and enfeoff Your Majesty, not to mention Huainan—Huainan will certainly be Yours.'"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "故漢王敬使使臣進愚計，願大王之留意也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Therefore Han king respectfully sent subject present foolish plan, wish great king pay attention.'",
              "idiomatic": "Therefore the Han king respectfully sent me to present this foolish plan, hoping Your Majesty will pay attention to it.'"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "淮南王曰：「請奉命。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Huainan king said: 'Request receive command.'",
              "idiomatic": "The King of Huainan said: 'I request to receive the command.'"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "陰許畔楚與漢，未敢泄也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Secretly permitted rebel Chu ally Han, not yet dared leak.",
              "idiomatic": "He secretly agreed to rebel against Chu and ally with Han, but did not yet dare leak it."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0069",
          "zh": "楚使者在，方急責英布發兵，舍傳舍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu envoy present, just urgently reproached Ying Bu send troops, lodged relay lodge.",
              "idiomatic": "The Chu envoy was present, just urgently reproaching Ying Bu to send troops, lodging at the relay station."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "隨何直入，坐楚使者上坐，曰：「九江王已歸漢，楚何以得發兵？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He straight entered, sat Chu envoy upper seat, said: 'Jiujiang king already returned Han, Chu how able send troops?'",
              "idiomatic": "Sui He went straight in and sat in the upper seat over the Chu envoy, saying: 'The King of Jiujiang has already returned to Han. How can Chu obtain troops?'"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "布愕然。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu astonished.",
              "idiomatic": "Bu was astonished."
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "楚使者起。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu envoy rose.",
              "idiomatic": "The Chu envoy stood up."
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "何因說布曰：「事已搆，可遂殺楚使者，無使歸，而疾走漢并力。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "He then persuaded Bu said: 'Matter already formed, can then kill Chu envoy, not make return, quickly run Han combine strength.'",
              "idiomatic": "He then persuaded Bu, saying: 'The matter is already formed. We can kill the Chu envoy and not let him return, then quickly go to Han and combine forces.'"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "布曰：「如使者教，因起兵而擊之耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu said: 'Like envoy teaches, then raise troops attack them.'",
              "idiomatic": "Bu said: 'As the envoy teaches, then raise troops and attack them.'"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "於是殺使者，因起兵而攻楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Thereupon killed envoy, then raised troops attacked Chu.",
              "idiomatic": "Thereupon they killed the envoy, then raised troops and attacked Chu."
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "楚使項聲、龍且攻淮南，項王留而攻下邑。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu sent Xiang Sheng, Long Ju attack Huainan, Xiang king stayed attacked Xiayi.",
              "idiomatic": "Chu sent Xiang Sheng and Long Ju to attack Huainan. The King of Xiang stayed and attacked Xiayi."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "數月，龍且擊淮南，破布軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Several months, Long Ju attacked Huainan, broke Bu army.",
              "idiomatic": "After several months, Long Ju attacked Huainan and broke Bu's army."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "布欲引兵走漢，恐楚王殺之，故閒行與何俱歸漢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu wished lead troops flee Han, feared Chu king kill him, therefore secretly went with He together returned Han.",
              "idiomatic": "Bu wished to lead troops and flee to Han, but feared the King of Chu would kill him, so he secretly went with He and together returned to Han."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "淮南王至，上方踞床洗，召布入見，布（甚）大怒，悔來，欲自殺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Huainan king arrived, emperor just sat cross-legged bed washed, summoned Bu entered saw, Bu greatly angered, regretted coming, wished suicide.",
              "idiomatic": "When the King of Huainan arrived, the emperor was just sitting cross-legged on a bed washing. He summoned Bu to enter and see him. Bu was greatly angered, regretted coming, and wished to commit suicide."
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "出就舍，帳御飲食從官如漢王居，布又大喜過望。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Exited went lodge, tent imperial food drink attendants like Han king residence, Bu again greatly joyful exceeded expectations.",
              "idiomatic": "He exited and went to his lodge. The tent, imperial food and drink, and attendants were like the Han king's residence. Bu was again greatly joyful, exceeding expectations."
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "於是乃使人入九江。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Thereupon then sent person entered Jiujiang.",
              "idiomatic": "Thereupon he then sent someone to enter Jiujiang."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "楚已使項伯收九江兵，盡殺布妻子。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu already sent Xiang Bo gathered Jiujiang troops, completely killed Bu wife children.",
              "idiomatic": "Chu had already sent Xiang Bo to gather Jiujiang troops and completely killed Bu's wife and children."
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "布使者頗得故人幸臣，將眾數千人歸漢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu envoy considerably obtained old friends favored ministers, led multitude several thousand persons returned Han.",
              "idiomatic": "Bu's envoy considerably obtained old friends and favored ministers, leading a multitude of several thousand persons who returned to Han."
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "漢益分布兵而與俱北，收兵至成皋。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han moreover distributed Bu troops with together north, gathered troops arrived Chenggao.",
              "idiomatic": "Han moreover distributed Bu's troops and together went north, gathering troops until arriving at Chenggao."
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "四年七月，立布為淮南王，與擊項籍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Fourth year seventh month, established Bu as Huainan king, with attacked Xiang Ji.",
              "idiomatic": "In the seventh month of the fourth year, Bu was established as King of Huainan, and together they attacked Xiang Ji."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0086",
          "zh": "漢五年，布使人入九江，得數縣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han fifth year, Bu sent person entered Jiujiang, obtained several counties.",
              "idiomatic": "In the fifth year of Han, Bu sent someone to enter Jiujiang and obtained several counties."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "六年，布與劉賈入九江，誘大司馬周殷，周殷反楚，遂舉九江兵與漢擊楚，破之垓下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sixth year, Bu with Liu Jia entered Jiujiang, lured grand marshal Zhou Yin, Zhou Yin rebelled Chu, then raised Jiujiang troops with Han attacked Chu, broke them Gaixia.",
              "idiomatic": "In the sixth year, Bu and Liu Jia entered Jiujiang, lured the grand marshal Zhou Yin, Zhou Yin rebelled against Chu, then raised Jiujiang troops and with Han attacked Chu, defeating them at Gaixia."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0088",
          "zh": "項籍死，天下定，上置酒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang Ji died, world pacified, emperor set wine.",
              "idiomatic": "Xiang Ji died, the world was pacified, and the emperor set out wine."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "上折隨何之功，謂何為腐儒，為天下安用腐儒。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor belittled Sui He merit, called He rotten Confucian, for world what use rotten Confucian.",
              "idiomatic": "The emperor belittled Sui He's merit, calling him a rotten Confucian, asking what use rotten Confucians are for the world."
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "隨何跪曰：「夫陛下引兵攻彭城，楚王未去齊也，陛下發步卒五萬人，騎五千，能以取淮南乎？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He knelt said: 'Indeed Your Majesty led troops attacked Pengcheng, Chu king not yet left Qi, Your Majesty sent infantry fifty thousand persons, cavalry five thousand, able thereby take Huainan?'",
              "idiomatic": "Sui He knelt and said: 'Indeed, when Your Majesty led troops to attack Pengcheng and the King of Chu had not yet left Qi, could Your Majesty have taken Huainan by sending fifty thousand infantry and five thousand cavalry?'"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "上曰：「不能。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'Could not.'",
              "idiomatic": "The emperor said: 'I could not.'"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "隨何曰：「陛下使何與二十人使淮南，至，如陛下之意，是何之功賢於步卒五萬人騎五千也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Sui He said: 'Your Majesty sent He with twenty persons envoyed Huainan, arrived, like Your Majesty intention, is He merit superior infantry fifty thousand persons cavalry five thousand.",
              "idiomatic": "Sui He said: 'Your Majesty sent me with twenty persons as envoys to Huainan. We arrived and succeeded according to Your Majesty's intention. My merit is superior to fifty thousand infantry and five thousand cavalry.'"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "然而陛下謂何腐儒，為天下安用腐儒，何也？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "However Your Majesty called He rotten Confucian, for world what use rotten Confucian, what?'",
              "idiomatic": "However, Your Majesty calls me a rotten Confucian, asking what use rotten Confucians are for the world. Why is that?'"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "上曰：「吾方圖子之功。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'I just considered your merit.'",
              "idiomatic": "The emperor said: 'I was just considering your merit.'"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "乃以隨何為護軍中尉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Then made Sui He as guard army captain.",
              "idiomatic": "He then made Sui He captain of the guard army."
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "布遂剖符為淮南王，都六，九江、廬江、衡山、豫章郡皆屬布。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu then divided tally made Huainan king, capital Liu, Jiujiang, Lujiang, Hengshan, Yuzhang commanderies all belonged Bu.",
              "idiomatic": "Bu then had his tally divided and was made King of Huainan, with Liu as capital. The Jiujiang, Lujiang, Hengshan, and Yuzhang commanderies all belonged to Bu."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0097",
          "zh": "七年，朝陳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Seventh year, audience Chen.",
              "idiomatic": "In the seventh year, he attended court at Chen."
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "八年，朝雒陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Eighth year, audience Luoyang.",
              "idiomatic": "In the eighth year, he attended court at Luoyang."
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "九年，朝長安。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Ninth year, audience Chang'an.",
              "idiomatic": "In the ninth year, he attended court at Chang'an."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0100",
          "zh": "十一年，高后誅淮陰侯，布因心恐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Eleventh year, Gao empress executed Huaiyin hou, Bu therefore heart feared.",
              "idiomatic": "In the eleventh year, Empress Gao executed the Marquis of Huaiyin, and Bu therefore became fearful in his heart."
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "夏，漢誅梁王彭越，醢之，盛其醢遍賜諸侯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Summer, Han executed Liang king Peng Yue, made him into paste, filled his paste extensively granted feudal lords.",
              "idiomatic": "In summer, Han executed King Peng Yue of Liang, made him into paste, and extensively distributed his paste to the feudal lords."
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "至淮南，淮南王方獵，見醢，因大恐，陰令人部聚兵，候伺旁郡警急。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Arrived Huainan, Huainan king just hunting, saw paste, therefore greatly feared, secretly made people departmental gathered troops, awaited spied neighboring commanderies emergency.",
              "idiomatic": "It arrived at Huainan. The King of Huainan was just hunting. He saw the paste and therefore became greatly fearful. He secretly had people gather troops by departments, awaiting and spying for emergencies in neighboring commanderies."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0103",
          "zh": "布所幸姬疾，請就醫，醫家與中大夫賁赫對門，姬數如醫家，賁赫自以為侍中，乃厚餽遺，從姬飲醫家。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu favored concubine ill, requested go to physician, physician house with palace gentleman Ben He faced gate, concubine repeatedly went physician house, Ben He self considered palace attendant, then thickly gifted sent, followed concubine drank physician house.",
              "idiomatic": "Bu's favored concubine was ill and requested to go to the physician. The physician's house faced the gate of the palace gentleman Ben He. The concubine repeatedly went to the physician's house. Ben He considered himself a palace attendant and then richly gifted and sent things, following the concubine and drinking at the physician's house."
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "姬侍王，從容語次，譽赫長者也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Concubine attended king, leisurely spoke in sequence, praised He elder.",
              "idiomatic": "The concubine attended the king and in leisurely conversation praised He as an elder."
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "王怒曰：「汝安從知之？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "King angered said: 'You how from know him?'",
              "idiomatic": "The king became angry and said: 'How do you know him?'"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "具說狀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Completely explained circumstances.",
              "idiomatic": "She completely explained the circumstances."
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "王疑其與亂。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "King suspected him with rebellion.",
              "idiomatic": "The king suspected him of being involved in rebellion."
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "赫恐，稱病。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "He feared, claimed illness.",
              "idiomatic": "He became fearful and claimed illness."
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "王愈怒，欲捕赫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "King increasingly angered, wished capture He.",
              "idiomatic": "The king became increasingly angry and wished to capture He."
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "赫言變事，乘傳詣長安。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "He spoke change matters, rode relay carriage went Chang'an.",
              "idiomatic": "He spoke of the rebellion matters and rode the relay carriage to Chang'an."
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "布使人追，不及。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu sent person pursued, not reached.",
              "idiomatic": "Bu sent someone to pursue him, but did not catch up."
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "赫至，上變，言布謀反有端，可先未發誅也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "He arrived, reported change, said Bu plotted rebellion had signs, can before not yet issued execute.",
              "idiomatic": "He arrived and reported the rebellion, saying that Bu was plotting rebellion and had signs of it. He could be executed before he had fully risen."
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "上讀其書，語蕭相國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor read his letter, spoke Xiao prime minister.",
              "idiomatic": "The emperor read his letter and spoke to Prime Minister Xiao."
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "相國曰：「布不宜有此，恐仇怨妄誣之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister said: 'Bu not proper have this, fear enmity resentment falsely accused him.",
              "idiomatic": "The prime minister said: 'Bu should not have this. I fear it is false accusation from enmity and resentment.'"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "請擊赫，使人微驗淮南王。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Request beat He, send person secretly verify Huainan king.'",
              "idiomatic": "I request that He be beaten and someone sent to secretly verify the King of Huainan.'"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "淮南王布見赫以罪亡，上變，固已疑其言國陰事；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Huainan king Bu saw He with crime fled, reported change, certainly already suspected his spoke kingdom secret matters;",
              "idiomatic": "The King Bu of Huainan saw that He had fled because of a crime and reported the change. He certainly already suspected that He had spoken of the kingdom's secret matters;"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "漢使又來，頗有所驗，遂族赫家，發兵反。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Han envoy again came, considerably had verification, then exterminated He clan, sent troops rebelled.",
              "idiomatic": "Han envoys came again and considerably verified things. He then exterminated He's clan and sent troops in rebellion."
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "反書聞，上乃赦賁赫，以為將軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Rebellion letter heard, emperor then pardoned Ben He, made general.",
              "idiomatic": "When the letter of rebellion was heard, the emperor then pardoned Ben He and made him a general."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0119",
          "zh": "上召諸將問曰：「布反，為之柰何？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor summoned various generals asked said: 'Bu rebels, make it what?'",
              "idiomatic": "The emperor summoned the various generals and asked: 'Bu has rebelled. What should we do?'"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "皆曰；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "All said;",
              "idiomatic": "They all said;"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "「發兵擊之，阬豎子耳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'Send troops attack him, massacred bastard child.",
              "idiomatic": "'Send troops to attack him. He's just a bastard child to be massacred.'"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "何能為乎！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "What able do!'",
              "idiomatic": "What can he do!'"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "汝陰侯滕公召故楚令尹問之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Ruyin hou Teng gong summoned former Chu prime minister asked him.",
              "idiomatic": "The Marquis of Ruyin, Teng Gong, summoned the former Chu prime minister and asked him."
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "令尹曰：「是故當反。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister said: 'This indeed should rebel.'",
              "idiomatic": "The prime minister said: 'He was indeed bound to rebel.'"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "滕公曰：「上裂地而王之，疏爵而貴之，南面而立萬乘之主，其反何也？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Teng gong said: 'Emperor divided territory king him, granted nobility noble him, south faced established ten thousand chariot lord, his rebel what?'",
              "idiomatic": "Teng Gong said: 'The emperor divided territory and made him king, granted him nobility and honored him, let him face south as a lord of ten thousand chariots. Why would he rebel?'"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "令尹曰：「往年殺彭越，前年殺韓信，此三人者，同功一體之人也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister said: 'Previous year killed Peng Yue, before previous year killed Han Xin, these three persons, same merit one body persons.",
              "idiomatic": "The prime minister said: 'Last year Peng Yue was killed, the year before Han Xin was killed. These three men were of the same merit and like one body.'"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "自疑禍及身，故反耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Self doubted calamity reach body, therefore rebelled.'",
              "idiomatic": "He doubted that calamity would reach his own person, therefore he rebelled.'"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "滕公言之上曰：「臣客故楚令尹薛公者，其人有籌筴之計，可問。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Teng gong spoke emperor said: 'Subject guest former Chu prime minister Xue gong, his person has strategizing plans, can ask.'",
              "idiomatic": "Teng Gong spoke to the emperor, saying: 'My guest, the former Chu prime minister Xue Gong, is a man with strategizing plans. He can be asked.'"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "上乃召見問薛公。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor then summoned saw asked Xue gong.",
              "idiomatic": "The emperor then summoned and saw Xue Gong to ask him."
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "薛公對曰：「布反不足怪也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xue gong replied said: 'Bu rebellion not sufficient strange.",
              "idiomatic": "Xue Gong replied, saying: 'Bu's rebellion is not surprising.'"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "使布出於上計，山東非漢之有也；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Make Bu issue upper strategy, Shandong not Han have;",
              "idiomatic": "If Bu employs the upper strategy, Shandong would not belong to Han;"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "出於中計，勝敗之數未可知也；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Issue middle strategy, victory defeat numbers not know;",
              "idiomatic": "If he employs the middle strategy, victory or defeat cannot be known;"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "出於下計，陛下安枕而臥矣。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Issue lower strategy, Your Majesty peaceful pillow lie.'",
              "idiomatic": "If he employs the lower strategy, Your Majesty can lie peacefully on your pillow.'"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "上曰：「何謂上計？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'What called upper strategy?'",
              "idiomatic": "The emperor said: 'What is the upper strategy?'"
            }
          ]
        },
        {
          "id": "s0135",
          "zh": "令尹對曰：「東取吳，西取楚，并齊取魯，傳檄燕、趙，固守其所，山東非漢之有也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister replied said: 'East take Wu, west take Chu, combine Qi take Lu, transmit proclamations Yan, Zhao, firmly defend his place, Shandong not Han have.'",
              "idiomatic": "The prime minister replied, saying: 'East take Wu, west take Chu, combine with Qi to take Lu, transmit proclamations to Yan and Zhao, firmly defend his position, and Shandong would not belong to Han.'"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "「何謂中計？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'What called middle strategy?'",
              "idiomatic": "'What is the middle strategy?'"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "「東取吳，西取楚，并韓取魏，據敖庾之粟，塞成皋之口，勝敗之數未可知也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'East take Wu, west take Chu, combine Han take Wei, occupy Aoyu grain, block Chenggao mouth, victory defeat numbers not know.'",
              "idiomatic": "'East take Wu, west take Chu, combine with Han to take Wei, occupy the grain of Aoyu, block the mouth of Chenggao, and victory or defeat cannot be known.'"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "「何謂下計？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'What called lower strategy?'",
              "idiomatic": "'What is the lower strategy?'"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "「東取吳，西取下蔡，歸重於越，身歸長沙，陛下安枕而臥，漢無事矣。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "'East take Wu, west take Xia Cai, return weight to Yue, person return Changsha, Your Majesty peaceful pillow lie, Han no affairs.'",
              "idiomatic": "'East take Wu, west take Xia Cai, entrust the heavy responsibility to Yue, personally return to Changsha, and Your Majesty can lie peacefully on your pillow. Han will have no troubles.'"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "上曰：「是計將安出？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'This strategy will where issue?'",
              "idiomatic": "The emperor said: 'Which strategy will he employ?'"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "令尹對曰：「出下計。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister replied said: 'Issue lower strategy.'",
              "idiomatic": "The prime minister replied, saying: 'He will employ the lower strategy.'"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "上曰：「何謂廢上中計而出下計？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'What called abandon upper middle strategies issue lower strategy?'",
              "idiomatic": "The emperor said: 'Why would he abandon the upper and middle strategies and employ the lower strategy?'"
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "令尹曰：「布故麗山之徒也，自致萬乘之主，此皆為身，不顧後為百姓萬世慮者也，故曰出下計。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Prime minister said: 'Bu originally Lishan followers, self achieved ten thousand chariot lord, this all for body, not consider after for common people ten thousand generations consider, therefore said issue lower strategy.'",
              "idiomatic": "The prime minister said: 'Bu was originally a follower of Lishan. He achieved the position of a lord of ten thousand chariots through his own efforts. This was all for his own person; he does not consider the future or plan for the common people for ten thousand generations. Therefore it is said he will employ the lower strategy.'"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "上曰：「善。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor said: 'Good.'",
              "idiomatic": "The emperor said: 'Good.'"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "封薛公千戶。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Enfeoffed Xue gong thousand households.",
              "idiomatic": "He enfeoffed Xue Gong with a thousand households."
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "乃立皇子長為淮南王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Then established imperial son Chang as Huainan king.",
              "idiomatic": "He then established his imperial son Chang as King of Huainan."
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "上遂發兵自將東擊布。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor then sent troops personally led east attacked Bu.",
              "idiomatic": "The emperor then sent troops and personally led them east to attack Bu."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "布之初反，謂其將曰：「上老矣，厭兵，必不能來。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu initial rebellion, said his generals: 'Emperor old, weary of war, certainly cannot come.",
              "idiomatic": "When Bu first rebelled, he said to his generals: 'The emperor is old and weary of war. He certainly cannot come.'"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "使諸將，諸將獨患淮陰、彭越，今皆已死，餘不足畏也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Send various generals, various generals only worried Huaiyin, Peng Yue, now all already dead, remaining not sufficient fear.'",
              "idiomatic": "He will send the various generals. The various generals only worried about Huaiyin and Peng Yue, but now they are all dead. The remainder are not sufficient to fear.'"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "故遂反。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Therefore then rebelled.",
              "idiomatic": "Therefore he proceeded to rebel."
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "果如薛公籌之，東擊荊，荊王劉賈走死富陵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Indeed like Xue gong strategized, east attacked Jing, Jing king Liu Jia fled died Ful陵.",
              "idiomatic": "Indeed as Xue Gong had strategized, he attacked east to Jing. King Liu Jia of Jing fled and died at Ful陵."
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "盡劫其兵，渡淮擊楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Completely seized their troops, crossed Huai attacked Chu.",
              "idiomatic": "He completely seized their troops and crossed the Huai to attack Chu."
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "楚發兵與戰徐、僮閒，為三軍，欲以相救為奇。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Chu sent troops battled between Xu, Tong, made three armies, wished mutually rescue make surprise.",
              "idiomatic": "Chu sent troops to battle between Xu and Tong, forming three armies, desiring to use mutual rescue as a surprise tactic."
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "或說楚將曰：「布善用兵，民素畏之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Someone persuaded Chu general said: 'Bu good at using troops, people usually fear him.",
              "idiomatic": "Someone persuaded the Chu general, saying: 'Bu is skilled at using troops, and the people usually fear him.'"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "且兵法，諸侯戰其地為散地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Moreover military methods, feudal lords battle their own territory called scattered ground.",
              "idiomatic": "Moreover, according to military methods, when feudal lords battle on their own territory, it is called scattered ground."
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "今別為三，彼敗吾一軍，餘皆走，安能相救！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Now divided into three, he defeats our one army, remaining all flee, how able mutually rescue!'",
              "idiomatic": "Now divided into three, if he defeats one of our armies, the remaining will all flee. How can they mutually rescue each other!'"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "不聽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Not listen.",
              "idiomatic": "He did not listen."
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "布果破其一軍，其二軍散走。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu indeed broke their one army, its two armies scattered fled.",
              "idiomatic": "Bu indeed broke one of their armies, and the other two armies scattered and fled."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0159",
          "zh": "遂西，與上兵遇蘄西，會甀。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Then west, with emperor troops encountered Qi west, assembled Beng.",
              "idiomatic": "He then went west and encountered the emperor's troops west of Qi, assembling at Beng."
            }
          ]
        },
        {
          "id": "s0160",
          "zh": "布兵精甚，上乃壁庸城，望布軍置陳如項籍軍，上惡之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu troops elite very, emperor then fortified Yong city, gazed Bu army arrayed battle like Xiang Ji army, emperor disliked it.",
              "idiomatic": "Bu's troops were very elite. The emperor then fortified Yong city. Gazing at Bu's army arrayed for battle like Xiang Ji's army, the emperor disliked it."
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "與布相望見，遙謂布曰：「何苦而反？」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "With Bu mutually gazed saw, remotely called Bu said: 'Why bitter yet rebel?'",
              "idiomatic": "Gazing at each other from afar, he remotely called to Bu: 'Why suffer by rebelling?'"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "布曰：「欲為帝耳。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu said: 'Wish become emperor.'",
              "idiomatic": "Bu said: 'I wish to become emperor.'"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "上怒罵之，遂大戰。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Emperor angered cursed him, then great battle.",
              "idiomatic": "The emperor angrily cursed him, and they then fought a great battle."
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "布軍敗走，渡淮，數止戰，不利，與百餘人走江南。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu army defeated fled, crossed Huai, repeatedly stopped battled, unfavorable, with hundred remaining persons fled Jiangnan.",
              "idiomatic": "Bu's army was defeated and fled. He crossed the Huai, repeatedly stopped to fight, but was unfavorable. With over a hundred men, he fled to Jiangnan."
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "布故與番君婚，以故長沙哀王使人紿布，偽與亡，誘走越，故信而隨之番陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Bu formerly with Fan jun married, because of this Changsha Ai king sent person deceived Bu, falsely with fled, lured walked Yue, therefore trusted followed him Fanyang.",
              "idiomatic": "Bu had formerly married the daughter of Lord Fan. Because of this, the Ai King of Changsha sent someone to deceive Bu, falsely agreeing to flee with him. He lured Bu to go to Yue, so Bu trusted him and followed to Fanyang."
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "番陽人殺布茲鄉民田舍，遂滅黥布。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Fanyang people killed Bu Zi township commoner field house, then extinguished Qing Bu.",
              "idiomatic": "The people of Fanyang killed Bu in the commoner's field house of Zi township, and thus extinguished Qing Bu."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "立皇子長為淮南王，封賁赫為期思侯，諸將率多以功封者。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Established imperial son Chang as Huainan king, enfeoffed Ben He as Qisi hou, various generals mostly many with merit enfeoffed.",
              "idiomatic": "He established his imperial son Chang as King of Huainan and enfeoffed Ben He as Marquis of Qisi. Most of the various generals were enfeoffed for their merit."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0168",
          "zh": "太史公曰：英布者，其先豈春秋所見楚滅英、六，皋陶之後哉？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Grand Historian said: Ying Bu, his ancestors perhaps Spring Autumns seen Chu extinguished Ying, Liu, Gao Tao after?",
              "idiomatic": "The Grand Historian said: Ying Bu—were his ancestors perhaps those seen in the Spring and Autumn period when Chu extinguished Ying and Liu, descendants of Gao Tao?"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "身被刑法，何其拔興之暴也！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Body suffered punishments, what his rise violent!",
              "idiomatic": "His body suffered punishments—how violent was his rise!"
            }
          ]
        },
        {
          "id": "s0170",
          "zh": "項氏之所阬殺人以千萬數，而布常為首虐。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Xiang clan massacred people by ten million count, yet Bu constantly first cruel.",
              "idiomatic": "The Xiang clan massacred people by the tens of millions in number, and Bu was constantly the first in cruelty."
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "功冠諸侯，用此得王，亦不免於身為世大僇。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Merit crowned feudal lords, used this obtained king, also not escaped body became world great humiliation.",
              "idiomatic": "His merit surpassed all the feudal lords. Using this, he obtained kingship, yet he also could not escape having his body become a great humiliation to the world."
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "禍之興自愛姬殖，妒媢生患，竟以滅國！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2026)",
              "model": "grok-1.5",
              "literal": "Calamity rise from loved concubine grew, jealousy engendered troubles, finally with extinguished kingdom!",
              "idiomatic": "The calamity arose from his beloved concubine growing in influence. Jealousy engendered troubles, and finally he extinguished his kingdom!"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    }
  ]
}