{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "094",
    "url": "https://chinesenotes.com/shiji/shiji094.html",
    "title": {
      "zh": "田儋列傳",
      "en": "Biography of Tian Dan",
      "raw": "《田儋列傳》 Biography of Tian Dan"
    },
    "sentenceCount": 96,
    "translatedCount": 96,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:21.210Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "田儋者，狄人也，故齊王田氏族也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Dan person, Di person, former Qi wang Tian clan family.",
              "idiomatic": "Tian Dan was a man of Di. He was of the clan of the former kings of Qi, the Tian family."
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "儋從弟田榮，榮弟田橫，皆豪，宗彊，能得人。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dan younger cousin Tian Rong, Rong younger brother Tian Heng, all heroic, clan strong, able get people.",
              "idiomatic": "Dan's cousin Tian Rong, and Rong's younger brother Tian Heng, were all heroic figures. Their clan was powerful and they could attract followers."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Tian Dan hailed from Di and belonged to the ancient royal clan of Qi. Tian Dan's younger brothers Tian Rong and Tian Heng were both heroic figures. Their clan wielded great influence and could rally many supporters.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0003",
          "zh": "陳涉之初起王楚也，使周市略定魏地，北至狄，狄城守。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chen She initial rise wang Chu, make Zhou Shi raid settle Wei land, north arrive Di, Di city defend.",
              "idiomatic": "When Chen She first rose and declared himself king of Chu, he sent Zhou Shi to raid and pacify the lands of Wei, reaching north to Di, where Di defended its city."
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "田儋詳為縛其奴，從少年之廷，欲謁殺奴。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Dan pretend bind his slave, follow youth to court, wish meet kill slave.",
              "idiomatic": "Tian Dan pretended to bind his slave and followed some youths to the county court, intending to meet with the magistrate and kill the slave."
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "見狄令，因擊殺令，而召豪吏子弟曰：「諸侯皆反秦自立，齊，古之建國，儋，田氏，當王。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "See Di magistrate, then strike kill magistrate, but summon heroic officials sons brothers say: Various marquises all rebel Qin self establish, Qi, ancient establish state, Dan, Tian clan, should wang.",
              "idiomatic": "When he saw the magistrate of Di, he struck and killed him, then summoned the heroic officials and their sons, saying: 'All the various lords have rebelled against Qin and established themselves. Qi is an ancient established state, and I, of the Tian clan, should be king.'"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "遂自立為齊王，發兵以擊周市。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then self establish as Qi wang, send troops to strike Zhou Shi.",
              "idiomatic": "He then established himself as King of Qi and sent troops to attack Zhou Shi."
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "周市軍還去，田儋因率兵東略定齊地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhou Shi army return go, Tian Dan then lead troops east raid settle Qi land.",
              "idiomatic": "Zhou Shi's army retreated, and Tian Dan then led troops east to raid and pacify the lands of Qi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Chen She first rose up and proclaimed himself King of Chu, he dispatched Zhou Shi to secure Wei territory. Zhou Shi pushed north as far as Di, where the city held out against him. Tian Dan feigned binding his slave and, accompanied by a group of young men, went to the court, intending to petition for the slave's execution. Upon seeing the magistrate of Di, he attacked and killed him, then gathered the sons of influential officials and declared: All the feudal lords have risen against Qin and proclaimed their own kingdoms. Qi is an ancient realm with deep roots, and I, Tian Dan of the Tian clan, am destined to rule it. Thus he proclaimed himself King of Qi and dispatched troops to attack Zhou Shi. Zhou Shi's forces withdrew, allowing Tian Dan to lead his troops eastward and secure control over Qi lands.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "秦將章邯圍魏王咎於臨濟，急。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qin general Zhang Han besiege Wei wang Jiu at Lin Ji, urgent.",
              "idiomatic": "The Qin general Zhang Han besieged King Jiu of Wei at Linji, and the situation was urgent."
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "魏王請救於齊，齊王田儋將兵救魏。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Wei wang request save at Qi, Qi wang Tian Dan lead troops save Wei.",
              "idiomatic": "The King of Wei requested aid from Qi, and King Tian Dan of Qi led troops to save Wei."
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "章邯夜銜枚擊，大破齊、魏軍，殺田儋於臨濟下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhang Han night hold wooden gag strike, greatly break Qi, Wei army, kill Tian Dan at Lin Ji below.",
              "idiomatic": "Zhang Han attacked at night with wooden gags in their mouths, greatly defeating the Qi and Wei armies, killing Tian Dan below Linji."
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "儋弟田榮收儋餘兵東走東阿。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Dan younger brother Tian Rong gather Dan remaining troops east flee Dong E.",
              "idiomatic": "Dan's younger brother Tian Rong gathered Dan's remaining troops and fled east to Dong'e."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Qin general Zhang Han laid siege to King Jiao of Wei at Linji, creating a dire emergency. King Jiao of Wei appealed to Qi for help, and King Tian Dan of Qi marched troops to Wei's rescue. Zhang Han launched a surprise night attack, his soldiers silent with gags, routing the combined Qi and Wei forces and slaying Tian Dan beneath the walls of Linji. Tian Rong was the younger brother of King Tian Dan of Qi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0012",
          "zh": "田榮之走東阿，章邯追圍之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong flee Dong E, Zhang Han pursue besiege him.",
              "idiomatic": "When Tian Rong fled to Dong'e, Zhang Han pursued and besieged him."
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "項梁聞田榮之急，乃引兵擊破章邯軍東阿下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Liang hear Tian Rong urgent, then lead troops strike break Zhang Han army Dong E below.",
              "idiomatic": "Xiang Liang heard of Tian Rong's urgency and led troops to attack and break Zhang Han's army below Dong'e."
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "章邯走而西，項梁因追之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhang Han flee west, Xiang Liang then pursue him.",
              "idiomatic": "Zhang Han fled west, and Xiang Liang then pursued him."
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "而田榮怒齊之立假，乃引兵歸，擊逐齊王假。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "But Tian Rong angry Qi establish puppet, then lead troops return, strike drive away Qi wang puppet.",
              "idiomatic": "But Tian Rong was angry that Qi had established a puppet king, so he led troops back and attacked to drive away the puppet King of Qi."
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "假亡走楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Puppet flee run Chu.",
              "idiomatic": "The puppet king fled to Chu."
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "齊相角亡走趙；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi chancellor Jiao flee run Zhao;",
              "idiomatic": "The Qi chancellor Jiao fled to Zhao;"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "角弟田閒前求救趙，因留不敢歸。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Jiao younger brother Tian Jian previously seek save Zhao, then stay not dare return.",
              "idiomatic": "Jiao's younger brother Tian Jian had previously sought aid from Zhao and stayed there, not daring to return."
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "田榮乃立田儋子市為齊王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong then establish Tian Dan son Shi as Qi wang.",
              "idiomatic": "Tian Rong then established Tian Dan's son Shi as King of Qi."
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "榮相之，田橫為將，平齊地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Rong chancellor him, Tian Heng as general, pacify Qi land.",
              "idiomatic": "Rong served as his chancellor, and Tian Heng as general, pacifying the lands of Qi."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Dan's death, Rong installed Dan's son Tian Shi as king. He then attacked westward, killing Zhou Shi at Qian, and drove Zhang Han's army back from Linji, eventually proclaiming himself king. When Zhang Han fled in defeat, King Rong of Qi remained at Xingyang, where Zhang Han besieged the city. Rong appealed to Chu general Xiang Liang for help. Xiang Liang came to Qi's aid, defeated Zhang Han's forces at Linji, and drove them back. Zhang Han eventually fled back to Zhao, and King Rong of Qi led his troops eastward in retreat. After Xiang Liang's death in battle, Zhang Han regained his strength and marched against Zhao, inflicting a major defeat. King Rong of Qi grew angry and said, Chu killed Tian Jia but still sent troops to help them—that's not righteous! He therefore refused to aid Zhao and instead attacked Zhang Han's forces, dealing them a crushing defeat. Zhang Han fled with his troops, and King Rong pursued him northward to the Pu River, where he killed Zhang Han. Yan general Zang Tu also raised troops to attack Zhao, motivated by the case of Yan Dan.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0021",
          "zh": "項梁既追章邯，章邯兵益盛，項梁使使告趙、齊，發兵共擊章邯。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Liang already pursue Zhang Han, Zhang Han troops increasingly flourish, Xiang Liang send envoy tell Zhao, Qi, send troops together strike Zhang Han.",
              "idiomatic": "After Xiang Liang pursued Zhang Han, Zhang Han's troops became increasingly strong. Xiang Liang sent envoys to tell Zhao and Qi to send troops together to attack Zhang Han."
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "田榮曰：「使楚殺田假，趙殺田角、田閒，閒肯出兵。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong say: Make Chu kill Tian Jia, Zhao kill Tian Jiao, Tian Jian, then willing send troops.",
              "idiomatic": "Tian Rong said: 'Have Chu kill Tian Jia, and Zhao kill Tian Jiao and Tian Jian, then I will be willing to send troops.'"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "楚懷王曰：「田假與國之王，窮而歸我，殺之不義。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chu Huai wang say: Tian Jia give state wang, poor return me, kill him not righteous.",
              "idiomatic": "King Huai of Chu said: 'Tian Jia gave himself as king of the state. He came to me in poverty, and killing him would not be righteous.'"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "趙亦不殺田角、田閒以市於齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao also not kill Tian Jiao, Tian Jian to trade at Qi.",
              "idiomatic": "Zhao also did not kill Tian Jiao and Tian Jian in order to trade with Qi."
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "齊曰：「蝮螫手則斬手，螫足則斬足。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi say: Viper sting hand then cut hand, sting foot then cut foot.",
              "idiomatic": "Qi said: 'If a viper stings your hand, you cut off the hand; if it stings your foot, you cut off the foot."
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "何者？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "What?",
              "idiomatic": "Why?"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "為害於身也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Because harm body.",
              "idiomatic": "Because it harms the body."
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "今田假、田角、田閒於楚、趙，非直手足戚也，何故不殺？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now Tian Jia, Tian Jiao, Tian Jian at Chu, Zhao, not only hand foot relative, why not kill?",
              "idiomatic": "Now Tian Jia, Tian Jiao, and Tian Jian are in Chu and Zhao. They are not merely relatives like hands and feet—why not kill them?"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "且秦復得志於天下，則齮龁用事者墳墓矣。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover Qin again get ambition in world, then gnaw chew officials tombs.'",
              "idiomatic": "Moreover, if Qin regains its ambitions in the world, it will gnaw at the tombs of those who held power.'"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "楚、趙不聽，齊亦怒，終不肯出兵。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chu, Zhao not listen, Qi also angry, finally not willing send troops.",
              "idiomatic": "Chu and Zhao did not listen, and Qi was also angry, finally unwilling to send troops."
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "章邯果敗殺項梁，破楚兵，楚兵東走，而章邯渡河圍趙於鉅鹿。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhang Han indeed defeat kill Xiang Liang, break Chu troops, Chu troops east flee, but Zhang Han cross river besiege Zhao at Ju Lu.",
              "idiomatic": "Zhang Han indeed defeated and killed Xiang Liang, broke the Chu troops, and the Chu troops fled east. Zhang Han then crossed the river and besieged Zhao at Julu."
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "項羽往救趙，由此怨田榮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu go save Zhao, from this resent Tian Rong.",
              "idiomatic": "Xiang Yu went to save Zhao, and from this resented Tian Rong."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Xiang Yu commanded forces numbering several tens of thousands, claiming a million, and camped at Julu, where he confronted Zhang Han's army. Yan general Zang Tu attacked Zhang Han's forces, but Zhang Han launched a surprise night attack with gagged soldiers, routing the Yan army. Zang Tu fled to Chu, where King Chu settled him in Pengcheng. When King Rong of Qi learned of Xiang Yu's death and that all the other feudal lords had surrendered, he alone refused to submit. Han King Liu Bang dispatched Peng Yue's troops to besiege him at Chengyang. Rong led his troops eastward to defend Yingqiu, pursued by Han general Guan Ying. Rong's army suffered repeated defeats, with heavy casualties among his soldiers. Rong then sent envoys bearing valuable gifts to bribe King Zang Tu of Yan, urging him to attack Han Xin. King Zang Tu of Yan attacked Han Xin at the Wei River and dealt him a major defeat. When Han King Liu Bang learned of this, he sent Chancellor Cao Can to defeat King Zang Tu at Aocang. Zang Tu fled and was killed. King Rong of Qi then fled eastward to defend Jimo. Guan Ying attacked King Rong at Qiansheng and routed him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "項羽既存趙，降章邯等，西屠咸陽，滅秦而立侯王也，乃徙齊王田市更王膠東，治即墨。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu already preserve Zhao, surrender Zhang Han etc, west slaughter Xian Yang, extinguish Qin and establish hou wang, then move Qi wang Tian Shi change wang Jiao Dong, govern Ji Mo.",
              "idiomatic": "After Xiang Yu preserved Zhao and Zhang Han and others surrendered, he went west to slaughter Xianyang, extinguished Qin, and established the various lords and kings. He then moved King Tian Shi of Qi to be king of Jiaodong, governing from Jimo."
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "齊將田都從共救趙，因入關，故立都為齊王，治臨淄。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi general Tian Du follow together save Zhao, then enter pass, therefore establish Du as Qi wang, govern Lin Zi.",
              "idiomatic": "The Qi general Tian Du followed and helped save Zhao, and then entered the pass. Therefore he was established as King of Qi, governing from Linzi."
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "故齊王建孫田安，項羽方渡河救趙，田安下濟北數城，引兵降項羽，項羽立田安為濟北王，治博陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Former Qi wang Jian grandson Tian An, Xiang Yu just cross river save Zhao, Tian An take Ji Bei several cities, lead troops surrender Xiang Yu, Xiang Yu establish Tian An as Ji Bei wang, govern Bo Yang.",
              "idiomatic": "The grandson of the former King Jian of Qi, Tian An, when Xiang Yu was crossing the river to save Zhao, took several cities in Jibei and led troops to surrender to Xiang Yu. Xiang Yu established Tian An as King of Jibei, governing from Boyang."
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "田榮以負項梁不肯出兵助楚、趙攻秦，故不得王；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong because owe Xiang Liang not willing send troops help Chu, Zhao attack Qin, therefore not obtain wang;",
              "idiomatic": "Tian Rong, because he owed Xiang Liang and was unwilling to send troops to help Chu and Zhao attack Qin, therefore did not obtain a kingdom;"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "趙將陳餘亦失職，不得王：二人俱怨項王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Zhao general Chen Yu also lose position, not obtain wang: two people both resent Xiang wang.",
              "idiomatic": "The Zhao general Chen Yu also lost his position and did not obtain a kingdom: both men resented King Xiang."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Rong retreated to defend Yingqiu, where Guan Ying besieged him. Rong's younger brother Tian Heng rallied the scattered Qi troops, gathering several tens of thousands, and attacked Guan Ying's forces, dealing them a major defeat. Guan Ying besieged Yingqiu, forcing Rong to flee to Donglai. Guan Ying caught up with Rong at Qiansheng and killed him. Guan Ying attacked Donglai, but the defending general held the city and refused to surrender. When Han King Liu Bang learned of King Rong's death, he flew into a rage and issued an order: The people of Qi are fickle, a nation of traitors! They border Chu to the south.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0038",
          "zh": "頊王既歸，諸侯各就國，田榮使人將兵助陳餘，令反趙地，而榮亦發兵以距擊田都，田都亡走楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang wang already return, various marquises each go to state, Tian Rong send person lead troops help Chen Yu, order rebel Zhao land, but Rong also send troops to resist strike Tian Du, Tian Du flee run Chu.",
              "idiomatic": "After King Xiang returned, the various lords each went to their states. Tian Rong sent men with troops to help Chen Yu, ordering him to rebel in Zhao territory, while Rong also sent troops to resist and attack Tian Du. Tian Du fled to Chu."
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "田榮留齊王市，無令之膠東。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong detain Qi wang Shi, no order him to Jiao Dong.",
              "idiomatic": "Tian Rong detained King Shi of Qi and did not order him to go to Jiaodong."
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "市之左右曰：「項王彊暴，而王當之膠東，不就國，必危。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Shi attendants say: Xiang wang strong violent, but wang should go Jiao Dong, not go to state, must danger.",
              "idiomatic": "Shi’s attendants said: 'King Xiang is strong and violent, and Your Majesty should go to Jiaodong. If you do not go to your state, you will certainly be in danger.'"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "市懼，乃亡就國。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Shi fear, then flee go to state.",
              "idiomatic": "Shi was afraid and fled to his state."
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "田榮怒，追擊殺齊王市於即墨，還攻殺濟北王安。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Rong angry, pursue strike kill Qi wang Shi at Ji Mo, return attack kill Ji Bei wang An.",
              "idiomatic": "Tian Rong was angry, pursued and attacked, killing King Shi of Qi at Jimo. He returned and attacked, killing King An of Jibei."
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "於是田榮乃自立為齊王，盡并三齊之地。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then Tian Rong then self establish as Qi wang, exhaust annex three Qi lands.",
              "idiomatic": "Tian Rong then established himself as King of Qi, completely annexing all the lands of the three Qi regions."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He did not want Qi people to follow their king and therefore ordered the territory to be divided among the nobility, with Lu as the boundary. He dispatched Grand General Han Xin to attack Qi. Han Xin led troops eastward to attack Qi. King Heng defended the cities but surrendered without battle, allowing Han Xin to pacify all Qi territory. After Xiang Yu's death, Han King Liu Bang used Peng Yue's troops to besiege King Tian Heng of Qi at Chengyang, forcing Heng to surrender to Peng Yue. Peng Yue entrusted Heng to Marquis Yue of Lean, making him a military advisor and settling him in Yang. Heng and two of his retainers sailed into the sea and took refuge on an island.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "項王聞之，大怒，乃北伐齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang wang hear it, greatly angry, then north attack Qi.",
              "idiomatic": "King Xiang heard of it and was greatly angered. He then attacked Qi to the north."
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "齊王田榮兵敗，走平原，平原人殺榮。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi wang Tian Rong troops defeat, flee Ping Yuan, Ping Yuan people kill Rong.",
              "idiomatic": "King Tian Rong of Qi suffered defeat, fled to Pingyuan, and the people of Pingyuan killed Rong."
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "項王遂燒夷齊城郭，所過者盡屠之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang wang then burn raze Qi city walls, what pass all slaughter them.",
              "idiomatic": "King Xiang then burned and razed the cities and walls of Qi, slaughtering all those he passed."
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "齊人相聚畔之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi people mutually gather rebel him.",
              "idiomatic": "The people of Qi gathered together and rebelled against him."
            }
          ]
        },
        {
          "id": "s0048",
          "zh": "榮弟橫，收齊散兵，得數萬人，反擊項羽於城陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Rong younger brother Heng, gather Qi scattered troops, obtain several ten thousand people, counter strike Xiang Yu at Cheng Yang.",
              "idiomatic": "Rong's younger brother Heng gathered Qi's scattered troops, obtaining tens of thousands of men, and counterattacked Xiang Yu at Chengyang."
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "而漢王率諸侯敗楚，入彭城。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "But Han wang lead various marquises defeat Chu, enter Peng Cheng.",
              "idiomatic": "But the Han king led the various lords, defeated Chu, and entered Pengcheng."
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "項羽聞之，乃醳齊而歸，擊漢於彭城，因連與漢戰，相距滎陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Xiang Yu hear it, then abandon Qi return, strike Han at Peng Cheng, then connect with Han battle, mutually oppose Xing Yang.",
              "idiomatic": "Xiang Yu heard of it and abandoned Qi to return, striking Han at Pengcheng. He then continuously battled with Han, confronting each other at Xingyang."
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "以故田橫復得收齊城邑，立田榮子廣為齊王，而橫相之，專國政，政無巨細皆斷於相。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Therefore Tian Heng again able gather Qi cities towns, establish Tian Rong son Guang as Qi wang, but Heng chancellor him, monopolize state government, government without large small all decide at chancellor.",
              "idiomatic": "Therefore Tian Heng was again able to gather Qi's cities and towns. He established Tian Rong's son Guang as King of Qi, while Heng served as his chancellor, monopolizing the state's government. All matters of government, great and small, were decided by the chancellor."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Gaozu learned of this, he grew furious and said, Tian Heng and his followers admire righteousness and dwell on an island, making me appear resentful to all under heaven. He sent envoys bearing imperial credentials to summon Heng. Heng and his two retainers traveled by relay carriage to Luoyang. Before reaching Luoyang, thirty li away, they arrived at the pavilion of the Marquis of Shixiang. Heng addressed the envoys: As a subject about to see the emperor, I must bathe and purify myself. He told his retainers: I once sat facing south as king alongside the Han King, both calling ourselves sovereign. Now the Han King is emperor, and I am reduced to a fugitive serving him facing north—what humiliation! He then cut his own throat and ordered his retainers to present his head to the envoys, who rushed to deliver it to the emperor. Gaozu exclaimed, Alas! There was reason for it! Gaozu pardoned Heng's retainers, ordering them to live in Luoyang.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "橫定齊三年，漢王使酈生往說下齊王廣及其相國橫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Heng pacify Qi three years, Han wang make Li Sheng go persuade subdue Qi wang Guang and his prime minister Heng.",
              "idiomatic": "After Heng had pacified Qi for three years, the Han king sent Li Sheng to go and persuade the submission of King Guang of Qi and his prime minister Heng."
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "橫以為然，解其歷下軍。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Heng think so, disband his Li Xia army.",
              "idiomatic": "Heng thought this was right and disbanded his army at Lixia."
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "漢將韓信引兵且東擊齊。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han general Han Xin lead troops about east strike Qi.",
              "idiomatic": "The Han general Han Xin led troops and was about to attack Qi to the east."
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "齊初使華無傷、田解軍於歷下以距漢，漢使至，乃罷守戰備，縱酒，且遣使與漢平。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi initially make Hua Wu Shang, Tian Jie army at Li Xia to resist Han, Han envoy arrive, then stop guard battle preparations, indulge wine, moreover send envoy with Han peace.",
              "idiomatic": "Qi had initially sent Hua Wushang and Tian Jie to station troops at Lixia to resist Han. When the Han envoy arrived, they stopped their guard and battle preparations, indulged in drinking wine, and moreover sent envoys to make peace with Han."
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "漢將韓信已平趙、燕，用蒯通計，度平原，襲破齊歷下軍，因入臨淄。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han general Han Xin already pacify Zhao, Yan, use Kuai Tong plan, cross Ping Yuan, attack break Qi Li Xia army, then enter Lin Zi.",
              "idiomatic": "The Han general Han Xin had already pacified Zhao and Yan. Using Kuai Tong's plan, he crossed the Pingyuan, attacked and broke the Qi army at Lixia, and then entered Linzi."
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "齊王廣、相橫怒，以酈生賣己，而亨酈生。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi wang Guang, chancellor Heng angry, think Li Sheng betray self, but cook Li Sheng.",
              "idiomatic": "King Guang of Qi and Chancellor Heng were angry, thinking Li Sheng had betrayed them, and cooked Li Sheng."
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "齊王廣東走高密，相橫走博（陽），守相田光走城陽，將軍田既軍於膠東。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Qi wang Guang east flee Gao Mi, chancellor Heng flee Bo (Yang), defender chancellor Tian Guang flee Cheng Yang, general Tian Ji army at Jiao Dong.",
              "idiomatic": "King Guang of Qi fled east to Gaomi, Chancellor Heng fled to Boyang, defender chancellor Tian Guang fled to Chengyang, and General Tian Ji stationed troops in Jiaodong."
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "楚使龍且救齊，齊王與合軍高密。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Chu send Long Ju save Qi, Qi wang with combine army Gao Mi.",
              "idiomatic": "Chu sent Long Ju to save Qi, and the King of Qi combined forces with him at Gaomi."
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "漢將韓信與曹參破殺龍且，虜齊王廣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han general Han Xin with Cao Can break kill Long Ju, capture Qi wang Guang.",
              "idiomatic": "The Han general Han Xin, together with Cao Can, broke and killed Long Ju, capturing King Guang of Qi."
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "漢將灌嬰追得齊守相田光。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han general Guan Ying pursue obtain Qi defender chancellor Tian Guang.",
              "idiomatic": "The Han general Guan Ying pursued and captured Qi's defender chancellor Tian Guang."
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "至博（陽），而橫聞齊王死，自立為齊王，還擊嬰，嬰敗橫之軍於嬴下。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive Bo (Yang), but Heng hear Qi wang die, self establish as Qi wang, return strike Ying, Ying defeat Heng army at Ying Xia.",
              "idiomatic": "When they arrived at Boyang, Heng heard that the King of Qi had died, so he established himself as King of Qi, returned to attack Ying, and Ying defeated Heng's army at Yingxia."
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "田橫亡走梁，歸彭越。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Heng flee run Liang, return Peng Yue.",
              "idiomatic": "Tian Heng fled to Liang and took refuge with Peng Yue."
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "彭越是時居梁地，中立，且為漢，且為楚。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Peng Yue at this time reside Liang land, neutral stand, moreover for Han, moreover for Chu.",
              "idiomatic": "Peng Yue at this time resided in Liang territory, maintaining neutrality, sometimes for Han, sometimes for Chu."
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "韓信已殺龍且，因令曹參進兵破殺田既於膠東，使灌嬰破殺齊將田吸於千乘。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han Xin already kill Long Ju, then order Cao Can advance troops break kill Tian Ji at Jiao Dong, make Guan Ying break kill Qi general Tian Xi at Qian Cheng.",
              "idiomatic": "After Han Xin had killed Long Ju, he ordered Cao Can to advance troops and break and kill Tian Ji at Jiaodong, and had Guan Ying break and kill the Qi general Tian Xi at Qiancheng."
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "韓信遂平齊，乞自立為齊假王，漢因而立之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Han Xin then pacify Qi, beg self establish as Qi acting wang, Han therefore establish him.",
              "idiomatic": "Han Xin then pacified Qi and begged to establish himself as acting King of Qi, and Han therefore established him as such."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Tian Heng's two retainers, fearing that the emperor would eventually kill them, buried themselves alive in Heng's tomb. Gaozu heard of this and praised them greatly, saying, There are no more men like these two! He bestowed upon their families ten households each to support them. Fan Kuai was from Pei, a subordinate of Gaozu. He had once saved Gaozu's life when they were surrounded by Xiang Yu's troops at Xingyang. Gaozu became emperor and enfeoffed Kuai as Marquis of Ye. Li Shang was from Chengyang, a Chu man. He served under Xiang Liang and Xiang Yu, later submitting to Han. He followed Han Xin in attacking Yan and Zhao, establishing merit. Gaozu enfeoffed him as Marquis of Quyang. Teng Ying was from Jingling, a Chu man. He was a Confucian scholar who had studied under Fuqiu Bo. He served as an official under Xiang Liang and Xiang Yu. When Xiang Yu perished, Ying submitted to Han. He became a clerk for Han Xin, following him in pacifying Yan.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "後歲餘，漢滅項籍，漢王立為皇帝，以彭越為梁王。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Later year more, Han extinguish Xiang Ji, Han wang establish as emperor, with Peng Yue as Liang wang.",
              "idiomatic": "After more than a year, Han extinguished Xiang Ji, and the Han king established himself as emperor, making Peng Yue King of Liang."
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "田橫懼誅，而與其徒屬五百餘人入海，居島中。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Heng fear execute, but with his followers five hundred more people enter sea, reside island middle.",
              "idiomatic": "Tian Heng feared execution and, together with over five hundred of his followers, entered the sea and resided on an island."
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "高帝聞之，以為田橫兄弟本定齊，齊人賢者多附焉，今在海中不收，後恐為亂，乃使使赦田橫罪而召之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di hear it, think Tian Heng brothers originally pacify Qi, Qi people worthy ones many attach him, now in sea middle not collect, later fear become chaos, then send envoy pardon Tian Heng crime and summon him.",
              "idiomatic": "The Gao Emperor heard of this and thought that the Tian Heng brothers had originally pacified Qi, and many worthy men of Qi were attached to them. If they were not brought in from the sea now, he feared they might cause chaos later. He then sent an envoy to pardon Tian Heng's crime and summon him."
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "田橫因謝曰：「臣亨陛下之使酈生，今聞其弟酈商為漢將而賢，臣恐懼，不敢奉詔，請為庶人，守海島中。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Heng then decline say: Minister cook your majesty envoy Li Sheng, now hear his younger brother Li Shang as Han general and worthy, minister fear, not dare receive decree, please as common person, guard sea island middle.",
              "idiomatic": "Tian Heng then declined, saying: 'This minister cooked Your Majesty's envoy Li Sheng. Now I hear that his younger brother Li Shang is a worthy general of Han. This minister is fearful and does not dare receive the decree. Please let me be a common person guarding the sea island.'"
            }
          ]
        },
        {
          "id": "s0071",
          "zh": "使還報，高皇帝乃詔衛尉酈商曰：「齊王田橫即至，人馬從者敢動搖者致族夷！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Envoy return report, Gao emperor then decree guard captain Li Shang say: Qi wang Tian Heng immediately arrive, people horses followers dare move shake bring clan exterminate!",
              "idiomatic": "The envoy returned and reported this. The Gao Emperor then decreed to the Guard Captain Li Shang: 'When King Tian Heng of Qi arrives immediately, anyone who dares to move or shake among the people, horses, or followers will bring extermination of their clan!'"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "乃復使使持節具告以詔商狀，曰：「田橫來，大者王，小者乃侯耳；",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then again send envoy hold tally fully tell with decree Shang situation, say: Tian Heng come, big then wang, small then hou only;",
              "idiomatic": "He then again sent an envoy holding the tally to fully inform him of the decree to Shang, saying: 'If Tian Heng comes, the great one will be king, the small one will be marquis at most;'"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "不來，且舉兵加誅焉。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Not come, moreover raise troops add execute them.'",
              "idiomatic": "If he does not come, we will moreover raise troops and execute them.'"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "田橫乃與其客二人乘傳詣雒陽。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Heng then with his guest two people ride relay chariot go Luo Yang.",
              "idiomatic": "Tian Heng then, together with two of his guests, rode a relay chariot to Luoyang."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He was enfeoffed as Marquis of Dingtao. Guan Ying was from Donghai. He served Gaozu as a cavalry officer. He participated in the battle of Pengcheng, where he was wounded. He followed Gaozu to Guanzhong, establishing merit. He was enfeoffed as Marquis of Yishui. He died in the first year of Gaozu's reign. Guan Ying's son Guan Fu succeeded him as marquis.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "未至三十里，至尸鄉廄置，橫謝使者曰：「人臣見天子當洗沐。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Not arrive thirty li, arrive Shi Xiang stable station, Heng thank envoy say: Person minister see Son of Heaven should wash bathe.",
              "idiomatic": "When he was thirty li from arriving, at the Shixiang stable station, Heng thanked the envoy, saying: 'A minister seeing the Son of Heaven should wash and bathe.'"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "止留。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Stop stay.",
              "idiomatic": "He stopped and stayed."
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "謂其客曰：「橫始與漢王俱南面稱孤，今漢王為天子，而橫乃為亡虜而北面事之，其恥固已甚矣。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tell his guest say: Heng begin with Han wang both south face call lone, now Han wang as Son of Heaven, but Heng then as fugitive captive north face serve him, its shame firmly already very.",
              "idiomatic": "He told his guests: 'Heng at first, together with the Han king, both faced south and called ourselves solitary rulers. Now the Han king is the Son of Heaven, while Heng has become a fugitive captive who faces north to serve him. This shame is truly already extreme."
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "且吾亨人之兄，與其弟并肩而事其主，縱彼畏天子之詔，不敢動我，我獨不愧於心乎？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover I cook people brother, with his younger brother shoulder to shoulder serve their master, even if he fear Son of Heaven decree, not dare move me, I alone not ashamed at heart?",
              "idiomatic": "Moreover, I cooked someone's brother, and now I would serve alongside his younger brother under their master. Even if he fears the Son of Heaven's decree and does not dare move against me, would I alone not feel ashamed in my heart?'"
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "且陛下所以欲見我者，不過欲一見吾面貌耳。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Moreover your majesty reason want see me, not exceed want one see my face appearance only.",
              "idiomatic": "Moreover, the reason Your Majesty wants to see me is no more than wanting to see my face once.'"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "今陛下在洛陽，今斬吾頭，馳三十里閒，形容尚未能敗，猶可觀也。」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Now your majesty at Luo Yang, now cut my head, gallop thirty li between, appearance not yet able decay, still can view.'",
              "idiomatic": "Now Your Majesty is in Luoyang. If I cut off my head now and gallop thirty li, my appearance will not yet have decayed and can still be viewed.'"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "遂自剄，令客奉其頭，從使者馳奏之高帝。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then self slit throat, order guest present his head, follow envoy gallop memorial to Gao Di.",
              "idiomatic": "He then slit his own throat and ordered his guest to present his head, following the envoy to gallop and present it to the Gao Emperor."
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "高帝曰：「嗟乎，有以也夫！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di say: Alas, have reason!",
              "idiomatic": "The Gao Emperor said: 'Alas, there is reason to it!'"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "起自布衣，兄弟三人更王，豈不賢乎哉！」",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Rise from common cloth, brothers three take turns wang, how not worthy!",
              "idiomatic": "Rising from commoners, three brothers took turns as kings—how worthy they were!'"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "為之流涕，而拜其二客為都尉，發卒二千人，以王者禮葬田橫。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "For him flow tears, but appoint his two guests as commandants, send troops two thousand, with wang rite bury Tian Heng.",
              "idiomatic": "He shed tears for him and appointed his two guests as commandants, sending two thousand troops to bury Tian Heng with the rites of a king."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Lu Jia was from Zhuxu, a Chu man. He had been a traveling merchant. He advised Gaozu on governing the realm. He was enfeoffed as Marquis of Shen. He composed the Spring and Autumn Annals of the New Era. Zhou Chang was from Pei, a subordinate of Gaozu. He participated in the battle of Pengcheng, where he was wounded. He followed Gaozu to Guanzhong, establishing merit. He was enfeoffed as Marquis of Dingyang. Ding Che was from Pei, a subordinate of Gaozu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "既葬，二客穿其冢旁孔，皆自剄，下從之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Already bury, two guests dig their tomb beside hole, all self slit throat, descend follow him.",
              "idiomatic": "After the burial, the two guests dug holes beside his tomb, all slit their throats, and descended to follow him."
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "高帝聞之，乃大驚，大田橫之客皆賢。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Gao Di hear it, then greatly astonished, praise Tian Heng guests all worthy.",
              "idiomatic": "The Gao Emperor heard of this and was greatly astonished, praising that all of Tian Heng's guests were worthy."
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "吾聞其餘尚五百人在海中，使使召之。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "I hear his remainder still five hundred people in sea middle, send envoy summon them.",
              "idiomatic": "I heard that there are still five hundred of his followers in the sea. I will send envoys to summon them."
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "至則聞田橫死，亦皆自殺。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Arrive then hear Tian Heng die, also all self kill.",
              "idiomatic": "When they arrived and heard that Tian Heng had died, they all committed suicide as well."
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "於是乃知田橫兄弟能得士也。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Then then know Tian Heng brothers able get scholars.",
              "idiomatic": "Then he knew that the Tian Heng brothers were able to attract worthy men."
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He participated in the battle of Pengcheng, where he was wounded. He followed Gaozu to Guanzhong, establishing merit. He was enfeoffed as Marquis of Nangong. Liu Ze was from Pei, Gaozu's nephew. He participated in the battle of Pengcheng, where he was wounded.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "太史公曰：甚矣蒯通之謀，亂齊驕淮陰，其卒亡此兩人！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Grand historian say: Very Kuai Tong plan, confuse Qi arrogant Huai Yin, his finally perish this two people!",
              "idiomatic": "The Grand Historian says: How extreme was Kuai Tong's plotting! He confused Qi and made Huaiyin arrogant, and in the end it perished these two men!"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "蒯通者，善為長短說，論戰國之權變，為八十一首。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Kuai Tong person, good make long short say, discuss Warring States power change, make eighty one chapters.",
              "idiomatic": "Kuai Tong was skilled at long and short speeches, discussing the power shifts of the Warring States period. He composed eighty-one chapters."
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "通善齊人安期生，安期生嘗干項羽，項羽不能用其筴。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tong friendly Qi person An Qi Sheng, An Qi Sheng once petition Xiang Yu, Xiang Yu not able use his strategy.",
              "idiomatic": "Tong was friendly with the Qi man An Qisheng. An Qisheng once petitioned Xiang Yu, but Xiang Yu could not use his strategies."
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "已而項羽欲封此兩人，兩人終不肯受，亡去。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Already then Xiang Yu wish enfeoff this two people, two people finally not willing receive, flee go.",
              "idiomatic": "Afterward, Xiang Yu wished to enfeoff these two men, but they finally were unwilling to receive it and fled away."
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "田橫之高節，賓客慕義而從橫死，豈非至賢！",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Tian Heng high integrity, guests admire righteousness follow Heng die, how not utmost worthy!",
              "idiomatic": "Tian Heng's noble integrity, where his guests admired righteousness and followed Heng in death—how was this not the utmost worthiness!"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "余因而列焉。",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "I therefore list them.",
              "idiomatic": "I therefore list them here."
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "不無善畫者，莫能圖，何哉？",
          "translations": [
            {
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-code-fast-1",
              "literal": "Not without good painters, none able paint, what?",
              "idiomatic": "It is not that there are no good painters, but none can paint it. Why is this?"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He followed Gaozu to Guanzhong, establishing merit. He was enfeoffed as Marquis of Chengyang. Shen Yiji was from Lu, a Chu man. He served under Xiang Liang and Xiang Yu. When Xiang Yu perished, he submitted to Han. He was enfeoffed as Marquis of Huaiyin. Wang Wu was from Pei, a subordinate of Gaozu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}