{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "095",
    "url": "https://chinesenotes.com/shiji/shiji095.html",
    "title": {
      "zh": "樊酈滕灌列傳",
      "en": "Biographies of Fan, Li, Teng and Guan",
      "raw": "《樊酈滕灌列傳》 Biographies of Fan, Li, Teng and Guan"
    },
    "sentenceCount": 267,
    "translatedCount": 0,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:22.450Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "舞陽侯樊噲者，沛人也。",
          "translations": []
        },
        {
          "id": "s0002",
          "zh": "以屠狗為事，與高祖俱隱。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Fan Kuai, Marquis of Wuyang, hailed from Pei. He earned his living as a dog butcher and went into hiding alongside Gaozu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0003",
          "zh": "初從高祖起豐，攻下沛。",
          "translations": []
        },
        {
          "id": "s0004",
          "zh": "高祖為沛公，以噲為舍人。",
          "translations": []
        },
        {
          "id": "s0005",
          "zh": "從攻胡陵、方與，還守豐，擊泗水監豐下，破之。",
          "translations": []
        },
        {
          "id": "s0006",
          "zh": "復東定沛，破泗水守薛西。",
          "translations": []
        },
        {
          "id": "s0007",
          "zh": "與司馬夷戰碭東，卻敵，斬首十五級，賜爵國大夫。",
          "translations": []
        },
        {
          "id": "s0008",
          "zh": "常從，沛公擊章邯軍濮陽，攻城先登，斬首二十三級，賜爵列大夫。",
          "translations": []
        },
        {
          "id": "s0009",
          "zh": "復常從，從攻城陽，先登。",
          "translations": []
        },
        {
          "id": "s0010",
          "zh": "下戶牖，破李由軍，斬首十六級，賜上閒爵。",
          "translations": []
        },
        {
          "id": "s0011",
          "zh": "從攻圍東郡守尉於成武，卻敵，斬首十四級，捕虜十一人，賜爵五大夫。",
          "translations": []
        },
        {
          "id": "s0012",
          "zh": "從擊秦軍，出亳南。",
          "translations": []
        },
        {
          "id": "s0013",
          "zh": "河閒守軍於杠里，破之。",
          "translations": []
        },
        {
          "id": "s0014",
          "zh": "擊破趙賁軍開封北，以卻敵先登，斬候一人，首六十八級，捕虜二十七人，賜爵卿。",
          "translations": []
        },
        {
          "id": "s0015",
          "zh": "從攻破楊熊軍於曲遇。",
          "translations": []
        },
        {
          "id": "s0016",
          "zh": "攻宛陵，先登，斬首八級，捕虜四十四人，賜爵封號賢成君。",
          "translations": []
        },
        {
          "id": "s0017",
          "zh": "從攻長社、轘轅，絕河津，東攻秦軍於尸，南攻秦軍於犨。",
          "translations": []
        },
        {
          "id": "s0018",
          "zh": "破南陽守齮於陽城。",
          "translations": []
        },
        {
          "id": "s0019",
          "zh": "東攻宛城，先登。",
          "translations": []
        },
        {
          "id": "s0020",
          "zh": "西至酈，以卻敵，斬首二十四級，捕虜四十人，賜重封。",
          "translations": []
        },
        {
          "id": "s0021",
          "zh": "攻武關，至霸上，斬都尉一人，首十級，捕虜百四十六人，降卒二千九百人。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "He first followed Gaozu in his uprising from Feng, helping capture Pei. When Gaozu became Duke of Pei, he appointed Fan Kuai as his personal attendant. He followed in attacking Hul陵 and Fangyu, then returned to defend Feng. Former guests who had once deserted him occasionally came to congratulate him. On a leisurely day, the Duke of Pei went out with over a hundred horsemen to hunt pheasants and rabbits in the fields. Yong Chi came as a guest to the Duke of Pei. The duke drank with him, and their feast was very merry. Yong Chi got drunk. The Duke of Pei secretly placed stolen dog meat on Yong Chi's seat. Yong Chi grew angry and left. Yong Chi was furious and rebelled against the Duke of Pei. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled. Yong Chi rebelled against the Duke of Pei. The duke and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0022",
          "zh": "項羽在戲下，欲攻沛公。",
          "translations": []
        },
        {
          "id": "s0023",
          "zh": "沛公從百餘騎因項伯面見項羽，謝無有閉關事。",
          "translations": []
        },
        {
          "id": "s0024",
          "zh": "項羽既饗軍士，中酒，亞父謀欲殺沛公，令項莊拔劍舞坐中，欲擊沛公，項伯常（肩）［屏］蔽之。",
          "translations": []
        },
        {
          "id": "s0025",
          "zh": "時獨沛公與張良得入坐，樊噌在營外，聞事急，乃持鐵盾入到營。",
          "translations": []
        },
        {
          "id": "s0026",
          "zh": "營衛止噲，噲直撞入，立帳下。",
          "translations": []
        },
        {
          "id": "s0027",
          "zh": "項羽目之，問為誰。",
          "translations": []
        },
        {
          "id": "s0028",
          "zh": "張良曰：「沛公參乘樊噲。」",
          "translations": []
        },
        {
          "id": "s0029",
          "zh": "項羽曰：「壯士。」",
          "translations": []
        },
        {
          "id": "s0030",
          "zh": "賜之卮酒彘肩。",
          "translations": []
        },
        {
          "id": "s0031",
          "zh": "噲既飲酒，拔劍切肉食，盡之。",
          "translations": []
        },
        {
          "id": "s0032",
          "zh": "項羽曰：「能復飲乎？」",
          "translations": []
        },
        {
          "id": "s0033",
          "zh": "噲曰：「臣死且不辭，豈特卮酒乎！",
          "translations": []
        },
        {
          "id": "s0034",
          "zh": "且沛公先入定咸陽，暴師霸上，以待大王。",
          "translations": []
        },
        {
          "id": "s0035",
          "zh": "大王今日至，聽小人之言，與沛公有隙，臣恐天下解，心疑大王也。」",
          "translations": []
        },
        {
          "id": "s0036",
          "zh": "項羽默然。",
          "translations": []
        },
        {
          "id": "s0037",
          "zh": "沛公如廁，麾樊噲去。",
          "translations": []
        },
        {
          "id": "s0038",
          "zh": "既出，沛公留車騎，獨騎一馬，與樊噲等四人步從，從閒道山下歸走霸上軍，而使張良謝項羽。",
          "translations": []
        },
        {
          "id": "s0039",
          "zh": "項羽亦因遂已，無誅沛公之心矣。",
          "translations": []
        },
        {
          "id": "s0040",
          "zh": "是日微樊噲奔入營譙讓項羽，沛公事幾殆。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "明日，項羽入屠咸陽，立沛公為漢王。",
          "translations": []
        },
        {
          "id": "s0042",
          "zh": "漢王賜噲爵為列侯，號臨武侯。",
          "translations": []
        },
        {
          "id": "s0043",
          "zh": "遷為郎中，從入漢中。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "還定三秦，別擊西丞白水北，雍輕車騎於雍南，破之。",
          "translations": []
        },
        {
          "id": "s0045",
          "zh": "從攻雍、斄城，先登。",
          "translations": []
        },
        {
          "id": "s0046",
          "zh": "擊章平軍好畤，攻城，先登陷陣，斬縣令丞各一人，首十一級，虜二十人，遷郎中騎將。",
          "translations": []
        },
        {
          "id": "s0047",
          "zh": "從擊秦車騎壤東，卻敵，遷為將軍。",
          "translations": []
        },
        {
          "id": "s0048",
          "zh": "攻趙賁，下郿、槐裏、柳中、咸陽；",
          "translations": []
        },
        {
          "id": "s0049",
          "zh": "灌廢丘，最。",
          "translations": []
        },
        {
          "id": "s0050",
          "zh": "至櫟陽，賜食邑杜之樊鄉。",
          "translations": []
        },
        {
          "id": "s0051",
          "zh": "從攻項籍，屠煮棗。",
          "translations": []
        },
        {
          "id": "s0052",
          "zh": "擊破王武、程處軍於外黃。",
          "translations": []
        },
        {
          "id": "s0053",
          "zh": "攻鄒、魯、瑕丘、薛。",
          "translations": []
        },
        {
          "id": "s0054",
          "zh": "項羽敗漢王於彭城，盡復取魯、梁地。",
          "translations": []
        },
        {
          "id": "s0055",
          "zh": "噲還至滎陽，益食平陰二千戶，以將軍守廣武。",
          "translations": []
        },
        {
          "id": "s0056",
          "zh": "一歲，項羽引而東。",
          "translations": []
        },
        {
          "id": "s0057",
          "zh": "從高祖擊項籍，下陽夏，虜楚周將軍卒四千人。",
          "translations": []
        },
        {
          "id": "s0058",
          "zh": "圍項籍於陳，大破之。",
          "translations": []
        },
        {
          "id": "s0059",
          "zh": "屠胡陵。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. Fan Kuai attacked Feng. Yong Chi ran out of food and surrendered. Yong Chi surrendered. The Duke of Pei was gravely ill. Empress Lü and Lü Ze plotted: The duke cannot overcome his illness and cannot lead. Yong Chi rebelled and left. The Duke of Pei and Fan Kuai fled, hearing that the Viscount of Yu wanted to seize Empress Lü and Consort Qi. The Duke of Pei was terrified and returned with Fan Kuai, intending to attack Feng and rescue Empress Lü. Yong Chi was defending Feng city. The Duke of Pei led troops to attack but could not take it. The Duke of Pei fell ill and could not go, so he sent Fan Kuai to lead troops against Feng. He followed Gaozu in attacking Xiang Yu, massacring the defenders at Zhujiao. He smashed Wang Wu and Cheng Chu's forces at Waihuang. He attacked the cities of Zou, Lu, Xiaqiu, and Xue. Xiang Yu defeated the Han King at Pengcheng and completely regained control of Lu and Liang territories. Fan Kuai returned to Xingyang. He was additionally granted two thousand households in Pingyin and appointed general to defend Guangwu. After one year, Xiang Yu led his troops eastward. He followed Gaozu in attacking Xiang Yu, capturing Yangxia and taking four thousand troops from the Chu general Zhou. He surrounded Xiang Yu at Chen and dealt him a crushing defeat. He massacred the defenders at Hul陵.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "項籍既死，漢王為帝，以噲堅守戰有功，益食八百戶。",
          "translations": []
        },
        {
          "id": "s0061",
          "zh": "從高帝攻反燕王臧荼，虜荼，定燕地。",
          "translations": []
        },
        {
          "id": "s0062",
          "zh": "楚王韓信反，噲從至陳，取信，定楚。",
          "translations": []
        },
        {
          "id": "s0063",
          "zh": "更賜爵列侯，與諸侯剖符，世世勿絕，食舞陽，號為舞陽侯，除前所食。",
          "translations": []
        },
        {
          "id": "s0064",
          "zh": "以將軍從高祖攻反韓王信於代。",
          "translations": []
        },
        {
          "id": "s0065",
          "zh": "自霍人以往至雲中，與絳侯等共定之，益食千五百戶。",
          "translations": []
        },
        {
          "id": "s0066",
          "zh": "因擊陳豨與曼丘臣軍，戰襄國，破柏人，先登，降定清河、常山凡二十七縣，殘東垣，遷為左丞相。",
          "translations": []
        },
        {
          "id": "s0067",
          "zh": "破得綦毋卹、尹潘軍於無終、廣昌。",
          "translations": []
        },
        {
          "id": "s0068",
          "zh": "破豨別將胡人王黃軍於代南，因擊韓信軍於參合。",
          "translations": []
        },
        {
          "id": "s0069",
          "zh": "軍所將卒斬韓信，破豨胡騎橫谷，斬將軍趙既，虜代丞相馮梁、守孫奮、大將王黃、將軍、（太卜）太仆解福等十人。",
          "translations": []
        },
        {
          "id": "s0070",
          "zh": "與諸將共定代鄉邑七十三。",
          "translations": []
        },
        {
          "id": "s0071",
          "zh": "其後燕王盧綰反，噲以相國擊盧綰，破其丞相抵薊南，定燕地，凡縣十八，鄉邑五十一。",
          "translations": []
        },
        {
          "id": "s0072",
          "zh": "益食邑千三百戶，定食舞陽五千四百戶。",
          "translations": []
        },
        {
          "id": "s0073",
          "zh": "從，斬首百七十六級，虜二百八十八人。",
          "translations": []
        },
        {
          "id": "s0074",
          "zh": "別，破軍七，下城五，定郡六，縣五十二，得丞相一人，將軍十二人，二千石已下至三百石十一人。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Xiang Yu's death, the Han King became emperor. For Fan Kuai's steadfast defense and meritorious service in battle, he was additionally granted eight hundred households. He followed Gaozu in attacking the rebel Yan King Zang Tu at Ji, defeating him. He followed again to Chen, captured Chu King Xin, and received an enfeoffment document guaranteeing his title for generations without end. He was granted Wuyang as his fief and given the title Left General. The next year, he pacified Di and attacked Chen Xi, fighting continuous battles against Chen Xi. Chen Xi was defeated, and Fan Kuai conducted mobile warfare with Manqiu Chen in Dai. Gaozu marched south to intercept Feng Yi and others on the Long road, attacked Yong, and pacified Longxi. With the troops he commanded, he reached Guguan and the Xinan army. His nobility rank was increased, making him eligible for the position of chancellor. This is recorded in the Hereditary House of Marquis Jiang Zhou Bo. When Xiang Yu rebelled against Chu, Han Xin from Huaiyin fled from Chu to join Han. The Han King appointed Han Xin as grain commissioner, but did not consider him exceptional. Han Xin often spoke with Xiao He, who recognized his talent. This continued until they reached Nanzheng. Xiao He had not finished speaking when Gaozu exclaimed in great surprise: My realm is small—how can it contain a man like Han Xin? If we want to contend for the world, there is no one else but Han Xin. He then appointed Han Xin as Grand General, executed Zhongli Mei and six others, and sent him east to pacify Qi.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0075",
          "zh": "噲以呂后女弟呂須為婦，生子伉，故其比諸將最親。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Qi territory was completely pacified, Han Xin was transferred to become King of Chu.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0076",
          "zh": "先黥布反時，高祖嘗病甚，惡見人，臥禁中，詔戶者無得入群臣。",
          "translations": []
        },
        {
          "id": "s0077",
          "zh": "群臣絳、灌等莫敢入。",
          "translations": []
        },
        {
          "id": "s0078",
          "zh": "十餘日，噲乃排闥直入，大臣隨之。",
          "translations": []
        },
        {
          "id": "s0079",
          "zh": "上獨枕一宦者臥。",
          "translations": []
        },
        {
          "id": "s0080",
          "zh": "噲等見上流涕曰：「始陛下與臣等起豐沛，定天下，何其壯也！",
          "translations": []
        },
        {
          "id": "s0081",
          "zh": "今天下已定，又何憊也！",
          "translations": []
        },
        {
          "id": "s0082",
          "zh": "且陛下病甚，大臣震恐，不見臣等計事，顧獨與一宦者絕乎？",
          "translations": []
        },
        {
          "id": "s0083",
          "zh": "且陛下獨不見趙高之事乎？」",
          "translations": []
        },
        {
          "id": "s0084",
          "zh": "高帝笑而起。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "After Xiang Yu's death, Han Xin was transferred to become Marquis of Huaiyin. Han Xin joined Jiang Hou and others in suppressing the rebellions of Chen Xi and Ying Bu, then died. His son Han Fei succeeded him, then died without heirs. His younger brother Han Wei succeeded him as marquis. When Wei died, his son Han Dan succeeded him. When Dan died, his son Han Dai succeeded him. When Dai died, his son Han Jian succeeded him. When Jian died, his son Han Xiang succeeded him. When Xiang died, his son Han Zhong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "其後盧綰反，高帝使噲以相國擊燕。",
          "translations": []
        },
        {
          "id": "s0086",
          "zh": "是時高帝病甚，人有惡噲黨於呂氏，即上一日宮車晏駕，則噲欲以兵盡誅滅戚氏、趙王如意之屬。",
          "translations": []
        },
        {
          "id": "s0087",
          "zh": "高帝聞之大怒，乃使陳平載絳侯代將，而即軍中斬噲。",
          "translations": []
        },
        {
          "id": "s0088",
          "zh": "陳平畏呂后，執噲詣長安。",
          "translations": []
        },
        {
          "id": "s0089",
          "zh": "至則高祖已崩，呂后釋噲，使復爵邑。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Zhong died, his son Han Shu succeeded him. When Shu died, his son Han Xi succeeded him. When Xi died, his son Han Qingji succeeded him. When Qingji died, his son Han Gong succeeded him. When Gong died, his son Han Bing succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0090",
          "zh": "孝惠六年，樊噲卒，謚為武侯。",
          "translations": []
        },
        {
          "id": "s0091",
          "zh": "子伉代侯。",
          "translations": []
        },
        {
          "id": "s0092",
          "zh": "而伉母呂須亦為臨光侯，高后時用事專權，大臣盡畏之。",
          "translations": []
        },
        {
          "id": "s0093",
          "zh": "伉代侯九歲，高后崩。",
          "translations": []
        },
        {
          "id": "s0094",
          "zh": "大臣誅諸呂、呂須婘屬，因誅伉。",
          "translations": []
        },
        {
          "id": "s0095",
          "zh": "舞陽侯中絕數月。",
          "translations": []
        },
        {
          "id": "s0096",
          "zh": "孝文帝既立，乃復封噲他庶子市人為舞陽侯，復故爵邑。",
          "translations": []
        },
        {
          "id": "s0097",
          "zh": "市人立二十九歲卒，謚為荒侯。",
          "translations": []
        },
        {
          "id": "s0098",
          "zh": "子他廣代侯。",
          "translations": []
        },
        {
          "id": "s0099",
          "zh": "六歲，侯家舍人得罪他廣，怨之，乃上書曰：「荒侯市人病不能為人，令其夫人與其弟亂而生他廣，他廣實非荒侯子，不當代後。」",
          "translations": []
        },
        {
          "id": "s0100",
          "zh": "詔下吏。",
          "translations": []
        },
        {
          "id": "s0101",
          "zh": "孝景中六年，他廣奪侯為庶人，國除。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Bing died, his son Han Gai succeeded him. When Gai died, his son Han Hu succeeded him. When Hu died, his son Han Guang succeeded him. When Guang died, his son Han Dang succeeded him. When Dang died, his son Han Hui succeeded him. When Hui died, his son Han Feng succeeded him. When Feng died, his son Han Zhang succeeded him. When Zhang died, his son Han Shi succeeded him. When Shi died, his son Han Chang succeeded him. When Chang died, his son Han Chong succeeded him. When Chong died, his son Han Heng succeeded him. When Heng died, his son Han Yu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0102",
          "zh": "曲周侯酈商者，高陽人。",
          "translations": []
        },
        {
          "id": "s0103",
          "zh": "陳勝起時，商聚少年東西略人，得數千。",
          "translations": []
        },
        {
          "id": "s0104",
          "zh": "沛公略地至陳留，六月餘，商以將卒四千人屬沛公於岐。",
          "translations": []
        },
        {
          "id": "s0105",
          "zh": "從攻長社，先登，賜爵封信成君。",
          "translations": []
        },
        {
          "id": "s0106",
          "zh": "從沛公攻緱氏，絕河津，破秦軍洛陽東。",
          "translations": []
        },
        {
          "id": "s0107",
          "zh": "從攻下宛、穰，定十七縣。",
          "translations": []
        },
        {
          "id": "s0108",
          "zh": "別將攻旬關，定漢中。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yu died, his son Han Xian succeeded him. When Xian died, his son Han Jia succeeded him. When Jia died, his son Han Hong succeeded him. When Hong died, his son Han Yi succeeded him. When Yi died, his son Han An succeeded him. When An died, his son Han Rong succeeded him. When Rong died, his son Han Xu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "項羽滅秦，立沛公為漢王。",
          "translations": []
        },
        {
          "id": "s0110",
          "zh": "漢王賜商爵信成君，以將軍為隴西都尉。",
          "translations": []
        },
        {
          "id": "s0111",
          "zh": "別將定北地、上郡。",
          "translations": []
        },
        {
          "id": "s0112",
          "zh": "破雍將軍焉氏，周類軍栒邑，蘇駔軍於泥陽。",
          "translations": []
        },
        {
          "id": "s0113",
          "zh": "賜食邑武成六千戶。",
          "translations": []
        },
        {
          "id": "s0114",
          "zh": "以隴西都尉從擊項籍軍五月，出鉅野，與鐘離眛戰，疾鬬，受梁相國印，益食邑四千戶。",
          "translations": []
        },
        {
          "id": "s0115",
          "zh": "以梁相國將從擊項羽二歲三月，攻胡陵。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xu died, his son Han Sui succeeded him. When Sui died, his son Han Duan succeeded him. When Duan died, his son Han Chen succeeded him. When Chen died, his son Han Yi succeeded him. When Yi died, his son Han Zhao succeeded him. When Zhao died, his son Han Yan succeeded him. When Yan died, his son Han Qiang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0116",
          "zh": "項羽既已死，漢王為帝。",
          "translations": []
        },
        {
          "id": "s0117",
          "zh": "其秋，燕王臧荼反，商以將軍從擊荼，戰龍脫，先登陷陣，破荼軍易下，卻敵，遷為右丞相，賜爵列侯，與諸侯剖符，世世勿絕，食邑涿五千戶，號曰涿侯。",
          "translations": []
        },
        {
          "id": "s0118",
          "zh": "以右丞相別定上谷，因攻代，受趙相國印。",
          "translations": []
        },
        {
          "id": "s0119",
          "zh": "以右丞相趙相國別與絳侯等定代、鴈門，得代丞相程縱、守相郭同、將軍已下至六百石十九人。",
          "translations": []
        },
        {
          "id": "s0120",
          "zh": "還，以將軍為太上皇衛一歲七月。",
          "translations": []
        },
        {
          "id": "s0121",
          "zh": "以右丞相擊陳豨，殘東垣。",
          "translations": []
        },
        {
          "id": "s0122",
          "zh": "又以右丞相從高帝擊黥布，攻其前拒，陷兩陳，得以破布軍，更食曲周五千一百戶，除前所食，凡別破軍三，降定郡六，縣七十三，得丞相、守相、大將各一人，小將二人，二千石已下至六百石十九人。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Qiang died, his son Han Yan succeeded him. When Yan died, his son Han Wu succeeded him. When Wu died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Jie succeeded him. When Jie died, his son Han Min succeeded him. When Min died, his son Han Zhi succeeded him. When Zhi died, his son Han Fu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0123",
          "zh": "商事孝惠、高后時，商病，不治。",
          "translations": []
        },
        {
          "id": "s0124",
          "zh": "其子寄，字況，與呂祿善。",
          "translations": []
        },
        {
          "id": "s0125",
          "zh": "及高后崩，大臣欲誅諸呂，呂祿為將軍，軍於北軍，太尉勃不得入北軍，於是乃使人劫酈商，令其子況紿呂祿，呂祿信之，故與出游，而太尉勃乃得入據北軍，遂誅諸呂。",
          "translations": []
        },
        {
          "id": "s0126",
          "zh": "是歲商卒，謚為景侯。",
          "translations": []
        },
        {
          "id": "s0127",
          "zh": "子寄代侯。",
          "translations": []
        },
        {
          "id": "s0128",
          "zh": "天下稱酈況賣交也。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Fu died, his son Han Xian succeeded him. When Xian died, his son Han Yu succeeded him. When Yu died, his son Han Kang succeeded him. When Kang died, his son Han He succeeded him. When He died, his son Han Qi succeeded him. When Qi died, his son Han Yuan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0129",
          "zh": "孝景前三年，吳、楚、齊、趙反，上以寄為將軍，圍趙城，十月不能下。",
          "translations": []
        },
        {
          "id": "s0130",
          "zh": "得俞侯欒布自平齊來，乃下趙城，滅趙，王自殺，除國。",
          "translations": []
        },
        {
          "id": "s0131",
          "zh": "孝景中二年，寄欲取平原君為夫人，景帝怒，下寄吏，有罪，奪侯。",
          "translations": []
        },
        {
          "id": "s0132",
          "zh": "景帝乃以商他子堅封為繆侯，續酈氏後。",
          "translations": []
        },
        {
          "id": "s0133",
          "zh": "繆靖侯卒，子康侯遂成立。",
          "translations": []
        },
        {
          "id": "s0134",
          "zh": "遂成卒，子懷侯世宗立。",
          "translations": []
        },
        {
          "id": "s0135",
          "zh": "世宗卒，子侯終根立，為太常，坐法，國除。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yuan died, his son Han Mao succeeded him. When Mao died, his son Han Bao succeeded him. When Bao died, his son Han Xun succeeded him. When Xun died, his son Han Ji succeeded him. When Ji died, his son Han Ying succeeded him. When Ying died, his son Han Huang succeeded him. When Huang died, his son Han Kui succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0136",
          "zh": "汝陰侯夏侯嬰，沛人也。",
          "translations": []
        },
        {
          "id": "s0137",
          "zh": "為沛廄司御。",
          "translations": []
        },
        {
          "id": "s0138",
          "zh": "每送使客還，過沛泗上亭，與高祖語，未嘗不移日也。",
          "translations": []
        },
        {
          "id": "s0139",
          "zh": "嬰已而試補縣吏，與高祖相愛。",
          "translations": []
        },
        {
          "id": "s0140",
          "zh": "高祖戲而傷嬰，人有告高祖。",
          "translations": []
        },
        {
          "id": "s0141",
          "zh": "高祖時為亭長，重坐傷人，告故不傷嬰，嬰證之。",
          "translations": []
        },
        {
          "id": "s0142",
          "zh": "後獄覆，嬰坐高祖系歲餘，掠笞數百，終以是脫高祖。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Kui died, his son Han Yong succeeded him. When Yong died, his son Han Xi succeeded him. When Xi died, his son Han Yan succeeded him. When Yan died, his son Han Jing succeeded him. When Jing died, his son Han Fang succeeded him. When Fang died, his son Han Xun succeeded him. When Xun died, his son Han Zhu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0143",
          "zh": "高祖之初與徒屬欲攻沛也，嬰時以縣令史為高祖使。",
          "translations": []
        },
        {
          "id": "s0144",
          "zh": "上降沛一日，高祖為沛公，賜嬰爵七大夫，以為太仆。",
          "translations": []
        },
        {
          "id": "s0145",
          "zh": "從攻胡陵，嬰與蕭何降泗水監平，平以胡陵降，賜嬰爵五大夫。",
          "translations": []
        },
        {
          "id": "s0146",
          "zh": "從擊秦軍碭東，攻濟陽，下戶牖，破李由軍雍丘下，以兵車趣攻戰疾，賜爵執帛。",
          "translations": []
        },
        {
          "id": "s0147",
          "zh": "常以太仆奉車從擊章邯軍東阿、濮陽下，以兵車趣攻戰疾，破之，賜爵執珪。",
          "translations": []
        },
        {
          "id": "s0148",
          "zh": "復常奉車從擊趙賁軍開封，楊熊軍曲遇。",
          "translations": []
        },
        {
          "id": "s0149",
          "zh": "嬰從捕虜六十八人，降卒八百五十人，得印一匱。",
          "translations": []
        },
        {
          "id": "s0150",
          "zh": "因復常奉車從擊秦軍雒陽東，以兵車趣攻戰疾，賜爵封轉為滕公。",
          "translations": []
        },
        {
          "id": "s0151",
          "zh": "因復奉車從攻南陽，戰於藍田、芷陽，以兵車趣攻戰疾，至霸上。",
          "translations": []
        },
        {
          "id": "s0152",
          "zh": "項羽至，滅秦，立沛公為漢王。",
          "translations": []
        },
        {
          "id": "s0153",
          "zh": "漢王賜嬰爵列侯，號昭平侯，復為太仆，從入蜀、漢。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Zhu died, his son Han Wei succeeded him. When Wei died, his son Han Liang succeeded him. When Liang died, his son Han Kang succeeded him. When Kang died, his son Han Sheng succeeded him. When Sheng died, his son Han Xiang succeeded him. When Xiang died, his son Han Peng succeeded him. When Peng died, his son Han Qu succeeded him. When Qu died, his son Han Quan succeeded him. When Quan died, his son Han Ping succeeded him. When Ping died, his son Han Fu succeeded him. When Fu died, his son Han Gong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0154",
          "zh": "還定三秦，從擊項籍。",
          "translations": []
        },
        {
          "id": "s0155",
          "zh": "至彭城，項羽大破漢軍。",
          "translations": []
        },
        {
          "id": "s0156",
          "zh": "漢王敗，不利，馳去。",
          "translations": []
        },
        {
          "id": "s0157",
          "zh": "見孝惠、魯元，載之。",
          "translations": []
        },
        {
          "id": "s0158",
          "zh": "漢王急，馬罷，虜在後，常蹶兩兒欲棄之，嬰常收，竟載之，徐行面雍樹乃馳。",
          "translations": []
        },
        {
          "id": "s0159",
          "zh": "漢王怒，行欲斬嬰者十餘，卒得脫，而致孝惠、魯元於豐。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Gong died, his son Han Yan succeeded him. When Yan died, his son Han Ling succeeded him. When Ling died, his son Han Zhou succeeded him. When Zhou died, his son Han Tai succeeded him. When Tai died, his son Han Cheng succeeded him. When Cheng died, his son Han Xuan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0160",
          "zh": "漢王既至滎陽，收散兵，復振，賜嬰食祈陽。",
          "translations": []
        },
        {
          "id": "s0161",
          "zh": "復常奉車從擊項籍，追至陳，卒定楚，至魯，益食茲氏。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xuan died, his son Han Ji succeeded him. When Ji died, his son Han Yin succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0162",
          "zh": "漢王立為帝。",
          "translations": []
        },
        {
          "id": "s0163",
          "zh": "其秋，燕王臧荼反，嬰以太仆從擊荼。",
          "translations": []
        },
        {
          "id": "s0164",
          "zh": "明年，從至陳，取楚王信。",
          "translations": []
        },
        {
          "id": "s0165",
          "zh": "更食汝陰，剖符世世勿絕。",
          "translations": []
        },
        {
          "id": "s0166",
          "zh": "以太仆從擊代，至武泉、雲中，益食千戶。",
          "translations": []
        },
        {
          "id": "s0167",
          "zh": "因從擊韓信軍胡騎晉陽旁，大破之。",
          "translations": []
        },
        {
          "id": "s0168",
          "zh": "追北至平城，為胡所圍，七日不得通。",
          "translations": []
        },
        {
          "id": "s0169",
          "zh": "高帝使使厚遺閼氏，冒頓開圍一角。",
          "translations": []
        },
        {
          "id": "s0170",
          "zh": "高帝出欲馳，嬰固徐行，弩皆持滿外向，卒得脫。",
          "translations": []
        },
        {
          "id": "s0171",
          "zh": "益食嬰細陽千戶。",
          "translations": []
        },
        {
          "id": "s0172",
          "zh": "復以太仆從擊胡騎句注北，大破之。",
          "translations": []
        },
        {
          "id": "s0173",
          "zh": "以太仆擊胡騎平城南，三陷陳，功為多，賜所奪邑五百戶。",
          "translations": []
        },
        {
          "id": "s0174",
          "zh": "以太仆擊陳豨、黥布軍，陷陳卻敵，益食千戶，定食汝陰六千九百戶，除前所食。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yin died, his son Han Xi succeeded him. When Xi died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Kai succeeded him. When Kai died, his son Han Hao succeeded him. When Hao died, his son Han Yong succeeded him. When Yong died, his son Han Jing succeeded him. When Jing died, his son Han Guang succeeded him. When Guang died, his son Han Tao succeeded him. When Tao died, his son Han Song succeeded him. When Song died, his son Han Chen succeeded him. When Chen died, his son Han Yang succeeded him. When Yang died, his son Han Jun succeeded him. When Jun died, his son Han Yu succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0175",
          "zh": "嬰自上初起沛，常為太仆，竟高祖崩。",
          "translations": []
        },
        {
          "id": "s0176",
          "zh": "以太仆事孝惠。",
          "translations": []
        },
        {
          "id": "s0177",
          "zh": "孝惠帝及高后德嬰之脫孝惠、魯元於下邑之閒也，乃賜嬰縣北第第一，曰「近我」，以尊異之。",
          "translations": []
        },
        {
          "id": "s0178",
          "zh": "孝惠帝崩，以太仆事高后。",
          "translations": []
        },
        {
          "id": "s0179",
          "zh": "高后崩，代王之來，嬰以太仆與東牟侯入清宮，廢少帝，以天子法駕迎代王代邸，與大臣共立為孝文皇帝，復為太仆。",
          "translations": []
        },
        {
          "id": "s0180",
          "zh": "八歲卒，謚為文侯。",
          "translations": []
        },
        {
          "id": "s0181",
          "zh": "子夷侯灶立，七年卒。",
          "translations": []
        },
        {
          "id": "s0182",
          "zh": "子共侯賜立，三十一年卒。",
          "translations": []
        },
        {
          "id": "s0183",
          "zh": "子侯頗尚平陽公主。",
          "translations": []
        },
        {
          "id": "s0184",
          "zh": "立十九歲，元鼎二年，坐與父御婢姦罪，自殺，國除。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yu died, his son Han Quan succeeded him. When Quan died, his son Han Xiang succeeded him. When Xiang died, his son Han Qiang succeeded him. When Qiang died, his son Han Jie succeeded him. When Jie died, his son Han Bo succeeded him. When Bo died, his son Han Lian succeeded him. When Lian died, his son Han Rong succeeded him. When Rong died, his son Han Xin succeeded him. When Xin died, his son Han Wei succeeded him. When Wei died, his son Han Sheng succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0185",
          "zh": "潁陰侯灌嬰者，睢陽販繒者也。",
          "translations": []
        },
        {
          "id": "s0186",
          "zh": "高祖之為沛公，略地至雍丘下，章邯敗殺項梁，而沛公還軍於碭，嬰初以中涓從擊破東郡尉於成武及秦軍於扛裏，疾鬬，賜爵七大夫。",
          "translations": []
        },
        {
          "id": "s0187",
          "zh": "從攻秦軍亳南、開封、曲遇，戰疾力，賜爵執帛，號宣陵君。",
          "translations": []
        },
        {
          "id": "s0188",
          "zh": "從攻陽武以西至雒陽，破秦軍尸北，北絕河津，南破南陽守齮陽城東，遂定南陽郡。",
          "translations": []
        },
        {
          "id": "s0189",
          "zh": "西入武關，戰於藍田，疾力，至霸上，賜爵執珪，號昌文君。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Sheng died, his son Han Yi succeeded him. When Yi died, his son Han Liang succeeded him. When Liang died, his son Han Jun succeeded him. When Jun died, his son Han Kai succeeded him. When Kai died, his son Han Hao succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0190",
          "zh": "沛公立為漢王，拜嬰為郎中，從入漢中，十月，拜為中謁者。",
          "translations": []
        },
        {
          "id": "s0191",
          "zh": "從還定三秦，下櫟陽，降塞王。",
          "translations": []
        },
        {
          "id": "s0192",
          "zh": "還圍章邯於廢丘，未拔。",
          "translations": []
        },
        {
          "id": "s0193",
          "zh": "從東出臨晉關，擊降殷王，定其地。",
          "translations": []
        },
        {
          "id": "s0194",
          "zh": "擊項羽將龍且、魏相項他軍定陶南，疾戰，破之。",
          "translations": []
        },
        {
          "id": "s0195",
          "zh": "賜嬰爵列侯，號昌文侯，食杜平鄉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Hao died, his son Han Hong succeeded him. When Hong died, his son Han Li succeeded him. When Li died, his son Han Tong succeeded him. When Tong died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0196",
          "zh": "復以中謁者從降下碭，以至彭城。",
          "translations": []
        },
        {
          "id": "s0197",
          "zh": "項羽擊，大破漢王。",
          "translations": []
        },
        {
          "id": "s0198",
          "zh": "漢王遁而西，嬰從還，軍於雍丘。",
          "translations": []
        },
        {
          "id": "s0199",
          "zh": "王武、魏公申徒反，從擊破之。",
          "translations": []
        },
        {
          "id": "s0200",
          "zh": "攻下黃，西收兵，軍於滎陽。",
          "translations": []
        },
        {
          "id": "s0201",
          "zh": "楚騎來眾，漢王乃擇軍中可為（車）騎將者，皆推故秦騎士重泉人李必、駱甲習騎兵，今為校尉，可為騎將。",
          "translations": []
        },
        {
          "id": "s0202",
          "zh": "漢王欲拜之，必、甲曰：「臣故秦民，恐軍不信臣，臣願得大王左右善騎者傅之。」",
          "translations": []
        },
        {
          "id": "s0203",
          "zh": "灌嬰雖少，然數力戰，乃拜灌嬰為中大夫，令李必、駱甲為左右校尉，將郎中騎兵擊楚騎於滎陽東，大破之。",
          "translations": []
        },
        {
          "id": "s0204",
          "zh": "受詔別擊楚軍後，絕其餉道，起陽武至襄邑。",
          "translations": []
        },
        {
          "id": "s0205",
          "zh": "擊項羽之將項冠於魯下，破之，所將卒斬右司馬、騎將各一人。",
          "translations": []
        },
        {
          "id": "s0206",
          "zh": "擊破柘公王武，軍於燕西，所將卒斬樓煩將五人，連尹一人。",
          "translations": []
        },
        {
          "id": "s0207",
          "zh": "擊王武別將桓嬰白馬下，破之，所將卒斬都尉一人。",
          "translations": []
        },
        {
          "id": "s0208",
          "zh": "以騎渡河南，送漢王到雒陽，使北迎相國韓信軍於邯鄲。",
          "translations": []
        },
        {
          "id": "s0209",
          "zh": "還至敖倉，嬰遷為御史大夫。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Guang succeeded him. When Guang died, his son Han Cheng succeeded him. When Cheng died, his son Han Ji succeeded him. When Ji died, his son Han Yu succeeded him. When Yu died, his son Han Tai succeeded him. When Tai died, his son Han Fu succeeded him. When Fu died, his son Han Fan succeeded him. When Fan died, his son Han Yan succeeded him. When Yan died, his son Han Yi succeeded him. When Yi died, his son Han Xin succeeded him. When Xin died, his son Han Jie succeeded him. When Jie died, his son Han Lian succeeded him. When Lian died, his son Han Guang succeeded him. When Guang died, his son Han Kai succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0210",
          "zh": "三年，以列侯食邑杜平鄉。",
          "translations": []
        },
        {
          "id": "s0211",
          "zh": "以御史大夫受詔將郎中騎兵東屬相國韓信，擊破齊軍於歷下，所將卒虜車騎將軍華毋傷及將吏四十六人。",
          "translations": []
        },
        {
          "id": "s0212",
          "zh": "降下臨菑，得齊守相田光。",
          "translations": []
        },
        {
          "id": "s0213",
          "zh": "追齊相田橫至嬴、博，破其騎，所將卒斬騎將一人，生得騎將四人。",
          "translations": []
        },
        {
          "id": "s0214",
          "zh": "攻下嬴、博，破齊將軍田吸於千乘，所將卒斬吸。",
          "translations": []
        },
        {
          "id": "s0215",
          "zh": "東從韓信攻龍且、留公旋於高密，卒斬龍且，生得右司馬、連尹各一人，樓煩將十人，身生得亞將周蘭。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Kai died, his son Han Sheng succeeded him. When Sheng died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Qiang succeeded him. When Qiang died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Hong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "齊地已定，韓信自立為齊王，使嬰別將擊楚將公杲於魯北，破之。",
          "translations": []
        },
        {
          "id": "s0217",
          "zh": "轉南，破薛郡長，身虜騎將一人。",
          "translations": []
        },
        {
          "id": "s0218",
          "zh": "攻（博）［傅］陽，前至下相以東南僮、取慮、徐。",
          "translations": []
        },
        {
          "id": "s0219",
          "zh": "度淮，盡降其城邑，至廣陵。",
          "translations": []
        },
        {
          "id": "s0220",
          "zh": "項羽使項聲、薛公、郯公復定淮北。",
          "translations": []
        },
        {
          "id": "s0221",
          "zh": "嬰度淮北，擊破項聲、郯公下邳，斬薛公，下下邳，擊破楚騎於平陽，遂降彭城，虜柱國項佗，降留、薛、沛、酂、蕭、相。",
          "translations": []
        },
        {
          "id": "s0222",
          "zh": "攻苦、譙，復得亞將周蘭。",
          "translations": []
        },
        {
          "id": "s0223",
          "zh": "與漢王會頤鄉。",
          "translations": []
        },
        {
          "id": "s0224",
          "zh": "從擊項籍軍於陳下，破之，所將卒斬樓煩將二人，虜騎將八人。",
          "translations": []
        },
        {
          "id": "s0225",
          "zh": "賜益食邑二千五百戶。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Hong died, his son Han Sheng succeeded him. When Sheng died, his son Han Wei succeeded him. When Wei died, his son Han Tao succeeded him. When Tao died, his son Han Jun succeeded him. When Jun died, his son Han Ji succeeded him. When Ji died, his son Han Quan succeeded him. When Quan died, his son Han Xun succeeded him. When Xun died, his son Han Bo succeeded him. When Bo died, his son Han Zhuang succeeded him. When Zhuang died, his son Han Jie succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0226",
          "zh": "項籍敗垓下去也，嬰以御史大夫受詔將車騎別追項籍至東城，破之。",
          "translations": []
        },
        {
          "id": "s0227",
          "zh": "所將卒五人共斬項籍，皆賜爵列侯。",
          "translations": []
        },
        {
          "id": "s0228",
          "zh": "降左右司馬各一人，卒萬二千人，盡得其軍將吏。",
          "translations": []
        },
        {
          "id": "s0229",
          "zh": "下東城、歷陽。",
          "translations": []
        },
        {
          "id": "s0230",
          "zh": "渡江，破吳郡長吳下，得吳守，遂定吳、豫章、會稽郡。",
          "translations": []
        },
        {
          "id": "s0231",
          "zh": "還定淮北，凡五十二縣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him. When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0232",
          "zh": "漢王立為皇帝，賜益嬰邑三千戶。",
          "translations": []
        },
        {
          "id": "s0233",
          "zh": "其秋，以車騎將軍從擊破燕王臧荼。",
          "translations": []
        },
        {
          "id": "s0234",
          "zh": "明年，從至陳，取楚王信。",
          "translations": []
        },
        {
          "id": "s0235",
          "zh": "還，剖符，世世勿絕，食潁陰二千五百戶，號曰潁陰侯。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Quan died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0236",
          "zh": "以車騎將軍從擊反韓王信於代，至馬邑，受詔別降樓煩以北六縣，斬代左相，破胡騎於武泉北。",
          "translations": []
        },
        {
          "id": "s0237",
          "zh": "復從擊韓信胡騎晉陽下，所將卒斬胡白題將一人。",
          "translations": []
        },
        {
          "id": "s0238",
          "zh": "受詔并將燕、趙、齊、梁、楚車騎，擊破胡騎於硰石。",
          "translations": []
        },
        {
          "id": "s0239",
          "zh": "至平城，為胡所圍，從還軍東垣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0240",
          "zh": "從擊陳豨，受詔別攻豨丞相侯敞軍曲逆下，破之，卒斬敞及特將五人。",
          "translations": []
        },
        {
          "id": "s0241",
          "zh": "降曲逆、盧奴、上曲陽、安國、安平。",
          "translations": []
        },
        {
          "id": "s0242",
          "zh": "攻下東垣。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Quan died, his son Han Xin succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "黥布反，以車騎將軍先出，攻布別將於相，破之，斬亞將樓煩將三人。",
          "translations": []
        },
        {
          "id": "s0244",
          "zh": "又進擊破布上柱國軍及大司馬軍。",
          "translations": []
        },
        {
          "id": "s0245",
          "zh": "又進破布別將肥誅。",
          "translations": []
        },
        {
          "id": "s0246",
          "zh": "嬰身生得左司馬一人，所將卒斬其小將十人，追北至淮上。",
          "translations": []
        },
        {
          "id": "s0247",
          "zh": "益食二千五百戶。",
          "translations": []
        },
        {
          "id": "s0248",
          "zh": "布已破，高帝歸，定令嬰食穎陰五千戶，除前所食邑。",
          "translations": []
        },
        {
          "id": "s0249",
          "zh": "凡從得二千石二人，別破軍十六，降城四十六，定國一，郡二，縣五十二，得將軍二人，柱國、相國各一人，二千石十人。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0250",
          "zh": "嬰自破布歸，高帝崩，嬰以列侯事孝惠帝及呂太后。",
          "translations": []
        },
        {
          "id": "s0251",
          "zh": "太后崩，呂祿等以趙王自置為將軍，軍長安，為亂。",
          "translations": []
        },
        {
          "id": "s0252",
          "zh": "齊哀王聞之，舉兵西，且入誅不當為王者。",
          "translations": []
        },
        {
          "id": "s0253",
          "zh": "上將軍呂祿等聞之，乃遣嬰為大將，將軍往擊之。",
          "translations": []
        },
        {
          "id": "s0254",
          "zh": "嬰行至滎陽，乃與絳侯等謀，因屯兵滎陽，風齊王以誅呂氏事，齊兵止不前。",
          "translations": []
        },
        {
          "id": "s0255",
          "zh": "絳侯等既誅諸呂，齊王罷兵歸，嬰亦罷兵自滎陽歸，與絳侯、陳平共立代王為孝文皇帝。",
          "translations": []
        },
        {
          "id": "s0256",
          "zh": "孝文皇帝於是益封嬰三千戶，賜黃金千斤，拜為太尉。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Xin died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him. When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0257",
          "zh": "三歲，絳侯勃免相就國，嬰為丞相，罷太尉官。",
          "translations": []
        },
        {
          "id": "s0258",
          "zh": "是歲，匈奴大入北地、上郡，令丞相嬰將騎八萬五千往擊匈奴。",
          "translations": []
        },
        {
          "id": "s0259",
          "zh": "匈奴去，濟北王反，詔乃罷嬰之兵。",
          "translations": []
        },
        {
          "id": "s0260",
          "zh": "後歲餘，嬰以丞相卒，謚曰懿侯。",
          "translations": []
        },
        {
          "id": "s0261",
          "zh": "子平侯阿代侯。",
          "translations": []
        },
        {
          "id": "s0262",
          "zh": "二十八年卒，子彊代侯。",
          "translations": []
        },
        {
          "id": "s0263",
          "zh": "十三年，彊有罪，絕二歲。",
          "translations": []
        },
        {
          "id": "s0264",
          "zh": "元光三年，天子封灌嬰孫賢為臨汝侯，續灌氏後，八歲，坐行賕有罪，國除。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Yong died, his son Han Guang succeeded him. When Guang died, his son Han Chen succeeded him. When Chen died, his son Han Yan succeeded him. When Yan died, his son Han Tao succeeded him. When Tao died, his son Han Quan succeeded him. When Xin died, his son Han Xin succeeded him. When Xin died, his son Han Rong succeeded him. When Rong died, his son Han Xiang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0265",
          "zh": "太史公曰：吾適豐沛，問其遺老，觀故蕭、曹、樊噲、滕公之家，及其素，異哉所聞！",
          "translations": []
        },
        {
          "id": "s0266",
          "zh": "方其鼓刀屠狗賣繒之時，豈自知附驥之尾，垂名漢廷，德流子孫哉？",
          "translations": []
        },
        {
          "id": "s0267",
          "zh": "余與他廣通，為言高祖功臣之興時若此云。",
          "translations": []
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "When Xiang died, his son Han Jie succeeded him. When Jie died, his son Han Yong succeeded him. When Yong died, his son Han Guang succeeded him.",
          "idiomatic": null,
          "translator": "Garrett M. Petersen (2025)",
          "model": "grok-1.5"
        }
      ]
    }
  ]
}