{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "099",
    "url": "https://chinesenotes.com/shiji/shiji099.html",
    "title": {
      "zh": "劉敬叔孫通列傳",
      "en": "Biographies of Liu Jing and Shusun Tong",
      "raw": "《劉敬叔孫通列傳》 Biographies of Liu Jing and Shusun Tong"
    },
    "sentenceCount": 188,
    "translatedCount": 188,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:26.538Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "劉敬者，齊人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Liu Jing was a man of Qi.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "漢五年，戍隴西，過洛陽，高帝在焉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth year of Han, he was garrisoned in Longxi and passed through Luoyang where the Gao Emperor was.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "婁敬脫輓輅，衣其羊裘，見齊人虞將軍曰：「臣願見上言便事。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lou Jing removed draught cart, clothed his sheep fur coat, saw Qi person Yu general said: 'Minister wishes see Sovereign speak convenient matters.'",
              "idiomatic": "Lou Jing removed himself from the draught cart, put on his sheepskin coat, and saw General Yu of Qi, saying: 'I wish to see the Sovereign and speak of convenient matters.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "虞將軍欲與之鮮衣，婁敬曰：「臣衣帛，衣帛見；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Yu general desired give him fresh clothes, Lou Jing said: 'Minister clothes silk, clothes silk see;",
              "idiomatic": "General Yu wanted to give him fine clothes, but Lou Jing said: 'I wear silk, I see in silk;'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "衣褐，衣褐見：終不敢易衣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "clothes coarse hemp, clothes coarse hemp see: ultimately not dare change clothes.'",
              "idiomatic": "I wear coarse hemp, I see in coarse hemp: I ultimately dare not change my clothes.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0006",
          "zh": "於是虞將軍入言上。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thereupon General Yu entered and spoke to the Sovereign.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "上召入見，賜食。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Sovereign summoned him to enter and see him, granting him food.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0008",
          "zh": "已而問婁敬，婁敬說曰：「陛下都洛陽，豈欲與周室比隆哉？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Already then asked Lou Jing, Lou Jing spoke said: 'Your Majesty capital Luoyang, perhaps desires with Zhou house compare flourishing?'",
              "idiomatic": "Then he asked Lou Jing, and Lou Jing spoke, saying: 'Your Majesty makes Luoyang the capital—does this desire to compare flourishing with the Zhou house?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0009",
          "zh": "上曰：「然。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sovereign said: 'Correct.'",
              "idiomatic": "The Sovereign said: 'Yes.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "婁敬曰：「陛下取天下與周室異。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lou Jing said: 'Your Majesty took all-under-heaven differs from Zhou house.",
              "idiomatic": "Lou Jing said: 'Your Majesty took the empire differently from the Zhou house.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "周之先自后稷，堯封之邰，積德累善十有餘世。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Zhou's ancestors from Hou Ji, Yao enfeoffed him Tai, accumulated virtue piled goodness ten plus generations.",
              "idiomatic": "The Zhou ancestors began with Hou Ji, whom Yao enfeoffed at Tai, accumulating virtue and goodness for more than ten generations.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "公劉避桀居豳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gong Liu avoided Jie and dwelt at Bin.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "太王以狄伐故，去豳，杖馬箠居岐，國人爭隨之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Because of Di invasions, Tai Wang left Bin, leaned on his horse whip and dwelt at Qi, and the people of the state contended to follow him.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "及文王為西伯，斷虞芮之訟，始受命，呂望、伯夷自海濱來歸之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Wen Wang became Western Bo, adjudicated Yu Rui's dispute, began received mandate, Lü Wang, Bo Yi from seacoast came submitted to him.",
              "idiomatic": "When Wen Wang became Western Bo, he adjudicated the dispute between Yu and Rui, began receiving the mandate, and Lü Wang and Bo Yi came from the seacoast to submit to him.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "武王伐紂，不期而會孟津之上八百諸侯，皆曰紂可伐矣，遂滅殷。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wu Wang attacked Zhou, and without appointment met eight hundred feudal lords above Mengjin, all saying Zhou could be attacked, then extinguished Yin.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "成王即位，周公之屬傅相焉，乃營成周洛邑，以此為天下之中也，諸侯四方納貢職，道裏均矣，有德則易以王，無德則易以亡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cheng Wang ascended throne, Zhou Gong's relations tutored chancellor there, then built Chengzhou Luoyi, with this made all-under-heaven's center, feudal lords four directions submitted tribute duties, road distances equal, had virtue then easy to king, no virtue then easy to perish.",
              "idiomatic": "Cheng Wang ascended the throne, and Zhou Gong's relations tutored and chancellored there, then built Chengzhou at Luoyi, making this the center of all under heaven. The feudal lords from four directions submitted tribute and duties, road distances were equal. With virtue one easily became king; without virtue one easily perished.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "凡居此者，欲令周務以德致人，不欲依阻險，令後世驕奢以虐民也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All who dwelt here desired to make Zhou attend to attracting people with virtue, not desiring to rely on strategic defiles, so as to prevent later generations from becoming arrogant and extravagant in oppressing the people.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "及周之盛時，天下和洽，四夷鄉風，慕義懷德，附離而并事天子，不屯一卒，不戰一士，八夷大國之民莫不賓服，效其貢職。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Zhou's flourishing time, all-under-heaven harmonious agreeable, four Yi turned to wind, admired righteousness cherished virtue, attached separated and together served Son of Heaven, not stationed one soldier, not battled one warrior, eight Yi great states' people none not submissive obedient, presented their tribute duties.",
              "idiomatic": "When Zhou was flourishing, all under heaven was harmonious and agreeable. The four Yi turned toward it like the wind, admired righteousness and cherished virtue, attached to those who had separated and together served the Son of Heaven. Without stationing a single soldier or battling a single warrior, the people of the eight Yi and great states were all submissive and obedient, presenting their tribute and duties.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "及周之衰也，分而為兩，天下莫朝，周不能制也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Zhou's decline, divided became two, all-under-heaven none court, Zhou could not control.",
              "idiomatic": "When Zhou declined, it divided into two, all under heaven ceased to court it, and Zhou could not control them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "非其德薄也，而形勢弱也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "It was not that their virtue was thin, but that their strategic position was weak.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "今陛下起豐沛，收卒三千人，以之徑往而卷蜀漢，定三秦，與項羽戰滎陽，爭成皋之口，大戰七十，小戰四十，使天下之民肝腦涂地，父子暴骨中野，不可勝數，哭泣之聲未絕，傷痍者未起，而欲比隆於成康之時，臣竊以為不侔也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Your Majesty arose Fengpei, gathered soldiers three thousand, with them directly went rolled up Shu Han, pacified San Qin, with Xiang Yu battled Xingyang, contended Chenggao mouth, great battles seventy, small battles forty, made all-under-heaven's people livers brains smeared ground, fathers sons exposed bones midst fields, cannot be counted, weeping crying sounds not ceased, wounded injured not yet risen, yet desires compare flourishing with Cheng Kang's time, minister secretly considers not equal.",
              "idiomatic": "Now Your Majesty arose from Feng and Pei, gathered three thousand soldiers, and with them directly went and rolled up Shu and Han, pacified the Three Qins, battled Xiang Yu at Xingyang, contended for the mouth of Chenggao. In seventy great battles and forty small battles, the people of all under heaven had their livers and brains smeared on the ground, fathers and sons exposed their bones in the midst of fields beyond counting. The sounds of weeping and crying have not ceased, the wounded and injured have not yet risen, yet you desire to compare flourishing with the time of Cheng and Kang. I secretly consider it unequal.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "且夫秦地被山帶河，四塞以為固，卒然有急，百萬之眾可具也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Moreover, Qin territory is covered by mountains and girded by rivers, with four strategic passes making it firm. If suddenly there is an emergency, a million multitudes can be prepared.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "因秦之故，資甚美膏腴之地，此所謂天府者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Following Qin's example, it has resources of very beautiful fertile lands—this is what is called the heavenly storehouse.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "陛下入關而都之，山東雖亂，秦之故地可全而有也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If Your Majesty enters the pass and makes it the capital, even if Shandong is chaotic, Qin's old lands can be completely preserved.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "夫與人鬬，不搤其亢，拊其背，未能全其勝也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now when fighting with a person, if you do not grasp his throat but pat his back, you cannot complete your victory.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "今陛下入關而都，案秦之故地，此亦搤天下之亢而拊其背也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Your Majesty entered pass made capital, pressed Qin old lands, this also grasped all-under-heaven's throat patted its back.'",
              "idiomatic": "Now if Your Majesty enters the pass and makes it the capital, pressing on Qin's old lands, this also grasps the throat of all under heaven while patting its back.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "高帝問群臣，群臣皆山東人，爭言周王數百年，秦二世即亡，不如都周。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Gao Emperor asked the assembled ministers, and the assembled ministers, all being Shandong people, contended that Zhou had ruled for several hundred years while Qin perished after two generations, so it was not equal to making Zhou the capital.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "上疑未能決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Sovereign doubted and could not decide.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "及留侯明言入關便，即日車駕西都關中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Liu Hou clearly spoke of the convenience of entering the pass, that very day the carriage drove west to make Guanzhong the capital.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "於是上曰：「本言都秦地者婁敬，『婁』者乃『劉』也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thereupon Sovereign said: 'Originally spoke capital Qin lands Lou Jing, \"Lou\" is \"Liu\".'",
              "idiomatic": "Thereupon the Sovereign said: 'The one who originally spoke of making Qin lands the capital was Lou Jing. \"Lou\" is \"Liu\".'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "賜姓劉氏，拜為郎中，號為奉春君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He was granted the surname Liu, appointed as Palace Attendant, and titled Lord Fengchun.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0033",
          "zh": "漢七年，韓王信反，高帝自往擊之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventh year of Han, King Xin of Han rebelled, and the Gao Emperor personally went to strike him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "至晉陽，聞信與匈奴欲共擊漢，上大怒，使人使匈奴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He arrived at Jinyang and heard that Xin, together with the Xiongnu, desired to strike Han. The Sovereign was greatly angered and sent a person to dispatch to the Xiongnu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "匈奴匿其壯士肥牛馬，但見老弱及羸畜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Xiongnu hid their strong warriors and fat oxen and horses, only showing old and weak people and emaciated livestock.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "使者十輩來，皆言匈奴可擊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Envoys came in ten groups, all saying the Xiongnu could be struck.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "上使劉敬復往使匈奴，還報曰：「兩國相擊，此宜夸矜見所長。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sovereign sent Liu Jing again go dispatch Xiongnu, returned reported said: 'Two states mutually strike, this should boast proudly show strengths.",
              "idiomatic": "The Sovereign sent Liu Jing to again go dispatch to the Xiongnu. He returned and reported: 'When two states mutually strike, this should boast proudly and show strengths.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "今臣往，徒見羸瘠老弱，此必欲見短，伏奇兵以爭利。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now when I went, I only saw emaciated, old, and weak people. This certainly means they desire to show weaknesses while hiding crack troops to contend for advantage.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "愚以為匈奴不可擊也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Foolish consider Xiongnu cannot strike.'",
              "idiomatic": "I foolishly consider that the Xiongnu cannot be struck.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "是時漢兵已踰句注，二十餘萬兵已業行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, Han troops had already crossed Guzhu, and twenty-plus ten thousand troops had already prepared to march.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "上怒，罵劉敬曰：「齊虜！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sovereign angered, cursed Liu Jing said: 'Qi captive!",
              "idiomatic": "The Sovereign was angered and cursed Liu Jing, saying: 'Qi captive!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "以口舌得官，今乃妄言沮吾軍。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "With mouth tongue got office, now then reckless words obstructed my army.'",
              "idiomatic": "You got your office with mouth and tongue, and now you recklessly speak to obstruct my army.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "械系敬廣武。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He shackled and bound Jing at Guangwu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "遂往，至平城，匈奴果出奇兵圍高帝白登，七日然後得解。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then went, arrived at Pingcheng, and the Xiongnu indeed sent crack troops that surrounded the Gao Emperor at Baiteng. Only after seven days did he get release.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "高帝至廣武，赦敬，曰：「吾不用公言，以困平城。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gao Emperor arrived Guangwu, pardoned Jing, said: 'I not used your words, therefore distressed Pingcheng.",
              "idiomatic": "The Gao Emperor arrived at Guangwu, pardoned Jing, and said: 'I did not use your words, which is why I was distressed at Pingcheng.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "吾皆已斬前使十輩言可擊者矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I all already beheaded previous envoys ten groups said could strike.'",
              "idiomatic": "I have already beheaded all the previous envoys in ten groups who said it could be struck.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "乃封敬二千戶，為關內侯，號為建信侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then enfeoffed Jing with two thousand households, served as Guannei Hou, and titled him Jianxin Hou.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0048",
          "zh": "高帝罷平城歸，韓王信亡入胡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Gao Emperor dismissed Pingcheng and returned, while Han King Xin fled and entered the Hu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "當是時，冒頓為單于，兵彊，控弦三十萬，數苦北邊。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "At this time, Modun served as Chanyu, his troops were strong, he controlled three hundred thousand archers, and frequently pained the northern borders.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "上患之，問劉敬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Sovereign worried about it and asked Liu Jing.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "劉敬曰：「天下初定，士卒罷於兵，未可以武服也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Liu Jing said: 'All-under-heaven newly pacified, officers soldiers fatigued by warfare, not yet can with martial subjugate.",
              "idiomatic": "Liu Jing said: 'The empire has newly been pacified, the officers and soldiers are fatigued by warfare, and it cannot yet be subjugated with martial means.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "冒頓殺父代立，妻群母，以力為威，未可以仁義說也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Modun killed his father and replaced him, took his father's wives as his own mothers, uses strength to create awe, and cannot yet be persuaded with benevolence and righteousness.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "獨可以計久遠子孫為臣耳，然恐陛下不能為。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Only can with plan long distant descendants serve as ministers, yet fear Your Majesty cannot do.'",
              "idiomatic": "Only with a plan for the long term can their descendants serve as ministers, but I fear Your Majesty cannot do it.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "上曰：「誠可，何為不能！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sovereign said: 'Truly can, why cannot!",
              "idiomatic": "The Sovereign said: 'If it truly can be done, why cannot I do it!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "顧為柰何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "But do how?'",
              "idiomatic": "But how should it be done?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "劉敬對曰：「陛下誠能以適長公主妻之，厚奉遺之，彼知漢適女送厚，蠻夷必慕以為閼氏，生子必為太子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Liu Jing replied said: 'Your Majesty truly able with legitimate eldest princess wife him, thick bestow send him, he knows Han legitimate daughter sent thick, barbarians foreigners certainly admire take as Yanzhi, born son certainly become crown prince.",
              "idiomatic": "Liu Jing replied: 'If Your Majesty can truly give him the legitimate eldest princess as wife, with thick bestowal and gifts, he will know that Han sends legitimate daughters with thickness, and the barbarians and foreigners will certainly admire and take her as Yanzhi. Any son born will certainly become crown prince.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "代單于。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He will replace the Chanyu.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "何者？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Why?",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "貪漢重幣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "They are greedy for Han's heavy gifts.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "陛下以歲時漢所餘彼所鮮數問遺，因使辯士風諭以禮節。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Your Majesty should frequently bestow upon them what Han has in surplus and they lack according to the seasons, and following this send eloquent scholars to gently exhort them with rites and propriety.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "冒頓在，固為子婿；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Modun present, firmly serves as son-in-law;",
              "idiomatic": "While Modun is present, he firmly serves as son-in-law;'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "死，則外孫為單于。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When he dies, then the grandson will become Chanyu.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "豈嘗聞外孫敢與大父抗禮者哉？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "How ever heard grandson dares with grandfather contend rites?",
              "idiomatic": "Have you ever heard of a grandson who dares to contend in rites with his grandfather?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "兵可無戰以漸臣也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The troops can without battle gradually make them ministers.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0065",
          "zh": "若陛下不能遣長公主，而令宗室及後宮詐稱公主，彼亦知，不肯貴近，無益也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If Your Majesty cannot send eldest princess, yet orders imperial clan and rear palace falsely call princess, they also know, not willing honor approach, no benefit.'",
              "idiomatic": "If Your Majesty cannot send the eldest princess, but orders the imperial clan and rear palace to falsely call someone princess, they will also know, and will not be willing to honor and approach her. It will be of no benefit.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "高帝曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Gao Emperor said: 'Good.'",
              "idiomatic": "The Gao Emperor said: 'Good.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0067",
          "zh": "欲遣長公主。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He desired to send the eldest princess.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "呂后日夜泣，曰：「妾唯太子、一女，柰何棄之匈奴！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lü Empress Dowager day night wept, said: 'Concubine only crown prince, one daughter, how abandon to Xiongnu!'",
              "idiomatic": "The Lü Empress Dowager wept day and night, saying: 'I have only the crown prince and one daughter—how can I abandon her to the Xiongnu!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "上竟不能遣長公主，而取家人子名為長公主，妻單于。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Sovereign finally could not send the eldest princess, but took a child from a commoner family and named her the eldest princess to be wife to the Chanyu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "使劉敬往結和親約。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He sent Liu Jing to go and tie the peaceful kinship covenant.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "劉敬從匈奴來，因言「匈奴河南白羊、樓煩王，去長安近者七百里，輕騎一日一夜可以至秦中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Liu Jing from Xiongnu came, following spoke 'Xiongnu Henan Baiyang, Loufan Wang, from Chang'an near seven hundred li, light cavalry one day one night can reach Qin central.",
              "idiomatic": "When Liu Jing came from the Xiongnu, he then said: 'The Xiongnu's Baiyang and Loufan kings south of the Yellow River are seven hundred li from Chang'an at closest. Light cavalry can reach Qin central in one day and one night.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0072",
          "zh": "秦中新破，少民，地肥饒，可益實。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qin central has newly been broken, has few people, the land is fertile and abundant, and can be increased and filled.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "夫諸侯初起時，非齊諸田，楚昭、屈、景莫能興。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now when the feudal lords initially arose, without the various Tian of Qi and the Zhao, Qu, Jing of Chu, none could rise.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0074",
          "zh": "今陛下雖都關中，實少人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now although Your Majesty has the capital in Guanzhong, in reality it has few people.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "北近胡寇，東有六國之族，宗彊，一日有變，陛下亦未得高枕而臥也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "North near Hu bandits, east has six states' clans, imperial clan strong, one day has change, Your Majesty also not yet gets high pillow lie.",
              "idiomatic": "To the north are near Hu bandits, to the east are the clans of the six states with strong imperial clans. If one day there is a change, Your Majesty also will not yet be able to lie with high pillow.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "臣願陛下徙齊諸田，楚昭、屈、景，燕、趙、韓、魏後，及豪桀名家居關中。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "I wish Your Majesty to move the various Tian of Qi, the Zhao, Qu, Jing of Chu, the descendants of Yan, Zhao, Han, Wei, and the heroic stalwart famous families to dwell in Guanzhong.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "無事，可以備胡；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "No affairs, can prepare Hu;",
              "idiomatic": "In peacetime, this can prepare against the Hu;'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "諸侯有變，亦足率以東伐。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "If the feudal lords rebel, it is also sufficient to lead them in attacking eastward.'",
              "idiomatic": null,
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0079",
          "zh": "此彊本弱末之術也」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This strengthen root weaken branches method.'",
              "idiomatic": "This is the method of strengthening the root and weakening the branches.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "上曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Sovereign said: 'Good.'",
              "idiomatic": "The Sovereign said: 'Good.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "乃使劉敬徙所言關中十餘萬口。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then sent Liu Jing to move what he had spoken of—ten-plus ten thousand people—to Guanzhong.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0082",
          "zh": "叔孫通者，薛人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong was a man of Xue.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "秦時以文學徵，待詔博士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "During Qin times he was summoned for his literature and awaited decrees as an erudite.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "數歲，陳勝起山東，使者以聞，二世召博士諸儒生問曰：「楚戍卒攻蘄入陳，於公如何？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Several years, Chen Sheng arose Shandong, envoy with reported, Second Generation summoned erudites various scholar students asked said: 'Chu garrison soldiers attacked Qi entered Chen, to gentlemen how?'",
              "idiomatic": "After several years, Chen Sheng arose in Shandong, and an envoy reported this. The Second Generation summoned the erudites and various scholar students and asked: 'Chu garrison soldiers have attacked Qi and entered Chen—what is this to you gentlemen?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0085",
          "zh": "博士諸生三十餘人前曰：「人臣無將，將即反，罪死無赦。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Erudites various students thirty-plus persons advanced said: 'Subject ministers no general, general then rebel, crime die no pardon.",
              "idiomatic": "The erudites and various students, thirty-plus persons, advanced and said: 'Subject ministers have no generals; if they have generals, then they rebel. The crime is death with no pardon.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "願陛下急發兵擊之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wish Your Majesty urgently send troops strike them.'",
              "idiomatic": "We wish Your Majesty to urgently send troops and strike them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0087",
          "zh": "二世怒，作色。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Second Generation was angered and changed color.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "叔孫通前曰：「諸生言皆非也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong advanced said: 'Various students words all not so.",
              "idiomatic": "Shusun Tong advanced and said: 'The various students' words are all wrong.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "夫天下合為一家，毀郡縣城，鑠其兵，示天下不復用。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now all under heaven is united as one family. The commandery and county walls have been destroyed, their weapons melted, showing all under heaven they will not be used again.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "且明主在其上，法令具於下，使人人奉職，四方輻輳，安敢有反者！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Moreover enlightened ruler at top, laws commands complete at bottom, makes everyone fulfill duty, four directions spokes converge, how dare have rebel persons!",
              "idiomatic": "Moreover, an enlightened ruler is at the top, laws and commands are complete at the bottom, making everyone fulfill their duties. The four directions converge like spokes to a hub—how dare there be any who rebel!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "此特群盜鼠竊狗盜耳，何足置之齒牙閒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "This is only a group of bandits—rat stealing, dog stealing—what is worth placing between the teeth.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0092",
          "zh": "郡守尉今捕論，何足憂。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Commandery governor and commandant's assistant now capture and judge them, what is there worth worrying.'",
              "idiomatic": "The commandery governor and commandant's assistant will now capture and judge them—what is there to worry about.'",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "二世喜曰：「善。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Second Generation pleased said: 'Good.'",
              "idiomatic": "The Second Generation was pleased and said: 'Good.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "盡問諸生，諸生或言反，或言盜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He asked all the various students, and the various students either said it was rebellion or said it was bandits.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "於是二世令御史案諸生言反者下吏，非所宜言。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Thereupon the Second Generation ordered the imperial secretary to investigate the various students who said it was rebellion and send them to the officials, as they had not spoken what was proper.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "諸言盜者皆罷之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All those who said it was bandits were dismissed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "乃賜叔孫通帛二十匹，衣一襲，拜為博士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then granted Shusun Tong twenty bolts of silk, one set of clothes, and appointed him as an erudite.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "叔孫通已出宮，反舍，諸生曰：「先生何言之諛也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong already exited palace, returned dwelling, various students said: 'Sir why speak flattery?'",
              "idiomatic": "Shusun Tong had already exited the palace and returned to his dwelling when the various students said: 'Sir, why did you speak flattery?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0099",
          "zh": "通曰：「公不知也，我幾不脫於虎口！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Tong said: 'Gentlemen not know, I almost not escape from tiger mouth!'",
              "idiomatic": "Tong said: 'You gentlemen do not know—I almost did not escape from the tiger's mouth!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "乃亡去，之薛，薛已降楚矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He then fled and went to Xue, but Xue had already submitted to Chu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0101",
          "zh": "及項梁之薛，叔孫通從之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Xiang Liang went to Xue, Shusun Tong followed him.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "敗於定陶，從懷王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He was defeated at Dingtao and followed the Huai King.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "懷王為義帝，徙長沙，叔孫通留事項王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Huai King became the Righteous Emperor and moved to Changsha, while Shusun Tong stayed and served Xiang Wang.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "漢二年，漢王從五諸侯入彭城，叔孫通降漢王。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the second year of Han, the Han King followed the five feudal lords into Pengcheng, and Shusun Tong submitted to the Han King.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0105",
          "zh": "漢王敗而西，因竟從漢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Han King was defeated and fled west, and thus ultimately joined the Han cause.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0106",
          "zh": "叔孫通儒服，漢王憎之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong Confucian garments, Han King disliked them;",
              "idiomatic": "Shusun Tong wore Confucian robes, which the Han King disliked;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "乃變其服，服短衣，楚製，漢王喜。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So he changed his clothing and wore a short jacket in Chu style, which pleased the Han King.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0108",
          "zh": "叔孫通之降漢，從儒生弟子百餘人，然通無所言進，專言諸故群盜壯士進之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong's submission to Han, followed Confucian scholar disciples over hundred people, but Tong nothing said advanced, specially spoke various former bandit group strong men advanced them.",
              "idiomatic": "When Shusun Tong submitted to Han, he was followed by over a hundred Confucian scholar disciples, but Tong made no recommendations for them. Instead, he specifically recommended the former bandit leaders and warriors for advancement.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0109",
          "zh": "弟子皆竊罵曰：「事先生數歲，幸得從降漢，今不能進臣等，專言大猾，何也？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Disciples all secretly cursed said: 'Served master several years, fortunately got follow submit Han, now cannot advance us ministers, specially speak big cunning ones, why?'",
              "idiomatic": "All the disciples secretly cursed and said, 'We served the master for several years and were fortunate enough to follow him in submitting to Han. Now he cannot advance us, but instead only speaks of promoting those big rogues—what is the reason?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "叔孫通聞之，乃謂曰：「漢王方蒙矢石爭天下，諸生寧能鬬乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong heard this, then said to them: 'Han King currently braves arrows stones contends for tianxia, various scholars how can fight?",
              "idiomatic": "Shusun Tong heard this and then said to them, 'The Han King is currently braving arrows and stones to contend for the empire—how can you Confucian scholars fight?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "故先言斬將搴旗之士。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore I first speak of promoting those warriors who behead generals and seize enemy banners.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "諸生且待我，我不忘矣。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Various scholars temporarily wait for me, I will not forget you.'",
              "idiomatic": "You scholars should wait for me—I will not forget you.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0113",
          "zh": "漢王拜叔孫通為博士，號稷嗣君。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Han King appointed Shusun Tong as a Doctor and gave him the title 'Successor to Ji.'",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0114",
          "zh": "漢五年，已并天下，諸侯共尊漢王為皇帝於定陶，叔孫通就其儀號。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the fifth year of Han, having already unified the empire, the feudal lords together honored the Han King as emperor at Dingtao, and Shusun Tong arranged the ceremonies and titles.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0115",
          "zh": "高帝悉去秦苛儀法，為簡易。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The High Emperor completely abolished the harsh Qin ceremonies and laws, making them simple and easy.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "群臣飲酒爭功，醉或妄呼，拔劍擊柱，高帝患之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The assembled ministers drank wine and argued about their merits. Some got drunk and shouted wildly, drew their swords and struck the pillars. The High Emperor was troubled by this.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "叔孫通知上益厭之也，說上曰：「夫儒者難與進取，可與守成。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong knew High Emperor increasingly disliked it, persuaded High Emperor said: 'Indeed Confucian scholars difficult with for advancement, can with for maintaining achievement.",
              "idiomatic": "Shusun Tong knew the High Emperor increasingly disliked this and persuaded him, saying, 'Confucian scholars are difficult to use for conquest, but they can be used for maintaining what has been achieved.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "臣願徵魯諸生，與臣弟子共起朝儀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Minister wishes summon Lu various scholars, with minister's disciples together establish court ceremony.'",
              "idiomatic": "I wish to summon the Confucian scholars of Lu and, together with my disciples, establish court ceremonies.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "高帝曰：「得無難乎？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor said: 'Will it not be difficult?'",
              "idiomatic": "The High Emperor said, 'Will it not be difficult?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0120",
          "zh": "叔孫通曰：「五帝異樂，三王不同禮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong said: 'Five Emperors different music, Three Kings different rites.",
              "idiomatic": "Shusun Tong said, 'The Five Emperors had different music, and the Three Kings had different rites.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "禮者，因時世人情為之節文者也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rites are ritual patterns created following the times, generations, and human feelings.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0122",
          "zh": "故夏、殷、周之禮所因損益可知者，謂不相復也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Therefore, what was followed, added, or subtracted in the rites of Xia, Yin, and Zhou can be known—they do not simply repeat each other.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "臣願頗采古禮與秦儀雜就之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Minister wishes somewhat collect ancient rites with Qin ceremonies mix complete them.'",
              "idiomatic": "I wish to somewhat collect ancient rites and mix them together with Qin ceremonies to complete them.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "上曰：「可試為之，令易知，度吾所能行為之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor said: 'Can try do it, make easy know, measure my ability to do it.'",
              "idiomatic": "The High Emperor said, 'We can try doing it—make it easy to understand and within my ability to perform.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0126",
          "zh": "於是叔孫通使徵魯諸生三十餘人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "So Shusun Tong sent to summon over thirty Confucian scholars from Lu.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "魯有兩生不肯行，曰：「公所事者且十主，皆面諛以得親貴。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu had two scholars unwilling go, said: 'You sir served ones nearly ten rulers, all flattered to face to obtain close nobility.",
              "idiomatic": "Lu had two scholars who were unwilling to go and said, 'You, sir, have served nearly ten rulers, and each time you flattered them to gain closeness and nobility.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "今天下初定，死者未葬，傷者未起，又欲起禮樂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now the empire has just been settled, the dead are not yet buried, the wounded have not yet recovered, and yet you wish to establish rites and music.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "禮樂所由起，積德百年而後可興也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Rites and music arise only after virtue has been accumulated for a hundred years before they can flourish.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "吾不忍為公所為。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "We cannot bear to do what you, sir, are doing.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "公所為不合古，吾不行。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "What you, sir, are doing does not accord with antiquity—we will not go.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0132",
          "zh": "公往矣，無汙我！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "You sir go, do not defile us!'",
              "idiomatic": "You, sir, may go—do not defile us!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "叔孫通笑曰：「若真鄙儒也，不知時變。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong laughed said: 'You are truly narrow Confucian scholars, do not know times change.'",
              "idiomatic": "Shusun Tong laughed and said, 'You are truly narrow-minded Confucian scholars who do not understand how times change.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "遂與所徵三十人西，及上左右為學者與其弟子百餘人為綿蕞野外。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then with summoned thirty people west, and High Emperor's left right learned ones with his disciples hundred more people made continuous tent open country outside.",
              "idiomatic": "So he went west with the thirty summoned scholars, along with the High Emperor's attendants who were scholars and his own disciples—over a hundred people total—and they practiced in a continuous tent in the open fields.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "習之月餘，叔孫通曰：「上可試觀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Practiced it month more, Shusun Tong said: 'High Emperor can try observe.'",
              "idiomatic": "After practicing for over a month, Shusun Tong said, 'Your Majesty can try observing.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "上既觀，使行禮，曰：「吾能為此。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor already observed, made perform rites, said: 'I can do this.'",
              "idiomatic": "After the High Emperor observed, he had them perform the rites and said, 'I can do this.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "乃令群臣習肄，會十月。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then he ordered all the ministers to practice and drill, and they assembled for ten months.",
              "idiomatic": null,
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0139",
          "zh": "漢七年，長樂宮成，諸侯群臣皆朝十月。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the seventh year of Han, when the Changle Palace was completed, all the feudal lords and ministers assembled for court in the tenth month.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0140",
          "zh": "儀：先平明，謁者治禮，引以次入殿門，廷中陳車騎步卒衛宮，設兵張旗志。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Ceremony: First dawn, ye zhe arranged rites, led in order enter hall gate, courtyard middle arranged chariots cavalry infantry guarded palace, set weapons displayed banners insignia.",
              "idiomatic": "The ceremony: Before dawn, the ye zhe arranged the rites and led them in proper order to enter the hall gate. In the courtyard were arrayed chariots, cavalry, and infantry guarding the palace, with weapons displayed and banners and insignia unfurled.",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "傳言「趨」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Transmitted words 'hurry'.",
              "idiomatic": "The command was transmitted: 'Hurry!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "殿下郎中俠陛，陛數百人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Below the hall, the lang zhong flanked the stairs, with several hundred people upon the stairs.",
              "idiomatic": null,
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0143",
          "zh": "功臣列侯諸將軍軍吏以次陳西方，東鄉；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Merit ministers lie hou various generals army officials in order arrayed western side, east facing;",
              "idiomatic": "The merit ministers, lie hou, various generals, and army officials were arrayed in order on the western side, facing east;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "文官丞相以下陳東方，西鄉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The civil officials, from the prime minister down, were arrayed on the eastern side, facing west.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "大行設九賓，臚傳。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The grand usher arranged the nine ranks of guests, and the lu proclaimed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "於是皇帝輦出房，百官執職傳警，引諸侯王以下至吏六百石以次奉賀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then the emperor's chariot emerged from the chamber. The hundred officials held their duties and transmitted alarms, leading the feudal lords and kings down to officials of six hundred dan to offer congratulations in order.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "自諸侯王以下莫不振恐肅敬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "From the feudal lords and kings down, none were not trembling with fear and solemn respect.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0148",
          "zh": "至禮畢，復置法酒。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the rites were finished, ritual wine was again placed.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "諸侍坐殿上皆伏抑首，以尊卑次起上壽。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "All those attending and seated in the hall above prostrated themselves and lowered their heads, rising in order of nobility to offer long life toasts.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "觴九行，謁者言「罷酒」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Cups nine circulated, ye zhe said 'dismiss wine'.",
              "idiomatic": "Nine rounds of cups circulated, and the ye zhe announced, 'Dismiss the wine.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "御史執法舉不如儀者輒引去。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The imperial secretaries enforced the law and immediately led away anyone who did not conform to the ceremony.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "竟朝置酒，無敢讙譁失禮者。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Throughout the morning while wine was placed, none dared make a clamor or lose propriety.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "於是高帝曰：「吾乃今日知為皇帝之貴也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then High Emperor said: 'I only today know being emperor's nobility.'",
              "idiomatic": "Then the High Emperor said, 'Only today do I understand the nobility of being emperor.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "乃拜叔孫通為太常，賜金五百斤。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Then he appointed Shusun Tong as Grand Master of Ceremonies and granted him five hundred jin of gold.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0155",
          "zh": "叔孫通因進曰：「諸弟子儒生隨臣久矣，與臣共為儀，願陛下官之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong then advanced said: 'Various disciples Confucian scholars followed minister long already, with minister together made ceremonies, wish Your Majesty official them.'",
              "idiomatic": "Shusun Tong then stepped forward and said, 'These disciples and Confucian scholars have followed me for a long time and helped me create the ceremonies. I wish Your Majesty would give them official positions.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "高帝悉以為郎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The High Emperor appointed them all as lang (court attendants).",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0157",
          "zh": "叔孫通出，皆以五百斤金賜諸生。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When Shusun Tong went out, he gave each of the scholars five hundred jin of gold.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "諸生乃皆喜曰：「叔孫生誠聖人也，知當世之要務。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Various scholars then all pleased said: 'Shusun Sheng truly sage person, knows current age's essential affairs.'",
              "idiomatic": "The scholars were all delighted and said, 'Master Shusun is truly a sage—he understands the essential affairs of our time.'",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0160",
          "zh": "漢九年，高帝徙叔孫通為太子太傅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "In the ninth year of Han, the High Emperor transferred Shusun Tong to serve as Grand Tutor to the Crown Prince.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "漢十二年，高祖欲以趙王如意易太子，叔孫通諫上曰：「昔者晉獻公以驪姬之故廢太子，立奚齊，晉國亂者數十年，為天下笑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Han twelfth year, Gaozu wished with Zhao King Ruyi change Crown Prince, Shusun Tong admonished High Emperor said: 'Formerly Jin Xian Gong because of Li Ji's sake deposed Crown Prince, established Xi Qi, Jin state in chaos several decades, became tianxia's laughingstock.",
              "idiomatic": "In the twelfth year of Han, Gaozu wished to replace the Crown Prince with King Ruyi of Zhao. Shusun Tong admonished the High Emperor, saying, 'Formerly, Duke Xian of Jin deposed the crown prince because of Li Ji and established Xi Qi, causing chaos in Jin that lasted several decades and made them the laughingstock of the empire.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "秦以不蚤定扶蘇，令趙高得以詐立胡亥，自使滅祀，此陛下所親見。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Qin failed to establish Fusu early, allowing Zhao Gao to fraudulently establish Hu Hai, which caused the Qin sacrifices to be extinguished—this is something Your Majesty witnessed personally.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "今太子仁孝，天下皆聞之；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now Crown Prince benevolent filial, tianxia all heard of it;",
              "idiomatic": "The current Crown Prince is benevolent and filial—everyone in the empire has heard of this;",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "呂后與陛下攻苦食啖，其可背哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Lu Empress with Your Majesty attacked hardship ate thin food, how can betray!",
              "idiomatic": "The Empress Lü endured hardship and ate meager food alongside Your Majesty—how can you betray her!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0165",
          "zh": "陛下必欲廢適而立少，臣願先伏誅，以頸血汙地。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Your Majesty must wish depose proper and establish young, minister wishes first receive execution, with neck blood stain ground.'",
              "idiomatic": "If Your Majesty insists on deposing the rightful heir and establishing a younger son, I wish to be executed first, staining the ground with my neck blood.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "高帝曰：「公罷矣，吾直戲耳。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor said: 'You stop, I only joking.'",
              "idiomatic": "The High Emperor said, 'Enough, you. I was only joking.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0167",
          "zh": "叔孫通曰：「太子天下本，本一搖天下振動，柰何以天下為戲！」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong said: 'Crown Prince tianxia root, root one shake tianxia shakes, how with tianxia as joke!'",
              "idiomatic": "Shusun Tong said, 'The Crown Prince is the root of the empire. If the root shakes even once, the whole empire shakes. How can you treat the empire as a joke!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "高帝曰：「吾聽公言。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor said: 'I listen to your words.'",
              "idiomatic": "The High Emperor said, 'I will listen to your words.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "及上置酒，見留侯所招客從太子入見，上乃遂無易太子志矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When High Emperor placed wine, saw Liu Hou's recruited guests follow Crown Prince enter audience, High Emperor then finally had no change Crown Prince intention.",
              "idiomatic": "When the High Emperor held a banquet, he saw the guests recruited by Liu Hou following the Crown Prince in for an audience, and the High Emperor finally abandoned any intention to change the Crown Prince.",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0170",
          "zh": "高帝崩，孝惠即位，乃謂叔孫生曰：「先帝園陵寢廟，群臣莫（能）習。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High Emperor collapsed, Filial Hui ascended throne, then said to Shusun Sheng: 'Late Emperor park tomb sleeping temple, assembled ministers none able practice.'",
              "idiomatic": "After the High Emperor passed away and Emperor Hui ascended the throne, he said to Master Shusun, 'The assembled ministers are not familiar with the rituals for the late emperor's park tomb and ancestral temple.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "徙為太常，定宗廟儀法。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "He was transferred to serve as Grand Master of Ceremonies and established the ceremonial regulations for the ancestral temples.",
              "idiomatic": null,
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0172",
          "zh": "及稍定漢諸儀法，皆叔孫生為太常所論箸也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "When the various ceremonial regulations of Han were gradually established, they were all discussed and recorded by Master Shusun while serving as Grand Master of Ceremonies.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0173",
          "zh": "孝惠帝為東朝長樂宮，及閒往，數蹕煩人，乃作複道，方筑武庫南。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Emperor Hui went to court at the eastern Changle Palace, and when he went there, repeatedly clearing the way troubled the people. So he built a covered walkway, which was just south of the armory.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "叔孫生奏事，因請閒曰：「陛下何自筑複道高寢，衣冠月出游高廟？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Sheng memorialized affairs, then requested private audience said: 'Your Majesty why personally build covered walkway high chamber, in robes monthly go out tour high temple?",
              "idiomatic": "Master Shusun memorialized on affairs, then requested a private audience and said, 'Why does Your Majesty personally build a covered walkway to the high chamber and, wearing court robes, go out monthly to tour the High Temple?'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "高廟，漢太祖，柰何令後世子孫乘宗廟道上行哉？」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "High temple, Han Great Ancestor, how make future generations descendants ride ancestral temple road above walk!'",
              "idiomatic": "The High Temple houses Han's Great Ancestor—how can we allow future generations' descendants to walk above the ancestral temple road!'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "孝惠帝大懼，曰：「急壞之。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Filial Hui Emperor greatly feared, said: 'Urgently destroy it.'",
              "idiomatic": "Emperor Hui was greatly terrified and said, 'Destroy it immediately.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "叔孫生曰：「人主無過舉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Sheng said: 'Ruler has no mistaken actions.",
              "idiomatic": "Master Shusun said, 'A ruler makes no mistaken actions.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "今已作，百姓皆知之，今壞此，則示有過舉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Now it has already been built and all the common people know about it. If we destroy it now, it will show that there was a mistaken action.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0179",
          "zh": "願陛下原廟渭北，衣冠月出游之，益廣多宗廟，大孝之本也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Wish Your Majesty establish temple Wei north, in robes monthly go out tour it, moreover expand many ancestral temples, great filial piety's root.'",
              "idiomatic": "I wish Your Majesty would establish a temple north of the Wei River and, wearing court robes, go out monthly to tour it. Moreover, expand and increase the ancestral temples—this is the root of great filial piety.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "上乃詔有司立原廟。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The High Emperor then decreed that the relevant officials should establish the Yuan Temple.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "原廟起，以複道故。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The Yuan Temple was established because of the covered walkway.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0182",
          "zh": "孝惠帝曾春出游離宮，叔孫生曰：「古者有春嘗果，方今櫻桃孰，可獻，願陛下出，因取櫻桃獻宗廟。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Filial Hui Emperor once spring went out toured detached palace, Shusun Sheng said: 'Ancient ones had spring tasting fruits, right now cherry ripe, can offer, wish Your Majesty go out, thereby take cherry offer ancestral temple.'",
              "idiomatic": "Once in spring, Emperor Hui went out to tour a detached palace. Master Shusun said, 'In ancient times there was the spring tasting of fruits. Right now the cherries are ripe and can be offered. I wish Your Majesty would go out and thereby take cherries to offer at the ancestral temple.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0183",
          "zh": "上乃許之。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The High Emperor then permitted it.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "諸果獻由此興。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "The offering of various fruits arose from this.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0185",
          "zh": "太史公曰：語曰「千金之裘，非一狐之腋也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Grand Historian said: Proverb says 'Thousand gold fur coat, not one fox armpit;",
              "idiomatic": "The Grand Historian said: As the proverb goes, 'A fur coat worth a thousand pieces of gold is not made from the armpit of a single fox;'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0186",
          "zh": "臺榭之榱，非一木之枝也；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Pavilion terrace rafters, not one tree branch;",
              "idiomatic": "The rafters of a pavilion or terrace are not made from the branch of a single tree;",
              "model": "grok-1.5",
              "reviewed": true
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "三代之際，非一士之智也。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Three dynasties governance, not one scholar's wisdom.'",
              "idiomatic": "The governance of the Three Dynasties was not the wisdom of a single scholar.'",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "信哉！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Truly!",
              "idiomatic": "How true!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0189",
          "zh": "夫高祖起微細，定海內，謀計用兵，可謂盡之矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Indeed, Gaozu rose from humble origins, pacified the empire, and exhausted all stratagems and military uses.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "然而劉敬脫輓輅一說，建萬世之安，智豈可專邪！",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "However Liu Jing removed bridle chariot one speech, established ten thousand generations peace, wisdom how can be monopolized!",
              "idiomatic": "However, Liu Jing's one speech about removing the chariot bridle established peace for ten thousand generations—how can wisdom be monopolized!",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "叔孫通希世度務，制禮進退，與時變化，卒為漢家儒宗。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "Shusun Tong rarely gauged worldly affairs, formulated rites for advancement and retreat, changed with the times, and finally became the Confucian patriarch of the Han house.",
              "idiomatic": null,
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "「大直若詘，道固委蛇」，蓋謂是乎？",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen (2025)",
              "literal": "'Great straight like bent, Way indeed winding', probably speaking of this?",
              "idiomatic": "'The great straight appears bent; the Way is indeed winding'—is this not what it speaks of?",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "",
          "literal": "",
          "idiomatic": null
        }
      ]
    }
  ]
}