{
  "meta": {
    "book": "shiji",
    "bookInfo": {
      "name": "Records of the Grand Historian",
      "chinese": "史記",
      "pinyin": "Shǐjì",
      "dynasty": "Xia to Han"
    },
    "chapter": "115",
    "url": "https://chinesenotes.com/shiji/shiji115.html",
    "title": {
      "zh": "朝鮮列傳",
      "en": "Treatise on Korea",
      "raw": "《朝鮮列傳》 Treatise on Korea"
    },
    "sentenceCount": 64,
    "translatedCount": 64,
    "glossarySize": 14406,
    "scrapedAt": "2025-12-15T05:59:45.306Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "朝鮮王滿者，故燕人也。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "King Wei Man of Joseon was originally a man of Yan.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "自始全燕時嘗略屬真番、朝鮮，為置吏，筑鄣塞。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "From the beginning when Yan was intact, they often raided and controlled Zhendan and Joseon, establishing officials and building barrier forts.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "秦滅燕，屬遼東外徼。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Qin destroyed Yan, and it became part of the outer defenses of Liaodong.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0004",
          "zh": "漢興，為其遠難守，復修遼東故塞，至浿水為界，屬燕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "When Han arose, because it was distant and difficult to defend, they repaired the old Liaodong border fortifications, using the Hun River as the boundary, and assigned it to Yan.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "燕王盧綰反，入匈奴，滿亡命，聚黨千餘人，魋結蠻夷服而東走出塞，渡浿水，居秦故空地上下鄣，稍役屬真番、朝鮮蠻夷及故燕、齊亡命者王之，都王險。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "When Yan king Lu Wan rebelled and fled to the Xiongnu, Wei Man fled, gathered over a thousand followers, braided their hair and wore barbarian clothing, and went east out of the passes, crossed the Hun River, and settled in the old Qin empty lands between the upper and lower barriers, gradually subjugating Zhendan, Joseon barbarians, and former Yan and Qi fugitives, ruling them from Wanggeom Fortress.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "King Wei Man of Joseon was originally a man of Yan. From the beginning when Yan was intact, they often raided and controlled Zhendan and Joseon, establishing officials and building barrier forts. Qin destroyed Yan, and it became part of the outer defenses of Liaodong. When Han arose, because it was distant and difficult to defend, they repaired the old Liaodong border fortifications, using the Hun River as the boundary, and assigned it to Yan. When Yan king Lu Wan rebelled and fled to the Xiongnu, Wei Man fled, gathered over a thousand followers, braided their hair and wore barbarian clothing, and went east out of the passes, crossed the Hun River, and settled in the old Qin empty lands between the upper and lower barriers, gradually subjugating Zhendan, Joseon barbarians, and former Yan and Qi fugitives, ruling them from Wanggeom Fortress.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0006",
          "zh": "會孝惠、高后時天下初定，遼東太守即約滿為外臣，保塞外蠻夷，無使盜邊；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "During the time of Emperor Hui and Empress Gao, when the world was first pacified, the Liaodong governor made an agreement with Wei Man to serve as an outer subject, protecting the barbarians outside the border and preventing them from raiding the frontier;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "諸蠻夷君長欲入見天子，勿得禁止。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Any barbarian chiefs who wished to enter and see the Son of Heaven should not be prohibited.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "以聞，上許之，以故滿得兵威財物侵降其旁小邑，真番、臨屯皆來服屬，方數千里。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "This was reported to the emperor, who approved it, so Wei Man used military might and wealth to invade and subjugate neighboring small settlements, and Zhendan and Lintun all came to submit and belong to him, covering several thousand square li.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "During the time of Emperor Hui and Empress Gao, when the world was first pacified, the Liaodong governor made an agreement with Wei Man to serve as an outer subject, protecting the barbarians outside the border and preventing them from raiding the frontier; Any barbarian chiefs who wished to enter and see the Son of Heaven should not be prohibited. This was reported to the emperor, who approved it, so Wei Man used military might and wealth to invade and subjugate neighboring small settlements, and Zhendan and Lintun all came to submit and belong to him, covering several thousand square li.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "傳子至孫右渠，所誘漢亡人滋多，又未嘗入見；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "He passed it to his son and grandson Right Channel, who lured ever more Han fugitives, and never once entered to pay respects;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "真番旁眾國欲上書見天子，又擁閼不通。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The neighboring countries like Zhendan wished to submit memorials to see the Son of Heaven, but he blocked and obstructed them from communicating.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "元封二年，漢使涉何譙諭右渠，終不肯奉詔。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "In the second year of Yuanshou, Han sent She He to reproach Right Channel, but he ultimately refused to obey the imperial edict.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "何去至界上，臨浿水，使御刺殺送何者朝鮮裨王長，即渡，馳入塞，遂歸報天子曰「殺朝鮮將」。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "He left and reached the border at the Hun River, had his chariot driver stab and kill the Joseon vice-king Chang who was escorting him, then immediately crossed and galloped into the passes, returning to report to the Son of Heaven saying 'killed the Joseon general'.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "上為其名美，即不詰，拜何為遼東東部都尉。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The emperor, for the beauty of his name, did not investigate, and appointed He as the Dongbu prefect of Liaodong.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "朝鮮怨何，發兵襲攻殺何。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Joseon resented He, sent troops to attack and kill him.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "He passed it to his son and grandson Right Channel, who lured ever more Han fugitives, and never once entered to pay respects; The neighboring countries like Zhendan wished to submit memorials to see the Son of Heaven, but he blocked and obstructed them from communicating. In the second year of Yuanshou, Han sent She He to reproach Right Channel, but he ultimately refused to obey the imperial edict. He left and reached the border at the Hun River, had his chariot driver stab and kill the Joseon vice-king Chang who was escorting him, then immediately crossed and galloped into the passes, returning to report to the Son of Heaven saying 'killed the Joseon general'. The emperor, for the beauty of his name, did not investigate, and appointed He as the Dongbu prefect of Liaodong. Joseon resented He, sent troops to attack and kill him.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0015",
          "zh": "天子募罪人擊朝鮮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Son of Heaven recruited criminals to attack Joseon.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "其秋，遣樓船將軍楊仆從齊浮渤海；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "That autumn, he sent the Tower Ship General Yang Pu from Qi by sea across the Bohai;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "兵五萬人，左將軍荀彘出遼東：討右渠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "With 50,000 troops, and the Left General Xun Zhi from Liaodong to attack Right Channel.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "右渠發兵距險。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Right Channel sent troops to defend the dangerous passes.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "左將軍卒正多率遼東兵先縱，敗散，多還走，坐法斬。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General's army officers, led by Du Zheng, first charged with the Liaodong troops, were defeated and scattered, many retreated and fled, so Du Zheng was executed by law.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "樓船將軍將齊兵七千人先至王險。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Tower Ship General led 7,000 Qi troops and arrived first at Wanggeom Fortress.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0021",
          "zh": "右渠城守，窺知樓船軍少，即出城擊樓船，樓船軍敗散走。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Right Channel defended the city, saw that the tower ship army was small, immediately came out of the city to attack the tower ships, the tower ship army was defeated and scattered in flight.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "將軍楊仆失其眾，遁山中十餘日，稍求收散卒，復聚。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "General Yang Pu lost his troops, fled into the mountains for over ten days, gradually gathered the scattered soldiers, and reformed them.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "左將軍擊朝鮮浿水西軍，未能破自前。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General attacked the Joseon army west of the Hun River, could not break through from the front.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Son of Heaven recruited criminals to attack Joseon. That autumn, he sent the Tower Ship General Yang Pu from Qi by sea across the Bohai; With 50,000 troops, and the Left General Xun Zhi from Liaodong to attack Right Channel. Right Channel sent troops to defend the dangerous passes. The Left General's army officers, led by Du Zheng, first charged with the Liaodong troops, were defeated and scattered, many retreated and fled, so Du Zheng was executed by law. The Tower Ship General led 7,000 Qi troops and arrived first at Wanggeom Fortress. Right Channel defended the city, saw that the tower ship army was small, immediately came out of the city to attack the tower ships, the tower ship army was defeated and scattered in flight. General Yang Pu lost his troops, fled into the mountains for over ten days, gradually gathered the scattered soldiers, and reformed them. The Left General attacked the Joseon army west of the Hun River, could not break through from the front.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0024",
          "zh": "天子為兩將未有利，乃使衛山因兵威往諭右渠。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Son of Heaven, because neither general had achieved victory, sent Wei Shan to use the army's might to persuade Right Channel.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "右渠見使者頓首謝：「願降，恐兩將詐殺臣；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Right Channel saw the envoy and bowed his head in apology: 'I wish to surrender, but fear the two generals will deceitfully kill me;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "今見信節，請服降。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Now seeing the trustworthy tally, I request to submit and surrender.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "遣太子入謝，獻馬五千匹，及饋軍糧。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "He sent his crown prince to apologize, offering five thousand horses, and supplying army provisions.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0028",
          "zh": "人眾萬餘，持兵，方渡浿水，使者及左將軍疑其為變，謂太子已服降，宜命人毋持兵。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "With a crowd of over ten thousand people bearing arms, when they were about to cross the Hun River, the envoy and Left General suspected they would rebel, told the crown prince that since he had already submitted, the people should not bear arms.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "太子亦疑使者左將軍詐殺之，遂不渡浿水，復引歸。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The crown prince also suspected the envoy and Left General would deceitfully kill him, so did not cross the Hun River, and led them back again.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0030",
          "zh": "山還報天子，天子誅山。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Shan returned and reported to the Son of Heaven, who executed Shan.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Son of Heaven, because neither general had achieved victory, sent Wei Shan to use the army's might to persuade Right Channel. Right Channel saw the envoy and bowed his head in apology: 'I wish to surrender, but fear the two generals will deceitfully kill me; Now seeing the trustworthy tally, I request to submit and surrender.' He sent his crown prince to apologize, offering five thousand horses, and supplying army provisions. With a crowd of over ten thousand people bearing arms, when they were about to cross the Hun River, the envoy and Left General suspected they would rebel, told the crown prince that since he had already submitted, the people should not bear arms. The crown prince also suspected the envoy and Left General would deceitfully kill him, so did not cross the Hun River, and led them back again. Shan returned and reported to the Son of Heaven, who executed Shan.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0031",
          "zh": "左將軍破浿水上軍，乃前，至城下，圍其西北。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General broke the army above the Hun River, then advanced to the city walls, surrounding the northwest.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "樓船亦往會，居城南。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The tower ships also went to join, stationed south of the city.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "右渠遂堅守城，數月未能下。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Right Channel thus firmly defended the city, after several months could not be taken.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Left General broke the army above the Hun River, then advanced to the city walls, surrounding the northwest. The tower ships also went to join, stationed south of the city. Right Channel thus firmly defended the city, after several months could not be taken.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0034",
          "zh": "左將軍素侍中，幸，將燕代卒，悍，乘勝，軍多驕。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General had formerly been a palace attendant, was favored, commanded Yan and Dai troops, who were fierce, rode on victory, the army was mostly arrogant.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "樓船將齊卒，入海，固已多敗亡；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The tower ship general commanded Qi troops who entered by sea, had already suffered many defeats and losses;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0036",
          "zh": "其先與右渠戰，因辱亡卒，卒皆恐，將心慚，其圍右渠，常持和節。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Previously when they fought Right Channel, they suffered and lost troops, the troops were all fearful, the general's heart was ashamed, when surrounding Right Channel, they often held peace tallies.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "左將軍急擊之，朝鮮大臣乃陰閒使人私約降樓船，往來言，尚未肯決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General urgently attacked, the Joseon ministers secretly sent people to privately agree to surrender to the tower ships, coming and going with messages, but not yet willing to decide.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "左將軍數與樓船期戰，樓船欲急就其約，不會；",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General repeatedly made battle appointments with the tower ships, the tower ships wished to quickly fulfill their agreement, did not meet;",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "左將軍亦使人求閒卻降下朝鮮，朝鮮不肯，心附樓船：以故兩將不相能。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General also sent people to seek to secretly persuade Joseon to surrender, Joseon refused, their hearts attached to the tower ships: therefore the two generals could not cooperate.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0040",
          "zh": "左將軍心意樓船前有失軍罪，今與朝鮮私善而又不降，疑其有反計，未敢發。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General suspected the tower ships previously had the crime of losing troops, now secretly befriended Joseon and still would not surrender, suspected they had rebellious plans, did not dare to act.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0041",
          "zh": "天子曰將率不能，前（及）［乃］使衛山諭降右渠，右渠遣太子，山使不能剸決，與左將軍計相誤，卒沮約。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Son of Heaven said the generals could not advance, previously sent Wei Shan to persuade Right Channel to surrender, Right Channel sent his crown prince, Shan could not decisively handle it, clashed with the Left General's plans, ultimately ruined the agreement.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "今兩將圍城，又乖異，以故久不決。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Now the two generals surround the city, but are at odds, therefore long undecided.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "使濟南太守公孫遂往（征）［正］之，有便宜得以從事。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Sent the Jinan governor Gongsun Sui to correct it, with discretion to handle affairs.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0044",
          "zh": "遂至，左將軍曰：「朝鮮當下久矣，不下者有狀。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Sui arrived, the Left General said: 'Joseon should have surrendered long ago, not surrendering has a reason.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0045",
          "zh": "言樓船數期不會，具以素所意告遂，曰：「今如此不取，恐為大害，非獨樓船，又且與朝鮮共滅吾軍。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "He told Sui about the tower ships repeatedly not meeting appointments, fully informed him of his longstanding suspicions, saying: 'Now like this not taking it, I fear it will become a great harm, not only the tower ships, but also together with Joseon will destroy our army.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "遂亦以為然，而以節召樓船將軍入左將軍營計事，即命左將軍麾下執捕樓船將軍，并其軍，以報天子。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Sui also thought it so, and used the tally to summon the tower ship general into the Left General's camp to discuss matters, immediately ordered the Left General's subordinates to arrest the tower ship general and his army, reporting to the Son of Heaven.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "天子誅遂。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Son of Heaven executed Sui.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Left General had formerly been a palace attendant, was favored, commanded Yan and Dai troops, who were fierce, rode on victory, the army was mostly arrogant. The tower ship general commanded Qi troops who entered by sea, had already suffered many defeats and losses; Previously when they fought Right Channel, they suffered and lost troops, the troops were all fearful, the general's heart was ashamed, when surrounding Right Channel, they often held peace tallies. The Left General urgently attacked, the Joseon ministers secretly sent people to privately agree to surrender to the tower ships, coming and going with messages, but not yet willing to decide. The Left General repeatedly made battle appointments with the tower ships, the tower ships wished to quickly fulfill their agreement, did not meet; The Left General also sent people to seek to secretly persuade Joseon to surrender, Joseon refused, their hearts attached to the tower ships: therefore the two generals could not cooperate. The Left General suspected the tower ships previously had the crime of losing troops, now secretly befriended Joseon and still would not surrender, suspected they had rebellious plans, did not dare to act. The Son of Heaven said the generals could not advance, previously sent Wei Shan to persuade Right Channel to surrender, Right Channel sent his crown prince, Shan could not decisively handle it, clashed with the Left General's plans, ultimately ruined the agreement. Now the two generals surround the city, but are at odds, therefore long undecided. Sent the Jinan governor Gongsun Sui to correct it, with discretion to handle affairs. Sui arrived, the Left General said: 'Joseon should have surrendered long ago, not surrendering has a reason.' He told Sui about the tower ships repeatedly not meeting appointments, fully informed him of his longstanding suspicions, saying: 'Now like this not taking it, I fear it will become a great harm, not only the tower ships, but also together with Joseon will destroy our army.' Sui also thought it so, and used the tally to summon the tower ship general into the Left General's camp to discuss matters, immediately ordered the Left General's subordinates to arrest the tower ship general and his army, reporting to the Son of Heaven. The Son of Heaven executed Sui.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0048",
          "zh": "左將軍已并兩軍，即急擊朝鮮。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General already combined the two armies, immediately urgently attacked Joseon.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0049",
          "zh": "朝鮮相路人、相韓陰、尼谿相參、將軍王唊相與謀曰：「始欲降樓船，樓船今執，獨左將軍并將，戰益急，恐不能與，（戰）王又不肯降。」",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Joseon chancellor Luo Ren, chancellor Han Yin, Ni Xi chancellor Shen, general Wang Xi together plotted: 'Initially wished to surrender to the tower ships, the tower ships now arrested, only the Left General commands alone, battle increasingly urgent, fear cannot resist, the king also refuses to surrender.'",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "陰、唊、路人皆亡降漢。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Yin, Xi, Luo Ren all fled and surrendered to Han.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "路人道死。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Luo Ren died en route.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0052",
          "zh": "元封三年夏，尼谿相參乃使人殺朝鮮王右渠來降。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "In the third year of Yuanshou, summer, Ni Xi chancellor Shen sent people to kill Joseon king Right Channel and come surrender.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0053",
          "zh": "王險城未下，故右渠之大臣成巳又反，復攻吏。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Wanggeom Fortress was not yet taken, therefore Right Channel's minister Cheng Ji again rebelled, attacked the officials again.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "左將軍使右渠子長降、相路人之子最告諭其民，誅成巳，以故遂定朝鮮，為四郡。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General made Right Channel's son Chang surrender, and Luo Ren's son Zui announce and persuade their people, executed Cheng Ji, therefore finally pacified Joseon, making it four commanderies.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0055",
          "zh": "封參為澅清侯，陰為荻苴侯，唊為平州侯，長［降］為幾侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Enfeoffed Shen as Marquis of Luqing, Yin as Marquis of Dichu, Xi as Marquis of Pingzhou, Chang as Marquis of Ji.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "最以父死頗有功，為溫陽侯。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Zui, because his father died and had considerable merit, became Marquis of Wenyang.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Left General already combined the two armies, immediately urgently attacked Joseon. The Joseon chancellor Luo Ren, chancellor Han Yin, Ni Xi chancellor Shen, general Wang Xi together plotted: 'Initially wished to surrender to the tower ships, the tower ships now arrested, only the Left General commands alone, battle increasingly urgent, fear cannot resist, the king also refuses to surrender.' Yin, Xi, Luo Ren all fled and surrendered to Han. Luo Ren died en route. In the third year of Yuanshou, summer, Ni Xi chancellor Shen sent people to kill Joseon king Right Channel and come surrender. Wanggeom Fortress was not yet taken, therefore Right Channel's minister Cheng Ji again rebelled, attacked the officials again. The Left General made Right Channel's son Chang surrender, and Luo Ren's son Zui announce and persuade their people, executed Cheng Ji, therefore finally pacified Joseon, making it four commanderies. Enfeoffed Shen as Marquis of Luqing, Yin as Marquis of Dichu, Xi as Marquis of Pingzhou, Chang as Marquis of Ji. Zui, because his father died and had considerable merit, became Marquis of Wenyang.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0057",
          "zh": "左將軍徵至，坐爭功相嫉，乖計，棄市。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Left General was summoned, sat for disputing merit and being jealous, conflicting plans, and was executed in the marketplace.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "樓船將軍亦坐兵至洌口，當待左將軍，擅先縱，失亡多，當誅，贖為庶人。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The tower ship general also sat for troops reaching the mouth of the Lie, should wait for the Left General, but presumptuously charged first, lost many, should be executed, redeemed as a commoner.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Left General was summoned, sat for disputing merit and being jealous, conflicting plans, and was executed in the marketplace. The tower ship general also sat for troops reaching the mouth of the Lie, should wait for the Left General, but presumptuously charged first, lost many, should be executed, redeemed as a commoner.",
          "idiomatic": null
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0059",
          "zh": "太史公曰：右渠負固，國以絕祀。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The Grand Historian said: Right Channel relied on fortifications, the state ended sacrifices.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0060",
          "zh": "涉何誣功，為兵發首。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "She He fabricated merit, became the first to send troops.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "樓船將狹，及難離咎。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "The tower ship general was narrow-minded, met difficulty and shared blame.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "悔失番禺，乃反見疑。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Regretted losing Panyu, then returned and was suspected.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "荀彘爭勞，與遂皆誅。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Xun Zhi disputed merit, with Sui were both executed.",
              "idiomatic": null
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "兩軍俱辱，將率莫侯矣。",
          "translations": [
            {
              "lang": "en",
              "translator": "Garrett M. Petersen",
              "model": "grok-1.5",
              "literal": "Both armies were humiliated, the generals were not enfeoffed.",
              "idiomatic": null
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "translator": "Garrett M. Petersen",
          "model": "grok-1.5",
          "literal": "The Grand Historian said: Right Channel relied on fortifications, the state ended sacrifices. She He fabricated merit, became the first to send troops. The tower ship general was narrow-minded, met difficulty and shared blame. Regretted losing Panyu, then returned and was suspected. Xun Zhi disputed merit, with Sui were both executed. Both armies were humiliated, the generals were not enfeoffed.",
          "idiomatic": null
        }
      ]
    }
  ]
}