{
  "s0001": "Confucius was born in Zouyi village, Changping township of Lu.",
  "s0002": "His ancestors were from Song, named Kong Fangshu.",
  "s0003": "Fangshu fathered Bo Xia, Bo Xia fathered Shu Liang He.",
  "s0004": "He mated with a Yan family woman out of wedlock and gave birth to Confucius, having prayed at Ni Hill to obtain Confucius.",
  "s0005": "Confucius was born in the twenty-second year of Duke Xiang of Lu.",
  "s0006": "He was born with a sunken fontanelle on top of his head, so he was named Qiu accordingly.",
  "s0007": "His courtesy name was Zhong Ni, surname Kong.",
  "s0008": "Qiu was born and Shu Liang He died, buried at Fang Mountain.",
  "s0009": "Fang Mountain is east of Lu, so Confucius doubted the location of his father's grave, because his mother kept it secret.",
  "s0010": "When Confucius was a child at play, he would always arrange the sacrificial stands and assume ritual postures.",
  "s0011": "When Confucius's mother died, he held the funeral at Wufu crossroads, showing his caution.",
  "s0012": "A Zou person, the mother of Ran You's father, informed Confucius of his father's grave, then he went and joined the burial at Fang.",
  "s0013": "Confucius was in mourning attire when the Ji family feasted the scholars, and Confucius went along.",
  "s0014": "Yang Hu rebuked him saying: 'The Ji family feasts the scholars, not daring to feast you.'",
  "s0015": "Confucius thus withdrew.",
  "s0016": "At age seventeen, Lu minister Meng Xi Zi was ill and near death, admonishing his heir Yi Zi saying: 'Kong Qiu is a descendant of sages, extinguished in Song.",
  "s0017": "His ancestor Fu Fu He first had Song but yielded to Li Gong.",
  "s0018": "And Zheng Kao Fu assisted Dai, Wu, and Xuan Gong, three summons becoming increasingly respectful, hence the ding inscription says: \"One summons and bent, two summons and bowed, three summons and prostrated, following the wall and running, none dare insult me.",
  "s0019": "Rice here, gruel here, to fill my mouth.\"'",
  "s0020": "His respectfulness was like this.",
  "s0021": "I have heard that descendants of sages, though not contemporary, must have achievers.",
  "s0022": "Now Kong Qiu is young and fond of ritual, is he an achiever?",
  "s0023": "If I die, you must take him as teacher.'",
  "s0024": "When Xi Zi died, Yi Zi and Lu man Nan Gong Jing Shu went to study ritual with him.",
  "s0025": "This year, Ji Wu Zi died, and Ping Zi succeeded him.",
  "s0026": "Confucius was poor and lowly.",
  "s0027": "When grown, he once served as Ji family accountant, measuring quantities fairly;",
  "s0028": "once served as keeper of stores and increased the livestock.",
  "s0029": "From this he became Director of Works.",
  "s0030": "Then he left Lu, was rejected in Qi, driven out of Song and Wei, besieged between Chen and Cai, then returned to Lu.",
  "s0031": "Confucius was nine chi six cun tall, people all called him 'tall man' and considered him unusual.",
  "s0032": "Lu again treated him well, so he returned to Lu.",
  "s0033": "Lu's Nan Gong Jing Shu spoke to the Lu lord saying: 'Please go with Confucius to Zhou.'",
  "s0034": "The Lu lord gave him one chariot, two horses, one attendant, went to Zhou to inquire about ritual, reportedly meeting Lao Zi.",
  "s0035": "When leaving, Lao Zi saw him off saying: 'I have heard that the wealthy and noble send people off with wealth, benevolent people send people off with words.",
  "s0036": "I cannot be wealthy and noble, I secretly bear the title of benevolent person, send you off with words, saying: \"Those who are clever and deeply perceptive yet close to death are those who like to criticize others.",
  "s0037": "Those who are broadly argumentative and expansive endanger themselves are those who expose others' faults.",
  "s0038": "As a son, do not consider yourself important; as a minister, do not consider yourself important.\"'",
  "s0039": "Confucius returned from Zhou to Lu, and disciples gradually increased.",
  "s0040": "At this time, Jin Ping Gong was licentious, the six ministers monopolized power, attacking eastern feudal lords;",
  "s0041": "Chu Ling Wang's troops were strong, trampling the central states;",
  "s0042": "Qi was large and close to Lu.",
  "s0043": "Lu was small and weak, attaching to Chu angered Jin;",
  "s0044": "attaching to Jin brought Chu to attack;",
  "s0045": "not preparing for Qi brought Qi troops to invade Lu.",
  "s0046": "In Duke Zhao of Lu's twentieth year, Confucius was about thirty years old.",
  "s0047": "Qi Jing Gong and Yan Ying came to Lu, Jing Gong asked Confucius: 'In the past, Qin Mu Gong's state was small and in a remote place, how did he become hegemon?'",
  "s0048": "He replied: 'Qin, though the state was small, its ambitions were great;",
  "s0049": "though the place was remote, its conduct was upright.",
  "s0050": "He personally selected the five black sheep, ennobled him as a minister, raised him from prison chains, spoke with him for three days, and entrusted him with governance.",
  "s0051": "With this he attained it, though becoming king was possible, his hegemony was but small.'",
  "s0052": "Duke Jing was pleased.",
  "s0053": "其後季平子卒，季桓子嗣位。",
  "s0054": "桓子嬖臣曰仲梁懷，與陽虎有隙。",
  "s0055": "陽虎欲逐懷，公山不狃止之。",
  "s0056": "其明年，懷益驕，陽虎執懷。",
  "s0057": "桓子怒，陽虎因囚桓子，與盟而釋之。",
  "s0058": "陽虎由此益輕季氏。",
  "s0059": "季氏亦僭於公室，陪臣執國政，是以魯自大夫以下皆僭離於正道。",
  "s0060": "故孔子不仕，退而修詩書禮樂，弟子彌眾，至自遠方，莫不受業焉。",
  "s0061": "孔子以詩書禮樂教弟子，蓋三千焉，身通六藝者七十二人。",
  "s0062": "孔子以四教：文、行、忠、信。",
  "s0063": "絕四：毋意、毋必、毋固、毋我。",
  "s0064": "所 careful：喪、祭、射、御。",
  "s0065": "子貢問曰：「貧而無諂，富而無驕，何如？」",
  "s0066": "孔子曰：「未若貧而樂，富而好禮者也。」",
  "s0067": "子貢曰：「《詩》云『如切如磋，如琢如磨』，其斯之謂與？」",
  "s0068": "孔子曰：「賜也！始可與言詩已矣，告諸往而知來者。」",
  "s0069": "孔子曰：「不憤不啟，不悱不發，舉一隅不以三隅反，則不復也。」",
  "s0070": "孔子年四十二，魯昭公卒於乾侯，定公立。",
  "s0071": "定公立五年，季平子卒，桓子代立。",
  "s0072": "季桓子穿井得土缶，中若羊，問仲尼云「得狗」。",
  "s0073": "仲尼曰：「以丘所聞，羊也。",
  "s0074": "丘聞之，木石之怪夔、罔閬，水之怪龍、罔象，土之怪坟羊。」",
  "s0075": "孔子年四十七，而徵魯司寇。",
  "s0076": "孔子為魯司寇，舍公族，誅少正卯，魯之兇人為之徙。",
  "s0077": "三月，魯大治。",
  "s0078": "齊人歸女樂以沮之。",
  "s0079": "季桓子受之，三日不聽政；",
  "s0081": "孔子遂行，宿於屯。",
  "s0082": "將適齊，為尼丘之言者所止。",
  "s0083": "於是反魯。",
  "s0084": "孔子年五十有一而不間魯政。",
  "s0085": "定公以孔子為中都宰，一年，四方皆則之。",
  "s0086": "由中都宰為司空，由司空為大司寇。",
  "s0087": "孔子年五十五，魯定公以問禮老禮於孔子。",
  "s0088": "孔子曰：「魯自大夫以下皆僭妄，久矣。」",
  "s0089": "定公以孔子為魯大司寇，齊人聞而畏之。",
  "s0090": "犂鉏曰：「孔子為政必霸，霸則吾地近焉，我及齊國之政未可知也。",
  "s0091": "君其早圖之。」",
  "s0092": "齊景公患之，亶朋曰：「請君臣而告魯為好會，召孔子。",
  "s0094": "今孔子從君臣而伐蠻夷，君臣若召孔子，未有失也。」",
  "s0095": "孔子謂子路曰：「魯至此兮，吾丘之罪也！」",
  "s0096": "遂不行。",
  "s0097": "齊人為女樂以誘魯君，并赂季桓子，魯君遂受女樂，三日不聽政。",
  "s0098": "孔子聞之，曰：「彼婦之口，可以出走矣。」",
  "s0099": "於是孔子遂適衛，主於子路妻兄顏浊鄒家。",
  "s0100": "衛靈公問孔子：「居魯得祿幾何？」",
  "s0101": "對曰：「俸粟六萬。」",
  "s0102": "Wei Ling Gong's wife was named Nan Zi, she sent someone to tell Confucius: 'Gentlemen from the four directions who do not consider it humiliating to become brothers with my lord must see my little lord.",
  "s0103": "My little lord wishes to see.'",
  "s0104": "Confucius declined politely, but had no choice and saw her.",
  "s0105": "The wife was in thin curtains.",
  "s0106": "Confucius entered the gate, faced north and bowed with hands to ground.",
  "s0107": "The wife bowed twice from within the curtains, her jade pendants clinking.",
  "s0108": "Confucius said: 'I wished not to see, having seen I respond with ritual.'",
  "s0109": "Zi Lu was displeased.",
  "s0110": "Confucius swore saying: 'If I have done wrong, Heaven reject me!",
  "s0111": "Heaven reject me!'",
  "s0112": "After staying in Wei over a month, Ling Gong and his wife rode in the same chariot, eunuch Yong Qu was the passenger, went out, made Confucius the next chariot, swaggered through the market past him.",
  "s0113": "Confucius said: 'I have never seen one who loves virtue like loving beauty.'",
  "s0114": "Thus he despised it and left Wei, passing through Cao.",
  "s0115": "This year, Lu Ding Gong died.",
  "s0116": "Confucius left Cao for Song, practicing ritual with disciples under a large tree.",
  "s0117": "Song commander Huan Tui wanted to kill Confucius, chopped down his tree.",
  "s0118": "Confucius left.",
  "s0119": "Disciples said: 'We can hurry.'",
  "s0120": "Confucius said: 'Heaven has endowed virtue in me, what can Huan Tui do to me!'",
  "s0121": "Confucius went to Zheng, became separated from his disciples, Confucius stood alone at the eastern gate of the outer wall.",
  "s0122": "A Zheng person told Zi Gong: 'There is a man at the eastern gate, his forehead resembles Yao, his neck resembles Gao Tao, his shoulders resemble Zi Chan, but from the waist down he is three cun shorter than Yu.",
  "s0123": "Wearily like a homeless dog.'",
  "s0124": "Zi Gong truthfully told Confucius.",
  "s0125": "Confucius smiled happily and said: 'Appearance is superficial.",
  "s0126": "But to say resembling a homeless dog, yes indeed!",
  "s0127": "Yes indeed!'",
  "s0128": "Confucius arrived at Chen, staying at the home of Director of Construction Zhen Zi.",
  "s0129": "Over a year, Wu King Fu Chai attacked Chen, took three cities and left.",
  "s0130": "Zhao Yang attacked Zhaoge.",
  "s0131": "Chu besieged Cai, Cai moved to Wu.",
  "s0132": "Wu defeated Yue King Gou Jian at Kuaiji.",
  "s0133": "A falcon gathered in the Chen court and died, pierced by a hu arrow, stone point, the arrow a chi and eight cun long.",
  "s0134": "Chen Min Gong sent an envoy to ask Confucius.",
  "s0135": "Confucius said: 'The falcon came from afar, this is a Su Shen arrow.",
  "s0136": "In the past when King Wu conquered Shang, he opened roads to the nine Yi and hundred Man, made each bring their local tribute to contribute, so they would not forget their duties.",
  "s0137": "Thus Su Shen contributed hu arrows and stone points, a chi and eight cun long.",
  "s0138": "The former kings wished to display their excellent virtue, divided the Su Shen arrows to give to Da Ji, matched with Yu Hu Gong and enfeoffed them at Chen.",
  "s0139": "Divided same surnames with precious jade to display closeness;",
  "s0140": "divided different surnames with distant duties so they would not forget submission.",
  "s0141": "Therefore divided Chen with Su Shen arrows.'",
  "s0142": "They tried seeking in the old treasury, indeed found them.",
  "s0143": "Confucius stayed in Chen three years, when Jin and Chu contended for strength, alternately attacking Chen, and Wu invaded Chen, Chen was constantly raided.",
  "s0144": "Confucius said: 'Return home!",
  "s0145": "Return home!",
  "s0146": "My party's youths are simple and ardent, advancing and gaining without forgetting their beginnings.'",
  "s0147": "Thus Confucius left Chen.",
  "s0148": "Passing through Pu, encountered Gong Shu clan rebelling with Pu, Pu people stopped Confucius.",
  "s0149": "Among disciples was Gong Liang Ru, who followed Confucius with five private chariots.",
  "s0150": "His character was tall and worthy, with courage and strength, he said: 'I once followed master and encountered difficulty at Kuang, now encounter difficulty here again, it is fate.",
  "s0151": "I and master have suffered difficulty twice, would rather fight and die.'",
  "s0152": "I will not let it fall.\"",
  "s0153": "Twelfth month, the duke besieged Cheng but could not conquer it.",
  "s0154": "Lu Ding Gong's fourteenth year, Confucius age fifty-six, as Grand Minister of Justice acted as prime minister, showing happy expression.",
  "s0155": "Disciples said: \"We have heard that gentlemen do not fear when disaster comes, do not rejoice when fortune arrives.\"",
  "s0156": "Confucius said: \"There are these words.",
  "s0157": "Does it not say 'delight in using nobility to humble oneself'?\"",
  "s0158": "Thus he executed Lu minister who disturbed the government, Shao Zheng Mao.",
  "s0159": "Participated in national affairs three months, those selling lambs and pigs did not inflate prices;",
  "s0160": "men and women walking kept to separate paths;",
  "s0161": "nothing was picked up and kept from the roads;",
  "s0162": "travelers from the four directions arriving at towns did not seek officials, all given what they needed to return home.",
  "s0163": "Qi people heard and feared, said: \"If Confucius governs he will certainly become hegemon, if hegemon then our territory is close, we will be the first annexed.",
  "s0164": "Why not offer territory?\"",
  "s0165": "Li Chu said: \"Please first try to obstruct him;",
  "s0166": "if obstructing him proves impossible then offer territory, how late would that be!\"",
  "s0167": "Thus selected eighty beautiful women from Qi, all clothed in embroidered garments dancing Kang Le, thirty teams of fine horses, sent to Lu lord.",
  "s0168": "Displayed female musicians and fine horses outside Lu city's south high gate, Ji Huan Zi in plain clothes went to view several times, about to accept, then told Lu lord to travel Zhou roads, went to view all day, neglected government affairs.",
  "s0169": "Zi Lu said: \"Master can leave.\"",
  "s0170": "Confucius said: \"Lu now will perform the suburban sacrifice, if they offer the sacrificial meat to ministers, then I can still remain.\"",
  "s0171": "Huan Zi finally accepted Qi's female musicians, three days did not attend to government;",
  "s0172": "at the suburban sacrifice, also did not offer sacrificial meats to ministers.",
  "s0173": "Confucius thus left, lodged at Tun.",
  "s0174": "Shi Yi sent him off, said: \"Master is not at fault.\"",
  "s0175": "Confucius said: \"May I sing?\"",
  "s0176": "Sang: \"That woman's mouth can make one flee;",
  "s0177": "that woman's flattery can lead to death and defeat.",
  "s0178": "Alas, wandering wandering, just to end the year!\"",
  "s0179": "Shi Yi returned, Huan Zi said: \"What did Confucius say?\"",
  "s0180": "Shi Yi truthfully told him.",
  "s0181": "Huan Zi sighed deeply: \"Master blames me because of the female slaves!\"",
  "s0183": "Confucius thus went to Wei, stayed at Zi Lu's wife's brother Yan Zhu Zou's home.",
  "s0184": "Wei Ling Gong asked Confucius: \"When living in Lu, how much salary did you receive?\"",
  "s0185": "Replied: \"Six hundred thousand bushels of grain.\"",
  "s0186": "Wei people also gave six hundred thousand bushels.",
  "s0187": "After staying a while, someone slandered Confucius to Wei Ling Gong.",
  "s0188": "Ling Gong made Gong Sun Yu monitor his comings and goings.",
  "s0189": "Confucius feared being convicted, after ten months, left Wei.",
  "s0190": "About to go to Chen, passed through Kuang, Yan Ke as servant, pointed with his whip saying: \"Formerly I entered here, through that gap.\"",
  "s0191": "Kuang people heard it, thought he was Lu's Yang Hu.",
  "s0192": "Yang Hu had once oppressed Kuang people, Kuang people thus stopped Confucius.",
  "s0193": "Confucius's appearance resembled Yang Hu, imprisoned five days, Yan Yuan arrived later, Confucius said: \"I thought you had died.\"",
  "s0194": "Yan Yuan said: \"Master is here, how dare I die!\"",
  "s0195": "Kuang people imprisoned Confucius even more urgently, disciples feared.",
  "s0196": "Confucius said: \"Since King Wen has passed, is culture not here?",
  "s0197": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0198": "If Heaven has not lost this culture, what can Kuang people do to me!\"",
  "s0199": "Confucius made followers serve as Ning Wu Zi's ministers in Wei, then was able to leave.",
  "s0200": "Left and passed through Pu.",
  "s0201": "Over a month, returned to Wei, stayed at Qu Bo Yu's home.",
  "s0202": "Wei Ling Gong's wife was named Nan Zi, she sent someone to tell Confucius: 'Gentlemen from the four directions who do not consider it humiliating to become brothers with my lord must see my little lord.",
  "s0203": "My little lord wishes to see.'",
  "s0204": "Confucius declined politely, but had no choice and saw her.",
  "s0205": "The wife was in thin curtains.",
  "s0206": "Confucius entered the gate, faced north and bowed with hands to ground.",
  "s0207": "The wife bowed twice from within the curtains, her jade pendants clinking.",
  "s0208": "Confucius said: 'I wished not to see, having seen I respond with ritual.'",
  "s0209": "Zi Lu was displeased.",
  "s0210": "Confucius swore saying: 'If I have done wrong, Heaven reject me!",
  "s0211": "Heaven reject me!'",
  "s0212": "After staying in Wei over a month, Ling Gong and his wife rode in the same chariot, eunuch Yong Qu was the passenger, went out, made Confucius the next chariot, swaggered through the market past him.",
  "s0213": "Confucius said: 'I have never seen one who loves virtue like loving beauty.'",
  "s0214": "Thus he despised it and left Wei, passing through Cao.",
  "s0215": "This year, Lu Ding Gong died.",
  "s0216": "Confucius left Cao for Song, practicing ritual with disciples under a large tree.",
  "s0217": "Song commander Huan Tui wanted to kill Confucius, chopped down his tree.",
  "s0218": "Confucius left.",
  "s0219": "Disciples said: 'We can hurry.'",
  "s0220": "Confucius said: 'Heaven has endowed virtue in me, what can Huan Tui do to me!'",
  "s0222": "A Zheng person told Zi Gong: 'There is a man at the eastern gate, his forehead resembles Yao, his neck resembles Gao Tao, his shoulders resemble Zi Chan, but from the waist down he is three cun shorter than Yu.",
  "s0223": "Wearily like a homeless dog.'",
  "s0224": "Zi Gong truthfully told Confucius.",
  "s0225": "Confucius smiled happily and said: 'Appearance is superficial.",
  "s0226": "But to say resembling a homeless dog, yes indeed!",
  "s0227": "Yes indeed!'",
  "s0228": "Confucius arrived at Chen, staying at the home of Director of Construction Zhen Zi.",
  "s0230": "Zhao Yang attacked Zhaoge.",
  "s0231": "Chu besieged Cai, Cai moved to Wu.",
  "s0232": "Wu defeated Yue King Gou Jian at Kuaiji.",
  "s0233": "A falcon gathered in the Chen court and died, pierced by a hu arrow, stone point, the arrow a chi and eight cun long.",
  "s0234": "Chen Min Gong sent an envoy to ask Confucius.",
  "s0235": "Confucius said: 'The falcon came from afar, this is a Su Shen arrow.",
  "s0236": "In the past when King Wu conquered Shang, he opened roads to the nine Yi and hundred Man, made each bring their local tribute to contribute, so they would not forget their duties.",
  "s0237": "Thus Su Shen contributed hu arrows and stone points, a chi and eight cun long.",
  "s0238": "The former kings wished to display their excellent virtue, divided the Su Shen arrows to give to Da Ji, matched with Yu Hu Gong and enfeoffed them at Chen.",
  "s0239": "Divided same surnames with precious jade to display closeness;",
  "s0240": "divided different surnames with distant duties so they would not forget submission.",
  "s0241": "Therefore divided Chen with Su Shen arrows.'",
  "s0242": "They tried seeking in the old treasury, indeed found them.",
  "s0243": "Confucius stayed in Chen three years, when Jin and Chu contended for strength, alternately attacking Chen, and Wu invaded Chen, Chen was constantly raided.",
  "s0244": "Confucius said: 'Return home!",
  "s0245": "Return home!",
  "s0246": "My party's youths are simple and ardent, advancing and gaining without forgetting their beginnings.'",
  "s0247": "Thus Confucius left Chen.",
  "s0248": "Passing through Pu, encountered Gong Shu clan rebelling with Pu, Pu people stopped Confucius.",
  "s0249": "Among disciples was Gong Liang Ru, who followed Confucius with five private chariots.",
  "s0250": "His character was tall and worthy, with courage and strength, he said: 'I once followed master and encountered difficulty at Kuang, now encounter difficulty here again, it is fate.",
  "s0251": "I and master have suffered difficulty twice, would rather fight and die.'",
  "s0252": "Confucius said: 'Alas, have you not heard?",
  "s0253": "The people are the foundation of the state, foundation solid the state is peaceful.",
  "s0254": "Now if we stop, how can I conduct myself?",
  "s0255": "Your fate is fate, my fate is fate.'",
  "s0256": "Gong Liang Ru said: 'Master cannot, I will go with master.'",
  "s0257": "Confucius said: 'You still consider me worthy, I am not worthy.",
  "s0258": "I do not try, thus am skilled.'",
  "s0259": "Confucius traveled, Gong Liang Ru was surrounded by Pu people, Confucius sent Zi Gong to persuade them.",
  "s0261": "If you can release his disciples, then it is master's calamity.",
  "s0262": "Master fortunately escapes, it is Pu's calamity.",
  "s0263": "Now where master is, the Wei lord contends with Pu people for him.",
  "s0264": "If you release him, then Wei lord contends with Pu people for him.",
  "s0265": "Master not wishing to see, then also useless.",
  "s0266": "If he sees, then it is master's calamity.'",
  "s0267": "Pu people released Gong Liang Ru and stopped Confucius.",
  "s0268": "Confucius heard of it, angry, said: 'Lu and Wei's governance are like brothers.",
  "s0269": "Now Lu and Wei are hostile, is it brothers' resentment?",
  "s0270": "Master's service cannot have two minds.",
  "s0271": "Therefore Lu people stop master, Wei people also stop master.",
  "s0272": "Master not going to Jin and Wei is not fearing the feudal lords.",
  "s0273": "Fearing their brothers' resentment.",
  "s0274": "Now cutting off Lu and Wei, then bad for those wishing to see.",
  "s0275": "If wishing to see, then first release oneself.",
  "s0276": "Thus Confucius from Wei went to Jin, passing through Kuang, Kuang people heard of it, thought he was Lu Yang Hu.",
  "s0277": "Therefore surrounded Confucius, disciples all had hungry appearance.",
  "s0278": "Confucius said: 'Since King Wen has passed, is culture not here?",
  "s0279": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0280": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0281": "Confucius knew disciples had worried appearance, told Zi Gong: 'Have you heard?'",
  "s0282": "Zi Gong said: 'Master can travel.",
  "s0284": "If there is no calamity here, then it is Kuang people's calamity.",
  "s0285": "If stop, then it is master's calamity.",
  "s0286": "If travel, then it is Kuang people's calamity.",
  "s0288": "Confucius said: 'Ci, you only know one, not two.",
  "s0289": "Since King Wen has passed, is culture not here?",
  "s0290": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0291": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0292": "Confucius having explained, Kuang people welcomed Confucius.",
  "s0293": "After a while, the teacher said: 'You have already mastered the melody, now you may add to it.'",
  "s0294": "Confucius returned and stayed in Zou village, composing the Zou song to mourn.",
  "s0295": "Then returned to Wei, staying at Qu Bo Yu's home.",
  "s0296": "Another day, Ling Gong asked about military formations.",
  "s0297": "Confucius said: 'Ritual matters I have heard of, military matters I have not studied.'",
  "s0299": "Confucius thus left, returning to Chen.",
  "s0300": "Summer, Wei Ling Gong died, established grandson Jie, who became Wei Chu Gong.",
  "s0301": "Sixth month, Zhao Yang brought crown prince Kuai Kui inside Qi.",
  "s0302": "Yang Hu made the crown prince wear mourning clothes, eight people in mourning attire, falsely as those welcoming from Wei, crying as they entered, thus resided there.",
  "s0303": "Winter, Cai moved to Zhou Lai.",
  "s0304": "This year was Lu Ai Gong's third year, Confucius was sixty years old.",
  "s0305": "Qi helped Wei besiege Qi because crown prince Kuai Kui was there.",
  "s0306": "Summer, Lu Huan Xi temple burned, Nan Gong Jing Shu saved the fire.",
  "s0307": "Confucius in Chen heard of it, said: 'The disaster must be at Huan Xi temple?'",
  "s0308": "Soon indeed so.",
  "s0309": "Autumn, Ji Huan Zi ill, carried to see Lu's city walls, sighed deeply saying: 'In the past this state almost prospered, but because I offended Confucius, it did not prosper.'",
  "s0310": "Looking back at his heir Kang Zi said: 'I will die soon, you must govern Lu;",
  "s0311": "governing Lu, must summon Zhong Ni.'",
  "s0312": "After several days, Huan Zi died, Kang Zi succeeded.",
  "s0313": "After burial, wished to summon Zhong Ni.",
  "s0314": "Gong Yu Yu said: 'In the past our former lord employed him but not to the end, finally became the laughingstock of the feudal lords.",
  "s0315": "Now employing him again, if cannot finish, this is again becoming the laughingstock of the feudal lords.'",
  "s0316": "Kang Zi said: 'Then who can be summoned?'",
  "s0317": "Said: 'Must summon Ran Qiu.'",
  "s0318": "Thus sent envoys to summon Ran Qiu.",
  "s0319": "Ran Qiu about to go, Confucius said: 'Lu people summon Qiu, not for small use, will greatly use him.'",
  "s0320": "That day, Confucius said: 'Return home! Return home!",
  "s0321": "My party's youths are ardent and simple, their patterns are brilliant, I do not know how to cut them.'",
  "s0322": "Zi Gong knew Confucius wished to return, sent Ran Qiu, admonishing to 'if employed, use Confucius as the banner.'",
  "s0323": "Ran Qiu having left, next year, Confucius from Chen moved to Cai.",
  "s0324": "Cai Zhao Gong about to go to Wu, Wu summoned him.",
  "s0325": "Previously Zhao Gong deceived his ministers to move Zhou Lai, now about to go, ministers feared he would move again, Gong Sun Pian shot and killed Zhao Gong.",
  "s0326": "Chu invaded Cai.",
  "s0328": "Next year, Confucius from Cai went to Ye.",
  "s0329": "Ye Gong asked about governance, Confucius said: 'Governance lies in attracting the distant and attaching the near.'",
  "s0330": "Another day, Ye Gong asked Confucius to Zi Lu, Zi Lu did not answer.",
  "s0331": "Confucius heard of it, said: 'You, why not answer saying \"His character is: studies the Way without tiring, teaches others without wearying, becomes indignant and forgets food, joyful and forgets worry, does not know old age is approaching\" thus.'",
  "s0332": "Left Ye, returned to Cai.",
  "s0333": "Chang Ju and Jie Nie were plowing together, Confucius considered them recluses, sent Zi Lu to ask for directions.",
  "s0334": "Chang Ju said: 'That one holding the reins, who is he?'",
  "s0335": "Zi Lu said: 'Kong Qiu.'",
  "s0336": "Said: 'Is he Lu Kong Qiu?'",
  "s0337": "Said: 'Yes.'",
  "s0338": "Said: 'He knows the directions.'",
  "s0339": "Jie Nie told Zi Lu: 'Who are you?'",
  "s0340": "Said: 'Zhong You.'",
  "s0341": "Said: 'Are you Lu Kong Qiu's disciple?'",
  "s0342": "Said: 'Yes.'",
  "s0343": "Said: 'The whole world is flooded, who can change it? Rather than follow a scholar who avoids this person and that person, better follow those who avoid the world.'",
  "s0344": "Planted his hoe and would not speak.",
  "s0345": "Zi Lu returned and told Confucius, Confucius sadly said: 'One cannot herd with birds and beasts. If the world is not the Way, with whom shall I go?",
  "s0346": "If the world has the Way, what need have I to change?'",
  "s0347": "Zi Lu followed after, encountered an old man, carrying a hoe on his shoulder.",
  "s0348": "Zi Lu asked: 'Have you seen my master?'",
  "s0349": "The old man said: 'Your four limbs are not diligent, five grains not distinguished, who is your master?'",
  "s0352": "Next day, Zi Lu traveled, told Confucius about it.",
  "s0353": "Confucius said: 'He is a recluse.'",
  "s0354": "Sent Zi Lu to return and see him, arrived but he had left.",
  "s0355": "Zi Lu said: 'Not serving is unrighteous.",
  "s0356": "The order of elders and juniors cannot be abandoned;",
  "s0357": "the righteousness of ruler and minister, how can it be abandoned?",
  "s0358": "Wanting to cleanse one's body, but disrupting the great relationships.",
  "s0359": "A gentleman's service, executes his righteousness.",
  "s0360": "The Way not being practiced, I have long known it.'",
  "s0361": "Confucius said to Zi Lu: 'I have heard, gentlemen who follow the Way gain praise, those who hide their traces have no blame.",
  "s0362": "I will hide my traces here.'",
  "s0363": "Thus went to Cao from Cai.",
  "s0364": "From Cao went to Song, practiced ritual with disciples under a large tree.",
  "s0365": "Song commander Huan Tui wanted to kill Confucius, chopped down his tree.",
  "s0366": "Confucius left.",
  "s0368": "Confucius said: 'Heaven has endowed virtue in me, what can Huan Tui do to me!'",
  "s0369": "Confucius went to Zheng, became separated from his disciples, Confucius stood alone at the eastern gate of the outer wall.",
  "s0370": "A Zheng person told Zi Gong: 'There is a man at the eastern gate, his forehead resembles Yao, his neck resembles Gao Tao, his shoulders resemble Zi Chan, but from the waist down he is three cun shorter than Yu.",
  "s0371": "Wearily like a homeless dog.'",
  "s0372": "Zi Gong truthfully told Confucius.",
  "s0373": "Confucius smiled happily and said: 'Appearance is superficial.",
  "s0374": "But to say resembling a homeless dog, yes indeed!",
  "s0375": "Yes indeed!'",
  "s0376": "Confucius arrived at Chen, staying at the home of Director of Construction Zhen Zi.",
  "s0377": "Over a year, Wu King Fu Chai attacked Chen, took three cities and left.",
  "s0378": "Zhao Yang attacked Zhaoge.",
  "s0379": "Chu besieged Cai, Cai moved to Wu.",
  "s0380": "Wu defeated Yue King Gou Jian at Kuaiji.",
  "s0381": "A falcon gathered in the Chen court and died, pierced by a hu arrow, stone point, the arrow a chi and eight cun long.",
  "s0382": "Chen Min Gong sent an envoy to ask Confucius.",
  "s0383": "Confucius said: 'The falcon came from afar, this is a Su Shen arrow.",
  "s0384": "In the past when King Wu conquered Shang, he opened roads to the nine Yi and hundred Man, made each bring their local tribute to contribute, so they would not forget their duties.",
  "s0385": "Thus Su Shen contributed hu arrows and stone points, a chi and eight cun long.",
  "s0387": "Divided same surnames with precious jade to display closeness;",
  "s0388": "divided different surnames with distant duties so they would not forget submission.",
  "s0389": "Therefore divided Chen with Su Shen arrows.'",
  "s0390": "They tried seeking in the old treasury, indeed found them.",
  "s0391": "Confucius stayed in Chen three years, when Jin and Chu contended for strength, alternately attacking Chen, and Wu invaded Chen, Chen was constantly raided.",
  "s0392": "Confucius said: 'Return home!",
  "s0394": "My party's youths are simple and ardent, advancing and gaining without forgetting their beginnings.'",
  "s0395": "Thus Confucius left Chen.",
  "s0396": "Passing through Pu, encountered Gong Shu clan rebelling with Pu, Pu people stopped Confucius.",
  "s0397": "Among disciples was Gong Liang Ru, who followed Confucius with five private chariots.",
  "s0398": "His character was tall and worthy, with courage and strength, he said: 'I once followed master and encountered difficulty at Kuang, now encounter difficulty here again, it is fate.",
  "s0399": "I and master have suffered difficulty twice, would rather fight and die.'",
  "s0400": "Confucius said: 'Alas, have you not heard?",
  "s0401": "The people are the foundation of the state, foundation solid the state is peaceful.",
  "s0402": "Now if we stop, how can I conduct myself?",
  "s0403": "Your fate is fate, my fate is fate.'",
  "s0405": "Confucius said: 'You still consider me worthy, I am not worthy.",
  "s0406": "I do not try, thus am skilled.'",
  "s0407": "Confucius traveled, Gong Liang Ru was surrounded by Pu people, Confucius sent Zi Gong to persuade them.",
  "s0408": "Zi Gong went, said: 'Master being here is Pu's calamity.",
  "s0409": "If you can release his disciples, then it is master's calamity.",
  "s0410": "Master fortunately escapes, it is Pu's calamity.",
  "s0411": "Now where master is, the Wei lord contends with Pu people for him.",
  "s0412": "If you release him, then Wei lord contends with Pu people for him.",
  "s0413": "Master not wishing to see, then also useless.",
  "s0414": "If he sees, then it is master's calamity.'",
  "s0416": "Confucius heard of it, angry, said: 'Lu and Wei's governance are like brothers.",
  "s0417": "Now Lu and Wei are hostile, is it brothers' resentment?",
  "s0418": "Master's service cannot have two minds.",
  "s0419": "Therefore Lu people stop master, Wei people also stop master.",
  "s0420": "Master not going to Jin and Wei is not fearing the feudal lords.",
  "s0421": "Fearing their brothers' resentment.",
  "s0422": "Now cutting off Lu and Wei, then bad for those wishing to see.",
  "s0423": "If wishing to see, then first release oneself.",
  "s0424": "Thus Confucius from Wei went to Jin, passing through Kuang, Kuang people heard of it, thought he was Lu Yang Hu.",
  "s0425": "Therefore surrounded Confucius, disciples all had hungry appearance.",
  "s0426": "Confucius said: 'Since King Wen has passed, is culture not here?",
  "s0428": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0429": "Confucius knew disciples had worried appearance, told Zi Gong: 'Have you heard?'",
  "s0430": "Zi Gong said: 'Master can travel.",
  "s0431": "If there is calamity here, then it is master's calamity.",
  "s0432": "If there is no calamity here, then it is Kuang people's calamity.",
  "s0433": "If stop, then it is master's calamity.",
  "s0434": "If travel, then it is Kuang people's calamity.",
  "s0435": "Why worry master?'",
  "s0436": "Confucius said: 'Ci, you only know one, not two.",
  "s0437": "Since King Wen has passed, is culture not here?",
  "s0438": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0439": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0440": "Confucius having explained, Kuang people welcomed Confucius.",
  "s0441": "King Wen resided in Feng, King Wu in Hao - lords of a hundred li territories who ultimately became kings of All Under Heaven.",
  "s0442": "Now if Kong Qiu were to gain control of territory with his worthy disciples as aides, it would not be fortunate for Chu.'",
  "s0443": "King Zhao thus stopped.",
  "s0444": "That autumn, Chu King Zhao died at Chengfu.",
  "s0612": "Zi Si was born Bai, courtesy name Zi Shang, age forty-seven.",
  "s0613": "Zi Shang fathered Qiu, courtesy name Zi Jia, age forty-five.",
  "s0614": "Zi Jia fathered Ji, courtesy name Zi Jing, age forty-six.",
  "s0615": "Zi Jing fathered Chuan, courtesy name Zi Gao, age fifty-one.",
  "s0616": "Zi Gao fathered Zi Shen, age fifty-seven, once served as Wei chancellor.",
  "s0617": "Zi Shen fathered Fu, age fifty-seven, died in Chen serving Chen King Fu as doctor.",
  "s0618": "Fu's disciple Xiang, age fifty-seven.",
  "s0619": "Once served as doctor to Emperor Hui of Han, moved to become governor of Changsha.",
  "s0620": "Nine chi six cun tall.",
  "s0621": "Zi Xiang fathered Zhong, age fifty-seven.",
  "s0622": "Zhong fathered Wu, Wu fathered Yan Nian and An Guo.",
  "s0623": "An Guo served as doctor to the current emperor, went to be governor of Linhuai, died young.",
  "s0624": "An Guo fathered Ang, Ang fathered Huan.",
  "s0625": "The Grand Historian says: \"The Poetry says: 'High mountains look up to stop, shining path to walk.\"",
  "s0626": "Though unable to reach it, the heart turns toward it.",
  "s0627": "I read Confucius's books, imagine seeing his person.",
  "s0628": "Went to Lu, observed Confucius's temple hall carriage robes ritual vessels, the disciples with the times practice ritual in his home, I reverently lingered and could not leave.",
  "s0629": "The world has many kings and worthy people, when alive they are honored, when dead they end.",
  "s0630": "Confucius as commoner, transmitted for over ten generations, scholars revere him.",
  "s0631": "From kings and nobles of China, those speaking of the six arts take Confucius as the standard, can be called the utmost sage!\""
}