{
  "s0201": "Kang Wang ascended the throne and ruled fifteen years, then died. His son Yuan ascended the throne, becoming Jia Ao.",
  "s0202": "Kang Wang favored his younger brothers Gong Zi Wei, Zi Bi, Zi Xi, and Qi Ji.",
  "s0203": "In Jia Ao's third year, he appointed his uncle Kang Wang's younger brother Gong Zi Wei as Prime Minister to command military affairs.",
  "s0204": "In the fourth year, Wei sent an envoy to Zheng, but heard the king was ill and returned.",
  "s0205": "In the twelfth month, on Ji You, Wei entered to inquire about the king's illness, strangled him, and assassinated him, then killed his son Mo and Ping Xia.",
  "s0206": "He sent messengers to announce to Zheng.",
  "s0207": "Wu Ju asked: 'Who will succeed him?'",
  "s0208": "They replied: 'Our grand master Wei.'",
  "s0209": "Wu Ju changed it to: 'Gong Wang's son Wei is the eldest.'",
  "s0210": "Zi Bi fled to Jin, while Wei ascended the throne, becoming Ling Wang.",
  "s0211": "In Ling Wang's third year, sixth month, Chu sent envoys to Jin requesting to assemble the feudal lords.",
  "s0212": "All the feudal lords assembled with Chu at Shen.",
  "s0213": "Wu Ju said: 'In ancient times, Xia Jie had the banquet at Gou Tai, Shang Tang had the mandate at Jing Bo, Zhou Wu Wang had the oath at Meng Jin, Cheng Wang had the meeting at Qi Yang, Kang Wang had the court at Feng Gong, Mu Wang had the assembly at Tu Shan, Duke Huan of Qi had the army at Zhao Ling, Duke Wen of Jin had the alliance at Jian Tu. What will our lord use?'",
  "s0214": "Ling Wang said: 'Use Duke Huan's method.'",
  "s0215": "At this time, Zi Chan of Zheng was present.",
  "s0216": "Thereupon Jin, Song, Lu, and Wei did not attend.",
  "s0217": "After Ling Wang concluded the alliance, he showed arrogant bearing.",
  "s0218": "Wu Ju said: 'Jie held the assembly at You Ren, and Yin rebelled against him.",
  "s0219": "Zhou held the assembly at Li Shan, and the eastern Yi rebelled against him.",
  "s0220": "King You held the alliance at Tai Shi, and the Rong and Di rebelled against him.",
  "s0221": "Your Majesty should be careful to the end!'",
  "s0223": "In the seventh month, Chu used the feudal lords' troops to attack Wu, surrounding Zhu Fang.",
  "s0224": "In the eighth month, they conquered it, imprisoned Qing Feng, and exterminated his clan.",
  "s0225": "They paraded him through the army, saying: 'Do not emulate Qing Feng of Qi who assassinated his lord and weakened his orphan, to make an alliance with the grand masters!'",
  "s0226": "Feng replied: 'None are like Chu Gong Wang's illegitimate son Wei who assassinated his lord's elder brother's son Yuan and replaced him on the throne!'",
  "s0227": "Thereupon Ling Wang ordered Qi Ji to kill him.",
  "s0228": "In the seventh year, he completed the Zhang Hua Terrace and ordered people fleeing internally to populate it.",
  "s0229": "In the eighth year, he sent Gong Zi Qi Ji to lead troops and extinguish Chen.",
  "s0230": "In the tenth year, he summoned the Marquis of Cai, got him drunk, and killed him.",
  "s0231": "He had Qi Ji pacify Cai and made him Duke of Chen and Cai.",
  "s0232": "In the eleventh year, he attacked Xu to intimidate Wu.",
  "s0233": "Ling Wang camped at Qian Xi to await them.",
  "s0234": "The king said: 'Qi, Jin, Lu, and Wei all received precious vessels when they were enfeoffed, but I alone did not.",
  "s0235": "Now I will send envoys to Zhou to request the ding tripod to divide it - will they give it to me?'",
  "s0236": "Xi Fu replied: 'They will certainly give it to Your Majesty!",
  "s0237": "In ancient times, our ancestor Xiong Xi took refuge in Jing Shan, dwelling in thatched huts and eating coarse food among the weeds and grass, traversing mountains and forests to serve the Son of Heaven, offering only peach bows and thorn arrows for the royal service.",
  "s0238": "Qi is the king's maternal uncle;",
  "s0239": "Jin and Lu and Wei are the king's maternal younger brothers: this is why Chu has no share while they all have some.",
  "s0240": "Now Zhou together with the four states serves Your Majesty, they will follow your commands - how dare they begrudge the ding?'",
  "s0241": "Ling Wang said: 'In ancient times, my royal ancestor Bo Fu Kun Wu originally dwelt in this region, but now the people of Zheng greedily keep their fields and will not give them to me. Now if I request them, will they give them to me?'",
  "s0242": "He replied: 'Zhou does not begrudge the ding, how dare Zheng begrudge the fields?'",
  "s0243": "Ling Wang said: 'In ancient times the feudal lords were distant from me and feared Jin, but now I greatly fortify Chen and Cai and Bu Geng, each with a thousand chariots in military strength - will the feudal lords fear me?'",
  "s0244": "He replied: 'They will fear you!'",
  "s0245": "Ling Wang was pleased and said: 'Xi Fu speaks well of ancient affairs.'",
  "s0247": "In the twelfth year, spring, Chu Ling Wang enjoyed Qian Xi so much he could not leave.",
  "s0248": "The people of the state suffered from the forced labor.",
  "s0249": "Initially, Ling Wang assembled troops at Shen and executed the Yue grand master Chang Shou Guo, killed the Cai grand master Guan Qi.",
  "s0250": "Qi's son Cong fled to Wu and persuaded the Wu king to attack Chu, creating discord between the Yue grand master Chang Shou Guo to cause rebellion, creating a gap for Wu.",
  "s0251": "He forged orders from Gong Zi Qi Ji to summon Gong Zi Bi from Jin, reaching Cai, wanting to attack Cai with Wu and Yue troops.",
  "s0252": "He commanded Gong Zi Bi to meet Qi Ji and form an alliance at Deng.",
  "s0253": "Ling Wang heard of the rebellion and returned from Qian Xi, camping at Ping Rao.",
  "s0254": "Qing Feng of Qi was at Chu at the time, so Ling Wang consulted him.",
  "s0255": "Qing Feng said: 'It is better to pardon them and let them come to court, then we can observe their intentions.'",
  "s0256": "Ling Wang sent someone to summon them, but they did not come.",
  "s0257": "He sent Gong Zi Zi Gao to observe their situation.",
  "s0258": "Zi Gao reported: 'They are allied and will surely rebel.'",
  "s0259": "Ling Wang wanted to attack them, but feared the people would not follow.",
  "s0260": "He sent Gong Zi Zi Qi to Jin to seek help, but Zi Qi defected to Jin.",
  "s0261": "Zi Qi's charioteer fled back and reported.",
  "s0262": "Ling Wang was angry and attacked Xu, taking Xu's Bi Xi.",
  "s0263": "He returned and camped at Yong Shi, then died there.",
  "s0264": "The gentlemen said: 'Ling Wang was arrogant and extravagant, building terraces and towers, exhausting the people, and finally perished.'",
  "s0265": "Zi Gao and Zi Qi buried Ling Wang secretly at Yong Shi.",
  "s0266": "When Zi Bi heard Ling Wang was dead, he returned from Jin.",
  "s0267": "He allied with the people of Chu at Zhao, and the people of Chu were glad.",
  "s0268": "They killed Zi Gao and Zi Qi, and Zi Bi ascended the throne, becoming Ping Wang.",
  "s0269": "Ping Wang's first year, he summoned Zhao Wang of Wei and killed him.",
  "s0270": "In the second year, he attacked Chen.",
  "s0271": "In the fourth year, he attacked Cai.",
  "s0272": "In the sixth year, he attacked Song.",
  "s0273": "In the eighth year, Ping Wang died, and his son Zhao Wang Zhen ascended the throne.",
  "s0274": "In Zhao Wang's first year, he attacked Zheng.",
  "s0275": "In the sixth year, Zhao Wang died, and his son Hui Wang Zhang ascended the throne.",
  "s0276": "In Hui Wang's first year, he attacked Song.",
  "s0277": "In the second year, Hui Wang died, and his son Jian Wang Sheng ascended the throne.",
  "s0278": "In Jian Wang's first year, he attacked Song.",
  "s0279": "In the second year, he attacked Zheng.",
  "s0280": "In the fourth year, Jian Wang died, and his son Sheng Wang Dang ascended the throne.",
  "s0281": "In Sheng Wang's first year, he attacked Song.",
  "s0282": "In the second year, he attacked Wei.",
  "s0283": "In the third year, Sheng Wang died, and his son Dao Wang Yi ascended the throne.",
  "s0284": "In Dao Wang's first year, he attacked Song.",
  "s0285": "In the twelfth year, Dao Wang died, and his son Xuan Wang Liang ascended the throne.",
  "s0286": "In Xuan Wang's first year, he attacked Wei.",
  "s0287": "In the third year, he attacked Song.",
  "s0288": "In the fourth year, Xuan Wang died, and his son Wei Wang Shang ascended the throne.",
  "s0289": "In Wei Wang's first year, he attacked Zheng.",
  "s0290": "In the fifth year, Wei Wang died, and his son Bao Wang Ying ascended the throne.",
  "s0291": "In Bao Wang's first year, he attacked Song.",
  "s0292": "In the sixth year, Bao Wang died, and his son Xuan Wang Wei ascended the throne.",
  "s0293": "In Xuan Wang's first year, he attacked Song.",
  "s0294": "In the third year, he attacked Wei.",
  "s0295": "In the sixth year, Xuan Wang died, and his son Hui Wang Wei ascended the throne.",
  "s0296": "In Hui Wang's first year, he attacked Song.",
  "s0297": "In the fourth year, Hui Wang died, and his son Zhao Wang Wei ascended the throne.",
  "s0298": "In Zhao Wang's first year, he attacked Song.",
  "s0299": "In the second year, he attacked Zheng.",
  "s0300": "In the third year, Zhao Wang died, and his son You Wang Lu ascended the throne."
}
