{
  "s0100": "Therefore these three spoke of profit matters splitting autumn hairs.",
  "s0101": "Laws increasingly strict, officials many dismissed removed.",
  "s0102": "Weapons and armor frequently moved, people many bought exemption and five great men, conscripted soldiers increasingly few.",
  "s0103": "Therefore exempted thousand man five great men as officials, those not wanting paid horses;",
  "s0104": "old officials all suited orders to cut brambles in Shanglin, made Kunming Pool.",
  "s0105": "Next year, great general, cavalry general greatly went out to attack Hu, got heads captives eighty nine thousand, rewards fifty thousand jin, Han army horses dead over ten thousand, transport carriages armor expenses not included.",
  "s0106": "At this time wealth scarce, warriors considerably could not get salaries.",
  "s0107": "Officials said three zhu money light, easy for evil fraud, then requested various commanderies kingdoms cast five zhu money, rimmed below it, made unable to grind take filings.",
  "s0108": "Great agronomist memorialed salt iron vice Kong Jin, Xian Yang said: 'Mountains seas, heaven earth's stores, all should belong to lesser treasury, Your Majesty not private, gave to great agronomist to assist taxes.",
  "s0109": "Wish recruit people self provide expenses, use official tools to boil salt, officials give boiler basins.",
  "s0110": "Floating eating strange people wish to monopolize mountains seas goods, to become rich and abundant, exploit benefit small people.",
  "s0111": "Their blocking affairs discussions, cannot all listen.",
  "s0112": "Daring privately cast iron tools boil salt, brand left foot, confiscate their tools objects.",
  "s0113": "Commanderies not producing iron, establish small iron officials, convenient belonging to local counties.'",
  "s0114": "Sent Kong Jin, Dong Guo Xian Yang riding post to tour realm salt iron, made official offices, dismissed old salt iron rich as officials.",
  "s0115": "Official path increasingly mixed, not selected, many merchants.",
  "s0116": "Merchants with currency changes, much accumulated goods pursued profit.",
  "s0117": "Therefore ministers said: 'Commanderies kingdoms rather suffered disasters, poor people without property, recruit move to broad fertile lands.",
  "s0118": "Your Majesty reduced meals saved use, took forbidden money to relieve the people, relaxed loans taxes, but people not equally went out to southern fields, merchants increasingly many.",
  "s0119": "Poor accumulated nothing, all dependent on county officials.",
  "s0120": "Different times taxed carriages merchants strings money all had differences, please tax as before.",
  "s0121": "Various merchants retail borrowed lent bought sold, resided in cities hoarded various goods, merchants taking profit, though no market registration, each with their goods self declared, rate string money two thousand one tax.",
  "s0122": "Various craftsmen rented and cast, rate string money four thousand one tax.",
  "s0123": "Non-officials like three elders, northern border cavalry, carriages one tax;",
  "s0124": "merchant carriages two taxes;",
  "s0125": "boats five zhang above one tax.",
  "s0126": "Concealed not self declared, declared not complete, garrison border one year, confiscate string money.",
  "s0127": "Those able to report, give half to them.",
  "s0128": "Merchants with market registration, and their families, all cannot register named fields, to benefit farmers.",
  "s0129": "Daring violate order, confiscate fields slaves.'",
  "s0131": "Emperor then thought of Bu Shi's words, summoned appointed Shi as central gentleman, nobility left commoner, granted ten qing fields, cloth announced realm, made clear known.",
  "s0132": "Initially, Bu Shi, Henan person, took farming livestock as occupation.",
  "s0133": "Parents died, Shi had young brother, brother grown, Shi stripped body went out divided, alone took hundred plus sheep, fields houses wealth all gave to brother.",
  "s0134": "Shi entered mountains pastured over ten years, sheep reached thousand plus heads, bought fields houses.",
  "s0135": "His brother completely ruined his occupation, Shi then again divided gave to brother several times.",
  "s0136": "At this time Han just frequently sent generals to attack Xiongnu, Bu Shi memorialed, wished to deliver half his family to county officials aid border.",
  "s0137": "Emperor sent envoy asked Shi: 'Wish official position?'",
  "s0138": "Shi said: 'Minister young pastured, not practiced serving officials, not wish.'",
  "s0139": "Envoy asked: 'Family perhaps has grievance, wish speak affairs?'",
  "s0140": "Shi said: 'Minister born with people no divided disputes.",
  "s0141": "Shi city people poor lent to them, not good taught to follow, resided people all followed Shi, Shi why seen grievance by people!",
  "s0142": "No wish to speak.'",
  "s0143": "Envoy said: 'If so, why do this?'",
  "s0144": "Shi said: 'Emperor punishes Xiongnu, foolish consider worthy should die section at border, having wealth should deliver property, thus Xiongnu can extinguish.'",
  "s0145": "Envoy complete his words entered to report.",
  "s0146": "Emperor spoke to chancellor Hong.",
  "s0147": "Hong said: 'This not human feeling.",
  "s0148": "Unruly minister, cannot for transformation and disorder laws, wish Your Majesty not permit.'",
  "s0149": "Therefore emperor long not replied Shi, several years, then dismissed Shi."
}
