{
  "s0132": "King Wu charged forward, the Zhou troops all collapsed and rebelled against Zhou.",
  "s0133": "Zhou fled, returned and ascended the Deer Tower, covered himself with his precious jades, and burned himself to death in the fire.",
  "s0134": "King Wu held the great white banner to command the lords, all the lords bowed to King Wu, King Wu then bowed to the lords, all the lords followed.",
  "s0135": "King Wu arrived at the Shang state, the common people of Shang all waited in the suburbs.",
  "s0136": "Therefore King Wu sent his ministers to announce to the Shang common people: 'Heaven has sent down good fortune!'",
  "s0137": "The Shang people all bowed twice with heads to ground, King Wu also returned the bow.",
  "s0138": "King Wu entered the palace, sat on the great throne, the lords all presented their captives.",
  "s0139": "King Wu made the proclamation to the four directions: 'The ancients had a saying: 'Do not kill those who surrender.'",
  "s0140": "I am not an executioner, do not kill the captives.'",
  "s0141": "King Wu released the imprisoned Jizi, restored the imprisoned Bi Gan.",
  "s0142": "He searched for the imprisoned Xiahou Shang, found him and released him.",
  "s0143": "He made the Duke of Zhou guard the eastern regions.",
  "s0144": "In the twelfth year, King Wu died.",
  "s0145": "King Cheng was young, the Duke of Zhou acted as regent.",
  "s0146": "The three guards rebelled, saying: 'The Duke of Zhou will harm the young king.'",
  "s0147": "The Duke of Zhou went to the eastern capital, put down the rebellion.",
  "s0148": "He moved the Yin people to Luo, established the eastern capital.",
  "s0149": "He made the Da Gao proclamation, comforted the Yin people.",
  "s0150": "He made the Kang Gao proclamation, established the ritual system.",
  "s0151": "He made the Jun Shi proclamation, divided the lands.",
  "s0152": "He made the Luo Gong proclamation, established the well-field system.",
  "s0153": "He made the wine prohibition proclamation, banned drunkenness.",
  "s0154": "King Cheng grew up, the Duke of Zhou returned the government.",
  "s0155": "King Cheng was diligent in government, the world was at peace.",
  "s0156": "King Cheng died, King Kang ascended.",
  "s0157": "King Kang monitored the eastern regions, toured the lords, administered justice.",
  "s0158": "Forty years without punishment, the world was at peace under King Kang.",
  "s0159": "King Kang died, King Zhao ascended.",
  "s0160": "King Zhao went south to tour, died at the Han River.",
  "s0161": "King Mu ascended.",
  "s0162": "King Mu was ambitious and fond of grandeur, personally drove the eight horses.",
  "s0163": "He went west to attack the Quanrong, obtained four white wolves and four white deer.",
  "s0164": "He made Zhao Ju the Grand Master, prepared to attack the Quanrong.",
  "s0165": "The Quanrong submitted, King Mu stopped.",
  "s0166": "He toured the north, reached the Great Wall.",
  "s0167": "He saw the Yellow Emperor's Xuanyuan Terrace.",
  "s0168": "He returned and died at Haojing.",
  "s0169": "King Mu's son King Gong ascended.",
  "s0170": "King Gong died, his younger brother King Yi ascended.",
  "s0171": "King Yi died, King Xiao ascended.",
  "s0172": "King Xiao died, King Li ascended.",
  "s0173": "King Li was tyrannical, the common people rebelled.",
  "s0174": "King Li fled to Zhi, died there.",
  "s0175": "The common people made Duke Wu of Gonghe regent.",
  "s0176": "Fourteen years, King Xuan ascended, the Gonghe administration ended.",
  "s0177": "King Xuan revived Zhou's prosperity, moved the capital to Luoyi.",
  "s0178": "He attacked the Quanrong, drove them out.",
  "s0179": "He attacked the Jiang, defeated them.",
  "s0180": "He attacked the Xu Yan, captured their king.",
  "s0181": "Two younger brothers of the same mother, Yi Zhongyan, gave birth to Gongsun Wuzhi."
}