{
  "s0598": "Like star not star, like cloud not cloud, named Gui Xie.",
  "s0749": "Heaven then has column lodges, earth then has province domains.",
  "s0750": "Three lights, yin yang essences, qi root in earth, but sages unify govern them.",
  "s0751": "You Li and past, esteemed.",
  "s0752": "Where see heaven changes, all states different caves holes, families divine things monsters, to combine time respond, their writings diagrams records auspicious inauspicious not law.",
  "s0753": "Thus Confucius discusses six classics, records anomalies and explanations not write.",
  "s0754": "To heaven way fate, not transmit;",
  "s0755": "Transmit its person, not wait tell;",
  "s0756": "Tell not its person, though speak not establish.",
  "s0757": "Former transmit heaven numbers: Gao Xin before, Zhong Li;",
  "s0758": "At Tang Yu, Xi He;",
  "s0759": "Has Xia, Kun Wu;",
  "s0760": "Yin Shang, Wu Xian;",
  "s0761": "Zhou chamber, Shi Yi, Chang Hong;",
  "s0762": "At Song, Zi Wei;",
  "s0763": "Zheng then Bi Zao;",
  "s0764": "In Qi, Gan Gong;",
  "s0765": "Chu, Tang Mei;",
  "s0766": "Zhao, Yin Gao;",
  "s0767": "Wei, Shi Shen.",
  "s0768": "Heaven movement, thirty years one small change, hundred years middle change, five hundred years great change;",
  "s0769": "Three great changes one ji, three ji then great complete: this its great number.",
  "s0770": "For state must value three five.",
  "s0771": "Up down each thousand years, then heaven man between continues complete.",
  "s0772": "Grand Historian pushes ancient heaven changes, not has can examine at now.",
  "s0773": "Cover briefly with Spring Autumn two hundred forty two years between, sun eclipses thirty six, comet three appear, Song Xiang Gong time star falls like rain.",
  "s0774": "Son of heaven slight, feudal lords force govern, five hegemons alternate rise, change for lord fate, from this after, crowds violent few, great combine small.",
  "s0775": "Qin Chu Wu Yue, barbarian Yi, become strong hegemons.",
  "s0776": "Tian clan usurps Qi, three families divide Jin, and become warring states.",
  "s0777": "Contend at attack take, weapons armor more arise, city towns several slaughter, because with famine disease urgent bitter, minister lord together worry calamity, their examine auspicious inauspicious wait star qi especially urgent.",
  "s0778": "Recent ages twelve feudal lords seven states oppose kings, speak vertical horizontal continue heels, thus Gao Tang Gan Shi follow time affairs discuss their books transmit, thus their divine verify mixed rice salt.",
  "s0779": "Twenty eight lodges govern twelve provinces, Dipper hold combine them, where from come long.",
  "s0780": "Qin strong, wait in Tai Bai, divine at Wolf Arc.",
  "s0781": "Wu Chu strong, wait in Ying Huo, divine at Bird Heng.",
  "s0782": "Yan Qi strong, wait in Chen Xing, divine at Xu Wei.",
  "s0783": "Song Zheng strong, wait in Sui Xing, divine at Fang Xin.",
  "s0784": "Jin strong, also wait in Chen Xing, divine at Shen Fa.",
  "s0785": "And Qin combines swallows three Jin, Yan Dai, from river mountain south China.",
  "s0786": "China at four seas within then in southeast, for yang;",
  "s0787": "Yang then sun, Sui Xing, Ying Huo, Tian Xing;",
  "s0788": "Divine at street south, Bi governs it.",
  "s0789": "Its northwest then Hu Mo Yue Shi various wear felt fur draw bow people, for yin;",
  "s0790": "Yin then moon, Tai Bai, Chen Xing;",
  "s0791": "Divine at street north, Mao governs it.",
  "s0792": "Thus China mountains rivers northeast flow, its dimension, head in Long Shu, tail drowns at Bo Jie.",
  "s0793": "Thus Qin Jin good use troops, again divine Tai Bai, Tai Bai governs China;",
  "s0794": "While Hu Mo several invade plunder, alone divine Chen Xing, Chen Xing enter exit restless urgent, constantly governs barbarian Yi: its great constant.",
  "s0795": "This changes for guest host.",
  "s0796": "Ying Huo for Bo, outside then manages troops, inner then manages governance.",
  "s0797": "Thus says 'though has bright son of heaven, must observe Ying Huo where'.",
  "s0798": "Feudal lords more strong, time calamities anomalies record, no can record.",
  "s0799": "Qin Shi Huang time, fifteen years comet four appear, long eighty days, long or across heaven.",
  "s0800": "Its after Qin then with troops extinguish six kings, combine China, outer expel four barbarians, dead people like chaotic hemp, because with Zhang Chu together arise, thirty years between troops mutually tread upon, cannot win count.",
  "s0801": "From Chi You since, not tasted like this.",
  "s0802": "Xiang Yu rescues Ju Lu, Wang Shi west flows, Shan Dong then combines from feudal lords, west pits Qin people, executes slaughters Xian Yang.",
  "s0803": "Han rise, five stars gather at Dong Jing.",
  "s0804": "Ping Cheng surround, moon halo Shen Bi seven heavy.",
  "s0805": "Various Lu make chaos, sun eclipse, day dark.",
  "s0806": "Wu Chu seven states rebel contrary, comet several zhang, heaven dog passes Liang wild;",
  "s0807": "And troops arise, then hidden corpses flow blood its below.",
  "s0808": "Yuan Guang, Yuan Shou, Chi You flag again appear, long then half heaven.",
  "s0809": "Its after Jing Shi commander four out, executes barbarian Yi several decades, while attack Hu especially severe.",
  "s0810": "Yue perishes, Ying Huo guards Dou;",
  "s0811": "Chao Xian pulls, star Fu at He Shu;",
  "s0812": "Troops campaign Da Yuan, star Fu Zhao Yao: this its bright great.",
  "s0813": "If to detailed small changes, cannot win speak.",
  "s0814": "From this observe, not has not first form appear then respond follows.",
  "s0815": "Since Han for heaven numbers, stars then Tang Du, qi then Wang Shuo, divine year then Wei Xian.",
  "s0816": "Thus Gan Shi calendar five stars method, only Ying Huo has contrary reverse conduct;",
  "s0817": "Contrary conduct where guards, and other stars contrary conduct, sun moon thin eclipse, all with for divine.",
  "s0818": "I observe history record, examine conducts affairs, hundred years midst, five stars no out not contrary reverse conduct, contrary reverse conduct, often flourishing great and change color;",
  "s0819": "Sun moon thin eclipse, conduct north south has time: this its great measure.",
  "s0820": "Thus Zi Gong, Fang Xin, Quan Heng, Xian Chi, Xu Wei column lodges department stars, this heaven five official seat positions, for constant, not move transfer, great small has difference, broad narrow has constant."
}
