{
  "s0100": "Lian Cheng had younger sister in duke palace, no favor, made her spy Xiang Gong, said 'affair succeeds make girl Wu Zhi wife'.",
  "s0101": "Winter twelfth month, Xiang Gong toured Gu Fen, then hunted Pei Qiu.",
  "s0102": "Saw pig, followers said 'Peng Sheng'.",
  "s0103": "Duke angered, shot it, pig stood cried.",
  "s0104": "Duke feared, fell from carriage injured foot, lost shoe.",
  "s0105": "Returned whipped chief shoe Fu three hundred.",
  "s0106": "Fu went out palace.",
  "s0107": "Wu Zhi, Lian Cheng, Guan Zhi Fu etc. heard duke injured, then led their multitudes attacked palace.",
  "s0108": "Met chief shoe Fu, Fu said: 'Moreover do not enter alarm palace, alarm palace not easy enter.'",
  "s0109": "Wu Zhi not believed, Fu showed his wound, then believed.",
  "s0110": "Waited palace outside, ordered Fu first enter.",
  "s0111": "Fu first entered, immediately hid Xiang Gong door between.",
  "s0112": "Long time, Wu Zhi etc. feared, then entered palace.",
  "s0113": "Fu returned with palace within and duke's favored ministers attacked Wu Zhi etc., not win, all died.",
  "s0114": "Wu Zhi entered palace, sought duke not obtained.",
  "s0115": "Someone saw person feet at door between, dug looked, was Xiang Gong, then assassinated him, Wu Zhi self established as Qi lord.",
  "s0116": "Huan Gong first year spring, Qi lord Wu Zhi toured Yong Lin.",
  "s0117": "Yong Lin person once had resentment Wu Zhi, to his going tour, Yong Lin person attacked killed Wu Zhi, informed Qi grand masters: 'Wu Zhi assassinated Xiang Gong self established, minister respectfully executed punishment.",
  "s0118": "Only grand masters moreover establish gong zi should establish, only command listen.'",
  "s0119": "Qi people consulted, wished son of Xiang Gong.",
  "s0120": "Initially, Xiang Gong's drunk killed Lu Huan Gong, communicated his wife, kill punish several not proper, lewd with women, several deceived ministers, group younger brothers feared calamity reach, so second younger brother Jiu fled Lu.",
  "s0121": "His mother Lu woman.",
  "s0122": "Guan Zhong, Zhao Hu taught him.",
  "s0123": "Second younger brother Xiao Bai fled Ju, Bao Shu taught him.",
  "s0124": "Xiao Bai mother, Wei woman, favored by Xi Gong.",
  "s0125": "Xiao Bai from young good worthy grand master Gao Xi.",
  "s0126": "To Yong Lin person killed Wu Zhi, discussed establish lord, Gao, Guo first secretly summoned Xiao Bai from Ju.",
  "s0127": "Lu heard Wu Zhi died, also sent troops sent Gong Zi Jiu, made Guan Zhong separately led troops blocked Ju road, shot hit Xiao Bai belt hook.",
  "s0128": "Xiao Bai feigned dead, Guan Zhong made person galloped reported Lu.",
  "s0129": "Lu sent Jiu went increasingly slow, six days to Qi, then Xiao Bai already entered, Gao Xi established him, this was Huan Gong.",
  "s0130": "Huan Gong's hook hit, feigned dead to mislead Guan Zhong, afterward loaded warm carriage galloped went, also had Gao, Guo internal response, so got first enter establish, sent troops resisted Lu.",
  "s0131": "Autumn, with Lu battled at Qian Shi, Lu troops defeated fled, Qi troops ambushed cut Lu return road.",
  "s0132": "Qi sent Lu letter: 'Zi Jiu brothers, not bear execute, please Lu self kill him.",
  "s0133": "Zhao Hu, Guan Zhong enemies, please obtain and satiate heart mince them.",
  "s0134": "Not so, will surround Lu.'",
  "s0135": "Lu people troubled it, then killed Zi Jiu at Sheng Du.",
  "s0136": "Zhao Hu committed suicide, Guan Zhong requested prisoner.",
  "s0137": "Huan Gong's establishment, sent troops attacked Lu, heart wished kill Guan Zhong.",
  "s0138": "Bao Shu Ya said: 'Minister fortunately got follow lord, lord finally established.",
  "s0139": "Lord's honor, minister no way increase lord.",
  "s0140": "Lord will govern Qi, then Gao Xi with Shu Ya sufficient.",
  "s0141": "Lord moreover wishes hegemon king, not Guan Yi Wu cannot.",
  "s0142": "Yi Wu resided country country heavy, cannot lose.'",
  "s0143": "Therefore Huan Gong followed it.",
  "s0144": "Then feigned summon Guan Zhong wished satiate heart, actually wished use him.",
  "s0145": "Guan Zhong knew it, so requested go.",
  "s0146": "Bao Shu Ya welcomed received Guan Zhong, to Tang Fu removed fetters, purified saw Huan Gong.",
  "s0147": "Huan Gong thickly ritualed made grand master, entrusted government.",
  "s0148": "Huan Gong already obtained Guan Zhong, with Bao Shu, Xi Peng, Gao Xi repaired Qi country government, connected five families' troops, established light heavy fish salt benefits, to support poor, salary worthy able, Qi people all pleased.",
  "s0149": "Second year, attacked extinguished Tan, Tan Zi fled Ju."
}
