{
  "s0001": {
    "literal": "Yan Shigu said: 'It only ranks ancient people and does not include contemporary people because the book was not finished.'",
    "idiomatic": "Yan Shigu said: 'The book only ranks ancient people and does not include contemporary figures because it was not completed.'"
  },
  "s0002": {
    "literal": "",
    "idiomatic": ""
  },
  "s0003": {
    "literal": "From the creation of writing, the early people who can be heard of, as the classics and traditions call them, from Tang and Yu upward, the emperors and kings have posthumous names.",
    "idiomatic": "From the invention of writing, the earliest people we can know about—as mentioned in the classics and transmitted records—from the time of Yao and Shun and earlier, emperors and kings had posthumous names."
  },
  "s0004": {
    "literal": "Their assistants cannot be named, but the various philosophers speak of them somewhat, although they do not examine according to Confucius, yet they are still recorded in writings, aiming to praise good and expose evil, to admonish and warn later generations, therefore I broadly collect them.",
    "idiomatic": "Their ministers and advisors cannot be specifically named, but the various philosophical schools discuss them to some extent. Though they don't follow Confucius's evaluations, these accounts are still preserved in the writings, serving to praise virtue and expose vice, to admonish and warn future generations. Therefore, I have gathered them broadly."
  },
  "s0005": {
    "literal": "Confucius said: 'As for sagehood and benevolence, how would I dare claim them?'",
    "idiomatic": "Confucius said: 'As for sagehood and benevolence, how would I dare claim such things?'"
  },
  "s0006": {
    "literal": "He also said: 'What is there to do with benevolence? Sagehood must be the highest!'",
    "idiomatic": "He also said: 'What is the point of mere benevolence? Sagehood must be the ultimate goal!'"
  },
  "s0007": {
    "literal": "'If one does not know, how can one be benevolent?'",
    "idiomatic": "'If someone lacks knowledge, how can they be benevolent?'"
  },
  "s0008": {
    "literal": "'Those who are born with knowledge are the highest;",
    "idiomatic": "'Those who are born with innate knowledge are the highest type;"
  },
  "s0009": {
    "literal": "those who learn and attain it are next;",
    "idiomatic": "those who study and achieve it are next;"
  },
  "s0010": {
    "literal": "those who learn despite difficulties and attain it are again next;",
    "idiomatic": "those who struggle to learn and achieve it are next after that;"
  },
  "s0011": {
    "literal": "the common people who do not learn are the lowest.'",
    "idiomatic": "and the common people who never learn are the lowest.'"
  },
  "s0012": {
    "literal": "'I cannot hope to see a sage; to see a gentleman would be enough.'",
    "idiomatic": "'A sage I cannot hope to see; to see a gentleman would be sufficient.'"
  },
  "s0013": {
    "literal": "'It is only in the depth of winter that one knows the pine and cypress are the last to lose their leaves.'",
    "idiomatic": "'It is only in the depth of winter that one knows the pine and cypress are the last to lose their leaves.'"
  },
  "s0014": {
    "literal": "'A person of resolve and benevolence does not preserve life at the expense of benevolence, but rather sacrifices life to achieve benevolence.'",
    "idiomatic": "'A person of resolve and benevolence does not preserve life at the expense of benevolence, but rather sacrifices life to achieve benevolence.'"
  },
  "s0015": {
    "literal": "'If I hear the Way in the morning, I can die in the evening with no regrets.'",
    "idiomatic": "'If I hear the Way in the morning, I can die in the evening with no regrets.'"
  }
}
