{
  "s0148": "Summer, Ling Gong died, wife ordered Zi Ying as crown prince, said: 'This Ling Gong command.'",
  "s0149": "Ying said: 'Fled person crown prince Kuai Ting's son Zhe present, not dare receive.'",
  "s0150": "Then Wei established Zhe as lord, this was Chu Gong.",
  "s0151": "Sixth month Yi You, Zhao Jian Zi wished enter Kuai Ting, then ordered Yang Hu cheated ordered Wei over ten people mourning clothes returned, Jian Zi sent Kuai Ting.",
  "s0152": "Wei people heard it, sent troops attacked Kuai Ting.",
  "s0153": "Kuai Ting not able enter, entered Su protected, Wei people also stopped troops.",
  "s0154": "Chu Gong Zhe fourth year, Qi Tian Qi assassinated their lord Ru Zi.",
  "s0155": "Eighth year, Qi Bao Zi assassinated their lord Dao Gong.",
  "s0156": "Kong Qiu from Chen entered Wei.",
  "s0157": "Ninth year, Kong Wen Zi asked troops about Zhong Ni, Zhong Ni not answered.",
  "s0158": "After Ru welcomed Zhong Ni, Zhong Ni returned Ru.",
  "s0159": "Twelfth year, initially, Kong Yu Wen Zi took crown prince Kuai Ting's elder sister, gave birth Kui.",
  "s0160": "Kong family's servant Hun Liang Fu beautiful good, Kong Wen Zi died, Liang Fu communicated with Kui mother.",
  "s0161": "Crown prince in Su, Kui mother sent Liang Fu to crown prince.",
  "s0162": "Crown prince with Liang Fu spoke said: 'If able enter my country, report you with chariot canopy, exempt you three deaths, nothing not give.'",
  "s0163": "Allied with him, permitted with Kui mother as wife.",
  "s0164": "Leap month, Liang Fu with crown prince entered, resided Kong family outer garden.",
  "s0165": "Dusk, two people covered clothes rode, eunuch Luo drove, went to Kong family.",
  "s0166": "Kong family's elder Luan Ning asked them, called relative concubine informed.",
  "s0167": "Then entered, went to Bo Ji Shi.",
  "s0168": "Already ate, Kui mother held spear first, crown prince with five people armored, carried Kui followed.",
  "s0169": "Bo Ji kidnapped Kui at toilet, strongly allied him, then kidnapped ascended tower.",
  "s0170": "Luan Ning about drink wine, roast not ripe, heard disorder, sent informed Zhong You.",
  "s0171": "Summoned guard harnessed carriage, walked rank drank roast, served Chu Gong Zhe fled Ru.",
  "s0172": "Zhong You about enter, met Zi Gao about exit, said: 'Gate already closed.'",
  "s0173": "Zi Lu said: 'I moreover go.'",
  "s0174": "Zi Gao said: 'Not reach, not step their difficulty.'",
  "s0175": "Zi Lu said: 'Eat then not avoid their difficulty.'",
  "s0176": "Zi Gao then exited.",
  "s0177": "Zi Lu entered, to gate, Gong Sun Gan closed gate, said: 'Do not enter for it!'",
  "s0178": "Zi Lu said: 'Is Gong Sun?",
  "s0179": "Seek profit escape their difficulty.",
  "s0180": "You not so, profit their salary, must save their calamity.'",
  "s0181": "Had envoy exited, Zi Lu then able entered.",
  "s0182": "Said: 'Crown prince where use Kong Kui?",
  "s0183": "Though kill him, must someone continue.'",
  "s0184": "Moreover said: 'Crown prince no courage.",
  "s0185": "If burn tower, must release Kong Shu.'",
  "s0186": "Crown prince heard it, feared, descended Shi Qi, Yu Xian attacked Zi Lu, with spear hit him, cut tassel.",
  "s0187": "Zi Lu said: 'Gentleman die, hat not remove.'",
  "s0188": "Tied tassel died.",
  "s0189": "Kong Qiu heard Wei disorder, said: 'Alas!",
  "s0190": "Chai then come?",
  "s0191": "You then die.'",
  "s0192": "Kong Kui finally established crown prince Kuai Ting, this was Zhuang Gong.",
  "s0193": "Zhuang Gong Kuai Ting, Chu Gong father, resided outside, resented grand masters none welcomed established.",
  "s0194": "First year ascended position, wished completely execute ministers, said: 'I resided outside long, you also once heard it?'",
  "s0195": "Group ministers wished make disorder, then stopped.",
  "s0196": "Second year, Ru Kong Qiu died.",
  "s0197": "Third year, Zhuang Gong ascended city, saw Rong Zhou.",
  "s0198": "Said: 'Rong captive why like this?'",
  "s0199": "Rong Zhou ill it.",
  "s0200": "Tenth month, Rong Zhou informed Zhao Jian Zi, Jian Zi surrounded Wei.",
  "s0201": "Eleventh month, Zhuang Gong went fleeing, Wei people established gong zi Ban Shi as Wei lord.",
  "s0202": "Qi attacked Wei, captured Ban Shi, moreover established gong zi Qi as Wei lord.",
  "s0203": "Wei lord Qi first year, Wei Shi Man Quan drove their lord Qi, Qi fled Qi.",
  "s0204": "Wei Chu Gong Zhe from Qi again returned established.",
  "s0205": "Initially, Chu Gong established twelve years fled, fled outside four years re-entered.",
  "s0206": "Chu Gong after first year, rewarded followed fled people.",
  "s0207": "Established twenty-one years died, Chu Gong younger uncle Qian attacked Chu Gong son self established, this was Dao Gong.",
  "s0208": "Dao Gong fifth year died, son Jing Gong Fu established.",
  "s0209": "Jing Gong nineteenth year died, son Zhao Gong Jiu established.",
  "s0210": "At time three Jin strong, Wei like small hou, belonged to them.",
  "s0211": "Zhao Gong sixth year, gong zi Wei assassinated him replaced established, this was Huai Gong.",
  "s0212": "Huai Gong eleventh year, gong zi Ji assassinated Huai Gong replaced established, this was Shen Gong.",
  "s0213": "Shen Gong father, gong zi Kuo;",
  "s0214": "Kuo father, Jing Gong.",
  "s0215": "Shen Gong forty-second year died, son Sheng Gong Xun established.",
  "s0216": "Sheng Gong eleventh year died, son Cheng Hou Su established.",
  "s0217": "Cheng Hou eleventh year, Gong Sun Yang entered Qin.",
  "s0218": "Sixteenth year, Wei moreover reduced title called hou.",
  "s0219": "Twenty-ninth year, Cheng Hou died, son Ping Hou established.",
  "s0220": "Ping Hou eighth year died, son Si Jun established.",
  "s0221": "Si Jun fifth year, moreover reduced title called jun, alone had Pu Yang.",
  "s0222": "Forty-second year died, son Huai Jun established.",
  "s0223": "Huai Jun thirty-first year, courted Wei, Wei imprisoned killed Huai Jun.",
  "s0224": "Wei moreover established Si Jun younger brother, this was Yuan Jun.",
  "s0225": "Yuan Jun for Wei son-in-law, so Wei established him.",
  "s0226": "Yuan Jun fourteenth year, Qin captured Wei eastern land, Qin initially established Dong commandery, moreover moved Wei Ye Wang county, united Pu Yang as Dong commandery.",
  "s0227": "Twenty-fifth year, Yuan Jun died, son Jun Jiao established.",
  "s0228": "Jun Jiao ninth year, Qin united world, established as Shi Huang Di.",
  "s0229": "Twenty-first year, Er Shi abolished Jun Jiao as commoner, Wei cut off sacrifices.",
  "s0230": "Grand Historian said: I read genealogy words, to Xuan Gong crown prince with wife seen executed, younger brother Shou contended died mutually yielded, this with Jin crown prince Shen Sheng not dare clear Li Ji excess same, both hated hurt father intention.",
  "s0231": "But finally died perished, what sad!",
  "s0232": "Or father son mutually killed, elder younger brothers mutually extinguished, also alone what?"
}
