{
  "s0422": "Broad calm, soft correct suitable sing song;",
  "s0423": "Vast calm, open penetrating trustworthy suitable sing great ya;",
  "s0424": "Respectful frugal love ritual suitable sing small ya;",
  "s0425": "Upright pure humble suitable sing wind;",
  "s0426": "Unrestrained straight benevolent loving suitable sing shang;",
  "s0427": "Warm good able decide suitable sing qi.",
  "s0428": "Song, straight self display virtue;",
  "s0429": "Move self heaven earth respond, four seasons harmonize, stars ordered, ten thousand things nurture.",
  "s0430": "Thus shang, five emperors' remaining sound, Shang people recorded it, thus called shang;",
  "s0431": "Qi, three dynasties' remaining sound, Qi people recorded it, thus called qi.",
  "s0432": "Clear shang poems, face affairs repeatedly decide;",
  "s0433": "Clear qi poems, see benefit yield.",
  "s0434": "Face affairs repeatedly decide, brave;",
  "s0435": "See benefit yield, righteous.",
  "s0436": "Have brave have righteous, not song who can preserve this?",
  "s0437": "Thus song as words, up like resist, down like troop, curved like break, stop like withered wood, reside middle square, phrase middle hook, continuous like abundant string pearls.",
  "s0438": "Thus song as words, long speak it.",
  "s0439": "Delight, thus speak;",
  "s0440": "Speak insufficient, thus long speak;",
  "s0441": "Long speak insufficient, thus sigh lament;",
  "s0442": "Sigh lament insufficient, thus not know hand dance foot tread.'",
  "s0443": "Zi Gong asked music.",
  "s0444": "All sound from human heart, heaven people have connect, like shadow image shape, echo respond sound.",
  "s0445": "Thus do good heaven repays blessing, do evil heaven gives calamity, natural.",
  "s0446": "Thus Shun played five string qin, sang southern wind poem world governed;",
  "s0447": "Zhou made zhao ge northern rustic sound, body died state perished.",
  "s0448": "Shun's way how broad?",
  "s0449": "Zhou's way how narrow?",
  "s0450": "Southern wind poem growing sound, Shun joy liked it, joy with heaven earth same intent, got ten thousand states happy hearts, thus world governed.",
  "s0451": "Zhao ge untimely, northern defeated, rustic vulgar, Zhou joy liked it, with ten thousand states different hearts, feudal lords not attach, hundred families not close, world rebelled, thus body died state perished.",
  "s0452": "Wei Ling Gong time, going Jin, reached Pu water above rested.",
  "s0453": "Night half heard drum qin sound, asked left right, all answered 'not heard'.",
  "s0454": "Then summoned Shi Juan said: 'I heard drum qin sound, asked left right, all not heard.",
  "s0455": "Its appearance like ghost spirit, for me listen write it.'",
  "s0456": "Shi Juan said: 'Yes.'",
  "s0457": "Thus upright sit drew qin, listened wrote it.",
  "s0458": "Next day, said: 'Minister got it, but not practiced, please night practice it.'",
  "s0459": "Ling Gong said: 'Can.'",
  "s0460": "Thus again night.",
  "s0461": "Next day, reported: 'Practiced.'",
  "s0462": "Then went Jin, saw Jin Ping Gong.",
  "s0463": "Ping Gong set wine at Shi Hui terrace.",
  "s0464": "Wine drunk, Ling Gong said: 'Now come, heard new sound, please play it.'",
  "s0465": "Ping Gong said: 'Can.'",
  "s0466": "Then commanded Shi Juan sit Shi Kuang beside, drew qin drummed it.",
  "s0467": "Not finished, Shi Kuang stroked stopped it said: 'This perished state sound, cannot continue.'",
  "s0468": "Ping Gong said: 'How know?'",
  "s0469": "Shi Kuang said: 'Shi Yan made it.",
  "s0470": "With Zhou made mi mi music, Wu Wang attacked Zhou, Shi Yan east fled, self threw Pu water midst, thus hear this sound must at Pu water above, first hear this sound state reduced.'",
  "s0471": "Ping Gong said: 'I like sound, wish continue hear it.'"
}
