{
  "s0021": {
    "chinese": "公劉雖在戎狄之間，復修后稷之業，務耕種，行地宜，自漆、沮度渭，取材用，行者有資，居者有畜積，民賴其慶。",
    "literal": "Although Gong Liu was among the Rong and Di barbarians, he revived Houji's work, devoted himself to farming and planting, practiced what was suitable for the land, from Qi and Ju crossed the Wei, took timber for use, travelers had provisions, residents had stores, the people relied on his good fortune.",
    "idiomatic": "Although Gong Liu lived among the Rong and Di barbarians, he revived the work of Houji. He devoted himself to farming and planting, practiced what was suitable for the land, crossed the Wei River from Qi and Ju, gathered timber for use. Travelers had provisions, residents had stores - the people relied on his blessings."
  },
  "s0022": {
    "chinese": "百姓懷之，多徙而保歸焉。",
    "literal": "The common people cherished him, many migrated and sought protection in returning to him.",
    "idiomatic": "The common people cherished him; many migrated and sought refuge by returning to him."
  },
  "s0023": {
    "chinese": "周道之興自此始，故詩人歌樂思其德。",
    "literal": "The rise of the Zhou way began from this, therefore poets sang and delighted in thinking of his virtue.",
    "idiomatic": "The rise of Zhou civilization began from this, which is why poets sang joyfully, thinking of his virtue."
  },
  "s0024": {
    "chinese": "公劉卒，子慶節立，國於豳。",
    "literal": "Gong Liu died, his son Qing Jie ascended, established the state at Bin.",
    "idiomatic": "Gong Liu died, and his son Qing Jie succeeded him, establishing the state at Bin."
  },
  "s0025": {
    "chinese": "慶節卒，子皇仆立。",
    "literal": "Qing Jie died, his son Huang Pu ascended.",
    "idiomatic": "Qing Jie died, and his son Huang Pu succeeded him."
  },
  "s0026": {
    "chinese": "皇仆卒，子差弗立。",
    "literal": "Huang Pu died, his son Cha Fu ascended.",
    "idiomatic": "Huang Pu died, and his son Cha Fu succeeded him."
  },
  "s0027": {
    "chinese": "差弗卒，子毀隃立。",
    "literal": "Cha Fu died, his son Hou Zhu ascended.",
    "idiomatic": "Cha Fu died, and his son Hou Zhu succeeded him."
  },
  "s0028": {
    "chinese": "毀隃卒，子公非立。",
    "literal": "Hou Zhu died, his son Gong Bo ascended.",
    "idiomatic": "Hou Zhu died, and his son Gong Bo succeeded him."
  },
  "s0029": {
    "chinese": "公非卒，子高圉立。",
    "literal": "Gong Bo died, his son Tai Wang ascended.",
    "idiomatic": "Gong Bo died, and his son Tai Wang succeeded him."
  },
  "s0030": {
    "chinese": "高圉卒，子亞圉立。",
    "literal": "Tai Wang had sons Tai Bo, Yu Zhong, and Ji Li.",
    "idiomatic": "Tai Wang died, and his son Ya Yu succeeded him."
  },
  "s0031": {
    "chinese": "亞圉卒，子公叔祖類立。",
    "literal": "Ya Yu died, his son Gong Shu Zu Lei ascended.",
    "idiomatic": "Ya Yu died, and his son Gong Shu Zu Lei succeeded him."
  },
  "s0032": {
    "chinese": "公叔祖類卒，子古公亶父立。",
    "literal": "Gong Shu Zu Lei died, his son Gu Gong Dan Fu ascended.",
    "idiomatic": "Gong Shu Zu Lei died, and his son Gu Gong Dan Fu succeeded him."
  },
  "s0033": {
    "chinese": "古公亶父復修后稷、公劉之業，積德行義，國人皆戴之。",
    "literal": "Gu Gong Dan Fu revived the work of Houji and Gong Liu, accumulated virtue and practiced righteousness, all the people of the state revered him.",
    "idiomatic": "Gu Gong Dan Fu revived the work of Houji and Gong Liu, accumulated virtue and practiced righteousness - all the people of the state revered him."
  },
  "s0034": {
    "chinese": "薰育戎狄攻之，欲得財物，予之。",
    "literal": "The Xun Yu Rong and Di attacked him, desiring to obtain wealth and goods, he gave them to them.",
    "idiomatic": "The Xunyu Rong and Di barbarians attacked him, desiring wealth and goods, so he gave them what they wanted."
  },
  "s0035": {
    "chinese": "已復攻，欲得地與民。",
    "literal": "Afterward they attacked again, desiring to obtain land and people.",
    "idiomatic": "Afterward they attacked again, desiring to obtain land and people."
  },
  "s0036": {
    "chinese": "民皆怒，欲戰。",
    "literal": "The people were all angry and wished to fight.",
    "idiomatic": "The people were all furious and wished to fight."
  },
  "s0037": {
    "chinese": "古公曰：「有民立君，將以利之。",
    "literal": "Gu Gong said: 'The ruler's way is to benefit the people. Though I die, why begrudge it? I will not fight.'",
    "idiomatic": "Gu Gong said: 'A ruler is established to benefit the people."
  },
  "s0038": {
    "chinese": "今戎狄所為攻戰，以吾地與民。",
    "literal": "He prepared to move. The people all wished to follow the ruler.",
    "idiomatic": "Now the Rong and Di barbarians attack and fight to take our land and people."
  },
  "s0039": {
    "chinese": "民之在我，與其在彼，何異。",
    "literal": "Gu Gong said: 'Those who reveal my plans will die.'",
    "idiomatic": "What difference does it make whether the people are with me or with them?"
  },
  "s0040": {
    "chinese": "民欲以我故戰，殺人父子而君之，予不忍為。」",
    "literal": "He secretly ordered his sons: 'When I leave, you must follow me quickly.'",
    "idiomatic": "The people wish to fight on my account, killing fathers and sons to make me their ruler - I cannot bear to do this.'" 
}
}
