{
  "s431": "Two. Year 3 BCE, Marquis Jian rebelled, state abolished.",
  "s433": "Forty-four",
  "s434": "Qi.",
  "s435": "As shield bearer Han King year 3 initially followed from Jinyang, as lian'ao attacked Xiang Ji, Han King defeated and fled, He as detachment general attacked Chu, pursuing cavalry therefore could not advance. Han King looked back and told He: 'You stay at Pengcheng, use holder of jade tablet to attack east against Yu, urgently cut off his nearby walls.' Became marquis, 1,400 households.",
  "s436": "Seven. Year 6 month 6 Ding Hai day, Marquis Gu Zeng He year 1.",
  "s437": "Seven",
  "s438": "Eight",
  "s439": "Eleven. Twelve. Year 12, Marquis Qing Hu year 1.",
  "s440": "Five. Eleven. Year 6, Marquis Tuo year 1.",
  "s441": "Eight. Yuanguang year 2, Marquis Tuo convicted of following shooting arbitrarily dismissed, disrespectful, state abolished.",
  "s442": "Fifty-one",
  "s443": "Ping.",
  "s444": "Troops initially rose, as retainer followed attacking Qin, as palace attendant entered Han, as general pacified various lords, guarded Luoyang, meritorious service led to marquisate, comparable to Marquis of Fei He, 1,300 households.",
  "s445": "Six. Year 6 month 6 Ding Hai day, Marquis Dao Pei Jia year 1. One. Year 12, Marquis Jing Nu year 1.",
  "s446": "Seven",
  "s447": "Eight",
  "s448": "Fifteen. Eight. Year 16, Marquis Zhi year 1.",
  "s449": "Eleven. Zhong year 5, Marquis Zhi committed crime, state abolished.",
  "s451": "Thirty-two",
  "s452": "Lu.",
  "s453": "As retainer followed uprising in Pei, to Xianyang became palace attendant, entered Han, as general followed pacifying various lords, became marquis, 4,800 households, meritorious service comparable to Marquis of Wuyang. Died in service, mother became marquis.",
  "s454": "Seven. Year 6 middle, Mother Marquis Ci year 1.",
  "s455": "Seven",
  "s456": "Four. Year 5, Mother Marquis Ci died, no heir, state abolished.",
  "s460": "Seven",
  "s461": "Gucheng.",
  "s462": "Troops initially rose, as ye zhe followed, entered Han, as general attacked various lords, as Right Chancellor prepared defense of Huaiyang with merit, comparable to Marquis of Yanxi, 2,000 households.",
  "s463": "Seven. Year 6 middle, Marquis Zhuang Yin Hui year 1.",
  "s464": "Two. Five. Year 3, Marquis Kai Fang year 1.",
  "s465": "Two. Year 3, Marquis Fang deprived of marquisate, became Guan Nei Hou.",
  "s469": "Twenty-six",
  "s470": "Ren.",
  "s471": "As cavalry commandery captain Han year 5 followed uprising in Dongyuan, attacked Yan, Dai, attached to Yong Chi, had merit, became marquis. Became chariot cavalry general.",
  "s472": "Seven. Year 6, Marquis Zhang Yue year 1.",
  "s473": "Seven",
  "s474": "Two. Year 3, Marquis Yue convicted of concealing death penalty crime, dismissed to commoner, state abolished.",
  "s479": "Jiqiu.",
  "s480": "As shield detachment scribe year 1 BCE followed uprising in Dang, broke Qin, as Superintendent of Grains entered Han, as Shang commandery governor attacked and pacified Western Wei territory, meritorious service led to marquisate.",
  "s481": "Seven. Year 6, Marquis Xiang year 1.",
  "s482": "Seven",
  "s483": "Four. Year 4, Marquis Xiang stripped of marquisate, became common soldier, state abolished.",
  "s488": "Aling.",
  "s489": "As lian'ao year 1 BCE followed uprising in Shanfu, as Sai Shu entered Han.",
  "s490": "Seven. Year 6 month 7 Geng Yin day, Marquis Qing Guo Ting year 1.",
  "s491": "Seven",
  "s492": "Eight",
  "s493": "Two. Twenty-one. Year 3, Marquis Hui Ou year 1.",
  "s494": "Eighteen. Year 2 BCE, Marquis Sheng Ke year 1. Committed crime, extinct. Nan four. Zhong year 6, Marquis Jing Yan Ju year 1.",
  "s495": "Eleven. Yuanguang year 6, Marquis Ze year 1. Seventeen. Yuanding year 5, Marquis Ze convicted of tribute gold, state abolished.",
  "s496": "Twenty-seven"
}
