{
  "s26": "Second year of the Second Emperor.",
  "s36": "Seventh month.",
  "s37": "Chu Yin Wang Chen Sheng rose in rebellion and entered Qin.",
  "s46": "Eighth month.",
  "s47": "Second. Ge Ying toured Jiujiang for Chen Sheng and established Xiang Qiang as Chu king.",
  "s49": "Wu Chen first arrived at Handan, established himself as Zhao king, beginning.",
  "s56": "Ninth month. Chu troops arrived at Xi.",
  "s57": "Third. Zhou Wen's troops arrived at Xi and were defeated. Ge Ying heard that Chen Sheng had become king and immediately killed Qiang.",
  "s58": "Xiang Liang was titled Wu Xin Jun.",
  "s59": "Second.",
  "s60": "Qi King Tian Dan beginning. Dan was a Di tribesman. The various Tian clan honored Qiang. Younger brother Rong, Rong's younger brother Heng.",
  "s61": "Pei Gong first rose in rebellion.",
  "s62": "Han Guang campaigned for Zhao, reaching Ji, established himself as Yan king, beginning.",
  "s63": "Wei King Jiu beginning. Jiu was in Chen and could not return to his state.",
  "s66": "Second year, tenth month.",
  "s67": "Fourth. Executed Ge Ying.",
  "s68": "Second.",
  "s69": "Third.",
  "s70": "Second. Dan rose in rebellion, killed the Di magistrate, and proclaimed himself king.",
  "s71": "Second. Attacked Hu Ling and Fang Yu, defeated Qin army supervisors.",
  "s72": "Second.",
  "s73": "Second.",
  "s76": "Eleventh month.",
  "s77": "Fifth. Zhou Wen died.",
  "s78": "Third.",
  "s79": "Fourth. Li Liang killed Wu Chen, Zhang Er and Chen Yu fled.",
  "s80": "Third.",
  "s81": "Third. Killed the Si Shui magistrate. Took Xishuai. Zhou Shi campaigned east between Feng and Pei.",
  "s82": "Third.",
  "s83": "Third. Qi and Zhao jointly established Zhou Shi, but Shi refused, saying 'We must establish Wei Jiu'.",
  "s86": "Twelfth month.",
  "s87": "Sixth. Chen Sheng died.",
  "s88": "Fourth.",
  "s90": "Fourth.",
  "s91": "Fourth. Yong Chi rebelled against Pei Gong, surrendered Feng to Wei. Pei Gong returned to attack Feng but could not take it.",
  "s92": "Fourth.",
  "s93": "Fourth. Jiu returned from Chen and was established.",
  "s96": "First month.",
  "s97": "Chu King Jing Ke beginning, Qin Jia established him.",
  "s98": "Fifth. Chen Sheng's general Zhao Ping falsely appointed Xiang Liang as Chu Zhu Guo and urgently attacked west against Qin.",
  "s99": "Zhao King Xie beginning, Zhang Er and Chen Yu established him.",
  "s100": "Fifth. Reprimanded Jing Ke for presumptuously becoming king without consulting us.",
  "s101": "Fifth. Pei Gong heard Jing Ke was king in Liu, went to join him, and together attacked Qin troops west of Dang.",
  "s102": "Fifth.",
  "s103": "Fifth. Zhang Han had defeated Chen Sheng and besieged Jiu at Lin Ji.",
  "s106": "Second month.",
  "s107": "Second. Jia became supreme general.",
  "s108": "Sixth. Liang crossed the Jiang, Chen Ying and Qing Bu all joined him.",
  "s109": "Second."
}
