{
  "s0050": "Mu Hou with his younger sister as Qi Huan Gong wife.",
  "s0051": "Eighteenth year, Qi Huan Gong with Cai woman played in boat, wife rocked boat, Huan Gong stopped her, not stopped, duke angered, returned Cai woman not cut off.",
  "s0052": "Cai Hou angered, married off his younger brother.",
  "s0053": "Qi Huan Gong angered, attacked Cai;",
  "s0054": "Cai collapsed, then captured Mu Hou, south to Chu Shao Ling.",
  "s0055": "Already then feudal lords for Cai apologized Qi, Qi Hou returned Cai Hou.",
  "s0056": "Twenty-nine years, Mu Hou died, son Zhuang Hou Jia Wu established.",
  "s0057": "Zhuang Hou third year, Qi Huan Gong died.",
  "s0058": "Fourteenth year, Jin Wen Gong defeated Chu at Cheng Pu.",
  "s0059": "Twentieth year, Chu crown prince Shang Chen assassinated his father Cheng Wang replaced established.",
  "s0060": "Twenty-fifth year, Qin Mu Gong died.",
  "s0061": "Thirty-third year, Chu Zhuang Wang ascended position.",
  "s0062": "Thirty-fourth year, Zhuang Hou died, son Wen Hou Shen established.",
  "s0063": "Wen Hou fourteenth year, Chu Zhuang Wang attacked Chen, killed Xia Zheng Shu.",
  "s0064": "Fifteenth year, Chu surrounded Zheng, Zheng surrendered Chu, Chu again released it.",
  "s0065": "Twentieth year, Wen Hou died, son Jing Hou Gu established.",
  "s0066": "Jing Hou first year, Chu Zhuang Wang died.",
  "s0067": "Forty-ninth year, Jing Hou for crown prince Ban married wife at Chu, Jing Hou communicated her.",
  "s0068": "Crown prince assassinated Jing Hou self established, this was Ling Hou.",
  "s0069": "Ling Hou second year, Chu gong zi Wei assassinated his wang Jia Ao self established, became Ling Wang.",
  "s0070": "Ninth year, Chen Si Tu Zhao assassinated his lord Ai Gong.",
  "s0071": "Chu made gong zi Qi Ji extinguished Chen had it.",
  "s0072": "Twelfth year, Chu Ling Wang because Ling Hou assassinated his father, lured Cai Ling Hou at Shen, hid armor feasted him, intoxicated killed him, punished his soldiers seventy people.",
  "s0073": "Ordered gong zi Qi Ji surrounded Cai.",
  "s0074": "Eleventh month, extinguished Cai, made Qi Ji as Cai Gong.",
  "s0075": "Chu extinguished Cai three years, Chu gong zi Qi Ji assassinated his lord Ling Wang replaced established, became Ping Wang.",
  "s0076": "Ping Wang then sought Cai Jing Hou youngest son Lu, established him, this was Ping Hou.",
  "s0077": "This year, Chu also again established Chen.",
  "s0078": "Chu Ping Wang initially established, wished close feudal lords, so again established Chen, Cai successors.",
  "s0079": "Ping Hou nine years died, Ling Hou Ban's grandson Dong Guo attacked Ping Hou son self established, this was Dao Hou.",
  "s0080": "Dao Hou father called Yin crown prince You.",
  "s0081": "Yin crown prince You, Ling Hou crown prince, Ping Hou established killed Yin crown prince, so Ping Hou died Yin crown prince son Dong Guo attacked Ping Hou son replaced established, this was Dao Hou.",
  "s0082": "Dao Hou third year died, younger brother Zhao Hou Shen established.",
  "s0083": "Zhao Hou tenth year, court Chu Zhao Wang, held beautiful fur two, offered its one to Zhao Wang self wore its one.",
  "s0084": "Chu chancellor Zi Chang desired it, not gave.",
  "s0085": "Zi Chang slandered Cai Hou, detained him Chu three years.",
  "s0086": "Cai Hou knew it, then offered his fur to Zi Chang;",
  "s0087": "Zi Chang received it, then spoke returned Cai Hou.",
  "s0088": "Cai Hou returned went to Jin, requested with Jin attacked Chu.",
  "s0089": "Thirteenth year spring, with Wei Ling Gong assembled Shao Ling.",
  "s0090": "Cai Hou privately with Zhou Zhang Hong sought seniority over Wei;",
  "s0091": "Wei made shi spoke Kang Shu merit virtue, then senior Wei.",
  "s0092": "Summer, for Jin extinguished Shen, Chu angered, attacked Cai.",
  "s0093": "Cai Zhao Hou made his son hostage at Wu, to together attacked Chu.",
  "s0094": "Winter, with Wu Wang He Lu then broke Chu entered Ying.",
  "s0095": "Cai resented Zi Chang, Zi Chang feared, fled Zheng.",
  "s0096": "Fourteenth year, Wu left Chu Zhao Wang restored country.",
  "s0097": "Sixteenth year, Chu Ling Yin for his people cried to plot Cai, Cai Zhao Hou feared.",
  "s0098": "Twenty-sixth year, Kong Qiu went to Cai."
}
