{
  "s0001": "King Goujian of Yue was a descendant of Yu the Great, and an illegitimate son of Emperor Shao Kang of the Xia dynasty.",
  "s0002": "He was enfeoffed at Kuaiji to maintain the sacrifices to Yu.",
  "s0003": "His people tattooed their bodies and cut their hair, dwelling among the weeds and grass in their settlement.",
  "s0004": "After more than twenty generations, it came to Yun Chang.",
  "s0005": "During Yun Chang's time, he fought with King He L端 of Wu and they resented each other, attacking back and forth.",
  "s0006": "Yun Chang died, and his son Goujian succeeded him, becoming King of Yue.",
  "s0007": "In his first year, King He L端 of Wu heard that Yun Chang had died, so he raised troops to attack Yue.",
  "s0008": "King Goujian of Yue sent suicide troops to challenge them. They advanced in three rows to the Wu battle line, shouting as they slit their own throats.",
  "s0009": "The Wu army watched this spectacle, and Yue took advantage to attack the Wu forces, defeating them at Gan Li and wounding King He L端 with arrows.",
  "s0010": "He L端 was about to die and told his son Fu Chai: 'You must never forget Yue.'",
  "s0012": "In the third year, Goujian heard that King Fu Chai of Wu was training his troops day and night, intending to avenge himself on Yue. Yue wanted to strike first before Wu could mobilize.",
  "s0013": "Fan Li advised: 'This cannot be done.",
  "s0014": "I have heard that weapons are instruments of ill omen, warfare goes against virtue, and contention is the lowest of affairs.",
  "s0015": "To scheme in secret, go against virtue, and delight in using instruments of ill omen, testing oneself in the lowest affairs - Heaven forbids this, and those who proceed will not prosper.'",
  "s0016": "The Yue king said: 'I have already decided.'",
  "s0017": "He raised troops.",
  "s0018": "The Wu king heard this and sent all his elite troops to attack Yue, defeating them at Fu Jiao.",
  "s0019": "The Yue king then took his remaining five thousand troops to defend Mount Kuaiji.",
  "s0020": "The Wu king pursued and besieged them.",
  "s0021": "The Yue king said to Fan Li: 'Because I did not listen to you, we have come to this. What should we do?'",
  "s0022": "Li replied: 'Those who hold fullness ally with Heaven, those who right the overturned ally with men, those who manage affairs ally with the earth.",
  "s0023": "Send humble words and generous gifts to them. If they do not agree, then offer yourself and your family as servants.'",
  "s0024": "Goujian said: 'Agreed.'",
  "s0025": "He ordered the grand master Wen Zhong to negotiate peace with Wu, crawling on his knees and knocking his head on the ground, saying: 'Your servant Goujian, the fugitive king, sends his humble servant Wen Zhong to dare inform your attendants: Goujian requests to become your servant, and his wife to become your concubine.'",
  "s0026": "The Wu king was about to agree.",
  "s0027": "Wu Zixu spoke to the Wu king: 'Heaven has given Yue to Wu - do not agree.'",
  "s0028": "Wen Zhong returned and reported to Goujian.",
  "s0029": "Goujian wanted to kill his wife and children, burn his treasures, and fight to the death.",
  "s0030": "Wen Zhong stopped Goujian, saying: 'The Wu prime minister Pi is greedy and can be tempted with profit. Let me secretly go and speak to him.'",
  "s0031": "Thus Goujian sent beautiful women and precious treasures through Wen Zhong to secretly offer to Prime Minister Pi of Wu.",
  "s0032": "Pi accepted them, then introduced Wen Zhong to the Wu king.",
  "s0033": "Wen Zhong knocked his head on the ground and said: 'I hope the Great King will pardon Goujian's crimes and accept all his precious treasures.",
  "s0034": "If unfortunately you do not pardon him, Goujian will kill all his wife and children, burn his precious treasures, and with his five thousand men fight to the death - surely some will strike their mark.'",
  "s0035": "Pi then persuaded the Wu king: 'Yue has submitted to become servants. If you pardon them, it will be advantageous to the state.'",
  "s0036": "The Wu king was about to agree.",
  "s0037": "Wu Zixu remonstrated: 'If we do not destroy Yue now, we will surely regret it later.",
  "s0038": "Goujian is a worthy ruler, Wen Zhong and Fan Li are capable ministers. If they return to their country, they will cause trouble.'",
  "s0039": "The Wu king did not listen and finally pardoned Yue, withdrawing his troops and returning.",
  "s0040": "When Goujian was trapped at Kuaiji, he sighed deeply: 'Will I end here?'",
  "s0041": "Wen Zhong said: 'Tang was imprisoned at Xia Tai, King Wen was held at You Li, Chong Er fled to Di, Xiao Bai fled to Ju - in the end they became kings and hegemons.",
  "s0042": "From this perspective, why would it not turn to good fortune?'",
  "s0044": "After Wu pardoned Yue, King Goujian of Yue returned to his country. He tormented his body and concentrated his thoughts, placing a gallbladder on his seat. Whether sitting or lying down, he would look up at the gallbladder; even when eating or drinking, he would taste the gallbladder.",
  "s0045": "He would say: 'Have you forgotten the humiliation of Kuaiji?'",
  "s0046": "He personally plowed the fields, his wife personally wove cloth. Their food was not supplemented with meat, their clothing did not have multiple layers. He humbled himself before worthy people, treated guests generously, aided the poor and mourned the dead, sharing the labors with the common people.",
  "s0047": "He wanted to have Fan Li manage the state administration, but Li replied: 'For military affairs, Wen Zhong is not as good as me;",
  "s0048": "for filling and comforting the state, winning over the people, I am not as good as Wen Zhong.'",
  "s0049": "Thus he entrusted all state affairs to Grand Master Wen Zhong, and sent Fan Li and Grand Master Zhu Ji to negotiate peace and serve as hostages in Wu.",
  "s0050": "After two years, Wu returned Fan Li.",
  "s0051": "Seven years after Goujian returned from Kuaiji, he comforted and cared for his officers and people, intending to use them to avenge Wu.",
  "s0052": "The Yue people were hungry for revenge, but Goujian was afraid they would be too hasty and not yet ready.",
  "s0053": "He tested them by drinking from a cup of foul water. When someone grimaced, he had them executed, saying: 'You cannot even bear foul water - how can you bear the great humiliation?'",
  "s0054": "He asked his ministers: 'Can we attack Wu now?'",
  "s0055": "Fan Li said: 'Not yet.'",
  "s0056": "After another year, he asked again. Fan Li replied: 'Not yet.'",
  "s0057": "After another year, he asked again. Fan Li replied: 'Not yet.'",
  "s0058": "When he asked a fourth time, Fan Li said: 'Now we can.'",
  "s0059": "In the ninth year, Goujian raised troops to attack Wu.",
  "s0060": "Wu was unprepared and suffered a great defeat.",
  "s0061": "In the tenth year, Yue again attacked Wu, capturing Wu territory west of the Jiang River.",
  "s0062": "In the eleventh year, Wu and Yue fought at Zhe Xiang, and Yue defeated Wu.",
  "s0063": "In the twelfth year, Yue again attacked Wu.",
  "s0064": "In the thirteenth year, King Fu Chai of Wu heard that Yue was training troops, and was about to attack Yue.",
  "s0065": "But Wu Zixu advised: 'Do not attack yet. Yue is still mourning their dead and has not recovered.'",
  "s0066": "Wu did not listen and sent troops to attack Yue, suffering another defeat.",
  "s0067": "Wu Zixu saw that the state could not be saved, so he gave his son to a fisherman and fled.",
  "s0068": "The fisherman rowed him across the river, but Wu Zixu turned back and saw a fisherman pursuing him, so he drew his sword and said: 'The Wu king wants my head - you can take it and receive the reward.'",
  "s0069": "He slit his own throat and died. The fisherman took his body and fled.",
  "s0070": "Fu Chai returned and had the body exhumed, making a leather bag from Wu Zixu's skin.",
  "s0071": "In the fourteenth year, Yue destroyed Wu.",
  "s0072": "King Fu Chai of Wu said to his attendants: 'I regret not listening to Wu Zixu's words!'",
  "s0073": "He covered his face and died. Yue took Fu Chai as a prisoner.",
  "s0074": "Goujian wanted to live with Fu Chai in Yue, but Fan Li wrote to advise him: 'Fly a bird until its feathers are complete, then shoot it; catch a rabbit, then release the dogs. A defeated army can be revived, a destroyed state can be restored. The enemy of an enemy is a friend.'",
  "s0075": "Goujian did not listen and kept Fu Chai.",
  "s0076": "Later, Yue moved its capital to Lang Ye, and Goujian toured the Wu region, proclaiming: 'This was the territory of Fu Chai.'",
  "s0077": "He had Fu Chai pull his chariot, saying: 'You are Fu Chai?'",
  "s0078": "Fu Chai said: 'Yes.'",
  "s0079": "Goujian said: 'I made you a servant - can you still be king?'",
  "s0080": "Fu Chai said: 'Cannot.'",
  "s0081": "Goujian pardoned him and gave him a house at Shi Men.",
  "s0082": "Later, Fu Chai asked permission to see Goujian.",
  "s0083": "Goujian went to see him. Fu Chai looked up at Goujian and sighed: 'I was once king of Wu, and you were once king of Yue. Now I pull your chariot. Heaven brings this about - what can man do?'",
  "s0084": "He then committed suicide by hanging himself.",
  "s0085": "Goujian buried him generously.",
  "s0086": "Fan Li became ill and wrote to Goujian: 'When governing a country, one should stop when success is achieved. When stretching a bow, one should loosen it when it is fully drawn. A flying bird should be shot when its feathers are complete. When the moon is full, it begins to wane; when things reach their peak, they decline.",
  "s0087": "I have heard that those who know when to stop avoid danger. Now Yue has avenged its humiliation, and the world knows your virtue. This is the time to stop.'",
  "s0088": "He then resigned his position and left.",
  "s0089": "Goujian said: 'Wen Zhong can manage internal affairs - I will share the country with him.'",
  "s0090": "He sent someone to tell Wen Zhong, but Wen Zhong refused, saying: 'Setting up a ruler is like setting up a cornerstone - if it is not level, the whole building will collapse. Serving a ruler is like building a house - if it is not completed, one cannot stop.'",
  "s0091": "He then committed suicide.",
  "s0092": "Goujian heard this and said: 'I had no one to share the country with.'",
  "s0093": "He then buried Wen Zhong generously.",
  "s0094": "Goujian ruled over Wu and Yue, becoming hegemon of the east.",
  "s0095": "He sent his younger son to serve the Zhou king, and the Zhou king honored him as a duke.",
  "s0096": "Goujian died, and his younger son succeeded him.",
  "s0097": "His younger son was not worthy, and the state declined.",
  "s0098": "After five generations, Yue was destroyed by Chu.",
  "s0099": "The Yue people said: 'The mountains and rivers are the same, but the people have changed.'",
  "s0100": "Therefore they sang: 'The mountains do not move, the rivers do not flow, but the people change their ways.'"
}
