{
  "s1355": "Two. Son of Heaven congratulated. Circulated coin. Song Tai Qiu She disappeared.",
  "s1356": "Thirty-five. Meng Zi came, king asked about benefiting state, replied: 'Lord cannot speak of profit.'",
  "s1361": "Seven. Met with Wei at Ping A south.",
  "s1364": "Three. King crowned. Pulled Han Yi Yang.",
  "s1366": "Twenty-four. Qin pulled our Yi Yang",
  "s1370": "Eight. Met with Wei at Zhen.",
  "s1373": "Four. Son of Heaven presented civil military sacrificial meat. Wei lady came.",
  "s1374": "Wei Xiang Wang first year. Met with feudal lords at Xu Zhou, to mutually king.",
  "s1375": "Twenty-five. Drought. Made high gate, Qu Yu Jiu said 'Zhao Hou will not go out this gate.'",
  "s1378": "Twenty-eight. Su Qin persuaded Yan.",
  "s1379": "Nine. Met with Wei at Xu Zhou, feudal lords mutually king.",
  "s1382": "Five. Yin Jin man Xi Shou became great good maker.",
  "s1383": "Two. Qin defeated us at Diao Yin.",
  "s1384": "Twenty-six. High gate completed, Zhao Hou died, did not go out this gate.",
  "s1386": "Seven. Besieged Qi at Xu Zhou.",
  "s1388": "Ten. Chu besieged our Xu Zhou.",
  "s1391": "Six. Wei used Yin Jin for peace, named Ning Qin.",
  "s1392": "Three. Attacked Zhao. Wei Ping Hou first year.",
  "s1393": "Han Xuan Hui Wang first year",
  "s1394": "Eighteen. Qi, Wei attacked us, we released river water to flood them.",
  "s1396": "Yan Yi Wang first year",
  "s1397": "Eleven. Attacked Zhao with Wei.",
  "s1400": "Seven. Yi Qu internal disorder, Shu Zhang Cao led troops pacified it.",
  "s1409": "Eight. Wei entered He Xi land to Qin.",
  "s1410": "Five. Gave Qin He Xi land Shao Liang. Qin besieged our Jiao, Qu Wo.",
  "s1418": "Nine. Crossed river, took Fen Yin, Pi Shi. Besieged Jiao, surrendered it. Met with Wei at Ying.",
  "s1419": "Six. Met with Qin at Ying. Qin took Fen Yin, Pi Shi.",
  "s1422": "Eleven. Wei defeated us at Xing Shan.",
  "s1427": "Ten. Zhang Yi chancellor. Gong Zi Sang besieged Pu Yang, surrendered it. Wei gave Shang Jun.",
  "s1428": "Seven. Entered Shang Jun to Qin.",
  "s1431": "Chu Huai Wang Huai first year",
  "s1433": "Fifteen. Song Jun Yan first year.",
  "s1436": "Eleven. Yi Qu jun became subject. Returned Wei Jiao, Qu Wo.",
  "s1437": "Eight. Qin returned our Jiao, Qu Wo.",
  "s1445": "Twelve. First La. Met at Long Men.",
  "s1454": "Thirteen. Fourth month Wu Wu, lord became king.",
  "s1456": "Eight. Wei defeated us at Han Ju.",
  "s1457": "Zhao Wu Ling Wang first year. Wei defeated us at Zhao Hu.",
  "s1463": "Chancellor Zhang Yi led troops took Shan. First changed first year",
  "s1464": "Eleven. Wei Si Jun first year.",
  "s1466": "Two. Built Hang city.",
  "s1472": "Two. Chancellor Zhang Yi met with Qi, Chu at Nie Sang.",
  "s1474": "Ten. Lord became king.",
  "s1476": "Six. Defeated Wei at Xiang Ling.",
  "s1477": "Ten. Lord became king.",
  "s1478": "Qi Min Wang Di first year",
  "s1481": "Three. Zhang Yi dismissed chancellor, chancellor Wei.",
  "s1482": "Thirteen. Qin took Qu Wo. Ping Zhou woman transformed into man.",
  "s1484": "Four. Met with Han at Ou Shu.",
  "s1493": "Five. Took Han woman as lady."
}
