{
  "s0041": {
    "chinese": "乃與私屬遂去豳，度漆、沮，踰梁山，止於岐下。",
    "literal": "The next day he left, and the people followed him saying: 'We will die with our ruler.'",
    "idiomatic": "He departed Bin with his closest followers, crossed the Qi and Ju rivers, climbed over Mount Liang, and stopped at the base of Mount Qi."
  },
  "s0042": {
    "chinese": "豳人舉國扶老攜弱，盡復歸古公於岐下。",
    "literal": "Gu Gong feared the Rong and Di would pursue and harm the people, so he stopped and said: 'You love me, but I cannot bear to harm you.'",
    "idiomatic": "The entire population of Bin, supporting the elderly and carrying the young, all returned and gathered around Gu Gong at the base of Mount Qi."
  },
  "s0043": {
    "chinese": "及他旁國聞古公仁，亦多歸之。",
    "literal": "He separated 300 li of land to give to the Rong and Di, and moved to Qi.",
    "idiomatic": "When the neighboring states heard of Gu Gong's benevolence, many of them also came to join him."
  },
  "s0044": {
    "chinese": "於是古公乃貶戎狄之俗，而營筑城郭室屋，而邑別居之。",
    "literal": "Therefore, the ancient Duke abandoned the customs of the Rong and Di barbarians, and built walled cities, houses, and rooms, separating the people into distinct settlements.",
    "idiomatic": "Thus Gu Gong abandoned the customs of the Rong and Di barbarians, and built walled cities, houses, and rooms, organizing the people into separate settlements."
  },
  "s0045": {
    "chinese": "作五官有司。",
    "literal": "He made Tai Bo and Yu Zhong cede the throne to Ji Li.",
    "idiomatic": "He established the five offices and their officials."
  },
  "s0046": {
    "chinese": "民皆歌樂之，頌其德。",
    "literal": "Tai Bo and Yu Zhong agreed and went to Wu and Yue, tattooed and cut their hair, and became foreigners.",
    "idiomatic": "The people all sang joyfully of him, praising his virtue."
  },
  "s0047": {
    "chinese": "古公有長子曰太伯，次曰虞仲。",
    "literal": "The people of Wu and Yue heard of Tai Bo's virtue and all came to him.",
    "idiomatic": "Gu Gong had an eldest son named Tai Bo, and a second son named Yu Zhong."
  },
  "s0048": {
    "chinese": "太姜生少子季歷，季歷娶太任，皆賢婦人，生昌，有聖瑞。",
    "literal": "Ji Li inherited the throne as King Wen.",
    "idiomatic": "Tai Jiang gave birth to a youngest son Ji Li. Ji Li married Tai Ren - both were virtuous women. They gave birth to Chang, who possessed sacred omens."
  },
  "s0049": {
    "chinese": "古公曰：「我世當有興者，其在昌乎？」",
    "literal": "King Wen was diligent in government and loved the people.",
    "idiomatic": "Gu Gong said: 'Our line will one day rise to greatness. Could it be with Chang?'"
  },
  "s0050": {
    "chinese": "長子太伯、虞仲知古公欲立季歷以傳昌，乃二人亡如荊蠻，文身斷髪，以讓季歷。",
    "literal": "He sought out worthies and sages, and the Duke of Zhou and others came to him.",
    "idiomatic": "The eldest son Tai Bo and second son Yu Zhong knew Gu Gong wished to establish Ji Li so that Chang would inherit the throne. The two fled to the Jing barbarians, tattooed their bodies and cut their hair, yielding the throne to Ji Li."
  },
  "s0051": {
    "chinese": "古公卒，季歷立，是為公季。",
    "literal": "Gu Gong died, Ji Li ascended, this was Gong Ji.",
    "idiomatic": ""
  },
  "s0052": {
    "chinese": "公季修古公遺道，篤於行義，諸侯順之。",
    "literal": "Gong Ji followed Gu Gong's legacy, was devoted to practicing righteousness, the lords submitted to him.",
    "idiomatic": ""
  },
  "s0053": {
    "chinese": "公季卒，子昌立，是為西伯。",
    "literal": "Gong Ji died, his son Chang ascended, this was Xi Bo.",
    "idiomatic": ""
  },
  "s0054": {
    "chinese": "西伯曰文王，遵后稷、公劉之業，則古公、公季之法，篤仁，敬老，慈少。",
    "literal": "Xi Bo was called King Wen, followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, loved the young.",
    "idiomatic": ""
  },
  "s0055": {
    "chinese": "禮下賢者，日中不暇食以待士，士以此多歸之。",
    "literal": "He treated worthies with courtesy, at noon had no time to eat while waiting for scholars, scholars therefore came to him in great numbers.",
    "idiomatic": ""
  },
  "s0056": {
    "chinese": "伯夷、叔齊在孤竹，聞西伯善養老，盍往歸之。",
    "literal": "Bo Yi and Shu Qi were in Gu Zhu, heard Xi Bo was good at caring for the elderly, and came to join him.",
    "idiomatic": ""
  },
  "s0057": {
    "chinese": "太顛、閎夭、散宜生、鬻子、辛甲大夫之徒皆往歸之。",
    "literal": "Taidian, Hongyao, San Yisheng, Yuzi, and Xiahou Dafu and others came to him.",
    "idiomatic": ""
  },
  "s0058": {
    "chinese": "崇侯虎譖西伯於殷紂曰：「西伯積善累德，諸侯皆向之，將不利於帝。」",
    "literal": "When King Wen was imprisoned at Youli, he increased in strength, the lords many came to Xi Bo.",
    "idiomatic": ""
  },
  "s0059": {
    "chinese": "帝紂乃囚西伯於羑里。",
    "literal": "When King Wen was released from prison, the Shang king gave him the right to punish without asking permission.",
    "idiomatic": ""
  },
  "s0060": {
    "chinese": "閎夭之徒患之。",
    "literal": "Hongyao and others were troubled by this.",
    "idiomatic": ""
}
}
