{
  "s1099": "Third year, ninth year, third year, sixth year",
  "s1100": "520 Twenty-fifth year, twenty-second year, solar eclipse.",
  "s1101": "Twenty-eighth year, sixth year, Zhou house chaos, duke pacified chaos, established Jing Wang.",
  "s1102": "Seventeenth year, ninth year, twelfth year, fifteenth year, fourteenth year, second year, fourth year, tenth year, fourth year, seventh year",
  "s1103": "519 Jing Wang first year, twenty-third year, earthquake.",
  "s1104": "Twenty-ninth year, seventh year, eighteenth year, tenth year, Wu attacked defeated us.",
  "s1105": "Thirteenth year, sixteenth year, fifteenth year, Wu defeated our troops, took Hu, Shen.",
  "s1106": "Third year, fifth year, eleventh year, Chu Jian made chaos, killed him.",
  "s1107": "Fifth year, eighth year, Gong Zi Guang defeated Chu.",
  "s1108": "518 Second year, twenty-fourth year, quail came nest.",
  "s1109": "Thirtieth year, eighth year, nineteenth year, eleventh year, Wu lowly Liang people contended mulberry, attacked took our Zhong Li.",
  "s1110": "Fourteenth year, seventeenth year, sixteenth year, Cai Zhao Hou Shen first year, Dao Hou younger brother.",
  "s1111": "Sixth year, twelfth year, duke went Jin, requested inner king.",
  "s1112": "Sixth year, ninth year",
  "s1113": "517 Jiashen third year, twenty-fifth year, duke wished execute Ji clan, three Huan clans attacked duke, duke went dwell Yun.",
  "s1114": "Thirty-first year, ninth year, twentieth year, twelfth year, fifteenth year, eighteenth year, seventeenth year, second year, seventh year, thirteenth year, seventh year, tenth year",
  "s1115": "516 Fourth year, twenty-sixth year, Qi took our Yun to place duke.",
  "s1116": "Thirty-second year, comet appeared.",
  "s1117": "Yan Zi said: 'Tian clan has virtue in Qi, can fear.'",
  "s1118": "Tenth year, Zhi Yue, Zhao Yang inner king at Wang Cheng.",
  "s1119": "Twenty-first year, thirteenth year, wished establish Zi Xi, Zi Xi not willing.",
  "s1120": "Qin woman established, this was Zhao Wang.",
  "s1121": "Song Jing Gong Tou Man first year, nineteenth year, eighteenth year, third year, eighth year, fourteenth year, eighth year, eleventh year",
  "s1122": "515 Fifth year, twenty-seventh year, thirty-third year, eleventh year, twenty-second year, Chu Zhao Wang Zhen first year, executed Wu Ji to please masses.",
  "s1123": "Second year, twentieth year, nineteenth year, fourth year, ninth year, fifteenth year, ninth year, twelfth year, Gong Zi Guang sent Zhuan Zhu kill Liao, self-established.",
  "s1124": "514 Sixth year, twenty-eighth year, duke went Jin, sought enter, Jin not listened, placed him Gan Hou.",
  "s1125": "Thirty-fourth year, twelfth year, six ministers executed duke clan, divided their cities.",
  "s1126": "Each made their son grand master.",
  "s1127": "Twenty-third year, second year, third year, twenty-first year, twentieth year, fifth year, Cao Xiang Gong first year, sixteenth year, tenth year, Wu He Lu first year",
  "s1128": "513 Seventh year, twenty-ninth year, duke from Gan Hou went Yun.",
  "s1129": "Qi Hou said: main ruler.",
  "s1130": "Duke ashamed, returned Gan Hou.",
  "s1131": "Thirty-fifth year, thirteenth year, twenty-fourth year, third year, fourth year, twenty-second year, twenty-first year, sixth year, second year, Zheng Xian Gong Chun first year, eleventh year, second year",
  "s1132": "512 Eighth year, thirtieth year, thirty-sixth year, fourteenth year, Qing Gong died.",
  "s1133": "Twenty-fifth year, fourth year, Wu three princes came fleeing, enfeoffed to guard Wu.",
  "s1134": "Fifth year, twenty-third year, twenty-second year, seventh year, third year, second year, twelfth year, third year, three princes fled Chu.",
  "s1135": "511 Ninth year, thirty-first year, solar eclipse.",
  "s1136": "Thirty-seventh year, Jin Ding Gong Wu first year, twenty-sixth year, fifth year, Wu attacked us Liu, Qian.",
  "s1137": "Sixth year, twenty-fourth year, twenty-third year, eighth year, fourth year, third year, thirteenth year, fourth year, attacked Chu Liu, Qian.",
  "s1138": "510 Tenth year, Jin sent feudal lords build city for us.",
  "s1139": "Thirty-second year, duke died Gan Hou.",
  "s1140": "Thirty-eighth year, second year, led feudal lords build city for Zhou.",
  "s1141": "Twenty-seventh year, sixth year, seventh year, twenty-fifth year, twenty-fourth year, ninth year, fifth year, Ping Gong younger brother Tong killed Xiang Gong self-established.",
  "s1142": "Fourth year, fourteenth year, fifth year",
  "s1143": "509 Eleventh year, Lu Ding Gong Song first year, Zhao Gong mourning from Gan Hou arrived.",
  "s1144": "Thirty-ninth year, third year, twenty-eighth year, seventh year, Nang Wa attacked Wu, defeated our Yu Zhang.",
  "s1145": "Cai Hou came court.",
  "s1146": "Eighth year, twenty-sixth year, twenty-fifth year, tenth year, court Chu, because fur coat detained.",
  "s1147": "Cao Yin Gong first year, fifth year, fifteenth year, sixth year, Chu attacked us, welcomed struck, defeated them, took Chu's Ju Chao.",
  "s1148": "508 Twelfth year, second year, fortieth year, fourth year, twenty-ninth year, eighth year, ninth year, twenty-seventh year, twenty-sixth year, eleventh year, second year, sixth year, sixteenth year, seventh year",
  "s1149": "507 Jiawu thirteenth year, third year, forty-first year, fifth year, thirtieth year, ninth year, Cai Zhao Hou detained three years, got fur coat, therefore returned.",
  "s1150": "Tenth year, twenty-eighth year, twenty-seventh year, twelfth year, allied with Zi Chang fur coat, got return, went Jin, requested attack Chu.",
  "s1151": "Third year, seventh year, seventeenth year, eighth year",
  "s1152": "506 Fourteenth year, allied with Jin led feudal lords invaded Chu.",
  "s1153": "Fourth year, forty-second year, sixth year, Zhou allied with us led feudal lords invaded Chu.",
  "s1154": "Thirty-first year, Chu Bao Xu requested rescue.",
  "s1155": "Tenth year, Wu, Cai attacked us, entered Ying, Zhao Wang fled.",
  "s1156": "Wu Zi Xu whipped Ping Wang grave.",
  "s1157": "Eleventh year, twenty-ninth year, contended seniority with Cai.",
  "s1158": "Twenty-eighth year, thirteenth year, contended seniority with Wei.",
  "s1159": "Chu invaded us, Wu allied with us attacked Chu, entered Ying.",
  "s1160": "Fourth year, eighth year, eighteenth year, ninth year, allied with Cai attacked Chu, entered Ying.",
  "s1161": "505 Fifteenth year, fifth year, Yang Hu arrested Ji Huan Zi, allied with him, released him.",
  "s1162": "Solar eclipse.",
  "s1163": "Forty-third year, seventh year, thirty-second year, eleventh year, Qin rescue arrived, Wu departed, Zhao Wang again entered.",
  "s1164": "Twelfth year, thirtieth year, Chen Huai Gong Liu first year, fourteenth year, Cao Jing Gong Lu first year, ninth year, nineteenth year, tenth year",
  "s1165": "504 Sixteenth year, Wang Zi Zhao followers made chaos, king fled Jin.",
  "s1166": "Sixth year, forty-fourth year, eighth year, thirty-third year, twelfth year, Wu attacked our Fan, Chu feared, moved Dui.",
  "s1167": "Thirteenth year, thirty-first year, second year, fifteenth year, second year, tenth year, Lu invaded us.",
  "s1168": "Yan Jian Gong first year, eleventh year, attacked Chu, took Fan.",
  "s1169": "503 Seventeenth year, Liu Zi welcomed king, Jin entered king.",
  "s1170": "Seventh year, Qi attacked us.",
  "s1171": "Forty-fifth year, invaded Wei.",
  "s1172": "Attacked Lu.",
  "s1173": "Ninth year, entered Zhou Jing Wang.",
  "s1174": "Thirty-fourth year, thirteenth year, fourteenth year, thirty-second year, Qi invaded us.",
  "s1175": "Third year, sixteenth year, third year, eleventh year, second year, twelfth year",
  "s1176": "502 Eighteenth year, eighth year, Yang Hu wished attack three Huan, three Huan attacked Yang Hu, Hu fled Yang Guan.",
  "s1177": "Forty-sixth year, Lu attacked us.",
  "s1178": "We attacked Lu.",
  "s1179": "Tenth year, attacked Wei.",
  "s1180": "Thirty-fifth year, fourteenth year, Zi Xi for people wept, people also wept, Cai Zhao Hou feared.",
  "s1181": "Fifteenth year, thirty-third year, Jin, Lu invaded attacked us.",
  "s1182": "Fourth year, duke went Wu, Wu detained him, because died Wu.",
  "s1183": "Seventeenth year, fourth year, Jing Gong died.",
  "s1184": "Twelfth year, third year, thirteenth year, Chen Huai Gong came, detained him, died Wu.",
  "s1185": "501 Nineteenth year, ninth year, attacked Yang Hu, Hu fled Qi.",
  "s1186": "Forty-seventh year, imprisoned Yang Hu, Hu fled Jin.",
  "s1187": "Eleventh year, Yang Hu came fleeing.",
  "s1188": "Thirty-sixth year, Ai Gong died.",
  "s1189": "Fifteenth year, sixteenth year, Yang Hu came fleeing.",
  "s1190": "Thirty-fourth year, Chen Min Gong Yue first year, eighteenth year, Cao Bo Yang first year, thirteenth year, Xian Gong died.",
  "s1191": "Fourth year, fourteenth year",
  "s1192": "500 Twentieth year, tenth year, duke assembled Qi Hou at Jia Gu.",
  "s1193": "Confucius chancellor.",
  "s1194": "Qi returned our lands.",
  "s1195": "Forty-eighth year, twelfth year, Qin Hui Gong first year, comet appeared.",
  "s1196": "Sixteenth year, seventeenth year, thirty-fifth year, second year, nineteenth year, second year, Zheng Sheng Gong Sheng first year, Zheng increasingly weak.",
  "s1197": "Fifth year, fifteenth year",
  "s1198": "499 Twenty-first year, eleventh year, twelfth year, forty-ninth year, thirteenth year, twentieth year, third year, third year, fourteenth year, third year"
}
