{
  "s0001": "The Xia Classic says: Yu controlled the floodwaters for thirteen years, passing by his home without entering the door.",
  "s0002": "On land he traveled in carriages, on water in boats, through mud he stepped on rushes, over mountains he used bridges.",
  "s0003": "He divided the nine provinces, following the mountains he dredged the rivers, according to the soil he established tribute.",
  "s0004": "He opened nine routes, dammed nine marshes, measured nine mountains.",
  "s0005": "Yet the Yellow River disasters overflowed and harmed China especially severely.",
  "s0006": "He made this his sole task.",
  "s0007": "Therefore he directed the Yellow River from Ji Shi through Long Men, south to Hua Yin, east down Dizhu, reaching Meng Jin and Luo Hui, arriving at Da Pei.",
  "s0008": "Therefore Yu considered that the Yellow River's source was high, the water turbulent and fierce, difficult to flow on level ground, frequently causing breaches, so he made two channels to divert its river.",
  "s0009": "North it carried to high ground, passing Jiang Shui, reaching Da Lu, spreading into nine rivers, all flowing back into the Yellow River, entering the Bohai Sea. The nine rivers being dredged, the nine marshes being cleared, all China peaceful, the merit extending to the Three Dynasties.",
  "s0010": "From this time on, from Xing Yang they diverted the Yellow River southeast to make the Hong Gou, connecting Song, Zheng, Chen, Cai, Cao, Wei, meeting with Ji, Ru, Huai, and Si.",
  "s0011": "In Chu, to the west they opened channels through the Han River and Yun Meng marshes, to the east they connected the Hong Gou between the Yangtze and Huai.",
  "s0012": "In Wu, they opened channels through the Three Rivers and Five Lakes.",
  "s0013": "In Qi, they opened channels between Zi and Ji.",
  "s0014": "In Shu, the Shu governor Bing chiseled apart the Li Dui, eliminated the Mo River's harm, pierced two rivers through Chengdu.",
  "s0015": "These canals could all carry boats, when there was surplus they used for irrigation, the people enjoyed their benefits.",
  "s0016": "Regarding the places passed, they often diverted their waters to additionally irrigate farmland canals, numbering in the tens of thousands, but cannot be fully counted.",
  "s0017": "Xi Men Bao diverted Zhang River water to irrigate Ye, enriching Wei's He Nei region.",
  "s0018": "Han heard Qin liked to undertake projects, wished to stop them, not let them attack east, so sent water engineer Zheng Guo to secretly persuade Qin, ordering him to dig Jing River from Zhong Shan west to Hu Kou as a canal, flowing north along the mountain east into Luo for over three hundred li, intending to irrigate fields.",
  "s0019": "Halfway through construction they discovered it, Qin wished to kill Zheng Guo.",
  "s0020": "Zheng Guo said: 'At first I was sent secretly, but the canal's completion will also benefit Qin.'",
  "s0021": "Qin considered this correct, finally had him complete the canal.",
  "s0022": "The canal completed, using it to divert accumulated water, irrigating saline-alkali land over forty thousand qing, harvests all one zhong per mu.",
  "s0023": "Therefore Guanzhong became fertile land, no famine years, Qin grew rich and strong, finally unified the feudal lords, so named it Zheng Guo Canal.",
  "s0024": "Han arose thirty-nine years, during Emperor Wen's time the Yellow River breached at Suan Zao, east broke the Golden Dike, so Dong Jun greatly raised troops to block it.",
  "s0025": "Forty plus years later, during the present emperor's Yuan Guang period, the Yellow River breached at Hou Zi, southeast flowing into Ju Ye, connecting to Huai and Si.",
  "s0026": "Therefore the emperor sent Ji An and Zheng Dang Shi to raise people and troops to block it, but it repeatedly broke again.",
  "s0027": "At this time Wu An Hou Tian Fen was chancellor, his fief ate from Ju.",
  "s0028": "Ju was north of the Yellow River, if the river breached south then Ju had no water disaster, fief income increased.",
  "s0029": "Fen spoke to the emperor: 'Yellow and Yangtze river breaches are all heavenly matters, not easy to forcibly block with human power, blocking it may not accord with heaven.'",
  "s0030": "Those who observed vapors and used calculations also considered it so.",
  "s0031": "Therefore the emperor long did not undertake blocking it again.",
  "s0032": "At this time Zheng Dang Shi was Grand Agrarian, said: 'In the past, transporting grain from east of the passes followed the Wei River, taking six months and stopping, the water transport route over nine hundred li, sometimes had difficult places.",
  "s0033": "Divert the Wei, dig a canal from Chang'an, along south mountain down, to the Yellow River over three hundred li, straight, easy transport, estimated could make it three months and stop;",
  "s0034": "the canal below people's fields over ten thousand qing, moreover could use to irrigate fields: this reduces transport, saves troops, and additionally fertilizes Guanzhong land, obtains grain.'",
  "s0035": "The emperor considered it correct, ordered Qi water engineer Xu Bo to table it, completely raised troops several tens of thousands to dig the transport canal, three years and connected.",
  "s0036": "Connected, used for transport, greatly convenient.",
  "s0037": "Afterward transport gradually increased, and the canal below people could considerably irrigate fields.",
  "s0038": "Afterward Hedong governor Fan Xi said: 'Transport from mountain west to east, yearly over one hundred thousand shi, passing Dizhu's limit, losses and destruction very many, moreover troublesome expensive.",
  "s0039": "Dig canal divert Fen irrigate Pi Shi, Fen Yin below, divert Yellow River irrigate Fen Yin, Pu Ban below, estimated can get five thousand qing.",
  "s0040": "Five thousand qing formerly all Yellow River banks abandoned land, people harvested reeds and pastured among them, now irrigate fields, estimated can get grain over two million shi.",
  "s0041": "Grain from Wei up, no different from Guanzhong, and east of Dizhu can no longer transport.'",
  "s0042": "The emperor considered it correct, raised troops several tens of thousands to make canal fields.",
  "s0043": "Several years, the Yellow River shifted, canal unfavorable, then farmers could not repay seeds.",
  "s0044": "Long time, Hedong canal fields abandoned, gave to Yue people, ordered Lesser Treasury as salary income.",
  "s0045": "Afterward someone memorialized wishing to open Bao Xie road and transport matters, sent to Censor-in-Chief Zhang Tang.",
  "s0046": "Tang asked its matters, because said: 'To Shu from old road, old road many slopes, winding far.",
  "s0047": "Now dig Bao Xie road, few slopes, near four hundred li;",
  "s0048": "Bao water connects Mian, Xie water connects Wei, all can carry boats transport.",
  "s0049": "Transport from Nanyang up Mian enter Bao, Bao's disconnected water to Xie, between over one hundred li, use carts transfer, from Xie down to Wei.'",
  "s0050": "Thus, Hanzhong grain can be delivered, Shandong from Mian unlimited, convenient for Dizhu transport."
}
