{
  "s3355": "Three, doubly allied with Chu and became close to Jin.",
  "s3356": "First year of Duke Cheng of Wei (Zheng)",
  "s3367": "Ten, Duke Xiao died, younger brother Pan used Wei's Gong Zi Kai Fang to assassinate Duke Xiao's son, established Pan.",
  "s3368": "Four, rescued Song, avenged Cao and Wei's humiliation.",
  "s3370": "Thirty-nine, sent Zi Yu to attack Song.",
  "s3371": "Four, Chu attacked us, we urgently appealed to Jin.",
  "s3381": "Twenty, king hunted at He Yang.",
  "s3382": "Twenty-eight, duke went to Jian Tu to assemble for audience.",
  "s3383": "First year of Duke Zhao of Qi (Pan), assembled with Jin to defeat Chu, audience with Zhou king.",
  "s3384": "Five, invaded Cao and attacked Wei, took Wu Lu, seized Cao lord. Feudal lords defeated Chu and audience at He Yang, Zhou mandate granted duke land.",
  "s3385": "Twenty-eight, assembled with Jin to attack Chu and audience with Zhou.",
  "s3386": "Forty, Jin defeated Zi Yu at Cheng Pu.",
  "s3387": "Five, Jin rescued us, Chu troops withdrew.",
  "s3388": "Three, Jin attacked us, took Wu Lu. Duke fled, established Gong Zi Xia assembled with Jin for audience, returned to Wei.",
  "s3389": "Sixteen, assembled with Jin to attack Chu, audience with Zhou king.",
  "s3390": "Fourteen, assembled with Jin to attack Chu, audience with Zhou king.",
  "s3391": "Twenty-one, Jin attacked us, seized duke, then returned him.",
  "s3404": "Four, Jin gave Wei to Song.",
  "s3405": "First year of Duke Gong of Chen (Shuo)",
  "s3416": "Seven, listened to Zhou and returned Duke Cheng of Wei. Allied with Qin to besiege Zheng.",
  "s3417": "Thirty, besieged Zheng, upon hearing words withdrew.",
  "s3420": "Five, Zhou entered Duke Cheng, restored Wei.",
  "s3424": "Forty-three, Qin and Jin besieged us, because of Jin.",
  "s3448": "Nine, Duke Wen died.",
  "s3449": "Thirty-two, about to raid Zheng, Jian Shu said it was not permissible.",
  "s3456": "Forty-five, Duke Wen died.",
  "s3460": "Jia Wu",
  "s3462": "Thirty-three, Duke Xi died.",
  "s3463": "Six, Di invaded us.",
  "s3464": "First year of Duke Xiang of Jin (Huan), defeated Qin at Xiao.",
  "s3465": "Thirty-three, raided Zheng, Jin defeated us at Xiao.",
  "s3472": "First year of Duke Mu of Zheng (Lan), Qin raided us, Xian Gao deceived them.",
  "s3478": "First year of Duke Wen of Lu (Xing)",
  "s3480": "Two, attacked Wei, Wei attacked us.",
  "s3481": "Thirty-four, defeated at Xiao about to flee and return, duke restored their offices.",
  "s3482": "Forty-six, king wished to kill crown prince and establish Zhi, crown prince feared, with tutor Pan Chong assassinated king. King wished to eat bear paw and die, they did not permit. Self-established as king.",
  "s3484": "Nine, Jin attacked us, we attacked Jin.",
  "s3496": "Three, Qin avenged our Xiao defeat, defeated us at Wang.",
  "s3497": "Thirty-five, attacked Jin to avenge Xiao, defeated us at Wang.",
  "s3498": "First year of King Mu of Chu (Shang Chen), granted his crown prince's residence to Chong, made him chancellor.",
  "s3510": "Three, duke went to Jin.",
  "s3512": "Four, Qin attacked us, took Wang Guan, we did not go out.",
  "s3513": "Thirty-six, with Meng Ming and others attacked Jin, Jin did not dare go out.",
  "s3514": "Two, Jin attacked us.",
  "s3528": "Five, attacked Qin, besieged Yuan and Xin Cheng.",
  "s3529": "Thirty-seven, Jin attacked us, besieged Yuan and Xin Cheng.",
  "s3530": "Three, extinguished Jiang.",
  "s3532": "Twelve, duke went to Jin.",
  "s3544": "Six, Zhao Cheng Zi, Luan Zhen Zi, Huo Bo, Jiu Ji all died.",
  "s3546": "Four, extinguished Liu and Liao."
}