{
  "s0051": {
    "chinese": "從攻項籍，屠煮棗。",
    "literal": "Followed in attacking Xiang Yu, massacred Zhujiao.",
    "idiomatic": "He followed Gaozu in attacking Xiang Yu, massacring the defenders at Zhujiao."
  },
  "s0052": {
    "chinese": "擊破王武、程處軍於外黃。",
    "literal": "Defeated Wang Wu and Cheng Chu's army at Waihuang.",
    "idiomatic": "He smashed Wang Wu and Cheng Chu's forces at Waihuang."
  },
  "s0053": {
    "chinese": "攻鄒、魯、瑕丘、薛。",
    "literal": "Attacked Zou, Lu, Xiaqiu, Xue.",
    "idiomatic": "He attacked the cities of Zou, Lu, Xiaqiu, and Xue."
  },
  "s0054": {
    "chinese": "項羽敗漢王於彭城，盡復取魯、梁地。",
    "literal": "Xiang Yu defeated Han King at Pengcheng, completely recaptured Lu and Liang territory.",
    "idiomatic": "Xiang Yu defeated the Han King at Pengcheng and completely regained control of Lu and Liang territories."
  },
  "s0055": {
    "chinese": "噲還至滎陽，益食平陰二千戶，以將軍守廣武。",
    "literal": "Kuai returned to Xingyang, additionally granted Pingyin two thousand households, as general guarding Guangwu.",
    "idiomatic": "Fan Kuai returned to Xingyang. He was additionally granted two thousand households in Pingyin and appointed general to defend Guangwu."
  },
  "s0056": {
    "chinese": "一歲，項羽引而東。",
    "literal": "One year, Xiang Yu led troops and went east.",
    "idiomatic": "After one year, Xiang Yu led his troops eastward."
  },
  "s0057": {
    "chinese": "從高祖擊項籍，下陽夏，虜楚周將軍卒四千人。",
    "literal": "Followed Gaozu attacking Xiang Yu, took Yangxia, captured Chu Zhou general's troops four thousand.",
    "idiomatic": "He followed Gaozu in attacking Xiang Yu, capturing Yangxia and taking four thousand troops from the Chu general Zhou."
  },
  "s0058": {
    "chinese": "圍項籍於陳，大破之。",
    "literal": "Surrounded Xiang Yu at Chen, greatly defeated him.",
    "idiomatic": "He surrounded Xiang Yu at Chen and dealt him a crushing defeat."
  },
  "s0059": {
    "chinese": "屠胡陵。",
    "literal": "Massacred Hul陵.",
    "idiomatic": "He massacred the defenders at Hul陵."
  },
  "s0060": {
    "chinese": "項籍既死，漢王為帝，以噲堅守戰有功，益食八百戶。",
    "literal": "Xiang Yu already dead, Han King became emperor, because Kuai firmly defended and fought with merit, additionally granted eight hundred households.",
    "idiomatic": "After Xiang Yu's death, the Han King became emperor. For Fan Kuai's steadfast defense and meritorious service in battle, he was additionally granted eight hundred households."
  },
  "s0061": {
    "chinese": "從高帝攻反燕王臧荼，虜荼，定燕地。",
    "literal": "從高祖攻反寇燕王臧荼於薊，破之。",
    "idiomatic": "He followed Gaozu in attacking the rebel Yan King Zang Tu at Ji, defeating him."
  },
  "s0062": {
    "chinese": "楚王韓信反，噲從至陳，取信，定楚。",
    "literal": "又從至陳，取楚王信，剖符，世世勿絕。",
    "idiomatic": "He followed again to Chen, captured Chu King Xin, and received an enfeoffment document guaranteeing his title for generations without end."
  },
  "s0063": {
    "chinese": "更賜爵列侯，與諸侯剖符，世世勿絕，食舞陽，號為舞陽侯，除前所食。",
    "literal": "食舞陽，號「左將軍」。",
    "idiomatic": "He was granted Wuyang as his fief and given the title Left General."
  },
  "s0064": {
    "chinese": "以將軍從高祖攻反韓王信於代。",
    "literal": "明年，定翟，伐陳豨，當陳豨連戰。",
    "idiomatic": "The next year, he pacified Di and attacked Chen Xi, fighting continuous battles against Chen Xi."
  },
  "s0065": {
    "chinese": "自霍人以往至雲中，與絳侯等共定之，益食千五百戶。",
    "literal": "陳豨敗，與曼丘臣遊擊於代。",
    "idiomatic": "Chen Xi was defeated, and Fan Kuai conducted mobile warfare with Manqiu Chen in Dai."
  },
  "s0066": {
    "chinese": "因擊陳豨與曼丘臣軍，戰襄國，破柏人，先登，降定清河、常山凡二十七縣，殘東垣，遷為左丞相。",
    "literal": "高祖南御馮異等絕隴道，攻雍，定隴西。",
    "idiomatic": "Gaozu marched south to intercept Feng Yi and others on the Long road, attacked Yong, and pacified Longxi."
  },
  "s0067": {
    "chinese": "破得綦毋卹、尹潘軍於無終、廣昌。",
    "literal": "以所將到故關與新安軍，益爵，宜至丞相。",
    "idiomatic": "With the troops he commanded, he reached Guguan and the Xinan army. His nobility rank was increased, making him eligible for the position of chancellor."
  },
  "s0068": {
    "chinese": "破豨別將胡人王黃軍於代南，因擊韓信軍於參合。",
    "literal": "語在《絳侯周勃世家》。",
    "idiomatic": "This is recorded in the Hereditary House of Marquis Jiang Zhou Bo."
  },
  "s0069": {
    "chinese": "軍所將卒斬韓信，破豨胡騎橫谷，斬將軍趙既，虜代丞相馮梁、守孫奮、大將王黃、將軍、（太卜）太仆解福等十人。",
    "literal": "項籍之叛楚也，淮陰人韓信亡楚歸漢。",
    "idiomatic": "When Xiang Yu rebelled against Chu, Han Xin from Huaiyin fled from Chu to join Han."
  },
  "s0070": {
    "chinese": "與諸將共定代鄉邑七十三。",
    "literal": "漢王授信為治粟都尉，未之奇也。",
    "idiomatic": "The Han King appointed Han Xin as grain commissioner, but did not consider him exceptional."
  },
  "s0071": {
    "chinese": "其後燕王盧綰反，噲以相國擊盧綰，破其丞相抵薊南，定燕地，凡縣十八，鄉邑五十一。",
    "literal": "信數與蕭何語，何奇之，至南鄭。",
    "idiomatic": "Han Xin often spoke with Xiao He, who recognized his talent. This continued until they reached Nanzheng."
  },
  "s0072": {
    "chinese": "益食邑千三百戶，定食舞陽五千四百戶。",
    "literal": "與信言未畢，上大驚曰：「吾國小，寧能容信？",
    "idiomatic": "Xiao He had not finished speaking when Gaozu exclaimed in great surprise: My realm is small—how can it contain a man like Han Xin?"
  },
  "s0073": {
    "chinese": "從，斬首百七十六級，虜二百八十八人。",
    "literal": "必欲爭天下，非信無可。",
    "idiomatic": "If we want to contend for the world, there is no one else but Han Xin."
  },
  "s0074": {
    "chinese": "別，破軍七，下城五，定郡六，縣五十二，得丞相一人，將軍十二人，二千石已下至三百石十一人。",
    "literal": "乃拜信為大將軍，斬鐘離眜等七人東定齊。",
    "idiomatic": "He then appointed Han Xin as Grand General, executed Zhongli Mei and six others, and sent him east to pacify Qi."
  },
  "s0075": {
    "chinese": "噲以呂后女弟呂須為婦，生子伉，故其比諸將最親。",
    "literal": "齊地悉定，徙信為楚王。",
    "idiomatic": "When Qi territory was completely pacified, Han Xin was transferred to become King of Chu."
  },
  "s0076": {
    "chinese": "先黥布反時，高祖嘗病甚，惡見人，臥禁中，詔戶者無得入群臣。",
    "literal": "項羽死，徙信為淮陰侯。",
    "idiomatic": "After Xiang Yu's death, Han Xin was transferred to become Marquis of Huaiyin."
  },
  "s0077": {
    "chinese": "群臣絳、灌等莫敢入。",
    "literal": "信與絳侯等平陳豨、黥布等反，薨。",
    "idiomatic": "Han Xin joined Jiang Hou and others in suppressing the rebellions of Chen Xi and Ying Bu, then died."
  },
  "s0078": {
    "chinese": "十餘日，噲乃排闥直入，大臣隨之。",
    "literal": "子肥嗣，薨，無子。",
    "idiomatic": "His son Han Fei succeeded him, then died without heirs."
  },
  "s0079": {
    "chinese": "上獨枕一宦者臥。",
    "literal": "弟媯嗣，為侯。",
    "idiomatic": "His younger brother Han Wei succeeded him as marquis."
  },
  "s0080": {
    "chinese": "噲等見上流涕曰：「始陛下與臣等起豐沛，定天下，何其壯也！",
    "literal": "媯薨，子但嗣。",
    "idiomatic": "When Wei died, his son Han Dan succeeded him."
  },
  "s0081": {
    "chinese": "今天下已定，又何憊也！",
    "literal": "但薨，子代嗣。",
    "idiomatic": "When Dan died, his son Han Dai succeeded him."
  },
  "s0082": {
    "chinese": "且陛下病甚，大臣震恐，不見臣等計事，顧獨與一宦者絕乎？",
    "literal": "代薨，子建嗣。",
    "idiomatic": "When Dai died, his son Han Jian succeeded him."
  },
  "s0083": {
    "chinese": "且陛下獨不見趙高之事乎？」",
    "literal": "建薨，子襄嗣。",
    "idiomatic": "When Jian died, his son Han Xiang succeeded him."
  },
  "s0084": {
    "chinese": "高帝笑而起。",
    "literal": "襄薨，子種嗣。",
    "idiomatic": "When Xiang died, his son Han Zhong succeeded him."
  },
  "s0085": {
    "chinese": "其後盧綰反，高帝使噲以相國擊燕。",
    "literal": "種薨，子術嗣。",
    "idiomatic": "When Zhong died, his son Han Shu succeeded him."
  },
  "s0086": {
    "chinese": "是時高帝病甚，人有惡噲黨於呂氏，即上一日宮車晏駕，則噲欲以兵盡誅滅戚氏、趙王如意之屬。",
    "literal": "術薨，子喜嗣。",
    "idiomatic": "When Shu died, his son Han Xi succeeded him."
  },
  "s0087": {
    "chinese": "高帝聞之大怒，乃使陳平載絳侯代將，而即軍中斬噲。",
    "literal": "喜薨，子慶忌嗣。",
    "idiomatic": "When Xi died, his son Han Qingji succeeded him."
  },
  "s0088": {
    "chinese": "陳平畏呂后，執噲詣長安。",
    "literal": "慶忌薨，子公嗣。",
    "idiomatic": "When Qingji died, his son Han Gong succeeded him."
  },
  "s0089": {
    "chinese": "至則高祖已崩，呂后釋噲，使復爵邑。",
    "literal": "公薨，子並嗣。",
    "idiomatic": "When Gong died, his son Han Bing succeeded him."
  },
  "s0090": {
    "chinese": "孝惠六年，樊噲卒，謚為武侯。",
    "literal": "並薨，子蓋嗣。",
    "idiomatic": "When Bing died, his son Han Gai succeeded him."
  },
  "s0091": {
    "chinese": "子伉代侯。",
    "literal": "蓋薨，子護嗣。",
    "idiomatic": "When Gai died, his son Han Hu succeeded him."
  },
  "s0092": {
    "chinese": "而伉母呂須亦為臨光侯，高后時用事專權，大臣盡畏之。",
    "literal": "護薨，子廣嗣。",
    "idiomatic": "When Hu died, his son Han Guang succeeded him."
  },
  "s0093": {
    "chinese": "伉代侯九歲，高后崩。",
    "literal": "廣薨，子當嗣。",
    "idiomatic": "When Guang died, his son Han Dang succeeded him."
  },
  "s0094": {
    "chinese": "大臣誅諸呂、呂須婘屬，因誅伉。",
    "literal": "當薨，子回嗣。",
    "idiomatic": "When Dang died, his son Han Hui succeeded him."
  },
  "s0095": {
    "chinese": "舞陽侯中絕數月。",
    "literal": "回薨，子逢嗣。",
    "idiomatic": "When Hui died, his son Han Feng succeeded him."
  },
  "s0096": {
    "chinese": "孝文帝既立，乃復封噲他庶子市人為舞陽侯，復故爵邑。",
    "literal": "逢薨，子章嗣。",
    "idiomatic": "When Feng died, his son Han Zhang succeeded him."
  },
  "s0097": {
    "chinese": "市人立二十九歲卒，謚為荒侯。",
    "literal": "章薨，子始嗣。",
    "idiomatic": "When Zhang died, his son Han Shi succeeded him."
  },
  "s0098": {
    "chinese": "子他廣代侯。",
    "literal": "始薨，子昌嗣。",
    "idiomatic": "When Shi died, his son Han Chang succeeded him."
  },
  "s0099": {
    "chinese": "六歲，侯家舍人得罪他廣，怨之，乃上書曰：「荒侯市人病不能為人，令其夫人與其弟亂而生他廣，他廣實非荒侯子，不當代後。」",
    "literal": "昌薨，子充嗣。",
    "idiomatic": "When Chang died, his son Han Chong succeeded him."
  },
  "s0100": {
    "chinese": "詔下吏。",
    "literal": "充薨，子衡嗣。",
    "idiomatic": "When Chong died, his son Han Heng succeeded him."
  }
}