{
  "s551": "Tai.",
  "s552": "As retainer followed uprising in Dang, used detachment commander entered Han, as commandery captain attacked Ji, Ji died, transferred to attack Linjiang, attached to General Jia, meritorious service led to marquisate. As general attacked Yan.",
  "s553": "Seven. Year 6 month 8 Jia Zi day, Marquis Ding Dai Ye year 1.",
  "s554": "Seven",
  "s555": "Eight",
  "s556": "Three. Twenty. Year 4, Marquis Cai year 1.",
  "s557": "Two. Year 3, Marquis Cai convicted of rebellion, state abolished.",
  "s559": "Thirty-five",
  "s560": "Anguo.",
  "s561": "As guest followed uprising in Feng, as carriage commander separately pacified Dong commandery, Nanyang, followed to Baxiang. Entered Han, guarded Feng. Superior went east, because following battle unfavorable, escorted Emperor Hui, Lu Yuan out through Sui water, and firmly defended Feng, enfeoffed as Marquis of Yong, 5,000 households.",
  "s562": "Seven. Year 6 month 8 Jia Zi day, Marquis Wu Wang Ling year 1. Marquis Ding Anguo.",
  "s563": "Seven. In his sixth year, became Right Chancellor.",
  "s564": "Seven. One. Year 8, Marquis Ai Ji year 1.",
  "s565": "Twenty-three. Year 1, Marquis Zhong You year 1.",
  "s566": "Sixteen",
  "s567": "Twenty. Jianyuan year 1, month 3, Marquis An Bi Fang year 1. Eight. Yuanshou year 3, Marquis Ding year 1. Yuanding year 5, Marquis Ding convicted of tribute gold, state abolished.",
  "s568": "Twelve",
  "s569": "Lecheng.",
  "s570": "As attendant cavalry followed uprising in Dang middle, became cavalry general, entered Han, pacified Three Qins, became marquis. As commandery captain attacked Ji, attached to Guan Ying, killed Long Qu, changed to Marquis of Lecheng, 1,000 households.",
  "s571": "Seven. Year 6 month 8 Jia Zi day, Marquis Jie Ding Li year 1.",
  "s572": "Seven",
  "s573": "Eight",
  "s574": "Four. Eighteen. Year 5, Marquis Yi Ma Cong year 1. One. After year 7, Marquis Wu Ke year 1.",
  "s575": "Sixteen",
  "s576": "Twenty-five. Yuanding year 2, Marquis Yi year 1. Three. Yuanding year 5, Marquis Yi convicted of saying Marquis of Wuli was unprincipled, executed in market, state abolished.",
  "s577": "Forty-two",
  "s578": "Biyang.",
  "s579": "As retainer initially rose, served Lü Empress, Emperor Hui in Pei three years ten months, Lü Empress entered Chu, Shiqi followed one year, became marquis.",
  "s580": "Seven. Year 6 month 8 Jia Zi day, Marquis You Shen Shiqi year 1.",
  "s581": "Seven",
  "s582": "Eight",
  "s583": "Three. Twenty. Year 4, Marquis Ping year 1.",
  "s584": "Two. Year 3, Marquis Ping convicted of rebellion, state abolished.",
  "s586": "Fifty-nine",
  "s587": "Anping.",
  "s588": "As ye zhe Han King year 3 initially followed, pacified various lords, had merit rank, recommended Xiao He, meritorious service led to marquisate, 2,000 households.",
  "s589": "Seven. Year 6 month 8 Jia Zi day, Marquis Jing E Qianqiu year 1.",
  "s590": "Two. Five. Hui year 3, Marquis Jian Jia year 1.",
  "s591": "Seven. One. Year 8, Marquis Qing Ying year 1.",
  "s592": "Thirteen. Ten. Year 14, Marquis Yang Ji year 1.",
  "s593": "Fifteen. One. After year 3, Marquis Dan year 1.",
  "s594": "Eighteen. Yuanshou year 1, convicted of consorting with King of Huainan's daughter Ling, sent Huainan letter claiming to be subject and exert full effort, executed in market, state abolished.",
  "s595": "Sixty-one",
  "s596": "Kuai Cheng.",
  "s597": "As retainer followed uprising in Pei, to Baxiang, became marquis. Entered Han, pacified Three Qins, received fief in Chiyang. Attacked Xiang Yu's army at Xingyang, cut off transport road, followed exit, crossed Pingyin, encountered Han Xin's army at Xiangguo. Chu-Han treaty divided at Honggou, used Zhen as guarantee, battle unfavorable, dared not leave superior, became marquis, 3,300 households.",
  "s598": "Seven. Year 6 month 8 Jia Zi day, Marquis Zun Zhou Zhen year 1. Year 12 month 10 Yi Wei day, fixed Kuai Cheng.",
  "s599": "Seven",
  "s600": "Eight",
  "s601": "Five. Zhen died, son Chang succeeded. Committed crime, extinct, state abolished.",
  "s602": "Dan one. Zhong year 1, enfeoffed Zhen's son Marquis Kang Ying year 1. Eight. Zhong year 2, Marquis Zhong Ju year 1."
}
