{
  "s0099": "Fire enters, drought;",
  "s0100": "Metal, troops;",
  "s0101": "Water, floods.",
  "s0102": "Middle has three pillars;",
  "s0103": "Pillars not complete, troops arise.",
  "s0104": "Kui called Feng Shi, for ditches drains.",
  "s0105": "Lou for gathering crowds.",
  "s0106": "Wei for Heaven Granary.",
  "s0107": "Its south numerous stars called storehouse accumulations.",
  "s0108": "Mao called mane head, Hu star, for white clothes assembly.",
  "s0109": "Bi called sparse vehicle, for border troops, governs shooting hunting.",
  "s0110": "Its big star beside small star for attached ear.",
  "s0111": "Attached ear shakes moves, has slanderous chaos minister at side.",
  "s0112": "Mao Bi between for Heaven Street.",
  "s0113": "Its yin, yin states;",
  "s0114": "Yang, yang states.",
  "s0115": "Shen for White Tiger.",
  "s0116": "Three stars straight, this is balance stone.",
  "s0117": "Below has three stars, Dui, called punishment, for cutting weed affairs.",
  "s0118": "Its outer four stars, left right shoulders thighs.",
  "s0119": "Small three stars corner placed, called Zi Xi, for tiger head, governs guard travel affairs.",
  "s0120": "Its south has four stars, called Heaven Toilet.",
  "s0121": "Toilet below one star, called Heaven Arrow.",
  "s0122": "Arrow yellow then auspicious;",
  "s0123": "Blue white black, inauspicious.",
  "s0124": "Its west has curved nine stars, three places spread: one called Heaven Flag, two called Heaven Garden, three called Nine Roam.",
  "s0125": "Its east has big star called Wolf.",
  "s0126": "Wolf horns change color, many bandits thieves.",
  "s0127": "Below has four stars called Arc, straight Wolf.",
  "s0128": "Wolf compared to earth has big star, called South Pole Old Man.",
  "s0129": "Old Man appears, governance peaceful;",
  "s0130": "Not appears, troops arise.",
  "s0131": "Constantly at autumn equinox time observe at south suburb.",
  "s0132": "Attached ear enters Bi midst, troops arise.",
  "s0133": "North Palace Black Tortoise, Xu, Wei.",
  "s0134": "Wei for covering house;",
  "s0135": "Xu for weeping crying affairs.",
  "s0136": "Its south has numerous stars, called Feather Forest Heaven Army.",
  "s0137": "Army west for rampart, or called Yue.",
  "s0138": "Beside has one big star for North Fall.",
  "s0139": "North Fall if faint lost, army stars move horns more sparse, and five planets offend North Fall, enter army, army arises.",
  "s0140": "Fire metal water especially severe: fire, army worry;",
  "s0141": "Water, flood calamity;",
  "s0142": "Wood earth, army auspicious.",
  "s0143": "Wei east six stars, two two compared, called Si Kong.",
  "s0144": "Camp Room for pure temple, called Li Palace, Pavilion Way.",
  "s0145": "Milky Way middle four stars, called Heaven Driver.",
  "s0146": "Beside one star, called Wang Liang.",
  "s0147": "Wang Liang whips horses, chariots cavalry fill fields.",
  "s0148": "Beside has eight stars, cross Milky Way, called Heaven Kuang."
}
