{
  "s3769": "First year of Qin Duke Gong (He)",
  "s4030": "Twenty, Duke Wen died.",
  "s4038": "Eighteen, Duke Xuan died.",
  "s4039": "Eight, Jin attacked defeated us.",
  "s4040": "Nine, attacked Qi, hostage Qiang, troops stopped.",
  "s4042": "Twenty-three, King Zhuang died.",
  "s4046": "First year of Duke Jing of Cai (Gu)",
  "s4054": "First year of Duke Cheng of Lu (Hei Gong), spring, Qi took our Long.",
  "s4058": "First year of King Gong of Chu (Shen)",
  "s4070": "Two, with Jin attacked Qi, Qi returned Wen Yang to us, secretly allied with Chu.",
  "s4071": "Ten, Jin Xi Ke defeated duke at An, captured Peng Chou Fu.",
  "s4072": "Eleven, with Lu, Cao defeated Qi.",
  "s4074": "Two, autumn, Shen Gong Wu Chen stole Zheng Shu's mother fled to Jin, made her Xing grandee. Winter, attacked Wei, Lu, rescued Qi.",
  "s4076": "Eleven, Duke Mu died. With feudal lords defeated Qi, reversed invaded territory. Chu attacked us.",
  "s4086": "Three, assembled Jin, Song, Wei, Cao attacked Zheng.",
  "s4087": "Eleven, Duke Qing went to Jin, wished to make Jin king, Jin did not dare accept.",
  "s4088": "Twelve, began establishing six ministers. Led feudal lords attacked Zheng.",
  "s4091": "First year of Duke Gong of Song (Xia)",
  "s4092": "First year of Duke Ding of Wei (Zang)",
  "s4095": "Seven, attacked Zheng.",
  "s4096": "Seventeen, Jin led feudal lords attacked us.",
  "s4100": "Jia Xu",
  "s4102": "Four, duke went to Jin, Jin not respectful, duke wished to break Jin alliance with Chu.",
  "s4104": "Thirteen, Lu duke came, not respectful.",
  "s4106": "Four, Zi Fan rescued Zheng.",
  "s4112": "Eighteen, Jin Luan Shu took our Fan. Duke Xiang died.",
  "s4117": "Twenty, King Ding died.",
  "s4120": "Fourteen, Liang Mountain collapsed. Bo Zong hid the person but used his words.",
  "s4122": "Five, attacked Zheng, because broke us. Duke Dao of Zheng came to accuse.",
  "s4128": "First year of Duke Dao of Zheng (Fei), duke went to Chu to accuse.",
  "s4129": "First year of Duke Zhao of Yan",
  "s4133": "First year of King Jian",
  "s4136": "Fifteen, sent Luan Shu to rescue Zheng, then invaded Cai.",
  "s4142": "Seven, Jin invaded us.",
  "s4144": "Two, Duke Dao died. Chu attacked us, Jin sent Luan Shu to rescue.",
  "s4146": "First year of Wu Shou Meng",
  "s4152": "Sixteen, with Wu Chen began communicating with Wu to plot against Chu.",
  "s4508": "Fifteen, attacked Zheng.",
  "s4512": "Four, with Chu attacked Song, Jin led feudal lords attacked us, Qin came to rescue.",
  "s4711": "Five, feared Jin communicated with Chu, Yan Ying plotted.",
  "s4714": "Eleven, communicated with Qi. Led Chen, Cai attacked Zheng rescued Qi.",
  "s4717": "Twenty, Chu led us to attack Zheng.",
  "s4718": "Forty-three, Chu led us to attack Zheng.",
  "s4720": "Seventeen, Fan Xuan Zi governed. We requested to attack Chen.",
  "s4726": "Twenty-five, Qi attacked our northern borders, to avenge Xiao Bo's army.",
  "s4727": "Six, Jin attacked us, avenged Zhao Ge. Cui Zhu because Duke Zhuang seduced his wife, assassinated him, established his younger brother as Duke Jing.",
  "s4728": "Ten, attacked Qi to Gao Tang, avenged Tai Xing campaign.",
  "s4729": "Twenty-nine, duke went to Jin, alliance not concluded.",
  "s4730": "Twelve, Wu attacked us, to avenge naval campaign, shot and killed Wu king."
}
