{
  "s0596": "Its affairs all secret.",
  "s0597": "Next day, descended the shady path.",
  "s0598": "Bing Chen day, shan at Mount Tai lower northeast Suoran Mountain, like sacrificing to Hou Tu ritual.",
  "s0599": "The emperor all personally bowed and saw, wore upper yellow and completely used music.",
  "s0600": "Between Yangtze Huai one thatched hut three ridges as divine mat.",
  "s0601": "Five colored earth additionally mixed in feng.",
  "s0602": "Released distant strange beasts flying birds and white pheasants various things, considerably added rituals.",
  "s0603": "Rhinoceros oxen rhinos elephants and such not used.",
  "s0604": "All arrived at Mount Tai sacrificed to Hou Tu.",
  "s0605": "Feng and shan sacrifices;",
  "s0606": "that night as if had light, by day had white clouds rising from feng.",
  "s0607": "The emperor from shan returned, sat in Bright Hall, ministers successively offered long life.",
  "s0608": "Therefore edict to censor: 'I with insignificant body receive utmost honor, fearful and cautious fear not capable.",
  "s0609": "My virtue meager thin, not enlightened in rites music.",
  "s0610": "Repaired sacrifice Tai Yi, as if had image shadow light, slight as if had hope, shaken by strange things, wished to stop dared not, so ascended feng Mount Tai, reached Liangfu, then shan at Suoran.",
  "s0611": "Self-renewed, happily with scholars officials begin anew, grant people hundred households one ox ten shi wine, add year eighty orphans widows two pi cloth silk.",
  "s0612": "Remit Bo, Fenggao, Sheqiu, Licheng, no pay this year rents taxes.",
  "s0613": "Great amnesty realm, like Yi Mao amnesty order.",
  "s0614": "Places passed no repeat labor.",
  "s0615": "Affairs in past two years, all do not listen investigate.'",
  "s0616": "Also issued edict: 'In ancient times Son of Heaven five years one tour inspection, perform affairs Mount Tai, feudal lords had court lodge places.",
  "s0617": "Order feudal lords each maintain residence Mount Tai below.'",
  "s0619": "The emperor having already feng Mount Tai, no wind rain disaster, and magicians moreover said Penglai various spirits as if could be obtained, therefore emperor happily nearly encountered them, then again east to sea gazed, hoped to encounter Penglai.",
  "s0620": "Chariot master Zi Hou suddenly ill, one day died.",
  "s0621": "The emperor then departed, toured sea, north to Jieshi, toured from Liaoxi, passed northern border to Jiuyuan.",
  "s0622": "Fifth month, returned to Ganquan.",
  "s0623": "Officials said precious ding appeared as yuan ding, make this year Yuanfeng first year.",
  "s0624": "That autumn, had star fringed at Dongjing.",
  "s0625": "After ten plus days, had star fringed at Sanneng.",
  "s0626": "Vapor observer Wang Shuo said: 'Observer alone saw earth star emerge like melon, meal time then entered again.'",
  "s0627": "All officials said: 'Your Majesty established Han house feng shan, heaven its repay virtue star clouds.'",
  "s0629": "The next year winter, suburban sacrifice Yong five emperors.",
  "s0630": "Returned, bowed blessed sacrificed Tai Yi.",
  "s0631": "Assisting feast said: 'Virtue star shining extending, that good fortune auspicious.",
  "s0632": "Longevity star repeatedly emerging, deep radiance bright.",
  "s0633": "Faith star clearly appearing, emperor respectfully bows grand blessing feast.'",
  "s0635": "That spring, Gongsun Qing said saw divine person Donglai Mountain, as if cloud 'wishes to see emperor.'",
  "s0636": "The emperor therefore went to Gou Shi city, appointed Qing as middle grand master.",
  "s0637": "Then reached Donglai, stayed several days, nothing seen, saw great person traces.",
  "s0638": "Again sent magicians seek divine strange gather mushrooms medicine numbering in thousands.",
  "s0639": "This year drought.",
  "s0640": "Therefore emperor having gone without name, prayed Wanli Sha, passed sacrificed Mount Tai.",
  "s0641": "Returned to Houzi, personally oversaw blocking breached river, stayed two days, sank sacrifice departed.",
  "s0642": "Sent two ministers lead troops block breached river, moved two channels, restored Yu's old traces.",
  "s0643": "At this time having extinguished two Yue, Yue people brave then said 'Yue people custom ghosts, their sacrifices all see ghosts, several effective.",
  "s0644": "Formerly Dong Ou king respected ghosts, lived 160 years.",
  "s0645": "Later generations negligent, so declined wasted.'",
  "s0646": "Therefore ordered Yue shamans establish Yue blessing sacrifices, set up platform no altar, also sacrificed heaven spirits supreme deities hundred ghosts, and divined with chicken.",
  "s0647": "The emperor believed it, Yue sacrifices chicken divination began use."
}
