{
  "s611": "Du.",
  "s612": "Jin Weng Shu named Ri Di, as Xiongnu Xiutu king crown prince followed Hunye king led multitude five thousand, surrendered to Han returned righteousness, Palace Attendant, served Emperor Wu, aware captured Palace Attendant plotting rebellion Ma He Luo and others with merit, Marquis, three thousand households. In middle served Emperor Zhao, careful substantial, increased enfeoffment by three thousand households. Son Hong succeeded, became Carriage Escort Colonel, served Emperor Xuan.",
  "s613": "An Yang.",
  "s614": "Shangguan Jie, family in Longxi. Skilled at horse archery followed army. Gradually noble, served Emperor Wu, became Left General. Aware captured beheaded Palace Attendant plotting rebellion Ma He Luo younger brother Marquis Tong of Chonghe with merit, Marquis, three thousand households. In middle served Emperor Zhao, with Grand General Huo Guang contended for power, therefore plotted rebellion, clan exterminated, state abolished.",
  "s615": "Sang Le.",
  "s616": "Shangguan An. Because father Jie was general therefore noble, Palace Attendant, served Emperor Zhao. An's daughter became Emperor Zhao's consort, established as Empress therefore Marquis, three thousand households. Arrogant contentious, with Grand General Huo Guang contended for power, therefore with father and son plotted rebellion, clan exterminated, state abolished.",
  "s617": "Fu Ping.",
  "s618": "Zhang Anshi, family in Duling. As former Grand Minister of Justice Zhang Tang's son during Emperor Wu time gave service to Shangshu, became Shangshu Order. Served Emperor Zhao, careful substantial practiced affairs, became Guanglu Xun Right General. Assisted governance thirteen years, no faults, Marquis, three thousand households. And served Emperor Xuan, replaced Huo Guang as Grand Marshal, handled affairs, increased enfeoffment by sixteen thousand households. Son Yan Shou succeeded, became Grand Servant Treasurer, Palace Attendant.",
  "s619": "Yi Yang.",
  "s620": "Fu Jiezhi, family in Beidi. Followed army became Palace Attendant, became Ping Le Supervisor. Emperor Zhao time, assassinated foreign king, Son of Heaven issued edict saying: 'Ping Le Supervisor Fu Jiezhi sent to foreign country, killed Lou Lan king, to directly avenge resentment, not troubled teachers, has merit, therefore with fief one thousand three hundred households enfeoff Fu Jiezhi as Marquis of Yi Yang.' Son Li succeeded, disputed property mutually accused, committed crime, state abolished.",
  "s621": "Shang Li.",
  "s622": "Wang Shan, Qiren. Formerly Chancellor Historian, met Cavalry General Shangguan An plotted rebellion, Shan persuaded An together entered Chancellor, beheaded An. Shan with military merit became Marquis, three thousand households. Memorialized wished to govern people, became Grand Administrator of Dai. Person memorialized spoke of him, imprisoned should die, met amnesty, released as commoner, state abolished.",
  "s623": "Jian Ping.",
  "s624": "Du Yannian. As former Grand Minister of Justice Du Zhou's son gave service Grand General tent headquarters, discovered plotting rebellion Cavalry General Shangguan An and others crimes, enfeoffed as Marquis, fief two thousand seven hundred households, appointed Grand Servant Treasurer. First year, went out as Grand Administrator of Xihe. Wufeng third year, entered as Grand Minister of Justice.",
  "s625": "Yi Yang.",
  "s626": "Ren Gong. As former Shanglin Guard captured checked plotting rebellion Left General Shangguan Jie, killed at convenient gate, enfeoffed as Marquis, two thousand households. Later became Grand Master of Ceremonies, and performed Commander of Guards affairs. Frugal careful trustworthy, ended with longevity, transmitted to descendants.",
  "s627": "Yi Cheng.",
  "s628": "Yan Cang. As former Grand General tent headquarters army official discovered plotting rebellion Cavalry General Shangguan An crime had merit, enfeoffed Marquis, fief two thousand households. Became Grand Administrator of Runan, had able reputation.",
  "s629": "Yi Chun.",
  "s630": "Wang Xun, family in Qi. Originally small official assistant historian, gradually promoted to Right Auxiliary Colonel. Emperor Wu frequently visited Fufeng commandery, Xun together arranged preparation, appointed Right Fufeng. To Emperor Zhao time, replaced Sang Hongyang as Grand Minister of Justice. Yuanfeng third year, replaced Tian Qianqiu as Chancellor, enfeoffed two thousand households. Stood two years, person memorialized spoke of tyranny, suicide, not clear. Son succeeded, became Dependent State Colonel.",
  "s631": "An Ping.",
  "s632": "Yang Chang, family in Huayin. Formerly gave service Grand General tent headquarters, gradually promoted to Grand Agrarian, became Grand Minister of Justice. Yuanfeng sixth year, replaced Wang Xun as Chancellor, enfeoffed two thousand households. Stood two years, died of illness. Son Ben succeeded, thirteen years died of illness. Son Weng Jun succeeded, became Superintendent of Dependent States. Three years, because maternal uncle Yun crime spoke evil words, imprisoned should die, obtained pardon, became commoner, state abolished.",
  "s635": "Yang Ping.",
  "s636": "Cai Yi, family in Wen. Formerly teacher received Han poetry, became erudite. Gave service Grand General tent headquarters, became Ducheng gate guard. Entered Palace Attendant, taught Emperor Zhao Han poetry, became Grand Minister of Justice. At this time aged eighty, declining old, constantly two people supported then could walk. Yet high officials ministers discussed, believed as ruler's teacher, should become chancellor. With Yuanping first year replaced Yang Chang as Chancellor, enfeoffed two thousand households. Died of illness, completely no posterity, state abolished.",
  "s637": "Fu Yang.",
  "s638": "Wei Xian, family in Lu. Mastered poetry, rites, Shangshu, became erudite, taught Lu great Confucian, entered Palace Attendant, became Emperor Zhao teacher, promoted to Guanglu Dafu, Grand Honglu, Changxin Shaofu. Believed as ruler teacher, Benshi third year replaced Cai Yi as Chancellor, enfeoffed Marquis of Fuyang, one thousand eight hundred households. Served as Chancellor five years, much benevolence, not practiced official affairs, dismissed chancellor went to residence, died of illness. Son Xuan Cheng succeeded, became Grand Master of Ceremonies. Convicted of temple sacrifice rode horse, title stripped, became Guan Nei Hou.",
  "s639": "Ping Ling.",
  "s640": "Fan Mingyou, family in Longxi. With family generation practiced foreign affairs, sent to protect Western Qiang. Served Emperor Zhao, appointed Diao General, attacked Wuhuan with merit, Marquis, two thousand households. Took Huo Guang daughter as wife. Diji fourth year, with various Huo sons Yu etc. plotted rebellion, clan exterminated, state abolished.",
  "s641": "Ying Ping.",
  "s642": "Zhao Chongguo. As Longxi cavalry soldier followed army obtained office, Palace Attendant, served Emperor Wu. Frequently led troops attacked Xiongnu had merit, became Protector Army Colonel, Palace Attendant, served Emperor Zhao. Emperor Zhao collapsed, discussed establishing Emperor Xuan, decided doubt settled plan, with pacified ancestral temple merit, Marquis, enfeoffed two thousand five hundred households.",
  "s643": "Yang Cheng.",
  "s644": "Tian Yannian. As army official served Emperor Zhao; discovered Shangguan Jie plotting rebellion affair, later detained not obtained enfeoffment, became Grand Agrarian. Originally created abolished Changyi king discussed establishing Emperor Xuan, decided doubt settled plan, with pacified ancestral temple merit, Marquis, two thousand seven hundred households. Met Emperor Zhao collapse, just presented affairs simultaneously urgent, therefore stole capital money thirty million. Discovered, suicide, state abolished.",
  "s645": "Ping Qiu.",
  "s646": "Wang Qian, family in Wei. Served as Shangshu Attendant, practiced knife brush writing. Palace Attendant, served Emperor Zhao. Emperor collapsed, established Emperor Xuan, decided doubt settled plan, with pacified ancestral temple merit, Marquis, two thousand households. Became Guanglu Dafu, rank middle two thousand shi. Convicted of receiving various nobles gold money property. Leaked palace affairs, executed, state abolished.",
  "s647": "Le Cheng.",
  "s648": "Huo Shan. Shan was Grand General Guang's elder brother's son. Guang not yet dead memorialized saying: 'Minister's elder brother Cavalry General Qu Bing followed army had merit, died of illness, granted posthumous title Jing Huan Hou, completely no posterity, minister Guang wishes with enfeoffed Dong Wuyang three thousand five hundred households divided with Shan.' Son of Heaven permitted, appointed Shan as Marquis. Later convicted of plotting rebellion, clan exterminated, state abolished.",
  "s649": "Guan Jun.",
  "s650": "Huo Yun. With Grand General elder brother Cavalry General Di Sun as Marquis. Diji third year, Son of Heaven issued edict saying 'Cavalry General Qu Bing attacked Xiongnu had merit, enfeoffed as Guan Jun Hou. Died, son Marquis succeeded, died of illness no posterity. Spring and Autumn righteousness, good goodness extends to descendants, therefore with fief three thousand households enfeoff Yun as Guan Jun Hou.' Later convicted of plotting rebellion, clan exterminated, state abolished.",
  "s651": "Ping En.",
  "s652": "Xu Guanghan, family Changyi. Convicted of affairs descended silkworm room, alone had one daughter, married to her. Emperor Xuan not yet established, originally with Guanghan entered exited mutually familiar, fortune tellers said should greatly noble, therefore Guanghan bestowed favor very thick. Diji third year, enfeoffed as Marquis, fief three thousand households. Died of illness no posterity, state abolished.",
  "s653": "Chang Shui.",
  "s654": "Tian Guangming. Formerly Palace Attendant, became Major, gradually promoted to Nanhun Grand Administrator, Huaiyang Grand Administrator, Honglu, Left Fengyi. Emperor Zhao collapsed, discussed abolished Changyi king, established Emperor Xuan, decided doubt settled plan, with pacified ancestral temple merit. Benshi third year, enfeoffed as Marquis, fief two thousand three hundred households. Became Grand Minister of Justice. Later became Qilian General, attacked Xiongnu, army not reached hostage, should die, suicide, state abolished.",
  "s655": "Gao Ping.",
  "s656": "Wei Xiang, family in Jiyin. Young studied Yi, became headquarters soldier historian, with worthy good selected as Maoling magistrate, promoted Henan Grand Administrator. Convicted of bandits killed innocent, imprisoned should die, met amnesty, dismissed as commoner. Had edict guarded Maoling magistrate, became Yangzhou Inspector, entered as Admonishing Official Dafu, again became Henan Grand Administrator, promoted Grand Agrarian, Grand Minister of Justice. Diji third year, slandered Wei Xian, replaced as Chancellor, enfeoffed one thousand five hundred households. Died of illness, eldest son Bin succeeded, convicted of temple sacrifice lost marquisate.",
  "s657": "Bo Wang.",
  "s658": "Xu Zhong Weng. With Ping En Marquis Xu Guanghan younger brother enfeoffed as Marquis, fief two thousand households. Also formerly had private favor, became Chang Le Guard Commander. Died, son Yan Nian succeeded.",
  "s659": "Le Ping",
  "s660": "Xu Weng Sun. With Ping En Marquis Xu Guanghan youngest younger brother therefore as Marquis, enfeoffed two thousand households. Appointed Strong Crossbow General, attacked broke Western Qiang, returned, again appointed Grand Marshal, Guanglu Xun. Also formerly had private favor, therefore obtained enfeoffment. Addicted to wine fond of sex, died early of illness. Son Tang succeeded.",
  "s661": "Jiang Ling"
}
