{
  "s0001": "Xiang Ji was from Xiapi, styled Yu.",
  "s0002": "When he first rose up, he was twenty-four years old.",
  "s0003": "His uncle Xiang Liang; Liang's father was the Chu general Xiang Yan, who was executed by the Qin general Wang Jian.",
  "s0004": "The Xiang clan generation after generation served as Chu generals, enfeoffed at Xiang, therefore surnamed Xiang.",
  "s0005": "When Xiang Ji was young, he studied writing but did not succeed, then went to study swordsmanship, and again did not succeed.",
  "s0006": "Xiang Liang was angry with him.",
  "s0007": "Ji said: 'Writing is enough only to record names and surnames.",
  "s0008": "Swordsmanship fights one man, not worth studying; study to fight ten thousand men.'",
  "s0009": "Therefore Xiang Liang taught Ji military strategy; Ji was greatly pleased, grasped the general meaning, but again would not complete the study.",
  "s0010": "Xiang Liang once had a warrant from Queyang, so asked the Qi prison clerk Cao Jiu to write a letter to the Queyang prison clerk Sima Xin, and through precedents it was resolved.",
  "s0011": "Xiang Liang killed someone, and with Ji fled enmity to Wu.",
  "s0012": "Wu generals were often subordinate to Xiang Liang.",
  "s0013": "When Chen Sheng first rose, the Wu guards wanted to respond, but Xiang Liang said: 'Chen Sheng is a commoner, cannot amount to much.'",
  "s0014": "When the Wu guards heard of the defeat of Chen Sheng and Wu Guang, they planned to kill Xiang Liang.",
  "s0015": "Xiang Liang escaped, Ji said: 'I can take them.'",
  "s0016": "Xiang Liang said: 'The world is in chaos, ghosts and spirits are moving, it is the time for great action.'",
  "s0017": "He forged a letter from Chen Sheng to the Wu guards, ordering Xiang Liang to lead the Wu troops, Xiang Liang as general, Ji as deputy general.",
  "s0018": "He summoned all the worthy and strong of Wu, and the young men who followed him numbered eight thousand.",
  "s0019": "He led them east, attacking the Qin forces.",
  "s0020": "When Xiang Liang reached Xiapi, he heard that Chen Sheng had been defeated and killed.",
  "s0021": "He then summoned the nobles of the six states, established Xiang Liang as the leader of the nobles.",
  "s0022": "He attacked Dong'e, took it.",
  "s0023": "Attacked Yuanqu, took it.",
  "s0024": "Attacked Chenggao, took it.",
  "s0025": "Attacked Dingtao, defeated Qin forces there.",
  "s0026": "Xiang Liang greatly expanded, his troops numbered sixty to seventy thousand.",
  "s0027": "He made Yuan Gong the prime minister, Fan Zeng the strategist.",
  "s0028": "Fan Zeng advised Xiang Liang to establish a descendant of the Chu royal family as king to win the people's hearts.",
  "s0029": "He found Xiong Xin, grandson of King Huai of Chu, established him as King Huai of Chu, with Pengcheng as capital.",
  "s0030": "King Huai made Xiang Liang 'Supreme General', gave him a seal, ordered him to attack the west.",
  "s0031": "Xiang Liang attacked Yongqiu, took it.",
  "s0032": "Attacked Dingtao again, took it.",
  "s0033": "Attacked External Huang, took it.",
  "s0034": "Attacked Chenliu, took it.",
  "s0035": "Xiang Liang grew arrogant, did not listen to advice.",
  "s0036": "The Qin general Zhang Han attacked Xiang Liang, defeated him at Dingtao, Xiang Liang was killed.",
  "s0037": "Xiang Liang's death caused the Chu army to lose heart, the nobles scattered.",
  "s0038": "King Huai moved the capital to Yinque.",
  "s0039": "Xiang Liang's nephew Xiang Ji and Fan Zeng collected the remaining troops, retreated east to Pengcheng.",
  "s0040": "They sent messengers to seek Xiang Liang's body, buried it in Yinling."
}

