{
  "s0001": "Tai Gong Wang Lu Shang, eastern sea person.",
  "s0002": "His ancestors once served as Four Peaks, assisted Yu control floodwaters greatly meritorious.",
  "s0003": "Yu Xia time enfeoffed at Lu, or enfeoffed at Shen, surname Jiang.",
  "s0004": "Xia Shang time, Shen Lu or enfeoffed branch collateral descendants, or became commoners, Shang their later descendants.",
  "s0005": "Originally surname Jiang, followed his fief surname, so called Lu Shang.",
  "s0006": "Lu Shang probably once poor, aged, used fishing hooks deceived Zhou Xi Bo.",
  "s0007": "Xi Bo about to go hunting, divined, said 'what obtained not dragon not boar not tiger not bear;",
  "s0008": "what obtained hegemon king's assistant'.",
  "s0009": "Therefore Zhou Xi Bo hunted, indeed met Tai Gong at Wei's north, spoke greatly pleased, said: 'From my previous lord Tai Gong said 'should have sage adapt Zhou, Zhou uses rise'.",
  "s0010": "You truly this? My Tai Gong hoped you long.'",
  "s0011": "Therefore titled him 'Tai Gong Wang', loaded with together returned, established as teacher.",
  "s0012": "Some say, Tai Gong broad knowledge, once served Zhou.",
  "s0013": "Zhou no way, left him.",
  "s0014": "Traveled persuaded feudal lords, nowhere met, finally west returned Zhou Xi Bo.",
  "s0015": "Some say, Lu Shang recluse, hidden seashore.",
  "s0016": "Zhou Xi Bo imprisoned You Li, San Yi Sheng, Hong Tian originally knew and summoned Lu Shang.",
  "s0017": "Lu Shang also said 'I heard Xi Bo worthy, moreover good support elderly, why not go'.",
  "s0018": "Three people for Xi Bo sought beautiful women rare objects, presented to Zhou to redeem Xi Bo.",
  "s0019": "Xi Bo able exit, returned country.",
  "s0020": "Speak Lu Shang so served Zhou though different, but main as Wen Wu teacher.",
  "s0021": "Zhou Xi Bo Chang's escape You Li return, with Lu Shang secretly planned cultivate virtue to overthrow Shang government, his affairs many military authority and strange strategies, so later generations speak military and Zhou's hidden authority all take Tai Gong as fundamental plan.",
  "s0022": "Zhou Xi Bo government peaceful, to adjudicating Yu Rui dispute, poets praised Xi Bo received mandate called Wen Wang.",
  "s0023": "Attacked Chong, Mi Xu, Quan Yi, greatly built Feng yi.",
  "s0024": "World three parts, its two belonged Zhou, Tai Gong's strategy planning most.",
  "s0025": "Wen Wang collapsed, Wu Wang ascended throne.",
  "s0026": "Nine years, wished repair Wen Wang enterprise, east attacked to observe feudal lords gathered or not.",
  "s0027": "Troops marched, Shi Shang Fu left held yellow axe, right grasped white banner to swear, said: 'Blue rhinoceros blue rhinoceros, gather your multitudes, give you boats oars, later arrive behead!'",
  "s0028": "Then arrived Meng Jin.",
  "s0029": "Feudal lords not appointed but assembled eight hundred feudal lords.",
  "s0030": "Feudal lords all said: 'Zhou can attack.'",
  "s0031": "Wu Wang said: 'Not yet.'",
  "s0032": "Returned troops, with Tai Gong made this great oath.",
  "s0033": "Resided two years, Zhou killed Wang Zi Bi Gan, imprisoned Ji Zi.",
  "s0034": "Wu Wang about attack Zhou, divined tortoise omen, not auspicious, wind rain violently arrived.",
  "s0035": "Group nobles all feared, only Tai Gong strongly urged Wu Wang, Wu Wang then proceeded.",
  "s0036": "Eleventh year first month Jia Zi, swore at Mu Ye, attacked Shang Zhou.",
  "s0037": "Zhou troops defeated routed.",
  "s0038": "Zhou fled back, ascended Lu Tai, then pursued beheaded Zhou.",
  "s0039": "Next day, Wu Wang stood at altar, group nobles presented bright water, Wei Kang Shu spread cloth mats, Shi Shang Fu led sacrificial animal, Shi Yi wrote blessing, to inform spirits punish Zhou's crimes.",
  "s0040": "Distributed Lu Tai's money, opened Ju Qiao's grain, to relieve poor people.",
  "s0041": "Sealed Bi Gan tomb, released Ji Zi prisoner.",
  "s0042": "Moved nine tripods, repaired Zhou government, with world began anew.",
  "s0043": "Shi Shang Fu planned most.",
  "s0044": "Therefore Wu Wang already pacified Shang became king world, enfeoffed Shi Shang Fu at Qi Ying Qiu.",
  "s0045": "East went to state, road stayed went slow.",
  "s0046": "Inn people said: 'I heard opportunity hard get easy lose.",
  "s0047": "Guest sleeps very peaceful, probably not go to state people.'",
  "s0048": "Tai Gong heard it, night clothed went, by dawn arrived state.",
  "s0049": "Lu Shang arrived state, repaired government, followed their customs, simplified their rites, opened merchant artisan occupations, facilitated fish salt benefits, people many belonged Qi, Qi became great country.",
  "s0050": "及周成王少時，管蔡作亂，淮夷畔周，乃使召康公命太公曰：「東至海，西至河，南至穆陵，北至無棣，五侯九伯，實得征之。」"
}
