{
  "s0051": {
    "chinese": "營丘邊萊。",
    "literal": "Yingqiu bordered Lai.",
    "idiomatic": "Yingqiu bordered the state of Lai."
  },
  "s0052": {
    "chinese": "萊人，夷也，會紂之亂而周初定，未能集遠方，是以與太公爭國。",
    "literal": "Lai people, Yi barbarians, met Zhou tyranny while Zhou newly established, unable gather distant regions, therefore contended with Tai Gong for state.",
    "idiomatic": "The people of Lai were Yi barbarians. Taking advantage of King Zhou's tyranny while the Zhou dynasty was still establishing itself and unable to control distant regions, they contended with Tai Gong for control of the state."
  },
  "s0053": {
    "chinese": "太公至國，修政，因其俗，簡其禮，通商工之業，便魚鹽之利，而人民多歸齊，齊為大國。",
    "literal": "Tai Gong arrived state, reformed governance, followed their customs, simplified their rituals, opened merchant artisan professions, facilitated fish salt profits, and people many returned Qi, Qi became great state.",
    "idiomatic": "When Tai Gong arrived in his state, he reformed the governance, adapted to local customs, simplified the rituals, opened up trade and craftsmanship, facilitated the profits from fish and salt, and many people came to settle in Qi, making it a great state."
  },
  "s0054": {
    "chinese": "及周成王少時，管蔡作亂，淮夷畔周，乃使召康公命太公曰：「東至海，西至河，南至穆陵，北至無棣，五侯九伯，實得征之。」",
    "literal": "And Zhou Cheng Wang young time, Guan Cai made rebellion, Huai Yi rebelled Zhou, then sent Zhao Kang Gong commanded Tai Gong said 'East to sea, west to river, south to Mu Ling, north to Wu Di, five marquises nine earls, truly may campaign against them.'",
    "idiomatic": "When King Cheng of Zhou was young, the Guanshu and Caishu rebelled, and the Huai Yi barbarians revolted against Zhou. The king sent Duke Zhao Kang to command Tai Gong: 'From the eastern sea to the western Yellow River, from southern Muling to northern Wudi, you may campaign against the five marquises and nine earls.'"
  },
  "s0055": {
    "chinese": "齊由此得征伐，為大國。",
    "literal": "Qi thus obtained campaign authority, became great state.",
    "idiomatic": "Qi thus obtained the authority to campaign against others and became a great state."
  },
  "s0056": {
    "chinese": "都營丘。",
    "literal": "Capital Yingqiu.",
    "idiomatic": "The capital was at Yingqiu."
  },
  "s0057": {
    "chinese": "蓋太公之卒百有餘年，子丁公呂伋立。",
    "literal": "Probably Tai Gong died over hundred years, son Ding Gong Lu Ji established.",
    "idiomatic": "Over a hundred years after Tai Gong's death, his son Duke Ding Lü Ji ascended the throne."
  },
  "s0058": {
    "chinese": "丁公卒，子乙公得立。",
    "literal": "Ding Gong died, son Yi Gong De established.",
    "idiomatic": "Duke Ding died, and his son Duke Yi De ascended the throne."
  },
  "s0059": {
    "chinese": "乙公卒，子癸公慈母立。",
    "literal": "Yi Gong died, son Gui Gong Ci Mu established.",
    "idiomatic": "Duke Yi died, and his son Duke Gui Ci Mu ascended the throne."
  },
  "s0060": {
    "chinese": "癸公卒，子哀公不辰立。",
    "literal": "Gui Gong died, son Ai Gong Bu Chen established.",
    "idiomatic": "Duke Gui died, and his son Duke Ai Bu Chen ascended the throne."
  },
  "s0061": {
    "chinese": "哀公時，紀侯譖之周，周烹哀公而立其弟靜，是為胡公。",
    "literal": "Ai Gong time, Ji Hou slandered him to Zhou, Zhou boiled Ai Gong and established his younger brother Jing, this was Hu Gong.",
    "idiomatic": "During Duke Ai's reign, the Marquis of Ji slandered him to the Zhou court. The Zhou king had Duke Ai executed by boiling and installed his younger brother Jing as duke, who became Duke Hu."
  },
  "s0062": {
    "chinese": "胡公徙都薄泵，而當周夷王之時。",
    "literal": "Hu Gong moved capital Bo Bei, and during Zhou Yi Wang time.",
    "idiomatic": "Duke Hu moved the capital to Bobei, during the reign of King Yi of Zhou."
  },
  "s0063": {
    "chinese": "哀公之同母少弟山怨胡公，乃與其黨率營丘人襲攻殺胡公而自立，是為獻公。",
    "literal": "Ai Gong same mother younger brother Shan resented Hu Gong, then with his faction led Yingqiu people surprise attacked killed Hu Gong and self-established, this was Xian Gong.",
    "idiomatic": "Duke Ai's younger half-brother Shan resented Duke Hu. He allied with his followers, led the people of Yingqiu in a surprise attack, killed Duke Hu, and established himself as duke, becoming Duke Xian."
  },
  "s0064": {
    "chinese": "獻公元年，盡逐胡公子，因徙薄泵都，治臨菑。",
    "literal": "Xian Gong first year, completely expelled Hu Gong sons, thus moved Bobei capital, governed Linzi.",
    "idiomatic": "In Duke Xian's first year, he completely expelled Duke Hu's sons, moved the capital from Bobei, and established his government at Linzi."
  },
  "s0065": {
    "chinese": "九年，獻公卒，子武公壽立。",
    "literal": "Nine years, Xian Gong died, son Wu Gong Shou established.",
    "idiomatic": "In the ninth year, Duke Xian died, and his son Duke Wu Shou ascended the throne."
  },
  "s0066": {
    "chinese": "武公九年，周厲王出奔，居彘。",
    "literal": "Wu Gong nine years, Zhou Li Wang fled, resided Zhi.",
    "idiomatic": "In Duke Wu's ninth year, King Li of Zhou fled and took residence at Zhi."
  },
  "s0067": {
    "chinese": "十年，王室亂，大臣行政，號曰「共和」。",
    "literal": "Ten years, royal house chaotic, ministers administered government, called 'Republican'.",
    "idiomatic": "In the tenth year, the royal house was in chaos, and ministers administered the government, which was called the 'Republican' period."
  },
  "s0068": {
    "chinese": "二十四年，周宣王初立。",
    "literal": "Twenty four years, Zhou Xuan Wang first established.",
    "idiomatic": "In the twenty-fourth year, King Xuan of Zhou first ascended the throne."
  },
  "s0069": {
    "chinese": "二十六年，武公卒，子厲公無忌立。",
    "literal": "Twenty six years, Wu Gong died, son Li Gong Wu Ji established.",
    "idiomatic": "In the twenty-sixth year, Duke Wu died, and his son Duke Li Wu Ji ascended the throne."
  },
  "s0070": {
    "chinese": "厲公暴虐，故胡公子復入齊，齊人欲立之，乃與攻殺厲公。",
    "literal": "Li Gong tyrannical cruel, therefore Hu Gong son again entered Qi, Qi people wished establish him, then with attacked killed Li Gong.",
    "idiomatic": "Duke Li was tyrannical and cruel. Therefore, Duke Hu's son entered Qi again, and the people of Qi wished to establish him as duke, so they attacked and killed Duke Li."
}
}
