{
  "s0099": "People called Yao worthy, because he yielded world to Xu You, Xu You not accepted, had yielded world name but actually not lost world.",
  "s0100": "Now Wang with country yields Zi Zhi, Zi Zhi must dare not accept, is Wang with Yao same walk.'",
  "s0101": "Yan Wang because entrusted country to Zi Zhi, Zi Zhi greatly heavy.",
  "s0102": "Someone said: 'Yu recommended Yi, already made Qi people officials.",
  "s0103": "To old, considered Qi people insufficient entrusted world, transmitted to Yi.",
  "s0104": "Already Qi with party attacked Yi, seized it.",
  "s0105": "World said Yu name transmitted world to Yi, already actually made Qi self take it.",
  "s0106": "Now Wang says entrusts country to Zi Zhi, officials none not crown prince people, is name entrusts Zi Zhi but actually crown prince administers affairs.'",
  "s0107": "Wang because collected seals self three hundred stone officials above gave Zi Zhi.",
  "s0108": "Zi Zhi south faced walked king affairs, Kuai old not listened government, turned became minister, country affairs all decided by Zi Zhi.",
  "s0109": "Third year, country greatly chaotic, hundred clans terrified.",
  "s0110": "General Shi Bei with crown prince Ping plotted, about attack Zi Zhi.",
  "s0111": "Various generals told Qi Min Wang said: 'Take advantage attack it, break Yan must.'",
  "s0112": "Qi Wang because made person told Yan crown prince Ping said: 'I heard crown prince righteousness, about abolish private establish public, regulated lord minister righteousness, clear father son position.",
  "s0113": "My country small, insufficient for before after.",
  "s0114": "Although, then only crown prince so command.'",
  "s0115": "Crown prince because gathered party assembled multitudes, general Shi Bei surrounded gong palace, attacked Zi Zhi, not conquered.",
  "s0116": "General Shi Bei and hundred clans returned attacked crown prince Ping, general Shi Bei died, displayed corpse.",
  "s0117": "Because constructed difficulty several months, died several ten thousand, multitudes terrified, hundred clans separated intentions.",
  "s0118": "Meng Ke told Qi Wang said: 'Now attack Yan, this Wen, Wu time, cannot lose.'",
  "s0119": "Wang because ordered Zhang Zi led five capitals troops, took advantage north land multitudes attacked Yan.",
  "s0120": "Soldiers not battled, city gates not closed, Yan lord Kuai died, Qi greatly won.",
  "s0121": "Yan Zi Zhi fled second year, Yan people together established crown prince Ping, this was Yan Zhao Wang.",
  "s0122": "Yan Zhao Wang after broken Yan then ascended position, lowly body thick bribes recruited worthy people.",
  "s0123": "Told Guo Wei said: 'Qi took advantage my country chaos attacked broke Yan, I extremely know Yan small strength few, insufficient to report.",
  "s0124": "But sincerely obtain worthy scholars with govern country, to snow previous wang shame, my wish.",
  "s0125": "Master see possible, obtain body serve him.'",
  "s0126": "Guo Wei said: 'Wang must wish bring scholars, first from Wei begin.",
  "s0127": "Moreover worthy than Wei, how far thousand li!'",
  "s0128": "Then Zhao Wang for Wei changed built palace served him as teacher.",
  "s0129": "Yue Yi from Wei went, Zou Yan from Qi went, Ju Xin from Zhao went, scholars contended went Yan.",
  "s0130": "Yan Wang Kuai dead asked orphan, with hundred clans same sweet bitter.",
  "s0131": "Twenty-eighth year, Yan country abundant rich, scholars troops happy brave light battle, then used Yue Yi as upper general, with Qin, Chu, three Jin united plotted attacked Qi.",
  "s0132": "Qi troops defeated, Min Wang went fleeing outside.",
  "s0133": "Yan troops alone pursued north, entered to Lin Zi, completely took Qi treasures, burned their palace chambers ancestral temples.",
  "s0134": "Qi cities not surrendered, only Liao, Ju, Ji Mo, rest all belonged Yan, six years.",
  "s0135": "Wu Cheng Wang seventh year, Qi Tian Dan attacked us, captured Zhong Yang.",
  "s0136": "Thirteenth year, Qin defeated Zhao at Chang Ping forty remaining ten thousand.",
  "s0137": "Fourteenth year, Wu Cheng Wang died, son Xiao Wang established.",
  "s0138": "Xiao Wang first year, Qin surrounded Han Dan released went.",
  "s0139": "Third year died, son now Wang Xi established.",
  "s0140": "Now Wang Xi fourth year, Qin Zhao Wang died.",
  "s0141": "Yan Wang ordered chancellor Li Fu allied pleased Zhao, with five hundred gold for Zhao Wang wine.",
  "s0142": "Returned reported Yan Wang said: 'Zhao Wang strong all died Chang Ping, their orphans not grown, can attack.'",
  "s0143": "Wang summoned Chang Guo Jun Yue Xian asked it.",
  "s0144": "Answered said: 'Zhao four battle country, its people accustomed troops, cannot attack.'",
  "s0145": "Wang said: 'I with five attack one.'",
  "s0146": "Answered: 'Cannot.'",
  "s0147": "Yan Wang angered, group ministers all considered can."
}
