{
  "s0200": "Have great blessing, must have ritual to take joy in it: joy sorrow divisions, all with ritual end.",
  "s0201": "Music is giving;",
  "s0202": "Ritual is receiving.",
  "s0203": "Music, takes joy in what gives birth to it;",
  "s0204": "Ritual returns to what begins it.",
  "s0205": "Music displays virtue, ritual repays feeling returns to beginning.",
  "s0206": "What is called great carriage, is the Son of Heaven's chariot;",
  "s0207": "Dragon banner nine tassels, is the Son of Heaven's standard;",
  "s0208": "Blue black edged, is the Son of Heaven's canopy turtle;",
  "s0209": "Followed by herds of cattle sheep, then this is to gift feudal lords.",
  "s0210": "Music is feelings that cannot be changed;",
  "s0211": "Ritual is principles that cannot be altered.",
  "s0212": "Music unites sameness, ritual distinguishes difference, ritual music's explanation penetrates human feelings.",
  "s0213": "Exhaust root know change, music's feeling;",
  "s0214": "Manifest sincerity remove falsity, ritual's constant.",
  "s0215": "Ritual music follows heaven earth's sincerity, reaches spirits' virtue, descends raises high low spirits, and congeals refined coarse bodies, leads father son ruler minister measures.",
  "s0216": "Thus great person raises ritual music, then heaven earth will become bright.",
  "s0217": "Heaven earth joyful unite, yin yang mutually obtain, warm nurture cover nourish ten thousand things, then grass trees flourish, regions sprout reach, feathered winged strive, horned tusked born, hibernating insects appear crawl, feathered warm brood, furred pregnant produce, womb born not abort egg born not break, then music's way returns there.",
  "s0218": "Music, not meaning yellow bell great lu string song shield axe, music's minor section, thus children dance it;",
  "s0219": "Spread mats seats, arrange zun zu, arrange ban dou, with ascending descending as ritual, ritual's minor section, thus officials manage it.",
  "s0220": "Music master distinguishes sounds poems, thus north facing strings;",
  "s0221": "Ancestral priest distinguishes ancestral temple ritual, thus behind corpse;",
  "s0222": "Funeral priest distinguishes mourning ritual, thus behind master.",
  "s0223": "Thus virtue complete then above, skill complete then below;",
  "s0224": "Conduct complete then first, affairs complete then after.",
  "s0225": "Thus former kings have above below, have first after, then can have system over the world.",
  "s0226": "Music is what sages take joy in, and can improve people's hearts.",
  "s0227": "Its moving people deep, its wind shifts customs easy, thus former kings established its teaching.",
  "s0228": "People have blood qi heart knowing nature, but no joy sorrow happiness anger constants, respond to stimulation arise from things and move, then heart methods take form.",
  "s0229": "Thus subtle withered declining sounds made, and people think worry;",
  "s0230": "Smooth slow easy elaborate patterned simple sectioned sounds made, and people peaceful joyful;",
  "s0231": "Coarse fierce violent rising striving end broad flourishing sounds made, and people firm resolute;",
  "s0232": "Pure straight upright correct solemn sincere sounds made, and people solemn respectful;",
  "s0233": "Broad ample fleshy good yielding formed harmonious moving sounds made, and people benevolent loving;",
  "s0234": "Flowing deviant evil scattered foreign formed washed overflowing sounds made, and people licentious chaotic.",
  "s0235": "Thus former kings based on feelings nature, examined measurements numbers, formed ritual righteousness, united vital energy harmony, guided five constants conduct, made yang without scattering, yin without dense, firm qi not angry, soft qi not frightened, four flourishing intersect at center and issue at outside, all settle their positions without mutually seizing.",
  "s0236": "Then established study grades, broadened rhythm, simplified patterns colors, to rope virtue thickness.",
  "s0237": "Classify small large proportions, compare end beginning order, to symbolize affairs conduct, make close distant noble base elder younger male female principles all appear in music: thus said 'music observe its deep'.",
  "s0238": "Soil exhausted then grass trees not grow, water troubled then fish turtles not big, qi declined then living things not nurture, age chaotic then ritual waste and music licentious.",
  "s0239": "Thus its sounds mournful without solemnity, joyful without peace, casual easy to violate sections, flowing drowning to forget root.",
  "s0240": "Broad then contains evil.",
  "s0241": "Narrow then desires, affected by washed wandering qi and extinguish peaceful virtue, thus gentlemen despise it.",
  "s0242": "All evil sounds move people and adverse qi respond to them, adverse qi forms images and licentious music arises.",
  "s0243": "Correct sounds move people and yielding qi respond to them, yielding qi forms images and harmonious music arises.",
  "s0244": "Leader harmony have response, returning deviant curved straight each return to their division, and ten thousand things principle with kind mutually move.",
  "s0245": "Thus gentleman returns to feeling to harmonize will, compares kinds to complete conduct.",
  "s0246": "Evil sounds chaotic colors not stay intelligence, licentious music wastes ritual not connect to heart methods, lazy slow deviant crooked qi not placed in body, make ears eyes nose mouth heart knowing hundred bodies all follow upright correct, to carry out their righteousness.",
  "s0247": "Then issue with sounds, pattern with qin se, move with shield axe, adorn with feather banners, follow with xiao pipes, strive utmost virtue light, move four qi harmony, to manifest ten thousand things principle.",
  "s0248": "Thus clear bright symbolizes heaven, vast symbolizes earth, end beginning symbolizes four seasons, circling symbolizes wind rain;",
  "s0249": "Five colors form pattern without chaos, eight winds follow pitch without evil, hundred measures obtain number have constant;"
}
