{
  "s3337": "Twenty-five, wished to bring in king, army at river.",
  "s3352": "Three, Song submitted.",
  "s3560": "Seven, duke died. Zhao Dun was crown prince young, wished to change ruler, feared execution, therefore established crown prince as Ling Gong.",
  "s3561": "Thirty-nine, Mu Gong died. Buried with human sacrifice, those who died with him 170 people, gentleman criticized it, therefore did not say died.",
  "s3576": "First year of Jin Ling Gong Yi Gao, Zhao Dun monopolized government.",
  "s3577": "First year of Qin Kang Gong Ying",
  "s3579": "Seventeen, Gong Sun Gu killed Cheng Gong.",
  "s3589": "Thirty-three, King Xiang died.",
  "s3590": "Eight, king sent Wei to seek gold for burial, not according to ritual.",
  "s3592": "Two, Qin attacked us, took Wu Cheng, avenged Ling Gu battle.",
  "s3595": "First year of Duke Zhao of Song (Chu Jiu), Xiang Gong's son.",
  "s3605": "First year of King Qing",
  "s3608": "Three, led feudal lords to rescue Zheng.",
  "s3610": "Eight, attacked Zheng, because it submitted to Jin.",
  "s3616": "Ten, Chu attacked us.",
  "s3620": "Jia Chen",
  "s3624": "Four, attacked Qin, took Shao Liang. Qin took our Bei Zheng.",
  "s3625": "Four, Jin attacked us, took Shao Liang. We attacked Jin took Bei Zheng.",
  "s3631": "First year of Duke Wen of Cao (Shou)",
  "s3633": "First year of Duke Huan of Yan",
  "s3638": "Eleven, defeated Tall Di at Xian and returned, got Tall Di.",
  "s3643": "Four, defeated Tall Di at Chang Qiu.",
  "s3656": "Six, Qin took our Ji Ma. Fought Qin at He Qu, Qin army fled.",
  "s3657": "Six, attacked Jin, took Ji Ma. Angry, fought great battle with us at He Qu.",
  "s3672": "Seven, got Sui Hui.",
  "s3673": "Seven, Jin deceived and got Sui Hui.",
  "s3685": "Six, King Qing died. Ministers contended for government, therefore did not report death.",
  "s3686": "Fourteen, comet entered Northern Dipper, Zhou historian said: seven years, Song, Qi, Jin rulers will die.",
  "s3687": "Twenty, Duke Zhao died. Younger brother Shang Ren killed crown prince self-established, this was Yi Gong.",
  "s3688": "Eight, Zhao Dun with 800 chariots installed Jie Gai, pacified royal house.",
  "s3690": "First year of King Zhuang of Chu (Lu)",
  "s3693": "First year of Duke Ling of Chen (Ping Guo)",
  "s3701": "First year of King Kuang",
  "s3702": "Fifteen, sixth month Xin Chou, solar eclipse, Qi attacked us.",
  "s3703": "First year of Qi Yi Gong Shang Ren",
  "s3704": "Nine, we entered Cai.",
  "s3710": "Thirty-four, Jin attacked us. Zhuang Hou died.",
  "s3711": "Six, Qi entered our outer wall.",
  "s3719": "Two, did not gain people's hearts.",
  "s3722": "Three, extinguished Yong.",
  "s3723": "Nine, Xiang consort made Wei Bo kill Duke Zhao. Younger brother Bao established.",
  "s3726": "First year of Cai Wen Hou Shen",
  "s3734": "Seventeen, Qi attacked us.",
  "s3735": "Three, attacked Lu.",
  "s3736": "Eleven, led feudal lords to pacify Song.",
  "s3739": "First year of Duke Wen of Song (Bao), Duke Zhao's younger brother. Jin led feudal lords to pacify us.",
  "s3750": "Eighteen, Xiang Zhong killed legitimate heir, established concubine's son as Xuan Gong.",
  "s3751": "Four, duke amputated Bing Chou Fu's foot and took Yan Zhi's wife, two men together killed duke, established Huan Gong's son Hui Gong.",
  "s3766": "First year of Duke Xuan of Lu (Bei), Lu established Xuan Gong, not proper, ducal house lowly.",
  "s3767": "First year of Duke Hui of Qi (Yuan), took Lu's Ji Xi fields."
}