{
  "s501": "Six. First year intercalary month gui mao, Marquis Jian Cheng first year.",
  "s503": "Lin Cai.",
  "s504": "As former Nanyue lang heard Han troops broke Panyu, for Fubo obtained Nanyue prime minister Lü Jia with merit, Marquis.",
  "s509": "Six. First year intercalary month gui mao, Marquis Sun Du first year.",
  "s511": "Dong Cheng.",
  "s512": "As former Dongyue Yuwang beheaded Dongyue king Yu Shan with merit, Marquis, ten thousand households.",
  "s517": "Six. First year intercalary month gui mao, Marquis Ju Fu first year.",
  "s519": "Wu Xi.",
  "s520": "As Dongyue general Han troops arrived abandoned army surrendered, Marquis.",
  "s525": "Six. First year, Marquis Duo Jun first year.",
  "s527": "She Du.",
  "s528": "As father abandoned former Grand Administrator of Nanhai, Han troops arrived surrendered city, son Marquis.",
  "s533": "Six. First year middle, Marquis Jia first year.",
  "s534": "Two. Taichu second year, Marquis Jia died, no posterity, state abolished.",
  "s535": "Ping Zhou.",
  "s536": "As Chaoxian general Han troops arrived surrendered, Marquis.",
  "s541": "One. Third year fourth month ding mao, Marquis Qi first year. Fourth year, Marquis Qi died, no posterity, state abolished.",
  "s543": "Di Ju.",
  "s544": "As Chaoxian prime minister Han troops arrived surrounded surrendered, Marquis.",
  "s549": "Four. Third year fourth month, Marquis Chaoxian prime minister Han Yin first year.",
  "s551": "Pi Qing.",
  "s552": "As Chaoxian Nixi prime minister sent person killed their king You Qu came surrendered, Marquis.",
  "s557": "Four. Third year sixth month bing chen, Marquis Chaoxian Nixi prime minister Can first year.",
  "s559": "Ti Ci.",
  "s560": "As Little Yuezhi Ruju king led multitude surrendered, Marquis.",
  "s565": "Three. Fourth year eleventh month ding mao, Marquis Ji Gu Gu first year.",
  "s566": "Taichu first year, Marquis Ji Gu Gu died, no posterity, state abolished.",
  "s567": "Hao.",
  "s568": "As former Palace Attendant General led troops captured Cheshi king with merit, Marquis.",
  "s573": "One. Fourth year first month jia shen, Marquis Wang Hui first year. Fourth year fourth month, Marquis Hui convicted of as envoy to Jiuquan forging orders harm, should die, ransomed, state abolished. Enfeoffment lasted three months.",
  "s575": "Li Zan.",
  "s576": "As Little Yuezhi king led thousand cavalry surrendered, Marquis.",
  "s581": "Two. Fourth year first month yi you, Marquis Ya Zhe first year. One. Sixth year, Marquis Sheng first year.",
  "s582": "Four",
  "s583": "Ji.",
  "s584": "As Chaoxian prince Han troops surrounded Chaoxian surrendered, Marquis.",
  "s589": "Two. Fourth year third month gui wei, Marquis Zhang Hun first year. Gui Yi. Sixth year, Marquis Zhang Hun sent to Chaoxian, plotted rebellion, died, state abolished.",
  "s591": "Nie Yang.",
  "s592": "As Chaoxian prime minister Lu Ren, Han troops arrived, first surrendered, died on road, son Marquis.",
  "s597": "Three. Fourth year third month ren yin, Marquis Kang Zi Zui first year.",
  "s598": "Two. Taichu second year, Marquis Zui died, no posterity, state abolished.",
  "s0600": "Later scholar who loved affairs Mr. Chu said: The Grand Historian recorded events ending with Emperor Wu's affairs, therefore again compiled records of meritorious ministers and marquises from Emperor Zhao onward, arranged on the left, so that later scholars who love affairs may view the successes and failures, lengths and shortness of severed generations, and may warn themselves thereby.",
  "s0601": "The gentlemen of the present age, exercising authority adapting to change, measuring time applying what is suitable, rarely using affairs to establish merit and obtain land enfeoffed as marquises, establishing names in the present age - is this not flourishing!",
  "s0602": "Observe their way of holding fullness guarding completion, all are not modest yielding, arrogant contentious for power, fond of proclaiming reputation, know advance not retreat, in the end kill body extinguish state.",
  "s0603": "With three obtained it, and in person lost it, cannot transmit merit to later generations, cause beneficence to flow to descendants - is this not sad!",
  "s0604": "Marquis Longluo once served as Forward General, worldly compliant good, substantial heavy careful trustworthy, did not participate in political affairs, retired yielding loved people.",
  "s0605": "His ancestors arose in the generation of the six ministers of Jin.",
  "s0606": "Since having land ruling state, being kings and marquises, descendants successively inherited not broken, through years through generations, up to now, altogether over hundred years - how can this be spoken of on the same day as meritorious ministers who lost it in person?",
  "s0607": "Alas, later generations should be warned by this!"
}
