{
  "s0350": "Hu Yan Jiu Fan, Wen Gong maternal uncle;",
  "s0351": "Jia Tuo;",
  "s0352": "Xian Zhen;",
  "s0353": "Wei Wu Zi.",
  "s0354": "From Xian Gong for crown prince time, Chong Er already adult.",
  "s0355": "Xian Gong ascended position, Chong Er age twenty-one.",
  "s0356": "Xian Gong thirteenth year, because Li Ji reason, Chong Er prepared Pu city guarded Qin.",
  "s0357": "Xian Gong twenty-first year, Xian Gong killed crown prince Shen Sheng, Li Ji slandered him, feared, not bid farewell Xian Gong guarded Pu city.",
  "s0358": "Xian Gong twenty-second year, Xian Gong sent eunuch Lu Di urged kill Chong Er.",
  "s0359": "Chong Er climbed wall, eunuch pursued cut his garment sleeve.",
  "s0360": "Chong Er then fled Di.",
  "s0361": "Di, his mother country.",
  "s0362": "At time Chong Er age forty-three.",
  "s0363": "Followed this five scholars, remaining not named several ten people, to Di.",
  "s0364": "Di attacked Jiu Ru, obtained two women: with elder daughter wife Chong Er, gave birth Bo Jiao, Shu Liu;",
  "s0365": "with younger daughter wife Zhao Shuai, gave birth Dun.",
  "s0366": "Resided Di five years Jin Xian Gong died, Li Ke already killed Xi Qi, Dao Zi, then sent people welcome, wished establish Chong Er.",
  "s0367": "Chong Er feared killing, because firmly declined, not dare enter.",
  "s0368": "Already Jin moreover welcomed his younger brother Yi Wu established him, this was Hui Gong.",
  "s0369": "Hui Gong seventh year, feared Chong Er, then sent eunuch Lu Di with brave men wished kill Chong Er.",
  "s0370": "Chong Er heard it, then plotted Zhao Shuai etc. said: 'Initially I fled Di, not because it usable with, because near easy pass, so moreover rest feet.",
  "s0371": "Rest feet long, firmly wish move to great country.",
  "s0372": "Sir Qi Huan Gong good goodness, will in hegemony wang, gather relieve feudal lords.",
  "s0373": "Now heard Guan Zhong, Xi Peng died, this also wish obtain worthy assist, why not go?'",
  "s0374": "Then went.",
  "s0375": "Chong Er told his wife said: 'Wait me twenty-five years not come, then marry.'",
  "s0376": "His wife laughed said: 'Plow twenty-five years, my tomb upper cypress big.",
  "s0377": "Although, concubine wait you.'",
  "s0378": "Chong Er resided Di altogether twelve years left.",
  "s0379": "Passed Wei, Wei Wen Gong not ritual.",
  "s0380": "Left, passed Wu Lu, famine from wild people begged food, wild people filled earth vessel presented him.",
  "s0381": "Chong Er angered.",
  "s0382": "Zhao Shuai said: 'Earth, have land, lord their bow receive it.'",
  "s0384": "To Qi, Qi Huan Gong thick ritual, with clan woman wife him, had horses twenty chariots, Chong Er peaceful it.",
  "s0385": "Chong Er to Qi two years Huan Gong died, met Shu Dao etc. made inner disorder, Qi Xiao Gong establish, feudal lords troops several arrived.",
  "s0386": "Remained Qi altogether five years.",
  "s0387": "Chong Er loved Qi woman, no leave heart.",
  "s0388": "Zhao Shuai, Jiu Fan then at mulberry below plotted go.",
  "s0389": "Qi woman attendants at mulberry above heard it, informed her master.",
  "s0390": "Her master then killed attendants, urged Chong Er hurry go.",
  "s0391": "Chong Er said: 'Person life peaceful happy, who know other!",
  "s0392": "Must die at this, cannot go.'",
  "s0393": "Qi woman said: 'You one country gong zi, poor come here, several scholars with you as life.",
  "s0394": "You not quickly return country, repay labor ministers, but cherish woman virtue, secretly for you ashamed.",
  "s0395": "Moreover not seek, what time obtain merit?'",
  "s0396": "Then with Zhao Shuai etc. plotted, intoxicated Chong Er, loaded with go.",
  "s0397": "Went far awakened, Chong Er great anger, drew spear wished kill Jiu Fan.",
  "s0398": "Jiu Fan said: 'Kill minister complete you, Yan wish.'",
  "s0399": "Chong Er said: 'Matter not succeed, I eat maternal uncle clan meat.'"
}
