{
  "s0322": "King Yi though without merit, should still divide land and make him king.'",
  "s0323": "The generals all said: 'Good.'",
  "s0324": "Then divided the world, established the generals as marquises and kings.",
  "s0325": "Xiang Yu and Fan Zeng suspected Liu Bang of having ambitions for the world, but having already made peace, and fearing to break the agreement and cause the lords to rebel, secretly plotted saying: 'The roads to Ba and Shu are dangerous, Qin's exiled people all live in Shu.'",
  "s0326": "Then said: 'Ba and Shu are also Guanzhong territory.'",
  "s0327": "Therefore established Liu Bang as Han King, ruling Ba, Shu, Hanzhong, with capital at Nanzheng.",
  "s0328": "And divided Guanzhong into three, made Qin surrendering generals kings to block Han King.",
  "s0329": "Xiang Yu then established Zhang Han as Yong King, ruling west of Xianyang, with capital at Feiqiu.",
  "s0330": "Chief Scribe Xin was formerly Queyang prison clerk, once had kindness to Xiang Liang;",
  "s0331": "Colonel Dong Yi originally advised Zhang Han to surrender to Chu.",
  "s0332": "Therefore established Sima Xin as Sai King, ruling east of Xianyang to the Yellow River, with capital at Queyang;",
  "s0333": "Established Dong Yi as Di King, ruling Shangjun, with capital at Gao.",
  "s0334": "When the division was completed, Xiang Yu wished to march east.",
  "s0335": "He camped at Gaixia, and the Han King Liu Bang attacked him.",
  "s0336": "Xiang Yu said: 'Our army has fought for three years, killed generals, crossed passes, taken cities, but the enemy is many and we are few.'",
  "s0337": "He sent Long Ju to ask Han Xin to attack Qi.",
  "s0338": "Han Xin said: 'The overlord is in danger, I cannot abandon him.'",
  "s0339": "Xiang Yu then sent Wu She to persuade Han Xin.",
  "s0340": "Wu She said: 'You and the overlord both Chu people, but you became king of Qi.",
  "s0341": "Now the overlord is in danger, but you do not help, this is disloyal.'",
  "s0342": "Han Xin said: 'The overlord once made me king, I am grateful.",
  "s0343": "But I have heard that if the mother is kind, the son is filial; if the lord is enlightened, the minister is loyal.",
  "s0344": "Now the overlord treats me with suspicion and sends someone else, this shows he does not trust me.'",
  "s0345": "Wu She returned and told Xiang Yu.",
  "s0346": "Xiang Yu sent Ji Xin to attack Qi.",
  "s0347": "Ji Xin attacked Qi, Han Xin defended Qi.",
  "s0348": "Han Xin said: 'Ji Xin is brave but not strategic, I can defeat him.'",
  "s0349": "Han Xin lured Ji Xin into a trap, captured him.",
  "s0350": "Han Xin then attacked Chu, defeated Xiang Yu at Gaixia.",
  "s0351": "Xiang Yu retreated to Dongcheng.",
  "s0352": "The Chu army was few, Xiang Yu said: 'I have fought seventy battles, all victorious, captured generals, taken cities, but finally trapped here.'",
  "s0353": "He divided his army into four, each with orders to break through separately and rendezvous at Dongcheng.",
  "s0354": "Xiang Yu said to the generals: 'I will take the enemy.'",
  "s0355": "He rode alone, broke through the encirclement, the generals could not follow.",
  "s0356": "Xiang Yu reached the Wujiang River, his horse was tired, could not cross.",
  "s0357": "Xiang Yu said: 'Heaven wishes to destroy me, not my fault.'",
  "s0358": "He turned and fought, killed several hundred enemies, wounded himself many times.",
  "s0359": "He saw his old subordinate L端 Matong among the enemies.",
  "s0360": "L端 Matong was formerly Xiang Yu's subordinate, Xiang Yu once captured his father but did not kill him.",
  "s0361": "L端 Matong said: 'Today you are finished.'",
  "s0362": "Xiang Yu laughed and said: 'I heard Han bought your head for a thousand gold and ten thousand households.'",
  "s0363": "He drew his sword and committed suicide.",
  "s0364": "The kings of Western Chu all surrendered to Han.",
  "s0365": "Liu Bang became emperor, established the Han dynasty.",
  "s0366": "Han Gao Zu first year, attacked Ying Bu at Jing Province.",
  "s0367": "Second year, attacked Chen Xi at Liang.",
  "s0368": "Third year, attacked Zang Tu at Yan.",
  "s0369": "Fourth year, attacked Wei Bao at Wei.",
  "s0370": "Fifth year, attacked Tian Rong at Qi.",
  "s0371": "Sixth year, attacked Lu Wan at Yan.",
  "s0372": "Seventh year, pacified the world.",
  "s0373": "Han Gao Zu died, Empress L端 acted as regent.",
  "s0374": "Wen Di ascended, practiced benevolent government.",
  "s0375": "Jing Di ascended, continued the policies.",
  "s0376": "Wu Di ascended, expanded the empire.",
  "s0377": "Wu Di died, Zhao Di ascended.",
  "s0378": "Zhao Di died, Xuan Di ascended.",
  "s0379": "Xuan Di died, Yuan Di ascended.",
  "s0380": "Yuan Di died, Cheng Di ascended.",
  "s0381": "Cheng Di died, Ai Di ascended."
}