{
  "s0822": "Sun changes cultivate virtue, moon changes reduce punishments, stars change bind harmony.",
  "s0823": "Generally heaven changes, exceed degree then divine.",
  "s0824": "State lords strong great, have virtue prosper;",
  "s0825": "Feathers small, adorn deceive perish.",
  "s0826": "Most superior cultivate virtue, next cultivate governance, next cultivate rescue, next cultivate exorcism, lowest none.",
  "s0827": "Constant stars changes rare see, but three lights divination frequent use.",
  "s0828": "Sun moon halos meet, clouds winds, this heaven guest qi, its send see also has great fortune.",
  "s0829": "However its with governance affairs face up face down, nearest heaven man sign.",
  "s0830": "This five, heaven感动.",
  "s0831": "For heaven numbers, must through three five.",
  "s0832": "End beginning ancient modern, deep observe time changes, examine their essence coarse, then heaven official complete.",
  "s0833": "Blue Emperor practice virtue, heaven gate for it opens.",
  "s0834": "Red Emperor practice virtue, heaven prison for it empties.",
  "s0835": "Yellow Emperor practice virtue, heaven premature for it rises.",
  "s0836": "Wind from northwest comes, must with geng xin.",
  "s0837": "One autumn midst, five arrive, great amnesty;",
  "s0838": "Three arrive, small amnesty.",
  "s0839": "White Emperor practice virtue, with first month twentieth day, twenty first, moon halo surrounds, constantly great amnesty year, called has sun.",
  "s0840": "One said: White Emperor practice virtue, Bi Mao for it surrounds.",
  "s0841": "Surround three evenings, virtue then completes;",
  "s0842": "Not three evenings, and surround not combine, virtue not complete.",
  "s0843": "Two said: with Chen surround, not out its ten days.",
  "s0844": "Black Emperor practice virtue, heaven pass for it moves.",
  "s0845": "Heaven practice virtue, son of heaven changes establishes year;",
  "s0846": "Not virtue, wind rain breaks stone.",
  "s0847": "Three Neng three Heng, heaven court.",
  "s0848": "Guest star out heaven court, has strange command."
}
