{
  "s0099": "Duke Mu died in his thirty-ninth year.",
  "s0100": "More than a hundred years later, Confucius discussed and transmitted the Six Arts, briefly saying that those who changed surnames and became kings, performing feng on Mount Tai and shan on Mount Li, numbered more than seventy kings, but their sacrificial rituals were not clear, so it is difficult to speak of them.",
  "s0101": "Someone asked about the explanation of the di sacrifice, and Confucius said: 'I do not know.",
  "s0102": "If one knew the explanation of the di sacrifice, it would be like seeing the whole realm in the palm of the hand.'",
  "s0103": "The Poetry says: 'When Zhou was on the throne, King Wen received the mandate, but his administration did not reach Mount Tai.'",
  "s0104": "King Wu conquered Yin in the second year, but the realm was not yet peaceful when he died.",
  "s0105": "Only during King Cheng's time was Zhou virtue fully pervasive, and King Cheng's feng and shan was close to it.",
  "s0106": "When later ministers took power, the Ji clan traveled to Mount Tai, and Confucius criticized them.",
  "s0107": "At this time, Chang Hong used magical arts to serve King Ling of Zhou, and the feudal lords did not come to court Zhou, so Zhou power was weak. Chang Hong then made clear the affairs of ghosts and spirits, and set up the shooting of fox heads.",
  "s0108": "Fox heads were for the feudal lords who did not come.",
  "s0109": "He relied on strange things to try to bring the feudal lords.",
  "s0110": "The feudal lords did not follow, and the Jin people captured and killed Chang Hong.",
  "s0111": "The Zhou people's discussions of magical oddities began with Chang Hong.",
  "s0112": "More than a hundred years later, Duke Ling of Qin built the Wu Yang Upper Altar, sacrificing to the Yellow Emperor;",
  "s0113": "built the Lower Altar, sacrificing to the Yan Emperor.",
  "s0114": "Forty-eight years later, the Zhou Grand Historian Tan met Duke Xian of Qin and said: 'Qin initially merged with Zhou, merged then separated, after five hundred years they should merge again, merge for seventeen years and a hegemon king will emerge.'",
  "s0115": "It rained gold at Yueyang, and Duke Xian of Qin considered himself to have obtained the gold omen, so he built the Qi Altar at Yueyang and sacrificed to the White Emperor.",
  "s0116": "One hundred twenty years later Qin extinguished Zhou, and Zhou's nine tripods entered Qin.",
  "s0117": "Some say the Song Taiqiu Altar perished, and the tripods sank in the Si River beneath Pengcheng.",
  "s0118": "One hundred fifteen years later Qin unified the realm.",
  "s0119": "After Qin Shi Huang unified the realm and became emperor, some said: 'The Yellow Emperor obtained earth virtue, yellow dragons and earthworms appeared.",
  "s0120": "Xia obtained wood virtue, green dragons stopped in the suburbs, grass and trees flourished.",
  "s0121": "Yin obtained metal virtue, silver overflowed from the mountains.",
  "s0122": "Zhou obtained fire virtue, there were symbols of red crows.",
  "s0123": "Now Qin changes Zhou, it is the time of water virtue.",
  "s0124": "Formerly Duke Wen of Qin went hunting and obtained a black dragon, this is the omen of water virtue.'",
  "s0125": "Therefore Qin renamed the river 'Virtue River', made the tenth month of winter the beginning of the year, took black as the superior color, measured with six as the name, took Da Lü as the superior pitch, and affairs were governed by law.",
  "s0126": "In the third year of his imperial position, he toured east through the commanderies and counties, sacrificed at Zouyi Mountain, praising Qin's achievements.",
  "s0127": "Therefore he summoned seventy Confucian scholars and doctors from Qi and Lu to the foot of Mount Tai.",
  "s0128": "Some Confucian scholars discussed: 'In ancient times, for the feng sacrifice they used cattail wagons to avoid harming the mountain's soil, stones, and vegetation;",
  "s0129": "they swept the ground and sacrificed, using mats of straw, speaking of how easy it was to follow.'",
  "s0130": "Shi Huang heard these discussions were all different, difficult to implement, so he dismissed the Confucian scholars.",
  "s0131": "He then cleared the road, ascending from the sunny side of Mount Tai to the peak, erected a stone to praise Qin Shi Huang's virtue, making clear that he obtained the feng sacrifice.",
  "s0132": "From the shady path he descended, performing shan at Mount Li.",
  "s0133": "The rituals mostly adopted what the Grand Invocator used in sacrificing to the Supreme Deity at Yong, but the feng and shan details were all kept secret, so later generations could not record them.",
  "s0134": "When Shi Huang ascended Mount Tai, midway he encountered violent wind and rain, and rested under a large tree.",
  "s0135": "The Confucian scholars, having been dismissed, could not participate in the feng sacrifice rituals. Hearing that Shi Huang encountered wind and rain, they mocked him.",
  "s0136": "Therefore Shi Huang then toured east to the sea, performing rituals and sacrifices to famous mountains, great rivers, and the eight spirits, seeking immortals and the like of Xianmen.",
  "s0137": "The eight spirits have existed since ancient times, some say they were created since the time of Tai Gong.",
  "s0138": "What makes Qi Qi is the heavenly Qi.",
  "s0139": "When its sacrifices ceased, no one knows when they began.",
  "s0140": "The eight spirits: the first is the Heaven Lord, sacrificing to Tian Qi.",
  "s0141": "Tian Qi is a deep pool, located below the mountain in the southern suburbs of Linzi.",
  "s0142": "The second is the Earth Lord, sacrificing at Mount Tai and Mount Li.",
  "s0143": "Heaven prefers shade, so sacrifices to it must be at the foot of high mountains and on top of small mountains, called 'zhi';",
  "s0144": "earth prefers sunlight, so sacrifices to it must be in round mounds in marshes.",
  "s0145": "The third is the War Lord, sacrificing to Chi You.",
  "s0146": "Chi You is in Dongping Lu Jian Township, the western border of Qi.",
  "s0147": "The fourth is the Yin Lord, sacrificing to the Three Mountains."
}
