{
  "s280": "Twelfth.",
  "s281": "Twenty-third. Attacked Nanyang magistrate Yi, defeated him east of Yangcheng walls.",
  "s282": "Twenty-third.",
  "s283": "Eleventh.",
  "s284": "Fourteenth.",
  "s286": "Seventh month.",
  "s287": "Third.",
  "s288": "Eleventh. Xiang Yu made an appointment with Zhang Han at Yin Xu, Zhang Han and others had already surrendered, made alliance with them, made Han Yong king.",
  "s289": "Twentieth.",
  "s290": "Thirteenth.",
  "s291": "Twenty-fourth. Surrendered and pacified Nanyang, enfeoffed its magistrate Yi.",
  "s292": "Twenty-fourth.",
  "s293": "Twelfth.",
  "s294": "Fifteenth. Shen Yang pacified Henan, surrendered to Chu.",
  "s296": "Eighth month. Zhao Gao killed the Second Emperor.",
  "s297": "Fourth.",
  "s298": "Twelfth. Made surrendered Qin duwei Yi and chief clerk Xin supreme generals, commanding surrendered Qin troops.",
  "s299": "Twenty-first. Zhao King Xie remained in his state. Chen Yu fled and dwelt in Nanpi.",
  "s300": "Fourteenth.",
  "s301": "Twenty-fifth. Attacked Wuguan, broke it.",
  "s302": "Twenty-fifth.",
  "s303": "Thirteenth.",
  "s304": "Sixteenth.",
  "s306": "Ninth month Ziying became king.",
  "s307": "Fifth.",
  "s308": "Thirteenth.",
  "s309": "Twenty-second.",
  "s310": "Fifteenth.",
  "s311": "Twenty-sixth. Attacked and took Ao and Lantian. Using Liu Hou's strategy, without battle all surrendered.",
  "s312": "Twenty-sixth.",
  "s313": "Fourteenth.",
  "s314": "Seventeenth.",
  "s316": "Tenth month.",
  "s317": "Sixth.",
  "s318": "Fourteenth. Xiang Yu led the lords' troops, over four hundred thousand, marched raiding territory, west to Henan.",
  "s319": "Twenty-third. Zhang Er followed Chu west into Qin.",
  "s320": "Sixteenth.",
  "s321": "Twenty-seventh. Han first year, Qin prince Ziying surrendered. Pei Gong entered and broke Xianyang, pacified Qin, returned army to Bashang, awaited the lords' agreement.",
  "s322": "Twenty-seventh.",
  "s323": "Fifteenth. Followed Xiang Yu raiding territory, then entered the pass.",
  "s324": "Eighteenth.",
  "s326": "Eleventh month.",
  "s327": "Seventh.",
  "s328": "Fifteenth. Yu falsely pit-killed two hundred thousand surrendered Qin soldiers at Xin'an.",
  "s329": "Twenty-fourth.",
  "s330": "Seventeenth.",
  "s331": "Twenty-eighth. Pei Gong issued the three chapter command, Qin people greatly pleased.",
  "s332": "Twenty-eighth.",
  "s333": "Sixteenth."
}
