{
  "s0899": "Twentieth year, third year, Jin attacked us, defeated Zhan Ban.",
  "s0900": "Nineteenth year, second year, twelfth year, thirty-fifth year, twenty-first year, ninth year, seventeenth year, fourth year",
  "s0901": "556 Sixteenth year, seventeenth year, Qi attacked our northern borders.",
  "s0902": "Twenty-sixth year, attacked Lu.",
  "s0903": "Second year, twenty-first year, fourth year, twentieth year, attacked Chen.",
  "s0904": "Third year, attacked Cao.",
  "s0905": "Thirteenth year, Song attacked us.",
  "s0906": "Thirty-sixth year, twenty-second year, Wei attacked us.",
  "s0907": "Tenth year, eighteenth year, fifth year",
  "s0908": "555 Seventeenth year, eighteenth year, allied with Jin attacked Qi.",
  "s0909": "Twenty-seventh year, Jin surrounded Lin Zi.",
  "s0910": "Yan Ying.",
  "s0911": "Third year, led Lu, Song, Zheng, Wei surrounded Qi, greatly defeated them.",
  "s0912": "Twenty-second year, fifth year, attacked Zheng.",
  "s0913": "Twenty-first year, Jin led us attacked Qi.",
  "s0914": "Fourth year, fourteenth year, thirty-seventh year, twenty-third year, Cheng Gong died.",
  "s0915": "Eleventh year, Jin led us surrounded Qi.",
  "s0916": "Chu attacked us.",
  "s0917": "Nineteenth year, Wu Gong died.",
  "s0918": "Sixth year",
  "s0919": "554 Eighteenth year, nineteenth year, twenty-eighth year, dismissed Guang, established Zi Ya as crown prince.",
  "s0920": "Guang allied with Cui Zhu killed Ya self-established.",
  "s0921": "Jin, Wei attacked us.",
  "s0922": "Fourth year, allied with Wei attacked Qi.",
  "s0923": "Twenty-third year, sixth year, twenty-second year, fifth year, Jin led us attacked Qi.",
  "s0924": "Fifteenth year, thirty-eighth year, Cao Wu Gong Sheng first year, twelfth year, Zi Chan as minister.",
  "s0925": "Yan Wen Gong first year, seventh year",
  "s0926": "553 Nineteenth year, twentieth year, solar eclipse.",
  "s0927": "Qi Zhuang Gong first year, fifth year, twenty-fourth year, seventh year, twenty-third year, sixth year, sixteenth year, thirty-ninth year, second year, thirteenth year, second year, eighth year",
  "s0928": "552 Twentieth year, twenty-first year, duke went Jin.",
  "s0929": "Solar eclipse again.",
  "s0930": "Second year, sixth year, Lu Xiang Gong came.",
  "s0931": "Killed Yang She Hu.",
  "s0932": "Twenty-fifth year, eighth year, twenty-fourth year, seventh year, seventeenth year, fortieth year, third year, fourteenth year, third year, ninth year",
  "s0933": "551 Twenty-first year, twenty-second year, Confucius born.",
  "s0934": "Third year, Jin Luan Ying came fleeing, Yan Ying said 'better return him'.",
  "s0935": "Seventh year, Luan Ying fled Qi.",
  "s0936": "Twenty-sixth year, ninth year, twenty-fifth year, eighth year, eighteenth year, forty-first year, fourth year, fifteenth year, fourth year, tenth year",
  "s0937": "550 Twenty-second year, twenty-third year, fourth year, wished send Luan Ying enter Qu Wo attack Jin, take Zhao Ge.",
  "s0938": "Eighth year, twenty-seventh year, tenth year, twenty-sixth year, ninth year, Qi attacked us.",
  "s0939": "Nineteenth year, forty-second year, fifth year, sixteenth year, fifth year, eleventh year",
  "s0940": "549 Twenty-third year, twenty-fourth year, invaded Qi.",
  "s0941": "Solar eclipse again.",
  "s0942": "Fifth year, feared Jin communicate Chu, Yan Zi planned.",
  "s0943": "Ninth year, twenty-eighth year, eleventh year, communicated with Qi.",
  "s0944": "Led Chen, Cai attacked Zheng rescued Qi.",
  "s0945": "Twenty-seventh year, tenth year, twentieth year, Chu led us attacked Zheng.",
  "s0946": "Forty-third year, Chu led us attacked Zheng.",
  "s0947": "Sixth year, seventeenth year, Fan Xuan Zi governed.",
  "s0948": "We requested attack Chen.",
  "s0949": "Sixth year, twelfth year",
  "s0950": "548 Twenty-fourth year, twenty-fifth year, Qi attacked our northern borders, to repay Xiao Bo army.",
  "s0951": "Sixth year, Jin attacked us, repaid Zhao Ge.",
  "s0952": "Cui Zhu with Zhuang Gong communicated his wife, killed him, established his younger brother, this was Jing Gong.",
  "s0953": "Tenth year, attacked Qi arrived Gao Tang, repaid Tai Hang campaign.",
  "s0954": "Twenty-ninth year, duke went Jin, alliance not concluded.",
  "s0955": "Twelfth year, Wu attacked us, to repay boat army campaign, shot killed Wu king.",
  "s0956": "Twenty-eighth year, eleventh year, twenty-first year, Zheng attacked us.",
  "s0957": "Forty-fourth year, seventh year, eighteenth year, attacked Chen, entered Chen.",
  "s0958": "Yan Yi Gong first year, thirteenth year, Zhu Fan attacked Chu, pressed Nest gate, injured shot died.",
  "s0959": "547 Jiajin twenty-fifth year, twenty-sixth year, Qi Jing Gong Chu Jiu first year went Jin, requested return Wei Xian Gong.",
  "s0960": "Eleventh year, executed Wei Shang Gong, again entered Xian Gong.",
  "s0961": "Thirtieth year, thirteenth year, led Chen, Cai attacked Zheng.",
  "s0962": "Twenty-ninth year, twelfth year, Qi, Jin killed Shang Gong, again inner Xian Gong.",
  "s0963": "Twenty-second year, Chu led us attacked Zheng.",
  "s0964": "Forty-fifth year, eighth year, nineteenth year, Chu led Chen, Cai attacked us.",
  "s0965": "Second year, Wu Yu Ji first year",
  "s0966": "546 Twenty-sixth year, twenty-seventh year, solar eclipse.",
  "s0967": "Second year, Qing Feng wished monopolize, executed Cui clan, Zhu suicide.",
  "s0968": "Twelfth year, thirty-first year, fourteenth year, thirtieth year, Wei Xian Gong Gan later first year, twenty-third year, forty-sixth year, ninth year, twentieth year, third year, second year",
  "s0969": "545 Twenty-seventh year, twenty-eighth year, duke went Chu.",
  "s0970": "Buried Kang Wang.",
  "s0971": "Third year, winter, Bao, Gao, Luan clans planned Qing Feng, raised troops attacked Qing Feng, Qing Feng fled Wu.",
  "s0972": "Thirteenth year, thirty-second year, fifteenth year, Kang Wang died.",
  "s0973": "Thirty-first year, second year, twenty-fourth year, forty-seventh year, tenth year, twenty-first year, fourth year, Yi Gong died.",
  "s0974": "Third year, Qi Qing Feng came fleeing.",
  "s0975": "544 Jing Wang first year, twenty-ninth year, Wu Ji Zha came observed Zhou music, fully knew music's purpose.",
  "s0976": "Fourth year, Wu Ji Zha came envoy, with Yan Ying happy.",
  "s0977": "Fourteenth year, Wu Ji Zha came, said 'Jin government finally return Han, Wei, Zhao.'",
  "s0978": "Thirty-third year, Chu Xiong Ju Ao first year, thirty-second year, third year, twenty-fifth year, forty-eighth year, eleventh year, twenty-second year, Wu Ji Zha told Zi Chan said: 'Government will return you, you with propriety, fortunately escape calamity.'",
  "s0979": "Yan Hui Gong first year, Qi Gao Zhi came fleeing.",
  "s0980": "Fourth year, gate guard killed Yu Ji.",
  "s0981": "Ji Zha envoyed feudal lords.",
  "s0982": "543 Second year, thirtieth year, fifth year, fifteenth year, thirty-fourth year, second year, thirty-third year, Wei Xiang Gong Wu first year, twenty-sixth year, forty-ninth year, for crown prince took Chu woman, duke communicated with her, crown prince killed duke self-established.",
  "s0983": "Twelfth year, twenty-third year, various princes contended favor mutually killed, moreover wished kill Zi Chan, Zi Cheng stopped them.",
  "s0984": "Second year, fifth year",
  "s0985": "542 Third year, thirty-first year, Xiang Gong died.",
  "s0986": "Sixth year, sixteenth year, thirty-fifth year, third year, Wang Ji Fu surrounded as Ling Yin.",
  "s0987": "Thirty-fourth year, second year, twenty-seventh year, Cai Ling Hou Ban first year, thirteenth year, twenty-fourth year, third year, sixth year",
  "s0988": "541 Fourth year, Lu Zhao Gong Chou first year, Zhao Gong age nineteen, had child heart.",
  "s0989": "Seventh year, seventeenth year, Qin Hou Zi came fleeing.",
  "s0990": "Thirty-sixth year, duke younger brother Hou Zi fled Jin, carriages thousand.",
  "s0991": "Fourth year, Ling Yin Wei killed Ju Ao, self-established as Ling Wang.",
  "s0992": "Thirty-fifth year, third year, twenty-eighth year, second year, fourteenth year, twenty-fifth year, fourth year, seventh year",
  "s0993": "540 Fifth year, second year, duke went Jin, arrived river, Jin apologized returned him.",
  "s0994": "Eighth year, Tian Wu Yu sent woman.",
  "s0995": "Eighteenth year, Qi Tian Wu Yu came sent woman.",
  "s0996": "Thirty-seventh year, Chu Ling Wang Wei first year, Gong Wang son, elbow jade.",
  "s0997": "Thirty-sixth year, fourth year, twenty-ninth year, third year, fifteenth year, twenty-sixth year, fifth year, eighth year",
  "s0998": "539 Sixth year, third year, duke went Jin."
}
