{
  "s0101": "He extinguished Kui, because Kui did not sacrifice to Zhu Rong and Yu Xiong.",
  "s0102": "In summer, he attacked Song, and Song urgently appealed to Jin for help. Jin rescued Song, so Cheng Wang withdrew and returned.",
  "s0103": "General Zi Yu requested to fight, but Cheng Wang said: 'Chong Er has been exiled abroad for a long time, and now suddenly returns to his country. This is Heaven's will - we cannot oppose it.'",
  "s0104": "Zi Yu persistently requested, so he gave him a small force and sent him away.",
  "s0105": "Jin indeed defeated Zi Yu at Cheng Pu.",
  "s0106": "Cheng Wang was angry and executed Zi Yu.",
  "s0107": "In the forty-sixth year, initially Cheng Wang intended to make Shang Chen his crown prince, and discussed it with Prime Minister Zi Shang.",
  "s0108": "Zi Shang said: 'Your Majesty is not yet old, and moreover you have many favored concubines. If you demote him, it will cause disorder.",
  "s0109": "In the state of Chu, the ruler is always chosen from among the younger sons.",
  "s0110": "Moreover, Shang Chen has wasp-like eyes and the voice of a wolf - he is a cruel man and cannot be established.'",
  "s0111": "The king did not listen and established him as crown prince.",
  "s0112": "Later he again wished to establish Zi Zhi and demote Crown Prince Shang Chen.",
  "s0113": "Shang Chen heard this but was not certain, so he told his tutor Pan Chong: 'How can I learn the truth?'",
  "s0114": "Chong said: 'Feast the king's favored concubine Jiang Mi but do not show her respect.'",
  "s0115": "Shang Chen followed this advice.",
  "s0116": "Jiang Mi was angry and said: 'No wonder the king wishes to kill you and establish Zhi.'",
  "s0117": "Shang Chen told Pan Chong: 'It is true.'",
  "s0118": "Chong said: 'Can you serve him?'",
  "s0119": "He said: 'I cannot.'",
  "s0120": "'Can you flee and leave?'",
  "s0121": "He said: 'I cannot.'",
  "s0122": "'Can you carry out great deeds?'",
  "s0123": "He said: 'I can.'",
  "s0124": "In winter, tenth month, Shang Chen used the palace guards to surround Cheng Wang.",
  "s0125": "Cheng Wang requested to eat bear paw and die, but they would not listen.",
  "s0126": "On Ding Wei, Cheng Wang strangled himself and died.",
  "s0127": "Shang Chen succeeded to the throne, becoming Mu Wang.",
  "s0128": "Mu Wang ascended the throne and gave his former palace to Pan Chong, appointing him as Grand Tutor to manage state affairs.",
  "s0129": "In Mu Wang's third year, he extinguished Jiang.",
  "s0130": "In the fourth year, he extinguished Liu and Liao.",
  "s0131": "Liu and Liao were descendants of Gao Tao.",
  "s0132": "In the eighth year, he attacked Chen.",
  "s0133": "In the twelfth year, he died.",
  "s0134": "His son Zhuang Wang Lü ascended the throne.",
  "s0135": "Zhuang Wang ascended the throne but for three years issued no commands, spending day and night in pleasure, and commanded the state: 'Anyone who dares remonstrate will be executed without pardon!'",
  "s0136": "Wu Ju entered to remonstrate.",
  "s0137": "Zhuang Wang was embracing the Zheng beauty on his left and the Yue beauty on his right, seated among bells and drums.",
  "s0138": "Wu Ju said: 'I wish to present a riddle.'",
  "s0139": "He said: 'There is a bird perched on a mound. For three years it does not fly, does not sing. What bird is this?'",
  "s0140": "Zhuang Wang said: 'For three years it does not fly, but when it flies it will soar to heaven;",
  "s0141": "for three years it does not sing, but when it sings it will astonish people.",
  "s0142": "You may retire - I understand.'",
  "s0143": "After several months, his debauchery became even worse.",
  "s0144": "The grand master Su Cong then entered to remonstrate.",
  "s0145": "The king said: 'Have you not heard the command?'",
  "s0146": "He replied: 'To die to enlighten my lord is my wish as a minister.'",
  "s0147": "Thereupon he stopped the debauchery and music, attended to government affairs, executed several hundred people, promoted several hundred people, entrusted Wu Ju and Su Cong with administration, and the people of the state were greatly pleased.",
  "s0148": "This year he extinguished Yong.",
  "s0149": "In the sixth year, he attacked Song and captured five hundred chariots.",
  "s0150": "In the eighth year, he attacked Lu Hun Rong, reaching as far as Luo, and reviewed his troops in the Zhou suburbs.",
  "s0151": "Zhou dispatched Wang Zi Man to inquire, saying: 'What is the meaning of this?'",
  "s0152": "The king replied: 'I have heard that you have treasures of jade and silk, I have come to request them.'",
  "s0153": "Wang Zi Man said: 'Do you have a command?'",
  "s0154": "The king said: 'No command.'",
  "s0155": "Wang Zi Man said: 'The Son of Heaven has a command, and the feudal lords respond to it. Now you have no command and come to request - this is called robbery.'",
  "s0156": "Zhuang Wang said: 'You speak well.' Then he withdrew his troops.",
  "s0157": "In the fourteenth year, Zhuang Wang died, and his son Gong Wang Shen ascended the throne.",
  "s0158": "Gong Wang's first year, he attacked Song.",
  "s0159": "In the twelfth year, Gong Wang died, and his son Kang Wang Zhao ascended the throne.",
  "s0160": "Kang Wang's first year, he attacked Sui.",
  "s0161": "In the second year, he extinguished Huang.",
  "s0162": "In the sixth year, he attacked Song and besieged Min Mian.",
  "s0163": "In the ninth year, Kang Wang died, and his son Ling Wang Wei ascended the throne.",
  "s0164": "Ling Wang's first year, he attacked Chen.",
  "s0165": "In the fourth year, he attacked Sui.",
  "s0166": "In the seventh year, Ling Wang died, and his son Ping Wang Qie ascended the throne.",
  "s0167": "Ping Wang's first year, he attacked Chen.",
  "s0168": "In the second year, he attacked Song.",
  "s0169": "In the fourth year, he attacked Zheng.",
  "s0170": "In the fifth year, he attacked Song.",
  "s0171": "In the sixth year, Ping Wang died, and his son Zhao Wang Heng ascended the throne.",
  "s0172": "In Zhao Wang's first year, he attacked Wei.",
  "s0173": "In the second year, he attacked Zheng.",
  "s0174": "In the sixth year, Zhao Wang died, and his son Dao Wang You ascended the throne.",
  "s0175": "In Dao Wang's first year, he attacked Song.",
  "s0176": "In the ninth year, Dao Wang died, and his son Su Wang Zang ascended the throne.",
  "s0177": "In Su Wang's first year, he attacked Zheng.",
  "s0178": "In the eleventh year, Su Wang died, and his son Xuan Wang Liang Fu ascended the throne.",
  "s0179": "In Xuan Wang's first year, he attacked Zheng.",
  "s0180": "In the twelfth year, Xuan Wang died, and his son Wei Wang Shang Chen ascended the throne.",
  "s0181": "In Wei Wang's first year, he attacked Sui.",
  "s0182": "In the second year, he attacked Zheng.",
  "s0183": "In the third year, Wei Wang died, and his son Dao Wang Xiong Qian ascended the throne.",
  "s0184": "In Dao Wang's first year, he attacked Song.",
  "s0185": "In the eighth year, Dao Wang died, and his son Zhuang Wang Lü ascended the throne.",
  "s0186": "In Zhuang Wang's first year, he attacked Chen.",
  "s0187": "In the second year, he attacked Song.",
  "s0188": "In the fourth year, Zhuang Wang died, and his son Gong Wang Shen ascended the throne.",
  "s0189": "In Gong Wang's first year, he attacked Song.",
  "s0190": "In the fourth year, Gong Wang died, and his son Kang Wang Zhao ascended the throne.",
  "s0191": "In Kang Wang's first year, he attacked Zheng.",
  "s0192": "In the second year, he attacked Song.",
  "s0193": "In the eighth year, Kang Wang died, and his son Jia Ao Yuan ascended the throne.",
  "s0194": "In Jia Ao's first year, he attacked Zheng.",
  "s0195": "In the second year, Jia Ao died, and his son Ling Wang Wei ascended the throne.",
  "s0196": "In Ling Wang's first year, he attacked Chen.",
  "s0197": "In the third year, Ling Wang died, and his son Ping Wang Qi Ji ascended the throne.",
  "s0198": "In Ping Wang's first year, he attacked Song.",
  "s0199": "In the second year, Ping Wang died, and his son Zhao Wang Zhen ascended the throne.",
  "s0200": "In Zhao Wang's first year, he attacked Wei."
}
