{
  "s0001": "The Grand Historian says: I have often read the Yu Shu, reaching the point where ruler and minister mutually admonish, only then is the state secure, but if the limbs are not good, ten thousand affairs fall into ruin, I have never not shed tears.",
  "s0002": "Cheng Wang made the Song, pushed himself to punish and reform, grieved those family difficulties, can it not be called trembling with fear, good at guarding and good at ending?",
  "s0003": "The gentleman when not constrained then cultivates virtue, when full then abandons ritual, at ease can think of the beginning, secure can remember the start, bathed in rich favor while singing of hardship, who but great virtue can be like this!",
  "s0004": "The tradition says 'When governance is settled and merit complete, ritual and music then flourish'.",
  "s0005": "Within the seas human way grew deeper, their virtue grew more complete, what they took joy in grew more refined.",
  "s0006": "Full without decrease then overflows, complete without holding then topples.",
  "s0007": "All music making is to moderate joy.",
  "s0008": "The gentleman takes humility and withdrawal as ritual, takes decrease and reduction as joy, takes joy in this way.",
  "s0009": "Considering that provinces differ and states vary, feelings and customs differ, thus broadly gather customs, harmonize and compare tones and rhythms, to supplement shortcomings and shift transformation, assist flowing governance and teaching.",
  "s0010": "The Son of Heaven personally at the Bright Hall observes, and the myriad people all wash away evil impurity, ladle full to the brim, to adorn their nature.",
  "s0011": "Thus it is said the sounds of ya and song order and people are correct, the sounds of jiao jiao arise and scholars strive, the tunes of Zheng and Wei move and hearts become licentious.",
  "s0012": "When it reaches harmonious blending, birds and beasts all are moved, and moreover those embracing the five constants, containing likes and dislikes, it is the natural tendency.",
  "s0013": "When the way of governance is deficient and Zheng music arises, enfeoffed lords generation after generation become powerful, names illustrious in neighboring states, contend to surpass each other.",
  "s0014": "Since Zhong Ni could not make the Qi actor tolerate him in Lu, though he retreated to correct music to guide the age, made five chapters to criticize the times, still none were transformed.",
  "s0015": "Declining to reach the six states, flowing and sinking in dissipation, went away never to return, finally perished body and extinguished clan, united state to Qin.",
  "s0016": "Qin Er Shi especially took it as entertainment.",
  "s0017": "Chancellor Li Si advanced remonstrance saying: 'Abandon poetry and books, extreme in sounds and colors, Zu Yi thus feared;",
  "s0018": "Lightly accumulate minor faults, indulge heart in long night, Zhou thus perished.'",
  "s0019": "Zhao Gao said: 'The Five Emperors, Three Kings music each had different names, showing they did not imitate each other.",
  "s0020": "Above from the court, below to the people, they can connect joy and happiness, unite attentiveness, not this harmonious delight does not communicate, the dissolving favor does not flow, also each age's transformation, measure of the times' joy, why must it be the Huashan black-eared horse then goes far?'",
  "s0021": "Er Shi approved it.",
  "s0022": "Gao Zu passed Pei sang the three marquess chapter, commanded children to sing it.",
  "s0023": "Gao Zu collapsed, commanded Pei to use the four seasons to sing and dance at the ancestral temple.",
  "s0024": "Xiao Hui, Xiao Wen, Xiao Jing made no additions or changes, at the Music Bureau practiced the constant and reviewed the old only.",
  "s0025": "Until the current emperor ascended the throne, made nineteen chapters, commanded Attendant Li Yan Nian to arrange their sounds, appointed as Harmonious Rhythms Colonel.",
  "s0026": "Those who master one classic cannot alone know its words, all gather the five classics scholars, mutually discuss and practice read it, then can thoroughly understand its meaning, much elegant and correct writing.",
  "s0027": "Han house constantly in first month upper xin sacrifices Tai Yi at Gan Quan, with dusk time night sacrifice, arrives at dawn and ends.",
  "s0028": "Constantly had shooting star pass over the sacrifice altar.",
  "s0029": "Made boy servants and girl servants seventy people all sing together.",
  "s0030": "Spring sings Qing Yang, summer sings Zhu Ming, autumn sings Xi Hai, winter sings Xuan Ming.",
  "s0031": "The world has many such, thus not discussed.",
  "s0032": "Also once obtained divine horse in Wo Wo water, moreover arranged it as Tai Yi song.",
  "s0033": "Song lyrics say: 'Tai Yi sends down the heavenly horse, moistens red sweat flows foam crimson.",
  "s0034": "Gallops at ease crosses ten thousand li, now has companion dragon as friend.'",
  "s0035": "Later attacked Da Yuan obtained thousand li horse, horse named Pu Shao, moreover made it as song.",
  "s0036": "Song poem says: 'Heavenly horse comes from western extreme, crosses ten thousand li returns to virtuous.",
  "s0037": "Receives spiritual might descends foreign lands, crosses flowing sands four barbarians submit.'",
  "s0038": "Colonel Ji Pian advanced saying: 'All kings who make music, above to receive ancestors, below to transform the myriad people.",
  "s0039": "Now Your Majesty obtains horse, makes poem as song, harmonizes at ancestral temple, former emperors and people how can they know its sound?'",
  "s0040": "The emperor was silent not pleased.",
  "s0041": "Chancellor Gong Sun Hong said: 'Pian slanders the sacred system, should be exterminated.'",
  "s0043": "All sound arises from the human heart.",
  "s0044": "The human heart's movement, things cause it so.",
  "s0045": "Moved by things thus takes form in sound;",
  "s0046": "Sounds respond thus give rise to change;",
  "s0047": "Change becomes pattern, called sound;",
  "s0048": "Compare sounds and take joy in them, and with shields axes feathers banners, called music.",
  "s0049": "Music is that from which sound is born, its root is in the human heart moved by things.",
  "s0050": "Thus those whose sorrowful heart is moved, their sound is high and sharp;"
}
