{
  "s251": "One. Year 2, Marquis Yan year 1. Zhong year 2, committed crime, extinct. Eight. Zhong year 6, enfeoffed He's son Marquis Zui year 1. Nest four. After year 3, Zui died, no heir, state abolished.",
  "s254": "Yangxia.",
  "s255": "As special general leading 500 troops, year 1 BCE followed uprising in Wan, Qu, to Baxiang, became marquis, as roving general separately pacified Dai, after defeating Zang Tea, enfeoffed Xi as Marquis of Yangxia.",
  "s256": "Five. Year 6, month 1 Bing Wu day, Marquis Chen Xi year 1. Year 10, month 8, Xi as Chancellor of Zhao led troops to guard Dai. Han sent to summon Xi, Xi rebelled, with his troops and Wang Huang etc. attacked Dai, self-established as king. Han killed Xi at Lingqiu.",
  "s263": "Longlü.",
  "s264": "As soldier followed uprising in Dang, as lian'ao entered Han, as long spear commandery captain. Attacked Xiang Yu, had merit, became marquis.",
  "s265": "Seven. Year 6 month 1 Ding Wei day, Marquis Ai Zhou Zao year 1.",
  "s266": "Seven",
  "s267": "Eight",
  "s268": "Seventeen. Six. After year 2, Marquis Tong year 1.",
  "s269": "Seven. Zhong year 1, Marquis Tong committed crime, state abolished.",
  "s271": "Thirty-four",
  "s272": "Yangdu.",
  "s273": "As Zhao general followed uprising in Ye, to Baxiang, became Loufan general, entered Han, pacified Three Qins, separately surrendered Di King, attached to King Dao Wu, killed Long Qu at Pengcheng, became Grand Sima; defeated Yu's army at Ye, appointed general, loyal minister, became marquis, 7,800 households.",
  "s274": "Seven. Year 6 month 1 Wu Shen day, Marquis Jing Ding Fu year 1.",
  "s275": "Seven",
  "s276": "Five. Three. Year 6, Marquis Zhao Ning year 1.",
  "s277": "Nine. Fourteen. Year 10, Marquis An Cheng year 1.",
  "s278": "One. Year 2, Marquis An Cheng committed crime, state abolished.",
  "s280": "Seventeen",
  "s281": "Xinyang.",
  "s282": "As Han year 5 used Left Lingyin initially followed, meritorious service comparable to Marquis of Tangyi, 1,000 households.",
  "s283": "Seven. Year 6 month 1 Gui Zi day, Marquis Hu Lü Qing year 1.",
  "s284": "Three. Four. Year 4, Marquis Qing Chen year 1.",
  "s285": "Eight",
  "s286": "Six. Two. Year 7, Marquis Huai Yi year 1. Fifteen. Year 9, Marquis Hui Tuo year 1.",
  "s287": "Four. Five. Year 5, Marquis Gong Shan year 1. Seven. Zhong year 3, Marquis Tan year 1.",
  "s288": "Twenty-eight. Yuanding year 5, Marquis Tan convicted of tribute gold, state abolished.",
  "s289": "Eighty-one",
  "s290": "Dongwu.",
  "s291": "As household guard. Rose from Xue, attached to King Dao Wu, defeated Qin army at Gangli, Yang Xiong's army at Quyu, entered Han, became Yue general, pacified Three Qins, as commandery captain firmly defended Aocang, became general, defeated Ji's army, meritorious service led to marquisate, 2,000 households.",
  "s292": "Seven. Year 6 month 1 Wu Wu day, Marquis Zhen Guo Meng year 1.",
  "s293": "Seven",
  "s294": "Five. Three. Year 6, Marquis Tuo year 1.",
  "s295": "Twenty-three",
  "s296": "Five. Year 6, Marquis Tuo executed in market, state abolished.",
  "s298": "Forty-one",
  "s299": "Zhifang.",
  "s300": "As Zhao general year 3 BCE followed pacifying various lords, became marquis, 2,500 households, meritorious service comparable to Marquis of Pingding. Chi was formerly Pei strongman, had strength, had alliance with superior, therefore followed late.",
  "s301": "Seven. Year 6 month 3 Wu Zi day, Marquis Su Yong Chi year 1.",
  "s302": "Two. Five. Year 3, Marquis Huang Ju year 1.",
  "s303": "Eight",
  "s304": ". Twenty-three",
  "s305": "Two. Ten. Year 3, Marquis Ye year 1. Four. Zhong year 6, Marquis Zhong Huan year 1.",
  "s306": "Twenty-eight. Yuanding year 5, Marquis Zhong Huan convicted of tribute gold, state abolished.",
  "s307": "Fifty-seven",
  "s308": "Jipu.",
  "s309": "As general year 1 BCE leading 2,500 troops rose from Xue, separately rescued Dong'a, to Baxiang, year 2 month 10 entered Han, attacked Qi army at Lixia Tian Ji, meritorious service led to marquisate.",
  "s310": "Seven. Year 6 month 3 Bing Shen day, Marquis Gang Chen Wu year 1.",
  "s311": "Seven"
}
