{
  "s0152": "This year, Kong Qiu died.",
  "s0153": "Qi Dong Lou Gong, Xia Hou Yu descendants Miao yi.",
  "s0154": "Yin time or enfeoffed or cut off.",
  "s0155": "Zhou Wu Wang conquered Yin Zhou, sought Yu descendants, obtained Dong Lou Gong, enfeoffed at Qi, to serve Xia Hou clan sacrifices.",
  "s0156": "Dong Lou Gong gave birth Xi Lou Gong, Xi Lou Gong gave birth Ti Gong, Ti Gong gave birth Mou Qu Gong.",
  "s0157": "Mou Qu Gong during Zhou Li Wang time.",
  "s0158": "Mou Qu Gong gave birth Wu Gong.",
  "s0159": "Wu Gong established forty-seven years died, son Jing Gong established.",
  "s0160": "Jing Gong twenty-three years died, son Gong Gong established.",
  "s0161": "Gong Gong eight years died, son De Gong established.",
  "s0162": "De Gong eighteen years died, younger brother Huan Gong Gu Rong established.",
  "s0163": "Huan Gong seventeen years died, son Xiao Gong Gai established.",
  "s0164": "Xiao Gong seventeen years died, younger brother Wen Gong Yi Gu established.",
  "s0165": "Wen Gong fourteen years died, younger brother Ping Gong Yu established.",
  "s0166": "Ping Gong eighteen years died, son Dao Gong Cheng established.",
  "s0167": "Dao Gong twelve years died, son Yin Gong Qi established.",
  "s0168": "Seventh month, Yin Gong younger brother Sui assassinated Yin Gong self established, this was Xi Gong.",
  "s0169": "Xi Gong nineteen years died, son Min Gong Wei established.",
  "s0170": "Min Gong fifteenth year, Chu Hui Wang extinguished Chen.",
  "s0171": "Sixteenth year, Min Gong younger brother Yan Lu assassinated Min Gong replaced established, this was Ai Gong.",
  "s0172": "Ai Gong established ten years died, Min Gong son Chi established, this was Chu Gong.",
  "s0173": "Chu Gong twelve years died, son Jian Gong Chun established.",
  "s0174": "Established one year, Chu Hui Wang forty-fourth year, extinguished Qi.",
  "s0175": "Qi after Chen perished thirty-four years.",
  "s0176": "Qi small minute, its affairs insufficient worthy describe.",
  "s0177": "Shun descendants, Zhou Wu Wang enfeoffed at Chen, to Chu Hui Wang extinguished it, has genealogy speaks.",
  "s0178": "Yu descendants, Zhou Wu Wang enfeoffed at Qi, Chu Hui Wang extinguished it, has genealogy speaks.",
  "s0179": "Qi descendants became Yin, Yin has basic record speaks.",
  "s0180": "Yin broken, Zhou enfeoffed its descendants at Song, Qi Min Wang extinguished it, has genealogy speaks.",
  "s0181": "Hou Ji descendants became Zhou, Qin Zhao Wang extinguished it, has basic record speaks.",
  "s0182": "Gao Tao descendants, or enfeoffed Ying, Liu, Chu Mu Wang extinguished them, no genealogy.",
  "s0183": "Bo Yi descendants, to Zhou Wu Wang again enfeoffed at Qi, called Tai Gong Wang, Chen clan extinguished it, has genealogy speaks.",
  "s0184": "Bo Yi descendants, to Zhou Ping Wang time enfeoffed as Qin, Xiang Yu extinguished it, has basic record speaks.",
  "s0185": "Chui, Yi, Kui, Long, their descendants not know enfeoffed where, not seen.",
  "s0186": "Right eleven people, all Tang Yu time famous meritorious virtue ministers;",
  "s0187": "their five people's descendants all to emperor kings, remainder became illustrious feudal lords.",
  "s0188": "Teng, Xue, Zou, Xia, Yin, Zhou between enfeoffed, small, insufficient worthy list, not discuss.",
  "s0189": "Zhou Wu Wang time, hou bo still over thousand people.",
  "s0190": "To You, Li after, feudal lords force attacked mutually annexed.",
  "s0191": "Jiang, Huang, Hu, Shen kind, cannot win count, so not collected recorded at transmission.",
  "s0192": "Grand Historian said: Shun virtue can call utmost!",
  "s0193": "Yielded position to Xia, later generations blood food lasted three dynasties.",
  "s0194": "To Chu extinguished Chen, Tian Chang obtained government at Qi, finally made establish country, hundred generations not cut off, Miao yi flourishing, having land not lack.",
  "s0195": "To Yu, at Zhou then Qi, minute very, insufficient count.",
  "s0196": "Chu Hui Wang extinguished Qi, its after Yue Wang Gou Jian rose."
}
