{
  "s0201": "When the tripod was completed, a dragon hung its whiskers down to welcome Huangdi.",
  "s0202": "Huangdi rode up, his ministers and consorts followed up the dragon over seventy people, then departed.",
  "s0203": "The remaining minor officials could not ascend, all held the dragon whiskers, the dragon whiskers pulled out, dropped Huangdi's bow.",
  "s0204": "The common people gazed up at Huangdi having ascended to heaven, then embraced his bow and the dragon whiskers wailing.",
  "s0205": "Therefore later generations named the place Dinghu, his bow Wuhao.'",
  "s0206": "Therefore the Son of Heaven said: 'Alas!",
  "s0207": "If I could truly be like Huangdi, I would view leaving wife and children as taking off shoes.'",
  "s0208": "Then appointed Qing as Gentleman, sent east to await spirits at Tai Room.",
  "s0209": "The emperor then performed suburban sacrifice at Yong, reached Longxi, west ascended Kongtong, arrived at Ganquan.",
  "s0210": "Ordered sacrificial officials Kuan Shu and others to prepare the Taiyi sacrifice altar, altar modeled after Boji's Taiyi altar, altar three levels.",
  "s0211": "The five emperors' altars surround below, each according to their direction, Huangdi southwest, removed eight ghost paths.",
  "s0212": "Also made the Son of Heaven's altar, high twenty zhang, wide twenty, with two dragons leading it.",
  "s0213": "Made the sacrifice ceremony like that of the suburban sacrifice.",
  "s0214": "Summoned all the scholars and Confucian officials to discuss the feng and shan sacrifices.",
  "s0215": "The emperor wished to perform the feng and shan sacrifices.",
  "s0216": "The prime minister and others said: 'Anciently, the Son of Heaven performed feng and shan when the world was at peace, when there were no natural disasters, when the yellow dragon appeared, when the phoenix gathered, when the qilin appeared, when the auspicious grain ripened, when the sweet springs flowed, when the jade talismans appeared, when the divine tripods emerged, when the rivers were clear, when the seas were calm.'",
  "s0217": "Now though the world is not yet peaceful, the qilin has appeared, the auspicious grain has ripened, the sweet springs have flowed, the jade talismans have appeared, the divine tripods have emerged.",
  "s0218": "But the yellow dragon has not appeared, the phoenix has not gathered, the rivers are not clear, the seas are not calm.",
  "s0219": "Therefore cannot perform feng and shan.'",
  "s0220": "The emperor said: 'The ancient way is distant, I will follow my own way.'",
  "s0221": "Then prepared to perform the feng and shan sacrifices.",
  "s0222": "The prime minister and others said: 'The feng and shan sacrifices are the most important of the Son of Heaven's ceremonies, if not perfect, ghosts and spirits will not enjoy it, the common people will not believe it, cannot be done.'",
  "s0223": "The emperor did not listen, prepared the feng and shan sacrifices.",
  "s0224": "The officials who opposed were all demoted or exiled.",
  "s0225": "The emperor toured Yongzhou.",
  "s0226": "Second year, the emperor toured Yizhou.",
  "s0227": "Third year, the emperor toured Yanzhou.",
  "s0228": "Fourth year, the emperor toured Jingzhou.",
  "s0229": "Fifth year, the emperor toured Yangzhou.",
  "s0230": "Sixth year, the emperor toured Qingzhou.",
  "s0231": "Seventh year, the emperor toured Xuzhou.",
  "s0232": "Eighth year, the emperor toured Youzhou.",
  "s0233": "Ninth year, the emperor toured Bingzhou.",
  "s0234": "Tenth year, the emperor toured Jizhou.",
  "s0235": "Eleventh year, the emperor toured Liangzhou.",
  "s0236": "Twelfth year, the emperor toured Yongzhou.",
  "s0237": "Thirteenth year, the emperor toured Yizhou.",
  "s0238": "Fourteenth year, the emperor toured Yanzhou.",
  "s0239": "Fifteenth year, the emperor toured Jingzhou.",
  "s0240": "Sixteenth year, the emperor toured Yangzhou.",
  "s0241": "Seventeenth year, the emperor toured Qingzhou.",
  "s0242": "Eighteenth year, the emperor toured Xuzhou.",
  "s0243": "Nineteenth year, the emperor toured Youzhou.",
  "s0244": "Twentieth year, the emperor toured Bingzhou.",
  "s0245": "Twenty-first year, the emperor toured Jizhou.",
  "s0246": "Twenty-second year, the emperor toured Liangzhou.",
  "s0247": "Twenty-third year, the emperor toured Yongzhou.",
  "s0248": "Twenty-fourth year, the emperor toured Yizhou.",
  "s0249": "Twenty-fifth year, the emperor toured Yanzhou.",
  "s0250": "Twenty-sixth year, the emperor toured Jingzhou."
}