{
  "s0001": {
    "literal": "Since ancient times, rulers who receive the mandate and those who restore the dynasty must revive extinguished lines, continue broken successions, repair what has been abandoned, and raise up those who have withdrawn, then the world will turn to benevolence, and the governance of the four quarters will be carried out.",
    "idiomatic": "Since ancient times, rulers who receive the heavenly mandate and those who restore a fallen dynasty must revive extinguished noble lines, continue broken successions, repair abandoned traditions, and raise up those who have withdrawn from public life. Only then will the world embrace benevolence, and governance extend to all four corners of the realm."
  },
  "s0002": {
    "literal": "The traditions say that when King Wu conquered Yin, he honored the tombs of worthy sages, even going so far as to honor those he could not reach before alighting from his chariot.",
    "idiomatic": "The traditions tell us that when King Wu conquered the Shang, he honored the tombs of worthy sages, going so far as to pay respects to those he could not reach before even stepping down from his chariot."
  },
  "s0003": {
    "literal": "Although the generations are different, the principles are the same.",
    "idiomatic": "Though the ages may change, these principles remain constant."
  },
  "s0004": {
    "literal": "Gaozu eliminated chaos and executed the violent, affairs were in their initial stages, he had no time to spare, yet he still performed sacrifices to the six states, sought out and summoned the Four Graybeards, passing through Wei he honored the tomb of Wu Ji, arriving in Zhao he enfeoffed the descendants of Yue Yi.",
    "idiomatic": "When Gaozu eliminated chaos and executed tyrants, the affairs of state were just beginning—he had no time to spare. Yet he still performed sacrifices to the six vanquished states, sought out and summoned the Four Graybeards, honored the tomb of Wu Ji when passing through Wei, and enfeoffed the descendants of Yue Yi upon arriving in Zhao."
  },
  "s0005": {
    "literal": "When it came to granting rewards and conferring positions, noble ranks were given according to merit as precedence, officials were appointed according to ability as sequence.",
    "idiomatic": "When it came to dispensing rewards and conferring positions, noble titles were granted based on merit, with officials appointed according to their abilities."
  },
  "s0006": {
    "literal": "His descendants together maintained his undertakings, old ministers successively held positions.",
    "idiomatic": "His descendants collectively upheld his legacy, with veteran ministers successively holding office."
  },
  "s0007": {
    "literal": "孝惠二年，帝太后稱制，三年正月崩。",
    "idiomatic": "In the second year of Xiaohui, the Empress Dowager exercised imperial authority. She passed away in the first month of the third year."
  },
  "s0008": {
    "literal": "四年正月，皇太后臨朝稱制。",
    "idiomatic": "In the first month of the fourth year, the Empress Dowager presided over court and exercised imperial authority."
  },
  "s0009": {
    "literal": "七年正月，皇太后崩。",
    "idiomatic": "In the first month of the seventh year, the Empress Dowager passed away."
  },
  "s0010": {
    "literal": "高后稱制，八年九月崩。",
    "idiomatic": "The Empress Gao exercised imperial authority. She passed away in the ninth month of the eighth year."
  },
  "s0011": {
    "literal": "八年十月，皇太后稱制。",
    "idiomatic": "In the tenth month of the eighth year, the Empress Dowager exercised imperial authority."
  },
  "s0012": {
    "literal": "十二年二月，皇太后崩。",
    "idiomatic": "In the second month of the twelfth year, the Empress Dowager passed away."
  },
  "s0013": {
    "literal": "孝文元年正月，皇太后稱制。",
    "idiomatic": "In the first month of the first year of Xiaowen, the Empress Dowager exercised imperial authority."
  },
  "s0014": {
    "literal": "六年正月，皇太后崩。",
    "idiomatic": "In the first month of the sixth year, the Empress Dowager passed away."
  },
  "s0015": {
    "literal": "孝景元年正月，皇太后稱制。",
    "idiomatic": "In the first month of the first year of Xiaojing, the Empress Dowager exercised imperial authority."
  },
  "s0016": {
    "literal": "六年正月，皇太后崩。",
    "idiomatic": "In the first month of the sixth year, the Empress Dowager passed away."
  },
  "s0017": {
    "literal": "孝武建元元年正月，皇太后稱制。",
    "idiomatic": "In the first month of the first year of Jianyuan (Xiaowu), the Empress Dowager exercised imperial authority."
  },
  "s0018": {
    "literal": "六年正月，皇太后崩。",
    "idiomatic": "In the first month of the sixth year, the Empress Dowager passed away."
  },
  "s0019": {
    "literal": "自古帝王，必有賢妃，助國治政。",
    "idiomatic": "Since ancient times, emperors must have wise consorts to assist in governing the state and administering affairs."
  },
  "s0020": {
    "literal": "外戚之家，連屬帝室，殊恩澤，賞賜優渥，豐履兼備。",
    "idiomatic": "The houses of imperial relatives are connected to the imperial family, receiving special favor and generous rewards, with abundant emoluments and complete provisions."
  },
  "s0021": {
    "literal": "恩及后世，榮華之盛，無與為比。",
    "idiomatic": "This favor extends to future generations, with splendor and prosperity unmatched by any other."
  },
  "s0022": {
    "literal": "然亦有輔政執謀，功冠帝室，德著祖宗，與帝連體，賢哉賢哉。",
    "idiomatic": "Yet there are also those who assist in governance and hold counsel, whose merits crown the imperial house, whose virtue illuminates ancestors, who are united with the emperor—truly worthy, truly worthy."
  },
  "s0023": {
    "literal": "今表外戚恩澤侯者，所以咸尊漢興，興滅國，繼絕世，修廢官，舉逸民。",
    "idiomatic": "Now I compile this table of marquises by grace of imperial relatives to universally honor the rise of Han, revive extinguished states, continue broken successions, repair abandoned offices, and raise up reclusive scholars."
  },
  "s0024": {
    "literal": "雲何？云何？",
    "idiomatic": "What does this mean? What does this mean?"
  },
  "s0025": {
    "literal": "號諡姓名",
    "idiomatic": "Title, Posthumous Name, Personal Name"
  },
  "s0026": {
    "literal": "恩澤侯",
    "idiomatic": "Marquis by Imperial Grace"
  },
  "s0027": {
    "literal": "爵位",
    "idiomatic": "Noble Rank"
  },
  "s0028": {
    "literal": "食邑",
    "idiomatic": "Fief Income"
  },
  "s0029": {
    "literal": "子",
    "idiomatic": "Successor"
  },
  "s0030": {
    "literal": "孫",
    "idiomatic": "Grandson"
  },
  "s0031": {
    "literal": "玄孫",
    "idiomatic": "Great-grandson"
  },
  "s0032": {
    "literal": "云孫",
    "idiomatic": "Great-great-grandson"
  },
  "s0033": {
    "literal": "來孫",
    "idiomatic": "Great-great-great-grandson"
  },
  "s0034": {
    "literal": "昆孫",
    "idiomatic": "Great-great-great-great-grandson"
  },
  "s0035": {
    "literal": "仍孫",
    "idiomatic": "Great-great-great-great-great-grandson"
  },
  "s0036": {
    "literal": "缌孫",
    "idiomatic": "Great-great-great-great-great-great-grandson"
  },
  "s0037": {
    "literal": "袑孫",
    "idiomatic": "Great-great-great-great-great-great-great-grandson"
  },
  "s0038": {
    "literal": "終孫",
    "idiomatic": "Great-great-great-great-great-great-great-great-grandson"
  },
  "s0039": {
    "literal": "信都侯盧綰",
    "idiomatic": "Marquis of Xindu, Lu Wan"
  },
  "s0040": {
    "literal": "高帝功臣，以相國侯。",
    "idiomatic": "Gaozu's meritorious official, enfeoffed as Marquis with the title of Chancellor."
  },
  "s0041": {
    "literal": "五年，謀反，國除。",
    "idiomatic": "In the fifth year, he plotted rebellion, and his fief was abolished."
  },
  "s0042": {
    "literal": "臨光侯劉賈",
    "idiomatic": "Marquis of Linguang, Liu Jia"
  },
  "s0043": {
    "literal": "高帝從父兄也，以家人子侯。",
    "idiomatic": "Gaozu's cousin, enfeoffed as Marquis as a member of the imperial family."
  },
  "s0044": {
    "literal": "七年，謀反，國除。",
    "idiomatic": "In the seventh year, he plotted rebellion, and his fief was abolished."
  },
  "s0045": {
    "literal": "陽信侯劉喜",
    "idiomatic": "Marquis of Yangxin, Liu Xi"
  },
  "s0046": {
    "literal": "高帝從父兄也，以家人子侯。",
    "idiomatic": "Gaozu's cousin, enfeoffed as Marquis as a member of the imperial family."
  },
  "s0047": {
    "literal": "七年，謀反，國除。",
    "idiomatic": "In the seventh year, he plotted rebellion, and his fief was abolished."
  },
  "s0048": {
    "literal": "東武侯郭蒙",
    "idiomatic": "Marquis of Dongwu, Guo Meng"
  },
  "s0049": {
    "literal": "高后從兄子也，以家人子侯。",
    "idiomatic": "Nephew of Empress Gao, enfeoffed as Marquis as a member of the imperial family."
  },
  "s0050": {
    "literal": "七年，謀反，國除。",
    "idiomatic": "In the seventh year, he plotted rebellion, and his fief was abolished."
  }
}
