{
  "s0148": "Finally raised two armies, chariots two thousand, Li Fu led attacked Gao, Qing Qin attacked Dai.",
  "s0149": "Only grand master Jiang Qu told Yan Wang said: 'With people through pass allied interacted, with five hundred gold drank person's wang, envoy reported returned attacked it, not auspicious, troops no successful.'",
  "s0150": "Yan Wang not listened, self led partial army followed it.",
  "s0151": "Jiang Qu pulled Yan Wang ribbon stopped said: 'Wang must not self go, go no successful.'",
  "s0152": "Wang kicked with foot.",
  "s0153": "Jiang Qu cried said: 'Minister not for self, for wang!'",
  "s0154": "Yan army to Song Zi, Zhao made Lian Po led, attacked broke Li Fu at Gao.",
  "s0155": "Yue Cheng broke Qing Qin at Dai.",
  "s0156": "Yue Xian fled Zhao.",
  "s0157": "Lian Po pursued five hundred remaining li, surrounded their country.",
  "s0158": "Yan people requested peace, Zhao people not permitted, must make Jiang Qu place peace.",
  "s0159": "Yan chancellor Jiang Qu with placed peace.",
  "s0160": "Zhao listened Jiang Qu, released Yan surround.",
  "s0161": "Sixth year, Qin extinguished east Zhou, established San Chuan commandery.",
  "s0162": "Seventh year, Qin captured Zhao Yu Ci thirty-seven cities, Qin established Tai Yuan commandery.",
  "s0163": "Ninth year, Qin Wang Zheng initially ascended position.",
  "s0164": "Tenth year, Zhao made Lian Po led attacked Fan Yang, captured it.",
  "s0165": "Zhao Xiao Cheng Wang died, Dao Xiang Wang established.",
  "s0166": "Made Yue Cheng replace Lian Po, Lian Po not listened, attacked Yue Cheng, Yue Cheng fled, Lian Po fled Da Liang.",
  "s0167": "Twelfth year, Zhao made Li Mu attacked Yan, captured Wu Sui, Fang Cheng.",
  "s0168": "Ju Xin formerly resided Zhao, with Pang Juan good, already fled went Yan.",
  "s0169": "Yan saw Zhao several troubled by Qin, Lian Po left, ordered Pang Juan led, wished take advantage Zhao weary attacked it.",
  "s0170": "Asked Ju Xin, Xin said: 'Pang Juan easy with.'",
  "s0171": "Yan made Ju Xin led attacked Zhao, Zhao made Pang Juan attacked it, took Yan army two ten thousand, killed Ju Xin.",
  "s0172": "Qin captured Wei twenty cities, established Dong commandery.",
  "s0173": "Nineteenth year, Qin captured Zhao Ye nine cities.",
  "s0174": "Zhao Dao Xiang Wang died.",
  "s0175": "Twenty-third year, crown prince Dan hostage at Qin, fled returned Yan.",
  "s0176": "Twenty-fifth year, Qin captured extinguished Han Wang An, established Ying Chuan commandery.",
  "s0177": "Twenty-seventh year, Qin captured Zhao Wang Qian, extinguished Zhao.",
  "s0178": "Zhao gong zi Jia self established as Dai Wang.",
  "s0179": "Yan saw Qin about extinguish six countries, Qin troops approached Yi Shui, calamity about arrived Yan.",
  "s0180": "Crown prince Dan secretly nurtured brave men twenty people, made Jing Ke presented Du Kang land map to Qin, took advantage attacked stabbed Qin Wang.",
  "s0181": "Qin Wang aware, killed Ke, made general Wang Jian attacked Yan.",
  "s0182": "Twenty-ninth year, Qin attacked captured our Ji, Yan Wang fled, moved resided Liao Dong, beheaded Dan to offer Qin.",
  "s0183": "Thirtieth year, Qin extinguished Wei.",
  "s0184": "Thirty-third year, Qin captured Liao Dong, captured Yan Wang Xi, finally extinguished Yan.",
  "s0185": "This year, Qin general Wang Ben also captured Dai Wang Jia.",
  "s0186": "Grand Historian said: Zhao Gong Shi can call benevolent!",
  "s0187": "Paulownia tree moreover thought it, moreover its person?",
  "s0188": "Yan outside pressed Man Hu, inside placed Qi, Jin, rugged strong country between, most weak small, nearly extinguished several times.",
  "s0189": "But altars blood food eight nine hundred years, at Ji surname alone last perished, how not Zhao Gong's merit!"
}
