{
  "s0106": "Fan Li then urged the advance of troops, saying: 'The king has entrusted government to you officials. Let the envoy leave, otherwise he will be guilty.'",
  "s0107": "The Wu envoy wept and left.",
  "s0108": "Goujian pitied him and sent someone to tell the Wu king: 'I will place you in Yong Dong, with a hundred families to serve you.'",
  "s0109": "The Wu king declined, saying: 'I am old and cannot serve Your Majesty!'",
  "s0110": "He then committed suicide.",
  "s0111": "He covered his face, saying: 'I have no face to see Wu Zixu!'",
  "s0112": "The Yue king then buried the Wu king and executed Prime Minister Pi.",
  "s0113": "After Goujian had pacified Wu, he led troops north across the Huai River and met with the feudal lords of Qi and Jin at Xu Province, presenting tribute to Zhou.",
  "s0114": "King Yuan of Zhou sent someone to grant Goujian sacrificial meat and appoint him as a marquess.",
  "s0115": "After Goujian left, he crossed south of the Huai and gave the land north of the Huai to Chu, returned the territory Wu had taken from Song to Song, and gave a hundred li east of the Si River to Lu.",
  "s0116": "At this time, Yue troops marched horizontally through the Jiang and Huai east regions. All the feudal lords congratulated him, and he was called the Hegemon King.",
  "s0117": "Fan Li then left and sent a letter to Wen Zhong from Qi: 'When the birds are all shot down, the good bow is put away;",
  "s0118": "when the cunning rabbit dies, the running dogs are cooked.",
  "s0119": "The Yue king has a long neck and bird-like beak - he can be shared with in hardship, but not in pleasure.",
  "s0120": "Why do you not leave?'",
  "s0121": "Wen Zhong saw the letter and feigned illness without attending court.",
  "s0122": "Someone slandered Wen Zhong, saying he was about to rebel. The Yue king sent him a sword, saying: 'You taught me seven strategies to attack Wu. I used three and defeated Wu. The four remaining are in you. Be my precursor to test them with the former kings.'",
  "s0123": "Wen Zhong then committed suicide.",
  "s0124": "Goujian died, and his son Wang Pi succeeded him.",
  "s0125": "Wang Pi died, and his son Wang Bu Shou succeeded him.",
  "s0126": "Wang Bu Shou died, and his son Wang Weng succeeded him.",
  "s0127": "Wang Weng died, and his son Wang Yi succeeded him.",
  "s0128": "Wang Yi died, and his son Wang Zhi Hou succeeded him.",
  "s0129": "Wang Zhi Hou died, and his son Wang Wu Qiang succeeded him.",
  "s0130": "During Wang Wu Qiang's time, Yue raised troops to attack Qi in the north and attack Chu in the west, contending for power with the central states.",
  "s0131": "During King Wei of Chu's time, Yue attacked Qi in the north. King Wei of Qi sent someone to persuade the Yue king: 'If Yue does not attack Chu, it cannot become a great king or even a small hegemon.",
  "s0132": "I suspect Yue's reason for not attacking Chu is that it cannot obtain Jin's support.",
  "s0133": "Han and Wei certainly will not attack Chu.",
  "s0134": "If Han attacks Chu and overturns their army, kills their general, then Ye and Yang Di will be in danger;",
  "s0135": "if Wei also overturns their army and kills their general, then Chen and Shang Cai will be uneasy.",
  "s0136": "Therefore the two Jin states serving Yue would not go so far as to overturn armies and kill generals, nor would they expend their horses' sweat effectively.",
  "s0137": "What is the importance of obtaining Jin's support?'",
  "s0138": "The Yue king said: 'What I seek from Jin is not to the point of clashing blades and meeting in battle, much less attacking cities and besieging towns.",
  "s0139": "I wish Wei would gather forces below Da Liang, and I wish Qi would test its troops in the southern regions of Ju territory, gathering at the borders of Chang and Tan. Then beyond Fang Cheng they would not go south, between Huai and Si they would not go east, the lands of Shang, Yu, Xi, Li, Zong Hu, and Xia Lu on the left would not be enough to defend against Qin, and south of the Jiang and north of the Si would not be enough to face Yue.",
  "s0140": "Then Qi, Qin, Han, and Wei could have their way with Chu - this is the two Jin states dividing land without fighting, harvesting without plowing.",
  "s0141": "If they do not do this, but clash blades between the rivers and mountains to serve Qi and Qin, then what they wait for is such a miscalculation. How can they become kings with this!'",
  "s0142": "The Qi envoy said: 'Fortunately Yue has not perished!",
  "s0143": "I do not value their intelligence as sharp as eyes that see fine hairs but miss their own eyelashes.",
  "s0144": "Now the king knows Jin's miscalculation but does not know Yue's own faults - this is blindness in discussion.",
  "s0145": "What the king awaits from Jin is not the strength of sweating horses, nor can they combine armies and form alliances. He awaits them to divide Chu's forces.",
  "s0146": "Now Chu's forces are already divided - what is there to await from Jin?'",
  "s0147": "The Yue king said: 'What should I do?'",
  "s0148": "He replied: 'Chu has three grand masters organizing nine armies, surrounding Qu Wo and Yu Zhong in the north, reaching the pass of Wu Jia - three thousand seven hundred li. Jing Cui's army gathers north at Lu and Qi, south at Nan Yang. Is there anything larger than this?",
  "s0149": "Moreover, what the king seeks is to make Jin and Chu fight;",
  "s0150": "if Jin and Chu do not fight, Yue troops will not rise - this is knowing two and five but not knowing ten.",
  "s0151": "If they do not attack Chu at this time, I know that Yue cannot become a great king or small hegemon.",
  "s0152": "Fu Chou, Pang, and Chang Sha are Chu's grain supplies;",
  "s0153": "Jing Ze Ling is Chu's timber.",
  "s0154": "If Yue overlooks the pass of Wu Jia with troops, these four cities will not pay tribute to Ying.",
  "s0155": "I have heard that if one aims for kingship but does not achieve it, the harm can still be hegemony.",
  "s0156": "Now Yue aims for kingship but cannot achieve it. If Yue attacks Chu, Chu will be weakened and Qin will be strong. If Qin is strong, it will swallow the three Jin states.",
  "s0157": "The three Jin states being swallowed, Yue cannot face Qin alone. This is Yue's great fault.",
  "s0158": "The king should ally with Chu and attack Qi, then the three Jin states will be grateful to Yue.",
  "s0159": "If the three Jin states are grateful, they will certainly divide Chu's land with Yue.",
  "s0160": "If the three Jin states divide Chu's land with Yue, Chu will certainly resent the three Jin states.",
  "s0161": "If Chu resents the three Jin states, the world will certainly submit to Yue.",
  "s0162": "This is the way to become hegemon.'",
  "s0163": "The Yue king followed this advice and allied with Chu to attack Qi, defeating Qi at Gui Lin.",
  "s0164": "Qi feared Yue and presented five hundred li of territory to sue for peace.",
  "s0165": "Yue withdrew its troops.",
  "s0166": "Yue allied with Chu and attacked Qi again, defeating Qi at Ai Ling.",
  "s0167": "Yue king Wu Qiang died, and his son Wang Zhu succeeded him.",
  "s0168": "Wang Zhu died, and his son Wang Tui succeeded him.",
  "s0169": "Wang Tui died, and his son Wang Yue Ren succeeded him.",
  "s0170": "Wang Yue Ren died, and his son Wang Wu Ju succeeded him.",
  "s0171": "Wang Wu Ju died, and his son Wang Tian succeeded him.",
  "s0172": "Wang Tian died, and his son Wang Bi Qian succeeded him.",
  "s0173": "Wang Bi Qian died, and his son Wang Zou succeeded him.",
  "s0174": "Wang Zou died, and his son Wang Ying succeeded him.",
  "s0175": "Wang Ying died, and his son Wang Chang succeeded him.",
  "s0176": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0177": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0178": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0179": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0180": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0181": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0182": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0183": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0184": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0185": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0186": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0187": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0188": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0189": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0190": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0191": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0192": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0193": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0194": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0195": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0196": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0197": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0198": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0199": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0200": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0201": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0202": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0203": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0204": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0205": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0206": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0207": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0208": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0209": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0210": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0211": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0212": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0213": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0214": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0215": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0216": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0217": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0218": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0219": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0220": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0221": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0222": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0223": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0224": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0225": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0226": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0227": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0228": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him.",
  "s0229": "Wang Lou Jia died, and his son Wang Guang succeeded him.",
  "s0230": "Wang Guang died, and his son Wang Zhu succeeded him.",
  "s0231": "Wang Zhu died, and his son Wang Chang succeeded him.",
  "s0232": "Wang Chang died, and his son Wang Jian succeeded him.",
  "s0233": "Wang Jian died, and his son Wang Yu succeeded him.",
  "s0234": "Wang Yu died, and his son Wang Wu Miao succeeded him.",
  "s0235": "Wang Wu Miao died, and his son Wang Yue Gui succeeded him.",
  "s0236": "Wang Yue Gui died, and his son Wang Lou Jia succeeded him."
}
