{
  "s0085": "Said heavenly son make people parents, to be world wang.",
  "s0086": "'Three virtues: one called upright, two called strong overcome, three called soft overcome.",
  "s0087": "Peaceful healthy upright, strong not friend strong overcome, inner friend soft overcome, sunk gradual strong overcome, high bright soft overcome.",
  "s0088": "Only ruler make fortune, only ruler make awe, only ruler jade food.",
  "s0089": "Minister no have make fortune make awe jade food.",
  "s0090": "Minister have make fortune make awe jade food, its harm at your family, ominous at your country, person use slanted biased ruler, people use presumptuous perverse.",
  "s0091": "'Ji yi: choose establish divination turtle people.",
  "s0092": "Then command divination turtle, said rain, said ji, said ti, said wu, said ke, said zhen, said hui, altogether seven.",
  "s0093": "Divine five, occupy use two, derive fu.",
  "s0094": "Establish timely person as divination turtle, three people occupy then follow two people's words.",
  "s0095": "You then have great doubt, consult your heart, consult ministers scholars, consult common people, consult divination turtle.",
  "s0096": "You then follow, turtle follow, divination follow, ministers scholars follow, common people follow, this called great same, body its peaceful strong, descendants its meet auspicious.",
  "s0097": "You then follow, turtle follow, divination follow, ministers scholars contrary, common people contrary, auspicious.",
  "s0098": "Ministers scholars follow, turtle follow, divination follow, you then contrary, common people contrary, auspicious.",
  "s0099": "Common people follow, turtle follow, divination follow, you then contrary, ministers scholars contrary, auspicious.",
  "s0100": "You then follow, turtle follow, divination contrary, ministers scholars contrary, common people contrary, make inner auspicious, make outer ominous.",
  "s0101": "Turtle divination together contrary to people, use quiet auspicious, use act ominous.",
  "s0102": "'Shu zheng: said rain, said yang, said yu, said han, said feng, said shi.",
  "s0103": "Five come prepared, each with its sequence, common grass abundant luxuriant.",
  "s0104": "One extreme prepared, ominous.",
  "s0105": "One extreme perished, ominous.",
  "s0106": "Said xiu zheng: said su, timely rain if, said zhi, timely yang if;",
  "s0107": "said zhi, timely yu if;",
  "s0108": "said mou, timely han if;",
  "s0109": "said sheng, timely feng if.",
  "s0110": "Said jiu zheng: said kuang, constant rain if;",
  "s0111": "said jian, constant yang if;",
  "s0112": "said shu, constant yu if;",
  "s0113": "said ji, constant han if;",
  "s0114": "said wu, constant feng if.",
  "s0115": "Wang sheng wei sui, qing shi wei yue, shi yin wei ri.",
  "s0116": "Sui yue ri shi no change, hundred grains use become, govern use bright, jun people use manifest, family use peaceful healthy.",
  "s0117": "Ri yue sui shi already change, hundred grains use not become, govern use dark not bright, jun people use slight, family use not peaceful.",
  "s0118": "Shu min wei xing, xing have good feng, xing have good yu.",
  "s0119": "Ri yue zhi xing, have dong have xia.",
  "s0120": "Yue zhi cong xing, then with feng yu.",
  "s0121": "'Five fu: one called shou, two called fu, three called kang ning, four called you hao de, five called kao zhong ming.",
  "s0122": "Six ji: one called xiong duan zhe, two called ji, three called you, four called pin, five called e, six called ruo.'",
  "s0124": "Then Wu Wang enfeoffed Ji Zi at Chaoxian not minister him.",
  "s0125": "Its after Ji Zi court Zhou, passed former Yin old capital, felt palaces chambers destroyed, gave birth grain millet, Ji Zi injured it, wished cry then not able, wished weep for its near women, then made Mai Xiu poem to sing chant it.",
  "s0126": "Its poem said: 'Mai xiu jian jian xi, he shu you you.",
  "s0127": "Bi jiao tong xi, bu yu wo hao xi!'",
  "s0128": "So called jiao tong, Zhou.",
  "s0129": "Yin people heard it, all became flowing tears.",
  "s0130": "Wu Wang collapsed, Cheng Wang young, Zhou Gong Dan replaced administered held country.",
  "s0131": "Guan, Cai doubted him, then with Wu Geng made disorder, wished attack Cheng Wang, Zhou Gong.",
  "s0132": "Zhou Gong already received Cheng Wang command executed Wu Geng, killed Guan Shu, banished Cai Shu, then commanded Wei Zi Kai replaced Yin successor, served his previous sacrifices, made Wei Zi command to declare it, state at Song.",
  "s0133": "Wei Zi originally able benevolent worthy, then replaced Wu Geng, so Yin remaining people very cherished loved him.",
  "s0134": "Wei Zi Kai died, established his younger brother Yan, this was Wei Zhong."
}
