{
  "s2128": "Thirty-three, presented jade to Lu and exchanged the Xu fields.",
  "s2134": "Two, Song bribed with a tripod that was placed in the grand temple, which the gentleman criticized.",
  "s2139": "Hua Du saw that Kong Fu's wife was beautiful and desired her. Hua Du assassinated Kong Fu and then assassinated Duke Shang. First year of Duke Feng of Song, with Hua Du as chancellor.",
  "s2145": "First year of Duke Xuan of Yan",
  "s2150": "Three, Hui welcomed the woman, the Qi lord sent the woman, which the gentleman criticized.",
  "s2152": "First year of Xiao Zi of Jin",
  "s2180": "Jia Xu",
  "s2181": "Thirteen, attacked Zheng.",
  "s2189": "Thirty-eight, younger brother Ta assassinated Crown Prince Mian. Replaced him on the throne, state fell into chaos, reported death twice.",
  "s2192": "Thirty-seven, attacked Zhou and wounded the king.",
  "s2199": "Twenty-five, Shan Rong attacked us.",
  "s2200": "Wu Gong of Quwo assassinated Xiao Zi. Zhou attacked Quwo and established Duke Ai's younger brother Min as Duke of Jin. First year of Duke Min of Jin",
  "s2202": "Thirty-five, invaded Sui, which practiced good governance and achieved peace.",
  "s2205": "First year of Duke Li of Chen (Ta)",
  "s2208": "Thirty-eight, Crown Prince Hu rescued Qi, Qi intended to marry him to a daughter.",
  "s2221": "Two, gave birth to Jing Zhong Wan. Zhou historian divined that Wan's descendants would rule Qi.",
  "s2234": "Thirty-seven, attacked Sui but could not take it, so made alliance and withdrew troops.",
  "s2249": "First year of Chu Zi of Qin",
  "s2283": "Ten, seized Ji Zhong.",
  "s2284": "Eighteen, Crown Prince Ji and younger brother Shou contended to the death.",
  "s2287": "First year of Duke Zhuang of Cao (She Gu)",
  "s2301": "Seven, the duke debauched Cai, Cai assassinated the duke.",
  "s2304": "First year of Duke Li of Zheng (Tu)",
  "s2311": "Thirty-two, Duke Xi ordered Wu Zhi's ranked service to be like the crown prince's.",
  "s2316": "First year of Duke Hui of Wei (Shuo)",
  "s2317": "First year of Duke Zhuang of Chen (Lin), son of Duke Huan.",
  "s2329": "Six, the three fathers assassinated Chu Zi and established his elder brother Wu Gong.",
  "s2336": "Three, the feudal lords attacked us to avenge the Song matter.",
  "s2340": "Jia Shen",
  "s2342": "Fifteen, the heavenly king demanded chariots, not according to ritual.",
  "s2343": "First year of Duke Xiang of Qi (Zhu Er), demoted Wu Zhi's ranked service, Wu Zhi resented it.",
  "s2345": "First year of Duke Wu of Qin, attacked Peng, reached Hua Mountain.",
  "s2348": "Three, Shuo fled to Qi, established Qian Mu.",
  "s2352": "Four, Ji Zhong established Hu, the duke went out to reside at Li.",
  "s2353": "First year of Duke Huan of Yan",
  "s2357": "First year of King Zhuang, gave birth to son Kui.",
  "s2358": "Sixteen, the duke met with Cao to plan attacking Zheng.",
  "s2364": "First year of Qian Mu of Wei",
  "s2368": "First year of Duke Zhao of Zheng (Hu), Hu's mother was Deng woman, Ji Zhong married her.",
  "s2373": "Two, had younger brother Ke.",
  "s2374": "Seventeen, solar eclipse, day not recorded, officials erred.",
  "s2384": "Two, Qu Mi assassinated Duke Zhao.",
  "s2390": "Eighteen, the duke and consort went to Qi, the Qi lord seduced her, sent Peng Sheng to assassinate the duke in the chariot.",
  "s2391": "Four, assassinated Duke Huan of Lu, executed Peng Sheng.",
  "s2398": "First year of Duke Ai of Cai (Xian Wu)",
  "s2400": "First year of Zi Wei of Zheng, Qi assassinated Zi Wei, disciple of Duke Zhao.",
  "s2405": "Four, Duke Zhou wished to assassinate the king and establish Zi Ke, the king executed Duke Zhou, Ke fled to Yan.",
  "s2406": "First year of Duke Zhuang of Lu (Tong)",
  "s2416": "First year of Zi Ying of Zheng, Zi Wei's younger brother.",
  "s2429": "First year of Duke Xuan of Chen (Chu Jiu), Chu Jiu was Duke Zhuang's younger brother."
}