{
  "s0001": "Imperial Edict to the Imperial Secretary: 'When nobles and kings wish to bestow private favor by dividing fiefs to younger brothers and sons, let each one memorialize separately, I will personally determine their titles and names.'",
  "s0002": "The Grand Historian said: Flourishing indeed is the virtue of the Son of Heaven!",
  "s0003": "When one person has good fortune, the whole empire relies on it.",
  "s11": "Zi.",
  "s12": "Son of Prince Xian of Hejian.",
  "s13": "Two. Fifth year first month ren zi, Marquis Liu Ming first year.",
  "s14": "Two. Third year, Marquis Ming convicted of plotting rebellion and murder, executed in market, state abolished.",
  "s19": "An Cheng.",
  "s20": "Son of Prince Ding of Changsha.",
  "s21": "One. Sixth year seventh month yi si, Marquis Si Liu Cang first year.",
  "s22": "Six",
  "s23": "Six",
  "s24": "Six. First year, current Marquis Zi Dang first year.",
  "s25": "Six",
  "s26": "Four",
  "s27": "Yi Chun.",
  "s28": "Son of Prince Ding of Changsha.",
  "s29": "One. Sixth year seventh month yi si, Marquis Liu Cheng first year.",
  "s30": "Six",
  "s31": "Six",
  "s32": "Four. Fifth year, Marquis Cheng convicted of tribute gold, state abolished.",
  "s35": "Ju Rong.",
  "s36": "Son of Prince Ding of Changsha.",
  "s37": "One. Sixth year seventh month yi si, Marquis Ai Liu Dang first year.",
  "s38": "First year, Marquis Ai Dang died, no posterity, state abolished.",
  "s43": "Ju Ling.",
  "s44": "Son of Prince Ding of Changsha.",
  "s45": "One. Sixth year seventh month yi si, Marquis Liu Fu first year.",
  "s46": "Six",
  "s47": "Six",
  "s48": "Four. Fifth year, Marquis Fu convicted of tribute gold, state abolished.",
  "s51": "Xing Shan.",
  "s52": "Son of Prince An of Chu.",
  "s53": "One. Sixth year ninth month after ren xu, Marquis Liu Cheng first year.",
  "s54": "Six",
  "s55": "Six",
  "s56": "Four. Fifth year, Marquis Cheng convicted of tribute gold, state abolished.",
  "s59": "Fu Qiu.",
  "s60": "Son of Prince An of Chu.",
  "s61": "One. Sixth year ninth month after ren xu, Marquis Liu Bu Shen first year.",
  "s62": "Six",
  "s63": "Four. Two. Fifth year, Marquis Ba first year.",
  "s64": "Four. Fifth year, Marquis Ba convicted of tribute gold, state abolished.",
  "s67": "Guang Qi.",
  "s68": "Son of Prince Gong of Lu.",
  "s70": "Six. First year tenth month ding you, Marquis Jie Liu Ze first year.",
  "s71": "Six. First year, Marquis Shi first year.",
  "s72": "Four. Fifth year, Marquis Shi convicted of tribute gold, state abolished.",
  "s75": "Dan Yang."
}
