{
  "s0192": {
    "chinese": "周公奉成王命，伐誅武庚、管叔，放蔡叔。",
    "literal": "He made the Luo Proclamation, established the well-field system.",
    "idiomatic": "The Duke of Zhou, carrying King Cheng's command, attacked and executed Wu Geng and Guan Shu, and exiled Cai Shu."
  },
  "s0193": {
    "chinese": "以微子開代殷後，國於宋。",
    "literal": "He made the Jun Shi Proclamation, divided the lands.",
    "idiomatic": "He established Wei Zi Kai as the successor to Yin, with the state of Song."
  },
  "s0194": {
    "chinese": "頗收殷餘民，以封武王少弟封為衛康叔。",
    "literal": "He made the wine prohibition proclamation, banned drunkenness.",
    "idiomatic": "He gathered many of the remaining Yin people and enfeoffed King Wu's younger brother Feng as Wei Kang Shu."
  },
  "s0195": {
    "chinese": "晉唐叔得嘉穀，獻之成王，成王以歸周公于兵所。",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": "Jin Tang Shu obtained excellent grain and presented it to King Cheng. King Cheng sent it to the Duke of Zhou at his military camp."
  },
  "s0196": {
    "chinese": "周公受禾東土，魯天子之命。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": "The Duke of Zhou received the grain in the eastern lands, receiving the Son of Heaven's command at Lu."
  },
  "s0197": {
    "chinese": "初，管、蔡畔周，周公討之，三年而畢定，故初作大誥，次作微子之命，次歸禾，次嘉禾，次康誥、酒誥、梓材，其事在周公之篇。",
    "literal": "King Cheng died, King Kang ascended.",
    "idiomatic": "At first, Guan Shu and Cai Shu rebelled against Zhou. The Duke of Zhou campaigned against them, and in three years it was completely pacified. Therefore he first made the Great Announcement, then the Command to Wei Zi, then the Return of Grain, then the Excellent Grain, then the Announcement to Kang, the Wine Prohibition, and the Timber Materials. These matters are in the Duke of Zhou's chapter."
  },
  "s0198": {
    "chinese": "周公行政七年，成王長，周公反政成王，北面就群臣之位。",
    "literal": "King Kang monitored the eastern regions, toured the lords, administered justice.",
    "idiomatic": "The Duke of Zhou administered the government for seven years. When King Cheng grew up, the Duke of Zhou returned the government to King Cheng and took his place among the ministers, facing north."
  },
  "s0199": {
    "chinese": "成王在豐，使召公復營洛邑，如武王之意。",
    "literal": "Forty years without punishment, the world was at peace under King Kang.",
    "idiomatic": "King Cheng was at Feng, and he sent Shao Gong to rebuild Luoyi, following King Wu's intentions."
  },
  "s0200": {
    "chinese": "周公復卜申視，卒營筑，居九鼎焉。",
    "literal": "King Kang died, King Zhao ascended.",
    "idiomatic": "The Duke of Zhou again divined and inspected, and finally built and fortified it, placing the Nine Tripods there."
  },
  "s0201": {
    "chinese": "曰：「此天下之中，四方入貢道里均。」",
    "literal": "King Zhao went south to tour, died at the Han River.",
    "idiomatic": "He said: 'This is the center of the world; the distances for tribute from the four directions are equal.'"
  },
  "s0202": {
    "chinese": "作召誥、洛誥。",
    "literal": "King Mu ascended.",
    "idiomatic": "He made the Announcement of Shao and the Announcement of Luo."
  },
  "s0203": {
    "chinese": "成王既遷殷遺民，周公以王命告，作多士、無佚。",
    "literal": "King Mu was ambitious and fond of grandeur, personally drove eight horses.",
    "idiomatic": "After King Cheng moved the remaining Yin people, the Duke of Zhou announced with the king's command, making the Many Officers and the No Sloth."
  },
  "s0204": {
    "chinese": "召公為保，周公為師，東伐淮夷，殘奄，遷其君薄泵。",
    "literal": "Shao Gong served as protector, the Duke of Zhou as master strategist. They attacked east against the Huai Yi, destroyed Yan, and moved their ruler to Bo Peng.",
    "idiomatic": "Shao Gong served as protector, the Duke of Zhou as master strategist. They attacked east against the Huai Yi, destroyed Yan, and moved their ruler to Bo Peng."
  },
  "s0205": {
    "chinese": "成王自奄歸，在宗周，作多方。",
    "literal": "King Cheng returned from Yan and was at Zongzhou, making the Many Regions.",
    "idiomatic": "King Cheng returned from Yan and was at Zongzhou, making the Many Regions."
  },
  "s0206": {
    "chinese": "既絀殷命，襲淮夷，歸在豐，作周官。",
    "literal": "After ending the Yin mandate and attacking the Huai Yi, he returned to Feng and made the Zhou Officials.",
    "idiomatic": "After ending the Yin mandate and attacking the Huai Yi, he returned to Feng and made the Zhou Officials."
  },
  "s0207": {
    "chinese": "興正禮樂，度制於是改，而民和睦，頌聲興。",
    "literal": "He promoted correct rites and music, and the measurements and regulations were thereby reformed. The people were harmonious, and the songs of praise arose.",
    "idiomatic": "He promoted correct rites and music, and the measurements and regulations were thereby reformed. The people were harmonious, and the songs of praise arose."
  },
  "s0208": {
    "chinese": "成王既伐東夷，息慎來賀，王賜榮伯作賄息慎之命。",
    "literal": "After King Cheng attacked the eastern Yi, the Xi Shen came to congratulate. The king commanded Rong Bo to make the Command with Gifts to Xi Shen.",
    "idiomatic": "After King Cheng attacked the eastern Yi, the Xi Shen came to congratulate. The king commanded Rong Bo to make the Command with Gifts to Xi Shen."
  },
  "s0209": {
    "chinese": "成王將崩，懼太子釗之不任，乃命召公、畢公率諸侯以相太子而立之。",
    "literal": "King Cheng was about to die and feared that Crown Prince Zhao might not be capable, so he commanded Shao Gong and Bi Gong to lead the feudal lords to assist the crown prince and establish him.",
    "idiomatic": "King Cheng was about to die and feared that Crown Prince Zhao might not be capable, so he commanded Shao Gong and Bi Gong to lead the feudal lords to assist the crown prince and establish him."
  },
  "s0210": {
    "chinese": "成王既崩，二公率諸侯，以太子釗見於先王廟，申告以文王、武王之所以為王業之不易，務在節儉，毋多欲，以篤信臨之，作顧命。",
    "literal": "After King Cheng died, the two nobles led the feudal lords and presented Crown Prince Zhao at the ancestral temple, solemnly declaring that the kingly enterprise of King Wen and King Wu was not easy to maintain, emphasizing frugality and few desires, to govern with sincere faith. They made the Testamentary Charge.",
    "idiomatic": "After King Cheng died, the two nobles led the feudal lords and presented Crown Prince Zhao at the ancestral temple, solemnly declaring that the kingly enterprise of King Wen and King Wu was not easy to maintain, emphasizing frugality and few desires, to govern with sincere faith. They made the Testamentary Charge."
  },
  "s0211": {
    "chinese": "太子釗遂立，是為康王。",
    "literal": "Crown Prince Zhao thus ascended the throne, known as King Kang.",
    "idiomatic": "Crown Prince Zhao thus ascended the throne, known as King Kang."
  }
}
