{
  "s692": "Winter, He sat as gu died.",
  "s698": "Seventh month Ren Wu, crown prince sent troops, killed Roaming Strike General Yue, envoy Jiang Chong.",
  "s699": "Third month Ding Si, Zhuo jun Grand Administrator Liu Qu Mi became chancellor, enfeoffed Peng Cheng Hou.",
  "s701": "Imperial Secretary Grandee Cheng.",
  "s704": "Sixth month, Liu Qu Mi because gu beheaded.",
  "s706": "Spring, Er Shi General Li Guang Li went out Shuo Fang, with troops surrendered to Hu. Chong He Hou Mang Tong went out Jiu Quan, Imperial Secretary Grandee Shang Qiu Cheng went out He Xi, struck Xiongnu.",
  "s711": "Sixth month Ding Si, Grand Hong Lu Tian Qian Qiu became chancellor, enfeoffed Fu Min Hou.",
  "s715": "Later Yuan first year",
  "s724": "Second month Ji Si, Guang Lu Grandee Huo Guang became Grand General, Bo Lu Hou; Colonel Jin Ri Di became Chariot Cavalry General, An Hou; Grand Usher An Yang Hou Shang Quan Mi became Grand General.",
  "s727": "Xiao Zhao Shi Yuan first year",
  "s729": "Four. Ninth month, Ri Di died.",
  "s748": "Third month Gui You, Wei Wei Wang Mang became Left General, Cavalry Colonel Shang Quan An became Chariot Cavalry General.",
  "s763": "Yuan Feng first year",
  "s766": "Ninth month Geng Wu, Guang Lu Xun Zhang An Shi became Right General.",
  "s767": "Imperial Secretary Grandee Xin.",
  "s952": "Yue Ling Hou Shi Zi Chang became Grand Commandant, Chariot Cavalry General. Crown Prince Grand Tutor Xiao Wang Zhi became Front General.",
  "s955": "Xiao Yuan Chu Yuan first year",
  "s970": "Twelfth month, Executive Gold Wu Feng Feng Shi became Right General.",
  "s982": "Second month Ding Si, Ping En Hou Xu Jia became Left General.",
  "s983": "Middle Junior Treasurer Gong Yu became Imperial Secretary Grandee. Twelfth month Ding Wei, Chang Xin Junior Treasurer Xue Guang De became Imperial Secretary Grandee.",
  "s985": "Yong Guang first year",
  "s986": "Tenth month Wu Yin, Ding Guo dismissed.",
  "s987": "Nine. Seventh month, Zi Chang dismissed, went to residence.",
  "s988": "Ninth month, Wei Wei Ping Chang Hou Wang Jie became Grand Commandant, Chariot Cavalry General. Second month, Guang De dismissed.",
  "s989": "Seventh month, Crown Prince Grand Tutor Wei Xuan Cheng became Imperial Secretary Grandee.",
  "s992": "Third month Ren Xu first day, solar eclipse.",
  "s993": "Second month Ding You, Imperial Secretary Grandee Wei Xuan Cheng became chancellor, enfeoffed Fu Yang Hou. Chancellor Xian son.",
  "s994": "Seventh month, Grand Usher Ren Qian Qiu became Fen Wu General, struck Xi Qiang; Yun Zhong Grand Administrator Han Ci Jun became Jian Wei General, struck Qiang. Later not went.",
  "s995": "Second month Ding You, Right Fu Feng Zheng Hong became Imperial Secretary Grandee."
}
