{
  "s0051": "Gu Gong died, Ji Li ascended, this was Gong Ji.",
  "s0052": "Gong Ji followed Gu Gong's legacy, was devoted to practicing righteousness, the lords submitted to him.",
  "s0053": "Gong Ji died, his son Chang ascended, this was Xi Bo.",
  "s0054": "Xi Bo was called King Wen, followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, loved the young.",
  "s0055": "He treated worthies with courtesy, at noon had no time to eat while waiting for scholars, scholars therefore came to him in great numbers.",
  "s0056": "Bo Yi and Shu Qi were in Gu Zhu, heard Xi Bo was good at caring for the elderly, and came to join him.",
  "s0057": "Taidian, Hongyao, San Yisheng, Yuzi, and Xiahou Dafu and others came to him.",
  "s0058": "When King Wen was imprisoned at Youli, he increased in strength, the lords many came to Xi Bo.",
  "s0059": "When King Wen was released from prison, the Shang king gave him the right to punish without asking permission.",
  "s0060": "Hongyao and others were troubled by this.",
  "s0061": "King Wen said: 'My ancestor Houji founded our clan. I should restore the title of Houji.'",
  "s0062": "He went to inspect the descendants of Houji and found Wu Wang.",
  "s0063": "Wu Wang was worthy, King Wen made him Houji.",
  "s0064": "King Wen died, his son Fa ascended, this was King Wu.",
  "s0065": "King Wu was diligent and wise, the people were at peace.",
  "s0066": "King Wu married the daughter of the ruler of Yu, gave birth to King Cheng.",
  "s0067": "King Wu made the Duke of Zhou and others his ministers.",
  "s0068": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
  "s0069": "The Duke of Zhou was devoted to his duties, King Cheng was pleased.",
  "s0070": "The Duke of Zhou made the Shao Proclamation, and the people were at peace.",
  "s0071": "King Cheng grew up, the Duke of Zhou returned power to him.",
  "s0072": "King Cheng was diligent in government, the world was at peace.",
  "s0073": "King Cheng died, his son Kang Wang ascended.",
  "s0074": "Kang Wang monitored the eastern regions, toured the lords, administered justice, the nation was at peace.",
  "s0075": "Forty more years without punishment, the world was at peace under Kang Wang."
}

