{
  "s0182": "He let horses run free on the southern slopes of Mount Hua, released oxen in the wilderness of Taolin;",
  "s0183": "Laid down weapons and spears, rested the troops and dismissed the armies: showing the world they would not be used again.",
  "s0184": "King Wu had already conquered Yin, two years later asked Jizi why Yin perished.",
  "s0185": "Jizi could not bear to speak of Yin's evils, so spoke of the principles for preserving and destroying states.",
  "s0186": "King Wu also considered it shameful, so asked about the Way of Heaven.",
  "s0187": "King Wu died in the twelfth year, King Cheng ascended.",
  "s0188": "King Cheng was young, the Duke of Zhou acted as regent.",
  "s0189": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
  "s0190": "He moved the Yin people to Luo, established the eastern capital.",
  "s0191": "He made the Shao Proclamation, established the ritual system.",
  "s0192": "He made the Luo Proclamation, established the well-field system.",
  "s0193": "He made the Jun Shi Proclamation, divided the lands.",
  "s0194": "He made the wine prohibition proclamation, banned drunkenness.",
  "s0195": "King Cheng grew up, the Duke of Zhou returned the government.",
  "s0196": "King Cheng was diligent in government, the world was at peace.",
  "s0197": "King Cheng died, King Kang ascended.",
  "s0198": "King Kang monitored the eastern regions, toured the lords, administered justice.",
  "s0199": "Forty years without punishment, the world was at peace under King Kang.",
  "s0200": "King Kang died, King Zhao ascended.",
  "s0201": "King Zhao went south to tour, died at the Han River.",
  "s0202": "King Mu ascended.",
  "s0203": "King Mu was ambitious and fond of grandeur, personally drove eight horses.",
  "s0204": "He went west to attack the Quanrong, obtained four white wolves and four white deer.",
  "s0205": "He made Zhao Ju the Grand Master, prepared to attack the Quanrong.",
  "s0206": "The Quanrong submitted, King Mu stopped.",
  "s0207": "He toured the north, reached the Great Wall.",
  "s0208": "He saw the Yellow Emperor's Xuanyuan Terrace.",
  "s0209": "He returned and died at Haojing.",
  "s0210": "King Mu's son King Gong ascended.",
  "s0211": "King Gong died, his younger brother King Yi ascended.",
  "s0212": "King Yi died, King Xiao ascended.",
  "s0213": "King Xiao died, King Li ascended.",
  "s0214": "King Li was tyrannical, the common people rebelled.",
  "s0215": "King Li fled to Zhi, died there.",
  "s0216": "The common people made Duke Wu of Gonghe regent.",
  "s0217": "Fourteen years, King Xuan ascended, the Gonghe administration ended.",
  "s0218": "King Xuan revived Zhou's prosperity, moved the capital to Luoyi.",
  "s0219": "He attacked the Quanrong, drove them out.",
  "s0220": "He attacked the Jiang, defeated them.",
  "s0221": "He attacked the Xu Yan, captured their king.",
  "s0222": "Two younger brothers of the same mother, Yi Zhongyan, gave birth to Gongsun Wuzhi.",
  "s0223": "19. The duke died and commanded to establish younger brother He as Duke Mu.",
  "s0224": "Duke Mu of Qin, first year.",
  "s0225": "Punished Zhou Xu.",
  "s0226": "Quwo Wu Gong killed Xiao Zi.",
  "s0227": "Zhou attacked Quwo, established Duke Ai of Jin's younger brother Min as Duke of Jin.",
  "s0228": "Duke Min of Jin, first year.",
  "s0229": "Duke Huan of Song, Yu Yue, first year.",
  "s0230": "Son of Duke Zhuang.",
  "s0231": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her."
}