{
  "s0497": "Precious ding emerges and communicates with spirits, perform feng and shan.",
  "s0498": "Feng and shan seventy-two kings, only Huang Di could ascend Mount Tai for feng.'",
  "s0499": "Shen Gong said: 'Han ruler also should ascend for feng, ascending for feng can become immortal and ascend to heaven.",
  "s0500": "Huang Di's time had ten thousand feudal lords, divine spirits' feng dwellers seven thousand.",
  "s0501": "Realm's famous mountains eight, three in barbarian Yi, five in central states.",
  "s0502": "Central states' Mount Hua, Shou Mountain, Tai Shi, Mount Tai, Donglai, these five mountains Huang Di constantly toured, met with spirits.",
  "s0503": "Huang Di fought and studied immortality.",
  "s0504": "Worried the people were not following the way, then beheaded those who defied ghosts and spirits.",
  "s0505": "Over a hundred years then could communicate with spirits.",
  "s0506": "Huang Di performed suburban sacrifice to Supreme Deity at Yong, stayed three months.",
  "s0507": "Gui Yu Qu was titled Great Hong, died buried at Yong, so Hong Tomb is it.",
  "s0508": "Afterward Huang Di received ten thousand spirits at Bright Court.",
  "s0509": "Bright Court is Ganquan.",
  "s0510": "So-called Cold Gate is Valley Mouth.",
  "s0511": "Huang Di gathered Shou Mountain copper, cast ding below Jing Mountain.",
  "s0512": "Ding completed, dragon hung beard down welcoming Huang Di.",
  "s0513": "Huang Di mounted, group ministers and rear palace followers who ascended seventy plus people, dragon then departed upward.",
  "s0514": "Remaining small ministers could not ascend, all held dragon beard, dragon beard pulled out, fell, fell Huang Di's bow.",
  "s0515": "People gazed up at Huang Di already ascended to heaven, embraced his bow and beard crying, so later generations named the place Ding Lake, his bow Wu Hao.'",
  "s0516": "Therefore the emperor said: 'Alas!",
  "s0517": "If I can truly be like Huang Di, I would view leaving wife and children like removing shoes.'",
  "s0518": "He appointed Qing as gentleman, sent east to wait for spirits at Tai Shi.",
  "s0519": "The emperor then performed suburban sacrifice at Yong, reached Longxi, west ascended Kongtong, went to Ganquan.",
  "s0520": "Ordered sacrificial official Kuan Shu and others to prepare Tai Yi sacrifice altar, sacrifice altar modeled after Bo Ji's Tai Yi altar, altar three levels.",
  "s0521": "Five Emperors altars ringed below it, each in their direction, Huang Di southwest, opened eight paths for ghosts.",
  "s0522": "Tai Yi's usage like Yong's one altar things, but added sweet wine, dates, dried meat and such, killed one badger ox as sacrificial stand vessel great sacrificial animals.",
  "s0523": "Five Emperors alone had sacrificial stands vessels sweet wine advanced.",
  "s0524": "Below four directions earth, for offering food to group spirits followers and Beidou.",
  "s0525": "After sacrifice, sacrificial remains all burnt.",
  "s0526": "Its ox color white, deer in middle, pig in deer, water poured over them.",
  "s0527": "Sacrifice day with ox, sacrifice month with sheep pig singly.",
  "s0528": "Tai Yi invocator and butcher then wore purple and embroidery.",
  "s0529": "Five Emperors each like their color, sun red, moon white.",
  "s0530": "Eleventh month Xin Si new moon dawn winter solstice, twilight, heavenly characters began suburban bow to Tai Yi.",
  "s0531": "Morning bowed to sun, evening bowed to moon, then saluted;",
  "s0532": "saw Tai Yi like Yong suburban ritual.",
  "s0533": "Its assisting feast said: 'Heaven began bestowing precious ding divine strategy on emperor, new moon after new moon, end and begin again, emperor respectfully bows and sees.'",
  "s0534": "Wore upper yellow.",
  "s0535": "Its sacrifice rowed fires full altar, altar side cooked offerings.",
  "s0536": "Officials said 'sacrifice has light above.'",
  "s0537": "Dukes and ministers said 'emperor began suburban see Tai Yi Yun Yang, officials offered round jade good sacrificial animals to feast.",
  "s0538": "This night had beautiful light, and by day, yellow vapor rose connecting to heaven.'",
  "s0539": "Grand Historian, sacrificial official Kuan Shu and others said: 'Divine spirits' good fortune, blessing good fortune omens, should establish Tai altar in this light region to make clear response.",
  "s0540": "Order grand invocator to oversee, sacrifice in autumn and year's end interval.",
  "s0541": "Three years emperor one suburban see.'",
  "s0543": "That autumn, for attacking Nanyue, informed and prayed to Tai Yi.",
  "s0544": "Used male Jing wood painted banners sun moon Beidou ascending dragon, to resemble Tai Yi three stars, made Tai Yi spearhead, named 'spirit banner.'",
  "s0545": "For praying for troops, then grand historian held it pointing to attacked country.",
  "s0546": "Five Profits General made not dare enter sea, went to Mount Tai to sacrifice."
}
