{
  "s0149": "Heaven Kuang beside, Jiang star.",
  "s0150": "Jiang star moves, people ford water.",
  "s0151": "Chui Chou four stars, in Wei south.",
  "s0152": "Pao Gua, has blue black star guards it, fish salt expensive.",
  "s0153": "South Dipper for temple, its north Jian star.",
  "s0154": "Jian star, banner.",
  "s0155": "Qian Niu for sacrificial animal.",
  "s0156": "Its north He Gu.",
  "s0157": "He Gu big star, upper general;",
  "s0158": "Left right, left right generals.",
  "s0159": "Wu Nu, its north Zhi Nu.",
  "s0160": "Zhi Nu, heaven girl grandson.",
  "s0161": "Observe sun moon conduct to measure year star forward backward.",
  "s0162": "Called eastern wood, governs spring, called Jia Yi.",
  "s0163": "Righteousness lost, punishment exits year star.",
  "s0164": "Year star advance retreat, with its lodges determines state.",
  "s0165": "Where state cannot attack, can punish person.",
  "s0166": "Its hurry lodges and advance called advance, retreat lodges called retreat.",
  "s0167": "Advance, its state has troops not return;",
  "s0168": "Retreat, its state has worry, will perish, state overturn defeat.",
  "s0169": "Its where, five stars all follow gather at one lodge, its below state can with righteousness bring all under heaven.",
  "s0170": "With She Ti Ge year: year yin left goes in Yin, year star right turns dwells Chou.",
  "s0171": "First month, with Dou, Qian Niu morning out eastern, named Jian De.",
  "s0172": "Color blue blue has light.",
  "s0173": "Its loses order, has response appears Liu.",
  "s0174": "Year early, floods;",
  "s0175": "Late, drought.",
  "s0176": "Year star out, east goes twelve degrees, hundred days then stops, contrary goes;",
  "s0177": "Contrary goes eight degrees, hundred days, again east goes.",
  "s0178": "Year goes thirty degrees sixteen fen degree seven, rate day goes twelve fen degree one, twelve years circles heaven.",
  "s0179": "Out constantly eastern, with morning;",
  "s0180": "Enters western, uses dusk.",
  "s0181": "Dan Yan year: year yin in Mao, star dwells Zi.",
  "s0182": "With second month and Wu Nu, Xu, Wei morning out, called Jiang Ru.",
  "s0183": "Great has light.",
  "s0184": "Its loses order, has response appears Zhang.",
  "s0185": "Its year great floods.",
  "s0186": "Zhi Xu year: year yin in Chen, star dwells Hai.",
  "s0187": "With third month and Ying Shi, Dong Bi morning out, called Qing Zhang.",
  "s0188": "Blue blue very bright.",
  "s0189": "Its loses order;",
  "s0190": "Has response appears Zhen.",
  "s0191": "Year early, drought;",
  "s0192": "Late, floods.",
  "s0193": "Da Huang Luo year: year yin in Si, star dwells Xu.",
  "s0194": "With fourth month and Kui, Lou morning out, called Bo Zhong.",
  "s0195": "Bear bear red color, has light.",
  "s0196": "Its loses order, has response appears Kang.",
  "s0197": "Dun Zang year: year yin in Wu, star dwells You.",
  "s0198": "With fifth month and Wei, Mao, Bi morning out, called Kai Ming."
}
