{
  "s0001": "The Grand Historian says: The period before the Yin was already ancient.",
  "s0002": "The Zhou enfeoffed five ranks: duke, marquis, earl, viscount, baron.",
  "s0003": "However, enfeoffing Bo Qin and Kang Shu in Lu and Wei, each with four hundred li of land, was to honor the duty of favoring relatives and to praise those with virtue;",
  "s0004": "Tai Gong in Qi received territory combining five marquises' lands, to honor diligent labor.",
  "s0005": "King Wu, Cheng, and Kang enfeoffed several hundred, with fifty-five of the same surname, the largest not exceeding one hundred li, the smallest thirty li, to assist and protect the royal house.",
  "s0006": "Guan, Cai, Kang Shu, Cao, Zheng - some exceeded, some were reduced.",
  "s0007": "After Li and You, the royal house declined, powerful states of marquises and earls arose, the Son of Heaven grew weak and could not correct them.",
  "s0008": "It was not that virtue was not pure, but that the situation was weak.",
  "s0009": "When Han arose, they established two ranks.",
  "s0010": "In the late years of Gaozu, those not of the Liu clan who became kings, or those without merit whom the emperor did not establish as marquises, were to be executed by all under heaven.",
  "s0011": "Gaozu's sons and younger brothers of the same clan who became kings numbered nine states, although Changsha alone was of a different surname, while meritorious officials who became marquises numbered more than one hundred.",
  "s0012": "From Yanmen and Taiyuan eastward to Liaoyang was the Yan and Dai states;",
  "s0013": "South of Changshan, turning left at Mount Taihang, crossing the Yellow River and Ji, eastward from A and Zhen to the sea, was the Qi and Zhao states;",
  "s0014": "From Chen westward, south to Jiuyi, eastward along the Yangtze, Huai, Gu, and Si rivers to Kuaiji, was the Liang, Chu, Huainan, and Changsha states: all bordering externally on the Xiongnu and Yue.",
  "s0015": "The inner lands north of the mountains eastward encompassed all the feudal lords' territories, the largest comprising five or six commanderies, connecting dozens of cities, establishing the hundred officials and palaces, rivaling the Son of Heaven.",
  "s0016": "Han alone possessed Sanhe, Dongjun, Yingchuan, and Nanyang commanderies, from Jiangling westward to Shu, north from Yunzhong to Longxi, together with the Interior Commandery making fifteen commanderies, while princesses and marquises had their fiefs scattered among them.",
  "s0017": "Why was this?",
  "s0018": "When the realm was first pacified, flesh and blood of the same surname were few, therefore they extensively strengthened collateral branches to soothe and control the four seas, using them to support and protect the Son of Heaven.",
  "s0019": "Within a century of Han's establishment, relatives grew more distant, feudal lords became arrogant and extravagant, evil ministers plotted licentious disorder, the great ones rebelled, the small ones violated the law, endangering their lives, losing their persons and states.",
  "s0020": "The Son of Heaven observed the ancient past, then bestowed favor, allowing the feudal lords to extend grace by dividing territories to younger brothers and sons, therefore Qi was divided into seven, Zhao into six, Liang into five, Huainan into three, and the Son of Heaven's collateral branches became kings, kings' collateral branches became marquises, numbering more than one hundred.",
  "s0021": "During the Wu and Chu period, previous and later feudal lords sometimes had their territories reduced for offenses, therefore Yan and Dai had no northern border commanderies, Wu, Huainan, and Changsha had no southern border commanderies, Qi, Zhao, Liang, and Chu's branch commanderies and famous mountains and seacoasts all reverted to Han.",
  "s0022": "The feudal lords gradually weakened, large states had no more than ten or so cities, small marquises no more than several dozen li, above sufficient to pay tribute and duties, below sufficient to provide for sacrifices, to protect and assist the capital.",
  "s0023": "While Han had eighty or ninety commanderies, interspersed among the feudal lords like dog teeth interlocking, holding the strategic positions and geographical advantages, strengthening the root and trunk, weakening the branches and leaves - thus hierarchy was clear and all matters found their proper place.",
  "s0024": "I, the minister Qian, have carefully recorded the feudal lords from Gaozu to the Taichu period, noting when their territories were increased or diminished, so that the present age may view them.",
  "s0025": "Though their position was strong, they took benevolence and righteousness as their foundation."
}
