{
  "s0300": "687 Jiawu tenth year, seven stars fell like rain, with rain together.",
  "s0301": "Eleventh year, twentieth year, eleventh year, third year, fifth year, tenth year, Qi established Hui Gong, Qian Mou fled Zhou.",
  "s0302": "Sixth year, eighth year, fifteenth year, seventh year, fourth year",
  "s0303": "686 Eleventh year, eighth year, Zi Jiu came fleeing, with Guan Zhong together avoided Wu Zhi chaos.",
  "s0304": "Twelfth year, Wu Zhi killed ruler self-established.",
  "s0305": "Twenty-first year, twelfth year, fourth year, sixth year, Wei Hui Gong Shuo again entered.",
  "s0306": "Fourteenth year, seventh year, ninth year, sixteenth year, eighth year, fifth year",
  "s0307": "685 Twelfth year, ninth year, Lu wished with Jiu enter, after Xiao Bai, Qi resisted Lu, made living deliver Guan Zhong.",
  "s0308": "Qi Huan Gong Xiao Bai first year spring, Qi killed Wu Zhi.",
  "s0309": "Twenty-second year, thirteenth year, fifth year, seventh year, fifteenth year, eighth year, tenth year, seventeenth year, ninth year, sixth year",
  "s0310": "684 Thirteenth year, tenth year, Qi attacked us, because Jiu enmity.",
  "s0311": "Second year, twenty-third year, fourteenth year, sixth year, rested lady, Chen woman, passed Cai, Cai not courteous, hated it.",
  "s0312": "Chu attacked Cai, captured Ai Hou to return.",
  "s0313": "Eighth year, sixteenth year, ninth year, eleventh year, Chu captured our hou.",
  "s0314": "Eighteenth year, tenth year, seventh year",
  "s0315": "683 Fourteenth year, eleventh year, Zang Wen Zhong condoled Song flood.",
  "s0316": "Third year, twenty-fourth year, fifteenth year, seventh year, ninth year, Song great flood, duke self-blamed.",
  "s0317": "Lu sent Zang Wen Zhong came condole.",
  "s0318": "Seventeenth year, tenth year, twelfth year, nineteenth year, eleventh year, eighth year",
  "s0319": "682 Fifteenth year, twelfth year, fourth year, twenty-fifth year, sixteenth year, eighth year, ten thousand killed ruler, Chou Mu had righteousness.",
  "s0320": "Eighteenth year, eleventh year, thirteenth year, twentieth year, twelfth year, ninth year",
  "s0321": "681 Xi Wang first year, thirteenth year, Cao Mo kidnapped Huan Gong.",
  "s0322": "Returned lost lands.",
  "s0323": "Fifth year, met Lu people at Ke.",
  "s0324": "Twenty-sixth year, seventeenth year, ninth year, Song Huan Gong Yu Shuo first year, Zhuang Gong son.",
  "s0325": "Nineteenth year, twelfth year, fourteenth year, twenty-first year, thirteenth year, tenth year",
  "s0326": "680 Second year, fourteenth year, sixth year, twenty-seventh year, eighteenth year, tenth year, second year, twentieth year, thirteenth year, fifteenth year, twenty-second year, fourteenth year, eleventh year",
  "s0327": "679 Third year, fifteenth year, seventh year, began hegemony, assembled feudal lords at Juan.",
  "s0328": "Twenty-eighth year, Qu Wo Wu Gong extinguished Jin Hou Min, offered treasure to Zhou, Zhou commanded Wu Gong as Jin ruler, united his lands.",
  "s0329": "Nineteenth year, eleventh year, third year, twenty-first year, fourteenth year, sixteenth year, twenty-third year, Zheng Li Gong first year, Li Gong fled after seventeen years returned enter.",
  "s0330": "Twelfth year",
  "s0331": "678 Fourth year, sixteenth year, eighth year, Jin Wu Gong Cheng united Jin, already established thirty-eight years, not changed yuan, followed his first year.",
  "s0332": "Twentieth year, buried Yong, began with people follow death.",
  "s0333": "Twelfth year, attacked Deng extinguished it.",
  "s0334": "Fourth year, twenty-second year, fifteenth year, seventeenth year, twenty-fourth year, second year, feudal lords attacked us.",
  "s0335": "Thirteenth year",
  "s0336": "677 Jichen fifth year, seventeenth year, ninth year, thirty-ninth year, Wu Gong died, son Gui Zhu established, this was Xian Gong.",
  "s0337": "Qin De Gong first year, Wu Gong younger brother.",
  "s0338": "Thirteenth year, fifth year, twenty-third year, sixteenth year, eighteenth year, twenty-fifth year, third year, fourteenth year",
  "s0339": "676 Hui Wang first year, took Chen empress.",
  "s0340": "Eighteenth year, tenth year, Jin Xian Gong Gui Zhu first year, second year, began made fu, sacrificed she, split dog four gates.",
  "s0341": "Chu Du Ao Mi first year, sixth year, twenty-fourth year, seventeenth year, nineteenth year, twenty-sixth year, fourth year, fifteenth year",
  "s0342": "675 Second year, Yan, Wei attacked king, king fled Wen, established Zi Qian.",
  "s0343": "Nineteenth year, eleventh year, second year, Qin Xuan Gong first year, second year, seventh year, took Wei woman.",
  "s0344": "Wen Gong younger brother.",
  "s0345": "Twenty-fifth year, eighteenth year, twentieth year, twenty-seventh year, fifth year, sixteenth year, attacked king, king fled Wen, established Zi Qian.",
  "s0346": "674 Third year, twentieth year, twelfth year, third year, second year, third year, eighth year, twenty-sixth year, nineteenth year, Cai Mu Hou Xi first year, twenty-eighth year, sixth year, seventeenth year, Zheng arrested our Zhong Fu.",
  "s0347": "673 Fourth year, executed Qian, entered Hui Wang.",
  "s0348": "Twenty-first year, thirteenth year, fourth year, third year, fourth year, ninth year, twenty-seventh year, twentieth year, second year, twenty-ninth year, seventh year, rescued Zhou chaos, entered king.",
  "s0349": "Eighteenth year",
  "s0350": "672 Fifth year, crown prince mother died early.",
  "s0351": "Hui empress gave birth to Shu Dai.",
  "s0352": "Twenty-second year, fourteenth year, Chen Wan from Chen came fleeing, Tian Chang began this.",
  "s0353": "Fifth year, attacked Li Rong, obtained Ji.",
  "s0354": "Fourth year, made Mi altar.",
  "s0355": "Fifth year, younger brother Yun killed Du Ao self-established.",
  "s0356": "Tenth year, twenty-eighth year, twenty-first year, Li Gong son Wan fled Qi.",
  "s0357": "Third year, thirtieth year, Zheng Wen Gong Jie first year, nineteenth year",
  "s0358": "671 Sixth year, twenty-third year, duke went to Qi observe she.",
  "s0359": "Fifteenth year, sixth year, fifth year, Chu Cheng Wang Yun first year, eleventh year, twenty-ninth year, twenty-second year, fourth year, thirty-first year, second year, twentieth year",
  "s0360": "670 Seventh year, twenty-fourth year, sixteenth year, seventh year, sixth year, second year, twelfth year, thirtieth year, twenty-third year, fifth year, Cao Xi Gong Yi first year, third year, twenty-first year",
  "s0361": "669 Eighth year, twenty-fifth year, seventeenth year, eighth year, completely killed former Jin Hou group sons.",
  "s0362": "Seventh year, third year, thirteenth year, thirty-first year, twenty-fourth year, sixth year, second year, fourth year, twenty-second year",
  "s0363": "668 Ninth year, twenty-sixth year, eighteenth year, ninth year, began walled Jiang capital.",
  "s0364": "Eighth year, fourth year, fourteenth year, Wei Yi Gong Chi first year, twenty-fifth year, seventh year, third year, fifth year, twenty-third year",
  "s0365": "667 Jinyin tenth year, granted Qi Hou command.",
  "s0366": "Twenty-seventh year, nineteenth year, tenth year, ninth year, fifth year, fifteenth year, second year, twenty-sixth year, eighth year, fourth year, sixth year, twenty-fourth year",
  "s0367": "666 Eleventh year, twenty-eighth year, twentieth year, eleventh year, tenth year, sixth year, sixteenth year, third year, twenty-seventh year, ninth year, fifth year, seventh year, twenty-fifth year",
  "s0368": "665 Twelfth year, twenty-ninth year, twenty-first year, twelfth year, crown prince Shen dwelt Qu Wo, Chong Er dwelt Pu city, Yi Wu dwelt Qu.",
  "s0369": "Li Ji cause.",
  "s0370": "Eleventh year, seventh year, seventeenth year, fourth year, twenty-eighth year, tenth year, sixth year, eighth year, twenty-sixth year",
  "s0371": "664 Thirteenth year, thirtieth year, twenty-second year, thirteenth year, twelfth year, eighth year, eighteenth year, fifth year, twenty-ninth year, eleventh year, seventh year, ninth year, twenty-seventh year",
  "s0372": "663 Fourteenth year, thirty-first year, twenty-third year, attacked Shan Rong, for Yan.",
  "s0373": "Fourteenth year, Qin Cheng Gong first year, ninth year, nineteenth year, sixth year, thirtieth year, twelfth year, eighth year, tenth year, twenty-eighth year",
  "s0374": "662 Fifteenth year, thirty-second year, Zhuang Gong younger brother Shu Ya poisoned died.",
  "s0375": "Qing Fu assassinated Zi Ban.",
  "s0376": "Ji You fled Chen, established Min Gong.",
  "s0377": "Twenty-fourth year, fifteenth year, second year, tenth year, twentieth year, seventh year, thirty-first year, thirteenth year, ninth year, eleventh year, twenty-ninth year",
  "s0378": "661 Sixteenth year, Lu Min Gong Kai first year, twenty-fifth year, sixteenth year, extinguished Wei, Geng, Huo.",
  "s0379": "Began enfeoffed Zhao Shu Geng, Bi Wan Wei, began this.",
  "s0380": "Third year, eleventh year, twenty-first year, eighth year, thirty-second year, fourteenth year, Cao Zhao Gong first year, twelfth year, thirtieth year",
  "s0381": "660 Seventeenth year, second year, Qing Fu killed Min Gong.",
  "s0382": "Ji You from Chen established Shen, this was Xi Gong.",
  "s0383": "Killed Qing Fu.",
  "s0384": "Twenty-sixth year, seventeenth year, Shen led army, superior men knew his dismissal.",
  "s0385": "Fourth year, twelfth year, twenty-second year, Di attacked us.",
  "s0386": "Duke fond of cranes, warriors not fought, extinguished our state.",
  "s0387": "State resented, Hui Gong chaos, extinguished his descendants, moreover established Qian Mou younger brother.",
  "s0388": "Wei Dai Gong first year, thirty-third year, fifteenth year, second year, thirteenth year, thirty-first year",
  "s0389": "659 Eighteenth year, Lu Xi Gong Shen first year, Ai Jiang mourning from Qi arrived.",
  "s0390": "Twenty-seventh year, killed female younger sister Lu Zhuang Gong lady, lewd cause.",
  "s0391": "Eighteenth year, Qin Mu Gong Ren Hao first year, thirteenth year, twenty-third year, Wei Wen Gong Hui first year, Dai Gong younger brother.",
  "s0392": "Thirty-fourth year, sixteenth year, third year, fourteenth year, thirty-second year",
  "s0393": "658 Nineteenth year, second year, twenty-eighth year, for Wei built Chu Qiu.",
  "s0394": "Rescued Rong Di attacked.",
  "s0395": "Nineteenth year, Xun Xi with currency borrowed road from Yu to attack Guo, extinguished Xia Yang.",
  "s0396": "Second year, fourteenth year, twenty-fourth year, second year, Qi Huan Gong led feudal lords for us walled Chu Qiu.",
  "s0397": "Thirty-fifth year, seventeenth year, fourth year, fifteenth year, thirty-third year",
  "s0398": "657 Jizi twentieth year, third year, twenty-ninth year, with Cai Ji shared boat, rocked duke, duke angry, returned Cai Ji."
}
