{
  "s274": "Thirteen",
  "s277": "Two",
  "s278": "Ten. Zhang Han made an agreement with Chu to surrender, not yet decided, Xiang Yu agreed but then attacked him.",
  "s279": "Nineteen",
  "s280": "Twelve",
  "s281": "Twenty-three. Attacked Nanyang governor Yi, broke him east of Yangcheng walls.",
  "s282": "Twenty-three",
  "s283": "Eleven",
  "s284": "Fourteen",
  "s287": "Three",
  "s288": "Eleven. Xiang Yu made an appointment with Zhang Han at Yin Xu, Zhang Han and others had already surrendered, made alliance with him, made Han the King of Yong.",
  "s289": "Twenty",
  "s290": "Thirteen",
  "s291": "Twenty-four. Surrendered and took Nanyang, enfeoffed its governor Yi.",
  "s292": "Twenty-four",
  "s293": "Twelve",
  "s294": "Fifteen. Shen Yang took Henan, surrendered to Chu.",
  "s296": "Eighth month. Zhao Gao killed the Second Emperor.",
  "s297": "Four",
  "s298": "Twelve. Made Qin surrender Commandant Yi and Vice Chancellor Xin the supreme generals, commanding the Qin surrender army.",
  "s299": "Twenty-one. King Xie of Zhao remained in the state. Chen Yu fled and resided at Nanpi.",
  "s300": "Fourteen",
  "s301": "Twenty-five. Attacked Wuguan, broke it.",
  "s302": "Twenty-five",
  "s303": "Thirteen",
  "s304": "Sixteen",
  "s307": "Five",
  "s308": "Thirteen",
  "s309": "Twenty-two",
  "s310": "Fifteen",
  "s311": "Twenty-six. Attacked and took Yao and Lantian. Using Liu Hou's strategy, without fighting all surrendered.",
  "s312": "Twenty-six",
  "s313": "Fourteen",
  "s314": "Seventeen",
  "s317": "Six",
  "s318": "Fourteen. Xiang Yu led the feudal lords' troops of more than 400,000, marched and raided territory, west to Henan.",
  "s319": "Twenty-three. Zhang Er followed Chu west into Qin.",
  "s320": "Sixteen",
  "s321": "Twenty-seven. Han year one, Qin prince Ziying surrendered. Duke Pei entered and broke Xianyang, pacified Qin, returned army to Bashang, awaited the feudal lords' agreement.",
  "s322": "Twenty-seven",
  "s323": "Fifteen. Followed Xiang Yu raiding territory, then entered the passes.",
  "s324": "Eighteen",
  "s327": "Seven",
  "s328": "Fifteen. Yu deceitfully pit-killed 200,000 Qin surrender soldiers at Xin'an.",
  "s329": "Twenty-four",
  "s330": "Seventeen",
  "s331": "Twenty-eight. Duke Pei issued three chapter command, Qin people greatly pleased.",
  "s332": "Twenty-eight",
  "s333": "Sixteen"
}