{
  "s262": "Twenty-first year",
  "s272": "Twenty-second year",
  "s278": "Tenth year. Zhang Han made agreement with Chu to surrender, not yet decided, Xiang Yu agreed then attacked him.",
  "s282": "Twenty-third year",
  "s288": "Eleventh month. Xiang Yu and Zhang Han agreed to meet at Yin Xu, Zhang Han and others already surrendered, made covenant with them, made Han Yong king.",
  "s292": "Twenty-fourth year",
  "s294": "Fifteenth year. Shen Yang took Henan, surrendered to Chu.",
  "s298": "Twelfth month. Made Qin surrender colonel Yi and chief clerk Xin supreme generals, commanding Qin surrender troops.",
  "s299": "Twenty-first year. Zhao King Xie remained in state. Chen Yu fled and resided at Nan Pi.",
  "s301": "Twenty-fifth year. Attacked Wu Guan, broke it.",
  "s302": "Twenty-fifth year",
  "s309": "Twenty-second year",
  "s311": "Twenty-sixth year. Attacked and took Yao and Lan Tian. Using Liu Hou's strategy, without fighting all surrendered.",
  "s312": "Twenty-sixth year",
  "s319": "Twenty-third year. Zhang Er followed Chu west into Qin.",
  "s321": "Twenty-seventh year. Han first year, Qin prince Zi Ying surrendered. Pei Gong entered and broke Xianyang, pacified Qin, returned army to Bashang, awaited feudal lords' agreement.",
  "s323": "Fifteenth year. Followed Xiang Yu to conquer territory, then entered the pass",
  "s328": "Fifteenth year. Yu falsely dug pits and killed Qin surrender soldiers 200,000 at Xin'an.",
  "s329": "Twenty-fourth year",
  "s335": "Twenty-fifth year",
  "s343": "Twenty-sixth year",
  "s351": "Twenty-seventh year",
  "s359": "Twenty-eighth year",
  "s367": "Twenty-ninth year",
  "s375": "Thirtieth year",
  "s377": "First month. Divided Guanzhong as Han.",
  "s378": "Divided Guanzhong as Yong.",
  "s379": "Divided Guanzhong as Sai.",
  "s380": "Divided Guanzhong as Di.",
  "s381": "Thirtieth year. Yan",
  "s382": "Divided as Liaodong.",
  "s383": "Eighteenth year. Changed to Western Wei.",
  "s384": "Divided as Yin.",
  "s385": "Twenty-first year. Han",
  "s386": "Divided as Henan.",
  "s388": "Second year. Moved capital to southern Jiangling.",
  "s389": "Western Chu Lord Bo, Xiang Yu beginning, commanded the realm's mandates, appointed eighteen kings.",
  "s390": "King Wu Rui beginning, former Fan Lord.",
  "s391": "King Gong Ao beginning, former Chu Zhu Guo.",
  "s392": "King Ying Bu beginning, former Chu general.",
  "s393": "King Zhang Er beginning, former Chu general.",
  "s394": "Twenty-seventh year. King Zhao Xie beginning, former Zhao king.",
  "s395": "King Tian Du beginning, former Qi general.",
  "s396": "King Tian An beginning, former Qi general.",
  "s397": "Twentieth year. King Tian Shi beginning, former Qi king.",
  "s398": "Second month. Han King beginning, former Pei Gong.",
  "s399": "King Zhang Han beginning, former Qin general.",
  "s400": "King Sima Xin beginning, former Qin general.",
  "s401": "King Dong Yi beginning, former Qin general.",
  "s402": "King Zang Chu beginning, former Yan general.",
  "s403": "Thirty-first year. King Han Guang beginning, former Yan king.",
  "s404": "Nineteenth year. King Wei Bao beginning, former Wei king."
}
