{
  "s5240": "Ten, Zhi Li and Zhao Yang brought the king into Wang Cheng.",
  "s5242": "Thirteen, wished to establish Zi Xi, Zi Xi refused. Qin woman established him, became King Zhao.",
  "s5243": "First year of Duke Jing of Song (Tou Man)",
  "s5258": "First year of King Zhao of Chu (Zhen), executed Wu Ji to please the multitude.",
  "s5266": "Twelve, Gong Zi Guang made Zhuan Zhu assassinate Liao, self-established.",
  "s5270": "Twenty-eight, duke went to Jin, sought entry, Jin did not permit, placed him at Qian Hou.",
  "s5272": "Twelve, six ministers executed ducal clan, divided their fiefs. Each made their son a grandee.",
  "s5279": "First year of Duke Xiang of Cao",
  "s5282": "First year of Wu He Lu",
  "s5286": "Twenty-nine, duke from Qian Hou went to Yun. Qi lord said: 'Lord.' Duke was ashamed, returned to Qian Hou.",
  "s5296": "First year of Duke Xian of Zheng (Chan)",
  "s5304": "Fourteen, Duke Qing died.",
  "s5306": "Four, Wu three princes came fleeing, enfeoffed them to guard against Wu.",
  "s5314": "Three, three princes fled to Chu.",
  "s5318": "Thirty-one, solar eclipse.",
  "s5320": "First year of Duke Ding of Jin (Wu)",
  "s5322": "Five, Wu attacked our Liu and Qian.",
  "s5330": "Four, attacked Chu Liu and Qian.",
  "s5333": "Ten, Jin made feudal lords build city for us.",
  "s5334": "Thirty-two, duke died at Qian Hou.",
  "s5336": "Two, led feudal lords to build city for Zhou.",
  "s5343": "Five, Duke Ping's younger brother Tong assassinated Duke Xiang self-established.",
  "s5350": "First year of Duke Ding of Lu (Song), Duke Zhao's funeral arrived from Qian Hou.",
  "s5354": "Seven, Nang Wa attacked Wu, defeated us at Yu Zhang. Cai lord came for audience.",
  "s5358": "Ten, audience with Chu, detained because of fur coat.",
  "s5359": "First year of Duke Yin of Cao",
  "s5362": "Six, Chu attacked us, counterattacked, defeated them, took Chu's Ju Chao.",
  "s5380": "Jia Wu",
  "s5386": "Nine, Cai Duke Zhao detained three years, obtained fur coat, therefore returned.",
  "s5390": "Twelve, with Zi Chang fur coat, obtained return, went to Jin, requested to attack Chu.",
  "s5397": "Fourteen, with Jin led feudal lords to invade Chu.",
  "s5400": "Six, Zhou with us led feudal lords to invade Chu.",
  "s5401": "Thirty-one, Chu Bao Xu requested aid.",
  "s5402": "Ten, Wu and Cai attacked us, entered Ying, King Zhao fled. Wu Zi Xu whipped King Ping's tomb.",
  "s5404": "Twenty-nine, contended with Cai for precedence.",
  "s5406": "Thirteen, contended with Wei for precedence. Chu invaded us, Wu with us attacked Chu, entered Ying.",
  "s5410": "Nine, with Cai attacked Chu, entered Ying.",
  "s5414": "Five, Yang Hu seized Ji Huan Zi, made alliance with him, released him. Solar eclipse.",
  "s5418": "Eleven, Qin rescue arrived, Wu withdrew, King Zhao re-entered.",
  "s5421": "First year of Duke Huai of Chen (Liu)",
  "s5423": "First year of Duke Jing of Cao (Lu)",
  "s5429": "Sixteen, because Zi Zhao's followers caused disorder, king fled to Jin.",
  "s5434": "Twelve, Wu attacked our Fan, Chu feared, moved to Ru.",
  "s5440": "Ten, Lu invaded us.",
  "s5441": "First year of Duke Jian of Yan",
  "s5442": "Eleven, attacked Chu, took Fan.",
  "s5445": "Seventeen, Liu Zi welcomed king, Jin entered king.",
  "s5446": "Seven, Qi attacked us.",
  "s5447": "Forty-five, invaded Wei. Attacked Lu.",
  "s5448": "Nine, entered Zhou King Jing."
}