{
  "s0102": "Chong Er mother, Di Hu Shi woman.",
  "s0103": "Yi Wu mother, Chong Er mother younger sister.",
  "s0104": "Xian Gong sons eight people, crown prince Shen Sheng, Chong Er, Yi Wu all had worthy conduct.",
  "s0105": "And obtained Li Ji, then distanced these three sons.",
  "s0106": "Sixteenth year, Jin Xian Gong made two armies.",
  "s0107": "Gong led upper army, crown prince Shen Sheng led lower army, Zhao Shu drove chariot, Bi Wan as right, attacked extinguished Huo, extinguished Wei, extinguished Geng.",
  "s0108": "Returned, for crown prince walled Qu Wo, granted Zhao Shu Geng, granted Bi Wan Wei, to be grand master.",
  "s0109": "Shi Kui said: 'Crown prince not able establish.",
  "s0110": "Divided his capital city, positioned as minister, first made extreme for him, moreover able establish!",
  "s0111": "Not like flee, not make crime arrive.",
  "s0112": "Be Wu Tai Bo, not also able, still have good name.'",
  "s0113": "Crown prince not followed.",
  "s0114": "Bu Yan said: 'Bi Wan after must great.",
  "s0115": "Wan, full number;",
  "s0116": "Wei, great name.",
  "s0117": "With this begin reward, heaven opened it.",
  "s0118": "Heavenly son called myriad people, feudal lords called ten thousand people, now command great, with follow full number, its must have crowd.'",
  "s0119": "Initially, Bi Wan divined service at Jin country, met Tun compare Bi.",
  "s0120": "Xin Liao occupied it said: 'Auspicious.",
  "s0121": "Tun solid Bi enter, auspicious what great.",
  "s0122": "Its after must flourish prosper.'",
  "s0124": "Seventeenth year, Jin Hou sent crown prince Shen Sheng attack Dong Shan.",
  "s0125": "Li Ke advised Xian Gong said: 'Crown prince serves ancestral temple state altar millet offerings, to morning evening view lord meals, so called eldest son.",
  "s0126": "Lord travels then guards, has guard then follows, follows called strokes army, guards called oversees country, ancient system.",
  "s0127": "Lead troops, specializes acts plans;",
  "s0128": "swear army travels, lord and state government's planned: not crown prince matters.",
  "s0129": "Troops in control commands only, receive commands then not awe, specialize commands then not filial, so lord successor fitting not able lead troops.",
  "s0130": "Lord loses his office, leads troops not awe, where use it?'",
  "s0131": "Gong said: 'I have sons, not know crown prince who establish.'",
  "s0132": "Li Ke not answered retired, saw crown prince.",
  "s0133": "Crown prince said: 'I its abolished?'",
  "s0134": "Li Ke said: 'Crown prince strive!",
  "s0135": "Teach with army travels, not share this fear, why abolished?",
  "s0136": "Moreover son fear not filial, not fear not establish.",
  "s0137": "Cultivate self not blame people, then avoid difficulty.'",
  "s0138": "Crown prince led troops, Gong clothed him one-sided garment, belted gold jue.",
  "s0139": "Li Ke declined illness, not followed crown prince.",
  "s0140": "Crown prince then attacked Dong Shan.",
  "s0141": "Nineteenth year, Xian Gong said: 'Initially my previous lords Zhuang Bo, Wu Gong executed Jin disorder, Guo often assisted Jin attacked us, moreover hid Jin fled gong zi, indeed made disorder.",
  "s0142": "Not execute, later leave descendants worry.'",
  "s0143": "Then sent Xun Xi with Qu produce chariot borrowed road at Yu.",
  "s0144": "Yu borrowed road, then attacked Guo, took its Xia Yang returned.",
  "s0145": "Xian Gong privately told Li Ji said: 'I wish abolish crown prince, with Xi Qi replace him.'",
  "s0146": "Li Ji wept said: 'Crown prince establish, feudal lords all already know, often leads troops, hundred clans attach to him, why with lowly concubine reason abolish proper establish concubine?",
  "s0147": "Lord must do it, concubine suicide.'",
  "s0148": "Li Ji feigned praised crown prince, secretly sent people slandered harmed crown prince, wished establish her son.",
  "s0149": "Twenty-first year, Li Ji told crown prince said: 'Lord dreamed saw Qi Jiang, crown prince quickly sacrifice Qu Wo, return blessing to lord.'",
  "s0150": "Crown prince then sacrificed his mother Qi Jiang at Qu Wo, offered his sacrificial meat to Xian Gong.",
  "s0151": "Xian Gong at time out hunted, placed meat in palace."
}
