{
  "s0001": "Emperor Xiaowu was Emperor Jing's middle son.",
  "s0002": "His mother was Empress Wang.",
  "s0003": "Jing fourth year, as imperial son he was made King of Jiaodong.",
  "s0004": "Jing seventh year, Crown Prince Liu Rong was deposed as King of Linjiang, the King of Jiaodong was made crown prince.",
  "s0005": "Jing sixteenth year, the emperor died, the crown prince ascended the throne, becoming Emperor Xiaowu.",
  "s0006": "Emperor Xiaowu at his initial ascension was especially reverent toward sacrifices to ghosts and spirits.",
  "s0007": "First year, the Han had risen over sixty years, the realm was peaceful and orderly, scholars and officials all hoped the Son of Heaven would perform the feng and shan sacrifices and reform the calendar and regulations.",
  "s0008": "And the emperor favored Confucian learning, summoned worthy and good men, Zhao Wan, Wang Zang and others became nobles and ministers through literature, wishing to discuss antiquity and establish a Bright Hall south of the capital to receive the lords.",
  "s0009": "The plans for imperial tours, feng and shan sacrifices, calendar reform, and color changes were not completed.",
  "s0010": "It happened that Empress Dowager Dou practiced Huang-Lao teachings, disliked Confucian learning, had people secretly obtain evidence of Zhao Wan and others' corrupt profiteering, summoned and investigated Wan and Zang, Wan and Zang committed suicide, all their undertakings were abandoned.",
  "s0011": "After six years, Empress Dowager Dou died.",
  "s0012": "The next year, the emperor summoned literary scholars Gongsun Hong and others.",
  "s0013": "The next year, the emperor first went to Yong, performed suburban sacrifice at the five altars.",
  "s0014": "Afterward, he regularly performed suburban sacrifice every three years.",
  "s0015": "At this time, the emperor sought divine immortals, housed them in the Tishi Pavilion in Shanglin Park.",
  "s0016": "The divine immortal was a woman from Changling, who grieved over her child's death, thus manifested as a spirit to the Empress Dowager Wanruo.",
  "s0017": "Wanruo sacrificed to her in her chamber, many people went to sacrifice.",
  "s0018": "The Lord of Pingyuan went to sacrifice, afterward his descendants became honored and eminent.",
  "s0019": "When Emperor Wu ascended, he respectfully placed her shrine in the inner palace, heard her words, but did not see her person, it is said.",
  "s0020": "At this time, Li Shaojun also appeared before the emperor with methods for sacrificing to the stove god, grain immortals, and warding off old age, the emperor honored him.",
  "s0021": "Shaojun was formerly a subordinate of Marquis Shen of Shenze, skilled in magic.",
  "s0022": "Shaojun advised the emperor saying: 'With sacrifices to the stove god, one can summon grain immortals; with grain immortals, one can refine gold; with refined gold, one can make vessels for eating and drinking; with those vessels, one can summon spirits and immortals; with spirits and immortals, one can avoid death.'",
  "s0023": "The emperor believed this, began to practice magic arts.",
  "s0024": "Shaojun was made Palace Attendant, given gold to practice magic.",
  "s0025": "Shaojun could make grain immortals appear, but could not make them stay.",
  "s0026": "He said: 'The immortals do not come because the sacrifices are not grand enough.'",
  "s0027": "He advised the emperor to make a great altar for the stove god, with a bronze pillar, nine tripods, all gilded, with purple silk curtains, jade vessels.",
  "s0028": "He said: 'This way the immortals will come.'",
  "s0029": "The emperor followed this, but the immortals still did not come.",
  "s0030": "Shaojun became old, his magic ineffective, he died.",
  "s0031": "The emperor sought similar people, but none could equal Shaojun.",
  "s0032": "Then there was Luan Da, a Qi man, who claimed to know the ways of immortals, came to see the emperor.",
  "s0033": "The emperor made Da a Court Gentleman, housed him in the Ganquan Palace.",
  "s0034": "Da advised the emperor to wear yellow robes, ride a yellow carriage, to show his intention to become an immortal.",
  "s0035": "He said: 'I have heard that when the Son of Heaven becomes an immortal, he rides a yellow carriage, wears yellow robes.'",
  "s0036": "The emperor believed this, changed his robes and carriage to yellow.",
  "s0037": "Da said: 'I have heard immortals reside in the sea, I wish to go to sea to seek them.'",
  "s0038": "The emperor gave him a ship, attendants, money, and sent him to sea.",
  "s0039": "Da went to sea, did not return for several years, his ship and money exhausted.",
  "s0040": "He claimed to have seen immortals, but they would not come.",
  "s0041": "He said: 'The immortals said the sacrifices are not sincere, I wish to return to prepare grand sacrifices.'",
  "s0042": "The emperor sent people to meet him, but Da had already fled.",
  "s0043": "The emperor knew Da was deceiving him, had him executed.",
  "s0044": "But the emperor's pursuit of immortals grew even more intense.",
  "s0045": "He sent people to sea to seek Penglai, Fangzhang, Yingzhou, these three immortal mountains.",
  "s0046": "The emperor heard the immortals resided there, had palaces of gold and silver.",
  "s0047": "He sent thousands of boys and girls to seek them, but none returned.",
  "s0048": "Some said they saw the mountains but could not reach them because the waves were too big.",
  "s0049": "The emperor made a great altar at the seashore, sacrificed to the immortals.",
  "s0050": "He sent Xu Fu to lead boys and girls to sea to seek immortals."
}
