{
  "s307": "Xiao Jing first year",
  "s308": "Established Xiao Wen emperor temple, jun guo as Tai Zong temple.",
  "s309": "Seven. Established Si Tu office.",
  "s314": "Established imperial son De as He Xian Wang, Yan as Lin Jiang Wang, Yu as Huai Yang Wang, Fei as Ru Nan Wang, Peng Zu as Guang Chuan Wang, Fa as Chang Sha Wang. Fourth month middle, Xiao Wen Tai Hou collapsed. Jia died.",
  "s315": "Eight. Kai Feng Hou Tao Qing became chancellor.",
  "s317": "Imperial Secretary Grandee Cuo.",
  "s320": "Wu Chu seven states rebelled, sent troops struck, all broke them. Imperial son Duan became Jiao Xi Wang, Sheng became Zhong Shan Wang.",
  "s321": "Two. Established Grand Commandant office.",
  "s322": "Commandant Tiao Hou Zhou Ya Fu. Became Grand Commandant, struck Wu Chu; Qu Zhou Hou Li Ji became general, struck Zhao; Dou Ying became Grand General, garrisoned Xing Yang, Luan Bu became general, struck Qi.",
  "s326": "Established crown prince.",
  "s328": "Two. Grand Commandant Ya Fu.",
  "s329": "Imperial Secretary Grandee Fen.",
  "s332": "Established Yang Ling yi. Chancellor Bei Ping Hou Zhang Cang died.",
  "s338": "Moved Guang Chuan Wang Peng Zu to Zhao Wang.",
  "s341": "Imperial Secretary Grandee Yang Ling Hou Cen Mai.",
  "s344": "Deposed crown prince Rong as Lin Jiang Wang. Fourth month Ding Si, Jiao Dong Wang established as crown prince. Qing dismissed chancellor.",
  "s345": "Sixth month Yi Si, Grand Commandant Tiao Hou Ya Fu became chancellor. Abolished Grand Commandant office.",
  "s346": "Five. Promoted became chancellor.",
  "s347": "Imperial Secretary Grandee She.",
  "s349": "Middle first year",
  "s356": "Imperial son Yue became Guang Chuan Wang, Ji became Jiao Dong Wang.",
  "s362": "Imperial son Cheng became Qing He Wang. Ya Fu dismissed chancellor.",
  "s363": "Four. Imperial Secretary Grandee Tao Hou Liu She became chancellor.",
  "s519": "Four. Imperial Secretary Grandee Yue An Hou Li Cai became chancellor.",
  "s520": "Champion Hou Huo Qu Bing became Brave Cavalry General, struck Hu, reached Qi Lian; Combined Cavalry Hou Ao became general. Went out Bei Di; Bo Wang Hou Zhang Qian, Lang Zhong Ling Li Guang became generals, went out You Bei Ping.",
  "s521": "Imperial Secretary Grandee Tang.",
  "s524": "Xiongnu entered You Bei Ping, Ding Xiang.",
  "s532": "Grand General Qing went out Ding Xiang, Lang Zhong Ling Li Guang became Front General, Grand Usher Gong Sun He became Left General, Lord of Fiefdom Zhao Shi Ji became Right General, Ping Yang Hou Cao Xiang became Rear General: struck Chan Yu.",
  "s536": "Cai sat invading garden wall, suicide."
}
