{
  "s0277": "Duke Zhao was Duke Huan's son, his mother was Ge Ying.",
  "s0278": "Duke Zhao year 1, Duke Wen of Jin defeated Chu at Chengpu, and assembled the feudal lords at Jiantu, paid court to Zhou, the Son of Heaven caused Jin to be called hegemon.",
  "s0279": "Year 6, the Di invaded Qi.",
  "s0280": "Duke Wen of Jin passed away.",
  "s0281": "Qin troops were defeated at Xiao.",
  "s0282": "Year 12, Duke Mu of Qin passed away.",
  "s0283": "Year 19 fifth month, Duke Zhao passed away, his son She established as ruler of Qi.",
  "s0284": "She's mother had no favor with Duke Zhao, the state people did not fear him.",
  "s0285": "Duke Zhao's younger brother Shang Ren, because Duke Huan's death had contended for establishment but failed, secretly associated with worthy scholars, attached to and loved the common people, the common people were pleased.",
  "s0286": "When Duke Zhao died and his son She was established, weak and isolated, in the tenth month at the tomb they assassinated Lord She of Qi, and Shang Ren established himself, this was Duke Yi.",
  "s0287": "Duke Yi was Duke Huan's son, his mother was Mi Ji.",
  "s0288": "Duke Yi year 4 spring, initially, when Duke Yi was a prince, he hunted with Bing Rong's father, contended for the catch and did not win, when he ascended the throne, he cut off Bing Rong's father's feet, and made Bing Rong his groom.",
  "s0289": "Yong Zhi's wife was beautiful, the duke took her into the palace, made Yong Zhi his chariot driver.",
  "s0290": "Fifth month, Duke Yi toured Shen Pool, the two bathed, played.",
  "s0291": "Zhi said: 'Son of the severed feet!'",
  "s0292": "Rong said: 'Wife-stealer!'",
  "s0293": "Both resented these words.",
  "s0294": "They plotted to tour with the duke in the bamboo grove, the two assassinated Duke Yi on his chariot, abandoned him in the bamboo and fled.",
  "s0295": "Duke Yi's establishment was arrogant, the people did not attach.",
  "s0296": "The people of Qi deposed his son and welcomed Prince Yuan from Wei, established him, this was Duke Hui.",
  "s0297": "Duke Hui was Duke Huan's son.",
  "s0298": "His mother was a Wei woman, called Shao Wei Ji, avoided Qi's disorder, so was in Wei.",
  "s0299": "Duke Hui year 2, the Chang Di came, Prince Cheng Fu attacked and killed him, buried him at the north gate.",
  "s0300": "Zhao Chuan of Jin assassinated his lord Duke Ling.",
  "s0301": "Year 10, Duke Hui passed away, his son Duke Qing Wu Ye established.",
  "s0302": "Initially, Cui Zhu had favor with Duke Hui, Duke Hui died, Gao and Guo feared his oppression, drove him out, Cui Zhu fled to Wei.",
  "s0303": "Duke Qing year 1, King Zhuang of Chu was strong, attacked Chen;",
  "s0304": "Year 2, surrounded Zheng, the Lord of Zheng surrendered, then restored the Lord of Zheng's state.",
  "s0305": "Year 6 spring, Jin sent Xi Ke to Qi, Qi made the lady observe from behind curtains.",
  "s0306": "Xi Ke ascended, the lady laughed at him.",
  "s0307": "Xi Ke said: 'If not repaid, will not cross the river again!'",
  "s0308": "Returning, requested to attack Qi, the Jin lord did not permit.",
  "s0309": "Qi envoy arrived at Jin, Xi Ke seized four Qi envoys within the river, killed them.",
  "s0310": "Year 8.",
  "s0311": "Jin attacked Qi, Qi sent Prince Qiang as hostage to Jin, Jin troops withdrew.",
  "s0312": "Year 10 spring, Qi attacked Lu and Wei.",
  "s0313": "Lu and Wei grandees went to Jin to request troops, all through Xi Ke.",
  "s0314": "Jin made Xi Ke lead 800 chariots as central army commander, Shi Xie command upper army, Luan Shu command lower army, to save Lu and Wei, attack Qi.",
  "s0315": "Sixth month ren shen day, joined battle with Qi lord's troops below Mi Ji.",
  "s0316": "Gui you day, arrayed at Long, Pang Chou Fu as Duke Qing's right.",
  "s0317": "Duke Qing said: 'Charge them, break the Jin army and have breakfast.'",
  "s0318": "Shot and wounded Xi Ke, blood flowing to his shoes.",
  "s0319": "Ke wished to return to the wall, his driver said: 'I first entered, twice wounded, dared not speak of illness, feared to frighten the troops, wish you endure it.'",
  "s0320": "Then resumed battle.",
  "s0321": "In battle, Qi urgent, Chou Fu feared the Qi lord would be captured, so exchanged positions, Duke Qing became right, chariot caught on wood and stopped.",
  "s0322": "Jin's young commander Han Jue lay in ambush before the Qi lord's chariot, said 'My lord sent me to save Lu and Wei', mocked him.",
  "s0323": "Chou Fu made Duke Qing descend to get drink, thus he escaped, broke away, entered his army.",
  "s0324": "Jin Xi Ke wished to kill Chou Fu.",
  "s0325": "Chou Fu said: 'Substitute death for lord and be mutilated, then later ministers will have no loyal to their lords.'",
  "s0326": "Ke released him, Chou Fu then escaped and returned to Qi."
}
