{
  "s0431": "Fu Chen advised: 'Ping, Huan, Zhuang, Hui all received service from Zheng, if the king abandons his relatives and favors Di, it cannot be followed.'",
  "s0432": "The king did not listen.",
  "s0433": "Sixteenth year, the king deposed the Di queen, the Di people came to attack, killed Tan Bo.",
  "s0434": "Fu Chen said: 'I have advised many times and you did not follow.",
  "s0435": "If I do not leave now, will the king consider me resentful?'",
  "s0436": "He died with his followers.",
  "s0437": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0438": "Eighteenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0439": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0440": "Twentieth year, solar eclipse, did not record the day, the officials lost it.",
  "s0441": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0442": "Twenty-second year, solar eclipse, did not record the day, the officials lost it.",
  "s0443": "Twenty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0444": "Twenty-fourth year, solar eclipse, did not record the day, the officials lost it.",
  "s0445": "Twenty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0446": "Twenty-sixth year, solar eclipse, did not record the day, the officials lost it.",
  "s0447": "Twenty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0448": "Twenty-eighth year, solar eclipse, did not record the day, the officials lost it.",
  "s0449": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0450": "Thirtieth year, solar eclipse, did not record the day, the officials lost it.",
  "s0451": "Thirty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0452": "Thirty-second year, solar eclipse, did not record the day, the officials lost it.",
  "s0453": "Thirty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0454": "Thirty-fourth year, solar eclipse, did not record the day, the officials lost it.",
  "s0455": "Thirty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0456": "Thirty-sixth year, solar eclipse, did not record the day, the officials lost it.",
  "s0457": "Thirty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0458": "Thirty-eighth year, solar eclipse, did not record the day, the officials lost it.",
  "s0459": "Thirty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0460": "Fortieth year, solar eclipse, did not record the day, the officials lost it.",
  "s0461": "Forty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0462": "Forty-second year, solar eclipse, did not record the day, the officials lost it.",
  "s0463": "Forty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0464": "Forty-fourth year, solar eclipse, did not record the day, the officials lost it.",
  "s0465": "Forty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0466": "Forty-sixth year, solar eclipse, did not record the day, the officials lost it.",
  "s0467": "Forty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0468": "Forty-eighth year, solar eclipse, did not record the day, the officials lost it.",
  "s0469": "Forty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0470": "Fiftieth year, solar eclipse, did not record the day, the officials lost it.",
  "s0471": "Fifty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0472": "Fifty-second year, solar eclipse, did not record the day, the officials lost it.",
  "s0473": "Fifty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0474": "Fifty-fourth year, solar eclipse, did not record the day, the officials lost it.",
  "s0475": "Fifty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0476": "Fifty-sixth year, solar eclipse, did not record the day, the officials lost it.",
  "s0477": "Fifty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0478": "Fifty-eighth year, solar eclipse, did not record the day, the officials lost it.",
  "s0479": "Fifty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0480": "Sixtieth year, solar eclipse, did not record the day, the officials lost it."
}