{
  "s0001": {
    "literal": "The Changes states that Fuxi, Shennong, and the Yellow Emperor created teachings to civilize the people, and they transmitted descriptions of their officials, making Fuxi have Dragon Master as the name for officials, Shennong have Fire Master as fire names, the Yellow Emperor have Cloud Master as cloud names, Shaohao have Bird Master as bird names.",
    "idiomatic": "The Book of Changes records that Fuxi, Shennong, and the Yellow Emperor established teachings to civilize the people, passing down descriptions of their officials. Fuxi used Dragon Master as the name for officials, Shennong used Fire Master as fire names, the Yellow Emperor used Cloud Master as cloud names, and Shaohao used Bird Master as bird names."
  },
  "s0002": {
    "literal": "From Zhuanxu onward, they became teachers of the people and were named according to human affairs, having the officials of Chongli, Goumang, Zhurong, Houtu, Rushe, and Xuanming, but these are already ancient.",
    "idiomatic": "From Emperor Zhuanxu onward, rulers became teachers of the people and officials were named according to human affairs, with positions like Chongli, Goumang, Zhurong, Houtu, Rushe, and Xuanming—but these are already from ancient times."
  },
  "s0003": {
    "literal": "The Documents record that in the time of Tang and Yu, Xihe and his four sons were commanded to follow the heavenly patterns and teach the people the seasons;",
    "idiomatic": "The Book of Documents records that during the reigns of Yao and Shun, Xihe and his four sons were commanded to follow the heavenly patterns and teach the people about the seasons."
  },
  "s0004": {
    "literal": "Consulted the Four Peaks to raise worthy talents, promote those in obscurity;",
    "idiomatic": "They consulted the Four Peaks to promote worthy talents and raise up those who were obscure and unknown."
  },
  "s0005": {
    "literal": "The twelve pastors soothed the distant and brought close the near;",
    "idiomatic": "The twelve regional governors pacified distant lands and brought nearby territories under control."
  },
  "s0006": {
    "literal": "Yu served as Minister of Works, leveling the waters and soils;",
    "idiomatic": "Yu served as Minister of Works, controlling the floods and organizing the lands."
  },
  "s0007": {
    "literal": "伯夷作秩宗，典三禮；",
    "idiomatic": "Bo Yi served as Minister of Rites, overseeing the three ceremonies."
  },
  "s0008": {
    "literal": "垂作共工，利器用；",
    "idiomatic": "Chui served as Minister of Works, benefiting the use of tools."
  },
  "s0009": {
    "literal": "益作朕虞，上下草木鳥獸；",
    "idiomatic": "Yi served as Minister of Agriculture, managing the plants, trees, birds, and beasts above and below."
  },
  "s0010": {
    "literal": "夔典樂教胄子；",
    "idiomatic": "Kui oversaw music and educated the noble sons."
  },
  "s0011": {
    "literal": "龍作納言，出入帝命；",
    "idiomatic": "Long served as Minister of the Interior, conveying the emperor's commands."
  },
  "s0012": {
    "literal": "至于夏殷，雖官名不同，其務則一。",
    "idiomatic": "By the Xia and Shang dynasties, although the official names differed, their duties were the same."
  },
  "s0013": {
    "literal": "周官則備矣。",
    "idiomatic": "The Zhou system of officials was then complete."
  },
  "s0014": {
    "literal": "司徒、司馬、司空、司士、司寇，典司五敘。",
    "idiomatic": "The Ministers of Education, War, Works, Justice, and Crime oversaw the five relationships."
  },
  "s0015": {
    "literal": "太師、太傅、太保、少師、少傅、少保，師氏、保氏，承訓振學。",
    "idiomatic": "The Grand Preceptor, Grand Tutor, Grand Guardian, Junior Preceptor, Junior Tutor, Junior Guardian, the Masters and Guardians transmitted teachings and encouraged learning."
  },
  "s0016": {
    "literal": "内史、太史、内宰、作冊、御史，掌書王命。",
    "idiomatic": "The Inner Scribe, Grand Scribe, Inner Steward, Royal Secretary, and Imperial Scribe managed the king's written commands."
  },
  "s0017": {
    "literal": "外史、御史，掌書王令。",
    "idiomatic": "The Outer Scribe and Imperial Scribe managed the king's written orders."
  },
  "s0018": {
    "literal": "小史、御史，掌書邦令。",
    "idiomatic": "The Junior Scribe and Imperial Scribe managed the state's written orders."
  },
  "s0019": {
    "literal": "上士、中士、下士，布三敘。",
    "idiomatic": "The senior, middle, and junior officers administered the three relationships."
  },
  "s0020": {
    "literal": "府、史、胥、徒，掌官敘。",
    "idiomatic": "The stewards, scribes, assistants, and laborers managed official affairs."
  },
  "s0021": {
    "literal": "秦兼天下，建皇帝之號，立百官之職。",
    "idiomatic": "When Qin unified the empire, it established the title of emperor and set up the positions of the hundred officials."
  },
  "s0022": {
    "literal": "漢因循而不革。",
    "idiomatic": "Han followed this without change."
  },
  "s0023": {
    "literal": "相國、丞相，皆秦官，金印紫綬，掌丞天子，助理萬機。",
    "idiomatic": "The Chancellor and Vice-Chancellor were both Qin offices, with gold seals and purple ribbons. They assisted the emperor and managed all affairs."
  },
  "s0024": {
    "literal": "太尉，秦官，金印紫綬，掌武事。",
    "idiomatic": "The Grand Commandant was a Qin office, with gold seal and purple ribbon, overseeing military affairs."
  },
  "s0025": {
    "literal": "御史大夫，秦官，銀印青綬，掌副丞相。",
    "idiomatic": "The Imperial Secretary was a Qin office, with silver seal and blue ribbon, serving as deputy to the chancellor."
  },
  "s0026": {
    "literal": "宗正，秦官，銀印青綬，掌親屬。",
    "idiomatic": "The Director of the Imperial Clan was a Qin office, with silver seal and blue ribbon, overseeing imperial relatives."
  },
  "s0027": {
    "literal": "治粟內史，秦官，銅印黑綬，掌穀貨。",
    "idiomatic": "The Superintendent of Agriculture was a Qin office, with bronze seal and black ribbon, overseeing grain and commodities."
  },
  "s0028": {
    "literal": "少府，秦官，銅印黑綬，掌山海池澤之稅。",
    "idiomatic": "The Privy Treasurer was a Qin office, with bronze seal and black ribbon, overseeing taxes from mountains, seas, pools, and marshes."
  },
  "s0029": {
    "literal": "衛尉，秦官，金印紫綬，掌宮門衛屯兵。",
    "idiomatic": "The Commander of the Guards was a Qin office, with gold seal and purple ribbon, overseeing palace gates and guard troops."
  },
  "s0030": {
    "literal": "太僕，秦官，銅印黑綬，掌輿馬。",
    "idiomatic": "The Master of Carriages was a Qin office, with bronze seal and black ribbon, overseeing chariots and horses."
  },
  "s0031": {
    "literal": "廷尉，秦官，銅印黑綬，掌刑辟。",
    "idiomatic": "The Superintendent of Trials was a Qin office, with bronze seal and black ribbon, overseeing criminal law."
  },
  "s0032": {
    "literal": "典客，秦官，銅印黑綬，掌諸侯及歸義蠻夷。",
    "idiomatic": "The Superintendent of Guests was a Qin office, with bronze seal and black ribbon, overseeing feudal lords and surrendered barbarians."
  },
  "s0033": {
    "literal": "郎中令，秦官，金印紫綬，掌宮殿掖門戶衛屯兵。",
    "idiomatic": "The Commander of the Gentlemen was a Qin office, with gold seal and purple ribbon, overseeing palace halls, side gates, and guard troops."
  },
  "s0034": {
    "literal": "將軍、列侯、九卿，皆秦官。",
    "idiomatic": "Generals, marquises, and the Nine Ministers were all Qin offices."
  },
  "s0035": {
    "literal": "漢遵而不改。",
    "idiomatic": "Han followed them without change."
  },
  "s0036": {
    "literal": "漢興，相國、丞相，綠綬。",
    "idiomatic": "When Han arose, the Chancellor and Vice-Chancellor had green ribbons."
  },
  "s0037": {
    "literal": "呂后時，丞相綠綬，綠綬亦丞相也。",
    "idiomatic": "During Empress Lü's time, the chancellor had a green ribbon; the green ribbon was also for the chancellor."
  },
  "s0038": {
    "literal": "孝惠、高后時，號相國，綠綬。",
    "idiomatic": "During Xiaohui and Empress Gao's time, the title was Chancellor, with green ribbon."
  },
  "s0039": {
    "literal": "孝文元年，復為丞相。",
    "idiomatic": "In the first year of Xiaowen, it reverted to Vice-Chancellor."
  },
  "s0040": {
    "literal": "太尉綠綬。",
    "idiomatic": "The Grand Commandant had a green ribbon."
  },
  "s0041": {
    "literal": "孝景三年，置司馬。",
    "idiomatic": "In the third year of Xiaojing, the Minister of War was established."
  },
  "s0042": {
    "literal": "司馬綠綬。",
    "idiomatic": "The Minister of War had a green ribbon."
  },
  "s0043": {
    "literal": "御史大夫青綬。",
    "idiomatic": "The Imperial Secretary had a blue ribbon."
  },
  "s0044": {
    "literal": "宗正青綬。",
    "idiomatic": "The Director of the Imperial Clan had a blue ribbon."
  },
  "s0045": {
    "literal": "治粟內史黑綬。",
    "idiomatic": "The Superintendent of Agriculture had a black ribbon."
  },
  "s0046": {
    "literal": "少府黑綬。",
    "idiomatic": "The Privy Treasurer had a black ribbon."
  },
  "s0047": {
    "literal": "衛尉青綬。",
    "idiomatic": "The Commander of the Guards had a blue ribbon."
  },
  "s0048": {
    "literal": "太僕黑綬。",
    "idiomatic": "The Master of Carriages had a black ribbon."
  },
  "s0049": {
    "literal": "廷尉黑綬。",
    "idiomatic": "The Superintendent of Trials had a black ribbon."
  },
  "s0050": {
    "literal": "典客黑綬。",
    "idiomatic": "The Superintendent of Guests had a black ribbon."
  }
}
