{
  "s0102": "Thirty-fourth year, initially, Ai Gong married Zheng, eldest wife gave birth Dao crown prince Shi, youngest wife gave birth Yan.",
  "s0103": "Two favored concubines, eldest concubine gave birth Liu, youngest concubine gave birth Sheng.",
  "s0104": "Liu had favor Ai Gong, Ai Gong entrusted him his younger brother Si Tu Zhao.",
  "s0105": "Ai Gong ill, third month, Zhao killed Dao crown prince, established Liu as crown prince.",
  "s0106": "Ai Gong angered, wished execute Zhao, Zhao sent troops surrounded guarded Ai Gong, Ai Gong self hanged killed.",
  "s0107": "Zhao finally established Liu as Chen lord.",
  "s0108": "Fourth month, Chen sent envoy announced Chu.",
  "s0109": "Chu Ling Wang heard Chen disorder, then killed Chen envoy, made gong zi Qi Ji sent troops attacked Chen, Chen lord Liu fled Zheng.",
  "s0110": "Ninth month, Chu surrounded Chen.",
  "s0111": "Eleventh month, extinguished Chen.",
  "s0112": "Made Qi Ji as Chen Gong.",
  "s0113": "Zhao's killed Dao crown prince, crown prince son named Wu, went fleeing Jin.",
  "s0114": "Jin Ping Gong asked great scribe Zhao said: 'Chen then perish?'",
  "s0115": "Answered said: 'Chen, Zhuan Xu clan.",
  "s0116": "Chen clan obtained government at Qi, then finally perish.",
  "s0117": "From Mu to Gu Sou, no violated command.",
  "s0118": "Shun weighed with bright virtue.",
  "s0119": "To Sui, generations guarded it.",
  "s0120": "To Hu Gong, Zhou granted surname, made sacrifice Yu emperor.",
  "s0121": "Moreover flourishing virtue descendants, must hundred generations sacrifice.",
  "s0122": "Yu world not ended, his at Qi?'",
  "s0124": "Chu Ling Wang extinguished Chen five years, Chu gong zi Qi Ji assassinated Ling Wang replaced established, this was Ping Wang.",
  "s0125": "Ping Wang initially established, wished obtain peace feudal lords, then sought former Chen Dao crown prince Shi son Wu, established as Chen Hou, this was Hui Gong.",
  "s0126": "Hui Gong established, explored continued Ai Gong died year made beginning, empty register five years.",
  "s0127": "Tenth year, Chen fire.",
  "s0128": "Fifteenth year, Wu Wang Liao made gong zi Guang attacked Chen, took Hu, Shen left.",
  "s0129": "Twenty-eighth year, Wu Wang He Lu with Zi Xu defeated Chu entered Ying.",
  "s0130": "This year, Hui Gong died, son Huai Gong Liu established.",
  "s0131": "Huai Gong first year, Wu broke Chu, in Ying, summoned Chen Hou.",
  "s0132": "Chen Hou wished go, grand masters said: 'Wu newly obtained will;",
  "s0133": "Chu wang though perished, with Chen have old, cannot betray.'",
  "s0134": "Huai Gong then with illness declined Wu.",
  "s0135": "Fourth year, Wu again summoned Huai Gong.",
  "s0136": "Huai Gong feared, went Wu.",
  "s0137": "Wu angered his previous not go, detained him, because died Wu.",
  "s0138": "Chen then established Huai Gong son Yue, this was Min Gong.",
  "s0139": "Min Gong sixth year, Kong Qiu went Chen.",
  "s0140": "Wu Wang Fu Cha attacked Chen, took three yi left.",
  "s0141": "Thirteenth year, Wu again came attacked Chen, Chen urgently told Chu, Chu Zhao Wang came save, stationed at Cheng Fu, Wu troops left.",
  "s0142": "This year, Chu Zhao Wang died at Cheng Fu.",
  "s0143": "At time Kong Qiu in Chen.",
  "s0144": "Fifteenth year, Song extinguished Cao.",
  "s0145": "Sixteenth year, Wu Wang Fu Cha attacked Qi, defeated it Ai Ling, made person summoned Chen Hou.",
  "s0146": "Chen Hou feared, went Wu.",
  "s0147": "Chu attacked Chen.",
  "s0148": "Twenty-first year, Qi Tian Chang assassinated their lord Jian Gong.",
  "s0149": "Twenty-third year, Chu Bai Gong Sheng killed Ling Yin Zi Xi, Zi Qi, attacked Hui Wang.",
  "s0150": "Ye Gong attacked defeated Bai Gong, Bai Gong self killed.",
  "s0151": "Twenty-fourth year, Chu Hui Wang restored country, with troops north attacked, killed Chen Min Gong, then extinguished Chen had it."
}
