{
  "s0351": "Initially, when the Son of Heaven performed feng at Mount Tai, Mount Tai's northeastern foot had an ancient Bright Hall place, the place was dangerous and not spacious.",
  "s0352": "The emperor wished to build a Bright Hall beside Fenggao, did not understand its system.",
  "s0353": "Jinan man Gong Yu presented a Bright Hall diagram from Huangdi's time.",
  "s0354": "In the Bright Hall diagram there was one hall, four sides without walls, covered with thatch, running water, round palace wall as covered walkway, above had tower, entered from southwest, named Kunlun, the Son of Heaven entered from it, to worship and sacrifice to the Supreme Thearch.",
  "s0355": "Therefore the emperor ordered Fenggao to build a Bright Hall on the Wen, like Yu's diagram.",
  "s0356": "When in the fifth year repairing feng, then sacrificed to Taiyi and the five emperors on the Bright Hall upper seat, made Gao Emperor sacrifice seat face it.",
  "s0357": "Sacrificed to Houtu in the lower room, with twenty great sacrificial animals.",
  "s0358": "The Son of Heaven entered from the Kunlun way, began worshiping the Bright Hall like suburban rites.",
  "s0359": "Rites completed, burnt offerings below the hall.",
  "s0360": "And the emperor again ascended Mount Tai, had secret sacrifices at its peak.",
  "s0361": "And below Mount Tai sacrificed to the five emperors, each according to their direction, Huangdi together with Chidi, and the officials served the sacrifices.",
  "s0362": "Then toured eastward, sacrificed to the eight gods at Mount Tai.",
  "s0363": "Each god had its own altar, one bull for each sacrifice.",
  "s0364": "Then the emperor returned, camped at Mount Liangfu.",
  "s0365": "The emperor said: 'The feng and shan sacrifices have been completed, the world is at peace.'",
  "s0366": "Then the emperor renamed the crown prince as Crown Prince, made Liu Ju crown prince.",
  "s0367": "The next year, the emperor fell ill, the crown prince attended to him.",
  "s0368": "The emperor was critically ill, summoned the prime minister and others to the bedside.",
  "s0369": "Said: 'This morning I dreamed I and the Supreme Thearch wrestled, the Supreme Thearch threw me down.'",
  "s0370": "The prime minister and others said: 'The emperor is the Son of Heaven, blessed by heaven, this dream is auspicious.'",
  "s0371": "The emperor said: 'No, wrestling with the Supreme Thearch is not auspicious.'",
  "s0372": "Then summoned the crown prince to the bedside, said: 'You are my successor, be diligent and frugal, love the people.'",
  "s0373": "The crown prince wept, could not speak.",
  "s0374": "The emperor said: 'The Supreme Thearch has summoned me, I cannot stay long.'",
  "s0375": "Then died in the Weiyang Palace.",
  "s0376": "The crown prince ascended the throne as Emperor Zhao, buried the emperor at Mao Mausoleum.",
  "s0377": "Emperor Zhao was young, the Grand Empress Dowager ruled.",
  "s0378": "Emperor Zhao ruled thirteen years, died.",
  "s0379": "The crown prince Liu Fuling ascended as Emperor Xuan.",
  "s0380": "Emperor Xuan ruled twenty-five years, died.",
  "s0381": "The crown prince Liu Shi ascended as Emperor Yuan.",
  "s0382": "Emperor Yuan ruled sixteen years, died.",
  "s0383": "The crown prince Liu Ao ascended as Emperor Cheng.",
  "s0384": "Emperor Cheng ruled twenty-six years, died.",
  "s0385": "The crown prince Liu Xin ascended as Emperor Ai.",
  "s0386": "Emperor Ai ruled six years, died.",
  "s0387": "The crown prince Liu Kan ascended as Emperor Ping.",
  "s0388": "Emperor Ping ruled five years, died.",
  "s0389": "The crown prince Liu Ying ascended as Emperor Ruzi.",
  "s0390": "Emperor Ruzi ruled one year, died.",
  "s0391": "The crown prince Liu Jian ascended as Emperor Gengshi.",
  "s0392": "Emperor Gengshi ruled one year, died.",
  "s0393": "The crown prince Liu Xuan ascended as Emperor Guangwu.",
  "s0394": "Emperor Guangwu ruled thirty-three years, died.",
  "s0395": "The crown prince Liu Yang ascended as Emperor Ming.",
  "s0396": "Emperor Ming ruled eighteen years, died.",
  "s0397": "The crown prince Liu Zhuang ascended as Emperor Zhang.",
  "s0398": "Emperor Zhang ruled seventeen years, died.",
  "s0399": "The crown prince Liu Zhao ascended as Emperor He.",
  "s0400": "Emperor He ruled seventeen years, died.",
  "s0401": "The crown prince Liu Long ascended as Emperor Shang.",
  "s0402": "Emperor Shang ruled one year, died.",
  "s0403": "The crown prince Liu Hu ascended as Emperor An.",
  "s0404": "Emperor An ruled nineteen years, died.",
  "s0405": "The crown prince Liu Yi ascended as Emperor Shun.",
  "s0406": "Emperor Shun ruled nineteen years, died.",
  "s0407": "The crown prince Liu Bao ascended as Emperor Chong.",
  "s0408": "Emperor Chong ruled one year, died.",
  "s0409": "The crown prince Liu Bing ascended as Emperor Zhi.",
  "s0410": "Emperor Zhi ruled one year, died.",
  "s0411": "The crown prince Liu Zuan ascended as Emperor Huan.",
  "s0412": "Emperor Huan ruled twenty-one years, died.",
  "s0413": "The crown prince Liu Hong ascended as Emperor Ling.",
  "s0414": "Emperor Ling ruled twenty-two years, died.",
  "s0415": "The crown prince Liu Bian ascended as Emperor Shao.",
  "s0416": "Emperor Shao ruled one year, died.",
  "s0417": "The crown prince Liu Xie ascended as Emperor Xian.",
  "s0418": "Emperor Xian ruled thirty-two years, died."
}