{
  "s0132": {
    "chinese": "武王馳之，紂兵皆崩畔紂。",
    "literal": "King Wu charged forward, the Zhou troops all collapsed and rebelled against Zhou.",
    "idiomatic": "King Wu charged forward, and King Zhou's troops all collapsed and turned against him."
  },
  "s0133": {
    "chinese": "紂走，反入登于鹿臺之上，蒙衣其殊玉，自燔于火而死。",
    "literal": "Zhou fled, returned and ascended the Deer Tower, covered himself with his precious jades, and burned himself to death in the fire.",
    "idiomatic": "King Zhou fled, returned and ascended the Deer Tower, covered himself with his precious jades, and burned himself to death in the fire."
  },
  "s0134": {
    "chinese": "武王持大白旗以麾諸侯，諸侯畢拜武王，武王乃揖諸侯，諸侯畢從。",
    "literal": "King Wu held the great white banner to command the lords, all the lords bowed to King Wu, King Wu then bowed to the lords, all the lords followed.",
    "idiomatic": "King Wu held the great white banner to direct the feudal lords; all the lords bowed to King Wu, then King Wu bowed to the lords, and all the lords followed him."
  },
  "s0135": {
    "chinese": "武王至商國，商國百姓咸待於郊。",
    "literal": "King Wu arrived at the Shang state, the common people of Shang all waited in the suburbs.",
    "idiomatic": "King Wu arrived at the Shang capital, and all the common people of Shang waited for him in the suburbs."
  },
  "s0136": {
    "chinese": "於是武王使群臣告語商百姓曰：「上天降休！」",
    "literal": "Therefore King Wu sent his ministers to announce to the Shang common people: 'Heaven has sent down good fortune!'",
    "idiomatic": "Thus King Wu sent his ministers to announce to the Shang common people: 'Heaven has sent down blessing!'"
  },
  "s0137": {
    "chinese": "商人皆再拜稽首，武王亦答拜。",
    "literal": "The Shang people all bowed twice with heads to ground, King Wu also returned the bow.",
    "idiomatic": "The Shang people all bowed twice with heads to the ground; King Wu also returned their bows."
  },
  "s0138": {
    "chinese": "遂入，至紂死所。",
    "literal": "King Wu entered the palace, sat on the great throne, the lords all presented their captives.",
    "idiomatic": "Thus he entered the palace and went to where King Zhou had died."
  },
  "s0139": {
    "chinese": "武王自射之，三發而後下車，以輕劍擊之，以黃鉞斬紂頭，縣大白之旗。",
    "literal": "King Wu made the proclamation to the four directions: 'The ancients had a saying: 'Do not kill those who surrender.'",
    "idiomatic": "King Wu himself shot at him, three arrows, then dismounted, struck him with a light sword, decapitated him with the yellow battle-axe, and hung his head from the great white banner."
  },
  "s0140": {
    "chinese": "已而至紂之嬖妾二女，二女皆經自殺。",
    "literal": "I am not an executioner, do not kill the captives.'",
    "idiomatic": "Then he came to King Zhou's two favored concubines; both women had hanged themselves."
  },
  "s0141": {
    "chinese": "武王又射三發，擊以劍，斬以玄鉞，縣其頭小白之旗。",
    "literal": "King Wu released the imprisoned Jizi, restored the imprisoned Bi Gan.",
    "idiomatic": "King Wu shot them three times each, struck them with his sword, decapitated them with the black battle-axe, and hung their heads from the small white banner."
  },
  "s0142": {
    "chinese": "武王已乃出復軍。",
    "literal": "He searched for the imprisoned Xiahou Shang, found him and released him.",
    "idiomatic": "King Wu then went out to return to his army."
  },
  "s0143": {
    "chinese": "其明日，除道，修社及商紂宮。",
    "literal": "He made the Duke of Zhou guard the eastern regions.",
    "idiomatic": "The next day, he cleared the roads and repaired the altars and King Zhou's palace."
  },
  "s0144": {
    "chinese": "及期，百夫荷罕旗以先驅。",
    "literal": "In the twelfth year, King Wu died.",
    "idiomatic": "When the time came, the captains of a hundred carried the rare banner to lead the way."
  },
  "s0145": {
    "chinese": "武王弟叔振鐸奉陳常車，周公旦把大鉞，畢公把小鉞，以夾武王。",
    "literal": "King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": "King Wu's younger brother Uncle Zhen Duo held the regular chariot, Zhou Gong Dan grasped the great battle-axe, Bi Gong grasped the small battle-axe, flanking King Wu on both sides."
  },
  "s0146": {
    "chinese": "散宜生、太顛、閎夭皆執劍以衛武王。",
    "literal": "The three guards rebelled, saying: 'The Duke of Zhou will harm the young king.'",
    "idiomatic": "San Yisheng, Tai Dian, and Hong Yao all held swords to guard King Wu."
  },
  "s0147": {
    "chinese": "既入，立于社南大卒之左，［左］右畢從。",
    "literal": "The Duke of Zhou went to the eastern capital, put down the rebellion.",
    "idiomatic": "When they entered, they stood south of the altar, to the left of the great army, with followers on both sides."
  },
  "s0148": {
    "chinese": "毛叔鄭奉明水，衛康叔封布茲，召公奭贊采，師尚父牽牲。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": "Mao Shu Zheng presented the clear water, Wei Kang Shu spread the rushes, Shao Gong Shi recited the liturgy, and Master Shangfu led the sacrificial animal."
  },
  "s0149": {
    "chinese": "尹佚筴祝曰：「殷之末孫季紂，殄廢先王明德，侮蔑神祇不祀，昏暴商邑百姓，其章顯聞于天皇上帝。」",
    "literal": "He made the Da Gao proclamation, comforted the Yin people.",
    "idiomatic": "Yin Yi beat the drum and made the invocation: 'Yin's last descendant, Ji Zhou, has extinguished and abandoned the enlightened virtue of the former kings, insulted and neglected the gods without sacrifice, tyrannized over the people of Shang, and his crimes are clearly heard by the Heavenly Sovereign.'"
  },
  "s0150": {
    "chinese": "於是武王再拜稽首，曰：「膺更大命，革殷，受天明命。」",
    "literal": "He made the Kang Gao proclamation, established the ritual system.",
    "idiomatic": "Thus King Wu bowed twice with head to ground and said: 'I receive this great mandate, to overthrow Yin and accept Heaven's enlightened command.'"
  },
  "s0151": {
    "chinese": "武王又再拜稽首，乃出。",
    "literal": "He made the Jun Shi proclamation, divided the lands.",
    "idiomatic": "King Wu again bowed twice with head to ground, then departed."
}
}
