{
  "s0300": "Thus people cannot lack music, music cannot lack form.",
  "s0301": "Form without following way, cannot lack chaos.",
  "s0302": "Former kings hated its chaos, thus formed ya song sounds to guide it, make its sounds sufficient for joy without flowing, make its patterns sufficient to bind without tiring, make its curved straight elaborate simple pure fleshy rhythms, sufficient to move people's good hearts only, not let wandering evil qi connect, this is former kings establishing music's method.",
  "s0303": "Thus music in ancestral temple midst, ruler minister high low together hear it, then none not harmonious respectful;",
  "s0304": "In clan elder village hamlet midst, elder younger together hear it, then none not harmonious yielding;",
  "s0305": "In inner chambers within, father son brothers together hear it, then none not harmonious close.",
  "s0306": "Thus music examines one to settle harmony, compares things to adorn sections, rhythms combine to form patterns, thus unites harmonizes father son ruler minister, attaches close ten thousand people, this is former kings establishing music's method.",
  "s0307": "Thus hear its ya song sounds, will intent gets broad;",
  "s0308": "Grasp its shield axe, practice its bow rise bend stretch, appearance gets solemn;",
  "s0309": "Carry its connected ranks, grasp its rhythms, rows columns get correct, advance retreat get even.",
  "s0310": "Thus music is heaven earth's equal, central harmony's record, human feelings cannot avoid.",
  "s0311": "Music is former kings' way to adorn joy;",
  "s0312": "Military campaigns axes hatchets is former kings' way to adorn anger.",
  "s0313": "Thus former kings' joy anger all got their equal.",
  "s0314": "Joy then world harmonizes it, anger then violent chaotic fear it.",
  "s0315": "Former kings' way ritual music can be called flourishing.",
  "s0316": "Wei Wen Hou asked Zi Xia saying: 'I properly capped robed hear ancient music then only fear sleeping, hear Zheng Wei sounds then not know tiredness.",
  "s0317": "Dare ask ancient music like that, why?",
  "s0318": "New music like this, why?'",
  "s0320": "Zi Xia answered saying: 'Now ancient music, advance troops retreat troops, harmony correct to broad, strings gourds sheng reeds together guard beat drum, begin performance with pattern, stop chaos with martial, govern chaos with prime minister, interrogate haste with ya.",
  "s0321": "Gentleman thus discusses, thus explains ancient, cultivates self reaches family, evens world: this ancient music's expression.",
  "s0322": "Now new music, advance bow retreat bow, evil sounds with licentious, drown without stop, reach actors dwarfs, mingle mixed sons daughters, not know father son.",
  "s0323": "Music end cannot discuss, cannot explain ancient: this new music's expression.",
  "s0324": "Now lord's asked is music, what likes is sound.",
  "s0325": "Music and sound, close but different.'",
  "s0327": "Wen Hou said: 'Dare ask how?'",
  "s0329": "Zi Xia answered saying: 'Ancient heaven earth orderly four seasons proper, people have virtue five grains prosper, sickness not arise without evil omens, this called great proper.",
  "s0330": "Then sage made father son ruler minister as framework, framework already correct, world greatly settled, world greatly settled, then correct six pitches, harmonize five sounds, string sing poem song, this called virtue sound, virtue sound called music.",
  "s0331": "Poem says: 'None his virtue sound, his virtue can bright, can bright can categorize, can elder can lord.",
  "s0332": "Wang this great state, can yield can aid.",
  "s0333": "Aid to Wen Wang, his virtue no regret.",
  "s0334": "Already received Di blessing, applied to grandson child.'",
  "s0335": "This what called.",
  "s0336": "Now lord's what likes, drown sound?'",
  "s0338": "Wen Hou said: 'Dare ask drown sound from where come?'",
  "s0340": "Zi Xia answered saying: 'Zheng sound likes overflowing licentious will, Song sound Yan woman drown will, Wei sound hurried numerous troubled will, Qi sound haughty deviant proud will, four all licentious in color harm virtue, thus sacrifice not use.",
  "s0341": "Poem says: 'Solemn harmonious cry together, ancestors this listen.'",
  "s0342": "Solemn solemn, respect;",
  "s0343": "Harmonious harmonious, harmony.",
  "s0344": "Respect with harmony, what affair not carry?",
  "s0345": "As person lord, careful what like hate only.",
  "s0346": "Lord likes then minister does it, above carries then people follow.",
  "s0347": "Poem says: 'Guide people very easy', this what called.",
  "s0348": "Then sage made nao drum frame drums xun chi, these six, virtue sound's sounds.",
  "s0349": "Then bells chimes yu se to harmonize it, shield axe banners standards to dance it.",
  "s0350": "This to sacrifice former kings' temple, to present rewards pledges exchanges, to official order noble base each get suitable, this to show later generations have noble base elder younger order.",
  "s0351": "Bell sound kong, kong to establish call, call to establish signal, signal to establish martial.",
  "s0352": "Gentleman hears bell sound then thinks martial ministers.",
  "s0353": "Stone sound qing, qing to establish distinction, distinction to cause death.",
  "s0354": "Gentleman hears chime sound then thinks death border ministers."
}
