{
  "s0001": "The Grand Historian said: The Xiongnu broke off the peace alliance and attacked the border passes along the route;",
  "s0002": "Minyue arbitrarily invaded, Dong'ou requested to surrender.",
  "s0003": "Two barbarian tribes mutually invaded, at the time when Han was at its most flourishing, from this one knows that meritorious ministers received enfeoffments comparable to their ancestors.",
  "s0004": "Why is this?",
  "s0005": "Since the Poetry and Documents speak of the Three Dynasties 'repelling the Rong and Di, punishing Jing and Tu', the Grand Historian said: Duke Huan of Qi crossed Yan to attack the Shanrong, King Wuling with his small state of Zhao subdued the Chanyu, Duke Mu of Qin used Baili to hegemonize the Western Rong, the rulers of Wu and Chu used the feudal lords to make the Hundred Yue serve.",
  "s0006": "How much more so with China unified, the enlightened Son of Heaven above, combining civil and military, sweeping across the four seas, internally gathering crowds of millions, how could they peacefully not conduct border campaigns!",
  "s0007": "From this time afterward, they sent out armies to attack the strong Hu to the north, executed the strong Yue to the south, generals and soldiers were successively enfeoffed.",
  "s15": "Xi.",
  "s16": "Xiongnu prime minister surrendered, Marquis. Yuanshuo second year, attached to the General of Chariots and Cavalry, attacked Xiongnu with merit, increased enfeoffment.",
  "s17": "Three. Fourth year seventh month ren wu, Marquis Zhao Xin first year.",
  "s18": "Five. Sixth year, Marquis Xin as Forward General attacked Xiongnu, encountered Chanyu troops, was defeated, Xin surrendered to Xiongnu, state abolished.",
  "s23": "Chi Zhuang.",
  "s24": "Xiongnu colonel surrendered, Marquis.",
  "s25": "Sixth year ninth month after bing yin, Marquis Yue first year.",
  "s26": "Six",
  "s27": "Six",
  "s28": "First year, Marquis Yue died, no posterity, state abolished.",
  "s31": "Qin Yang.",
  "s32": "Xiongnu prime minister surrendered, Marquis.",
  "s34": "Three. Second year tenth month gui si, Marquis Yue Zhi first year. Fifth year, Marquis Yue Zhi convicted of fleeing decapitation, state abolished.",
  "s39": "Ruo Yang.",
  "s40": "Xiongnu prime minister surrendered, Marquis.",
  "s42": "Three. Second year tenth month gui si, Marquis Meng first year. Fifth year, Marquis Meng convicted of fleeing decapitation, state abolished.",
  "s47": "Chang Ping.",
  "s48": "With Yuanshuo second year again as General of Chariots and Cavalry attacked Xiongnu, achieved merit in taking Shuofang and Henan, Marquis. Yuanshuo fifth year, as Grand General attacked Xiongnu, defeated Right Wise King, increased enfeoffment by three thousand households.",
  "s50": "Five. Second year third month bing chen, Marquis Lie Wei Qing first year.",
  "s51": "Six",
  "s52": "Six",
  "s53": "Six",
  "s54": "Taichu first year, current Marquis Kang first year.",
  "s55": "Ping Ling.",
  "s56": "As colonel followed General of Chariots and Cavalry Qing attacked Xiongnu with merit, Marquis. With Yuanshuo fifth year, as Roaming General followed Grand General, increased enfeoffment.",
  "s58": "Five. Second year third month bing chen, Marquis Su Jian first year.",
  "s59": "Six",
  "s60": "Six. Sixth year, Marquis Jian as Right General, together with Marquis Xi Xin were defeated, alone escaped and returned, should be executed, ransomed, state abolished.",
  "s63": "An Tou.",
  "s64": "As colonel followed General of Chariots and Cavalry Qing attacked Xiongnu with merit, Marquis. Yuanshuo sixth year, followed Grand General, increased enfeoffment.",
  "s66": "Five. Second year sixth month ren chen, Marquis Zhang Ci Gong first year.",
  "s67": "First year, Marquis Ci Gong convicted of adultery with daughter of King of Huainan, and accepting bribes crime, state abolished.",
  "s71": "Ping Jin.",
  "s72": "As Chancellor memorialized for praise, Marquis.",
  "s74": "Four. Fifth year eleventh month yi chou, Marquis Xian Gong Sun Hong first year.",
  "s75": "Two. Four. Third year, Marquis Qing first year.",
  "s76": "Six",
  "s77": "Three. Fourth year, Marquis Qing convicted of crimes as Grand Administrator of Shanyang, state abolished.",
  "s79": "She An",
  "s80": "As Xiongnu Chanyu crown prince surrendered, Marquis.",
  "s82": "One. Third year fourth month bing zi, Marquis Yu Shan first year. Fifth month, died, no posterity, state abolished.",
  "s87": "Chang Wu."
}
