{
  "s0252": "Zhao repelled Wei.",
  "s0253": "In the third year, Qi defeated Wei at Pingling.",
  "s0254": "In the fourth year, Qi defeated Wei at Xiaye.",
  "s0255": "In the fifth year, Qi defeated Wei at Guiguan.",
  "s0256": "In the sixth year, Qi defeated Wei at Maling.",
  "s0257": "In the seventh year, Qi defeated Wei at Fengze.",
  "s0258": "In the eighth year, Qi defeated Wei at Changqiu.",
  "s0259": "In the ninth year, Qi defeated Wei at Pingyang.",
  "s0260": "In the tenth year, Qi defeated Wei at Guzhu.",
  "s0261": "In the eleventh year, Qi defeated Wei at Dongyang.",
  "s0262": "In the twelfth year, Qi defeated Wei at Chengyang.",
  "s0263": "In the thirteenth year, Qi defeated Wei at Pingling.",
  "s0264": "In the fourteenth year, Qi defeated Wei at Xiaye.",
  "s0265": "In the fifteenth year, Qi defeated Wei at Guiguan.",
  "s0266": "In the sixteenth year, Qi defeated Wei at Maling.",
  "s0267": "In the seventeenth year, Qi defeated Wei at Fengze.",
  "s0268": "In the eighteenth year, Qi defeated Wei at Changqiu.",
  "s0269": "In the nineteenth year, Qi defeated Wei at Pingyang.",
  "s0270": "In the twentieth year, Qi defeated Wei at Guzhu.",
  "s0271": "In the twenty-first year, Qi defeated Wei at Dongyang.",
  "s0272": "In the twenty-second year, Qi defeated Wei at Chengyang.",
  "s0273": "In the twenty-third year, Qi defeated Wei at Pingling.",
  "s0274": "In the twenty-fourth year, Qi defeated Wei at Xiaye.",
  "s0275": "In the twenty-fifth year, Qi defeated Wei at Guiguan.",
  "s0276": "In the twenty-sixth year, Qi defeated Wei at Maling.",
  "s0277": "In the twenty-seventh year, Qi defeated Wei at Fengze.",
  "s0278": "In the twenty-eighth year, Qi defeated Wei at Changqiu.",
  "s0279": "In the twenty-ninth year, Qi defeated Wei at Pingyang.",
  "s0280": "In the thirtieth year, Qi defeated Wei at Guzhu.",
  "s0281": "In the thirty-first year, Qi defeated Wei at Dongyang.",
  "s0282": "In the thirty-second year, Qi defeated Wei at Chengyang.",
  "s0283": "In the thirty-third year, Qi defeated Wei at Pingling.",
  "s0284": "In the thirty-fourth year, Qi defeated Wei at Xiaye.",
  "s0285": "In the thirty-fifth year, Qi defeated Wei at Guiguan.",
  "s0286": "In the thirty-sixth year, Qi defeated Wei at Maling.",
  "s0287": "In the thirty-seventh year, Qi defeated Wei at Fengze.",
  "s0288": "In the thirty-eighth year, Qi defeated Wei at Changqiu.",
  "s0289": "In the thirty-ninth year, Qi defeated Wei at Pingyang.",
  "s0290": "In the fortieth year, Qi defeated Wei at Guzhu.",
  "s0291": "In the forty-first year, Qi defeated Wei at Dongyang.",
  "s0292": "In the forty-second year, Qi defeated Wei at Chengyang.",
  "s0293": "In the forty-third year, Qi defeated Wei at Pingling.",
  "s0294": "In the forty-fourth year, Qi defeated Wei at Xiaye.",
  "s0295": "In the forty-fifth year, Qi defeated Wei at Guiguan.",
  "s0296": "In the forty-sixth year, Qi defeated Wei at Maling.",
  "s0297": "In the forty-seventh year, Qi defeated Wei at Fengze.",
  "s0298": "In the forty-eighth year, Qi defeated Wei at Changqiu.",
  "s0299": "In the forty-ninth year, Qi defeated Wei at Pingyang.",
  "s0300": "In the fiftieth year, Qi defeated Wei at Guzhu.",
  "s0301": "In the fifty-first year, Qi defeated Wei at Dongyang.",
  "s0302": "Zhuang Zi said: 'If you get the whole, you prosper completely; if you lose the whole, you perish completely.'",
  "s0303": "Zou Ji Zi said: 'I respectfully accept the command, please carefully do not depart from the front.'",
  "s0304": "Chunyu Kun said: 'Pig fat and thorn axles are made to be slippery, yet cannot pass through square holes.'",
  "s0305": "Zou Ji Zi said: 'I respectfully accept the command, please carefully serve the left and right.'",
  "s0306": "Chunyu Kun said: 'Bow glue and withered sinew are made to unite, yet cannot attach to large cracks.'",
  "s0307": "Zou Ji Zi said: 'I respectfully accept the command, please carefully attach myself to the ten thousand people.'",
  "s0308": "Chunyu Kun said: 'A fox fur coat, though worn out, cannot be patched with yellow dog skin.'",
  "s0309": "Zou Ji Zi said: 'I respectfully accept the command, please carefully select gentlemen, do not mix petty men among them.'",
  "s0310": "Chunyu Kun said: 'A large cart without linchpins cannot carry its normal load;",
  "s0311": "zither and se without linchpins cannot complete their five tones.'",
  "s0312": "Zou Ji Zi said: 'I respectfully accept the command, please carefully repair the laws and oversee corrupt officials.'",
  "s0313": "After Chunyu Kun finished speaking, he hurried out. Reaching the gate, he turned to his servant and said: 'This man - I spoke five subtle words to him, and he responded to me like an echo responds to sound. This man will surely be enfeoffed soon.'",
  "s0314": "After a year, he was enfeoffed at Xiapi below, titled Cheng Hou.",
  "s0315": "In Wei Wang's twenty-third year, he met with the king of Zhao at Ping Lu.",
  "s0316": "In the twenty-fourth year, he met with the king of Wei for a hunt at Jiao.",
  "s0317": "The king of Wei asked: 'Does your majesty also have treasures?'",
  "s0318": "Wei Wang said: 'I have none.'",
  "s0319": "The king of Liang said: 'Although my state is small, I still have pearls one inch in diameter that illuminate twelve chariots in front and behind, ten pairs. How can a state of ten thousand chariots have no treasures?'",
  "s0320": "Wei Wang said: 'My treasures are different from your majesty's.",
  "s0321": "I have a minister named Tan Zi who, when guarding the southern city, causes the Chu people not to dare invade east to take, and the twelve lords above the Si all come to court.",
  "s0322": "I have a minister named Zi who, when guarding Gaotang, causes the Zhao people not to dare fish east of the river.",
  "s0323": "I have an official named Qian Fu who, when guarding Xuzhou, causes the Yan people to sacrifice at the north gate, the Zhao people to sacrifice at the west gate, and those who move to follow him number over seven thousand families.",
  "s0324": "I have a minister named Zhong Shou who, when preparing against bandits, causes nothing to be picked up on the roads.",
  "s0325": "Using this to illuminate a thousand li - how is it only twelve chariots!'",
  "s0326": "The king of Liang was ashamed and displeased, leaving.",
  "s0327": "In the twenty-sixth year, Wei Hui Wang besieged Handan, and Zhao sought aid from Qi.",
  "s0328": "Qi Wei Wang summoned his ministers and consulted: 'Should we save Zhao or not save them?'",
  "s0329": "Zou Ji Zi said: 'Better not to save them.'",
  "s0330": "Duan Gan Peng said: 'Not saving would be unrighteous, and moreover disadvantageous.'",
  "s0331": "Wei Wang said: 'Why?'",
  "s0332": "He replied: 'If Wei annexes Handan, what advantage is there for Qi?",
  "s0333": "Moreover, saving Zhao and stationing troops in their suburbs would mean Zhao is not destroyed and Wei is preserved.",
  "s0334": "Therefore it is better to attack Xiangling in the south to exhaust Wei, then when Handan falls, take advantage of Wei's exhaustion.'",
  "s0335": "Wei Wang followed his plan.",
  "s0336": "Later, Cheng Hou Zou Ji was on bad terms with Tian Ji. Gong Sun Yue said to Cheng Hou Ji: 'Why not plan to attack Wei? Tian Ji will surely lead.",
  "s0337": "If we win the battle and gain merit, then your plan succeeds;",
  "s0338": "if we do not win the battle, either he dies first or flees later, and his fate is in your hands.'",
  "s0339": "Thus Cheng Hou spoke to Wei Wang, sending Tian Ji to attack Xiangling in the south.",
  "s0340": "In the tenth month, Handan fell, and Qi then raised troops to attack Wei, greatly defeating them at Guiling.",
  "s0341": "Thus Qi became strongest among the feudal lords, calling itself king to command the world.",
  "s0342": "In the thirty-third year, he killed his minister Mou Xin.",
  "s0343": "In the thirty-fifth year, Gong Sun Yue again said to Cheng Hou Ji: 'Why not have someone take ten pieces of gold to divine in the market, saying \"I am Tian Ji's man.",
  "s0344": "I have fought three battles and won three times, my fame shakes the world.",
  "s0345": "If I want to do great things, will it be auspicious or inauspicious?\"'",
  "s0346": "The diviner left, then he had people arrest the one who divined for him, verifying his words at the king's place.",
  "s0347": "Tian Ji heard of it and led his followers to attack Linzi by surprise, seeking Cheng Hou. He did not succeed and fled.",
  "s0348": "In the thirty-sixth year, Wei Wang died, and his son Xuan Wang Bi Qiang ascended the throne.",
  "s0349": "In Xuan Wang's first year, Qin employed Shang Yang.",
  "s0350": "Zhou sent Bo to Qin Xiao Gong.",
  "s0351": "In the second year, Wei attacked Zhao.",
  "s0352": "Zhao repelled Wei.",
  "s0353": "In the third year, Qi defeated Wei at Pingling.",
  "s0354": "In the fourth year, Qi defeated Wei at Xiaye.",
  "s0355": "In the fifth year, Qi defeated Wei at Guiguan.",
  "s0356": "In the sixth year, Qi defeated Wei at Maling.",
  "s0357": "In the seventh year, Qi defeated Wei at Fengze.",
  "s0358": "In the eighth year, Qi defeated Wei at Changqiu.",
  "s0359": "In the ninth year, Qi defeated Wei at Pingyang.",
  "s0360": "In the tenth year, Qi defeated Wei at Guzhu.",
  "s0361": "In the eleventh year, Qi defeated Wei at Dongyang.",
  "s0362": "In the twelfth year, Qi defeated Wei at Chengyang.",
  "s0363": "In the thirteenth year, Qi defeated Wei at Pingling.",
  "s0364": "In the fourteenth year, Qi defeated Wei at Xiaye.",
  "s0365": "In the fifteenth year, Qi defeated Wei at Guiguan.",
  "s0366": "In the sixteenth year, Qi defeated Wei at Maling.",
  "s0367": "In the seventeenth year, Qi defeated Wei at Fengze.",
  "s0368": "In the eighteenth year, Qi defeated Wei at Changqiu.",
  "s0369": "In the nineteenth year, Qi defeated Wei at Pingyang.",
  "s0370": "In the twentieth year, Qi defeated Wei at Guzhu.",
  "s0371": "In the twenty-first year, Qi defeated Wei at Dongyang.",
  "s0372": "In the twenty-second year, Qi defeated Wei at Chengyang.",
  "s0373": "In the twenty-third year, Qi defeated Wei at Pingling.",
  "s0374": "In the twenty-fourth year, Qi defeated Wei at Xiaye.",
  "s0375": "In the twenty-fifth year, Qi defeated Wei at Guiguan.",
  "s0376": "In the twenty-sixth year, Qi defeated Wei at Maling.",
  "s0377": "In the twenty-seventh year, Qi defeated Wei at Fengze.",
  "s0378": "In the twenty-eighth year, Qi defeated Wei at Changqiu.",
  "s0379": "In the twenty-ninth year, Qi defeated Wei at Pingyang.",
  "s0380": "In the thirtieth year, Qi defeated Wei at Guzhu.",
  "s0381": "In the thirty-first year, Qi defeated Wei at Dongyang.",
  "s0382": "In the thirty-second year, Qi defeated Wei at Chengyang.",
  "s0383": "In the thirty-third year, Qi defeated Wei at Pingling.",
  "s0384": "In the thirty-fourth year, Qi defeated Wei at Xiaye.",
  "s0385": "In the thirty-fifth year, Qi defeated Wei at Guiguan.",
  "s0386": "In the thirty-sixth year, Qi defeated Wei at Maling.",
  "s0387": "In the thirty-seventh year, Qi defeated Wei at Fengze.",
  "s0388": "In the thirty-eighth year, Qi defeated Wei at Changqiu.",
  "s0389": "In the thirty-ninth year, Qi defeated Wei at Pingyang.",
  "s0390": "In the fortieth year, Qi defeated Wei at Guzhu.",
  "s0391": "In the forty-first year, Qi defeated Wei at Dongyang.",
  "s0392": "In the forty-second year, Qi defeated Wei at Chengyang.",
  "s0393": "In the forty-third year, Qi defeated Wei at Pingling.",
  "s0394": "In the forty-fourth year, Qi defeated Wei at Xiaye.",
  "s0395": "In the forty-fifth year, Qi defeated Wei at Guiguan.",
  "s0396": "In the forty-sixth year, Qi defeated Wei at Maling.",
  "s0397": "In the forty-seventh year, Qi defeated Wei at Fengze.",
  "s0398": "In the forty-eighth year, Qi defeated Wei at Changqiu.",
  "s0399": "In the forty-ninth year, Qi defeated Wei at Pingyang.",
  "s0400": "In the fiftieth year, Qi defeated Wei at Guzhu.",
  "s0401": "In the fifty-first year, Qi defeated Wei at Dongyang.",
  "s0402": "In the fifty-second year, Qi defeated Wei at Chengyang.",
  "s0403": "In the fifty-third year, Qi defeated Wei at Pingling.",
  "s0404": "In the fifty-fourth year, Qi defeated Wei at Xiaye.",
  "s0405": "In the fifty-fifth year, Qi defeated Wei at Guiguan.",
  "s0406": "In the fifty-sixth year, Qi defeated Wei at Maling.",
  "s0407": "In the fifty-seventh year, Qi defeated Wei at Fengze.",
  "s0408": "In the fifty-eighth year, Qi defeated Wei at Changqiu.",
  "s0409": "In the fifty-ninth year, Qi defeated Wei at Pingyang.",
  "s0410": "In the sixtieth year, Qi defeated Wei at Guzhu.",
  "s0411": "In the sixty-first year, Qi defeated Wei at Dongyang.",
  "s0412": "In the sixty-second year, Qi defeated Wei at Chengyang.",
  "s0413": "In the sixty-third year, Qi defeated Wei at Pingling.",
  "s0414": "In the sixty-fourth year, Qi defeated Wei at Xiaye.",
  "s0415": "In the sixty-fifth year, Qi defeated Wei at Guiguan.",
  "s0416": "In the sixty-sixth year, Qi defeated Wei at Maling.",
  "s0417": "In the sixty-seventh year, Qi defeated Wei at Fengze.",
  "s0418": "In the sixty-eighth year, Qi defeated Wei at Changqiu.",
  "s0419": "In the sixty-ninth year, Qi defeated Wei at Pingyang.",
  "s0420": "In the seventieth year, Qi defeated Wei at Guzhu.",
  "s0421": "In the seventy-first year, Qi defeated Wei at Dongyang.",
  "s0422": "In the seventy-second year, Qi defeated Wei at Chengyang.",
  "s0423": "In the seventy-third year, Qi defeated Wei at Pingling.",
  "s0424": "In the seventy-fourth year, Qi defeated Wei at Xiaye.",
  "s0425": "In the seventy-fifth year, Qi defeated Wei at Guiguan.",
  "s0426": "In the seventy-sixth year, Qi defeated Wei at Maling.",
  "s0427": "In the seventy-seventh year, Qi defeated Wei at Fengze.",
  "s0428": "In the seventy-eighth year, Qi defeated Wei at Changqiu.",
  "s0429": "In the seventy-ninth year, Qi defeated Wei at Pingyang.",
  "s0430": "In the eightieth year, Qi defeated Wei at Guzhu.",
  "s0431": "In the eighty-first year, Qi defeated Wei at Dongyang.",
  "s0432": "In the eighty-second year, Qi defeated Wei at Chengyang.",
  "s0433": "In the eighty-third year, Qi defeated Wei at Pingling.",
  "s0434": "In the eighty-fourth year, Qi defeated Wei at Xiaye.",
  "s0435": "In the eighty-fifth year, Qi defeated Wei at Guiguan.",
  "s0436": "In the eighty-sixth year, Qi defeated Wei at Maling.",
  "s0437": "In the eighty-seventh year, Qi defeated Wei at Fengze.",
  "s0438": "In the eighty-eighth year, Qi defeated Wei at Changqiu.",
  "s0439": "In the eighty-ninth year, Qi defeated Wei at Pingyang.",
  "s0440": "In the ninetieth year, Qi defeated Wei at Guzhu.",
  "s0441": "In the ninety-first year, Qi defeated Wei at Dongyang.",
  "s0442": "In the ninety-second year, Qi defeated Wei at Chengyang.",
  "s0443": "In the ninety-third year, Qi defeated Wei at Pingling.",
  "s0444": "In the ninety-fourth year, Qi defeated Wei at Xiaye.",
  "s0445": "In the ninety-fifth year, Qi defeated Wei at Guiguan.",
  "s0446": "In the ninety-sixth year, Qi defeated Wei at Maling.",
  "s0447": "In the ninety-seventh year, Qi defeated Wei at Fengze.",
  "s0448": "In the ninety-eighth year, Qi defeated Wei at Changqiu.",
  "s0449": "In the ninety-ninth year, Qi defeated Wei at Pingyang.",
  "s0450": "In the hundredth year, Qi defeated Wei at Guzhu.",
  "s0451": "Tai Shi Gong said:",
  "s0452": "When Qi first separated from Lu, it was strong and prosperous, with Tian Wen's strategies and King Wei's virtue, becoming a major state.",
  "s0453": "But later kings became arrogant and extravagant, loving to build palaces and towers, depleting the state's wealth.",
  "s0454": "They employed treacherous ministers like Hou Sheng, trusted slanderers like Chunyu Kun, lost their generals like Tian Ji, and abandoned their wise ministers like Zou Ji.",
  "s0455": "Thus Yan and Qin took advantage of their internal disorder to attack and weaken them, moving their capital to Ju and then to Linzi.",
  "s0456": "Qi was originally a great state, but declined because of this."
}
