{
  "s0050": "Sixth year, Hui Gong many favored wives, duke wished remove various grand masters establish favored wife Song, grand masters together executed Ji Song, Hui Gong feared, fled Qi.",
  "s0051": "Fourth year, Qi Gao Yan went to Jin, requested together attack Yan, enter their lord.",
  "s0052": "Jin Ping Gong permitted, with Qi attacked Yan, entered Hui Gong.",
  "s0053": "Hui Gong to Yan died.",
  "s0054": "Yan established Dao Gong.",
  "s0055": "Dao Gong seventh year died, Gong Gong established.",
  "s0056": "Gong Gong fifth year died, Ping Gong established.",
  "s0057": "Jin gong chamber lowly, six ministers began strong great.",
  "s0058": "Ping Gong eighteenth year, Wu Wang He Lu broke Chu entered Ying.",
  "s0059": "Nineteenth year died, Jian Gong established.",
  "s0060": "Jian Gong twelfth year died, Xian Gong established.",
  "s0061": "Jin Zhao Yang surrounded Fan, Zhong Xing at Zhao Ge.",
  "s0062": "Xian Gong twelfth year, Qi Tian Chang assassinated their lord Jian Gong.",
  "s0063": "Fourteenth year, Kong Qiu died.",
  "s0064": "Twenty-eighth year, Xian Gong died, Xiao Gong established.",
  "s0065": "Xiao Gong twelfth year, Han, Wei, Zhao extinguished Zhi Bo, divided his land, three Jin strong.",
  "s0066": "Fifteenth year, Xiao Gong died, Cheng Gong established.",
  "s0067": "Cheng Gong sixteenth year died, Min Gong established.",
  "s0068": "Min Gong thirty-first year died, Xi Gong established.",
  "s0069": "This year, three Jin ranked as feudal lords.",
  "s0070": "Xi Gong thirtieth year, attacked defeated Qi at Lin Ying.",
  "s0071": "Xi Gong died, Huan Gong established.",
  "s0072": "Huan Gong eleventh year died, Wen Gong established.",
  "s0073": "This year, Qin Xian Gong died.",
  "s0074": "Qin increasingly strong.",
  "s0075": "Wen Gong nineteenth year, Qi Wei Wang died.",
  "s0076": "Twenty-eighth year, Su Qin began came see, persuaded Wen Gong.",
  "s0077": "Wen Gong gave chariots horses gold silk to reach Zhao, Zhao Xu Hou used him.",
  "s0078": "Because allied six countries, became alliance chief.",
  "s0079": "Qin Hui Wang with his daughter as Yan crown prince wife.",
  "s0080": "Twenty-ninth year, Wen Gong died, crown prince established, this was Yi Wang.",
  "s0081": "Yi Wang initially established, Qi Xuan Wang took advantage Yan mourning attacked us, took ten cities;",
  "s0082": "Su Qin persuaded Qi, made again return Yan ten cities.",
  "s0083": "Tenth year, Yan lord became king.",
  "s0084": "Su Qin with Yan Wen Gong wife privately communicated, feared executed, then persuaded king made Qi as anti spy, wished to chaos Qi.",
  "s0085": "Yi Wang established twelfth year died, son Yan Kuai established.",
  "s0086": "Yan Kuai already established, Qi people killed Su Qin.",
  "s0087": "Su Qin's in Yan, with his chancellor Zi Zhi married, Su Dai with Zi Zhi interacted.",
  "s0088": "To Su Qin died, Qi Xuan Wang again used Su Dai.",
  "s0089": "Yan Kuai third year, with Chu, three Jin attacked Qin, not win returned.",
  "s0090": "Zi Zhi chancellor Yan, noble heavy, main decided.",
  "s0091": "Su Dai as Qi envoy to Yan, Yan Wang asked: 'Qi Wang what like?'",
  "s0092": "Answered: 'Must not hegemon.'",
  "s0093": "Yan Wang said: 'Why?'",
  "s0094": "Answered: 'Not trust his ministers.'",
  "s0095": "Su Dai wished to stimulate Yan Wang to honor Zi Zhi.",
  "s0096": "Then Yan Wang greatly trusted Zi Zhi.",
  "s0097": "Zi Zhi because sent Su Dai hundred gold, listened his commanded.",
  "s0098": "Lu Mao Shou told Yan Wang: 'Not like with country yield chancellor Zi Zhi."
}
