{
  "s1065": "As guest followed uprising in Pei, became Grand Master of the Court, guarded Feng two years, attacked Ji, became Shangdang governor, Chen Xi rebelled, firmly defended, became marquis, 1,800 households. Later promoted to Grand Master of the Court.",
  "s1066": "Two. Year 11 month 2 Ding Hai day, Marquis Yi Ren Ao year 1.",
  "s1067": "Seven",
  "s1068": "Eight",
  "s1069": "Two. One. Year 3, Marquis Yi Jing year 1. Twenty. Year 4, Marquis Jing Dan year 1.",
  "s1070": "Sixteen",
  "s1071": "Four. Jianyuan year 5, Marquis Yue year 1. Twenty-one. Yuanding year 2, Marquis Yue convicted as Grand Master of Ceremonies temple wine sour, disrespectful, state abolished.",
  "s1072": "Eighty-nine",
  "s1073": "Xuchang.",
  "s1074": "As ye zhe Han King first year initially rose in Hanzhong, Yong army blocked Chen, appealed to superior, superior calculated wanted to return, Yan spoke from another road, road connected, later became Hexian governor, Chen Xi rebelled, executed commandery captain Xiangru, meritorious service led to marquisate, 1,400 households.",
  "s1075": "Two. Year 11 month 2 Ji You day, Marquis Zhen Zhao Yan year 1.",
  "s1076": "Seven",
  "s1077": "Eight",
  "s1078": "Fifteen. Four. Year 16, Marquis Dai Fu year 1. Four. After year 4, Marquis Bu Hai year 1.",
  "s1079": "Four. Year 5, Marquis Bu Hai committed crime, state abolished.",
  "s1081": "One hundred seven",
  "s1082": "Linyuan.",
  "s1083": "Initially rose as palace attendant, as commandery captain defended Qicheng, as Commandant became marquis, 500 households.",
  "s1084": "Two. Year 11 month 2 Yi You day, Marquis Jian Qi Sao year 1.",
  "s1085": "Four. Three. Year 5, Marquis Yi Chu Long year 1.",
  "s1086": "Eight",
  "s1087": "Twenty-three",
  "s1088": "Three. Thirteen. Year 4, Marquis Gong Zhong year 1.",
  "s1089": "Three. Jianyuan year 4, Marquis Xian year 1. Twenty-five. Yuanding year 5, Marquis Xian convicted of tribute gold, state abolished.",
  "s1090": "One hundred sixteen",
  "s1091": "Ji.",
  "s1092": "Gaozu year 6 became Grand Coachman, attacked Dai Xi, had merit, became marquis, 1,200 households. Became Zhao Grand Tutor.",
  "s1093": "Two. Year 11 month 2 Ji Si day, Marquis Zhong Gong Shang Bu Hai year 1.",
  "s1094": "One. Six. Year 2, Marquis Yi Wu year 1.",
  "s1095": "Eight",
  "s1096": "Thirteen. Ten. Year 14, Marquis Kang Tong year 1.",
  "s1097": "Sixteen",
  "s1098": "One. Nine. Jianyuan year 2, Marquis Guang De year 1. Yuanguang year 5, Guang De convicted wife Jing great rebellion crime, implicated Guang De, executed in market, state abolished.",
  "s1099": "One hundred twenty-three",
  "s1100": "Ningling.",
  "s1101": "As retainer followed Chenliu, as palace attendant entered Han, defeated Cao Jiu at Chenghao, as superior's follower cavalry, as commandery captain attacked Chen Xi, meritorious service led to marquisate, 1,000 households.",
  "s1102": "Two. Year 11 month 2 Xin Hai day, Marquis Yi Lü Chen year 1.",
  "s1103": "Seven",
  "s1104": "Eight",
  "s1105": "Ten. Thirteen. Year 11, Marquis Dai She year 1.",
  "s1106": "Three. Year 4, Marquis Hui Shi year 1. One. Year 5, Marquis Shi died, no heir, state abolished.",
  "s1108": "Seventy-three",
  "s1109": "Fenyang.",
  "s1110": "As palace attendant cavalry thousand men year 2 BCE followed uprising in Yangxia, attacked Xiang Yu, as Commandant defeated Zhongli Mei, meritorious service led to marquisate.",
  "s1111": "Two. Year 11 month 2 Xin Hai day, Marquis Jin Qiang year 1.",
  "s1112": "Seven",
  "s1113": "Two. Six. Year 3, Marquis Gong Xie year 1.",
  "s1114": "Twenty-three",
  "s1115": "Four. Twelve. Year 5, Marquis Kang Hu year 1. Extinct.",
  "s1116": "Jiang Zou nineteen. Yuanding year 5, Marquis Shi year 1. Taishi year 4 month 5 Ding Mao day, Marquis Shi convicted as Grand Master of Ceremonies, acting Grand Coachman affairs, treating se fu Ke Nian, increased Zong Nian, state abolished."
}
