{
  "s0501": "You Wang's second year, he attacked Wei.",
  "s0502": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0503": "Ai Wang's first year, he attacked Song.",
  "s0504": "Chen Zhen happened to be serving as Qin envoy to Qi, and the Qi king said: 'What should we do?'",
  "s0505": "Chen Zhen said: 'Your Majesty need not worry, please allow me to make them withdraw.'",
  "s0506": "He immediately went to see Zhao Yang in the army camp, saying: 'I wish to hear about Chu's laws - what rank is given to those who break armies and kill generals?'",
  "s0507": "Zhao Yang said: 'Their office becomes Upper Pillar State, sealed with upper nobility holding the jade tablet.'",
  "s0508": "Chen Zhen said: 'Is there anything more noble than this?'",
  "s0509": "Zhao Yang said: 'Prime Minister.'",
  "s0510": "Chen Zhen said: 'Now you have already become Prime Minister - this is the highest position in the state.",
  "s0511": "Allow me to give you a parable.",
  "s0512": "There was someone who left his servants a cup of wine. The servants said to each other: 'Several people drinking this would not be enough to go around, so let us draw a snake on the ground - the one who finishes the snake first will drink it alone.'",
  "s0513": "One man said: 'My snake is finished first.'",
  "s0514": "He picked up the wine and stood up, saying: 'I can add feet to it.'",
  "s0515": "When he came to add the feet, another person snatched the wine and drank it, saying: 'A snake has no feet - now that you've added feet, this is not a snake.'",
  "s0516": "Now you are Prime Minister of Chu attacking Wei, breaking their army and killing their general - no merit could be greater, the highest position cannot be added to.",
  "s0517": "Now if you shift troops to attack Qi, and if you attack Qi and win, your office and nobility will not be added to this;",
  "s0518": "if you attack but do not win, you will die and lose your nobility, bringing ruin to Chu - this is the story of adding feet to the snake.",
  "s0519": "It would be better to lead troops away and show virtue to Qi - this is the way to hold fullness.'",
  "s0520": "Zhao Yang said: 'Good.'",
  "s0521": "He led his troops away.",
  "s0522": "Yan and Han lords first proclaimed themselves kings.",
  "s0523": "Qin sent Zhang Yi to meet with Chu, Qi, and Wei, forming an alliance at Nie Sang.",
  "s0524": "In the eleventh year, Su Qin united the six states east of the mountains to attack Qin together, with Chu Hui Wang as the alliance leader.",
  "s0525": "They reached the Hangu Pass, Qin sent troops to attack the six states, and the six states' troops all retreated and returned, with Qi alone coming last.",
  "s0526": "In the twelfth year, Qi Min Wang attacked and defeated Zhao and Wei's armies, while Qin also attacked and defeated Han, contending with Qi for leadership.",
  "s0527": "In the sixteenth year, Qin wished to attack Qi, but Chu was allied with Qi, so Qin Hui Wang was troubled by this. He proclaimed that Zhang Yi was dismissed as prime minister, and sent Zhang Yi south to see the Chu king, telling him: 'What my king most delights in has no precedence over the Great King, and what I most wish to be is a gatekeeper for the Great King.",
  "s0528": "What my king most hates has no precedence over the Qi king, and what I most hate also has no precedence over the Qi king.",
  "s0529": "But the Great King is allied with him, which is why my king cannot serve the Great King, and I also cannot be a gatekeeper.",
  "s0530": "May the Great King close his gates and break with Qi for my sake. Now I will send envoys with me west to take the six hundred li of Shang Yu land that Qin divided from Chu, and give it back to you. Thus Qi will be weakened.",
  "s0531": "This weakens Qi to the north, shows favor to Qin in the west, and privately gets Shang Yu back for enrichment - this is one plan that achieves three benefits.'",
  "s0532": "Hui Wang was greatly pleased and placed the prime minister's seal on Zhang Yi, drinking with him daily, proclaiming 'I have regained my Shang Yu land.'",
  "s0533": "All the ministers congratulated him, but Chen Zhen alone mourned.",
  "s0534": "Hui Wang said: 'Why?'",
  "s0535": "Chen Zhen replied: 'What Qin values in the king is that he has Qi as an ally.",
  "s0536": "Now the land cannot be obtained but the Qi alliance is broken first - this isolates Chu.",
  "s0537": "Why would Qin value an isolated state? They will surely despise Chu.",
  "s0538": "Moreover, if we get the land first and then break with Qi, Qin's plan will not succeed.",
  "s0539": "If we break with Qi first and then demand the land, we will surely be deceived by Zhang Yi.",
  "s0540": "Being deceived by Zhang Yi, the king will surely resent him.",
  "s0541": "Resenting him means raising troubles with Qin in the west and breaking the alliance with Qi in the north.",
  "s0542": "Raising troubles with Qin in the west and breaking the alliance with Qi in the north means both states' armies will surely come.",
  "s0543": "Therefore I mourn.'",
  "s0544": "The Chu king would not listen, so he sent a general west to receive the sealed land.",
  "s0545": "Zhang Yi arrived in Qin, pretended to be drunk and fall from his chariot, claiming illness and not coming out for three months, so the land could not be obtained.",
  "s0546": "The Chu king said: 'Does Zhang Yi think breaking with Qi is still too little?'",
  "s0547": "So he sent the brave warrior Song Yi north to insult the Qi king.",
  "s0548": "The Qi king was greatly angered, broke the Chu alliance tablet, and allied with Qin.",
  "s0549": "Qin and Qi allied, then Zhang Yi rose from his sickbed to court, telling the Chu general: 'Why do you not receive the land?",
  "s0550": "From such-and-such to such-and-such, six li wide.'",
  "s0551": "The Chu general said: 'I was commanded to receive six hundred li, not six li.'",
  "s0552": "He returned and reported to Hui Wang.",
  "s0553": "Hui Wang was greatly angered and raised troops to attack Qin.",
  "s0554": "Zhang Yi said to Qin: 'Please give me a few days, I will get Chu to send troops to Han and Wei, then Qin can attack them.'",
  "s0555": "Zhang Yi went to see Hui Wang, saying: 'The land is already given to you, why attack Qin?'",
  "s0556": "Hui Wang said: 'I do not dare receive six li - I must receive the six hundred li.'",
  "s0557": "Zhang Yi said: 'You never lost six hundred li to Qin - how can you receive it? Qin gives you six li out of kindness.'",
  "s0558": "Hui Wang was angry and would not listen, sending troops to attack Qin, taking Qin land.",
  "s0559": "Then Qin sent troops to attack Chu, defeating them at Dan Yang, killing eight generals, taking fifteen cities, reaching Ying.",
  "s0560": "In the seventeenth year, Hui Wang died, and his son Qing Xiang Wang Zhang ascended the throne.",
  "s0561": "Qing Xiang Wang's first year, he attacked Song.",
  "s0562": "In the second year, he attacked Zheng.",
  "s0563": "In the fourth year, Qing Xiang Wang died, and his son You Wang Hao ascended the throne.",
  "s0564": "You Wang's first year, he attacked Wei.",
  "s0565": "In the third year, You Wang died, and his son Ai Wang Hao ascended the throne.",
  "s0566": "Ai Wang's first year, he attacked Wei.",
  "s0567": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0568": "Shen Wang's first year, he attacked Wei.",
  "s0569": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0570": "You Wang's first year, he attacked Wei.",
  "s0571": "In the second year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0572": "Ai Wang's first year, he attacked Song.",
  "s0573": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0574": "Shen Wang's first year, he attacked Song.",
  "s0575": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0576": "You Wang's first year, he attacked Wei.",
  "s0577": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0578": "Ai Wang's first year, he attacked Song.",
  "s0579": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0580": "Shen Wang's first year, he attacked Song.",
  "s0581": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0582": "You Wang's first year, he attacked Wei.",
  "s0583": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0584": "Ai Wang's first year, he attacked Song.",
  "s0585": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0586": "Shen Wang's first year, he attacked Song.",
  "s0587": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0588": "You Wang's first year, he attacked Wei.",
  "s0589": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0590": "Ai Wang's first year, he attacked Song.",
  "s0591": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0592": "Shen Wang's first year, he attacked Song.",
  "s0593": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0594": "You Wang's first year, he attacked Wei.",
  "s0595": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0596": "Ai Wang's first year, he attacked Song.",
  "s0597": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0598": "Shen Wang's first year, he attacked Song.",
  "s0599": "In the second year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0600": "You Wang's first year, he attacked Wei."
}
