{
  "s0100": "Marriage capping and hair-pinning, thus to distinguish male and female;",
  "s0101": "Archery village feasts, thus to correct intercourse.",
  "s0102": "Ritual moderates the people's hearts, music harmonizes the people's sounds, governance to carry it out, punishment to guard against it.",
  "s0103": "Ritual music punishment governance four reach without contradiction, then the kingly way is complete.",
  "s0104": "Music is for sameness, ritual is for difference.",
  "s0105": "Same then mutually intimate, different then mutually respectful.",
  "s0106": "Music prevails then flows, ritual prevails then separates.",
  "s0107": "Uniting feelings adorning appearance, is ritual music's affair.",
  "s0108": "Ritual righteousness established, then noble base equal;",
  "s0109": "Music culture same, then high low harmonize;",
  "s0110": "Likes dislikes manifest, then worthy unworthy distinguished;",
  "s0111": "Punishment prohibits violence, rank raises worthy, then governance even.",
  "s0112": "Benevolence to love them, righteousness to correct them, thus then people governance flows.",
  "s0113": "Music comes from within, ritual is made from without.",
  "s0114": "Music comes from within, thus quiet;",
  "s0115": "Ritual made from without, thus patterned.",
  "s0116": "Great music must be easy, great ritual must be simple.",
  "s0117": "Music reaches then no resentment, ritual reaches then no contention.",
  "s0118": "Yielding and deferring to govern the world, this is called ritual music.",
  "s0119": "Violent people do not arise, feudal lords submit as guests, weapons not tested, five punishments not used, hundred families without worry, Son of Heaven not angry, thus then music reaches completion.",
  "s0120": "Unites father son closeness, clarifies elder younger order, to respect within the four seas.",
  "s0121": "Son of Heaven thus, then ritual flows.",
  "s0122": "Great music with heaven earth same harmony, great ritual with heaven earth same measure.",
  "s0123": "Harmony, thus hundred things not lost;",
  "s0124": "Measure, thus sacrifice heaven worship earth.",
  "s0125": "Bright then has ritual music, dark then has ghosts spirits, thus within four seas united respect same love.",
  "s0126": "Ritual is different affairs united respect;",
  "s0127": "Music is different patterns united love.",
  "s0128": "Ritual music feelings same, thus enlightened kings mutually continue.",
  "s0129": "Thus affairs with time together, name with merit accompany.",
  "s0130": "Thus bells drums pipes chimes feathers yu shields axes, music's instruments;",
  "s0131": "Bend stretch bow rise levels ranks spread hurry, music's patterns.",
  "s0132": "Gui fu zu dou systems patterns, ritual's instruments;",
  "s0133": "Ascend descend high low circle turn bare wear, ritual's patterns.",
  "s0134": "Thus knowing ritual music feelings can create, recognizing ritual music patterns can explain.",
  "s0135": "Creator called sage, explainer called enlightened.",
  "s0136": "Enlightened sage is explainer creator called.",
  "s0137": "Music is heaven earth's harmony;",
  "s0138": "Ritual is heaven earth's order.",
  "s0139": "Harmony thus hundred things all transform;",
  "s0140": "Order thus group things all distinguished.",
  "s0141": "Music by heaven made, ritual by earth formed.",
  "s0142": "Exceed formation then chaos, exceed making then violent.",
  "s0143": "Clear about heaven earth, then can flourish ritual music.",
  "s0144": "Discuss principles without worry, music's feeling;",
  "s0145": "Joy happiness delight love, music's appearance.",
  "s0146": "Central correct without evil, ritual's substance;",
  "s0147": "Solemn respectful reverent yielding, ritual's system.",
  "s0148": "As for ritual music's application to metal stone, surpasses sounds, used at ancestral temple earth altar, serves mountain rivers ghosts spirits, then this is to unite with people.",
  "s0149": "Kings when merit complete make music, when governance settled establish ritual."
}
