{
  "s1407": "曹桓公終生 first year",
  "s1518": "蔡宣侯楷論 first year",
  "s1540": "JiaWu",
  "s1547": "宋宣公力 first year",
  "s1597": "陳桓公 first year",
  "s1700": "JiaChen",
  "s1756": "衛桓公完 first year",
  "s1815": "齊釐公祿父 first year",
  "s1851": "宋穆公和 first year",
  "s1857": "燕穆侯 first year",
  "s1860": "JiaYin",
  "s1989": "桓王 first year",
  "s1995": "宋殤公與夷 first year",
  "s2020": "JiaZi",
  "s2024": "晉哀侯光 first year",
  "s2057": "秦寧公 first year",
  "s2078": "蔡桓侯封人 first year",
  "s2145": "燕宣侯 first year",
  "s2152": "晉小子 first year",
  "s2180": "JiaXu",
  "s2200": "曲沃武公殺小子。周伐曲沃，立晉哀侯弟湣為晉侯。晉侯湣 first year",
  "s2205": "陳厲公他 first year",
  "s2249": "秦出子 first year",
  "s2287": "曹莊公射姑 first year",
  "s2304": "鄭厲公突 first year",
  "s2316": "衛惠公朔 first year",
  "s2340": "JiaShen",
  "s2353": "燕桓侯 first year",
  "s2364": "衛黔牟 first year",
  "s1392": "Fourteen, gave birth to Zhuang Gong Wu Sheng.",
  "s1401": "Ten, established Fan altar.",
  "s1437": "Chen Wen Gong Yu first year gave birth to Huan Gong Bao, Li Gong Ta. Ta's mother was Cai woman.",
  "s1440": "Seventeen, gave birth to younger brother Duan, mother wished to establish Duan, duke did not listen.",
  "s1531": "Eighteen, gave birth to Lu Huan Gong's mother.",
  "s1545": "Nineteen, established altar to Chen Bao.",
  "s1576": "Jin Zhao Hou first year enfeoffed father's younger brother Cheng Shi at Quwo, Quwo larger than the state, gentleman criticized saying: 'Jin disorder begins from Quwo.'",
  "s1581": "Ten, Wen Gong died.",
  "s1616": "Zheng Zhuang Gong Wu Sheng first year, Ji Zhong as chancellor.",
  "s1644": "Seventeen, favored concubine son Zhou Xu, Zhou Xu fond of war.",
  "s1658": "Wu Wang established.",
  "s1672": "Pan Fu killed Zhao Hou, brought in Cheng Shi, did not succeed. Zhao Hou's son established, this was Xiao Hou.",
  "s1740": "Twenty-three, consort had no sons, Huan Gong established.",
  "s1772": "Two, younger brother Zhou Xu arrogant, Huan deposed him, fled.",
  "s1800": "Nine, Quwo Huan Shu Cheng Shi died, son Dai established, became Zhuang Bo.",
  "s1831": "Two, same mother younger brother Yi Zhong Yan gave birth to Gong Sun Wu Zhi.",
  "s1835": "Nineteen, duke died, commanded to establish younger brother He as Duke Mu.",
  "s1912": "Sixteen, Quwo Zhuang Bo killed Xiao Hou, Jin people established Xiao Hou's son Que as E Hou.",
  "s1928": "Jin E Hou Que first year Quwo stronger than Jin.",
  "s1942": "Lu Yin Gong Xi Gu first year mother Sheng Zi.",
  "s1952": "Twenty-two, Duan rebelled, fled.",
  "s1968": "Twenty-three, duke regretted, thought of mother could not see her, dug tunnel to meet.",
  "s1974": "Three, second month, solar eclipse.",
  "s1979": "Nine, duke entrusted Kong Fu to establish Shang Gong. Feng fled to Zheng.",
  "s1984": "Twenty-four, invaded Zhou, took grain.",
  "s1996": "Sixteen, Zhou Xu assassinated duke self-established.",
  "s1997": "Twenty-six, Wei Shi Que came to announce, therefore seized Zhou Xu.",
  "s2005": "Two, sent Guo Gong to attack Jin's Quwo.",
  "s2006": "Five, duke viewed fish at Tang, gentleman criticized it.",
  "s2008": "Six, E Hou died. Quwo Zhuang Bo again attacked Jin. Established E Hou's son Guang as Ai Hou.",
  "s2011": "Two, Zheng attacked us. We attacked Zheng.",
  "s2012": "Wei Xuan Gong Jin first year jointly established him. Punished Zhou Xu.",
  "s2022": "Six, Zheng people came to change the peace.",
  "s2032": "Twenty-seven, first audience with king, king did not treat with courtesy.",
  "s2040": "Two, Zhuang Bo died, son Cheng established, became Wu Gong.",
  "s2054": "Eight, exchanged Xu fields, gentleman criticized it.",
  "s2064": "Twenty-nine, gave Beng to Lu, exchanged Xu fields.",
  "s2070": "Nine, third month, great hailstorm, thunder.",
  "s2091": "Seven, feudal lords defeated us. Our army with Wei people attacked Zheng.",
  "s2102": "Eleven, grandee Hui requested to kill Huan Gong, sought to be chancellor, duke did not listen, then killed duke.",
  "s2118": "Lu Huan Gong Yun first year mother Song Wu Gong's daughter, gave birth to Shou Wen as Lu consort.",
  "s2128": "Thirty-three, used jade to add to Lu, exchanged Xu fields.",
  "s2134": "Two, Song bribed with tripod, entered the grand temple, gentleman criticized it.",
  "s2139": "Hua Du saw Kong Fu's wife was beautiful, delighted with her. Hua Du killed Kong Fu, and killed Shang Gong. Song Gong Feng first year Hua Du as chancellor.",
  "s2150": "Three, Hui welcomed woman, Qi Hou sent woman, gentleman criticized it.",
  "s2181": "Thirteen, attacked Zheng.",
  "s2189": "Thirty-eight, younger brother Ta killed crown prince Mian. Replaced establishment, state in chaos, twice reported death.",
  "s2192": "Thirty-seven, attacked Zhou, wounded king.",
  "s2199": "Twenty-five, Shan Rong attacked us.",
  "s2202": "Thirty-five, invaded Sui, Sui practiced good governance, obtained cessation.",
  "s2208": "Thirty-eight, crown prince Hu rescued Qi, Qi would marry him.",
  "s2221": "Two, gave birth to Jing Zhong Wan. Zhou historian divined Wan's descendants would rule Qi.",
  "s2234": "Thirty-seven, attacked Sui, could not take it, but made alliance, withdrew troops.",
  "s2283": "Ten, seized Ji Zhong.",
  "s2284": "Eighteen, crown prince Ji and younger brother Shou contended to death.",
  "s2301": "Seven, duke debauched Cai, Cai killed duke.",
  "s2311": "Thirty-two, Li Gong ordered Wu Zhi ranked service as crown prince.",
  "s2317": "Chen Zhuang Gong Lin first year Huan Gong's son.",
  "s2329": "Six, three fathers killed Chu Zi, established his elder brother Wu Gong.",
  "s2336": "Three, feudal lords attacked us, avenged Song matter.",
  "s2342": "Fifteen, heavenly king demanded carriages, not ritual.",
  "s2343": "Qi Xiang Gong Zhu Er first year demoted Wu Zhi's ranked service, Wu Zhi resentful.",
  "s2345": "Qin Wu Gong first year attacked Peng, reached Hua Mountain.",
  "s2348": "Three, Shuo fled to Qi, established Qian Mu.",
  "s2352": "Four, Ji Zhong established Hu, duke went out to reside at Li.",
  "s2357": "Zhuang Wang first year gave birth to son Kui.",
  "s2358": "Sixteen, duke met Cao, planned to attack Zheng.",
  "s2368": "Zheng Zhao Gong Hu first year Hu's mother Deng woman, Ji Zhong took her.",
  "s2373": "Two, had younger brother Ke.",
  "s2374": "Seventeen, solar eclipse, did not record the day, officials lost it.",
  "s2384": "Two, Qu Mi killed Zhao Gong."
}
