{
  "s0247": "Twenty-four years, Jin Wen Gong ascended position.",
  "s0248": "Thirty-three years, Xi Gong died, son Xing established, this was Wen Gong.",
  "s0249": "Wen Gong first year, Chu crown prince Shang Chen assassinated his father Cheng Wang, replaced established.",
  "s0250": "Third year, Wen Gong court Jin Xiang Fu.",
  "s0251": "Eleven years tenth month Jia Wu, Lu defeated Di at Xian, obtained long Di Qiao Ru, Fu Fu Zhong Sheng thrust his throat, with spear killed him, buried his head at Zi Ju gate, to command Xuan Bo.",
  "s0252": "Initially, Song Wu Gong time, Kuai Man attacked Song, Si Tu Huang Fu led troops resisted it, with defeated Di at Chang Qiu, obtained long Di Yuan Si.",
  "s0253": "Jin's extinguished Lu, obtained Qiao Ru younger brother Fen Ru.",
  "s0254": "Qi Hui Gong second year, Kuai Man attacked Qi, Qi Wang Zi Cheng Fu obtained his younger brother Rong Ru, buried his head at north gate.",
  "s0255": "Wei people obtained his youngest younger brother Jian Ru.",
  "s0256": "Kuai Man from this then perished.",
  "s0257": "Fifteen years, Ji Wen Zi sent to Jin.",
  "s0258": "Eighteen years second month, Wen Gong died.",
  "s0259": "Wen Gong had two wives: eldest wife Qi woman called Ai Jiang, gave birth sons Wu and Shi;",
  "s0260": "second wife Jing Ying, favored loved, gave birth son Chou.",
  "s0261": "Chou privately served Xiang Zhong, Xiang Zhong wished establish him, Shu Zhong said cannot.",
  "s0262": "Xiang Zhong requested Qi Hui Gong, Hui Gong newly established, wished close Lu, permitted it.",
  "s0263": "Winter tenth month, Xiang Zhong killed Zi Wu and Shi established Chou, this was Xuan Gong.",
  "s0264": "Ai Jiang returned Qi, cried passed market, said: 'Heaven!",
  "s0265": "Xiang Zhong does not follow way, kills proper establishes secondary!'",
  "s0266": "Market people all cried, Lu people called her 'Ai Jiang'.",
  "s0267": "Lu from this gong chamber lowly, three Huan strong.",
  "s0268": "Xuan Gong Chou twelve years, Chu Zhuang Wang strong, surrounded Zheng.",
  "s0269": "Zheng Bo surrendered, restored his state.",
  "s0270": "Eighteen years, Xuan Gong died, son Cheng Gong Hei Gong established, this was Cheng Gong.",
  "s0271": "Ji Wen Zi said: 'Made me kill proper establish secondary lose great support, Xiang Zhong.'",
  "s0272": "Xiang Zhong established Xuan Gong, Gong Sun Gui Fu had favor.",
  "s0273": "Xuan Gong wished remove three Huan, with Jin plotted attack three Huan.",
  "s0274": "Met Xuan Gong died, Ji Wen Zi resented it, Gui Fu fled Qi.",
  "s0275": "Cheng Gong second year spring, Qi attacked took our Long.",
  "s0276": "Summer, duke with Jin Xi Ke defeated Qi Qing Gong at Ai, Qi returned our invaded land.",
  "s0277": "Fourth year, Cheng Gong went to Jin, Jin Jing Gong not respected Lu.",
  "s0278": "Lu wished break Jin unite with Chu, someone advised, then not.",
  "s0279": "Tenth year, Cheng Gong went to Jin.",
  "s0280": "Jin Jing Gong died, because detained Cheng Gong send funeral, Lu avoided it.",
  "s0281": "Fifteenth year, began with Wu Wang Shou Meng assembled Zhong Li.",
  "s0282": "Sixteenth year, Xuan Bo informed Jin, wished execute Ji Wen Zi.",
  "s0283": "Wen Zi had righteousness, Jin people not permitted.",
  "s0284": "Eighteenth year, Cheng Gong died, son Wu established, this was Xiang Gong.",
  "s0285": "At this time Xiang Gong three years.",
  "s0286": "Xiang Gong first year, Jin established Dao Gong.",
  "s0287": "Previous year winter, Jin Luan Shu assassinated their lord Li Gong.",
  "s0288": "Fourth year, Xiang Gong court Jin.",
  "s0289": "Fifth year, Ji Wen Zi died.",
  "s0290": "Family no silk cloth concubines, stable no grain eating horses, office no gold jade, to assist three lords.",
  "s0291": "Gentlemen said: 'Ji Wen Zi incorrupt loyal.'",
  "s0293": "Ninth year, with Jin attacked Zheng.",
  "s0294": "Jin Dao Gong capped Xiang Gong at Wei, Ji Wu Zi followed, assisted performed rites.",
  "s0295": "Eleventh year, three Huan families divided into three armies."
}
