{
  "s0254": "Previously, Xiang Gong wife wished communicate with gong zi Bao, not able, then helped him exert in country, because grand master Hua Yuan as right teacher.",
  "s0255": "Zhao Gong exited hunt, wife Wang Ji sent Wei Bo attack kill Zhao Gong Chu Jiu.",
  "s0256": "Younger brother Bao Ge established, this was Wen Gong.",
  "s0257": "Wen Gong first year, Jin led feudal lords attacked Song, blamed with assassinate lord.",
  "s0258": "Heard Wen Gong settled established, then left.",
  "s0259": "Second year, Zhao Gong son because Wen Gong mother younger brother Xu with Wu, Mu, Dai, Zhuang, Huan clans made disorder, Wen Gong completely executed them, exited Wu, Mu clans.",
  "s0260": "Fourth year spring, Zheng commanded Zheng attacked Song.",
  "s0261": "Song sent Hua Yuan lead, Zheng defeated Song, imprisoned Hua Yuan.",
  "s0262": "Hua Yuan about battle, killed sheep to feed scholars, his driver sheep soup not obtain, so resented, galloped entered Zheng army, so Song army defeated, obtained imprisoned Hua Yuan.",
  "s0263": "Song with war chariots hundred rode decorated horses four hundred pairs redeemed Hua Yuan.",
  "s0264": "Not completely entered, Hua Yuan fled returned Song.",
  "s0265": "Fourteenth year, Chu Zhuang Wang surrounded Zheng.",
  "s0266": "Zheng Bo surrendered Chu, Chu again released him.",
  "s0267": "Sixteenth year, Chu envoy passed Song, Song had previous enmity, seized Chu envoy.",
  "s0268": "Ninth month, Chu Zhuang Wang surrounded Song.",
  "s0269": "Seventeenth year, Chu with surround Song five months not resolved, Song city middle urgent, no food, Hua Yuan then night privately saw Chu general Zi Fan.",
  "s0270": "Zi Fan informed Zhuang Wang.",
  "s0271": "Wang asked: 'City middle what like?'",
  "s0272": "Said: 'Split bones cook, exchange sons eat.'",
  "s0273": "Zhuang Wang said: 'Truly words!",
  "s0274": "My army also has two days grain.'",
  "s0275": "With trust reason, then stopped troops left.",
  "s0276": "Twenty-second year, Wen Gong died, son Gong Gong Xia established.",
  "s0277": "Began thick burial.",
  "s0278": "Jun Zi criticized Hua Yuan not minister.",
  "s0279": "Gong Gong tenth year, Hua Yuan friendly Chu general Zi Chong, also friendly Jin general Luan Shu, both allied Jin Chu.",
  "s0280": "Thirteenth year, Gong Gong died.",
  "s0281": "Hua Yuan as right teacher, Yu Shi as left teacher.",
  "s0282": "Commander Tang Shan attacked killed crown prince Fei, wished kill Hua Yuan, Hua Yuan fled Jin, Yu Shi stopped him, to river then returned, executed Tang Shan.",
  "s0283": "Then established Gong Gong young son Cheng, this was Ping Gong.",
  "s0284": "Ping Gong third year, Chu Gong Wang pulled Song's Peng Cheng, to enfeoff left teacher Yu Shi.",
  "s0285": "Fourth year, feudal lords together executed Yu Shi, returned Peng Cheng to Song.",
  "s0286": "Thirty-fifth year, Chu gong zi Wei assassinated his lord self established, became Ling Wang.",
  "s0287": "Forty-fourth year, Ping Gong died, son Yuan Gong Zuo established.",
  "s0288": "Yuan Gong third year, Chu gong zi Qi Ji assassinated Ling Wang, self established as Ping Wang.",
  "s0289": "Eighth year, Song fire.",
  "s0290": "Tenth year, Yuan Gong Wu Xin, falsely killed various gong zi, grand master Hua, Xiang clans made disorder.",
  "s0291": "Chu Ping Wang crown prince Jian came fled, saw various Hua clans mutually attacked disorder, Jian left went Zheng.",
  "s0292": "Fifteenth year, Yuan Gong for Lu Zhao Gong avoided Ji clan resided outside, for him sought enter Lu, traveling road died, son Jing Gong Tou Man established.",
  "s0293": "Jing Gong sixteenth year, Lu Yang Hu came fled, already again left.",
  "s0294": "Twenty-fifth year, Kong Qiu passed Song, Song commander Huan Kui hated him, wished kill Kong Qiu, Kong Qiu disguised clothes left.",
  "s0295": "Thirtieth year, Cao betrayed Song, again betrayed Jin, Song attacked Cao, Jin not save, then extinguished Cao possessed it.",
  "s0296": "Thirty-sixth year, Qi Tian Chang assassinated Jian Gong.",
  "s0297": "Thirty-seventh year, Chu Hui Wang extinguished Chen.",
  "s0298": "Ying Huo guarded Xin.",
  "s0299": "Xin, Song's field division.",
  "s0300": "Jing Gong worried it.",
  "s0301": "Commander star Zi Wei said: 'Can move to chancellor.'",
  "s0302": "Jing Gong said: 'Chancellor, my limbs.'",
  "s0303": "Said: 'Can move to people.'",
  "s0304": "Jing Gong said: 'Lord waits people.'",
  "s0305": "Said: 'Can move to year.'",
  "s0306": "Jing Gong said: 'Year famine people distressed, I who for lord!'",
  "s0307": "Zi Wei said: 'Heaven high hears low.",
  "s0308": "Lord has lord people's words three, Ying Huo should have movement.'",
  "s0309": "Then awaited it, indeed moved three degrees.",
  "s0310": "Sixty-fourth year, Jing Gong died.",
  "s0311": "Song gong zi Te attacked killed crown prince self established, this was Zhao Gong.",
  "s0312": "Zhao Gong, Yuan Gong's great grandson concubine born.",
  "s0313": "Zhao Gong father Gong Sun Jiu, Jiu father gong zi Chu Qin, Chu Qin namely Yuan Gong young son.",
  "s0314": "Jing Gong killed Zhao Gong father Jiu, so Zhao Gong resented killed crown prince self established.",
  "s0315": "Zhao Gong forty-seventh year died, son Dao Gong Gou You established.",
  "s0316": "Dao Gong eighth year died, son Xiu Gong Tian established.",
  "s0317": "Xiu Gong Tian twenty-third year died, son Pi Gong Pi Bing established.",
  "s0318": "Pi Gong third year died, son Ti Cheng established.",
  "s0319": "Ti Cheng forty-first year, Ti Cheng younger brother Yan attacked raided Ti Cheng, Ti Cheng defeated fled Qi, Yan self established as Song lord.",
  "s0320": "Lord Yan eleventh year, self established as wang.",
  "s0321": "East defeated Qi, took five cities;",
  "s0322": "south defeated Chu, took land three hundred li;",
  "s0323": "west defeated Wei army, then with Qi, Wei became enemy countries.",
  "s0324": "Filled blood with leather bag, hung shot it, named 'shoot heaven'.",
  "s0325": "Lewd in wine women.",
  "s0326": "Group ministers advised then shot them.",
  "s0327": "Then feudal lords all said 'Jie Song'.",
  "s0328": "'Song will again do Zhou's deeds, not able not execute.'",
  "s0329": "Informed Qi attack Song.",
  "s0330": "Wang Yan established forty-seventh year, Qi Min Wang with Wei, Chu attacked Song, killed wang Yan, then extinguished Song divided its land three ways.",
  "s0331": "Grand Historian said: Kong Qiu called 'Wei Zi left it, Ji Zi became slave for it, Bi Gan advised died, Yin had three benevolent'.",
  "s0332": "Spring Autumn criticized Song's disorder from Xuan Gong abandoned crown prince established younger brother, country with not peaceful ten generations.",
  "s0333": "Xiang Gong's time, practiced cultivated benevolence righteousness, wished become alliance lord.",
  "s0334": "His grand master Zheng Kao Fu praised it, so traced way Qi, Tang, Gao Zong, Yin so rose, made Shang Song.",
  "s0335": "Xiang Gong already defeated at Hong, but Jun Zi some thought many, injured Chinese lack ritual righteousness, praised him, Song Xiang's had ritual yielding."
}
