{
  "s4733": "Twenty-one, Zheng attacked us.",
  "s4736": "Eighteen, attacked Chen, entered Chen.",
  "s4737": "First year of Duke Yi of Yan",
  "s4738": "Thirteen, Zhu Fan attacked Chu, pressed Nest Gate, injured by arrow died.",
  "s4740": "Jia Yin",
  "s4743": "First year of Qi Duke Jing (Chu Jiu), went to Jin, requested return Wei Duke Xian.",
  "s4744": "Eleven, executed Wei Duke Shang, re-entered Duke Xian.",
  "s4746": "Thirteen, led Chen, Cai attacked Zheng.",
  "s4748": "Twelve, Qi, Jin executed Duke Shang, re-entered Duke Xian.",
  "s4749": "Twenty-two, Chu led us to attack Zheng.",
  "s4752": "Nineteen, Chu led Chen, Cai to attack us.",
  "s4754": "First year of Wu Yu Ji",
  "s4758": "Twenty-seven, solar eclipse.",
  "s4759": "Two, Qing Feng wished monopoly, executed Cui clan, Zhu committed suicide.",
  "s4764": "First year of Wei Duke Xian (Kan) later",
  "s4774": "Twenty-eight, duke went to Chu. Buried King Kang.",
  "s4775": "Three, winter, Bao, Gao, Luan clans plotted against Qing Feng, sent troops attacked Qing Feng, Qing Feng fled to Wu.",
  "s4778": "Fifteen, King Kang died.",
  "s4785": "Four, Duke Yi died.",
  "s4786": "Three, Qi Qing Feng came fleeing.",
  "s4789": "First year of King Jing",
  "s4790": "Twenty-nine, Wu Ji Zha came to observe Zhou music, knew all music meanings.",
  "s4791": "Four, Wu Ji Zha came as envoy, happy with Yan Ying.",
  "s4792": "Fourteen, Wu Ji Zha came, said 'Jin government finally belongs to Han, Wei, Zhao.'",
  "s4794": "First year of Chu Xiong Ju Ao",
  "s4800": "Twenty-two, Wu Ji Zha told Zi Chan: 'Government will belong to you, if you use ritual, fortunately escape calamity.'",
  "s4801": "First year of Duke Hui of Yan, Qi Gao Zhi came fleeing.",
  "s4802": "Four, gatekeeper assassinated Yu Ji. Ji Zha made feudal lords.",
  "s4812": "First year of Duke Xiang of Wei (Wu)",
  "s4814": "Forty-nine, took Chu woman for crown prince, duke seduced her, crown prince assassinated duke self-established.",
  "s4816": "Twenty-three, various princes contended for favor killed each other, also wished to kill Zi Chan, Zi Cheng stopped them.",
  "s4822": "Thirty-one, Duke Xiang died.",
  "s4826": "Three, Wang Ji Fu became Ling Yin.",
  "s4830": "First year of Duke Ling of Cai (Ban)",
  "s4838": "First year of Duke Zhao of Lu (Chou), Duke Zhao age nineteen, had childish heart.",
  "s4840": "Seventeen, Qin Hou Zi came fleeing.",
  "s4841": "Thirty-six, duke's younger brother Hou Zi fled to Jin, thousand chariots.",
  "s4842": "Four, Ling Yin Wei assassinated Ju Ao, self-established as King Ling.",
  "s5238": "Twenty-six, Qi took our Yun to place duke.",
  "s5239": "Thirty-two, comet appeared. Yan Ying said: 'Tian clan has virtue in Qi, fearful.'",
  "s5452": "Thirty-two, Qi invaded us.",
  "s5462": "Eight, Yang Hu wished to attack three Huan, three Huan attacked Yang Hu, Hu fled Yang Pass.",
  "s5463": "Forty-six, Lu attacked us. We attacked Lu.",
  "s5464": "Ten, attacked Wei.",
  "s5466": "Fourteen, Zi Xi wept for people, people also wept, Cai Duke Zhao feared.",
  "s5468": "Thirty-three, Jin, Lu invaded attacked us.",
  "s5469": "Four, duke went to Wu, Wu detained him, died in Wu.",
  "s5471": "Four, Duke Jing died.",
  "s5474": "Thirteen, Chen Duke Huai came, detained him, died in Wu."
}
