{
  "s0001": {
    "literal": "From the creation of writing, the early people who can be heard of, as the classics and traditions call them, from Tang and Yu upward, the emperors and kings have posthumous names.",
    "idiomatic": "From the invention of writing, the earliest people we can know about—as mentioned in the classics and transmitted records—from the time of Yao and Shun and earlier, emperors and kings had posthumous names."
  },
  "s0002": {
    "literal": "Their assistants cannot be named, but the various philosophers speak of them somewhat, although they do not examine according to Confucius, yet they are still recorded in writings, aiming to praise good and expose evil, to admonish and warn later generations, therefore I broadly collect them.",
    "idiomatic": "Their ministers and advisors cannot be specifically named, but the various philosophical schools discuss them to some extent. Though they don't follow Confucius's evaluations, these accounts are still preserved in the writings, serving to praise virtue and expose vice, to admonish and warn future generations. Therefore, I have gathered them broadly."
  },
  "s0003": {
    "literal": "Confucius said: 'As for sage and benevolence, how would I dare claim them?'",
    "idiomatic": "Confucius said: 'As for sagehood and benevolence, how would I dare claim such things?'"
  },
  "s0004": {
    "literal": "He also said: 'What is there to do with benevolence? Sagehood must be the highest!'",
    "idiomatic": "He also said: 'What is the point of mere benevolence? Sagehood must be the ultimate goal!'"
  },
  "s0005": {
    "literal": "'If one does not know, how can one be benevolent?'",
    "idiomatic": "'If someone lacks knowledge, how can they be benevolent?'"
  },
  "s0006": {
    "literal": "'Those who are born with knowledge are the highest;",
    "idiomatic": "'Those who are born with innate knowledge are the highest type;"
  },
  "s0007": {
    "literal": "those who learn and attain it are next;",
    "idiomatic": "those who study and achieve it are next;"
  },
  "s0008": {
    "literal": "those who learn despite difficulties and attain it are again next;",
    "idiomatic": "those who struggle to learn and achieve it are next again;"
  },
  "s0009": {
    "literal": "the common people who do not learn are the lowest.'",
    "idiomatic": "and the common people who never learn are the lowest.'"
  },
  "s0010": {
    "literal": "「聖人吾不得而見之矣；得見君子者，斯可矣。」",
    "idiomatic": "'I cannot hope to see a sage; to see a gentleman would be enough.'"
  },
  "s0011": {
    "literal": "「聖人，吾不得而見之矣；得見君子者，斯可矣。」",
    "idiomatic": "'A sage I cannot hope to see; to see a gentleman would be sufficient.'"
  },
  "s0012": {
    "literal": "「生而知之者，上也；學而知之者，次也；困而學之者，又其次也；困而不學，民斯為下矣。」",
    "idiomatic": "'Those who know from birth are highest; those who learn and know are next; those who struggle and learn are next after that; those who are in difficulty but don't learn—these are the lowest of the people.'"
  },
  "s0013": {
    "literal": "「子在齊聞韶，三月不知肉味，曰：『不圖為樂之至于斯也。』」",
    "idiomatic": "'When the Master was in Qi and heard the Shao music, for three months he didn't notice the taste of meat. He said, \"I never imagined that music could reach such heights.\"'"
  },
  "s0014": {
    "literal": "「志士仁人，無求生以害仁，有殺身以成仁。」",
    "idiomatic": "'A person of resolve and benevolence does not preserve life at the expense of benevolence, but rather sacrifices life to achieve benevolence.'"
  },
  "s0015": {
    "literal": "「朝聞道，夕死可矣。」",
    "idiomatic": "'If I hear the Way in the morning, I can die in the evening with no regrets.'"
  },
  "s0016": {
    "literal": "「智者不惑，仁者不憂，勇者不懼。」",
    "idiomatic": "'The wise are not confused, the benevolent are not worried, the brave are not afraid.'"
  },
  "s0017": {
    "literal": "「見賢思齊焉，見不賢而内自省也。」",
    "idiomatic": "'When seeing the virtuous, think of emulating them; when seeing the unvirtuous, examine yourself inwardly.'"
  },
  "s0018": {
    "literal": "「德之不修，學之不講，聞義不能徙，不善不能改，是吾憂也。」",
    "idiomatic": "'Not cultivating virtue, not discussing learning, hearing of righteousness but not moving toward it, having faults but not correcting them—these are my worries.'"
  },
  "s0019": {
    "literal": "「己所不欲，勿施於人。」",
    "idiomatic": "'Do not do to others what you do not want done to yourself.'"
  },
  "s0020": {
    "literal": "「君子欲訥於言而敏於行。」",
    "idiomatic": "'The gentleman wishes to be slow in speech but quick in action.'"
  },
  "s0021": {
    "literal": "「質勝文則野，文勝質則史。文質彬彬，然後君子。」",
    "idiomatic": "'If substance outweighs refinement, one becomes rustic; if refinement outweighs substance, one becomes pedantic. When substance and refinement are properly balanced, then one is a gentleman.'"
  },
  "s0022": {
    "literal": "「知之者不如好之者，好之者不如樂之者。」",
    "idiomatic": "'Those who know it are not as good as those who love it; those who love it are not as good as those who take joy in it.'"
  },
  "s0023": {
    "literal": "「歲寒，然後知松柏之後彫也。」",
    "idiomatic": "'It is only in the depth of winter that one knows the pine and cypress are the last to lose their leaves.'"
  },
  "s0024": {
    "literal": "「可與共學，未可與適道；可與適道，未可與立；可與立，未可與權。」",
    "idiomatic": "'Some can study together with you, but not pursue the Way; some can pursue the Way, but not stand firm; some can stand firm, but not adapt with wisdom.'"
  },
  "s0025": {
    "literal": "「不患人之不己知，患不知人也。」",
    "idiomatic": "'Do not worry that others do not know you; worry that you do not know others.'"
  }
}
