{
  "s0398": "Black circle horns, worry, has water affairs;",
  "s0499": "Rabbit seven names, called Xiao Zheng, Chen Xing, Tian Chan, An Zhou Xing, Xi Shuang, Neng Xing, Gou Xing.",
  "s0500": "Its color yellow and small, out and easy place, all under heaven culture changes and not good.",
  "s0501": "Rabbit five colors, blue circle worry, white circle mourning, red circle middle not peaceful, black circle auspicious.",
  "s0502": "Red horns offend my city, yellow horns land dispute, white horns crying calling sound.",
  "s0503": "Its out eastern, goes four lodges forty eight days, its number twenty days, then returns enters at eastern;",
  "s0504": "Its out western, goes four lodges forty eight days, its number twenty days, then returns enters at western.",
  "s0505": "Its one waits Ying Shi, Jue, Bi, Ji, Liu.",
  "s0506": "Out Fang Xin between, earth moves.",
  "s0507": "Chen Xing color: spring, blue yellow;",
  "s0508": "Summer, red white;",
  "s0509": "Autumn, blue white, and year ripe;",
  "s0510": "Winter, yellow and not bright.",
  "s0511": "If changes its color, its time not prosperous.",
  "s0512": "Spring not see, great wind, autumn then not real.",
  "s0513": "Summer not see, has sixty days drought, month eclipse.",
  "s0514": "Autumn not see, has troops, spring then not born.",
  "s0515": "Winter not see, yin rain sixty days, has flowing cities, summer then not grow.",
  "s0516": "Jue Kang Di, Yan Zhou.",
  "s0517": "Fang Xin, Yu Zhou.",
  "s0518": "Wei Ji, You Zhou.",
  "s0519": "Dou, Jiang Hu.",
  "s0520": "Qian Niu Wu Nu, Yang Zhou.",
  "s0521": "Xu Wei, Qing Zhou.",
  "s0522": "Ying Shi to Dong Bi, Bing Zhou.",
  "s0523": "Kui Lou Wei, Xu Zhou.",
  "s0524": "Mao Bi, Ji Zhou.",
  "s0525": "Zi Xi Shen, Yi Zhou.",
  "s0526": "Dong Jing Yu Gui, Yong Zhou.",
  "s0527": "Liu Seven Stars Zhang, three He.",
  "s0528": "Yi Zhen, Jing Zhou.",
  "s0529": "Seven Stars for round official, Chen Xing temple, barbarian Yi star.",
  "s0530": "Two armies oppose, sun halo;",
  "s0531": "Halo equal, strength balanced;",
  "s0532": "Thick long great, has victory;",
  "s0533": "Thin short small, no victory.",
  "s0534": "Heavy embrace great defeat none.",
  "s0535": "Embrace for harmonious, back for not harmonious, for separate depart.",
  "s0536": "Straight for self establish, establish marquises kings;",
  "s0537": "Broken army kill general.",
  "s0538": "Negative and carry, has joy.",
  "s0539": "Surround in middle, middle victorious;",
  "s0540": "In outside, outside victorious.",
  "s0541": "Blue outer red middle, with harmony depart;",
  "s0542": "Red outer blue middle, with evil depart.",
  "s0543": "Qi halo first arrives then goes, garrison army victorious.",
  "s0544": "First arrives first goes, front beneficial back ill;",
  "s0545": "Later arrives later goes, front ill back beneficial;",
  "s0546": "Later arrives first goes, front back all ill, garrison army not victorious.",
  "s0547": "Appears then goes, its send urgent, though victorious no merit.",
  "s0548": "Appears half day above, merit great.",
  "s0549": "White rainbow bent short, top bottom Dui, has below great flow blood.",
  "s0550": "Sun halo determines victory, near period thirty days, far period sixty days.",
  "s0551": "Its eclipse, eclipse place unfavorable;",
  "s0552": "Again born, born place beneficial;",
  "s0553": "And eclipse increasingly exhausted, for lord position.",
  "s0554": "With its straight and sun lodges, add sun time, use determine its state.",
  "s0555": "Moon goes middle path, peaceful harmonious.",
  "s0556": "Yin between, much water, yin affairs.",
  "s0557": "Outer north three chi, yin star.",
  "s0558": "North three chi, great yin, great floods, troops.",
  "s0559": "Yang between, arrogant unrestrained.",
  "s0560": "Yang star, much violent prisons.",
  "s0561": "Great yang, great drought mourning.",
  "s0562": "Horns heaven gate, tenth month for fourth month, eleventh month for fifth month, twelfth month for sixth month, water sends, near three chi, far five chi.",
  "s0563": "Offends four assistants, assistant ministers execute.",
  "s0564": "Goes north south rivers, with yin yang speak, drought floods troops mourning.",
  "s0565": "Moon eclipses year star, its lodge land, famine if perishes.",
  "s0566": "Ying Huo chaos, Tian Xing down offends up, Tai Bai strong state with battle defeated, Chen Xing female chaos.",
  "s0567": "Eclipse great horns, governs fate bad it;",
  "s0568": "Xin, then for inner traitor chaos;",
  "s0569": "Column stars, its lodge land worry.",
  "s0570": "Month eclipse begins day, five months six, six months five, five months again six, six months one, and five months five, generally hundred thirteen months then returns begins.",
  "s0571": "Thus month eclipse, constant;",
  "s0572": "Sun eclipse, for not good.",
  "s0573": "Jia Yi, four seas outside, sun moon not divine.",
  "s0574": "Bing Ding, Jiang Huai Hai Dai.",
  "s0575": "Wu Ji, central states He Ji.",
  "s0576": "Geng Xin, Hua Shan west.",
  "s0577": "Ren Gui, Heng Shan north.",
  "s0578": "Sun eclipse, state lord;",
  "s0579": "Month eclipse, general oppose it.",
  "s0580": "Bright morning star, great and white, no horns, suddenly up suddenly down.",
  "s0581": "Where out state, raise troops, much change.",
  "s0582": "Five remnant stars, out precisely east eastern wild.",
  "s0583": "Its star shape resembles Chen Xing, from ground can six zhang.",
  "s0584": "Great thief star, out precisely south southern wild.",
  "s0585": "Star from ground can six zhang, great and red, several moves, has light.",
  "s0586": "Si Wei star, out precisely west western wild.",
  "s0587": "Star from ground can six zhang, great and white, resembles Tai Bai.",
  "s0588": "Yu Han star, out precisely north northern wild.",
  "s0589": "Star from ground can six zhang, great and red, several moves, examine middle blue.",
  "s0590": "This four wild stars where out, out not its direction, its below has troops, conflict unfavorable.",
  "s0591": "Four Tian stars, where out four corners, from ground can four zhang.",
  "s0592": "Earth dimension Xian Guang, also out four corners, from ground can three zhang, like month begins out.",
  "s0593": "Where appears, below has chaos;",
  "s0594": "Chaos perish, has virtue prosper.",
  "s0595": "Candle star, shape like Tai Bai, its out not goes.",
  "s0596": "Appears then extinguishes.",
  "s0597": "Where illuminates, city towns chaos."
}
