{
  "s0001": "The Grand Historian says: The records of the Five Emperors and Three Dynasties are already ancient.",
  "s0002": "Before the Yin dynasty, the lords cannot be properly genealogized; from the Zhou onward, they can be quite clearly recorded.",
  "s0003": "Confucius arranged the Spring and Autumn Annals based on historical documents, recording the first year, correcting the times, days, and months—how detailed they are!",
  "s0004": "As for the Book of Documents, it is brief, without years or months;",
  "s0005": "Some have them to some extent, but many are missing, so they cannot be recorded.",
  "s0006": "Therefore, where there is doubt, transmit the doubt—this shows his caution.",
  "s0007": "I have read the secret records, and from the Yellow Emperor onward, all have dates.",
  "s0008": "Examining the chronological genealogies and records of the transmission of the Five Virtues from beginning to end, the ancient texts all differ and contradict each other.",
  "s0009": "The Master's not arranging their years and months—was it in vain?",
  "s0010": "Therefore I have made genealogical records of the Five Emperors, collected the centuries of the Book of Documents, from the Yellow Emperor to the Gonghe period, as chronological tables.",
  "s0011": "King Kang Zhao, punishment weapons stored away for forty years.",
  "s0012": "Duke Boqin of Lu, Duke Ding Lü Ji of Lu, Marquis Xie of Jin, Nüfang, Xiong Yi, Wei Zhong (Qi brother's younger brother).",
  "s0013": "Kang Bo, Shen Gong, Cai Zhong, nine generations to Marquis Hui.",
  "s0014": "King Zhao Xia went on a southern tour and did not return.",
  "s0015": "Did not arrive, so it was tabooed.",
  "s0016": "Duke Kao, Duke Yi, Marquis Wu, Pang Gao, Xiong Yuan, Duke of Song, Xiao Bo, Duke Xiang, Cai Bo, Tai Bo",
  "s0017": "King Mu Man.",
  "s0018": "Made the Punishments of Fu.",
  "s0019": "The remote regions did not come.",
  "s0020": "Duke Yang, younger brother of Duke Kao.",
  "s0021": "Duke Gui, Marquis Cheng, Da Ji, Xiong Sheng, Duke Ding, Si Bo, Duke Xiao, Gong Hou, Zhong Jun",
  "s0022": "King Gong Yi Hu, Duke You, Duke Ai, Marquis Li, Da Luo, Xiong Yang, Duke Min (younger brother of Duke Ding).",
  "s0023": "Zhe Bo, Duke Shen, Marquis Li, Gong Bo",
  "s0024": "King Yi Jian.",
  "s0025": "The Zhou way declined, poets made satires.",
  "s0026": "Duke Wei, Duke Hu, Marquis Jing, Fei Zi, Xiong Qu, Duke Yang (younger brother of Duke Min).",
  "s0027": "Jing Bo, Duke You, Marquis Wu, Xiao Bo",
  "s0028": "King Yi Xie, son of King Yi.",
  "s0029": "Duke Xian, younger brother of Duke Li.",
  "s0030": "Marquis Wu, Gong Bo, Xiong Zhi Hong, Duke Xi, Marquis Qing",
  "s0031": "King Li Hu.",
  "s0032": "Hating to hear criticism, he caused disorder, fled, and died at Zhi.",
  "s0033": "Duke Zhen, Qin Zhong, Xiong Yan (Hong's younger brother).",
  "s0034": "Xi Hou",
  "s0035": "Gonghe, the two lords administered the government.",
  "s0036": "Marquis Wu, younger brother of Duke Zhen.",
  "s0037": "Xiong Yong",
  "s0038": "Master Zhang asked Master Zhu: \"The Odes say that Jie and Hou Ji were both born without fathers.",
  "s0039": "Now examining the various biographies, they all say they had fathers, and their fathers were all sons of the Yellow Emperor—could it be that this contradicts the Odes?\"",
  "s0040": "Master Zhu said: \"Not so.",
  "s0041": "The Odes saying Jie was born from an egg and Hou Ji from a footprint was to show their heavenly mandate and sincere intent.",
  "s0042": "Spirits and gods cannot complete themselves; they must be born through humans—how could they be born without fathers!",
  "s0043": "One account says they had fathers, another says no fathers; believe what is believable, doubt what is doubtful, therefore both are stated.",
  "s0044": "Yao knew Jie and Ji were both worthy men, born of Heaven, so he enfeoffed Jie with seventy li; after more than ten generations came Tang, who became king of the world.",
  "s0045": "Yao knew Hou Ji's descendants would later become kings, so he additionally enfeoffed him with one hundred li; his descendants lasted nearly a thousand years, until King Wen obtained the world.",
  "s0046": "The Odes tradition says: 'Tang's ancestor was Jie, born without a father.",
  "s0047": "Jie's mother was bathing with her sisters at Xuanqiu Water when a swallow carried an egg and dropped it; Jie's mother got it, so she held it, mistakenly swallowed it, and thus gave birth to Jie.",
  "s0048": "Jie was born and was worthy; Yao established him as Minister of Rites, and surnamed him the Zi clan.",
  "s0049": "Zi means 'this';",
  "s0050": "'this' means increasingly great.",
  "s0051": "The poets praised and sang of it: 'The Yin altars are vast, Heaven's mandate, the dark bird descends and gives birth to Shang'.",
  "s0052": "Shang means solid, Yin is the title.",
  "s0053": "King Wen's ancestor was Hou Ji; Hou Ji was also born without a father.",
  "s0054": "Hou Ji's mother was Jiang Yuan; she went out and saw the footprint of a great man, stepped in it, felt it in her body, and thus gave birth to Hou Ji.",
  "s0055": "Jiang Yuan thought he had no father, considered him base, and abandoned him in the wilds; oxen and sheep avoided him and did not tread on him.",
  "s0056": "She carried him to the mountains; the mountains nourished him.",
  "s0057": "She also abandoned him in the great marsh; birds covered him with their wings and fed him.",
  "s0058": "Jiang Yuan was astonished by this, so she knew he was a son of Heaven, and took him to raise.",
  "s0059": "Yao knew his worthy talent and established him as Great Farmer, surnaming him the Ji clan.",
  "s0060": "Ji means root.",
  "s0061": "The poets praised and sang of it: 'In the beginning he gave birth to the people', deeply cultivating and increasingly completing, thus relating Hou Ji's beginning.'\"",
  "s0062": "Confucius said: 'In ancient times Yao commanded Jie to be the Zi clan, because there would be Tang.",
  "s0063": "He commanded Hou Ji to be the Ji clan, because there would be King Wen.",
  "s0064": "King Tai commanded Ji Li to clarify the heavenly omens.",
  "s0065": "Tai Bo went to Wu, thus establishing the source.'",
  "s0066": "Heaven's mandate is difficult to speak of; only sages can perceive it.",
  "s0067": "Shun, Yu, Jie, and Hou Ji were all descendants of the Yellow Emperor.",
  "s0068": "The Yellow Emperor grasped Heaven's mandate and governed the world; his virtue and favor ran deep to later generations, therefore his descendants all again became established as Sons of Heaven—this is Heaven's reward for the virtuous.",
  "s0069": "People do not know this, thinking it happened by chance from commoners rising up.",
  "s0070": "How could commoners rise to become kings of the world for no reason?",
  "s0071": "It is because they had Heaven's mandate.\"",
  "s0072": "\"Why did the Yellow Emperor's descendants rule the world for so long?\"",
  "s0073": "He said: \"The tradition says that rulers of the world who redeem the lives of the common people for ten thousand households become emperors, and have blessings for ten thousand generations.",
  "s0074": "The Yellow Emperor was such a one.",
  "s0075": "When the five government affairs are clear, cultivate ritual and righteousness, take advantage of heavenly timing to raise troops and attack successfully, become kings with blessings for a thousand generations.",
  "s0076": "The King of Shu is a descendant of the Yellow Emperor; even now he is five thousand li southwest of Han, constantly comes to court and submit, offering tribute to Han—isn't this because his ancestors had virtue, with favor flowing to later generations?",
  "s0077": "Practicing morality—how can it be treated carelessly!",
  "s0078": "Rulers and kings should take this and observe it.",
  "s0079": "Han General Huo Qubing named Guang is also a descendant of the Yellow Emperor.",
  "s0080": "This can be spoken of to those with broad knowledge and far sight, but is certainly difficult to explain to those with shallow understanding.",
  "s0081": "Why say this?",
  "s0082": "Ancient lords took their states as surnames.",
  "s0083": "Huo is a state name.",
  "s0084": "King Wu enfeoffed his younger brother Shu Chu at Huo; later generations Duke Xian of Jin extinguished Duke Huo, later generations became commoners, coming and going they lived at Pingyang.",
  "s0085": "Pingyang is in Hedong; Hedong was Jin territory, divided to become the state of Wei.",
  "s0086": "Speaking of it in terms of the Odes, it can also be considered the Zhou period.",
  "s0087": "Zhou arose from Hou Ji; Hou Ji was born without a father.",
  "s0088": "Speaking in terms of the Three Dynasties genealogical transmissions, Hou Ji had a father named Gaoxin;",
  "s0089": "Gaoxin was the Yellow Emperor's great-grandson.",
  "s0090": "The Yellow Emperor's chronological record says: 'After Han had arisen more than one hundred years, there was a man neither short nor tall, coming from the region of Yan, holding the world's government, at a time when there was an infant ruler, wanting to drive the carriage.'"
}