{
  "s0699": "593 Fourteenth year, sixteenth year, sixth year, seventh year, Sui Hui extinguished Chi Di.",
  "s0700": "Eleventh year, twenty-first year, eighteenth year, seventh year, sixth year, nineteenth year, second year, twelfth year, ninth year",
  "s0701": "592 Fifteenth year, seventeenth year, solar eclipse.",
  "s0702": "Seventh year, Jin sent Xi Ke came Qi, woman laughed at him, Ke angry, returned went.",
  "s0703": "Eighth year, sent Xi Ke envoy Qi, woman laughed at him, Ke angry returned.",
  "s0704": "Twelfth year, twenty-second year, nineteenth year, eighth year, seventh year, twentieth year, Wen Hou died.",
  "s0705": "Third year, thirteenth year, tenth year",
  "s0706": "591 Sixteenth year, eighteenth year, Xuan Gong died.",
  "s0707": "Eighth year, Jin attacked defeated us.",
  "s0708": "Ninth year, attacked Qi, hostage strong, troops stopped.",
  "s0709": "Thirteenth year, twenty-third year, Zhuang Wang died.",
  "s0710": "Twentieth year, ninth year, eighth year, Cai Jing Hou Gu first year, fourth year, fourteenth year, eleventh year",
  "s0711": "590 Seventeenth year, Lu Cheng Gong Hei Gong first year, spring, Qi took our Long.",
  "s0712": "Ninth year, tenth year, fourteenth year, Chu Gong Wang Shen first year, twenty-first year, tenth year, ninth year, second year, fifth year, fifteenth year, twelfth year",
  "s0713": "589 Eighteenth year, second year, with Jin attacked Qi, Qi returned our Wen Yang, secretly allied with Chu.",
  "s0714": "Tenth year, Jin Xi Ke defeated duke at An, captured Peng Chou Fu.",
  "s0715": "Eleventh year, with Lu, Cao defeated Qi.",
  "s0716": "Fifteenth year, second year, autumn, Shen Gong Wu Chen stole Zheng Shu mother fled Jin, made Xing grand master.",
  "s0717": "Winter, attacked Wei, Lu, rescued Qi.",
  "s0718": "Twenty-second year, eleventh year, Mu Gong died.",
  "s0719": "With feudal lords defeated Qi, returned invaded lands.",
  "s0720": "Chu attacked us.",
  "s0721": "Tenth year, third year, sixth year, sixteenth year, thirteenth year",
  "s0722": "588 Nineteenth year, third year, assembled Jin, Song, Wei, Cao attacked Zheng.",
  "s0723": "Eleventh year, Qing Gong went Jin, wished king Jin, Jin dared not accept.",
  "s0724": "Twelfth year, began established six ministers.",
  "s0725": "Led feudal lords attacked Zheng.",
  "s0726": "Sixteenth year, third year, Song Gong Gong Xia first year, Wei Ding Gong Zang first year, eleventh year, fourth year, seventh year, attacked Zheng.",
  "s0727": "Seventeenth year, Jin led feudal lords attacked us.",
  "s0728": "Fourteenth year",
  "s0729": "587 Jiaxu twentieth year, fourth year, duke went Jin, Jin not respectful, duke wished double Jin ally with Chu.",
  "s0730": "Twelfth year, thirteenth year, Lu duke came, not respectful.",
  "s0731": "Seventeenth year, fourth year, Zi Fan rescued Zheng.",
  "s0732": "Second year, second year, twelfth year, fifth year, eighth year, eighteenth year, Jin Luan Shu took our Fan.",
  "s0733": "Xiang Gong died.",
  "s0734": "Fifteenth year",
  "s0735": "586 Twentieth year, Ding Wang died.",
  "s0736": "Fifth year, thirteenth year, fourteenth year, Liang Shan collapsed.",
  "s0737": "Bo Zong hid his person and used his words.",
  "s0738": "Eighteenth year, fifth year, attacked Zheng, because we doubled cause.",
  "s0739": "Zheng Dao Gong came sued.",
  "s0740": "Third year, third year, thirteenth year, sixth year, ninth year, Zheng Dao Gong Fei first year, duke went Chu sued.",
  "s0741": "Yan Zhao Gong first year",
  "s0742": "585 Jian Wang first year, sixth year, fourteenth year, fifteenth year, sent Luan Shu rescued Zheng, then invaded Cai.",
  "s0743": "Nineteenth year, sixth year, fourth year, fourth year, fourteenth year, seventh year, Jin invaded us.",
  "s0744": "Tenth year, second year, Dao Gong died.",
  "s0745": "Chu attacked us, Jin sent Luan Shu came rescue.",
  "s0746": "Second year, Wu Shou Meng first year",
  "s0747": "584 Second year, seventh year, fifteenth year, sixteenth year, with Wu Chen began communicate with Wu and planned Chu.",
  "s0748": "Twentieth year, seventh year, attacked Zheng.",
  "s0749": "Fifth year, fifth year, fifteenth year, eighth year, eleventh year, Zheng Cheng Gong Mao first year, Dao Gong younger brother.",
  "s0750": "Chu attacked us.",
  "s0751": "Third year, second year, minister Wu came, planned attack Chu.",
  "s0752": "583 Third year, eighth year, sixteenth year, seventeenth year, restored Zhao Wu field city.",
  "s0753": "Invaded Cai.",
  "s0754": "Twenty-first year, eighth year, sixth year, sixth year, sixteenth year, ninth year, Jin attacked us.",
  "s0755": "Twelfth year, second year, fourth year, third year",
  "s0756": "582 Fourth year, ninth year, seventeenth year, Qing Gong died.",
  "s0757": "Eighteenth year, arrested Zheng Cheng Gong, attacked Zheng.",
  "s0758": "Qin attacked us.",
  "s0759": "Twenty-second year, attacked Jin.",
  "s0760": "Ninth year, rescued Zheng.",
  "s0761": "Winter, allied with Jin.",
  "s0762": "Seventh year, seventh year, seventeenth year, tenth year, thirteenth year, third year, allied with Chu.",
  "s0763": "Duke went Jin, arrested duke attacked us.",
  "s0764": "Fifth year, fourth year",
  "s0765": "581 Fifth year, tenth year, duke went Jin sent burial, tabooed it.",
  "s0766": "Qi Ling Gong Huan first year, nineteenth year, twenty-third year, tenth year, eighth year, eighth year, eighteenth year, eleventh year, fourteenth year, fourth year, Jin led feudal lords attacked us.",
  "s0767": "Sixth year, fifth year",
  "s0768": "580 Sixth year, eleventh year, second year, Jin Li Gong Shou Man first year, twenty-fourth year, allied with Jin duke between river, returned, doubled alliance.",
  "s0769": "Eleventh year, ninth year, ninth year, nineteenth year, twelfth year, fifteenth year, fifth year, seventh year, sixth year",
  "s0770": "579 Seventh year, twelfth year, third year, second year, twenty-fifth year, twelfth year, tenth year, tenth year, twentieth year, thirteenth year, sixteenth year, sixth year, eighth year, seventh year",
  "s0771": "578 Eighth year, thirteenth year, assembled Jin attacked Qin.",
  "s0772": "Fourth year, attacked Qin.",
  "s0773": "Third year, attacked Qin to Jing, defeated them, captured their general Cheng Chai.",
  "s0774": "Twenty-sixth year, Jin led feudal lords attacked us.",
  "s0775": "Thirteenth year, eleventh year, Jin led us attacked Qin.",
  "s0776": "Eleventh year, twenty-first year, fourteenth year, seventeenth year, Jin led us attacked Qin.",
  "s0777": "Seventh year, Jin led us attacked Qin.",
  "s0778": "Ninth year, eighth year",
  "s0779": "577 Jiashen ninth year, fourteenth year, fifth year, fourth year, twenty-seventh year, fourteenth year, twelfth year, twelfth year, Ding Gong died.",
  "s0780": "Twenty-second year, fifteenth year, Cao Cheng Gong Fu Chou first year, eighth year, tenth year, ninth year",
  "s0781": "576 Tenth year, fifteenth year, began communicate with Wu, assembled Zhong Li.",
  "s0782": "Sixth year, fifth year, Xi slandered Bo Zong, killed him, Bo Zong fond of direct remonstration.",
  "s0783": "Qin Jing Gong first year, fifteenth year, Xu feared Zheng, requested move Ye.",
  "s0784": "Thirteenth year, Hua Yuan fled Jin, again returned.",
  "s0785": "Wei Xian Gong Gan first year, twenty-third year, sixteenth year, second year, Jin arrested our duke to return.",
  "s0786": "Ninth year, eleventh year, tenth year, allied with Lu assembled Zhong Li.",
  "s0787": "575 Eleventh year, sixteenth year, Xuan Bo reported Jin, wished kill Ji Wen Zi, Wen Zi with righteousness escaped.",
  "s0788": "Seventh year, sixth year, defeated Chu Yan Ling.",
  "s0789": "Second year, sixteenth year, rescued Zheng, unfavorable.",
  "s0790": "Zi Fan drunk, army defeated, killed Zi Fan returned.",
  "s0791": "Song Ping Gong Cheng first year, second year, twenty-fourth year, seventeenth year, third year, tenth year, doubled Jin allied Chu, Jin attacked us, Chu came rescue.",
  "s0792": "Twelfth year, eleventh year",
  "s0793": "574 Twelfth year, seventeenth year, eighth year, seventh year, third year, seventeenth year, second year, third year, twenty-fifth year, eighteenth year, fourth year, eleventh year, thirteenth year, Zhao Gong died.",
  "s0794": "Twelfth year",
  "s0795": "573 Thirteenth year, eighteenth year, Cheng Gong died.",
  "s0796": "Ninth year, eighth year, Luan Shu, Zhong Xing Yan killed Li Gong, established Xiang Gong great-grandson, this was Dao Gong.",
  "s0797": "Fourth year, eighteenth year, made Yu Shi attacked Song Peng Cheng.",
  "s0798": "Fifth year, sixth year, seventh year, fourteenth year, fourth year, fifth year"
}
