{
  "s334": "Nineteenth.",
  "s336": "Twelfth month.",
  "s337": "Eighth. Divided Chu into four.",
  "s338": "Sixteenth. Arrived in Guanzhong, executed Qin prince Ziying, massacred and burned Xianyang. Divided the empire, established the lords.",
  "s339": "Twenty-fifth. Divided Zhao into Dai state.",
  "s340": "Eighteenth. Xiang Yu resented Rong, divided Qi into three states.",
  "s341": "Twenty-ninth. Had a falling out with Xiang Yu, met him below Xi, reconciled. Yu broke the agreement, divided Guanzhong into four states.",
  "s342": "Twenty-ninth. Zang Tu followed and entered, divided Yan into two states.",
  "s343": "Seventeenth. Divided Wei into Yin state.",
  "s344": "Twentieth. Divided Han into Henan state.",
  "s367": "Ninth. Yi Di first year. The lords honored Huai Wang as Yi Di.",
  "s368": "Seventeenth. Xiang Ji established himself as Western Chu Overlord.",
  "s369": "Divided into Hengshan.",
  "s370": "Divided into Linjiang.",
  "s371": "Divided into Jiujiang.",
  "s372": "Twenty-sixth. Changed name to Changshan.",
  "s373": "Divided into Dai.",
  "s374": "Nineteenth. Changed name to Linzi.",
  "s375": "Divided into Jibei.",
  "s376": "Divided into Jiaodong.",
  "s377": "First month. Divided Guanzhong into Han.",
  "s378": "Divided Guanzhong into Yong.",
  "s379": "Divided Guanzhong into Sai.",
  "s380": "Divided Guanzhong into Di.",
  "s381": "Thirtieth. Yan",
  "s382": "Divided into Liaodong.",
  "s383": "Eighteenth. Changed to Western Wei.",
  "s384": "Divided into Yin.",
  "s385": "Twenty-first. Han",
  "s386": "Divided into Henan.",
  "s388": "Second. Moved capital to Chenzhou south of the Jiang.",
  "s389": "Western Chu lorded over the dukes, Xiang Ji beginning, commanded the empire's fate, controlled eighteen kings.",
  "s390": "King Wu Rui beginning, former Fan lord.",
  "s391": "King Gong Ao beginning, former Chu Zhu Guo.",
  "s392": "King Ying Bu beginning, former Chu general.",
  "s393": "King Zhang Er beginning, former Chu general.",
  "s394": "Twenty-seventh. King Zhao Xie beginning, former Zhao king.",
  "s395": "King Tian Du beginning, former Qi general.",
  "s396": "King Tian An beginning, former Qi general.",
  "s397": "Twentieth. King Tian Shi beginning, former Qi king.",
  "s398": "Second month. Han King beginning, former Pei Gong.",
  "s399": "King Zhang Han beginning, former Qin general.",
  "s400": "King Sima Xin beginning, former Qin general.",
  "s401": "King Dong Yi beginning, former Qin general.",
  "s402": "King Zang Tu beginning, former Yan general.",
  "s403": "Thirty-first. King Han Guang beginning, former Yan king.",
  "s404": "Nineteenth. King Wei Bao beginning, former Wei king.",
  "s405": "King Sima Ang beginning, former Zhao general.",
  "s406": "Twenty-second. King Han Cheng beginning, former Han general."
}
