{
  "s0102": "Zhao Hou's first year, Qin attacked us.",
  "s0103": "In the thirty-second year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0104": "Xu Hou's first year, Qin attacked us.",
  "s0105": "In the thirty-third year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0106": "Wen Hou's first year, Qin attacked us.",
  "s0107": "In the thirty-fourth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0108": "Ai Hou's first year, Qin attacked us.",
  "s0109": "In the thirty-fifth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0110": "Zhao Hou's first year, Qin attacked us.",
  "s0111": "In the thirty-sixth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0112": "Xu Hou's first year, Qin attacked us.",
  "s0113": "In the thirty-seventh year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0114": "Wen Hou's first year, Qin attacked us.",
  "s0115": "In the thirty-eighth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0116": "Ai Hou's first year, Qin attacked us.",
  "s0117": "In the thirty-ninth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0118": "Zhao Hou's first year, Qin attacked us.",
  "s0119": "In the fortieth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0120": "Xu Hou's first year, Qin attacked us.",
  "s0121": "In the forty-first year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0122": "Wen Hou's first year, Qin attacked us.",
  "s0123": "In the forty-second year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0124": "Ai Hou's first year, Qin attacked us.",
  "s0125": "In the forty-third year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0126": "Zhao Hou's first year, Qin attacked us.",
  "s0127": "In the forty-fourth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0128": "Xu Hou's first year, Qin attacked us.",
  "s0129": "In the forty-fifth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0130": "Wen Hou's first year, Qin attacked us.",
  "s0131": "In the forty-sixth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0132": "Ai Hou's first year, Qin attacked us.",
  "s0133": "In the forty-seventh year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0134": "Zhao Hou's first year, Qin attacked us.",
  "s0135": "In the forty-eighth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0136": "Xu Hou's first year, Qin attacked us.",
  "s0137": "In the forty-ninth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0138": "Wen Hou's first year, Qin attacked us.",
  "s0139": "In the fiftieth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0140": "Ai Hou's first year, Qin attacked us.",
  "s0141": "In the fifty-first year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0142": "Zhao Hou's first year, Qin attacked us.",
  "s0143": "In the fifty-second year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0144": "Xu Hou's first year, Qin attacked us.",
  "s0145": "In the fifty-third year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0146": "Wen Hou's first year, Qin attacked us.",
  "s0147": "In the fifty-fourth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0148": "Ai Hou's first year, Qin attacked us.",
  "s0149": "In the fifty-fifth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0150": "Zhao Hou's first year, Qin attacked us.",
  "s0151": "In the fifty-sixth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0152": "Xu Hou's first year, Qin attacked us.",
  "s0153": "In the fifty-seventh year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0154": "Wen Hou's first year, Qin attacked us.",
  "s0155": "In the fifty-eighth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0156": "Ai Hou's first year, Qin attacked us.",
  "s0157": "In the fifty-ninth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0158": "Zhao Hou's first year, Qin attacked us.",
  "s0159": "In the sixtieth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0160": "Xu Hou's first year, Qin attacked us.",
  "s0161": "In the sixty-first year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0162": "Wen Hou's first year, Qin attacked us.",
  "s0163": "In the sixty-second year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0164": "Ai Hou's first year, Qin attacked us.",
  "s0165": "In the sixty-third year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0166": "Zhao Hou's first year, Qin attacked us.",
  "s0167": "In the sixty-fourth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0168": "Xu Hou's first year, Qin attacked us.",
  "s0169": "In the sixty-fifth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0170": "Wen Hou's first year, Qin attacked us.",
  "s0171": "In the sixty-sixth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0172": "Ai Hou's first year, Qin attacked us.",
  "s0173": "In the sixty-seventh year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0174": "Zhao Hou's first year, Qin attacked us.",
  "s0175": "In the sixty-eighth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0176": "Xu Hou's first year, Qin attacked us.",
  "s0177": "In the sixty-ninth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0178": "Wen Hou's first year, Qin attacked us.",
  "s0179": "In the seventieth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0180": "Ai Hou's first year, Qin attacked us.",
  "s0181": "In the seventy-first year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0182": "Zhao Hou's first year, Qin attacked us.",
  "s0183": "In the seventy-second year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0184": "Xu Hou's first year, Qin attacked us.",
  "s0185": "In the seventy-third year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0186": "Wen Hou's first year, Qin attacked us.",
  "s0187": "In the seventy-fourth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0188": "Ai Hou's first year, Qin attacked us.",
  "s0189": "In the seventy-fifth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0190": "Zhao Hou's first year, Qin attacked us.",
  "s0191": "In the seventy-sixth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0192": "Xu Hou's first year, Qin attacked us.",
  "s0193": "In the seventy-seventh year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0194": "Wen Hou's first year, Qin attacked us.",
  "s0195": "In the seventy-eighth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0196": "Ai Hou's first year, Qin attacked us."
}
