{
  "s163": "Six",
  "s164": "First year, Marquis Kang convicted of forging imperial orders without harm, state abolished.",
  "s167": "Yin An.",
  "s168": "With father's merit as Grand General Qing defeated Right Wise King, Marquis.",
  "s170": "Two. Fifth year fourth month ding wei, Marquis Wei Bu Yi first year.",
  "s171": "Six",
  "s172": "Four. Fifth year, Marquis Bu Yi convicted of tribute gold, state abolished.",
  "s175": "Fa Gan.",
  "s176": "With father's merit as Grand General Qing defeated Right Wise King, Marquis.",
  "s178": "Two. Fifth year fourth month ding wei, Marquis Wei Deng first year.",
  "s179": "Six",
  "s180": "Four. Fifth year, Marquis Deng convicted of tribute gold, state abolished.",
  "s183": "Bo Wang.",
  "s184": "As colonel followed Grand General sixth year attacked Xiongnu, knew water routes, and previously as envoy to remote regions Daxia with merit, Marquis.",
  "s186": "One. Sixth year third month jia chen, Marquis Zhang Qian first year.",
  "s187": "One. Second year, Marquis Qian convicted of as general attacking Xiongnu being cowardly, should be executed, ransomed, state abolished.",
  "s191": "Guan Jun.",
  "s192": "As Piaoyao colonel twice followed Grand General, sixth year followed Grand General attacked Xiongnu, beheaded prime minister with merit, Marquis. Yuanshou second year, as Piaoyi General attacked Xiongnu to Qilian, increased enfeoffment; welcomed Hunye King, increased enfeoffment; attacked Left and Right Wise Kings, increased enfeoffment.",
  "s194": "One. Sixth year fourth month ren shen, Marquis Jing Huan Huo Qu Bing first year.",
  "s195": "Six",
  "s196": "Six. First year, Marquis Ai Shan first year.",
  "s197": "First year, Marquis Ai Shan died, no posterity, state abolished.",
  "s199": "Zhong Li.",
  "s200": "As Grand Administrator of Shanggu four times followed Grand General, sixth year attacked Xiongnu, captured over thousand heads with merit, Marquis.",
  "s202": "One. Sixth year fifth month ren chen, Marquis Hao Xian first year.",
  "s203": "One. Second year, Marquis Xian convicted of as Grand Administrator of Shanggu taking garrison soldiers' property in accounts fraudulently, state abolished.",
  "s207": "Liao.",
  "s208": "As Xiongnu King Zhao surrendered, Marquis.",
  "s211": "One. First year seventh month ren wu, Marquis Dao Zhao Wang Nuan Zi first year. Second year, Nuan Zi died, no posterity, state abolished.",
  "s215": "Yi Guan.",
  "s216": "As colonel followed Piaoyi General second year twice went out attacked Xiongnu with merit, Marquis. Formerly Xiongnu who returned righteousness.",
  "s219": "Two. Second year first month yi hai, Marquis Gao Bu Shi first year. Fourth year, Bu Shi attacked Xiongnu, in battle merit increased heads not according to reality, should be executed, ransomed crime, state abolished.",
  "s223": "Hui Qu.",
  "s224": "As colonel followed Piaoyi General second year twice went out attacked Xiongnu, obtained king with merit, Marquis. As colonel followed Piaoyi General second year captured five kings with merit, increased enfeoffment. Formerly Xiongnu who returned righteousness.",
  "s227": "Five. Second year second month yi chou, Marquis Zhong Pu Duo first year.",
  "s228": "Three. Three. Fourth year, Marquis Dian first year.",
  "s229": "Six",
  "s230": "Four",
  "s231": "Followed Piao.",
  "s232": "As Major twice followed Piaoyi General repeatedly penetrated deep into Xiongnu, obtained two princes cavalry general with merit, Marquis. As Hunhe General Yuanfeng third year attacked Loulan with merit, restored marquisate.",
  "s235": "Five. Second year fifth month ding chou, Marquis Zhao Po Nu first year.",
  "s236": "Four. Fifth year, Marquis Po Nu convicted of tribute gold, state abolished.",
  "s237": "Zhuo Ye. Four. Third year, Marquis Po Nu first year.",
  "s238": "One. Second year, Marquis Po Nu as Junji General attacked Xiongnu, lost army, captured by enemy, state abolished.",
  "s239": "Xia Mi.",
  "s240": "As Xiongnu king surrendered, Marquis.",
  "s243": "Five. Second year sixth month yi hai, Marquis Hu Du Ni first year.",
  "s244": "Four. Two. Fifth year, Marquis Yang Yi Ji Xuan first year.",
  "s245": "Six"
}
