{
  "s0149": "Its at twelve branches for Shen.",
  "s0150": "Shen, speak yin use affairs, shen harm ten thousand things, thus Shen.",
  "s0151": "North to Zhu.",
  "s0152": "Zhu, touch, speak ten thousand things all touch death, thus Zhu.",
  "s0153": "North to Liu.",
  "s0154": "Liu, speak yang qi detain stay, thus Liu.",
  "s0155": "Eighth month, pitch middle Nan Lu.",
  "s0156": "Nan Lu, speak yang qi travel enter store.",
  "s0157": "Its at twelve branches for You.",
  "s0158": "You, ten thousand things old, thus You.",
  "s0159": "Chang He wind dwells west.",
  "s0160": "Chang, lead;",
  "s0161": "He, store.",
  "s0162": "Speak yang qi exhaust ten thousand things, he yellow springs.",
  "s0163": "Its at ten mothers for Geng Xin.",
  "s0164": "Geng, speak yin qi geng ten thousand things, thus Geng;",
  "s0165": "Xin, speak ten thousand things xin born, thus Xin.",
  "s0166": "North to Wei.",
  "s0167": "Wei, speak yang qi approach store, all wei wei.",
  "s0168": "North to Lou.",
  "s0169": "Lou, call ten thousand things and inner them.",
  "s0170": "North to Kui.",
  "s0171": "Kui, govern poison sting kill ten thousand things, Kui and store them.",
  "s0172": "Ninth month, pitch middle Wu She.",
  "s0173": "Wu She, yin qi flourish use affairs, yang qi no remainder, thus Wu She.",
  "s0174": "Its at twelve branches for Xu.",
  "s0175": "Xu, speak ten thousand things all extinguish, thus Xu.",
  "s0176": "Pitch numbers: nine nine eighty one as gong.",
  "s0177": "Divide three remove one, fifty four as zhi.",
  "s0178": "Divide three add one, seventy two as shang.",
  "s0179": "Divide three remove one, forty eight as yu.",
  "s0180": "Divide three add one, sixty four as jue.",
  "s0181": "Huang Zhong length eight cun seven fen one, gong.",
  "s0182": "Da Lu length seven cun five fen three two.",
  "s0183": "Tai Cu length seven cun ten fen two, jue.",
  "s0184": "Jia Zhong length six cun seven fen three one.",
  "s0185": "Gu Xi length six cun ten fen four, yu.",
  "s0186": "Zhong Lu length five cun nine fen three two, zhi.",
  "s0187": "Rui Bin length five cun six fen three two.",
  "s0188": "Lin Zhong length five cun ten fen four, jue.",
  "s0189": "Yi Ze length five cun four fen three two, shang.",
  "s0190": "Nan Lu length four cun ten fen eight, zhi.",
  "s0191": "Wu She length four cun four fen three two.",
  "s0192": "Ying Zhong length four cun two fen three two, yu.",
  "s0193": "Born bell divisions: Zi one fen.",
  "s0194": "Chou three fen two.",
  "s0195": "Yin nine fen eight.",
  "s0196": "Mao twenty seven fen sixteen.",
  "s0197": "Chen eighty one fen sixty four.",
  "s0198": "Si two hundred forty three fen one hundred twenty eight."
}
