{
  "s0547": "The emperor sent people to follow and verify, truly nothing seen.",
  "s0548": "Five Profits falsely claimed to see his teacher, his techniques all exhausted, much not verified.",
  "s0549": "The emperor then executed Five Profits.",
  "s0550": "That winter, Gongsun Qing waited for spirits south of Yellow River, said saw immortal traces on Gou Shi city wall, there was something like a pheasant, coming and going on the city wall.",
  "s0551": "The emperor personally went to Gou Shi city to view the traces.",
  "s0552": "Asked Qing: 'Not imitating Wencheng, Five Profits?'",
  "s0553": "Qing said: 'Immortals do not seek rulers, rulers seek them.",
  "s0554": "Their way not somewhat tolerant and lenient, spirits do not come.",
  "s0555": "Speaking of spirit matters, matters like distant and fantastic, accumulate over years then can achieve.'",
  "s0556": "Therefore commanderies and kingdoms each cleared roads, repaired and maintained palace observatories famous mountains spirit sacrifices places, to await visits.",
  "s0557": "That spring, after extinguishing Nanyue, the emperor had favored minister Li Yannian appear through good music.",
  "s0558": "The emperor favored him, ordered dukes and ministers to discuss, said: 'Among the people sacrifices still have drum dance music, now suburban sacrifices have no music, is this appropriate?'",
  "s0559": "Dukes and ministers said: 'In ancient times sacrificing to heaven and earth all had music, then spirits could be approached and rituals performed.'",
  "s0560": "Some said: 'Tai Di made Su Nu drum the fifty string zither, sad, Di prohibited but could not stop, so broke its zither into twenty-five strings.'",
  "s0561": "Therefore after pacifying Nanyue, prayed and sacrificed to Tai Yi, Hou Tu, began using music and dance, increasingly summoned singing boys, made twenty-five string zithers and harp qin zithers from this arose.",
  "s0562": "The next year winter, the emperor discussed: 'In ancient times first shook troops in Ze, then performed feng and shan.'",
  "s0563": "Therefore proceeded north touring Shuofang, mustered troops over ten thousand, returned sacrificed at Huang Di's tomb Qiaoshan, dismissed troops waited.",
  "s0564": "The emperor said: 'I heard Huang Di does not die, now has a tomb, why?'",
  "s0565": "Some answered: 'Huang Di already became immortal ascended to heaven, ministers buried his clothes and hat.'",
  "s0566": "Having arrived at Ganquan, about to perform affairs at Mount Tai, first practiced sacrificing to Tai Yi.",
  "s0567": "Since obtaining precious ding, the emperor with dukes ministers various scholars discussed feng and shan.",
  "s0568": "Feng and shan used rarely and distantly, no one knew their ceremonies and rituals, group Confucians gathered feng and shan Shangshu, Zhouguan, Wangzhi's gazing sacrifices shooting oxen matters.",
  "s0569": "Qi man Ding Gong over ninety years, said: 'Feng and shan are matters of uniting undying name.",
  "s0570": "Qin emperor could not ascend for feng, Your Majesty must ascend, gradually ascend if no wind rain, then ascend for feng.'",
  "s0571": "The emperor therefore ordered various Confucians to practice shooting oxen, draft feng and shan ceremonies.",
  "s0572": "Several years, to about going.",
  "s0573": "The emperor having heard Gongsun Qing and magicians' words, Huang Di and above performed feng and shan, all brought forth strange things and communicated with spirits, wished to imitate Huang Di and above receiving divine immortals Penglai scholars, transcend the world compare virtue to Nine Sovereigns, and rather adopted Confucian arts to civilize it.",
  "s0574": "Group Confucians already could not clearly distinguish feng and shan matters, moreover constrained by Poetry Book ancient texts could not gallop freely.",
  "s0575": "The emperor made feng and shan sacrificial vessels to show group Confucians, group Confucians some said 'not same as ancient', Xu Yan moreover said 'grand regular various scholars performing rites not as good as Lu', Zhou Ba drew feng and shan matters, therefore the emperor dismissed Yan, Ba, and completely dismissed various Confucians not using them.",
  "s0576": "Third month, proceeded east to Gou Shi, ritual ascended Zhong Yue Tai Shi.",
  "s0577": "Following officials at mountain foot heard as if saying 'ten thousand years.'",
  "s0578": "Asked the emperor, emperor did not speak;",
  "s0579": "asked below, below did not speak.",
  "s0580": "Therefore with three hundred households enfeoffed Tai Shi to maintain sacrifice, named Chonggao yi.",
  "s0581": "East ascended Mount Tai, Mount Tai's grass trees leaves not yet grown, then ordered people ascend stone erected at Mount Tai peak.",
  "s0582": "The emperor then toured east to sea, performed rituals sacrificed to eight spirits.",
  "s0583": "Qi people's memorials speaking of divine strange marvelous techniques numbered in tens of thousands, but none verified.",
  "s0584": "Then increased sending ships, ordered those speaking of sea divine mountains several thousand people seek Penglai divine people.",
  "s0585": "Gongsun Qing held tally constantly went first waiting at famous mountains, reached Donglai, said at night saw great man, several zhang tall, approached then disappeared, saw his traces very large, like bird beast.",
  "s0586": "Ministers had those who said saw one old father leading dog, said 'I wish to see great duke', suddenly disappeared.",
  "s0587": "The emperor immediately saw great traces, did not believe, when ministers had those who spoke of old father, then greatly considered immortal person.",
  "s0588": "Stayed at sea, gave magicians relay carriages and secret envoys seeking immortals numbering in thousands.",
  "s0589": "Fourth month, returned to Fenggao.",
  "s0590": "The emperor reflected various Confucians and magicians' words on feng and shan each different, not orthodox, difficult to implement.",
  "s0591": "The emperor reached Liangfu, ritual sacrificed to earth lord.",
  "s0592": "Yi Mao day, ordered attendant Confucian Pi Mian recommended girdle, shoot oxen perform affairs.",
  "s0593": "Feng at Mount Tai lower eastern side, like suburban sacrifice Tai Yi ritual.",
  "s0594": "Feng wide one zhang two chi, high nine chi, below then had jade slips book, book secret.",
  "s0595": "Ritual finished, emperor alone with attendant chariot master Zi Hou ascended Mount Tai, also had feng."
}
