{
  "s330": "152",
  "s331": "Five",
  "s332": "Establishes Yang Mausoleum town. Chancellor Bei Ping Hou Zhang Cang passes away.",
  "s333": "Four",
  "s334": "Three",
  "s336": "151",
  "s337": "Six",
  "s338": "Moves Guangchuan King Peng Zu to Zhao King.",
  "s339": "Five",
  "s340": "Four",
  "s341": "Imperial Secretary Yang Ling Hou Cen Mai.",
  "s342": "150",
  "s343": "Seven",
  "s344": "Deposes Crown Prince Rong as Linjiang King. Fourth month ding si, Jiaodong King established as Crown Prince. Qing dismissed from chancellor.",
  "s345": "Sixth month yi si, Grand Commandant Marquis of Tiao Zhou Yafu becomes Chancellor. Abolishes Grand Commandant office.",
  "s346": "Five. Promoted to Chancellor.",
  "s347": "Imperial Secretary She.",
  "s348": "149",
  "s349": "Zhong first year",
  "s351": "Two",
  "s354": "148",
  "s355": "Two",
  "s356": "Imperial son Yue becomes Guangchuan King, Ji becomes Jiaodong King.",
  "s357": "Three",
  "s360": "147",
  "s361": "Three",
  "s362": "Imperial son Cheng becomes Qinghe King. Yafu dismissed from chancellor.",
  "s363": "Four. Imperial Secretary Tao Hou Liu She becomes Chancellor.",
  "s365": "Imperial Secretary Wan.",
  "s366": "146",
  "s367": "Four",
  "s368": "Linjiang King summoned, commits suicide, buried at Lan Tian, Yan several tens of thousands make clay figures placed on tomb.",
  "s369": "Two",
  "s372": "145",
  "s373": "Five",
  "s374": "Imperial son Shun becomes Changshan King.",
  "s375": "Three",
  "s378": "144",
  "s379": "Six",
  "s380": "Liang Xiao King Wu passes away. Divides Liang into five states, kings various sons: son Mai becomes Liang King, Ming becomes Ji Chuan King, Peng Li becomes Ji Dong King, Ding becomes Shan Yang King, Bu Shi becomes Ji Yin King.",
  "s381": "Four",
  "s384": "143",
  "s385": "Hou first year",
  "s386": "Fifth month, earth movement. Seventh month yi si, solar eclipse. She dismissed from chancellor.",
  "s387": "Five. Eighth month ren chen, Imperial Secretary Jian Ling Hou Wei Wan becomes Chancellor.",
  "s389": "Imperial Secretary Bu Yi.",
  "s390": "142",
  "s391": "Two",
  "s393": "Two"
}
