{
  "s422": "Four. Third year tenth month gui you, Marquis Liu Mian first year.",
  "s423": "Six",
  "s424": "Six",
  "s425": "Six",
  "s426": "Four",
  "s427": "Zhou Xiang.",
  "s428": "Son of Prince Xian of Hejian.",
  "s430": "Four. Third year tenth month gui you, Marquis Jie Liu Jin first year.",
  "s431": "Six",
  "s432": "Six",
  "s433": "Five. One. Sixth year, current Marquis Hui first year.",
  "s434": "Four",
  "s435": "Cheng Ping.",
  "s436": "Son of Prince Xian of Hejian.",
  "s438": "Four. Third year tenth month gui you, Marquis Liu Li first year.",
  "s439": "Two. Third year, Marquis Li committed crime, state abolished.",
  "s443": "Guang.",
  "s444": "Son of Prince Xian of Hejian.",
  "s446": "Four. Third year tenth month gui you, Marquis Liu Shun first year.",
  "s447": "Six",
  "s448": "Four. Fifth year, Marquis Shun convicted of tribute gold, state abolished.",
  "s451": "Gai Xu.",
  "s452": "Son of Prince Xian of Hejian.",
  "s454": "Four. Third year tenth month gui you, Marquis Liu Rang first year.",
  "s455": "Six",
  "s456": "Four. Fifth year, Marquis Rang convicted of tribute gold, state abolished.",
  "s459": "Pei An.",
  "s460": "Son of Prince Zhen of Jibei.",
  "s462": "Four. Third year tenth month gui you, Marquis Kang Liu Bu Hai first year.",
  "s463": "Six",
  "s464": "One. Second year, Marquis Ai Qin Ke first year. Two. Third year, Marquis Qin Ke died, no posterity, state abolished.",
  "s467": "Rong Jian.",
  "s468": "Son of Prince Zhen of Jibei.",
  "s470": "Four. Third year tenth month gui you, Marquis Liu Qian first year.",
  "s471": "Two. Third year, Marquis Qian committed crime, state abolished.",
  "s475": "Zhou Jian.",
  "s476": "Son of Prince Zhen of Jibei.",
  "s478": "Four. Third year tenth month gui you, Marquis Liu He first year.",
  "s479": "Four. Two. Fifth year, Marquis Dang Shi first year.",
  "s480": "Four. Fifth year, Marquis Dang Shi convicted of tribute gold, state abolished.",
  "s483": "An Yang.",
  "s484": "Son of Prince Zhen of Jibei.",
  "s486": "Four. Third year tenth month gui you, Marquis Liu Jie first year.",
  "s487": "Six",
  "s488": "Six",
  "s489": "Six",
  "s490": "Four",
  "s491": "Wu Ling.",
  "s492": "Son of Prince Zhen of Jibei."
}
