{
  "s110": "Sixth. Jing Ke sent Gongsun Qing to reprimand Qi, executed Qing.",
  "s111": "Sixth. Attacked and took Dang, obtained six thousand troops, together with previous forces totaling nine thousand.",
  "s112": "Sixth.",
  "s113": "Sixth.",
  "s116": "Third month.",
  "s117": "Third.",
  "s118": "Seventh.",
  "s119": "Third.",
  "s120": "Seventh.",
  "s121": "Seventh. Attacked and took Xiayi, then attacked Feng, but Feng did not fall. Heard Xiang Liang had many troops, went to request him to attack Feng.",
  "s122": "Seventh.",
  "s123": "Seventh.",
  "s126": "Fourth month.",
  "s127": "Fourth.",
  "s128": "Eighth. Liang attacked and killed Jing Ke and Qin Jia, then entered Xue, troops numbering over one hundred thousand.",
  "s129": "Fourth.",
  "s130": "Eighth.",
  "s131": "Eighth. Pei Gong went to Xue to see Xiang Liang, Liang increased Pei Gong's troops by five thousand, attacked Feng, took it. Yong Chi fled to Wei.",
  "s132": "Eighth.",
  "s133": "Eighth. Lin Ji was in crisis, Zhou Shi went to Qi and Chu to request aid.",
  "s136": "Fifth month.",
  "s138": "Ninth.",
  "s139": "Fifth.",
  "s140": "Ninth.",
  "s141": "Ninth.",
  "s142": "Ninth.",
  "s143": "Ninth.",
  "s146": "Sixth month.",
  "s147": "Chu Huai Wang beginning, capital at Xutai, former Huai Wang's grandson, Liang established him.",
  "s148": "Tenth. Liang sought the Chu Huai Wang's grandson, found him among the common people, established him as Chu king.",
  "s149": "Sixth.",
  "s150": "Tenth. Dan rescued Lin Ji, Zhang Han killed Tian Dan. Rong fled to Dong'e.",
  "s151": "Tenth. Pei Gong went to Xue and together established Chu Huai Wang.",
  "s152": "Tenth.",
  "s153": "Tenth. Jiu committed suicide, Lin Ji surrendered to Qin.",
  "s154": "Han King Cheng beginning.",
  "s156": "Seventh month.",
  "s157": "Second. Chen Ying became Zhu Guo.",
  "s158": "Eleventh. Great rain, for three months stars were not seen.",
  "s159": "Seventh.",
  "s160": "Qi established Tian Jia as king, Qin urgently besieged Dong'e.",
  "s161": "Eleventh. Pei Gong and Xiang Yu went north to rescue Dong'e, defeated Qin army at Puyang, east slaughtered Chengyang.",
  "s162": "Eleventh.",
  "s163": "Jiu's younger brother Bao fled to Dong'e.",
  "s164": "Second.",
  "s166": "Eighth month.",
  "s167": "Third.",
  "s168": "Twelfth. Rescued Dong'e, defeated Qin army, following victory to Dingtao, Xiang Liang showed arrogance.",
  "s169": "Eighth."
}
