{
  "s4856": "Eighteen, Qi Tian Wu Yu came to send a woman.",
  "s4858": "First year of King Ling of Chu (Wei), King Gong's son, Zhou Yu.",
  "s4871": "Nine, Yan Ying sent to Jin, saw Shu Xiang, said 'Qi governance belongs to Tian clan.' Shu Xiang said: 'Jin ducal house is lowly.'",
  "s4880": "Twenty-seven, summer, went to Jin. Winter, went to Chu.",
  "s4881": "Six, duke wished to kill ministers and establish favored servants, ministers executed favored servants, duke feared, fled to Qi.",
  "s4886": "Four, claimed illness would not assemble with Chu.",
  "s4890": "Three, summer, assembled feudal lords in Song territory, made alliance. Attacked Wu Zhu Fang, executed Qing Feng. Winter, avenged us, took three cities.",
  "s4892": "Six, claimed illness would not assemble with Chu.",
  "s4895": "Seventeen, claimed illness would not assemble with Chu.",
  "s4896": "Twenty-eight, Zi Chan said: Three states will not assemble.",
  "s4898": "Ten, Chu executed Qing Feng.",
  "s4900": "Jia Zi",
  "s4904": "Twenty-one, Qin Hou Zi returned to Qin.",
  "s4905": "Forty, duke died. Hou Zi returned from Jin.",
  "s4906": "Four, led feudal lords to attack Wu.",
  "s4914": "Eleven, Chu led feudal lords to attack us.",
  "s4919": "Twelve, duke went to Jin, requested to attack Yan, entered their ruler.",
  "s4920": "Twenty-two, Qi Duke Jing came, requested to attack Yan, entered their ruler.",
  "s4921": "First year of Duke Ai of Qin",
  "s4922": "Five, attacked Wu, camped at Qian Xi.",
  "s4929": "Nine, Qi attacked us.",
  "s4930": "Twelve, Chu attacked us, camped at Qian Xi.",
  "s4934": "Seven, Ji Wu Zi died. Solar eclipse.",
  "s4935": "Thirteen, entered Yan ruler.",
  "s4936": "Twenty-three, entered Yan ruler.",
  "s4938": "Six, seized Shu Yin refugee entered Zhang Hua.",
  "s4940": "Nine, consort Jiang had no sons.",
  "s4945": "First year of Duke Dao of Yan, Duke Hui returned and died.",
  "s4950": "Eight, duke went to Chu, Chu detained him. Congratulated Zhang Hua Tower.",
  "s4954": "Seven, went to Zhang Hua Tower, inside filled with refugees. Extinguished Chen.",
  "s4956": "First year of Duke Ling of Wei",
  "s4957": "Thirty-five, younger brother Zhao caused disorder, Duke Ai committed suicide.",
  "s4970": "Eight, younger brother Qi Ji led troops to pacify Chen.",
  "s4973": "First year of Duke Hui of Chen (Wu), Duke Ai's grandson. Chu came to pacify us.",
  "s4984": "Twenty-six, spring, star appeared in Wu Nu. Seventh month, duke died.",
  "s4987": "Forty-four, Duke Ping died.",
  "s5000": "First year of Duke Zhao of Jin (Yi)",
  "s5002": "Ten, drunk assassinated Cai lord, made Qi Ji besiege him. Qi Ji dwelt there, became Cai lord.",
  "s5003": "First year of Duke Yuan of Song (Zuo)",
  "s5006": "Twelve, Duke Ling went to Chu, Chu assassinated him, made Qi Ji dwell there, became Cai lord.",
  "s5014": "Twelve, audience with Jin to the river, Jin apologized and returned.",
  "s5015": "Eighteen, duke went to Jin.",
  "s5018": "Eleven, king attacked Xu to intimidate Wu, camped at Qian Xi. People exhausted from service, resented the king.",
  "s5020": "Five, duke went to Jin, audience with successor ruler.",
  "s5022": "First year of Cai Lord Lu, Duke Jing's son.",
  "s5024": "Thirty-six, duke went to Jin.",
  "s5026": "First year of Wu Yu Mei",
  "s5034": "Twelve, Qi Ji caused disorder and self-established, King Ling committed suicide. Restored Chen and Cai.",
  "s5037": "Five, Chu King Ping restored Chen, established Duke Hui.",
  "s5038": "Two, Chu King Ping restored us, established Duke Jing's son Lu."
}