{
  "s0546": "Third month Bing Wu, Jin troops entered Cao, counted them with not used Xi Fu Ji words, used beautiful women rode chariots three hundred people.",
  "s0547": "Commanded army not enter Xi Fu Ji ancestor home to repay virtue.",
  "s0548": "Chu surrounded Song, Song again informed urgent Jin.",
  "s0549": "Wen Gong wished save then attack Chu, for Chu once had virtue, not wished attack;",
  "s0550": "wished release Song, Song also once had virtue at Jin: troubled it.",
  "s0551": "Xian Zhen said: 'Seize Cao Bo, divide Cao, Wei land to grant Song, Chu urgent Cao, Wei, its tendency suitable release Song.'",
  "s0552": "Then Wen Gong followed it, Chu Cheng Wang then led troops returned.",
  "s0553": "Chu general Zi Yu said: 'Wang met Jin extremely thick, now know Chu urgent Cao, Wei but purposely attack them, is light wang.'",
  "s0554": "Wang said: 'Jin Hou perished outside nineteen years, distressed long, indeed obtain return country, dangers straits completely know it, able use its people, heaven opened, not able resist.'",
  "s0555": "Zi Yu requested said: 'Not dare certainly have merit, wish with resolve slander wickedness mouths.'",
  "s0556": "Chu wang angered, little granted troops.",
  "s0557": "Then Zi Yu sent Wan Chun informed Jin: 'Please restore Wei Hou enfeoff Cao, minister also release Song.'",
  "s0558": "Jiu Fan said: 'Zi Yu without ritual, lord take one, minister take two, not permit.'",
  "s0559": "Xian Zhen said: 'Settle person called ritual.",
  "s0560": "Chu one word settle three countries, you one word perish them, I then without ritual.",
  "s0561": "Not permit Chu, is abandon Song.",
  "s0562": "Not like privately permit Cao, Wei to lure them, seize Wan Chun to anger Chu, already battle then after plan it.'",
  "s0563": "Jin Hou then imprisoned Wan Chun at Wei, moreover privately permitted restore Cao, Wei.",
  "s0564": "Cao, Wei informed cut with Chu.",
  "s0565": "Chu De Chen angered, attacked Jin army, Jin army retreated.",
  "s0566": "Army officers said: 'Why retreat?'",
  "s0567": "Wen Gong said: 'Formerly in Chu, agreed retreat three she, can double?'",
  "s0568": "Chu army wished leave, De Chen not willing.",
  "s0569": "Fourth month Wu Chen, Song Gong, Qi general, Qin general with Jin Hou next Cheng Pu.",
  "s0570": "Ji Si, with Chu troops combined battle, Chu troops defeated, De Chen gathered remaining troops left.",
  "s0571": "Jia Wu, Jin army returned to Heng Yong, made wang palace at Jian Tu.",
  "s0572": "Initially, Zheng assisted Chu, Chu defeated, feared, sent people requested ally Jin Hou.",
  "s0573": "Jin Hou with Zheng Bo allied.",
  "s0574": "Fifth month Ding Wei, offered Chu captives to Zhou, chariot horses hundred rode, foot soldiers thousand.",
  "s0575": "Heavenly son sent Wang Zi Hu commanded Jin Hou as Bo, granted great chariot, red bow arrows hundred, black bow arrows thousand, black millet wine one vessel, gui zan, tiger guards three hundred people.",
  "s0576": "Jin Hou three declined, then knocked head received it.",
  "s0577": "Zhou made Jin Wen Hou command: 'Wang if said: Father righteousness harmony, greatly manifest Wen, Wu, able careful bright virtue, illuminate ascend upper, spread hear lower, only time Shang Di gathered its command at Wen, Wu.",
  "s0578": "Relieve my body, continue my one person forever its in position.'",
  "s0579": "Then Jin Wen Gong called Bo.",
  "s0580": "Gui Hai, Wang Zi Hu allied feudal lords at wang court.",
  "s0581": "Jin burned Chu army, fire several days not extinguished, Wen Gong sighed.",
  "s0582": "Left right said: 'Conquered Chu lord still worried, why?'",
  "s0583": "Wen Gong said: 'I heard able battle conquer peaceful only sage person, so fear.",
  "s0584": "Moreover Zi Yu still in, how able happy!'",
  "s0585": "Zi Yu defeated returned, Chu Cheng Wang angered his not used his words, greedy with Jin battle, reprimanded blamed Zi Yu, Zi Yu suicide.",
  "s0586": "Jin Wen Gong said: 'I attacked their outer, Chu executed their inner, inner outer corresponded.'",
  "s0587": "Then happy.",
  "s0588": "Sixth month, Jin people again entered Wei Hou.",
  "s0589": "Ren Wu, Jin Hou crossed He Bei returned country.",
  "s0590": "Went reward, Hu Yan as head.",
  "s0591": "Someone said: 'Cheng Pu matter, Xian Zhen plan.'",
  "s0592": "Wen Gong said: 'Cheng Pu matter, Yan said me not lose trust.",
  "s0593": "Xian Zhen said 'military matters conquer as right', I used with conquer.",
  "s0594": "But this one time words, Yan words ten thousand generations merit, why with one time profit add ten thousand generations merit?'"
}
