{
  "s938": "Li.",
  "s939": "Lost this marquis's beginning uprising and extinction.",
  "s940": "Year 9 month 4 Wu Yin day, Deng Ruo year 1.",
  "s947": "Yi Ling.",
  "s948": "As Changsha Zhuguo became marquis, 1,500 households.",
  "s949": "Four. Year 9 month 9 Bing Zi day, Marquis Wu Cheng year 1.",
  "s950": "Three. Four. Year 4, Marquis Zhong year 1.",
  "s951": "Six. Year 7, Marquis Zhong died, no heir, state abolished. All lost posthumous names.",
  "s955": "One hundred thirty-four",
  "s956": "Xuanping.",
  "s957": "Troops initially rose, Zhang Er executed Qin, became chancellor, united various lords' troops at Julu, broke Qin pacified Zhao, became Changshan King. Chen Yu rebelled, attacked Er, abandoned country, with ministers returned to Han, Han pacified Zhao, became king. Died, son Ao succeeded. His minister Guan Gao not good, demoted to marquis.",
  "s958": "Four. Year 9 month 4, Marquis Wu Zhang Ao year 1.",
  "s959": "Seven",
  "s960": "Six. Xin Ping died, son Yan became Ru King, state abolished.",
  "s961": "Fifteen. Year 1, as former Ru King became Marquis of Nangong. Eight. Year 16, Marquis Ai Ou year 1.",
  "s962": "Nine. Seven. Zhong year 3, Marquis Sheng year 1.",
  "s963": "Seven. Committed crime, extinct. Suiyang eighteen. Yuanguang year 3, enfeoffed Yan's grandson Marquis Guang year 1. Thirteen. Yuanding year 2, Marquis Chang year 1. Taichu year 3, Marquis Chang as Grand Master of Ceremonies lacking sacrifice, state abolished.",
  "s964": "Three",
  "s965": "Dongyang.",
  "s966": "Gaozu year 6, became Central Grand Master, as Hexian governor attacked Chen Xi forceful battle with merit, became marquis, 1,300 households.",
  "s967": "Two. Year 11 month 12 Gui Si day, Marquis Wu Zhang Xiangru year 1.",
  "s968": "Seven",
  "s969": "Eight",
  "s970": "Fifteen. Five. Year 16, Marquis Gong Yin year 1. Three. After year 5, Marquis Dai An Guo year 1.",
  "s971": "Three. Thirteen. Year 4, Marquis Ai Qiang year 1.",
  "s972": "Jianyuan year 1, Marquis Qiang died, no heir, state abolished.",
  "s973": "One hundred eighteen",
  "s974": "Kaifeng.",
  "s975": "As Right Sima Han King year 5 initially followed, as Commandant attacked Yan, pacified Dai, became marquis, comparable to Marquis of Gong, 2,000 households.",
  "s976": "One. Year 11 month 12 Bing Chen day, Marquis Min Tao She year 1. One. Year 12, Marquis Yi Qing year 1.",
  "s977": "Seven",
  "s978": "Eight",
  "s979": "Twenty-three",
  "s980": "Nine. Jing period, became chancellor. Seven. Zhong year 3, Marquis Jie Yan year 1.",
  "s981": "Ten. Yuanguang year 5, Marquis Sui year 1. Eighteen. Yuanding year 5, Marquis Sui convicted of tribute gold, state abolished.",
  "s982": "One hundred fifteen",
  "s983": "Pei.",
  "s984": "Gaozu's elder brother Heyang Marquis Liu Zhong's son, became marquis.",
  "s985": "One. Year 11 month 12 Gui Si day, Marquis Liu Pi year 1. Year 12 month 10 Xin Chou day, Marquis Pi became Wu King, state abolished.",
  "s992": "Shen Yang.",
  "s993": "As Huaiyin retainer, reported Huaiyin Marquis Xin rebellion, became marquis, 2,000 households.",
  "s994": "Two. Year 11 month 12 Jia Yin day, Marquis Luan Shuo year 1.",
  "s995": "Seven",
  "s996": "Eight",
  "s997": "Twenty-two",
  "s998": "Twelve. Four. Zhong year 6, Marquis Jing Yuan Zhi year 1.",
  "s999": "Twenty-two. Jianyuan year 1, Marquis Mai Zhi year 1. Yuanshou year 5, Marquis Mai Zhi convicted of casting white gold executed in market, state abolished.",
  "s1000": "One hundred thirty-one",
  "s1001": "Hecheng.",
  "s1002": "As soldier Han year 5 initially followed, as palace attendant attacked Dai, beheaded Chen Xi, became marquis, 1,900 households."
}
