{
  "s172": "Five. Jianyu sixth year, Marquis Chi convicted of illegally purchasing fields and residences, and requesting officials' crimes, state abolished.",
  "s173": "Shan Du.",
  "s174": "In Gaozu fifth year served as Palace Attendant in the Column Orders, as Guard General attacked Chen Xi, used as Prime Minister of Liang, Marquis.",
  "s176": "Five. Fourth year fourth month bing shen, Marquis Zhen Wang Tian Kai first year.",
  "s177": "Three. Twenty. Fourth year, Marquis Hui Zhong Huang first year.",
  "s178": "Three. Thirteen. Fourth year, Marquis Jing Chu Long first year.",
  "s179": "Twenty-two. Yuanshou fifth year, Marquis Dang first year. Eight. Yuanfeng first year, Marquis Dang convicted of entering Shanglin Park with slaves, state abolished.",
  "s180": "Song Zi.",
  "s181": "When troops first arose, as attendant followed uprising in Pei, as Palace Attendant entered Han, returned, achieved merit in obtaining King of Yong Yan's family, used as Chancellor of Changshan, Marquis.",
  "s183": "Five. Fourth year fourth month bing shen, Marquis Yi Xu Li first year.",
  "s184": "Six. Seventeen. Seventh year, Marquis Kang Dao first year.",
  "s185": "Twelve. Four. Zhong sixth year, Marquis Yan first year.",
  "s186": "Five. Jianyu sixth year, Marquis Yan committed crime, state abolished.",
  "s187": "Cheng Tao.",
  "s188": "As soldier followed Gaozu uprising in Shanfu, became Lü clan attendant, achieved merit in escorting Empress Lü across the Huai, used as Governor of Henan, Marquis, five hundred households.",
  "s190": "Five. Fourth year fourth month bing shen, Marquis Yi Zhou Xin first year.",
  "s191": "Eleven. Twelfth year, Marquis Xiao Bo first year. Three. Fifteenth year, Marquis Bo committed crime, state abolished.",
  "s194": "Yu.",
  "s195": "As Lian Ao followed Gaozu breaking Qin, entered Han, as Colonel pacified the nobles, merit compared to Marquis of Chaoyang. Ying died, son Ta inherited merit, used as Grand Master of Ceremonies, Marquis.",
  "s197": "Four. Fourth year fourth month bing shen, Marquis Lü Ta first year. Eighth year, Marquis Ta convicted of Lü clan affairs, executed, state abolished.",
  "s201": "Teng.",
  "s202": "As attendant, Palace Attendant, twelve years, as Colonel garrisoned Bashang, used as Prime Minister of Chu, Marquis.",
  "s204": "Four. Fourth year fourth month bing shen, Marquis Lü Geng Shi first year. Eighth year, Marquis Geng Shi convicted of Lü clan affairs, executed, state abolished.",
  "s208": "Li Ling.",
  "s209": "As soldier followed, Han King second year first uprising in Queyang, as soldier official attacked Xiang Ji, became Colonel of Henan, used as Prime Minister of Changsha, Marquis, six hundred households.",
  "s211": "Five. Fourth year fourth month bing shen, Marquis Yue first year.",
  "s212": "Three. Fourth year, Marquis Yue committed crime, state abolished.",
  "s215": "Lü Cheng",
  "s216": "Empress Lü's younger brother's son, Marquis.",
  "s218": "Four. Fourth year fourth month bing shen, Marquis Lü Fen first year. Eighth year, Marquis Fen convicted of Lü clan affairs, executed, state abolished.",
  "s222": "Dong Mou.",
  "s223": "Son of King Dao Hui of Qi, Marquis.",
  "s225": "Three. Sixth year fourth month ding you, Marquis Liu Xing Ju first year.",
  "s226": "One. Second year, Marquis Xing Ju became King of Jibei, state abolished.",
  "s229": "Chui.",
  "s230": "Son of Lü Su Wang, Marquis.",
  "s232": "Two. Sixth year fourth month ding you, Marquis Lü Tong first year. Eighth year, Marquis Tong became King of Yan, convicted of Lü clan affairs, state abolished.",
  "s236": "Xin Du.",
  "s237": "As son of Zhang Ao and Empress Yuan of Lu, Marquis.",
  "s239": "One. Eighth year fourth month ding you, Marquis Zhang Chi first year.",
  "s240": "First year, Marquis Chi committed crime, state abolished.",
  "s243": "Le Chang",
  "s244": "As son of Zhang Ao and Empress Yuan of Lu, Marquis.",
  "s246": "One. Eighth year fourth month ding you, Marquis Zhang Shou first year.",
  "s247": "First year, Marquis Shou committed crime, state abolished.",
  "s250": "Zhu Zi.",
  "s251": "Empress Lü's younger brother's son, Marquis.",
  "s253": "Eighth year fourth month ding you, Marquis Lü Rong first year. Convicted of Lü clan affairs, executed, state abolished.",
  "s257": "Jian Ling.",
  "s258": "As Grand Herald, Marquis, eunuch, possessed many unusual strategies."
}
