{
  "s0400": "Jiu Fan said: 'Matter not succeed, Fan meat stinking foul, what sufficient eat!'",
  "s0401": "Then stopped, went.",
  "s0402": "Passed Cao, Cao Gong Gong not ritual, wished observe Chong Er joined ribs.",
  "s0403": "Cao grand master Xi Fu Ji said: 'Jin gong zi worthy, moreover same surname, poor come pass us, why not ritual!'",
  "s0404": "Gong Gong not followed his plan.",
  "s0405": "Fu Ji then privately sent Chong Er food, placed jade its below.",
  "s0406": "Chong Er received his food, returned his jade.",
  "s0407": "Left, passed Song.",
  "s0408": "Song Xiang Gong newly distressed troops at Chu, injured at Hong, heard Chong Er worthy, then with country ritual ritual Chong Er.",
  "s0409": "Song commander Gong Sun Gu good with Jiu Fan, said: 'Song small country newly distressed, not sufficient seek enter, change to great country.'",
  "s0410": "Then left.",
  "s0411": "Passed Zheng, Zheng Wen Gong not ritual.",
  "s0412": "Zheng Shu Zhan advised his lord said: 'Jin gong zi worthy, his followers all country ministers, moreover same surname.",
  "s0413": "Zheng come out from Li Wang, Jin come out from Wu Wang.'",
  "s0414": "Zheng lord said: 'Feudal lords perished gong zi pass here many, how able completely ritual!'",
  "s0415": "Shu Zhan said: 'Lord not ritual, not like kill him, moreover after for country calamity.'",
  "s0416": "Zheng lord not listened.",
  "s0417": "Chong Er left to Chu, Chu Cheng Wang with proper feudal lords ritual treated him, Chong Er declined not dare receive.",
  "s0418": "Zhao Shuai said: 'You perished outside ten remaining years, small countries light you, moreover great countries? Now Chu great country firmly meet you, you their not yield, this heaven open you.'",
  "s0419": "Then with guest ritual saw him.",
  "s0420": "Cheng Wang thick treated Chong Er, Chong Er very humble.",
  "s0421": "Cheng Wang said: 'You if return country, what with report me?'",
  "s0422": "Chong Er said: 'Feathers fur teeth horns jade silks, lord wang remaining, not know what with report.'",
  "s0423": "Wang said: 'Although, what with report not gu?'",
  "s0424": "Chong Er said: 'If not able avoid, with lord wang with war chariots assemble plains broad marshes, please avoid wang three she.'",
  "s0425": "Chu general Zi Yu angered said: 'Wang meet Jin gong zi extremely thick, now Chong Er speak not respectful, please kill him.'",
  "s0426": "Cheng Wang said: 'Jin gong zi worthy困 outside long, followers all country vessels, this heaven placed, how able kill?",
  "s0427": "Moreover words what with change!'",
  "s0428": "Resided Chu several months, Jin crown prince Yu perished Qin, Qin resented it;",
  "s0429": "heard Chong Er in Chu, then summoned him.",
  "s0430": "Cheng Wang said: 'Chu far, change several countries to Jin.",
  "s0431": "Qin Jin connect borders, Qin lord worthy, you their strive go!'",
  "s0432": "Thick sent Chong Er.",
  "s0433": "Chong Er to Qin, Mu Gong with clan women five people wife Chong Er, former Zi Yu wife with went.",
  "s0434": "Chong Er not wished receive, Si Kong Ji Zi said: 'Its country moreover attack, moreover its former wife?",
  "s0435": "Moreover receive to tie Qin relatives seek enter, you then constrain small ritual, forget great shame?'",
  "s0436": "Then received.",
  "s0437": "Mu Gong great happy, with Chong Er drank.",
  "s0438": "Zhao Shuai sang Shu Miao poem.",
  "s0439": "Mu Gong said: 'Know you wish urgent return country.'",
  "s0440": "Zhao Shuai with Chong Er descended, again bowed said: 'Orphan minister look up lord, like hundred grains hope timely rain.'",
  "s0441": "At time Jin Hui Gong fourteenth year autumn.",
  "s0442": "Hui Gong with ninth month died, Zi Yu established.",
  "s0443": "Eleventh month, buried Hui Gong.",
  "s0444": "Twelfth month, Jin country grand masters Luan, Xi etc. heard Chong Er in Qin, all secretly came urged Chong Er, Zhao Shuai etc. return country, as inner support very many.",
  "s0445": "Then Qin Mu Gong sent troops with Chong Er return Jin.",
  "s0446": "Jin heard Qin troops come, also sent troops resisted him.",
  "s0447": "But all secretly knew gong zi Chong Er entered."
}
