{
  "s0150": "Shi returned, again farmed pastured.",
  "s0151": "Year plus, met army frequently out, Hunye King etc. surrendered, county officials expenses many, storehouses empty.",
  "s0152": "Next year, poor people greatly moved, all dependent on county officials, no way to completely support.",
  "s0153": "Bu Shi held twenty thousand money gave to Henan governor, to supply moved people.",
  "s0154": "Henan memorialed rich people helping poor registers, emperor saw Bu Shi name, recognized it, said 'this solid formerly wished to deliver half family aid border', then granted Shi outer labor four hundred people.",
  "s0155": "Shi again completely returned to county officials.",
  "s0156": "At this time rich powerful all competed to hide wealth, only Shi especially wished to deliver to aid expenses.",
  "s0157": "Emperor therefore took Shi as finally elder, honored displayed to encourage the people.",
  "s0158": "Initially, Shi not wish to be gentleman.",
  "s0159": "Emperor said: 'I have sheep in Shanglin, wish make you pasture them.'",
  "s0160": "Shi then appointed as gentleman, cloth clothes straw sandals pastured sheep.",
  "s0161": "Year plus, sheep fat increased.",
  "s0162": "Emperor passed saw his sheep, praised them.",
  "s0163": "Shi said: 'Not only sheep, governing people also like this.",
  "s0164": "With timing rise rest;",
  "s0165": "bad then expel remove, not let ruin group.'",
  "s0166": "Emperor took Shi as strange, appointed as Gou Shi magistrate tested him, Gou Shi benefited.",
  "s0167": "Promoted to Chenggao magistrate, transport most excellent.",
  "s0168": "Emperor considered Shi simple loyal, appointed as Qi King great tutor.",
  "s0169": "Kong Jin's sent realm to cast make utensils, three years appointed as great agronomist, ranked among nine ministers.",
  "s0170": "Sang Hong Yang as great agronomist vice, managed various accounting affairs, gradually established equal transport to circulate goods.",
  "s0171": "Began ordered officials able enter grain supplement officials, gentlemen to six hundred shi.",
  "s0172": "From making white gold five zhu money after five years, pardoned officials people sentenced stealing cast gold money death several tens of thousands.",
  "s0173": "Those not discovered mutually killed, countless.",
  "s0174": "Pardoned self coming out over one hundred thousand.",
  "s0175": "But could not half self come out, realm generally no worry all cast gold money.",
  "s0176": "Violators many, officials could not exhaust punish take, sent doctor Chu Da, Xu Yan etc. divided groups tour commanderies kingdoms, raised monopoly followers governors officials taking profit.",
  "s0177": "Censor-in-chief Zhang Tang just honored used affairs, reduced Xuan, Du Zhou etc. as central vice, Yi Zong, Yin Qi, Wang Wen Shu etc. used cruel urgent harsh deep as nine ministers, direct finger Xia Lan etc. began emerge.",
  "s0178": "Great agronomist Yan Yi executed.",
  "s0179": "Initially, Yi as Jinan pavilion chief, with integrity straight gradually promoted to nine ministers.",
  "s0180": "Emperor with Zhang Tang made white deer skin currency, asked Yi.",
  "s0181": "Yi said: 'Now kings marquises morning congratulations with blue jade, worth several thousand, their skin mats instead forty thousand, root tip not matching.'",
  "s0182": "Emperor not pleased.",
  "s0183": "Zhang Tang moreover with Yi had grudge, when someone accused Yi with other discussions, matter sent Zhang Tang govern Yi.",
  "s0184": "Yi spoke with guest, guest spoke initial order down had inconvenient, Yi not respond, slightly curled lips.",
  "s0185": "Tang memorialed should Yi nine ministers seeing order inconvenient, not enter speak but abdominal slander, sentenced death.",
  "s0186": "From this after, had abdominal slander law, ministers grand masters many flattered sought favor.",
  "s0187": "Emperor having issued string money order and honored Bu Shi, people finally not divided wealth aided county officials, then Yang Ke informed string money released.",
  "s0188": "Commanderies kingdoms many evil cast money, money many light, ministers requested order capital cast bell official red side, one equal five, assigned official use not red side not able proceed.",
  "s0189": "White gold gradually cheap, people not treasured used, county officials with orders prohibited, no benefit.",
  "s0190": "Year plus, white gold finally abolished not proceeded.",
  "s0191": "This year, Zhang Tang died but people not thought of him.",
  "s0192": "After two years, red side money cheap, people clever law used it, inconvenient, again abolished.",
  "s0193": "Therefore completely prohibited commanderies kingdoms no cast money, specially ordered Shanglin three officials cast.",
  "s0194": "Money already many, ordered realm not three officials money not able proceed, various commanderies kingdoms previous cast money all abolished melted, transported their copper to three officials.",
  "s0195": "People casting money increasingly few, calculated expenses could not match, only true craftsmen great evil then stole made it.",
  "s0196": "Bu Shi chancellor Qi, Yang Ke informed string money throughout realm, middle families above generally all encountered information.",
  "s0197": "Du Zhou governed them, prisons few reversed.",
  "s0198": "Then divided sent censor court judge supervisors divided groups went, immediately governed commanderies kingdoms string money, got people wealth goods counted in hundreds of millions, slaves girls thousand million number, fields large counties several hundred qing, small counties hundred plus qing, residences also like."
}
