{
  "s0707": "The dowager said: 'This old woman cannot.'",
  "s0708": "The dowager's discordant expression somewhat lessened.",
  "s0709": "The left mentor, Lord Gong, said: 'My humble youngest son Shu Qi is most unworthy, but I am old, and I secretly cherish and love him. I wish to obtain a vacancy in the black-clad guards to protect the palace, risking death to inform you.'",
  "s0710": "The dowager said: 'I respectfully accept.",
  "s0711": "How old is he?'",
  "s0712": "He replied: 'Fifteen years old.",
  "s0713": "Though young, I wish to entrust him before I fill the ditch.'",
  "s0714": "The dowager said: 'Do men also love their young sons?'",
  "s0715": "He replied: 'Even more than women.'",
  "s0716": "The dowager smiled and said: 'Women are quite different.'",
  "s0717": "He replied: 'I secretly think your love for the Queen of Yan is wiser than for Lord Chang'an.'",
  "s0718": "The dowager said: 'You are mistaken - it is not as much as for Lord Chang'an.'",
  "s0719": "The left mentor said: 'When parents love their children, they plan far ahead.",
  "s0720": "When you sent the Queen of Yan off, holding her heels, weeping for her, you remembered her distance, and pitied her.",
  "s0721": "After she left, though not forgetting her, you prayed during sacrifices, saying 'May she never return,' which was surely planning for long duration, to enable her descendants to succeed as kings.'",
  "s0722": "The dowager said: 'Yes.'",
  "s0723": "The left mentor said: 'Now, three generations ago, to the sons of the Zhao lords who became marquises, are any of their descendants still there?'",
  "s0724": "She said: 'None.'",
  "s0725": "He said: 'Not only Zhao, are there any among the other lords?'",
  "s0726": "She said: 'This old woman has not heard.'",
  "s0727": "He said: 'This is because the harm comes close to their own bodies, far away to their sons and grandsons.",
  "s0728": "Why are the sons of rulers not good when they become marquises?",
  "s0729": "Their positions are honored but without merit, their support is thick but without labor, and they hold heavy vessels in multitude.'",
  "s0730": "Now you honor Lord Chang'an's position, and enfeoff him with fertile lands, giving him many heavy vessels, but not allowing him to establish merit for the state at once. When the imperial tomb collapses, how can Lord Chang'an rely on himself in Zhao?'",
  "s0731": "The old minister thinks your planning for Lord Chang'an is short-sighted, so I say your love is not as good as for the Queen of Yan.'",
  "s0732": "The dowager said: 'Yes, I leave it to you to do as you wish.'",
  "s0733": "Thus they prepared a hundred chariots for Lord Chang'an, and sent hostages to Qi. The Qi troops then came out.",
  "s0734": "Zi Yi heard of it and said: 'The ruler's son is close flesh and blood, yet cannot hold honored positions without merit, support without labor, to guard gold and jade treasures, and moreover for me?'",
  "s0735": "He committed suicide.",
  "s0736": "Qi general Tian Dan led Zhao troops and attacked Yan's Zhongyang, capturing it.",
  "s0737": "He also attacked Yan's Han Zhu Ren, capturing it.",
  "s0738": "In the second year, Empress Huiwen died.",
  "s0739": "Tian Dan became prime minister.",
  "s0740": "In the fourth year, the king dreamed he wore a one-sided garment, rode a flying dragon up to heaven, but did not reach it and fell, seeing piles of gold and jade like mountains.",
  "s0741": "The next day, the king summoned the divination master Gan to interpret it, saying: 'Dreaming of wearing a one-sided garment means mutilation.",
  "s0742": "Riding a flying dragon up to heaven but not reaching and falling means having energy but no substance.",
  "s0743": "Seeing piles of gold and jade like mountains means worry.'",
  "s0744": "Three days later, the guard of Han's Shangdang, Feng Ting, sent an envoy saying: 'Han cannot defend Shangdang and will give it to Qin.",
  "s0745": "Its officials and people all prefer to be Zhao, not wishing to be Qin.",
  "s0746": "There are seventeen cities and towns, I bow twice and offer them to Zhao, and wish the king to reward the officials and people.'",
  "s0747": "The king was greatly delighted and summoned Lord Pingyang Bao to tell him: 'Feng Ting offers seventeen cities and towns - what do you think of accepting them?'",
  "s0748": "He replied: 'The sage avoids unexpected profits.'",
  "s0749": "The king said: 'People cherish my virtue - why call it unexpected?'",
  "s0750": "He replied: 'Qin nibbles away at Han's territory, cutting it off so neighboring states cannot connect, believing they can sit and receive Shangdang's territory.",
  "s0751": "Han gives up the effort to Qin, and Zhao receives the benefit. Though strong and great, they cannot obtain it from the weak, but the weak will obtain it from the strong - how can this not be unexpected profit?'",
  "s0752": "Moreover, Qin uses the water of Niu Tian to transport grain, nibbling like a silkworm, with superior forces doubling in battle, tearing apart the great state's territory, their government effective, so they cannot be contended with.'",
  "s0753": "The king said: 'Now if we send a million troops and attack for a year or two without taking one city, now they offer seventeen cities and towns as gifts to my state - this is great profit.'",
  "s0754": "Lord Pingyang went out, and the king summoned Lord Pingyuan and Zhao Yu to tell them.",
  "s0755": "Lord Pingyuan said: 'Accepting it is beneficial.'",
  "s0756": "Zhao Yu said: 'Accepting it is harmful.'",
  "s0757": "The king said: 'How do you see it?'",
  "s0758": "Zhao Yu said: 'Han gives Shangdang to Qin, but the people do not wish to be Qin, so they give it to Zhao. If Zhao does not accept, the people will resent Zhao. If we accept, Qin will be angry and attack, and Zhao will bear the harm.",
  "s0759": "Not accepting Shangdang, Qin and Han will fight, Zhao can sit and watch the profit. This is the plan of the hegemon.'",
  "s0760": "The king said: 'Good.'",
  "s0761": "He did not accept and sent it back.",
  "s0762": "Feng Ting indeed gave Shangdang to Qin.",
  "s0763": "Qin sent Bai Qi to attack Han at Shangdang.",
  "s0764": "Zhao sent troops to rescue, fighting with Qin at Changping.",
  "s0765": "Zhao general Lian Po led troops to defend Changping.",
  "s0766": "Qin general Wang He attacked Zhao, defeating them.",
  "s0767": "Zhao changed generals, sending Zhao Kuo.",
  "s0768": "Zhao Kuo defeated Qin, killing Qin general Hu Yang.",
  "s0769": "Wang He again attacked Zhao Kuo, surrounding him at Changping.",
  "s0770": "Zhao Kuo was short of food, dug deeper, fought desperately, but was defeated.",
  "s0771": "Zhao Kuo was killed, and forty thousand Zhao troops surrendered to Qin.",
  "s0772": "Wang He had them buried alive.",
  "s0773": "Zhao people were angry, and the king wanted to kill Lian Po.",
  "s0774": "Lian Po fled to Wei.",
  "s0775": "The king made Zhao Sheng prime minister, calling him Lord Ma Fuzi.",
  "s0776": "Lord Ma Fuzi was jealous of Lian Po's merit."
}