{
  "s0201": "Its winter, Jin extinguished Guo, Guo Gong Chou fled Zhou.",
  "s0202": "Returned, attacked extinguished Yu, captured Yu Gong and his grand master Jing Bo Bai Li Xi to send Qin Mu Ji, repaired Yu sacrifices.",
  "s0203": "Xun Xi led previously left Yu Qu produce chariot presented to Xian Gong, Xian Gong laughed said: 'Horse then my horse, teeth also old!'",
  "s0205": "Twenty-third year, Xian Gong then sent Jia Hua etc. attack Qu, Qu collapsed.",
  "s0206": "Yi Wu about flee Di.",
  "s0207": "Ji Rui said: 'Not able, Chong Er already there, now go, Jin must shift troops attack Di, Di fear Jin, calamity will reach.",
  "s0208": "Not like flee Liang, Liang near Qin, Qin strong, our lord hundred years after can seek enter.'",
  "s0209": "Then fled Liang.",
  "s0210": "Twenty-fifth year, Jin attacked Di, Di because Chong Er reason, also attacked Jin at Nie Sang, Jin troops dispersed left.",
  "s0211": "When this time, Jin strong, west had He Xi, bordered Qin, north bordered Di, east to He Nei.",
  "s0212": "Li Ji younger brother gave birth Dao Zi.",
  "s0213": "Twenty-sixth year summer, Qi Huan Gong great assembly feudal lords at Kui Qiu.",
  "s0214": "Jin Xian Gong ill, traveled after, not arrived, met Zhou steward Kong.",
  "s0215": "Steward Kong said: 'Qi Huan Gong increasingly arrogant, not attend virtue attend far strategy, feudal lords not peaceful.",
  "s0216": "Lord younger brother not assemble, no harm Jin.'",
  "s0217": "Xian Gong also ill, again returned home.",
  "s0218": "Ill serious, then told Xun Xi said: 'I with Xi Qi as successor, year young, various ministers not submit, fear disorder rise, you able establish him?'",
  "s0219": "Xun Xi said: 'Able.'",
  "s0220": "Xian Gong said: 'What use as proof?'",
  "s0221": "Answered said: 'Make dead revive, living not ashamed, for proof.'",
  "s0222": "Then entrusted Xi Qi to Xun Xi.",
  "s0223": "Xun Xi as chancellor, main country government.",
  "s0224": "Autumn ninth month, Xian Gong died.",
  "s0225": "Li Ke, Pi Zheng wished inner Chong Er, with three gong zi followers make disorder, told Xun Xi said: 'Three resentments will rise, Qin, Jin assist them, you will what like?'",
  "s0226": "Xun Xi said: 'I not able betray previous lord words.'",
  "s0227": "Tenth month, Li Ke killed Xi Qi at mourning place, Xian Gong not buried.",
  "s0228": "Xun Xi about die it, someone said not like establish Xi Qi younger brother Dao Zi assist him, Xun Xi established Dao Zi buried Xian Gong.",
  "s0229": "Eleventh month, Li Ke assassinated Dao Zi at court, Xun Xi died it.",
  "s0230": "Jun Zi said: 'Shi so called 'white gui flaw, still able grind, this words flaw, not able do', its Xun Xi called!",
  "s0231": "Not betray his words.'",
  "s0232": "Initially, Xian Gong about attack Li Rong, divined said 'teeth for calamity'.",
  "s0233": "And broke Li Rong, obtained Li Ji, loved her, finally with disorder Jin.",
  "s0234": "Li Ke etc. already killed Xi Qi, Dao Zi, sent people welcome gong zi Chong Er from Di, wished establish him.",
  "s0235": "Chong Er declined said: 'Bear father command exit flee, father died not able cultivate person son ritual serve mourning, Chong Er what dare enter!",
  "s0236": "Grand masters their change establish other son.'",
  "s0237": "Returned reported Li Ke, Li Ke sent welcome Yi Wu from Liang.",
  "s0238": "Yi Wu wished go, Lu Sheng, Xi Rui said: 'Inner still has gong zi able establish but outside seek, difficult believe.",
  "s0239": "Plot not at Qin, assist strong country awe enter, fear dangerous.'",
  "s0240": "Then sent Xi Rui thick bribe Qin, agreed said: 'If obtain enter, please with Jin He Xi land give Qin.'",
  "s0241": "And sent Li Ke letter said: 'Truly obtain establish, please then enfeoff son at Fen Yang city.'",
  "s0242": "Qin Mu Gong then sent troops sent Yi Wu to Jin.",
  "s0243": "Qi Huan Gong heard Jin inner disorder, also led feudal lords like Jin.",
  "s0244": "Qin troops with Yi Wu also arrived Jin, Qi then sent Xi Peng assemble Qin together enter Yi Wu, established as Jin lord, this was Hui Gong.",
  "s0245": "Qi Huan Gong to Jin Gao Liang returned home.",
  "s0246": "Hui Gong Yi Wu first year, sent Pi Zheng thank Qin said: 'Initially Yi Wu with He Xi land permitted lord, now fortunately obtained enter establish.",
  "s0247": "Ministers said: 'Land previous lord land, lord perished outside, what with obtain monopolize permit Qin?'",
  "s0248": "I contended it not able obtain, so thank Qin.'",
  "s0249": "Also not gave Li Ke Fen Yang city, robbed his authority.",
  "s0250": "Fourth month, Zhou Xiang Wang sent Zhou Gong Ji Fu assemble Qi, Qin grand masters together ritual Jin Hui Gong."
}
