{
  "s0150": "Merit great then music complete, governance clear then ritual complete.",
  "s0151": "Shield axe dance, not complete music;",
  "s0152": "Cook sacrifice, not reach ritual.",
  "s0153": "Five Emperors different times, not continue music;",
  "s0154": "Three Kings different ages, not imitate ritual.",
  "s0155": "Music extreme then worry, ritual crude then partial.",
  "s0156": "Reach sincere music without worry, ritual complete without partial, its only great sage?",
  "s0157": "Heaven high earth low, ten thousand things scattered different, ritual system carries;",
  "s0158": "Flows without cease, unites contracts transforms, music arises.",
  "s0159": "Spring makes summer grows, benevolence;",
  "s0160": "Autumn gathers winter stores, righteousness.",
  "s0161": "Benevolence close to music, righteousness close to ritual.",
  "s0162": "Music sincere harmony, leads spirits follows heaven;",
  "s0163": "Ritual distinguishes suitable, dwells ghosts follows earth.",
  "s0164": "Thus sages make music to respond heaven, make ritual to match earth.",
  "s0165": "Ritual music clear complete, heaven earth official.",
  "s0166": "Heaven honored earth humble, ruler minister settled.",
  "s0167": "High low already displayed, noble base positioned.",
  "s0168": "Movement stillness have constant, small large different.",
  "s0169": "Directions by kind gather, things by group divide, then life nature different.",
  "s0170": "In heaven forms images, on earth forms shapes, thus ritual heaven earth's distinction.",
  "s0171": "Earth qi ascends, heaven qi descends, yin yang mutually rub, heaven earth mutually surge, drums with thunder, rouses with wind rain, moves with four seasons, warms with sun moon, hundred things transform arise, thus music heaven earth's harmony.",
  "s0172": "Transform not timely then not born, male female no distinction then chaos ascends, this heaven earth's feelings.",
  "s0173": "Reach ritual music's extreme heaven coil earth, walk yin yang connect ghosts spirits, exhaust high extreme far measure deep thick, music manifests great beginning ritual dwells completed things.",
  "s0174": "Manifest not cease heaven, manifest not move earth.",
  "s0175": "One move one still, heaven earth's between.",
  "s0176": "Thus sages say 'ritual cloud music cloud'.",
  "s0177": "Former Shun made five string qin, to sing southern wind;",
  "s0178": "Kui first made music, to reward feudal lords.",
  "s0179": "Thus Son of Heaven makes music, to reward feudal lords who have virtue.",
  "s0180": "Virtue flourishing teaching honored, five grains timely ripe, then reward with music.",
  "s0181": "Thus govern people toil, their dance steps grade far;",
  "s0182": "Govern people ease, their dance steps grade short.",
  "s0183": "Thus observe dance know virtue, hear posthumous know conduct.",
  "s0184": "Great Zhang, zhang it;",
  "s0185": "Xian Chi, complete;",
  "s0186": "Shao, continue;",
  "s0187": "Xia, great;",
  "s0188": "Yin Zhou music exhaust.",
  "s0189": "Heaven earth's way, cold heat not timely then illness, wind rain not measure then famine.",
  "s0190": "Teaching, people's cold heat, teaching not timely then harm age.",
  "s0191": "Affairs, people's wind rain, affairs not measure then no merit.",
  "s0192": "Thus then former kings make music, with law governs, good then conduct symbolizes virtue.",
  "s0193": "Raise pigs for wine, not for calamity;",
  "s0194": "But lawsuits increasingly frequent, then wine flow gives birth calamity.",
  "s0195": "Thus former kings because wine ritual, one offering ritual, guest host hundred bows, end day drink wine not get drunk, this former kings prepare wine calamity.",
  "s0196": "Thus wine food, to unite joy.",
  "s0197": "Music, to symbolize virtue;",
  "s0198": "Ritual, to close licentious.",
  "s0199": "Thus former kings have great affairs, must have ritual to mourn them;"
}
