{
  "s0001": "Since ancient times, have the emperors and kings who received the mandate of heaven ever failed to perform the feng and shan sacrifices?",
  "s0002": "There have been cases where they performed the rituals without receiving the appropriate omens, but never have there been cases where auspicious signs appeared and they did not proceed to Mount Tai.",
  "s0003": "Even those who received the mandate but whose achievements were insufficient, or those who reached Mount Li but whose virtue was not all-encompassing, or those whose virtue was all-encompassing but who lacked sufficient time - these are the reasons why the rituals were performed rarely.",
  "s0004": "The Classic says: 'If for three years the rites are not performed, the rites will surely be abolished;",
  "s0005": "if for three years the music is not performed, the music will surely be ruined.'",
  "s0006": "In times of flourishing dynasties, the feng and shan sacrifices respond accordingly; in times of decline, they cease.",
  "s0007": "The longest gaps lasted over a thousand years, the shortest several hundred years, so their ceremonies have become lost and obscured, and their details can no longer be recorded or transmitted.",
  "s0008": "The Classic says that Shun, using the jade disks and jade staff, aligned the seven celestial bodies.",
  "s0009": "He then offered sacrifices to the Supreme Deity, made offerings to the Six Honored Ones, gazed upon the mountains and rivers, and paid respects to all the spirits.",
  "s0010": "He gathered the five auspicious symbols, chose an auspicious month and day, met with the four mountain lords and the regional governors, and returned the symbols.",
  "s0011": "In the second month, he toured the east, arriving at Mount Dai.",
  "s0012": "Mount Dai is Mount Tai.",
  "s0013": "He made burnt offerings and gazed in order upon the mountains and rivers.",
  "s0014": "He then held court with the eastern lords.",
  "s0015": "The eastern lords were the feudal lords.",
  "s0016": "He harmonized the seasons, months, and days; unified the pitch pipes, measures, and weights; and refined the five rites with five jades, three silks, two living creatures, and one dead offering.",
  "s0017": "In the fifth month, he toured to the southern peak.",
  "s0018": "The southern peak is Mount Heng.",
  "s0019": "In the eighth month, he toured to the western peak.",
  "s0020": "The western peak is Mount Hua.",
  "s0021": "In the eleventh month, he toured to the northern peak.",
  "s0022": "The northern peak is Mount Heng.",
  "s0023": "All followed the same rituals as at Mount Dai.",
  "s0024": "The central peak is Mount Song.",
  "s0025": "He toured once every five years.",
  "s0026": "Yu followed these practices.",
  "s0027": "Fourteen generations later, during the reign of Emperor Kong Jia, his virtue became decadent and he favored spirits excessively, so the spirits abandoned him, and two dragons departed.",
  "s0028": "Three generations later, Tang attacked Jie and wanted to move the Xia altar, but it could not be moved, so he created a Xia altar.",
  "s0029": "Eight generations later, during the reign of Emperor Tai Wu, a mulberry tree and a grain plant grew in the courtyard, growing to the size of a large embrace overnight, which frightened him.",
  "s0030": "Yi Zhi said: 'Monsters cannot overcome virtue.'",
  "s0031": "Tai Wu cultivated virtue, and the mulberry and grain died.",
  "s0032": "Yi Zhi praised Wu Xian, and Wu Xian's rise began from this time.",
  "s0033": "Fourteen generations later, Emperor Wu Ding obtained Fu Yue as his chancellor, and Yin was revived, and he was called Gao Zong.",
  "s0034": "A pheasant perched on the cauldron's handle and crowed, which frightened Wu Ding.",
  "s0035": "Zu Ji said: 'Cultivate virtue.'",
  "s0036": "Wu Ding followed this advice, and his position was permanently secure.",
  "s0037": "Five generations later, Emperor Wu Yi offended the spirits and was killed by lightning.",
  "s0038": "Three generations later, Emperor Zhou was decadent and chaotic, and King Wu attacked him.",
  "s0039": "From this we can see that at the beginning they were never irreverent toward the spirits, but later they gradually became negligent.",
  "s0040": "The Zhou officials said that on the winter solstice, they sacrificed to heaven in the southern suburbs to welcome the lengthening days;",
  "s0041": "on the summer solstice, they sacrificed to the earth spirits.",
  "s0042": "They all used music and dance, and only then could the spirits be approached and the rites performed.",
  "s0043": "The Son of Heaven sacrificed to the famous mountains and great rivers of the realm. The Five Peaks were treated like the Three Dukes, the Four Rivers like the feudal lords, and the feudal lords sacrificed to the famous mountains and great rivers within their territories.",
  "s0044": "The Four Rivers are the Yangtze, Yellow River, Huai, and Ji.",
  "s0045": "The Son of Heaven called it the Bright Hall and the Universal School, the feudal lords called it the Half Moon Palace.",
  "s0046": "After the Duke of Zhou assisted King Cheng, he performed suburban sacrifices to Hou Ji to match heaven, and ancestral sacrifices to King Wen in the Bright Hall to match the Supreme Deity.",
  "s0047": "Since Yu rose and established the altar sacrifices, and Hou Ji farmed, there were grain sacrifices, and the origins of suburban and altar sacrifices go back to ancient times.",
  "s0048": "After the Zhou conquered Yin, fourteen generations passed, and the dynasty gradually declined. Rites and music were abandoned, the feudal lords acted wantonly, and King You was defeated by the Dog Rong, so the Zhou moved east to Luoyi.",
  "s0049": "Duke Xiang of Qin attacked the Rong to save Zhou, and began to be ranked among the feudal lords."
}
