{
  "s4854": "Two, duke went to Jin, reached river, Jin apologized and returned him.",
  "s4855": "Eight, Tian Wu Yu sent woman.",
  "s5040": "First year of Duke Ding of Zheng (Ning)",
  "s5050": "First year of King Ping of Chu (Ju), Gong Wang's son, Bao Yu.",
  "s5057": "First year of Duke Gong of Yan",
  "s5060": "Jia Xu",
  "s5061": "Eighteen, queen's crown prince died.",
  "s5062": "Fifteen, solar eclipse. Duke went to Jin, Jin detained him for burial, duke was ashamed.",
  "s5066": "Two, king took Qin woman for crown prince, favored her, took her himself.",
  "s5071": "First year of Duke Ping of Cao (Xu)",
  "s5080": "Six, duke died. Six ministers strong, ducal house lowly.",
  "s5090": "First year of Wu Liao",
  "s5094": "Seventeen, fifth month new moon, solar eclipse. Comet seen at Chen.",
  "s5096": "First year of Duke Qing of Jin (Qu Ji)",
  "s5098": "Four, fought with Wu.",
  "s5104": "Five, fire, wished to exorcise it, Zi Chan said: better to cultivate virtue.",
  "s5106": "Two, fought with Chu.",
  "s5115": "Eight, fire.",
  "s5116": "Eleven, fire.",
  "s5117": "Ten, fire.",
  "s5119": "Four, Duke Ping died.",
  "s5120": "Six, fire.",
  "s5121": "Five, Duke Gong died.",
  "s5126": "Nineteen, earthquake.",
  "s5135": "First year of Duke Dao of Cao (Wu)",
  "s5137": "First year of Duke Ping of Yan",
  "s5142": "Twenty, Qi Duke Jing hunted with Yan Ying, entered Lu to ask about ritual.",
  "s5143": "Twenty-six, hunted Lu borders, thereby entered Lu.",
  "s5146": "Seven, executed Wu She and Shang, crown prince Jian fled to Song, Wu Xu fled to Wu.",
  "s5147": "Ten, duke did not believe. Falsely killed various princes. Chu crown prince Jian came fleeing, saw disorder, went to Zheng.",
  "s5150": "Nine, Duke Ping died. Ling Hou's grandson Dong Guo killed Ping Hou's son and self-established.",
  "s5152": "Eight, Chu crown prince Jian came fleeing from Song.",
  "s5154": "Five, Wu Yuan came fleeing.",
  "s5158": "Twenty-one, duke went to Jin to river, Jin apologized, returned. Solar eclipse.",
  "s5162": "Eight, Cai lord came fleeing.",
  "s5166": "First year of Cai Dao Hou Dong Guo, fled to Chu.",
  "s5174": "Twenty-two, solar eclipse.",
  "s5176": "Six, Zhou court disorder, duke pacified disorder, established King Jing.",
  "s5189": "First year of King Jing",
  "s5190": "Twenty-three, earthquake.",
  "s5194": "Ten, Wu attacked and defeated us.",
  "s5197": "Fifteen, Wu defeated our army, took Hu and Shen.",
  "s5200": "Eleven, Chu Jian caused disorder, executed him.",
  "s5202": "Eight, Gong Zi Guang defeated Chu.",
  "s5206": "Twenty-four, dove nested.",
  "s5210": "Eleven, Wu Bei Liang people disputed mulberry, attacked and took our Zhong Li.",
  "s5214": "First year of Cai Zhao Hou Shen, Dao Hou's younger brother.",
  "s5216": "Twelve, duke went to Jin, requested to bring in king.",
  "s5220": "Jia Shen",
  "s5222": "Twenty-five, duke wished to execute Ji clan, three Huan clans attacked duke, duke went out to reside at Yun."
}