{
  "s0542": "Fifth year, Wei king came to court at Yingting, returned Puban to Wei.",
  "s0543": "Sixth year, Shu lord Hui rebelled, Sima Cuo pacified Shu.",
  "s0544": "Senior Minister Huan attacked Chu, beheaded 20,000.",
  "s0545": "Jingyang Jun went as hostage to Qi.",
  "s0546": "Solar eclipse, day darkened.",
  "s0547": "Seventh year, took Xincheng.",
  "s0548": "Mang Li Zi died.",
  "s0549": "Eighth year, sent General Mi Yong to attack Chu, took Xinshi.",
  "s0550": "Qi sent Zhang Zi, Wei sent Gongsun Xi, Han sent Bao Yuan together attacked Chu Fangcheng, took Tangmei.",
  "s0551": "Zhao destroyed Zhongshan, its ruler fled, finally died in Qi.",
  "s0552": "Wei prince Jing, Han prince Chang became lords.",
  "s0553": "Ninth year, attacked Wei, took Shen.",
  "s0554": "Tenth year, attacked Wei, took Huayang.",
  "s0555": "Eleventh year, attacked Wei, took Shen again.",
  "s0556": "Twelfth year, attacked Wei, took Huayang again.",
  "s0557": "Thirteenth year, attacked Wei, took Shen again.",
  "s0558": "Fourteenth year, attacked Wei, took Huayang again.",
  "s0559": "Fifteenth year, attacked Wei, took Shen again.",
  "s0560": "Sixteenth year, attacked Wei, took Huayang again.",
  "s0561": "Seventeenth year, attacked Wei, took Shen again.",
  "s0562": "Eighteenth year, attacked Wei, took Huayang again.",
  "s0563": "Nineteenth year, attacked Wei, took Shen again.",
  "s0564": "Twentieth year, attacked Wei, took Huayang again.",
  "s0565": "Twenty-first year, attacked Wei, took Shen again.",
  "s0566": "Twenty-second year, attacked Wei, took Huayang again.",
  "s0567": "Twenty-third year, attacked Wei, took Shen again.",
  "s0568": "Twenty-fourth year, attacked Wei, took Huayang again.",
  "s0569": "Twenty-fifth year, attacked Wei, took Shen again.",
  "s0570": "Twenty-sixth year, Qin Shi Huang ascended, his son Qin Er Shi ascended.",
  "s0571": "Qin Er Shi first year, attacked Wei, took Huayang again.",
  "s0572": "Second year, attacked Wei, took Shen again.",
  "s0573": "Third year, Qin Er Shi died.",
  "s0574": "Too史公曰：秦之先為嬴姓。其後分封，以國為姓，有徐氏、郯氏、莒氏、終黎氏、運奄氏、菟裘氏、將梁氏、黄氏、江氏、脩魚氏、白冥氏、蜚廉氏、秦氏。然秦以其先造父封趙城，為趙氏。",
  "s0575": "Chancellor Li Si killed Fusu, established Huhai as Qin Er Shi.",
  "s0576": "The six states rose together, Qin destroyed them all.",
  "s0577": "Qin Shi Huang unified the world, made himself emperor.",
  "s0578": "He toured the eastern states, erected stone inscriptions.",
  "s0579": "He burned books and buried scholars.",
  "s0580": "He built the Great Wall, dug the Ling Canal.",
  "s0581": "He sought immortals, sent Xu Fu to sea.",
  "s0582": "He died at Shaqiu, Huhai became emperor.",
  "s0583": "The ministers Zhao Gao and Li Si plotted rebellion.",
  "s0584": "Chen Sheng and Wu Guang rose in rebellion.",
  "s0585": "Zhang Han attacked the rebels, but the Qin dynasty fell.",
  "s0586": "Liu Bang entered Guanzhong, became king of Han.",
  "s0587": "Xiang Yu destroyed Qin, divided the lands.",
  "s0588": "Han Xin attacked Wei, took Linjin.",
  "s0589": "Han Xin attacked Zhao, took Anyi.",
  "s0590": "Han Xin attacked Qi, took Linzi.",
  "s0591": "Liu Bang attacked Chu, took Pengcheng.",
  "s0592": "Xiang Yu counterattacked, defeated Han at Pengcheng.",
  "s0593": "Han Xin defeated Qi, Liu Bang defeated Chu.",
  "s0594": "Battle of Gaixia, Xiang Yu committed suicide.",
  "s0595": "Liu Bang became emperor, established the Han dynasty.",
  "s0596": "Han Gao Zu first year, attacked Qin remnants.",
  "s0597": "Second year, pacified the various lords.",
  "s0598": "Third year, attacked Chu remnants.",
  "s0599": "Fourth year, attacked Qi remnants.",
  "s0600": "Fifth year, attacked Zhao remnants.",
  "s0601": "Sixth year, attacked Yan remnants.",
  "s0602": "Seventh year, attacked Wei remnants.",
  "s0603": "Eighth year, attacked Dai remnants.",
  "s0604": "Ninth year, pacified the world.",
  "s0605": "Han Gao Zu died, Empress Lü acted as regent.",
  "s0606": "Wen Di ascended, practiced benevolent government.",
  "s0607": "Jing Di ascended, continued the policies.",
  "s0608": "Wu Di ascended, expanded the empire.",
  "s0609": "Wu Di died, Zhao Di ascended.",
  "s0610": "Zhao Di died, Xuan Di ascended.",
  "s0611": "Xuan Di died, Yuan Di ascended.",
  "s0612": "Yuan Di died, Cheng Di ascended.",
  "s0613": "Cheng Di died, Ai Di ascended.",
  "s0614": "Ai Di died, Ping Di ascended.",
  "s0615": "Ping Di died, Ruzi Ying ascended.",
  "s0616": "Wang Mang usurped the throne.",
  "s0617": "Liu Xiu restored the Han dynasty.",
  "s0618": "Guang Wu Di ascended, pacified the world.",
  "s0619": "Ming Di ascended, continued the legacy.",
  "s0620": "Zhang Di ascended, promoted Confucianism."
}