{
  "s3770": "Six, attacked Song and Chen, because they doubled our submission to Jin.",
  "s3771": "Three, Chu and Zheng attacked us, because we doubled Chu.",
  "s3776": "Twenty, with Chu invaded Chen, then invaded Song. Jin sent Zhao Dun to attack us, because we doubled Jin.",
  "s3780": "Jia Yin",
  "s3781": "Six, King Kuang died.",
  "s3783": "Two, crown prince Cheng Fu defeated the Tall Di.",
  "s3784": "Fourteen, Zhao Chuan assassinated Duke Ling, Zhao Dun made Chuan welcome Gong Zi Hei Lie from Zhou, established him. Zhao clan granted noble status.",
  "s3787": "Four, Hua Yuan trapped in Zheng because of the sheep stew.",
  "s3792": "Twenty-one, fought with Song army, captured Hua Yuan.",
  "s3797": "First year of King Ding",
  "s3800": "First year of Duke Cheng of Jin (Hei Lie), attacked Zheng.",
  "s3802": "Eight, attacked Lu Hun, reached Luo, inquired about the tripods' weight.",
  "s3803": "Five, ransomed Hua Yuan, he fled and returned. Besieged Cao.",
  "s3807": "Twelve, Song besieged us.",
  "s3808": "Twenty-two, Hua Yuan fled and returned.",
  "s3818": "Nine, Ruo Ao clan caused disorder, extinguished them. Attacked Zheng.",
  "s3824": "First year of Duke Ling of Zheng (Yi), Gong Zi Gui Sheng assassinated Duke Ling because of the turtle.",
  "s3832": "Three, Zhong Xing Huan Zi Xun Lin Fu rescued Zheng, attacked Chen.",
  "s3837": "Ten, Chu attacked Zheng, made peace with us. Jin Zhong Xing Huan Zi resisted Chu, rescued Zheng, attacked us.",
  "s3840": "First year of Duke Xiang of Zheng (Jian), Duke Ling's younger brother. Chu attacked us, Jin came to rescue.",
  "s3848": "Four, invaded Chen with Wei.",
  "s3849": "First year of Duke Huan of Qin",
  "s3852": "Thirty-two, invaded Chen with Jin.",
  "s3853": "Eleven, Jin and Wei invaded us.",
  "s3878": "Eight, seventh month, solar eclipse.",
  "s3880": "Six, with Lu attacked Qin, captured Qin spy, executed him in Jiang market, revived after six days.",
  "s3881": "Three, Jin attacked us, captured spy.",
  "s3882": "Thirteen, attacked Chen, extinguished Shu and Liao.",
  "s3885": "Thirteen, Chu attacked us.",
  "s3889": "First year of Duke Xuan of Yan",
  "s3896": "Seven, sent Huan Zi to attack Chu. Led feudal lords' army to attack Chen and rescue Zheng. Duke Cheng died.",
  "s3898": "Fourteen, attacked Zheng, Jin Xi Que rescued Zheng, defeated us.",
  "s3904": "Five, Chu attacked us, Jin came to rescue, defeated Chu army.",
  "s3910": "Fourteen, month, solar eclipse.",
  "s3911": "Ten, duke died. Cui Zhu was favored, Gao and Guo drove him out, he fled to Wei.",
  "s3912": "First year of Duke Jing of Jin (Ju), attacked Zheng with Song.",
  "s3916": "First year of Duke Mu of Wei (Chi), Qi's Cui Zhu came fleeing.",
  "s3917": "Fifteen, Xia Zheng Shu killed Duke Ling because of his mother.",
  "s3920": "Six, Jin, Song, Chu attacked us.",
  "s3927": "First year of Duke Qing of Qi (Wu Ye)",
  "s3930": "Sixteen, led feudal lords to execute Chen's Xia Zheng Shu, established Chen Duke Ling's son Wu.",
  "s3933": "First year of Duke Cheng of Chen (Wu), Duke Ling's crown prince.",
  "s3940": "Jia Zi",
  "s3944": "Three, rescued Zheng, defeated by Chu at the river.",
  "s3946": "Seventeen, besieged Zheng, Zheng lord bared flesh to apologize, released him.",
  "s3947": "Fourteen, attacked Chen.",
  "s3952": "Eight, Chu besieged us, we used humble words to resolve it.",
  "s3976": "Five, attacked Zheng.",
  "s3978": "Nineteen, besieged Song, because they killed our envoy.",
  "s3979": "Sixteen, killed Chu envoy, Chu besieged us."
}