{
  "s603": "Twenty-six. Yuanding year 3, Ju convicted as Grand Master of Ceremonies committed crime, state abolished.",
  "s604": "Twenty-one",
  "s605": "Beiping.",
  "s606": "As guest followed uprising in Yangwu, to Baxiang, became Changshan governor, got Chen Yu, became Dai chancellor, moved to Zhao chancellor, became marquis. Served as accounting chancellor 4 years, Huainan chancellor 14 years. 1,300 households.",
  "s607": "Seven. Year 6 month 8 Ding Chou day, Marquis Wen Zhang Cang year 1.",
  "s608": "Seven",
  "s609": "Eight",
  "s610": "Twenty-three. Year 4 became chancellor. Five years dismissed.",
  "s611": "Five. Eight. Year 6, Marquis Kang Feng year 1. Three. After year 1, Marquis Yu year 1.",
  "s612": "Four. Jianyuan year 5, Marquis Yu convicted of attending various lords' funerals afterward, disrespectful, state abolished.",
  "s613": "Sixty-five",
  "s614": "Gao Hu.",
  "s615": "As soldier followed uprising in Gangli, entered Han, as commandery captain attacked Ji, as commandery captain pacified Yan, became marquis, 1,000 households.",
  "s616": "Seven. Year 6 middle, Marquis Chen Fu Qi year 1.",
  "s617": "Seven",
  "s618": "Eight",
  "s619": "Four. Year 5, Marquis Shang Cheng succeeded. Died, no heir, state abolished.",
  "s622": "Eighty-two",
  "s623": "Yanci.",
  "s624": "As Shen general year 1 BCE followed uprising in Liu, entered Han, as commandery captain defended Guangwu, meritorious service led to marquisate.",
  "s625": "Seven. Year 6 middle, Marquis Yuan Qing year 1.",
  "s626": "Seven",
  "s627": "Eight",
  "s628": "Five. Year 1, Marquis He year 1. Year 6, Marquis He plotted rebellion, state abolished.",
  "s631": "Twenty-four",
  "s632": "Pinggao.",
  "s633": "Xiang Tuo, Han year 6 as Dang commandery governor initially followed, granted surname Liu; meritorious service comparable to Marquis Dai Peng Zu, 580 households.",
  "s634": "Six. Year 7 month 10 Gui Hai day, Marquis Yang Liu Tuo year 1.",
  "s635": "Four. Three. Year 5, Marquis Gong Yuan year 1.",
  "s636": "Eight",
  "s637": "Twenty-three",
  "s638": "Sixteen. Year 1, Marquis Jie Guang year 1.",
  "s639": "Twenty-eight. Jianyuan year 1, Marquis Sheng year 1. Yuanding year 5, Marquis Sheng convicted of tribute gold, state abolished.",
  "s640": "One hundred twenty-one",
  "s641": "Fuyang.",
  "s642": "As soldier followed uprising in Xue, as general entered Han, as Right Sima attacked Xiang Ji, became marquis, 1,000 households.",
  "s643": "Six. Year 7 month 10 Jia Zi day, Marquis Gang Chen Xu year 1.",
  "s644": "Seven",
  "s645": "Eight",
  "s646": "Ten. Thirteen. Year 11, Marquis Gong Jia year 1.",
  "s647": "Five. Eleven. Year 6, Marquis Kang Shi year 1.",
  "s648": "Twelve. Yuanshuo year 1, Marquis Qiang year 1. Seven. Yuanshou year 2, convicted that father Shi was not Jia's son, state abolished.",
  "s649": "Forty-nine",
  "s650": "Yanghe.",
  "s651": "As central ye zhe followed into Han, as palace attendant cavalry followed pacifying various lords, became marquis 500 households, meritorious service comparable to Marquis of Gaohu.",
  "s652": "Three. Year 7 month 10 Jia Zi day, Marquis of Qi Ai year 1. Three. Year 10, Marquis An Guo year 1.",
  "s653": "Seven",
  "s654": "Eight",
  "s655": "Twenty-three",
  "s656": "Ten. Six. Zhong year 4, Marquis Wu year 1. Zhong extinct."
}
