{
  "s0039": {
    "chinese": "遂馳入代邸。",
    "literal": "Then galloped entered Dai residence.",
    "idiomatic": "He then galloped into the Dai residence."
  },
  "s0040": {
    "chinese": "群臣從至。",
    "literal": "Ministers followed arrived.",
    "idiomatic": "The ministers followed and arrived."
  },
  "s0041": {
    "chinese": "丞相陳平、太尉周勃、大將軍陳武、御史大夫張蒼、宗正劉郢、朱虛侯劉章、東牟侯劉興居、典客劉揭皆再拜言曰：「子弘等皆非孝惠帝子，不當奉宗廟。",
    "literal": "Chancellor Chen Ping, Grand Marshal Zhou Bo, General-in-Chief Chen Wu, Grandee Secretary Zhang Cang, Imperial Clan Administrator Liu Ying, Marquis Zhu Xu Liu Zhang, Marquis Dong Mou Liu Xingju, Court Guests Receptionist Liu Jie all twice bowed spoke said: 'Zi Hong etc. all not Xiao Hui Emperor sons, not proper to serve ancestral temple.",
    "idiomatic": "Chancellor Chen Ping, Grand Marshal Zhou Bo, General-in-Chief Chen Wu, Grandee Secretary Zhang Cang, Imperial Clan Administrator Liu Ying, Marquis Zhu Xu Liu Zhang, Marquis Dong Mou Liu Xingju, and Court Guests Receptionist Liu Jie all bowed twice and said: 'Zi Hong and the others are not sons of Emperor Xiaohui and should not serve at the ancestral temple.'"
  },
  "s0042": {
    "chinese": "臣謹請（與）陰安侯列侯頃王后與瑯邪王、宗室、大臣、列侯、吏二千石議曰：『大王高帝長子，宜為高帝嗣。』",
    "literal": "Ministers respectfully request (with) Yin'an Marquis various marquises Queen Dowager of King Qing and Langye King, imperial clan, ministers, various marquises, officials of two thousand shi discussed said: 'Great king Gao Di eldest son, suitable to be Gao Di successor.'",
    "idiomatic": "We ministers respectfully request to discuss with the Marquis of Yin'an, the various marquises, the Queen Dowager of King Qing, the King of Langye, the imperial clan, ministers, marquises, and officials of 2,000 shi, who have said: 'Your Majesty is Emperor Gao's eldest son and should succeed Emperor Gao.'"
  },
  "s0043": {
    "chinese": "願大王即天子位。」",
    "literal": "Wish great king immediately Son of Heaven position.'",
    "idiomatic": "We wish Your Majesty to immediately ascend the imperial throne.'"
  },
  "s0044": {
    "chinese": "代王曰：「奉高帝宗廟，重事也。",
    "literal": "Dai King said: 'Serve Gao Di ancestral temple, heavy matter also.",
    "idiomatic": "The King of Dai said: 'Serving at Emperor Gao's ancestral temple is a grave matter."
  },
  "s0045": {
    "chinese": "寡人不佞，不足以稱宗廟。",
    "literal": "I not talented, not sufficient to match ancestral temple.",
    "idiomatic": "I am untalented and insufficient to serve at the ancestral temple."
  },
  "s0046": {
    "chinese": "願請楚王計宜者，寡人不敢當。」",
    "literal": "Wish request Chu King plan suitable ones, I not dare accept.'",
    "idiomatic": "I wish to request that the King of Chu be consulted on what is appropriate. I do not dare to accept.'"
  },
  "s0047": {
    "chinese": "群臣皆伏固請。",
    "literal": "Ministers all prostrated firmly requested.",
    "idiomatic": "All the ministers prostrated themselves and firmly requested."
  },
  "s0048": {
    "chinese": "代王西鄉讓者三，南鄉讓者再。",
    "literal": "Dai King west facing declined three times, south facing declined two times.",
    "idiomatic": "The King of Dai declined three times while facing west, and declined twice while facing south."
  },
  "s0049": {
    "chinese": "丞相平等皆曰：「臣伏計之，大王奉高帝宗廟最宜稱，雖天下諸侯萬民以為宜。",
    "literal": "Chancellor Ping etc. all said: 'Ministers prostrated considered it, great king serve Gao Di ancestral temple most suitable worthy, although realm feudal lords ten thousand people consider suitable.",
    "idiomatic": "Chancellor Ping and the others all said: 'We ministers have carefully considered it. Your Majesty serving at Emperor Gao's ancestral temple is most suitable and worthy. Even all the feudal lords and people of the realm consider it appropriate."
  },
  "s0050": {
    "chinese": "臣等為宗廟社稷計，不敢忽。",
    "literal": "Ministers etc. for ancestral temple state altars plan, not dare neglect.",
    "idiomatic": "We ministers, for the sake of the ancestral temple and the state, dare not be negligent."
  },
  "s0051": {
    "chinese": "願大王幸聽臣等。",
    "literal": "Wish great king fortunately listen to ministers etc.",
    "idiomatic": "We wish Your Majesty would graciously listen to us ministers."
  },
  "s0052": {
    "chinese": "臣謹奉天子璽符再拜上。」",
    "literal": "Ministers respectfully present Son of Heaven seal tally twice bow offer.'",
    "idiomatic": "We ministers respectfully present the imperial seal and tally, bowing twice in offering.'"
  },
  "s0053": {
    "chinese": "代王曰：「宗室將相王列侯以為莫宜寡人，寡人不敢辭。」",
    "literal": "Dai King said: 'Imperial clan generals chancellors kings marquises consider none suitable I, I not dare decline.'",
    "idiomatic": "The King of Dai said: 'If the imperial clan, generals, chancellors, kings, and marquises all consider me the most suitable, I dare not decline.'"
  },
  "s0054": {
    "chinese": "遂即天子位。",
    "literal": "Then immediately Son of Heaven position.",
    "idiomatic": "He then immediately ascended the imperial throne."
  },
  "s0055": {
    "chinese": "群臣以禮次侍。",
    "literal": "Ministers with ritual order attended.",
    "idiomatic": "The ministers attended in proper ritual order."
  },
  "s0056": {
    "chinese": "乃使太仆嬰與東牟侯興居清宮，奉天子法駕，迎于代邸。",
    "literal": "Then caused Grand Coachman Ying and Dong Mou Marquis Xingju clear palace, carry Son of Heaven ceremonial carriage, welcome at Dai residence.",
    "idiomatic": "He then ordered Grand Coachman Ying and Marquis Dong Mou Xingju to clear the palace and bring the imperial ceremonial carriage to welcome him at the Dai residence."
  },
  "s0057": {
    "chinese": "皇帝即日夕入未央宮。",
    "literal": "Emperor immediately that day evening entered Weiyang Palace.",
    "idiomatic": "The emperor entered Weiyang Palace that very evening."
  },
  "s0058": {
    "chinese": "乃夜拜宋昌為衛將軍，鎮撫南北軍。",
    "literal": "Then night appointed Song Chang as Guard General, pacify and soothe northern and southern armies.",
    "idiomatic": "That night he appointed Song Chang as Guard General to pacify and control the northern and southern armies."
  },
  "s0059": {
    "chinese": "以張武為郎中令，行殿中。",
    "literal": "With Zhang Wu as Chamberlain for Attendants, managed palace affairs.",
    "idiomatic": "He appointed Zhang Wu as Chamberlain for Attendants to manage palace affairs."
  },
  "s0060": {
    "chinese": "還坐前殿。",
    "literal": "Returned sat front hall.",
    "idiomatic": "He returned and sat in the front hall."
  },
  "s0061": {
    "chinese": "於是夜下詔書曰：「閒者諸呂用事擅權，謀為大逆，欲以危劉氏宗廟，賴將相列侯宗室大臣誅之，皆伏其辜。",
    "literal": "Thereupon night issued edict said: 'Recently various Lu handled affairs monopolized power, plotted great rebellion, desired to endanger Liu clan ancestral temple, relied on generals chancellors marquises imperial clan ministers executed them, all submitted to their punishment.",
    "idiomatic": "That night he issued an edict saying: 'Recently the Lü clansmen handled affairs and monopolized power. They plotted great rebellion to endanger the Liu clan ancestral temple. Thanks to the generals, chancellors, marquises, imperial clan, and ministers who executed them, they all received their just punishment."
  },
  "s0062": {
    "chinese": "朕初即位，其赦天下，賜民爵一級，女子百戶牛酒，酺五日。」",
    "literal": "I initially ascended throne, let there be amnesty throughout realm, grant people nobility rank one level, women hundred households ox wine, drinking parties five days.'",
    "idiomatic": "Since I have just ascended the throne, let there be a general amnesty throughout the realm. Grant the people one level of nobility rank, and women in every hundred households oxen and wine. Hold drinking celebrations for five days.'"
  },
  "s0064": {
    "chinese": "辛亥，皇帝即阼，謁高廟。",
    "literal": "Xinhai day, emperor ascended throne, visited Gao temple.",
    "idiomatic": "On the xinhai day, the emperor ascended the throne and paid respects at the Gao ancestral temple."
  },
  "s0065": {
    "chinese": "右丞相平徙為左丞相，太尉勃為右丞相，大將軍灌嬰為太尉。",
    "literal": "Right Chancellor Ping moved to Left Chancellor, Grand Marshal Bo became Right Chancellor, General-in-Chief Guan Ying became Grand Marshal.",
    "idiomatic": "Right Chancellor Ping was moved to Left Chancellor, Grand Marshal Bo became Right Chancellor, and General-in-Chief Guan Ying became Grand Marshal."
  },
  "s0066": {
    "chinese": "諸呂所奪齊楚故地，皆復與之。",
    "literal": "Various Lu seized Qi Chu former lands, all restored to them.",
    "idiomatic": "All the lands previously seized from Qi and Chu by the Lü clansmen were restored to them."
  },
  "s0067": {
    "chinese": "壬子，遣車騎將軍薄昭迎皇太后於代。",
    "literal": "Renzi day, dispatched Chariot Cavalry General Bo Zhao welcome Empress Dowager at Dai.",
    "idiomatic": "On the renzi day, he dispatched Chariot Cavalry General Bo Zhao to welcome the Empress Dowager from Dai."
  },
  "s0068": {
    "chinese": "皇帝曰：「呂產自置為相國，呂祿為上將軍，擅矯遣灌將軍嬰將兵擊齊，欲代劉氏，嬰留滎陽弗擊，與諸侯合謀以誅呂氏。",
    "literal": "Emperor said: 'Lu Chan self appointed as Chancellor, Lu Lu as Supreme General, arbitrarily forged orders dispatched Guan General Ying lead troops attack Qi, desired to replace Liu clan, Ying stayed Xingyang not attack, with feudal lords jointly plotted to execute Lu clan.",
    "idiomatic": "The emperor said: 'Lü Chan appointed himself Chancellor and Lü Lu as Supreme General. They arbitrarily forged orders to dispatch General Guan Ying with troops to attack Qi, intending to replace the Liu clan. Ying stayed at Xingyang and did not attack, joining with the feudal lords in plotting to execute the Lü clan."
  },
  "s0069": {
    "chinese": "呂產欲為不善，丞相陳平與太尉周勃謀奪呂產等軍。",
    "literal": "Lu Chan desired to do evil, Chancellor Chen Ping with Grand Marshal Zhou Bo plotted seize Lu Chan etc. army.",
    "idiomatic": "Lü Chan intended to do evil, so Chancellor Chen Ping and Grand Marshal Zhou Bo plotted to seize Lü Chan and the others' army."
  },
  "s0070": {
    "chinese": "朱虛侯劉章首先捕呂產等。",
    "literal": "Zhu Xu Marquis Liu Zhang first captured Lu Chan etc.",
    "idiomatic": "Marquis Zhu Xu Liu Zhang was the first to capture Lü Chan and the others."
  },
  "s0071": {
    "chinese": "太尉身率襄平侯通持節承詔入北軍。",
    "literal": "Grand Marshal personally led Xiangping Marquis Tong held tally received edict entered Northern Army.",
    "idiomatic": "The Grand Marshal personally led Marquis Xiangping Tong, holding the imperial tally and edict, into the Northern Army."
  },
  "s0072": {
    "chinese": "典客劉揭身奪趙王呂祿印。",
    "literal": "Court Guests Receptionist Liu Jie personally seized Zhao King Lu Lu seal.",
    "idiomatic": "Court Guests Receptionist Liu Jie personally seized the seal of King Zhao Lü Lu."
  },
  "s0073": {
    "chinese": "益封太尉勃萬戶，賜金五千斤。",
    "literal": "Additionally enfeoffed Grand Marshal Bo ten thousand households, granted gold five thousand jin.",
    "idiomatic": "Grand Marshal Bo was additionally enfeoffed with ten thousand households and granted five thousand jin of gold."
  },
  "s0074": {
    "chinese": "丞相陳平、灌將軍嬰邑各三千戶，金二千斤。",
    "literal": "Chancellor Chen Ping, Guan General Ying fiefs each three thousand households, gold two thousand jin.",
    "idiomatic": "Chancellor Chen Ping and General Guan Ying each received fiefs of three thousand households and two thousand jin of gold."
  },
  "s0075": {
    "chinese": "朱虛侯劉章、襄平侯通、東牟侯劉興居邑各二千戶，金千斤。",
    "literal": "Zhu Xu Marquis Liu Zhang, Xiangping Marquis Tong, Dong Mou Marquis Liu Xingju fiefs each two thousand households, gold thousand jin.",
    "idiomatic": "Marquis Zhu Xu Liu Zhang, Marquis Xiangping Tong, and Marquis Dong Mou Liu Xingju each received fiefs of two thousand households and one thousand jin of gold."
  },
  "s0076": {
    "chinese": "封典客揭為陽信侯，賜金千斤。」",
    "literal": "Enfeoffed Court Guests Receptionist Jie as Yangxin Marquis, granted gold thousand jin.'",
    "idiomatic": "Court Guests Receptionist Jie was enfeoffed as Marquis of Yangxin and granted one thousand jin of gold.'"
  },
}
