{
  "s0001": {
    "literal": "In the fifth year, winter, tenth month, the Han King pursued Xiang Yu to the south of Yangxia and halted his army; he had arranged with Qi King Xin and Wei Prime Minister Yue to meet and attack Chu together, but they arrived at Juling and did not meet.",
    "idiomatic": "Winter of the fifth year, tenth month: the Han King pursued Xiang Yu southward to Yangxia and halted his army. He had arranged with Qi King Xin and Wei Prime Minister Yue to rendezvous and jointly attack Chu, but upon arriving at Juling, they failed to appear."
  },
  "s0002": {
    "literal": "Chu attacked the Han army and greatly defeated it.",
    "idiomatic": "Chu forces attacked the Han army and inflicted a crushing defeat."
  },
  "s0003": {
    "literal": "The Han King again entered his fortifications, dug deep moats, and defended.",
    "idiomatic": "The Han King retreated once more into his fortifications, deepened the moats, and held his position defensively."
  },
  "s0004": {
    "literal": "He said to Zhang Liang: 'The lords do not follow—what can be done?'",
    "idiomatic": "He said to Zhang Liang, 'The feudal lords refuse to obey—what shall we do?'"
  },
  "s0005": {
    "literal": "良曰：「楚兵且破，而諸侯之兵未會，其實難矣。",
    "idiomatic": "Zhang Liang said, 'Chu troops are on the verge of defeat, but the lords' armies have not yet assembled—this presents real difficulty."
  },
  "s0006": {
    "literal": "今楚與漢相距滎陽，衆寡又不敵，願君王出武關，項王必引兵南走王負函之衆。",
    "idiomatic": "Now Chu and Han confront each other at Xingyang, and their numbers are unequal. I urge Your Majesty to emerge from Wuguan Pass—Xiang Yu will surely lead his troops south to pursue Your Majesty's forces at Mount Li."
  },
  "s0007": {
    "literal": "王出武關，入函谷關，收赤泉侯兵。",
    "idiomatic": "Once Your Majesty emerges from Wuguan Pass and enters Hangu Pass, you can rally the troops of the Marquis of Chiquan."
  },
  "s0008": {
    "literal": "如此，則荊王之兵可盡有也。",
    "idiomatic": "In this way, Your Majesty can gain complete control over King Jing's forces."
  },
  "s0009": {
    "literal": "王從之，出軍宛、葉間。",
    "idiomatic": "The King followed this advice and led his army out between Wan and Ye."
  },
  "s0010": {
    "literal": "與黥布行收兵。",
    "idiomatic": "Together with Ying Bu, he proceeded to gather troops."
  },
  "s0011": {
    "literal": "羽聞漢王出武關，使長史欣將兵駐嶢關，絕漢道。",
    "idiomatic": "When Xiang Yu heard that the Han King had emerged from Wuguan Pass, he sent Chief Clerk Xin with troops to station at Yaoguan Pass and block the Han route."
  },
  "s0012": {
    "literal": "王使盧綰、劉賈將卒二萬人，騎數百，軍於 outside 嶢關。",
    "idiomatic": "The King sent Lu Wan and Liu Jia with 20,000 troops and several hundred cavalry to position themselves outside Yaoguan Pass."
  },
  "s0013": {
    "literal": "王將餘軍徇宛、西入武關。",
    "idiomatic": "The King led his remaining army to subdue Wan, then entered Wuguan Pass from the west."
  },
  "s0014": {
    "literal": "與秦軍戰於藍田南，大破之，斬其將軍。",
    "idiomatic": "He battled Qin forces south of Lantian, greatly defeating them and slaying their general."
  },
  "s0015": {
    "literal": "漢王入武關，遣將軍薛歐、王吸出武關，因王陵兵，南陽守齮軍於葉，得數萬人。",
    "idiomatic": "The Han King entered Wuguan Pass and dispatched generals Xue Ou and Wang Xi to emerge from Wuguan Pass, joining forces with Wang Ling's troops. The Nanyang governor Yan's army at Ye provided several tens of thousands of men."
  },
  "s0016": {
    "literal": "王數敗於項籍。",
    "idiomatic": "The King suffered several defeats at the hands of Xiang Ji."
  },
  "s0017": {
    "literal": "及項籍滅齊，引兵次於陳留，與漢王相距。",
    "idiomatic": "When Xiang Ji destroyed Qi, he led his troops and camped at Chenliu, confronting the Han King."
  },
  "s0018": {
    "literal": "漢王引軍而東，至彭城。",
    "idiomatic": "The Han King led his army east and arrived at Pengcheng."
  },
  "s0019": {
    "literal": "項籍亦引兵東擊漢，大破之。",
    "idiomatic": "Xiang Ji also led his troops east to attack Han and greatly defeated them."
  },
  "s0020": {
    "literal": "漢王遁而西走，收集散卒，復軍於滎陽。",
    "idiomatic": "The Han King fled west, gathered his scattered soldiers, and reformed his army at Xingyang."
  },
  "s0021": {
    "literal": "楚騎來衆，漢王擇軍中可使者，遣語大司馬曹參。",
    "idiomatic": "Chu cavalry arrived in great numbers; the Han King selected capable men from his army and sent them to speak with Grand Marshal Cao Can."
  },
  "s0022": {
    "literal": "參曰：「臣子不足與計事。」",
    "idiomatic": "Cao Can said, 'Your servant is not worthy to discuss matters with you.'"
  },
  "s0023": {
    "literal": "漢王曰：「吾非忘諸君也，特以為君所知耳。」",
    "idiomatic": "The Han King said, 'I have not forgotten you gentlemen; I merely thought this was something you already knew.'"
  },
  "s0024": {
    "literal": "參曰：「大王何以待天下士？」",
    "idiomatic": "Cao Can said, 'How does Your Majesty treat the scholars of the world?'"
  },
  "s0025": {
    "literal": "漢王曰：「吾能容之。」",
    "idiomatic": "The Han King said, 'I can accommodate them.'"
  },
  "s0026": {
    "literal": "參曰：「大王不能容，臣請以為大王陳之。」",
    "idiomatic": "Cao Can said, 'Your Majesty cannot truly accommodate them; allow me to explain this to Your Majesty.'"
  },
  "s0027": {
    "literal": "漢王曰：「善。」",
    "idiomatic": "The Han King said, 'Very well.'"
  },
  "s0028": {
    "literal": "參曰：「夫三秦王為秦將，將秦子弟數歲矣，所殺亡不可勝計，然終為漢家臣。」",
    "idiomatic": "Cao Can said, 'The three Qin kings served as Qin generals and led Qin youths for several years. The slain and lost cannot be counted, yet they ultimately became servants of the Han house.'"
  },
  "s0029": {
    "literal": "參曰：「又何以怨乎？」",
    "idiomatic": "Cao Can said, 'What reason is there to resent them?'"
  },
  "s0030": {
    "literal": "漢王曰：「善。」",
    "idiomatic": "The Han King said, 'Very well.'"
  },
  "s0031": {
    "literal": "乃以陳平金四萬斤與參，曰：「以給諸將。」",
    "idiomatic": "He then gave Cao Can 40,000 jin of gold, saying, 'Use this to supply the various generals.'"
  },
  "s0032": {
    "literal": "參以金遺諸將，得其死力。",
    "idiomatic": "Cao Can used the gold to reward the various generals and obtained their utmost loyalty."
  },
  "s0033": {
    "literal": "漢王自將軍中騎出入馳射，軍吏士卒皆隨之。",
    "idiomatic": "The Han King personally led the cavalry from the army, riding out and shooting arrows; all the military officials and soldiers followed him."
  },
  "s0034": {
    "literal": "漢王曰：「吾騎士可為楚騎乎？」",
    "idiomatic": "The Han King said, 'Can my cavalry match the Chu cavalry?'"
  },
  "s0035": {
    "literal": "曰：「不可也。」",
    "idiomatic": "They said, 'They cannot.'"
  },
  "s0036": {
    "literal": "漢王曰：「吾知所以置之矣。」",
    "idiomatic": "The Han King said, 'I know how to deploy them now.'"
  },
  "s0037": {
    "literal": "乃拜灌嬰為中大夫令，李必、駱甲為左右校尉，調驍騎二千。",
    "idiomatic": "He then appointed Guan Ying as Commandant of the Middle Court, and Li Bi and Luo Jia as Left and Right Colonels, selecting two thousand elite cavalry."
  },
  "s0038": {
    "literal": "漢王晨馳見楚將曹咎曰：「吾願易邑與君。」",
    "idiomatic": "Early the next morning, the Han King rode out to see the Chu general Cao Jiu and said, 'I wish to exchange cities with you.'"
  },
  "s0039": {
    "literal": "咎曰：「吾不以易邑也，願易王。」",
    "idiomatic": "Cao Jiu said, 'I will not exchange cities; I wish to exchange kings.'"
  },
  "s0040": {
    "literal": "漢王曰：「吾不以易王也，然則聽吾計。」",
    "idiomatic": "The Han King said, 'I will not exchange kings, but listen to my plan.'"
  },
  "s0041": {
    "literal": "咎曰：「奈何？」",
    "idiomatic": "Cao Jiu said, 'What is it?'"
  },
  "s0042": {
    "literal": "漢王曰：「吾賜君金三萬斤，君還楚，吾罷兵而歸。」",
    "idiomatic": "The Han King said, 'I will give you thirty thousand jin of gold; you return to Chu, and I will disband my troops and return home.'"
  },
  "s0043": {
    "literal": "咎許諾。",
    "idiomatic": "Cao Jiu agreed."
  },
  "s0044": {
    "literal": "還報項王，王亦許之。",
    "idiomatic": "He returned and reported to Xiang Wang, who also agreed."
  },
  "s0045": {
    "literal": "項王使人追曹咎，不及。",
    "idiomatic": "Xiang Wang sent someone to pursue Cao Jiu, but could not catch him."
  },
  "s0046": {
    "literal": "漢王出軍宛、葉間，與黥布行收兵。",
    "idiomatic": "The Han King led his army out between Wan and Ye, and together with Ying Bu proceeded to gather troops."
  },
  "s0047": {
    "literal": "羽聞漢王出武關，使長史欣將兵駐嶢關，絕漢道。",
    "idiomatic": "When Xiang Yu heard that the Han King had emerged from Wuguan Pass, he sent Chief Clerk Xin with troops to station at Yaoguan Pass and block the Han route."
  },
  "s0048": {
    "literal": "王使盧綰、劉賈將卒二萬人，騎數百，軍於嶢關外。",
    "idiomatic": "The King sent Lu Wan and Liu Jia with 20,000 troops and several hundred cavalry to position themselves outside Yaoguan Pass."
  },
  "s0049": {
    "literal": "王將餘軍徇宛、西入武關。",
    "idiomatic": "The King led his remaining army to subdue Wan, then entered Wuguan Pass from the west."
  },
  "s0050": {
    "literal": "與秦軍戰於藍田南，大破之，斬其將軍。",
    "idiomatic": "He battled Qin forces south of Lantian, greatly defeating them and slaying their general."
  }
}
