{
  "s0001": "The Grand Historian read the list of enfeoffments down to the Marquis of Bian and said: 'There is a reason for this!'",
  "s0002": "The King of Changsha was recorded in the statutes as one who demonstrated loyalty.",
  "s0003": "In the past, when Gaozu pacified the empire, among the meritorious ministers who were not of the same surname as the imperial family and were enfeoffed as kings, there were eight states.",
  "s0004": "By the time of Emperor Hui, only the Jiang family remained complete, passing the throne through five generations, passing the throne through five generations, and because there was no heir, it came to an end. In intention there was no fault; they served as regional guardians with good faith.",
  "s0005": "Therefore, their beneficence flowed to branches and descendants, and several persons became marquises without merit.",
  "s0006": "From Emperor Hui to the period between Emperor Hui and Emperor Jing, over fifty years, they pursued and honored the meritorious ministers from Gaozu's time, as well as those who followed from Dai, and the laborers of Wu and Chu, the sons of nobles like close relatives, and foreigners who submitted to righteousness. Those enfeoffed numbered more than ninety.",
  "s0007": "All displayed their beginnings and ends, and were the prominent ones of contemporary benevolence, righteousness, achievement, and success.",
  "s15": "State Name",
  "s16": "Marquis Merit",
  "s17": "Emperor Hui Seven",
  "s18": "Empress Gao Eight",
  "s19": "Emperor Wen Twenty-three",
  "s20": "Emperor Jing Sixteen",
  "s21": "Jianyu to Yuanfeng Sixth Year Thirty-six",
  "s22": "Taichu and After",
  "s23": "Bian.",
  "s24": "Prince of Changsha, Marquis, two thousand households.",
  "s25": "Seven. First year ninth month, Marquis Qing Wu Qian first year.",
  "s26": "Eight",
  "s27": "Twenty-two. One. Later seventh year, Marquis Gong Xin first year.",
  "s28": "Five. Eleven. Former sixth year, Marquis Guang Zhi first year.",
  "s29": "Twenty-eight. Yuanding fifth year, Marquis Qian Qiu convicted of tribute gold, state abolished.",
  "s31": "Yan.",
  "s32": "Prime Minister of Changsha, Marquis, seven hundred households.",
  "s33": "Six. Second year fourth month gengzi, Marquis Li Cang first year.",
  "s34": "Two. Six. Third year, Marquis Xi first year.",
  "s35": "Fifteen. Eight. Sixteenth year, Marquis Peng Zu first year.",
  "s36": "Sixteen",
  "s37": "Thirty. Yuanfeng first year, Marquis Zhi served as Grand Administrator of Donghai, passed through without requesting permission, arbitrarily mobilized troops as escort, should be executed, but met amnesty, state abolished.",
  "s39": "Pingdu.",
  "s40": "As General of Qi, surrendered in Gaozu third year, pacified Qi, Marquis, one thousand households.",
  "s41": "Three. Fifth year sixth month yi hai, Marquis Xiao Liu Dao first year.",
  "s42": "Eight",
  "s43": "Two. Twenty-one. Third year, Marquis Cheng first year.",
  "s44": "Fourteen. Later second year, Marquis Cheng committed crime, state abolished.",
  "s54": "Fu Liu.",
  "s55": "Son of Empress Gao's elder sister Chang Xu, Marquis.",
  "s57": "Seven. First year fourth month geng yin, Marquis Lü Ping first year. Eighth year, Marquis Ping convicted of Lü clan affairs, executed, state abolished.",
  "s61": "Jiao.",
  "s62": "Empress Lü's elder brother King Dao Wu personally assisted Gaozu in pacifying the empire, the Lü clan assisted Gaozu in governing the empire, the empire greatly at peace, enfeoffed King Wu's youngest son Chan as Marquis of Jiao.",
  "s64": "Five. First year fourth month xin mao, Marquis Lü Chan first year. Sixth year seventh month ren chen, Chan became King of Lü, state abolished. Eighth year ninth month, Chan as King of Lü became Han Chancellor, plotted evil. The ministers executed Chan, then exterminated all the Lü clan.",
  "s68": "Nan Gong.",
  "s69": "Father was a Yue native who served as Gaozu's cavalry general, followed the army, became Grand Master of Ceremonies, Marquis.",
  "s71": "Seven. First year fourth month bing yin, Marquis Zhang Mai first year. Eighth year, Marquis Mai convicted of Lü clan affairs, executed, state abolished.",
  "s75": "Wu.",
  "s76": "As military craftsman followed uprising at Ji, entered Han, later became Privy Treasurer, constructed Chang Le and Wei Yang palaces, built Chang'an city, completed first, meritorious Marquis, five hundred households.",
  "s78": "Six. First year fourth month yi you, Marquis of Qi Yang Cheng Yan first year. Two. Seventh year, Marquis Jing Qu Ji first year.",
  "s79": "Twenty-three",
  "s80": "Nine. Seven. Zhong third year, Marquis Jing Yan first year.",
  "s81": "Eight. Yuanguang third year, Marquis Rong Nu first year. Fourteen. Yuanshou fifth year, Marquis Rong Nu convicted of plotting to kill maternal uncle, executed in market, state abolished."
}
