{
  "s0001": "Chen Wan was the son of Chen Li Gong Tuo.",
  "s0002": "When Wan was born, Zhou's Grand Historian Guo passed through Chen. Chen Li Gong had him divine for Wan, and the hexagram was Guan with Pi: 'This is the light of observing the state, beneficial to be a guest of the king.",
  "s0003": "Will this replace Chen and obtain a state?",
  "s0004": "Not here but in another state?",
  "s0005": "Not in his own person but in his descendants.",
  "s0006": "If in another state, it must be a Jiang-surnamed state.",
  "s0007": "Jiang surname, descendants of the Four Peaks.",
  "s0008": "Things cannot have two greatnesses - Chen declines, will this flourish?'",
  "s0009": "Li Gong was the youngest son of Chen Wen Gong, his mother was a Cai woman.",
  "s0010": "Wen Gong died, Li Gong's elder brother Bao ascended the throne, becoming Huan Gong.",
  "s0011": "Huan Gong and Tuo had different mothers.",
  "s0012": "When Huan Gong fell ill, Cai people killed Huan Gong Bao and the crown prince Mian on behalf of Tuo and established him as Li Gong.",
  "s0013": "After Li Gong ascended the throne, he married a Cai woman.",
  "s0014": "The Cai woman was licentious with Cai men, returning home frequently. Li Gong also went to Cai frequently.",
  "s0015": "Huan Gong's youngest son Lin resented Li Gong for killing his father and brother, so he had Cai people lure Li Gong and kill him.",
  "s0016": "Lin established himself, becoming Zhuang Gong.",
  "s0017": "Thus Chen Wan could not ascend the throne and became a Chen minister.",
  "s0018": "Li Gong's killing resulted from licentious behavior leaving the state, so the Spring and Autumn Annals says 'Cai people killed Chen Tuo' - blaming him.",
  "s0019": "Zhuang Gong died and established his younger brother Chu Jiu, who became Xuan Gong.",
  "s0020": "In Xuan Gong's twenty-first year, he killed his crown prince Yu Kou.",
  "s0021": "Yu Kou and Wan were close friends. Fearing calamity would reach himself, Wan therefore fled to Qi.",
  "s0022": "Qi Huan Gong wanted to make him a minister, but he declined saying: 'A sojourning minister is fortunate to escape carrying a basket on his shoulder - this is your lordship's kindness. I dare not accept a high position.'",
  "s0023": "Huan Gong made him Director of Works.",
  "s0024": "Qi Yi Zhong wanted to give his daughter in marriage to Wan. He divined it, and the omen said: 'This is called the phoenix flying together, harmonious calls clanging.",
  "s0025": "With Gui's descendants, will nurture among Jiang.",
  "s0026": "Five generations will flourish, equal to the chief ministers.",
  "s0027": "Eight generations later, none will rival in greatness.'",
  "s0028": "He finally gave his daughter to Wan.",
  "s0029": "Wan fled to Qi when Qi Huan Gong had been on the throne fourteen years.",
  "s0030": "Wan died, receiving the posthumous title Jing Zhong.",
  "s0031": "Zhong fathered Zhi Meng Yi.",
  "s0032": "Jing Zhong went to Qi and changed his clan name from Chen to Tian.",
  "s0033": "Tian Zhi Meng Yi fathered Min Meng Zhuang, and Tian Min Meng Zhuang fathered Wen Zi Xu Wu.",
  "s0034": "Tian Wen Zi served Qi Zhuang Gong.",
  "s0035": "Jin minister Luan Ying rebelled in Jin and came fleeing to Qi. Qi Zhuang Gong treated him generously as a guest.",
  "s0036": "Yan Ying and Tian Wen Zi remonstrated, but Zhuang Gong did not listen.",
  "s0037": "Wen Zi died and fathered Huan Zi Wu Yu.",
  "s0038": "Tian Huan Zi Wu Yu was strong and served Qi Zhuang Gong, being greatly favored.",
  "s0039": "Wu Yu died and fathered Wu Zi Kai and Xi Zi Qi.",
  "s0040": "Tian Xi Zi Qi served Qi Jing Gong as minister. He collected taxes from the people using small measures but distributed grain to the people using large measures, performing hidden benevolence toward the people, and Jing Gong did not prohibit it.",
  "s0041": "From this the Tian family won the hearts of the Qi people, their clan grew stronger, and the people thought of the Tian family.",
  "s0042": "Yan Zi repeatedly remonstrated with Jing Gong, but Jing Gong did not listen.",
  "s0043": "Later Yan Zi was sent to Jin and privately told Shu Xiang: 'Qi state's governance has finally come to rest with the Tian family.'",
  "s0044": "After Yan Ying died, Fan and Zhong Hang rebelled against Jin.",
  "s0045": "Jin attacked them urgently, so Fan and Zhong Hang requested grain from Qi.",
  "s0046": "Tian Qi wanted to create disorder and build a party among the feudal lords, so he persuaded Jing Gong saying: 'Fan and Zhong Hang have repeatedly been kind to Qi - Qi cannot fail to rescue them.'",
  "s0047": "Qi sent Tian Qi to rescue them and transport grain to them.",
  "s0048": "Jing Gong's crown prince died. Later there was a favored concubine named Rui Zi who bore a son Tu.",
  "s0049": "Jing Gong fell ill and commanded his prime minister Hui Zi and Gao Zhao Zi to establish Zi Tu as crown prince.",
  "s0050": "Jing Gong died, and Gao Zhao Zi and Hui Zi killed Zi Tu and established Yan Zi.",
  "s0051": "Yan Zi established himself as Dao Gong.",
  "s0052": "Dao Gong's first year, Tian Qi killed Gao Zhao Zi and Hui Zi in court.",
  "s0053": "Dao Gong惧, and Tian Qi said: 'The high ministers killed your crown prince and established you. I killed them for you.'",
  "s0054": "Dao Gong rewarded Tian Qi with Lü and Xi, and the Tian family became even stronger.",
  "s0055": "Dao Gong's second year, Tian Qi died, and his son Cheng Zi Tai succeeded him.",
  "s0056": "Cheng Zi served Dao Gong.",
  "s0057": "Dao Gong's sixth year, Yan Zi died.",
  "s0058": "Dao Gong's ninth year, the people of Qi were troubled by the strengthening of the Tian family.",
  "s0059": "Cheng Zi said to his clan: 'The people are troubled by us. If we do not prepare, there will be calamity.'",
  "s0060": "He secretly built three fortresses.",
  "s0061": "Dao Gong knew it and attacked Cheng Zi, killing him.",
  "s0062": "Cheng Zi's son Tai ran away, and the Tian clan scattered.",
  "s0063": "Tai fled to Lü, and Lü protected him.",
  "s0064": "Dao Gong besieged Lü, Lü surrendered Tai, and Dao Gong killed him.",
  "s0065": "Tian Tai's younger brother Ping ran away to Jin.",
  "s0066": "Dao Gong died, and Yan Zi's son Kuai ascended the throne, becoming Jian Gong.",
  "s0067": "Jian Gong's first year, Tian Ping returned from Jin.",
  "s0068": "Jian Gong granted him Lü.",
  "s0069": "Tian Ping served Jian Gong, being greatly trusted.",
  "s0070": "Jian Gong's fourth year, Wu attacked Qi, reaching the Yellow River.",
  "s0071": "Qi was in great fear.",
  "s0072": "Tian Ping said to Jian Gong: 'Your ministers cannot defend the state, please let me try.'",
  "s0073": "Jian Gong agreed.",
  "s0074": "Tian Ping selected brave men from the Tian clan, numbering eight hundred, and defeated Wu at Ailing.",
  "s0075": "Wu withdrew.",
  "s0076": "Tian Ping became prime minister, and his power was heavy.",
  "s0077": "Jian Gong's eighth year, Tian Ping died, and his son Wen Zi Ying succeeded him.",
  "s0078": "Wen Zi served Jian Gong.",
  "s0079": "Jian Gong's twelfth year, Jin attacked Qi, reaching the borders.",
  "s0080": "Qi feared greatly.",
  "s0081": "Wen Zi said to Jian Gong: 'Your ministers cannot defend the state, please let me try.'",
  "s0082": "Jian Gong agreed.",
  "s0083": "Wen Zi selected brave men from the Tian clan, numbering seven hundred, and defeated Jin at An.",
  "s0084": "Jin withdrew.",
  "s0085": "Tian Wen Zi became prime minister, and his power was heavy.",
  "s0086": "Jian Gong's fourteenth year, the Tian clan attacked the Jiang clan at court, killing Jian Gong.",
  "s0087": "Tian Wen Zi established Ping Gong.",
  "s0088": "Ping Gong was Yan Zi's youngest son, known for benevolence.",
  "s0089": "Ping Gong's first year, Tian Wen Zi became prime minister.",
  "s0090": "Ping Gong's fourth year, Wu attacked Qi, reaching the Yellow River.",
  "s0091": "Tian Wen Zi said to Ping Gong: 'Wu is strong, Qi is weak, cannot fight them directly.'",
  "s0092": "He sent messengers to bribe Wu generals with money, and Wu withdrew.",
  "s0093": "Ping Gong's sixth year, Tian Wen Zi died.",
  "s0094": "His son Huan Zi Guang succeeded him.",
  "s0095": "Huan Zi served Ping Gong.",
  "s0096": "Ping Gong's tenth year, Chu attacked Qi, reaching Jimo.",
  "s0097": "Ping Gong said to Huan Zi: 'Can you defend against Chu?'",
  "s0098": "Huan Zi said: 'Cannot.'",
  "s0099": "Ping Gong said: 'Why?'",
  "s0100": "Huan Zi said: 'The state's army is not enough, the people's hearts are not united.'",
  "s0101": "Ping Gong said: 'How to unite the people's hearts?'"
}
