{
  "s0327": "Then Jin army pursued Qi to Ma Ling.",
  "s0328": "Qi lord requested to apologize with precious vessels, not listened to;",
  "s0329": "must obtain the one who laughed at Ke, Xiao Tong Shu Zi, make Qi cede eastern fields.",
  "s0330": "Replied: 'Shu Zi is the Qi lord's mother.",
  "s0331": "Qi lord's mother is also like Jin lord's mother, how will you place her?",
  "s0332": "Moreover you attack with righteousness but follow with violence, how can this be?'",
  "s0333": "Then permitted, commanded to return Lu and Wei's invaded lands.",
  "s0334": "Year 11, Jin first established six ministers, rewarded An's merit.",
  "s0335": "Duke Qing of Qi paid court to Jin, wished to honor and make King Duke Jing of Jin, Duke Jing of Jin dared not accept, then returned.",
  "s0336": "Returning, Duke Qing relaxed the parks and preserves, lightened taxes and levies, relieved the orphaned and inquired of the ill, emptied granaries to save the people, the people also greatly pleased.",
  "s0337": "Thickly ritualed the feudal lords.",
  "s0338": "Finally Duke Qing passed away, the common people attached, feudal lords did not violate.",
  "s0339": "Year 17, Duke Qing passed away, his son Duke Ling Huan established.",
  "s0340": "Duke Ling year 9, Luan Shu of Jin assassinated his lord Duke Li.",
  "s0341": "Year 10, Duke Dao of Jin attacked Qi, Qi sent Prince Guang as hostage to Jin.",
  "s0342": "Year 19, established Zi Guang as crown prince, Gao Hou tutored him, commanded to assemble the feudal lords to ally at Zhongli.",
  "s0343": "Year 27, Jin sent Zhonghang Xian Zi to attack Qi.",
  "s0344": "Qi army defeated, Duke Ling fled into Linzi.",
  "s0345": "Yan Ying stopped Duke Ling, Duke Ling did not follow.",
  "s0346": "Said: 'Lord also has no courage!'",
  "s0347": "Jin troops then surrounded Linzi, Linzi city defended dared not go out, Jin burned the outer walls and left.",
  "s0348": "Year 28, initially, Duke Ling took a Lu woman, gave birth to Zi Guang, established as crown prince.",
  "s0349": "Zhong Ji, Rong Ji.",
  "s0350": "Rong Ji was favored, Zhong Ji gave birth to Zi Ya, entrusted to Rong Ji.",
  "s0351": "Rong Ji requested to establish as crown prince, the duke permitted it.",
  "s0352": "Zhong Ji said: 'Cannot.",
  "s0353": "Guang's establishment is listed among the feudal lords, now without cause depose him, lord will certainly regret it.'",
  "s0354": "The duke said: 'In my hands.'",
  "s0355": "Then deposed Crown Prince Guang, made Gao Hou tutor Ya as crown prince.",
  "s0356": "Duke Ling fell ill, Cui Zhu welcomed former crown prince Guang and established him, this was Duke Zhuang.",
  "s0357": "Duke Zhuang killed Rong Ji.",
  "s0358": "Fifth month ren chen day, Duke Ling passed away, Duke Zhuang ascended the throne, seized crown prince Ya at Gou Dou Hill, killed him.",
  "s0359": "Eighth month, Cui Zhu killed Gao Hou.",
  "s0360": "Jin heard of Qi's disorder, attacked Qi, reached Gao Tang.",
  "s0361": "Duke Zhuang year 3, Jin grandee Luan Ying fled to Qi, Duke Zhuang treated him thickly as guest.",
  "s0362": "Yan Ying, Tian Wen Zi advised, the duke did not listen.",
  "s0363": "Year 4, Duke Zhuang of Qi made Luan Ying secretly enter Jin Qu Wo as internal support, sent troops to follow, ascended Taihang, entered Meng Gate.",
  "s0364": "Luan Ying defeated, Qi troops returned, took Zhao Ge.",
  "s0365": "Year 6, initially, Tang Gong's wife was beautiful, Tang Gong died, Cui Zhu took her.",
  "s0366": "Duke Zhuang communicated with her, frequently went to Cui residence, gave Cui Zhu's hat to someone.",
  "s0367": "Attendant said: 'Cannot.'",
  "s0368": "Cui Zhu angered, because of attacking Jin, wished to conspire with Jin to raid Qi but could not find opportunity.",
  "s0369": "Duke Zhuang once flogged eunuch Jia Ju, Jia Ju again served, for Cui Zhu spied on the duke to repay resentment.",
  "s0370": "Fifth month, Ju lord paid court to Qi, Qi feasted him on jia xu day.",
  "s0371": "Cui Zhu claimed illness did not attend affairs.",
  "s0372": "Yi hai day, duke inquired of Cui Zhu's illness, then followed Cui Zhu's wife.",
  "s0373": "Cui Zhu's wife entered the chamber, with Cui Zhu closed the door and did not come out, duke leaned on pillar and sang.",
  "s0374": "Eunuch Jia Ju blocked the duke's following officials from entering, closed the door, Cui Zhu's followers held weapons and rose from within.",
  "s0375": "Duke ascended platform and requested release, not permitted;",
  "s0376": "requested alliance, not permitted;"
}
