{
  "s2745": "Four, established the Mi altar.",
  "s2746": "Five, younger brother Yun assassinated Du Ao and established himself.",
  "s2749": "Twenty-one, Duke Li's son Wan fled to Qi.",
  "s2752": "First year of Duke Wen of Zheng (Jie)",
  "s2758": "Twenty-three, the duke went to Qi to view the suburban sacrifice.",
  "s2762": "First year of King Cheng of Chu (Yun)",
  "s2783": "First year of Duke Xi of Cao (Yi)",
  "s2792": "Eight, completely slaughtered the former Jin duke's various sons.",
  "s2808": "Nine, began fortifying Jiang capital.",
  "s2812": "First year of Duke Yi of Wei (Chi)",
  "s2820": "Jia Yin",
  "s2821": "Ten, granted the Qi lord his mandate.",
  "s2856": "Twelve, Crown Prince Shen Sheng resided at Quwo, Chong Er at Pu city, Yi Wu at Qu. Because of Li Ji.",
  "s2887": "Twenty-three, attacked Shan Rong, for Yan's sake.",
  "s2889": "First year of Duke Cheng of Qin",
  "s2902": "Thirty-two, Duke Zhuang's younger brother Shu Ya died by poison. Qing Fu assassinated Zi Ban. Ji You fled to Chen, established Duke Min.",
  "s2918": "First year of Duke Min of Lu",
  "s2920": "Sixteen, extinguished Wei, Geng, Huo. First enfeoffed Zhao Su at Geng, Bi Wan at Wei, began from this.",
  "s2927": "First year of Duke Zhao of Cao",
  "s2934": "Two, Qing Fu assassinated Duke Min. Ji You from Chen established Shen as Duke Xi. Assassinated Qing Fu.",
  "s2936": "Seventeen, Shen Sheng as general, gentleman knew he would be deposed.",
  "s2940": "Di attacked us. The duke favored cranes, soldiers would not fight, extinguished our state. State resented, Duke Hui caused chaos, extinguished his descendants, changed to establish Qian Mu's younger brother. First year of Duke Dai of Wei",
  "s2950": "First year of Duke Xi of Lu (Shen), Ai Jiang's funeral arrived from Qi.",
  "s2951": "Twenty-seven, killed younger sister Duke Zhuang's consort, because of licentiousness.",
  "s2953": "First year of Duke Mu of Qin (Ren Hao)",
  "s2956": "First year of Duke Wen of Wei (Hui), Duke Dai's younger brother.",
  "s2967": "Twenty-eight, built Chu Hill for Wei. Rescued from Rong Di attack.",
  "s2968": "Nineteen, Xun Xi used bribes to borrow passage through Yu to attack Guo, extinguished Xia Yang.",
  "s2972": "Two, Qi Huan Gong led feudal lords to build Chu Hill for us.",
  "s2980": "Jia Zi",
  "s2983": "Twenty-nine, shared boat with Cai Ji, she shook the duke, duke angered, returned Cai Ji.",
  "s2990": "Eighteen, because of the woman, Qi attacked us.",
  "s2993": "First year of Duke Xiang of Yan",
  "s2999": "Thirty, led feudal lords to attack Cai, Cai collapsed, then attacked Chu, demanded the tribute of wrapped mugwort.",
  "s3000": "Twenty-one, Shen Sheng committed suicide because of Li Ji's slander. Chong Er fled to Pu, Yi Wu fled to Qu.",
  "s3001": "Four, welcomed bride from Jin.",
  "s3002": "Sixteen, Qi attacked us, reached Xing, sent Qu Wan to make alliance.",
  "s3016": "Twenty-two, extinguished Yu and Guo. Chong Er fled to Di.",
  "s3031": "Thirty-two, led feudal lords to attack Zheng.",
  "s3032": "Twenty-three, Yi Wu fled to Liang.",
  "s3034": "Eighteen, attacked Xu, Xu lord bared flesh to apologize, Chu followed.",
  "s3061": "Twenty-five, King Xiang established, feared Tai Shu.",
  "s3064": "Twenty-five, attacked Di, because of Chong Er.",
  "s3067": "Thirty, duke ill, Crown Prince Zi Fu yielded to elder brother Mu Yi as worthy, duke did not listen.",
  "s3071": "First year of Duke Gong of Cao",
  "s3077": "First year of King Xiang, feudal lords established the king.",
  "s3078": "Nine, Qi led us to attack Jin's chaos, returned at Gao Liang.",
  "s3079": "Thirty-five, summer, assembled feudal lords at Kui Qiu. The Son of Heaven sent minister Kong to grant sacrificial meat, commanded no bowing.",
  "s3080": "Twenty-six, duke died, established Xi Qi, Li Ke assassinated him and Zhu Zi. Established Yi Wu.",
  "s3081": "Nine, Yi Wu sent Xi Rui with bribes to seek entry."
}