{
  "s0001": "Tai Gong Wang Lu Shang, eastern sea person.",
  "s0002": "His ancestors once for four peaks, assisted Yu pacify waters earth very had merit.",
  "s0003": "Yu Xia between sealed at Lu, or sealed at Shen, surname Jiang clan.",
  "s0004": "Xia Shang time, Shen Lu or sealed branch collateral sons grandsons, or for common people, still their later descendants.",
  "s0005": "Originally surname Jiang clan, followed their seal surname, thus called Lu Shang.",
  "s0006": "Lu Shang probably once poor destitute, aged, with fishing angling tricked Zhou Xi Bo.",
  "s0007": "Xi Bo about to go hunting, divined it, said 'what obtain not dragon not boar not tiger not bear;",
  "s0008": "what obtain hegemon king assistant'.",
  "s0009": "Thus Zhou Xi Bo hunted, indeed met Tai Gong at Wei river yang, spoke with greatly pleased, said 'from my former lord Tai Gong said \"should have sage person suitable Zhou, Zhou with rise\".",
  "s0010": "You truly are he?",
  "s0011": "My Tai Gong awaited you long.'",
  "s0012": "Thus titled him 'Tai Gong Wang', loaded with together return, established as master.",
  "s0013": "Some say, Tai Gong broad knowledge, once served Zhou.",
  "s0014": "Zhou without way, left him.",
  "s0015": "Wander persuaded feudal lords, nowhere met, and finally west returned Zhou Xi Bo.",
  "s0016": "Some say, Lu Shang recluse, hidden seashore.",
  "s0017": "Zhou Xi Bo imprisoned You Li, San Yi Sheng, Hong Yao always knew and recruited Lu Shang.",
  "s0018": "Lu Shang also said 'I heard Xi Bo worthy, moreover good support elderly, why not go there'.",
  "s0019": "Three people for Xi Bo sought beautiful women rare objects, offered to Zhou, to redeem Xi Bo.",
  "s0020": "Xi Bo thus able out, returned state.",
  "s0021": "Speak Lu Shang so served Zhou though different, yet essential was Wen Wu master.",
  "s0022": "Zhou Xi Bo Chang escaped You Li returned, with Lu Shang secret plotted cultivate virtue to overthrow Shang governance, their affairs many military strategy with strange plans, thus later generations speak military and Zhou secret authority all revered Tai Gong as fundamental strategist.",
  "s0023": "Zhou Xi Bo governance peaceful, and judged Yu Rui dispute, then poets praised Xi Bo received mandate called Wen Wang.",
  "s0024": "Attacked Chong, Mi Xu, Quan Yi, greatly built Feng Yi.",
  "s0025": "All under heaven three portions, its two returned Zhou, Tai Gong strategy resided many.",
  "s0026": "Wen Wang collapsed, Wu Wang ascended throne.",
  "s0027": "Nine years, wished continue Wen Wang enterprise, east attacked to observe feudal lords gathered not.",
  "s0028": "Army marched, Master Shang Fu left grasped yellow axe, right held white banner to oath, said 'Azure rhinoceros azure rhinoceros, gather your multitudes, with your boats oars, later arrive chop!'",
  "s0029": "Thus arrived Meng Jin.",
  "s0030": "Feudal lords not appointed but met eight hundred feudal lords.",
  "s0031": "Feudal lords all said 'Zhou can attack'.",
  "s0032": "Wu Wang said 'not yet can'.",
  "s0033": "Returned army, with Tai Gong made this Tai Oath.",
  "s0034": "Dwelt two years, Zhou killed Wang Zi Bi Gan, imprisoned Ji Zi.",
  "s0035": "Wu Wang about attack Zhou, divined tortoise signs, not auspicious, wind rain violent arrived.",
  "s0036": "Group dukes all feared, only Tai Gong strongly advised Wu Wang, Wu Wang thus proceeded.",
  "s0037": "Eleven years first month jia zi, swore at Mu Ye, attacked Shang Zhou.",
  "s0038": "Zhou army defeated routed.",
  "s0039": "Zhou contrary fled, ascended Lu Tai, thus pursued chopped Zhou.",
  "s0040": "Tomorrow, Wu Wang stood at She, group dukes offered clear water, Wei Kang Shu sealed spread ritual mat, Master Shang Fu led sacrificial animal, Shi Yi wrote prayer, to announce gods punished Zhou crime.",
  "s0041": "Scattered Lu Tai money, opened Ju Qiao grain, to relieve poor people.",
  "s0042": "Sealed Bi Gan tomb, released Ji Zi prisoner.",
  "s0043": "Moved nine tripods, repaired Zhou governance, with all under heaven renewed beginning.",
  "s0044": "Master Shang Fu strategy resided many.",
  "s0045": "Thus Wu Wang already pacified Shang and king all under heaven, sealed Master Shang Fu at Qi Ying Qiu.",
  "s0046": "East toward state, road lodged delayed.",
  "s0047": "Inn person said 'I heard opportunity hard get easy lose.",
  "s0048": "Guest sleeps very peaceful, probably not toward state person'.",
  "s0049": "Tai Gong heard it, night clothed and went, plowed dawn arrived state."
}