{
  "s0648": "Gongsun Qing said: 'Immortals can be seen, but emperor goes always hastily, so not seen.",
  "s0649": "Now Your Majesty can make observatory, like Gou city, place dried meat dates, divine people should be summonable.",
  "s0650": "Moreover immortals like tower residence.'",
  "s0651": "Therefore emperor ordered Chang'an then make Flying Lean Gui observatory, Ganquan then make Benefit Extend Longevity observatory, make Qing hold tally set up utensils wait for divine people.",
  "s0652": "Then made Tongtian Stem Terrace, placed sacrificial utensils below it, to summon immortal divine people and such.",
  "s0653": "Therefore Ganquan changed established front hall, began expanding various palace chambers.",
  "s0654": "Summer, had mushroom grow in hall room within.",
  "s0655": "The emperor for blocking river, raised Tongtian Terrace, as if saw light, then issued edict: 'Gan Quan hall room grew mushroom nine stems, amnesty realm, no repeat labor.'",
  "s0657": "The next year, attacked Chaoxian.",
  "s0658": "Summer, drought.",
  "s0659": "Gongsun Qing said: 'Huang Di time feng then heaven drought, dry feng three years.'",
  "s0660": "The emperor then issued edict: 'Heaven drought, perhaps dry feng?",
  "s0661": "Order realm honor sacrifice spirit star.'",
  "s0663": "The next year, emperor suburban sacrificed Yong, opened Hui Zhong road, toured it.",
  "s0664": "Spring, reached Mingze, from Xihe returned.",
  "s0665": "The next year winter, emperor toured Nangan, reached Jiangling east.",
  "s0666": "Ascended ritual Mian Tianzhu Mountain, named South Yue.",
  "s0667": "Floated Yangtze, from Xunyang exited Congyang, passed Pengli, ritual its famous mountains rivers.",
  "s0668": "North reached Langye, toured sea.",
  "s0669": "Fourth month, reached Fenggao repaired feng.",
  "s0670": "Initially, emperor feng Mount Tai, Mount Tai northeast foot ancient time had Bright Hall place, place dangerous not spacious.",
  "s0671": "Emperor wished to treat Bright Hall beside Fenggao, not yet understood its system.",
  "s0672": "Jinan man Gong Yu belt presented Huang Di time Bright Hall diagram.",
  "s0673": "Bright Hall diagram middle has one hall, four sides no walls, covered with thatch, connected water, round palace wall as covered walkway, above has tower, from southwest entered, named Kunlun, emperor from it entered, to bow sacrifice Supreme Deity.",
  "s0674": "Therefore emperor ordered Fenggao make Bright Hall beside Wen, like belt diagram.",
  "s0675": "And five years repaired feng, then sacrificed Tai Yi, Five Emperors at Bright Hall upper seat, ordered Gao Emperor sacrifice seat face it.",
  "s0676": "Sacrificed Hou Tu at lower chamber, with twenty great sacrificial animals.",
  "s0677": "Emperor from Kunlun path entered, began bowed Bright Hall like suburban ritual.",
  "s0678": "Ritual finished, burnt below hall.",
  "s0679": "And emperor moreover ascended Mount Tai, himself had secret sacrifice its peak.",
  "s0680": "Mount Tai below sacrificed Five Emperors, each like their direction, Huang Di together with Red Emperor, officials served sacrifice.",
  "s0681": "Mountain raised fire, below all responded.",
  "s0682": "After two years, eleventh month Jia Zi new moon dawn winter solstice, pushed calendar with this system.",
  "s0683": "Emperor personally reached Mount Tai, with eleventh month Jia Zi new moon dawn winter solstice day sacrificed Supreme Deity Bright Hall, no repair feng shan.",
  "s0684": "Its assisting feast said: 'Heaven additionally bestowed emperor Tai Yuan divine strategy, cycle and begin again.",
  "s0685": "Emperor respectfully bows Tai Yi.'",
  "s0686": "East reached sea, examined entering sea and magicians seeking spirits, none verified, yet increased sending, hoped to encounter them.",
  "s0687": "Eleventh month Yi You, Bai Liang disaster.",
  "s0688": "Twelfth month Jia Wu new moon, emperor personally shan Gao Li, sacrificed Hou Tu.",
  "s0689": "Faced Bohai, about to gaze sacrifice Penglai and such, hoped to reach special court.",
  "s0690": "Emperor returned, because Bai Liang disaster, court received accounts Ganquan.",
  "s0691": "Gongsun Qing said: 'Huang Di went to Qing Ling Terrace, twelve days burned, Huang Di then treated Bright Court.",
  "s0692": "Bright Court is Ganquan.'",
  "s0693": "Magicians many said ancient emperors kings had capitals Ganquan.",
  "s0694": "Afterward emperor moreover court feudal lords Ganquan, Ganquan made feudal lords residences.",
  "s0695": "Brave then said: 'Yue custom has fire disaster, rebuild houses must use large, use to overcome subdue it.'",
  "s0696": "Therefore made Jianzhang Palace, measured thousand gates ten thousand households.",
  "s0697": "Front hall measured high not yet central.",
  "s0698": "Its east then Feng Que, high twenty plus zhang."
}
