{
  "s522": "120",
  "s523": "Three",
  "s524": "Xiongnu enter You Beiping, Ding Xiang.",
  "s525": "Two",
  "s528": "119",
  "s529": "Four",
  "s531": "Three",
  "s532": "Grand General Qing exits Ding Xiang, Palace Gentleman Commander Li Guang becomes Front General, Master of Carriages Gong Sun He becomes Left General, Director of Honors Zhao Shi Qi becomes Right General, Ping Yang Hou Cao Xiang becomes Rear General: strike Chanyu.",
  "s534": "118",
  "s535": "Five",
  "s536": "Cai convicted of encroaching on garden wall, commits suicide.",
  "s537": "Four. Crown Prince Junior Tutor Wu Qiang Hou Zhuang Qing Di becomes Chancellor.",
  "s540": "117",
  "s541": "Six",
  "s542": "Fourth month yi si, imperial son Hong becomes Qi King, Dan becomes Yan King, Xu becomes Guangling King.",
  "s543": "Two",
  "s546": "116",
  "s547": "Yuan Ding first year",
  "s549": "Three",
  "s552": "115",
  "s553": "Two",
  "s554": "Qing Di has crime, commits suicide.",
  "s555": "Four. Crown Prince Grand Tutor Gao Ling Hou Zhao Zhou becomes Chancellor.",
  "s556": "Tang has crime, commits suicide.",
  "s557": "Imperial Secretary Qing.",
  "s558": "114",
  "s559": "Three",
  "s561": "Two",
  "s564": "113",
  "s565": "Four",
  "s566": "Establishes Changshan Xian King son Ping as Zhen Ding King, Shang as Si Shui King. Sixth month middle, Hedong Fen Yin obtains precious tripod.",
  "s567": "Three",
  "s570": "112",
  "s571": "Five",
  "s572": "Third month middle, Nanyue chancellor Jia rebels, kills their king and Han envoy. Eighth month, Zhou convicted of tribute gold, commits suicide.",
  "s573": "Four. Ninth month xin si, Imperial Secretary Shi Qing becomes Chancellor, sealed as Mu Qiu Hou.",
  "s574": "Guard Commander Lu Bo De becomes Subduing Waves General, exits Gui Yang; Director of Honors Yang Pu becomes Tower Ship General, exits Yu Zhang: all defeat Nanyue.",
  "s576": "111",
  "s577": "Six",
  "s578": "Twelfth month, Dong Yue rebels.",
  "s579": "Two",
  "s580": "Former Long Qiang Hou Han Yue becomes Transverse Sea General, exits Kuaiji; Tower Ship General Yang Pu exits Yu Zhang; Commandant Wang Wen Shu exits Kuaiji: all defeat Dong Yue.",
  "s581": "Imperial Secretary Shi.",
  "s582": "110",
  "s583": "Yuan Feng first year.",
  "s585": "Three",
  "s587": "Imperial Secretary Kuan.",
  "s588": "109",
  "s589": "Two"
}
