{
  "s0001": "Confucius was born in Zouyi village, Changping township of Lu.",
  "s0002": "His ancestors were from Song, named Kong Fangshu.",
  "s0003": "Fangshu fathered Bo Xia, Bo Xia fathered Shu Liang He.",
  "s0004": "He mated with a Yan family woman out of wedlock and gave birth to Confucius, having prayed at Ni Hill to obtain Confucius.",
  "s0005": "Confucius was born in the twenty-second year of Duke Xiang of Lu.",
  "s0006": "He was born with a sunken fontanelle on top of his head, so he was named Qiu accordingly.",
  "s0007": "His courtesy name was Zhong Ni, surname Kong.",
  "s0008": "Qiu was born and Shu Liang He died, buried at Fang Mountain.",
  "s0009": "Fang Mountain is east of Lu, so Confucius doubted the location of his father's grave, because his mother kept it secret.",
  "s0010": "When Confucius was a child at play, he would always arrange the sacrificial stands and assume ritual postures.",
  "s0011": "When Confucius's mother died, he held the funeral at Wufu crossroads, showing his caution.",
  "s0012": "A Zou person, the mother of Ran You's father, informed Confucius of his father's grave, then he went and joined the burial at Fang.",
  "s0013": "Confucius was in mourning attire when the Ji family feasted the scholars, and Confucius went along.",
  "s0014": "Yang Hu rebuked him saying: 'The Ji family feasts the scholars, not daring to feast you.'",
  "s0015": "Confucius thus withdrew.",
  "s0016": "At age seventeen, Lu minister Meng Xi Zi was ill and near death, admonishing his heir Yi Zi saying: 'Kong Qiu is a descendant of sages, extinguished in Song.",
  "s0017": "His ancestor Fu Fu He first had Song but yielded to Li Gong.",
  "s0018": "And Zheng Kao Fu assisted Dai, Wu, and Xuan Gong, three summons becoming increasingly respectful, hence the ding inscription says: \"One summons and bent, two summons and bowed, three summons and prostrated, following the wall and running, none dare insult me.",
  "s0019": "Rice here, gruel here, to fill my mouth.\"'",
  "s0020": "His respectfulness was like this.",
  "s0021": "I have heard that descendants of sages, though not contemporary, must have achievers.",
  "s0022": "Now Kong Qiu is young and fond of ritual, is he an achiever?",
  "s0023": "If I die, you must take him as teacher.'",
  "s0024": "When Xi Zi died, Yi Zi and Lu man Nan Gong Jing Shu went to study ritual with him.",
  "s0025": "This year, Ji Wu Zi died, and Ping Zi succeeded him.",
  "s0026": "Confucius was poor and lowly.",
  "s0027": "When grown, he once served as Ji family accountant, measuring quantities fairly;",
  "s0028": "once served as keeper of stores and increased the livestock.",
  "s0029": "From this he became Director of Works.",
  "s0030": "Then he left Lu, was rejected in Qi, driven out of Song and Wei, besieged between Chen and Cai, then returned to Lu.",
  "s0031": "Confucius was nine chi six cun tall, people all called him 'tall man' and considered him unusual.",
  "s0032": "Lu again treated him well, so he returned to Lu.",
  "s0033": "Lu's Nan Gong Jing Shu spoke to the Lu lord saying: 'Please go with Confucius to Zhou.'",
  "s0034": "The Lu lord gave him one chariot, two horses, one attendant, went to Zhou to inquire about ritual, reportedly meeting Lao Zi.",
  "s0035": "When leaving, Lao Zi saw him off saying: 'I have heard that the wealthy and noble send people off with wealth, benevolent people send people off with words.",
  "s0036": "I cannot be wealthy and noble, I secretly bear the title of benevolent person, send you off with words, saying: \"Those who are clever and deeply perceptive yet close to death are those who like to criticize others.",
  "s0037": "Those who are broadly argumentative and expansive endanger themselves are those who expose others' faults.",
  "s0038": "As a son, do not consider yourself important; as a minister, do not consider yourself important.\"'",
  "s0039": "Confucius returned from Zhou to Lu, and disciples gradually increased.",
  "s0040": "At this time, Jin Ping Gong was licentious, the six ministers monopolized power, attacking eastern feudal lords;",
  "s0041": "Chu Ling Wang's troops were strong, trampling the central states;",
  "s0042": "Qi was large and close to Lu.",
  "s0043": "Lu was small and weak, attaching to Chu angered Jin;",
  "s0044": "attaching to Jin brought Chu to attack;",
  "s0045": "not preparing for Qi brought Qi troops to invade Lu.",
  "s0046": "In Duke Zhao of Lu's twentieth year, Confucius was about thirty years old.",
  "s0047": "Qi Jing Gong and Yan Ying came to Lu, Jing Gong asked Confucius: 'In the past, Qin Mu Gong's state was small and in a remote place, how did he become hegemon?'",
  "s0048": "He replied: 'Qin, though the state was small, its ambitions were great;",
  "s0049": "though the place was remote, its conduct was upright.",
  "s0050": "He employed the worthy and able, listened to straight words, united the Western Rong, cultivated virtue and righteousness, served the king respectfully, aided the weak, attacked the violent - this is how he became hegemon.'",
  "s0051": "景公說，厚禮留孔子，孔子固辭不受，歸魯。",
  "s0052": "孔子年三十五，而季平子與郈昭伯以鬪雞故得罪魯昭公，昭公率師擊平子，平子與孟孫氏、叔孫氏三家共攻昭公，昭公師敗，奔於齊，齊處昭公乾侯。",
  "s0053": "其後季平子卒，季桓子嗣位。",
  "s0054": "桓子嬖臣曰仲梁懷，與陽虎有隙。",
  "s0055": "陽虎欲逐懷，公山不狃止之。",
  "s0056": "其明年，懷益驕，陽虎執懷。",
  "s0057": "桓子怒，陽虎因囚桓子，與盟而釋之。",
  "s0058": "陽虎由此益輕季氏。",
  "s0059": "季氏亦僭於公室，陪臣執國政，是以魯自大夫以下皆僭離於正道。",
  "s0060": "故孔子不仕，退而修詩書禮樂，弟子彌眾，至自遠方，莫不受業焉。",
  "s0061": "孔子以詩書禮樂教弟子，蓋三千焉，身通六藝者七十二人。",
  "s0062": "孔子以四教：文、行、忠、信。",
  "s0063": "絕四：毋意、毋必、毋固、毋我。",
  "s0064": "所 careful：喪、祭、射、御。",
  "s0065": "子貢問曰：「貧而無諂，富而無驕，何如？」",
  "s0066": "孔子曰：「未若貧而樂，富而好禮者也。」",
  "s0067": "子貢曰：「《詩》云『如切如磋，如琢如磨』，其斯之謂與？」",
  "s0068": "孔子曰：「賜也！始可與言詩已矣，告諸往而知來者。」",
  "s0069": "孔子曰：「不憤不啟，不悱不發，舉一隅不以三隅反，則不復也。」",
  "s0070": "孔子年四十二，魯昭公卒於乾侯，定公立。",
  "s0071": "定公立五年，季平子卒，桓子代立。",
  "s0072": "季桓子穿井得土缶，中若羊，問仲尼云「得狗」。",
  "s0073": "仲尼曰：「以丘所聞，羊也。",
  "s0074": "丘聞之，木石之怪夔、罔閬，水之怪龍、罔象，土之怪坟羊。」",
  "s0075": "孔子年四十七，而徵魯司寇。",
  "s0076": "孔子為魯司寇，舍公族，誅少正卯，魯之兇人為之徙。",
  "s0077": "三月，魯大治。",
  "s0078": "齊人歸女樂以沮之。",
  "s0079": "季桓子受之，三日不聽政；",
  "s0080": "郊，又不致膰組於大夫；",
  "s0081": "孔子遂行，宿於屯。",
  "s0082": "將適齊，為尼丘之言者所止。",
  "s0083": "於是反魯。",
  "s0084": "孔子年五十有一而不間魯政。",
  "s0085": "定公以孔子為中都宰，一年，四方皆則之。",
  "s0086": "由中都宰為司空，由司空為大司寇。",
  "s0087": "孔子年五十五，魯定公以問禮老禮於孔子。",
  "s0088": "孔子曰：「魯自大夫以下皆僭妄，久矣。」",
  "s0089": "定公以孔子為魯大司寇，齊人聞而畏之。",
  "s0090": "犂鉏曰：「孔子為政必霸，霸則吾地近焉，我及齊國之政未可知也。",
  "s0091": "君其早圖之。」",
  "s0092": "齊景公患之，亶朋曰：「請君臣而告魯為好會，召孔子。",
  "s0093": "孔子將往，子路曰：「昔者由也聞諸夫子：『親於其身為不善者，君子不入也。』",
  "s0094": "今孔子從君臣而伐蠻夷，君臣若召孔子，未有失也。」",
  "s0095": "孔子謂子路曰：「魯至此兮，吾丘之罪也！」",
  "s0096": "遂不行。",
  "s0097": "齊人為女樂以誘魯君，并赂季桓子，魯君遂受女樂，三日不聽政。",
  "s0098": "孔子聞之，曰：「彼婦之口，可以出走矣。」",
  "s0099": "於是孔子遂適衛，主於子路妻兄顏浊鄒家。",
  "s0100": "衛靈公問孔子：「居魯得祿幾何？」",
  "s0101": "對曰：「俸粟六萬。」"
}
