{
  "s0250": "Small large mutually complete, end beginning mutually born, lead harmony clear turbid, alternate mutually as warp.",
  "s0251": "Thus music carries principles clear, ears eyes intelligent, blood qi peaceful, shift customs change habits, world all peaceful.",
  "s0252": "Thus said 'music joy'.",
  "s0253": "Gentleman joy gets way, small person joy gets desires.",
  "s0254": "With way control desires, then joy without chaos;",
  "s0255": "With desires forget way, then confused without joy.",
  "s0256": "Thus gentleman returns to feeling harmonize will, broadens joy completes teaching, music carries people turn to square, can observe virtue.",
  "s0257": "Virtue, nature's beginning;",
  "s0258": "Music, virtue's flower;",
  "s0259": "Metal stone silk bamboo, music's instruments.",
  "s0260": "Poem, speaks will;",
  "s0261": "Song, chants sound;",
  "s0262": "Dance, moves appearance: three from heart, then music qi follows.",
  "s0263": "Thus feelings deep civilized bright, qi flourishing transforms divine, harmonious yielding accumulates center brilliant flower issues outside, only music cannot be false.",
  "s0264": "Music, heart's movement;",
  "s0265": "Sound, music's image;",
  "s0266": "Patterns colors rhythms, sound's ornament.",
  "s0267": "Gentleman moves root, enjoys image, then governs ornament.",
  "s0268": "Thus first drum to warn guard, three steps to show square, twice begin to manifest going, return chaos to arrange return, rouse quick without pull, extreme dark without hide.",
  "s0269": "Alone joy will, not weary way;",
  "s0270": "Complete raise way, not private desires.",
  "s0271": "Thus feelings appear righteousness established, music ends virtue honored;",
  "s0272": "Gentleman with love good, small person with cease faults: thus said 'born people way, music great'.",
  "s0273": "Gentleman says: ritual music cannot moment leave body.",
  "s0274": "Reach music to govern heart, then easy straight filial sincere heart naturally born.",
  "s0275": "Easy straight filial sincere heart born then joy, joy then peaceful, peaceful then long, long then heaven, heaven then divine.",
  "s0276": "Heaven then not speak trustworthy, divine then not angry awe.",
  "s0277": "Reach music, to govern heart;",
  "s0278": "Reach ritual, to govern person.",
  "s0279": "Govern person then solemn respectful, solemn respectful then strict awe.",
  "s0280": "Heart moment not harmonious not joyful, base deceit heart enters;",
  "s0281": "Outside appearance moment not solemn not respectful, lazy easy heart enters.",
  "s0282": "Thus music, moves within;",
  "s0283": "Ritual, moves without.",
  "s0284": "Music extreme harmony, ritual extreme yielding.",
  "s0285": "Inner harmony outer yielding, then people gaze face not contend, look appearance people not born easy lazy.",
  "s0286": "Virtue splendor moves within people none not receive hear, principle issues without people none not receive follow, thus said 'know ritual music way, raise place world no difficulty'.",
  "s0287": "Music, moves within;",
  "s0288": "Ritual, moves without.",
  "s0289": "Thus ritual masters humility, music masters fullness.",
  "s0290": "Ritual humble advances, with advance as pattern;",
  "s0291": "Music full returns, with return as pattern.",
  "s0292": "Ritual humble not advance, then disappears;",
  "s0293": "Music full not return, then abandons.",
  "s0294": "Thus ritual has repay music has return.",
  "s0295": "Ritual gets repay then joy, music gets return then peaceful.",
  "s0296": "Ritual's repay, music's return, meaning one.",
  "s0297": "Music joy, human feelings cannot avoid.",
  "s0298": "Music must issue from sounds, form in movement stillness, human way.",
  "s0299": "Sounds movement stillness, nature method change, exhaust here."
}
