{
  "s312": "Eight",
  "s313": "Sixteen. After year 1, Marquis Wu died. Successor son Qi rebelled, could not establish heir, state abolished.",
  "s316": "Thirteen",
  "s317": "Duchang.",
  "s318": "As retainer year 1 BCE followed uprising in Pei, as cavalry detachment led first surrender of Di King, captured Zhang Han, meritorious service led to marquisate.",
  "s319": "Seven. Year 6 month 3 Geng Zi day, Marquis Zhuang Zhu Zhen year 1.",
  "s320": "Seven",
  "s321": "Eight. Year 1, Marquis Gang Shuai year 1.",
  "s322": "Seven. Sixteen. Year 8, Marquis Yi Qu year 1.",
  "s323": "Two. Year 1, Marquis Gong Yan year 1. Five. Year 3, Marquis Pi Qiang year 1. Zhong year 1, Pi Qiang died, no heir, state abolished.",
  "s325": "Twenty-three",
  "s326": "Wuqiang.",
  "s327": "As retainer followed to Baxiang, as cavalry general entered Han. Returned to attack Xiang Yu, attached to Chancellor Ning, meritorious service led to marquisate, became general attacked Qing Bu, became marquis.",
  "s328": "Seven. Year 6 month 3 Geng Zi day, Marquis Zhuang Zhuang Bu Shi year 1.",
  "s329": "Seven",
  "s330": "Six. Two. Year 7, Marquis Jian Ying year 1.",
  "s331": "Seventeen. Six. After year 2, Marquis Qing Di year 1.",
  "s332": ". Sixteen",
  "s333": "Twenty-five. Yuanding year 2, Marquis Qing Di convicted as Chancellor together with Chief Clerk Zhu Mai Chen etc. arrested Grand Master of the Court Tang unfairly, state abolished.",
  "s334": "Thirty-three",
  "s335": "Shi.",
  "s336": "As Yue household commander followed breaking Qin, entered Han, pacified Three Qins, as commandery captain attacked Xiang Yu, 1,600 households, meritorious service comparable to Marquis of Tai.",
  "s337": "Two. Year 6, month 3 Geng Zi day, Marquis of Qi Lü year 1. Five. Year 8, Marquis Gong Fang Shan year 1.",
  "s338": "Seven",
  "s339": "Eight",
  "s340": "Two. Year 1, Marquis Yang Chi year 1. Twelve. Year 12, Marquis Kang Yi year 1.",
  "s341": "Sixteen",
  "s342": "Sixteen. Yuanshuo year 5, Marquis Qian year 1. Eight. Yuanding year 1, Marquis Qian convicted of murder executed in market, state abolished.",
  "s343": "Thirty-six",
  "s344": "Haiyang.",
  "s345": "As Yue detachment general followed breaking Qin, entered Han pacified Three Qins, as commandery captain attacked Xiang Yu, became marquis, 1,800 households.",
  "s346": "Seven. Year 6 month 3 Geng Zi day, Marquis of Qi Xin Yao Wuyu year 1.",
  "s347": "Two. Five. Year 3, Marquis Ai Zhao Rang year 1.",
  "s348": "Four. Four. Year 5, Marquis Kang Jian year 1.",
  "s349": "Twenty-three",
  "s350": "Three. Year 4, Marquis Ai Xing year 1. Ten. Zhong year 6, Marquis Xing died, no heir, state abolished.",
  "s352": "Thirty-seven",
  "s353": "Nanan.",
  "s354": "As Henan general Han King year 3 surrendered Jinyang, as deputy general defeated Zang Tea, became marquis, 900 households.",
  "s355": "Seven. Year 6 month 3 Geng Zi day, Marquis Zhuang Xuan Hu year 1.",
  "s356": "Seven",
  "s357": "Eight",
  "s358": "Eight. Eleven. Year 9, Marquis Gong Rong year 1. Four. After year 4, Marquis Qianqiu year 1.",
  "s359": "Seven. Zhong year 1, Qianqiu convicted of injuring person, dismissed.",
  "s361": "Sixty-three",
  "s362": "Feiru.",
  "s363": "As Wei Grand Coachman year 3 initially followed, as chariot cavalry commandery captain defeated Long Qu and Pengcheng, became marquis, 1,000 households.",
  "s364": "Seven. Year 6 month 3 Geng Zi day, Marquis Jing Cai Yin year 1.",
  "s365": "Seven",
  "s366": "Eight"
}
