{
  "s367": "Two. Fourteen. Year 3, Marquis Zhuang Cheng year 1. Seven. After year 1, Marquis Nu year 1.",
  "s368": "Year 1, Marquis Nu died, no heir, state abolished.",
  "s370": "Sixty-six",
  "s371": "Qucheng.",
  "s372": "As Qucheng household commander leading 37 troops initially followed uprising in Dang, to Baxiang, became holder of jade tablet, became second detachment general, attached to King Dao Wu, entered Han, pacified Three Qins, as commandery captain defeated Xiang Yu's army at Chenxia, meritorious service led to marquisate, 4,000 households. Became general, attacked Yan, Dai, captured them.",
  "s373": "Seven. Year 6 month 3 Geng Zi day, Marquis Yu Gu Feng year 1.",
  "s374": "Seven",
  "s375": "Eight",
  "s376": "Eight. Year 1, Marquis Jie year 1. Committed crime, extinct. Five. After year 3, re-enfeoffed Marquis Gong Jie year 1.",
  "s377": "Thirteen. Committed crime, extinct. Yuan five. Zhong year 5, re-enfeoffed Marquis Gong Jie year 1.",
  "s378": "One. Jianyuan year 2, Marquis Gao Rou year 1. Twenty-five. Yuanding year 3, Marquis Gao Rou convicted as Grand Administrator of Runan knowing people not using red side coins for taxes, state abolished.",
  "s379": "Eighteen",
  "s380": "Heyang.",
  "s381": "As soldier year 1 BCE rose from Dang followed, as second detachment general entered Han, attacked Xiang Yu, personally received palace attendant general position, meritorious service led to marquisate. As Chancellor pacified Qi territory.",
  "s382": "Seven. Year 6 month 3 Geng Zi day, Marquis Zhuang Chen Juan year 1.",
  "s383": "Seven",
  "s384": "Eight",
  "s385": "Three. Year 1, Marquis Xin year 1. Four. Year 4, Marquis Xin convicted of not repaying debts over six months, deprived of marquisate, state abolished.",
  "s388": "Twenty-nine",
  "s389": "Huaiyin.",
  "s390": "Troops initially rose, as soldier followed Xiang Liang, Liang died attached to Xiang Yu as palace attendant, to Xianyang, fled to follow into Han, became lian'ao master of guests, Xiao He spoke became Grand General, separately pacified Wei, Qi, became king, moved to Chu, convicted of arbitrarily raising troops, demoted to Marquis of Huaiyin.",
  "s391": "Five. Year 6 month 4, Marquis Han Xin year 1. Year 11, Xin plotted rebellion in Guanzhong, Lü Empress executed Xin, exterminated three clans, state abolished.",
  "s398": "Mang.",
  "s399": "As gate captain year 1 BCE initially rose from Dang, to Baxiang, became Wu Ding Jun, entered Han, returned pacified Three Qins, as commandery captain attacked Xiang Yu, became marquis.",
  "s400": "Three. Year 6, Marquis Zhao year 1. Year 9, Marquis Zhao committed crime, state abolished.",
  "s404": "Zhang eleven. Jing year 3, Zhao as former Marquis of Mang led troops following Grand Commandant Yafu attacked Wu Chu with merit, re-enfeoffed as marquis. Three. After year 1 month 3, Marquis Shen year 1.",
  "s405": "Seventeen. Yuanshuo year 6, Marquis Shen convicted of marrying Nanguan princess, disrespectful, state abolished.",
  "s407": "Gushi.",
  "s408": "As shield bearer initially rose, entered Han, became River guard, promoted to acting chancellor, attacked Xiang Yu, became marquis, 1,000 households, meritorious service comparable to Marquis of Pingding.",
  "s409": "Three. Year 6 month 4 Gui Wei day, Marquis Yan Ze Chi year 1. Four. Year 9, Marquis Yi Wu Hai year 1.",
  "s410": "Seven",
  "s411": "Eight",
  "s412": "Nineteen. Four. After year 4, Marquis Dai Xu year 1.",
  "s413": "Four. Twelve. Jing year 5, Marquis Gu succeeded.",
  "s414": "Twenty-eight. Yuanding year 5, Marquis Gu convicted of tribute gold, state abolished.",
  "s415": "Fifty-five",
  "s416": "Liuqiu.",
  "s417": "As lian'ao followed uprising in Xue, as second detachment general entered Han, pacified Three Qins, as commandery captain defeated Xiang Ji's army, became general. Became marquis, 1,000 households.",
  "s418": "Seven. Year 6 month 6 Ding Hai day, Marquis of Qi Rong Ci year 1.",
  "s419": "Seven",
  "s420": "Four. Four. Year 5, Marquis Ding An Guo year 1.",
  "s421": "Twenty-three",
  "s422": "Three. Year 4, Marquis Jing Jia Cheng year 1. Ten. After year 1, Marquis Jue succeeded, committed crime, state abolished.",
  "s424": "Twenty-six",
  "s425": "Weiqi.",
  "s426": "As retainer followed from Pei, as palace attendant entered Han, became Zhou Xin Hou, pacified Three Qins, promoted to palace attendant cavalry general, defeated Ji at Dongcheng, became marquis, 1,000 households.",
  "s427": "Seven. Year 6 month 6 Ding Hai day, Marquis Zhuang Zhou Ding year 1.",
  "s428": "Seven",
  "s429": "Four. Four. Year 5, Marquis Jian year 1.",
  "s430": "Twenty-three"
}
