{
  "s0021": {
    "chinese": "公劉雖在戎狄之間，復修后稷之業，務耕種，行地宜，自漆、沮度渭，取材用，行者有資，居者有畜積，民賴其慶。",
    "literal": "Although Gong Liu was among the Rong and Di barbarians, he revived Houji's work, devoted himself to farming and planting, practiced what was suitable for the land, from Qi and Ju crossed the Wei, took timber for use, travelers had provisions, residents had stores, the people relied on his good fortune.",
    "idiomatic": ""
  },
  "s0022": {
    "chinese": "百姓懷之，多徙而保歸焉。",
    "literal": "The common people cherished him, many migrated and sought protection in returning to him.",
    "idiomatic": ""
  },
  "s0023": {
    "chinese": "周道之興自此始，故詩人歌樂思其德。",
    "literal": "The rise of the Zhou way began from this, therefore poets sang and delighted in thinking of his virtue.",
    "idiomatic": ""
  },
  "s0024": {
    "chinese": "公劉卒，子慶節立，國於豳。",
    "literal": "Gong Liu died, his son Qing Jie ascended, established the state at Bin.",
    "idiomatic": ""
  },
  "s0025": {
    "chinese": "慶節卒，子皇仆立。",
    "literal": "Qing Jie died, his son Huang Pu ascended.",
    "idiomatic": ""
  },
  "s0026": {
    "chinese": "皇仆卒，子差弗立。",
    "literal": "Huang Pu died, his son Cha Fu ascended.",
    "idiomatic": ""
  },
  "s0027": {
    "chinese": "差弗卒，子毀隃立。",
    "literal": "Cha Fu died, his son Hou Zhu ascended.",
    "idiomatic": ""
  },
  "s0028": {
    "chinese": "毀隃卒，子公非立。",
    "literal": "Hou Zhu died, his son Gong Bo ascended.",
    "idiomatic": ""
  },
  "s0029": {
    "chinese": "公非卒，子高圉立。",
    "literal": "Gong Bo died, his son Tai Wang ascended.",
    "idiomatic": ""
  },
  "s0030": {
    "chinese": "高圉卒，子亞圉立。",
    "literal": "Tai Wang had sons Tai Bo, Yu Zhong, and Ji Li.",
    "idiomatic": ""
  },
  "s0031": {
    "chinese": "亞圉卒，子公叔祖類立。",
    "literal": "Ya Yu died, his son Gong Shu Zu Lei ascended.",
    "idiomatic": ""
  },
  "s0032": {
    "chinese": "公叔祖類卒，子古公亶父立。",
    "literal": "Gong Shu Zu Lei died, his son Gu Gong Dan Fu ascended.",
    "idiomatic": ""
  },
  "s0033": {
    "chinese": "古公亶父復修后稷、公劉之業，積德行義，國人皆戴之。",
    "literal": "Gu Gong Dan Fu revived the work of Houji and Gong Liu, accumulated virtue and practiced righteousness, all the people of the state revered him.",
    "idiomatic": ""
  },
  "s0034": {
    "chinese": "薰育戎狄攻之，欲得財物，予之。",
    "literal": "The Xun Yu Rong and Di attacked him, desiring to obtain wealth and goods, he gave them to them.",
    "idiomatic": ""
  },
  "s0035": {
    "chinese": "已復攻，欲得地與民。",
    "literal": "Afterward they attacked again, desiring to obtain land and people.",
    "idiomatic": ""
  },
  "s0036": {
    "chinese": "民皆怒，欲戰。",
    "literal": "The people were all angry and wished to fight.",
    "idiomatic": ""
  },
  "s0037": {
    "chinese": "古公曰：「有民立君，將以利之。",
    "literal": "Gu Gong said: 'The ruler's way is to benefit the people. Though I die, why begrudge it? I will not fight.'",
    "idiomatic": ""
  },
  "s0038": {
    "chinese": "今戎狄所為攻戰，以吾地與民。",
    "literal": "He prepared to move. The people all wished to follow the ruler.",
    "idiomatic": ""
  },
  "s0039": {
    "chinese": "民之在我，與其在彼，何異。",
    "literal": "Gu Gong said: 'Those who reveal my plans will die.'",
    "idiomatic": ""
  },
  "s0040": {
    "chinese": "民欲以我故戰，殺人父子而君之，予不忍為。」",
    "literal": "He secretly ordered his sons: 'When I leave, you must follow me quickly.'",
    "idiomatic": ""
  },
  "s0041": {
    "chinese": "乃與私屬遂去豳，度漆、沮，踰梁山，止於岐下。",
    "literal": "The next day he left, and the people followed him saying: 'We will die with our ruler.'",
    "idiomatic": ""
  },
  "s0042": {
    "chinese": "豳人舉國扶老攜弱，盡復歸古公於岐下。",
    "literal": "Gu Gong feared the Rong and Di would pursue and harm the people, so he stopped and said: 'You love me, but I cannot bear to harm you.'",
    "idiomatic": ""
  },
  "s0043": {
    "chinese": "及他旁國聞古公仁，亦多歸之。",
    "literal": "He separated 300 li of land to give to the Rong and Di, and moved to Qi.",
    "idiomatic": ""
  },
  "s0044": {
    "chinese": "於是古公乃貶戎狄之俗，而營筑城郭室屋，而邑別居之。",
    "literal": "Therefore, the ancient Duke abandoned the customs of the Rong and Di barbarians, and built walled cities, houses, and rooms, separating the people into distinct settlements.",
    "idiomatic": ""
  },
  "s0045": {
    "chinese": "作五官有司。",
    "literal": "He made Tai Bo and Yu Zhong cede the throne to Ji Li.",
    "idiomatic": ""
  },
  "s0046": {
    "chinese": "民皆歌樂之，頌其德。",
    "literal": "Tai Bo and Yu Zhong agreed and went to Wu and Yue, tattooed and cut their hair, and became foreigners.",
    "idiomatic": ""
  },
  "s0047": {
    "chinese": "古公有長子曰太伯，次曰虞仲。",
    "literal": "The people of Wu and Yue heard of Tai Bo's virtue and all came to him.",
    "idiomatic": ""
  },
  "s0048": {
    "chinese": "太姜生少子季歷，季歷娶太任，皆賢婦人，生昌，有聖瑞。",
    "literal": "Ji Li inherited the throne as King Wen.",
    "idiomatic": ""
  },
  "s0049": {
    "chinese": "古公曰：「我世當有興者，其在昌乎？」",
    "literal": "King Wen was diligent in government and loved the people.",
    "idiomatic": ""
  },
  "s0050": {
    "chinese": "長子太伯、虞仲知古公欲立季歷以傳昌，乃二人亡如荊蠻，文身斷髪，以讓季歷。",
    "literal": "He sought out worthies and sages, and the Duke of Zhou and others came to him.",
    "idiomatic": ""
  },
  "s0051": {
    "chinese": "古公卒，季歷立，是為公季。",
    "literal": "Gu Gong died, Ji Li ascended, this was Gong Ji.",
    "idiomatic": ""
  },
  "s0052": {
    "chinese": "公季修古公遺道，篤於行義，諸侯順之。",
    "literal": "Gong Ji followed Gu Gong's legacy, was devoted to practicing righteousness, the lords submitted to him.",
    "idiomatic": ""
  },
  "s0053": {
    "chinese": "公季卒，子昌立，是為西伯。",
    "literal": "Gong Ji died, his son Chang ascended, this was Xi Bo.",
    "idiomatic": ""
  },
  "s0054": {
    "chinese": "西伯曰文王，遵后稷、公劉之業，則古公、公季之法，篤仁，敬老，慈少。",
    "literal": "Xi Bo was called King Wen, followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, loved the young.",
    "idiomatic": ""
  },
  "s0055": {
    "chinese": "禮下賢者，日中不暇食以待士，士以此多歸之。",
    "literal": "He treated worthies with courtesy, at noon had no time to eat while waiting for scholars, scholars therefore came to him in great numbers.",
    "idiomatic": ""
  },
  "s0056": {
    "chinese": "伯夷、叔齊在孤竹，聞西伯善養老，盍往歸之。",
    "literal": "Bo Yi and Shu Qi were in Gu Zhu, heard Xi Bo was good at caring for the elderly, and came to join him.",
    "idiomatic": ""
  },
  "s0057": {
    "chinese": "太顛、閎夭、散宜生、鬻子、辛甲大夫之徒皆往歸之。",
    "literal": "Taidian, Hongyao, San Yisheng, Yuzi, and Xiahou Dafu and others came to him.",
    "idiomatic": ""
  },
  "s0058": {
    "chinese": "崇侯虎譖西伯於殷紂曰：「西伯積善累德，諸侯皆向之，將不利於帝。」",
    "literal": "When King Wen was imprisoned at Youli, he increased in strength, the lords many came to Xi Bo.",
    "idiomatic": ""
  },
  "s0059": {
    "chinese": "帝紂乃囚西伯於羑里。",
    "literal": "When King Wen was released from prison, the Shang king gave him the right to punish without asking permission.",
    "idiomatic": ""
  },
  "s0060": {
    "chinese": "閎夭之徒患之。",
    "literal": "Hongyao and others were troubled by this.",
    "idiomatic": ""
  },
  "s0061": {
    "chinese": "乃求有莘氏美女，驪戎之文馬，有熊九駟，他奇怪物，因殷嬖臣費仲而獻之紂。",
    "literal": "King Wen said: 'My ancestor Houji founded our clan. I should restore the title of Houji.'",
    "idiomatic": ""
  },
  "s0062": {
    "chinese": "紂大說，曰：「此一物足以釋西伯，況其多乎！」",
    "literal": "He went to inspect the descendants of Houji and found Wu Wang.",
    "idiomatic": ""
  },
  "s0063": {
    "chinese": "乃赦西伯，賜之弓矢斧鉞，使西伯得征伐。",
    "literal": "Wu Wang was worthy, King Wen made him Houji.",
    "idiomatic": ""
  },
  "s0064": {
    "chinese": "曰：「譖西伯者，崇侯虎也。」",
    "literal": "King Wen died, his son Fa ascended, this was King Wu.",
    "idiomatic": ""
  },
  "s0065": {
    "chinese": "西伯乃獻洛西之地，以請紂去炮格之刑。",
    "literal": "King Wu was diligent and wise, the people were at peace.",
    "idiomatic": ""
  },
  "s0066": {
    "chinese": "紂許之。",
    "literal": "King Wu married the daughter of the ruler of Yu, gave birth to King Cheng.",
    "idiomatic": ""
  },
  "s0067": {
    "chinese": "西伯陰行善，諸侯皆來決平。",
    "literal": "King Wu made the Duke of Zhou and others his ministers.",
    "idiomatic": ""
  },
  "s0068": {
    "chinese": "於是虞、芮之人有獄不能決，乃如周。",
    "literal": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": ""
  },
  "s0069": {
    "chinese": "入界，耕者皆讓畔，民俗皆讓長。",
    "literal": "The Duke of Zhou was devoted to his duties, King Cheng was pleased.",
    "idiomatic": ""
  },
  "s0070": {
    "chinese": "虞、芮之人未見西伯，皆慚，相謂曰：「吾所爭，周人所恥，何往為，秖取辱耳。」",
    "literal": "The Duke of Zhou made the Shao Proclamation, and the people were at peace.",
    "idiomatic": ""
  },
  "s0071": {
    "chinese": "遂還，俱讓而去。",
    "literal": "King Cheng grew up, the Duke of Zhou returned power to him.",
    "idiomatic": ""
  },
  "s0072": {
    "chinese": "諸侯聞之，曰「西伯蓋受命之君」。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": ""
  },
  "s0073": {
    "chinese": "明年，伐犬戎。",
    "literal": "King Cheng died, his son Kang Wang ascended.",
    "idiomatic": ""
  },
  "s0074": {
    "chinese": "明年，伐密須。",
    "literal": "Kang Wang monitored the eastern regions, toured the lords, administered justice, the nation was at peace.",
    "idiomatic": ""
  },
  "s0075": {
    "chinese": "明年，敗耆國。",
    "literal": "Forty more years without punishment, the world was at peace under Kang Wang.",
    "idiomatic": ""
  },
  "s0076": {
    "chinese": "殷之祖伊聞之，懼，以告帝紂。",
    "literal": "The Shang ancestor Yi heard of this and was afraid, reported it to Emperor Zhou.",
    "idiomatic": ""
  },
  "s0077": {
    "chinese": "紂曰：「不有天命乎？",
    "literal": "Zhou said: 'Is there not the Heavenly Mandate?",
    "idiomatic": ""
  },
  "s0078": {
    "chinese": "是何能為！」",
    "literal": "What can they do!'",
    "idiomatic": ""
  },
  "s0079": {
    "chinese": "明年，伐邘。",
    "literal": "The next year, attacked Tang.",
    "idiomatic": ""
  },
  "s0080": {
    "chinese": "明年，伐崇侯虎。",
    "literal": "The next year, attacked Chong Hou Hu.",
    "idiomatic": ""
  },
  "s0081": {
    "chinese": "而作豐邑，自岐下而徙都豐。",
    "literal": "He built Feng city, moved the capital from Qi below the mountain to Feng.",
    "idiomatic": ""
  },
  "s0082": {
    "chinese": "明年，西伯崩，太子發立，是為武王。",
    "literal": "The next year, defeated the Qi state.",
    "idiomatic": ""
  },
  "s0083": {
    "chinese": "西伯蓋即位五十年。",
    "literal": "King Wen died, King Wu ascended.",
    "idiomatic": ""
  },
  "s0084": {
    "chinese": "其囚羑里，蓋益易之八卦為六十四卦。",
    "literal": "King Wu made the Duke of Zhou prime minister, and the Duke of Shao assistant.",
    "idiomatic": ""
  },
  "s0085": {
    "chinese": "詩人道西伯，蓋受命之年稱王而斷虞芮之訟。",
    "literal": "He prepared troops, observed the stars and constellations, chose an auspicious day.",
    "idiomatic": ""
  },
  "s0086": {
    "chinese": "後十年而崩，謚為文王。",
    "literal": "King Wu reviewed the troops at Mengjin.",
    "idiomatic": ""
  },
  "s0087": {
    "chinese": "改法度，制正朔矣。",
    "literal": "The Shang king Zhou heard of this and laughed, saying: 'The western barbarians are few.'",
    "idiomatic": ""
  },
  "s0088": {
    "chinese": "追尊古公為太王，公季為王季：蓋王瑞自太王興。",
    "literal": "He did not prepare defenses.",
    "idiomatic": ""
  },
  "s0089": {
    "chinese": "武王即位，太公望為師，周公旦為輔，召公、畢公之徒左右王，師修文王緒業。",
    "literal": "King Wu crossed the Yellow River at Mengjin with 800 lords.",
    "idiomatic": ""
  },
  "s0090": {
    "chinese": "九年，武王上祭于畢。",
    "literal": "The next day, engaged in battle at Muye.",
    "idiomatic": ""
  },
  "s0091": {
    "chinese": "東觀兵，至于盟津。",
    "literal": "The Shang troops were numerous, but the Zhou troops were resolute.",
    "idiomatic": ""
  },
  "s0092": {
    "chinese": "為文王木主，載以車，中軍。",
    "literal": "The Shang troops all turned against Zhou, and Zhou was defeated.",
    "idiomatic": ""
  },
  "s0093": {
    "chinese": "武王自稱太子發，言奉文王以伐，不敢自專。",
    "literal": "King Wu entered the Shang capital, the city of Zhao.",
    "idiomatic": ""
  },
  "s0094": {
    "chinese": "乃告司馬、司徒、司空、諸節：「齊栗，信哉！",
    "literal": "He captured the treasures of the Yin Shang, returned to Fenghao.",
    "idiomatic": ""
  },
  "s0095": {
    "chinese": "予無知，以先祖有德臣，小子受先功，畢立賞罰，以定其功。」",
    "literal": "He divided the lands, enfeoffed the Zhou lords.",
    "idiomatic": ""
  },
  "s0096": {
    "chinese": "遂興師。",
    "literal": "He put the Duke of Zhou in charge of the eastern regions.",
    "idiomatic": ""
  },
  "s0097": {
    "chinese": "師尚父號曰：「總爾眾庶，與爾舟楫，後至者斬。」",
    "literal": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": ""
  },
  "s0098": {
    "chinese": "武王渡河，中流，白魚躍入王舟中，武王俯取以祭。",
    "literal": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
    "idiomatic": ""
  },
  "s0099": {
    "chinese": "既渡，有火自上復于下，至于王屋，流為烏，其色赤，其聲魄云。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": ""
  },
  "s0100": {
    "chinese": "是時，諸侯不期而會盟津者八百諸侯。",
    "literal": "He made the Luo Proclamation, established the well-field system.",
    "idiomatic": ""
  },
  "s0101": {
    "chinese": "諸侯皆曰：「紂可伐矣。」",
    "literal": "He made the various lords swear oaths.",
    "idiomatic": ""
  },
  "s0102": {
    "chinese": "武王曰：「女未知天命，未可也。」",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": ""
  },
  "s0103": {
    "chinese": "乃還師歸。",
    "literal": "King Cheng went to the eastern capital, toured the lords.",
    "idiomatic": ""
  },
  "s0104": {
    "chinese": "居二年，聞紂昏亂暴虐滋甚，殺王子比干，囚箕子。",
    "literal": "The lords all came to court, no one dared to be late.",
    "idiomatic": ""
  },
  "s0105": {
    "chinese": "太師疵、少師彊抱其樂器而奔周。",
    "literal": "King Cheng returned to Fenghao, was diligent in government.",
    "idiomatic": ""
  },
  "s0106": {
    "chinese": "於是武王遍告諸侯曰：「殷有重罪，不可以不畢伐。」",
    "literal": "Therefore King Wu announced to all the lords: 'Yin has grave crimes, we cannot but completely attack them.'",
    "idiomatic": ""
  },
  "s0107": {
    "chinese": "乃遵文王，遂率戎車三百乘，虎賁三千人，甲士四萬五千人，以東伐紂。",
    "literal": "He followed King Wen, and led 300 war chariots, 3,000 tiger warriors, 45,000 armored soldiers, to attack Zhou eastward.",
    "idiomatic": ""
  },
  "s0108": {
    "chinese": "十一年十二月戊午，師畢渡盟津，諸侯咸會。",
    "literal": "In the eleventh year, twelfth month, day wuwu, the army all crossed Mengjin, all the lords assembled.",
    "idiomatic": ""
  },
  "s0109": {
    "chinese": "曰：「孳孳無怠！」",
    "literal": "He said: 'Be diligent without slackening!'",
    "idiomatic": ""
  },
  "s0110": {
    "chinese": "武王乃作太誓，告于眾庶：「今殷王紂乃用其婦人之言，自絕于天，毀壞其三正，離逖其王父母弟，乃斷棄其先祖之樂，乃為淫聲，用變亂正聲，怡說婦人。",
    "literal": "King Wu made the Great Oath, announced to the multitudes: 'Now the Yin king Zhou uses the words of his women, cuts himself off from Heaven, destroys his three officials, separates from his royal parents and brothers, discards his ancestors' music, makes licentious sounds, uses them to change and confuse proper sounds, delights in women.'",
    "idiomatic": ""
  },
  "s0111": {
    "chinese": "故今予發維共行天罰。",
    "literal": "Therefore now I Fa will jointly execute Heaven's punishment.",
    "idiomatic": ""
  },
  "s0112": {
    "chinese": "勉哉夫子，不可再，不可三！」",
    "literal": "Strive, gentlemen, it cannot be done twice, cannot be done three times!'",
    "idiomatic": ""
  },
  "s0114": {
    "chinese": "二月甲子昧爽，武王朝至于商郊牧野，乃誓。",
    "literal": "In the second month, day jiazi at dawn, King Wu arrived at the Shang suburb of Muye, and made the oath.",
    "idiomatic": ""
  },
  "s0115": {
    "chinese": "武王左杖黃鉞，右秉白旄，以麾。",
    "literal": "King Wu held the yellow axe in his left hand, white banner in his right, to command.",
    "idiomatic": ""
  },
  "s0116": {
    "chinese": "曰：「遠矣西土之人！」",
    "literal": "He said: 'Distant are the people of the western lands!'",
    "idiomatic": ""
  },
  "s0117": {
    "chinese": "武王曰：「嗟！",
    "literal": "King Wu said: 'Alas!",
    "idiomatic": ""
  },
  "s0118": {
    "chinese": "我有國冢君，司徒、司馬、司空，亞旅、師氏，千夫長、百夫長，及庸、蜀、羌、髳、微、纑、彭、濮人，稱爾戈，比爾干，立爾矛，予其誓。」",
    "literal": "I have the great lords of states, the Minister of Works, Minister of War, Minister of the Masses, subordinate officers, commanders, captains of a thousand, captains of a hundred, and the people of Yong, Shu, Qiang, Mao, Wei, Lu, Peng, and Pu. Raise your spears, array your shields, set your lances, I will make my oath.'",
    "idiomatic": ""
  },
  "s0119": {
    "chinese": "王曰：「古人有言『牝雞無晨。",
    "literal": "The king said: 'The ancients had a saying: 'The hen does not crow at dawn.",
    "idiomatic": ""
  },
  "s0120": {
    "chinese": "牝雞之晨，惟家之索』。",
    "literal": "If the hen crows at dawn, it brings ruin to the family.'",
    "idiomatic": ""
  },
  "s0121": {
    "chinese": "今殷王紂維婦人言是用，自棄其先祖肆祀不答，昏棄其家國，遺其王父母弟不用，乃維四方之多罪逋逃是崇是長，是信是使，俾暴虐于百姓，以姦軌于商國。",
    "literal": "Now the Yin king Zhou only uses the words of women, abandons his ancestors' generous sacrifices without response, carelessly abandons his state and family, neglects his royal parents and brothers without employing them, but honors and promotes the many criminals and fugitives from the four directions, trusts and employs them, causing violence and oppression to the common people, bringing chaos and rebellion to the Shang state.'",
    "idiomatic": ""
  },
  "s0122": {
    "chinese": "今予發維共行天之罰。",
    "literal": "Now I Fa will jointly execute Heaven's punishment.",
    "idiomatic": ""
  },
  "s0123": {
    "chinese": "今日之事，不過六步七步，乃止齊焉，夫子勉哉！",
    "literal": "Today the battle must be decisive, we will not return until evening.'",
    "idiomatic": ""
  },
  "s0124": {
    "chinese": "不過於四伐五伐六伐七伐，乃止齊焉，勉哉夫子！",
    "literal": "In the second month, day jiazi, the Zhou army defeated the Yin at Muye.",
    "idiomatic": ""
  },
  "s0125": {
    "chinese": "尚桓桓，如虎如羆，如豺如離，于商郊，不御克奔，以役西土，勉哉夫子！",
    "literal": "King Zhou fled, burned himself in the Deer Tower.",
    "idiomatic": ""
  },
  "s0126": {
    "chinese": "爾所不勉，其于爾身有戮。」",
    "literal": "King Wu cut off his head, hung it on a white banner.",
    "idiomatic": ""
  },
  "s0127": {
    "chinese": "誓已，諸侯兵會者車四千乘，陳師牧野。",
    "literal": "He attacked Yan, killed Bi Gan the loyal minister, released Mi Zi, restored Jizi.",
    "idiomatic": ""
  },
  "s0128": {
    "chinese": "帝紂聞武王來，亦發兵七十萬人距武王。",
    "literal": "He divided the Yin lands, enfeoffed the Zhou lords.",
    "idiomatic": ""
  },
  "s0129": {
    "chinese": "武王使師尚父與百夫致師，以大卒馳帝紂師。",
    "literal": "He returned to Fenghao, the four directions all submitted.",
    "idiomatic": ""
  },
  "s0130": {
    "chinese": "紂師雖眾，皆無戰之心，心欲武王亟入。",
    "literal": "He made the Duke of Zhou prime minister, to govern the eastern regions.",
    "idiomatic": ""
  },
  "s0131": {
    "chinese": "紂師皆倒兵以戰，以開武王。",
    "literal": "In the second year, King Wu toured the eastern regions.",
    "idiomatic": ""
  },
  "s0132": {
    "chinese": "武王馳之，紂兵皆崩畔紂。",
    "literal": "King Wu charged forward, the Zhou troops all collapsed and rebelled against Zhou.",
    "idiomatic": ""
  },
  "s0133": {
    "chinese": "紂走，反入登于鹿臺之上，蒙衣其殊玉，自燔于火而死。",
    "literal": "Zhou fled, returned and ascended the Deer Tower, covered himself with his precious jades, and burned himself to death in the fire.",
    "idiomatic": ""
  },
  "s0134": {
    "chinese": "武王持大白旗以麾諸侯，諸侯畢拜武王，武王乃揖諸侯，諸侯畢從。",
    "literal": "King Wu held the great white banner to command the lords, all the lords bowed to King Wu, King Wu then bowed to the lords, all the lords followed.",
    "idiomatic": ""
  },
  "s0135": {
    "chinese": "武王至商國，商國百姓咸待於郊。",
    "literal": "King Wu arrived at the Shang state, the common people of Shang all waited in the suburbs.",
    "idiomatic": ""
  },
  "s0136": {
    "chinese": "於是武王使群臣告語商百姓曰：「上天降休！」",
    "literal": "Therefore King Wu sent his ministers to announce to the Shang common people: 'Heaven has sent down good fortune!'",
    "idiomatic": ""
  },
  "s0137": {
    "chinese": "商人皆再拜稽首，武王亦答拜。",
    "literal": "The Shang people all bowed twice with heads to ground, King Wu also returned the bow.",
    "idiomatic": ""
  },
  "s0138": {
    "chinese": "遂入，至紂死所。",
    "literal": "King Wu entered the palace, sat on the great throne, the lords all presented their captives.",
    "idiomatic": ""
  },
  "s0139": {
    "chinese": "武王自射之，三發而後下車，以輕劍擊之，以黃鉞斬紂頭，縣大白之旗。",
    "literal": "King Wu made the proclamation to the four directions: 'The ancients had a saying: 'Do not kill those who surrender.'",
    "idiomatic": ""
  },
  "s0140": {
    "chinese": "已而至紂之嬖妾二女，二女皆經自殺。",
    "literal": "I am not an executioner, do not kill the captives.'",
    "idiomatic": ""
  },
  "s0141": {
    "chinese": "武王又射三發，擊以劍，斬以玄鉞，縣其頭小白之旗。",
    "literal": "King Wu released the imprisoned Jizi, restored the imprisoned Bi Gan.",
    "idiomatic": ""
  },
  "s0142": {
    "chinese": "武王已乃出復軍。",
    "literal": "He searched for the imprisoned Xiahou Shang, found him and released him.",
    "idiomatic": ""
  },
  "s0143": {
    "chinese": "其明日，除道，修社及商紂宮。",
    "literal": "He made the Duke of Zhou guard the eastern regions.",
    "idiomatic": ""
  },
  "s0144": {
    "chinese": "及期，百夫荷罕旗以先驅。",
    "literal": "In the twelfth year, King Wu died.",
    "idiomatic": ""
  },
  "s0145": {
    "chinese": "武王弟叔振鐸奉陳常車，周公旦把大鉞，畢公把小鉞，以夾武王。",
    "literal": "King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": ""
  },
  "s0146": {
    "chinese": "散宜生、太顛、閎夭皆執劍以衛武王。",
    "literal": "The three guards rebelled, saying: 'The Duke of Zhou will harm the young king.'",
    "idiomatic": ""
  },
  "s0147": {
    "chinese": "既入，立于社南大卒之左，［左］右畢從。",
    "literal": "The Duke of Zhou went to the eastern capital, put down the rebellion.",
    "idiomatic": ""
  },
  "s0148": {
    "chinese": "毛叔鄭奉明水，衛康叔封布茲，召公奭贊采，師尚父牽牲。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": ""
  },
  "s0149": {
    "chinese": "尹佚筴祝曰：「殷之末孫季紂，殄廢先王明德，侮蔑神祇不祀，昏暴商邑百姓，其章顯聞于天皇上帝。」",
    "literal": "He made the Da Gao proclamation, comforted the Yin people.",
    "idiomatic": ""
  },
  "s0150": {
    "chinese": "於是武王再拜稽首，曰：「膺更大命，革殷，受天明命。」",
    "literal": "He made the Kang Gao proclamation, established the ritual system.",
    "idiomatic": ""
  },
  "s0151": {
    "chinese": "武王又再拜稽首，乃出。",
    "literal": "He made the Jun Shi proclamation, divided the lands.",
    "idiomatic": ""
  },
  "s0152": {
    "chinese": "封商紂子祿父殷之餘民。",
    "literal": "He made the Luo Gong proclamation, established the well-field system.",
    "idiomatic": ""
  },
  "s0153": {
    "chinese": "武王為殷初定未集，乃使其弟管叔鮮、蔡叔度相祿父治殷。",
    "literal": "He made the wine prohibition proclamation, banned drunkenness.",
    "idiomatic": ""
  },
  "s0154": {
    "chinese": "已而命召公釋箕子之囚。",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": ""
  },
  "s0155": {
    "chinese": "命畢公釋百姓之囚，表商容之閭。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": ""
  },
  "s0156": {
    "chinese": "命南宮括散鹿臺之財，發鉅橋之粟，以振貧弱萌隸。",
    "literal": "King Cheng died, King Kang ascended.",
    "idiomatic": ""
  },
  "s0157": {
    "chinese": "命南宮括、史佚展九鼎保玉。",
    "literal": "King Kang monitored the eastern regions, toured the lords, administered justice.",
    "idiomatic": ""
  },
  "s0158": {
    "chinese": "命閎夭封比干之墓。",
    "literal": "Forty years without punishment, the world was at peace under King Kang.",
    "idiomatic": ""
  },
  "s0159": {
    "chinese": "命宗祝享祠于軍。",
    "literal": "King Kang died, King Zhao ascended.",
    "idiomatic": ""
  },
  "s0160": {
    "chinese": "乃罷兵西歸。",
    "literal": "King Zhao went south to tour, died at the Han River.",
    "idiomatic": ""
  },
  "s0161": {
    "chinese": "行狩，記政事，作武成。",
    "literal": "King Mu ascended.",
    "idiomatic": ""
  },
  "s0162": {
    "chinese": "封諸侯，班賜宗彝，作分殷之器物。",
    "literal": "King Mu was ambitious and fond of grandeur, personally drove the eight horses.",
    "idiomatic": ""
  },
  "s0163": {
    "chinese": "武王追思先聖王，乃褒封神農之後於焦，黃帝之後於祝，帝堯之後於薊，帝舜之後於陳，大禹之後於杞。",
    "literal": "He went west to attack the Quanrong, obtained four white wolves and four white deer.",
    "idiomatic": ""
  },
  "s0164": {
    "chinese": "於是封功臣謀士，而師尚父為首封。",
    "literal": "He made Zhao Ju the Grand Master, prepared to attack the Quanrong.",
    "idiomatic": ""
  },
  "s0165": {
    "chinese": "封尚父於營丘，曰齊。",
    "literal": "The Quanrong submitted, King Mu stopped.",
    "idiomatic": ""
  },
  "s0166": {
    "chinese": "封弟周公旦於曲阜，曰魯。",
    "literal": "He toured the north, reached the Great Wall.",
    "idiomatic": ""
  },
  "s0167": {
    "chinese": "封召公奭於燕。",
    "literal": "He saw the Yellow Emperor's Xuanyuan Terrace.",
    "idiomatic": ""
  },
  "s0168": {
    "chinese": "封弟叔鮮於管，弟叔度於蔡。",
    "literal": "He returned and died at Haojing.",
    "idiomatic": ""
  },
  "s0169": {
    "chinese": "餘各以次受封。",
    "literal": "King Mu's son King Gong ascended.",
    "idiomatic": ""
  },
  "s0170": {
    "chinese": "武王徵九牧之君，登豳之阜，以望商邑。",
    "literal": "King Gong died, his younger brother King Yi ascended.",
    "idiomatic": ""
  },
  "s0171": {
    "chinese": "武王至于周，自夜不寐。",
    "literal": "King Yi died, King Xiao ascended.",
    "idiomatic": ""
  },
  "s0172": {
    "chinese": "周公旦即王所，曰：「曷為不寐？」",
    "literal": "King Xiao died, King Li ascended.",
    "idiomatic": ""
  },
  "s0173": {
    "chinese": "王曰：「告女：維天不饗殷，自發未生於今六十年，麋鹿在牧，蜚鴻滿野。",
    "literal": "King Li was tyrannical, the common people rebelled.",
    "idiomatic": ""
  },
  "s0174": {
    "chinese": "天不享殷，乃今有成。",
    "literal": "King Li fled to Zhi, died there.",
    "idiomatic": ""
  },
  "s0175": {
    "chinese": "維天建殷，其登名民三百六十夫，不顯亦不賓滅，以至今。",
    "literal": "The common people made Duke Wu of Gonghe regent.",
    "idiomatic": ""
  },
  "s0176": {
    "chinese": "我未定天保，何暇寐！」",
    "literal": "Fourteen years, King Xuan ascended, the Gonghe administration ended.",
    "idiomatic": ""
  },
  "s0177": {
    "chinese": "王曰：「定天保，依天室，悉求夫惡，貶從殷王受。",
    "literal": "King Xuan revived Zhou's prosperity, moved the capital to Luoyi.",
    "idiomatic": ""
  },
  "s0178": {
    "chinese": "日夜勞來定我西土，我維顯服，及德方明。",
    "literal": "He attacked the Quanrong, drove them out.",
    "idiomatic": ""
  },
  "s0179": {
    "chinese": "自洛汭延于伊汭，居易毋固，其有夏之居。",
    "literal": "He attacked the Jiang, defeated them.",
    "idiomatic": ""
  },
  "s0180": {
    "chinese": "我南望三涂，北望嶽鄙，顧詹有河，粵詹雒、伊，毋遠天室。」",
    "literal": "He attacked the Xu Yan, captured their king.",
    "idiomatic": ""
  },
  "s0181": {
    "chinese": "營周居于雒邑而後去。",
    "literal": "Two younger brothers of the same mother, Yi Zhongyan, gave birth to Gongsun Wuzhi.",
    "idiomatic": ""
  },
  "s0182": {
    "chinese": "縱馬於華山之陽，放牛於桃林之虛；",
    "literal": "He let horses run free on the southern slopes of Mount Hua, released oxen in the wilderness of Taolin;",
    "idiomatic": ""
  },
  "s0183": {
    "chinese": "偃干戈，振兵釋旅：示天下不復用也。",
    "literal": "Laid down weapons and spears, rested the troops and dismissed the armies: showing the world they would not be used again.",
    "idiomatic": ""
  },
  "s0184": {
    "chinese": "武王已克殷，後二年，問箕子殷所以亡。",
    "literal": "King Wu had already conquered Yin, two years later asked Jizi why Yin perished.",
    "idiomatic": ""
  },
  "s0185": {
    "chinese": "箕子不忍言殷惡，以存亡國宜告。",
    "literal": "Jizi could not bear to speak of Yin's evils, so spoke of the principles for preserving and destroying states.",
    "idiomatic": ""
  },
  "s0186": {
    "chinese": "武王亦醜，故問以天道。",
    "literal": "King Wu also considered it shameful, so asked about the Way of Heaven.",
    "idiomatic": ""
  },
  "s0187": {
    "chinese": "武王病。",
    "literal": "King Wu died in the twelfth year, King Cheng ascended.",
    "idiomatic": ""
  },
  "s0188": {
    "chinese": "天下未集，群公懼，穆卜，周公乃祓齋，自為質，欲代武王，武王有瘳。",
    "literal": "King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": ""
  },
  "s0189": {
    "chinese": "後而崩，太子誦代立，是為成王。",
    "literal": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
    "idiomatic": ""
  },
  "s0190": {
    "chinese": "成王少，周初定天下，周公恐諸侯畔周，公乃攝行政當國。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": ""
  },
  "s0191": {
    "chinese": "管叔、蔡叔群弟疑周公，與武庚作亂，畔周。",
    "literal": "He made the Shao Proclamation, established the ritual system.",
    "idiomatic": ""
  },
  "s0192": {
    "chinese": "周公奉成王命，伐誅武庚、管叔，放蔡叔。",
    "literal": "He made the Luo Proclamation, established the well-field system.",
    "idiomatic": ""
  },
  "s0193": {
    "chinese": "以微子開代殷後，國於宋。",
    "literal": "He made the Jun Shi Proclamation, divided the lands.",
    "idiomatic": ""
  },
  "s0194": {
    "chinese": "頗收殷餘民，以封武王少弟封為衛康叔。",
    "literal": "He made the wine prohibition proclamation, banned drunkenness.",
    "idiomatic": ""
  },
  "s0195": {
    "chinese": "晉唐叔得嘉穀，獻之成王，成王以歸周公于兵所。",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": ""
  },
  "s0196": {
    "chinese": "周公受禾東土，魯天子之命。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": ""
  },
  "s0197": {
    "chinese": "初，管、蔡畔周，周公討之，三年而畢定，故初作大誥，次作微子之命，次歸禾，次嘉禾，次康誥、酒誥、梓材，其事在周公之篇。",
    "literal": "King Cheng died, King Kang ascended.",
    "idiomatic": ""
  },
  "s0198": {
    "chinese": "周公行政七年，成王長，周公反政成王，北面就群臣之位。",
    "literal": "King Kang monitored the eastern regions, toured the lords, administered justice.",
    "idiomatic": ""
  },
  "s0199": {
    "chinese": "成王在豐，使召公復營洛邑，如武王之意。",
    "literal": "Forty years without punishment, the world was at peace under King Kang.",
    "idiomatic": ""
  },
  "s0200": {
    "chinese": "周公復卜申視，卒營筑，居九鼎焉。",
    "literal": "King Kang died, King Zhao ascended.",
    "idiomatic": ""
  },
  "s0201": {
    "chinese": "曰：「此天下之中，四方入貢道里均。」",
    "literal": "King Zhao went south to tour, died at the Han River.",
    "idiomatic": ""
  },
  "s0202": {
    "chinese": "作召誥、洛誥。",
    "literal": "King Mu ascended.",
    "idiomatic": ""
  },
  "s0203": {
    "chinese": "成王既遷殷遺民，周公以王命告，作多士、無佚。",
    "literal": "King Mu was ambitious and fond of grandeur, personally drove eight horses.",
    "idiomatic": ""
  },
  "s0204": {
    "chinese": "召公為保，周公為師，東伐淮夷，殘奄，遷其君薄泵。",
    "literal": "He went west to attack the Quanrong, obtained four white wolves and four white deer.",
    "idiomatic": ""
  },
  "s0205": {
    "chinese": "成王自奄歸，在宗周，作多方。",
    "literal": "He made Zhao Ju the Grand Master, prepared to attack the Quanrong.",
    "idiomatic": ""
  },
  "s0206": {
    "chinese": "既絀殷命，襲淮夷，歸在豐，作周官。",
    "literal": "The Quanrong submitted, King Mu stopped.",
    "idiomatic": ""
  },
  "s0207": {
    "chinese": "興正禮樂，度制於是改，而民和睦，頌聲興。",
    "literal": "He toured the north, reached the Great Wall.",
    "idiomatic": ""
  },
  "s0208": {
    "chinese": "成王既伐東夷，息慎來賀，王賜榮伯作賄息慎之命。",
    "literal": "He saw the Yellow Emperor's Xuanyuan Terrace.",
    "idiomatic": ""
  },
  "s0209": {
    "chinese": "成王將崩，懼太子釗之不任，乃命召公、畢公率諸侯以相太子而立之。",
    "literal": "He returned and died at Haojing.",
    "idiomatic": ""
  },
  "s0210": {
    "chinese": "成王既崩，二公率諸侯，以太子釗見於先王廟，申告以文王、武王之所以為王業之不易，務在節儉，毋多欲，以篤信臨之，作顧命。",
    "literal": "King Mu's son King Gong ascended.",
    "idiomatic": ""
  },
  "s0211": {
    "chinese": "太子釗遂立，是為康王。",
    "literal": "King Gong died, his younger brother King Yi ascended.",
    "idiomatic": ""
  },
  "s0212": {
    "chinese": "康王即位，遍告諸侯，宣告以文武之業以申之，作《康誥》。",
    "literal": "King Yi died, King Xiao ascended.",
    "idiomatic": ""
  },
  "s0213": {
    "chinese": "故成康之際，天下安寧，刑錯四十餘年不用。",
    "literal": "King Xiao died, King Li ascended.",
    "idiomatic": ""
  },
  "s0214": {
    "chinese": "康王命作策畢公分居里，成周郊，作《畢命》。",
    "literal": "King Li was tyrannical, the common people rebelled.",
    "idiomatic": ""
  },
  "s0215": {
    "chinese": "康王卒，子昭王瑕立。",
    "literal": "King Li fled to Zhi, died there.",
    "idiomatic": ""
  },
  "s0216": {
    "chinese": "昭王之時，王道微缺。",
    "literal": "The common people made Duke Wu of Gonghe regent.",
    "idiomatic": ""
  },
  "s0217": {
    "chinese": "昭王南巡狩不返，卒於江上。",
    "literal": "Fourteen years, King Xuan ascended, the Gonghe administration ended.",
    "idiomatic": ""
  },
  "s0218": {
    "chinese": "其卒不赴告，諱之也。",
    "literal": "King Xuan revived Zhou's prosperity, moved the capital to Luoyi.",
    "idiomatic": ""
  },
  "s0219": {
    "chinese": "立昭王子滿，是為穆王。",
    "literal": "He attacked the Quanrong, drove them out.",
    "idiomatic": ""
  },
  "s0220": {
    "chinese": "穆王即位，春秋已五十矣。",
    "literal": "He attacked the Jiang, defeated them.",
    "idiomatic": ""
  },
  "s0221": {
    "chinese": "王道衰微，穆王閔文武之道缺，乃命伯臩申誡太仆國之政，作臩命。",
    "literal": "He attacked the Xu Yan, captured their king.",
    "idiomatic": ""
  },
  "s0222": {
    "chinese": "復寧。",
    "literal": "Two younger brothers of the same mother, Yi Zhongyan, gave birth to Gongsun Wuzhi.",
    "idiomatic": ""
  },
  "s0223": {
    "chinese": "穆王將征犬戎，祭公謀父諫曰：「不可。",
    "literal": "19. The duke died and commanded to establish younger brother He as Duke Mu.",
    "idiomatic": ""
  },
  "s0224": {
    "chinese": "先王燿德不觀兵。",
    "literal": "Duke Mu of Qin, first year.",
    "idiomatic": ""
  },
  "s0225": {
    "chinese": "夫兵戢而時動，動則威，觀則玩，玩則無震。",
    "literal": "Punished Zhou Xu.",
    "idiomatic": ""
  },
  "s0226": {
    "chinese": "是故周文公之頌曰：『載戢干戈，載櫜弓矢，我求懿德，肆于時夏，允王保之。』",
    "literal": "Quwo Wu Gong killed Xiao Zi.",
    "idiomatic": ""
  },
  "s0227": {
    "chinese": "先王之於民也，茂正其德而厚其性，阜其財求而利其器用，明利害之鄉，以文修之，使之務利而辟害，懷德而畏威，故能保世以滋大。",
    "literal": "Zhou attacked Quwo, established Duke Ai of Jin's younger brother Min as Duke of Jin.",
    "idiomatic": ""
  },
  "s0228": {
    "chinese": "昔我先王世后稷以服事虞、夏。",
    "literal": "Duke Min of Jin, first year.",
    "idiomatic": ""
  },
  "s0229": {
    "chinese": "及夏之衰也，棄稷不務，我先王不窋用失其官，而自竄於戎狄之閒。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0230": {
    "chinese": "不敢怠業，時序其德，遵修其緒，修其訓典，朝夕恪勤，守以敦篤，奉以忠信。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0231": {
    "chinese": "奕世載德，不忝前人。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0232": {
    "chinese": "至于文王、武王，昭前之光明而加之以慈和，事神保民，無不欣喜。",
    "literal": "Until King Wen and King Wu, they illuminated the previous brightness and added kindness and harmony, served the spirits and protected the people, all were joyful.",
    "idiomatic": ""
  },
  "s0233": {
    "chinese": "商王帝辛大惡于民，庶民不忍，訢載武王，以致戎于商牧。",
    "literal": "The Shang king Di Xin greatly harmed the people, the common people could not bear it, united with King Wu, to bring troops to the Shang pasture.",
    "idiomatic": ""
  },
  "s0234": {
    "chinese": "是故先王非務武也，勸恤民隱而除其害也。",
    "literal": "Therefore the former kings did not pursue military matters, but encouraged care for the people's hardships and removed their harms.",
    "idiomatic": ""
  },
  "s0235": {
    "chinese": "夫先王之制，邦內甸服，邦外侯服，侯衛賓服，夷蠻要服，戎翟荒服。",
    "literal": "The former kings' system: within the state dian service, outside the state hou service, hou wei bin service, yi man yao service, rong di huang service.",
    "idiomatic": ""
  },
  "s0236": {
    "chinese": "甸服者祭，侯服者祀，賓服者享，要服者貢，荒服者王。",
    "literal": "Dian service offers sacrifice, hou service offers worship, bin service offers tribute, yao service offers contribution, huang service offers kingly visits.",
    "idiomatic": ""
  },
  "s0237": {
    "chinese": "日祭，月祀，時享，歲貢，終王。",
    "literal": "Daily sacrifice, monthly worship, seasonal tribute, yearly contribution, lifetime kingly visits.",
    "idiomatic": ""
  },
  "s0238": {
    "chinese": "先王之順祀也，有不祭則修意，有不祀則修言，有不享則修文，有不貢則修名，有不王則修德，序成而有不至則修刑。",
    "literal": "First month, day renchen, the sun was eclipsed, the officials lost it, the day was not recorded.",
    "idiomatic": ""
  },
  "s0239": {
    "chinese": "於是有刑不祭，伐不祀，征不享，讓不貢，告不王。",
    "literal": "Sixth month, the Rong and Di invaded the west.",
    "idiomatic": ""
  },
  "s0240": {
    "chinese": "於是有刑罰之辟，有攻伐之兵，有征討之備，有威讓之命，有文告之辭。",
    "literal": "Seventh month, the king went to the eastern capital.",
    "idiomatic": ""
  },
  "s0241": {
    "chinese": "布令陳辭而有不至，則增修於德，無勤民於遠。",
    "literal": "Ninth month, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0242": {
    "chinese": "是以近無不聽，遠無不服。",
    "literal": "Eleventh month, returned to Haojing.",
    "idiomatic": ""
  },
  "s0243": {
    "chinese": "今自大畢、伯士之終也，犬戎氏以其職來王，天子曰『予必以不享征之，且觀之兵』，無乃廢先王之訓，而王幾頓乎？",
    "literal": "Twelfth month, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0244": {
    "chinese": "吾聞犬戎樹敦，率舊德而守終純固，其有以御我矣。」",
    "literal": "Duke Xuan of Wei, Jin, first year.",
    "idiomatic": ""
  },
  "s0245": {
    "chinese": "王遂征之，得四白狼四白鹿以歸。",
    "literal": "Together established him.",
    "idiomatic": ""
  },
  "s0246": {
    "chinese": "自是荒服者不至。",
    "literal": "Punished Zhou Xu.",
    "idiomatic": ""
  },
  "s0247": {
    "chinese": "諸侯有不睦者，甫侯言於王，作修刑辟。",
    "literal": "Beng to Lu, exchanged Xu fields.",
    "idiomatic": ""
  },
  "s0248": {
    "chinese": "王曰：「吁，來！",
    "literal": "Quwo Wu Gong killed Xiao Zi.",
    "idiomatic": ""
  },
  "s0249": {
    "chinese": "有國有土，告汝祥刑。",
    "literal": "Zhou attacked Quwo, established Duke Ai of Jin's younger brother Min as Duke of Jin.",
    "idiomatic": ""
  },
  "s0250": {
    "chinese": "在今爾安百姓，何擇非其人，何敬非其刑，何居非其宜與？",
    "literal": "Duke Min of Jin, first year.",
    "idiomatic": ""
  },
  "s0251": {
    "chinese": "兩造具備，師聽五辭。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0252": {
    "chinese": "五辭簡信，正於五刑。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0253": {
    "chinese": "五刑不簡，正於五罰。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0254": {
    "chinese": "五罰不服，正於五過。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0255": {
    "chinese": "五過之疵，官獄內獄，閱實其罪，惟鈞其過。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0256": {
    "chinese": "五刑之疑有赦，五罰之疑有赦，其審克之。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0257": {
    "chinese": "簡信有眾，惟訊有稽。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0258": {
    "chinese": "無簡不疑，共嚴天威。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0259": {
    "chinese": "黥辟疑赦，其罰百率，閱實其罪。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0260": {
    "chinese": "劓辟疑赦，其罰倍灑，閱實其罪。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0261": {
    "chinese": "臏辟疑赦，其罰倍差，閱實其罪。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0262": {
    "chinese": "宮辟疑赦，其罰五百率，閱實其罪。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0263": {
    "chinese": "大辟疑赦，其罰千率，閱實其罪。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0264": {
    "chinese": "墨罰之屬千，劓罰之屬千，臏罰之屬五百，宮罰之屬三百，大辟之罰其屬二百：五刑之屬三千。」",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0265": {
    "chinese": "命曰甫刑。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0266": {
    "chinese": "穆王立五十五年，崩，子共王繄扈立。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0267": {
    "chinese": "共王游於涇上，密康公從，有三女奔之。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0268": {
    "chinese": "其母曰：「必致之王。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0269": {
    "chinese": "夫獸三為群，人三為眾，女三為粲。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0270": {
    "chinese": "王田不取群，公行不下眾，王御不參一族。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0271": {
    "chinese": "夫粲，美之物也。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0272": {
    "chinese": "眾以美物歸女，而何德以堪之？",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0273": {
    "chinese": "王猶不堪，況爾之小醜乎！",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0274": {
    "chinese": "小醜備物，終必亡。」",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0275": {
    "chinese": "康公不獻，一年，共王滅密。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0276": {
    "chinese": "共王崩，子懿王艱立。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0277": {
    "chinese": "懿王之時，王室遂衰，詩人作刺。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0278": {
    "chinese": "懿王崩，共王弟辟方立，是為孝王。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0279": {
    "chinese": "孝王崩，諸侯復立懿王太子燮，是為夷王。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0280": {
    "chinese": "夷王崩，子厲王胡立。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0281": {
    "chinese": "厲王即位三十年，好利，近榮夷公。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0282": {
    "chinese": "大夫芮良夫諫厲王曰：「王室其將卑乎？",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0283": {
    "chinese": "夫榮公好專利而不知大難。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0284": {
    "chinese": "夫利，百物之所生也，天地之所載也，而有專之，其害多矣。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0285": {
    "chinese": "天地百物皆將取焉，何可專也？",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0286": {
    "chinese": "所怒甚多，不備大難。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0287": {
    "chinese": "以是教王，王其能久乎？",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0288": {
    "chinese": "夫王人者，將導利而布之上下者也。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0289": {
    "chinese": "使神人百物無不得極，猶日怵惕懼怨之來也。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0290": {
    "chinese": "故《頌》曰『思文后稷，克配彼天，立我蒸民，莫匪爾極』。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0291": {
    "chinese": "大雅曰『陳錫載周』。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0292": {
    "chinese": "是不布利而懼難乎，故能載周以至于今。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0293": {
    "chinese": "今王學專利，其可乎？",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0294": {
    "chinese": "匹夫專利，猶謂之盜，王而行之，其歸鮮矣。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0295": {
    "chinese": "榮公若用，周必敗也。」",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0296": {
    "chinese": "厲王不聽，卒以榮公為卿士，用事。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0297": {
    "chinese": "王行暴虐侈傲，國人謗王。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0298": {
    "chinese": "召公諫曰：「民不堪命矣。」",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0299": {
    "chinese": "王怒，得衛巫，使監謗者，以告則殺之。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0300": {
    "chinese": "其謗鮮矣，諸侯不朝。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0301": {
    "chinese": "三十四年，王益嚴，國人莫敢言，道路以目。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0302": {
    "chinese": "厲王喜，告召公曰：「吾能弭謗矣，乃不敢言。」",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0303": {
    "chinese": "召公曰：「是鄣之也。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0304": {
    "chinese": "防民之口，甚於防水。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0305": {
    "chinese": "水壅而潰，傷人必多，民亦如之。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0306": {
    "chinese": "是故為水者決之使導，為民者宣之使言。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0307": {
    "chinese": "故天子聽政，使公卿至於列士獻詩，瞽獻曲，史獻書，師箴，瞍賦，矇誦，百工諫，庶人傳語，近臣盡規，親戚補察，瞽史教誨，耆艾修之，而後王斟酌焉，是以事行而不悖。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0308": {
    "chinese": "民之有口也，猶土之有山川也，財用於是乎出：猶其有原隰衍沃也，衣食於是乎生。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0309": {
    "chinese": "口之宣言也，善敗於是乎興。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0310": {
    "chinese": "行善而備敗，所以產財用衣食者也。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0311": {
    "chinese": "夫民慮之於心而宣之於口，成而行之。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0312": {
    "chinese": "若壅其口，其與能幾何？」",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0313": {
    "chinese": "王不聽。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0314": {
    "chinese": "於是國莫敢出言，三年，乃相與畔，襲厲王。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0315": {
    "chinese": "厲王出奔於彘。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0316": {
    "chinese": "厲王太子靜匿召公之家，國人聞之，乃圍之。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0317": {
    "chinese": "召公曰：「昔吾驟諫王，王不從，以及此難也。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0318": {
    "chinese": "今殺王太子，王其以我為讎而懟怒乎？",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0319": {
    "chinese": "夫事君者，險而不讎懟，怨而不怒，況事王乎！」",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0320": {
    "chinese": "乃以其子代王太子，太子竟得脫。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0321": {
    "chinese": "召公、周公二相行政，號曰「共和」。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0322": {
    "chinese": "共和十四年，厲王死于彘。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0323": {
    "chinese": "太子靜長於召公家，二相乃共立之為王，是為宣王。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0324": {
    "chinese": "宣王即位，二相輔之，修政，法文、武、成、康之遺風，諸侯復宗周。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0325": {
    "chinese": "十二年，魯武公來朝。",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0326": {
    "chinese": "宣王不修籍於千畝，虢文公諫曰不可，王弗聽。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0327": {
    "chinese": "三十九年，戰于千畝，王師敗績于姜氏之戎。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0328": {
    "chinese": "宣王既亡南國之師，乃料民於太原。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0329": {
    "chinese": "仲山甫諫曰：「民不可料也。」",
    "literal": "Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0330": {
    "chinese": "宣王不聽，卒料民。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0331": {
    "chinese": "四十六年，宣王崩，子幽王宮湦立。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0332": {
    "chinese": "幽王二年，西周三川皆震。",
    "literal": "King You second year, the Western Zhou three rivers all shook.",
    "idiomatic": ""
  },
  "s0333": {
    "chinese": "伯陽甫曰：「周將亡矣。",
    "literal": "Bo Yangfu said: 'Zhou will perish.",
    "idiomatic": ""
  },
  "s0334": {
    "chinese": "夫天地之氣，不失其序；",
    "literal": "The qi of heaven and earth do not lose their order;",
    "idiomatic": ""
  },
  "s0335": {
    "chinese": "若過其序，民亂之也。",
    "literal": "If they lose their order, it is because the people are in chaos.",
    "idiomatic": ""
  },
  "s0336": {
    "chinese": "陽伏而不能出，陰迫而不能蒸，於是有地震。",
    "literal": "Yang is suppressed and cannot emerge, yin presses and cannot rise, therefore there are earthquakes.",
    "idiomatic": ""
  },
  "s0337": {
    "chinese": "今三川實震，是陽失其所而填陰也。",
    "literal": "Now the three rivers are shaking, this is yang losing its place and being filled by yin.",
    "idiomatic": ""
  },
  "s0338": {
    "chinese": "陽失而在陰，原必塞；",
    "literal": "Yang is the ruler, yin is the minister; ruler yielding to minister, this is the Way of Zhou perishing.'",
    "idiomatic": ""
  },
  "s0339": {
    "chinese": "原塞，國必亡。",
    "literal": "King You was fond of Bao Si, made her queen, deposed Shen Hou and the crown prince.",
    "idiomatic": ""
  },
  "s0340": {
    "chinese": "夫水土演而民用也。",
    "literal": "The crown prince's mother died early. Hui Queen gave birth to Shu Dai.",
    "idiomatic": ""
  },
  "s0341": {
    "chinese": "土無所演，民乏財用，不亡何待！",
    "literal": "King You wanted to establish Shu Dai as crown prince, Shen Hou did not agree.",
    "idiomatic": ""
  },
  "s0342": {
    "chinese": "昔伊、洛竭而夏亡，河竭而商亡。",
    "literal": "King You was angry, Shen Hou fled to Shen.",
    "idiomatic": ""
  },
  "s0343": {
    "chinese": "今周德若二代之季矣，其川原又塞，塞必竭。",
    "literal": "King You attacked Shen, Shen Hou called on the Quanrong to help.",
    "idiomatic": ""
  },
  "s0344": {
    "chinese": "夫國必依山川，山崩川竭，亡國之徵也。",
    "literal": "The Quanrong attacked Zhou, captured King You at Li Mountain, killed him.",
    "idiomatic": ""
  },
  "s0345": {
    "chinese": "川竭必山崩。",
    "literal": "The Quanrong attacked Haojing, took Bao Si.",
    "idiomatic": ""
  },
  "s0346": {
    "chinese": "若國亡不過十年，數之紀也。",
    "literal": "The common people made the crown prince Ji Nie king, this was King Ping.",
    "idiomatic": ""
  },
  "s0347": {
    "chinese": "天之所棄，不過其紀。」",
    "literal": "King Ping moved east to Luoyi, this was the Eastern Zhou.",
    "idiomatic": ""
  },
  "s0348": {
    "chinese": "是歲也，三川竭，岐山崩。",
    "literal": "Shen Hou returned, became queen mother.",
    "idiomatic": ""
  },
  "s0349": {
    "chinese": "三年，幽王嬖愛褒姒。",
    "literal": "King Ping first year, the Quanrong again invaded the west.",
    "idiomatic": ""
  },
  "s0350": {
    "chinese": "褒姒生子伯服，幽王欲廢太子。",
    "literal": "Second year, attacked Yan.",
    "idiomatic": ""
  },
  "s0351": {
    "chinese": "太子母申侯女，而為后。",
    "literal": "Third year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0352": {
    "chinese": "後幽王得褒姒，愛之，欲廢申后，并去太子宜臼，以褒姒為后，以伯服為太子。",
    "literal": "Fourth year, attacked the Jiang.",
    "idiomatic": ""
  },
  "s0353": {
    "chinese": "周太史伯陽讀史記曰：「周亡矣。」",
    "literal": "Fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0354": {
    "chinese": "昔自夏后氏之衰也，有二神龍止於夏帝庭而言曰：「余，褒之二君。」",
    "literal": "Sixth year, Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
    "idiomatic": ""
  },
  "s0355": {
    "chinese": "夏帝卜殺之與去之與止之，莫吉。",
    "literal": "Chu attacked Cai, captured Duke Ai and returned.",
    "idiomatic": ""
  },
  "s0356": {
    "chinese": "卜請其漦而藏之，乃吉。",
    "literal": "Seventh year, Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": ""
  },
  "s0357": {
    "chinese": "於是布幣而策告之，龍亡而漦在，櫝而去之。",
    "literal": "Son of Duke Zhuang.",
    "idiomatic": ""
  },
  "s0358": {
    "chinese": "夏亡，傳此器殷。",
    "literal": "Eighth year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0359": {
    "chinese": "殷亡，又傳此器周。",
    "literal": "Ninth year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0360": {
    "chinese": "比三代，莫敢發之，至厲王之末，發而觀之。",
    "literal": "Tenth year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0361": {
    "chinese": "漦流于庭，不可除。",
    "literal": "Eleventh year, Duke Xiang of Song, Zi Fu, first year.",
    "idiomatic": ""
  },
  "s0362": {
    "chinese": "厲王使婦人裸而譟之。",
    "literal": "Mu Yi as prime minister.",
    "idiomatic": ""
  },
  "s0363": {
    "chinese": "漦化為玄黿，以入王後宮。",
    "literal": "Twelfth year, Duke Xiang of Song, Zi Fu, first year.",
    "idiomatic": ""
  },
  "s0364": {
    "chinese": "後宮之童妾既齔而遭之，既笄而孕，無夫而生子，懼而棄之。",
    "literal": "Mu Yi as prime minister.",
    "idiomatic": ""
  },
  "s0365": {
    "chinese": "宣王之時童女謠曰：「厭弧箕服，實亡周國。」",
    "literal": "Thirteenth year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0366": {
    "chinese": "於是宣王聞之，有夫婦賣是器者，宣王使執而戮之。",
    "literal": "Fourteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0367": {
    "chinese": "逃於道，而見鄉者後宮童妾所棄妖子出於路者，聞其夜啼，哀而收之，夫婦遂亡，奔於褒。",
    "literal": "Fifteenth year, Duke Mu of Qin, first year.",
    "idiomatic": ""
  },
  "s0368": {
    "chinese": "褒人有罪，請入童妾所棄女子者於王以贖罪。",
    "literal": "Sixteenth year, Xun Xi used treasures to borrow passage from Yu to attack Guo, extinguished Xia Yang.",
    "idiomatic": ""
  },
  "s0369": {
    "chinese": "棄女子出於褒，是為褒姒。",
    "literal": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0370": {
    "chinese": "當幽王三年，王之後宮見而愛之，生子伯服，竟廢申后及太子，以褒姒為后，伯服為太子。",
    "literal": "Eighteenth year, Duke Zhuang of Zheng, Wu Sheng, first year.",
    "idiomatic": ""
  },
  "s0371": {
    "chinese": "太史伯陽曰：「禍成矣，無可奈何！」",
    "literal": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0373": {
    "chinese": "褒姒不好笑，幽王欲其笑萬方，故不笑。",
    "literal": "Twentieth year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0374": {
    "chinese": "幽王為烽燧大鼓，有寇至則舉烽火。",
    "literal": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0375": {
    "chinese": "諸侯悉至，至而無寇，褒姒乃大笑。",
    "literal": "Twenty-second year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0376": {
    "chinese": "幽王說之，為數舉烽火。",
    "literal": "Twenty-third year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0377": {
    "chinese": "其後不信，諸侯益亦不至。",
    "literal": "Twenty-fourth year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0378": {
    "chinese": "幽王以虢石父為卿，用事，國人皆怨。",
    "literal": "Twenty-fifth year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0379": {
    "chinese": "石父為人佞巧善諛好利，王用之。",
    "literal": "Twenty-sixth year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0380": {
    "chinese": "又廢申后，去太子也。",
    "literal": "Twenty-seventh year, Duke Wen of Qin, Fei Zi, first year.",
    "idiomatic": ""
  },
  "s0381": {
    "chinese": "申侯怒，與繒、西夷犬戎攻幽王。",
    "literal": "Twenty-eighth year, Xun Xi used treasures to borrow passage from Yu to attack Guo, extinguished Xia Yang.",
    "idiomatic": ""
  },
  "s0382": {
    "chinese": "幽王舉烽火徵兵，兵莫至。",
    "literal": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0383": {
    "chinese": "遂殺幽王驪山下，虜褒姒，盡取周賂而去。",
    "literal": "They killed King You at the foot of Li Mountain, captured Bao Si, took all Zhou's treasures and left.",
    "idiomatic": ""
  },
  "s0384": {
    "chinese": "於是諸侯乃即申侯而共立故幽王太子宜臼，是為平王，以奉周祀。",
    "literal": "Therefore the lords went to Shen Hou and together established the former King You's crown prince Yi Jiu, this was King Ping, to continue the Zhou sacrifices.",
    "idiomatic": ""
  },
  "s0385": {
    "chinese": "平王立，東遷于雒邑，辟戎寇。",
    "literal": "King Ping ascended, moved east to Luoyi, to avoid the Rong invaders.",
    "idiomatic": ""
  },
  "s0386": {
    "chinese": "平王之時，周室衰微，諸侯彊并弱，齊、楚、秦、晉始大，政由方伯。",
    "literal": "In King Ping's time, the Zhou house declined and weakened, the lords strong annexed the weak, Qi, Chu, Qin, Jin began to grow great, government was by the regional lords.",
    "idiomatic": ""
  },
  "s0387": {
    "chinese": "四十九年，魯隱公即位。",
    "literal": "Forty-ninth year, Duke Yin of Lu ascended.",
    "idiomatic": ""
  },
  "s0388": {
    "chinese": "五十一年，平王崩，太子洩父蚤死，立其子林，是為桓王。",
    "literal": "Fifty-first year, Duke Huan of Lu ascended.",
    "idiomatic": ""
  },
  "s0389": {
    "chinese": "桓王，平王孫也。",
    "literal": "Fifty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0390": {
    "chinese": "桓王三年，鄭莊公朝，桓王不禮。",
    "literal": "Fifty-third year, Duke Zhuang of Lu ascended.",
    "idiomatic": ""
  },
  "s0391": {
    "chinese": "五年，鄭怨，與魯易許田。",
    "literal": "Fifty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0392": {
    "chinese": "許田，天子之用事太山田也。",
    "literal": "Fifty-fifth year, Duke Xi of Lu ascended.",
    "idiomatic": ""
  },
  "s0393": {
    "chinese": "八年，魯殺隱公，立桓公。",
    "literal": "Fifty-sixth year, Duke Wen of Lu ascended.",
    "idiomatic": ""
  },
  "s0394": {
    "chinese": "十三年，伐鄭，鄭射傷桓王，桓王去歸。",
    "literal": "Fifty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0395": {
    "chinese": "二十三年，桓王崩，子莊王佗立。",
    "literal": "Fifty-eighth year, Duke Xuan of Lu ascended.",
    "idiomatic": ""
  },
  "s0396": {
    "chinese": "莊王四年，周公黑肩欲殺莊王而立王子克。",
    "literal": "Fifty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0397": {
    "chinese": "辛伯告王，王殺周公。",
    "literal": "Sixtieth year, Duke Cheng of Lu ascended.",
    "idiomatic": ""
  },
  "s0398": {
    "chinese": "王子克奔燕。",
    "literal": "Sixty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0399": {
    "chinese": "十五年，莊王崩，子釐王胡齊立。",
    "literal": "Sixty-second year, Duke Xiang of Lu ascended.",
    "idiomatic": ""
  },
  "s0400": {
    "chinese": "釐王三年，齊桓公始霸。",
    "literal": "Sixty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0401": {
    "chinese": "五年，釐王崩，子惠王閬立。",
    "literal": "Sixty-fourth year, Duke Zhao of Lu ascended.",
    "idiomatic": ""
  },
  "s0402": {
    "chinese": "惠王二年。",
    "literal": "Sixty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0403": {
    "chinese": "初，莊王嬖姬姚，生子穨，穨有寵。",
    "literal": "Sixty-sixth year, Duke Ding of Lu ascended.",
    "idiomatic": ""
  },
  "s0404": {
    "chinese": "及惠王即位，奪其大臣以為囿，故大夫邊伯等五人作亂，謀召燕、衛師，伐惠王。",
    "literal": "Sixty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0405": {
    "chinese": "惠王犇溫，已居鄭之櫟。",
    "literal": "Sixty-eighth year, Duke Ai of Lu ascended.",
    "idiomatic": ""
  },
  "s0406": {
    "chinese": "立釐王弟穨為王。",
    "literal": "Sixty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0407": {
    "chinese": "樂及徧舞，鄭、虢君怒。",
    "literal": "Seventieth year, Duke Dao of Lu ascended.",
    "idiomatic": ""
  },
  "s0408": {
    "chinese": "四年，鄭與虢君伐殺王穨，復入惠王。",
    "literal": "Seventy-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0409": {
    "chinese": "惠王十年，賜齊桓公為伯。",
    "literal": "Seventy-second year, Duke Yuan of Lu ascended.",
    "idiomatic": ""
  },
  "s0410": {
    "chinese": "二十五年，惠王崩，子襄王鄭立。",
    "literal": "Seventy-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0411": {
    "chinese": "襄王母蚤死，後母曰惠后。",
    "literal": "Seventy-fourth year, Duke Mu of Lu ascended.",
    "idiomatic": ""
  },
  "s0412": {
    "chinese": "惠后生叔帶，有寵於惠王，襄王畏之。",
    "literal": "Seventy-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0413": {
    "chinese": "三年，叔帶與戎、翟謀伐襄王，襄王欲誅叔帶，叔帶奔齊。",
    "literal": "Seventy-sixth year, Duke Gong of Lu ascended.",
    "idiomatic": ""
  },
  "s0414": {
    "chinese": "齊桓公使管仲平戎于周，使隰朋平戎于晉。",
    "literal": "Seventy-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0415": {
    "chinese": "王以上卿禮管仲。",
    "literal": "Seventy-eighth year, Duke Kang of Lu ascended.",
    "idiomatic": ""
  },
  "s0416": {
    "chinese": "管仲辭曰：「臣賤有司也，有天子之二守國、高在。",
    "literal": "Seventy-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0417": {
    "chinese": "若節春秋來承王命，何以禮焉。",
    "literal": "Eightieth year, Duke Ding of Lu ascended.",
    "idiomatic": ""
  },
  "s0418": {
    "chinese": "陪臣敢辭。」",
    "literal": "Eighty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0419": {
    "chinese": "王曰：「舅氏，余嘉乃勳，毋逆朕命。」",
    "literal": "Eighty-second year, Duke Ai of Lu ascended.",
    "idiomatic": ""
  },
  "s0420": {
    "chinese": "管仲卒受下卿之禮而還。",
    "literal": "Eighty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0421": {
    "chinese": "九年，齊桓公卒。",
    "literal": "Eighty-fourth year, Duke Dao of Lu ascended.",
    "idiomatic": ""
  },
  "s0422": {
    "chinese": "十二年，叔帶復歸于周。",
    "literal": "Eighty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0423": {
    "chinese": "十三年，鄭伐滑，王使游孫、伯服請滑，鄭人囚之。",
    "literal": "Eighty-sixth year, Duke Yuan of Lu ascended.",
    "idiomatic": ""
  },
  "s0424": {
    "chinese": "鄭文公怨惠王之入不與厲公爵，又怨襄王之與衛滑，故囚伯服。",
    "literal": "Eighty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0425": {
    "chinese": "王怒，將以翟伐鄭。",
    "literal": "Eighty-eighth year, Duke Mu of Lu ascended.",
    "idiomatic": ""
  },
  "s0426": {
    "chinese": "富辰諫曰：「凡我周之東徙，晉、鄭焉依。",
    "literal": "Eighty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0427": {
    "chinese": "子穨之亂，又鄭之由定，今以小怨棄之！」",
    "literal": "Ninetieth year, Duke Gong of Lu ascended.",
    "idiomatic": ""
  },
  "s0428": {
    "chinese": "王不聽。",
    "literal": "Ninety-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0429": {
    "chinese": "十五年，王降翟師以伐鄭。",
    "literal": "Ninety-second year, Duke Kang of Lu ascended.",
    "idiomatic": ""
  },
  "s0430": {
    "chinese": "王德翟人，將以其女為后。",
    "literal": "Ninety-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0431": {
    "chinese": "富辰諫曰：「平、桓、莊、惠皆受鄭勞，王棄親親翟，不可從。」",
    "literal": "Fu Chen advised: 'Ping, Huan, Zhuang, Hui all received service from Zheng, if the king abandons his relatives and favors Di, it cannot be followed.'",
    "idiomatic": ""
  },
  "s0432": {
    "chinese": "王不聽。",
    "literal": "The king did not listen.",
    "idiomatic": ""
  },
  "s0433": {
    "chinese": "十六年，王絀翟后，翟人來誅，殺譚伯。",
    "literal": "Sixteenth year, the king deposed the Di queen, the Di people came to attack, killed Tan Bo.",
    "idiomatic": ""
  },
  "s0434": {
    "chinese": "富辰曰：「吾數諫不從。",
    "literal": "Fu Chen said: 'I have advised many times and you did not follow.",
    "idiomatic": ""
  },
  "s0435": {
    "chinese": "如是不出，王以我為懟乎？」",
    "literal": "If I do not leave now, will the king consider me resentful?'",
    "idiomatic": ""
  },
  "s0436": {
    "chinese": "乃以其屬死之。",
    "literal": "He died with his followers.",
    "idiomatic": ""
  },
  "s0437": {
    "chinese": "初，惠后欲立王子帶，故以黨開翟人，翟人遂入周。",
    "literal": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0438": {
    "chinese": "襄王出奔鄭，鄭居王于汜。",
    "literal": "Eighteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0439": {
    "chinese": "子帶立為王，取襄王所絀翟后與居溫。",
    "literal": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0440": {
    "chinese": "十七年，襄王告急于晉，晉文公納王而誅叔帶。",
    "literal": "Twentieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0441": {
    "chinese": "襄王乃賜晉文公珪鬯弓矢，為伯，以河內地與晉。",
    "literal": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0442": {
    "chinese": "二十年，晉文公召襄王，襄王會之河陽、踐土，諸侯畢朝，書諱曰「天王狩于河陽」。",
    "literal": "Twenty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0443": {
    "chinese": "二十四年，晉文公卒。",
    "literal": "Twenty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0444": {
    "chinese": "三十一年，秦穆公卒。",
    "literal": "Twenty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0445": {
    "chinese": "三十二年，襄王崩，子頃王壬臣立。",
    "literal": "Twenty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0446": {
    "chinese": "頃王六年，崩，子匡王班立。",
    "literal": "Twenty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0447": {
    "chinese": "匡王六年，崩，弟瑜立，是為定王。",
    "literal": "Twenty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0448": {
    "chinese": "定王元年，楚莊王伐陸渾之戎，次洛，使人問九鼎。",
    "literal": "Twenty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0449": {
    "chinese": "王使王孫滿應設以辭，楚兵乃去。",
    "literal": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0450": {
    "chinese": "十年，楚莊王圍鄭，鄭伯降，已而復之。",
    "literal": "Thirtieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0451": {
    "chinese": "十六年，楚莊王卒。",
    "literal": "Thirty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0452": {
    "chinese": "二十一年，定王崩，子簡王夷立。",
    "literal": "Thirty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0453": {
    "chinese": "簡王十三年，晉殺其君厲公，迎子周於周，立為悼公。",
    "literal": "Thirty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0454": {
    "chinese": "十四年，簡王崩，子靈王泄心立。",
    "literal": "Thirty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0455": {
    "chinese": "靈王二十四年，齊崔杼弒其君莊公。",
    "literal": "Thirty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0456": {
    "chinese": "二十七年，靈王崩，子景王貴立。",
    "literal": "Thirty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0457": {
    "chinese": "景王十八年，后太子聖而蚤卒。",
    "literal": "Thirty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0458": {
    "chinese": "二十年，景王愛子朝，欲立之，會崩，子丐之黨與爭立，國人立長子猛為王，子朝攻殺猛。",
    "literal": "Thirty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0459": {
    "chinese": "猛為悼王。",
    "literal": "Thirty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0460": {
    "chinese": "晉人攻子朝而立丐，是為敬王。",
    "literal": "Fortieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0461": {
    "chinese": "敬王元年，晉人入敬王，子朝自立，敬王不得入，居澤。",
    "literal": "Forty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0462": {
    "chinese": "四年，晉率諸侯入敬王于周，子朝為臣，諸侯城周。",
    "literal": "Forty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0463": {
    "chinese": "十六年，子朝之徒復作亂，敬王奔于晉。",
    "literal": "Forty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0464": {
    "chinese": "十七年，晉定公遂入敬王于周。",
    "literal": "Forty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0465": {
    "chinese": "三十九年，齊田常殺其君簡公。",
    "literal": "Forty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0466": {
    "chinese": "四十一年，楚滅陳。",
    "literal": "Forty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0467": {
    "chinese": "孔子卒。",
    "literal": "Forty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0468": {
    "chinese": "四十二年，敬王崩，子元王仁立。",
    "literal": "Forty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0469": {
    "chinese": "元王八年，崩，子定王介立。",
    "literal": "Forty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0470": {
    "chinese": "定王十六年，三晉滅智伯，分有其地。",
    "literal": "Fiftieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0471": {
    "chinese": "二十八年，定王崩，長子去疾立，是為哀王。",
    "literal": "Fifty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0472": {
    "chinese": "哀王立三月，弟叔襲殺哀王而自立，是為思王。",
    "literal": "Fifty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0473": {
    "chinese": "思王立五月，少弟嵬攻殺思王而自立，是為考王。",
    "literal": "Fifty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0474": {
    "chinese": "此三王皆定王之子。",
    "literal": "Fifty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0475": {
    "chinese": "考王十五年，崩，子威烈王午立。",
    "literal": "Fifty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0476": {
    "chinese": "考王封其弟于河南，是為桓公，以續周公之官職。",
    "literal": "Fifty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0477": {
    "chinese": "桓公卒，子威公代立。",
    "literal": "Fifty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0478": {
    "chinese": "威公卒，子惠公代立，乃封其少子於鞏以奉王，號東周惠公。",
    "literal": "Fifty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0479": {
    "chinese": "威烈王二十三年，九鼎震。",
    "literal": "Fifty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0480": {
    "chinese": "命韓、魏、趙為諸侯。",
    "literal": "Sixtieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0481": {
    "chinese": "二十四年，崩，子安王驕立。",
    "literal": "Twenty-fourth year, he died, his son An Wang Jiao ascended.",
    "idiomatic": ""
  },
  "s0482": {
    "chinese": "是歲盜殺楚聲王。",
    "literal": "This year robbers killed Chu Sheng Wang.",
    "idiomatic": ""
  },
  "s0483": {
    "chinese": "安王立二十六年，崩，子烈王喜立。",
    "literal": "An Wang ascended for twenty-six years, died, his son Lie Wang Xi ascended.",
    "idiomatic": ""
  },
  "s0484": {
    "chinese": "烈王二年，周太史儋見秦獻公曰：「始周與秦國合而別，別五百載復合，合十七歲而霸王者出焉。」",
    "literal": "Lie Wang second year, Zhou Grand Historian Dan saw Qin Xian Gong and said: 'Originally Zhou and Qin were united then separated, separated five hundred years then reunited, united seventeen years and a hegemon-king will emerge.'",
    "idiomatic": ""
  },
  "s0486": {
    "chinese": "十年，烈王崩，弟扁立，是為顯王。",
    "literal": "Tenth year, Lie Wang died, his younger brother Bian ascended, this was Xian Wang.",
    "idiomatic": ""
  },
  "s0487": {
    "chinese": "顯王五年，賀秦獻公，獻公稱伯。",
    "literal": "Xian Wang fifth year, congratulated Qin Xian Gong, Xian Gong was called hegemon.",
    "idiomatic": ""
  },
  "s0488": {
    "chinese": "九年，致文武胙於秦孝公。",
    "literal": "Ninth year, sent the sacrifices of Wen and Wu to Qin Xiao Gong.",
    "idiomatic": ""
  },
  "s0489": {
    "chinese": "二十五年，秦會諸侯於周。",
    "literal": "Sixteenth year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0490": {
    "chinese": "二十六年，周致伯於秦孝公。",
    "literal": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0491": {
    "chinese": "三十三年，賀秦惠王。",
    "literal": "Twenty-third year, attacked the Quanrong.",
    "idiomatic": ""
  },
  "s0492": {
    "chinese": "三十五年，致文武胙於秦惠王。",
    "literal": "Twenty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0493": {
    "chinese": "四十四年，秦惠王稱王。",
    "literal": "Twenty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0494": {
    "chinese": "其後諸侯皆為王。",
    "literal": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0495": {
    "chinese": "四十八年，顯王崩，子慎靚王定立。",
    "literal": "Thirty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0496": {
    "chinese": "慎靚王立六年，崩，子赧王延立。",
    "literal": "Thirty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0497": {
    "chinese": "王赧時東西周分治。",
    "literal": "Thirty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0498": {
    "chinese": "王赧徙都西周。",
    "literal": "Thirty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0499": {
    "chinese": "西周武公之共太子死，有五庶子，毋適立。",
    "literal": "Thirty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0500": {
    "chinese": "司馬翦謂楚王曰：「不如以地資公子咎，為請太子。」",
    "literal": "Forty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0501": {
    "chinese": "左成曰：「不可。",
    "literal": "Forty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0502": {
    "chinese": "周不聽，是公之知困而交疏於周也。",
    "literal": "Forty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0503": {
    "chinese": "不如請周君孰欲立，以微告翦，翦請令楚（賀）［資］之以地。」",
    "literal": "Forty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0504": {
    "chinese": "果立公子咎為太子。",
    "literal": "Forty-eighth year, Xian Wang died, his son Shenjing Wang ascended.",
    "idiomatic": ""
  },
  "s0505": {
    "chinese": "八年，秦攻宜陽，楚救之。",
    "literal": "Shenjing Wang first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0506": {
    "chinese": "而楚以周為秦故，將伐之。",
    "literal": "Second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0507": {
    "chinese": "蘇代為周說楚王曰：「何以周為秦之禍也？",
    "literal": "Third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0508": {
    "chinese": "言周之為秦甚於楚者，欲令周入秦也，故謂『周秦』也。",
    "literal": "Fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0509": {
    "chinese": "周知其不可解，必入於秦，此為秦取周之精者也。",
    "literal": "Fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0510": {
    "chinese": "為王計者，周於秦因善之，不於秦亦言善之，以疏之於秦。",
    "literal": "Sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0511": {
    "chinese": "周絕於秦，必入於郢矣。」",
    "literal": "Seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0513": {
    "chinese": "秦借道兩周之閒，將以伐韓，周恐借之畏於韓，不借畏於秦。",
    "literal": "Eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0514": {
    "chinese": "史厭謂周君曰：「何不令人謂韓公叔曰『秦之敢絕周而伐韓者，信東周也。",
    "literal": "Ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0515": {
    "chinese": "公何不與周地，發質使之楚』？",
    "literal": "Tenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0516": {
    "chinese": "秦必疑楚不信周，是韓不伐也。",
    "literal": "Eleventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0517": {
    "chinese": "又謂秦曰『韓彊與周地，將以疑周於秦也，周不敢不受』。",
    "literal": "Twelfth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0518": {
    "chinese": "秦必無辭而令周不受，是受地於韓而聽於秦。」",
    "literal": "Thirteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0520": {
    "chinese": "秦召西周君，西周君惡往，故令人謂韓王曰：「秦召西周君，將以使攻王之南陽也，王何不出兵於南陽？",
    "literal": "Fourteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0521": {
    "chinese": "周君將以為辭於秦。",
    "literal": "Fifteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0522": {
    "chinese": "周君不入秦，秦必不敢踰河而攻南陽矣。」",
    "literal": "Sixteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0524": {
    "chinese": "東周與西周戰，韓救西周。",
    "literal": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0525": {
    "chinese": "或為東周說韓王曰：「西周故天子之國，多名器重寶。",
    "literal": "Eighteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0526": {
    "chinese": "王案兵毋出，可以德東周，而西周之寶必可以盡矣。」",
    "literal": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0528": {
    "chinese": "王赧謂成君。",
    "literal": "Twentieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0529": {
    "chinese": "楚圍雍氏，韓徵甲與粟於東周，東周君恐，召蘇代而告之。",
    "literal": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0530": {
    "chinese": "代曰：「君何患於是。",
    "literal": "Twenty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0531": {
    "chinese": "臣能使韓毋徵甲與粟於周，又能為君得高都。」",
    "literal": "Twenty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0532": {
    "chinese": "周君曰：「子茍能，請以國聽子。」",
    "literal": "Twenty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0533": {
    "chinese": "代見韓相國曰：「楚圍雍氏，期三月也，今五月不能拔，是楚病也。",
    "literal": "Twenty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0534": {
    "chinese": "今相國乃徵甲與粟於周，是告楚病也。」",
    "literal": "Twenty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0535": {
    "chinese": "韓相國曰：「善。",
    "literal": "Twenty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0536": {
    "chinese": "使者已行矣。」",
    "literal": "Twenty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0537": {
    "chinese": "代曰：「何不與周高都？」",
    "literal": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0538": {
    "chinese": "韓相國大怒曰：「吾毋徵甲與粟於周亦已多矣，何故與周高都也？」",
    "literal": "Thirtieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0539": {
    "chinese": "代曰：「與周高都，是周折而入於韓也，秦聞之必大怒忿周，即不通周使，是以獘高都得完周也。",
    "literal": "Thirty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0540": {
    "chinese": "曷為不與？」",
    "literal": "Thirty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0541": {
    "chinese": "相國曰：「善。」",
    "literal": "Thirty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0542": {
    "chinese": "果與周高都。",
    "literal": "Thirty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0543": {
    "chinese": "三十四年，蘇厲謂周君曰：「秦破韓、魏，撲師武，北取趙藺、離石者，皆白起也。",
    "literal": "Thirty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0544": {
    "chinese": "是善用兵，又有天命。",
    "literal": "Thirty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0545": {
    "chinese": "今又將兵出塞攻梁，梁破則周危矣。",
    "literal": "Thirty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0546": {
    "chinese": "君何不令人說白起乎？",
    "literal": "Thirty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0547": {
    "chinese": "曰『楚有養由基者，善射者也。",
    "literal": "Thirty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0548": {
    "chinese": "去柳葉百步而射之，百發而百中之。",
    "literal": "Fortieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0549": {
    "chinese": "左右觀者數千人，皆曰善射。",
    "literal": "Forty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0550": {
    "chinese": "有一夫立其旁，曰「善，可教射矣」。",
    "literal": "Forty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0551": {
    "chinese": "養由基怒，釋弓搤劍，曰「客安能教我射乎」？",
    "literal": "Forty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0552": {
    "chinese": "客曰「非吾能教子支左詘右也。",
    "literal": "Forty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0553": {
    "chinese": "夫去柳葉百步而射之，百發而百中之，不以善息，少焉氣衰力倦，弓撥矢鉤，一發不中者，百發盡息」。",
    "literal": "Forty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0554": {
    "chinese": "今破韓、魏，撲師武，北取趙藺、離石者，公之功多矣。",
    "literal": "Forty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0555": {
    "chinese": "今又將兵出塞，過兩周，倍韓，攻梁，一舉不得，前功盡棄。",
    "literal": "Forty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0556": {
    "chinese": "公不如稱病而無出』。」",
    "literal": "Forty-eighth year, Shenjing Wang died, his son Nan Wang ascended.",
    "idiomatic": ""
  },
  "s0558": {
    "chinese": "四十二年，秦破華陽約。",
    "literal": "Nan Wang first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0559": {
    "chinese": "馬犯謂周君曰：「請令梁城周。」",
    "literal": "Second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0560": {
    "chinese": "乃謂梁王曰：「周王病若死，則犯必死矣。",
    "literal": "Third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0561": {
    "chinese": "犯請以九鼎自入於王，王受九鼎而圖犯。」",
    "literal": "Fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0562": {
    "chinese": "梁王曰：「善。」",
    "literal": "Fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0563": {
    "chinese": "遂與之卒，言戍周。",
    "literal": "Sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0564": {
    "chinese": "因謂秦王曰：「梁非戍周也，將伐周也。",
    "literal": "Seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0565": {
    "chinese": "王試出兵境以觀之。」",
    "literal": "Eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0566": {
    "chinese": "秦果出兵。",
    "literal": "Ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0567": {
    "chinese": "又謂梁王曰：「周王病甚矣，犯請後可而復之。",
    "literal": "Tenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0568": {
    "chinese": "今王使卒之周，諸侯皆生心，後舉事且不信。",
    "literal": "Eleventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0569": {
    "chinese": "不若令卒為周城，以匿事端。」",
    "literal": "Twelfth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0570": {
    "chinese": "梁王曰：「善。」",
    "literal": "Thirteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0571": {
    "chinese": "遂使城周。",
    "literal": "Fourteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0572": {
    "chinese": "四十五年，周君之秦客謂周（最）［聚］曰：「公不若譽秦王之孝，因以應為太后養地，秦王必喜，是公有秦交。",
    "literal": "Fifteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0573": {
    "chinese": "交善，周君必以為公功。",
    "literal": "Sixteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0574": {
    "chinese": "交惡，勸周君入秦者必有罪矣。」",
    "literal": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0575": {
    "chinese": "秦攻周，而周聚謂秦王曰：「為王計者不攻周。",
    "literal": "Eighteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0576": {
    "chinese": "攻周，實不足以利，聲畏天下。",
    "literal": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0577": {
    "chinese": "天下以聲畏秦，必東合於齊。",
    "literal": "Twentieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0578": {
    "chinese": "兵獘於周。",
    "literal": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0579": {
    "chinese": "合天下於齊，則秦不王矣。",
    "literal": "Twenty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0580": {
    "chinese": "天下欲獘秦，勸王攻周。",
    "literal": "Twenty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0581": {
    "chinese": "秦與天下獘，則令不行矣。」",
    "literal": "Twenty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0583": {
    "chinese": "五十八年，三晉距秦。",
    "literal": "Twenty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0584": {
    "chinese": "周令其相國之秦，以秦之輕也，還其行。",
    "literal": "Twenty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0585": {
    "chinese": "客謂相國曰：「秦之輕重未可知也。",
    "literal": "Twenty-seventh year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0586": {
    "chinese": "秦欲知三國之情。",
    "literal": "Twenty-eighth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0587": {
    "chinese": "公不如急見秦王曰『請為王聽東方之變』，秦王必重公。",
    "literal": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0588": {
    "chinese": "重公，是秦重周，周以取秦也；",
    "literal": "Thirtieth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0589": {
    "chinese": "齊重，則固有周聚以收齊：是周常不失重國之交也。」",
    "literal": "Thirty-first year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0590": {
    "chinese": "秦信周，發兵攻三晉。",
    "literal": "Thirty-second year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0591": {
    "chinese": "五十九年，秦取韓陽城負黍，西周恐，倍秦，與諸侯約從，將天下銳師出伊闕攻秦，令秦無得通陽城。",
    "literal": "Thirty-third year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0592": {
    "chinese": "秦昭王怒，使將軍摎攻西周。",
    "literal": "Thirty-fourth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0593": {
    "chinese": "西周君犇秦，頓首受罪，盡獻其邑三十六，口三萬。",
    "literal": "Thirty-fifth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0594": {
    "chinese": "秦受其獻，歸其君於周。",
    "literal": "Thirty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0595": {
    "chinese": "周君、王赧卒，周民遂東亡。",
    "literal": "Fifty-ninth year, Qin destroyed Zhou, divided its territory.",
    "idiomatic": ""
  },
  "s0596": {
    "chinese": "秦取九鼎寶器，而遷西周公於憚狐。",
    "literal": "Qin took the nine tripods and precious vessels, and moved the Western Zhou duke to Danhu.",
    "idiomatic": ""
  },
  "s0597": {
    "chinese": "後七歲，秦莊襄王滅東（西）周。",
    "literal": "Seven years later, Qin Zhuang Xiang Wang destroyed Eastern Zhou.",
    "idiomatic": ""
  },
  "s0598": {
    "chinese": "東西周皆入于秦，周既不祀。",
    "literal": "Eastern and Western Zhou both entered Qin, Zhou no longer performed sacrifices.",
    "idiomatic": ""
  },
  "s0599": {
    "chinese": "太史公曰：學者皆稱周伐紂，居洛邑，綜其實不然。",
    "literal": "The Grand Historian says: Scholars all claim Zhou attacked Zhou and resided in Luoyi, but comprehensively it was not so.",
    "idiomatic": ""
  },
  "s0600": {
    "chinese": "武王營之，成王使召公卜居，居九鼎焉，而周復都豐、鎬。",
    "literal": "King Wu planned it, King Cheng sent Shao Gong to divine the site, placed the nine tripods there, and Zhou again made its capital at Feng and Hao.",
    "idiomatic": ""
  },
  "s0601": {
    "chinese": "至犬戎敗幽王，周乃東徙于洛邑。",
    "literal": "Until the Quanrong defeated King You, Zhou then moved east to Luoyi.",
    "idiomatic": ""
  },
  "s0602": {
    "chinese": "所謂「周公葬（我）［於］畢」，畢在鎬東南杜中。",
    "literal": "What is called 'Zhou Gong buried me at Bi', Bi is in the Du midst southeast of Hao.",
    "idiomatic": ""
  },
  "s0603": {
    "chinese": "秦滅周。",
    "literal": "Qin extinguished Zhou.",
    "idiomatic": ""
  },
  "s0604": {
    "chinese": "漢興九十有餘載，天子將封泰山，東巡狩至河南，求周苗裔，封其後嘉三十里地，號曰周子南君，比列侯，以奉其先祭祀。",
    "literal": "After Han arose, ninety-some years passed, the Son of Heaven was about to seal Taishan, toured east to Henan, sought Zhou descendants, enfeoffed their posterity Jia with thirty li of land, titled Zhou Zi Nan Jun, ranked as liehou, to continue their ancestral sacrifices.",
    "idiomatic": ""
  }
}