{
  "s0101": {
    "chinese": "魏人 周市略地豐沛，使人謂雍齒曰：「豐，故梁徙也，今魏地已定者數十城。",
    "literal": "Wei person Zhou Shi conquered territory Feng Pei, sent person to tell Yong Chi: 'Feng was originally Liang migrants, now Wei territory already settled dozens of cities.'",
    "idiomatic": "Zhou Shi of Wei, having conquered the Feng and Pei regions, sent a messenger to Yong Chi saying, 'Feng was originally settled by migrants from Liang. Wei has now secured dozens of cities.'"
  },
  "s0102": {
    "chinese": "齒今下魏，魏以齒為侯守豐；",
    "literal": "'Chi now submit to Wei, Wei will make Chi marquis to guard Feng;'",
    "idiomatic": "'If Yong Chi submits to Wei now, Wei will make him a marquis and let him defend Feng;'"
  },
  "s0103": {
    "chinese": "不下，且屠豐。」",
    "literal": "'if not submit, then will slaughter Feng.'",
    "idiomatic": "'if you don't submit, we'll slaughter the people of Feng.'"
  },
  "s0104": {
    "chinese": "雍齒雅不欲屬沛公，及魏招之，即反為魏守 豐。",
    "literal": "Yong Chi usually did not wish to belong to Pei Gong, when Wei summoned him, immediately rebelled to guard Feng for Wei.",
    "idiomatic": "Yong Chi had never wanted to serve Lord Pei. When Wei summoned him, he immediately defected and began defending Feng for Wei."
  },
  "s0105": {
    "chinese": "沛公攻豐，不能取。",
    "literal": "Pei Gong attacked Feng, could not capture it.",
    "idiomatic": "Lord Pei attacked Feng but could not take it."
  },
  "s0106": {
    "chinese": "沛公還之沛，怨雍齒與豐子弟畔之。",
    "literal": "Pei Gong returned to Pei, resented Yong Chi and the Feng youths rebelling against him.",
    "idiomatic": "Lord Pei returned to Pei, resentful that Yong Chi and the young men of Feng had rebelled against him."
  },
  "s0107": {
    "chinese": "正月，張耳等立趙後趙歇為趙王。",
    "literal": "First month, Zhang Er and others established Zhao descendant Zhao Xie as Zhao King.",
    "idiomatic": "In the first month, Zhang Er and others installed Zhao Xie, a descendant of the Zhao royal family, as King of Zhao."
  },
  "s0108": {
    "chinese": "東陽甯君、秦嘉立景駒為楚王，在留。",
    "literal": "Dongyang Ning Jun, Qin Jia established Jing Ju as Chu King, at Liu.",
    "idiomatic": "Ning Jun of Dongyang and Qin Jia installed Jing Ju as King of Chu, with his capital at Liu."
  },
  "s0109": {
    "chinese": "沛公往從之，道得張良，遂與俱 見景駒，請兵以攻豐。",
    "literal": "Pei Gong went to follow them, on the road obtained Zhang Liang, then together went to see Jing Ju, requested troops to attack Feng.",
    "idiomatic": "Lord Pei went to join them. Along the way he met Zhang Liang, and together they went to see King Jing Ju to request troops for attacking Feng."
  },
  "s0110": {
    "chinese": "時章邯從陳，別將司馬镛將兵北定楚地，屠相，至碭。",
    "literal": "At this time Zhang Han came from Chen, separate general Sima Ni led troops north to pacify Chu territory, massacred Xiang, arrived at Dang.",
    "idiomatic": "At this time, Zhang Han was advancing from Chen. His deputy general Sima Ni led troops north to pacify Chu territory, massacring the people of Xiang and reaching Dang."
  },
  "s0111": {
    "chinese": "東陽甯君、沛公引兵西，與戰蕭西，不利，還收兵聚留。",
    "literal": "Dongyang Ning Jun, Pei Gong led troops west, fought battle at Xiao west, unfavorable, returned gathered troops at Liu.",
    "idiomatic": "Ning Jun of Dongyang and Lord Pei led troops west and fought a battle west of Xiao, but were defeated. They retreated and regrouped at Liu."
  },
  "s0112": {
    "chinese": "二月，攻碭，三日拔之。",
    "literal": "Second month, attacked Dang, three days captured it.",
    "idiomatic": "In the second month, they attacked Dang and captured it after three days."
  },
  "s0113": {
    "chinese": "收碭 兵，得六千人，與故合九千人。",
    "literal": "Recruited Dang troops, got six thousand, combined with original made nine thousand.",
    "idiomatic": "They recruited troops from Dang, gaining six thousand men, bringing their total to nine thousand."
  },
  "s0114": {
    "chinese": "三月，攻下邑，拔之。",
    "literal": "Third month, attacked Xiayi, captured it.",
    "idiomatic": "In the third month, they attacked Xiayi and captured it."
  },
  "s0115": {
    "chinese": "還擊豐，不下。",
    "literal": "Returned to attack Feng, could not capture.",
    "idiomatic": "They returned to attack Feng but could not take it."
  },
  "s0116": {
    "chinese": "四月，項梁擊殺景駒、秦嘉，止薛，沛公往見之。",
    "literal": "Fourth month, Xiang Liang attacked and killed Jing Ju, Qin Jia, stopped at Xue, Pei Gong went to see him.",
    "idiomatic": "In the fourth month, Xiang Liang attacked and killed Jing Ju and Qin Jia. He halted at Xue, and Lord Pei went to meet him."
  },
  "s0117": {
    "chinese": "項梁益沛公卒五千人，五大夫將十人。",
    "literal": "Xiang Liang increased Pei Gong's troops five thousand, Grand Master generals ten people.",
    "idiomatic": "Xiang Liang gave Lord Pei five thousand additional troops and ten generals of the rank of Grand Master."
  },
  "s0118": {
    "chinese": "沛公 還，引兵攻豐，拔之。",
    "literal": "Pei Gong returned, led troops to attack Feng, captured it.",
    "idiomatic": "Lord Pei returned, led his troops to attack Feng, and captured it."
  },
  "s0119": {
    "chinese": "雍齒奔魏。",
    "literal": "Yong Chi fled to Wei.",
    "idiomatic": "Yong Chi fled to Wei."
  },
  "s0120": {
    "chinese": "五月，項羽拔襄城還。",
    "literal": "Fifth month, Xiang Yu captured Xiangcheng and returned.",
    "idiomatic": "In the fifth month, Xiang Yu captured Xiangcheng and returned."
  },
  "s0121": {
    "chinese": "項梁盡召別將。",
    "literal": "Xiang Liang completely summoned the separate generals.",
    "idiomatic": "Xiang Liang summoned all his deputy generals."
  },
  "s0122": {
    "chinese": "六月，沛公如薛，與項梁共立楚懷王孫心為楚懷王。",
    "literal": "Sixth month, Pei Gong went to Xue, together with Xiang Liang established Chu King Huai's grandson Xin as Chu King Huai.",
    "idiomatic": "In the sixth month, Lord Pei went to Xue and together with Xiang Liang installed Xin, grandson of King Huai of Chu, as King Huai of Chu."
  },
  "s0123": {
    "chinese": "章邯破殺魏王 咎、齊王田儋於臨濟。",
    "literal": "Zhang Han defeated and killed Wei King Jiu, Qi King Tian Dan at Linji.",
    "idiomatic": "Zhang Han defeated and killed King Jiu of Wei and King Tian Dan of Qi at Linji."
  },
  "s0124": {
    "chinese": "七月，大霖雨。",
    "literal": "Seventh month, great continuous rain.",
    "idiomatic": "In the seventh month, there was continuous heavy rain."
  },
  "s0125": {
    "chinese": "沛公攻亢父。",
    "literal": "Pei Gong attacked Kang Fu.",
    "idiomatic": "Lord Pei attacked Kang Fu."
  },
  "s0126": {
    "chinese": "章邯圍田榮於東阿。",
    "literal": "Zhang Han besieged Tian Rong at Dong'a.",
    "idiomatic": "Zhang Han besieged Tian Rong at Dong'a."
  },
  "s0127": {
    "chinese": "沛公與項梁共救田榮，大破章邯東阿。",
    "literal": "Pei Gong together with Xiang Liang rescued Tian Rong, greatly defeated Zhang Han at Dong'a.",
    "idiomatic": "Lord Pei and Xiang Liang together went to rescue Tian Rong and inflicted a major defeat on Zhang Han at Dong'a."
  },
  "s0128": {
    "chinese": "田榮歸，沛公、項羽追北，至城陽，攻屠其城。",
    "literal": "Tian Rong returned, Pei Gong, Xiang Yu pursued north, arrived at Chengyang, attacked and slaughtered its city.",
    "idiomatic": "Tian Rong returned home. Lord Pei and Xiang Yu pursued the retreating enemy northward, reaching Chengyang where they attacked and massacred the inhabitants."
  },
  "s0129": {
    "chinese": "軍濮 陽東，復與章邯戰，又破之。",
    "literal": "Camped east of Puyang, again fought with Zhang Han, again defeated him.",
    "idiomatic": "They camped east of Puyang and fought Zhang Han again, defeating him once more."
  },
  "s0130": {
    "chinese": "章邯復振，守濮陽，環水。",
    "literal": "Zhang Han again recovered, defended Puyang, surrounded by water.",
    "idiomatic": "Zhang Han rallied again and defended Puyang, which was surrounded by water."
  },
  "s0131": {
    "chinese": "沛公、項羽去攻定陶。",
    "literal": "Pei Gong, Xiang Yu left to attack Dingtao.",
    "idiomatic": "Lord Pei and Xiang Yu departed to attack Dingtao."
  },
  "s0132": {
    "chinese": "八月，田榮立田儋子市為齊王。",
    "literal": "Eighth month, Tian Rong established Tian Dan's son Shi as Qi King.",
    "idiomatic": "In the eighth month, Tian Rong installed Tian Shi, son of Tian Dan, as King of Qi."
  },
  "s0133": {
    "chinese": "定陶未下，沛公與項羽西略地至雍丘，與秦軍戰，大敗之，斬三川守李由。",
    "literal": "Dingtao not yet fallen, Pei Gong together with Xiang Yu west conquered territory to Yongqiu, fought with Qin army, greatly defeated them, beheaded Sanchuan defender Li You.",
    "idiomatic": "While Dingtao still held out, Lord Pei and Xiang Yu marched west conquering territory until they reached Yongqiu. There they fought the Qin army, inflicted a major defeat, and beheaded Li You, defender of Sanchuan commandery."
  },
  "s0134": {
    "chinese": "還攻外黃，外黃未下。",
    "literal": "Returned to attack Waihuang, Waihuang did not fall.",
    "idiomatic": "They returned to attack Waihuang, but could not capture it."
  },
  "s0135": {
    "chinese": "項梁再破秦軍，有驕色。",
    "literal": "Xiang Liang again defeated Qin army, had arrogant appearance.",
    "idiomatic": "Xiang Liang defeated the Qin army again and grew arrogant."
  },
  "s0136": {
    "chinese": "宋義諫，不聽。",
    "literal": "Song Yi advised, did not listen.",
    "idiomatic": "Song Yi advised him against it, but he would not listen."
  },
  "s0137": {
    "chinese": "秦益章邯兵。",
    "literal": "Qin increased Zhang Han's troops.",
    "idiomatic": "Qin reinforced Zhang Han with additional troops."
  },
  "s0138": {
    "chinese": "九月，章邯夜銜枚擊項梁定陶，大破之，殺項梁。",
    "literal": "Ninth month, Zhang Han night held wooden gag attacked Xiang Liang at Dingtao, greatly defeated him, killed Xiang Liang.",
    "idiomatic": "In the ninth month, Zhang Han attacked Xiang Liang at Dingtao under cover of night with gags in mouths to maintain silence. He inflicted a major defeat and killed Xiang Liang."
  },
  "s0139": {
    "chinese": "時連雨自七月至九月。",
    "literal": "At this time continuous rain from seventh month to ninth month.",
    "idiomatic": "Continuous rain fell from the seventh through ninth months."
  },
  "s0140": {
    "chinese": "沛公、項羽方攻陳留，聞梁死，士卒恐，乃與將軍呂臣引兵而東，徙懷王自盱台都彭城。",
    "literal": "Pei Gong, Xiang Yu just attacking Chenliu, heard Liang died, soldiers afraid, then together with general Lu Chen led troops east, moved King Huai from Xutai capital to Pengcheng.",
    "idiomatic": "Lord Pei and Xiang Yu were in the midst of attacking Chenliu when they heard of Xiang Liang's death. Their troops were terrified, so they joined with General Lu Chen and led their forces east, moving King Huai from Xutai to establish his capital at Pengcheng."
  },
  "s0141": {
    "chinese": "呂臣軍彭城東，項羽軍彭城西，沛公軍碭。",
    "literal": "Lu Chen's army east of Pengcheng, Xiang Yu's army west of Pengcheng, Pei Gong's army at Dang.",
    "idiomatic": "Lu Chen's army camped east of Pengcheng, Xiang Yu's army west of Pengcheng, and Lord Pei's army at Dang."
  },
  "s0142": {
    "chinese": "魏咎弟豹 自立為魏王。",
    "literal": "Wei Jiu's younger brother Bao self-established as Wei King.",
    "idiomatic": "Wei Jiu's younger brother Bao proclaimed himself King of Wei."
  },
  "s0143": {
    "chinese": "後九月，懷王并呂臣、項羽軍自將之。",
    "literal": "After ninth month, King Huai merged Lu Chen, Xiang Yu's armies and personally led them.",
    "idiomatic": "In the following ninth month, King Huai merged the armies of Lu Chen and Xiang Yu under his personal command."
  },
  "s0144": {
    "chinese": "以沛公為碭郡長，封武安侯，將碭郡兵。",
    "literal": "Made Pei Gong Dang commandery chief, sealed as Marquis of Wuan, led Dang commandery troops.",
    "idiomatic": "He appointed Lord Pei as governor of Dang commandery, enfeoffed him as Marquis of Wuan, and put him in command of Dang's troops."
  },
  "s0145": {
    "chinese": "以羽為魯公，封長安侯，呂臣為司徒，其父呂青為令尹。",
    "literal": "Made Yu Duke of Lu, sealed as Marquis of Chang'an, Lu Chen as Minister of the Masses, his father Lu Qing as Prime Minister.",
    "idiomatic": "He made Xiang Yu Duke of Lu and Marquis of Chang'an, appointed Lu Chen as Minister of the Masses, and his father Lu Qing as Prime Minister."
  },
  "s0146": {
    "chinese": "章邯已破項梁，以為楚地兵不足憂，乃渡河北擊趙王歇，大破之。",
    "literal": "Zhang Han having defeated Xiang Liang, thought Chu territory troops not worth worrying about, then crossed north of Yellow River attacked Zhao King Xie, greatly defeated him.",
    "idiomatic": "Having defeated Xiang Liang, Zhang Han considered the Chu forces no longer a threat and crossed north of the Yellow River to attack King Xie of Zhao, inflicting a major defeat."
  },
  "s0147": {
    "chinese": "歇保鉅鹿城，秦將王離圍之。",
    "literal": "Xie defended Julu city, Qin general Wang Li besieged it.",
    "idiomatic": "King Xie defended the city of Julu, but Qin general Wang Li besieged it."
  },
  "s0148": {
    "chinese": "趙數請救，懷王乃以宋義為上將，項羽為次將，范增為末將，北救趙。",
    "literal": "Zhao repeatedly requested rescue, King Huai then made Song Yi supreme general, Xiang Yu deputy general, Fan Zeng rear general, north to rescue Zhao.",
    "idiomatic": "Zhao repeatedly appealed for help. King Huai appointed Song Yi as supreme commander, Xiang Yu as deputy commander, and Fan Zeng as rear commander, to march north and rescue Zhao."
  },
  "s0149": {
    "chinese": "初，懷王與諸將約，先入定關中者王之。",
    "literal": "Originally, King Huai made agreement with various generals, the first to enter and pacify Guanzhong would be made king there.",
    "idiomatic": "Originally, King Huai had agreed with his generals that whoever first entered and pacified Guanzhong would be made king there."
  },
  "s0150": {
    "chinese": "當是時，秦兵彊，常乘勝逐北，諸將莫利先入關。",
    "literal": "At this time, Qin troops strong, constantly took advantage of victory pursued retreating enemy, various generals none saw benefit in entering pass first.",
    "idiomatic": "At this time, the Qin forces were strong and constantly pressing their advantage to pursue retreating enemies. None of the generals saw any advantage in being the first to enter the pass."
  }
}