{
  "s0001": "Kings establish affairs make laws, things measure tracks rules, all receive from six pitches, six pitches are ten thousand affairs root.",
  "s0002": "Their regard for weapons especially heavy, thus said 'look at enemy know good bad, hear sound know victory defeat', hundred kings unchanging way.",
  "s0003": "Wu Wang attacked Zhou, blew pitches listened to sound, pushed first spring to last winter, killing qi mutually combined, sound still gong.",
  "s0004": "Same sound mutually follow, things' natural, what sufficient to wonder?",
  "s0005": "Warriors, sages use to punish strong violent, pacify chaotic age, level dangers obstacles, save peril crisis.",
  "s0006": "From containing teeth wearing horns beasts see violation then fight, moreover concerning people harboring likes dislikes happy angry qi?",
  "s0007": "Happy then loving heart born, angry then poisonous sting added, feelings nature's principle.",
  "s0008": "Former Huang Di had Zhuolu battle, to settle fire disaster;",
  "s0009": "Zhuan Xu had Gong Gong battle array, to pacify water harm;",
  "s0010": "Cheng Tang had Nan Chao attack, to exterminate Xia chaos.",
  "s0011": "Successively rise successively waste, victors use affairs, received from heaven.",
  "s0012": "From this after, famous scholars successively rise, Jin used Jiu Fan, Qi used Wang Zi, Wu used Sun Wu, declared army covenants, rewards punishments must trustworthy, finally hegemon feudal lords, annexed column state lands, though not reach three dynasties' announcements oaths, yet body honored lord respected, contemporary illustrious praised, can not call glorious?",
  "s0013": "How with worldly Confucians dark about great outline, not weigh light heavy, vile speak virtue transformation, not appropriate use troops, great to lord insulted lost defense, small then invaded diminished weakened, then held not move etc!",
  "s0014": "Writing teaching cane cannot waste in home, punishments cannot abandon in state, executions cannot cease in world, use has skillful clumsy, carry has reverse proper only.",
  "s0015": "Xia Jie, Yin Zhou hand wrestled wolves boars, feet pursued four horses, brave not slight;",
  "s0016": "Hundred battles victorious, feudal lords awed submitted, power not light.",
  "s0017": "Qin Er Shi garrisoned troops useless places, connected troops at borders, strength not weak;",
  "s0018": "Tied resentment Xiongnu, entangled calamity Yue, momentum not few.",
  "s0019": "When authority exhausted momentum extreme, alley people became enemy state, fault born from martial not knowing sufficiency, sweet gain heart not rest.",
  "s0020": "Gao Zu had world, three borders outside rebelled;",
  "s0021": "Great states' kings though called auxiliary support, minister conduct not complete.",
  "s0022": "Met Gao Zu weary bitter military affairs, also had Xiao Zhang plans, thus ceased martial one rest, restrained not prepared.",
  "s0023": "Continued to Xiao Wen ascended throne, generals Chen Wu etc discussed: 'Nan Yue, Chao Xian from complete Qin time inner belonged as minister children, after moreover held troops blocked passes, wriggling watching.",
  "s0024": "Gao Zu time world newly settled, people small peaceful, not could again raise troops.",
  "s0025": "Now Your Majesty benevolent gracious caressed hundred families, favor moisture added within seas, appropriate reach scholar people happy use, attack rebellious parties, to unify borders.'",
  "s0026": "Xiao Wen said: 'I can bear robe hat, thought not reach this.",
  "s0027": "Met Lu clan chaos, merit ministers clan relatives together not ashamed, wrongly occupied correct positions, constantly trembling trembling, feared affairs not end.",
  "s0028": "Moreover troops ominous instruments, though conquer wished, move also exhaust illness, say hundred families far places what?",
  "s0029": "Also former emperor knew toil people cannot trouble, thus not took as intent.",
  "s0030": "I how self say able?",
  "s0031": "Now Xiongnu inner invade, army officials no merit, border people fathers sons carry weapons days long, I constantly for moved heart pained, no day forget.",
  "s0032": "Now not able dissolve defense, wish moreover strengthen borders set scouts, tie peace connect envoys, rest peaceful north borders, for merit many.",
  "s0033": "Moreover no discuss troops.'",
  "s0034": "Thus hundred families no inner outer corvee, got rest shoulders at fields, world prosperous rich, grain to ten plus cash, crowing cocks barking dogs, smoke fires ten thousand li, can call harmonious happy!",
  "s0035": "Grand Historian says: Wen emperor time, met world newly left cauldrons fires, people happy occupations, followed their wish thus, could not disturb chaos, thus hundred families then peaceful.",
  "s0036": "From age sixty seventy old men also not tasted to market wells, roam play frolic like children appearance.",
  "s0037": "Confucius called virtuous gentleman ones!",
  "s0038": "Book says seven correct, twenty eight lodges.",
  "s0039": "Pitch calendar, heaven thus connects five phases eight correct qi, heaven thus completes ripens ten thousand things.",
  "s0040": "Lodges, sun moon lodged.",
  "s0041": "Lodges, loose qi.",
  "s0042": "Not Zhou wind dwells northwest, governs killing birth.",
  "s0043": "Dong Bi dwells Not Zhou wind east, governs open birth qi east it.",
  "s0044": "To Ying Shi.",
  "s0045": "Ying Shi, governs camp fetal yang qi produce it.",
  "s0046": "East to Wei.",
  "s0047": "Wei, wei.",
  "s0048": "Speak yang qi wei wei, thus called Wei.",
  "s0049": "Tenth month, pitch middle Ying Zhong."
}
