{
  "s0694": "Then hit tree died.",
  "s0695": "Initially, Dun often hunted Shou Shan, saw mulberry below had famine person.",
  "s0696": "Famine person, Shi Mi Ming.",
  "s0697": "Dun granted food, ate its half.",
  "s0698": "Asked its reason, said: 'Eunuch three years, not know mother exist not, wish send mother.'",
  "s0699": "Dun righteous it, moreover granted rice meat.",
  "s0700": "Already became Jin cook, Zhao Dun not again know.",
  "s0701": "Ninth month, Jin Ling Gong drank Zhao Dun wine, hid armor about attacked Dun.",
  "s0702": "Gong cook Shi Mi Ming knew it, feared Dun drunk not able rise, advanced said: 'Lord grant minister, goblet three rounds can stop.'",
  "s0703": "Wished with leave Zhao Dun, command first, no reach difficulty.",
  "s0704": "Dun already left, Ling Gong hid scholars not assembled, first released biting dog named Ao.",
  "s0705": "Ming for Dun fought killed dog.",
  "s0706": "Dun said: 'Abandon person use dog, though fierce what for.'",
  "s0707": "But not know Ming as secret virtue.",
  "s0708": "Already Ling Gong released hid scholars exited pursued Zhao Dun, Shi Mi Ming contrary attacked Ling Gong hid scholars, hid scholars not able advance, finally released Dun.",
  "s0709": "Dun asked its reason, said: 'I mulberry below famine person.'",
  "s0710": "Asked its name, not informed.",
  "s0711": "Ming also because perished left.",
  "s0712": "Dun then fled, not exited Jin border.",
  "s0713": "Yi Chou, Dun elder younger brothers general Zhao Chuan attacked killed Ling Gong at Tao Yuan welcomed Zhao Dun.",
  "s0714": "Zhao Dun originally noble, obtained people harmony;",
  "s0715": "Ling Gong young, extravagant, people not attached, so assassinated easy.",
  "s0716": "Dun restored position.",
  "s0717": "Jin grand historian Dong Hu wrote said 'Zhao Dun assassinated his lord', to view at court.",
  "s0718": "Dun said: 'Assassinated Zhao Chuan, I no crime.'",
  "s0719": "Grand historian said: 'You for proper minister, perished not exit border, returned not executed country disorder, not you who?'",
  "s0720": "Kong Qiu heard it, said: 'Dong Hu, ancient good historian, writing method not hid.",
  "s0721": "Xuan Zi, good grand master, for method received evil.",
  "s0722": "Pity, exit border then avoid.'",
  "s0724": "Zhao Dun sent Zhao Chuan welcomed Xiang Gong younger brother Hei Tun at Zhou established him, this was Cheng Gong.",
  "s0725": "Cheng Gong, Wen Gong young son, his mother Zhou woman.",
  "s0726": "Ren Shen, court at Wu Gong temple.",
  "s0727": "Cheng Gong first year, granted Zhao clan as gong clan.",
  "s0728": "Attacked Zheng, Zheng betrayed Jin reason.",
  "s0729": "Third year, Zheng Bo initial established, attached Jin abandoned Chu.",
  "s0730": "Chu angered, attacked Zheng, Jin went saved it.",
  "s0731": "Sixth year, attacked Qin, captured Qin general Chi.",
  "s0732": "Seventh year, Cheng Gong with Chu Zhuang Wang contended strong, assembled feudal lords at Hu.",
  "s0733": "Chen feared Chu, not assembled.",
  "s0734": "Jin sent Zhong Xing Huan Zi attacked Chen, because saved Zheng, with Chu battled, defeated Chu army.",
  "s0735": "This year, Cheng Gong died, son Jing Gong Ju established.",
  "s0736": "Jing Gong first year spring, Chen grand master Xia Zheng Shu assassinated his lord Ling Gong.",
  "s0737": "Second year, Chu Zhuang Wang attacked Chen, executed Zheng Shu.",
  "s0738": "Third year, Chu Zhuang Wang surrounded Zheng, Zheng informed urgent Jin.",
  "s0739": "Jin sent Xun Lin Fu led middle army, Sui Hui led upper army, Zhao Shuo led lower army, Xi Ke, Luan Shu, Xian Hu, Han Jue, Gong Shuo assisted them.",
  "s0740": "Sixth month, arrived river.",
  "s0741": "Heard Chu already submitted Zheng, Zheng Bo bare flesh allied left, Xun Lin Fu wished return.",
  "s0742": "Xian Hu said: 'All come save Zheng, not arrive not able, about led separate hearts.'",
  "s0743": "Finally crossed river.",
  "s0744": "Chu already submitted Zheng, wished drink horse at river for name left.",
  "s0745": "Chu with Jin army great battle.",
  "s0746": "Zheng newly attached Chu, feared it, contrary assisted Chu attacked Jin.",
  "s0747": "Jin army defeated, fled river, contended cross, boat middle people finger very many.",
  "s0748": "Chu captured our general Zhi Ying.",
  "s0749": "Returned Lin Fu said: 'Minister for supervised general, army defeated should executed, please die.'",
  "s0750": "Jing Gong wished permitted it.",
  "s0751": "Sui Hui said: 'Former Wen Gong with Chu battle Cheng Pu, Cheng Wang returned killed Zi Yu, Wen Gong then happy.",
  "s0752": "Now Chu already defeated our army, moreover execute their general, is assist Chu kill enemy.'",
  "s0753": "Then stopped.",
  "s0754": "Fourth year, Xian Hu with head stratagem defeated Jin army river above, feared executed, then fled Di, with Di plotted attacked Jin.",
  "s0755": "Jin aware, then clan Hu.",
  "s0756": "Hu, Xian Zhen son.",
  "s0757": "Fifth year, attacked Zheng, for assisted Chu reason.",
  "s0758": "At time Chu Zhuang Wang strong, with frustrated Jin troops river above.",
  "s0759": "Sixth year, Chu attacked Song, Song came informed urgent Jin, Jin wished save it, Bo Zong planned said: 'Chu, heaven just opening it, not able resist.'",
  "s0760": "Then sent Xie Yang Tai as save Song.",
  "s0761": "Zheng people seized with Chu, Chu thick granted, sent return his words, commanded Song urgent surrender.",
  "s0762": "Xie Yang Tai permitted it, finally delivered Jin lord words.",
  "s0763": "Chu wished kill him, someone advised, then returned Xie Yang.",
  "s0764": "Seventh year, Jin sent Sui Hui extinguished Chi Di.",
  "s0765": "Eighth year, sent Xi Ke at Qi.",
  "s0766": "Qi Qu Gong mother from tower above observed laughed him.",
  "s0767": "So reason, Xi Ke humpbacked, Lu sent lame, Wei sent one-eyed, so Qi also sent person like to guide guests.",
  "s0768": "Xi Ke angered, returned to river above, said: 'Not repay Qi, He Bo see it!'",
  "s0769": "To country, requested lord, wished attack Qi.",
  "s0770": "Jing Gong asked knew its reason, said: 'Your resentment, how sufficient trouble country!'",
  "s0771": "Not listened.",
  "s0772": "Wei Wen Zi requested old rest, avoided Xi Ke, Ke held government.",
  "s0773": "Ninth year, Chu Zhuang Wang died.",
  "s0774": "Jin attacked Qi, Qi sent crown prince Qiang as hostage at Jin, Jin troops stopped.",
  "s0775": "Eleventh year spring, Qi attacked Lu, took Long.",
  "s0776": "Lu informed urgent Wei, Wei with Lu both because Xi Ke informed urgent at Jin.",
  "s0777": "Jin then sent Xi Ke, Luan Shu, Han Jue with war chariots eight hundred rode with Lu, Wei together attacked Qi.",
  "s0778": "Summer, with Qu Gong battled at Ai, injured Qu Gong.",
  "s0779": "Qu Gong then with his right exchanged position, descended took drink, with obtained released left.",
  "s0780": "Qi army defeated fled, Jin pursued north to Qi.",
  "s0781": "Qu Gong offered precious vessels to seek peace, not listened.",
  "s0782": "Xi Ke said: 'Must obtain Xiao Tong nephew son as hostage.'",
  "s0783": "Qi sent said: 'Xiao Tong nephew son, Qu Gong mother;",
  "s0784": "Qu Gong mother like Jin lord mother, why must obtain it?",
  "s0785": "Not righteous, please again battle.'",
  "s0786": "Jin then permitted allied left.",
  "s0787": "Chu Shen Gong Wu Chen stole Xia Ji fled Jin, Jin with Wu Chen as Xing grand master.",
  "s0788": "Twelfth year winter, Qi Qu Gong like Jin, wished ascend honor Jin Jing Gong as wang, Jing Gong declined not dared.",
  "s0789": "Jin began made six army, Han Jue, Gong Shuo, Zhao Chuan, Xun Yu, Zhao Kuo, Zhao Zhan all became ministers.",
  "s0790": "Zhi Ying from Chu returned.",
  "s0791": "Thirteenth year, Lu Cheng Gong courted Jin, Jin not respected, Lu angered left, betrayed Jin.",
  "s0792": "Jin attacked Zheng, took Fan.",
  "s0793": "Fourteenth year, Liang Shan collapsed."
}
