{
  "s0595": "So first him.'",
  "s0597": "Winter, Jin Hou assembled feudal lords at Wen, wished lead them court Zhou.",
  "s0598": "Strength not able, feared have break away, then sent people speak Zhou Xiang Wang hunted at He Yang.",
  "s0599": "Ren Shen, then led feudal lords court wang at Jian Tu.",
  "s0600": "Kong Qiu read history records to Wen Gong, said 'feudal lords no summon wang', 'wang hunted He Yang', Spring Autumn concealed it.",
  "s0601": "Ding Chou, feudal lords surrounded Xu.",
  "s0602": "Cao Bo minister someone persuaded Jin Hou said: 'Qi Huan Gong united feudal lords country different surname, now lord for assembly extinguish same surname.",
  "s0603": "Cao, Shu Zhen Duo after;",
  "s0604": "Jin, Tang Shu after.",
  "s0605": "United feudal lords extinguish brothers, not ritual.'",
  "s0606": "Jin Hou pleased, restored Cao Bo.",
  "s0607": "Then Jin began made three rows.",
  "s0608": "Xun Lin Fu led middle row, Xian Hu led right row, Xian Mie led left row.",
  "s0609": "Seventh year, Jin Wen Gong, Qin Mu Gong together surrounded Zheng, with its without ritual at Wen Gong perished pass time, and Cheng Pu time Zheng assisted Chu.",
  "s0610": "Surrounded Zheng, wished obtain Shu Zhan.",
  "s0611": "Shu Zhan heard it, suicide.",
  "s0612": "Zheng held Shu Zhan informed Jin.",
  "s0613": "Jin said: 'Must obtain Zheng lord then sweet heart.'",
  "s0614": "Zheng feared, then secretly sent made told Qin Mu Gong said: 'Perish Zheng thick Jin, at Jin obtained, Qin not for profit.",
  "s0615": "Lord why not resolve Zheng, obtain as east road exchange?'",
  "s0616": "Qin Bo pleased, stopped troops.",
  "s0617": "Jin also stopped troops.",
  "s0618": "Ninth year winter, Jin Wen Gong died, son Xiang Gong Huan established.",
  "s0619": "This year Zheng Bo also died.",
  "s0620": "Zheng people or sold their country to Qin, Qin Mu Gong sent troops went attacked Zheng.",
  "s0621": "Twelfth month, Qin troops passed our suburb.",
  "s0622": "Xiang Gong first year spring, Qin army passed Zhou, without ritual, Wang Sun Man criticized it.",
  "s0623": "Troops arrived Hua, Zheng merchant Xian Gao about market at Zhou, met them, with twelve oxen labored Qin army.",
  "s0624": "Qin army alarmed returned, extinguished Hua left.",
  "s0625": "Jin Xian Zhen said: 'Qin Bo not used Jian Shu, returned their crowd hearts, this able attack.'",
  "s0626": "Luan Zhi said: 'Not repaid previous lord grant at Qin, attack it, not able.'",
  "s0627": "Xian Zhen said: 'Qin insulted our orphan, attacked our same surname, what virtue repay?'",
  "s0628": "Then attacked it.",
  "s0629": "Xiang Gong ink mourning clothes.",
  "s0630": "Fourth month, defeated Qin army at Xiao, captured Qin three generals Meng Ming Shi, Xi Qi Shu, Bai Yi Bing returned.",
  "s0631": "Then ink buried Wen Gong.",
  "s0632": "Wen Gong wife Qin woman, told Xiang Gong said: 'Qin wished obtain their three generals execute them.'",
  "s0633": "Gong permitted, sent them.",
  "s0634": "Xian Zhen heard it, told Xiang Gong said: 'Calamity born.'",
  "s0635": "Zhen then pursued Qin generals.",
  "s0636": "Qin generals crossed river, already in boat, knocked head thanked, finally not returned.",
  "s0637": "After three years, Qin indeed sent Meng Ming attacked Jin, repaid Xiao defeat, took Jin Wang returned.",
  "s0638": "Fourth year, Qin Mu Gong greatly raised troops attacked us, crossed river, took Wang Guan, buried Xiao corpses left.",
  "s0639": "Jin feared, not dared exit, then walled defended.",
  "s0640": "Fifth year, Jin attacked Qin, took Xin Cheng, repaid Wang Guan campaign.",
  "s0641": "Sixth year, Zhao Shuai Cheng Zi, Luan Zhen Zi, Jiu Ji Zi Fan, Huo Bo all died.",
  "s0642": "Zhao Dun replaced Zhao Shuai held government.",
  "s0643": "Seventh year eighth month, Xiang Gong died.",
  "s0644": "Crown prince Yi Gao young."
}
