{
  "s0051": "Moreover Bao Xie timber bamboo arrow abundance, comparable to Ba Shu.'",
  "s0052": "The emperor considered it correct, appointed Tang's son Ang as Hanzhong governor, raised several tens of thousands to make Bao Xie road over five hundred li.",
  "s0053": "The road indeed convenient and near, but water turbulent with rocks, cannot transport.",
  "s0054": "Afterward Zhuang Xiong Pi said: 'Lin Jin people wish to dig Luo to irrigate Chong Quan east over ten thousand qing former saline-alkali land.",
  "s0055": "Truly get water, can make per mu ten shi.'",
  "s0056": "Therefore raised troops over ten thousand to dig canal, from Zheng divert Luo water to Shang Yan mountain below.",
  "s0057": "Banks easily collapse, so dug wells, deepest over forty zhang.",
  "s0058": "Often made wells, wells below mutually connected flowing water.",
  "s0059": "Water stopped to block Shang Yan, east to mountain ridge over ten li between.",
  "s0060": "Well canal origin from this began.",
  "s0061": "Digging canal got dragon bones, so named Dragon Head Canal.",
  "s0062": "Made it over ten years, canal considerably connected, still not obtained its richness.",
  "s0063": "From Yellow River breaching Hou Zi after over twenty years, years because repeatedly not bountiful, Liang and Chu lands especially severe.",
  "s0064": "The emperor having feng shan toured sacrificed mountains rivers, the next year, drought, dry feng little rain.",
  "s0065": "The emperor then sent Ji Ren, Guo Chang raise troops several tens of thousands to block Hou Zi breach.",
  "s0066": "Therefore the emperor having performed affairs at Wan Li Sha, then returned personally overseeing breached river, sank white horse jade bi in river, ordered ministers and officials from generals down all carry firewood fill breached river.",
  "s0067": "At this time Dong Jun burned grass, therefore firewood little, used Qi Yuan bamboo below as piles.",
  "s0068": "The emperor having personally overseen river breach, lamented work's failure, made song: 'Hou Zi breaches, what to do?",
  "s0069": "Bright vast the river! Tired exhausted for the river!",
  "s0070": "Exhausted for river, land cannot rest, work endless time, my mountain level.",
  "s0071": "My mountain level, Ju Ye overflows, fish boil oppressive winter day.",
  "s0072": "Long road relaxed, depart normal flow, flood dragons race, just far travel.",
  "s0073": "Return old channel, divine and abundant, not feng shan how know outside!",
  "s0074": "For me tell River Lord why not benevolent, flooding without stopping troubles my people?",
  "s0075": "Gnawing mulberry floating Huai Si full, long not return water gradually slow.'",
  "s0076": "Another says: 'River rushing surging, surging flowing, north crossing filth, dredging difficult.",
  "s0077": "Pluck long rushes sink beautiful jade, River Lord promises firewood not connected.",
  "s0078": "Firewood not connected Wei people guilty, burned desolate alas how control water!",
  "s0079": "Cut forest bamboo piles stone calamities, Xuan Fang blocks ten thousand blessings come.'",
  "s0080": "Therefore finally blocked Hou Zi, built palace above it, named Xuan Fang Palace.",
  "s0081": "Directed Yellow River north two canals, restored Yu's old traces, Liang and Chu lands again peaceful, no water disasters.",
  "s0082": "From this after, project undertakers competed to speak water benefits.",
  "s0083": "Shuofang, Xihe, Hexi, Jiuquan all diverted Yellow River and valley streams to irrigate fields;",
  "s0084": "Guanzhong auxiliary canal, Ling Zhi diverted Du water;",
  "s0085": "Runan, Jiujiang diverted Huai;",
  "s0086": "Donghai diverted Ju Ding;",
  "s0087": "Below Taishan diverted Wen water: all dug canals to irrigate fields, each over ten thousand qing.",
  "s0088": "Other small canals splitting mountains opening roads, cannot be fully spoken.",
  "s0089": "But the famous one is Xuan Fang.",
  "s0090": "Grand Historian says: I south ascended Lu Mountain, observed Yu dredge nine rivers, then reached Kuaiji Great Tang, ascended Gusu, viewed five lakes;",
  "s0091": "East peeked Luo Hui, Da Pei, welcomed Yellow River, traveled Huai, Si, Ji, Luo Lo canals;",
  "s0092": "West gazed Shu's Min Mountain and Li Dui;",
  "s0093": "North from Long Men to Shuofang.",
  "s0094": "Said: How great, water's benefits and harms!",
  "s0095": "I followed carrying firewood blocked Xuan Fang, grieved Hou Zi's poems and made Rivers and Canals book."
}
