{
  "s0050": "Ying Zhong, yang qi response, not use affairs.",
  "s0051": "Its at twelve branches for Hai.",
  "s0052": "Hai, contain.",
  "s0053": "Speak yang qi store at below, thus contain.",
  "s0054": "Guang Mo wind dwells north.",
  "s0055": "Guang Mo, speak yang qi at below, yin cannot yang vast great, thus Guang Mo.",
  "s0056": "East to Xu.",
  "s0057": "Xu, able solid able empty, speak yang qi winter then curl store at xu, winter solstice then one yin below store, one yang above stretch, thus Xu.",
  "s0058": "East to Xu Nu.",
  "s0059": "Speak ten thousand things change their place, yin yang qi not yet separate, still mutually like xu like, thus Xu Nu.",
  "s0060": "Eleventh month, pitch middle Huang Zhong.",
  "s0061": "Huang Zhong, yang qi follow yellow springs exit.",
  "s0062": "Its at twelve branches for Zi.",
  "s0063": "Zi, nourish;",
  "s0064": "Nourish, speak ten thousand things nourish at below.",
  "s0065": "Its at ten mothers for Ren Gui.",
  "s0066": "Ren speak, Ren, speak yang qi Ren nourish ten thousand things at below.",
  "s0067": "Gui speak, Kui, speak ten thousand things can Kui measure, thus Gui.",
  "s0068": "East to Qian Niu.",
  "s0069": "Qian Niu, speak yang qi qian lead ten thousand things exit them.",
  "s0070": "Niu, cover, speak earth though freeze, able cover born.",
  "s0071": "Niu, plow plant sow ten thousand things.",
  "s0072": "East to Jian Xing.",
  "s0073": "Jian Xing, jian various born.",
  "s0074": "Twelfth month, pitch middle Da Lu.",
  "s0075": "Da Lu.",
  "s0076": "Its at twelve branches for Chou.",
  "s0077": "Tiao wind dwells northeast, governs exit ten thousand things.",
  "s0078": "Tiao speak tiao govern ten thousand things exit them, thus Tiao wind.",
  "s0079": "South to Ji.",
  "s0080": "Ji, speak ten thousand things root ji, thus Ji.",
  "s0081": "First month, pitch middle Tai Cu.",
  "s0082": "Tai Cu, speak ten thousand things cu born, thus Tai Cu.",
  "s0083": "Its at twelve branches for Yin.",
  "s0084": "Yin speak ten thousand things begin born yong thus, thus Yin.",
  "s0085": "South to Wei, speak ten thousand things begin born like wei.",
  "s0086": "South to Xin, speak ten thousand things begin born have hua xin.",
  "s0087": "South to Fang.",
  "s0088": "Fang, speak ten thousand things door gate, reach door then exit.",
  "s0089": "Second month, pitch middle Jia Zhong.",
  "s0090": "Jia Zhong, speak yin yang mutually jia mix.",
  "s0091": "Its at twelve branches for Mao.",
  "s0092": "Mao speak, Mao, speak ten thousand things mao.",
  "s0093": "Ming Shu wind dwells southeast corner, governs long nourish ten thousand things.",
  "s0094": "Today Ming Shu.",
  "s0095": "South to Di.",
  "s0096": "Di, speak ten thousand things all arrive.",
  "s0097": "South to Kang.",
  "s0098": "Kang, speak ten thousand things kang appear.",
  "s0199": "One yue four hundred eight zhu, two sixteen zhu, three one hundred twenty zhu, four five hundred seventy six zhu, five three thousand four hundred fifty six zhu, six twenty five thousand seven hundred seventy six zhu.",
  "s0200": "Da Lu: length seven cun five fen three two, diameter two fen nine li seven hao, circumference nine fen, weight one hundred eighty four zhu.",
  "s0201": "Tai Cu: length seven cun ten fen two, diameter two fen eight li six hao, circumference eight fen eight li, weight one hundred sixty eight zhu.",
  "s0202": "Jia Zhong: length six cun seven fen three one, diameter two fen seven li four hao, circumference eight fen six li, weight one hundred fifty two zhu.",
  "s0203": "Gu Xi: length six cun ten fen four, diameter two fen six li two hao, circumference eight fen four li, weight one hundred thirty six zhu.",
  "s0204": "Zhong Lu: length five cun nine fen three two, diameter two fen five li, circumference eight fen two li, weight one hundred twenty zhu.",
  "s0205": "Rui Bin: length five cun six fen three two, diameter two fen four li, circumference eight fen, weight one hundred eight zhu.",
  "s0206": "Lin Zhong: length five cun ten fen four, diameter two fen three li, circumference seven fen eight li, weight ninety six zhu.",
  "s0207": "Yi Ze: length five cun four fen three two, diameter two fen two li, circumference seven fen six li, weight eighty four zhu.",
  "s0208": "Nan Lu: length four cun ten fen eight, diameter two fen one li, circumference seven fen four li, weight seventy two zhu.",
  "s0209": "Wu She: length four cun four fen three two, diameter two fen, circumference seven fen two li, weight sixty zhu.",
  "s0210": "Ying Zhong: length four cun two fen three two, diameter one fen nine li, circumference seven fen, weight fifty four zhu.",
  "s0211": "Bell large its sound large sparse, bell small its sound small dense.",
  "s0212": "Each according its bell diameter inspect with stopped fen make it.",
  "s0213": "Huang Zhong, Da Lu, Tai Cu, Jia Zhong, Gu Xi, Zhong Lu, Rui Bin as upper nine, Yi Ze, Nan Lu, Wu She, Ying Zhong as lower nine.",
  "s0214": "Upper nine with lower nine all empty number, empty number, accumulate solid number as denominator, with upper nine lower nine as method.",
  "s0215": "Thus upper nine, bell already upper born, lower nine, bell already lower born.",
  "s0216": "Bell already upper born clear double half, bell already lower born clear not half.",
  "s0217": "Twenty four qi, bell pitch tune.",
  "s0218": "Twenty four qi, twenty four pitches.",
  "s0219": "Pitches divide twelve, even qi divide twenty four.",
  "s0220": "Twenty four pitches get one jun.",
  "s0221": "Twenty four pitches zhun, zhun, thus even tune qi.",
  "s0222": "Jun, thus level.",
  "s0223": "Zhun, thus weigh.",
  "s0224": "Weigh thus level light heavy.",
  "s0225": "Zhun thus even tune.",
  "s0226": "Jun thus level govern qi."
}
