{
  "s0001": "The Chu family's ancestral origins trace back to Emperor Zhuanxu Gao Yang.",
  "s0002": "Gao Yang was the grandson of the Yellow Emperor and son of Chang Yi.",
  "s0003": "Gao Yang fathered Chen, who fathered Juan Zhang, who fathered Chong Li.",
  "s0004": "Chong Li served as Minister of Fire under Emperor Ku Gao Xin and achieved great merit, being able to illuminate and unite the whole world. Emperor Ku named him Zhu Rong.",
  "s0005": "When the Gong Gong clan rebelled, Emperor Ku ordered Chong Li to suppress them, but he did not completely succeed.",
  "s0006": "The emperor then executed Chong Li on the day Geng Yin, and appointed Chong Li's younger brother Wu Hui as his successor to serve as Minister of Fire, becoming Zhu Rong.",
  "s0007": "Wu Hui fathered Lu Zhong.",
  "s0008": "Lu Zhong fathered six sons, who were born by splitting open his body.",
  "s0009": "The eldest was named Kun Wu;",
  "s0010": "the second Can Hu;",
  "s0011": "the third Peng Zu;",
  "s0012": "the fourth Hui Ren;",
  "s0013": "the fifth Cao Xing;",
  "s0014": "the sixth Ji Lian of the Mi surname, from whom Chu descended.",
  "s0015": "The Kun Wu clan served as marquises during the Xia dynasty, but King Jie destroyed them during the time of Tang.",
  "s0016": "The Peng Zu clan served as marquises during the Yin dynasty, but were destroyed at the end of the Yin period.",
  "s0017": "Ji Lian fathered Fu Ju, who fathered Xue Xiong.",
  "s0018": "Afterward their line declined, sometimes residing among the Chinese, sometimes among the barbarians, so their generations cannot be clearly traced.",
  "s0019": "During the time of King Wen of Zhou, Ji Lian's descendant was named Yu Xiong.",
  "s0020": "Yu Xiong served King Wen but died young.",
  "s0021": "His son was named Xiong Li.",
  "s0022": "Xiong Li fathered Xiong Kuang, who fathered Xiong Xi.",
  "s0023": "During the time of King Cheng of Zhou, because of the meritorious service of Wen and Wu, Xiong Xi was enfeoffed in Chu among the barbarians, given territory of the rank of zi and nan, with the surname Mi, and resided in Dan Yang.",
  "s0024": "The Chu lord Xiong Xi, along with Duke Bo Qin of Lu, Zi Mu of Wei Kang Shu, Hou Xie of Jin, and Tai Zi Lü Ji of Qi, all served King Cheng.",
  "s0025": "Xiong Xi fathered Xiong Ai, who fathered Xiong Dan, who fathered Xiong Sheng.",
  "s0026": "Xiong Sheng made his younger brother Xiong Yang his successor.",
  "s0027": "Xiong Yang fathered Xiong Qu.",
  "s0028": "Xiong Qu lived for three years after fathering a son.",
  "s0029": "During the time of King Yi of Zhou, the royal house declined, and the feudal lords sometimes failed to attend court and attacked each other.",
  "s0030": "Xiong Qu greatly won the favor of the people between the Jiang and Han rivers, so he raised troops to attack Yong, Yang Wei, reaching as far as E.",
  "s0031": "Xiong Qu said: 'I am a barbarian, so I do not use the titles and posthumous names of China.'",
  "s0032": "Therefore he established his eldest son Kang as King of Ju Dian, his middle son Hong as King of E, and his youngest son Zhi Ci as King of Yue Zhang, all within the Chu barbarian lands along the Jiang River.",
  "s0033": "When King Li of Zhou became tyrannical, Xiong Qu feared he would attack Chu, so he also removed their royal titles.",
  "s0034": "Later he became Xiong Wu Kang, but Wu Kang died young.",
  "s0035": "Xiong Qu died, and his son Xiong Zhi Hong succeeded him.",
  "s0036": "Zhi Hong died, and his younger brother assassinated him and took the throne, calling himself Xiong Yan.",
  "s0037": "Xiong Yan fathered Xiong Yong.",
  "s0038": "In Xiong Yong's sixth year, the Zhou people rebelled, attacking King Li, who fled to Zhi.",
  "s0039": "In Xiong Yong's tenth year, he died, and his younger brother Xiong Yan succeeded him.",
  "s0040": "In Xiong Yan's tenth year, he died.",
  "s0041": "He had four sons: the eldest Bo Shuang, the second Zhong Xue, the third Shu Kan, and the youngest Ji Xun.",
  "s0042": "When Xiong Yan died, the eldest son Bo Shuang succeeded him, becoming Xiong Shuang.",
  "s0043": "In Xiong Shuang's first year, King Xuan of Zhou first ascended the throne.",
  "s0044": "In Xiong Shuang's sixth year, he died, and the three younger brothers contended for the throne.",
  "s0045": "Zhong Xue died;",
  "s0046": "Shu Kan fled and took refuge in Pu;",
  "s0047": "and the youngest Ji Xun succeeded, becoming Xiong Xun.",
  "s0048": "In Xiong Xun's sixteenth year, Duke Huan of Zheng was first enfeoffed in Zheng.",
  "s0049": "In the twenty-second year, Xiong Xun died, and his son Xiong E succeeded him.",
  "s0050": "In Xiong E's first year, Duke Zhuang of Zheng died.",
  "s0051": "In the second year, Xiong E died, and his younger brother Xiong Xue succeeded him.",
  "s0052": "In Xiong Xue's first year, King You of Zhou was in power.",
  "s0053": "In the second year, the Quanrong attacked and killed King You, and the Zhou moved eastward.",
  "s0054": "In the third year, Xiong Xue died, and his son Xiong Kan succeeded him.",
  "s0055": "In Xiong Kan's first year, Duke Xiang of Qin died.",
  "s0056": "In the fifth year, Xiong Kan died, and his son Xiong Yuan succeeded him.",
  "s0057": "In Xiong Yuan's first year, Duke Wen of Qin died.",
  "s0058": "In the tenth year, Xiong Yuan died, and his son Xiong Qu succeeded him.",
  "s0059": "In Xiong Qu's first year, Duke Mu of Qin died.",
  "s0060": "In the tenth year, Xiong Qu died, and his son Xiong Zi succeeded him.",
  "s0061": "In Xiong Zi's first year, Duke Kang of Qin died.",
  "s0062": "In the twelfth year, Xiong Zi died, and his son Xiong Wei succeeded him.",
  "s0063": "In Xiong Wei's first year, Duke Gong of Qin died.",
  "s0064": "In the twelfth year, Xiong Wei died, and his son Xiong Ao succeeded him.",
  "s0065": "In Xiong Ao's first year, Duke Jing of Qin died.",
  "s0066": "In the thirteenth year, Xiong Ao died, and his son Xiong Xi succeeded him.",
  "s0067": "In Xiong Xi's first year, Duke Ai of Qin died.",
  "s0068": "In the fourth year, Xiong Xi died, and his son Xiong Qumi succeeded him.",
  "s0069": "In Xiong Qumi's first year, Duke Hui of Qin died.",
  "s0070": "In the eleventh year, Xiong Qumi died, and his son Xiong Shang succeeded him.",
  "s0071": "In Xiong Shang's first year, Duke Xiao of Qin died.",
  "s0072": "In the twelfth year, Xiong Shang died, and his son Xiong Yan succeeded him.",
  "s0073": "In Xiong Yan's first year, Duke Hui Wen of Qin died.",
  "s0074": "In the fourth year, Xiong Yan died, and his son Xiong Yong succeeded him.",
  "s0075": "In Xiong Yong's first year, Duke Wu of Qin died.",
  "s0076": "In the ninth year, Xiong Yong died, and his son Xiong Shan succeeded him.",
  "s0077": "In Xiong Shan's first year, Duke Zhao of Qin died.",
  "s0078": "In the twelfth year, Xiong Shan died, and his son Xiong Zhen succeeded him.",
  "s0079": "In Xiong Zhen's first year, Duke Xiao of Qin died.",
  "s0080": "In the eleventh year, Xiong Zhen died, and his son Xiong Xu succeeded him.",
  "s0081": "In Xiong Xu's first year, Duke Hui of Qin died.",
  "s0082": "In the twelfth year, Xiong Xu died, and his son Xiong Xuan succeeded him.",
  "s0083": "In Xiong Xuan's first year, Duke Ling of Qin died.",
  "s0084": "In the ninth year, Xiong Xuan died, and his son Xiong Liang succeeded him.",
  "s0085": "In Xiong Liang's first year, Duke Jian of Qin died.",
  "s0086": "In the fourth year, Xiong Liang died, and his son Xiong Zi succeeded him.",
  "s0087": "In Xiong Zi's first year, Duke Hui of Qin died.",
  "s0088": "In the fourteenth year, Xiong Zi died, and his son Xiong Wei succeeded him.",
  "s0089": "In Xiong Wei's first year, Duke Ai of Qin died.",
  "s0090": "In the seventeenth year, Xiong Wei died, and his son Xiong Dang succeeded him.",
  "s0091": "In Xiong Dang's first year, Duke Xian of Qin died.",
  "s0092": "In the fourth year, Xiong Dang died, and his son Xiong Kang succeeded him.",
  "s0093": "In Xiong Kang's first year, Duke Zhao of Qin died.",
  "s0094": "In the sixth year, Xiong Kang died, and his son Xiong Yuan succeeded him.",
  "s0095": "In Xiong Yuan's first year, Duke Hui Wen of Qin died.",
  "s0096": "In the thirteenth year, Xiong Yuan died, and his son Xiong Zhao succeeded him.",
  "s0097": "In Xiong Zhao's first year, Duke Wu of Qin died.",
  "s0098": "In the seventeenth year, Xiong Zhao died, and his son Xiong Heng succeeded him.",
  "s0099": "In Xiong Heng's first year, Duke Zhao of Qin died.",
  "s0100": "In the thirtieth year, Xiong Heng died, and his son Xiong Shang succeeded him."
}