{
  "s0150": "Xi grown, married for him at Song.",
  "s0151": "Song woman arrived good, Hui Gong took her self married.",
  "s0152": "Gave birth son Yun.",
  "s0153": "Promoted Song woman as wife, made Yun crown prince.",
  "s0154": "To Hui Gong died, for Yun young reason, Lu people together ordered Xi act government, not speak ascended position.",
  "s0155": "Yin Gong five years, observed fishing at Tang.",
  "s0156": "Eight years, with Zheng exchanged heavenly son's Tai Shan yi Bang and Xu field, gentlemen criticized it.",
  "s0157": "Eleven years winter, Gong Zi Hui flattered told Yin Gong said: 'Hundred clans convenient lord, lord his then establish.",
  "s0158": "I request for lord kill Zi Yun, lord make me chancellor.'",
  "s0159": "Yin Gong said: 'Have previous lord command.",
  "s0160": "I for Yun young, so act replace.",
  "s0161": "Now Yun grown, I about manage rabbit fur place old there, give Zi Yun government.'",
  "s0162": "Hui feared Zi Yun heard return execute him, then returned slandered Yin Gong to Zi Yun said: 'Yin Gong wishes then establish, leave you, you his plan it.",
  "s0163": "Request for you kill Yin Gong.'",
  "s0164": "Zi Yun permitted.",
  "s0165": "Eleven month, Yin Gong sacrificed Zhong Wu, fasted at She Pu, lodged at Wei Shi.",
  "s0166": "Hui made person kill Yin Gong at Wei Shi, established Zi Yun as lord, this was Huan Gong.",
  "s0167": "Huan Gong first year, Zheng with jade exchanged heavenly son's Xu field.",
  "s0168": "Second year, with Song's bribe tripod entered great temple, gentlemen criticized it.",
  "s0169": "Third year, made Hui welcome wife from Qi as wife.",
  "s0170": "Six years, wife gave birth son, with Huan Gong same day, so named Tong.",
  "s0171": "Tong grown, became crown prince.",
  "s0172": "Sixteen years, assembled at Cao, attacked Zheng, entered Li Gong.",
  "s0173": "Eighteen years spring, duke about have travel, then with wife went to Qi.",
  "s0174": "Shen Xu advised stop, duke not listened, then went to Qi.",
  "s0175": "Qi Xiang Gong communicated Huan Gong wife.",
  "s0176": "Duke angered wife, wife informed Qi Hou.",
  "s0177": "Summer fourth month Bing Zi, Qi Xiang Gong feasted duke, duke drunk, made Gong Zi Peng Sheng embrace Lu Huan Gong, because ordered Peng Sheng fold his ribs, duke died in carriage.",
  "s0178": "Lu people informed Qi said: 'Our lord feared lord's awe, not dare peaceful reside, came repair good rites.",
  "s0179": "Rites complete not return, nowhere return blame, please obtain Peng Sheng remove shame at feudal lords.'",
  "s0180": "Qi people killed Peng Sheng to please Lu.",
  "s0181": "Established crown prince Tong, this was Zhuang Gong.",
  "s0182": "Zhuang Gong mother wife because stayed Qi, not dared return Lu.",
  "s0183": "Zhuang Gong five years winter, attacked Wei, entered Wei Hui Gong.",
  "s0184": "Eight years, Qi gong zi Jiu came flee.",
  "s0185": "Nine years, Lu wished enter Zi Jiu to Qi, after Huan Gong, Huan Gong sent troops attacked Lu, Lu urgent, killed Zi Jiu.",
  "s0186": "Zhao Hu died.",
  "s0187": "Qi informed Lu living deliver Guan Zhong.",
  "s0188": "Lu person Shi Bo said: 'Qi wishes obtain Guan Zhong, not kill him, will use him, use him then become Lu trouble.",
  "s0189": "Not like kill, give his corpse to them.'",
  "s0180": "Zhuang Gong not listened, then imprisoned Guan Zhong gave Qi.",
  "s0191": "Qi people made Guan Zhong chancellor.",
  "s0192": "Thirteenth year, Lu Zhuang Gong with Cao Mei assembled Qi Huan Gong at Ke, Cao Mei kidnapped Qi Huan Gong, sought Lu invaded land, already allied released Huan Gong.",
  "s0193": "Huan Gong wished break agreement, Guan Zhong advised, finally returned Lu invaded land.",
  "s0194": "Fifteenth year, Qi Huan Gong began hegemon.",
  "s0195": "Twenty-three years, Zhuang Gong went to Qi observed altar.",
  "s0196": "Thirty-two years, initially, Zhuang Gong built tower overlooked Dang Shi, saw Meng woman, pleased loved her, permitted establish as wife, cut arm allied.",
  "s0197": "Meng woman gave birth son Ban.",
  "s0198": "Ban grown, pleased Liang Shi woman, went observe."
}
