{
  "s363": "Son of King Dao Hui of Qi, Marquis.",
  "s366": "Twelve. Fourth year fifth month jia yin, Marquis Liu Ang first year. Sixteenth year, Marquis Ang became King of Jiaoxi, state abolished.",
  "s369": "Wu Cheng.",
  "s370": "Son of King Dao Hui of Qi, Marquis.",
  "s373": "Twelve. Fourth year fifth month jia yin, Marquis Liu Xian first year. Sixteenth year, Marquis Xian became King of Zichuan, state abolished.",
  "s376": "Bai Shi.",
  "s377": "Son of King Dao Hui of Qi, Marquis.",
  "s380": "Twelve. Fourth year fifth month jia yin, Marquis Liu Xiong Qu first year. Sixteenth year, Marquis Xiong Qu became King of Jiaodong, state abolished.",
  "s383": "Bo Ling.",
  "s384": "As Marquis of Yangling Jun.",
  "s387": "Five. Seventh year third month jia yin, Marquis Kang Wei Si first year. Twelfth year, Marquis Kang Wei Si died, no posterity, state abolished.",
  "s390": "Nan Ling.",
  "s391": "As Marquis of Xinping Jun.",
  "s394": "One. Seventh year third month bing yin, Marquis Qi first year. During Emperor Wen's time convicted of stepfather's crime, title reduced, became Guan Nei Hou.",
  "s397": "Fu Ling.",
  "s398": "As son of Prince Li of Huainan, Marquis.",
  "s401": "Eight. Eighth year fifth month bing wu, Marquis Liu An first year. Sixteenth year, Marquis An became King of Huainan, state abolished.",
  "s404": "An Yang.",
  "s405": "As son of Prince Li of Huainan, Marquis.",
  "s408": "Eight. Eighth year fifth month bing wu, Marquis Bo first year. Sixteenth year, Marquis Bo became King of Hengshan, state abolished.",
  "s411": "Yang Zhou",
  "s412": "As son of Prince Li of Huainan, Marquis.",
  "s415": "Eight. Eighth year fifth month bing wu, Marquis Liu Ci first year. Sixteenth year, Marquis Ci became King of Lujiang, state abolished.",
  "s418": "Dong Cheng.",
  "s419": "As son of Prince Li of Huainan, Marquis.",
  "s422": "Seven. Eighth year fifth month bing wu, Marquis Ai Liu Liang first year. Fifteenth year, Marquis Liang died, no posterity, state abolished.",
  "s425": "Li.",
  "s426": "As son of Prime Minister of Qi Zhao Ping, Marquis, one thousand four hundred ten households.",
  "s429": "Eleven. Tenth year fourth month gui chou, Marquis Qing Zhao Nu first year. Three. Later fifth year, Marquis Ze first year.",
  "s430": "Sixteen",
  "s431": "Sixteen. Yuanshuo fifth year, Marquis Yan first year. Nineteen. Yuanfeng sixth year, Marquis Yan convicted of not going out to hold horses, executed, state abolished.",
  "s432": "Ping.",
  "s433": "As Grand Administrator of Beidi Sun Ang, Xiongnu entered Beidi, fought strenuously and died in service, son Marquis.",
  "s436": "Ten. Fourteenth year third month ding si, Marquis Sun Shan first year.",
  "s437": "Two. Former third year, Marquis Shan plotted rebellion, state abolished.",
  "s439": "Gong Gao.",
  "s440": "As Xiongnu Prime Minister surrendered, illegitimate son of former King Xin of Han, Marquis, one thousand two hundred thirty-seven households.",
  "s443": "Eight. Sixteenth year sixth month bing zi, Marquis Zhuang Han Kui Dang first year.",
  "s444": "Sixteen. Former first year, Marquis Ze first year.",
  "s445": "Sixteen. Yuanshuo fifth year, Marquis Ze died, no posterity, state abolished.",
  "s446": "Xiang Cheng.",
  "s447": "As Xiongnu Prime Minister surrendered, Marquis, grandson of former King Xin of Han, one thousand four hundred thirty-two households.",
  "s450": "Seven. Sixteenth year sixth month bing zi, Marquis Ai Han Ying first year. One. Later seventh year, Marquis Ze Zhi first year.",
  "s451": "Sixteen",
  "s452": "Fifteen. Yuanshuo fourth year, Marquis Ze Zhi convicted of feigning illness and not following orders, disrespectful, state abolished.",
  "s453": "Gu An.",
  "s454": "Emperor Wen first year, selected Governor of Huaiyang who followed Gaozu entering Han with merit, Marquis, fief five hundred households; used as Chancellor, Marquis, one thousand seven hundred twelve households.",
  "s457": "Five. Later third year fourth month ding si, Marquis Jie Shen Tu Jia first year.",
  "s458": "Two. Fourteen. Former third year, Marquis Gong Mie first year.",
  "s459": "Nineteen. Yuanshou second year, Marquis Qing An Yu first year. Five. Yuanding first year, Marquis Yu convicted of crimes as Grand Administrator of Jiu Jiang, state abolished."
}
