{
  "s0051": "Seventeen levels, altogether worth over thirty thousand jin.",
  "s0052": "Those who buy martial merit nobility official heads may try to supplement clerks, first removed;",
  "s0053": "thousand man like five great men;",
  "s0054": "those with crimes again reduce two grades;",
  "s0055": "nobility reaches music minister: to display military merit.'",
  "s0056": "Military merit much used skipping grades, great ones enfeoffed as marquises ministers grand masters, small ones gentlemen officials.",
  "s0057": "Official path mixed and many branches, then official positions wasted and abolished.",
  "s0058": "Since Gongsun Hong used Spring and Autumn principles to bind subjects becoming Han chancellor, Zhang Tang used harsh writing to decide cases as court judge, then the knowing law arose, and blocking hindering slandering thorough investigation prisons used.",
  "s0059": "Next year, Huainan, Hengshan, Jiangdu kings rebellion traces appeared, ministers and nobles sought origins to govern them, exhausted their parties and accomplices, those sentenced to death several tens of thousands, senior officials increasingly cruel urgent and laws clear discerning.",
  "s0060": "During this time, they honored upright, good, worthy, excellent literature scholars, some reaching ministers and grand masters.",
  "s0061": "Gongsun Hong as Han chancellor, cloth quilt, did not eat repeated flavors, was first in the realm.",
  "s0062": "But no benefit to customs, gradually moved toward profit and benefit.",
  "s0063": "Next year, cavalry general again went out to attack Hu, captured heads forty thousand.",
  "s0064": "That autumn, Hunye King led tens of thousands to surrender, Han sent two thousand carriages to welcome them.",
  "s0065": "When arrived, received rewards, granted to meritorious soldiers.",
  "s0066": "This year expenses altogether over one hundred vast millions.",
  "s0067": "Initially, previously over ten years ago Yellow River breached Guan, Liang Chu lands already repeatedly troubled, while Yellow River border commanderies built dikes to block river, frequently breached and ruined, expenses countless.",
  "s0068": "Afterward Fan Xi wished to save Dizhu transport, dug Fen, Yellow River canal for irrigation fields, workers tens of thousands;",
  "s0069": "Zheng Dang Shi for Wei transport canal winding far, chiseled straight canal from Chang'an to Huayin, workers tens of thousands;",
  "s0070": "Shuofang also dug canal, workers tens of thousands: each took two three periods, work not completed, expenses also each vast millions tens.",
  "s0071": "Emperor for attacking Hu, abundantly raised horses, horses coming to eat in Chang'an tens of thousands, soldiers leading holding insufficient in Guanzhong, then transferred nearby commanderies.",
  "s0072": "Hu surrenders all clothed fed by county officials, county officials not sufficient, emperor then reduced meals, released carriage horses, took imperial storehouse forbidden treasures to support them.",
  "s0073": "Next year, Shandong suffered water disasters, people many hungry lacking, emperor sent envoys to empty commandery kingdom granaries to relieve poor people.",
  "s0074": "Still insufficient, also recruited rich powerful people to lend to each other.",
  "s0075": "Still could not mutually save, then moved poor people to passes west, and filled Shuofang south new Qinzhong, seventy plus thousand mouths, clothing food all dependent on county officials.",
  "s0076": "Several years, loaned property, envoys divided areas to protect them, official carriages mutually visible.",
  "s0077": "Expenses counted in hundreds of millions, countless.",
  "s0078": "Therefore county officials greatly empty.",
  "s0079": "Rich merchants and great traders sometimes hoarded wealth to exploit poor, circulated hundreds of carriages, abandoned residences in cities, enfeoffed lords all bowed heads dependent.",
  "s0080": "Smelting casting boiling salt, wealth sometimes accumulated ten thousand jin, but not aided state's emergencies, common people heavily troubled.",
  "s0081": "Therefore emperor with ministers discussed, change money make currency to support expenses, and break floating extravagant monopoly followers.",
  "s0082": "At this time forbidden park had white deer and lesser treasury had much silver tin.",
  "s0083": "Since Emperor Wen recast four zhu money, to this year over forty years, from Jian Yuan since, used little, county officials often took many copper mountains to cast money, people also secretly stole cast money, countless.",
  "s0084": "Money increasingly many and light, goods increasingly few and expensive.",
  "s0085": "Officials said: 'Ancient leather currency, feudal lords used for visits and offerings.",
  "s0086": "Gold has three grades, yellow gold upper, white gold middle, red gold lower.",
  "s0087": "Now half liang money law heavy four zhu, but evil sometimes steal grind money inside take filings, money increasingly light thin and goods expensive, then distant places using currency troublesome expensive not saving.'",
  "s0088": "Therefore used white deer skin one square foot, edged with algae embroidery, as leather currency, worth forty thousand.",
  "s0089": "Kings marquises imperial clan morning audiences visit offerings, must use leather currency present jade, then could proceed.",
  "s0090": "Also made silver tin as white gold.",
  "s0091": "Considering heaven use nothing like dragon, earth use nothing like horse, person use nothing like turtle, therefore white gold three grades: first said heavy eight liang, round it, its pattern dragon, named 'white selection', worth three thousand;",
  "s0092": "second with weight somewhat small, square it, its pattern horse, worth five hundred;",
  "s0093": "third again small, oval it, its pattern turtle, worth three hundred.",
  "s0094": "Ordered county officials melt half liang money, recast three zhu money, inscription like its weight.",
  "s0095": "Stealing casting various gold money crimes all death, but officials people's stealing casting white gold countless.",
  "s0096": "Therefore appointed Dong Guo Xian Yang, Kong Jin as great agronomist vice, overseeing salt iron affairs;",
  "s0097": "Sang Hong Yang with calculations managed affairs, attendant.",
  "s0098": "Xian Yang, Qi's great salt boiler, Kong Jin, Nanyang great smelter, both achieved wealth accumulated thousand jin, therefore Zheng Dang Shi recommended them.",
  "s0099": "Hong Yang, Luoyang merchant son, with mental calculation, age thirteen attendant."
}
