{
  "s0081": "He gave birth to Duke Wen.",
  "s0082": "Duke Wen of Qin first year, resided at Xichui Palace.",
  "s0083": "Third year, Duke Wen led 700 troops to hunt eastward.",
  "s0084": "Fourth year, arrived at the confluence of Qian and Wei.",
  "s0085": "He said: 'In ancient times, Zhou enfeoffed our ancestor Qin Ying here; later he finally became a lord.'",
  "s0086": "He divined for residence; the omen said auspicious, so he built a city there.",
  "s0087": "Tenth year, first established the Fu altar, using three sacrificial animals.",
  "s0088": "Thirteenth year, first had historians to record events; many people became civilized.",
  "s0089": "Sixteenth year, Duke Wen led troops to attack the Rong; the Rong were defeated and fled.",
  "s0090": "Therefore Duke Wen gathered the remaining Zhou people and possessed them; territory reached Qi, east of Qi he presented to Zhou.",
  "s0091": "Nineteenth year, obtained the Chen treasure.",
  "s0092": "Twenty年, Duke Wen died, his son Duke Xiang ascended.",
  "s0093": "Duke Xiang of Qin first year, the Qin people moved to Qinyong.",
  "s0094": "Second year, began to build temples and palaces.",
  "s0095": "Third year, Duke Xiang died, his son Duke Ning ascended.",
  "s0096": "Duke Ning of Qin first year, the Rong attacked Qin.",
  "s0097": "Second year, Duke Ning died, his son Duke Wu ascended.",
  "s0098": "Duke Wu of Qin first year, attacked the Pengxi Rong.",
  "s0099": "Second year, established the Peng altar.",
  "s0100": "Third year, attacked the Daliang Rong.",
  "s0101": "Fourth year, Duke Wu died, his son Duke De ascended.",
  "s0102": "Duke De of Qin first year, the Rong attacked Qin.",
  "s0103": "Second year, began to use coins.",
  "s0104": "Third year, Duke De died, his son Duke Xuan ascended.",
  "s0105": "Duke Xuan of Qin first year, attacked the Jin Rong.",
  "s0106": "Second year, established the Jing altar.",
  "s0107": "Third year, Duke Xuan died, his son Duke Cheng ascended.",
  "s0108": "Duke Cheng of Qin first year, established the Yong altar.",
  "s0109": "Second year, Duke Cheng died, his son Duke Mu ascended.",
  "s0110": "Duke Mu of Qin first year, attacked the Mian Rong.",
  "s0111": "Second year, established the Zhao altar.",
  "s0112": "Third year, attacked the Jin.",
  "s0113": "Fourth year, attacked the Rui Rong.",
  "s0114": "Fifth year, attacked the Xi Rong.",
  "s0115": "Sixth year, attacked the Qian Rong.",
  "s0116": "Seventh year, established the Wu altar.",
  "s0117": "Eighth year, attacked the Quanrong.",
  "s0118": "Ninth year, attacked the Quanrong.",
  "s0119": "Tenth year, Duke Mu died, his son Duke Kang ascended.",
  "s0120": "Duke Kang of Qin first year, attacked the Xi Qiang."
}

