{
  "s76": "Son of Prince Yi of Jiangdu.",
  "s78": "Six. First year twelfth month jia chen, Marquis Ai Gan first year.",
  "s79": "Yuanshou first year, Marquis Gan died, no posterity, state abolished.",
  "s83": "Xu Tai.",
  "s84": "Son of Prince Yi of Jiangdu.",
  "s86": "Six. First year twelfth month jia chen, Marquis Liu Xiang Zhi first year.",
  "s87": "Six",
  "s88": "Four. Fifth year, Marquis Xiang Zhi convicted of tribute gold, state abolished.",
  "s91": "Hu Shu.",
  "s92": "Son of Prince Yi of Jiangdu.",
  "s94": "Six. First year first month ding mao, Marquis Qing Liu Xu first year.",
  "s95": "Six",
  "s96": "Four. Two. Fifth year, current Marquis Sheng first year.",
  "s97": "Six",
  "s98": "Four",
  "s99": "Zhi Yang.",
  "s100": "Son of Prince Yi of Jiangdu.",
  "s102": "Six. First year first month ding mao, Marquis Zhong Liu Lian first year.",
  "s103": "Six",
  "s104": "Three. Fourth year, Marquis Zhong Lian died, no posterity, state abolished.",
  "s107": "Sui Ling.",
  "s108": "Son of Prince Yi of Jiangdu.",
  "s110": "Six. First year first month ding mao, Marquis Liu Ding Guo first year.",
  "s111": "Six",
  "s112": "Four. Fifth year, Marquis Ding Guo convicted of tribute gold, state abolished.",
  "s115": "Long Qiu.",
  "s116": "Son of Prince Yi of Jiangdu.",
  "s118": "Five. Second year fifth month yi si, Marquis Liu Dai first year.",
  "s119": "Six",
  "s120": "Four. Fifth year, Marquis Dai convicted of tribute gold, state abolished.",
  "s123": "Zhang Liang.",
  "s124": "Son of Prince Yi of Jiangdu.",
  "s126": "Five. Second year fifth month yi si, Marquis Ai Liu Ren first year.",
  "s127": "Six",
  "s128": "Two. Four. Third year, current Marquis Shun first year.",
  "s129": "Six",
  "s130": "Four",
  "s131": "Ju.",
  "s132": "Son of Prince Yi of Zichuan.",
  "s134": "Five. Second year fifth month yi si, Marquis Yuan Liu Cuo first year.",
  "s135": "Six",
  "s136": "One. Five. Second year, Marquis Xiao Guang Chang first year.",
  "s137": "Six",
  "s138": "Four",
  "s139": "Rang.",
  "s140": "Son of Prince Yi of Zichuan.",
  "s142": "Five. Second year fifth month yi si, Marquis Yi Liu Gao Sui first year.",
  "s143": "Six",
  "s144": "Six. First year, current Marquis Yan first year."
}
