{
  "s0101": "Bo Qin ascended position after, had Guan, Cai etc. rebel, Huai Yi, Xu Rong also together rose rebel.",
  "s0102": "Then Bo Qin led troops attacked them at Xi, made Xi oath, said: 'Array your armor weapons, none dare not good.",
  "s0103": "None dare injure pregnant.",
  "s0104": "Horse oxen their wind, minister concubine fled, not dare cross pursue, respectfully return them.",
  "s0105": "None dare plunder steal, cross wall fences.",
  "s0106": "Lu people three suburbs three tunnels, prepare your fodder grain, dry provisions, stakes beams, none dare not reach.",
  "s0107": "I Jia Xu built attacked Xu Rong, none dare not reach, have great punishment.'",
  "s0108": "Made this Xi oath, then pacified Xu Rong, settled Lu.",
  "s0109": "Lu Gong Bo Qin died, son Kao Gong Qiu established.",
  "s0110": "Kao Gong four years died, established younger brother Xi, this called Yang Gong.",
  "s0111": "Yang Gong built Mao Que gate.",
  "s0112": "Six years died, son You Gong Zai established.",
  "s0113": "You Gong fourteen years.",
  "s0114": "You Gong younger brother Fei killed You Gong self established, this was Wei Gong.",
  "s0115": "Wei Gong fifty years died, son Li Gong Zhuo established.",
  "s0116": "Li Gong thirty-seven years died, Lu people established his younger brother Ju, this was Xian Gong.",
  "s0117": "Xian Gong thirty-two years died, son Zhen Gong Bi established.",
  "s0118": "Zhen Gong fourteen years, Zhou Li Wang no way, went fleeing Zhu, republican administered government.",
  "s0119": "Twenty-nine years, Zhou Xuan Wang ascended throne.",
  "s0120": "Thirty years, Zhen Gong died, younger brother Ao established, this was Wu Gong.",
  "s0121": "Wu Gong nine years spring, Wu Gong with eldest son Kuo, youngest son Xi, west court Zhou Xuan Wang.",
  "s0122": "Xuan Wang loved Xi, wished establish Xi as Lu crown prince.",
  "s0123": "Zhou's Fan Zhong Shan Fu advised Xuan Wang said: 'Abolish eldest establish youngest, not follow;",
  "s0124": "not follow, must violate Wang command;",
  "s0125": "violate Wang command, must execute: so issue command cannot not follow.",
  "s0126": "Command not walk, government not establish;",
  "s0127": "walk not follow, people will abandon above.",
  "s0128": "Below serve above, young serve old, so for follow.",
  "s0129": "Now heavenly son establishes feudal lords, establishes their young, is teach people rebel.",
  "s0130": "If Lu follows it, feudal lords imitate it, Wang command will have blocked;",
  "s0131": "if not follow execute it, is self execute Wang command.",
  "s0132": "Execute also loss, not execute also loss, Wang his plan it.'",
  "s0133": "Xuan Wang not listen, finally established Xi as Lu crown prince.",
  "s0134": "Summer, Wu Gong returned died, Xi established, this was Yi Gong.",
  "s0135": "Yi Gong nine years, Yi Gong elder brother Kuo's son Bo Yu with Lu people attacked assassinated Yi Gong, established Bo Yu as lord.",
  "s0136": "Bo Yu ascended position eleven years, Zhou Xuan Wang attacked Lu, killed its lord Bo Yu, inquired Lu gong zi able guide follow feudal lords, to make Lu successor.",
  "s0137": "Fan Mu Zhong said: 'Lu Yi Gong younger brother Cheng, solemn respectful bright spirits, respectful served elders;",
  "s0138": "assigned affairs executed punishments, must ask previous teachings consult old practices;",
  "s0139": "not interfere asked, not violate consulted.'",
  "s0140": "Xuan Wang said: 'Yes, able teach govern his people.'",
  "s0141": "Then established Cheng at Yi Gong palace, this was Xiao Gong.",
  "s0142": "From this after, feudal lords many rebelled Wang command.",
  "s0143": "Xiao Gong twenty-five years, feudal lords rebelled Zhou, Quan Rong killed You Wang.",
  "s0144": "Qin began ranked as feudal lords.",
  "s0145": "Twenty-seven years, Xiao Gong died, son Fu Nang established, this was Hui Gong.",
  "s0146": "Hui Gong thirty years, Jin people assassinated their lord Zhao Hou.",
  "s0147": "Forty-five years, Jin people again assassinated their lord Xiao Hou.",
  "s0148": "Forty-six years, Hui Gong died, long concubine son Xi acted held country, walked lord affairs, this was Yin Gong.",
  "s0149": "Initially, Hui Gong proper wife no sons, duke lowly concubine Sheng Zi gave birth son Xi."
}
