{
  "s0051": "Those whose joyful heart is moved, their sound smooth slow;",
  "s0052": "Those whose happy heart is moved, their sound issue scatter;",
  "s0053": "Those whose angry heart is moved, their sound coarse fierce;",
  "s0054": "Those whose respectful heart is moved, their sound straight pure;",
  "s0055": "Those whose loving heart is moved, their sound harmonious soft.",
  "s0056": "Six not nature, moved by things then act, thus former kings careful what move them.",
  "s0057": "Thus ritual to guide their will, music to harmonize their sound, governance to unify their conduct, punishment to guard their evil.",
  "s0058": "Ritual music punishment governance, their extreme one, thus same people's hearts and issue governance way.",
  "s0059": "All sound, born human heart.",
  "s0060": "Feelings move within, thus form in sound, sound forms pattern called sound.",
  "s0061": "Thus orderly age sound peaceful joyful, its correct harmony;",
  "s0062": "Chaotic age sound resentful angry, its correct contrary;",
  "s0063": "Perished state sound sorrowful thoughtful, its people distressed.",
  "s0064": "Sound way, with correct connects.",
  "s0065": "Gong for ruler, shang for minister, jue for people, zhi for affairs, yu for things.",
  "s0066": "Five not chaotic, then no worried sounds.",
  "s0067": "Gong chaotic then wild, its ruler arrogant;",
  "s0068": "Shang chaotic then strike, its ministers ruined;",
  "s0069": "Jue chaotic then worry, its people resentful;",
  "s0070": "Zhi chaotic then sorrow, its affairs diligent;",
  "s0071": "Yu chaotic then dangerous, its wealth scarce.",
  "s0072": "Five all chaotic, mutually invade, called slow.",
  "s0073": "Thus then state's extinction no day.",
  "s0074": "Zheng Wei sounds, chaotic age sounds, close to slow.",
  "s0075": "Sang Jian Pu Shang sounds, perished state sounds, its governance scattered, its people flow, deceive superiors carry private cannot stop.",
  "s0076": "All sound, born human heart;",
  "s0077": "Music, connects principles ethics.",
  "s0078": "Thus know sound not know sound, birds beasts are;",
  "s0079": "Know sound not know music, common people are.",
  "s0080": "Only gentleman can know music.",
  "s0081": "Thus examine sound to know sound, examine sound to know music, examine music to know governance, governance way complete.",
  "s0082": "Thus not know sound cannot speak sound with, not know sound cannot speak music know music then near ritual.",
  "s0083": "Ritual music all obtained, called has virtue.",
  "s0084": "Virtue is obtain.",
  "s0085": "Thus music's flourishing, not extreme sound;",
  "s0086": "Feast ritual, not extreme flavor.",
  "s0087": "Clear temple qin, vermilion strings sparse bridges, one lead three sigh, has remaining sound.",
  "s0088": "Great feast ritual, still black wine zu raw fish, great broth not mixed, has remaining flavor.",
  "s0089": "Thus former kings' establish ritual music, not to extreme mouth belly ears eyes desires, will teach people even likes dislikes return human way correct.",
  "s0090": "Human life quiet, heaven's nature;",
  "s0091": "Moved by things act, nature's endowment.",
  "s0092": "Things arrive know know, then likes dislikes form.",
  "s0093": "Likes dislikes no measure within, knowledge lured without, cannot return self, heaven principle extinguished.",
  "s0094": "Things move people infinite, human likes dislikes no measure, then things arrive human transform things.",
  "s0095": "Human transform things, extinguish heaven principle exhaust human desires.",
  "s0096": "Thus have contrary deceit false heart, have licentious dissipation make chaos affairs.",
  "s0097": "Thus strong coerce weak, many violent few, wise deceive foolish, brave oppress cowardly, sickness not nurture, old young orphans widows not get place, this great chaos way.",
  "s0098": "Thus former kings establish ritual music, human make measure: mourning hemp cry weep, thus measure mourning record;",
  "s0099": "Bells drums shield axe, thus harmonize peaceful joy;"
}
