{
  "s0382": "Xiang Yu from this resented Bu.",
  "s0383": "Han second year winter, Xiang Yu then went north to Chengyang, Tian Rong also led troops to battle together.",
  "s0384": "Tian Rong could not win, fled to Pingyuan, Pingyuan people killed him.",
  "s0385": "Then went north burning and destroying Qi city walls houses, all buried Tian Rong's surrendering soldiers, captured and enslaved their old and weak women.",
  "s0386": "Marched through Qi to Beihai, destroyed much.",
  "s0387": "Qi people gathered and rebelled against him.",
  "s0388": "Therefore Tian Rong's younger brother Tian Heng gathered Qi fleeing soldiers got tens of thousands, rebelled at Chengyang.",
  "s0389": "Xiang Yu stayed, fought continuously but could not take it.",
  "s0390": "Spring, Han King led five lords' troops, total fifty-six thousand men, attacked Chu east.",
  "s0391": "Xiang Yu heard this, immediately ordered the generals to attack Qi, while he personally with elite troops thirty thousand went south from Lu through Huling.",
  "s0392": "Fourth month, Han had all entered Pengcheng, collected its goods treasures and beauties, daily held wine feasts.",
  "s0393": "Xiang Yu attacked Han army at Lingbi, greatly defeated them, killed many.",
  "s0394": "The Han army fled, Xiang Yu pursued to Yinque, the Han army surrendered.",
  "s0395": "Xiang Yu divided the surrendering Han army into two, ordered the Chu army to cross the Si River, buried alive the surrendering soldiers.",
  "s0396": "Xiang Yu then camped at Gaixia, the Han army fled south to the Yangtze.",
  "s0397": "Xiang Yu heard Liu Bang had fled to Han, sent Bu Gong to pursue and attack Liu Bang.",
  "s0398": "Liu Bang sent Lu Wan to defend Yan, attacked Wei Bao at Wei.",
  "s0399": "Attacked Chen Xi at Dai.",
  "s0400": "Attacked Zang Tu at Yan.",
  "s0401": "Attacked Tian Rong at Qi.",
  "s0402": "Attacked Han Xin at Chu.",
  "s0403": "Attacked Ying Bu at Jiujiang.",
  "s0404": "Attacked Wu Rui at Hengshan.",
  "s0405": "Attacked Gong Ao at Linhuai.",
  "s0406": "Attacked Zhang Er at Zhao.",
  "s0407": "Attacked Wei Bao at Wei.",
  "s0408": "Attacked Sima Ang at Dai.",
  "s0409": "Attacked Zhang Er at Changshan.",
  "s0410": "Xiang Yu returned to Chu, attacked Liu Bang at Guling.",
  "s0411": "Liu Bang fled to Pingcheng, Xiang Yu pursued to Henei.",
  "s0412": "Liu Bang sent Zhang Liang to negotiate peace with Xiang Yu.",
  "s0413": "Xiang Yu agreed to divide the world at Hong Canal, east for Chu, west for Han.",
  "s0414": "Xiang Yu released Liu Bang's father and wife.",
  "s0415": "Xiang Yu camped at Guangwu, Liu Bang camped at Chenggao.",
  "s0416": "Xiang Yu attacked Liu Bang at Chenggao, Liu Bang fled.",
  "s0417": "Xiang Yu pursued to Yongqiu, Liu Bang fled to Chenliu.",
  "s0418": "Xiang Yu attacked Chenliu, Liu Bang fled to Xingyang.",
  "s0419": "Xiang Yu besieged Xingyang, Liu Bang fled through Xiaopi.",
  "s0420": "Xiang Yu pursued to solid earth, Liu Bang fled to Henei.",
  "s0421": "Xiang Yu attacked Henei, Liu Bang fled to Pingcheng.",
  "s0422": "Liu Bang sent Guo Ji to negotiate peace, Xiang Yu agreed.",
  "s0423": "Xiang Yu camped at Guangwu, Liu Bang camped at Xiaohe.",
  "s0424": "Xiang Yu attacked Han Xin at Qi, Han Xin fled.",
  "s0425": "Xiang Yu attacked Peng Yue at Liang, Peng Yue fled.",
  "s0426": "Xiang Yu returned to attack Xingyang.",
  "s0427": "Liu Bang sent Lu Jia to negotiate peace with Xiang Yu.",
  "s0428": "Xiang Yu said: 'If you give me the map of the Han lands, I will release you.'",
  "s0429": "Liu Bang agreed, Xiang Yu released Xingyang siege.",
  "s0430": "Xiang Yu camped at Chenliu, Liu Bang camped at Xiaohe.",
  "s0431": "Xiang Yu attacked Liu Bang at Xiaohe, Liu Bang fled.",
  "s0432": "Xiang Yu pursued to Henei, Liu Bang fled to Yongqiu.",
  "s0433": "Xiang Yu attacked Yongqiu, Liu Bang fled to Chenliu.",
  "s0434": "Xiang Yu attacked Chenliu, Liu Bang fled to Xingyang.",
  "s0435": "Xiang Yu besieged Xingyang, Liu Bang fled through Xiaopi.",
  "s0436": "Xiang Yu pursued to solid earth, Liu Bang fled to Henei.",
  "s0437": "Xiang Yu attacked Henei, Liu Bang fled to Pingcheng.",
  "s0438": "Liu Bang sent Hou Babao to negotiate peace, Xiang Yu agreed.",
  "s0439": "Xiang Yu camped at Guangwu, Liu Bang camped at Xiaohe.",
  "s0440": "Xiang Yu attacked Han Xin at Qi again, Han Xin fled again."
}