{
  "s365": "Imperial Secretary Grandee Wan.",
  "s368": "Lin Jiang Wang Zheng, suicide, buried at Lan Tian, Yan several ten thousand as bitter soldiers placed on tomb.",
  "s374": "Imperial son Shun became Chang Shan Wang.",
  "s380": "Liang Xiao Wang Wu died. Divided Liang into five states, enfeoffed various sons: Zi Mai became Liang Wang, Ming became Ji Chuan Wang, Peng Li became Ji Dong Wang, Ding became Shan Yang Wang, Bu Shi became Ji Yin Wang.",
  "s385": "Later first year",
  "s386": "Fifth month, earth shook. Seventh month Yi Si, solar eclipse. Dismissed chancellor.",
  "s387": "Five. Eighth month Ren Chen, Imperial Secretary Grandee Jian Ling Hou Wei Wan became chancellor.",
  "s389": "Imperial Secretary Grandee Bu Yi.",
  "s394": "Sixth month Ding Chou, Imperial Secretary Grandee Cen Mai died.",
  "s398": "First month Jia Zi, Xiao Jing emperor collapsed. Second month Bing Zi, crown prince established.",
  "s403": "Xiao Wu Jian Yuan first year",
  "s404": "Wan dismissed chancellor.",
  "s405": "Four. Wei Qi Hou Dou Ying became chancellor. Established Grand Commandant.",
  "s406": "Wu An Hou Tian Fen became Grand Commandant.",
  "s407": "Imperial Secretary Grandee Di.",
  "s410": "Established Mao Ling. Ying dismissed chancellor.",
  "s411": "Second month Yi Wei, Grand Usher Bai Zhi Hou Xu Chang became chancellor. Fen dismissed Grand Commandant. Abolished Grand Commandant office.",
  "s413": "Imperial Secretary Grandee Zhao Wan.",
  "s416": "Dong Ou Wang Guang Wu Hou Wang led his multitude forty thousand plus people came to surrender, placed in Lu Jiang jun.",
  "s425": "Imperial Secretary Grandee Qing Di.",
  "s428": "Circulated three divided coins.",
  "s434": "First month, Min Yue Wang rebelled. Xiao Jing Tai Hou collapsed.. Chang dismissed chancellor.",
  "s435": "Five. Sixth month Gui Si, Wu An Hou Tian Fen became chancellor.",
  "s436": "Qing Di became crown prince Grand Tutor.",
  "s437": "Imperial Secretary Grandee An Guo.",
  "s439": "Yuan Guang first year",
  "s446": "Emperor first went to Yong, suburbanly saw five zhi.",
  "s448": "Summer, Imperial Secretary Grandee Han An Guo became Protector General, Wei Wei Li Guang became Brave Cavalry General, Grand Usher Gong Sun He became Light Chariot General, Grand Herald Wang Hui became General Garrison General, Grand Master Li Xi became Timber Officer General, trapped Chan Yu at Mai Yi, not successful, executed Hui.",
  "s452": "Fifth month Bing Zi, river burst at Hu Zi.",
  "s458": "Twelfth month Ding Hai, earth shook. Fen died.",
  "s459": "Five. Ping Ji Hou Xue Ze became chancellor.",
  "s461": "Imperial Secretary Grandee Ou.",
  "s464": "Tenth month, exterminated Guan Fu family, executed Wei Qi Hou in market.",
  "s470": "Southern Yi first established postal stations.",
  "s472": "Grand Master Wei Qing became Chariot Cavalry General, went out Shang Gu; Wei Wei Li Guang became Brave Cavalry General, went out Yan Men; Grand Master Gong Sun Ao became Cavalry General, went out Dai; Grand Usher Gong Sun He became Light Chariot General, went out Yun Zhong: all struck Xiongnu.",
  "s475": "Yuan Shuo first year",
  "s476": "Wei lady established as empress.",
  "s478": "Chariot Cavalry General Qing went out Yan Men, struck Xiongnu. Wei Wei Han An Guo became General Garrison General, army Dai, next year, garrison Yu Yang died.",
  "s484": "Spring, Chariot Cavalry General Wei Qing went out Yun Zhong, reached Gao Que, took He Nan land.",
  "s488": "Xiongnu killed Dai Grand Administrator You.",
  "s491": "Imperial Secretary Grandee Hong.",
  "s494": "Xiongnu entered Ding Xiang, Dai, Shang Jun.",
  "s500": "Xiongnu killed Dai Colonel Vuheng Zhu Ying. Ze dismissed chancellor.",
  "s501": "Eight. Eleventh month Yi Chou, Imperial Secretary Grandee Gong Sun Hong became chancellor, enfeoffed Ping Jin Hou.",
  "s502": "Spring, Chang Ping Hou Wei Qing became Grand General, struck You Xian. Wei Wei Su Jian became Roaming Strike General, belonged to Qing. Left Interior Li Ju became Strong Crossbow General, Grand Usher He became Chariot Cavalry General, Dai chancellor Li Cai became Light Chariot General, An Tou Hou Zhang Ci Gong became general, Grand Herald Xi became general: all belonged to Grand General, struck Xiongnu.",
  "s508": "Grand General Qing again went out Ding Xiang struck Hu. He Qi Hou Gong Sun Ao became Middle General, Grand Usher He became Left General, Lang Zhong Ling Li Guang became Rear General. Xi Hou Zhao Xin became Front General, defeated surrendered Xiongnu. Wei Wei Su Jian became Right General, defeated, body escaped. Left Interior Ju became Strong Crossbow General. All belonged to Qing.",
  "s511": "Yuan Shou first year",
  "s512": "Tenth month, Huai Nan Wang An, Heng Shan Wang Ci plotted rebellion, all suicide, states eliminated.",
  "s515": "Imperial Secretary Grandee Cai.",
  "s518": "Xiongnu entered Yan Men, Dai jun. Jiang Du Wang Jian rebelled. Jiao Dong prince Qing established as Liu An Wang. Hong died."
}
