{
  "s0051": "Ying Qiu bordered Lai.",
  "s0052": "Lai people, Yi barbarians, met Zhou's chaos and Zhou initially settled, could not gather distant places, therefore with Tai Gong contended for state.",
  "s0053": "Tai Gong arrived state, repaired government, followed their customs, simplified their rites, opened merchant artisan occupations, facilitated fish salt benefits, people many belonged Qi, Qi became great country.",
  "s0054": "When Zhou Cheng Wang young, Guan Cai made disorder, Huai Yi rebelled Zhou, then sent Shao Kang Gong commanded Tai Gong: 'East to sea, west to Yellow River, south to Mu Ling, north to Wu Di, five marquises nine earls, truly able attack them.'",
  "s0055": "Qi from this able attack, became great country.",
  "s0056": "Capital Ying Qiu.",
  "s0057": "About Tai Gong's death over hundred years, son Ding Gong Lu Ji established.",
  "s0058": "Ding Gong died, son Yi Gong De established.",
  "s0059": "Yi Gong died, son Gui Gong Ci Mu established.",
  "s0060": "Gui Gong died, son Ai Gong Bu Chen established.",
  "s0061": "Ai Gong time, Ji Hou slandered him to Zhou, Zhou boiled Ai Gong established his younger brother Jing, this was Hu Gong.",
  "s0062": "Hu Gong moved capital Bo Zhuang, during Zhou Yi Wang time.",
  "s0063": "Ai Gong's same mother younger brother Shan resented Hu Gong, then with his party led Ying Qiu people attacked killed Hu Gong self established, this was Xian Gong.",
  "s0064": "Xian Gong first year, completely drove out Hu Gong sons, because moved Bo Zhuang capital, governed Lin Zi.",
  "s0065": "Nine years, Xian Gong died, son Wu Gong Shou established.",
  "s0066": "Wu Gong nine years, Zhou Li Wang went fleeing, resided Zhu.",
  "s0067": "Tenth year, Wang chamber chaos, ministers administered government, called 'Republican'.",
  "s0068": "Twenty-four years, Zhou Xuan Wang initially established.",
  "s0069": "Twenty-six years, Wu Gong died, son Li Gong Wu Ji established.",
  "s0070": "Li Gong tyrannical cruel, so Hu Gong sons again entered Qi, Qi people wished establish him, then with attacked killed Li Gong.",
  "s0071": "Hu Gong son also battle died.",
  "s0072": "Qi people then established Li Gong son Chi as lord, this was Wen Gong, executed killed Li Gong seventy people.",
  "s0073": "Wen Gong twelve years died, son Cheng Gong Tuo established.",
  "s0074": "Cheng Gong nine years died, son Zhuang Gong Gou established.",
  "s0075": "Zhuang Gong twenty-four years, Quan Rong killed You Wang, Zhou east moved Luo.",
  "s0076": "Qin began ranked as feudal lords.",
  "s0077": "Fifty-six years, Jin assassinated their lord Zhao Hou.",
  "s0078": "Sixty-four years, Zhuang Gong died, son Xi Gong Lu Fu established.",
  "s0079": "Xi Gong nine years, Lu Yin Gong initially established.",
  "s0080": "Nineteen years, Lu Huan Gong assassinated his elder brother Yin Gong self established as lord.",
  "s0081": "Twenty-five years, northern Rong attacked Qi.",
  "s0082": "Zheng sent crown prince Hu came save Qi, Qi wished marry him.",
  "s0083": "Hu said: 'Zheng small Qi large, not our match.'",
  "s0084": "Then declined it.",
  "s0085": "Thirty-two years, Xi Gong same mother younger brother Yi Zhong year died.",
  "s0086": "His son called Gong Sun Wu Zhi, Xi Gong loved him, ordered his rank clothing support compare crown prince.",
  "s0087": "Thirty-three years, Xi Gong died, crown prince Zhu Er established, this was Xiang Gong.",
  "s0088": "Xiang Gong first year, began as crown prince time, once with Wu Zhi fought, to established, reduced Wu Zhi rank clothing, Wu Zhi resented.",
  "s0089": "Fourth year, Lu Huan Gong with wife went to Qi.",
  "s0090": "Qi Xiang Gong originally once privately communicated Lu wife.",
  "s0091": "Lu wife was Xiang Gong younger sister, from Xi Gong time married as Lu Huan Gong wife, to Huan Gong came Xiang Gong again communicated her.",
  "s0092": "Lu Huan Gong knew it, angered wife, wife informed Qi Xiang Gong.",
  "s0093": "Qi Xiang Gong with Lu lord drank, intoxicated him, made strong man Peng Sheng embrace lift Lu lord onto carriage, then pulled killed Lu Huan Gong, Huan Gong descended carriage then died.",
  "s0094": "Lu people considered it reproach, Qi Xiang Gong killed Peng Sheng to apologize Lu.",
  "s0095": "Eighth year, attacked Ji, Ji moved left their city.",
  "s0096": "Twelfth year, initially, Xiang Gong made Lian Cheng, Guan Zhi Fu garrison Kui Qiu, melon time went, to melon then replace.",
  "s0097": "Went garrison one year, reached melon time but duke not sent replacement.",
  "s0098": "Someone requested replacement, duke not permitted.",
  "s0099": "Therefore these two angered, through Gong Sun Wu Zhi planned make disorder."
}
