{
  "s0148": "Zhao Gong sixth year, Qi Huan Gong defeated Cai, then to Chu Zhao Ling.",
  "s0149": "Ninth year, Zhao Gong died, son Gong Gong Xiang established.",
  "s0150": "Gong Gong sixteenth year, initially, Jin gong zi Chong Er his fleeing passed Cao, Cao lord no rites, wished observe his joined ribs.",
  "s0151": "Xi Fu Ji advised, not listened, privately good to Chong Er.",
  "s0152": "Twenty-first year, Jin Wen Gong Chong Er attacked Cao, captured Gong Gong returned, ordered army not enter Xi Fu Ji clan alley.",
  "s0153": "Someone persuaded Jin Wen Gong said: 'Formerly Qi Huan Gong assembled feudal lords, restored different surnames;",
  "s0154": "now lord imprisoned Cao lord, extinguished same surname, how to command feudal lords?'",
  "s0155": "Jin then again returned Gong Gong.",
  "s0156": "Twenty-fifth year, Jin Wen Gong died.",
  "s0157": "Thirty-fifth year, Gong Gong died, son Wen Gong Shou established.",
  "s0158": "Wen Gong twenty-third year died, son Xuan Gong Qiang established.",
  "s0159": "Xuan Gong seventeenth year died, younger brother Cheng Gong Fu Chu established.",
  "s0160": "Cheng Gong third year, Jin Li Gong attacked Cao, captured Cheng Gong returned, already again released him.",
  "s0161": "Fifth year, Jin Luan Shu, Zhong Xing Yan made Cheng Hua assassinated their lord Li Gong.",
  "s0162": "Twenty-third year, Cheng Gong died, son Wu Gong Sheng established.",
  "s0163": "Wu Gong twenty-sixth year, Chu gong zi Qi Ji assassinated their lord Ling Wang replaced established.",
  "s0164": "Twenty-seventh year, Wu Gong died, son Ping Gong Xu established.",
  "s0165": "Ping Gong fourth year died, son Dao Gong Wu established.",
  "s0166": "This year, Song, Wei, Chen, Zheng all fire.",
  "s0167": "Dao Gong eighth year, Song Jing Gong established.",
  "s0168": "Ninth year, Dao Gong court Song, Song imprisoned him;",
  "s0169": "Cao established his younger brother Ye, this was Sheng Gong.",
  "s0170": "Dao Gong died at Song, returned buried.",
  "s0171": "Sheng Gong fifth year, Ping Gong younger brother Tong assassinated Sheng Gong replaced established, this was Yin Gong.",
  "s0172": "Yin Gong fourth year, Sheng Gong younger brother Lu assassinated Yin Gong replaced established, this was Jing Gong.",
  "s0173": "Jing Gong fourth year died, son Bo Yang established.",
  "s0174": "Bo Yang third year, country people dreamed many gentlemen stood at altar palace, plotted wished perish Cao;",
  "s0175": "Cao Shu Zhen Duo stopped them, requested wait Gong Sun Qiang, permitted.",
  "s0176": "Dawn, sought him at Cao, no this person.",
  "s0177": "Dreamer warned his son said: 'I perish, you hear Gong Sun Qiang administers government, must leave Cao, no separate Cao calamity.'",
  "s0178": "To Bo Yang ascended position, liked hunting shooting affairs.",
  "s0179": "Sixth year, Cao wild person Gong Sun Qiang also liked hunting shooting, obtained white goose offered it, moreover spoke hunting shooting sayings, because visited government affairs.",
  "s0180": "Bo Yang greatly pleased him, had favor, made him Si Cheng to listen government.",
  "s0181": "Dreamer's son then fled away.",
  "s0182": "Gong Sun Qiang spoke hegemon sayings to Cao Bo.",
  "s0183": "Fourteenth year, Cao Bo followed it, then broke Jin offended Song.",
  "s0184": "Song Jing Gong attacked it, Jin people not saved.",
  "s0185": "Fifteenth year, Song extinguished Cao, captured Cao Bo Yang and Gong Sun Qiang returned killed them.",
  "s0186": "Cao then cut off its sacrifices.",
  "s0187": "Grand Historian said: I sought Cao Gong Gong's not used Xi Fu Ji, then rode chariots three hundred people, knew only virtue not established.",
  "s0188": "To Zhen Duo's dream, how not wished extend Cao sacrifices?",
  "s0189": "Like Gong Sun Qiang not repaired his government, Shu Duo's sacrifices suddenly perished."
}
