{
  "s980": "Son of Prince Jing of Zhongshan.",
  "s982": "Two. Fifth year third month gui you, Marquis Yi Liu Gai first year.",
  "s983": "Two. Four. Third year, Marquis Su first year.",
  "s984": "Four. Fifth year, Marquis Su convicted of tribute gold, state abolished.",
  "s987": "Rong Qiu.",
  "s988": "Son of Prince Jing of Zhongshan.",
  "s990": "Two. Fifth year third month gui you, Marquis Liu Rang first year.",
  "s991": "Six",
  "s992": "Four. Fifth year, Marquis Rang convicted of tribute gold, state abolished.",
  "s995": "Fan Yu.",
  "s996": "Son of Prince Jing of Zhongshan.",
  "s998": "Two. Fifth year third month gui you, Marquis Jie Liu Tiao first year.",
  "s999": "Six",
  "s1000": "Six",
  "s1001": "Six",
  "s1002": "Four",
  "s1003": "Qu Cheng.",
  "s1004": "Son of Prince Jing of Zhongshan.",
  "s1006": "Two. Fifth year second month gui you, Marquis Liu Wan Sui first year.",
  "s1007": "Six",
  "s1008": "Four. Fifth year, Marquis Wan Sui convicted of tribute gold, state abolished.",
  "s1011": "An Guo.",
  "s1012": "Son of Prince Jing of Zhongshan.",
  "s1014": "Two. Fifth year third month gui you, Marquis Liu Bo first year.",
  "s1015": "Six",
  "s1016": "Six",
  "s1017": "Six",
  "s1018": "Four",
  "s1019": "An Xian.",
  "s1020": "Son of Prince Jing of Zhongshan.",
  "s1022": "Two. Fifth year third month gui you, Marquis Liu Ying first year.",
  "s1023": "Six",
  "s1024": "Four. Fifth year, Marquis Ying convicted of tribute gold, state abolished.",
  "s1027": "An Yao.",
  "s1028": "Son of Prince Jing of Zhongshan.",
  "s1030": "Two. Fifth year third month gui you, Marquis Liu Hui first year.",
  "s1031": "Six",
  "s1032": "Four. Fifth year, Marquis Hui convicted of tribute gold, state abolished.",
  "s1035": "Fu Yi.",
  "s1036": "Son of Prince Ding of Changsha.",
  "s1038": "Two. Fifth year third month gui you, Marquis Jing Liu Yi first year.",
  "s1039": "Six",
  "s1040": "Four. Six. Fifth year, current Marquis Yu first year.",
  "s1041": "Six",
  "s1042": "Four",
  "s1043": "Chong Ling.",
  "s1044": "Son of Prince Ding of Changsha.",
  "s1046": "Two. Fifth year sixth month ren zi, Marquis Liu Mai first year.",
  "s1047": "Six"
}
