{
  "s570": "Jiang Yang.",
  "s571": "As General attacking Wu Chu with merit, used as Prime Minister of Zhao, Marquis, two thousand five hundred forty-one households.",
  "s575": "Four. Sixth year fourth month ren shen, Marquis Kang Su Jia first year. Seven. Zhong third year, Marquis Yi Lu first year.",
  "s576": "Two. Jianyu third year, Marquis Ming first year. Sixteen. Yuanshuo sixth year, Marquis Diao first year. Eleven. Yuanding fifth year, Marquis Diao convicted of tribute gold, state abolished.",
  "s578": "Ju.",
  "s579": "As Prime Minister of Zhao Jian De, King Sui rebelled, Jian De did not listen, died in service, son Marquis, one thousand nine hundred seventy households.",
  "s583": "Six. Zhong second year fourth month yi si, Marquis Heng first year. Later second year, Marquis Heng committed crime, state abolished.",
  "s586": "Xin Shi.",
  "s587": "As Interior Minister of Zhao Wang Shen, King Sui rebelled, Shen did not listen, died in service, son Marquis, one thousand fourteen households.",
  "s591": "Five. Zhong second year fourth month yi si, Marquis Wang Kang first year. Three. Later first year, Marquis Shang Shi Chang first year.",
  "s592": "Nine. Yuanguang fourth year, Marquis Shang Shi Chang assassinated, state abolished.",
  "s594": "Shang Ling.",
  "s595": "As Grand Tutor of Chu Zhao Yi Wu, King Wu rebelled, did not listen, died in service, son Marquis, one thousand forty-five households.",
  "s599": "Eight. Zhong second year fourth month yi si, Marquis Zhao Zhou first year.",
  "s600": "Twenty-nine. Yuanding fifth year, Marquis Zhou convicted of as Chancellor knowing marquises' tribute gold light, sent to Tribunal, suicide, state abolished.",
  "s602": "Shan Yang",
  "s603": "As Prime Minister of Chu Zhang Shang, King Wu rebelled, Shang did not listen, died in service, son Marquis, one thousand one hundred fourteen households.",
  "s607": "Eight. Zhong second year fourth month yi si, Marquis Zhang Dang Ju first year.",
  "s608": "Sixteen. Yuanshuo fifth year, Marquis Dang Ju convicted of as Grand Master of Ceremonies not punishing disciple disciples according to real crimes, state abolished.",
  "s610": "An Ling",
  "s611": "As Xiongnu king surrendered, Marquis, one thousand five hundred seventeen households.",
  "s615": "Seven. Zhong third year eleventh month geng zi, Marquis Zi Jun first year.",
  "s616": "Five. Jianyu sixth year, Marquis Zi Jun died, no posterity, state abolished.",
  "s618": "Yuan.",
  "s619": "As Xiongnu king surrendered, Marquis.",
  "s623": "Three. Zhong third year twelfth month ding chou, Marquis Ci first year. Sixth year, Ci died, could not succeed to heir.",
  "s626": "Qiu.",
  "s627": "As Xiongnu king surrendered, Marquis, five thousand five hundred sixty-nine households.",
  "s631": "Zhong third year twelfth month ding chou, Marquis Long Qiang first year. Could not succeed Long Qiang.",
  "s633": "Later first year fourth month jia chen, Marquis Ze convicted of sending witch Qi Shao Jun to pray and curse, great way without way, state abolished.",
  "s634": "Rong Cheng.",
  "s635": "As Xiongnu king surrendered, Marquis, seven hundred households.",
  "s639": "Seven. Zhong third year twelfth month ding chou, Marquis Wei Xu Lu first year.",
  "s640": "Fourteen. Jianyu first year, Marquis Kang Chuo first year. Twenty-two. Yuanshuo third year, Marquis Guang first year.",
  "s641": "Eighteen. Later second year, third month ren chen, Marquis Guang convicted of praying and cursing, state abolished.",
  "s642": "Yi.",
  "s643": "As Xiongnu king surrendered, Marquis.",
  "s647": "Six. Zhong third year twelfth month ding chou, Marquis Pu Qing first year. Later second year, Marquis Pu Qing died, no heir.",
  "s650": "Fan Yang.",
  "s651": "As Xiongnu king surrendered, Marquis, one thousand one hundred ninety-seven households.",
  "s655": "Seven. Zhong third year twelfth month ding chou, Marquis Duan Dai first year.",
  "s656": "Seven. Yuanguang second year, Marquis Huai De first year. Two. Yuanguang fourth year, Marquis De died, no posterity, state abolished.",
  "s658": "Xi.",
  "s659": "As Xiongnu king surrendered, Marquis.",
  "s663": "Seven. Zhong third year twelfth month ding chou, Marquis Han Dan first year.",
  "s664": "Nine. Yuanguang fourth year, Marquis Han Dan convicted of coming and going without requesting Chang Xin, disrespectful, state abolished.",
  "s666": "Ya Gu.",
  "s667": "As Donghu king of Xiongnu surrendered, son of former King Lu Wan of Yan, Marquis, one thousand five hundred households.",
  "s671": "Two. Zhong fifth year fourth month ding si, Marquis Jian Ta Fu first year. Three. Later first year, Marquis An Zhong first year.",
  "s672": "Eleven. Jianyu first year, Marquis Kang Pian first year. Twenty-five. Yuanguang sixth year, Marquis He first year."
}
