{
  "s0001": "Zhou Gong Dan, Zhou Wu Wang's younger brother.",
  "s0002": "From Wen Wang time, Dan as son filial, sincere benevolent, different from group sons.",
  "s0003": "To Wu Wang ascended throne, Dan constantly assisted Wu Wang, handled affairs most.",
  "s0004": "Wu Wang ninth year, east attacked to Meng Jin, Zhou Gong assisted went.",
  "s0005": "Eleventh year, attacked Zhou, to Mu Ye, Zhou Gong assisted Wu Wang, made Mu Shi oath.",
  "s0006": "Broke Yin, entered Shang palace.",
  "s0007": "Already killed Zhou, Zhou Gong held great axe, Zhao Gong held small axe, flanked Wu Wang, sacrificed altar, informed Zhou's crimes to heaven, and Yin people.",
  "s0008": "Released Ji Zi's prisoner.",
  "s0009": "Enfeoffed Zhou son Wu Geng Lu Fu, made Guan Shu, Cai Shu teach him, to continue Yin sacrifices.",
  "s0010": "Universally enfeoffed meritorious ministers same surname relatives.",
  "s0011": "Enfeoffed Zhou Gong Dan at Shao Hao's old capital Qu Fu, this was Lu Gong.",
  "s0012": "Zhou Gong not accept enfeoffment, stayed assisted Wu Wang.",
  "s0013": "Wu Wang conquered Yin second year, world not yet gathered, Wu Wang had illness, not well, ministers feared, Tai Gong, Zhao Gong then divined.",
  "s0014": "Zhou Gong said: 'Not can grieve our previous kings.'",
  "s0015": "Zhou Gong then self became pledge, set up three altars, Zhou Gong north faced stood, wore jade disc held jade tablet, informed Tai Wang, Wang Ji, Wen Wang.",
  "s0016": "Shi ce blessed said: 'Only your first grandson Wang Fa, diligent labored ill.",
  "s0017": "If you three kings have bear son's responsibility to heaven, with Dan replace Wang Fa's body.",
  "s0018": "Dan skilled able, many talents many arts, able serve ghosts spirits.",
  "s0019": "Wang Fa not like Dan many talents many arts, cannot serve ghosts spirits.",
  "s0020": "Then commanded at emperor court, spread help four directions, used able settle your descendants on lower land, four directions people none not revere fear.",
  "s0021": "No fall heaven's descended protect mandate, our previous kings also forever have place rely.",
  "s0022": "Now I will receive command from great turtle, you permit me, I with its jade disc jade tablet return, await your command.",
  "s0023": "You not permit me, I then reject jade disc jade tablet.'",
  "s0024": "Zhou Gong already ordered shi ce inform Tai Wang, Wang Ji, Wen Wang, wished replace Wu Wang Fa, then approached three kings divined.",
  "s0025": "Diviners all said auspicious, opened book viewed it, indeed auspicious.",
  "s0026": "Zhou Gong pleased, opened bamboo slips, then saw book met auspicious.",
  "s0027": "Zhou Gong entered congratulated Wu Wang said: 'Wang will no harm.",
  "s0028": "Dan newly received command three kings, only long forever plan this.",
  "s0029": "This way able think of me one person.'",
  "s0030": "Zhou Gong hid its ce gold tied box within, warned guards not dare speak.",
  "s0031": "Next day, Wu Wang recovered.",
  "s0032": "After Wu Wang already collapsed, Cheng Wang young, in strong protection within.",
  "s0033": "Zhou Gong feared world heard Wu Wang collapse rebel, Zhou Gong then ascended throne replaced Cheng Wang administered government held country.",
  "s0034": "Guan Shu and his group brothers spread rumors in country said: 'Zhou Gong will harm Cheng Wang.'",
  "s0035": "Zhou Gong then told Tai Gong Wang, Zhao Gong Shi said: 'I so not avoid administered government, feared world rebel Zhou, no way inform our previous kings Tai Wang, Wang Ji, Wen Wang.",
  "s0036": "Three kings' worry labor world long, to now afterward complete.",
  "s0037": "Wu Wang early ended, Cheng Wang young, will complete Zhou, I so do it like this.'",
  "s0038": "Then finally assisted Cheng Wang, made his son Bo Qin replace accept enfeoffment at Lu.",
  "s0039": "Zhou Gong warned Bo Qin said: 'I Wen Wang's son, Wu Wang's younger brother, Cheng Wang's uncle father, I at world also not lowly.",
  "s0040": "But I one bathe three grasp hair, one eat three spit food, rise await scholars, still feared lose world's worthy people.",
  "s0041": "You to Lu, careful not with country arrogant people.'",
  "s0043": "Guan, Cai, Wu Geng etc. indeed led Huai Yi rebel.",
  "s0044": "Zhou Gong then received Cheng Wang command, raised troops east attacked, made great announcement.",
  "s0045": "Then executed Guan Shu, killed Wu Geng, banished Cai Shu.",
  "s0046": "Collected Yin remaining people, enfeoffed Kang Shu at Wei, enfeoffed Wei Zi at Song, to serve Yin sacrifices.",
  "s0047": "Pacified Huai Yi eastern lands, two years then completely settled.",
  "s0048": "Feudal lords all submitted revered Zhou.",
  "s0049": "Heaven descended blessings fortune, Tang Shu obtained grain, different stalk same head, presented to Cheng Wang, Cheng Wang ordered Tang Shu with present Zhou Gong at eastern lands, made present grain.",
  "s0050": "Zhou Gong already received command grain, praised heavenly son command, made praise grain."
}
