{
  "s0001": "Central Palace Heaven's Pole star, its one bright one, Tai Yi constantly resides;",
  "s0002": "Beside three stars three dukes, or called son attendants.",
  "s0003": "Back curved four stars, last big star chief consort, remaining three stars rear palace attendants.",
  "s0004": "Surrounding barrier guard twelve stars, feudal ministers.",
  "s0005": "All called Purple Palace.",
  "s0006": "Front row straight Dipper mouth three stars, follow north end Dui, appear not appear, called Yin Virtue, or called Tian Yi.",
  "s0007": "Purple Palace left three stars called Heaven Spear, right five stars called Heaven Club, back six stars cross Milky Way reach Camp Room, called Pavilion Way.",
  "s0008": "North Dipper seven stars, what is called 'Xuan Ji Yu Heng to align seven governance'.",
  "s0009": "Ladle carries Dragon horn, balance presses Southern Dipper, handle pillows Shen head.",
  "s0010": "Use dusk establish ladle;",
  "s0011": "Ladle, from China southwest.",
  "s0012": "Night half establish balance;",
  "s0013": "Balance, Yin central states He Ji between.",
  "s0014": "Level dawn establish handle;",
  "s0015": "Handle, Hai Dai northeast.",
  "s0016": "Dipper is Emperor carriage, moves at center, overlooks controls four directions.",
  "s0017": "Divides yin yang, establishes four seasons, equalizes five phases, shifts measures, determines various records, all tied to Dipper.",
  "s0018": "Dipper handle wears barrier six stars called Wen Chang Palace: one called Upper General, two called Vice General, three called Noble Chancellor, four called Si Ming, five called Si Zhong, six called Si Lu.",
  "s0019": "In Dipper handle midst, noble person's prison.",
  "s0020": "Handle below six stars, two two compared, named Three Neng.",
  "s0021": "Three Neng color even, ruler minister harmonious;",
  "s0022": "Not even, become contrary perverse.",
  "s0023": "Auxiliary star bright close, auxiliary minister intimate strong;",
  "s0024": "Distant small, distant weak.",
  "s0025": "Ladle end has two stars: one inner spear, Zhao Yao;",
  "s0026": "One outer shield, Heaven Peak.",
  "s0027": "Has curved circle fifteen stars, belongs ladle, called lowly person's prison.",
  "s0028": "Its prison middle star solid then prisoners many, empty then open out.",
  "s0029": "Tian Yi, spear, club, spear, shield move shake, horns large, troops arise.",
  "s0030": "East Palace Azure Dragon, Fang, Xin.",
  "s0031": "Xin is Bright Hall, big star Heaven King, front back stars son attendants.",
  "s0032": "Not want straight, straight then Heaven King loses plan.",
  "s0033": "Fang is Storehouse, called Heaven Driver.",
  "s0034": "Its yin, right trace horse.",
  "s0035": "Beside has two stars called collar;",
  "s0036": "North one star called fan.",
  "s0037": "Northeast curved twelve stars called banner.",
  "s0038": "Banner middle four stars Heaven Market;",
  "s0039": "Middle six stars called Market Tower.",
  "s0040": "Market middle stars numerous solid;",
  "s0041": "Its empty then waste.",
  "s0042": "Fang south numerous stars called Cavalry Official.",
  "s0043": "Left horn, Li;",
  "s0044": "Right horn, General.",
  "s0045": "Big horn, Heaven King imperial court.",
  "s0046": "Its two sides each have three stars, tripod feet hooked, called She Ti.",
  "s0047": "She Ti, straight Dipper ladle pointed, to establish time sections, thus called 'She Ti Ge'.",
  "s0048": "Kang is sparse temple, governs illness.",
  "s0049": "Its south north two big stars, called South Gate."
}
