{
  "s206": "Five. Second year fifth month yi si, Marquis Liu Yan first year.",
  "s207": "Six",
  "s208": "Six",
  "s209": "Six",
  "s210": "Four",
  "s211": "Yi Cheng.",
  "s212": "Son of Prince Yi of Zichuan.",
  "s214": "Five. Second year fifth month yi si, Marquis Kang Liu Yan first year.",
  "s215": "Six",
  "s216": "Six. First year, Marquis Fu first year.",
  "s217": "Six",
  "s218": "First year, Marquis Fu convicted of killing younger brother, executed in market, state abolished.",
  "s219": "Lin Qu.",
  "s220": "Son of Prince Yi of Zichuan.",
  "s222": "Five. Second year fifth month yi si, Marquis Ai Liu Nu first year.",
  "s223": "Six",
  "s224": "Six",
  "s225": "Six",
  "s226": "Four",
  "s227": "Lei.",
  "s228": "Son of Prince Gong of Chengyang.",
  "s230": "Five. Second year fifth month jia xu, Marquis Liu Xi first year.",
  "s231": "Six",
  "s232": "Five. Fifth year, Marquis Xi convicted of tribute gold, state abolished.",
  "s235": "Dong Guan.",
  "s236": "Son of Prince Gong of Chengyang.",
  "s238": "Three. Second year fifth month jia xu, Marquis Liu Ji first year. Fifth year, Marquis Ji had chronic illness, did not attend court, deposed, state abolished.",
  "s243": "Pi.",
  "s244": "Son of Prince Gong of Chengyang.",
  "s246": "Three. Second year fifth month jia xu, Marquis Jie Liu Zhuang first year. Two. Fifth year, Marquis Peng first year.",
  "s247": "Six",
  "s248": "Four. Fifth year, Marquis Peng convicted of tribute gold, state abolished.",
  "s251": "Wei Wen.",
  "s252": "Son of Prince Jing Su of Zhao.",
  "s254": "Five. Second year sixth month jia wu, Marquis Jie Liu Bing first year.",
  "s255": "Six. First year, Marquis Du first year.",
  "s256": "Four. Fifth year, Marquis Du convicted of tribute gold, state abolished.",
  "s259": "Feng Si.",
  "s260": "Son of Prince Jing Su of Zhao.",
  "s262": "Five. Second year sixth month jia wu, Marquis Gong Liu Hu Yang first year.",
  "s263": "Six",
  "s264": "Six",
  "s265": "Six",
  "s266": "Two. Two. Third year, current Marquis Ru Yi first year.",
  "s267": "Yu Qiu.",
  "s268": "Son of Prince Jing Su of Zhao.",
  "s270": "Five. Second year sixth month jia wu, Marquis Liu Shou Fu first year.",
  "s271": "Six",
  "s272": "Four. Fifth year, Marquis Shou Fu convicted of tribute gold, state abolished."
}
