{
  "s1545": "Nineteen, established altar to Chen Bao.",
  "s3095": "Thirty-six, sent Xi Peng to establish Jin Duke Hui.",
  "s3096": "First year of Jin Duke Hui (Yi Wu), executed Li Ke, broke Qin alliance.",
  "s3097": "Ten, Pi Zheng Zi Bao fled came.",
  "s3099": "First year of Duke Xiang of Song (Zi Fu), Mu Yi as chancellor.",
  "s3109": "Three, Rong attacked us, Tai Shu Dai summoned them. Wished to execute Shu Dai, Shu Dai fled to Qi.",
  "s3113": "Eleven, rescued king attacked Rong, Rong withdrew.",
  "s3114": "Twenty-three, attacked Huang.",
  "s3120": "Twenty-four, consort dreamed heaven gave orchid, gave birth to Duke Mu Lan.",
  "s3127": "Thirty-eight, sent Guan Zhong to pacify Rong at Zhou, wished to use upper minister ritual, declined, accepted lower minister.",
  "s3140": "Jia Xu",
  "s3143": "Thirty-nine, sent Zhong Sun to request king, spoke of Shu Dai, king angered.",
  "s3144": "Four, famine, requested grain, Qin gave us.",
  "s3145": "Thirteen, Pi Bao wished not to give, duke did not listen, transported Jin grain, from Yong to Jiang.",
  "s3149": "First year of Duke Mu of Chen (Kuan)",
  "s3160": "Five, Qin famine, requested grain, Jin broke it.",
  "s3162": "Twenty-six, extinguished Liu, Ying.",
  "s3174": "Fifteen, fifth month, solar eclipse. Not recorded, historian erred.",
  "s3176": "Six, Qin captured Duke Hui, re-established him.",
  "s3177": "Fifteen, because robber ate good horse knight obtained broke Jin.",
  "s3182": "First year of Duke Zhuang of Cai (Jia Wu)",
  "s3191": "Forty-two, king with Rong invaders informed Qi, Qi summoned feudal lords to defend Zhou.",
  "s3192": "Seven, Chong Er heard Guan Zhong died, left Di to Qi.",
  "s3193": "Sixteen, established officials for east of river.",
  "s3195": "Seven, five stones fell. Six lu retreated flying, passed our capital.",
  "s3223": "First year of Duke Xiao of Qi (Zhao)",
  "s3241": "Nineteen, extinguished Liang. Liang fond of fortifying, did not dwell, people exhausted, mutually alarmed, therefore perished.",
  "s3274": "Thirty-three, seized Duke Xiang of Song, returned him.",
  "s3275": "Twelve, summoned Chu alliance.",
  "s3285": "Fourteen, Shu Dai returned to Zhou.",
  "s3287": "Five, returned king's younger brother Dai.",
  "s3288": "Thirteen, crown prince Yu hostage Qin fled returned.",
  "s3291": "Thirteen, Hong battle, Chu defeated duke.",
  "s3296": "Thirty-five, duke went to Chu, Song attacked us.",
  "s3300": "Jia Shen",
  "s3303": "Six, attacked Song, because did not join alliance.",
  "s3304": "Fourteen, Yu established, became Duke Huai.",
  "s3305": "Twenty-three, welcomed Chong Er from Chu, treated him thickly, married daughter. Chong Er wished to return.",
  "s3306": "Thirty-five, Chong Er passed, treated thickly.",
  "s3307": "Fourteen, duke died from Hong battle.",
  "s3308": "Twenty-three, Chong Er from Qi passed, no courtesy.",
  "s3311": "Sixteen, Chong Er passed, no courtesy, Xi Fu Ji privately befriended.",
  "s3312": "Thirty-six, Chong Er passed, no courtesy, Shu Zhan admonished.",
  "s3317": "Sixteen, king fled to Si. Si is Zheng territory.",
  "s3320": "First year of Duke Wen of Jin, executed Zi Yu. Wei Wu Zi as Wei grandee, Zhao Shuai as Yuan grandee. Jiu Fan said 'seek hegemony none better than bringing in king.'",
  "s3321": "Twenty-four, sent troops to send Chong Er.",
  "s3323": "First year of Duke Cheng of Song (Wang Chen)",
  "s3333": "Seventeen, Jin brought in king.",
  "s3768": "Thirteen, Zhao Dun rescued Chen and Song, attacked Zheng.",
  "s4854": "Two, duke went to Jin, reached river, Jin apologized returned him.",
  "s4855": "Eight, Tian Wu Yu sent woman.",
  "s5040": "First year of Duke Ding of Zheng (Ning)",
  "s5050": "First year of King Ping of Chu (Ju), Gong Wang's son, Bao Yu.",
  "s5057": "First year of Duke Gong of Yan",
  "s5060": "Jia Xu",
  "s5061": "Eighteen, queen's crown prince died.",
  "s5062": "Fifteen, solar eclipse. Duke went to Jin, Jin detained for burial, duke ashamed.",
  "s5066": "Two, king took Qin woman for crown prince, favored, took himself.",
  "s5071": "First year of Duke Ping of Cao (Xu)",
  "s5080": "Six, duke died. Six ministers strong, ducal house lowly.",
  "s5090": "First year of Wu Liao",
  "s5094": "Seventeen, fifth month new moon, solar eclipse. Comet seen at Chen.",
  "s5096": "First year of Duke Qing of Jin (Qu Ji)",
  "s5098": "Four, fought with Wu.",
  "s5104": "Five, fire, wished exorcise, Zi Chan said better cultivate virtue.",
  "s5106": "Two, fought with Chu.",
  "s5115": "Eight, fire.",
  "s5116": "Eleven, fire.",
  "s5117": "Ten, fire.",
  "s5119": "Four, Duke Ping died.",
  "s5120": "Six, fire.",
  "s5121": "Five, Duke Gong died.",
  "s5126": "Nineteen, earthquake.",
  "s5135": "First year of Duke Dao of Cao (Wu)",
  "s5137": "First year of Duke Ping of Yan",
  "s5142": "Twenty, Qi Duke Jing with Yan Ying hunted, entered Lu asked ritual.",
  "s5143": "Twenty-six, hunted Lu borders, thereby entered Lu.",
  "s5146": "Seven, executed Wu She Shang, crown prince Jian fled Song, Wu Xu fled Wu.",
  "s5147": "Ten, duke did not believe. Falsely killed various princes. Chu crown prince Jian came fleeing, saw disorder, went Zheng.",
  "s5150": "Nine, Duke Ping died. Ling Hou grandson Dong Guo killed Ping Hou son self-established.",
  "s5152": "Eight, Chu crown prince Jian came fleeing from Song.",
  "s5154": "Five, Wu Yuan came fleeing.",
  "s5158": "Twenty-one, duke went Jin river, Jin apologized, returned. Solar eclipse.",
  "s5162": "Eight, Cai lord came fleeing.",
  "s5166": "First year of Cai Dao Hou Dong Guo, fled Chu.",
  "s5174": "Twenty-two, solar eclipse.",
  "s5176": "Six, Zhou court disorder, duke pacified disorder, established King Jing.",
  "s5189": "First year of King Jing",
  "s5190": "Twenty-three, earthquake.",
  "s5194": "Ten, Wu attacked defeated us.",
  "s5197": "Fifteen, Wu defeated army, took Hu Shen.",
  "s5200": "Eleven, Chu Jian caused disorder, executed him.",
  "s5202": "Eight, Gong Zi Guang defeated Chu.",
  "s5206": "Twenty-four, dove nested.",
  "s5210": "Eleven, Wu Bei Liang people disputed mulberry, attacked took Zhong Li.",
  "s5214": "First year of Cai Zhao Hou Shen, Dao Hou younger brother.",
  "s5216": "Twelve, duke went Jin, requested bring king.",
  "s5220": "Jia Shen",
  "s5222": "Twenty-five, duke wished execute Ji clan, three Huan clans attacked duke, duke went resided Yun."
}
