{
  "s1000": "Right General Ping En Hou Xu Jia became Chariot Cavalry General, Attendant, Guang Lu Grandee Yue Chang Hou Wang Shang became Right General, Right General Feng Feng Shi became Left General.",
  "s1015": "Jian Zhao first year",
  "s1024": "Hong dismissed.",
  "s1025": "Guang Lu Xun Kuang Heng became Imperial Secretary Grandee.",
  "s1028": "Sixth month Jia Chen, Xuan Cheng died.",
  "s1029": "Seventh month Gui Hai, Imperial Secretary Grandee Kuang Heng became chancellor, enfeoffed Yue An Hou.",
  "s1031": "Wei Wei Fan Yan Shou became Imperial Secretary Grandee.",
  "s1045": "Jing Ning first year",
  "s1048": "Sixth month Ji Wei, Wei Wei Yang Ping Hou Wang Feng became Grand Commandant, Grand General. Yan Shou died.",
  "s1049": "Third month Bing Yin, Crown Prince Junior Tutor Zhang Tan became Imperial Secretary Grandee.",
  "s1051": "Xiao Cheng Jian Shi first year",
  "s1064": "Twelfth month Ding Chou, Heng dismissed.",
  "s1065": "Seven. Eighth month Gui Chou, sent Guang Lu Xun Zhao Jia return seal cords dismissed, granted gold two hundred jin.",
  "s1066": "Tenth month, Right General Yue Chang Hou Wang Shang became Guang Lu Grandee, Right General, Executive Gold Wu Yi Yang Hou Ren Qian Qiu became Right General. Tan dismissed.",
  "s1067": "Court Judge Yin Zhong became Imperial Secretary Grandee.",
  "s1071": "Third month Jia Shen, Right General Yue Chang Hou Wang Shang became Right Chancellor.",
  "s1072": "Ren Qian Qiu became Left General, Chang Yue Wei Wei Shi Dan became Right General. Tenth month Ji Hai, Yin Zhong self-stabbed killed.",
  "s1073": "Junior Treasurer Zhang Zhong became Imperial Secretary Grandee.",
  "s1075": "He Ping first year",
  "s1090": "Tenth month Xin Mao, Shi Dan became Left General, Grand Usher Ping An Hou Wang Zhang became Right General.",
  "s1094": "Fourth month Ren Yin, Chancellor Shang dismissed.",
  "s1095": "Sixth month Bing Wu, various officials Scattered Cavalry Guang Lu Grandee Zhang Yu became chancellor.",
  "s1099": "Yang Shuo first year",
  "s1108": "Zhang Zhong died.",
  "s1109": "Sixth month, Grand Usher Wang Yin became Imperial Secretary Grandee.",
  "s1114": "Ninth month Jia Zi, Imperial Secretary Grandee Wang Yin became Chariot Cavalry General.",
  "s1115": "Tenth month Yi Mao, Guang Lu Xun Yu Yong became Imperial Secretary Grandee.",
  "s1119": "Seventh month Yi Chou, Right General Guang Lu Xun Ping An Hou Wang Zhang died.",
  "s1120": "Intercalary month Ren Xu, Yong died."
}
