{
  "s265": "Later first year",
  "s266": "Xin Yuan Ping deceives with magicians, discovered, executes him.",
  "s267": "Fourteen",
  "s270": "162",
  "s271": "Two",
  "s272": "Xiongnu peace marriage. Earth movement. Eighth month wu chen, Cang dismissed from chancellor.",
  "s273": "Fifteen. Eighth month geng wu, Imperial Secretary Shen Tu Jia becomes Chancellor, sealed as Marquis of Gu An.",
  "s275": "Imperial Secretary Qing.",
  "s276": "161",
  "s277": "Three",
  "s278": "Establishes Gu Kou town.",
  "s279": "Two",
  "s282": "160",
  "s283": "Four",
  "s285": "Three",
  "s288": "159",
  "s289": "Five",
  "s290": "Emperor visits Yong.",
  "s291": "Four",
  "s294": "158",
  "s295": "Six",
  "s296": "Xiongnu three thousand enter Shangjun, two thousand enter Yunzhong.",
  "s297": "Five",
  "s298": "Makes Central Court Gentleman Ling Mian chariot cavalry general, army at Feihu, former Chu chancellor Su Yi general, army at Gouzhu; General Zhang Wu garrison Beidi; Hedong governor Zhou Yafu general, army Xi Liu; Imperial Kinsman Liu Li army Ba Shang; Zhu Ci Hou Xu Li army Ji Men: to prepare for Hu. Several months, Hu depart, also disband.",
  "s300": "157",
  "s301": "Seven",
  "s302": "Sixth month ji hai, Filial Wen Emperor passes away. Ding wei, Crown Prince ascends. People mourn three days, buried at Ba Mausoleum.",
  "s303": "Six",
  "s304": "Commandant Yafu becomes chariot cavalry general, Palace Gentleman Commander Zhang Wu becomes Covering Earth general, Protector of Dependent States Han becomes Garrison General. Palace Steward Rong Nu becomes chariot cavalry general, serves Empress Dowager.",
  "s306": "156",
  "s307": "Filial Jing first year",
  "s308": "Establishes Filial Wen Emperor temple, commanderies and states as Grand Ancestor temples.",
  "s309": "Seven. Establishes Minister over the Masses office.",
  "s312": "155",
  "s313": "Two",
  "s314": "Establishes imperial son De as Hejian King, Yan as Linjiang King, Yu as Huaiyang King, Fei as Runan King, Peng Zu as Guangchuan King, Fa as Changsha King. Fourth month middle, Filial Wen Empress Dowager passes away. Jia passes away.",
  "s315": "Eight. Kai Feng Hou Tao Qing becomes Chancellor.",
  "s317": "Imperial Secretary Cuo.",
  "s318": "154",
  "s319": "Three",
  "s320": "Wu Chu seven states rebel, sends troops to strike, all defeat them. Imperial son Duan becomes Jiaoxi King, Sheng becomes Zhongshan King.",
  "s321": "Two. Establishes Grand Commandant office.",
  "s322": "Commandant Marquis of Tiao Zhou Yafu. Becomes Grand Commandant, strikes Wu Chu; Qu Zhou Hou Li Ji becomes general, strikes Zhao; Dou Ying becomes Grand General, garrison Xingyang, Luan Bu becomes general, strikes Qi.",
  "s324": "153",
  "s325": "Four",
  "s326": "Establishes Crown Prince.",
  "s327": "Three",
  "s328": "Two. Grand Commandant Yafu.",
  "s329": "Imperial Secretary Fen."
}
