{
  "s0399": "Twentieth year, third year, fifteenth year, twenty-fifth year, third year, thirty-sixth year, eighteenth year, because woman cause, Qi attacked us.",
  "s0400": "Fifth year, sixteenth year, Yan Xiang Gong first year",
  "s0401": "656 Twenty-first year, fourth year, thirtieth year, led feudal lords attacked Cai, Cai collapsed, then attacked Chu, demanded bundled thatch tribute.",
  "s0402": "Twenty-first year, Shen Sheng because Li Ji slander self-killed.",
  "s0403": "Chong Er fled Pu, Yi Wu fled Qu.",
  "s0404": "Fourth year, welcomed woman from Jin.",
  "s0405": "Sixteenth year, Qi attacked us, arrived Xing, made Qu Wan ally.",
  "s0406": "Twenty-sixth year, fourth year, thirty-seventh year, nineteenth year, sixth year, seventeenth year, second year",
  "s0407": "655 Twenty-second year, fifth year, thirty-first year, twenty-second year, extinguished Yu, Guo.",
  "s0408": "Chong Er fled Di.",
  "s0409": "Fifth year, seventeenth year, twenty-seventh year, fifth year, thirty-eighth year, twentieth year, seventh year, eighteenth year, third year",
  "s0410": "654 Twenty-third year, sixth year, thirty-second year, led feudal lords attacked Zheng.",
  "s0411": "Twenty-third year, Yi Wu fled Liang.",
  "s0412": "Sixth year, eighteenth year, attacked Xu, Xu ruler bare flesh apologized, Chu followed it.",
  "s0413": "Twenty-eighth year, sixth year, thirty-ninth year, twenty-first year, eighth year, nineteenth year, fourth year",
  "s0414": "653 Twenty-fourth year, seventh year, thirty-third year, twenty-fourth year, seventh year, nineteenth year, twenty-ninth year, seventh year, fortieth year, twenty-second year, ninth year, twentieth year, fifth year",
  "s0415": "652 Twenty-fifth year, Xiang Wang established, feared Tai Shu.",
  "s0416": "Eighth year, thirty-fourth year, twenty-fifth year, attacked Di, because Chong Er cause.",
  "s0417": "Eighth year, twentieth year, thirtieth year, duke ill, crown prince Zi Fu yielded elder brother Mu Yi worthy, duke not listened.",
  "s0418": "Eighth year, forty-first year, twenty-third year, Cao Gong Gong first year, twenty-first year, sixth year",
  "s0419": "651 Xiang Wang first year, feudal lords established king.",
  "s0420": "Ninth year, Qi led us attacked Jin chaos, arrived Gao Liang returned.",
  "s0421": "Thirty-fifth year, summer, assembled feudal lords at Kui Qiu.",
  "s0422": "Son of Heaven made prime minister grant blessing meat, commanded no bow.",
  "s0423": "Twenty-sixth year, duke died, established Xi Qi, Li Ke killed him.",
  "s0424": "And Zhuo Zi.",
  "s0425": "Established Yi Wu.",
  "s0426": "Ninth year, Yi Wu made Xi Rui bribe, sought enter.",
  "s0427": "Twenty-first year, thirty-first year, duke died, not buried, Qi Huan assembled Kui Qiu.",
  "s0428": "Ninth year, forty-second year, twenty-fourth year, second year, twenty-second year, seventh year",
  "s0429": "650 Second year, tenth year, thirty-sixth year, made Xi Peng establish Jin Hui Gong.",
  "s0430": "Jin Hui Gong Yi Wu first year, executed Li Ke, doubled Qin treaty.",
  "s0431": "Tenth year, Pi Zheng Zi Bao fled came.",
  "s0432": "Twenty-second year, Song Xiang Gong Zi Fu first year, Mu Yi chancellor.",
  "s0433": "Tenth year, forty-third year, twenty-fifth year, third year, twenty-third year, eighth year",
  "s0434": "649 Third year, Rong attacked us, Tai Shu Dai summoned them.",
  "s0435": "Wished execute Shu Dai, Shu Dai fled Qi.",
  "s0436": "Eleventh year, thirty-seventh year, second year, eleventh year, rescued king attacked Rong, Rong departed.",
  "s0437": "Twenty-third year, attacked Huang.",
  "s0438": "Second year, eleventh year, forty-fourth year, twenty-sixth year, fourth year, twenty-fourth year, had concubine dream heaven gave orchid, gave birth to Mu Gong Lan.",
  "s0439": "Ninth year",
  "s0440": "648 Fourth year, twelfth year, thirty-eighth year, made Guan Zhong pacify Rong at Zhou, wished with upper minister rites, declined, received lower minister.",
  "s0441": "Third year, twelfth year, twenty-fourth year, third year, twelfth year, forty-fifth year, twenty-seventh year, fifth year, twenty-fifth year, tenth year",
  "s0442": "647 Jishen fifth year, thirteenth year, thirty-ninth year, made Zhong Sun request king, spoke Shu Dai, king angry.",
  "s0443": "Fourth year, famine, requested grain, Qin gave us.",
  "s0444": "Thirteenth year, Pi Bao wished not give, duke not listened, transported Jin grain, rose Yong to Jiang.",
  "s0445": "Twenty-fifth year, fourth year, thirteenth year, Chen Mu Gong Kuan first year, twenty-eighth year, sixth year, twenty-sixth year, eleventh year",
  "s0446": "646 Sixth year, fourteenth year, fortieth year, fifth year, Qin famine, requested grain, Jin doubled it.",
  "s0447": "Fourteenth year, twenty-sixth year, extinguished Liu, Ying.",
  "s0448": "Fifth year, fourteenth year, second year, twenty-ninth year, seventh year, twenty-seventh year, twelfth year",
  "s0449": "645 Seventh year, fifteenth year, fifth month, solar eclipse.",
  "s0450": "Not recorded, historian officials lost it.",
  "s0451": "Forty-first year, sixth year, Qin captured Hui Gong, again established him.",
  "s0452": "Fifteenth year, with thief ate good horses knight obtained broke Jin.",
  "s0453": "Twenty-seventh year, sixth year, fifteenth year, third year, Cai Zhuang Hou Jia Wu first year, eighth year, twenty-eighth year, thirteenth year",
  "s0454": "644 Eighth year, sixteenth year, forty-second year, king with Rong bandits reported Qi, Qi summoned feudal lords garrison Zhou.",
  "s0455": "Seventh year, Chong Er heard Guan Zhong died, left Di went Qi.",
  "s0456": "Sixteenth year, established Hedong official overseers.",
  "s0457": "Twenty-eighth year, seventh year, fell five stones.",
  "s0458": "Sixth year, ducks retreated flew, passed our capital.",
  "s0459": "Sixteenth year, fourth year, second year, ninth year, twenty-ninth year, fourteenth year",
  "s0460": "643 Ninth year, seventeenth year, forty-third year, eighth year, seventeenth year, twenty-ninth year, eighth year, seventeenth year, fifth year, third year, tenth year, thirtieth year, fifteenth year",
  "s0461": "642 Tenth year, eighteenth year, Qi Xiao Gong Zhao first year, ninth year, eighteenth year, thirtieth year, ninth year, eighteenth year, sixth year, fourth year, eleventh year, thirty-first year, sixteenth year",
  "s0462": "641 Eleventh year, nineteenth year, second year, tenth year, nineteenth year, extinguished Liang.",
  "s0463": "Liang fond walled, not dwelt, people tired, mutually alarmed, therefore perished.",
  "s0464": "Thirty-first year, tenth year, nineteenth year, seventh year, fifth year, twelfth year, thirty-second year, seventeenth year",
  "s0465": "640 Twelfth year, twentieth year, third year, eleventh year, twentieth year, thirty-second year, eleventh year, twentieth year, eighth year, sixth year, thirteenth year, thirty-third year, eighteenth year",
  "s0466": "639 Thirteenth year, twenty-first year, fourth year, twelfth year, twenty-first year, thirty-third year, arrested Song Xiang Gong, again returned him.",
  "s0467": "Twelfth year, summoned Chu ally.",
  "s0468": "Twenty-first year, ninth year, seventh year, fourteenth year, thirty-fourth year, nineteenth year",
  "s0469": "638 Fourteenth year, Shu Dai again returned to Zhou.",
  "s0470": "Twenty-second year, fifth year, returned king younger brother Dai.",
  "s0471": "Thirteenth year, crown prince Yu hostage Qin fled returned.",
  "s0472": "Twenty-second year, thirty-fourth year, thirteenth year, Hong battle, Chu defeated duke.",
  "s0473": "Twenty-second year, tenth year, eighth year, fifteenth year, thirty-fifth year, duke went Chu, Song attacked us.",
  "s0474": "Twentieth year",
  "s0475": "637 Jishen fifteenth year, twenty-third year, sixth year, attacked Song, because they not same ally.",
  "s0476": "Fourteenth year, Yu established, this was Huai Gong.",
  "s0477": "Twenty-third year, welcomed Chong Er from Chu, thickly honored him, married woman to him.",
  "s0478": "Chong Er wished return.",
  "s0479": "Thirty-fifth year, Chong Er passed, thickly honored him.",
  "s0480": "Fourteenth year, duke ill died Hong battle.",
  "s0481": "Twenty-third year, Chong Er from Qi passed, without courtesy.",
  "s0482": "Eleventh year, ninth year, sixteenth year, Chong Er passed, without courtesy, Xi Fu Ji privately good.",
  "s0483": "Thirty-sixth year, Chong Er passed, without courtesy, Shu Zhan advised.",
  "s0484": "Twenty-first year",
  "s0485": "636 Sixteenth year, king fled Si.",
  "s0486": "Si, Zheng land.",
  "s0487": "Twenty-fourth year, seventh year, Jin Wen Gong first year, executed Zi Yu.",
  "s0488": "Wei Wu Zi as Wei grand master, Zhao Shuai as Yuan grand master.",
  "s0489": "Jiu Fan said 'seek hegemony nothing like inner king.'",
  "s0490": "Twenty-fourth year, with troops sent Chong Er.",
  "s0491": "Thirty-sixth year, Song Cheng Gong Wang Chen first year, twenty-fourth year, twelfth year, tenth year, seventeenth year, thirty-seventh year, twenty-second year",
  "s0492": "635 Seventeenth year, Jin welcomed king.",
  "s0493": "Twenty-fifth year, eighth year, second year, twenty-fifth year, wished inner king, army Yellow River on.",
  "s0494": "Thirty-seventh year, second year, twenty-fifth year, thirteenth year, eleventh year, eighteenth year, thirty-eighth year, twenty-third year",
  "s0495": "634 Eighteenth year, twenty-sixth year, ninth year, third year, Song submitted.",
  "s0496": "Twenty-sixth year, thirty-eighth year, third year, doubled Chu close Jin.",
  "s0497": "Wei Cheng Gong Zheng first year, fourteenth year, twelfth year, nineteenth year, thirty-ninth year, twenty-fourth year",
  "s0498": "633 Nineteenth year, twenty-seventh year, tenth year, fourth year, twenty-seventh year, fortieth year, fourth year, Chen Wen Gong Qiu first year, fifteenth year, thirteenth year, twentieth year, fortieth year, twenty-fifth year"
}
