{
  "s0031": {
    "chinese": "諸侯皆曰：「紂可伐也。」",
    "literal": "Feudal lords all said 'Zhou can attack'.",
    "idiomatic": "All the feudal lords said: 'King Zhou can be attacked.'"
  },
  "s0032": {
    "chinese": "武王曰：「未可。」",
    "literal": "Wu Wang said 'not yet can'.",
    "idiomatic": "King Wu said: 'Not yet.'"
  },
  "s0033": {
    "chinese": "還師，與太公作此太誓。",
    "literal": "Returned army, with Tai Gong made this Tai Oath.",
    "idiomatic": "Upon returning the army, he composed the Great Oath with Tai Gong."
  },
  "s0034": {
    "chinese": "居二年，紂殺王子比干，囚箕子。",
    "literal": "Dwelt two years, Zhou killed Wang Zi Bi Gan, imprisoned Ji Zi.",
    "idiomatic": "Two years passed, and King Zhou killed Prince Bi Gan and imprisoned Ji Zi."
  },
  "s0035": {
    "chinese": "武王將伐紂，卜龜兆，不吉，風雨暴至。",
    "literal": "Wu Wang about attack Zhou, divined tortoise signs, not auspicious, wind rain violent arrived.",
    "idiomatic": "When King Wu was about to attack King Zhou, he consulted the oracle with tortoise shells, but the signs were inauspicious, and violent wind and rain suddenly arrived."
  },
  "s0036": {
    "chinese": "群公盡懼，唯太公彊之勸武王，武王於是遂行。",
    "literal": "Group dukes all feared, only Tai Gong strongly advised Wu Wang, Wu Wang thus proceeded.",
    "idiomatic": "All the nobles were terrified, but only Tai Gong strongly urged King Wu forward, and thus King Wu proceeded."
  },
  "s0037": {
    "chinese": "十一年正月甲子，誓於牧野，伐商紂。",
    "literal": "Eleven years first month jia zi, swore at Mu Ye, attacked Shang Zhou.",
    "idiomatic": "In the eleventh year, first month, jiazi day, they swore the oath at Muye and attacked the Shang king Zhou."
  },
  "s0038": {
    "chinese": "紂師敗績。",
    "literal": "Zhou army defeated routed.",
    "idiomatic": "King Zhou's army was utterly defeated."
  },
  "s0039": {
    "chinese": "紂反走，登鹿臺，遂追斬紂。",
    "literal": "Zhou contrary fled, ascended Lu Tai, thus pursued chopped Zhou.",
    "idiomatic": "King Zhou fled in the opposite direction, climbed the Deer Terrace, and was pursued and executed."
  },
  "s0040": {
    "chinese": "明日，武王立于社，群公奉明水，衛康叔封布采席，師尚父牽牲，史佚策祝，以告神討紂之罪。",
    "literal": "Tomorrow, Wu Wang stood at She, group dukes offered clear water, Wei Kang Shu sealed spread ritual mat, Master Shang Fu led sacrificial animal, Shi Yi wrote prayer, to announce gods punished Zhou crime.",
    "idiomatic": "The next day, King Wu stood at the Altar of Soil. The nobles offered pure water, Wei Kangshu spread the ritual mat, Master Shangfu led the sacrificial animal, and Shi Yi composed the prayer to inform the gods that Zhou's crimes had been punished."
  },
  "s0041": {
    "chinese": "散鹿臺之錢，發鉅橋之粟，以振貧民。",
    "literal": "Scattered Lu Tai money, opened Ju Qiao grain, to relieve poor people.",
    "idiomatic": "He distributed the money from the Deer Terrace and opened the granaries at Ju Bridge to aid the poor people."
  },
  "s0042": {
    "chinese": "封比干墓，釋箕子囚。",
    "literal": "Sealed Bi Gan tomb, released Ji Zi prisoner.",
    "idiomatic": "He honored Bi Gan's tomb and released Ji Zi from prison."
  },
  "s0043": {
    "chinese": "遷九鼎，修周政，與天下更始。",
    "literal": "Moved nine tripods, repaired Zhou governance, with all under heaven renewed beginning.",
    "idiomatic": "He moved the Nine Tripods, reformed Zhou governance, and began anew with all under heaven."
  },
  "s0044": {
    "chinese": "師尚父謀居多。",
    "literal": "Master Shang Fu strategy resided many.",
    "idiomatic": "Master Shangfu contributed most of the strategies."
  },
  "s0045": {
    "chinese": "於是武王已平商而王天下，封師尚父於齊營丘。",
    "literal": "Thus Wu Wang already pacified Shang and king all under heaven, sealed Master Shang Fu at Qi Ying Qiu.",
    "idiomatic": "Thus King Wu pacified the Shang and became king of all under heaven, enfeoffing Master Shangfu at Qi in Yingqiu."
  },
  "s0046": {
    "chinese": "東就國，道宿行遲。",
    "literal": "East toward state, road lodged delayed.",
    "idiomatic": "He traveled east toward his fief, stopping along the way and proceeding slowly."
  },
  "s0047": {
    "chinese": "逆旅之人曰：「吾聞時難得而易失。",
    "literal": "Inn person said 'I heard opportunity hard get easy lose.",
    "idiomatic": "The innkeeper said: 'I have heard that opportunities are hard to obtain and easy to lose."
  },
  "s0048": {
    "chinese": "客寢甚安，殆非就國者也。」",
    "literal": "Guest sleeps very peaceful, probably not toward state person'.",
    "idiomatic": "This guest sleeps so peacefully - he is probably not someone heading toward his fief.'"
  },
  "s0049": {
    "chinese": "太公聞之，夜衣而行，犁明至國。",
    "literal": "Tai Gong heard it, night clothed and went, plowed dawn arrived state.",
    "idiomatic": "Tai Gong heard this, dressed at night and departed, arriving at his state by dawn."
  },
  "s0050": {
    "chinese": "萊侯來伐，與之爭營丘。",
    "literal": "",
    "idiomatic": "The Marquis of Lai came to attack, and they fought over Yingqiu."
}
}
