{
  "s0246": "Now the sacrifices to the Supreme Deity and the various mountain and river spirits that should be sacrificed to, each will be sacrificed to according to their times and rituals as before.'",
  "s0248": "Four years later, when the realm was already settled, he commanded the censor to order Feng to carefully maintain the Fen Yu Altar, constantly sacrificing to it in the four seasons, in spring using pigs and sheep.",
  "s0249": "He ordered the invocator officials to establish Chi You's sacrifice in Chang'an.",
  "s0250": "Chang'an established invocator officials and female shamans.",
  "s0251": "The Liang shamans sacrificed to heaven, earth, heavenly altar, heavenly water, inner chambers, halls above, and others;",
  "s0252": "the Jin shamans sacrificed to the five emperors, eastern lord, cloud middle lord, destiny master, shaman altar, shaman temple, clansmen, first cooks, and others;",
  "s0253": "the Qin shamans sacrificed to the altar lord, shaman protector, clan multitudes, and others;",
  "s0254": "the Jing shamans sacrificed to hall below, shaman ancestors, destiny master, spreading spirits, and others;",
  "s0255": "the nine heaven shamans sacrificed to the nine heavens: all sacrificed in the palace according to the seasons.",
  "s0256": "The river shamans sacrificed to the river at Linjin, and the southern mountain shamans sacrificed to the southern mountains in Qin central.",
  "s0257": "Qin central refers to the Second Emperor.",
  "s0258": "Each had its time and day.",
  "s0259": "Two years later, some said that when Zhou arose they settled in Tai, established Hou Ji's sacrifice, and to this day receive blood sacrifices throughout the realm.",
  "s0260": "Therefore Gaozu issued an edict to the censor: 'Order the commanderies, kingdoms, and counties to establish the spirit star sacrifice, constantly sacrificing to it with oxen according to the seasons.'",
  "s0262": "In Gaozu's tenth year spring, the officials requested to order the counties to constantly sacrifice to the altars and grains in spring's second month and at year's end with pigs and sheep, and the village altars would each use their own wealth for sacrifices.",
  "s0263": "The edict said: 'Approved.'",
  "s0265": "Eighteen years later, Emperor Wen ascended the throne.",
  "s0266": "In his thirteenth year of reign, he issued an edict saying: 'Now the secret prayers transfer calamities downward, I greatly disapprove.",
  "s0267": "From now on, abolish them.'",
  "s0269": "At first, famous mountains and great rivers were in the feudal lords' territories, the feudal lords' invocators each maintained their own sacrifices, the Son of Heaven's officials did not oversee them.",
  "s0270": "When the Qi and Huainan kingdoms were abolished, he ordered the grand invocator to completely perform the seasonal rituals as before.",
  "s0271": "That year, the edict said: 'I have now been on the throne thirteen years, relying on the ancestral temples' spirits and the altars' blessings, the realm within the borders is peaceful, the people have no illnesses.",
  "s0272": "Recently there have been good harvests for several years, due to my lack of virtue, how can I enjoy this?",
  "s0273": "It is all the Supreme Deity and various spirits' blessings.",
  "s0274": "I have heard that in ancient times, those who enjoyed virtue necessarily repaid merit, and wish to increase the sacrifices to the various spirits.",
  "s0275": "The officials discussed increasing Yong's five altars by one road carriage each, with harnesses and coverings;",
  "s0276": "the western altar and qi altar by one wooden carriage each, four wooden horses, with harnesses and coverings;",
  "s0277": "the Yellow River, Jiao, Han River to add two pieces of jade each;",
  "s0278": "and for the various sacrifices, each to broaden the altar grounds, adding jade, silk, sacrificial stands, and vessels according to rank.",
  "s0279": "The praying invocators should return blessings to me, the people should not participate.",
  "s0280": "From now on, when praying, show respect, do not make any requests.'",
  "s0282": "The Lu man Gongsun Chen submitted a memorial saying: 'At first Qin obtained water virtue, now Han receives it, following the cycles of beginning and end transmission, then Han should be earth virtue, the response to earth virtue is yellow dragons appearing.",
  "s0283": "We should correct the calendar, change the clothing colors, take yellow as the superior color.'",
  "s0284": "At this time Chancellor Zhang Cang liked laws and calendars, believing Han was the beginning of water virtue, so the river breaking the golden dike was its omen.",
  "s0285": "The year began in winter's tenth month, color was black outside and red inside, matching the virtue.",
  "s0286": "Gongsun Chen's words were not correct.",
  "s0287": "He dismissed him.",
  "s0288": "Three years later, a yellow dragon appeared at Chengji.",
  "s0289": "Emperor Wen then summoned Gongsun Chen, appointed him as a doctor, and with the various scholars drafted matters of changing the calendar and clothing colors.",
  "s0290": "That summer, he issued an edict saying: 'Strange spiritual objects have appeared at Chengji, without harming the people, the year has good harvests.",
  "s0291": "I pray at the suburban sacrifices to the Supreme Deity and various spirits, the ritual officials discuss, do not avoid laboring me.'",
  "s0292": "All the officials said: 'In ancient times the Son of Heaven personally performed the summer suburban sacrifice, sacrificing to the Supreme Deity in the suburbs, hence called suburban.'",
  "s0293": "Therefore in summer's fourth month, Emperor Wen began the suburban audience, sacrificing at Yong's five altars, all clothing was upper red.",
  "s0294": "The next year, the Zhao man Xin Yuangping, by observing vapors, saw the emperor and said: 'Northeast of Chang'an there is divine vapor forming five colors, like a man's hat tassel.",
  "s0295": "Some say it is the northeast divine spirits' dwelling, the west divine spirits' tomb.",
  "s0296": "Heavenly auspicious signs have descended, we should establish sacrifices to the Supreme Deity to match the omens and responses.'",
  "s0297": "Therefore they built the Wei Yang Five Emperors Temple, same building, one hall per emperor, each facing five gates, each matching their emperor's color.",
  "s0298": "The sacrificial materials used and ceremonies were also like Yong's five altars.",
  "s0299": "In summer's fourth month, Emperor Wen personally bowed at the Ba Wei gathering, performing suburban audience at Wei Yang's five emperors."
}
