{
  "s0401": "You Wang's second year, he attacked Wei.",
  "s0402": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0403": "On Ji Mao, Zhao Wang fled.",
  "s0404": "On Geng Chen, the Wu people entered Ying.",
  "s0405": "Zhao Wang fled to Yun Meng.",
  "s0406": "The people of Yun Meng did not recognize their king and shot and wounded him.",
  "s0407": "The king fled to Yun.",
  "s0408": "Yun Gong's younger brother Huai said: 'Ping Wang killed my father, now I will kill his son - would that not be fitting?'",
  "s0409": "Yun Gong stopped him, but fearing he would assassinate Zhao Wang, he accompanied the king and fled to Sui.",
  "s0410": "The Wu king heard Zhao Wang had gone there, so he advanced to attack Sui, telling the Sui people: 'The Zhou descendants enfeoffed between the Jiang and Han rivers - Chu has extinguished them all.'",
  "s0411": "He wanted to kill Zhao Wang.",
  "s0412": "The king's follower Zi Qi secretly hid the king, pretending to be the king himself, telling the Sui people: 'Give me to Wu.'",
  "s0413": "The Sui people divined giving him to Wu, but it was inauspicious, so they apologized to the Wu king: 'Zhao Wang has fled, he is not in Sui.'",
  "s0414": "Wu requested to enter and search themselves, but Sui would not allow it, so Wu also withdrew.",
  "s0415": "When Zhao Wang fled Ying, he sent Shen Bao Xu to request aid from Qin.",
  "s0416": "Qin sent five hundred chariots to rescue Chu, and Chu also gathered its remaining scattered troops to attack Wu together with Qin.",
  "s0417": "In the eleventh year, sixth month, they defeated Wu at Ji.",
  "s0418": "At this time, Wu Wang's younger brother Fu Gai saw Wu Wang's troops were injured and defeated, so he fled back and established himself as king.",
  "s0419": "He L端 heard this and led his troops away from Chu, returning to attack Fu Gai.",
  "s0420": "Fu Gai was defeated and fled to Chu, where Chu enfeoffed him at Tang Xi, calling him the Tang Xi clan.",
  "s0421": "Chu Zhao Wang extinguished Tang in nine months and returned to enter Ying.",
  "s0422": "In the twelfth year, Wu again attacked Chu and took Fan.",
  "s0423": "Chu was afraid and left Ying, moving the capital north to Dui.",
  "s0424": "In the sixteenth year, Confucius became prime minister of Lu.",
  "s0425": "In the twentieth year, Chu extinguished Dun and extinguished Hu.",
  "s0426": "In the twenty-first year, Wu Wang He L端 attacked Yue.",
  "s0427": "Yue Wang Gou Jian shot and wounded Wu Wang, who then died.",
  "s0428": "Wu thus resented Yue and did not attack Chu to the west.",
  "s0429": "In the twenty-seventh year, spring, Wu attacked Chen, and Chu Zhao Wang rescued it, camping at Cheng Fu.",
  "s0430": "In the tenth month, Zhao Wang fell ill in the army camp, with red clouds like birds flying alongside the sun.",
  "s0431": "Zhao Wang asked Zhou's Grand Historian, who said: 'This bodes ill for the Chu king, but it can be transferred to the generals and ministers.'",
  "s0432": "The generals and ministers heard this and requested to sacrifice themselves to the spirits.",
  "s0433": "Zhao Wang said: 'Generals and ministers are my limbs - now transferring the calamity, how can I let them bear it!'",
  "s0434": "He would not listen.",
  "s0435": "They divined that the River was causing the trouble, and the grand masters requested to sacrifice to the River.",
  "s0436": "Zhao Wang said: 'Since my ancestors received the enfeoffment, their domain did not extend beyond the Jiang and Han rivers, and the River is not something we have offended.'",
  "s0437": "He stopped them and would not allow it.",
  "s0438": "Confucius was in Chen and heard this, saying: 'Chu Zhao Wang understands the great Way.",
  "s0439": "That he does not lose his state is fitting!'",
  "s0441": "Zhao Wang's illness grew severe, so he summoned the various princes and grand masters: 'I am unworthy, having twice brought shame to Chu's armies, now I can end with a natural lifespan - this is my good fortune.'",
  "s0442": "He yielded to his younger brother Gong Zi Shen to become king, but he would not accept.",
  "s0443": "He again yielded to his next younger brother Gong Zi Jie, who also would not accept.",
  "s0444": "He then yielded to his next younger brother Gong Zi L端, yielding five times before he finally agreed to become king.",
  "s0445": "They were about to fight when, on Geng Yin, Zhao Wang died in the army camp.",
  "s0446": "Zi L端 said: 'The king was gravely ill and, abandoning his son, yielded to his ministers. I agreed to the king to broaden his intentions.",
  "s0447": "Now the king has died, how dare I forget the king's intentions!'",
  "s0448": "Thus he plotted with Zi Xi and Zi Qi, hid troops and blocked the roads, welcomed Yue Nu's son Zhang and established him as king, who became Hui Wang.",
  "s0449": "Then they dismissed the troops and returned, burying Zhao Wang.",
  "s0450": "In Hui Wang's second year, Zi Xi summoned the former Ping Wang Crown Prince Jian's son Sheng from Wu to be the Nest grand master, calling him Bai Gong.",
  "s0451": "Bai Gong loved military affairs and treated worthy men well, desiring to avenge his grievances.",
  "s0452": "In the sixth year, Bai Gong requested troops from Prime Minister Zi Xi to attack Zheng.",
  "s0453": "Initially, Bai Gong's father Jian had fled to Zheng, where Zheng killed him, so Bai Gong fled to Wu, and Zi Xi again summoned him, thus he resented Zheng and wanted to attack it.",
  "s0454": "Zi Xi gave him troops, and Bai Gong defeated Zheng and took Xiang Ling.",
  "s0455": "He returned and attacked Zheng again, defeating them at Fang Cheng.",
  "s0456": "He was arrogant and wanted to seize the Chu government.",
  "s0457": "Zi Xi feared this and did not give him more troops.",
  "s0458": "Bai Gong then allied with Qi Zhao and attacked Zi Xi and Zi Qi, killing them.",
  "s0459": "He seized the Chu capital and summoned Hui Wang from Cheng Fu.",
  "s0460": "Hui Wang feared and fled to Sui, then to Cai.",
  "s0461": "Bai Gong established himself as king.",
  "s0462": "In the seventh year, the Chu people resented Bai Gong's actions.",
  "s0463": "The grand masters plotted with each other: 'We raised him, but he has turned against us.'",
  "s0464": "They sent Yin Qi to Sui to welcome Hui Wang back.",
  "s0465": "Hui Wang returned and entered the Chu capital.",
  "s0466": "The people of Chu attacked Bai Gong, who fled to the mountains and committed suicide.",
  "s0467": "Hui Wang was restored, and he granted Yin Qi the surname Wang Sun.",
  "s0468": "In Hui Wang's tenth year, he died, and his son Jian Wang Sheng ascended the throne.",
  "s0469": "Jian Wang's first year, he attacked Song.",
  "s0470": "In the second year, he attacked Zheng.",
  "s0471": "In the fourth year, Jian Wang died, and his son Sheng Wang Dang ascended the throne.",
  "s0472": "Sheng Wang's first year, he attacked Song.",
  "s0473": "In the second year, he attacked Wei.",
  "s0474": "In the third year, Sheng Wang died, and his son Dao Wang Yi ascended the throne.",
  "s0475": "Dao Wang's first year, he attacked Song.",
  "s0476": "In the twelfth year, Dao Wang died, and his son Xuan Wang Liang ascended the throne.",
  "s0477": "Xuan Wang's first year, he attacked Wei.",
  "s0478": "In the third year, he attacked Song.",
  "s0479": "In the fourth year, Xuan Wang died, and his son Wei Wang Shang ascended the throne.",
  "s0480": "Wei Wang's first year, he attacked Zheng.",
  "s0481": "In the fifth year, Wei Wang died, and his son Bao Wang Ying ascended the throne.",
  "s0482": "Bao Wang's first year, he attacked Song.",
  "s0483": "In the sixth year, Bao Wang died, and his son Xuan Wang Wei ascended the throne.",
  "s0484": "Xuan Wang's first year, he attacked Song.",
  "s0485": "In the third year, he attacked Wei.",
  "s0486": "In the sixth year, Xuan Wang died, and his son Hui Wang Wei ascended the throne.",
  "s0487": "Hui Wang's first year, he attacked Song.",
  "s0488": "In the fourth year, Hui Wang died, and his son Zhao Wang Wei ascended the throne.",
  "s0489": "Zhao Wang's first year, he attacked Song.",
  "s0490": "In the second year, he attacked Zheng.",
  "s0491": "In the third year, Zhao Wang died, and his son You Wang Lu ascended the throne.",
  "s0492": "You Wang's first year, he attacked Song.",
  "s0493": "In the second year, he attacked Zheng.",
  "s0494": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0495": "Ai Wang's first year, he attacked Song.",
  "s0496": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0497": "Shen Wang's first year, he attacked Song.",
  "s0498": "In the second year, he attacked Wei.",
  "s0499": "In the sixth year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0500": "You Wang's first year, he attacked Wei."
}
