{
  "s1199": "Seventeenth year, eighteenth year, thirty-sixth year, third year, twentieth year, three states people dreamed many gentlemen stood society palace, planned perish Cao, Zhen Duo requested wait Gong Sun Qiang, permitted it.",
  "s1200": "Second year, sixth year, sixteenth year",
  "s1201": "498 Twenty-second year, twelfth year, Qi came return female musicians, Ji Huan Zi accepted them, Confucius departed.",
  "s1202": "Fiftieth year, sent Lu female musicians.",
  "s1203": "Fourteenth year, third year, eighteenth year, nineteenth year, thirty-seventh year, attacked Cao.",
  "s1204": "Fourth year, twenty-first year, fourth year, Wei attacked us.",
  "s1205": "Third year, seventh year, seventeenth year",
  "s1206": "497 Jiachen twenty-third year, thirteenth year, fifty-first year, fifteenth year, Zhao Yang attacked Fan, Zhong Xing.",
  "s1207": "Fourth year, nineteenth year, twentieth year, thirty-eighth year, Confucius came, paid him like Lu.",
  "s1208": "Fifth year, twenty-second year, fifth year, fourth year, eighth year, eighteenth year",
  "s1209": "496 Twenty-fourth year, fourteenth year, fifty-second year, sixteenth year, fifth year, twentieth year, twenty-first year, thirty-ninth year, crown prince Kuai Kui fled out.",
  "s1210": "Sixth year, Confucius came.",
  "s1211": "Twenty-third year, sixth year, Gong Sun Qiang fond archery, offered geese, ruler made him Si Cheng, dreamers departed.",
  "s1212": "Fifth year, Zi Chan died.",
  "s1213": "Ninth year, nineteenth year, attacked Yue, defeated us, injured He Lu finger, died.",
  "s1214": "495 Twenty-fifth year, fifteenth year, Ding Gong died.",
  "s1215": "Solar eclipse.",
  "s1216": "Fifty-third year, seventeenth year, sixth year, twenty-first year, extinguished Hu.",
  "s1217": "Because Wu defeated, we doubled them.",
  "s1218": "Twenty-second year, Zheng attacked us.",
  "s1219": "Fortieth year, seventh year, twenty-fourth year, seventh year, sixth year, attacked Song.",
  "s1220": "Tenth year, Wu Wang Fu Chai first year",
  "s1221": "494 Twenty-sixth year, Lu Ai Gong Jiang first year, fifty-fourth year, attacked Jin.",
  "s1222": "Eighteenth year, Zhao Yang surrounded Fan, Zhong Xing Zhao Ge.",
  "s1223": "Qi, Wei attacked us.",
  "s1224": "Seventh year, twenty-second year, led feudal lords surrounded Cai.",
  "s1225": "Twenty-third year, forty-first year, attacked Jin.",
  "s1226": "Eighth year, Wu attacked us.",
  "s1227": "Twenty-fifth year, Chu attacked us, because Wu enmity.",
  "s1228": "Eighth year, seventh year, eleventh year, second year, attacked Yue.",
  "s1229": "493 Twenty-seventh year, second year, fifty-fifth year, transported Fan, Zhong Xing clan grain.",
  "s1230": "Nineteenth year, Zhao Yang surrounded Fan, Zhong Xing, Zheng came rescue, we defeated them.",
  "s1231": "Eighth year, twenty-third year, twenty-fourth year, forty-second year, Ling Gong died.",
  "s1232": "Kuai Kui son Che established.",
  "s1233": "Jin welcomed crown prince Kuai Kui at Qi.",
  "s1234": "Ninth year, twenty-sixth year, feared Chu, privately summoned Wu people, begged move to Zhou Lai, Zhou Lai near Wu.",
  "s1235": "Ninth year, eighth year, rescued Fan, Zhong Xing clan, battled Zhao Yang at Tie, defeated our army.",
  "s1236": "Twelfth year, third year",
  "s1237": "492 Twenty-eighth year, third year, earthquake.",
  "s1238": "Fifty-sixth year, twentieth year, ninth year, twenty-fourth year, twenty-fifth year, Confucius passed Song, Huan Dai hated him.",
  "s1239": "Wei Chu Gong Che first year, tenth year, twenty-seventh year, tenth year, Song attacked us.",
  "s1240": "Ninth year, Yan Xian Gong first year, fourth year",
  "s1241": "491 Twenty-ninth year, fourth year, fifty-seventh year, begged rescue Fan clan.",
  "s1242": "Twenty-first year, Zhao Yang captured Han Dan, Bo Ren, had them.",
  "s1243": "Tenth year, Hui Gong died.",
  "s1244": "Twenty-fifth year, twenty-sixth year, second year, eleventh year, twenty-eighth year, grand masters together executed Zhao Hou.",
  "s1245": "Eleventh year, tenth year, second year, fifth year",
  "s1246": "490 Thirtieth year, fifth year, fifty-eighth year, Jing Gong died.",
  "s1247": "Established favored lady son as crown prince.",
  "s1248": "Twenty-second year, Zhao Yang defeated Fan Zhong Xing, Zhong Xing fled Qi.",
  "s1249": "Attacked Wei.",
  "s1250": "Qin Dao Gong first year, twenty-sixth year, twenty-seventh year, third year, Jin attacked us, rescued Fan clan cause.",
  "s1251": "Twelfth year, Cai Cheng Hou Shuo first year, twelfth year, eleventh year, third year, sixth year",
  "s1252": "489 Thirty-first year, sixth year, Qi Yan Ru Zi first year, Tian Qi falsely established Yang Sheng, killed Ru Zi.",
  "s1253": "Twenty-third year, second year, twenty-seventh year, rescued Chen, wang died Cheng Fu.",
  "s1254": "Twenty-eighth year, attacked Cao.",
  "s1255": "Fourth year, thirteenth year, Wu attacked us, Chu came rescue.",
  "s1256": "Second year, thirteenth year, Song attacked us.",
  "s1257": "Twelfth year, fourth year, seventh year, attacked Chen.",
  "s1258": "488 Thirty-second year, seventh year, duke assembled Wu wang at Zeng.",
  "s1259": "Wu demanded one hundred penned animals, Ji Kang Zi sent Zi Gong apologize.",
  "s1260": "Qi Dao Gong Yang Sheng first year, twenty-fourth year, invaded Wei.",
  "s1261": "Third year, Chu Hui Wang Zhang first year, twenty-ninth year, invaded Zheng, surrounded Cao.",
  "s1262": "Fifth year, Jin invaded us.",
  "s1263": "Fourteenth year, third year, fourteenth year, Song surrounded us, Zheng rescued us.",
  "s1264": "Thirteenth year, fifth year, eighth year, Lu assembled us Zeng.",
  "s1265": "487 Jiajin thirty-third year, eighth year, Wu for Zhu attacked us, arrived city walls, allied and departed.",
  "s1266": "Qi took our three cities.",
  "s1267": "Second year, attacked Lu, took three cities.",
  "s1268": "Twenty-fifth year, fourth year, second year, Zi Xi summoned Jian Zi Sheng from Wu, as Bai Gong.",
  "s1269": "Thirtieth year, Cao doubled us, we extinguished them.",
  "s1270": "Sixth year, fifteenth year, fourth year, fifteenth year, Song extinguished Cao, captured Bo Yang.",
  "s1271": "Fourteenth year, sixth year, ninth year, attacked Lu.",
  "s1272": "486 Thirty-fourth year, ninth year, third year, twenty-sixth year, fifth year, third year, attacked Chen, Chen with Wu cause.",
  "s1273": "Thirty-first year, Zheng surrounded us, defeated them at Yong Qiu.",
  "s1274": "Seventh year, sixteenth year, doubled Chu, allied with Wu.",
  "s1275": "Fifth year, fifteenth year, surrounded Song, defeated our army Yong Qiu, attacked us.",
  "s1276": "Seventh year, tenth year",
  "s1277": "485 Thirty-fifth year, tenth year, allied with Wu attacked Qi.",
  "s1278": "Fourth year, Wu, Lu attacked us.",
  "s1279": "Bao Zi killed Dao Gong, Qi people established his son Ren as Jian Gong.",
  "s1280": "Twenty-seventh year, sent Zhao Yang attacked Qi.",
  "s1281": "Sixth year, fourth year, attacked Chen.",
  "s1282": "Thirty-second year, attacked Zheng.",
  "s1283": "Eighth year, Confucius from Chen came.",
  "s1284": "Seventeenth year, sixth year, sixteenth year, eighth year, eleventh year, allied with Lu attacked Qi rescued Chen.",
  "s1285": "Executed Wu Yuan.",
  "s1286": "484 Thirty-sixth year, eleventh year, Qi attacked us.",
  "s1287": "Ran You spoke, therefore welcomed Confucius, Confucius returned.",
  "s1288": "Qi Jian Gong first year, Lu allied with Wu defeated us.",
  "s1289": "Twenty-eighth year, seventh year, fifth year, thirty-third year, ninth year, Confucius returned Lu.",
  "s1290": "Eighteenth year, seventh year, seventeenth year, ninth year, twelfth year, allied with Lu defeated Qi.",
  "s1291": "483 Thirty-seventh year, twelfth year, allied with Wu assembled Tao Gao.",
  "s1292": "Used field taxes.",
  "s1293": "Second year, twenty-ninth year, eighth year, sixth year, Bai Gong Sheng repeatedly requested Zi Xi attack Zheng, because father enmity.",
  "s1294": "Thirty-fourth year, tenth year, duke went Jin, allied with Wu assembled Tao Gao.",
  "s1295": "Nineteenth year, eighth year, eighteenth year, Song attacked us.",
  "s1296": "Tenth year, thirteenth year, allied with Lu assembled Tao Gao.",
  "s1297": "482 Thirty-eighth year, thirteenth year, allied with Wu assembled Huang Chi.",
  "s1298": "Third year, thirtieth year, allied with Wu assembled Huang Chi, contended seniority.",
  "s1299": "Ninth year, seventh year, attacked Chen.",
  "s1300": "Thirty-fifth year, Zheng defeated our army.",
  "s1301": "Eleventh year, twentieth year, ninth year, nineteenth year, defeated Song army.",
  "s1302": "Eleventh year, fourteenth year, allied with Jin assembled Huang Chi.",
  "s1303": "481 Thirty-ninth year, fourteenth year, west hunting captured unicorn.",
  "s1304": "Wei Chu Gong came fleeing.",
  "s1305": "Fourth year, Tian Chang killed Jian Gong, established his younger brother Ao, this was Ping Gong, Chang chancellor, monopolized state authority.",
  "s1306": "Thirty-first year, tenth year, eighth year, thirty-sixth year, twelfth year, father Kuai Kui entered, Che fled out.",
  "s1307": "Twenty-first year, tenth year, twentieth year, twelfth year, fifteenth year",
  "s1308": "480 Fortieth year, fifteenth year, Zi Fu Jing Bo sent Qi, Zi Gong as deputy, Qi returned our invaded lands.",
  "s1309": "Qi Ping Gong Ao first year, Jing Gong grandson.",
  "s1310": "Qi from this called Tian clan.",
  "s1311": "Thirty-second year, eleventh year, ninth year, thirty-seventh year, Ying Huo guarded Xin, Zi Wei said 'auspicious.'",
  "s1312": "Wei Zhuang Gong Kuai Kui first year, twenty-second year, eleventh year, twenty-first year, thirteenth year, sixteenth year",
  "s1313": "479 Forty-first year, sixteenth year, Confucius died.",
  "s1314": "Second year, thirty-third year, twelfth year, tenth year, Bai Gong Sheng killed Ling Yin Zi Xi, attacked Hui Wang.",
  "s1315": "Ye Gong attacked Bai Gong, Bai Gong suicide.",
  "s1316": "Hui Wang restored state.",
  "s1317": "Thirty-eighth year, second year, twenty-third year, Chu extinguished Chen, killed Min Gong.",
  "s1318": "Twelfth year, twenty-second year, fourteenth year, seventeenth year",
  "s1319": "478 Forty-second year, seventeenth year, third year, thirty-fourth year, thirteenth year, eleventh year, thirty-ninth year, third year, Zhuang Gong insulted Rong Zhou people, Rong Zhou people allied with Zhao Jian Zi attacked Zhuang Gong, fled out.",
  "s1320": "Thirteenth year, twenty-third year, fifteenth year, eighteenth year, Yue defeated us.",
  "s1321": "477 Jiazi forty-third year, Jing Wang died.",
  "s1322": "Eighteenth year, twenty-seventh year died.",
  "s1323": "Fourth year, twenty-fifth year died.",
  "s1324": "Thirty-fifth year, thirty-seventh year died.",
  "s1325": "Fourteenth year died, son Li Gong Gong established.",
  "s1326": "Twelfth year, fifty-seventh year died.",
  "s1327": "Forty-sixth year, fourteenth year died.",
  "s1328": "Wei Jun Qi first year, Shi Fu drove Qi out, Che again entered.",
  "s1329": "Fourteenth year, nineteenth year died, twenty-fourth year, thirty-eighth year died.",
  "s1330": "Sixteenth year, twenty-eighth year died.",
  "s1331": "Nineteenth year, twenty-third year died.",
  "s1332": "The Grand Historian says: Confucian scholars cut their meanings, dashing speakers gallop their words, not strive to comprehensively their beginnings and ends;",
  "s1333": "Calendar people take their years and months, several families exalt divine fate, genealogies and records only record posthumous names, their words brief, wish one view the essentials difficult.",
  "s1334": "Therefore tabulated twelve feudal lords, from Gonghe to Confucius, table shows Spring and Autumn Annals, Guo Yu scholars criticize flourishing decline great pointers seen in the scroll, for completing learning governing ancient texts essential summary."
}
