{
  "s0102": "In the twenty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0103": "In the twenty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0104": "In the twenty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0105": "In the twenty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0106": "In the thirtieth year, Qin attacked Wei, taking Yueyang.",
  "s0107": "In the thirty-first year, Qin attacked Wei, taking Chengyang.",
  "s0108": "In the thirty-second year, Qin attacked Wei, taking Yueyang.",
  "s0109": "In the thirty-third year, Qin attacked Wei, taking Chengyang.",
  "s0110": "In the thirty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0111": "In the thirty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0112": "In the thirty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0113": "In the thirty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0114": "In the thirty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0115": "In the thirty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0116": "In the fortieth year, Qin attacked Wei, taking Yueyang.",
  "s0117": "In the forty-first year, Qin attacked Wei, taking Chengyang.",
  "s0118": "In the forty-second year, Qin attacked Wei, taking Yueyang.",
  "s0119": "In the forty-third year, Qin attacked Wei, taking Chengyang.",
  "s0120": "In the forty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0121": "In the forty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0122": "In the forty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0123": "In the forty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0124": "In the forty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0125": "In the forty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0126": "In the fiftieth year, Qin attacked Wei, taking Yueyang.",
  "s0127": "In the fifty-first year, Qin attacked Wei, taking Chengyang.",
  "s0128": "In the fifty-second year, Qin attacked Wei, taking Yueyang.",
  "s0129": "In the fifty-third year, Qin attacked Wei, taking Chengyang.",
  "s0130": "In the fifty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0131": "In the fifty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0132": "In the fifty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0133": "In the fifty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0134": "In the fifty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0135": "In the fifty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0136": "In the sixtieth year, Qin attacked Wei, taking Yueyang.",
  "s0137": "In the sixty-first year, Qin attacked Wei, taking Chengyang.",
  "s0138": "In the sixty-second year, Qin attacked Wei, taking Yueyang.",
  "s0139": "In the sixty-third year, Qin attacked Wei, taking Chengyang.",
  "s0140": "In the sixty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0141": "In the sixty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0142": "In the sixty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0143": "In the sixty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0144": "In the sixty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0145": "In the sixty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0146": "In the seventieth year, Qin attacked Wei, taking Yueyang.",
  "s0147": "In the seventy-first year, Qin attacked Wei, taking Chengyang.",
  "s0148": "In the seventy-second year, Qin attacked Wei, taking Yueyang.",
  "s0149": "In the seventy-third year, Qin attacked Wei, taking Chengyang.",
  "s0150": "In the seventy-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0151": "In the seventy-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0152": "In the seventy-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0153": "In the seventy-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0154": "In the seventy-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0155": "In the seventy-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0156": "In the eightieth year, Qin attacked Wei, taking Yueyang.",
  "s0157": "In the eighty-first year, Qin attacked Wei, taking Chengyang.",
  "s0158": "In the eighty-second year, Qin attacked Wei, taking Yueyang.",
  "s0159": "In the eighty-third year, Qin attacked Wei, taking Chengyang.",
  "s0160": "In the eighty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0161": "In the eighty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0162": "In the eighty-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0163": "In the eighty-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0164": "In the eighty-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0165": "In the eighty-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0166": "In the ninetieth year, Qin attacked Wei, taking Yueyang.",
  "s0167": "In the ninety-first year, Qin attacked Wei, taking Chengyang.",
  "s0168": "In the ninety-second year, Qin attacked Wei, taking Yueyang.",
  "s0169": "In the ninety-third year, Qin attacked Wei, taking Chengyang.",
  "s0170": "In the ninety-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0171": "In the ninety-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0172": "In the ninety-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0173": "In the ninety-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0174": "In the ninety-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0175": "In the ninety-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0176": "In the hundredth year, Qin attacked Wei, taking Yueyang.",
  "s0177": "In the hundred-first year, Qin attacked Wei, taking Chengyang.",
  "s0178": "In the hundred-second year, Qin attacked Wei, taking Yueyang.",
  "s0179": "In the hundred-third year, Qin attacked Wei, taking Chengyang.",
  "s0180": "In the hundred-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0181": "In the hundred-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0182": "In the hundred-sixth year, Qin attacked Wei, taking Yueyang.",
  "s0183": "In the hundred-seventh year, Qin attacked Wei, taking Chengyang.",
  "s0184": "In the hundred-eighth year, Qin attacked Wei, taking Yueyang.",
  "s0185": "In the hundred-ninth year, Qin attacked Wei, taking Chengyang.",
  "s0186": "In the hundred-tenth year, Qin attacked Wei, taking Yueyang.",
  "s0187": "In the hundred-eleventh year, Qin attacked Wei, taking Chengyang.",
  "s0188": "In the hundred-twelfth year, Qin attacked Wei, taking Yueyang.",
  "s0189": "In the hundred-thirteenth year, Qin attacked Wei, taking Chengyang.",
  "s0190": "In the hundred-fourteenth year, Qin attacked Wei, taking Yueyang.",
  "s0191": "In the hundred-fifteenth year, Qin attacked Wei, taking Chengyang.",
  "s0192": "In the hundred-sixteenth year, Qin attacked Wei, taking Yueyang.",
  "s0193": "In the hundred-seventeenth year, Qin attacked Wei, taking Chengyang.",
  "s0194": "In the hundred-eighteenth year, Qin attacked Wei, taking Yueyang.",
  "s0195": "In the hundred-nineteenth year, Qin attacked Wei, taking Chengyang.",
  "s0196": "In the hundred-twentieth year, Qin attacked Wei, taking Yueyang.",
  "s0197": "In the hundred-twenty-first year, Qin attacked Wei, taking Chengyang.",
  "s0198": "In the hundred-twenty-second year, Qin attacked Wei, taking Yueyang.",
  "s0199": "In the hundred-twenty-third year, Qin attacked Wei, taking Chengyang.",
  "s0200": "In the hundred-twenty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0201": "In the hundred-twenty-fifth year, Qin attacked Wei, taking Chengyang.",
  "s0202": "In the eighth year, Qin returned our Jiao and Quwo.",
  "s0203": "In the twelfth year, Chu defeated us at Xiangling.",
  "s0204": "The feudal lords' prime ministers met with Qin's Zhang Yi at Ni Sang.",
  "s0205": "In the thirteenth year, Zhang Yi became prime minister of Wei.",
  "s0206": "Wei had a woman who transformed into a man.",
  "s0207": "Qin took our Quwo and Pingzhou.",
  "s0208": "In the sixteenth year, Xiang Wang died, and his son Ai Wang ascended the throne.",
  "s0209": "Zhang Yi returned to Qin again.",
  "s0210": "In Ai Wang's first year, five states together attacked Qin but failed and withdrew.",
  "s0211": "In the second year, Qi defeated us at Guanjin.",
  "s0212": "In the fifth year, Qin sent Chu Li Zi to attack and take our Quwo, driving Xi Shou to An Men.",
  "s0213": "In the sixth year, Qin came to establish Prince Zheng as crown prince.",
  "s0214": "We met with Qin at Linjin.",
  "s0215": "In the seventh year, we attacked Qi.",
  "s0216": "Together with Qin we attacked Yan.",
  "s0217": "In the eighth year, we attacked Wei, capturing two cities.",
  "s0218": "The lord of Wei was troubled by this.",
  "s0219": "Ru Er suggested destroying Zhao, dividing Zhao into two, but the reason Wei did not perish was because Wei was the alliance leader.",
  "s0220": "Now Wei is on the verge of perishing and will go west to serve Qin.",
  "s0221": "Rather than letting Qin save Wei, it would be better to let Wei save Wei. He went to see the lord of Wei and said: 'Please withdraw Wei's troops - would exempting Lord Chengling be acceptable?'",
  "s0222": "The lord of Wei said: 'If you can truly accomplish this, I will have Wei serve you for generations.'",
  "s0223": "Ru Er went to see Lord Chengling and said: 'In the past when Wei attacked Zhao, cutting the Sheep's Intestine pass and capturing Yan and Yu, Wei's kindness to Wei will surely be endless.'",
  "s0224": "Lord Chengling said: 'Very well.'",
  "s0225": "Ru Er went to see the king of Wei and said: 'I have a request regarding Wei.",
  "s0226": "Wei was originally a branch of the Zhou royal house, and though called a small state, it has many precious vessels.",
  "s0227": "Now the state is in dire straits but the precious vessels are not coming out, because in their hearts they think that attacking Wei to save Wei does not take the king as leader, so even if the precious vessels come out, they will certainly not enter the king's possession.",
  "s0228": "I secretly calculate that whoever first speaks of saving Wei will be the one who receives Wei.'",
  "s0229": "Ru Er left, and Lord Chengling entered, presenting his words to the king of Wei.",
  "s0230": "The king of Wei listened to his proposal, withdrew his troops, and exempted Lord Chengling, never seeing him again for life.",
  "s0231": "In the ninth year, we met with the king of Qin at Linjin.",
  "s0232": "Zhang Yi and Wei Zhang both returned to Wei.",
  "s0233": "Wei prime minister Tian Xu died, and Chu harmed Zhang Yi, Xi Shou, and Xue Gong.",
  "s0234": "Chu prime minister Zhao Yu said to Su Dai: 'Tian Xu has died. I fear that one of Zhang Yi, Xi Shou, or Xue Gong will become prime minister of Wei.'",
  "s0235": "Dai said: 'Yes, but who do you want as prime minister and would be convenient for you?'",
  "s0236": "Zhao Yu said: 'I want the crown prince to serve as his own prime minister.'",
  "s0237": "Dai said: 'I will go north for you and make sure he becomes prime minister.'",
  "s0238": "Zhao Yu said: 'How?'",
  "s0239": "Dai replied: 'You should write to the king of Wei, and I will persuade him.'",
  "s0240": "Zhao Yu said: 'How?'",
  "s0241": "Dai replied: 'I came from Chu, and Zhao Yu was very worried, saying: \"Tian Xu has died. I fear that one of Zhang Yi, Xi Shou, or Xue Gong will become prime minister of Wei.\"",
  "s0242": "I said: \"The king of Wei is a great lord - he will certainly not appoint Zhang Yi as prime minister.",
  "s0243": "If Zhang Yi becomes prime minister, he will favor Qin and slight Wei.",
  "s0244": "If Xi Shou becomes prime minister, he will favor Han and slight Wei.",
  "s0245": "If Xue Gong becomes prime minister, he will favor Qi and slight Wei.",
  "s0246": "The king of Wei is a great lord - he will certainly not find it convenient.\"'",
  "s0247": "The king said: 'Then whom should I appoint as prime minister?'",
  "s0248": "I said: 'Nothing would be better than the crown prince serving as his own prime minister.",
  "s0249": "If the crown prince serves as his own prime minister, these three men will all consider the crown prince as not being a normal prime minister, and will all strive to serve Wei with their states, wanting to obtain the prime minister's seal.",
  "s0250": "With Wei's strength, and three ten-thousand chariot states supporting it, Wei will certainly be secure.",
  "s0251": "Therefore I say nothing would be better than the crown prince serving as his own prime minister.\"'",
  "s0252": "Zhao Yu wrote to the king of Wei as Dai had said.",
  "s0253": "The king of Wei appointed the crown prince as prime minister.",
  "s0254": "Zhang Yi, Xi Shou, Xue Gong all declined and did not dare accept.",
  "s0255": "The king of Wei sent troops to attack Qi, defeating Qi at Pingling.",
  "s0256": "The king of Wei became arrogant and attacked Zhao, defeating Zhao at Shaoliang.",
  "s0257": "Qin sent troops to rescue Zhao, defeating Wei at Shaoliang, killing ten thousand Wei troops.",
  "s0258": "The king of Wei became afraid and wanted to make peace with Qin.",
  "s0259": "Qin demanded the territory south of the Yellow River.",
  "s0260": "The king of Wei did not want to give it, but trusted Zhang Yi's strategy.",
  "s0261": "Zhang Yi said: 'If you give the territory south of the Yellow River, I can return it to you.'",
  "s0262": "The king of Wei gave the territory south of the Yellow River to Qin.",
  "s0263": "Zhang Yi returned it to Wei.",
  "s0264": "Qin was angry with Zhang Yi.",
  "s0265": "Zhang Yi feared Qin would harm him, so he left Qin and went to Wei.",
  "s0266": "Zhang Yi served as prime minister of Wei, and Wei attacked Qin, defeating Qin at Shaoliang.",
  "s0267": "Qin sent troops to attack Wei, defeating Wei at Jingling.",
  "s0268": "The king of Wei was angry at Zhang Yi and wanted to kill him.",
  "s0269": "Zhang Yi said: 'If you kill me today, tomorrow Qin will divide Wei.'",
  "s0270": "The king of Wei spared him.",
  "s0271": "Zhang Yi went to Chu.",
  "s0272": "Su Dai served as prime minister of Wei.",
  "s0273": "Su Dai sent Zhang Yi to advise the king of Yan.",
  "s0274": "The king of Yan appointed Zhang Yi as prime minister.",
  "s0275": "Su Dai returned to Wei.",
  "s0276": "Wei attacked Qi, defeating Qi at Guiguan.",
  "s0277": "In the ninth year, the king of Wei died, and his son Anxi Wang ascended the throne.",
  "s0278": "Anxi Wang's first year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0279": "In the second year, Wei attacked Zhao again, defeating Zhao at Shaoliang.",
  "s0280": "In the third year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0281": "In the fourth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0282": "In the fifth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0283": "In the sixth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0284": "In the seventh year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0285": "In the eighth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0286": "In the ninth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0287": "In the tenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0288": "In the eleventh year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0289": "In the twelfth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0290": "In the thirteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0291": "In the fourteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0292": "In the fifteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0293": "In the sixteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0294": "In the seventeenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0295": "In the eighteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0296": "In the nineteenth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0297": "In the twentieth year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0298": "In the twenty-first year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0299": "In the twenty-second year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0300": "In the twenty-third year, Wei attacked Zhao, defeating Zhao at Shaoliang.",
  "s0301": "In the twenty-fourth year, Wei attacked Zhao, defeating Zhao at Shaoliang."
}
