{
  "s0001": "Jin Tang Shu Yu, Zhou Wu Wang son and Cheng Wang younger brother.",
  "s0002": "Initially, Wu Wang with Shu Yu mother met time, dreamed heaven told Wu Wang said: 'I command give birth son, name Yu, I grant him Tang.'",
  "s0003": "And gave birth son, writing on his hand said 'Yu', so then because commanded him called Yu.",
  "s0004": "Wu Wang collapsed, Cheng Wang established, Tang had disorder, Zhou Gong executed extinguished Tang.",
  "s0005": "Cheng Wang with Shu Yu played, cut paulownia leaf made gui to grant Shu Yu, said: 'With this enfeoff you.'",
  "s0006": "Shi Yi because requested choose day establish Shu Yu.",
  "s0007": "Cheng Wang said: 'I with him played.'",
  "s0008": "Shi Yi said: 'Heavenly son no play words.",
  "s0009": "Words then historian writes it, ritual completes it, music sings it.'",
  "s0010": "Then enfeoffed Shu Yu at Tang.",
  "s0011": "Tang at Yellow River, Fen River east, square hundred li, so called Tang Shu Yu.",
  "s0012": "Surname Ji Shi, style Zi Yu.",
  "s0013": "Tang Shu son Xie, this was Jin Hou.",
  "s0014": "Jin Hou son Ning Zu, this was Wu Hou.",
  "s0015": "Wu Hou son Fu Ren, this was Cheng Hou.",
  "s0016": "Cheng Hou son Fu, this was Li Hou.",
  "s0017": "Li Hou son Yi Jiu, this was Jing Hou.",
  "s0018": "Jing Hou since then, years can calculate.",
  "s0019": "From Tang Shu to Jing Hou five generations, no their year numbers.",
  "s0020": "Jing Hou seventeenth year, Zhou Li Wang confused tyrannical cruel, country people made disorder, Li Wang exited fled to Zhi, ministers administered government, so called 'Republican'.",
  "s0021": "Eighteenth year, Jing Hou died, son Xi Hou Si Tu established.",
  "s0022": "Xi Hou fourteenth year, Zhou Xuan Wang initially established.",
  "s0023": "Eighteenth year, Xi Hou died, son Xian Hou Ji established.",
  "s0024": "Xian Hou eleventh year died, son Mu Hou Fei Wang established.",
  "s0025": "Mu Hou fourth year, took Qi woman Jiang Shi as wife.",
  "s0026": "Seventh year, attacked Tiao.",
  "s0027": "Gave birth crown prince Qiu.",
  "s0028": "Tenth year, attacked Qian Mu, had merit.",
  "s0029": "Gave birth young son, named Cheng Shi.",
  "s0030": "Jin person Shi Fu said: 'Strange, lord's naming son!",
  "s0031": "Crown prince called Qiu, Qiu means enemy.",
  "s0032": "Young son called Cheng Shi, Cheng Shi great name, one who completes it.",
  "s0033": "Name self names;",
  "s0034": "things self determine.",
  "s0035": "Now legitimate concubine names contrary, this after Jin its able not disorder?'",
  "s0037": "Twenty-seventh year, Mu Hou died, younger brother Shang Shu self established, crown prince Qiu exited fled.",
  "s0038": "Shang Shu third year, Zhou Xuan Wang collapsed.",
  "s0039": "Fourth year, Mu Hou crown prince Qiu led his followers attacked Shang Shu established, this was Wen Hou.",
  "s0040": "Wen Hou tenth year, Zhou You Wang without way, Quan Rong killed You Wang, Zhou east moved.",
  "s0041": "And Qin Xiang Gong began ranked as feudal lords.",
  "s0042": "Thirty-fifth year, Wen Hou Qiu died, son Zhao Hou Bo established.",
  "s0043": "Zhao Hou first year, enfeoffed Wen Hou younger brother Cheng Shi at Qu Wo.",
  "s0044": "Qu Wo city greater than Yi.",
  "s0045": "Yi, Jin lord capital city.",
  "s0046": "Cheng Shi enfeoffed Qu Wo, numbered Huan Shu.",
  "s0047": "Jing Hou concubine grandson Luan Bin assisted Huan Shu.",
  "s0048": "Huan Shu at this time age fifty-eight, good virtue, Jin country's crowd all attached to him.",
  "s0049": "Jun Zi said: 'Jin disorder its at Qu Wo.",
  "s0050": "Branch greater than root obtains people's hearts, not disorder what wait!'"
}
