{
  "s342": "Five. Second year sixth month jia wu, Marquis Liu Jia first year.",
  "s343": "Six",
  "s344": "Four. Fifth year, Marquis Jia convicted of tribute gold, state abolished.",
  "s347": "Xing Cheng.",
  "s348": "Son of Prince Jing of Zhongshan.",
  "s350": "Five. Second year sixth month jia wu, Marquis Liu Zhen first year.",
  "s351": "Six",
  "s352": "Four. Fifth year, Marquis Zhen convicted of tribute gold, state abolished.",
  "s355": "Pu Ling.",
  "s356": "Son of Prince Hui of Guangchuan.",
  "s358": "Four. Third year tenth month gui you, Marquis Liu Jia first year.",
  "s363": "Xi Xiong.",
  "s364": "Son of Prince Hui of Guangchuan.",
  "s366": "Four. Third year tenth month gui you, Marquis Liu Ming first year.",
  "s371": "Zao Qiang.",
  "s372": "Son of Prince Hui of Guangchuan.",
  "s374": "Four. Third year tenth month gui you, Marquis Liu Yan first year.",
  "s379": "Bi Liang.",
  "s380": "Son of Prince Hui of Guangchuan.",
  "s382": "Four. Third year tenth month gui you, Marquis Liu Ying first year.",
  "s383": "Six",
  "s384": "Six",
  "s385": "Three. Fourth year, Marquis Ying committed crime, state abolished.",
  "s387": "Fang Guang.",
  "s388": "Son of Prince Xian of Hejian.",
  "s390": "Four. Third year tenth month gui you, Marquis Liu Yin first year.",
  "s391": "Six",
  "s392": "First year, Marquis Yin committed crime, state abolished.",
  "s395": "Ju Yang.",
  "s396": "Son of Prince Xian of Hejian.",
  "s398": "Four. Third year tenth month gui you, Marquis Liu Tun first year.",
  "s399": "Four. Two. Fifth year, Marquis Du first year.",
  "s400": "Four. Fifth year, Marquis Du committed crime, state abolished.",
  "s403": "Lou.",
  "s404": "Son of Prince Xian of Hejian.",
  "s406": "Four. Third year tenth month gui you, Marquis Liu Miao first year.",
  "s407": "Six",
  "s408": "Six",
  "s409": "Six. First year, current Marquis Ying first year.",
  "s410": "Four",
  "s411": "E Wu.",
  "s412": "Son of Prince Xian of Hejian.",
  "s414": "Four. Third year tenth month gui you, Marquis Min Liu Yu first year.",
  "s415": "Six",
  "s416": "Six",
  "s417": "Six",
  "s418": "Two. Two. Third year, current Marquis Kuan first year.",
  "s419": "Can Hu.",
  "s420": "Son of Prince Xian of Hejian."
}
