{
  "s1274": "Seven",
  "s1275": "Two. Six. Year 3, Marquis Yi Kai year 1.",
  "s1276": "Seventeen. Six. After year 2, Marquis Yang year 1.",
  "s1277": "Two. Year 3, Yang rebelled, state abolished.",
  "s1279": "Eighty",
  "s1280": "Gan Quan.",
  "s1281": "As chariot Sima Han King first year followed uprising in Gaoling, attached to Liu Jia, as commandery captain followed army, became marquis.",
  "s1282": "One. Year 12 month 6 Ren Chen day, Marquis Wang Jing year 1.",
  "s1283": "Six. One. Year 7, Marquis Dai Mo Yao year 1.",
  "s1284": "Eight",
  "s1285": "Ten. Thirteen. Year 11, Marquis Piao year 1.",
  "s1286": "Nine. Year 10, Marquis Piao committed crime, state abolished.",
  "s1288": "One hundred six",
  "s1289": "Zhu Zao.",
  "s1290": "As Yue lian'ao followed uprising in Feng, separately as palace attendant general entered Han, attacked various lords, as commandery captain became marquis, 900 households.",
  "s1291": "One. Year 12 month 6 Ren Chen day, Marquis Jing Chi year 1.",
  "s1292": "Seven",
  "s1293": "Eight",
  "s1294": "One. Twenty-two. Year 2, Chi's son Marquis Kang Wu year 1.",
  "s1295": "Eight. Zhong year 2, Marquis Chang year 1. Two. Zhong year 4, committed crime, state abolished.",
  "s1297": "Seventy-five",
  "s1298": "Zhang.",
  "s1299": "As attendant cavalry followed uprising in Feng, as palace attendant general entered Han, followed attacking various lords, 700 households.",
  "s1300": "One. Year 12 month 6 Ren Chen day, Marquis Jie Mao Ze year 1.",
  "s1301": "Seven",
  "s1302": "Eight",
  "s1303": "Ten. Two. Year 11, Marquis Yi Qing year 1. Eleven. Year 13, Marquis Shun year 1.",
  "s1304": "Twelve. Zhong year 6, Marquis Shun committed crime, state abolished.",
  "s1306": "Seventy-nine",
  "s1307": "Yanling.",
  "s1308": "As soldier followed uprising in Feng, entered Han, as commandery captain attacked Ji, Tea, became marquis, 700 households.",
  "s1309": "One. Year 12 middle, Marquis Zhuang Zhu Pi year 1.",
  "s1310": "Seven",
  "s1311": "Three. Five. Year 4, Marquis Gong Qing year 1.",
  "s1312": "Six. Year 7, Marquis Gong Qing died, no heir, state abolished.",
  "s1315": "Fifty-two",
  "s1316": "Xun.",
  "s1317": "As attendant year 1 BCE followed uprising in Shanfu, did not enter pass, attacked Ji, Bu, Yan King Wan, got Nanyang, became marquis, 2,700 households.",
  "s1318": "One. Year 12, Marquis Zhuang Zhang Ping year 1.",
  "s1319": "Seven",
  "s1320": "Four. Four. Year 5, Marquis Sheng year 1.",
  "s1321": "Three. Year 4, Marquis Sheng committed crime, state abolished.",
  "s1324": "Forty-eight"
}
