{
  "s0152": "In the twenty-second year of Duke Ping, Zhao Jia died, and his son Zhao Zhuang succeeded him.",
  "s0153": "Zhao Zhuang served as chief minister.",
  "s0154": "In the twenty-third year of Duke Ping, Zhao Zhuang died, and his son Zhao Jia succeeded him.",
  "s0155": "Zhao Jia served as chief minister.",
  "s0156": "In the twenty-fourth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0157": "Zhao Yang served as chief minister.",
  "s0158": "In the twenty-fifth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0159": "Zhao Wu served as chief minister.",
  "s0160": "In the twenty-sixth year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0161": "Zhao Bao served as chief minister.",
  "s0162": "In the twenty-seventh year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0163": "Zhao Ping served as chief minister.",
  "s0164": "In the twenty-eighth year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0165": "Zhao Jia served as chief minister.",
  "s0166": "In the twenty-ninth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0167": "Zhao Yang served as chief minister.",
  "s0168": "In the thirtieth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0169": "Zhao Wu served as chief minister.",
  "s0170": "In the thirty-first year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0171": "Zhao Bao served as chief minister.",
  "s0172": "In the thirty-second year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0173": "Zhao Ping served as chief minister.",
  "s0174": "In the thirty-third year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0175": "Zhao Jia served as chief minister.",
  "s0176": "In the thirty-fourth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0177": "Zhao Yang served as chief minister.",
  "s0178": "In the thirty-fifth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0179": "Zhao Wu served as chief minister.",
  "s0180": "In the thirty-sixth year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0181": "Zhao Bao served as chief minister.",
  "s0182": "In the thirty-seventh year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0183": "Zhao Ping served as chief minister.",
  "s0184": "In the thirty-eighth year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0185": "Zhao Jia served as chief minister.",
  "s0186": "In the thirty-ninth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0187": "Zhao Yang served as chief minister.",
  "s0188": "In the fortieth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0189": "Zhao Wu served as chief minister.",
  "s0190": "In the forty-first year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0191": "Zhao Bao served as chief minister.",
  "s0192": "In the forty-second year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0193": "Zhao Ping served as chief minister.",
  "s0194": "In the forty-third year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0195": "Zhao Jia served as chief minister.",
  "s0196": "In the forty-fourth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0197": "Zhao Yang served as chief minister.",
  "s0198": "In the forty-fifth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0199": "Zhao Wu served as chief minister.",
  "s0200": "In the forty-sixth year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0201": "Zhao Bao served as chief minister.",
  "s0202": "In the forty-seventh year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0203": "Zhao Ping served as chief minister.",
  "s0204": "In the forty-eighth year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0205": "Zhao Jia served as chief minister.",
  "s0206": "In the forty-ninth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0207": "Zhao Yang served as chief minister.",
  "s0208": "In the fiftieth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0209": "Zhao Wu served as chief minister.",
  "s0210": "In the fifty-first year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0211": "Zhao Bao served as chief minister.",
  "s0212": "In the fifty-second year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0213": "Zhao Ping served as chief minister.",
  "s0214": "In the fifty-third year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0215": "Zhao Jia served as chief minister.",
  "s0216": "In the fifty-fourth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0217": "Zhao Yang served as chief minister.",
  "s0218": "In the fifty-fifth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0219": "Zhao Wu served as chief minister.",
  "s0220": "In the fifty-sixth year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0221": "Zhao Bao served as chief minister.",
  "s0222": "In the fifty-seventh year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0223": "Zhao Ping served as chief minister.",
  "s0224": "In the fifty-eighth year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0225": "Zhao Jia served as chief minister.",
  "s0226": "In the fifty-ninth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0227": "Zhao Yang served as chief minister.",
  "s0228": "In the first year of Duke Zhao of Jin, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0229": "Zhao Wu served as chief minister.",
  "s0230": "In the second year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0231": "Zhao Bao served as chief minister.",
  "s0232": "In the third year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0233": "Zhao Ping served as chief minister.",
  "s0234": "In the fourth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0235": "Zhao Jia served as chief minister.",
  "s0236": "In the fifth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0237": "Zhao Yang served as chief minister.",
  "s0238": "In the sixth year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0239": "Zhao Wu served as chief minister.",
  "s0240": "In the seventh year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0241": "Zhao Bao served as chief minister.",
  "s0242": "In the eighth year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0243": "Zhao Ping served as chief minister.",
  "s0244": "In the ninth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0245": "Zhao Jia served as chief minister.",
  "s0246": "In the tenth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0247": "Zhao Yang served as chief minister.",
  "s0248": "In the eleventh year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0249": "Zhao Wu served as chief minister.",
  "s0250": "In the twelfth year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0251": "Zhao Bao served as chief minister.",
  "s0252": "In the thirteenth year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0253": "Zhao Ping served as chief minister.",
  "s0254": "In the fourteenth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0255": "Zhao Jia served as chief minister.",
  "s0256": "In the fifteenth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0257": "Zhao Yang served as chief minister.",
  "s0258": "In the sixteenth year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0259": "Zhao Wu served as chief minister.",
  "s0260": "In the seventeenth year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0261": "Zhao Bao served as chief minister.",
  "s0262": "In the eighteenth year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0263": "Zhao Ping served as chief minister.",
  "s0264": "In the nineteenth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0265": "Zhao Jia served as chief minister.",
  "s0266": "In the twentieth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0267": "Zhao Yang served as chief minister.",
  "s0268": "In the twenty-first year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0269": "Zhao Wu served as chief minister.",
  "s0270": "In the twenty-second year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0271": "Zhao Bao served as chief minister.",
  "s0272": "In the twenty-third year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0273": "Zhao Ping served as chief minister.",
  "s0274": "In the twenty-fourth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0275": "Zhao Jia served as chief minister.",
  "s0276": "In the twenty-fifth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0277": "Zhao Yang served as chief minister.",
  "s0278": "In the twenty-sixth year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0279": "Zhao Wu served as chief minister.",
  "s0280": "In the twenty-seventh year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0281": "Zhao Bao served as chief minister.",
  "s0282": "In the twenty-eighth year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0283": "Zhao Ping served as chief minister.",
  "s0284": "In the twenty-ninth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0285": "Zhao Jia served as chief minister.",
  "s0286": "In the thirtieth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0287": "Zhao Yang served as chief minister.",
  "s0288": "In the thirty-first year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0289": "Zhao Wu served as chief minister.",
  "s0290": "In the thirty-second year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0291": "Zhao Bao served as chief minister.",
  "s0292": "In the thirty-third year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0293": "Zhao Ping served as chief minister.",
  "s0294": "In the thirty-fourth year of Duke Zhao, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0295": "Zhao Jia served as chief minister.",
  "s0296": "In the thirty-fifth year of Duke Zhao, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0297": "Zhao Yang served as chief minister.",
  "s0298": "In the thirty-sixth year of Duke Zhao, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0299": "Zhao Wu served as chief minister.",
  "s0300": "In the thirty-seventh year of Duke Zhao, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0301": "Zhao Bao served as chief minister.",
  "s0302": "In the thirty-eighth year of Duke Zhao, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0303": "Zhao Ping served as chief minister.",
  "s0304": "In the tenth year, Duke Wu of Zhongshan first ascended the throne.",
  "s0305": "In the thirteenth year, they fortified Pingyi.",
  "s0306": "In the fifteenth year, Marquis Xian died, and his son Marquis Lie Ji ascended the throne.",
  "s0307": "In Marquis Lie's first year, Marquis Wen of Wei attacked Zhongshan and sent the crown prince to strike and defend it.",
  "s0308": "In the sixth year, Wei, Han, and Zhao all mutually recognized each other as feudal lords, and posthumously honored Xian Zi as Marquis Xian.",
  "s0309": "Marquis Lie loved music and asked his prime minister Gong Zhong Lian: 'I have a favorite - can I ennoble him?'",
  "s0310": "Gong Zhong said: 'You can enrich him, but ennobling him would not be good.'",
  "s0311": "Marquis Lie said: 'Yes.",
  "s0312": "The two singers from Zheng, Qiang and Shi - I will grant them fields of ten thousand mu each.'",
  "s0313": "Gong Zhong said: 'Very well.'",
  "s0314": "But he did not give it to them.",
  "s0315": "After one month, Marquis Lie returned from Dai and asked about the singers' fields.",
  "s0316": "Gong Zhong said: 'I sought for them, but there were none suitable.'",
  "s0317": "Soon after, Marquis Lie asked again.",
  "s0318": "Gong Zhong still did not give them, and then feigned illness and did not attend court.",
  "s0319": "The lord of Fanwu came from Dai and said to Gong Zhong: 'You truly love goodness, but do not know what to hold to.",
  "s0320": "Now Gong Zhong has served as prime minister of Zhao for four years - have you advanced any worthy men?'",
  "s0321": "Gong Zhong said: 'Not yet.'",
  "s0322": "The lord of Fanwu said: 'Niu Xu, Xun Xin, and Xu Yue are all suitable.'",
  "s0323": "Gong Zhong then advanced these three men.",
  "s0324": "When he attended court, Marquis Lie asked again: 'How are the singers' fields?'",
  "s0325": "Gong Zhong said: 'I am just now having the good ones selected.'",
  "s0326": "Niu Xu served Marquis Lie with benevolence and righteousness, advising with the way of the king. Marquis Lie was enlightened.",
  "s0327": "The next day, Xun Xin served with selecting and training the worthy, appointing officials based on ability.",
  "s0328": "The next day, Xu Yue served with economizing expenditures and carefully assessing merit and virtue.",
  "s0329": "All he gave was fully sufficient, and the lord was pleased.",
  "s0330": "Marquis Lie sent a messenger to tell the prime minister: 'The singers' fields will be stopped.'",
  "s0331": "He appointed Niu Xu as tutor, Xun Xin as commander of the guards, Xu Yue as minister of the interior, and granted the prime minister two sets of robes.",
  "s0332": "In the ninth year, Marquis Lie died, and his younger brother Duke Wu ascended the throne.",
  "s0333": "Duke Wu reigned thirteen years and died. Zhao again established Marquis Lie's crown prince Zhang, who became Marquis Jing.",
  "s0334": "This year, Marquis Wen of Wei died.",
  "s0335": "In Marquis Jing's first year, Duke Wu's son Chao rebelled but failed, fleeing to Wei.",
  "s0336": "Zhao first established its capital at Handan.",
  "s0337": "In the second year, Zhao defeated Qi at Lingqiu.",
  "s0338": "In the third year, Zhao aided Wei at Linqiu, greatly defeating the Qi forces.",
  "s0339": "In the fourth year, Wei defeated Zhao at Tu Tai.",
  "s0340": "Zhao built Gangping to invade Wei.",
  "s0341": "In the fifth year, Qi and Wei attacked Zhao on behalf of Wei, taking Gangping.",
  "s0342": "In the sixth year, Zhao borrowed troops from Chu to attack Wei, taking Ji Pu.",
  "s0343": "In the eighth year, Zhao captured Wei's Huang City.",
  "s0344": "In the ninth year, Zhao attacked Qi.",
  "s0345": "Qi attacked Yan, and Zhao aided Yan.",
  "s0346": "In the tenth year, Zhao fought with Zhongshan at Fangzi.",
  "s0347": "In the eleventh year, Wei, Han, and Zhao together destroyed Jin and divided its territory.",
  "s0348": "Zhao attacked Zhongshan again and fought at Zhongren.",
  "s0349": "In the twelfth year, Marquis Jing died, and his son Marquis Cheng Zhong ascended the throne.",
  "s0350": "In Marquis Cheng's first year, Prince Sheng contended with Marquis Cheng for the throne and rebelled.",
  "s0351": "In the second year, sixth month, it snowed.",
  "s0352": "In the third year, Tai Wu Wu served as prime minister.",
  "s0353": "Zhao attacked Wei and took seventy-three towns and villages."
}
