{
  "s4154": "Seven, attacked Zheng.",
  "s4160": "First year of Duke Cheng of Zheng (Mai), Dao Gong's younger brother. Chu attacked us.",
  "s4352": "Thirteen, Jin attacked and defeated us, troops camped at Wei, Chu came to rescue.",
  "s4357": "Ling Wang first year gave birth to bearded child.",
  "s4358": "Two, assembled with Jin at Hu Lao fortress.",
  "s4360": "Two, led feudal lords to attack Zheng, fortified Hu Lao.",
  "s4368": "Fourteen, Cheng Gong died. Jin led feudal lords to attack us.",
  "s4376": "Three, Wei Jiang insulted Yang Gan.",
  "s4378": "Twenty-one, sent Zi Chong to attack Wu, reached Heng Mountain. Sent He Ji to invade Chen.",
  "s4381": "Twenty-nine, broke Chu alliance, Chu invaded us.",
  "s4384": "First year of Duke Xi of Zheng (Yun)",
  "s4386": "Sixteen, Chu attacked us.",
  "s4390": "Four, duke went to Jin.",
  "s4392": "Four, Wei Jiang persuaded to make peace with Rong and Di, Di came to Jin court.",
  "s4394": "Twenty-two, attacked Chen.",
  "s4397": "Thirty, Chu attacked us. Cheng Gong died.",
  "s4406": "Five, Ji Wen Zi died.",
  "s4410": "Twenty-three, attacked Chen.",
  "s4413": "First year of Duke Ai of Chen (Ruo)",
  "s4420": "Jia Wu",
  "s4442": "Twenty-five, besieged Chen.",
  "s4445": "Three, Chu besieged us, duke fled back.",
  "s4448": "Five, Zi Si sent assassin to kill Xi Gong at night, falsely announced illness and death to feudal lords.",
  "s4454": "Eight, duke went to Jin.",
  "s4458": "Twenty-six, attacked Zheng.",
  "s4462": "Twenty-seven, Zheng invaded us.",
  "s4464": "First year of Duke Jian of Zheng (Jia), Xi Gong's son.",
  "s4470": "Nine, with Jin attacked Zheng, assembled at river, asked duke's age twelve, could be capped, capped at Wei.",
  "s4471": "Eighteen, with Jin attacked Zheng.",
  "s4472": "Nine, led Qi, Lu, Song, Wei, Cao to attack Zheng. Qin attacked us.",
  "s4473": "Thirteen, attacked Jin, Chu aided us.",
  "s4474": "Twenty-seven, attacked Zheng, camped at Wu Cheng, for Qin.",
  "s4475": "Twelve, Jin led us to attack Zheng.",
  "s4476": "Thirteen, Jin led us to attack Zheng. At Cao, duke favored consort.",
  "s4479": "Fourteen, Jin led us to attack Zheng.",
  "s4480": "Two, executed Zi Si. Jin led feudal lords to attack us, we made alliance. Chu angered, attacked us.",
  "s4485": "Nine, Wang Shu fled to Jin.",
  "s4486": "Ten, Chu and Zheng invaded our western borders.",
  "s4487": "Nineteen, ordered crown prince Guang and Gao Hou to assemble feudal lords at Zhong Li.",
  "s4488": "Ten, led feudal lords to attack Zheng. Xun Ying attacked Qin.",
  "s4489": "Fourteen, Jin attacked us.",
  "s4490": "Twenty-eight, sent Zi Nang to rescue Zheng.",
  "s4491": "Thirteen, Zheng attacked us, Wei came to rescue.",
  "s4492": "Fourteen, rescued Song.",
  "s4496": "Three, Jin led feudal lords to attack us, Chu came to rescue. Zi Kong caused disorder, Zi Chan attacked him.",
  "s4502": "Eleven, three Huan divided into three armies, each commanded army.",
  "s4504": "Eleven, led feudal lords to attack Zheng, Qin defeated us at Li. Duke said: 'I used Wei Jiang nine times to assemble feudal lords,' granted him music.",
  "s4505": "Fifteen, we sent Shu Zhang Bao to attack Jin and rescue Zheng, defeated them at Li.",
  "s4506": "Twenty-nine, with Zheng attacked Song.",
  "s4507": "Fourteen, Chu and Zheng attacked us."
}