{
  "s0001": {
    "chinese": "太公望呂尚者，東海上人。",
    "literal": "Tai Gong Wang Lu Shang, eastern sea person.",
    "idiomatic": "Tai Gong Wang Lü Shang was a man from the eastern seacoast."
  },
  "s0002": {
    "chinese": "其先祖嘗為四嶽，佐禹平水土甚有功。",
    "literal": "His ancestors once for four peaks, assisted Yu pacify waters earth very had merit.",
    "idiomatic": "His ancestors once served as the Four Peaks and assisted Yu the Great in controlling the floods, performing great deeds."
  },
  "s0003": {
    "chinese": "虞夏之際封於呂，或封於申，姓姜氏。",
    "literal": "Yu Xia between sealed at Lu, or sealed at Shen, surname Jiang clan.",
    "idiomatic": "During the transition from the Yu to Xia dynasties, they were enfeoffed at Lü, or sometimes at Shen, and bore the Jiang surname."
  },
  "s0004": {
    "chinese": "夏商之時，申、呂或封枝庶子孫，或為庶人，尚其後苗裔也。",
    "literal": "Xia Shang time, Shen Lu or sealed branch collateral sons grandsons, or for common people, still their later descendants.",
    "idiomatic": "During the Xia and Shang periods, the Shen and Lü branches were enfeoffed with cadet lineages or served as commoners, but these are still their descendants."
  },
  "s0005": {
    "chinese": "本姓姜氏，從其封姓，故曰呂尚。",
    "literal": "Originally surname Jiang clan, followed their seal surname, thus called Lu Shang.",
    "idiomatic": "Their original surname was Jiang, but they took the name of their fief, and thus he was called Lü Shang."
  },
  "s0006": {
    "chinese": "呂尚蓋嘗窮困，年老矣，以漁釣奸周西伯。",
    "literal": "Lu Shang probably once poor destitute, aged, with fishing angling tricked Zhou Xi Bo.",
    "idiomatic": "Lü Shang had once been impoverished and destitute, and now in his old age, he was fishing by the river to deceive King Wen of Zhou."
  },
  "s0007": {
    "chinese": "西伯將出獵，卜之，曰「所獲非龍非彨非虎非羆；",
    "literal": "Xi Bo about to go hunting, divined it, said 'what obtain not dragon not boar not tiger not bear;",
    "idiomatic": "King Wen was about to go hunting, so he consulted the oracle, which said: 'What you shall obtain is neither dragon nor boar, neither tiger nor bear;"
  },
  "s0008": {
    "chinese": "所獲霸王之輔」。",
    "literal": "what obtain hegemon king assistant'.",
    "idiomatic": "what you shall obtain is the aide to a hegemon king.'"
  },
  "s0009": {
    "chinese": "於是周西伯獵，果遇太公於渭之陽，與語大說，曰：「自吾先君太公曰『當有聖人適周，周以興』。",
    "literal": "Thus Zhou Xi Bo hunted, indeed met Tai Gong at Wei river yang, spoke with greatly pleased, said 'from my former lord Tai Gong said \"should have sage person suitable Zhou, Zhou with rise\".",
    "idiomatic": "Thus King Wen went hunting, and indeed met Tai Gong on the northern bank of the Wei River. They spoke together, and the king was greatly pleased, saying: 'My late father Tai Gong once said: \"There should be a sage who comes to Zhou, and Zhou shall rise through him.\"'"
  },
  "s0010": {
    "chinese": "子真是邪？",
    "literal": "You truly are he?",
    "idiomatic": "Are you truly that man?"
  }
}
