{
  "s5590": "First year of Duke Ai of Lu (Jiang)",
  "s5591": "Fifty-four, attacked Jin.",
  "s5592": "Eighteen, Zhao Yang besieged Fan and Zhong Xing at Zhao Ge. Qi and Wei attacked us.",
  "s5594": "Twenty-two, led feudal lords to besiege Cai.",
  "s5596": "Forty-one, attacked Jin.",
  "s5597": "Eight, Wu attacked us.",
  "s5598": "Twenty-five, Chu attacked us, because of Wu resentment.",
  "s5602": "Two, attacked Yue.",
  "s5607": "Fifty-five, transported grain to Fan and Zhong Xing clan.",
  "s5608": "Nineteen, Zhao Yang besieged Fan and Zhong Xing, Zheng came to rescue, we defeated them.",
  "s5612": "Forty-two, Duke Ling died. Kuai Kui's son Zhe established. Jin brought crown prince Kuai Kui to Qi.",
  "s5756": "Nine, Confucius returned to Lu.",
  "s5762": "Twelve, with Lu defeated Qi.",
  "s5766": "Twelve, with Wu assembled at Tao Gao. Used field tax.",
  "s5770": "Six, Bai Gong Sheng repeatedly requested Zi Xi to attack Zheng, because of father's resentment.",
  "s5772": "Ten, duke went to Jin, with Wu assembled at Tao Gao.",
  "s5776": "Eighteen, Song attacked us.",
  "s5778": "Thirteen, with Lu assembled at Tao Gao.",
  "s5782": "Thirteen, with Wu assembled at Huang Chi.",
  "s5784": "Thirty, with Wu assembled at Huang Chi, contended for precedence.",
  "s5786": "Seven, attacked Chen.",
  "s5787": "Thirty-five, Zheng defeated our army.",
  "s5792": "Nineteen, defeated Song army.",
  "s5794": "Fourteen, with Jin assembled at Huang Chi.",
  "s5798": "Fourteen, western hunt captured unicorn. Wei Chu Gong came fleeing.",
  "s5799": "Four, Tian Chang assassinated Duke Jian, established his younger brother Ao as Duke Ping, Chang became chancellor, monopolized state power.",
  "s5804": "Twelve, father Kuai Kui entered, Zhe fled.",
  "s5814": "Fifteen, Zi Fu Jing Bo sent to Qi, Zi Gong as intermediary, Qi returned our invaded territory.",
  "s5815": "First year of Duke Ping of Qi (Ao), Duke Jing's grandson. Qi from this called Tian clan.",
  "s5819": "Thirty-seven, Mars guarded Heart, Zi Wei said 'good.'",
  "s5820": "First year of Duke Zhuang of Wei (Kuai Kui)",
  "s5830": "Sixteen, Confucius died.",
  "s5834": "Ten, Bai Gong Sheng assassinated Ling Yin Zi Xi, attacked King Hui. Ye Gong attacked Bai Gong, Bai Gong committed suicide. King Hui restored the state.",
  "s5837": "Twenty-three, Chu extinguished Chen, assassinated Duke Min.",
  "s5852": "Three, Duke Zhuang insulted Rong Zhou people, Rong Zhou people with Zhao Jian Zi attacked Duke Zhuang, fled.",
  "s5858": "Eighteen, Yue defeated us.",
  "s5860": "Jia Zi",
  "s5861": "Forty-three, King Jing died.",
  "s5862": "Eighteen, died at twenty-seven.",
  "s5863": "Four, died at twenty-five.",
  "s5864": "Thirty-five, died at thirty-seven.",
  "s5865": "Fourteen, died, son Duke Li Gong established.",
  "s5866": "Twelve, died at fifty-seven.",
  "s5867": "Forty-six, died at fourteen.",
  "s5868": "First year of Wei Jun Qi, Shi Fu drove Qi out, Zhe re-entered.",
  "s5870": "Fourteen, died at nineteen.",
  "s5872": "Twenty-four, died at thirty-eight.",
  "s5873": "Sixteen, died at twenty-eight.",
  "s5874": "Nineteen, died at twenty-three."
}
