{
  "s497": "Changwu.",
  "s498": "Initially rose as retainer followed, as palace attendant entered Han, pacified Three Qins, as palace attendant general attacked various lords, became marquis, 980 households, comparable to Marquis of Weiqi.",
  "s499": "Seven. Year 6 month 7 Geng Yin day, Marquis Jing Xin Shan Ning year 1.",
  "s500": "Five. Two. Year 6, Marquis Yi Ruyi year 1.",
  "s501": "Eight",
  "s502": "Twenty-three",
  "s503": "Ten. Six. Zhong year 4, Marquis Kang Jia Cheng year 1.",
  "s504": "Ten. Yuanguang year 5, Marquis De year 1. Four. Yuanshuo year 3, Marquis De convicted of injuring person who died within twenty days, executed in market, state abolished.",
  "s505": "Forty-five",
  "s506": "Gaoyuan.",
  "s507": "Initially rose as retainer followed, entered Han, pacified Three Qins, as Commandant defeated Ji, became marquis, 1,600 households, comparable to Marquis of Chiqiu.",
  "s508": "Seven. Year 6 month 7 Wu Xu day, Marquis Zhi Bing Qian year 1.",
  "s509": "Seven. Year 1, Marquis Jian De year 1.",
  "s510": "Eight",
  "s511": "Fifteen. Eight. Year 16, Marquis Xiao Wu year 1.",
  "s512": "Sixteen",
  "s513": "Two. Jianyuan year 1, Marquis Xin year 1. Jianyuan year 3, Marquis Xin convicted of entering/exiting imperial carriage area, deprived of marquisate, state abolished.",
  "s514": "Forty-one",
  "s515": "Xuanqu.",
  "s516": "As soldier followed uprising in Liu, as cavalry general entered Han, pacified Three Qins, defeated Ji's army at Xingyang, became palace attendant cavalry general, defeated Zhongli Mei's army at Guling, became marquis, 670 households.",
  "s517": "Seven. Year 6 month 7 Wu Xu day, Marquis of Qi Ding Yi year 1.",
  "s518": "Seven",
  "s519": "Eight",
  "s520": "Ten. Thirteen. Year 11, Marquis Tong year 1.",
  "s521": "Four. Committed crime, abolished. Fa Lou. Zhong year 5, re-enfeoffed Marquis Tong year 1. Zhong year 6, Marquis Tong committed crime, state abolished.",
  "s523": "Forty-three",
  "s524": "Jiangyang.",
  "s525": "As Yue general followed uprising in Liu, entered Han, pacified Three Qins, attacked Zang Tea, became marquis, 740 households. Followed attacking Mayi and Bu.",
  "s526": "Seven. Year 6 month 7 Wu Xu day, Marquis of Qi Hua Wu Hai year 1.",
  "s527": "Seven",
  "s528": "Eight",
  "s529": "Three. Sixteen. Year 4, Marquis Gong Bo Qi year 1. Four. After year 4, Marquis Lu year 1.",
  "s530": "Three. Year 4, Marquis Lu convicted of crossing boundary, committed crime, state abolished.",
  "s532": "Forty",
  "s533": "Dongmao.",
  "s534": "As retainer followed uprising in Dang, to Baxiang, as second detachment entered Han, pacified Three Qins, as commandery captain attacked Xiang Yu, defeated Zang Tea, became marquis. Captured Han Xin, became general, increased fief by 1,000 households.",
  "s535": "Seven. Year 6 month 8 Bing Chen day, Marquis Jing Liu Zhao year 1.",
  "s536": "Seven",
  "s537": "Eight",
  "s538": "Two. Year 3, Marquis Ji year 1. Thirteen. Year 16, Marquis Ji deprived of rank, state abolished.",
  "s541": "Forty-eight",
  "s542": "Chiqiu.",
  "s543": "As retainer followed uprising in Feng, as Left Sima entered Han, as deputy general attacked Ji, conquered enemy, became Dong commandery commandery captain, defeated Ji at Wucheng, became marquis, became Han Commandant, attacked Bu, became Marquis of Chiqiu, 1,000 households.",
  "s544": "Seven. Year 6 month 8 Bing Chen day, Marquis Yi Tang Li year 1.",
  "s545": "Seven",
  "s546": "Eight",
  "s547": "Eight. Thirteen. Year 9, Marquis Gong Chao year 1. Two. After year 6, Marquis Xian year 1.",
  "s548": "Sixteen",
  "s549": "Twenty-five. Yuanding year 2, Marquis Zun year 1. Three. Yuanding year 5, Marquis Zun convicted of tribute gold, state abolished.",
  "s550": "Forty"
}
