{
  "s0050": "The Marquis of Lai came to attack, contending with him for Yingqiu.",
  "s0248": "Ge Ying gave birth to Duke Zhao Pan;",
  "s0249": "Mi Ji gave birth to Duke Yi Shang Ren;",
  "s0250": "Song Hua Zi gave birth to Prince Yong.",
  "s0251": "Duke Huan and Guan Zhong entrusted Duke Xiao to Duke Xiang of Song, making him heir apparent.",
  "s0252": "Yong Wu was favored by Wei Gong Ji, and through the eunuch Shu Dao made rich offerings to Duke Huan, also gaining favor, so Duke Huan promised to establish Wu Gui.",
  "s0253": "When Guan Zhong died, the five princes all sought to be established.",
  "s0254": "Winter tenth month yi hai day, Duke Huan of Qi passed away.",
  "s0255": "Yi Ya entered, and together with Shu Dao used the inner favorites to kill the assembled officials, establishing Prince Wu Gui as ruler.",
  "s0256": "Crown Prince Zhao fled to Song.",
  "s0257": "When Duke Huan fell ill, the five princes each formed factions contending for establishment.",
  "s0258": "When Duke Huan died, they attacked each other, so the palace was empty, no one daring to coffin him.",
  "s0259": "Duke Huan's corpse lay on the bed sixty-seven days, corpse worms crawling out the door.",
  "s0260": "Twelfth month yi hai day, Wu Gui was established, then coffined and proceeded.",
  "s0261": "Xin si night, dressed and encoffined.",
  "s0262": "Duke Huan had more than ten sons, but those who later were established as the five: Wu Gui established three months then died, no posthumous name;",
  "s0263": "next Duke Xiao;",
  "s0264": "next Duke Zhao;",
  "s0265": "next Duke Yi;",
  "s0266": "next Duke Hui.",
  "s0267": "Duke Xiao year 1 third month, Duke Xiang of Song led the feudal lords' troops to send Crown Prince Zhao of Qi and attack Qi.",
  "s0268": "The people of Qi were afraid, killed their ruler Wu Gui.",
  "s0269": "The people of Qi were about to establish Crown Prince Zhao, but the four princes' followers attacked the crown prince, the crown prince fled to Song, Song then fought with Qi's four princes.",
  "s0270": "Fifth month, Song defeated the four princes' army and established Crown Prince Zhao, this was Duke Xiao of Qi.",
  "s0271": "Song came to attack because Duke Huan and Guan Zhong had entrusted him as crown prince.",
  "s0272": "Because of the disorder, eighth month then buried Duke Huan of Qi.",
  "s0273": "Year 6 spring, Qi attacked Song, because they did not ally with Qi.",
  "s0274": "Summer, Duke Xiang of Song passed away.",
  "s0275": "Year 7, Duke Wen of Jin was established.",
  "s0276": "Year 10, Duke Xiao passed away, Duke Xiao's younger brother Pan used Wei prince Kai Fang to kill Duke Xiao's son and establish Pan, this was Duke Zhao."
}
