{
  "s1117": "Ninety-six",
  "s1118": "Dai.",
  "s1119": "As soldier followed uprising in Pei, as soldier opened Pei city gate, became Supreme Father's servant; as central carriage captain attacked Xi, became marquis, 1,200 households.",
  "s1120": "Two. Year 11 month 3 Gui You day, Marquis Jing Peng Zu year 1.",
  "s1121": "Seven",
  "s1122": "Two. Six. Year 3, Marquis Gong Dao year 1.",
  "s1123": "Seven. Sixteen. Year 8, Marquis Yi An Guo year 1.",
  "s1124": "Sixteen",
  "s1125": "Sixteen. Yuanshuo year 5, Marquis An Qi year 1. Twelve. Yuanding year 5, Marquis Meng year 1. Twenty-five. Houyuan year 1 month 5 Jia Xu day, convicted of cursing, unprincipled, state abolished.",
  "s1126": "One hundred sixteen",
  "s1127": "Yan.",
  "s1128": "As Han year 2 Yan governor, as commandery captain conquered Chu nine cities, firmly defended Yan, became marquis, 900 households.",
  "s1129": "Two. Year 11 month 7 Yi Si day, Marquis Jian Di Xu year 1.",
  "s1130": "Seven",
  "s1131": "Three. Two. Year 4, Marquis Zhi Shan year 1. Three. Year 6, Marquis Jie Jia year 1.",
  "s1132": "Twenty-three",
  "s1133": "Sixteen",
  "s1134": "Two. Jianyuan year 3, Marquis Bu Yi year 1. Ten. Yuanshuo year 1, Bu Yi convicted of carrying false edict discussed crime, state abolished.",
  "s1135": "One hundred thirty",
  "s1136": "Pingzhou.",
  "s1137": "Han King year 4, as Yan chancellor followed attacking Ji, returned attacked Tea, as former two thousand shi general became ranked marquis, 1,000 households.",
  "s1138": "Two. Year 11 month 8 Jia Chen day, Marquis Gong Zhao She Diao Wei year 1.",
  "s1139": "Seven",
  "s1140": "Eight",
  "s1141": "One. Three. Year 2, Marquis Dai Fu year 1. Four. Year 5, Marquis Huai Tuo Ren year 1. Fifteen. Year 9, Marquis Xiao Ma Tong year 1.",
  "s1142": "Fourteen. Two. After year 2, Marquis Mei year 1.",
  "s1143": "Thirty-three. Yuanshou year 5, Marquis Mei convicted of galloping in relay station calling out gallop away crime, state abolished.",
  "s1144": "One hundred eleven",
  "s1145": "Zhongmu.",
  "s1146": "As soldier followed uprising in Pei, entered Han as palace attendant attacked Bu, meritorious service led to marquisate, 2,300 households. Initially when Gaozu was humble, had emergency, gave Gaozu one horse, therefore got marquisate.",
  "s1147": "One. Year 12 month 10 Yi Wei day, Marquis Gong Shan Fu Sheng year 1.",
  "s1148": "Seven",
  "s1149": "Eight",
  "s1150": "Seven. Five. Year 8, Marquis Jing Zeng year 1. Eleven. Year 13, Marquis Dai Zhong Gen year 1.",
  "s1151": "Sixteen",
  "s1152": "Ten. Yuanguang year 5, Marquis Shun year 1. Eighteen. Yuanding year 5, Marquis Shun convicted of tribute gold, state abolished.",
  "s1153": "One hundred twenty-five",
  "s1154": "Qi.",
  "s1155": "As former bandit chief became Linjiang general, then for Han attacked King of Linjiang and various lords, defeated Bu, meritorious service led to marquisate, 1,000 households.",
  "s1156": "Year 12 month 10 Wu Xu day, Marquis Zhuang Huang Ji Zhong year 1.",
  "s1157": "Seven",
  "s1158": "Eight",
  "s1159": "Eleven. Nine. Year 12, Marquis Qing Rong Sheng year 1. Three. After year 5, Marquis Gong Ming year 1.",
  "s1160": "Sixteen",
  "s1161": "Sixteen. Yuanshuo year 5, Marquis Sui year 1. Eight. Yuanding year 1, Sui convicted of selling residence to county officials at high price, state abolished.",
  "s1162": "One hundred thirteen",
  "s1163": "Boyang.",
  "s1164": "As soldier followed uprising in Feng, as detachment soldier entered Han, attacked Ji at Chenghao, had merit, became general, Bu rebelled, pacified Wu commandery, became marquis, 1,400 households.",
  "s1165": "One. Year 12 month 10 Xin Chou day, Marquis Jie Zhou Ju year 1.",
  "s1166": "Seven"
}
