{
  "s0674": "Like smoke not smoke, like cloud not cloud, dense dense scattered scattered, bleak bleak round round, this called minister cloud.",
  "s0675": "Minister cloud appears, joyful qi.",
  "s0676": "Like fog not fog, clothes caps not wet, appears then its domain wears armor and hurries.",
  "s0677": "Thunder lightning, rainbow, thunderclap, night bright, yang qi movers, spring summer then send, autumn winter then hide, thus observers none not supervise.",
  "s0678": "Heaven opens hangs things, earth moves cracks breaks.",
  "s0679": "Mountain collapses and moves, river blocks stream dries;",
  "s0680": "Water floods swamps dry up, land extends, swamps dry appear images.",
  "s0681": "City walls gates doors, inner gates withered dry;",
  "s0682": "Palaces temples residences, people dwell places.",
  "s0683": "Songs customs chariots clothes, observe people food drink.",
  "s0684": "Five grains grass wood, observe their belongings.",
  "s0685": "Granaries treasuries stables storehouses, four through roads.",
  "s0686": "Six livestock fowl beasts, produced go stay;",
  "s0687": "Fish turtles birds mice, observe their dwells.",
  "s0688": "Ghost cries like calls, its people meet disasters.",
  "s0689": "Transform words, truly thus.",
  "s0690": "Generally observe year beauty bad, carefully observe year beginning.",
  "s0691": "Year beginning or winter solstice day, produce qi begins sprouts.",
  "s0692": "La tomorrow, people numerous end year, one gather food drink, send yang qi, thus called first year.",
  "s0693": "First month dawn, king year head;",
  "s0694": "Stand spring day, four seasons ends beginning.",
  "s0695": "Four beginnings, wait their days.",
  "s0696": "And Han Wei little gather la bright first month dawn decide eight winds.",
  "s0697": "Wind from southern comes, great drought;",
  "s0698": "Southwest, small drought;",
  "s0699": "Western, has troops;",
  "s0700": "Northwest, barbarian beans become, small rain, urges troops;",
  "s0701": "Northern, for middle year;",
  "s0702": "Northeast, for upper year;",
  "s0703": "Eastern, great floods;",
  "s0704": "Southeast, people have illness epidemic, year bad.",
  "s0705": "Thus eight winds each with their conflict oppose, evaluate many victorious.",
  "s0706": "Many overcomes few, long overcomes urgent, urgent overcomes slow.",
  "s0707": "Dawn to meal, for wheat;",
  "s0708": "Meal to sun declines, for millet;",
  "s0709": "Declines to evening meal, for glutinous millet;",
  "s0710": "Evening meal to lower evening meal, for beans;",
  "s0711": "Lower evening meal to sun enters, for hemp.",
  "s0712": "Desires whole day has rain has cloud, has wind, has sun.",
  "s0713": "Sun when its time, deep and much fruit;",
  "s0714": "No cloud has wind sun, when its time, shallow and much fruit;",
  "s0715": "Has cloud wind, no sun, when its time, deep and little fruit;",
  "s0716": "Has sun, no cloud, not wind, when its time crops have defeat.",
  "s0717": "Like meal time, small defeat;",
  "s0718": "Ripe five dou rice time, great defeat.",
  "s0719": "Then wind again rises, has cloud, its crops again rise.",
  "s0720": "Each with its time use cloud color divine plant suitable.",
  "s0721": "Its rain snow if cold, year bad.",
  "s0722": "This day bright clear, listen capital cities people sound.",
  "s0723": "Sound gong, then year good, auspicious;",
  "s0724": "Shang, then has troops;",
  "s0725": "Zhi, drought;",
  "s0726": "Yu, floods;",
  "s0727": "Jue, year bad.",
  "s0728": "Or from first month dawn compare number rain.",
  "s0729": "Rate day eats one sheng, to seven sheng extreme;",
  "s0730": "Over it, not divine.",
  "s0731": "Number to twelve days, sun straight its month, divine floods drought.",
  "s0732": "For its circle domain thousand li within divine, then for all under heaven wait, exhaust first month.",
  "s0733": "Month leaves column lodges, sun wind clouds, divine its state.",
  "s0734": "However must observe great year where.",
  "s0735": "In metal, abundant;",
  "s0736": "Water, destroys;",
  "s0737": "Wood, famine;",
  "s0738": "Fire, drought.",
  "s0739": "This its great constant.",
  "s0740": "First month upper jia, wind from eastern, suitable silkworms;",
  "s0741": "Wind from western, if dawn yellow cloud, bad.",
  "s0742": "Winter solstice short extreme, hang earth charcoal, charcoal moves, deer shed horns, orchid roots out, spring water leaps, roughly know day arrives, essential decide sundial shadow.",
  "s0743": "Year star where, five grains meet prosperous.",
  "s0744": "Its oppose for conflict, year then has calamity.",
  "s0745": "Grand Historian says: from initial born people since, generation lords what time not experience sun moon star constellations?",
  "s0746": "And to five families, three generations, continue and clarify them, inner crowned belted, outer barbarians, divide central states as twelve provinces, face up then observe images at heaven, face down then imitate categories at earth.",
  "s0747": "Heaven then has sun moon, earth then has yin yang.",
  "s0748": "Heaven has five stars, earth has five phases."
}
