{
  "s394": "Sixth month ding chou, Imperial Secretary Cen Mai passes away.",
  "s396": "141",
  "s397": "Three",
  "s398": "First month jia zi, Filial Jing Emperor passes away. Second month bing zi, Crown Prince ascends.",
  "s399": "Three",
  "s402": "140",
  "s403": "Filial Wu Jian Yuan first year",
  "s404": "Wan dismissed from chancellor.",
  "s405": "Four. Wei Qi Hou Dou Ying becomes Chancellor. Establishes Grand Commandant.",
  "s406": "Wu An Hou Tian Fen becomes Grand Commandant.",
  "s407": "Imperial Secretary Di.",
  "s408": "139",
  "s409": "Two",
  "s410": "Establishes Mao Mausoleum. Ying dismissed from chancellor.",
  "s411": "Second month yi wei, Grand Master of Ceremonies Bai Zhi Hou Xu Chang becomes Chancellor. Fen dismissed from Grand Commandant. Abolishes Grand Commandant office.",
  "s413": "Imperial Secretary Zhao Wan.",
  "s414": "138",
  "s415": "Three",
  "s416": "Dong Ou King Guang Wu Hou Wang leads his multitude over forty thousand people to surrender, places in Lujiang commandery.",
  "s417": "Two",
  "s420": "137",
  "s421": "Four",
  "s423": "Three",
  "s425": "Imperial Secretary Qing Di.",
  "s426": "136",
  "s427": "Five",
  "s428": "Circulates three-part coin.",
  "s429": "Four",
  "s432": "135",
  "s433": "Six",
  "s434": "First month, Min Yue King rebels. Filial Jing Empress Dowager passes away. Chang dismissed from chancellor.",
  "s435": "Five. Sixth month gui si, Wu An Hou Tian Fen becomes Chancellor.",
  "s436": "Qing Di becomes Crown Prince Grand Tutor.",
  "s437": "Imperial Secretary An Guo.",
  "s438": "134",
  "s439": "Yuan Guang first year",
  "s441": "Two",
  "s444": "133",
  "s445": "Two",
  "s446": "Emperor first visits Yong, suburban sacrifice sees five altars.",
  "s447": "Three",
  "s448": "Summer, Imperial Secretary Han An Guo becomes Protector General, Guard Commander Li Guang becomes Brave Cavalry General, Master of Carriages Gong Sun He becomes Light Chariot General, Grand Usher Wang Hui becomes Garrison General, Palace Attendant Li Xi becomes Timber Officer General, ambush Chanyu at Mai Yi, unsuccessful, executes Hui.",
  "s450": "132",
  "s451": "Three",
  "s452": "Fifth month bing zi, Yellow River breaches at Hulu Zi.",
  "s453": "Four",
  "s456": "131",
  "s457": "Four",
  "s458": "Twelfth month ding hai, earth movement. Fen passes away."
}
