{
  "s0051": "Have Gui descendants, will raise at Jiang.",
  "s0052": "Five generations his prosper, equal to proper ministers.",
  "s0053": "Eight generations after, none with compare capital.'",
  "s0055": "Thirty-seventh year, Qi Huan Gong attacked Cai, Cai defeated;",
  "s0056": "south invaded Chu, to Zhao Ling, returned passed Chen.",
  "s0057": "Chen grand master Yuan Tao Tu hated his passed Chen, cheated Qi ordered go eastern road.",
  "s0058": "Eastern road bad, Huan Gong angered, captured Chen Yuan Tao Tu.",
  "s0059": "This year, Jin Xian Gong killed his crown prince Shen Sheng.",
  "s0060": "Forty-fifth year, Xuan Gong died, son Kuan established, this was Mu Gong.",
  "s0061": "Mu Gong fifth year, Qi Huan Gong died.",
  "s0062": "Sixteenth year, Jin Wen Gong defeated Chu troops at Cheng Pu.",
  "s0063": "This year, Mu Gong died, son Gong Gong Shuo established.",
  "s0064": "Gong Gong sixth year, Chu crown prince Shang Chen assassinated his father Cheng Wang replaced established, this was Mu Wang.",
  "s0065": "Eleventh year, Qin Mu Gong died.",
  "s0066": "Eighteenth year, Gong Gong died, son Ling Gong Ping Guo established.",
  "s0067": "Ling Gong first year, Chu Zhuang Wang ascended position.",
  "s0068": "Sixth year, Chu attacked Chen.",
  "s0069": "Tenth year, Chen with Chu peace.",
  "s0070": "Fourteenth year, Ling Gong with his grand masters Kong Ning, Yi Xing Fu all communicated Xia Ji, exchanged their clothes to play at court.",
  "s0071": "Xie Ye advised: 'Lord ministers lewd disorder, people what imitate?'",
  "s0072": "Ling Gong informed two sons, two sons requested kill Xie Ye, duke not prohibited, then killed Xie Ye.",
  "s0073": "Fifteenth year, Ling Gong with two sons drank at Xia family.",
  "s0074": "Duke played two sons said: 'Zheng Shu resembles you.'",
  "s0075": "Two sons said: 'Also resembles duke.'",
  "s0076": "Zheng Shu angered.",
  "s0077": "Ling Gong stopped wine went out, Zheng Shu hid crossbow stable door shot killed Ling Gong.",
  "s0078": "Kong Ning, Yi Xing Fu all fled Chu, Ling Gong crown prince Wu fled Jin.",
  "s0079": "Zheng Shu self established as Chen Hou.",
  "s0080": "Zheng Shu, originally Chen grand master.",
  "s0081": "Xia Ji, Yu Shu wife, Shu's mother.",
  "s0082": "Cheng Gong first year winter, Chu Zhuang Wang for Xia Zheng Shu killed Ling Gong, led feudal lords attacked Chen.",
  "s0083": "Told Chen: 'Do not fear, I execute Zheng Shu only.'",
  "s0084": "Already executed Zheng Shu, because suspended Chen had it, group ministers all congratulated.",
  "s0085": "Shen Shu Shi sent to Qi came returned, alone not congratulated.",
  "s0086": "Zhuang Wang asked its reason, answered said: 'Vulgar saying has it, lead ox enter person field, field master seize ox.",
  "s0087": "Enter then has crime, seize ox, not also excessive?",
  "s0088": "Now Wang with Zheng Shu as traitor assassinated lord, so requested troops feudal lords, with righteousness attacked it, already then took it, with profit its land, then after what with command world!",
  "s0089": "Therefore not congratulate.'",
  "s0090": "Zhuang Wang said: 'Good.'",
  "s0091": "Then welcomed Chen Ling Gong crown prince Wu from Jin established him, restored ruled Chen as before, this was Cheng Gong.",
  "s0092": "Kong Qiu read history records to Chu restored Chen, said: 'Worthy Chu Zhuang Wang!",
  "s0093": "Light thousand chariot country heavy one word.'",
  "s0095": "Twenty-eight year, Chu Zhuang Wang died.",
  "s0096": "Twenty-ninth year, Chen betrayed Chu alliance.",
  "s0097": "Thirtieth year, Chu Gong Wang attacked Chen.",
  "s0098": "This year, Cheng Gong died, son Ai Gong Ruo established.",
  "s0099": "Chu because Chen mourning, stopped troops left.",
  "s0100": "Ai Gong third year, Chu surrounded Chen, again released it.",
  "s0101": "Twenty-eighth year, Chu gong zi Wei assassinated his wang Jia Ao self established, became Ling Wang."
}
