{
  "s0011": {
    "chinese": "吾太公望子久矣。」",
    "literal": "My Tai Gong awaited you long.'",
    "idiomatic": "'My grandfather Tai Gong has been waiting for you for a long time.'"
  },
  "s0012": {
    "chinese": "故號之曰「太公望」，載與俱歸，立為師。",
    "literal": "Thus titled him 'Tai Gong Wang', loaded with together return, established as master.",
    "idiomatic": "Thus they titled him 'Tai Gong Wang', loaded him into their carriage, and returned together, establishing him as their master."
  },
  "s0013": {
    "chinese": "或曰，太公博聞，嘗事紂。",
    "literal": "Some say, Tai Gong broad knowledge, once served Zhou.",
    "idiomatic": "Some say that Tai Gong was broadly learned and had once served King Zhou."
  },
  "s0014": {
    "chinese": "紂無道，去之。",
    "literal": "Zhou without way, left him.",
    "idiomatic": "When King Zhou became tyrannical, he left the king."
  },
  "s0015": {
    "chinese": "游說諸侯，無所遇，而卒西歸周西伯。",
    "literal": "Wander persuaded feudal lords, nowhere met, and finally west returned Zhou Xi Bo.",
    "idiomatic": "He wandered about trying to persuade the feudal lords, but found no one who would listen, and finally went west to return to King Wen of Zhou."
  },
  "s0016": {
    "chinese": "或曰，呂尚處士，隱海濱。",
    "literal": "Some say, Lu Shang recluse, hidden seashore.",
    "idiomatic": "Some say that Lü Shang was a scholar in retirement, living in seclusion by the seashore."
  },
  "s0017": {
    "chinese": "周西伯拘羑里，散宜生、閎夭素知而招呂尚。",
    "literal": "Zhou Xi Bo imprisoned You Li, San Yi Sheng, Hong Yao always knew and recruited Lu Shang.",
    "idiomatic": "When King Wen of Zhou was imprisoned at Youli, San Yisheng and Hong Yao, who had long known Lü Shang, recruited him."
  },
  "s0018": {
    "chinese": "呂尚亦曰「吾聞西伯賢，又善養老，盍往焉」。",
    "literal": "Lu Shang also said 'I heard Xi Bo worthy, moreover good support elderly, why not go there'.",
    "idiomatic": "Lü Shang also said: 'I have heard that King Wen is worthy and moreover treats the elderly well. Why not go there?'"
  },
  "s0019": {
    "chinese": "三人者為西伯求美女奇物，獻之於紂，以贖西伯。",
    "literal": "Three people for Xi Bo sought beautiful women rare objects, offered to Zhou, to redeem Xi Bo.",
    "idiomatic": "These three men sought beautiful women and rare treasures for King Wen, presented them to King Zhou, and thus redeemed King Wen."
  },
  "s0020": {
    "chinese": "西伯得以出，反國。",
    "literal": "Xi Bo thus able out, returned state.",
    "idiomatic": "King Wen was thus able to leave prison and return to his state."
  },
  "s0021": {
    "chinese": "言呂尚所以事周雖異，然要之為文武師。",
    "literal": "Speak Lu Shang so served Zhou though different, yet essential was Wen Wu master.",
    "idiomatic": "Although the accounts of how Lü Shang served the Zhou differ, the essential point is that he became the master of Kings Wen and Wu."
  },
  "s0022": {
    "chinese": "周西伯昌之脫羑里歸，與呂尚陰謀修德以傾商政，其事多兵權與奇計，故後世之言兵及周之陰權皆宗太公為本謀。",
    "literal": "Zhou Xi Bo Chang escaped You Li returned, with Lu Shang secret plotted cultivate virtue to overthrow Shang governance, their affairs many military strategy with strange plans, thus later generations speak military and Zhou secret authority all revered Tai Gong as fundamental strategist.",
    "idiomatic": "When King Wen of Zhou escaped from Youli and returned home, he secretly plotted with Lü Shang to cultivate virtue and overthrow the Shang regime. Their affairs involved much military strategy and clever plans, so later generations who speak of military matters and Zhou's secret maneuvers all revere Tai Gong as the fundamental strategist."
  },
  "s0023": {
    "chinese": "周西伯政平，及斷虞芮之訟，而詩人稱西伯受命曰文王。",
    "literal": "Zhou Xi Bo governance peaceful, and judged Yu Rui dispute, then poets praised Xi Bo received mandate called Wen Wang.",
    "idiomatic": "King Wen of Zhou's governance was peaceful, and when he judged the dispute between Yu and Rui, the poets praised him as having received the mandate and called him King Wen."
  },
  "s0024": {
    "chinese": "伐崇、密須、犬夷，大作豐邑。",
    "literal": "Attacked Chong, Mi Xu, Quan Yi, greatly built Feng Yi.",
    "idiomatic": "He attacked Chong, Mi Xu, and Quan Yi, and greatly expanded the city of Feng."
  },
  "s0025": {
    "chinese": "天下三分，其二歸周者，太公之謀計居多。",
    "literal": "All under heaven three portions, its two returned Zhou, Tai Gong strategy resided many.",
    "idiomatic": "The world was divided into three parts, and two of them came to Zhou - Tai Gong's strategies contributed most to this."
  },
  "s0026": {
    "chinese": "文王崩，武王即位。",
    "literal": "Wen Wang collapsed, Wu Wang ascended throne.",
    "idiomatic": "King Wen passed away, and King Wu ascended the throne."
  },
  "s0027": {
    "chinese": "九年，欲修文王業，東伐以觀諸侯集否。",
    "literal": "Nine years, wished continue Wen Wang enterprise, east attacked to observe feudal lords gathered not.",
    "idiomatic": "In the ninth year, wishing to continue King Wen's enterprise, he attacked eastward to see whether the feudal lords would gather."
  },
  "s0028": {
    "chinese": "師行，師尚父左杖黃鉞，右把白旄以誓，曰：「蒼兕蒼兕，總爾眾庶，與爾舟楫，後至者斬！」",
    "literal": "Army marched, Master Shang Fu left grasped yellow axe, right held white banner to oath, said 'Azure rhinoceros azure rhinoceros, gather your multitudes, with your boats oars, later arrive chop!'",
    "idiomatic": "As the army marched, Master Shang Fu held a yellow axe in his left hand and a white banner in his right to take the oath: 'Blue rhinoceros, blue rhinoceros, gather your multitudes with boats and oars - those who arrive late will be executed!'"
  },
  "s0029": {
    "chinese": "遂至盟津。",
    "literal": "Thus arrived Meng Jin.",
    "idiomatic": "Thus they arrived at Mengjin."
  },
  "s0030": {
    "chinese": "諸侯不期而會者八百諸侯。",
    "literal": "Feudal lords not appointed but met eight hundred feudal lords.",
    "idiomatic": "Eight hundred feudal lords gathered there without prior appointment."
}
}
