{
  "s0047": {
    "chinese": "徒中壯士願從諸十餘人。",
    "literal": "Among the convicts there were sturdy warriors who wished to follow him, more than ten people.",
    "idiomatic": "Among the convicts were over a dozen strong men who wanted to follow him."
  },
  "s0048": {
    "chinese": "高祖被酒，夜徑澤中，令一人行前。",
    "literal": "Gaozu was drunk, at night he went directly through the marsh, ordered one person to walk ahead.",
    "idiomatic": "Gaozu was drunk and walking through the marsh at night when he sent one man ahead to scout."
  },
  "s0049": {
    "chinese": "行前者還報曰：「",
    "literal": "The one walking ahead returned and reported saying: '",
    "idiomatic": "The scout returned and reported, '"
  },
  "s0050": {
    "chinese": "前有大蛇當徑，願還。」",
    "literal": "Ahead there is a large snake blocking the path, I wish to return.'",
    "idiomatic": "There's a huge snake blocking the path ahead. I want to turn back.'"
  },
  "s0051": {
    "chinese": "高祖醉，曰：「壯士行，何畏！」",
    "literal": "Gaozu drunk, said: 'A warrior walks, what is there to fear!'",
    "idiomatic": "Gaozu, still drunk, said, 'A real man keeps going! What's there to fear?'"
  },
  "s0052": {
    "chinese": "乃前，拔劍斬蛇。",
    "literal": "Then he went forward, drew his sword and cut the snake.",
    "idiomatic": "He went forward, drew his sword, and slashed the snake in two."
  },
  "s0053": {
    "chinese": "蛇分為兩，道開。",
    "literal": "The snake divided into two, the path opened.",
    "idiomatic": "The snake split in two, clearing the path."
  },
  "s0054": {
    "chinese": "行數里， 醉困臥。",
    "literal": "They walked several li, drunk and tired he lay down.",
    "idiomatic": "They walked a few miles before Gaozu, exhausted and still drunk, collapsed and fell asleep."
  },
  "s0055": {
    "chinese": "後人來至蛇所，有一老嫗夜哭。",
    "literal": "Later people came to the snake's location, there was an old woman crying at night.",
    "idiomatic": "Later, when people came to where the snake had been, they found an old woman crying in the night."
  },
  "s0056": {
    "chinese": "人問嫗何哭，嫗曰：「人殺吾子。」",
    "literal": "People asked the old woman why she cried, the old woman said: 'Someone killed my son.'",
    "idiomatic": "Someone asked the old woman why she was crying. 'A man killed my son,' she replied."
  },
  "s0057": {
    "chinese": "人曰：「嫗子何為見殺？」",
    "literal": "People said: 'Old woman's son why was he killed?'",
    "idiomatic": "They asked, 'How did your son get killed?'"
  },
  "s0058": {
    "chinese": "嫗曰：「吾子，白帝子也，化為蛇，當道，今者赤帝子斬 之，故哭。」",
    "literal": "The old woman said: 'My son is the son of the White Emperor, transformed into a snake, blocked the path, now the son of the Red Emperor cut it, therefore I cry.'",
    "idiomatic": "The old woman said, 'My son was the child of the White Emperor. He transformed into a snake to block the path, but now the child of the Red Emperor has slain him. That's why I'm crying.'"
  },
  "s0059": {
    "chinese": "人乃以嫗為不誠，欲苦之，嫗因忽不見。",
    "literal": "People then took the old woman as not sincere, wanted to harm her, the old woman therefore suddenly disappeared.",
    "idiomatic": "The people thought she was lying and wanted to punish her, but she suddenly vanished."
  },
  "s0060": {
    "chinese": "後人至，高祖覺。",
    "literal": "Later people arrived, Gaozu awoke.",
    "idiomatic": "When others arrived later, Gaozu woke up."
  },
  "s0061": {
    "chinese": "告高祖，高祖乃心獨喜，自負。",
    "literal": "They told Gaozu, Gaozu then in his heart alone was happy, considered himself outstanding.",
    "idiomatic": "They told Gaozu what happened, and he was secretly delighted, feeling quite pleased with himself."
  },
  "s0062": {
    "chinese": "諸從者日益畏之。",
    "literal": "The various followers increasingly feared him.",
    "idiomatic": "His followers grew increasingly awed by him."
  },
  "s0063": {
    "chinese": "秦始皇帝嘗曰「東南有天子氣」，於是東游以猒當之。",
    "literal": "Qin Shihuang once said 'There is emperor aura in the southeast', therefore he toured east to repress it.",
    "idiomatic": "Qin Shihuang once said there was 'imperial aura' in the southeast, so he traveled east to suppress it."
  },
  "s0064": {
    "chinese": "高祖隱於芒、碭山澤間，呂后與人俱求，常得之。",
    "literal": "Gaozu hid in the mountains and marshes between Mang and Dang, Empress Lü together with people sought him, often found him.",
    "idiomatic": "Gaozu hid in the mountains and marshes between Mang and Dang counties. Empress Lü searched for him with others and always found him."
  },
  "s0065": {
    "chinese": "高祖怪問之。",
    "literal": "Gaozu strangely asked about it.",
    "idiomatic": "Gaozu asked curiously how she always found him."
  },
  "s0066": {
    "chinese": "呂后曰：「季所居上常有雲氣，故從往常得季。」",
    "literal": "Empress Lü said: 'Above where Ji resides there is often cloud qi, therefore following it I always find Ji.'",
    "idiomatic": "Empress Lü replied, 'There's always a cloud of auspicious vapor above wherever you hide. I just follow that cloud and it leads me right to you.'"
  },
  "s0067": {
    "chinese": "高祖又喜。",
    "literal": "Gaozu again was happy.",
    "idiomatic": "Gaozu was pleased once more."
  },
  "s0068": {
    "chinese": "沛中子弟或聞之，多欲附者矣。",
    "literal": "Pei middle young men some heard of it, many desired to attach themselves.",
    "idiomatic": "When some young men from Pei heard about this, many wanted to join him."
  },
  "s0069": {
    "chinese": "於是樊噲從高祖來。",
    "literal": "Therefore Fan Kuai followed Gaozu and came.",
    "idiomatic": "This is when Fan Kuai came to join Gaozu."
  },
  "s0070": {
    "chinese": "沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。",
    "literal": "The Pei magistrate afterwards regretted, feared there would be change, therefore closed the city and defended it, wanted to execute Xiao and Cao.",
    "idiomatic": "The magistrate of Pei now regretted his decision. Fearing trouble, he sealed the city gates and prepared to execute Xiao He and Cao Shen."
  },
  "s0071": {
    "chinese": "蕭、曹恐，踰城保高祖。",
    "literal": "Xiao and Cao were afraid, climbed over the wall to protect Gaozu.",
    "idiomatic": "Xiao He and Cao Shen, terrified, climbed over the city wall to join Gaozu."
  },
  "s0072": {
    "chinese": "高祖乃書 帛射城上，與沛父老曰：「天下同苦秦久矣。",
    "literal": "Gaozu then wrote on silk and shot it onto the city wall, telling the Pei elders: 'The realm together has suffered under Qin for a long time.",
    "idiomatic": "Gaozu wrote a message on silk, shot it over the city wall, and addressed the elders of Pei: 'All under heaven have suffered long under Qin tyranny."
  },
  "s0073": {
    "chinese": "今父老雖為沛令守，諸侯並起，今屠沛。",
    "literal": "Now although elders defend for the Pei magistrate, the feudal lords all rise, now they will slaughter Pei.",
    "idiomatic": "Though you defend the magistrate now, the other lords are rising up. They'll slaughter everyone in Pei."
  },
  "s0074": {
    "chinese": "沛今共誅令，擇可立立之，以應諸侯，即室家完。",
    "literal": "Pei now together execute the magistrate, choose someone suitable to establish, to respond to the feudal lords, then families will be complete.",
    "idiomatic": "If Pei executes the magistrate together and chooses a worthy leader to join the other lords, your families will be safe."
  },
  "s0075": {
    "chinese": "不然，父子俱屠，無為 也。」",
    "literal": "If not, fathers and sons will all be slaughtered, useless.'",
    "idiomatic": "Otherwise, we'll all be massacred—fathers, sons, everyone. There's no point in that.'"
  },
  "s0076": {
    "chinese": "父老乃帥子弟共殺沛令，開城門迎高祖，欲以為沛令。",
    "literal": "The elders then led their young men together to kill the Pei magistrate, opened the city gates to welcome Gaozu, wished to make him Pei magistrate.",
    "idiomatic": "The elders rallied their sons and young men, killed the magistrate, opened the gates, and welcomed Gaozu, wanting to make him magistrate of Pei."
  },
  "s0077": {
    "chinese": "高祖曰：「天下方擾，諸侯並起，令置將不善，一敗塗地。",
    "literal": "Gaozu said: 'The realm is currently in chaos, feudal lords all rising, appointing generals poorly, one defeat covers the ground.",
    "idiomatic": "Gaozu said, 'The empire is in turmoil with lords rising everywhere. If I appoint the wrong commanders, one defeat will destroy everything."
  },
  "s0078": {
    "chinese": "吾非敢自愛，恐能薄，不能完父兄子弟。",
    "literal": "I do not dare to love myself, fear my abilities are thin, cannot protect fathers, elder brothers, younger brothers.",
    "idiomatic": "I'm not trying to save myself—I just fear my abilities are limited and I can't protect all our families.'"
  },
  "s0079": {
    "chinese": "此 大事，願吏擇可者。」",
    "literal": "This is a great matter, I wish officials choose the suitable one.'",
    "idiomatic": "This is a grave responsibility. Please, officials, choose someone capable.'"
  },
  "s0080": {
    "chinese": "蕭、曹等皆文吏，自愛，恐事不就，後秦種族其家，盡讓高祖。",
    "literal": "Xiao, Cao and others all were civil officials, loved themselves, feared affairs would not succeed, afterwards Qin would exterminate their families, all yielded to Gaozu.",
    "idiomatic": "Xiao He, Cao Shen and the other civil officials, fearing failure and Qin reprisals against their families, all declined and urged Gaozu to take the position."
  },
  "s0081": {
    "chinese": "諸父老皆曰：「平生所聞劉季奇怪，當貴，且卜筮之，莫如劉季最吉。」",
    "literal": "All the elders said: 'What we have heard in our lives about Liu Ji is strange, he should be noble, moreover divining it, none is as auspicious as Liu Ji.'",
    "idiomatic": "All the elders said, 'Throughout our lives we've heard strange tales about Liu Ji. He is destined for greatness. Even divination shows no one more auspicious than Liu Ji.'"
  },
  "s0082": {
    "chinese": "高祖 數讓。",
    "literal": "Gaozu repeatedly declined.",
    "idiomatic": "Gaozu repeatedly declined the position."
  },
  "s0083": {
    "chinese": "眾莫肯為，高祖乃立為沛公。",
    "literal": "The crowd none would do it, Gaozu then was established as Pei Lord.",
    "idiomatic": "No one else would accept, so Gaozu was established as Lord of Pei."
  },
  "s0084": {
    "chinese": "祠黃帝，祭蚩尤於沛廷，而釁鼓旗。",
    "literal": "Sacrificed to the Yellow Emperor, offered to Chi You in the Pei court, and smeared the drums and banners with blood.",
    "idiomatic": "He sacrificed to the Yellow Emperor and Chi You in the Pei courthouse, then consecrated the drums and banners with blood."
  },
  "s0085": {
    "chinese": "幟皆赤，由所殺蛇白帝子，所殺者赤帝子故也。",
    "literal": "The banners all were red, because the killed snake was White Emperor's son, the killer was Red Emperor's son therefore.",
    "idiomatic": "All banners were red, symbolizing that he who killed the White Emperor's son (the snake) was himself the Red Emperor's son."
  },
  "s0086": {
    "chinese": "於是少年豪吏如蕭、曹、樊噲等皆為收沛子 弟，得三千人。",
    "literal": "Therefore young heroic officials like Xiao, Cao, Fan Kuai and others all recruited Pei young men, obtained three thousand.",
    "idiomatic": "Young officials like Xiao He, Cao Shen, and Fan Kuai recruited three thousand young men from Pei."
  },
  "s0087": {
    "chinese": "是月，項梁與兄子羽起吳。",
    "literal": "This month, Xiang Liang and his brother's son Yu rose in Wu.",
    "idiomatic": "That month, Xiang Liang and his nephew Xiang Yu rose up in Wu."
  },
  "s0088": {
    "chinese": "田儋與從弟榮、橫起齊，自立為齊王。",
    "literal": "Tian Dan and his younger cousin Rong, Heng rose in Qi, established themselves as King of Qi.",
    "idiomatic": "Tian Dan and his cousins Tian Rong and Tian Heng rose up in Qi and proclaimed themselves King of Qi."
  },
  "s0089": {
    "chinese": "韓廣自立為燕王。",
    "literal": "Han Guang established himself as King of Yan.",
    "idiomatic": "Han Guang proclaimed himself King of Yan."
  },
  "s0090": {
    "chinese": "魏咎自立為魏王。",
    "literal": "Wei Jiu established himself as King of Wei.",
    "idiomatic": "Wei Jiu proclaimed himself King of Wei."
  },
  "s0091": {
    "chinese": "陳涉之將周章西入關，至戲，秦將章邯距破之。",
    "literal": "Chen Sheng's general Zhou Zhang entered the passes westward, reached Xi, Qin general Zhang Han resisted and defeated him.",
    "idiomatic": "Chen Sheng's general Zhou Zhang marched west through the passes and reached Xi, where Qin general Zhang Han defeated him."
  },
  "s0092": {
    "chinese": "秦二年十月，沛公攻胡陵、方與，還守豐。",
    "literal": "Qin second year tenth month, Pei Lord attacked Hu Ling and Fang Yu, returned to defend Feng.",
    "idiomatic": "In the tenth month of the second year of Qin, Lord Pei attacked Hu Ling and Fang Yu, then returned to defend Feng."
  },
  "s0093": {
    "chinese": "秦泗川監平將兵圍豐。",
    "literal": "Qin Sishui commandery overseer Ping led troops to surround Feng.",
    "idiomatic": "The Qin overseer of Sishui commandery, Ping, led troops to besiege Feng."
  },
  "s0094": {
    "chinese": "二日，出與戰，破之。",
    "literal": "Two days, went out and fought with them, defeated them.",
    "idiomatic": "Two days later, they sallied forth and defeated the besiegers."
  },
  "s0095": {
    "chinese": "令雍齒守豐。",
    "literal": "Ordered Yong Chi to defend Feng.",
    "idiomatic": "He ordered Yong Chi to defend Feng."
  },
  "s0096": {
    "chinese": "十 一月，沛公引兵之薜。",
    "literal": "Eleventh month, Pei Lord led troops to Xi.",
    "idiomatic": "In the eleventh month, Lord Pei led his troops to Xi."
  },
  "s0097": {
    "chinese": "秦泗川守壯兵敗於薛，走至戚，沛公左司馬得殺之。",
    "literal": "Qin Sishui defender Zhuang's troops were defeated at Xue, fled to Qi, Pei Lord's left marshal captured and killed him.",
    "idiomatic": "The Qin defender of Sishui, Zhuang, was defeated at Xue and fled to Qi, where Lord Pei's left marshal captured and executed him."
  },
  "s0098": {
    "chinese": "沛公還軍亢父，至方與。",
    "literal": "Pei Lord returned his army to Kangfu, arrived at Fangyu.",
    "idiomatic": "Lord Pei withdrew his army to Kangfu, then proceeded to Fangyu."
  },
  "s0099": {
    "chinese": "趙王武臣為其將所殺。",
    "literal": "Zhao King Wu Chen was killed by his general.",
    "idiomatic": "King Wu Chen of Zhao was assassinated by one of his generals."
  }
}
