{
  "s0262": "Fan Kuai said: 'How is today's matter?'",
  "s0263": "Zhang Liang said: 'Very urgent.",
  "s0264": "Now Xiang Zhuang draws his sword and dances, his intention is always on Liu Bang.'",
  "s0265": "Fan Kuai said: 'This is urgent, I request to enter and die with him.'",
  "s0266": "Fan Kuai immediately carried sword and shield, entered the army gate.",
  "s0267": "The halberd-crossing guards wished to stop him from entering, Fan Kuai tilted his shield to strike, guards fell to the ground, Fan Kuai then entered, parted the curtain and stood facing west, glared at Xiang Yu, his hair stood on end, his eyes were bloodshot to the corners.",
  "s0268": "Xiang Yu pressed his sword and knelt saying: 'Guest, what are you doing?'",
  "s0269": "Zhang Liang said: 'He is Liu Bang's chariot companion Fan Kuai.'",
  "s0270": "Xiang Yu said: 'Brave warrior, give him a cup of wine.'",
  "s0271": "Then gave him a large cup of wine.",
  "s0272": "Fan Kuai bowed and thanked, rose, stood and drank it.",
  "s0273": "Xiang Yu said: 'Brave warrior, give him a pork shoulder.'",
  "s0274": "Fan Kuai took the pork shoulder, put it on his shield, and ate it raw.",
  "s0275": "Xiang Yu said: 'Brave warrior, can you still drink?'",
  "s0276": "Fan Kuai said: 'I dare not refuse death, how dare I refuse wine!",
  "s0277": "Today I came to fight, not to drink.'",
  "s0278": "Xiang Yu said: 'Give him a seat.'",
  "s0279": "Fan Kuai sat next to Zhang Liang.",
  "s0280": "After a short while, Liu Bang rose to relieve himself.",
  "s0281": "Fan Kuai wished to follow.",
  "s0282": "Liu Bang said: 'The matter is urgent, I cannot return.'",
  "s0283": "He called Zhang Liang to stay, gave him the white jade ring as thanks to Xiang Yu.",
  "s0284": "Liu Bang rode alone, fled through Xiaopi.",
  "s0285": "Zhang Liang entered, Xiang Yu asked where Liu Bang was.",
  "s0286": "Zhang Liang said: 'He left suddenly, saying he had urgent business.'",
  "s0287": "Xiang Yu said: 'The prince is polite.'",
  "s0288": "Then gave the white jade ring to Zhang Liang.",
  "s0289": "Xiang Yu camped at Hongmen, Liu Bang camped at Bashang.",
  "s0290": "Xiang Yu made Liu Bang king of Han, with Bashang as capital.",
  "s0291": "Xiang Yu then returned east.",
  "s0292": "King Huai of Chu heard Xiang Yu had made kings in the west, was angry, wished to attack Xiang Yu.",
  "s0293": "Xiang Yu heard this, sent Ying Bu to kill King Huai at Chen, buried him at Yinling.",
  "s0294": "Xiang Yu then summoned the princes to Jibei to swear alliance.",
  "s0295": "He made Tian Rong king of Qi, with Linzi as capital.",
  "s0296": "Made Peng Yue king of Liang, with Xiapei as capital.",
  "s0297": "Made Han Xin king of Chu, with Chu as capital.",
  "s0298": "Made Ying Bu king of Jiujiang, with Jiujiang as capital.",
  "s0299": "Made Wu Rui king of Hengshan, with Hengshan as capital.",
  "s0300": "Made Gong Ao king of Linhuai, with Linhuai as capital.",
  "s0301": "Made Zang Tu king of Yan, with Yan as capital.",
  "s0302": "Made Zhang Er king of Changshan, with Changshan as capital.",
  "s0303": "Made Wei Bao king of Wei, with Pingyang as capital.",
  "s0304": "Made Sima Ang king of Dai, with Dai as capital.",
  "s0305": "Xiang Yu said: 'The world is in chaos, ghosts and spirits are moving, it is the time for great action.'",
  "s0306": "He forged a letter from King Huai saying: 'Whoever attacks Qin first, their general will be made King of Western Chu.'",
  "s0307": "Xiang Yu then first crossed the Yellow River, sank boats, smashed cooking pots, burned tents, only carried three days rations, to show determination to fight to the death.",
  "s0308": "The army numbered twenty-eight thousand men, all Chu warriors, attacked Qin at Xin'an.",
  "s0309": "When the Chu army reached, the Qin army was still besieging Zhao at Julu.",
  "s0310": "Xiang Yu sent messengers to the princes saying: 'Our army has provisions for three days, please follow us to fight Qin.'",
  "s0311": "The princes said: 'We dare not advance, but hope the general will fight Qin.'",
  "s0312": "Xiang Yu then led twenty thousand men to fight Qin at Julu.",
  "s0313": "Xiang Yu's army was hungry and tired, but he made a great battle, defeated Qin forces.",
  "s0314": "Xiang Yu then led the princes' armies south, attacked Qin at Julu again.",
  "s0315": "Xiang Yu's army was at the front, the princes' armies followed behind.",
  "s0316": "When they reached the Yin Mountains, Xiang Yu ordered the princes' armies to cut paths through the mountains.",
  "s0317": "The princes' armies cut paths, Xiang Yu feared they would take advantage, secretly ordered the strong Chu army to follow behind and kill them.",
  "s0318": "When the princes' armies entered the passes, Xiang Yu sealed the passes, did not let them enter.",
  "s0319": "He stationed troops to guard the passes, then led the Chu army west alone.",
  "s0320": "When Xiang Yu reached Hangu Pass, the Qin forces were still many.",
  "s0321": "Xiang Yu attacked, defeated Qin, entered Hangu Pass."
}