{
  "s1224": "Three. Jianyuan year 4, Marquis Yan year 1.",
  "s1225": "One hundred five",
  "s1226": "Qi.",
  "s1227": "As commandery captain Han year 2 initially rose in Cuo Yang, attacked Fei Qiu, defeated it, therefore attacked Xiang Ji, separately attached to Han Xin defeated Qi army, attacked Zang Tea, promoted to general, attacked Xin, became marquis, 1,000 households.",
  "s1228": "One. Year 12 month 12 Gui Mao day, Marquis Yu Ji Bi year 1.",
  "s1229": "Seven",
  "s1230": "Eight",
  "s1231": "Three. Twenty. Year 4, Marquis of Qi Ban year 1.",
  "s1232": "Sixteen",
  "s1233": "Two. Jianyuan year 3, Marquis Xin Cheng year 1. Twenty. Yuanshou year 5, Marquis Xin Cheng convicted as Grand Master of Ceremonies, let Chancellor invade divine path dike, disrespectful, state abolished.",
  "s1234": "Ninety",
  "s1235": "Zhuang.",
  "s1236": "As Chu general Han King year 3 surrendered, rose in Linji, as palace attendant attacked Ji, Chen Xi, meritorious service led to marquisate, 600 households.",
  "s1237": "One. Year 12 month 1 Yi Chou day, Marquis Jing Xu Qian year 1.",
  "s1238": "Seven",
  "s1239": "Eight",
  "s1240": "Twenty-three",
  "s1241": "One. Fifteen. Year 2, Marquis Gong Hui year 1.",
  "s1242": "One. Jianyuan year 2, Marquis Shang Ze year 1. Nine. Yuanguang year 5, Marquis Guang Zong year 1. Fifteen. Yuanding year 1, Marquis Guang Zong convicted of tribute gold, state abolished.",
  "s1243": "One hundred twelve",
  "s1244": "Chengyang.",
  "s1245": "As Wei palace attendant Han King year 2 followed uprising in Yangwu, attacked Ji, attached to Wei Bao, Bao rebelled, attached to Chancellor Peng Yue, as Taiyuan captain pacified Dai, became marquis, 600 households.",
  "s1246": "One. Year 12 month 1 Yi You day, Marquis Ding Yi year 1.",
  "s1247": "Seven",
  "s1248": "Eight",
  "s1249": "Ten. Thirteen. Year 11, Marquis Xin year 1.",
  "s1250": "Sixteen",
  "s1251": "Jianyuan year 1, Marquis Xin convicted of ghost servant crime, state abolished.",
  "s1252": "One hundred ten",
  "s1253": "Tao.",
  "s1254": "As guest followed Han King year 2 uprising in Dingtao, as Grand Ye Zhe attacked Bu, became marquis, 1,000 households. Served as Huaiyin defender. Xiang clan relative, granted surname.",
  "s1255": "One. Year 12 month 3 Ding Si day, Marquis An Liu Xiang year 1.",
  "s1256": "Seven",
  "s1257": "One. Deprived, extinct. Seven. Year 2, re-enfeoffed Xiang.",
  "s1258": "Nine. Fourteen. Year 10, Marquis Ai She year 1.",
  "s1259": "Sixteen. Jing period, became chancellor.",
  "s1260": "Thirteen. Jianyuan year 1, Marquis Li Shen year 1. Fifteen. Yuanshuo year 2, Marquis Zi Wei year 1. Yuanding year 5, Marquis Zi Wei convicted of tribute gold, state abolished.",
  "s1261": "One hundred thirty-five",
  "s1262": "Gao Liang.",
  "s1263": "Shiqi, troops rose as guest followed attacking and breaking Qin, entered Han as ranked marquis, returned pacifying various lords, constantly sent to harmonize various lords' troops and gatherings, became marquis, meritorious service comparable to Marquis Ping Jia; died in service, son Jie inherited Shiqi's meritorious marquisate, 900 households.",
  "s1264": "One. Year 12 month 3 Bing Yin day, Marquis Gong Li Jie year 1.",
  "s1265": "Seven",
  "s1266": "Eight",
  "s1267": "Twenty-three",
  "s1268": "Sixteen",
  "s1269": "Eight. Yuanguang year 3, Marquis Bo year 1. Ten. Yuanshou year 1, convicted of fraudulent edict taking gold from King of Hengshan, sentenced to death, died of illness, state abolished.",
  "s1270": "Sixty-six",
  "s1271": "Ji.",
  "s1272": "As attendant followed uprising in Feng, as cavalry general entered Han, as general attacked Ji, later attacked Lu Wan, became marquis, 700 households.",
  "s1273": "One. Year 12 month 6 Ren Chen day, Marquis Kuang Chen Cang year 1."
}
