{
  "s0106": "Therefore King Wu announced to all the lords: 'Yin has grave crimes, we cannot but completely attack them.'",
  "s0107": "He followed King Wen, and led 300 war chariots, 3,000 tiger warriors, 45,000 armored soldiers, to attack Zhou eastward.",
  "s0108": "In the eleventh year, twelfth month, day wuwu, the army all crossed Mengjin, all the lords assembled.",
  "s0109": "He said: 'Be diligent without slackening!'",
  "s0110": "King Wu made the Great Oath, announced to the multitudes: 'Now the Yin king Zhou uses the words of his women, cuts himself off from Heaven, destroys his three officials, separates from his royal parents and brothers, discards his ancestors' music, makes licentious sounds, uses them to change and confuse proper sounds, delights in women.'",
  "s0111": "Therefore now I Fa will jointly execute Heaven's punishment.",
  "s0112": "Let the people be reverent, do not kill those who surrender, do not strike those who yield.'",
  "s0113": "The next day, engaged in battle at Muye.",
  "s0114": "The Yin army was defeated, King Zhou fled to his tower and burned himself to death.",
  "s0115": "King Wu cut off his head and hung it on a white banner.",
  "s0116": "Then he attacked Yan, killed the evil Bi Gan, released Mi Zi, restored the imprisoned Jizi.",
  "s0117": "He divided the Yin lands, enfeoffed the Zhou lords.",
  "s0118": "He returned to Fenghao, the people of the four directions all submitted.",
  "s0119": "He made the Duke of Zhou prime minister, governed the eastern regions.",
  "s0120": "In the second year, King Wu toured the eastern regions.",
  "s0121": "He camped at Qianwei, the lords all came to court.",
  "s0122": "He made the Luo Oath, established the eastern capital.",
  "s0123": "He returned to Fenghao, died in the twelfth year.",
  "s0124": "King Cheng ascended, the Duke of Zhou acted as regent.",
  "s0125": "The three guards rebelled, saying: 'The Duke of Zhou will harm the young king.'",
  "s0126": "The Duke of Zhou went to the eastern capital, put down the rebellion.",
  "s0127": "He made the Da Gao proclamation, comforted the Yin people.",
  "s0128": "He made the Jun Shi proclamation, divided the lands.",
  "s0129": "He made the Luo Gong proclamation, established the well-field system.",
  "s0130": "He made the wine prohibition proclamation, banned drunkenness.",
  "s0131": "He made the Kang Gao proclamation, established the ritual system.",
  "s0132": "King Cheng grew up, the Duke of Zhou returned the government.",
  "s0133": "King Cheng was diligent, the world was at peace.",
  "s0134": "King Cheng died, King Kang ascended.",
  "s0135": "King Kang was enlightened and wise, the people were prosperous.",
  "s0136": "He went to the eastern capital, the lords all came to court.",
  "s0137": "He did not use punishments for forty years, the world was at peace.",
  "s0138": "King Kang died, King Zhao ascended.",
  "s0139": "King Zhao went south to tour, died at the Han River.",
  "s0140": "King Mu ascended."
}

