{
  "s0051": {
    "chinese": "古公卒，季歷立，是為公季。",
    "literal": "Gu Gong died, Ji Li ascended, this was Gong Ji.",
    "idiomatic": "Gu Gong died, and Ji Li succeeded him, known as Gong Ji."
  },
  "s0052": {
    "chinese": "公季修古公遺道，篤於行義，諸侯順之。",
    "literal": "Gong Ji followed Gu Gong's legacy, was devoted to practicing righteousness, the lords submitted to him.",
    "idiomatic": "Gong Ji followed Gu Gong's teachings, was devoted to practicing righteousness, and the feudal lords submitted to him."
  },
  "s0053": {
    "chinese": "公季卒，子昌立，是為西伯。",
    "literal": "Gong Ji died, his son Chang ascended, this was Xi Bo.",
    "idiomatic": "Gong Ji died, and his son Chang succeeded him, known as Xi Bo."
  },
  "s0054": {
    "chinese": "西伯曰文王，遵后稷、公劉之業，則古公、公季之法，篤仁，敬老，慈少。",
    "literal": "Xi Bo was called King Wen, followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, loved the young.",
    "idiomatic": "Xi Bo came to be called King Wen. He followed the work of Houji and Gong Liu, observed the laws of Gu Gong and Gong Ji, was profoundly benevolent, respected the elderly, and loved the young."
  },
  "s0055": {
    "chinese": "禮下賢者，日中不暇食以待士，士以此多歸之。",
    "literal": "He treated worthies with courtesy, at noon had no time to eat while waiting for scholars, scholars therefore came to him in great numbers.",
    "idiomatic": "He treated worthies with courtesy; at noon he had no time to eat while waiting for scholars. Scholars therefore came to him in great numbers."
  },
  "s0056": {
    "chinese": "伯夷、叔齊在孤竹，聞西伯善養老，盍往歸之。",
    "literal": "Bo Yi and Shu Qi were in Gu Zhu, heard Xi Bo was good at caring for the elderly, and came to join him.",
    "idiomatic": "Bo Yi and Shu Qi were in Guzhu. They heard that Xi Bo was good at caring for the elderly and came to join him."
  },
  "s0057": {
    "chinese": "太顛、閎夭、散宜生、鬻子、辛甲大夫之徒皆往歸之。",
    "literal": "Taidian, Hongyao, San Yisheng, Yuzi, and Xiahou Dafu and others came to him.",
    "idiomatic": "Taidian, Hongyao, San Yisheng, Yuzi, Xiahou Dafu, and others all came to join him."
  },
  "s0058": {
    "chinese": "崇侯虎譖西伯於殷紂曰：「西伯積善累德，諸侯皆向之，將不利於帝。」",
    "literal": "When King Wen was imprisoned at Youli, he increased in strength, the lords many came to Xi Bo.",
    "idiomatic": "Chonghou Hu slandered Xi Bo to King Zhou of Yin: 'Xi Bo accumulates virtue and goodness. All the feudal lords turn to him - this will be disadvantageous to Your Majesty.'"
  },
  "s0059": {
    "chinese": "帝紂乃囚西伯於羑里。",
    "literal": "When King Wen was released from prison, the Shang king gave him the right to punish without asking permission.",
    "idiomatic": "King Zhou therefore imprisoned Xi Bo at Youli."
  },
  "s0060": {
    "chinese": "閎夭之徒患之。",
    "literal": "Hongyao and others were troubled by this.",
    "idiomatic": "Hongyao and his companions were troubled by this."
  },
  "s0061": {
    "chinese": "乃求有莘氏美女，驪戎之文馬，有熊九駟，他奇怪物，因殷嬖臣費仲而獻之紂。",
    "literal": "King Wen said: 'My ancestor Houji founded our clan. I should restore the title of Houji.'",
    "idiomatic": "They sought beautiful women from the Youshen clan, patterned horses from the Lirong barbarians, nine teams of bears, and other strange treasures. Through the Yin favorite Fei Zhong, they presented them to King Zhou."
  },
  "s0062": {
    "chinese": "紂大說，曰：「此一物足以釋西伯，況其多乎！」",
    "literal": "He went to inspect the descendants of Houji and found Wu Wang.",
    "idiomatic": "King Zhou was greatly pleased and said: 'Even one of these treasures would be enough to release Xi Bo, let alone so many!'"
  },
  "s0063": {
    "chinese": "乃赦西伯，賜之弓矢斧鉞，使西伯得征伐。",
    "literal": "Wu Wang was worthy, King Wen made him Houji.",
    "idiomatic": "He therefore pardoned Xi Bo, granted him bows, arrows, axes, and battle-axes, allowing Xi Bo to campaign against others."
  },
  "s0064": {
    "chinese": "曰：「譖西伯者，崇侯虎也。」",
    "literal": "King Wen died, his son Fa ascended, this was King Wu.",
    "idiomatic": "He said: 'The one who slandered Xi Bo was Chonghou Hu.'"
  },
  "s0065": {
    "chinese": "西伯乃獻洛西之地，以請紂去炮格之刑。",
    "literal": "King Wu was diligent and wise, the people were at peace.",
    "idiomatic": "Xi Bo then offered the land west of the Luo River to request that King Zhou abolish the punishment of burning at the stake."
  },
  "s0066": {
    "chinese": "紂許之。",
    "literal": "King Wu married the daughter of the ruler of Yu, gave birth to King Cheng.",
    "idiomatic": "King Zhou agreed to this."
  },
  "s0067": {
    "chinese": "西伯陰行善，諸侯皆來決平。",
    "literal": "King Wu made the Duke of Zhou and others his ministers.",
    "idiomatic": "Xi Bo secretly practiced goodness, and all the feudal lords came to him for judgments and settlements."
  },
  "s0068": {
    "chinese": "於是虞、芮之人有獄不能決，乃如周。",
    "literal": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": "Thus, when the people of Yu and Rui had a dispute they could not resolve, they went to Zhou."
  },
  "s0069": {
    "chinese": "入界，耕者皆讓畔，民俗皆讓長。",
    "literal": "The Duke of Zhou was devoted to his duties, King Cheng was pleased.",
    "idiomatic": "Upon entering Zhou territory, the farmers all yielded their fields to one another, and the people yielded precedence to their elders."
  },
  "s0070": {
    "chinese": "虞、芮之人未見西伯，皆慚，相謂曰：「吾所爭，周人所恥，何往為，秖取辱耳。」",
    "literal": "The Duke of Zhou made the Shao Proclamation, and the people were at peace.",
    "idiomatic": "The people of Yu and Rui, before even seeing Xi Bo, were ashamed. They said to each other: 'What we fight over, the Zhou people consider shameful. Why go there? We'd only bring humiliation on ourselves.'"
}
}
