{
  "s0101": "780 Second year, San Chuan earthquake.",
  "s0102": "Twenty-seventh year, fifteenth year, Jin Wen Hou Chou first year, forty-second year, eleventh year, twentieth year, thirty-third year, Chen Yi Gong Yue first year, thirtieth year, sixteenth year, twenty-seventh year, eleventh year",
  "s0103": "779 Third year, king took Bao Si.",
  "s0104": "Twenty-eighth year, sixteenth year, second year, forty-third year, twelfth year, twenty-first year, thirty-fourth year, second year, thirty-first year, seventeenth year, twenty-eighth year, twelfth year",
  "s0105": "778 Fourth year, twenty-ninth year, seventeenth year, third year, forty-fourth year, thirteenth year, twenty-second year, thirty-fifth year, third year, thirty-second year, eighteenth year, twenty-ninth year, thirteenth year",
  "s0106": "777 Jiazi fifth year, thirtieth year, eighteenth year, fourth year, Qin Xiang Gong first year, fourteenth year, twenty-third year, thirty-sixth year, Chen Ping Gong Xie first year, thirty-third year, nineteenth year, thirtieth year, fourteenth year",
  "s0107": "776 Sixth year, thirty-first year, nineteenth year, fifth year, second year, fifteenth year, twenty-fourth year, thirty-seventh year, second year, thirty-fourth year, twentieth year, thirty-first year, fifteenth year",
  "s0108": "775 Seventh year, thirty-second year, twentieth year, sixth year, third year, sixteenth year, twenty-fifth year, thirty-eighth year, third year, thirty-fifth year, twenty-first year, thirty-second year, sixteenth year",
  "s0109": "774 Eighth year, thirty-third year, twenty-first year, seventh year, fourth year, seventeenth year, twenty-sixth year, thirty-ninth year, fourth year, thirty-sixth year, twenty-second year, thirty-third year, seventeenth year",
  "s0110": "773 Ninth year, thirty-fourth year, twenty-second year, eighth year, fifth year, eighteenth year, twenty-seventh year, fortieth year, fifth year, thirty-seventh year, twenty-third year, thirty-fourth year, eighteenth year",
  "s0111": "772 Tenth year, thirty-fifth year, twenty-third year, ninth year, sixth year, nineteenth year, twenty-eighth year, forty-first year, sixth year, thirty-eighth year, twenty-fourth year, thirty-fifth year, nineteenth year",
  "s0112": "771 Eleventh year, You Wang killed by Quanrong.",
  "s0113": "Thirty-sixth year, twenty-fourth year, tenth year, seventh year began listed as feudal lords.",
  "s0114": "Twentieth year, twenty-ninth year, forty-second year, seventh year, thirty-ninth year, twenty-fifth year, thirty-sixth year, because of You Wang, killed by Quanrong.",
  "s0115": "Twentieth year",
  "s0116": "770 Ping Wang first year moved east to Luo city.",
  "s0117": "Thirty-seventh year, twenty-fifth year, eleventh year, eighth year first established Xi altar, sacrificed White Emperor.",
  "s0118": "Twenty-first year, thirtieth year, forty-third year, eighth year, fortieth year, twenty-sixth year, Zheng Wu Gong Hua Tu first year, twenty-first year",
  "s0119": "769 Second year, thirty-eighth year, twenty-sixth year, twelfth year, ninth year, twenty-second year, thirty-first year, forty-fourth year, ninth year, forty-first year, twenty-seventh year, second year, twenty-second year",
  "s0120": "768 Third year, Lu Hui Gong Fu Yin",
  "s0121": "First year, twenty-seventh year, thirteenth year, tenth year, twenty-third year, thirty-second year, forty-fifth year, tenth year, forty-second year, twenty-eighth year, third year, twenty-third year",
  "s0122": "767 Jiaxu fourth year, second year, twenty-eighth year, fourteenth year, eleventh year, twenty-fourth year, thirty-third year, forty-sixth year, eleventh year, forty-third year, twenty-ninth year, fourth year, twenty-fourth year",
  "s0123": "766 Fifth year, third year, twenty-ninth year, fifteenth year, twelfth year, attacked Rong to Qi and died.",
  "s0124": "Twenty-fifth year, thirty-fourth year, forty-seventh year, twelfth year, forty-fourth year, thirtieth year, fifth year, Yan Ai Hou first year",
  "s0125": "765 Sixth year, fourth year, thirtieth year, sixteenth year, Qin Wen Gong first year, twenty-sixth year, Song Wu Gong Si Kong first year, forty-eighth year, thirteenth year, forty-fifth year, thirty-first year, sixth year, second year",
  "s0126": "764 Seventh year, fifth year, thirty-first year, seventeenth year, second year, twenty-seventh year, second year, forty-ninth year, fourteenth year, forty-sixth year, thirty-second year, seventh year, Yan Zheng Hou first year",
  "s0127": "763 Eighth year, sixth year, thirty-second year, eighteenth year, third year, Chu Xiao Ao first year, third year, fiftieth year, fifteenth year, forty-seventh year, thirty-third year, eighth year, second year",
  "s0128": "762 Ninth year, seventh year, thirty-third year, nineteenth year, fourth year, second year, fourth year, fifty-first year, sixteenth year, forty-eighth year, thirty-fourth year, ninth year, third year",
  "s0129": "761 Tenth year, eighth year, thirty-fourth year, twentieth year, fifth year, third year, fifth year, fifty-second year, seventeenth year, Cai Gong Hou Xing first year, thirty-fifth year, tenth year, married Shen Hou woman Wu Jiang.",
  "s0130": "Fourth year",
  "s0131": "760 Eleventh year, ninth year, thirty-fifth year, twenty-first year, sixth year, fourth year, sixth year, fifty-third year, eighteenth year, second year, thirty-sixth year, eleventh year, fifth year",
  "s0132": "759 Twelfth year, tenth year, thirty-sixth year, twenty-second year, seventh year, fifth year, seventh year, fifty-fourth year, nineteenth year, Cai Dai Hou first year, Cao Mu Gong first year, twelfth year, sixth year",
  "s0133": "758 Thirteenth year, eleventh year, thirty-seventh year, twenty-third year, eighth year, sixth year, eighth year, fifty-fifth year, twentieth year, second year, second year, thirteenth year, seventh year",
  "s0134": "757 Jiashen fourteenth year, twelfth year, thirty-eighth year, twenty-fourth year, ninth year, Chu Fen Mao first year, ninth year, Wei Zhuang Gong Yang first year, twenty-first year, third year, third year, fourteenth year, gave birth to Zhuang Gong Wu Sheng.",
  "s0135": "Eighth year",
  "s0136": "756 Fifteenth year, thirteenth year, thirty-ninth year, twenty-fifth year, tenth year, made Fu altar.",
  "s0137": "Second year, tenth year, second year, twenty-second year, fourth year, Cao Huan Gong Zhong Sheng first year, fifteenth year, ninth year",
  "s0138": "755 Sixteenth year, fourteenth year, fortieth year, twenty-sixth year, eleventh year, third year, eleventh year, third year, twenty-third year, fifth year, second year, sixteenth year, tenth year",
  "s0139": "754 Seventeenth year, fifteenth year, forty-first year, twenty-seventh year, twelfth year, fourth year, twelfth year, fourth year, Chen Wen Gong Yu first year, gave birth to Huan Gong Bao, Li Gong Ta.",
  "s0140": "Ta mother Cai woman.",
  "s0141": "Sixth year, third year, seventeenth year, gave birth to great uncle Duan, mother wished to establish Duan, duke did not listen.",
  "s0142": "Eleventh year",
  "s0143": "753 Eighteenth year, sixteenth year, forty-second year, twenty-eighth year, thirteenth year, fifth year, thirteenth year, fifth year, second year, seventh year, fourth year, eighteenth year, twelfth year",
  "s0144": "752 Nineteenth year, seventeenth year, forty-third year, twenty-ninth year, fourteenth year, sixth year, fourteenth year, sixth year, third year, eighth year, fifth year, nineteenth year, thirteenth year",
  "s0145": "751 Twentieth year, eighteenth year, forty-fourth year, thirtieth year, fifteenth year, seventh year, fifteenth year, seventh year, fourth year, ninth year, sixth year, twentieth year, fourteenth year",
  "s0146": "750 Twenty-first year, nineteenth year, forty-fifth year, thirty-first year, sixteenth year, eighth year, sixteenth year, eighth year, fifth year, tenth year, seventh year, twenty-first year, fifteenth year",
  "s0147": "749 Twenty-second year, twentieth year, forty-sixth year, thirty-second year, seventeenth year, ninth year, seventeenth year, ninth year, sixth year, Cai Xuan Hou Kai Lun first year, eighth year, twenty-second year, sixteenth year",
  "s0148": "748 Twenty-third year, twenty-first year, forty-seventh year, thirty-third year, eighteenth year, tenth year, eighteenth year, gave birth to Lu Huan Gong mother.",
  "s0149": "Tenth year, seventh year, second year, ninth year, twenty-third year, seventeenth year",
  "s0150": "747 Jiawu twenty-fourth year, twenty-second year, forty-eighth year, thirty-fourth year, nineteenth year, made sacrifice Chen treasure.",
  "s0151": "Eleventh year, Song Xuan Gong Li first year, eleventh year, eighth year, third year, tenth year, twenty-fourth year, eighteenth year",
  "s0152": "746 Twenty-fifth year, twenty-third year, forty-ninth year, thirty-fifth year, twentieth year, twelfth year, second year, twelfth year, ninth year, fourth year, eleventh year, twenty-fifth year, nineteenth year",
  "s0153": "745 Twenty-sixth year, twenty-fourth year, fiftieth year, Jin Zhao Hou first year, enfeoffed uncle Cheng Shi at Qu Wo, Qu Wo greater than state, superior men criticized saying: 'Jin people chaos began from Qu Wo.'",
  "s0154": "Twenty-first year, thirteenth year, third year, thirteenth year, tenth year, Wen Gong died.",
  "s0155": "Fifth year, twelfth year, twenty-sixth year, twentieth year",
  "s0156": "744 Twenty-seventh year, twenty-fifth year, fifty-first year, second year, twenty-second year, fourteenth year, fourth year, fourteenth year, Chen Huan Gong first year, sixth year, thirteenth year, twenty-seventh year, twenty-first year",
  "s0157": "743 Twenty-eighth year, twenty-sixth year, fifty-second year, third year, twenty-third year, fifteenth year, fifth year, fifteenth year, second year, seventh year, fourteenth year, Zheng Zhuang Gong Wu Sheng first year, Ji Zhong chancellor.",
  "s0158": "Twenty-second year",
  "s0159": "742 Twenty-ninth year, twenty-seventh year, fifty-third year, fourth year, twenty-fourth year, sixteenth year, sixth year, sixteenth year, third year, eighth year, fifteenth year, second year, twenty-third year",
  "s0160": "741 Thirtieth year, twenty-eighth year, fifty-fourth year, fifth year, twenty-fifth year, seventeenth year, seventh year, seventeenth year, loved concubine son Zhou Xu, Zhou Xu fond of troops.",
  "s0161": "Fourth year, ninth year, sixteenth year, third year, twenty-fourth year",
  "s0162": "740 Thirty-first year, twenty-ninth year, fifty-fifth year, sixth year, twenty-sixth year, Wu Wang established.",
  "s0163": "Eighth year, eighteenth year, fifth year, tenth year, seventeenth year, fourth year, twenty-fifth year",
  "s0164": "739 Thirty-second year, thirtieth year, fifty-sixth year, Pan Fu killed Zhao Hou, welcomed Cheng Shi, not successful.",
  "s0165": "Zhao Hou son established, this was Xiao Hou.",
  "s0166": "Twenty-seventh year, second year, ninth year, nineteenth year, sixth year, eleventh year, eighteenth year, fifth year, twenty-sixth year",
  "s0167": "738 Thirty-third year, thirty-first year, fifty-seventh year, second year, twenty-eighth year, third year, tenth year, twentieth year, seventh year, twelfth year, nineteenth year, sixth year, twenty-seventh year",
  "s0168": "737 Jichen thirty-fourth year, thirty-second year, fifty-eighth year, third year, twenty-ninth year, fourth year, eleventh year, twenty-first year, eighth year, thirteenth year, twentieth year, seventh year, twenty-eighth year",
  "s0169": "736 Thirty-fifth year, thirty-third year, fifty-ninth year, fourth year, thirtieth year, fifth year, twelfth year, twenty-second year, ninth year, fourteenth year, twenty-first year, eighth year, twenty-ninth year",
  "s0170": "735 Thirty-sixth year, thirty-fourth year, sixtieth year, fifth year, thirty-first year, sixth year, thirteenth year, twenty-third year, lady had no son, Huan Gong established.",
  "s0171": "Tenth year, fifteenth year, twenty-second year, ninth year, thirtieth year",
  "s0172": "734 Thirty-seventh year, thirty-fifth year, sixty-first year, sixth year, thirty-second year, seventh year, fourteenth year, Wei Huan Gong Wan first year, eleventh year, sixteenth year, twenty-third year, tenth year, thirty-first year",
  "s0173": "733 Thirty-eighth year, thirty-sixth year, sixty-second year, seventh year, thirty-third year, eighth year, fifteenth year, second year, younger brother Zhou Xu arrogant, Huan demoted him, fled.",
  "s0174": "Twelfth year, seventeenth year, twenty-fourth year, eleventh year, thirty-second year",
  "s0175": "732 Thirty-ninth year, thirty-seventh year, sixty-third year, eighth year, thirty-fourth year, ninth year, sixteenth year, third year, thirteenth year, eighteenth year, twenty-fifth year, twelfth year, thirty-third year",
  "s0176": "731 Fortieth year, thirty-eighth year, sixty-fourth year, ninth year, Qu Wo Huan Shu Cheng Shi died, son Dai established, this was Zhuang Bo.",
  "s0177": "Thirty-fifth year, tenth year, seventeenth year, fourth year, fourteenth year, nineteenth year, twenty-sixth year, thirteenth year, thirty-fourth year",
  "s0178": "730 Forty-first year, thirty-ninth year, Qi Xi Gong Lu Fu first year, tenth year, thirty-sixth year, eleventh year, eighteenth year, fifth year, fifteenth year, twentieth year, twenty-seventh year, fourteenth year, thirty-fifth year",
  "s0179": "729 Forty-second year, fortieth year, second year, same mother younger brother Yi Zhong year gave birth, Gong Sun Wu Zhi also did not know.",
  "s0180": "Eleventh year, thirty-seventh year, twelfth year, nineteenth year, duke died, commanded establish younger brother He, this was Mu Gong.",
  "s0181": "Sixth year, sixteenth year, twenty-first year, twenty-eighth year, fifteenth year, thirty-sixth year",
  "s0182": "728 Forty-third year, forty-first year, third year, twelfth year, thirty-eighth year, thirteenth year, Song Mu Gong He first year, seventh year, seventeenth year, twenty-second year, twenty-ninth year, sixteenth year, Yan Mu Hou first year",
  "s0183": "727 Jinyin forty-fourth year, forty-second year, fourth year, thirteenth year, thirty-ninth year, fourteenth year, second year, eighth year, eighteenth year, twenty-third year, thirtieth year, seventeenth year, second year",
  "s0184": "726 Forty-fifth year, forty-third year, fifth year, fourteenth year, fortieth year, fifteenth year, third year, ninth year, nineteenth year, twenty-fourth year, thirty-first year, eighteenth year, third year",
  "s0185": "725 Forty-sixth year, forty-fourth year, sixth year, fifteenth year, forty-first year, sixteenth year, fourth year, tenth year, twentieth year, twenty-fifth year, thirty-second year, nineteenth year, fourth year",
  "s0186": "724 Forty-seventh year, forty-fifth year, seventh year, sixteenth year, Qu Wo Zhuang Bo killed Xiao Hou, Jin people established Xiao Hou son Que as E Hou.",
  "s0187": "Forty-second year, seventeenth year, fifth year, eleventh year, twenty-first year, twenty-sixth year, thirty-third year, twentieth year, fifth year",
  "s0188": "723 Forty-eighth year, forty-sixth year, eighth year, Jin E Hou Que first year, Qu Wo strong over Jin.",
  "s0189": "Forty-third year, eighteenth year, sixth year, twelfth year, twenty-second year, twenty-seventh year, thirty-fourth year, twenty-first year, sixth year",
  "s0190": "722 Forty-ninth year, Lu Yin Gong Xi Gu first year, mother Sheng Zi.",
  "s0191": "Ninth year, second year, forty-fourth year, nineteenth year, seventh year, thirteenth year, twenty-third year, twenty-eighth year, thirty-fifth year, twenty-second year, Duan made chaos, fled.",
  "s0192": "Seventh year",
  "s0193": "721 Fiftieth year, second year, tenth year, third year, forty-fifth year, twentieth year, eighth year, fourteenth year, twenty-fourth year, twenty-ninth year, thirty-sixth year, twenty-third year, duke regretted, thought of mother not seen, dug earth to see each other.",
  "s0194": "Eighth year",
  "s0195": "720 Fifty-first year, third year, second month, solar eclipse.",
  "s0196": "Eleventh year, fourth year, forty-sixth year, twenty-first year, ninth year, duke entrusted Kong Fu establish Shang Gong.",
  "s0197": "Feng fled to Zheng.",
  "s0198": "Fifteenth year, twenty-fifth year, thirtieth year, thirty-seventh year, twenty-fourth year, invaded Zhou, took grain.",
  "s0199": "Ninth year",
  "s0200": "719 Huan Wang first year, fourth year, twelfth year, fifth year, forty-seventh year, twenty-second year, Song Shang Gong Yu Yi first year, sixteenth year, Zhou Xu assassinated duke self-established."
}
