{
  "s0091": {
    "chinese": "東觀兵，至于盟津。",
    "literal": "The Shang troops were numerous, but the Zhou troops were resolute.",
    "idiomatic": "He reviewed the troops to the east, reaching Mengjin."
  },
  "s0092": {
    "chinese": "為文王木主，載以車，中軍。",
    "literal": "The Shang troops all turned against Zhou, and Zhou was defeated.",
    "idiomatic": "He made a wooden spirit tablet for King Wen, loaded it on a carriage, and placed it in the center of the army."
  },
  "s0093": {
    "chinese": "武王自稱太子發，言奉文王以伐，不敢自專。",
    "literal": "King Wu entered the Shang capital, the city of Zhao.",
    "idiomatic": "King Wu called himself Crown Prince Fa, saying he was carrying out King Wen's will in the campaign, not daring to act on his own authority."
  },
  "s0094": {
    "chinese": "乃告司馬、司徒、司空、諸節：「齊栗，信哉！",
    "literal": "He captured the treasures of the Yin Shang, returned to Fenghao.",
    "idiomatic": "He addressed the Minister of War, Minister of Education, Minister of Works, and all officers: 'Be orderly and respectful, be trustworthy!'"
  },
  "s0095": {
    "chinese": "予無知，以先祖有德臣，小子受先功，畢立賞罰，以定其功。」",
    "literal": "He divided the lands, enfeoffed the Zhou lords.",
    "idiomatic": "'I am inexperienced, but my ancestors had worthy ministers. I, the young one, receive their previous achievements. I will fully establish rewards and punishments to settle their merits.'"
  },
  "s0096": {
    "chinese": "遂興師。",
    "literal": "He put the Duke of Zhou in charge of the eastern regions.",
    "idiomatic": "Thus he raised the army."
  },
  "s0097": {
    "chinese": "師尚父號曰：「總爾眾庶，與爾舟楫，後至者斬。」",
    "literal": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": "Master Shangfu shouted: 'Gather your multitudes with boats and oars - those who arrive late will be executed!'"
  },
  "s0098": {
    "chinese": "武王渡河，中流，白魚躍入王舟中，武王俯取以祭。",
    "literal": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
    "idiomatic": "King Wu crossed the Yellow River; in mid-stream, a white fish leaped into the king's boat. King Wu bent down, took it, and offered it as a sacrifice."
  },
  "s0099": {
    "chinese": "既渡，有火自上復于下，至于王屋，流為烏，其色赤，其聲魄云。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": "After crossing, fire descended from above to below, reaching Wangwu Mountain, flowing into crows whose color was red, whose sound was like thunder."
  },
  "s0100": {
    "chinese": "是時，諸侯不期而會盟津者八百諸侯。",
    "literal": "He made the Luo Proclamation, established the well-field system.",
    "idiomatic": "At this time, eight hundred feudal lords gathered at Mengjin without prior appointment."
  },
  "s0101": {
    "chinese": "諸侯皆曰：「紂可伐矣。」",
    "literal": "He made the various lords swear oaths.",
    "idiomatic": "All the feudal lords said: 'King Zhou can be attacked.'"
  },
  "s0102": {
    "chinese": "武王曰：「女未知天命，未可也。」",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": "King Wu said: 'You do not know the Heavenly Mandate yet. It is not yet time.'"
  },
  "s0103": {
    "chinese": "乃還師歸。",
    "literal": "King Cheng went to the eastern capital, toured the lords.",
    "idiomatic": "Thus he returned the army home."
  },
  "s0104": {
    "chinese": "居二年，聞紂昏亂暴虐滋甚，殺王子比干，囚箕子。",
    "literal": "The lords all came to court, no one dared to be late.",
    "idiomatic": "Two years passed, and he heard that King Zhou's confusion and tyranny had grown even worse - he had killed Prince Bi Gan and imprisoned Ji Zi."
  },
  "s0105": {
    "chinese": "太師疵、少師彊抱其樂器而奔周。",
    "literal": "King Cheng returned to Fenghao, was diligent in government.",
    "idiomatic": "The Grand Music Master Chi and Junior Music Master Qiang embraced their musical instruments and fled to Zhou."
  },
  "s0106": {
    "chinese": "於是武王遍告諸侯曰：「殷有重罪，不可以不畢伐。」",
    "literal": "Therefore King Wu announced to all the lords: 'Yin has grave crimes, we cannot but completely attack them.'",
    "idiomatic": "Thus King Wu announced to all the feudal lords: 'Yin has grave crimes; we cannot but attack them completely.'"
  },
  "s0107": {
    "chinese": "乃遵文王，遂率戎車三百乘，虎賁三千人，甲士四萬五千人，以東伐紂。",
    "literal": "He followed King Wen, and led 300 war chariots, 3,000 tiger warriors, 45,000 armored soldiers, to attack Zhou eastward.",
    "idiomatic": "He followed King Wen's will and led 300 war chariots, 3,000 tiger warriors, and 45,000 armored soldiers to attack King Zhou to the east."
  },
  "s0108": {
    "chinese": "十一年十二月戊午，師畢渡盟津，諸侯咸會。",
    "literal": "In the eleventh year, twelfth month, day wuwu, the army all crossed Mengjin, all the lords assembled.",
    "idiomatic": "In the eleventh year, twelfth month, wuwu day, the entire army crossed Mengjin, and all the feudal lords assembled."
  },
  "s0109": {
    "chinese": "曰：「孳孳無怠！」",
    "literal": "He said: 'Be diligent without slackening!'",
    "idiomatic": "He said: 'Be diligent without slackening!'"
  },
  "s0110": {
    "chinese": "武王乃作太誓，告于眾庶：「今殷王紂乃用其婦人之言，自絕于天，毀壞其三正，離逖其王父母弟，乃斷棄其先祖之樂，乃為淫聲，用變亂正聲，怡說婦人。",
    "literal": "King Wu made the Great Oath, announced to the multitudes: 'Now the Yin king Zhou uses the words of his women, cuts himself off from Heaven, destroys his three officials, separates from his royal parents and brothers, discards his ancestors' music, makes licentious sounds, uses them to change and confuse proper sounds, delights in women.'",
    "idiomatic": "King Wu made the Great Oath and announced to the multitudes: 'Now the Yin king Zhou uses the words of his women, cuts himself off from Heaven, destroys his three chief ministers, separates himself from his royal parents and brothers, discards his ancestors' music, makes licentious sounds, uses them to change and confuse the proper sounds, and delights in women.'" 
}
}
