{
  "s0232": {
    "chinese": "至于文王、武王，昭前之光明而加之以慈和，事神保民，無不欣喜。",
    "literal": "Until King Wen and King Wu, they illuminated the previous brightness and added kindness and harmony, served the spirits and protected the people, all were joyful.",
    "idiomatic": "Until King Wen and King Wu, they illuminated the previous brightness and added kindness and harmony, served the spirits and protected the people, all were joyful."
  },
  "s0233": {
    "chinese": "商王帝辛大惡于民，庶民不忍，訢載武王，以致戎于商牧。",
    "literal": "The Shang king Di Xin greatly harmed the people, the common people could not bear it, united with King Wu, to bring troops to the Shang pasture.",
    "idiomatic": "The Shang king Di Xin greatly harmed the people, the common people could not bear it, united with King Wu, to bring troops to the Shang pasture."
  },
  "s0234": {
    "chinese": "是故先王非務武也，勸恤民隱而除其害也。",
    "literal": "Therefore the former kings did not pursue military matters, but encouraged care for the people's hardships and removed their harms.",
    "idiomatic": "Therefore the former kings did not pursue military matters, but encouraged care for the people's hardships and removed their harms."
  },
  "s0235": {
    "chinese": "夫先王之制，邦內甸服，邦外侯服，侯衛賓服，夷蠻要服，戎翟荒服。",
    "literal": "The former kings' system: within the state dian service, outside the state hou service, hou wei bin service, yi man yao service, rong di huang service.",
    "idiomatic": "The former kings' system: within the state dian service, outside the state hou service, hou wei bin service, yi man yao service, rong di huang service."
  },
  "s0236": {
    "chinese": "甸服者祭，侯服者祀，賓服者享，要服者貢，荒服者王。",
    "literal": "Dian service offers sacrifice, hou service offers worship, bin service offers tribute, yao service offers contribution, huang service offers kingly visits.",
    "idiomatic": "Dian service offers sacrifice, hou service offers worship, bin service offers tribute, yao service offers contribution, huang service offers kingly visits."
  },
  "s0237": {
    "chinese": "日祭，月祀，時享，歲貢，終王。",
    "literal": "Daily sacrifice, monthly worship, seasonal tribute, yearly contribution, lifetime kingly visits.",
    "idiomatic": "Daily sacrifice, monthly worship, seasonal tribute, yearly contribution, lifetime kingly visits."
  },
  "s0238": {
    "chinese": "先王之順祀也，有不祭則修意，有不祀則修言，有不享則修文，有不貢則修名，有不王則修德，序成而有不至則修刑。",
    "literal": "First month, day renchen, the sun was eclipsed, the officials lost it, the day was not recorded.",
    "idiomatic": "The former kings' orderly sacrifices: if not sacrificed then cultivate intention, if not worshipped then cultivate speech, if not enjoyed then cultivate culture, if not contributed then cultivate reputation, if not visited then cultivate virtue, if the sequence is complete but not reached then cultivate punishment."
  },
  "s0239": {
    "chinese": "於是有刑不祭，伐不祀，征不享，讓不貢，告不王。",
    "literal": "Sixth month, the Rong and Di invaded the west.",
    "idiomatic": "Thus there are punishments for not sacrificing, attacks for not worshipping, campaigns for not enjoying, reprimands for not contributing, announcements for not visiting."
  },
  "s0240": {
    "chinese": "於是有刑罰之辟，有攻伐之兵，有征討之備，有威讓之命，有文告之辭。",
    "literal": "Seventh month, the king went to the eastern capital.",
    "idiomatic": "Thus there are statutes for punishment, troops for attack, preparations for campaigns, commands for intimidation, and words for announcements."
  },
  "s0241": {
    "chinese": "布令陳辭而有不至，則增修於德，無勤民於遠。",
    "literal": "Ninth month, attacked the Quanrong.",
    "idiomatic": "If commands are issued and announcements made but not obeyed, then increase cultivation of virtue, do not weary the people with distant campaigns."
  },
  "s0242": {
    "chinese": "是以近無不聽，遠無不服。",
    "literal": "Eleventh month, returned to Haojing.",
    "idiomatic": "Thus the near obey without exception, the far submit without exception."
  },
  "s0243": {
    "chinese": "今自大畢、伯士之終也，犬戎氏以其職來王，天子曰『予必以不享征之，且觀之兵』，無乃廢先王之訓，而王幾頓乎？",
    "literal": "Twelfth month, attacked the Quanrong.",
    "idiomatic": "Now since the end of Da Bi and Bo Shi, the Quanrong have come to serve the king with their duties. The Son of Heaven said: 'I must campaign against them for not enjoying tribute, and moreover observe their troops.' Is this not abandoning the former kings' teachings, causing the king's affairs to falter?'"
  },
  "s0244": {
    "chinese": "吾聞犬戎樹敦，率舊德而守終純固，其有以御我矣。」",
    "literal": "Duke Xuan of Wei, Jin, first year.",
    "idiomatic": "'I have heard that the Quanrong plant virtue, follow old virtues and maintain pure firmness to the end, they have means to resist us.'"
  },
  "s0245": {
    "chinese": "王遂征之，得四白狼四白鹿以歸。",
    "literal": "Together established him.",
    "idiomatic": "The king then campaigned against them, obtained four white wolves and four white deer and returned."
  },
  "s0246": {
    "chinese": "自是荒服者不至。",
    "literal": "Punished Zhou Xu.",
    "idiomatic": "From this time the distant subjects did not come."
  },
  "s0247": {
    "chinese": "諸侯有不睦者，甫侯言於王，作修刑辟。",
    "literal": "Beng to Lu, exchanged Xu fields.",
    "idiomatic": "When feudal lords were not harmonious, Fu Hou spoke to the king, making the Statute for Cultivating Punishments."
  },
  "s0248": {
    "chinese": "王曰：「吁，來！",
    "literal": "Quwo Wu Gong killed Xiao Zi.",
    "idiomatic": "The king said: 'Ah, come!'"
  },
  "s0249": {
    "chinese": "有國有土，告汝祥刑。",
    "literal": "Zhou attacked Quwo, established Duke Ai of Jin's younger brother Min as Duke of Jin.",
    "idiomatic": "You who have states and territories, I announce to you the auspicious punishments."
  },
  "s0250": {
    "chinese": "在今爾安百姓，何擇非其人，何敬非其刑，何居非其宜與？",
    "literal": "Duke Min of Jin, first year.",
    "idiomatic": "Now you pacify the common people, what is there to choose if not the right person, what to respect if not the right punishment, what to dwell on if not what is appropriate?'"
  },
  "s0251": {
    "chinese": "兩造具備，師聽五辭。",
    "literal": "Duke Huan of Song, Yu Yue, first year.",
    "idiomatic": "Both parties are present, the judge hears the five statements."
}
}
