{
  "s0349": "An Qisheng is an immortal who passes through Penglai, when it matches he appears to people, when it doesn't match he hides.'",
  "s0350": "Therefore the emperor began personally sacrificing to the stove, sent magicians into the sea seeking Penglai and An Qisheng and others, and undertook transforming cinnabar and realgar and other medicines into gold.",
  "s0351": "After a long time, Li Shaojun fell ill and died.",
  "s0352": "The emperor considered him to have transformed and departed without dying, and ordered Huang Hammer Clerk Kuan Shu to receive his techniques.",
  "s0353": "Seeking Penglai and An Qisheng could not be obtained, but the sea magicians of Yan and Qi with their strange and far-fetched techniques came in even greater numbers to speak of divine matters.",
  "s0354": "The Bo man Miu Ji memorialized sacrificing to Tai Yi, saying: 'Among the heavenly spirits, the most honored is Tai Yi, Tai Yi's assistants are called the Five Emperors.",
  "s0355": "In ancient times the Son of Heaven sacrificed to Tai Yi in the southeastern suburbs in spring and autumn, using the great sacrificial animals, for seven days, opened eight paths for the ghosts.'",
  "s0356": "Therefore the emperor ordered the grand invocator to establish his sacrifice in Chang'an's southeastern suburbs, constantly maintaining the sacrifice according to Ji's methods.",
  "s0357": "Afterward someone submitted a memorial saying: 'In ancient times the Son of Heaven once every three years used great sacrificial animals to sacrifice to the Three Ones: Heaven One, Earth One, Tai One.'",
  "s0358": "The emperor approved it, ordered the grand invocator to oversee sacrificing to them on Ji's Tai Yi altar, according to his methods.",
  "s0359": "Later someone again submitted a memorial saying: 'In ancient times the Son of Heaven constantly used spring to release sacrifices, sacrificing to the Yellow Emperor used one owl broken mirror;",
  "s0360": "the Dark Sheep used sheep to sacrifice;",
  "s0361": "the Horse Walk used one blue stallion;",
  "s0362": "Tai Yi, Ze Mountain Lord, Earth Chief used oxen;",
  "s0363": "Wu Yi Lord used dried fish;",
  "s0364": "Yin Yang messengers used one ox.'",
  "s0365": "He ordered the sacrificial officials to oversee it according to his methods, sacrificing beside Ji's Tai Yi altar.",
  "s0366": "Afterward, the emperor's park had a white deer, used its skin as currency to proclaim auspicious responses, created white gold.",
  "s0367": "The next year, at the Yong suburban sacrifice, they obtained a one-horned beast, like a muntjac.",
  "s0368": "The officials said: 'Your Majesty reverently performed the suburban sacrifice, the Supreme Deity responded and enjoyed it, bestowed a one-horned beast, probably a qilin.'",
  "s0369": "Therefore they offered it at the five altars, the altars added one ox for burnt offering.",
  "s0370": "He bestowed white gold on the feudal lords, the wind and symbols matched heaven's responses.",
  "s0371": "Therefore the King of Jibei considered the emperor would perform feng and shan, submitted a memorial offering Mount Tai and its neighboring cities, the emperor compensated him with other counties.",
  "s0372": "The King of Changshan committed crimes, was moved, the emperor enfeoffed his younger brother at Zhending to continue the previous king's sacrifices, and made Changshan a commandery, then all five peaks were in the Son of Heaven's commanderies.",
  "s0373": "The next year, the Qi man Shao Wen appeared before the emperor using ghost and spirit techniques.",
  "s0374": "The emperor favored Lady Wang, Lady Wang died, Shao Wen using techniques seemed to summon Lady Wang and the stove ghost's appearance at night, the emperor saw them from within the curtains.",
  "s0375": "Therefore he appointed Shao Wen as General Wencheng, richly rewarded him, treated him with guest rituals.",
  "s0376": "Wencheng said: 'If Your Majesty wishes to communicate with spirits, the palace chambers and clothing should resemble the spirits, then spiritual objects will arrive.'",
  "s0377": "Therefore he made painted cloud vapor carriages, and each on victorious days drove carriages to ward off evil spirits.",
  "s0378": "He also built the Ganquan Palace, in the center made a platform chamber, painted heaven, earth, Tai Yi, and various ghosts and spirits, and placed sacrificial utensils to summon heavenly spirits.",
  "s0379": "After over a year, his techniques increasingly declined, spirits did not come.",
  "s0380": "He made a silk book to feed an ox, pretended not to know, said this ox's belly has something strange.",
  "s0381": "They killed and inspected, obtained the book, the book spoke of very strange things.",
  "s0382": "The emperor recognized his handwriting, questioned the person, it was indeed a forged book, therefore executed General Wencheng, concealed it.",
  "s0383": "Afterward they then made the Bai Liang, copper pillars, and dew-catching immortal palms and such.",
  "s0384": "The year after Wencheng died, the emperor fell seriously ill at Ding Lake, shamans and physicians were all summoned, but he did not recover.",
  "s0385": "You Shui Fa Gen said Shang Commandery had a shaman who fell ill and ghosts and spirits descended to her.",
  "s0386": "The emperor summoned and established sacrifices to her at Ganquan.",
  "s0387": "When he fell ill, he sent people to ask the divine lord.",
  "s0388": "The divine lord said: 'The emperor need not worry about illness.",
  "s0389": "When illness improves a little, force yourself to meet me at Ganquan.'",
  "s0390": "Therefore the illness improved, he arose, went to Ganquan, the illness was completely cured.",
  "s0391": "He granted a great amnesty, established the Shou Palace divine lord.",
  "s0392": "The Shou Palace divine lord's most honored was Tai Yi, her assistants called Da Jin, Si Ming and others, all followed her.",
  "s0393": "She could not be seen, people heard her words, her words were like human speech.",
  "s0394": "Sometimes left, sometimes came, when she came the wind was solemn.",
  "s0395": "She resided in the chamber curtains.",
  "s0396": "Sometimes spoke by day, but usually at night.",
  "s0397": "The emperor purified himself, then entered."
}
