{
  "s2309": "Seventeen. Nei Shi Teng struck got Han Wang An, took all his land, established Ying Chuan jun. Hua Yang Tai Hou died.",
  "s2311": "Nine. Qin captured Wang An, Qin extinguished Han.",
  "s2319": "Fourteen. Wei Jun Jiao first year.",
  "s2327": "Nineteen. Wang Jian pulled Zhao, captured Wang Qian at Han Dan. Di Tai Hou died.",
  "s2330": "Eight. Qin Wang Jian captured Wang Qian at Han Dan. Gong Zi Jia self-established as Dai Wang.",
  "s2331": "Ten. You Wang died, younger brother Hao established, became Ai Wang. Third month, Fu Chu assassinated Ai Wang.",
  "s2336": "Twenty. Yan crown prince sent Jing Ke to assassinate king, aware of it. Wang Jian will strike Yan.",
  "s2337": "Wei Wang Jia first year",
  "s2339": "Dai Wang Jia first year",
  "s2340": "Chu Wang Fu Chu first year. Fu Chu, Ai Wang concubine brother.",
  "s2341": "Twenty-eight. Crown prince Dan sent Jing Ke to assassinate Qin Wang, Qin attacked us.",
  "s2345": "Twenty-one. Wang Ben struck Chu.",
  "s2349": "Two. Qin greatly broke us, took ten cities.",
  "s2350": "Twenty-nine. Qin pulled our Ji, got crown prince Dan. Wang moved to Liao Dong.",
  "s2354": "Twenty-two. Wang Ben struck Wei, got their Wang Jia, took all their land.",
  "s2355": "Three. Qin captured Wang Jia.",
  "s2363": "Twenty-three. Wang Jian, Meng Wu struck broke Chu army, killed their general Xiang Yan.",
  "s2367": "Four. Qin broke our general Xiang Yan.",
  "s2372": "Twenty-four. Wang Jian, Meng Wu broke Chu, captured their Wang Fu Chu.",
  "s2376": "Five. Qin captured Wang Fu Chu. Qin extinguished Chu.",
  "s2381": "Twenty-five. Wang Ben struck Yan, captured Wang Xi. Again struck got Dai Wang Jia. Fifth month, all under heaven greatly feasted.",
  "s2384": "Six. Qin general Wang Ben captured Wang Jia, Qin extinguished Zhao.",
  "s2386": "Thirty-three. Qin captured Wang Xi, pulled Liao Dong, Qin extinguished Yan.",
  "s2390": "Twenty-six. Wang Ben struck Qi, captured Wang Jian. First united all under heaven, established as emperor.",
  "s2396": "Forty-four. Qin captured Wang Jian. Qin extinguished Qi.",
  "s2399": "Twenty-seven changed named He river 'De Water'. Made twelve gold men. Commanded people called 'Qian Shou'. Unified all under heaven writing. Divided into thirty-six jun.",
  "s2408": "Twenty-eight made E Pang Palace. Went to Heng Shan. Repaired chariot roads. Emperor went to Lang Ya, passed Nan Jun entered. Made Tai Ji temple. Granted households thirty, rank one level.",
  "s2417": "Twenty-nine jun xian great search ten days. Emperor went to Lang Ya, passed Shang Dang entered.",
  "s2435": "Thirty-one changed named La 'Jia Ping'. Granted Qian Shou li six dan rice two sheep, with Jia Ping. Great search twenty days.",
  "s2444": "Thirty-two emperor went to Jie Shi, passed Shang Jun entered.",
  "s2453": "Thirty-three sent various fugitives and merchants concubine sons to plunder take Lu Liang, made Gui Lin, Nan Hai, Xiang jun, for garrisoning. Northwest took Rong made thirty-four xian. Built long wall He river, Meng Tian led thirty thousand.",
  "s2462": "Thirty-four sent handled prison unjust ones built long wall. Took southern Yue land. Reversed prison old losses.",
  "s2471": "Thirty-five made straight road, road Jiu Yuan, connected Gan Quan.",
  "s2480": "Thirty-six moved people to Bei He, Yu Zhong, endured moved three places, bestowed rank one level. Stone carved under Dong Jun, had writing 'Land divided.'",
  "s2489": "Thirty-seven tenth month, emperor went to Hui Ji, Lang Ya, returned to Sha Qiu collapsed. Son Hu Hai established, became Er Shi emperor. Killed Meng Tian. Road Jiu Yuan entered. Again circulated coin.",
  "s2498": "Er Shi first year tenth month Wu Yin, great amnesty criminals. Eleventh month, made Tu Yuan. Twelfth month, entered E Pang Palace. That ninth month, jun xian all rebelled. Chu troops reached Xi, Zhang Han struck repelled them. Sent out Wei Jun Jiao as commoner.",
  "s2507": "Two generals Zhang Han, Chang Shi Si Ma Xin, Du Wei Dong Yi pursued Chu troops to river. Executed chancellor Si, Qu Ji, general Feng Jie.",
  "s2516": "Three Zhao Gao rebelled, Er Shi suicide, Gao established Er Shi younger brother Zi Ying. Zi Ying established, assassinated Gao, exterminated three clans. Feudal lords entered Qin, Ying surrendered, killed by Xiang Yu. Soon executed Yu, all under heaven belonged to Han."
}
