{
  "s0199": "Bright bright has light.",
  "s0200": "Cease troops;",
  "s0201": "Only beneficial to duke king, not beneficial to managing troops.",
  "s0202": "Its loses order, has response appears Fang.",
  "s0203": "Year early, drought;",
  "s0204": "Late, floods.",
  "s0205": "Xie Xia year: year yin in Wei, star dwells Shen.",
  "s0206": "With sixth month and Zi Xi, Shen morning out, called Long Column.",
  "s0207": "Bright bright has light.",
  "s0208": "Beneficial to march troops.",
  "s0209": "Its loses order, has response appears Ji.",
  "s0210": "Hun Tan year: year yin in Shen, star dwells Wei.",
  "s0211": "With seventh month and Dong Jing, Yu Gui morning out, called Great Sound.",
  "s0212": "Bright bright white.",
  "s0213": "Its loses order, has response appears Qian Niu.",
  "s0214": "Zuo E year: year yin in You, star dwells Wu.",
  "s0215": "With eighth month and Liu, Seven Stars, Zhang morning out, called Long Wang.",
  "s0216": "Zuo zuo has spikes.",
  "s0217": "State its prosperous, ripe grain.",
  "s0218": "Its loses order, has response appears Wei.",
  "s0219": "Has drought and prosperous, has female mourning, people illness.",
  "s0220": "Yan Mao year: year yin in Xu, star dwells Si.",
  "s0221": "With ninth month and Yi, Zhen morning out, called Heaven Sui.",
  "s0222": "White color greatly bright.",
  "s0223": "Its loses order, has response appears Dong Bi.",
  "s0224": "Year floods, female mourning.",
  "s0225": "Da Yuan Xian year: year yin in Hai, star dwells Chen.",
  "s0226": "With tenth month and Jue, Kang morning out, called Great Zhang.",
  "s0227": "Cang cang thus, stars if leap and yin out dawn, this called 'correct level'.",
  "s0228": "Raise army troops, its commander must martial;",
  "s0229": "Its state has virtue, will have four seas.",
  "s0230": "Its loses order, has response appears Lou.",
  "s0231": "Kun Dun year: year yin in Zi, star dwells Mao.",
  "s0232": "With eleventh month and Di, Fang, Xin morning out, called Heaven Spring.",
  "s0233": "Black color very bright.",
  "s0234": "Rivers pools its prosperous, not beneficial to raise troops.",
  "s0235": "Its loses order, has response appears Mao.",
  "s0236": "Chi Fen Ruo year: year yin in Chou, star dwells Yin, with twelfth month and Wei, Ji morning out, called Heaven Hao.",
  "s0237": "Zhe thus black color very bright.",
  "s0238": "Its loses order, has response appears Shen.",
  "s0239": "Should dwell not dwell, dwell then moreover left right shake, not should go go it, with other stars meet, its state inauspicious.",
  "s0240": "Its dwells long, state has virtue thick.",
  "s0241": "Its horns move, suddenly small suddenly big, if color several change, person lord has worry.",
  "s0242": "Its loses order lodges below, advances east north, three months born heaven club, long four zhang, end Dui, advances east south, three months born comet, long two zhang, resembles comet.",
  "s0243": "Retreats west north, three months born heaven chan, long four zhang, end Dui.",
  "s0244": "Retreats west south, three months born heaven spear, long several zhang, two heads Dui.",
  "s0245": "Carefully observe its seen state, cannot raise affairs use troops.",
  "s0246": "Its out like float like sink, its state has earth works;",
  "s0247": "Like sink like float, its fields lost.",
  "s0248": "Color red and has horns, its dwells state prosperous."
}
