{
  "s0152": {
    "chinese": "封商紂子祿父殷之餘民。",
    "literal": "He made the Luo Gong proclamation, established the well-field system.",
    "idiomatic": "He enfeoffed King Zhou's son Lu Fu with the remaining Yin people."
  },
  "s0153": {
    "chinese": "武王為殷初定未集，乃使其弟管叔鮮、蔡叔度相祿父治殷。",
    "literal": "He made the wine prohibition proclamation, banned drunkenness.",
    "idiomatic": "Since Yin had just been conquered and was not yet settled, King Wu sent his younger brothers Guan Shu Xian and Cai Shu Du to assist Lu Fu in governing Yin."
  },
  "s0154": {
    "chinese": "已而命召公釋箕子之囚。",
    "literal": "King Cheng grew up, the Duke of Zhou returned the government.",
    "idiomatic": "Then he commanded Shao Gong to release Ji Zi from prison."
  },
  "s0155": {
    "chinese": "命畢公釋百姓之囚，表商容之閭。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": "He commanded Bi Gong to release the prisoners of the common people and honor Shang Rong's neighborhood."
  },
  "s0156": {
    "chinese": "命南宮括散鹿臺之財，發鉅橋之粟，以振貧弱萌隸。",
    "literal": "King Cheng died, King Kang ascended.",
    "idiomatic": "He commanded Nan Gong Kuo to distribute the treasures of the Deer Tower and open the granaries of Ju Qiao to relieve the poor, weak, widows, and orphans."
  },
  "s0157": {
    "chinese": "命南宮括、史佚展九鼎保玉。",
    "literal": "King Kang monitored the eastern regions, toured the lords, administered justice.",
    "idiomatic": "He commanded Nan Gong Kuo and Shi Yi to display the Nine Tripods and the precious jade."
  },
  "s0158": {
    "chinese": "命閎夭封比干之墓。",
    "literal": "Forty years without punishment, the world was at peace under King Kang.",
    "idiomatic": "He commanded Hong Yao to honor Bi Gan's tomb."
  },
  "s0159": {
    "chinese": "命宗祝享祠于軍。",
    "literal": "King Kang died, King Zhao ascended.",
    "idiomatic": "He commanded the ancestral priests to offer sacrifices in the army."
  },
  "s0160": {
    "chinese": "乃罷兵西歸。",
    "literal": "King Zhao went south to tour, died at the Han River.",
    "idiomatic": "Thus he disbanded the army and returned west."
  },
  "s0161": {
    "chinese": "行狩，記政事，作武成。",
    "literal": "King Mu ascended.",
    "idiomatic": "He went hunting, recorded governmental affairs, and composed the 'Completion of the War.'"
  },
  "s0162": {
    "chinese": "封諸侯，班賜宗彝，作分殷之器物。",
    "literal": "King Mu was ambitious and fond of grandeur, personally drove the eight horses.",
    "idiomatic": "He enfeoffed the feudal lords, distributed ancestral vessels, and made the ritual objects for dividing Yin."
  },
  "s0163": {
    "chinese": "武王追思先聖王，乃褒封神農之後於焦，黃帝之後於祝，帝堯之後於薊，帝舜之後於陳，大禹之後於杞。",
    "literal": "He went west to attack the Quanrong, obtained four white wolves and four white deer.",
    "idiomatic": "King Wu, reflecting on the ancient sage kings, honored and enfeoffed the descendants of Shen Nong at Jiao, Huang Di at Zhu, Emperor Yao at Ji, Emperor Shun at Chen, and Great Yu at Qi."
  },
  "s0164": {
    "chinese": "於是封功臣謀士，而師尚父為首封。",
    "literal": "He made Zhao Ju the Grand Master, prepared to attack the Quanrong.",
    "idiomatic": "Thus he enfeoffed the meritorious officials and counselors, with Master Shangfu receiving the first enfeoffment."
  },
  "s0165": {
    "chinese": "封尚父於營丘，曰齊。",
    "literal": "The Quanrong submitted, King Mu stopped.",
    "idiomatic": "He enfeoffed Shangfu at Yingqiu, calling it Qi."
  },
  "s0166": {
    "chinese": "封弟周公旦於曲阜，曰魯。",
    "literal": "He toured the north, reached the Great Wall.",
    "idiomatic": "He enfeoffed his younger brother Zhou Gong Dan at Qufu, calling it Lu."
  },
  "s0167": {
    "chinese": "封召公奭於燕。",
    "literal": "He saw the Yellow Emperor's Xuanyuan Terrace.",
    "idiomatic": "He enfeoffed Shao Gong Shi at Yan."
  },
  "s0168": {
    "chinese": "封弟叔鮮於管，弟叔度於蔡。",
    "literal": "He returned and died at Haojing.",
    "idiomatic": "He enfeoffed his younger brother Shu Xian at Guan and his younger brother Shu Du at Cai."
  },
  "s0169": {
    "chinese": "餘各以次受封。",
    "literal": "King Mu's son King Gong ascended.",
    "idiomatic": "The others each received enfeoffments in order."
  },
  "s0170": {
    "chinese": "武王徵九牧之君，登豳之阜，以望商邑。",
    "literal": "King Gong died, his younger brother King Yi ascended.",
    "idiomatic": "King Wu summoned the lords of the nine provinces, ascended the hill of Bin, and gazed upon the city of Shang."
  },
  "s0171": {
    "chinese": "武王至于周，自夜不寐。",
    "literal": "King Yi died, King Xiao ascended.",
    "idiomatic": "King Wu arrived at Zhou, and from that night he could not sleep."
}
}
