{
  "s0497": "Tui said: 'Blame moreover imitate it, crime have more.",
  "s0498": "Moreover exit resent words, not eat its salary.'",
  "s0499": "Mother said: 'Also make know it, how?'",
  "s0500": "Answered said: 'Words, body pattern;",
  "s0501": "body wish hide, why use pattern?",
  "s0502": "Pattern it, is seek manifest.'",
  "s0503": "His mother said: 'Able like this?",
  "s0504": "With you together hide.'",
  "s0505": "To death not again see.",
  "s0506": "Jie Zi Tui followers pitied him, then hung writing gong gate said: 'Dragon wish ascend heaven, five snakes as auxiliary.",
  "s0507": "Dragon already ascended cloud, four snakes each entered their residence, one snake alone resented, finally not see place.'",
  "s0508": "Wen Gong exited, saw his writing, said: 'This Jie Zi Tui.",
  "s0509": "I just worry wang chamber, not plan his merit.'",
  "s0510": "Sent people summon him, then perished.",
  "s0511": "Then sought location, heard entered Mian Shang mountain middle, then Wen Gong surrounded Mian Shang mountain middle sealed it, to as Jie Tui field, numbered Jie Shan, 'to record my excess, moreover commend good person'.",
  "s0512": "Followed perished lowly minister Hu Shu said:",
  "s0513": "'Lord three carry reward, reward not reach minister, dare request crime.'",
  "s0514": "Wen Gong reported said: 'Guide me with benevolence righteousness, prevent me with virtue favor, this receive upper reward.",
  "s0515": "Assist me with conduct, finally established, this receive next reward.",
  "s0516": "Arrow stone difficulty, sweat horse labor, this again receive next reward.",
  "s0517": "If with strength serve me without supplement my lack, this receive next reward.",
  "s0518": "Three rewards after, then reach you.'",
  "s0519": "Jin people heard it, all pleased.",
  "s0520": "Second year spring, Qin army Yellow River above, about enter wang.",
  "s0521": "Zhao Shuai said:",
  "s0522": "'Seek hegemony not like enter wang honor Zhou.",
  "s0523": "Zhou Jin same surname, Jin not first enter wang, after Qin enter it, no with command world.",
  "s0524": "Just now honor wang, Jin capital.'",
  "s0525": "Third month Jia Chen, Jin then sent troops to Yang Fan, surrounded Wen, entered Xiang Wang to Zhou.",
  "s0526": "Fourth month, killed wang younger brother Dai.",
  "s0527": "Zhou Xiang Wang granted Jin He Nei Yang Fan land.",
  "s0528": "Fourth year, Chu Cheng Wang and feudal lords surrounded Song, Song Gong Sun Gu like Jin informed urgent.",
  "s0529": "Xian Zhen said: 'Repay grant settle hegemony, at now in.'",
  "s0530": "Hu Yan said: 'Chu newly obtained Cao initial married at Wei, if attack Cao, Wei, Chu must save them, then Song exempt.'",
  "s0531": "Then Jin made three armies.",
  "s0532": "Zhao Shuai raised Xi Hu lead middle army, Xi Zhen assist him;",
  "s0533": "sent Hu Yan lead upper army, Hu Mao assist him, commanded Zhao Shuai as minister;",
  "s0534": "Luan Zhi lead lower army, Xian Zhen assist him;",
  "s0535": "Xun Lin Fu drove chariot, Wei Chou as right: went attack.",
  "s0536": "Winter twelfth month, Jin troops first descend Shan Dong, with Yuan sealed Zhao Shuai.",
  "s0537": "Fifth year spring, Jin Wen Gong wished attack Cao, borrowed road at Wei, Wei people not permitted.",
  "s0538": "Returned from He Nan crossed, invaded Cao, attacked Wei.",
  "s0539": "First month, took Wu Lu.",
  "s0540": "Second month, Jin Hou, Qi Hou allied at Lian Yu.",
  "s0541": "Wei Hou requested ally Jin, Jin not permitted.",
  "s0542": "Wei Hou wished with Chu, country people not wished, so exited their lord to please Jin.",
  "s0543": "Wei Hou resided Xiang Niu, gong zi Mai guarded Wei.",
  "s0544": "Chu saved Wei, not complete.",
  "s0545": "Jin Hou surrounded Cao."
}
