{
  "s0301": "You Wang's first year, he attacked Song.",
  "s0302": "In the second year, he attacked Zheng.",
  "s0303": "Zi Bi reigned as king for more than ten days, but Zi Xi could not be established, and both were executed.",
  "s0304": "All four sons were cut off without descendants.",
  "s0305": "Only Qi Ji later ascended the throne as Ping Wang, and finally continued the Chu sacrifices, just as the omen had foretold.",
  "s0306": "Initially, when Zi Bi returned from Jin, Han Xuan Zi asked Shu Xiang: 'Will Zi Bi succeed?'",
  "s0307": "He replied: 'He will not succeed.'",
  "s0308": "Xuan Zi said: 'Like evils seek each other, like merchants in the market - why would he not succeed?'",
  "s0309": "He replied: 'Without sharing good things, who shares evil?",
  "s0310": "Taking a state has five difficulties: having favor but no people, one;",
  "s0311": "having people but no master, two;",
  "s0312": "having a master but no strategy, three;",
  "s0313": "having strategy but no populace, four;",
  "s0314": "having populace but no virtue, five.'",
  "s0315": "Zi Bi has been in Jin for thirteen years, but Jin and Chu followers have not communicated - this can be called having no people;",
  "s0316": "his clan is exhausted and relatives have rebelled - this can be called having no master;",
  "s0317": "moving without cause - this can be called having no strategy;",
  "s0318": "being a hostage all his life - this can be called having no populace;",
  "s0319": "fleeing without beloved omens - this can be called having no virtue.",
  "s0320": "The king is cruel but not cautious, Zi Bi encounters five difficulties to assassinate his lord - who can help him succeed!",
  "s0321": "One who can have the state of Chu - it would be Qi Ji.",
  "s0322": "He controls Chen and Cai, and the outer areas beyond Fang Cheng belong to him.",
  "s0323": "Harsh and evil do not arise, thieves hide themselves, private desires are not violated, the people have no resentment.",
  "s0324": "The spirits have commanded him, the people believe in him.",
  "s0325": "When the Mi surname has disorder, it must be the youngest who establishes - this is Chu's constant rule.",
  "s0326": "Zi Bi's office is Right Minister;",
  "s0327": "counting his noble favor, he is an illegitimate son;",
  "s0328": "according to the spirits' command, he is even further removed;",
  "s0329": "the people do not long for him - how can he be established?'",
  "s0330": "Xuan Zi said: 'Were Duke Huan of Qi and Duke Wen of Jin not also like this?'",
  "s0331": "He replied: 'Duke Huan was the son of Wei Ji, favored by Duke Xi.",
  "s0332": "He had Bao Shu Ya, Bin Xu Wu, Xi Peng as assistants, Ju and Wei as outer supporters, Gao and Guo as inner supporters.",
  "s0333": "He followed goodness like flowing water, bestowed favors without tiring.",
  "s0334": "That he obtained the state - was it not fitting?",
  "s0335": "In ancient times, our Duke Wen was the son of Hu Ji, favored by Duke Xian.",
  "s0336": "He studied tirelessly.",
  "s0337": "At seventeen years old, he had five worthy men, had former grand master Zi Yu and Zi Fan as heart, had Wei Wu and Jia Tuo as limbs, had Qi, Song, Qin, Chu as outer supporters, had Luan, Xi, Hu, Xian as inner supporters.",
  "s0338": "Exiled for nineteen years, his resolve grew even stronger.",
  "s0339": "Hui and Huai abandoned the people, the people followed him.",
  "s0340": "That Duke Wen obtained the state - was it not fitting?",
  "s0341": "Zi Bi has done nothing for the people, has no support from outside, when he left Jin, Jin did not send him;",
  "s0342": "when he returned to Chu, Chu did not welcome him.",
  "s0343": "How can he obtain the state!'",
  "s0344": "Zi Bi indeed did not last, and the one who finally ascended was Qi Ji, just as Shu Xiang said.",
  "s0345": "In Ping Wang's second year, he sent Fei Wu Ji to Qin to take a wife for Crown Prince Jian.",
  "s0346": "The woman was beautiful, and on the way back, Wu Ji returned first and said to Ping Wang: 'The Qin woman is beautiful - you should take her yourself, and find another wife for the crown prince.'",
  "s0347": "Ping Wang listened to him and ultimately took the Qin woman himself, fathering Xiong Zhen.",
  "s0348": "He found another wife for the crown prince.",
  "s0349": "At this time, Wu She was the crown prince's Grand Tutor, Wu Ji was the Junior Tutor.",
  "s0350": "Wu Ji was not favored by the crown prince and constantly slandered Crown Prince Jian.",
  "s0351": "Jian was then fifteen years old, his mother was a woman from Cai, not favored by the king, so the king gradually became more distant from Jian.",
  "s0352": "In the sixth year, he sent Crown Prince Jian to reside at Cheng Fu to guard the border.",
  "s0353": "Wu Ji slandered him, saying: 'Jian is plotting rebellion.'",
  "s0354": "Ping Wang believed him and sent someone to kill Jian.",
  "s0355": "Jian heard of it and fled to Song, then to Zheng, then to Wei, then to Jin, finally dying in Cheng Fu.",
  "s0356": "Jian's son Xiong Shen was young, so he also fled to Jin.",
  "s0357": "Wu Ji feared disaster and fled to Zheng.",
  "s0358": "Wu She was Jian's tutor, and because of this he was imprisoned and about to be executed.",
  "s0359": "Wu She said: 'Please let me die after my student.'",
  "s0360": "His two sons Wu Shang and Wu Zixu were in the Chu army, heard their father would be executed, and fled to Wu.",
  "s0361": "Wu Zixu later became a famous minister of Wu, and together with Sun Wu destroyed Chu.",
  "s0362": "Wu She died, and his clan was exterminated.",
  "s0363": "In Ping Wang's thirteenth year, the Jin minister Zhao Dun assassinated his lord Ling Gong and established Cheng Gong.",
  "s0364": "In the fifteenth year, Ping Wang died, and his son Zhao Wang Zhen ascended the throne.",
  "s0365": "Zhao Wang's first year, he attacked Song.",
  "s0366": "In the sixth year, Zhao Wang died, and his son Hui Wang Zhang ascended the throne.",
  "s0367": "Hui Wang's first year, he attacked Song.",
  "s0368": "In the second year, Hui Wang died, and his son Jian Wang Sheng ascended the throne.",
  "s0369": "Jian Wang's first year, he attacked Song.",
  "s0370": "In the second year, he attacked Zheng.",
  "s0371": "In the fourth year, Jian Wang died, and his son Sheng Wang Dang ascended the throne.",
  "s0372": "Sheng Wang's first year, he attacked Song.",
  "s0373": "In the second year, he attacked Wei.",
  "s0374": "In the third year, Sheng Wang died, and his son Dao Wang Yi ascended the throne.",
  "s0375": "Dao Wang's first year, he attacked Song.",
  "s0376": "In the twelfth year, Dao Wang died, and his son Xuan Wang Liang ascended the throne.",
  "s0377": "Xuan Wang's first year, he attacked Wei.",
  "s0378": "In the third year, he attacked Song.",
  "s0379": "In the fourth year, Xuan Wang died, and his son Wei Wang Shang ascended the throne.",
  "s0380": "Wei Wang's first year, he attacked Zheng.",
  "s0381": "In the fifth year, Wei Wang died, and his son Bao Wang Ying ascended the throne.",
  "s0382": "Bao Wang's first year, he attacked Song.",
  "s0383": "In the sixth year, Bao Wang died, and his son Xuan Wang Wei ascended the throne.",
  "s0384": "Xuan Wang's first year, he attacked Song.",
  "s0385": "In the third year, he attacked Wei.",
  "s0386": "In the sixth year, Xuan Wang died, and his son Hui Wang Wei ascended the throne.",
  "s0387": "Hui Wang's first year, he attacked Song.",
  "s0388": "In the fourth year, Hui Wang died, and his son Zhao Wang Wei ascended the throne.",
  "s0389": "Zhao Wang's first year, he attacked Song.",
  "s0390": "In the second year, he attacked Zheng.",
  "s0391": "In the third year, Zhao Wang died, and his son You Wang Lu ascended the throne.",
  "s0392": "You Wang's first year, he attacked Song.",
  "s0393": "In the second year, he attacked Zheng.",
  "s0394": "In the fourth year, You Wang died, and his son Ai Wang Shen ascended the throne.",
  "s0395": "Ai Wang's first year, he attacked Song.",
  "s0396": "In the second year, Ai Wang died, and his son Shen Wang Hao ascended the throne.",
  "s0397": "Shen Wang's first year, he attacked Song.",
  "s0398": "In the second year, he attacked Wei.",
  "s0399": "In the sixth year, Shen Wang died, and his son You Wang Hao ascended the throne.",
  "s0400": "You Wang's first year, he attacked Wei."
}
