{
  "s0081": "Now you rise from Jiangdong, the Chu generals all vie to attach to you, because you are generation after generation Chu generals, able to restore the Chu descendants.'",
  "s0082": "Therefore Xiang Liang agreed to his words, sought King Huai of Chu's grandson Xin among the people, who was herding sheep, established him as King Huai of Chu, following the people's hopes.",
  "s0083": "Chen Ying became Chu's Supreme Pillar of State, enfeoffed five counties, with King Huai resided at Xutai.",
  "s0084": "Xiang Liang called himself 'Lord Wu Xin'.",
  "s0085": "After several months, led troops to attack Kangfu, joined with Qi's Tian Rong and Sima Longqu's army to rescue Dong'a, greatly defeated Qin army at Dong'a.",
  "s0086": "Tian Rong then led troops back, drove out their king Jia.",
  "s0087": "Jia fled to Chu.",
  "s0088": "Jia's prime minister Tian Jiao fled to Zhao.",
  "s0089": "Jiao's younger brother Tian Xian was formerly a Qi general, resided in Zhao, dared not return.",
  "s0090": "Tian Rong established Tian Dan's son Shi as Qi king.",
  "s0091": "Xiang Liang had already defeated Dong'a and lowered the army, then pursued Qin army.",
  "s0092": "Attacked Yuanqu, took it.",
  "s0093": "Attacked Chenggao, took it.",
  "s0094": "Attacked Dingtao, defeated Qin forces there.",
  "s0095": "Xiang Liang greatly expanded, his troops numbered sixty to seventy thousand.",
  "s0096": "He made Yuan Gong the prime minister, Fan Zeng the strategist.",
  "s0097": "Fan Zeng advised Xiang Liang to establish a descendant of the Chu royal family as king to win the people's hearts.",
  "s0098": "He found Xiong Xin, grandson of King Huai of Chu, established him as King Huai of Chu, with Pengcheng as capital.",
  "s0099": "King Huai made Xiang Liang 'Supreme General', gave him a seal, ordered him to attack the west.",
  "s0100": "Xiang Liang attacked Yongqiu, took it.",
  "s0101": "Attacked Dingtao again, took it.",
  "s0102": "Attacked External Huang, took it.",
  "s0103": "Attacked Chenliu, took it.",
  "s0104": "Xiang Liang grew arrogant, did not listen to advice.",
  "s0105": "The Qin general Zhang Han attacked Xiang Liang, defeated him at Dingtao, Xiang Liang was killed.",
  "s0106": "Xiang Liang's death caused the Chu army to lose heart, the nobles scattered.",
  "s0107": "King Huai moved the capital to Yinque.",
  "s0108": "Xiang Liang's nephew Xiang Ji and Fan Zeng collected the remaining troops, retreated east to Pengcheng.",
  "s0109": "They sent messengers to seek Xiang Liang's body, buried it in Yinling.",
  "s0110": "The Guangling man Zhao Ping then served Chen Wang by attacking Guangling, but could not take it.",
  "s0111": "He heard Chen Wang had been defeated and fled, and Qin troops were about to arrive, so crossed the Yangtze, forged Chen Wang's order, appointed Liang as Chu King's 'Supreme Pillar of State'.",
  "s0112": "He said: 'Jiangdong is already pacified, urgently lead troops west to attack Qin.'",
  "s0113": "Xiang Liang then led eight thousand men across the Yangtze west.",
  "s0114": "He heard Chen Ying had taken Dongyang, sent messengers desiring to join forces and go west together.",
  "s0115": "Chen Ying was formerly a Dongyang county clerk, resided in the county, was always trustworthy and careful, called an elder.",
  "s0116": "Dongyang youths killed their magistrate, gathered several thousand, wished to appoint a leader, had no suitable person, so invited Chen Ying.",
  "s0117": "Ying declined saying he could not, but they forcibly established Ying as leader, those who followed from the county got twenty thousand men.",
  "s0118": "The youths wished to establish Ying directly as king, with different colored banners and special banners.",
  "s0119": "Chen Ying's mother said to Ying: 'Since I became your family's wife, I have never heard that your ancestors had nobles.",
  "s0120": "Now suddenly gaining great fame, it is not auspicious.",
  "s0121": "Do not accept the king title.'",
  "s0122": "Ying's strategist Qin Jia said: 'If you do not accept, the people will disperse.",
  "s0123": "If you accept, you will gain great merit.'",
  "s0124": "Chen Ying then established himself as king, appointed Qin Jia as prime minister.",
  "s0125": "Xiang Liang sent messengers to Chen Ying, wishing to join forces.",
  "s0126": "Chen Ying's mother said: 'I heard generals are like women's husbands, difficult to know.",
  "s0127": "If we join Xiang Liang, we will become his subordinates.",
  "s0128": "Better to go west alone.'",
  "s0129": "Chen Ying sent messengers to Xiang Liang saying: 'My mother said generals are difficult to know.",
  "s0130": "I wish to go west alone.'",
  "s0131": "Xiang Liang was angry, attacked Chen Ying, defeated him.",
  "s0132": "Chen Ying fled to Dongyang, Xiang Liang pursued and killed him.",
  "s0133": "Xiang Liang took Dongyang, incorporated Chen Ying's troops, his forces grew to twenty thousand.",
  "s0134": "Xiang Liang then led troops west, camped at Xiapi.",
  "s0135": "At this time, Liu Ji was serving as magistrate of Pei, recruited troops, got several thousand men.",
  "s0136": "Xiang Liang sent messengers to Liu Ji, wishing to join forces.",
  "s0137": "Liu Ji's counselor Cao Can said: 'Xiang Liang is brave and has merit, but cannot be subordinate to.'",
  "s0138": "Liu Ji was hesitant.",
  "s0139": "Cao Can said: 'If we go, we will become his subordinates; if we don't go, he will attack us.'",
  "s0140": "Liu Ji said: 'Then what to do?'"
}