{
  "s0499": "Fourth year, rescued Song, repaid Cao, Wei shame.",
  "s0500": "Twenty-seventh year, thirty-ninth year, sent Zi Yu attacked Song.",
  "s0501": "Fourth year, Chu attacked us, we urgently reported Jin.",
  "s0502": "Second year, fifteenth year, thirteenth year, twentieth year, fortieth year, twenty-fifth year",
  "s0503": "632 Twentieth year, king hunted Yellow River north.",
  "s0504": "Twenty-eighth year, duke went Jian Tu assembled court.",
  "s0505": "Qi Zhao Gong Pan first year, assembled Jin defeated Chu, court Zhou king.",
  "s0506": "Fifth year, invaded Cao attacked Wei, took Wu Lu, arrested Cao Bo.",
  "s0507": "Feudal lords defeated Chu and court Yellow River north, Zhou commanded granted duke lands.",
  "s0508": "Twenty-eighth year, assembled Jin attacked Chu court Zhou.",
  "s0509": "Fortieth year, Jin defeated Zi Yu at Cheng Pu.",
  "s0510": "Fifth year, Jin rescued us, Chu troops departed.",
  "s0511": "Third year, Jin attacked us, took Wu Lu.",
  "s0512": "Duke fled out, established Gong Zi Xia assembled Jin court, again returned Wei.",
  "s0513": "Sixteenth year, assembled Jin attacked Chu, court Zhou king.",
  "s0514": "Fourteenth year, assembled Jin attacked Chu, court Zhou king.",
  "s0515": "Twenty-first year, Jin attacked us, arrested duke, again returned him.",
  "s0516": "Forty-first year, twenty-sixth year",
  "s0517": "631 Twenty-first year, twenty-ninth year, second year, sixth year, twenty-ninth year, forty-first year, sixth year, fourth year, Jin with Wei and Song.",
  "s0518": "Chen Gong Gong Shuo first year, fifteenth year, twenty-second year, forty-second year, twenty-seventh year",
  "s0519": "630 Twenty-second year, thirtieth year, third year, seventh year, listened Zhou returned Wei Cheng Gong.",
  "s0520": "With Qin surrounded Zheng.",
  "s0521": "Thirtieth year, surrounded Zheng, had words then departed.",
  "s0522": "Forty-second year, seventh year, fifth year, Zhou entered Cheng Gong, restored Wei.",
  "s0523": "Second year, sixteenth year, twenty-third year, forty-third year, Qin, Jin surrounded us, because Jin cause.",
  "s0524": "Twenty-eighth year",
  "s0525": "629 Twenty-third year, thirty-first year, fourth year, eighth year, thirty-first year, forty-third year, eighth year, sixth year, third year, seventeenth year, twenty-fourth year, forty-fourth year, twenty-ninth year",
  "s0526": "628 Twenty-fourth year, thirty-second year, fifth year, ninth year, Wen Gong died.",
  "s0527": "Thirty-second year, wished attack Zheng, Jian Shu said not permitted.",
  "s0528": "Forty-fourth year, ninth year, seventh year, fourth year, eighteenth year, twenty-fifth year, forty-fifth year, Wen Gong died.",
  "s0529": "Thirtieth year",
  "s0530": "627 Jiawu twenty-fifth year, thirty-third year, Xi Gong died.",
  "s0531": "Sixth year, Di invaded us.",
  "s0532": "Jin Xiang Gong Huan first year, broke Qin at Xiao.",
  "s0533": "Thirty-third year, attacked Zheng, Jin defeated us Xiao.",
  "s0534": "Forty-fifth year, tenth year, eighth year, fifth year, nineteenth year, twenty-sixth year, Zheng Mu Gong Lan first year, Qin attacked us, Xian Gao deceived them.",
  "s0535": "Thirty-first year",
  "s0536": "626 Twenty-sixth year, Lu Wen Gong Xing first year, seventh year, second year, attacked Wei, Wei attacked us.",
  "s0537": "Thirty-fourth year, defeated Xiao general wished perish return, duke restored their offices.",
  "s0538": "Forty-sixth year, king wished kill crown prince establish Zhi, crown prince feared, with tutor Pan Chong killed king.",
  "s0539": "King wished eat bear paw died, not listened.",
  "s0540": "Self-established as king.",
  "s0541": "Eleventh year, ninth year, Jin attacked us, we attacked Jin.",
  "s0542": "Sixth year, twentieth year, twenty-seventh year, second year, thirty-second year",
  "s0543": "625 Twenty-seventh year, second year, eighth year, third year, Qin repaid us Xiao, defeated at Wang.",
  "s0544": "Thirty-fifth year, attacked Jin repaid Xiao, defeated us at Wang.",
  "s0545": "Chu Mu Wang Shang Chen first year, with his crown prince residence granted Chong, as chancellor.",
  "s0546": "Twelfth year, tenth year, seventh year, twenty-first year, twenty-eighth year, third year, thirty-third year",
  "s0547": "624 Twenty-eighth year, third year, duke went Jin.",
  "s0548": "Ninth year, fourth year, Qin attacked us, took Wang Guan, we not came out.",
  "s0549": "Thirty-sixth year, with Meng Ming and others attacked Jin, Jin dared not come out.",
  "s0550": "Second year, Jin attacked us.",
  "s0551": "Thirteenth year, eleventh year, eighth year, twenty-second year, twenty-ninth year, fourth year, thirty-fourth year",
  "s0552": "623 Twenty-ninth year, fourth year, tenth year, fifth year, attacked Qin, surrounded Bian, Xin Cheng.",
  "s0553": "Thirty-seventh year, Jin attacked us, surrounded Bian, Xin Cheng.",
  "s0554": "Third year, extinguished Jiang.",
  "s0555": "Fourteenth year, twelfth year, duke went Jin.",
  "s0556": "Ninth year, twenty-third year, thirtieth year, fifth year, thirty-fifth year",
  "s0557": "622 Thirtieth year, fifth year, eleventh year, sixth year, Zhao Cheng Zi, Luan Zhen Zi, Huo Bo, Jiu Ji all died.",
  "s0558": "Thirty-eighth year, fourth year, extinguished Liu, Liao.",
  "s0559": "Fifteenth year, thirteenth year, tenth year, twenty-fourth year, thirty-first year, sixth year, thirty-sixth year",
  "s0560": "621 Thirty-first year, sixth year, twelfth year, seventh year, duke died.",
  "s0561": "Zhao Dun as crown prince young, wished change establish ruler, feared executed, then established crown prince as Ling Gong.",
  "s0562": "Thirty-ninth year, Mu Gong died.",
  "s0563": "Buried followed with people, following dead one hundred seventy people, superior men criticized it, therefore not speak died.",
  "s0564": "Fifth year, sixteenth year, fourteenth year, eleventh year, twenty-fifth year, thirty-second year, seventh year, thirty-seventh year",
  "s0565": "620 Thirty-second year, seventh year, thirteenth year, Jin Ling Gong Yi Gao first year, Zhao Dun monopolized government.",
  "s0566": "Qin Kang Gong Ying first year, sixth year, seventeenth year, Gong Sun Gu killed Cheng Gong.",
  "s0567": "Fifteenth year, twelfth year, twenty-sixth year, thirty-third year, eighth year, thirty-eighth year",
  "s0568": "619 Thirty-third year, Xiang Wang died.",
  "s0569": "Eighth year, king sent Wei came seek gold for burial, without propriety.",
  "s0570": "Fourteenth year, second year, Qin attacked us, took Wu Cheng, repaid Ling Gu battle.",
  "s0571": "Second year, seventh year, Song Zhao Gong Chu Jiu first year, Xiang Gong son.",
  "s0572": "Sixteenth year, thirteenth year, twenty-seventh year, thirty-fourth year, ninth year, thirty-ninth year",
  "s0573": "618 Qing Wang first year, ninth year, fifteenth year, third year, led feudal lords rescued Zheng.",
  "s0574": "Third year, eighth year, attacked Zheng, because they submitted Jin.",
  "s0575": "Second year, seventeenth year, fourteenth year, twenty-eighth year, thirty-fifth year, tenth year, Chu attacked us.",
  "s0576": "Fortieth year",
  "s0577": "617 Jichen second year, tenth year, sixteenth year, fourth year, attacked Qin, captured Shao Liang.",
  "s0578": "Qin took our Bei Zheng.",
  "s0579": "Fourth year, Jin attacked us, took Shao Liang.",
  "s0580": "We attacked Jin took Bei Zheng.",
  "s0581": "Ninth year, third year, eighteenth year, fifteenth year, twenty-ninth year, Cao Wen Gong Shou first year, eleventh year, Yan Huan Gong first year",
  "s0582": "616 Third year, eleventh year, defeated Chang Di at Xian and returned, obtained Chang Di.",
  "s0583": "Seventeenth year, fifth year, fifth year, tenth year, fourth year, defeated Chang Di Chang Qiu.",
  "s0584": "Nineteenth year, sixteenth year, thirtieth year, second year, twelfth year, second year",
  "s0585": "615 Fourth year, twelfth year, eighteenth year, sixth year, Qin took our Ji Ma.",
  "s0586": "With Qin battled He Qu, Qin army fled.",
  "s0587": "Sixth year, attacked Jin, took Ji Ma.",
  "s0588": "Angry, with us great battle He Qu.",
  "s0589": "Eleventh year, fifth year, twentieth year, seventeenth year, thirty-first year, third year, thirteenth year, third year",
  "s0590": "614 Fifth year, thirteenth year, nineteenth year, seventh year, obtained Sui Hui.",
  "s0591": "Seventh year, Jin deceived obtained Sui Hui.",
  "s0592": "Twelfth year, sixth year, twenty-first year, eighteenth year, thirty-second year, fourth year, fourteenth year, fourth year",
  "s0593": "613 Sixth year, Qing Wang died.",
  "s0594": "Dukes and ministers contended government, therefore not attended.",
  "s0595": "Fourteenth year, comet entered Big Dipper, Zhou historian said: seven years, Song, Qi, Jin rulers die.",
  "s0596": "Twentieth year, Zhao Gong died.",
  "s0597": "Younger brother Shang Ren killed crown prince self-established, this was Yi Gong.",
  "s0598": "Fifteenth year, seventh year, twenty-second year, nineteenth year, thirty-third year, fifth year, fifteenth year, fifth year"
}
