{
  "s0301": "Hui Gong horse stumbled not advance, Qin troops arrived, Gong distressed, summoned Qing Zheng as driver.",
  "s0302": "Zheng said: 'Not use divination, defeat not also proper!'",
  "s0303": "Then left.",
  "s0304": "Changed commanded Liang You Mi drove, Guo She as right, attacked Qin Mu Gong.",
  "s0305": "Mu Gong brave men risked defeated Jin army, Jin army defeated, then lost Qin Mu Gong, instead obtained Jin Gong returned.",
  "s0306": "Qin about sacrifice Shang Di.",
  "s0307": "Jin lord elder sister for Mu Gong wife, mourning clothes wept.",
  "s0308": "Gong said: 'Obtained Jin Hou will make pleasure, now like this.",
  "s0309": "Moreover I heard Ji Zi saw Tang Shu initial enfeoffment, said 'its after must greatly', Jin how able extinguish!'",
  "s0310": "Then allied with Jin Hou at Wang Cheng permitted him return.",
  "s0311": "Jin Hou also sent Lu Sheng etc. report country people said: 'Orphan though obtain return, no face see state altar, divine day establish Zi Yu.'",
  "s0312": "Jin people heard it, all cried.",
  "s0313": "Qin Mu Gong asked Lu Sheng: 'Jin country peaceful?'",
  "s0314": "Answered said: 'Not peaceful.",
  "s0315": "Small people fear lose lord perish relatives, not dread establish Zi Yu, said 'must repay enmity, rather serve Rong, Di'.",
  "s0316": "Its gentlemen then love lord know crime, wait Qin command, said 'must repay virtue'.",
  "s0317": "Have this two reasons, not peaceful.'",
  "s0318": "Then Qin Mu Gong changed lodge Jin Hui Gong, presented seven cattle.",
  "s0319": "Eleventh month, returned Jin Hou.",
  "s0320": "Jin Hou to country, executed Qing Zheng, cultivated government teaching.",
  "s0321": "Plotted said: 'Chong Er outside, feudal lords many profit inner him.'",
  "s0322": "Wished send people kill Chong Er at Di.",
  "s0323": "Chong Er heard it, went Qi.",
  "s0324": "Eighth year, sent crown prince Yu hostage Qin.",
  "s0325": "Initially, Hui Gong perished in Liang, Liang Bo with his daughter wife him, gave birth one male one female.",
  "s0326": "Liang Bo divined it, male for person minister, female for person concubine, so named male Yu, female concubine.",
  "s0327": "Tenth year, Qin extinguished Liang.",
  "s0328": "Liang Bo good earth works, governed city moat, people strength exhausted resented, its crowd several mutually alarmed, said 'Qin bandits arrive', people feared confused, Qin finally extinguished it.",
  "s0329": "Thirteenth year, Jin Hui Gong ill, inner had several sons.",
  "s0330": "Crown prince Yu said: 'My mother family in Liang, Liang now Qin extinguished it, I outside light at Qin inner no aid in country.",
  "s0331": "Lord if not rise, ill grand masters light, moreover establish other gong zi.'",
  "s0332": "Then plotted with his wife together fled return.",
  "s0333": "Qin woman said: 'You one country crown prince, humiliated here.",
  "s0334": "Qin sent maid serve, to solidify your heart.",
  "s0335": "You fled, I not follow you, also not dare speak.'",
  "s0336": "Zi Yu then fled return Jin.",
  "s0337": "Fourteenth year ninth month, Hui Gong died, crown prince Yu established, this was Huai Gong.",
  "s0338": "Zi Yu perished, Qin resented it, then sought gong zi Chong Er, wished inner him.",
  "s0339": "Zi Yu establish, feared Qin attack.",
  "s0340": "Then commanded country various follow Chong Er perished with period, period completely not arrive completely extinguish their family.",
  "s0341": "Hu Tu son Mao and Yan followed Chong Er in Qin, not willing summon.",
  "s0342": "Huai Gong angered, imprisoned Hu Tu.",
  "s0343": "Tu said: 'Minister son served Chong Er have year number, now summon him, is teach him reverse lord.",
  "s0344": "What with teach him?'",
  "s0345": "Huai Gong finally killed Hu Tu.",
  "s0346": "Qin Mu Gong then sent troops sent inner Chong Er, sent people informed Luan, Xi party as inner support, killed Huai Gong at Gao Liang, entered Chong Er.",
  "s0347": "Chong Er established, this was Wen Gong.",
  "s0348": "Jin Wen Gong Chong Er, Jin Xian Gong son.",
  "s0349": "From young good scholars, age seventeen, had worthy scholars five people: called Zhao Shuai;"
}
