{
  "s0150": "Initially, Huan Gong fled time, passed Tan, Tan no rites, so attacked it.",
  "s0151": "Fifth year, attacked Lu, Lu will troops defeated.",
  "s0152": "Lu Zhuang Gong requested offer Sui yi to pacify, Huan Gong permitted, with Lu met at Ke allied.",
  "s0153": "Lu about ally, Cao Mei with dagger kidnapped Huan Gong on altar, said: 'Return Lu's invaded land!'",
  "s0154": "Huan Gong permitted it.",
  "s0155": "Afterward Cao Mei removed dagger, north faced took minister position.",
  "s0156": "Huan Gong afterward regretted, wished not give Lu land kill Cao Mei.",
  "s0157": "Guan Zhong said: 'Kidnap permitted then betray trust kill him, moreover one small pleasure, abandon trust at feudal lords, lose world's support, cannot.'",
  "s0158": "Therefore then gave Cao Mei three times defeated lost land to Lu.",
  "s0159": "Feudal lords heard it, all trusted Qi wished attach.",
  "s0160": "Seventh year, feudal lords assembled Huan Gong at Zhen, Huan Gong then began hegemon.",
  "s0161": "Fourteenth year, Chen Li Gong son Wan, number Jing Zhong, came flee Qi.",
  "s0162": "Qi Huan Gong wished make him minister, declined;",
  "s0163": "therefore made him artisan chief.",
  "s0164": "Tian Cheng Zi Chang ancestor.",
  "s0165": "Twenty-third year, Shan Rong attacked Yan, Yan urgently told Qi.",
  "s0166": "Qi Huan Gong saved Yan, then attacked Shan Rong, reached Gu Zhu returned.",
  "s0167": "Yan Zhuang Gong then sent Huan Gong enter Yan border.",
  "s0168": "Huan Gong said: 'Not Son of Heaven, feudal lords mutually send not exit border, I cannot without rites to Yan.'",
  "s0169": "Therefore divided ditch cut Yan lord arrived place gave Yan, ordered Yan lord again repair Zhao Gong government, pay tribute to Zhou, like Cheng Kang time.",
  "s0170": "Feudal lords heard it, all followed Qi.",
  "s0171": "Twenty-seventh year, Lu Min Gong mother called Ai Jiang, Huan Gong younger sister.",
  "s0172": "Ai Jiang lewd with Lu gong zi Qing Fu, Qing Fu assassinated Min Gong, Ai Jiang wished establish Qing Fu, Lu people moreover established Xi Gong.",
  "s0173": "Huan Gong summoned Ai Jiang, killed her.",
  "s0174": "Twenty-eighth year, Wei Wen Gong had Di disorder, urgently told Qi.",
  "s0175": "Qi led feudal lords walled Chu Qiu established Wei lord.",
  "s0176": "Twenty-ninth year, Huan Gong with wife Cai Ji played in boat.",
  "s0177": "Cai Ji accustomed water, rocked duke, duke feared, stopped her, not stopped, went out boat, angered, returned Cai Ji, not cut off.",
  "s0178": "Cai also angered, married off his daughter.",
  "s0179": "Huan Gong heard angered, raised troops went attack.",
  "s0180": "Thirtieth year spring, Qi Huan Gong led feudal lords attacked Cai, Cai collapsed.",
  "s0181": "Then attacked Chu.",
  "s0182": "Chu Cheng Wang raised troops asked: 'Why cross my land?'",
  "s0183": "Guan Zhong answered: 'Formerly Zhao Kang Gong commanded our previous lord Tai Gong: 'Five marquises nine earls, if truly attack them, to flank assist Zhou chamber.'",
  "s0184": "Granted our previous lord shoes, east to sea, west to Yellow River, south to Mu Ling, north to Wu Di.",
  "s0185": "Chu tribute wrapped thatch not enter, Wang sacrifice not complete, so came demand.",
  "s0186": "Zhao Wang south campaign not return, so came ask.'",
  "s0187": "Chu Wang said: 'Tribute not enter, have it, I guilty, dare not not supply!",
  "s0188": "Zhao Wang out not return, lord ask water shore.'",
  "s0189": "Qi troops advanced stationed at Xing.",
  "s0190": "Summer, Chu Wang sent Qu Wan led troops defended Qi, Qi troops retreated stationed Zhao Ling.",
  "s0191": "Huan Gong showed off Qu Wan with his multitudes.",
  "s0192": "Qu Wan said: 'Lord with way then possible;",
  "s0193": "if not, then Chu Fang Cheng as city, Yangtze Han as moat, lord how able advance?'",
  "s0194": "Then allied with Qu Wan left.",
  "s0195": "Passed Chen, Chen Yuan Tao Tu cheated Qi, ordered go eastern direction, discovered.",
  "s0196": "Autumn, Qi attacked Chen.",
  "s0197": "This year, Jin killed crown prince Shen Sheng.",
  "s0198": "Thirty-fifth year summer, assembled feudal lords at Kui Qiu."
}
