{
    "literal": "Thirty-sixth year, solar eclipse, did not record the day, the officials lost it.",
    "idiomatic": ""
  },
  "s0595": {
    "chinese": "周君、王赧卒，周民遂東亡。",
    "literal": "Fifty-ninth year, Qin destroyed Zhou, divided its territory.",
    "idiomatic": ""
  },
  "s0596": {
    "chinese": "秦取九鼎寶器，而遷西周公於憚狐。",
    "literal": "Qin took the nine tripods and precious vessels, and moved the Western Zhou duke to Danhu.",
    "idiomatic": ""
  },
  "s0597": {
    "chinese": "後七歲，秦莊襄王滅東（西）周。",
    "literal": "Seven years later, Qin Zhuang Xiang Wang destroyed Eastern Zhou.",
    "idiomatic": ""
  },
  "s0598": {
    "chinese": "東西周皆入于秦，周既不祀。",
    "literal": "Eastern and Western Zhou both entered Qin, Zhou no longer performed sacrifices.",
    "idiomatic": ""
  },
  "s0599": {
    "chinese": "太史公曰：學者皆稱周伐紂，居洛邑，綜其實不然。",
    "literal": "The Grand Historian says: Scholars all claim Zhou attacked Zhou and resided in Luoyi, but comprehensively it was not so.",
    "idiomatic": ""
  },
  "s0600": {
    "chinese": "武王營之，成王使召公卜居，居九鼎焉，而周復都豐、鎬。",
    "literal": "King Wu planned it, King Cheng sent Shao Gong to divine the site, placed the nine tripods there, and Zhou again made its capital at Feng and Hao.",
    "idiomatic": ""
  },
  "s0601": {
    "chinese": "至犬戎敗幽王，周乃東徙于洛邑。",
    "literal": "Until the Quanrong defeated King You, Zhou then moved east to Luoyi.",
    "idiomatic": ""
  },
  "s0602": {
    "chinese": "所謂「周公葬（我）［於］畢」，畢在鎬東南杜中。",
    "literal": "What is called 'Zhou Gong buried me at Bi', Bi is in the Du midst southeast of Hao.",
    "idiomatic": ""
  },
  "s0603": {
    "chinese": "秦滅周。",
    "literal": "Qin extinguished Zhou.",
    "idiomatic": ""
  },
  "s0604": {
    "chinese": "漢興九十有餘載，天子將封泰山，東巡狩至河南，求周苗裔，封其後嘉三十里地，號曰周子南君，比列侯，以奉其先祭祀。",
    "literal": "After Han arose, ninety-some years passed, the Son of Heaven was about to seal Taishan, toured east to Henan, sought Zhou descendants, enfeoffed their posterity Jia with thirty li of land, titled Zhou Zi Nan Jun, ranked as liehou, to continue their ancestral sacrifices.",
    "idiomatic": ""
  }
}}
