{
  "s983": "Central Minor Treasurer Gong Yu becomes Imperial Secretary. Twelfth month ding wei, Chang Xin Minor Treasurer Xue Guang De becomes Imperial Secretary.",
  "s984": "43",
  "s985": "Yong Guang first year",
  "s986": "Tenth month wu yin, Ding Guo dismissed.",
  "s987": "Nine. Seventh month, Zi Chang dismissed, returns to residence.",
  "s988": "Ninth month, Guard Commander Ping Chang Hou Wang Jie becomes Grand Commandant, Chariot Cavalry General. Second month, Guang De dismissed.",
  "s989": "Seventh month, Crown Prince Grand Tutor Wei Xuan Cheng becomes Imperial Secretary.",
  "s990": "42",
  "s991": "Two",
  "s992": "Third month ren xu new moon, solar eclipse.",
  "s993": "Second month ding you, Imperial Secretary Wei Xuan Cheng becomes Chancellor, sealed as Fu Yang Hou. Chancellor Xian son.",
  "s994": "Seventh month, Grand Master of Ceremonies Ren Qian Qiu becomes Valiant Martial General, strikes Western Qiang; Yunzhong governor Han Ci Jun becomes Establishing Might General, strikes Qiang. Later does not go.",
  "s995": "Second month ding you, Right Fufeng Zheng Hong becomes Imperial Secretary.",
  "s996": "41",
  "s997": "Three",
  "s999": "Two",
  "s1000": "Right General Ping En Hou Xu Jia becomes Chariot Cavalry General, Attendant in Emperor's Presence, Palace Assistant Le Chang Hou Wang Shang becomes Right General, Right General Feng Feng Shi becomes Left General.",
  "s1002": "40",
  "s1003": "Four",
  "s1005": "Three",
  "s1008": "39",
  "s1009": "Five",
  "s1011": "Four",
  "s1014": "38",
  "s1015": "Jian Zhao first year",
  "s1017": "Five",
  "s1020": "37",
  "s1021": "Two",
  "s1023": "Six",
  "s1024": "Hong dismissed.",
  "s1025": "Palace Assistant Kuang Heng becomes Imperial Secretary.",
  "s1026": "36",
  "s1027": "Three",
  "s1028": "Sixth month jia chen, Xuan Cheng passes away.",
  "s1029": "Seventh month gui hai, Imperial Secretary Kuang Heng becomes Chancellor, sealed as Le An Hou.",
  "s1031": "Guard Commander Fan Yan Shou becomes Imperial Secretary.",
  "s1032": "35",
  "s1033": "Four",
  "s1035": "Two",
  "s1038": "34",
  "s1039": "Five",
  "s1041": "Three",
  "s1044": "33",
  "s1045": "Jing Ning first year",
  "s1047": "Four",
  "s1048": "Sixth month ji wei, Guard Commander Yang Ping Hou Wang Feng becomes Grand Commandant, Grand General. Yan Shou passes away.",
  "s1049": "Third month bing yin, Crown Prince Junior Tutor Zhang Tan becomes Imperial Secretary.",
  "s1050": "32",
  "s1051": "Filial Cheng Jian Shi first year"
}
