{
  "s318": "Four",
  "s319": "San.",
  "s320": "As Xiongnu colonel surrendered, Marquis.",
  "s323": "Three. Fourth year sixth month ding mao, Marquis Dong Tu Wu first year.",
  "s324": "Six",
  "s325": "Six",
  "s326": "Two. Two. Taichu third year, current Marquis An Han first year.",
  "s327": "Zang Ma.",
  "s328": "As Xiongnu king surrendered, Marquis.",
  "s331": "One. Fourth year sixth month ding mao, Marquis Kang Yan Nian first year. Fifth year, Marquis Yan Nian died, could not establish posterity, state abolished.",
  "s335": "Zhou Zi Nan Jun.",
  "s336": "As Zhou descendant continued enfeoffment.",
  "s340": "Three. Fourth year eleventh month ding mao, Marquis Ji Jia first year.",
  "s341": "Three. Three. Fourth year, Jun Mai first year.",
  "s342": "Four",
  "s343": "Le Tong.",
  "s344": "As fangshu (occult arts) Marquis.",
  "s348": "One. Fourth year fourth month yi si, Marquis Wu Li Jiang Jun Luan Da first year. Fifth year, Marquis Da committed crime, executed, state abolished.",
  "s351": "Liao.",
  "s352": "As Xiongnu king who returned righteousness surrendered, Marquis.",
  "s356": "One. Fourth year sixth month bing wu, Marquis Ci Gong first year. Fifth year, Marquis Ci Gong convicted of tribute gold, state abolished.",
  "s359": "Zhu Yang.",
  "s360": "As elder brother of King of Nanyue Gao Chang, Marquis.",
  "s364": "One. Fourth year, Marquis Jian De first year. Fifth year, Marquis Jian De committed crime, state abolished.",
  "s367": "Long Kang.",
  "s368": "As colonel Lou Le attacked Nanyue, died in service, son Marquis.",
  "s372": "Two. Fifth year third month ren wu, Marquis Guang De first year.",
  "s373": "Six. Sixth year, Marquis Guang De convicted and executed, state abolished.",
  "s375": "Cheng An.",
  "s376": "As colonel Han Qian Qiu attacked Nanyue died in service, son Marquis.",
  "s380": "Two. Fifth year third month ren zi, Marquis Yan Nian first year.",
  "s381": "Six. Sixth year, Marquis Yan Nian committed crime, state abolished.",
  "s383": "Kun.",
  "s384": "As Dependent State Grand Chief attacked Xiongnu with merit, Marquis.",
  "s388": "Two. Fifth year fifth month wu xu, Marquis Qu Fu Lei first year.",
  "s389": "Six",
  "s390": "Four",
  "s391": "Qi.",
  "s392": "As Dependent State cavalry attacked Xiongnu, captured Chanyu brother with merit, Marquis.",
  "s396": "Two. Fifth year sixth month ren zi, Marquis Ju Ji first year.",
  "s397": "Six",
  "s398": "Four",
  "s399": "Liang Qi.",
  "s400": "As Dependent State colonel five years interval went out attacked Xiongnu, obtained Fu Lei Chiman etc. with merit, Marquis.",
  "s404": "Two. Fifth year seventh month xin si, Marquis Ren Po Hu first year.",
  "s405": "Six",
  "s406": "Four",
  "s407": "Mu Qiu.",
  "s408": "As Chancellor and ancestors Wanshi accumulated virtue careful conduct, Marquis."
}
