{
  "s0001": "Zhao Gong Shi with Zhou same surname, surname Ji.",
  "s0002": "Zhou Wu Wang's extinguished Zhou, enfeoffed Zhao Gong at north Yan.",
  "s0003": "His in Cheng Wang time, Zhao Gong made three dukes: from Xia west, Zhao Gong governed it;",
  "s0004": "from Xia east, Zhou Gong governed it.",
  "s0005": "Cheng Wang already young, Zhou Gong acted government, held country ascended throne, Zhao Gong doubted him, made Jun Shi.",
  "s0006": "Jun Shi not pleased Zhou Gong.",
  "s0007": "Zhou Gong then said 'Tang time had Yi Yin, relied on August Heaven;",
  "s0008": "in Tai Wu time, then had like Yi Zhi, Chen Hu, relied on Shang Di, Wu Xian governed Wang family;",
  "s0009": "in Zu Yi time, then had like Wu Xian;",
  "s0010": "in Wu Ding time, then had like Gan Pan: led only this had array, protected peace had Yin'.",
  "s0011": "Then Zhao Gong pleased.",
  "s0012": "Zhao Gong's governing western, very obtained common people harmony.",
  "s0013": "Zhao Gong patrolled rural cities, had paulownia tree, decided prison government affairs under it, from marquises earls to commoners each obtained their place, no lost duty.",
  "s0014": "Zhao Gong died, people thought Zhao Gong's government, cherished paulownia tree dared not cut, sang recited it, made Gan Tang poem.",
  "s0015": "From Zhao Gong below nine generations to Hui Hou.",
  "s0016": "Yan Hui Hou during Zhou Li Wang fled Zhu, republican administered government time.",
  "s0017": "Hui Hou died, son Xi Hou established.",
  "s0018": "This year, Zhou Xuan Wang initially ascended position.",
  "s0019": "Xi Hou twenty-first year, Zheng Huan Gong initially enfeoffed at Zheng.",
  "s0020": "Thirty-sixth year, Xi Hou died, son Qing Hou established.",
  "s0021": "Qing Hou twentieth year, Zhou You Wang lewd chaos, for Quan Rong assassinated.",
  "s0022": "Qin began ranked as feudal lords.",
  "s0023": "Twenty-fourth year, Qing Hou died, son Ai Hou established.",
  "s0024": "Ai Hou second year died, son Zheng Hou established.",
  "s0025": "Zheng Hou thirty-sixth year died, son Mu Hou established.",
  "s0026": "Mu Hou seventh year, Ru Yin Gong first year.",
  "s0027": "Eighteenth year died, son Xuan Hou established.",
  "s0028": "Xuan Hou thirteenth year died, son Huan Hou established.",
  "s0029": "Huan Hou seventh year died, son Zhuang Gong established.",
  "s0030": "Zhuang Gong twelfth year, Qi Huan Gong began hegemon.",
  "s0031": "Sixteenth year, with Song, Wei together attacked Zhou Hui Wang, Hui Wang went fleeing Wen, established Hui Wang younger brother Sui as Zhou Wang.",
  "s0032": "Seventeenth year, Zheng captured Yan Zhong Fu entered Hui Wang to Zhou.",
  "s0033": "Twenty-seventh year, Shan Rong came invaded us, Qi Huan Gong saved Yan, then north attacked Shan Rong returned.",
  "s0034": "Yan lord sent Qi Huan Gong out border, Huan Gong because cut Yan arrived place gave Yan, made Yan together tribute heavenly son, like Cheng Zhou time duty;",
  "s0035": "made Yan again repair Zhao Gong's method.",
  "s0036": "Thirty-third year died, son Xiang Gong established.",
  "s0037": "Xiang Gong twenty-sixth year, Jin Wen Gong for Jian Tu assembly, called hegemon.",
  "s0038": "Thirty-first year, Qin troops defeated at Xiao.",
  "s0039": "Thirty-seventh year, Qin Mu Gong died.",
  "s0040": "Fortieth year, Xiang Gong died, Huan Gong established.",
  "s0041": "Huan Gong sixteenth year died, Xuan Gong established.",
  "s0042": "Xuan Gong fifteenth year died, Zhao Gong established.",
  "s0043": "Zhao Gong thirteenth year died, Wu Gong established.",
  "s0044": "This year Jin extinguished three Xi grand masters.",
  "s0045": "Wu Gong nineteenth year died, Wen Gong established.",
  "s0046": "Wen Gong sixth year died, Yi Gong established.",
  "s0047": "Yi Gong first year, Qi Cui Zhu assassinated their lord Zhuang Gong.",
  "s0048": "Fourth year died, son Hui Gong established.",
  "s0049": "Hui Gong first year, Qi Gao Zhi came flee."
}
