{
  "s170": "Chu rescued Rong, who was able to return, drove out Tian Jia, established Dan's son Shi as Qi king, beginning.",
  "s171": "Twelfth. Pei Gong and Xiang Yu campaigned west, executed the Sanchuan magistrate Li You at Yongqiu.",
  "s172": "Twelfth.",
  "s174": "Third.",
  "s176": "Ninth month.",
  "s177": "Fourth. Moved capital to Pengcheng.",
  "s178": "Thirteenth. Zhang Han defeated and killed Xiang Liang at Dingtao, Xiang Yu was afraid, returned army to Pengcheng.",
  "s179": "Ninth.",
  "s180": "Second. Tian Jia fled to Chu, Chu hurried to Qi to rescue Zhao. Tian Rong refused because of Jia, saying 'Chu must kill Jia before I send troops.' Xiang Yu was angry at Tian Rong.",
  "s181": "Thirteenth. Pei Gong heard Xiang Liang was dead, returned army, followed Huai Wang, encamped at Dang.",
  "s182": "Thirteenth.",
  "s183": "Wei Bao established himself as Wei king, capital at Pingyang, beginning.",
  "s184": "Fourth.",
  "s186": "Later ninth month.",
  "s187": "Fifth. Appointed Song Yi as supreme general.",
  "s188": "Huai Wang enfeoffed Xiang Yu at Lu, as deputy general, subordinate to Song Yi, north to rescue Zhao.",
  "s189": "Tenth. Qin army besieged Xie at Julu, Chen Yu went out to gather troops.",
  "s190": "Third.",
  "s191": "Fourteenth. Huai Wang enfeoffed Pei Gong as Wu'an Hou, commanding Dang commandery troops west, agreed that first to reach Xianyang would be king there.",
  "s192": "Fourteenth.",
  "s193": "Second.",
  "s194": "Fifth.",
  "s196": "Third year, tenth month.",
  "s197": "Sixth.",
  "s198": "Second.",
  "s199": "Eleventh. Zhang Han defeated Handan, moved its people to Henei.",
  "s200": "Fourth. Qi general Tian Du rebelled against Rong, went to assist Xiang Yu rescue Zhao.",
  "s201": "Fifteenth. Attacked and broke Dong commandery wei and Wang Li's army south of Chengwu.",
  "s202": "Fifteenth. Sent general Zang Tu to rescue Zhao.",
  "s203": "Third.",
  "s204": "Sixth.",
  "s206": "Eleventh month.",
  "s207": "Seventh. Appointed Ji as supreme general.",
  "s208": "Third. Yu falsely killed Song Yi, took his troops and crossed the river to rescue Julu.",
  "s209": "Twelfth.",
  "s210": "Fifth.",
  "s211": "Sixteenth.",
  "s212": "Sixteenth.",
  "s213": "Fourth.",
  "s214": "Seventh.",
  "s216": "Twelfth month.",
  "s217": "Eighth.",
  "s218": "Fourth. Greatly defeated Qin army below Julu, all the lords' generals joined Xiang Yu.",
  "s219": "Thirteenth. Chu rescue arrived, Qin siege lifted.",
  "s220": "Sixth. Former Qi King Jian's grandson Tian An came down from Jibei, followed Xiang Yu to rescue Zhao.",
  "s221": "Seventeenth. (Rescuing Zhao) arrived at Li, obtained Huang Xin and Wu Pu's armies. Fought with Qin army, defeated them.",
  "s222": "Seventeenth.",
  "s223": "Fifth. Bao rescued Zhao.",
  "s224": "Eighth."
}
