{
  "s0355": "Silk sound sorrowful, sorrowful to establish purity, purity to establish will.",
  "s0356": "Gentleman hears qin se sound then thinks will righteousness ministers.",
  "s0357": "Bamboo sound overflowing, overflowing to establish meeting, meeting to gather crowd.",
  "s0358": "Gentleman hears yu sheng xiao pipes sound then thinks herding gathering ministers.",
  "s0359": "Drum pi sound clamor, clamor to establish movement, movement to advance crowd.",
  "s0360": "Gentleman hears drum pi sound then thinks general commander ministers.",
  "s0361": "Gentleman's hearing sound, not hear its kong qiang only, also has what unite it.'",
  "s0363": "Bin Mu Jia served sitting at Confucius, Confucius spoke with him, reached music, said: 'Wu preparation guard already long, why?'",
  "s0365": "Answered saying: 'Sick not get its multitude.'",
  "s0367": "'Long sigh, licentious liquid, why?'",
  "s0369": "Answered saying: 'Fear not reach affairs.'",
  "s0371": "'Raise wave tread fierce already early, why?'",
  "s0373": "Answered saying: 'Reach timely affairs.'",
  "s0375": "'Wu sit cause right raise left, why?'",
  "s0377": "Answered saying: 'Not Wu sit.'",
  "s0379": "'Sound licentious reach shang, why?'",
  "s0381": "Answered saying: 'Not Wu sound.'",
  "s0383": "Zi said: 'If not Wu sound, then what sound?'",
  "s0385": "Answered saying: 'Officials lost their transmission.",
  "s0386": "If not officials lost their transmission, then Wu Wang's will wasted.'",
  "s0388": "Zi said: 'Only Qiu heard from Chang Hong, also like my son's words correct.'",
  "s0390": "Bin Mu Jia rose, left seat and asked saying: 'Wu preparation guard already long, then already heard command.",
  "s0391": "Dare ask slow's slow and moreover long, why?'",
  "s0393": "Zi said: 'Sit, I tell you.",
  "s0394": "Music is symbolizes completion.",
  "s0395": "Gather shields stand mountain-like, Wu Wang's affair;",
  "s0396": "Raise wave tread fierce, Tai Gong's will;",
  "s0397": "Wu chaos all sit, Zhou Zhao's governance.",
  "s0398": "Moreover Wu, begin north go out, twice complete extinguish Shang, three complete south, four complete southern states this border, five complete divide Xia, Zhou Gong left, Zhao Gong right, six complete again join, to honor Son of Heaven, flank shake it four attack, flourish authority in central states.",
  "s0399": "Divide flank advance, affair early complete.",
  "s0400": "Long stand at join, to wait feudal lords' arrival.",
  "s0401": "Moreover you alone not heard Mu Ye's words?",
  "s0402": "Wu Wang conquered Yin returned Shang, not yet alighted carriage, then enfeoffed Huang Di's descendant at Ji, enfeoffed Di Yao's descendant at Zhu, enfeoffed Di Shun's descendant at Chen;",
  "s0403": "Alighted carriage then enfeoffed Xia Hou Shi's descendant at Qi, enfeoffed Yin descendant at Song, enfeoffed Wang Zi Bi Gan tomb, released Ji Zi prisoner, made him carry Shang Rong return his position.",
  "s0404": "Common people loosen governance, common scholars double salary.",
  "s0405": "Crossed river west, horses scattered Hua Shan yang not again ride;",
  "s0406": "Oxen scattered Tao Lin wild not again serve;",
  "s0407": "Chariots armor sheathed stored treasury not again use;",
  "s0408": "Inverted load shields spears, wrapped tiger skin;",
  "s0409": "General commanders' scholars, made feudal lords, named 'Build quiver': then world knew Wu Wang not again use troops.",
  "s0410": "Disbanded army suburban shoot, left shoot li shou, right shoot zou yu, penetrate leather shooting ceased;",
  "s0411": "Pi crown insert tablet, tiger guard scholars sheathe swords;",
  "s0412": "Sacrifice Bright Hall, people know filial;",
  "s0413": "Court audience, then feudal lords know how minister;",
  "s0414": "Plow borrow, then feudal lords know how respect: five world great teachings.",
  "s0415": "Feed three elders five elders at grand school, Son of Heaven bare arm cut meat, grasp sauce feed, grasp cup toast, capped gather shields, thus teach feudal lords' brotherliness.",
  "s0416": "Like this, then Zhou way four reach, ritual music interchange, then Wu's slow long, not suitable?'",
  "s0418": "Zi Gong saw Shi Yi and asked saying: 'Ci heard sound song each have suitable, like Ci suitable what song?'",
  "s0420": "Shi Yi said: 'Yi, lowly artisan, how sufficient to ask suitable.",
  "s0421": "Please recite what heard, my son yourself decide."
}
