{
  "s0201": "Twenty-sixth year, Wei Shi Que came to report, therefore arrested Zhou Xu.",
  "s0202": "Thirty-first year, thirty-eighth year, twenty-fifth year, tenth year",
  "s0203": "718 Second year, sent Guo Gong attack Jin's Qu Wo.",
  "s0204": "Fifth year, duke watched fish at Tang, superior men criticized it.",
  "s0205": "Thirteenth year, sixth year, E Hou died.",
  "s0206": "Qu Wo Zhuang Bo again attacked Jin.",
  "s0207": "Established E Hou son Guang as Ai Hou.",
  "s0208": "Forty-eighth year, twenty-third year, second year, Zheng attacked us.",
  "s0209": "We attacked Zheng.",
  "s0210": "Wei Xuan Gong Jin first year, together established him.",
  "s0211": "Punished Zhou Xu.",
  "s0212": "Twenty-seventh year, thirty-second year, thirty-ninth year, twenty-sixth year, eleventh year",
  "s0213": "717 Jiazi third year, sixth year, Zheng people came to renew peace.",
  "s0214": "Fourteenth year, Jin Ai Hou Guang first year, forty-ninth year, twenty-fourth year, third year, second year, twenty-eighth year, thirty-third year, fortieth year, twenty-seventh year, began court king, king not courteous.",
  "s0215": "Twelfth year",
  "s0216": "716 Fourth year, seventh year, fifteenth year, second year, Zhuang Bo died, son Cheng established, this was Wu Gong.",
  "s0217": "Fiftieth year, twenty-fifth year, fourth year, third year, twenty-ninth year, thirty-fourth year, forty-first year, twenty-eighth year, thirteenth year",
  "s0218": "715 Fifth year, eighth year, exchanged Xu fields, superior men criticized it.",
  "s0219": "Sixteenth year, third year, Qin Ning Gong first year, twenty-sixth year, fifth year, fourth year, thirtieth year, thirty-fifth year, forty-second year, twenty-ninth year, with Lu Beng, exchanged Xu fields.",
  "s0220": "Fourteenth year",
  "s0221": "714 Sixth year, ninth year, third month, great hail rain, lightning.",
  "s0222": "Seventeenth year, fourth year, second year, twenty-seventh year, sixth year, fifth year, thirty-first year, Cai Huan Hou Feng Ren first year, forty-third year, thirtieth year, fifteenth year",
  "s0223": "713 Seventh year, tenth year, eighteenth year, fifth year, third year, twenty-eighth year, seventh year, feudal lords defeated us.",
  "s0224": "Our troops with Wei people attacked Zheng.",
  "s0225": "Sixth year, thirty-second year, second year, forty-fourth year, thirty-first year, sixteenth year",
  "s0226": "712 Eighth year, eleventh year, grandee Hui requested kill Huan Gong, sought to be chancellor, duke did not listen, then killed duke.",
  "s0227": "Nineteenth year, sixth year, fourth year, twenty-ninth year, eighth year, seventh year, thirty-third year, third year, forty-fifth year, thirty-second year, seventeenth year",
  "s0228": "711 Ninth year, Lu Huan Gong Yun first year, mother Song Wu Gong woman, gave birth to Shou Wen as Lu lady.",
  "s0229": "Twentieth year, seventh year, fifth year, thirtieth year, ninth year, eighth year, thirty-fourth year, fourth year, forty-sixth year, thirty-third year, with jade plus Lu, exchanged Xu fields.",
  "s0230": "Eighteenth year",
  "s0231": "710 Tenth year, second year, Song bribed with ding, entered Grand Temple, superior men criticized it.",
  "s0232": "Twenty-first year, eighth year, sixth year, thirty-first year, Hua Du saw Kong Fu wife good, delighted her.",
  "s0233": "Hua Du killed Kong Fu, and killed Shang Gong.",
  "s0234": "Song Gong Feng first year, Hua Du as chancellor.",
  "s0235": "Ninth year, thirty-fifth year, fifth year, forty-seventh year, thirty-fourth year, Yan Xuan Hou first year",
  "s0236": "709 Eleventh year, third year, Hui welcomed woman, Qi Hou sent woman, superior men criticized it.",
  "s0237": "Twenty-second year, Jin Xiao Zi first year, seventh year, thirty-second year, second year, tenth year, thirty-sixth year, sixth year, forty-eighth year, thirty-fifth year",
  "s0238": "708 Twelfth year, fourth year, twenty-third year, second year, eighth year, thirty-third year, third year, eleventh year, thirty-seventh year, seventh year, forty-ninth year, thirty-sixth year, third year",
  "s0239": "707 Jiashen thirteenth year, attacked Zheng.",
  "s0240": "Fifth year, twenty-fourth year, third year, ninth year, thirty-fourth year, fourth year, twelfth year, thirty-eighth year, younger brother Ta killed crown prince Mian.",
  "s0241": "Replaced established, state chaos, twice attended.",
  "s0242": "Eighth year, fiftieth year, thirty-seventh year, attacked Zhou, wounded king.",
  "s0243": "Fourth year",
  "s0244": "706 Fourteenth year, sixth year, twenty-fifth year, Shan Rong attacked us.",
  "s0245": "Qu Wo Wu Gong killed Xiao Zi.",
  "s0246": "Zhou attacked Qu Wo, established Jin Ai Hou younger brother Min as Jin Hou.",
  "s0247": "Jin Hou Min first year, tenth year, thirty-fifth year, invaded Sui, Sui because good governance, got to stop.",
  "s0248": "Fifth year, thirteenth year, Chen Li Gong Ta first year, ninth year, fifty-first year, thirty-eighth year, crown prince Hu rescued Qi, Qi will marry him.",
  "s0249": "Fifth year",
  "s0250": "705 Fifteenth year, seventh year, twenty-sixth year, second year, eleventh year, thirty-sixth year, sixth year, fourteenth year, second year, gave birth to Jing Zhong Wan.",
  "s0251": "Zhou historian divined Wan later generations king Qi.",
  "s0252": "Tenth year, fifty-second year, thirty-ninth year, sixth year",
  "s0253": "704 Sixteenth year, eighth year, twenty-seventh year, third year, twelfth year, thirty-seventh year, attacked Sui, not captured, only allied, stopped troops.",
  "s0254": "Seventh year, fifteenth year, third year, eleventh year, fifty-third year, fortieth year, seventh year",
  "s0255": "703 Seventeenth year, ninth year, twenty-eighth year, fourth year, Qin Chu Zi first year, thirty-eighth year, eighth year, sixteenth year, fourth year, twelfth year, fifty-fourth year, forty-first year, eighth year",
  "s0256": "702 Eighteenth year, tenth year, twenty-ninth year, fifth year, second year, thirty-ninth year, ninth year, seventeenth year, fifth year, thirteenth year, fifty-fifth year, forty-second year, ninth year",
  "s0257": "701 Nineteenth year, eleventh year, thirtieth year, sixth year, third year, fortieth year, tenth year, arrested Ji Zhong.",
  "s0258": "Eighteenth year, crown prince Ji younger brother Shou contended died.",
  "s0259": "Sixth year, fourteenth year, Cao Zhuang Gong She Gu first year, forty-third year, tenth year",
  "s0260": "700 Twentieth year, twelfth year, thirty-first year, seventh year, fourth year, forty-first year, eleventh year, nineteenth year, seventh year, duke lewd Cai, Cai killed duke.",
  "s0261": "Fifteenth year, second year, Zheng Li Gong Tu first year, eleventh year",
  "s0262": "699 Twenty-first year, thirteenth year, thirty-second year, Xi Gong commanded Wu Zhi rank clothing like crown prince.",
  "s0263": "Eighth year, fifth year, forty-second year, twelfth year, Wei Hui Gong Shuo first year, Chen Zhuang Gong Lin first year, Huan Gong son.",
  "s0264": "Sixteenth year, third year, second year, twelfth year",
  "s0265": "698 Twenty-second year, fourteenth year, thirty-third year, ninth year, sixth year, three fathers killed Chu Zi, established his elder brother Wu Gong.",
  "s0266": "Forty-third year, thirteenth year, second year, second year, seventeenth year, fourth year, third year, feudal lords attacked us, repaid Song enmity.",
  "s0267": "Thirteenth year",
  "s0268": "697 Jiashen twenty-third year, fifteenth year, heaven king sought carriage, without propriety.",
  "s0269": "Qi Xiang Gong Zhu Er first year, demoted Wu Zhi rank clothing, Wu Zhi resented.",
  "s0270": "Tenth year, Qin Wu Gong first year, attacked Peng, reached Hua Shan.",
  "s0271": "Forty-fourth year, fourteenth year, third year, Shuo fled to Qi, established Qian Mou.",
  "s0272": "Third year, eighteenth year, fifth year, fourth year, Ji Zhong established Hu, duke went dwell Li.",
  "s0273": "Yan Huan Hou first year",
  "s0274": "696 Zhuang Wang first year, gave birth to son Qian.",
  "s0275": "Sixteenth year, duke met Cao, planned attack Zheng.",
  "s0276": "Second year, eleventh year, second year, forty-fifth year, fifteenth year, Wei Qian Mou first year, fourth year, nineteenth year, sixth year, Zheng Zhao Gong Hu first year, Hu mother Deng woman, Ji Zhong took her.",
  "s0277": "Second year",
  "s0278": "695 Second year, had younger brother Ke.",
  "s0279": "Seventeenth year, solar eclipse, not recorded day, officials lost it.",
  "s0280": "Third year, twelfth year, third year, forty-sixth year, sixteenth year, second year, fifth year, twentieth year, seventh year, second year, Qu Mi killed Zhao Gong.",
  "s0281": "Third year",
  "s0282": "694 Third year, eighteenth year, duke with lady went to Qi, Qi Hou communicated with her, sent Peng Sheng kill duke on carriage.",
  "s0283": "Fourth year, killed Lu Huan Gong, executed Peng Sheng.",
  "s0284": "Thirteenth year, fourth year, forty-seventh year, seventeenth year, third year, sixth year, Cai Ai Hou Xian Wu first year, eighth year, Zheng Zi Mi first year, Qi killed Zi Mi, Zhao Gong younger brother.",
  "s0285": "Fourth year",
  "s0286": "693 Fourth year, Zhou Gong wished kill king establish Zi Ke, king executed Zhou Gong, Ke fled Yan.",
  "s0287": "Lu Zhuang Gong Tong first year, fifth year, fourteenth year, fifth year, forty-eighth year, eighteenth year, fourth year, seventh year, second year, ninth year, Zheng Zi Ying first year, Zi Mi's younger brother.",
  "s0288": "Fifth year",
  "s0289": "692 Fifth year, second year, sixth year, fifteenth year, sixth year, forty-ninth year, nineteenth year, fifth year, Chen Xuan Gong Chu Jiu first year, Chu Jiu, Zhuang Gong younger brother.",
  "s0290": "Third year, tenth year, second year, sixth year",
  "s0291": "691 Sixth year, third year, seventh year, sixteenth year, seventh year, fiftieth year, Song Min Gong Jie first year, sixth year, second year, fourth year, eleventh year, third year, seventh year",
  "s0292": "690 Seventh year, fourth year, eighth year, attacked Ji, removed its capital city.",
  "s0293": "Seventeenth year, eighth year, fifty-first year, king attacked, Sui reported lady heart moved, king died in army.",
  "s0294": "Second year, seventh year, third year, fifth year, twelfth year, fourth year, Yan Zhuang Gong first year",
  "s0295": "689 Eighth year, fifth year, with Qi attacked Wei, welcomed Hui Gong.",
  "s0296": "Ninth year, eighteenth year, ninth year, Chu Wen Wang Ci first year, began capital Ying.",
  "s0297": "Third year, eighth year, fourth year, sixth year, thirteenth year, fifth year, second year",
  "s0298": "688 Ninth year, sixth year, tenth year, nineteenth year, tenth year, second year, attacked Shen, passed Deng, Deng nephew said Chu can take, Deng Hou not permitted.",
  "s0299": "Fourth year, ninth year, fifth year, seventh year, fourteenth year, sixth year, third year"
}
