{
  "s0071": {
    "chinese": "遂還，俱讓而去。",
    "literal": "King Cheng grew up, the Duke of Zhou returned power to him.",
    "idiomatic": "They therefore returned, each yielding to the other as they departed."
  },
  "s0072": {
    "chinese": "諸侯聞之，曰「西伯蓋受命之君」。",
    "literal": "King Cheng was diligent in government, the world was at peace.",
    "idiomatic": "When the feudal lords heard of this, they said: 'Xi Bo is indeed a lord who has received the mandate.'"
  },
  "s0073": {
    "chinese": "明年，伐犬戎。",
    "literal": "King Cheng died, his son Kang Wang ascended.",
    "idiomatic": "The next year, he attacked the Quanrong."
  },
  "s0074": {
    "chinese": "明年，伐密須。",
    "literal": "Kang Wang monitored the eastern regions, toured the lords, administered justice, the nation was at peace.",
    "idiomatic": "The next year, he attacked Mi Xu."
  },
  "s0075": {
    "chinese": "明年，敗耆國。",
    "literal": "Forty more years without punishment, the world was at peace under Kang Wang.",
    "idiomatic": "The next year, he defeated the state of Qi."
  },
  "s0076": {
    "chinese": "殷之祖伊聞之，懼，以告帝紂。",
    "literal": "The Shang ancestor Yi heard of this and was afraid, reported it to Emperor Zhou.",
    "idiomatic": "When Zu Yi of Yin heard of this, he was afraid and reported it to King Zhou."
  },
  "s0077": {
    "chinese": "紂曰：「不有天命乎？",
    "literal": "Zhou said: 'Is there not the Heavenly Mandate?",
    "idiomatic": "King Zhou said: 'Is there not the Heavenly Mandate?"
  },
  "s0078": {
    "chinese": "是何能為！」",
    "literal": "What can they do!'",
    "idiomatic": "What can they possibly do!'"
  },
  "s0079": {
    "chinese": "明年，伐邘。",
    "literal": "The next year, attacked Tang.",
    "idiomatic": "The next year, he attacked Tang."
  },
  "s0080": {
    "chinese": "明年，伐崇侯虎。",
    "literal": "The next year, attacked Chong Hou Hu.",
    "idiomatic": "The next year, he attacked Chonghou Hu."
  },
  "s0081": {
    "chinese": "而作豐邑，自岐下而徙都豐。",
    "literal": "He built Feng city, moved the capital from Qi below the mountain to Feng.",
    "idiomatic": "He built the city of Feng and moved the capital from below Mount Qi to Feng."
  },
  "s0082": {
    "chinese": "明年，西伯崩，太子發立，是為武王。",
    "literal": "The next year, defeated the Qi state.",
    "idiomatic": "The next year, Xi Bo died, and Crown Prince Fa succeeded him, known as King Wu."
  },
  "s0083": {
    "chinese": "西伯蓋即位五十年。",
    "literal": "King Wen died, King Wu ascended.",
    "idiomatic": "Xi Bo had reigned for fifty years."
  },
  "s0084": {
    "chinese": "其囚羑里，蓋益易之八卦為六十四卦。",
    "literal": "King Wu made the Duke of Zhou prime minister, and the Duke of Shao assistant.",
    "idiomatic": "During his imprisonment at Youli, he expanded the Changes from eight trigrams to sixty-four hexagrams."
  },
  "s0085": {
    "chinese": "詩人道西伯，蓋受命之年稱王而斷虞芮之訟。",
    "literal": "He prepared troops, observed the stars and constellations, chose an auspicious day.",
    "idiomatic": "The poets record that Xi Bo, in the year he received the mandate, was called king and judged the dispute between Yu and Rui."
  },
  "s0086": {
    "chinese": "後十年而崩，謚為文王。",
    "literal": "King Wu reviewed the troops at Mengjin.",
    "idiomatic": "Ten years later he died and was posthumously titled King Wen."
  },
  "s0087": {
    "chinese": "改法度，制正朔矣。",
    "literal": "The Shang king Zhou heard of this and laughed, saying: 'The western barbarians are few.'",
    "idiomatic": "He reformed the laws and established the calendar."
  },
  "s0088": {
    "chinese": "追尊古公為太王，公季為王季：蓋王瑞自太王興。",
    "literal": "He did not prepare defenses.",
    "idiomatic": "He posthumously honored Gu Gong as Tai Wang and Gong Ji as Wang Ji: indeed, the kingly omens began with Tai Wang."
  },
  "s0089": {
    "chinese": "武王即位，太公望為師，周公旦為輔，召公、畢公之徒左右王，師修文王緒業。",
    "literal": "King Wu crossed the Yellow River at Mengjin with 800 lords.",
    "idiomatic": "When King Wu ascended the throne, Tai Gong Wang served as his master strategist, Zhou Gong Dan as his assistant, and the Duke of Shao, Duke of Bi, and others stood by the king's side. They continued to build on King Wen's legacy."
  },
  "s0090": {
    "chinese": "九年，武王上祭于畢。",
    "literal": "The next day, engaged in battle at Muye.",
    "idiomatic": "In the ninth year, King Wu offered sacrifices at Bi."
}
}
