{
  "s2102": "Eleven, grandee Hui requested to kill Duke Huan, sought to be chancellor, duke did not listen, then killed duke.",
  "s2118": "First year of Duke Huan of Lu (Yun), mother was daughter of Duke Wu of Song, gave birth to Shou Wen as Lu consort.",
  "s2443": "First year of Duke Min of Song (Jie)",
  "s2455": "Eight, attacked Ji, removed their capital city.",
  "s2458": "Fifty-one, king attacked, Sui informed consort's heart moved, king died in army.",
  "s2465": "First year of Duke Zhuang of Yan",
  "s2470": "Five, with Qi attacked Wei, installed Duke Hui.",
  "s2474": "First year of King Wen of Chu (Zi), began capital at Ying.",
  "s2490": "Two, attacked Shen, passed Deng, Deng's nephew said Chu could be taken, Deng lord did not permit.",
  "s2500": "Jia Wu",
  "s2502": "Seven, stars fell like rain, together with rain.",
  "s2508": "Ten, Qi established Duke Hui, Qian Mu fled to Zhou.",
  "s2518": "Eight, Gong Zi Jiu came fleeing, with Guan Zhong avoided Wu Zhi disorder.",
  "s2519": "Twelve, Wu Zhi killed ruler self-established.",
  "s2524": "Wei Hui Gong Shuo re-entered. Fourteenth year",
  "s2534": "Nine, Lu wished to enter with Jiu, after Xiao Bai, Qi blocked Lu, made them deliver Guan Zhong alive.",
  "s2535": "First year of Qi Huan Gong Xiao Bai, spring, Qi killed Wu Zhi.",
  "s2550": "Ten, Qi attacked us, because of Jiu.",
  "s2554": "Six, Xi consort, Chen woman, passed Cai, Cai did not treat courteously, hated it. Chu attacked Cai, captured Ai Hou and returned.",
  "s2558": "Eleven, Chu captured our lord.",
  "s2566": "Eleven, Zang Wen Zhong condoled Song flood.",
  "s2571": "Nine, Song great flood, duke self-blamed. Lu sent Zang Wen Zhong to condole.",
  "s2587": "Ten, Wan killed ruler, Qiu Mu had righteousness.",
  "s2597": "First year of King Xi",
  "s2598": "Thirteen, Cao Mo hijacked Huan Gong. Returned lost territory.",
  "s2599": "Five, assembled with Lu people at Ke.",
  "s2603": "First year of Duke Huan of Song (Yu Yue), Zhuang Gong's son.",
  "s2631": "Seven, began hegemony, assembled feudal lords at Juan.",
  "s2632": "Twenty-eight, Quwo Wu Gong extinguished Jin Hou Min, presented treasures to Zhou, Zhou commanded Wu Gong to be Jin ruler, annexed its territory.",
  "s2640": "First year of Duke Li of Zheng, Duke Li fled seventeen years later re-entered.",
  "s2648": "Jin Wu Gong Cheng annexed Jin, had established thirty-eight years, did not change first year, continued its first year.",
  "s2649": "Twenty, buried at Yong, began with human sacrifice.",
  "s2650": "Twelve, attacked Deng extinguished it.",
  "s2656": "Two, feudal lords attacked us.",
  "s2660": "Jia Chen",
  "s2664": "Thirty-nine, Wu Gong died, son Gui Zhu established, became Xian Gong.",
  "s2665": "First year of Qin De Gong, Wu Gong's younger brother.",
  "s2677": "First year of King Hui, took Chen consort.",
  "s2680": "First year of Jin Xian Gong Gui Zhu",
  "s2681": "Two, began making Fu sacrifice, sacrificed to She, split dogs at four gates.",
  "s2682": "First year of Chu Du Ao Su",
  "s2693": "Two, Yan and Wei attacked king, king fled to Wen, established Zi Kui.",
  "s2697": "First year of Qin Xuan Gong",
  "s2699": "Seven, took Wei woman. Wen Gong's younger brother.",
  "s2705": "Sixteen, attacked king, king fled to Wen, established Zi Kui.",
  "s2718": "First year of Cai Mu Hou Xi",
  "s2721": "Seventeen, Zheng seized our Zhong Fu.",
  "s2725": "Four, executed Kui, entered King Hui.",
  "s2736": "Seven, rescued Zhou disorder, entered king.",
  "s2741": "Five, crown prince's mother died early. Hui consort gave birth to Shu Dai."
}