{
  "s0302": "Confucius said: 'Alas, have you not heard?",
  "s0303": "The people are the foundation of the state, foundation solid the state is peaceful.",
  "s0304": "Now if we stop, how can I conduct myself?",
  "s0305": "Your fate is fate, my fate is fate.'",
  "s0306": "Gong Liang Ru said: 'Master cannot, I will go with master.'",
  "s0307": "Confucius said: 'You still consider me worthy, I am not worthy.",
  "s0308": "I do not try, thus am skilled.'",
  "s0309": "Confucius traveled, Gong Liang Ru was surrounded by Pu people, Confucius sent Zi Gong to persuade them.",
  "s0310": "Zi Gong went, said: 'Master being here is Pu's calamity.",
  "s0311": "If you can release his disciples, then it is master's calamity.",
  "s0312": "Master fortunately escapes, it is Pu's calamity.",
  "s0313": "Now where master is, the Wei lord contends with Pu people for him.",
  "s0314": "If you release him, then Wei lord contends with Pu people for him.",
  "s0315": "Master not wishing to see, then also useless.",
  "s0316": "If he sees, then it is master's calamity.'",
  "s0317": "Pu people released Gong Liang Ru and stopped Confucius.",
  "s0318": "Confucius heard of it, angry, said: 'Lu and Wei's governance are like brothers.",
  "s0319": "Now Lu and Wei are hostile, is it brothers' resentment?",
  "s0320": "Master's service cannot have two minds.",
  "s0321": "Therefore Lu people stop master, Wei people also stop master.",
  "s0322": "Master not going to Jin and Wei is not fearing the feudal lords.",
  "s0323": "Fearing their brothers' resentment.",
  "s0324": "Now cutting off Lu and Wei, then bad for those wishing to see.",
  "s0325": "If wishing to see, then first release oneself.",
  "s0326": "Thus Confucius from Wei went to Jin, passing through Kuang, Kuang people heard of it, thought he was Lu Yang Hu.",
  "s0327": "Therefore surrounded Confucius, disciples all had hungry appearance.",
  "s0328": "Confucius said: 'Since King Wen has passed, is culture not here?",
  "s0329": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0330": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0331": "Confucius knew disciples had worried appearance, told Zi Gong: 'Have you heard?'",
  "s0332": "Zi Gong said: 'Master can travel.",
  "s0333": "If there is calamity here, then it is master's calamity.",
  "s0334": "If there is no calamity here, then it is Kuang people's calamity.",
  "s0335": "If stop, then it is master's calamity.",
  "s0336": "If travel, then it is Kuang people's calamity.",
  "s0337": "Why worry master?'",
  "s0338": "Confucius said: 'Ci, you only know one, not two.",
  "s0339": "Since King Wen has passed, is culture not here?",
  "s0340": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0341": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0342": "Confucius having explained, Kuang people welcomed Confucius.",
  "s0343": "Confucius arrived at Wei, Wei Hou welcomed him at the suburbs.",
  "s0344": "Confucius returned and stayed in Zou village, composing the Zou song to mourn.",
  "s0345": "Then returned to Wei, staying at the home of Qu Bo Yu.",
  "s0346": "Another day, Ling Gong asked about military formations.",
  "s0347": "Confucius said: 'Ritual matters I have heard of, military matters I have not studied.'",
  "s0348": "The next day, spoke with Confucius, saw flying geese, looked up at them, his attention not on Confucius.",
  "s0349": "Confucius thus left, returning to Chen.",
  "s0350": "Summer, Wei Ling Gong died, established grandson Jie, who became Wei Chu Gong.",
  "s0351": "Sixth month, Zhao Yang brought crown prince Kuai Kui inside Qi.",
  "s0352": "Yang Hu made the crown prince wear mourning clothes, eight people in mourning attire, falsely as those welcoming from Wei, crying as they entered, thus resided there.",
  "s0353": "Winter, Cai moved to Zhou Lai.",
  "s0354": "This year was Lu Ai Gong's third year, Confucius was sixty years old.",
  "s0355": "Qi helped Wei besiege Qi because crown prince Kuai Kui was there.",
  "s0356": "Summer, Lu Huan Xi temple burned, Nan Gong Jing Shu saved the fire.",
  "s0357": "Confucius in Chen heard of it, said: 'The disaster must be at Huan Xi temple?'",
  "s0358": "Soon indeed so.",
  "s0359": "Autumn, Ji Huan Zi ill, carried to see Lu's city walls, sighed deeply saying: 'In the past this state almost prospered, but because I offended Confucius, it did not prosper.'",
  "s0360": "Looking back at his heir Kang Zi said: 'I will die soon, you must govern Lu;",
  "s0361": "governing Lu, must summon Zhong Ni.'",
  "s0362": "After several days, Huan Zi died, Kang Zi succeeded.",
  "s0363": "After burial, wished to summon Zhong Ni.",
  "s0364": "Gong Yu Yu said: 'In the past our former lord employed him but not to the end, finally became the laughingstock of the feudal lords.",
  "s0365": "Now employing him again, if cannot finish, this is again becoming the laughingstock of the feudal lords.'",
  "s0366": "Kang Zi said: 'Then who can be summoned?'",
  "s0367": "Said: 'Must summon Ran Qiu.'",
  "s0368": "Thus sent envoys to summon Ran Qiu.",
  "s0369": "Ran Qiu about to go, Confucius said: 'Lu people summon Qiu, not for small use, will greatly use him.'",
  "s0370": "That day, Confucius said: 'Return home! Return home!",
  "s0371": "My party's youths are ardent and simple, their patterns are brilliant, I do not know how to cut them.'",
  "s0372": "Zi Gong knew Confucius wished to return, sent Ran Qiu, admonishing to 'if employed, use Confucius as the banner.'",
  "s0373": "Ran Qiu having left, next year, Confucius from Chen moved to Cai.",
  "s0374": "Cai Zhao Gong about to go to Wu, Wu summoned him.",
  "s0375": "Previously Zhao Gong deceived his ministers to move Zhou Lai, now about to go, ministers feared he would move again, Gong Sun Pian shot and killed Zhao Gong.",
  "s0376": "Chu invaded Cai.",
  "s0377": "Autumn, Qi Jing Gong died.",
  "s0378": "Next year, Confucius from Cai went to Ye.",
  "s0379": "Ye Gong asked about governance, Confucius said: 'Governance lies in attracting the distant and attaching the near.'",
  "s0380": "Another day, Ye Gong asked Confucius to Zi Lu, Zi Lu did not answer.",
  "s0381": "Confucius heard of it, said: 'You, why not answer saying \"His character is: studies the Way without tiring, teaches others without wearying, becomes indignant and forgets food, joyful and forgets worry, does not know old age is approaching\" thus.'",
  "s0382": "Left Ye, returned to Cai.",
  "s0383": "Chang Ju and Jie Nie were plowing together, Confucius considered them recluses, sent Zi Lu to ask for directions.",
  "s0384": "Chang Ju said: 'That one holding the reins, who is he?'",
  "s0385": "Zi Lu said: 'Kong Qiu.'",
  "s0386": "Said: 'Is he Lu Kong Qiu?'",
  "s0387": "Said: 'Yes.'",
  "s0388": "Said: 'He knows the directions.'",
  "s0389": "Jie Nie told Zi Lu: 'Who are you?'",
  "s0390": "Said: 'Zhong You.'",
  "s0391": "Said: 'Are you Lu Kong Qiu's disciple?'",
  "s0392": "Said: 'Yes.'",
  "s0393": "Said: 'The whole world is flooded, who can change it? Rather than follow a scholar who avoids this person and that person, better follow those who avoid the world.'",
  "s0394": "Planted his hoe and would not speak.",
  "s0395": "Zi Lu returned and told Confucius, Confucius sadly said: 'One cannot herd with birds and beasts. If the world is not the Way, with whom shall I go?",
  "s0396": "If the world has the Way, what need have I to change?'",
  "s0397": "子路從而後，遇丈人，以杖荷蓧。",
  "s0398": "子路問曰：「子見夫子乎？」",
  "s0399": "丈人曰：「四體不勤，五穀不分，孰為夫子？」",
  "s0400": "植其杖而芸，子路拱而立。",
  "s0401": "止子路宿，殺雞為黍而食之，見其二子焉。",
  "s0402": "明日，子路行，以告。",
  "s0403": "子曰：「隱者也。」",
  "s0404": "使子路反見之，至則行矣。",
  "s0405": "子路曰：「不仕無義。",
  "s0406": "長幼之節，不可廢也；",
  "s0407": "君臣之義，如之何其廢之？",
  "s0408": "欲潔其身，而亂大倫。",
  "s0409": "君子之仕也，行其義也。",
  "s0410": "道之不行，已知之矣。」",
  "s0411": "孔子謂子路曰：「吾聞之，君子遵道則譽，遁跡則无咎。",
  "s0412": "吾將遁跡於此矣。」",
  "s0413": "遂自蔡如曹。",
  "s0414": "自曹適宋，與弟子習禮大樹下。",
  "s0415": "宋司馬桓魋欲殺孔子，拔其樹。",
  "s0416": "孔子去。",
  "s0417": "弟子曰：「可以速矣。」",
  "s0418": "孔子曰：「天生德於予，桓魋其如予何！」",
  "s0419": "孔子適鄭，與弟子相失，孔子獨立郭東門。",
  "s0420": "鄭人或謂子貢曰：「東門有人，其顙似堯，其項類皋陶，其肩類子產，然自要以下不及禹三寸。",
  "s0421": "纍纍若喪家之狗。」",
  "s0422": "子貢以實告孔子。",
  "s0423": "孔子欣然笑曰：「形狀，末也。",
  "s0424": "而謂似喪家之狗，然哉！",
  "s0425": "然哉！」",
  "s0426": "孔子遂至陳，主於司城貞子家。",
  "s0427": "歲餘，吳王夫差伐陳，取三邑而去。",
  "s0428": "趙鞅伐朝歌。",
  "s0429": "楚圍蔡，蔡遷于吳。",
  "s0430": "吳敗越王句踐會稽。",
  "s0431": "有隼集于陳廷而死，楛矢貫之，石砮，矢長尺有咫。",
  "s0432": "陳湣公使使問仲尼。",
  "s0433": "仲尼曰：「隼來遠矣，此肅慎之矢也。",
  "s0434": "昔武王克商，通道九夷百蠻，使各以其方賄來貢，使無忘職業。",
  "s0435": "於是肅慎貢楛矢石砮，長尺有咫。",
  "s0436": "先王欲昭其令德，以肅慎矢分大姬，配虞胡公而封諸陳。",
  "s0437": "分同姓以珍玉，展親；",
  "s0438": "分異姓以遠職，使無忘服。",
  "s0439": "故分陳以肅慎矢。」",
  "s0440": "試求之故府，果得之。",
  "s0441": "孔子居陳三歲，會晉楚爭彊，更伐陳，及吳侵陳，陳常被寇。",
  "s0442": "孔子曰：「歸與！",
  "s0443": "歸與！",
  "s0444": "吾黨之小子狂簡，進取不忘其初。」",
  "s0445": "於是孔子去陳。",
  "s0446": "過蒲，會公叔氏以蒲畔，蒲人止孔子。",
  "s0447": "弟子有公良孺者，以私車五乘從孔子。",
  "s0448": "其為人長賢，有勇力，謂曰：「吾昔從夫子遇難於匡，今又遇難於此，命也已。",
  "s0449": "吾與夫子再罹難，寧鬬而死。」",
  "s0450": "孔子曰：「惡，子不聞乎？",
  "s0451": "夫民為邦本，本固邦寧。",
  "s0452": "今若止，吾何以行為？",
  "s0453": "子命也已，吾命也已。」"
}