{
  "s0251": "Hui Gong because Chong Er outside, feared Li Ke make change, granted Li Ke die.",
  "s0252": "Told said: 'Without Li Zi I not obtain establish.",
  "s0253": "Although, you also killed two lords one grand master, for your lord not also difficult?'",
  "s0254": "Li Ke answered said: 'Not have abolished, lord what with rise?",
  "s0255": "Wish execute him, his no words?",
  "s0256": "Then speak this!",
  "s0257": "Minister heard command.'",
  "s0258": "Then prostrated sword died.",
  "s0259": "Then Pi Zheng sent thank Qin not returned, so not reached difficulty.",
  "s0260": "Jin lord changed buried Gong crown prince Shen Sheng.",
  "s0261": "Autumn, Hu Tu below country, met Shen Sheng, Shen Sheng with rode told him said: 'Yi Wu without ritual, I obtained request at Di, will with Jin give Qin, Qin will sacrifice me.'",
  "s0262": "Hu Tu answered said: 'Minister heard spirits not eat not their ancestor, lord sacrifice perhaps cut off?",
  "s0263": "Lord their plan it.'",
  "s0264": "Shen Sheng said: 'Yes, I will again request Di.",
  "s0265": "After ten days, Xin Cheng west side will have shaman see me.'",
  "s0266": "Permitted it, then not seen.",
  "s0267": "And period went, again seen, Shen Sheng told him said: 'Di permitted punish guilty, decayed at Han.'",
  "s0268": "Child then sang: 'Gong crown prince changed buried, after fourteen years, Jin also not prosper, prosper then at elder brother.'",
  "s0270": "Pi Zheng sent Qin, heard Li Ke executed, then persuaded Qin Mu Gong said: 'Lu Sheng, Xi Cheng, Ji Rui truly not follow.",
  "s0271": "If heavy bribe with plot, exit Jin lord, enter Chong Er, matter must succeed.'",
  "s0272": "Qin Mu Gong permitted it, sent people with return report Jin, thick bribed three sons.",
  "s0273": "Three sons said: 'Money thick words sweet, this must Pi Zheng sell us to Qin.'",
  "s0274": "Then killed Pi Zheng and Li Ke, Pi Zheng party seven chariot grand masters.",
  "s0275": "Pi Zheng son Bao fled Qin, spoke attack Jin, Mu Gong not listened.",
  "s0276": "Hui Gong establish, betrayed Qin land and Li Ke, executed seven chariot grand masters, country people not attached.",
  "s0277": "Second year, Zhou sent Zhao Gong Guo ritual Jin Hui Gong, Hui Gong ritual arrogant, Zhao Gong criticized him.",
  "s0278": "Fourth year, Jin famine, begged grain at Qin.",
  "s0279": "Mu Gong asked Bai Li Xi, Bai Li Xi said: 'Heaven calamity circulate, country alternate have, save calamity relieve neighbor, country's way.",
  "s0280": "Give it.'",
  "s0281": "Pi Zheng son Bao said: 'Attack it.'",
  "s0282": "Mu Gong said: 'Its lord evil, its people what crime!'",
  "s0283": "Finally gave grain, from Yong to Jiang.",
  "s0284": "Fifth year, Qin famine, requested grain at Jin.",
  "s0285": "Jin lord planned it, Qing Zheng said: 'With Qin obtained establish, already betrayed its land agreement.",
  "s0286": "Jin famine Qin lent me, now Qin famine request grain, give it what doubt?",
  "s0287": "But plan it!'",
  "s0288": "Guo She said: 'Previous year heaven with Jin granted Qin, Qin not know take lent me.",
  "s0289": "Now heaven with Qin granted Jin, Jin its can reverse heaven?",
  "s0290": "Then attacked it.'",
  "s0291": "Hui Gong used Guo She plan, not gave Qin grain, sent troops moreover attacked Qin.",
  "s0292": "Qin great anger, also sent troops attacked Jin.",
  "s0293": "Sixth year spring, Qin Mu Gong led troops attacked Jin.",
  "s0294": "Jin Hui Gong told Qing Zheng said: 'Qin troops deep, what do?'",
  "s0295": "Zheng said: 'Qin inner lord, lord betrayed its bribe;",
  "s0296": "Jin famine Qin transported grain, Qin famine Jin betrayed it, then wished because its famine attack it: its deep not also suitable!'",
  "s0297": "Jin divined drove right, Qing Zheng all auspicious.",
  "s0298": "Gong said: 'Zheng not respectful.'",
  "s0299": "Then changed commanded Bu Yang drove chariot, Jia Pu Tu as right, advanced troops.",
  "s0300": "Ninth month Ren Xu, Qin Mu Gong, Jin Hui Gong combined battle Han Yuan."
}
