{
  "s647": "Six",
  "s648": "Six",
  "s649": "Six",
  "s650": "Four",
  "s651": "Yu Lang.",
  "s652": "Son of Prince Gong of Lu.",
  "s654": "Four. Third year third month yi mao, Marquis Liu Ji first year.",
  "s655": "Six",
  "s656": "Four. Fifth year, Marquis Ji convicted of tribute gold, state abolished.",
  "s659": "Xi Chang.",
  "s660": "Son of Prince Gong of Lu.",
  "s662": "Four. Third year third month yi mao, Marquis Liu Jing first year.",
  "s663": "Six",
  "s664": "Four. Fifth year, Marquis Jing convicted of tribute gold, state abolished.",
  "s667": "Xing Cheng.",
  "s668": "Son of Prince Jing of Zhongshan.",
  "s670": "Four. Third year third month gui you, Marquis Liu Yi first year.",
  "s671": "Six",
  "s672": "Four. Fifth year, Marquis Yi convicted of tribute gold, state abolished.",
  "s675": "Han Ping.",
  "s676": "Son of Prince Jing Su of Zhao.",
  "s678": "Four. Third year fourth month geng chen, Marquis Liu Shun first year.",
  "s679": "Six",
  "s680": "Four. Fifth year, Marquis Shun convicted of tribute gold, state abolished.",
  "s683": "Wu Shi.",
  "s684": "Son of Prince Jing Su of Zhao.",
  "s686": "Four. Third year fourth month geng chen, Marquis Liu Chang first year.",
  "s687": "Six",
  "s688": "Six",
  "s689": "Six",
  "s690": "Four",
  "s691": "Xiang Shi.",
  "s692": "Son of Prince Jing Su of Zhao.",
  "s694": "Four. Third year fourth month geng chen, Marquis Jie Liu He first year.",
  "s695": "Six",
  "s696": "Six",
  "s697": "Two. Four. Third year, Marquis Si An De first year.",
  "s698": "Four",
  "s699": "Yi.",
  "s702": "Four. Third year fourth month geng chen, Marquis An Liu Ping first year.",
  "s703": "Six",
  "s704": "Six",
  "s705": "Four. Two. Fifth year, current Marquis Zhong first year.",
  "s706": "Four",
  "s707": "Luo Ling.",
  "s708": "Son of Prince Ding of Changsha.",
  "s710": "Three. Fourth year third month yi chou, Marquis Liu Zhang first year.",
  "s711": "One. Second year, Marquis Zhang committed crime, state abolished.",
  "s715": "You Yu."
}
