{
  "s0482": "Thirteenth year fourth month day wuwu, Wei ruler became king, Han also became king.",
  "s0483": "Sent Zhang Yi to attack and take Xia, moved its people to Wei.",
  "s0484": "Fourteenth year, changed to first year.",
  "s0485": "Second year, Zhang Yi met with Qi and Chu ministers at Ni Sang.",
  "s0486": "Third year, Han and Wei crown princes came to court.",
  "s0487": "Zhang Yi became prime minister of Wei.",
  "s0488": "Fifth year, the king toured to Beihe.",
  "s0489": "Seventh year, Yue Chi became prime minister of Qin.",
  "s0490": "Han, Zhao, Wei, Yan, Qi led the Xiongnu to attack Qin together.",
  "s0491": "Qin sent Senior Minister Ji to battle at Xiuyu, captured their general Shen Chai, defeated Zhao prince Ke and Han crown prince Huan, beheaded 82,000.",
  "s0492": "Eighth year, Zhang Yi again became prime minister of Qin.",
  "s0493": "Ninth year, attacked Wei, took Puyang.",
  "s0494": "Tenth year, Zhang Yi attacked Wei, took He Dong.",
  "s0495": "Eleventh year, attacked Wei, took Yao and Xingyuan.",
  "s0496": "Twelfth year, attacked Wei, took Zhaoge.",
  "s0497": "Thirteenth year, attacked Wei, took Hequ.",
  "s0498": "Fourteenth year, attacked Wei, took Anyi.",
  "s0499": "Fifteenth year, attacked Wei, took Huayang.",
  "s0500": "Sixteenth year, attacked Wei, took Hequ again.",
  "s0501": "Seventeenth year, attacked Wei, took Xingqiu.",
  "s0502": "Eighteenth year, attacked Wei, took Pishi.",
  "s0503": "Nineteenth year, attacked Wei, took Linjin.",
  "s0504": "Twentieth year, attacked Wei, took Yongqiu.",
  "s0505": "Twenty-first year, attacked Wei, took Puyang again.",
  "s0506": "Twenty-second year, attacked Wei, took Xingqiu again.",
  "s0507": "Twenty-third year, attacked Wei, took Linjin again.",
  "s0508": "Twenty-fourth year, attacked Wei, took Yongqiu again.",
  "s0509": "Twenty-fifth year, attacked Wei, took Pishi again.",
  "s0510": "Twenty-sixth year, attacked Wei, took Anyi again.",
  "s0511": "Twenty-seventh year, attacked Wei, took Hequ again.",
  "s0512": "Twenty-eighth year, attacked Wei, took Zhaoge again.",
  "s0513": "Twenty-ninth year, attacked Wei, took Xingyuan again.",
  "s0514": "Thirtieth year, attacked Wei, took Yao again.",
  "s0515": "Thirty-first year, attacked Wei, took He Dong again.",
  "s0516": "Thirty-second year, attacked Wei, took Puyang again.",
  "s0517": "Thirty-third year, attacked Wei, took Hequ again.",
  "s0518": "Thirty-fourth year, attacked Wei, took Anyi again.",
  "s0519": "Thirty-fifth year, attacked Wei, took Huayang again.",
  "s0520": "Thirty-sixth year, attacked Wei, took Hequ again.",
  "s0521": "Thirty-seventh year, attacked Wei, took Xingqiu again.",
  "s0522": "Thirty-eighth year, attacked Wei, took Pishi again.",
  "s0523": "Thirty-ninth year, attacked Wei, took Linjin again.",
  "s0524": "Fortieth year, attacked Wei, took Yongqiu again.",
  "s0525": "Forty-first year, attacked Wei, took Puyang again.",
  "s0526": "Forty-second year, attacked Wei, took Xingqiu again.",
  "s0527": "Forty-third year, attacked Wei, took Linjin again.",
  "s0528": "Forty-fourth year, attacked Wei, took Yongqiu again.",
  "s0529": "Forty-fifth year, attacked Wei, took Pishi again.",
  "s0530": "Forty-sixth year, attacked Wei, took Anyi again.",
  "s0531": "Forty-seventh year, attacked Wei, took Hequ again.",
  "s0532": "Forty-eighth year, attacked Wei, took Zhaoge again.",
  "s0533": "Forty-ninth year, attacked Wei, took Xingyuan again.",
  "s0534": "Fiftieth year, attacked Wei, took Yao again.",
  "s0535": "Fifty-first year, Duke Zhaoxiang died, his son King Xiaowen ascended.",
  "s0536": "King Xiaowen of Qin first year, attacked Wei, took He Dong again.",
  "s0537": "Second year, King Xiaowen died, his son King Zhuangxiang ascended.",
  "s0538": "King Zhuangxiang of Qin first year, attacked Wei, took Puyang again.",
  "s0539": "Second year, attacked Wei, took Xingqiu again.",
  "s0540": "Third year, King Zhuangxiang died, his son Qin Shi Huang ascended."
}