{
  "s657": "Twenty-seven. Yuanding year 4, Marquis Gong Zhang year 1. Pi Shan three. Yuanfeng year 1, Marquis Ren year 1. Twenty. Zhenghe year 3, month 10, Ren and mother convicted of cursing, great rebellion unprincipled, state abolished.",
  "s658": "Eighty-three",
  "s659": "Chaoyang.",
  "s660": "As retainer followed uprising in Xue, as lian'ao entered Han, as commandery captain attacked Xiang Yu, later attacked Han King Xin, became marquis, 1,000 households.",
  "s661": "Six. Year 7 month 3 Ren Yin day, Marquis of Qi Hua Ji year 1.",
  "s662": "Seven",
  "s663": "Eight. Year 1, Marquis Wen Yao year 1.",
  "s664": "Thirteen. Ten. Year 14, Marquis Dang year 1.",
  "s665": "Sixteen",
  "s666": "Thirteen. Yuanshuo year 2, Marquis Dang convicted of teaching people to submit false petitions violating law, state abolished.",
  "s667": "Sixty-nine",
  "s668": "Jiyang.",
  "s669": "As soldier followed uprising in Huling, entered Han, as palace attendant general welcomed Left Chancellor army to attack Xiang Ji, became marquis, 1,000 households.",
  "s670": "Six. Year 7 month 7 Bing Shen day, Marquis Zhuang Du De Chen year 1.",
  "s671": "Seven",
  "s672": "Eight",
  "s673": "Five. Eighteen. Year 6, Marquis Zhi Dan year 1.",
  "s674": "Sixteen",
  "s675": "Nine. Yuanguang year 4, Marquis Huai Wu year 1. Seven. Yuanshuo year 5, died, no heir, state abolished.",
  "s676": "Eighty-one",
  "s677": "Neyang.",
  "s678": "As cavalry soldier Han King year 2 followed exiting passes, as palace attendant general attacked and beheaded Xiang Yu, became marquis, 1,500 households, comparable to Marquis of Duyan.",
  "s679": "Six. Year 7 middle, Marquis Zhuang Lü Sheng year 1.",
  "s680": "Seven",
  "s681": "Eight",
  "s682": "Four. Year 5, Marquis Zhuang's son Cheng actually not son, should not be marquis, state abolished.",
  "s685": "One hundred four",
  "s686": "Pingji.",
  "s687": "As guest followed uprising in Kangfu, beheaded Zhang Han's appointed Shu governor, used Yan chancellor became marquis, 1,000 households.",
  "s688": "Six. Year 7 middle, Marquis Yi Zhi year 1.",
  "s689": "Seven",
  "s690": "Seven. One. Year 8, Marquis Pi Qiang year 1.",
  "s691": "Five. Year 6, Marquis Pi Qiang committed crime, became ghost servant, state abolished.",
  "s694": "Sixty-four",
  "s695": "Geng Xie",
  "s696": "As Gaozu's brother's son followed army, attacked rebelling King of Han Xin, became palace attendant general. Xin's mother once offended Gaozu in humble times, Supreme Emperor pitied her, therefore enfeoffed as Marquis of Geng Xie.",
  "s697": "Six. Year 7 middle, Marquis Liu Xin year 1.",
  "s698": "Seven",
  "s699": "Year 1, Xin committed crime, reduced rank one level, became Guan Nei Hou.",
  "s704": "Shenze.",
  "s705": "As Zhao general Han King year 3 surrendered, attached to Han Xin, pacified Zhao, Qi, Chu, attacked Pingcheng, became marquis, 700 households.",
  "s706": "Five. Year 8 month 10 Gui Chou day, Marquis of Qi Zhao Jiang Ye year 1.",
  "s707": "Seven",
  "s708": "One. Deprived, extinct. Year 3 re-enfeoffed, one year extinct.",
  "s709": "Four. Year 14, re-enfeoffed Jiang Ye year 1. Six. After year 2, Marquis Dai Tou year 1.",
  "s710": "Two. Seven. Year 3, Marquis Xun year 1. Committed crime, extinct. Geng five. Zhong year 5, enfeoffed Tou's son Marquis Yi Hu year 1.",
  "s711": "Sixteen. Yuanshuo year 5, Marquis Yi Hu died, no heir, state abolished.",
  "s712": "Ninety-eight",
  "s713": "Bai Zhi.",
  "s714": "As Pian Lian followed uprising in Changyi, persuaded Wei to enter Han, as Commandant attacked Ji, became marquis, 1,000 households."
}
