{
  "s757": "Six",
  "s759": "Nine",
  "s762": "80",
  "s763": "Yuan Feng first year",
  "s765": "Ten",
  "s766": "Ninth month geng wu, Palace Assistant Zhang An Shi becomes Right General.",
  "s767": "Imperial Secretary Xin.",
  "s768": "79",
  "s769": "Two",
  "s771": "Eleven",
  "s774": "78",
  "s775": "Three",
  "s777": "Twelve",
  "s778": "Twelfth month geng yin, Commandant Fan Ming You becomes Du Liao General, strikes Wu Huan.",
  "s780": "77",
  "s781": "Four",
  "s782": "Third month jia xu, Qian Qiu passes away.",
  "s783": "Third month yi chou, Imperial Secretary Wang Xin becomes Chancellor, sealed as Fu Chun Hou.",
  "s785": "Imperial Secretary Yang Chang.",
  "s786": "76",
  "s787": "Five",
  "s788": "Twelfth month geng xu, Xin passes away.",
  "s789": "Two",
  "s792": "75",
  "s793": "Six",
  "s795": "Eleventh month yi chou, Imperial Secretary Yang Chang becomes Chancellor, sealed as An Ping Hou.",
  "s796": "Ninth month geng yin, Guard Commander Ping Ling Hou Fan Ming You becomes Du Liao General, strikes Wu Huan.",
  "s798": "74",
  "s799": "Yuan Ping first year",
  "s800": "Chang passes away.",
  "s801": "Ninth month wu xu, Imperial Secretary Cai Yi becomes Chancellor, sealed as Yang Ping Hou.",
  "s802": "Fourth month jia shen, Palace Assistant Long Qiang Hou Han Zeng becomes Front General. Fifth month ding you, Water Controller Colonel Zhao Chong Guo becomes Rear General, Right General Zhang An Shi becomes Chariot Cavalry General.",
  "s803": "Imperial Secretary Chang Shui Hou Tian Guang Ming.",
  "s804": "73",
  "s805": "Filial Xuan Ben Shi first year",
  "s807": "Two",
  "s810": "72",
  "s811": "Two",
  "s813": "Three",
  "s814": "Seventh month geng yin, Imperial Secretary Tian Guang Ming becomes Qi Lian General, Long Qiang Hou Han Zeng becomes Rear General, Ying Ping Hou Zhao Chong Guo becomes Pu Lei General, Du Liao General Ping Ling Hou Fan Ming You becomes Yunzhong governor, Fu Min Hou Tian Shun becomes Hu Ya General: all strike Xiongnu.",
  "s816": "71",
  "s817": "Three",
  "s818": "Third month wu zi, Empress passes away. Sixth month yi chou, Yi passes away.",
  "s819": "Sixth month jia chen, Chang Xin Minor Treasurer Wei Xian becomes Chancellor, sealed as Fu Yang Hou. Tian Guang Ming, Tian Shun strike Hu return, all commit suicide. Chong Guo deprived of general seal.",
  "s821": "Imperial Secretary Wei Xiang.",
  "s822": "70",
  "s823": "Four",
  "s824": "Tenth month yi mao, establishes Huo Empress.",
  "s825": "Two"
}
