{
  "s67": "Eleven",
  "s68": "Execute Huaiyin, Peng Yue. Qing Bu rebels.",
  "s69": "Eleven",
  "s70": "Zhou Bo becomes Grand Commandant. Attacks Dai. Later office abolished.",
  "s72": "195",
  "s73": "Twelve",
  "s74": "Winter, strikes Bu. Returns passing Pei. Summer, Emperor passes away, buried at Chang Mausoleum.",
  "s75": "Twelve",
  "s78": "194",
  "s79": "Filial Hui first year",
  "s80": "Zhao Hidden King Ruyi dies. Begins constructing Chang'an city northwest corner. Abolishes commandery kings' chancellors to chancellors.",
  "s81": "Thirteen",
  "s84": "193",
  "s85": "Two",
  "s86": "Chu Yuan King, Qi Dao Hui King come to court. Seventh month xin wei, He passes away.",
  "s87": "Fourteen. Seventh month gui si, Qi chancellor Ping Yang Hou Cao Can becomes Prime Minister.",
  "s90": "192",
  "s91": "Three",
  "s92": "First constructs Chang'an city. Shu Jian Di rebels. Strikes them.",
  "s93": "Two",
  "s96": "191",
  "s97": "Four",
  "s98": "Third month jia zi, amnesty, nothing to redeem service.",
  "s99": "Three",
  "s102": "190",
  "s103": "Five",
  "s104": "Establishes Gao Zu temple in Pei city wall, places singing children one hundred twenty people. Eighth month yi chou, Can passes away.",
  "s105": "Four",
  "s108": "189",
  "s109": "Six",
  "s110": "Seventh month, Qi Dao Hui King passes away. Establishes Grand Granary, Western Market.",
  "s111": "One. Tenth month ji si, An Guo Hou Wang Ling becomes Right Chancellor. Qu Ni Hou Chen Ping becomes Left Chancellor.",
  "s112": "Yao has crime.",
  "s113": "Guang E Hou Ren Ao becomes Imperial Secretary.",
  "s114": "188",
  "s115": "Seven",
  "s116": "Emperor passes away. Ministers use Zhang Pi Qiang plan, Lü clan power heavy, establishes Lü Tai as Lü King. Establishes Young Emperor. Ninth month xin si, buried at An Mausoleum.",
  "s117": "Two",
  "s120": "187",
  "s121": "Gaohou first year",
  "s122": "Seals Filial Hui various sons. Establishes filial piety, fraternal duty, strength, farming.",
  "s123": "Three. Eleventh month jia zi, moves Ping to Right Chancellor. Pi Yang Hou Shen Shi Qi becomes Left Chancellor.",
  "s126": "186",
  "s127": "Two",
  "s128": "Twelfth month, Lü King Tai passes away, son Jia succeeds as Lü King. Circulates eight zhu coin.",
  "s129": "Four. Ping. Two. Shi Qi.",
  "s131": "Ping Yang Hou Cao Tao becomes Imperial Secretary.",
  "s132": "185",
  "s133": "Three"
}
