{
  "s0249": "Meet horns and battle, not victorious.",
  "s0250": "Star color red yellow and sinks, its dwells fields greatly abundant.",
  "s0251": "Color blue white and red gray, its dwells fields have worry.",
  "s0252": "Year star enters moon, its fields have expel chancellor;",
  "s0253": "With Tai Bai fight, its fields have broken army.",
  "s0254": "Year star one called She Ti, called Chong Hua, called Ying Star, called Ji Star.",
  "s0255": "Camp Room is pure temple, year star temple.",
  "s0256": "Observe firm qi to place Ying Huo.",
  "s0257": "Called southern fire, governs summer, called Bing, Ding.",
  "s0258": "Ritual lost, punishment exits Ying Huo, Ying Huo loses conduct this is.",
  "s0259": "Exits then has troops, enters then troops scatter.",
  "s0260": "With its lodges determine state.",
  "s0261": "Ying Huo for violent chaos, remnant harm, illness, mourning, famine, troops.",
  "s0262": "Contrary way two lodges above, dwells it, three months has calamity, five months receives troops, seven months half loses land, nine months great half loses land.",
  "s0263": "Because with together enter exit, state extinguishes sacrifices.",
  "s0264": "Dwells it, calamity returns arrive, though great when small;",
  "s0265": "Long and arrive, when small contrary great.",
  "s0266": "Its south for husband mourning, north for wife mourning.",
  "s0267": "If horns move circle ring it, and suddenly front suddenly back, left right, calamity increases great.",
  "s0268": "With other stars fight, light mutually reach, becomes harm;",
  "s0269": "Not mutually reach, not harm.",
  "s0270": "Five stars all follow and gather at one lodge, its below state can with ritual bring all under heaven.",
  "s0271": "Method, exits east goes sixteen lodges then stops;",
  "s0272": "Inverse goes two lodges;",
  "s0273": "Sixty days, again east goes, from its stops counts ten lodges, ten months enters western;",
  "s0274": "Hidden goes five months, exits eastern.",
  "s0275": "Its exits western called 'contrary bright', governs fate bad it.",
  "s0276": "East goes urgent, one day goes one degree half.",
  "s0277": "Its goes east west south north urgent.",
  "s0278": "Troops each gather its below;",
  "s0279": "Use battle, follows it victorious, contrary it defeated.",
  "s0280": "Ying Huo follows Tai Bai, army worry;",
  "s0281": "Separates it, army retreats.",
  "s0282": "Exits Tai Bai yin, has divide army;",
  "s0283": "Goes its yang, has partial general battle.",
  "s0284": "When its goes, Tai Bai reaches it, breaks army kills general.",
  "s0285": "Its enters guards offends Tai Wei, Xuan Yuan, Camp Room, governs fate bad it.",
  "s0286": "Xin is Bright Hall, Ying Huo temple.",
  "s0287": "Carefully wait this.",
  "s0288": "Li Dipper meeting to settle Tian Xing position.",
  "s0289": "Called central earth, governs late summer, called Wu, Ji, Yellow Emperor, governs virtue, female lord image.",
  "s0290": "Year Tian one lodge, its dwells state auspicious.",
  "s0291": "Not should dwell dwells, if already goes and again returns, returns dwells it, its state gets earth, not then gets female.",
  "s0292": "If should dwell not dwell, already dwells it, moreover west east goes, its state loses earth, not then loses female, cannot raise affairs use troops.",
  "s0293": "Its dwells long, its state blessing thick;",
  "s0294": "Easy, blessing thin.",
  "s0295": "Its one name called Earth Hou, governs year.",
  "s0296": "Year goes thirteen degrees hundred twelve fen degree five, day goes twenty eight fen degree one, twenty eight years circles heaven.",
  "s0297": "Its dwells, five stars all follow gather at one lodge, its below state, can heavy bring all under heaven.",
  "s0298": "Ritual virtue righteousness kill punishment all lost, then Tian Xing for it moves shakes."
}
