{
  "s0377": "requested to die by suicide in the temple, not permitted.",
  "s0378": "All said: 'Your servant Zhu is ill, cannot listen to commands.",
  "s0379": "Close to the duke's palace.",
  "s0380": "Attendant ministers rush to those with lewdness, do not know two commands.'",
  "s0381": "Duke climbed wall, shot hit duke's thigh, duke fell back, then assassinated him.",
  "s0382": "Yan Ying stood at Cui Zhu's gate, said: 'If lord dies for the altars of soil and grain then die for it, if flees for the altars of soil and grain then flee for it.",
  "s0383": "If dies for oneself or flees for oneself, not being privately intimate, who dares undertake it!'",
  "s0384": "Gate opened and entered, pillowed the duke's corpse and wept, three times leaped out.",
  "s0385": "People told Cui Zhu: 'Must kill him.'",
  "s0386": "Cui Zhu said: 'The people's hope, release him to gain the people.'",
  "s0388": "Ding chou day, Cui Zhu established Duke Zhuang's different mother younger brother Chu Jiu, this was Duke Jing.",
  "s0389": "Duke Jing's mother was the daughter of Shu Sun Xuan Bo of Lu.",
  "s0390": "Duke Jing established, made Cui Zhu right chancellor, Qing Feng left chancellor.",
  "s0391": "Two chancellors feared disorder would arise, then allied with the state people saying: 'Those not with Cui Qing die!'",
  "s0392": "Yan Zi gazed heavenward saying: 'Ying follows only those loyal to lord and beneficial to altars of soil and grain!'",
  "s0393": "Would not ally.",
  "s0394": "Qing Feng wished to kill Yan Zi, Cui Zhu said: 'Loyal minister, release him.'",
  "s0395": "Qi grand historian wrote 'Cui Zhu assassinated Duke Zhuang', Cui Zhu killed him.",
  "s0396": "His younger brother again wrote, Cui Zhu again killed him.",
  "s0397": "Youngest younger brother again wrote, Cui Zhu then released him.",
  "s0398": "Duke Jing year 1, initially, Cui Zhu gave birth to Zi Cheng and Qiang, his mother died, took Dong Guo woman, gave birth to Ming.",
  "s0399": "Dong Guo woman made her former husband Zi Wu Jiu and her younger brother Yan mutually support Cui clan.",
  "s0400": "Cheng had crime, two chancellors urgently punished him, established Ming as crown prince.",
  "s0401": "Cheng requested to retire in Cui, Cui Zhu permitted it, two chancellors did not listen, said: 'Cui is ancestral city, cannot.'",
  "s0402": "Cheng and Qiang angered, told Qing Feng.",
  "s0403": "Qing Feng had enmity with Cui Zhu, wished his defeat.",
  "s0404": "Cheng and Qiang killed Wu Jiu and Yan in Cui Zhu's house, household all fled and scattered.",
  "s0405": "Cui Zhu angered, had no people, made one eunuch drive, saw Qing Feng.",
  "s0406": "Qing Feng said: 'Please for you execute them.'",
  "s0407": "Made Cui Zhu's enemy Lu Pu Bi attack Cui clan, killed Cheng and Qiang, completely extinguished Cui clan, Cui Zhu's wife committed suicide.",
  "s0408": "Cui Zhu had no return, also committed suicide.",
  "s0409": "Qing Feng became chancellor, monopolized power.",
  "s0410": "Year 3 tenth month, Qing Feng went hunting.",
  "s0411": "Initially, Qing Feng having killed Cui Zhu, became increasingly arrogant, addicted to wine and fond of hunting, did not listen to government commands.",
  "s0412": "Qing She used government, already had internal enmity.",
  "s0413": "Tian Wen Zi told Jian Zi: 'Disorder will arise.'",
  "s0414": "Tian, Bao, Gao, Luan clans mutually plotted against Qing clan.",
  "s0415": "Qing She mobilized armor surrounding Qing Feng's palace, four families' followers together attacked and broke it.",
  "s0416": "Qing Feng returned, could not enter, fled to Lu.",
  "s0417": "Qi people rebuked Lu, Feng fled to Wu.",
  "s0418": "Wu gave him Zhu Fang, gathered his clan and dwelt there, richer than in Qi.",
  "s0419": "That autumn, Qi people moved and buried Duke Zhuang, mutilated Cui Zhu's corpse in the market to please the masses.",
  "s0420": "Year 9, Duke Jing sent Yan Ying to Jin, privately spoke with Shu Xiang saying: 'Qi governance finally returns to Tian clan.",
  "s0421": "Tian clan though without great virtue, with public power for private use, has virtue for the people, people love them.'",
  "s0422": "Year 12, duke went to Jin, saw Duke Ping, wished to attack Yan together.",
  "s0423": "Year 18, duke again went to Jin, saw Duke Zhao.",
  "s0424": "Year 26, hunted in Lu suburbs, thus entered Lu, with Yan Ying together inquired of Lu rites.",
  "s0425": "Year 31, Duke Zhao of Lu avoided Ji clan difficulty, fled to Qi.",
  "s0426": "Qi wished to seal him with thousand settlements, Zi Jia stopped Duke Zhao, Duke Zhao then requested Qi attack Lu, take Yun to house Duke Zhao.",
  "s0427": "Year 32, comet appeared."
}
