{
  "s0001": {
    "literal": "Emperor Zhao the Filial was Emperor Wu's youngest son.",
    "idiomatic": "Emperor Zhao the Filial was Emperor Wu's youngest son."
  },
  "s0002": {
    "literal": "His mother was Consort Zhao, who originally obtained favor because of extraordinary qualities, and when she gave birth to the Emperor, it was also extraordinary.",
    "idiomatic": "His mother was Consort Zhao, who originally gained the emperor's favor due to her extraordinary qualities; when she gave birth to the emperor, it was also extraordinary."
  },
  "s0003": {
    "literal": "The account is in the Biography of Outer Relatives.",
    "idiomatic": "The full account is in the Biography of the Imperial Relatives by Marriage."
  },
  "s0004": {
    "literal": "帝年五歲，武帝崩。",
    "idiomatic": "The Emperor was five years old when Emperor Wu passed away."
  },
  "s0005": {
    "literal": "戊寅，太子即皇帝位，謁高廟。",
    "idiomatic": "On the day Wuyin, the crown prince ascended the imperial throne and paid respects at the Gao Temple."
  },
  "s0006": {
    "literal": "尊皇太后曰太皇太后，皇后曰皇太后。",
    "idiomatic": "He honored the Empress Dowager as Grand Empress Dowager, and the Empress as Empress Dowager."
  },
  "s0007": {
    "literal": "夏六月，赦天下。",
    "idiomatic": "Summer, sixth month, granted amnesty to the world."
  },
  "s0008": {
    "literal": "秋七月，庚申，封皇后父奉光侯洨為右扶風，爵如故。",
    "idiomatic": "Autumn, seventh month, day Gengshen, enfeoffed the Empress's father Marquis Fengguang Hao as Right Prefect of Fufeng, with his marquisate as before."
  },
  "s0009": {
    "literal": "九月，詔曰：「朕以眇身獲保宗廟，戰戰兢兢，惟恐不稱。",
    "idiomatic": "Ninth month, edict said: 'I, with my insignificant person, have obtained the protection of the ancestral temples; I am fearful and cautious, afraid of not being worthy."
  },
  "s0010": {
    "literal": "百姓未喻朕志。",
    "idiomatic": "The common people have not yet understood my intentions."
  },
  "s0011": {
    "literal": "惟民之繫心念想，咸惠以申思，免今歲田租。",
    "idiomatic": "The people's hearts are bound up with anxious thoughts; I wish to extend favor to express my thoughts, so I exempt this year's land taxes.'"
  },
  "s0012": {
    "literal": "二年春正月，賜民爵一級。",
    "idiomatic": "Second year, spring, first month, granted the people nobility ranks of one level."
  },
  "s0013": {
    "literal": "赦天下。",
    "idiomatic": "Granted amnesty to the world."
  },
  "s0014": {
    "literal": "二月乙丑，上耕于鈇鉏。",
    "idiomatic": "Second month, day Yichou, the Emperor plowed at Fu Chu."
  },
  "s0015": {
    "literal": "三月，詔曰：「朕之不逮，咎在厥躬。",
    "idiomatic": "Third month, edict said: 'My shortcomings are due to my own faults."
  },
  "s0016": {
    "literal": "乃者廣廷講學，稽古建厲，以崇禮義，厥功茂焉。",
    "idiomatic": "Recently in the broad court we conducted academic lectures, investigated antiquity to establish moral principles, exalting ritual and righteousness—their merit has been abundant."
  },
  "s0017": {
    "literal": "其賜中二千石以下至吏民爵，各有差。",
    "idiomatic": "Grant to those from 2000 shi officials and below, down to officials and commoners, nobility ranks according to their respective degrees.'"
  },
  "s0018": {
    "literal": "夏四月，詔曰：「朕以眇身奉承祖宗，夙夜惟念，孝心恆結。",
    "idiomatic": "Summer, fourth month, edict said: 'I, with my insignificant person, receive the legacy of my ancestors; day and night I think only of this, my filial heart is constantly bound."
  },
  "s0019": {
    "literal": "中外之輔，忠愛尤著，海內鄉風，百姓歸德。",
    "idiomatic": "The inner and outer assistants have been especially loyal and loving; the realm looks to this example, the people return to virtue."
  },
  "s0020": {
    "literal": "惟功德茂盛，暨臻于治，復博選賢俊，宣譽厥德。",
    "idiomatic": "Their merit and virtue are abundant, bringing us to good governance; moreover, I have broadly selected worthy talents to proclaim their virtue."
  },
  "s0021": {
    "literal": "其與中二千石、博士議郎，錄功臣後嗣，咸以所聞。」",
    "idiomatic": "Let them together with the 2000 shi officials and Erudites discuss recording the descendants of meritorious officials, all according to what they have heard.'"
  },
  "s0022": {
    "literal": "六月，赦天下。",
    "idiomatic": "Sixth month, granted amnesty to the world."
  },
  "s0023": {
    "literal": "三年春正月，泰山有大石自起立。",
    "idiomatic": "Third year, spring, first month, at Mount Tai a large stone rose up by itself."
  },
  "s0024": {
    "literal": "上林有柳樹斷枯卧地，亦自立生。",
    "idiomatic": "In the Shanglin Gardens a willow tree that was broken and lying withered on the ground also stood up and came back to life."
  },
  "s0025": {
    "literal": "二月，詔曰：「朕承先帝之休烈，夙夜戰慄，以保宗廟。",
    "idiomatic": "Second month, edict said: 'I inherit the blessed achievements of my predecessor emperors; day and night I tremble with fear to preserve the ancestral temples."
  },
  "s0026": {
    "literal": "惟念百姓未贍，前年減漕三百萬石，米貴民貧。",
    "idiomatic": "I think only of the people not being satisfied; last year we reduced the tribute grain by three million shi; grain is expensive and the people are poor."
  },
  "s0027": {
    "literal": "其減口賦錢。」",
    "idiomatic": "Reduce the poll tax money.'"
  },
  "s0028": {
    "literal": "夏四月，赦天下。",
    "idiomatic": "Summer, fourth month, granted amnesty to the world."
  },
  "s0029": {
    "literal": "六月，詔曰：「蓋聞龍言之君，必有明察之佐。",
    "idiomatic": "Sixth month, edict said: 'I have heard that a sage ruler must have perceptive assistants."
  },
  "s0030": {
    "literal": "故夏殷周政，咸建賢材，胥和百姓。",
    "idiomatic": "Therefore the governments of Xia, Shang, and Zhou all established worthy talents, bringing harmony to the people."
  },
  "s0031": {
    "literal": "朕承宗廟，兢兢業業，惟恐弗逮。",
    "idiomatic": "I inherit the ancestral temples, working diligently and cautiously, fearing I may not be adequate."
  },
  "s0032": {
    "literal": "百姓未喻朕志。",
    "idiomatic": "The common people have not yet understood my intentions."
  },
  "s0033": {
    "literal": "惟民之繫心，咸惠以申思。",
    "idiomatic": "The people's hearts are bound; I wish to extend favor to express my thoughts."
  },
  "s0034": {
    "literal": "其賜中二千石以下至吏民爵，各有差。」",
    "idiomatic": "Grant to those from 2000 shi officials and below, down to officials and commoners, nobility ranks according to their respective degrees.'"
  },
  "s0035": {
    "literal": "秋七月，詔曰：「朕以眇身，獲保宗廟，戰戰兢兢，惟恐不稱。",
    "idiomatic": "Autumn, seventh month, edict said: 'I, with my insignificant person, have obtained the protection of the ancestral temples; I am fearful and cautious, afraid of not being worthy."
  },
  "s0036": {
    "literal": "百姓未贍，前年減漕，米尚糴貴。",
    "idiomatic": "The people are not yet satisfied; last year we reduced the tribute grain, yet grain is still expensive to buy."
  },
  "s0037": {
    "literal": "其減天下口錢。」",
    "idiomatic": "Reduce the poll tax money for the world.'"
  },
  "s0038": {
    "literal": "八月，詔曰：「往年災害多，今年羣穀豊熟。",
    "idiomatic": "Eighth month, edict said: 'In previous years disasters were many; this year the various grains are abundantly ripe."
  },
  "s0039": {
    "literal": "惟遣使者赍帛祠行水旱災處，存問百姓。",
    "idiomatic": "I will dispatch envoys bearing silk to offer sacrifices at places affected by floods and droughts, and to inquire after the people's welfare."
  },
  "s0040": {
    "literal": "鰥寡孤獨老弱不能自存者，賜帛二匹。」",
    "idiomatic": "For widowers, widows, orphans, the solitary, the elderly and weak who cannot support themselves, grant two bolts of silk.'"
  },
  "s0041": {
    "literal": "九月，大鴻臚靳石謁見匈奴單于。",
    "idiomatic": "Ninth month, the Grand Herald Jin Shi paid respects to the Xiongnu Chanyu."
  },
  "s0042": {
    "literal": "四年春正月，賜中二千石以下至吏民爵，各有差。",
    "idiomatic": "Fourth year, spring, first month, granted nobility ranks to those from 2000 shi officials and below, down to officials and commoners, each according to their degree."
  },
  "s0043": {
    "literal": "二月，赦天下。",
    "idiomatic": "Second month, granted amnesty to the world."
  },
  "s0044": {
    "literal": "夏四月，詔曰：「朕承先帝休烈，夙夜戰慄，懼弗稱嗣。",
    "idiomatic": "Summer, fourth month, edict said: 'I inherit the blessed achievements of my predecessor emperor; day and night I tremble with fear, afraid of not being worthy of succession."
  },
  "s0045": {
    "literal": "惟百姓未贍，前年減漕三百萬石，米貴民貧。",
    "idiomatic": "The people are not yet satisfied; last year we reduced the tribute grain by three million shi; grain is expensive and the people are poor."
  },
  "s0046": {
    "literal": "其減口賦錢。」",
    "idiomatic": "Reduce the poll tax money.'"
  },
  "s0047": {
    "literal": "六月，赦天下。",
    "idiomatic": "Sixth month, granted amnesty to the world."
  },
  "s0048": {
    "literal": "秋八月，詔曰：「往年比災害，民未嘗贍也。",
    "idiomatic": "Autumn, eighth month, edict said: 'In previous years disasters followed one after another; the people have never been satisfied."
  },
  "s0049": {
    "literal": "其遣使者循行郡國，存問耆老、鰥寡孤獨、不能自存者，餽穀帛有差。」",
    "idiomatic": "Dispatch envoys to tour the commanderies and kingdoms, inquiring after the elderly, widowers, widows, orphans, and the solitary who cannot support themselves, granting grain and silk according to their needs.'"
  },
  "s0050": {
    "literal": "五年春正月，赦天下。",
    "idiomatic": "Fifth year, spring, first month, granted amnesty to the world."
  },
  "s0051": {
    "literal": "二月，詔曰：「朕以眇身，奉承祖宗，深惟百姓未贍，前年減漕，米尚糴貴。",
    "idiomatic": "Second month, edict said: 'I, with my insignificant person, receive the legacy of my ancestors; I deeply consider that the people are not yet satisfied; last year we reduced the tribute grain, yet grain is still expensive to buy."
  },
  "s0052": {
    "literal": "其減口賦。」",
    "idiomatic": "Reduce the poll tax.'"
  },
  "s0053": {
    "literal": "夏陽陵田陿，發民屯軍。",
    "idiomatic": "Summer, the Yangling fields were narrow; mobilized the people to station troops."
  },
  "s0054": {
    "literal": "六月，赦天下。",
    "idiomatic": "Sixth month, granted amnesty to the world."
  },
  "s0055": {
    "literal": "秋七月，大雨，渭橋絕。",
    "idiomatic": "Autumn, seventh month, great rain; the Wei Bridge broke."
  },
  "s0056": {
    "literal": "八月，詔曰：「今歲郡國熟，榖賤，取爵賜如前。」",
    "idiomatic": "Eighth month, edict said: 'This year the commanderies and kingdoms have good harvests; grain is cheap. Take nobility ranks and grant as before.'"
  },
  "s0057": {
    "literal": "九月，詔曰：「朕以眇身，獲保宗廟，戰戰兢兢，惟恐不稱。",
    "idiomatic": "Ninth month, edict said: 'I, with my insignificant person, have obtained the protection of the ancestral temples; I am fearful and cautious, afraid of not being worthy."
  },
  "s0058": {
    "literal": "今歲飢民流原，朕慙焉。",
    "idiomatic": "This year hungry people have fled to the wilderness; I am ashamed."
  },
  "s0059": {
    "literal": "其減天下口錢。」",
    "idiomatic": "Reduce the poll tax money for the world.'"
  },
  "s0060": {
    "literal": "六年春正月，赦天下。",
    "idiomatic": "Sixth year, spring, first month, granted amnesty to the world."
  },
  "s0061": {
    "literal": "二月，詔曰：「蓋聞古者祖宗之君，豫建太子，所以重社稷也。",
    "idiomatic": "Second month, edict said: 'I have heard that in ancient times the ancestral rulers established crown princes in advance, so as to value the altars of soil and grain."
  },
  "s0062": {
    "literal": "朕承宗廟，戰戰兢兢，惧弗稱嗣。",
    "idiomatic": "I inherit the ancestral temples, fearful and cautious, afraid of not being worthy of succession."
  },
  "s0063": {
    "literal": "惟前孝武皇帝早弃天下，朕稚沖孺，未能親政。",
    "idiomatic": "Previously Emperor Wu the Filial abandoned the world early; I was young and immature, unable to personally govern."
  },
  "s0064": {
    "literal": "其廣延博選，舉賢聖之材，立太子以安宗廟。」",
    "idiomatic": "Broadly extend and extensively select, raise worthy and sage talents, establish a crown prince to secure the ancestral temples.'"
  },
  "s0065": {
    "literal": "夏四月，赦天下。",
    "idiomatic": "Summer, fourth month, granted amnesty to the world."
  },
  "s0066": {
    "literal": "六月，赦天下。",
    "idiomatic": "Sixth month, granted amnesty to the world."
  },
  "s0067": {
    "literal": "秋八月，詔曰：「往年比災害，民未嘗贍。",
    "idiomatic": "Autumn, eighth month, edict said: 'In previous years disasters followed one after another; the people have never been satisfied."
  },
  "s0068": {
    "literal": "其遣使者存問老弱鰥寡孤獨，賜谷帛有差。」",
    "idiomatic": "Dispatch envoys to inquire after the elderly, weak, widowers, widows, orphans, and solitary, granting grain and silk according to their needs.'"
  },
  "s0069": {
    "literal": "九月，大司馬大將軍霍光稽首歸政。",
    "idiomatic": "Ninth month, Grand Marshal Grand General Huo Guang bowed his head and returned the government."
  },
  "s0070": {
    "literal": "上褒讚曰：「大司馬大將軍忠信勇篤，祿位永元。」",
    "idiomatic": "The Emperor praised him, saying: 'The Grand Marshal Grand General is loyal, trustworthy, brave, and steadfast; his emoluments and position shall be eternally enduring.'"
  },
  "s0071": {
    "literal": "七年春正月，赦天下。",
    "idiomatic": "Seventh year, spring, first month, granted amnesty to the world."
  },
  "s0072": {
    "literal": "二月，詔曰：「朕承宗廟之休，戰戰兢兢，惟恐不稱。",
    "idiomatic": "Second month, edict said: 'I inherit the blessed fortune of the ancestral temples; I am fearful and cautious, afraid of not being worthy."
  }
}
