{
  "s0296": "Twelfth year, court Jin.",
  "s0297": "Sixteenth year, Jin Ping Gong ascended position.",
  "s0298": "Twenty-first year, court Jin Ping Gong.",
  "s0299": "Twenty-second year, Kong Qiu born.",
  "s0300": "Twenty-fifth year, Qi Cui Zhu assassinated their lord Zhuang Gong, established his younger brother Jing Gong.",
  "s0301": "Twenty-ninth year, Wu Yan Ling Ji Zi sent to Lu, asked Zhou music, completely knew its meaning, Lu people respected him.",
  "s0302": "Thirty-first year sixth month, Xiang Gong died.",
  "s0303": "Its ninth month, crown prince died.",
  "s0304": "Lu people established Qi returned son Chou as lord, this was Zhao Gong.",
  "s0305": "Zhao Gong year nineteen, still had child heart.",
  "s0306": "Mu Shu not wished establish, said: 'Crown prince died, has mother younger brother can establish, not immediately establish eldest.",
  "s0307": "Years equal choose worthy, righteousness equal then divine it.",
  "s0308": "Now Chou not proper heir, moreover in mourning intention not in sorrow has happy color, if indeed establish, must be Ji Shi worry.'",
  "s0309": "Ji Wu Zi not listened, finally established him.",
  "s0310": "When reached burial, three changed mourning clothes.",
  "s0311": "Gentlemen said: 'This not end.'",
  "s0313": "Zhao Gong third year, court Jin to Yellow River, Jin Ping Gong apologized returned him, Lu shamed it.",
  "s0314": "Fourth year, Chu Ling Wang assembled feudal lords at Shen, Zhao Gong claimed illness not went.",
  "s0315": "Seventh year, Ji Wu Zi died.",
  "s0316": "Eighth year, Chu Ling Wang completed Zhang Hua Tai, summoned Zhao Gong.",
  "s0317": "Zhao Gong went congratulated, granted Zhao Gong treasure vessels;",
  "s0318": "afterward regretted, again cheated took them.",
  "s0319": "Twelfth year, court Jin to Yellow River, Jin Ping Gong apologized returned him.",
  "s0320": "Thirteenth year, Chu gong zi Qi Ji assassinated their lord Ling Wang, replaced established.",
  "s0321": "Fifteenth year, court Jin, Jin detained him bury Jin Zhao Gong, Lu shamed it.",
  "s0322": "Twentieth year, Qi Jing Gong with Yan Zi hunted border, because entered Lu asked rites.",
  "s0323": "Twenty-first year, court Jin to Yellow River, Jin apologized returned him.",
  "s0324": "Twenty-fifth year spring, qu yu came nest.",
  "s0325": "Shi Ji said: 'Wen Cheng time children's rhyme said 'qu yu come nest, duke at Qian Hou.",
  "s0326": "qu yu enter residence, duke outside fields'.' ",
  "s0328": "Ji Shi with Hou Shi fought cocks, Ji Shi mustard chicken feathers, Hou Shi gold spurs.",
  "s0329": "Ji Ping Zi angered invaded Hou Shi, Hou Zhao Bo also angered Ping Zi.",
  "s0330": "Zang Zhao Bo's younger brother Hui falsely slandered Zang Shi, hid Ji Shi, Zang Zhao Bo imprisoned Ji Shi people.",
  "s0331": "Ji Ping Zi angered, imprisoned Zang Shi elders.",
  "s0332": "Zang, Hou Shi with difficulty informed Zhao Gong.",
  "s0333": "Zhao Gong ninth month Wu Xu attacked Ji Shi, then entered.",
  "s0334": "Ping Zi ascended tower requested said: 'Lord with slander not examine minister crime, execute him, request move Yi Shang.'",
  "s0335": "Not permitted.",
  "s0336": "Requested imprison at Meng, not permitted.",
  "s0337": "Requested with five chariots flee, not permitted.",
  "s0338": "Zi Jia Ju said: 'Lord his permit it.",
  "s0339": "Government from Ji Shi long, followers numerous, multitudes will unite plot.'",
  "s0340": "Not listened.",
  "s0341": "Hou Shi said: 'Must kill him.'",
  "s0342": "Shu Sun Shi's minister Li told his multitudes said: 'No Ji Shi with have, which beneficial?'",
  "s0343": "All said: 'No Ji Shi is no Shu Sun Shi.'",
  "s0344": "Li said: 'Yes, save Ji Shi!'",
  "s0345": "Then defeated duke troops."
}
