{
  "s0001": "The ancestors of Han shared the same surname as Zhou, being of the Ji clan.",
  "s0002": "Their descendants served Jin and were enfeoffed at Han Yuan, called Han Wu Zi.",
  "s0003": "Three generations after Wu Zi there was Han Jue, who changed his clan name to Han.",
  "s0004": "Han Jue, in the third year of Duke Jing of Jin, when Jin's Minister of Justice Tu An Jia was about to rebel and execute Duke Ling's assassin Zhao Dun.",
  "s0005": "Zhao Dun had already died, so he wanted to execute his son Zhao Shuo.",
  "s0006": "Han Jue stopped Jia, but Jia would not listen.",
  "s0007": "Jue told Zhao Shuo to flee.",
  "s0008": "Shuo said: 'If you can ensure the Zhao sacrifices are not extinguished, I will die without regret.'",
  "s0009": "Han Jue agreed.",
  "s0010": "When Jia executed the Zhao clan, Jue feigned illness and did not go out.",
  "s0011": "He knew that Cheng Ying and Gong Sun Chu Jiu were hiding the Zhao orphan Zhao Wu.",
  "s0012": "In the eleventh year of Duke Jing, Jue and Xi Ke led eight hundred chariots to attack Qi, defeating Duke Qing of Qi at An, capturing Feng Chou Fu.",
  "s0013": "Thus Jin established the six ministers, and Han Jue held one of the minister positions, called Xian Zi.",
  "s0014": "In the seventeenth year of Duke Jing, he fell ill. Divination showed that those without successors were causing the trouble.",
  "s0015": "Han Jue mentioned Zhao Cheng Ji's merit, saying there were no descendants now to continue sacrifices, which moved Duke Jing.",
  "s0016": "Duke Jing asked: 'Are there still descendants?'",
  "s0017": "Jue then spoke of Zhao Wu, and restored the former Zhao lands and cities, continuing the Zhao sacrifices.",
  "s0018": "In the seventh year of Duke Dao of Jin, Han Xian Zi grew old.",
  "s0019": "Xian Zi died, and his son Xuan Zi succeeded him.",
  "s0020": "Xuan Zi moved his residence to Zhou.",
  "s0021": "In the fourteenth year of Duke Ping of Jin, Wu Ji Zha of Wu visited Jin and said: 'Jin's government has finally come to rest with Han, Wei, and Zhao.'",
  "s0022": "In the twelfth year of Duke Qing of Jin, Han Xuan Zi together with Zhao and Wei divided the ten counties of the Qi and Yang She families.",
  "s0023": "In the fifteenth year of Duke Ding of Jin, Xuan Zi together with Zhao Jian Zi attacked Fan and Zhong Hang.",
  "s0024": "Xuan Zi died, and his son Zhen Zi succeeded him.",
  "s0025": "Zhen Zi moved his residence to Pingyang.",
  "s0026": "Zhen Zi died, and his son Jian Zi succeeded him.",
  "s0027": "Jian Zi died, and his son Zhuang Zi succeeded him.",
  "s0028": "Zhuang Zi died, and his son Kang Zi succeeded him.",
  "s0029": "Kang Zi together with Zhao Xiang Zi and Wei Huan Zi defeated Zhi Bo and divided his territory, their lands growing larger, greater than the other feudal lords.",
  "s0030": "Kang Zi died, and his son Wu Zi succeeded him.",
  "s0031": "In Wu Zi's second year, they attacked Zheng and killed their ruler Duke You.",
  "s0032": "In the sixteenth year, Wu Zi died, and his son Jing Hou succeeded him.",
  "s0033": "In the first year of Jing Hou's reign, they attacked Zheng and took Yongqiu.",
  "s0034": "In the second year, Zheng defeated us at Fu Shu.",
  "s0035": "In the sixth year, together with Zhao and Wei they all became recognized as feudal lords.",
  "s0036": "In the ninth year, Zheng besieged our Yangdi.",
  "s0037": "Jing Hou died, and his son Lie Hou succeeded him.",
  "s0038": "In Lie Hou's third year, Nie Zheng assassinated Han's prime minister Xia Lei.",
  "s0039": "In the ninth year, Qin attacked our Yiyang and took six cities.",
  "s0040": "In the thirteenth year, Lie Hou died, and his son Wen Hou succeeded him.",
  "s0041": "This year Wei Wen Hou died.",
  "s0042": "In Wen Hou's second year, they attacked Zheng and took Yangcheng.",
  "s0043": "They attacked Song, reaching Pengcheng and capturing the Song ruler.",
  "s0044": "In the seventh year, they attacked Qi, reaching Sangqiu.",
  "s0045": "Zheng rebelled against Jin.",
  "s0046": "In the ninth year, they attacked Qi, reaching Lingqiu.",
  "s0047": "In the tenth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0048": "In Ai Hou's first year, together with Zhao and Wei they divided Jin.",
  "s0049": "In the second year, they destroyed Zheng and moved their capital to Zheng.",
  "s0050": "In the sixth year, Ai Hou died, and his son Gong Hou succeeded him.",
  "s0051": "Gong Hou's first year, Qin attacked us.",
  "s0052": "In the second year, Gong Hou died, and his son Huan Hou succeeded him.",
  "s0053": "Huan Hou's first year, Qin attacked us.",
  "s0054": "In the third year, Huan Hou died, and his son Wang Hou succeeded him.",
  "s0055": "Wang Hou's first year, Qin attacked us.",
  "s0056": "In the sixth year, Wang Hou died, and his son Dan Hou succeeded him.",
  "s0057": "Dan Hou's first year, Qin attacked us.",
  "s0058": "In the ninth year, Dan Hou died, and his son Ai Hou succeeded him.",
  "s0059": "Ai Hou's first year, Qin attacked us.",
  "s0060": "In the eleventh year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0061": "Zhao Hou's first year, Qin attacked us.",
  "s0062": "In the twelfth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0063": "Xu Hou's first year, Qin attacked us.",
  "s0064": "In the thirteenth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0065": "Wen Hou's first year, Qin attacked us.",
  "s0066": "In the fourteenth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0067": "Ai Hou's first year, Qin attacked us.",
  "s0068": "In the fifteenth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0069": "Zhao Hou's first year, Qin attacked us.",
  "s0070": "In the sixteenth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0071": "Xu Hou's first year, Qin attacked us.",
  "s0072": "In the seventeenth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0073": "Wen Hou's first year, Qin attacked us.",
  "s0074": "In the eighteenth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0075": "Ai Hou's first year, Qin attacked us.",
  "s0076": "In the nineteenth year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0077": "Zhao Hou's first year, Qin attacked us.",
  "s0078": "In the twentieth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0079": "Xu Hou's first year, Qin attacked us.",
  "s0080": "In the twenty-first year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0081": "Wen Hou's first year, Qin attacked us.",
  "s0082": "In the twenty-second year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0083": "Ai Hou's first year, Qin attacked us.",
  "s0084": "In the twenty-third year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0085": "Zhao Hou's first year, Qin attacked us.",
  "s0086": "In the twenty-fourth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0087": "Xu Hou's first year, Qin attacked us.",
  "s0088": "In the twenty-fifth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0089": "Wen Hou's first year, Qin attacked us.",
  "s0090": "In the twenty-sixth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0091": "Ai Hou's first year, Qin attacked us.",
  "s0092": "In the twenty-seventh year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0093": "Zhao Hou's first year, Qin attacked us.",
  "s0094": "In the twenty-eighth year, Zhao Hou died, and his son Xu Hou succeeded him.",
  "s0095": "Xu Hou's first year, Qin attacked us.",
  "s0096": "In the twenty-ninth year, Xu Hou died, and his son Wen Hou succeeded him.",
  "s0097": "Wen Hou's first year, Qin attacked us.",
  "s0098": "In the thirtieth year, Wen Hou died, and his son Ai Hou succeeded him.",
  "s0099": "Ai Hou's first year, Qin attacked us.",
  "s0100": "In the thirty-first year, Ai Hou died, and his son Zhao Hou succeeded him.",
  "s0101": "Zhao Hou's first year, Qin attacked us."
}
