{
  "s767": "Mo.",
  "s768": "As Zhao guard general Han King year 3 followed uprising in Lunü, attacked Xiang Yu at Aocang, became general, attacked Zang Tea with merit, became marquis, 1,000 households.",
  "s769": "Five. Year 8 month 7 Gui You day, Marquis Jian Cheng Hei year 1.",
  "s770": "Seven",
  "s771": "Two. Six. Year 3, Marquis Xiao Xi year 1.",
  "s772": "Sixteen. Seven. After year 1, Marquis Zao year 1.",
  "s773": "Seven. Year 1, Zao committed crime, state abolished.",
  "s775": "Ninety-two",
  "s776": "Gao.",
  "s777": "Gao Di year 7, became general, followed attacking Dai Chen Xi with merit, became marquis, 600 households.",
  "s778": "Five. Year 8 month 12 Ding Wei day, Marquis Zhi Chen Cuo year 1.",
  "s779": "Two. Five. Year 3, Marquis Huai Ying year 1.",
  "s780": "Eight",
  "s781": "Six. Fourteen. Year 7, Marquis Gong Ying year 1. Three. After year 5, Marquis An year 1.",
  "s782": "Sixteen",
  "s783": "Twelve. Could not, Qianqiu father. Seven. Yuanshou year 2, Marquis Qianqiu year 1. Nine. Yuanding year 5, Marquis Qianqiu convicted of tribute gold, state abolished.",
  "s784": "One hundred twenty-four",
  "s785": "Songzi.",
  "s786": "As Han year 3 Zhao Yulin general initially followed, pacified various lords with merit, comparable to Marquis of Mo, 540 households.",
  "s787": "Four. Year 8 month 12 Ding Mao day, Marquis Hui Xu Que year 1. One. Year 12, Marquis Gong Bu Yi year 1.",
  "s788": "Seven",
  "s789": "Eight",
  "s790": "Nine. Fourteen. Year 10, Marquis Jiu year 1.",
  "s791": "Eight. Zhong year 2, Marquis Jiu convicted of buying prohibited items outside the pass, state abolished.",
  "s793": "Ninety-nine",
  "s794": "Yishi.",
  "s795": "As retainer followed uprising in Feng, entered Han, as commandery captain attacked Xiang Yu, became marquis, 2,400 households.",
  "s796": "Five. Year 8 month 3 Bing Xu day, Marquis Jing Chen Chi year 1.",
  "s797": "Six. One. Year 7, Marquis Jing Jiao year 1.",
  "s798": "Eight",
  "s799": "Twenty-three",
  "s800": "Two. Year 3, Marquis Qing Chai year 1. Died, no heir, state abolished.",
  "s802": "Fifty",
  "s803": "Qing.",
  "s804": "As crossbow general initially rose, followed into Han, as commandery captain attacked Xiang Yu, Dai, became marquis, comparable to Marquis of Peng, 1,000 households.",
  "s805": "Five. Year 8 month 3 Bing Xu day, Marquis Jian Kong Zhong year 1.",
  "s806": "Seven. Year 1, Marquis Qing Sheng year 1.",
  "s807": "Eight",
  "s808": "Seven. Sixteen. Year 8, Marquis Kang Fu year 1.",
  "s809": "Sixteen",
  "s810": "Twenty. Yuanshou year 3, Marquis Gong Shi year 1. Seven. Yuanding year 4, Marquis Sheng year 1. One. Yuanding year 5, Sheng convicted of tribute gold, state abolished.",
  "s811": "Seventy-one",
  "s812": "Qiang.",
  "s813": "As guest official initially rose, followed into Han, as commandery captain attacked Xiang Yu, Dai, became marquis, comparable to Marquis of Peng 1,000 households.",
  "s814": "Three. Year 8 month 3 Bing Xu day, Marquis Jian Liu Sheng year 1. Two. Year 11, Marquis Dai Zhang year 1.",
  "s815": "Seven",
  "s816": "Eight",
  "s817": "Twelve. Year 13, Marquis Fu year 1. Two. Year 15, Marquis Fu committed crime, state abolished.",
  "s820": "Seventy-two",
  "s821": "Peng."
}
