{
  "s0300": "The Five Emperors Temple faced south on the Wei, north crossed the Pu Pool ditch water, the quan fire was raised and sacrificed to, as if brilliant light connected to heaven.",
  "s0301": "Therefore he honored Yuangping as an upper grand master, granting him accumulated thousands in gold.",
  "s0302": "And ordered the doctors and scholars to examine the Six Classics to create the King System, to discuss matters of touring, hunting, feng and shan sacrifices.",
  "s0303": "Emperor Wen exited the Long Gate, as if seeing five people on the northern road, so following their straight north he established the Five Emperors Altar, sacrificing with five sets of sacrificial animals.",
  "s0304": "The next year, Xin Yuangping sent someone holding a jade cup, submitting a memorial to present it at the palace gate.",
  "s0305": "Yuangping told the emperor: 'Below the palace gate there is precious jade vapor coming.'",
  "s0306": "When they inspected it, there was indeed someone offering a jade cup, engraved saying 'Ruler Extends Longevity.'",
  "s0307": "Yuangping also said 'I observed the sun being midday twice.'",
  "s0308": "After a short time, the sun indeed returned to midday again.",
  "s0309": "Therefore he began changing to make the seventeenth year the first year, ordering the realm to have a great feast.",
  "s0310": "Yuangping said: 'The Zhou tripod is lost in the Si River water, now the river overflows connecting to the Si, I gazed northeast at Fen Yin and there is straight golden treasure vapor, perhaps the Zhou tripod will emerge?",
  "s0311": "If omens appear and are not welcomed, they will not come.'",
  "s0312": "Therefore the emperor sent envoys to build a temple south of Fen Yin, facing the river, wishing to sacrifice for the Zhou tripod to emerge.",
  "s0313": "Someone submitted a memorial reporting that Xin Yuangping's words about vapors and spirits were all fraud.",
  "s0314": "He sent Yuangping to the judicial officials for punishment, executed and exterminated Xin Yuangping.",
  "s0315": "From this time on, Emperor Wen was neglectful of matters of correcting the calendar, changing clothing colors, and spirits, and the Wei Yang and Long Gate Five Emperors were overseen by the sacrificial officials, who performed rituals according to the seasons, he did not go.",
  "s0316": "The next year, the Xiongnu frequently entered the borders, they raised troops to guard and defend.",
  "s0317": "Later years had poor harvests.",
  "s0318": "Several years later Emperor Jing ascended the throne.",
  "s0319": "In his sixteenth year, the sacrificial officials each sacrificed according to the seasons as before, nothing new was established, continuing to the present emperor.",
  "s0320": "The present emperor, when first ascending the throne, was especially respectful toward ghost and spirit sacrifices.",
  "s0321": "In the first year, Han had already risen over sixty years, the realm was peaceful, the educated class all hoped the emperor would perform feng and shan and correct the measures, and the emperor favored Confucian arts, summoned worthy and good men, Zhao Wan, Wang Zang and others became high officials through literature, wishing to discuss the ancients and establish the Bright Hall south of the capital to receive the feudal lords.",
  "s0322": "They drafted matters of touring, hunting, feng and shan, changing calendar and clothing colors but did not complete them.",
  "s0323": "They encountered Empress Dowager Dou practicing Huang Lao teachings, not liking Confucian arts, sent people to secretly spy and obtained Zhao Wan and others' profiteering matters, summoned and investigated Wan and Zang, Wan and Zang committed suicide, all their undertakings were abolished.",
  "s0324": "Six years later, Empress Dowager Dou passed away.",
  "s0325": "The next year, they summoned literary scholars Gongsun Hong and others.",
  "s0326": "The next year, the present emperor first went to Yong, performed suburban audience at the five altars.",
  "s0327": "Afterward he constantly performed suburban sacrifices once every three years.",
  "s0328": "At this time the emperor sought the divine lord, housed him in the Ti Shi Pavilion in Shanglin Park.",
  "s0329": "The divine lord was a Changling woman who died in childbirth, appeared as a spirit to her mother-in-law Wanruo.",
  "s0330": "Wanruo sacrificed to her in her room, the people frequently went to sacrifice.",
  "s0331": "The Prince of Pingyuan went to sacrifice, afterward his descendants became honored and prominent.",
  "s0332": "When the present emperor ascended the throne, he richly endowed and placed the sacrifice within the palace.",
  "s0333": "People heard her words, but did not see the person.",
  "s0334": "At this time Li Shaojun also appeared before the emperor using methods of sacrificing to the stove, grain immortals, and anti-aging, the emperor honored him.",
  "s0335": "Shaojun was formerly a retainer of the Marquis of Shenze, mastered techniques.",
  "s0336": "He concealed his age and growth, constantly claimed to be seventy, could make things appear, and reverse aging.",
  "s0337": "He traveled among the feudal lords using his techniques.",
  "s0338": "He had no wife or children.",
  "s0339": "People heard of his ability to make things appear and not die, so they sent him gifts, he constantly had surplus gold, money, clothing, and food.",
  "s0340": "People all thought he did not manage livelihood but was wealthy, and moreover did not know where he came from, believed him even more, competed to serve him.",
  "s0341": "Shaojun was fond of techniques, good at making skillful predictions that strangely hit the mark.",
  "s0342": "He once drank with the Marquis of Wuan, there was a ninety-year-old man in the seats, Shaojun spoke of places he had hunted and shot with his grandfather, the old man as a child had followed his grandfather, recognized the places, the whole gathering was astonished.",
  "s0343": "Shaojun saw the emperor, the emperor had an old bronze vessel, asked Shaojun.",
  "s0344": "Shaojun said: 'This vessel Duke Huan of Qi placed in the Bo Resting Hall in his tenth year.'",
  "s0345": "When they examined its engraving, it was indeed Duke Huan of Qi's vessel.",
  "s0346": "The whole palace was shocked, considered Shaojun divine, several hundred years old.",
  "s0347": "Shaojun told the emperor: 'Sacrificing to the stove brings things, bringing things makes cinnabar and realgar transform into gold, gold made into eating vessels then extends life, extending life then the Penglai immortals in the sea can be seen, seeing them and performing feng and shan then one does not die, Huang Di was like this.",
  "s0348": "I once traveled on the sea, saw An Qisheng, An Qisheng ate giant jujubes as large as melons."
}
