{
  "s0199": "Stable man Luan from wall outside with Liang Shi woman played.",
  "s0200": "Ban angered, whipped Luan.",
  "s0201": "Zhuang Gong heard it, said: 'Luan has strength, then killed him, is not can whip place.'",
  "s0202": "Ban not obtained kill.",
  "s0203": "Met Zhuang Gong had illness.",
  "s0204": "Zhuang Gong had three younger brothers, eldest Qing Fu, second Shu Ya, second Ji You.",
  "s0205": "Zhuang Gong took Qi woman as wife called Ai Jiang.",
  "s0206": "Ai Jiang no sons.",
  "s0207": "Ai Jiang younger sister called Shu Jiang, gave birth son Kai.",
  "s0208": "Zhuang Gong no proper heir, loved Meng woman, wished establish her son Ban.",
  "s0209": "Zhuang Gong ill, asked heir from younger brother Shu Ya.",
  "s0210": "Shu Ya said: 'One continue one reach, Lu's constant.",
  "s0211": "Qing Fu present, can be heir, lord what worry?'",
  "s0212": "Zhuang Gong troubled Shu Ya wished establish Qing Fu, retreated asked Ji You.",
  "s0213": "Ji You said: 'Request with death establish Ban.'",
  "s0214": "Zhuang Gong said: 'Previously Shu Ya wished establish Qing Fu, how?'",
  "s0215": "Ji You with Zhuang Gong command ordered Ya wait at Zhen Wu Shi, made Zhen Ji force drink Shu Ya with poison, said: 'Drink this then have descendants serve sacrifices;",
  "s0216": "not so, die moreover no descendants.'",
  "s0217": "Ya then drank poison died, Lu established his son as Shu Sun Shi.",
  "s0218": "Eight month Gui Hai, Zhuang Gong died, Ji You finally established Zi Ban as lord, like Zhuang Gong command.",
  "s0219": "Served mourning, resided at Dang Shi.",
  "s0220": "Before Qing Fu with Ai Jiang privately communicated, wished establish Ai Jiang younger sister son Kai.",
  "s0221": "To Zhuang Gong died Ji You established Ban, tenth month Ji Wei, Qing Fu made stable man Luan kill Lu gong zi Ban at Dang Shi.",
  "s0222": "Ji You fled Chen.",
  "s0223": "Qing Fu finally established Zhuang Gong son Kai, this was Min Gong.",
  "s0224": "Min Gong second year, Qing Fu with Ai Jiang communicated increasingly excessive.",
  "s0225": "Ai Jiang with Qing Fu plotted kill Min Gong establish Qing Fu.",
  "s0226": "Qing Fu made Bo Xi attack killed Min Gong at Wu Wei.",
  "s0227": "Ji You heard it, from Chen with Min Gong younger brother Shen went to Zhu, requested Lu seek enter him.",
  "s0228": "Lu people wished execute Qing Fu.",
  "s0229": "Qing Fu feared, fled Ju.",
  "s0230": "Then Ji You served Zi Shen entered, established him, this was Xi Gong.",
  "s0231": "Xi Gong also Zhuang Gong youngest son.",
  "s0232": "Ai Jiang feared, fled Zhu.",
  "s0233": "Ji You with bribe went to Ju sought Qing Fu, Qing Fu returned, made person kill Qing Fu, Qing Fu requested flee, not listened, then made grand master Xi Si walk cry go.",
  "s0234": "Qing Fu heard Xi Si sound, then self killed.",
  "s0235": "Qi Huan Gong heard Ai Jiang with Qing Fu disorder endangered Lu, called her from Zhu killed her, with her corpse returned, displayed Lu.",
  "s0236": "Lu Xi Gong requested buried her.",
  "s0237": "Ji You mother Chen woman, so fled in Chen, Chen therefore assisted sent Ji You and Zi Shen.",
  "s0238": "Ji You about give birth, father Lu Huan Gong made person divine it, said: 'Male, his name 'You', between two altars, for gong chamber auxiliary.",
  "s0239": "Ji You flee, then Lu not prosper.'",
  "s0240": "To born, had writing on palm said 'You', then with name it, number Cheng Ji.",
  "s0241": "His after became Ji Shi, Qing Fu after became Meng Shi.",
  "s0242": "Xi Gong first year, with Wen Yang Meng enfeoffed Ji You.",
  "s0243": "Ji You became chancellor.",
  "s0244": "Nine years, Jin Li Ke killed their lord Xi Qi, Zhuo Zi.",
  "s0245": "Qi Huan Gong led Xi Gong punished Jin disorder, reached Gao Liang returned, established Jin Hui Gong.",
  "s0246": "Seventeen years, Qi Huan Gong died."
}
