{
  "s1618": "Five. Qin pulled our Yi Yang, beheaded sixty thousand.",
  "s1619": "Nineteen. First Hu clothing.",
  "s1625": "Qin Zhao Xiang Wang first year",
  "s1626": "Thirteen. Qin struck Pi Shi, not pulled then withdrew.",
  "s1627": "Six. Qin again gave us Wu Sui.",
  "s1634": "Two. Comet appeared. Sang Jun made disorder, executed.",
  "s1635": "Fourteen. Qin Wu Wang empress came back.",
  "s1638": "Twenty-four. Qin came to welcome woman.",
  "s1647": "Twenty-five. Met with Qin king at Huang Jiao, Qin again returned our Shang Yong.",
  "s1652": "Four. Comet appeared.",
  "s1653": "Sixteen. Qin pulled our Pu Ban, Jin Yang, Feng Ling.",
  "s1654": "Nine. Qin took Wu Sui.",
  "s1656": "Twenty-six. Crown prince hostage Qin.",
  "s1661": "Five. Wei king came to court.",
  "s1662": "Seventeen. Met with Qin at Lin Jin, again returned our Pu Ban.",
  "s1663": "Ten. Crown prince Ying met with Qin king at Lin Jin, then went to Xian Yang and returned.",
  "s1670": "Six. Shu rebelled, Si Ma Cuo went to execute Shu guard Hui, pacified Shu. Solar eclipse, day darkened. Attacked Chu.",
  "s1671": "Eighteen. Struck Chu with Qin.",
  "s1672": "Eleven. Qin took our Rang. Struck Chu with Qin.",
  "s1673": "Twenty-five. Zhao attacked Zhong Shan. Hui empress died.",
  "s1674": "Twenty-eight. Qin, Han, Wei, Qi defeated our general Tang Mei at Chong Qiu.",
  "s1676": "Twenty-three. Struck Chu with Qin, sent Gong Zi to lead, greatly merited.",
  "s1679": "Seven. Chu Li Ji died. Struck Chu, beheaded thirty thousand. Wei Ran became chancellor.",
  "s1683": "Twenty-nine. Qin took our Xiang Cheng, killed Jing Que.",
  "s1685": "Twenty-four. Qin sent Jing Yang Jun to come as hostage.",
  "s1688": "Eight. Chu king came, then detained him.",
  "s1689": "Twenty. Met with Qi king at Han.",
  "s1690": "Thirteen. Qi, Wei kings came. Established Jiu as crown prince.",
  "s1692": "Thirty. King entered Qin. Qin took our eight cities.",
  "s1694": "Twenty-five. Jing Yang Jun again returned to Qin. Xue Wen entered chancellor Qin.",
  "s1698": "Twenty-one. Struck Qin with Qi, Han at Han Gu. River, Wei cut off one day.",
  "s1699": "Fourteen. Struck Qin with Qi, Wei.",
  "s1700": "Zhao Hui Wen Wang first year. Made Gong Zi Sheng chancellor, enfeoffed Ping Yuan Jun.",
  "s1701": "Chu Qing Xiang Wang first year. Qin took our sixteen cities",
  "s1703": "Twenty-six. Struck Qin with Wei, Han. Meng Chang Jun returned chancellor Qi.",
  "s1706": "Ten. Chu Huai Wang fled to Zhao, Zhao did not let in.",
  "s1709": "Two. Chu Huai Wang fled came, did not let in.",
  "s1715": "Eleven. Comet appeared. Again sealed Feng Ling with Wei.",
  "s1717": "Sixteen. (Struck Qin with Qi Wei) Qin made peace with us at Wu Sui.",
  "s1719": "Three. Huai Wang died in Qin, came back for burial.",
  "s1724": "Twelve. Lou Huan dismissed. Rang Hou Wei Ran became chancellor.",
  "s1725": "Wei Zhao Wang first year. Qin Wei Cuo came struck our Xiang.",
  "s1726": "Han Xi Wang Jiu first year",
  "s1727": "Four. Besieged killed Zhu Fu. Extinguished Zhong Shan with Qi, Yan.",
  "s1728": "Four. Lu Wen Gong first year.",
  "s1730": "Twenty-nine. Assisted Zhao extinguish Zhong Shan.",
  "s1733": "Thirteen. Ren Bi became Han Zhong governor.",
  "s1734": "Two. Fought with Qin, we unfavorable.",
  "s1739": "Thirty. Tian Jia kidnapped king, chancellor Xue Wen fled.",
  "s1742": "Fourteen. Bai Qi struck Yi Que, beheaded two hundred forty thousand."
}
