{
  "s0302": "The king said: 'With the worthies Meng Chang and Mang Ao leading strong Han and Wei to attack Qin, they still could do nothing to me.",
  "s0303": "Now with the incapable Ru Er and Wei Qi leading weak Han and Wei to attack Qin, it is also clear they can do nothing to me.'",
  "s0304": "All those around him said: 'Very true.'",
  "s0305": "Zhong Qi Feng Qin replied: 'Your majesty's assessment of the world is wrong.",
  "s0306": "During the time of the six Jin ministers, Zhi Shi was strongest, destroying Fan and Zhong Hang, then leading Han and Wei troops to besiege Zhao Xiang Zi at Jinyang, releasing Jin waters to flood Jinyang city, with only three boards not submerged.",
  "s0307": "Zhi Bo released the water, Wei Huan Zi drove the chariot, Han Kang Zi was the passenger.",
  "s0308": "Zhi Bo said: 'I originally did not know water could destroy a state, but now I know it.'",
  "s0309": "Fen water can flood Anyi, Jiang water can flood Pingyang.",
  "s0310": "Wei Huan Zi elbowed Han Kang Zi, Han Kang Zi stepped on Wei Huan Zi, their elbows and feet met on the chariot, yet Zhi Shi's territory was divided, he died and his state perished, becoming the world's laughingstock.",
  "s0311": "Now though Qin troops are strong, they cannot surpass Zhi Shi;",
  "s0312": "though Han and Wei are weak, they are still wiser than at Jinyang.",
  "s0313": "This is precisely the time to use elbows and feet - I hope your majesty will not take it lightly!'",
  "s0314": "Thus the Qin king was afraid.",
  "s0315": "Qi and Chu formed an alliance to attack Wei, Wei sent people to seek aid from Qin, with envoys coming one after another, but Qin aid did not arrive.",
  "s0316": "Wei had a man named Tang Ju, over ninety years old, who said to the king of Wei: 'This old minister requests to go west to persuade the king of Qin, let the troops leave before me.'",
  "s0317": "The king of Wei bowed twice and prepared a chariot to send him.",
  "s0318": "Tang Ju arrived and entered to see the king of Qin.",
  "s0319": "The king of Qin said: 'Elder, you have come such a long way, it has been very arduous!",
  "s0320": "Wei has come seeking aid several times, I already know Wei's urgency.'",
  "s0321": "Tang Ju said: 'If your majesty already knows Wei's urgency, why not send troops?'",
  "s0322": "The king of Qin said: 'I will send them.'",
  "s0323": "Tang Ju said: 'When will they arrive?'",
  "s0324": "The king of Qin said: 'I will send them in twenty days.'",
  "s0325": "Tang Ju said: 'This is not what I meant.'",
  "s0326": "The king of Qin said: 'What did you mean?'",
  "s0327": "Tang Ju said: 'I requested that troops leave before me, now I am leaving, and troops will follow after twenty days - this is not troops leaving before me.'",
  "s0328": "The king of Qin said: 'Very well, I will send them in ten days.'",
  "s0329": "Tang Ju said: 'This is still not what I meant.'",
  "s0330": "The king of Qin said: 'What did you mean?'",
  "s0331": "Tang Ju said: 'I requested that troops leave before me. Now I am leaving today, troops should leave today.'",
  "s0332": "The king of Qin became angry, saying: 'Elder, you are too much! If I had you executed, who would know?'",
  "s0333": "Tang Ju said: 'If you execute me, who would know? But there is something you should know.",
  "s0334": "In ancient times, Jing Fu killed his lord and was praised in the world; Zi Xu killed his lord and was praised in Wu.",
  "s0335": "Though they killed their lords, they were praised because they were loyal to their states.",
  "s0336": "If I die today, I will be praised in Wei. People will say: Tang Ju did not fear death, persuaded Qin for Wei, and died for his state.",
  "s0337": "This old man dies, but gains fame. Your majesty executes me, gains the name of killing an envoy, and loses the hearts of the world.'",
  "s0338": "The king of Qin said: 'Stop, elder. I will send the troops.'",
  "s0339": "He ordered the troops to set out the same day.",
  "s0340": "Tang Ju left and the Qin troops followed.",
  "s0341": "The king of Wei heard of it and was delighted.",
  "s0342": "He asked Tang Ju: 'How did you persuade the king of Qin?'",
  "s0343": "Tang Ju said: 'I used the way of Jing Fu and Zi Xu.'",
  "s0344": "The king of Wei was afraid, saying: 'If Qin hears of this, what will we do?'",
  "s0345": "He secretly executed Tang Ju.",
  "s0346": "Qin heard of it and was angry, saying: 'Wei is not worth aiding.'",
  "s0347": "They recalled their troops.",
  "s0348": "Qi defeated Wei at Maling, killing ten thousand Wei troops, capturing their general Shen Bi.",
  "s0349": "The king of Wei was afraid and sent people to seek peace with Qi, ceding ten cities.",
  "s0350": "The king of Wei died, and his son Jing Wang ascended the throne.",
  "s0351": "Jing Wang's first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0352": "In the second year, Qi attacked Wei again, defeating Wei at Guiguan.",
  "s0353": "In the third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0354": "In the fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0355": "In the fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0356": "In the sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0357": "In the seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0358": "In the eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0359": "In the ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0360": "In the tenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0361": "In the eleventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0362": "In the twelfth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0363": "In the thirteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0364": "In the fourteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0365": "In the fifteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0366": "In the sixteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0367": "In the seventeenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0368": "In the eighteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0369": "In the nineteenth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0370": "In the twentieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0371": "In the twenty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0372": "In the twenty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0373": "In the twenty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0374": "In the twenty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0375": "In the twenty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0376": "In the twenty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0377": "In the twenty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0378": "In the twenty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0379": "In the twenty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0380": "In the thirtieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0381": "In the thirty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0382": "In the thirty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0383": "In the thirty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0384": "In the thirty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0385": "In the thirty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0386": "In the thirty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0387": "In the thirty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0388": "In the thirty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0389": "In the thirty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0390": "In the fortieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0391": "In the forty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0392": "In the forty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0393": "In the forty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0394": "In the forty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0395": "In the forty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0396": "In the forty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0397": "In the forty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0398": "In the forty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0399": "In the forty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0400": "In the fiftieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0401": "In the fifty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0402": "In the fifty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0403": "In the fifty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0404": "In the fifty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0405": "In the fifty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0406": "In the fifty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0407": "In the fifty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0408": "In the fifty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0409": "In the fifty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0410": "In the sixtieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0411": "In the sixty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0412": "In the sixty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0413": "In the sixty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0414": "In the sixty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0415": "In the sixty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0416": "In the sixty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0417": "In the sixty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0418": "In the sixty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0419": "In the sixty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0420": "In the seventieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0421": "In the seventy-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0422": "In the seventy-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0423": "In the seventy-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0424": "In the seventy-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0425": "In the seventy-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0426": "In the seventy-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0427": "In the seventy-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0428": "In the seventy-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0429": "In the seventy-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0430": "In the eightieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0431": "In the eighty-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0432": "In the eighty-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0433": "In the eighty-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0434": "In the eighty-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0435": "In the eighty-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0436": "In the eighty-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0437": "In the eighty-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0438": "In the eighty-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0439": "In the eighty-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0440": "In the ninetieth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0441": "In the ninety-first year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0442": "In the ninety-second year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0443": "In the ninety-third year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0444": "In the ninety-fourth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0445": "In the ninety-fifth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0446": "In the ninety-sixth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0447": "In the ninety-seventh year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0448": "In the ninety-eighth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0449": "In the ninety-ninth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0450": "In the hundredth year, Qi attacked Wei, defeating Wei at Guiguan.",
  "s0451": "Tai Shi Gong said:",
  "s0452": "When Wei first separated from Jin, it was strong and prosperous, with Li Kui's laws and Wu Qi's strategies, becoming a major state.",
  "s0453": "But later kings became arrogant and extravagant, loving to build palaces and towers, depleting the state's wealth.",
  "s0454": "They employed treacherous ministers like Zhang Yi, trusted slanderers like Guo Kai, lost their generals like Mang Ao, and abandoned their wise ministers like Xun Zi.",
  "s0455": "Thus Qin took advantage of their internal disorder to attack and weaken them, moving their capital to Daliang.",
  "s0456": "Wei was originally a great state, but declined because of this."
}
