{
  "s0076": "The Shang ancestor Yi heard of this and was afraid, reported it to Emperor Zhou.",
  "s0077": "Zhou said: 'Is there not the Heavenly Mandate?",
  "s0078": "What can they do!'",
  "s0079": "The next year, attacked Tang.",
  "s0080": "The next year, attacked Chong Hou Hu.",
  "s0081": "He built Feng city, moved the capital from Qi below the mountain to Feng.",
  "s0082": "The next year, defeated the Qi state.",
  "s0083": "King Wen died, King Wu ascended.",
  "s0084": "King Wu made the Duke of Zhou prime minister, and the Duke of Shao assistant.",
  "s0085": "He prepared troops, observed the stars and constellations, chose an auspicious day.",
  "s0086": "King Wu reviewed the troops at Mengjin.",
  "s0087": "The Shang king Zhou heard of this and laughed, saying: 'The western barbarians are few.'",
  "s0088": "He did not prepare defenses.",
  "s0089": "King Wu crossed the Yellow River at Mengjin with 800 lords.",
  "s0090": "The next day, engaged in battle at Muye.",
  "s0091": "The Shang troops were numerous, but the Zhou troops were resolute.",
  "s0092": "The Shang troops all turned against Zhou, and Zhou was defeated.",
  "s0093": "King Wu entered the Shang capital, the city of Zhao.",
  "s0094": "He captured the treasures of the Yin Shang, returned to Fenghao.",
  "s0095": "He divided the lands, enfeoffed the Zhou lords.",
  "s0096": "He put the Duke of Zhou in charge of the eastern regions.",
  "s0097": "King Wu died, King Cheng was young, the Duke of Zhou acted as regent.",
  "s0098": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
  "s0099": "He moved the Yin people to Luo, established the eastern capital.",
  "s0100": "He made the Luo Proclamation, established the well-field system.",
  "s0101": "He made the various lords swear oaths.",
  "s0102": "King Cheng grew up, the Duke of Zhou returned the government.",
  "s0103": "King Cheng went to the eastern capital, toured the lords.",
  "s0104": "The lords all came to court, no one dared to be late.",
  "s0105": "King Cheng returned to Fenghao, was diligent in government."
}

