{
  "s0001": "The ancestors of Wei were descendants of Bi Gong Gao.",
  "s0002": "Bi Gong Gao shared the same surname as the Zhou royal family.",
  "s0003": "When King Wu attacked King Zhou, Gao was enfeoffed at Bi, thus becoming the Bi surname.",
  "s0004": "His descendants later lost their enfeoffment and became commoners, some living in the Central Plains, others among the barbarians.",
  "s0005": "One of his descendants was named Bi Wan, who served Duke Xian of Jin.",
  "s0006": "In Duke Xian's sixteenth year, Zhao Shu served as charioteer and Bi Wan as guard, attacking and destroying Huo, Geng, and Wei.",
  "s0007": "Geng was granted to Zhao Shu, Wei was granted to Bi Wan, making him a minister.",
  "s0008": "Bu Yan said: 'Bi Wan's descendants will surely become great. Wan means ten thousand, a full number;",
  "s0009": "Wei is a great name.",
  "s0010": "With this as the beginning of his reward, Heaven has opened the way. The Son of Heaven is called 'myriad people,' feudal lords are called 'ten thousand people.'",
  "s0011": "Now giving him a great name following a full number, he will surely have many followers.'",
  "s0012": "Initially, when Bi Wan divined about serving Jin, he encountered the hexagram Tun with Bi.",
  "s0013": "Xin Liao interpreted it, saying: 'Auspicious.",
  "s0014": "Tun is solid, Bi enters - what could be more auspicious? He will surely flourish and prosper.'",
  "s0015": "Eleven years after Bi Wan was enfeoffed, Duke Xian of Jin died, and his four sons contended to succeed him, causing chaos in Jin.",
  "s0016": "Meanwhile, Bi Wan's descendants grew increasingly prominent, changing their clan name from their state name to Wei.",
  "s0017": "He fathered Wu Zi.",
  "s0018": "Wei Wu Zi served Jin's Prince Chong Er with the sons of Wei.",
  "s0019": "In Duke Xian's twenty-first year, Wu Zi followed Chong Er into exile.",
  "s0020": "After nineteen years, Chong Er returned and was established as Duke Wen of Jin. He commanded Wei Wu Zi to inherit the Wei family's enfeoffment and ranked him as a minister, governing Wei.",
  "s0021": "He fathered Dao Zi.",
  "s0022": "Wei Dao Zi moved his administration to Huo.",
  "s0023": "He fathered Wei Jiang.",
  "s0024": "Wei Jiang served Duke Dao of Jin.",
  "s0025": "In Duke Dao's third year, he assembled the feudal lords.",
  "s0026": "Duke Dao's younger brother Yang Qian behaved improperly. Wei Jiang seized and humiliated Yang Qian.",
  "s0027": "Duke Dao was angry, saying: 'Assembling the feudal lords brings glory, now you've humiliated my younger brother!'",
  "s0028": "He was about to execute Wei Jiang.",
  "s0029": "Someone persuaded Duke Dao, and he stopped.",
  "s0030": "In the end, he entrusted Wei Jiang with governing, making him harmonize with the Rong and Di tribes, who became attached and friendly.",
  "s0031": "In Duke Dao's eleventh year, he said: 'Since I employed Wei Jiang, in eight years we have assembled the feudal lords nine times, the Rong and Di are peaceful - this is your strength.'",
  "s0032": "He granted him music, and after three refusals, Wei Jiang accepted it.",
  "s0033": "He moved his administration to Anyi.",
  "s0034": "Wei Jiang died, receiving the posthumous title Zhao Zi.",
  "s0035": "He fathered Wei Ying.",
  "s0036": "Ying fathered Wei Xian Zi.",
  "s0037": "Xian Zi served Duke Zhao of Jin.",
  "s0038": "Duke Zhao died and the six ministers grew strong while the ducal house declined.",
  "s0039": "In Duke Qing's twelfth year, Han Xuan Zi grew old, and Wei Xian Zi managed state affairs.",
  "s0040": "The Jin ducal families Qi and Yang She hated each other. The six ministers executed them, taking all their cities to make ten counties, with each of the six ministers appointing their sons as county magistrates.",
  "s0041": "Xian Zi together with Zhao Jian Zi, Zhong Hang Wen Zi, and Fan Xian Zi became ministers of Jin.",
  "s0042": "Fourteen years later, Confucius became prime minister of Lu.",
  "s0043": "Four years after that, Zhao Jian Zi, because of the chaos at Jinyang, allied with Han and Wei to attack Fan and Zhong Hang.",
  "s0044": "Wei Xian Zi fathered Wei Chi.",
  "s0045": "Wei Chi together with Zhao Yang attacked Fan and Zhong Hang.",
  "s0046": "Wei Chi's grandson was Wei Huan Zi, who together with Han Kang Zi and Zhao Xiang Zi attacked and destroyed Zhi Bo, dividing his territory.",
  "s0047": "Huan Zi's grandson was Wen Hou Du.",
  "s0048": "Wei Wen Hou's first year was Qin Ling Gong's first year.",
  "s0049": "He was contemporary with Han Wu Zi, Zhao Huan Zi, and Zhou Wei Wang.",
  "s0050": "Wen Hou began to appoint Li Kui as prime minister, abolishing the old laws and establishing new ones.",
  "s0051": "He welcomed Wu Qi from Chu, appointing him as general to attack Qin, capturing five cities.",
  "s0052": "He welcomed Tian Wen from Qi, appointing him as prime minister.",
  "s0053": "He welcomed Xi Men Bao from Wei, making him magistrate of Ye, where he developed waterworks to benefit the people.",
  "s0054": "He welcomed Xun Qing from Zhao, making him tutor to his son.",
  "s0055": "He welcomed Meng Ke from Lu, treating him with great courtesy.",
  "s0056": "These five men were all worthies, and under Wen Hou's governance, Wei became strong and prominent.",
  "s0057": "In Wen Hou's sixteenth year, he died, and his son Wu Hou Ji ascended the throne.",
  "s0058": "Wu Hou's first year, he welcomed Shang Yang from Qin.",
  "s0059": "In Wu Hou's ninth year, he died, and his son Hui Wang ascended the throne.",
  "s0060": "Hui Wang's first year, he welcomed Meng Zi from Zou.",
  "s0061": "In Hui Wang's ninth year, he welcomed Xun Qing from Zhao.",
  "s0062": "In Hui Wang's thirteenth year, Qin attacked Wei, taking Yuan.",
  "s0063": "In the fifteenth year, Hui Wang died, and his son Xiang Wang ascended the throne.",
  "s0064": "Xiang Wang's first year, he welcomed Xun Zi from Zhao.",
  "s0065": "In Xiang Wang's sixteenth year, Qin attacked Wei, taking She.",
  "s0066": "In the seventeenth year, Xiang Wang died, and his son Anxi Wang ascended the throne.",
  "s0067": "Anxi Wang's first year, Qin attacked Wei, taking Pu.",
  "s0068": "In the ninth year, Qin attacked Wei, taking Huayang.",
  "s0069": "In the twelfth year, Anxi Wang died, and his son Jing Wang ascended the throne.",
  "s0070": "Jing Wang's first year, Qin attacked Wei, taking Yongqiu.",
  "s0071": "In the fourteenth year, Qin attacked Wei, taking Xiangling.",
  "s0072": "In the sixteenth year, Qin attacked Wei, taking Yuan and She.",
  "s0073": "In the seventeenth year, Jing Wang died, and his son Wuan Wang ascended the throne.",
  "s0074": "Wuan Wang's first year, Qin attacked Wei, taking Puzi.",
  "s0075": "In the fifth year, Qin attacked Wei, taking Xingqiu.",
  "s0076": "In the ninth year, Qin attacked Wei, taking Ying.",
  "s0077": "In the twelfth year, Wuan Wang died, and his son Jing Wang ascended the throne.",
  "s0078": "Jing Wang's first year, Qin attacked Wei, taking Anling.",
  "s0079": "In the second year, Qin attacked Wei, taking Deng.",
  "s0080": "In the fifth year, Qin attacked Wei, taking Zhao.",
  "s0081": "In the sixth year, Qin attacked Wei, taking He.",
  "s0082": "In the seventh year, Qin attacked Wei, taking Anyi.",
  "s0083": "Anyi was Wei's old capital, so Jing Wang moved the capital to Daliang.",
  "s0084": "In the eighth year, Qin attacked Wei, taking Huai.",
  "s0085": "In the ninth year, Qin attacked Wei, taking Xinling.",
  "s0086": "In the tenth year, Qin attacked Wei, taking Wei.",
  "s0087": "In the eleventh year, Qin attacked Wei, taking Yuan.",
  "s0088": "In the twelfth year, Qin attacked Wei, taking Xingqiu.",
  "s0089": "In the thirteenth year, Qin attacked Wei, taking Zhaoyang.",
  "s0090": "In the fourteenth year, Qin attacked Wei, taking Changping.",
  "s0091": "In the fifteenth year, Qin attacked Wei, taking Wangcheng.",
  "s0092": "In the sixteenth year, Qin attacked Wei, taking Hefei.",
  "s0093": "In the seventeenth year, Qin attacked Wei, taking Yingqiu.",
  "s0094": "In the eighteenth year, Qin attacked Wei, taking Linjin.",
  "s0095": "In the nineteenth year, Qin attacked Wei, taking Chengyang.",
  "s0096": "In the twentieth year, Qin attacked Wei, taking Yueyang.",
  "s0097": "In the twenty-first year, Qin attacked Wei, taking Chengyang.",
  "s0098": "In the twenty-second year, Qin attacked Wei, taking Yueyang.",
  "s0099": "In the twenty-third year, Qin attacked Wei, taking Chengyang.",
  "s0100": "In the twenty-fourth year, Qin attacked Wei, taking Yueyang.",
  "s0101": "In the twenty-fifth year, Qin attacked Wei, taking Chengyang."
}
