{
  "s0051": "Eastern lands with gathered, Zhou Gong returned reported Cheng Wang, then made poem gave Wang, named it Chi Xiao.",
  "s0052": "Wang also not dared instruct Zhou Gong.",
  "s0053": "Cheng Wang seventh year second month Yi Wei, Wang morning walked from Zhou, to Feng, made Tai Bao Zhao Gong first to Luo survey land.",
  "s0054": "Its third month, Zhou Gong went planned Cheng Zhou Luo yi, divined residence, said auspicious, then made capital.",
  "s0055": "Cheng Wang grown, able listen government.",
  "s0056": "Then Zhou Gong returned government to Cheng Wang, Cheng Wang faced court.",
  "s0057": "Zhou Gong's replace Cheng Wang govern, south faced back leaned court feudal lords.",
  "s0058": "To seven years after, returned government Cheng Wang, north faced took minister position, trembling like fearing.",
  "s0059": "Initially, Cheng Wang young time, ill, Zhou Gong self cut his fingernails sank river, blessed to spirits said: 'Wang young not have knowledge, harm spirit mandate is Dan.'",
  "s0060": "Also hid its ce at office.",
  "s0061": "Cheng Wang ill recovered.",
  "s0062": "To Cheng Wang administered affairs, person or slandered Zhou Gong, Zhou Gong fled Chu.",
  "s0063": "Cheng Wang opened office, saw Zhou Gong prayer book, then cried, returned Zhou Gong.",
  "s0064": "Zhou Gong returned, feared Cheng Wang strong, governed had licentious leisure, then made many scholars, made mother leisure.",
  "s0065": "Mother leisure said: 'Be person parents, occupation to long lasting, descendants arrogant extravagant forget it, with lose their family, be person son can not careful?",
  "s0066": "Formerly in Yin Wang Zhong Zong, strict respectful feared heaven mandate, self measured governed people, shocked feared not dare idle peaceful, so Zhong Zong enjoyed country seventy-five years.",
  "s0067": "Its in Gao Zong, long labored outside, for with small people, made his ascended throne, then had bright dark, three years not speak, speak then clear, not dare idle peaceful, quiet calmed Yin country, to small great no resentment, so Gao Zong enjoyed country fifty-five years.",
  "s0068": "Its in Zu Jia, not righteous only king, long as small person outside, knew small people's dependence, able protect extend small people, not insult few, so Zu Jia enjoyed country thirty-three years.'",
  "s0069": "Many scholars said: 'From Tang to Di Yi, none not followed sacrifices bright virtue, none not matched heaven.",
  "s0070": "In now later successor Wang Zhou, wantonly lewd his leisure, not consider heaven and people's following.",
  "s0071": "Its people all can execute.'",
  "s0072": "(Zhou many scholars) 'Wen Wang day middle declined not leisure eat, enjoyed country fifty years.'",
  "s0073": "Made this to warn Cheng Wang.",
  "s0074": "Cheng Wang in Feng, world already peaceful, Zhou's official government not in order, then Zhou Gong made Zhou officers, officers distinguished their suitable, made establish government, convenient people.",
  "s0075": "People pleased.",
  "s0076": "Zhou Gong in Feng, ill, about die, said: 'Must bury me Cheng Zhou, to show I not dare leave Cheng Wang.'",
  "s0077": "Zhou Gong already died, Cheng Wang also declined, buried Zhou Gong at Bi, followed Wen Wang, to show my little son not dare minister Zhou Gong.",
  "s0078": "Zhou Gong died after, autumn not harvested, violent wind thunder rain, grain all flattened, great trees all uprooted.",
  "s0079": "Zhou country greatly feared.",
  "s0080": "Cheng Wang with grand masters court robes opened gold tied book, Wang then obtained Zhou Gong self considered merit replace Wu Wang's words.",
  "s0081": "Two gongs and Wang then asked shi hundred officials, shi hundred officials said: 'Indeed have, formerly Zhou Gong commanded me not dare speak.'",
  "s0082": "Cheng Wang held book cried, said: 'From now after will no wrong divination?",
  "s0083": "Formerly Zhou Gong diligent labored Wang family, only I young person not reached know.",
  "s0084": "Now heaven moved awe to manifest Zhou Gong's virtue, only my little son welcome, our state rites also suitable it.'",
  "s0085": "Wang went suburbs, heaven then rained, reversed wind, grain all rose.",
  "s0086": "Two gongs ordered country people, all great trees flattened places, all rose built them.",
  "s0087": "Year then great harvest.",
  "s0088": "Then Cheng Wang ordered Lu obtain suburban sacrifice Wen Wang.",
  "s0089": "Lu had heavenly son rites music, to praise Zhou Gong's virtue.",
  "s0090": "Zhou Gong died, son Bo Qin already previously received enfeoffment, this was Lu Gong.",
  "s0091": "Lu Gong Bo Qin's initially received enfeoffment Lu, three years then reported government Zhou Gong.",
  "s0092": "Zhou Gong said: 'Why late?'",
  "s0093": "Bo Qin said: 'Change their customs, reform their rites, mourn three years then remove, so late.'",
  "s0094": "Tai Gong also enfeoffed at Qi, five months reported government Zhou Gong.",
  "s0095": "Zhou Gong said: 'Why fast?'",
  "s0096": "Said: 'I simplified their lord minister rites, followed their customs did it.'",
  "s0097": "To after heard Bo Qin reported government late, then sighed said: 'Alas, Lu later generations will north face serve Qi!",
  "s0098": "Government not simple not easy, people not have close;",
  "s0099": "Peaceful easy close people, people must return it.'"
}
