{
  "s0794": "Asked Bo Zong, Bo Zong thought insufficient strange.",
  "s0795": "Sixteenth year, Chu general Zi Fan resented Wu Chen, extinguished his clan.",
  "s0796": "Wu Chen angered, sent Zi Fan letter said: 'Must make you tired at running commands!'",
  "s0797": "Then requested envoy Wu, commanded his son as Wu traveler, taught Wu ride chariots use troops.",
  "s0798": "Wu Jin began through, agreed attack Chu.",
  "s0799": "Seventeenth year, executed Zhao Tong, Zhao Kuo, clan extinguished them.",
  "s0800": "Han Jue said: 'Zhao Shuai, Zhao Dun merit how able forget?",
  "s0801": "Why cut sacrifices!'",
  "s0802": "Then again commanded Zhao concubine son Wu as Zhao successor, again granted cities.",
  "s0803": "Nineteenth year summer, Jing Gong ill, established his crown prince Shou Man as lord, this was Li Gong.",
  "s0804": "After month remainder, Jing Gong died.",
  "s0805": "Li Gong first year, initial established, wished harmonize feudal lords, with Qin Huan Gong between river allied.",
  "s0806": "Returned Qin betrayed alliance, with Di plotted attacked Jin.",
  "s0807": "Third year, sent Lu Xiang ceded Qin, because with feudal lords attacked Qin.",
  "s0808": "To Jing, defeated Qin at Ma Sui, captured their general Cheng Chai.",
  "s0809": "Fifth year, three Xi slandered Bo Zong, killed him.",
  "s0810": "Bo Zong with good straight advice obtained this calamity, country people with this not attached Li Gong.",
  "s0811": "Sixth year spring, Zheng betrayed Jin with Chu allied, Jin angered.",
  "s0812": "Luan Shu said: 'Not able at my generation lose feudal lords.'",
  "s0813": "Then sent troops.",
  "s0814": "Li Gong self led, fifth month crossed river.",
  "s0815": "Heard Chu troops came save, Fan Wen Zi requested Gong wished return.",
  "s0816": "Xi Zhi said: 'Sent troops punish contrary, saw strong avoid it, no with command feudal lords.'",
  "s0817": "Then battled.",
  "s0818": "Gui Si, shot hit Chu Gong Wang eye, Chu troops defeated at Yan Ling.",
  "s0819": "Zi Fan gathered remaining troops, patted followed wished again battle, Jin troubled it.",
  "s0820": "Gong Wang summoned Zi Fan, his attendants Shu Yang Gu advanced wine, Zi Fan drunk, not able see.",
  "s0821": "Wang angered, reprimanded Zi Fan, Zi Fan died.",
  "s0822": "Wang then led troops returned.",
  "s0823": "Jin from this awed feudal lords, wished with command world seek hegemony.",
  "s0824": "Li Gong many outer favored Ji, returned, wished completely remove group grand masters established various Ji brothers.",
  "s0825": "Favored Ji elder brother called Xu Tong, once with Xi Zhi had enmity, and Luan Shu also resented Xi Zhi not used his plan but finally defeated Chu, then sent people secretly informed Chu.",
  "s0826": "Chu came deceived Li Gong said: 'Yan Ling battle, truly Zhi summoned Chu, wished make disorder, inner Zi Zhou establish him.",
  "s0827": "Met with country not prepared, so matter not succeed.'",
  "s0828": "Li Gong informed Luan Shu.",
  "s0829": "Luan Shu said: 'Its nearly have!",
  "s0830": "Wish Gong try send person Zhou secretly examine it.'",
  "s0831": "Indeed sent Xi Zhi to Zhou.",
  "s0832": "Luan Shu moreover sent Gong Zi Zhou see Xi Zhi, Xi Zhi not know seen sell.",
  "s0833": "Li Gong verified it, believe so, then resented Xi Zhi, wished kill him.",
  "s0834": "Eighth year, Li Gong hunted, with Ji drank, Xi Zhi killed pig presented advanced, eunuch seized it.",
  "s0835": "Xi Zhi shot killed eunuch.",
  "s0836": "Gong angered, said: 'Ji Zi deceived me!'",
  "s0837": "About execute three Xi, not issued.",
  "s0838": "Xi Gou wished attack Gong, said: 'I though die, Gong also ill.'",
  "s0839": "Xi Zhi said: 'Trust not contrary lord, wisdom not harm people, courage not make disorder.",
  "s0840": "Lose this three, who with me?",
  "s0841": "I die ear!'",
  "s0842": "Twelfth month Ren Wu, Gong commanded Xu Tong with troops eight hundred people attacked killed three Xi.",
  "s0843": "Xu Tong because with kidnapped Luan Shu, Zhong Xing Yan at court, said: 'Not kill two sons, calamity must reach Gong.'",
  "s0844": "Gong said: 'Once kill three ministers, I not bear moreover.'",
  "s0845": "Answered said: 'Person will bear lord.'",
  "s0846": "Gong not listened, apologized Luan Shu etc. with execute Xi clan crime: 'Grand masters restore position.'",
  "s0847": "Two sons knocked head said: 'Fortunate very fortunate!'",
  "s0848": "Gong sent Xu Tong as minister.",
  "s0849": "Leap month Yi Mao, Li Gong toured Jiang Li clan, Luan Shu, Zhong Xing Yan with their party attacked captured Li Gong, imprisoned him, killed Xu Tong, sent people welcomed Gong Zi Zhou at Zhou established him, this was Dao Gong.",
  "s0850": "Dao Gong first year first month Geng Shen, Luan Shu, Zhong Xing Yan assassinated Li Gong, buried with one chariot.",
  "s0851": "Li Gong imprisoned six days died, died ten days Geng Wu, Zhi Ying welcomed Gong Zi Zhou came, to Jiang, executed chicken with grand masters allied established him, this was Dao Gong.",
  "s0852": "Xin Si, courted Wu Gong temple.",
  "s0853": "Second month Yi You, ascended position.",
  "s0854": "Dao Gong Zhou, his grandfather Jie, Jin Xiang Gong young son, not able establish, numbered Huan Shu, Huan Shu most loved.",
  "s0855": "Huan Shu gave birth Hui Bo Tan, Tan gave birth Dao Gong Zhou.",
  "s0856": "Zhou establish, age fourteen.",
  "s0857": "Dao Gong said: 'Grandfather, father all not able establish avoided difficulty at Zhou, guest died there.",
  "s0858": "I self with distant, no nearly as lord.",
  "s0859": "Now grand masters not forget Wen, Xiang intention kindly established Huan Shu after, rely ancestral temple grand masters spirit, obtained serve Jin sacrifices, how dare not tremble?",
  "s0860": "Grand masters their also assist me!'",
  "s0861": "Then expelled not minister seven people, cultivated old merit, applied virtue favor, gathered Wen Gong enter time merit ministers after.",
  "s0862": "Autumn, attacked Zheng.",
  "s0863": "Zheng army defeated, then to Chen.",
  "s0864": "Third year, Jin assembled feudal lords.",
  "s0865": "Dao Gong asked group ministers usable, Qi Xi raised Xie Hu.",
  "s0866": "Xie Hu, Xi enemy.",
  "s0867": "Again asked, raised his son Qi Wu.",
  "s0868": "Jun Zi said: 'Qi Xi can call not party!",
  "s0869": "Outer raise not hid enemy, inner raise not hid son.'",
  "s0870": "Just assembled feudal lords, Dao Gong younger brother Yang Gan disorderly conduct, Wei Jiang executed his charioteer.",
  "s0871": "Dao Gong angered, someone advised Gong, Gong finally worthy Jiang, entrusted government, sent harmonize Rong, Rong greatly close attached.",
  "s0872": "Eleventh year, Dao Gong said: 'From I used Wei Jiang, nine assembled feudal lords, harmonized Rong, Di, Wei Zi strength.'",
  "s0873": "Granted music, three declined then received.",
  "s0874": "Winter, Qin took our Yue.",
  "s0875": "Fourteenth year, Jin sent six ministers led feudal lords attacked Qin, crossed Jing, greatly defeated Qin army, to Yu Lin left.",
  "s0876": "Fifteenth year, Dao Gong asked govern country at Shi Kuang.",
  "s0877": "Shi Kuang said: 'Only benevolence righteousness as foundation.'",
  "s0878": "Winter, Dao Gong died, son Ping Gong Biao established.",
  "s0879": "Ping Gong first year, attacked Qi, Qi Ling Gong with battled Mi Xia, Qi army defeated fled.",
  "s0880": "Yan Ying said: 'Lord also no courage, why not stop battle?'",
  "s0881": "Then left.",
  "s0882": "Jin pursued, then surrounded Lin Zi, completely burned slaughtered its outer city.",
  "s0883": "East to Jiao, south to Yi, Qi all walled defended, Jin then led troops returned.",
  "s0884": "Sixth year, Lu Xiang Gong courted Jin.",
  "s0885": "Jin Luan Cheng had crime, fled Qi.",
  "s0886": "Eighth year, Qi Zhuang Gong secretly sent Luan Cheng at Qu Wo, with troops followed him.",
  "s0887": "Qi troops ascended Tai Xing, Luan Cheng from Qu Wo middle contrary, attacked entered Jiang.",
  "s0888": "Jiang not prepared, Ping Gong wished suicide, Fan Xian Zi stopped Gong, with his followers attacked Cheng, Cheng defeated fled Qu Wo.",
  "s0889": "Qu Wo attacked Cheng, Cheng died, then extinguished Luan clan ancestor.",
  "s0890": "Cheng, Luan Shu grandson.",
  "s0891": "His entered Jiang, with Wei clan plotted.",
  "s0892": "Qi Zhuang Gong heard Cheng defeated, then returned, took Jin Chao Ge left, to repay Lin Zi campaign.",
  "s0893": "Tenth year, Qi Cui Zhu assassinated his lord Zhuang Gong.",
  "s0894": "Jin because Qi disorder, attacked defeated Qi at Gao Tang left, repaid Tai Xing campaign.",
  "s0895": "Fourteenth year, Wu Yan Ling Ji Zi came envoy, with Zhao Wen Zi, Han Xuan Zi, Wei Xian Zi spoke, said: 'Jin country government, finally return this three families.'",
  "s0897": "Nineteenth year, Qi sent Yan Ying like Jin, with Shu Xiang spoke.",
  "s0898": "Shu Xiang said: 'Jin, last generation.",
  "s0899": "Gong thick collected for towers pools not relieve government, government in private gates, its able long?'",
  "s0900": "Yan Zi approved it.",
  "s0901": "Twenty-second year, attacked Yan.",
  "s0902": "Twenty-sixth year, Ping Gong died, son Zhao Gong Yi established.",
  "s0903": "Zhao Gong sixth year died.",
  "s0904": "Six ministers strong, gong chamber lowly.",
  "s0905": "Son Qu Gong Qu Ji established.",
  "s0906": "Qu Gong sixth year, Zhou Jing Wang collapsed, wang sons contended establish.",
  "s0907": "Jin six ministers settled wang chamber disorder, established Jing Wang.",
  "s0908": "Ninth year, Lu Ji clan drove their lord Zhao Gong, Zhao Gong resided Gan Hou.",
  "s0909": "Eleventh year, Wei, Song sent envoys requested Jin accept Lu lord.",
  "s0910": "Ji Ping Zi private bribed Fan Xian Zi, Xian Zi received it, then told Jin lord said: 'Ji clan no crime.'",
  "s0911": "Not succeed enter Lu lord.",
  "s0912": "Twelfth year, Jin ancestral family Qi Xi grandson, Shu Xiang son, mutually disliked at lord.",
  "s0913": "Six ministers wished weak gong chamber, then with law completely extinguished their clan.",
  "s0914": "Divided their cities as ten counties, each commanded their son as grand master.",
  "s0915": "Jin increasingly weak, six ministers all great.",
  "s0916": "Fourteenth year, Qu Gong died, son Ding Gong Wu established.",
  "s0917": "Ding Gong eleventh year, Lu Yang Hu fled Jin, Zhao Meng Jian Zi lodged him.",
  "s0918": "Twelfth year, Kong Qiu chancellor Lu.",
  "s0919": "Fifteenth year, Zhao Meng sent Han Dan grand master Wu, not believed, wished kill Wu, Wu with Zhong Xing Yin, Fan Ji She relatives attacked Zhao Meng, Meng fled protected Jin Yang.",
  "s0920": "Ding Gong surrounded Jin Yang.",
  "s0921": "Xun Yue, Han Bu Xin, Wei Chi with Fan, Zhong Xing for enemy, then shifted troops attacked Fan, Zhong Xing.",
  "s0922": "Fan, Zhong Xing contrary, Jin lord attacked them, defeated Fan, Zhong Xing.",
  "s0923": "Fan, Zhong Xing walked Chao Ge, protected it.",
  "s0924": "Han, Wei for Zhao Meng apologized Jin lord, then pardoned Zhao Meng, restored position.",
  "s0925": "Twenty-second year, Jin defeated Fan, Zhong Xing clan, two sons fled Qi.",
  "s0926": "Thirtieth year, Ding Gong with Wu wang Fu Chai assembled Huang Chi, contended seniority, Zhao Meng at time followed, finally seniority Wu.",
  "s0927": "Thirty-first year, Qi Tian Chang assassinated his lord Jian Gong, established Jian Gong younger brother Ao as Ping Gong.",
  "s0928": "Thirty-third year, Kong Qiu died.",
  "s0929": "Thirty-seventh year, Ding Gong died, son Chu Gong Zao established.",
  "s0930": "Chu Gong seventeenth year, Zhi Bo with Zhao, Han, Wei together divided Fan, Zhong Xing land as cities.",
  "s0931": "Chu Gong angered, informed Qi, Lu, wished with attack four ministers.",
  "s0932": "Four ministers feared, then contrary attacked Chu Gong.",
  "s0933": "Chu Gong fled Qi, road died.",
  "s0934": "So Zhi Bo then established Zhao Gong great grandson Jiao as Jin lord, this was Ai Gong.",
  "s0935": "Ai Gong great grandfather Yong, Jin Zhao Gong young son, numbered Dai Zi.",
  "s0936": "Dai Zi gave birth Ji.",
  "s0937": "Ji good Zhi Bo, early died, so Zhi Bo wished completely unite Jin, not dared, then established Ji son Jiao as lord.",
  "s0938": "At this time, Jin country government all decided Zhi Bo, Jin Ai Gong not able have control.",
  "s0939": "Zhi Bo then possessed Fan, Zhong Xing land, most strong.",
  "s0940": "Ai Gong fourth year, Zhao Xiang Zi, Han Kang Zi, Wei Huan Zi together killed Zhi Bo, completely united his land.",
  "s0941": "Eighteenth year, Ai Gong died, son You Gong Liu established.",
  "s0942": "You Gong time, Jin feared, contrary courted Han, Zhao, Wei lords.",
  "s0943": "Alone had Jiang, Qu Wo, remainder all entered three Jin.",
  "s0944": "Fifteenth year, Wei Wen Hou initial established.",
  "s0945": "Eighteenth year, You Gong lewd women, night secretly exited city middle, thief killed You Gong.",
  "s0946": "Wei Wen Hou with troops executed Jin disorder, established You Gong son Zhi, this was Lie Gong.",
  "s0947": "Lie Gong nineteenth year, Zhou Wei Lie Wang granted Zhao, Han, Wei all commanded as feudal lords.",
  "s0948": "Twenty-seventh year, Lie Gong died, son Xiao Gong Ni established.",
  "s0949": "Xiao Gong ninth year, Wei Wu Hou initial established, attacked Han Dan, not conquer left.",
  "s0950": "Seventeenth year, Xiao Gong died, son Jing Gong Ju Jiu established.",
  "s0951": "This year, Qi Wei Wang first year.",
  "s0952": "Jing Gong second year, Wei Wu Hou, Han Ai Hou, Zhao Jing Hou extinguished Jin after divided its land three ways.",
  "s0953": "Jing Gong moved as commoner, Jin cut off not sacrifice.",
  "s0954": "Grand Historian said: Jin Wen Gong, ancient called enlightened lord, perished resided outside nineteen years, to extremely distressed, and ascended position carried reward, still forgot Jie Zi Tui, moreover arrogant lord?",
  "s0955": "Ling Gong already assassinated, its after Cheng, Jing brought strict, to Li greatly harsh, grand masters feared executed, calamity made.",
  "s0956": "Dao Gong after day declined, six ministers monopolized power.",
  "s0957": "So lord way control his ministers below."
}
