{
  "s0645": "Jin people with difficulty reason, wished establish long lord.",
  "s0646": "Zhao Dun said: 'Establish Xiang Gong younger brother Yong.",
  "s0647": "Good goodness long, previous lord loved him;",
  "s0648": "moreover near Qin, Qin originally good.",
  "s0649": "Establish good then solid, serve long then orderly, serve love then filial, tie old good then peaceful.'",
  "s0650": "Jia Ji said: 'Not like his younger brother Le.",
  "s0651": "Chen Ying favored at two lords, establish his son, people must peaceful him.'",
  "s0652": "Zhao Dun said: 'Chen Ying low, rank at nine people below, his son what awe have!",
  "s0653": "Moreover for two lords favored, lewd.",
  "s0654": "For previous lord son, not able seek great exit reside small country, remote.",
  "s0655": "Mother lewd son remote, no awe;",
  "s0656": "Chen small far, no aid: will what able!'",
  "s0657": "Sent Shi Hui like Qin welcome gong zi Yong.",
  "s0658": "Jia Ji also sent people summon gong zi Le at Chen.",
  "s0659": "Zhao Dun abolished Jia Ji, with his killed Yang Chu Fu.",
  "s0660": "Tenth month, buried Xiang Gong.",
  "s0661": "Eleventh month, Jia Ji fled Di.",
  "s0662": "This year, Qin Mu Gong also died.",
  "s0663": "Ling Gong first year fourth month, Qin Kang Gong said: 'Former Wen Gong enter no guard, so have Lu, Xi calamity.'",
  "s0664": "Then many granted gong zi Yong guard.",
  "s0665": "Crown prince mother Mu Ying day night held crown prince wailed at court, said: 'Previous lord what crime?",
  "s0666": "Its successor also what crime?",
  "s0667": "Abandon proper outside seek lord, will place this?'",
  "s0668": "Exited court, then held went to Zhao Dun place, knocked head said: 'Previous lord served this son entrusted you, said 'this son talented, I receive its grant;",
  "s0669": "not talented, I resent you'.",
  "s0670": "Now lord died, words still in ear, abandoned it, how?'",
  "s0671": "Zhao Dun with various grand masters all troubled Mu Ying, moreover feared executed, then back welcomed established crown prince Yi Gao, this was Ling Gong.",
  "s0672": "Sent troops with resist Qin sent gong zi Yong.",
  "s0673": "Zhao Dun as general, went attacked Qin, defeated at Ling Hu.",
  "s0674": "Xian Mie, Sui Hui perished fled Qin.",
  "s0675": "Autumn, Qi, Song, Wei, Zheng, Cao, Xu lords all assembled Zhao Dun, allied at Hu, with Ling Gong initial establish reason.",
  "s0676": "Fourth year, attacked Qin, took Shao Liang.",
  "s0677": "Qin also took Jin Ji.",
  "s0678": "Sixth year, Qin Kang Gong attacked Jin, took Ji Ma.",
  "s0679": "Jin Hou angered, sent Zhao Dun, Zhao Chuan, Xi Que attacked Qin, great battle He Qu, Zhao Chuan most had merit.",
  "s0680": "Seventh year, Jin six ministers troubled Sui Hui in Qin, often made Jin disorder, then feigned commanded Wei Shou Yu rebel Jin surrender Qin.",
  "s0681": "Qin sent Sui Hui Wei, because seized Hui returned Jin.",
  "s0682": "Eighth year, Zhou Qu Wang collapsed, ministers contended power, so not went.",
  "s0683": "Jin sent Zhao Dun with chariots eight hundred rode peaceful Zhou disorder established Kuang Wang.",
  "s0684": "This year, Chu Zhuang Wang initial ascended position.",
  "s0685": "Twelfth year, Qi people assassinated their lord Yi Gong.",
  "s0686": "Fourteenth year, Ling Gong grown, extravagant, thick collected to carve walls.",
  "s0687": "From tower above shot people, observed their avoid pellets.",
  "s0688": "Cook boiled bear paw not ripe, Ling Gong angered, killed cook, sent women held his corpse exited abandoned, passed court.",
  "s0689": "Zhao Dun, Sui Hui before several advised, not listened;",
  "s0690": "already again saw dead person hand, two people before advised.",
  "s0691": "Sui Hui first advised, not listened.",
  "s0692": "Ling Gong troubled it, sent Chu Ni stabbed Zhao Dun.",
  "s0693": "Dun gate opened, residence frugal, Chu Ni retreated, sighed said: 'Kill loyal minister, abandon lord command, crime one.'"
}
