{
  "s0346": "Meng Yi Zi heard Shu Sun Shi won, also killed Hou Zhao Bo.",
  "s0347": "Hou Zhao Bo for duke envoy, so Meng Shi obtained him.",
  "s0348": "Three families together attacked duke, duke then fled.",
  "s0349": "Ji Hai, duke arrived Qi.",
  "s0350": "Qi Jing Gong said: 'Request present thousand altars await lord.'",
  "s0351": "Zi Jia said: 'Abandon Zhou Gong's enterprise become minister to Qi, can?'",
  "s0352": "Then stopped.",
  "s0353": "Zi Jia said: 'Qi Jing Gong no trust, not like early to Jin.'",
  "s0354": "Not followed.",
  "s0355": "Shu Sun saw duke returned, saw Ping Zi, Ping Zi knocked head.",
  "s0356": "Initially wished welcome Zhao Gong, Meng Sun, Ji Sun afterward regretted, then stopped.",
  "s0357": "Twenty-sixth year spring, Qi attacked Lu, took Yun resided Zhao Gong there.",
  "s0358": "Summer, Qi Jing Gong about enter duke, ordered not accept Lu bribes.",
  "s0359": "Shen Feng, Ru Jia permitted Qi minister Gao Que, Zi Jiang grain five thousand dou.",
  "s0360": "Zi Jiang spoke to Qi Hou said: 'Group ministers cannot serve Lu lord, have different.",
  "s0361": "Song Yuan Gong for Lu went Jin, sought enter him, road died.",
  "s0362": "Shu Sun Zhao Zi sought enter their lord, no illness died.",
  "s0363": "Not know heaven abandon Lu?",
  "s0364": "Or Lu lord has crime to ghosts spirits?",
  "s0365": "Wish lord moreover wait.'",
  "s0366": "Qi Jing Gong followed it.",
  "s0367": "Twenty-eighth year, Zhao Gong went Jin, sought enter.",
  "s0368": "Ji Ping Zi privately with Jin six ministers, six ministers received Ji Shi bribes, advised Jin lord, Jin lord then stopped, resided Zhao Gong Qian Hou.",
  "s0369": "Twenty-ninth year, Zhao Gong went Yun.",
  "s0370": "Qi Jing Gong made person granted Zhao Gong letter, self called 'main lord'.",
  "s0371": "Zhao Gong shamed it, angered left Qian Hou.",
  "s0372": "Thirty-first year, Jin wished enter Zhao Gong, summoned Ji Ping Zi.",
  "s0373": "Ping Zi cloth clothes barefoot walked, through six ministers apologized crime.",
  "s0374": "Six ministers for spoke said: 'Jin wishes enter Zhao Gong, multitudes not follow.'",
  "s0375": "Jin people stopped.",
  "s0376": "Thirty-second year, Zhao Gong died at Qian Hou.",
  "s0377": "Lu people together established Zhao Gong younger brother Song as lord, this was Ding Gong.",
  "s0378": "Ding Gong established, Zhao Jian Zi asked Shi Mo said: 'Ji Shi perish?'",
  "s0379": "Shi Mo answered said: 'Not perish.",
  "s0380": "Ji You had great merit at Lu, received Meng as upper minister, to Wen Zi, Wu Zi, generations increased their enterprise.",
  "s0381": "Lu Wen Gong died, Dong Men Sui killed proper established secondary, Lu lord then lost country government.",
  "s0382": "Government in Ji Shi, to now four lords.",
  "s0383": "People not know lord, how obtain country!",
  "s0384": "Therefore be lord careful vessels and names, cannot lend people.'",
  "s0386": "Ding Gong fifth year, Ji Ping Zi died.",
  "s0387": "Yang Hu privately angered, imprisoned Ji Huan Zi, allied with him, then released him.",
  "s0388": "Seventh year, Qi attacked us, took Yun, made Lu Yang Hu yi to follow government.",
  "s0389": "Eighth year, Yang Hu wished completely kill three Huan proper sons, moreover establish his good secondary sons to replace them;",
  "s0390": "loaded Ji Huan Zi about kill him, Huan Zi cheated obtained escape.",
  "s0391": "Three Huan together attacked Yang Hu, Yang Hu resided Yang Guan.",
  "s0392": "Ninth year, Lu attacked Yang Hu, Yang Hu fled Qi, afterward fled Jin Zhao Shi.",
  "s0393": "Tenth year, Ding Gong with Qi Jing Gong assembled at Jia Gu, Kong Qiu walked chancellor affairs.",
  "s0394": "Qi wished attack Lu lord, Kong Qiu with rites ascended steps, executed Qi lewd music, Qi Hou feared, then stopped, returned Lu invaded land apologized crime.",
  "s0395": "Twelfth year, made Zhong You destroy three Huan cities, collected their armor weapons.",
  "s0396": "Meng Shi not wished fall city, attacked him, not conquered then stopped.",
  "s0397": "Ji Huan Zi received Qi woman music, Kong Qiu left.",
  "s0398": "Fifteenth year, Ding Gong died, son Jiang established, this was Ai Gong.",
  "s0399": "Ai Gong fifth year, Qi Jing Gong died.",
  "s0400": "Sixth year, Qi Tian Qi assassinated their lord Ru Zi.",
  "s0401": "Seventh year, Wu Wang Fu Cha strong, attacked Qi, to Zeng, demanded hundred tribute offerings from Lu.",
  "s0402": "Ji Kang Zi made Zi Gong persuade Wu Wang and chief steward Pi, with rites bent them.",
  "s0403": "Wu Wang said: 'I tattooed body, not worth demand rites.'",
  "s0404": "Then stopped.",
  "s0405": "Wu for Zou attacked Lu, to city walls, allied left.",
  "s0406": "Qi attacked us, took three yi.",
  "s0407": "Tenth year, attacked Qi south border.",
  "s0408": "Qi attacked Lu.",
  "s0409": "Ji Shi used Ran You had merit, thought Kong Qiu, Kong Qiu from Wei returned Lu.",
  "s0410": "Qi Tian Chang assassinated their lord Jian Gong at Xu Zhou.",
  "s0411": "Kong Qiu requested attack him, Ai Gong not listened.",
  "s0412": "Fifteenth year, made Zi Fu Jing Bo, Zi Gong as intermediaries, went Qi, Qi returned our invaded land.",
  "s0413": "Tian Chang initially chancellor, wished close feudal lords.",
  "s0414": "Sixteenth year, Kong Qiu died.",
  "s0415": "Twenty-second year, Yue Wang Gou Jian extinguished Wu Wang Fu Cha.",
  "s0416": "Twenty-seventh year spring, Ji Kang Zi died.",
  "s0417": "Summer, Ai Gong troubled three Huan, about wished take advantage feudal lords to coerce them, three Huan also troubled duke make difficulty, so lord minister many gaps.",
  "s0418": "Duke toured at Ling Ban, met Meng Wu Bo at street, said: 'Please ask I reach death?'",
  "s0419": "Answered said: 'Not know.'",
  "s0420": "Duke wished with Yue attack three Huan.",
  "s0421": "Eighth month, Ai Gong went Xi Shi.",
  "s0422": "Three Huan attacked duke, duke fled to Wei, left went Zou, then went Yue.",
  "s0423": "Country people welcomed Ai Gong returned, died at You Shan Shi.",
  "s0424": "Son Ning established, this was Dao Gong.",
  "s0425": "Dao Gong time, three Huan won, Lu like small marquis, lowly to three Huan families.",
  "s0426": "Thirteenth year, three Jin extinguished Zhi Bo, divided his land had it.",
  "s0427": "Thirty-seventh year, Dao Gong died, son Jia established, this was Yuan Gong.",
  "s0428": "Yuan Gong twenty-first year died, son Xian established, this was Mu Gong.",
  "s0429": "Mu Gong thirty-third year died, son Fen established, this was Gong Gong.",
  "s0430": "Gong Gong twenty-second year died, son Tun established, this was Kang Gong.",
  "s0431": "Kang Gong ninth year died, son Pi established, this was Jing Gong.",
  "s0432": "Jing Gong twenty-ninth year died, son Shu established, this was Ping Gong.",
  "s0433": "At this time six countries all called king.",
  "s0434": "Ping Gong twelfth year, Qin Hui Wang died.",
  "s0435": "Twenty year, Ping Gong died, son Jia established, this was Wen Gong.",
  "s0436": "Wen Gong first year, Chu Huai Wang died at Qin.",
  "s0437": "Twenty-third year, Wen Gong died, son Qiu established, this was Qing Gong.",
  "s0438": "Qing Gong second year, Qin captured Chu's Ying, Chu Qing Wang east moved to Chen.",
  "s0439": "Nineteenth year, Chu attacked us, took Xu Zhou.",
  "s0440": "Twenty-fourth year, Chu Kao Lie Wang attacked extinguished Lu.",
  "s0441": "Qing Gong fled, moved to lower yi, became commoner, Lu cut off sacrifices.",
  "s0442": "Qing Gong died at Ke.",
  "s0443": "Lu from Zhou Gong to Qing Gong, altogether thirty-four generations.",
  "s0444": "Grand Historian said: I heard Kong Qiu say 'extreme Lu way's decline!",
  "s0445": "Zhu Si between quarrel quarrel like'.",
  "s0446": "Observe Qing Fu and Shu Ya Min Gong time, what its chaos?",
  "s0447": "Yin Huan affairs;",
  "s0448": "Xiang Zhong killed proper established secondary;",
  "s0449": "three families north face became ministers, personally attacked Zhao Gong, Zhao Gong with fled.",
  "s0440": "To their bow yield rites then followed, but actions what its contrary!"
}
