{
  "s0100": {
    "chinese": "十二月，楚王陳涉為其御莊賈所殺。",
    "literal": "Twelfth month, Chu King Chen Sheng was killed by his charioteer Zhuang Jia.",
    "idiomatic": "In the twelfth month, King Chen Sheng of Chu was assassinated by his charioteer Zhuang Jia."
  },
  "s0101": {
    "chinese": "魏人 周市略地豐沛，使人謂雍齒曰：「豐，故梁徙也，今魏地已定者數十城。",
    "literal": "Wei person Zhou Shi conquered territory Feng Pei, sent person to tell Yong Chi: 'Feng was formerly Liang migrants, now Wei territory already settled several tens cities.",
    "idiomatic": "The Wei commander Zhou Shi was conquering territory around Feng and Pei. He sent a messenger to Yong Chi: 'Feng was originally settled by Liang migrants. Wei has now secured dozens of cities in this area."
  },
  "s0102": {
    "chinese": "齒今下魏，魏以齒為侯守豐；",
    "literal": "Chi now submits to Wei, Wei will make Chi a marquis to guard Feng;",
    "idiomatic": "If you submit to Wei now, we'll make you Marquis of Feng and let you defend it."
  },
  "s0103": {
    "chinese": "不下，且屠豐。」",
    "literal": "If not submit, then will slaughter Feng.'",
    "idiomatic": "If you refuse, we'll massacre everyone in Feng.'"
  },
  "s0104": {
    "chinese": "雍齒雅不欲屬沛公，及魏招之，即反為魏守 豐。",
    "literal": "Yong Chi fundamentally did not wish to belong to Pei Lord, when Wei summoned him, immediately rebelled to guard Feng for Wei.",
    "idiomatic": "Yong Chi had never wanted to serve Lord Pei anyway. When Wei offered him the deal, he immediately defected and began defending Feng for Wei."
  },
  "s0105": {
    "chinese": "沛公攻豐，不能取。",
    "literal": "Pei Lord attacked Feng, could not take it.",
    "idiomatic": "Lord Pei attacked Feng but couldn't capture it."
  },
  "s0106": {
    "chinese": "沛公還之沛，怨雍齒與豐子弟畔之。",
    "literal": "Pei Lord returned to Pei, resented Yong Chi and Feng young men rebelling against him.",
    "idiomatic": "Lord Pei returned to Pei, resentful that Yong Chi and the young men of Feng had rebelled against him."
  },
  "s0107": {
    "chinese": "正月，張耳等立趙後趙歇為趙王。",
    "literal": "First month, Zhang Er and others established Zhao descendant Zhao Xie as Zhao King.",
    "idiomatic": "In the first month, Zhang Er and others installed Zhao Xie, a descendant of the Zhao royal family, as King of Zhao."
  },
  "s0108": {
    "chinese": "東陽甯君、秦嘉立景駒為楚王，在留。",
    "literal": "Dongyang Ning Jun, Qin Jia established Jing Ju as Chu King, located in Liu.",
    "idiomatic": "Lord Ning of Dongyang and Qin Jia installed Jing Ju as King of Chu, with his capital at Liu."
  },
  "s0109": {
    "chinese": "沛公往從之，道得張良，遂與俱 見景駒，請兵以攻豐。",
    "literal": "Pei Lord went to follow him, on the way obtained Zhang Liang, therefore together with him went to see Jing Ju, requested troops to attack Feng.",
    "idiomatic": "Lord Pei went to join him. Along the way he met Zhang Liang, and together they went to see King Jing Ju to request troops for attacking Feng."
  },
  "s0110": {
    "chinese": "時章邯從陳，別將司馬镛將兵北定楚地，屠相，至碭。",
    "literal": "At this time Zhang Han from Chen, separate general Sima Yi led troops north to pacify Chu territory, massacred Xiang, arrived at Dang.",
    "idiomatic": "At this time, Zhang Han was coming from Chen. His deputy general Sima Yi led troops north to pacify Chu territory, massacring the people of Xiang before reaching Dang."
  },
  "s0111": {
    "chinese": "東陽甯君、沛公引兵西，與戰蕭西，不利，還收兵聚留。",
    "literal": "Dongyang Ning Jun, Pei Lord led troops west, fought with them west of Xiao, unfavorable, returned collected troops gathered at Liu.",
    "idiomatic": "Lord Ning of Dongyang and Lord Pei led troops west and fought the enemy west of Xiao, but were defeated. They withdrew, gathered their troops, and concentrated at Liu."
  }
}
