{
  "s1123": "Hong Jia first year",
  "s1124": "Third month, Yu died.",
  "s1125": "Fourth month Geng Chen, Xue Xuan became chancellor.",
  "s191": "Guan Zhong Hou Shen Tu Jia became Imperial Secretary Grandee.",
  "s194": "Removed coin law, people could cast coins",
  "s200": "Deposed Huai Nan Wang, moved Yan Dao, died on road at Yong.",
  "s206": "Fourth month Bing Zi, first established Nan Ling.",
  "s212": "Grand Usher Ru Yin Hou Teng Gong died.",
  "s218": "Wen Shi bell self-rang. Made Zhi Yang xiang into Ba Ling.",
  "s221": "Imperial Secretary Grandee Jing.",
  "s224": "Feudal lords all arrived at Chang An.",
  "s230": "Emperor visited Dai. Earth shook.",
  "s236": "River burst Dong Jun Jin Di. Moved Huai Yang Wang to Liang Wang.",
  "s242": "Removed corporal punishment and field tax law, garrison troops command.",
  "s248": "Xiongnu greatly entered Xiao Guan, sent troops struck them, also garrisoned beside Chang An.",
  "s250": "Cheng Hou Dong Chi, Interior Li Luan Bu, Chang Hou Lu Qing, Long Lu Hou Zao, Ning Hou Chi all became generals, Dong Yang Hou Zhang Xiang Ru became Grand General, all struck Xiongnu. Commandant Zhou She, Lang Zhong Ling Zhang Wu all became generals, garrisoned beside Chang An.",
  "s254": "Yellow dragon appeared at Cheng Ji. Emperor first suburbanly saw Yong five emperors.",
  "s260": "Emperor first suburbanly saw Wei Yang five emperors.",
  "s265": "Later first year",
  "s266": "Second month, earth shook. Southwest夷反。",
  "s272": "Third month, earth shook. Southwest Yi rebelled.",
  "s273": "Fourth month, established Yueyang Commandery.",
  "s275": "Fifth month, earth shook.",
  "s278": "Sixth month, earth shook.",
  "s290": "Qi Xuan Gong Jiu Za first year",
  "s296": "Four. Divided Fan, Zhong Xing land with Zhi Bo.",
  "s298": "Fifth month, Zhi Bo died.",
  "s302": "Sixth month, Zhi Bo's clan fled.",
  "s304": "Han Kang Zi defeated Zhi Bo at Jin Yang.",
  "s537": "Grand General Qing struck Hu, captured Chan Yu's father Jian, mother阏氏, son。",
  "s542": "Fifth month, Grand General Qing returned, triumphant.",
  "s547": "Sixth month, amnesty.",
  "s554": "Four. Shu Zhang Chun assassinated Huai Gong. Crown prince died early, ministers established crown prince's son, became Ling Gong.",
  "s555": "Wei Dao Gong Wei first year.",
  "s556": "Thirty-three. Xiang Zi died.",
  "s557": "Qin Ling Gong first year. Gave birth to Xian Gong.",
  "s566": "Zhao Huan Zi first year.",
  "s572": "Two. Zheng You Gong first year. Han assassinated him.",
  "s573": "Zhao Xian Hou first year",
  "s574": "Three. Made upper lower zhi.",
  "s578": "Five. Wei assassinated Jin You Gong, established his younger brother Zhi.",
  "s580": "Six. Jin Lie Gong Zhi first year. Wei built Yong Liang city.",
  "s581": "Seven. Fought with Wei at Shao Liang.",
  "s583": "Three. Zheng established You Gong's son, became Xu Gong, first year.",
  "s587": "Eight. County established Pu, Lan Tian, Shan Ming Shi.",
  "s592": "Nine. Attacked Wei, not victorious.",
  "s619": "Ten. Repaired Pang, built Ji Gu city. Ling Gong died, established his younger uncle Dao Zi, became Jian Gong.",
  "s620": "Qin Jian Gong first year",
  "s626": "Eight. Built moat He river bank. First used jun lord wife river.",
  "s627": "Eight. Again built Shao Liang city.",
  "s635": "Eleven. Shu chancellor assassinated Shu Hou.",
  "s643": "Twelve. Southwest Yi rebelled, sent troops struck them.",
  "s647": "Thirteenth month, amnesty.",
  "s659": "Fourteenth month, amnesty.",
  "s664": "Fifteenth month, amnesty.",
  "s667": "Sixteenth month, amnesty.",
  "s683": "Seventeenth month, amnesty.",
  "s691": "Eighteenth month, amnesty."
}
