{
  "s0152": "Li Ji sent people placed poison in meat.",
  "s0153": "Resided two days, Xian Gong from hunt came returned, butcher presented meat to Xian Gong, Xian Gong wished eat it.",
  "s0154": "Li Ji from side stopped him, said: 'Meat from come far, should test it.'",
  "s0155": "Sacrificed ground, ground swelled;",
  "s0156": "gave dog, dog died;",
  "s0157": "gave small minister, small minister died.",
  "s0158": "Li Ji wept said: 'Crown prince why cruel!",
  "s0159": "His father wish assassinate replace him, moreover others?",
  "s0160": "Moreover lord old, morning evening person, once not able wait wish assassinate him!'",
  "s0161": "Told Xian Gong said: 'Crown prince so, not over concubine and Xi Qi reason.",
  "s0162": "Concubine wish mother son avoid other country, if early suicide, not make mother son become crown prince fish meat.",
  "s0163": "Initially lord wished abolish him, concubine still hated it;",
  "s0164": "to now, concubine especially self lost at this.'",
  "s0165": "Crown prince heard it, fled Xin Cheng.",
  "s0166": "Xian Gong angered, then executed his tutor Du Yuan Kuan.",
  "s0167": "Someone told crown prince said: 'Made this poison, Li Ji, crown prince why not self explain clarify it?'",
  "s0168": "Crown prince said: 'My lord old, without Li Ji, sleep not peaceful, eat not sweet.",
  "s0169": "If explain it, lord will anger her.",
  "s0170": "Not able.'",
  "s0171": "Someone told crown prince said: 'Can flee other country.'",
  "s0172": "Crown prince said: 'Bear this evil name exit, person who accept me?",
  "s0173": "I suicide.'",
  "s0174": "Twelfth month Wu Shen, Shen Sheng suicide at Xin Cheng.",
  "s0175": "This time Chong Er, Yi Wu came court.",
  "s0176": "Person or informed Li Ji said: 'Two gong zi resent Li Ji slandered killed crown prince.'",
  "s0177": "Li Ji feared, because slandered two gong zi: 'Shen Sheng poison meat, two gong zi knew it.'",
  "s0178": "Two sons heard it, feared, Chong Er fled Pu, Yi Wu fled Qu, protected their cities, self prepared defense.",
  "s0179": "Initially, Xian Gong sent Shi Kui for two gong zi build Pu, Qu cities, not completed.",
  "s0180": "Yi Wu with informed Gong, Gong angered Shi Kui.",
  "s0181": "Shi Kui apologized said: 'Border cities few bandits, why use them?'",
  "s0182": "Retired sang said: 'Fox fur thick, one country three ministers, I who follow!'",
  "s0183": "Finally completed cities.",
  "s0184": "And Shen Sheng died, two sons also returned protected their cities.",
  "s0185": "Twenty-second year, Xian Gong angered two sons not bid farewell left, indeed had plot, then sent troops attacked Pu.",
  "s0186": "Pu people's eunuch Bo Di commanded Chong Er quickly suicide.",
  "s0187": "Chong Er climbed wall, eunuch pursued cut his garment sleeve.",
  "s0188": "Chong Er then fled Di.",
  "s0189": "Sent people attack Qu, Qu city defended, not able descend.",
  "s0190": "This year, Jin again borrowed road at Yu to attack Guo.",
  "s0191": "Yu's grand master Gong Zhi Qi advised Yu lord said: 'Jin not able borrow road, this will extinguish Yu.'",
  "s0192": "Yu lord said: 'Jin my same surname, not suitable attack me.'",
  "s0193": "Gong Zhi Qi said: 'Tai Bo, Yu Zhong, Tai Wang sons, Tai Bo fled away, so not succeeded.",
  "s0194": "Guo Zhong, Guo Shu, Wang Ji sons, for Wen Wang ministers scholars, their merit records in wang chamber, stored in alliance repository.",
  "s0195": "Will Guo extinguished, what cherish Yu?",
  "s0196": "Moreover Yu close able closer than Huan, Zhuang clans?",
  "s0197": "Huan, Zhuang clans what crime, completely extinguished them.",
  "s0198": "Yu with Guo, lips with teeth, lips perished then teeth cold.'",
  "s0199": "Yu Gong not listened, then permitted Jin.",
  "s0200": "Gong Zhi Qi with his clan left Yu."
}
