{
  "s201": "As attendant followed uprising in Dang, to Baxiang, became Changwen Jun. Entered Han, pacified Three Qins, received fief. As chariot cavalry general attached to Han Xin, pacified Qi, Huainan and Xia Yi, killed Xiang Ji, became marquis, 5,000 households.",
  "s202": "Seven. Year 6 month 1 Bing Wu day, Marquis Yi Guan Ying year 1.",
  "s203": "Seven",
  "s204": "Eight",
  "s205": "Four. Year 1, became Grand Commandant; year 3, became Chancellor. Nineteen. Year 5, Marquis Ping He year 1.",
  "s206": "Nine. Seven. Zhong year 3, Marquis Qiang year 1.",
  "s207": "Six. Committed crime, extinct. Nine. Yuanguang year 2, enfeoffed Ying's grandson Xian as Marquis of Linru. Marquis Xian year 1. Yuanshuo year 5, Marquis Xian convicted of bribery, state abolished.",
  "s208": "Nine",
  "s209": "Fen Yin.",
  "s210": "Initially rose using official position to attack and break Qin, entered Han, exited passes, as Interior Minister firmly defended Aocang, as Grand Master of the Court pacified various lords, comparable to Marquis of Qingyang, 2,800 households.",
  "s211": "Seven. Year 6 month 1 Bing Wu day, Marquis Dao Zhou Chang year 1.",
  "s212": "Three. Jianping four. Year 4, Marquis Ai Kai Fang year 1.",
  "s213": "Eight",
  "s214": "Four. Year 5 BCE, Marquis Yi year 1. Thirteen. Committed crime, extinct.",
  "s215": "Anyang eight. Zhong year 2, enfeoffed Chang's grandson Zuo Che.",
  "s216": "Jianyuan year 1, committed crime, state abolished.",
  "s217": "Sixteen",
  "s218": "Liang Zou.",
  "s219": "Troops initially rose, as ye zhe followed attacking and breaking Qin, entered Han, as general pacified various lords with merit, comparable to Marquis of Boyang, 2,800 households.",
  "s220": "Seven. Year 6 month 1 Bing Wu day, Marquis Xiao Wu Ru year 1.",
  "s221": "Four. Three. Year 5, Marquis Zui year 1.",
  "s222": "Eight",
  "s223": "Twenty-three",
  "s224": "Sixteen",
  "s225": "Six. Yuanguang year 1, Marquis Qing Ying Qi year 1. Three. Yuanguang year 4, Marquis Shan Fu year 1. Twenty. Yuanding year 5, Marquis Shan Fu convicted of tribute gold, state abolished.",
  "s226": "Twenty",
  "s227": "Cheng.",
  "s228": "Troops initially rose, as retainer followed attacking Qin, became commandery captain; entered Han, pacified Three Qins. Exited passes, as general pacified various lords with merit, comparable to Marquis of Yanci, 2,800 households.",
  "s229": "Seven. Year 6 month 1 Bing Wu day, Marquis Jing Dong Xi year 1.",
  "s230": "Seven. Year 1, Marquis Kang Chi year 1.",
  "s231": "Eight",
  "s232": "Twenty-three",
  "s233": "Six. Committed crime, extinct. Jie clan five. Zhong year 5, re-enfeoffed Marquis Kang Chi year 1.",
  "s234": "Three. Jianyuan year 4, Marquis Gong Ba Jun year 1. Five. Yuanguang year 3, Marquis Chao year 1. Twelve. Yuanshou year 3, Marquis Chao as Grand Administrator of Jinan, consorted with King of Chengyang's daughter, disrespectful, state abolished.",
  "s235": "Twenty-five",
  "s236": "Liao.",
  "s237": "As shield bearer year 1 BCE followed uprising in Dang, as Left Sima entered Han, became general, three times as commandery captain attacked Xiang Yu, attached to Han Xin, meritorious service led to marquisate.",
  "s238": "Seven. Year 6 month 1 Bing Wu day, Marquis Kong Cong year 1.",
  "s239": "Seven",
  "s240": "Eight",
  "s241": "Eight. Fifteen. Year 9, Marquis Zang year 1.",
  "s242": "Sixteen",
  "s243": "Fourteen. Yuanshuo year 3, Marquis Zang as Grand Master of Ceremonies, Nanling bridge broken, robes and hats carriage could not cross, state abolished.",
  "s244": "Thirty",
  "s245": "Fei.",
  "s246": "As retainer year 1 BCE followed uprising in Dang, as Left Sima entered Han, as commandery captain attached to Han Xin, attacked Xiang Yu with merit, became general, pacified Kuaiji, Zhejiang, Huyang, became marquis.",
  "s247": "Seven. Year 6 month 1 Bing Wu day, Marquis Yu Chen He year 1.",
  "s248": "Seven",
  "s249": "Eight",
  "s250": "Twenty-three. Year 1, Marquis Gong Chang year 1."
}
