{
  "s0201": "Therefore the Chu army night attacked and buried alive over 200,000 Qin soldiers south of Xin'an city.",
  "s0202": "Then proceeded to pacify Qin territory.",
  "s0203": "Hangu Pass had troops guarding the pass, could not enter.",
  "s0204": "He also heard Liu Bang had already taken Xianyang, Xiang Yu greatly angered, sent Dangyang Jun and others to attack the pass.",
  "s0205": "Xiang Yu then entered, reached Xi west.",
  "s0206": "Liu Bang's army was at Bashang, could not meet with Xiang Yu.",
  "s0207": "Liu Bang's Left Marshal Cao Wushang sent someone to speak to Xiang Yu saying: 'Liu Bang wishes to be king of Guanzhong, make Ziying prime minister, all precious treasures will belong to you.'",
  "s0208": "Xiang Yu greatly angered, said: 'Tomorrow feast the soldiers, to attack and defeat Liu Bang's army!'",
  "s0209": "At this time, Xiang Yu had 400,000 troops, at Xinfeng Hongmen, Liu Bang had 100,000 troops, at Bashang.",
  "s0210": "Fan Zeng advised Xiang Yu saying: 'When Liu Bang was in Shandong, greedy for wealth and goods, fond of beautiful women.",
  "s0211": "Now entered the pass, wealth and goods he takes nothing, women he does not favor, this shows his ambitions are not small.",
  "s0212": "Please kill him quickly, do not delay.'",
  "s0213": "Xiang Yu said: 'Don't kill him.'",
  "s0215": "Fan Zeng sent Xiang Zhuang to banquet in the army tent, to make Xiang Zhuang dance with sword, take opportunity to strike Liu Bang.",
  "s0216": "Xiang Zhuang danced with sword, Xiang Yu rose and toasted, saying: 'The prince cannot dance.'",
  "s0217": "Xiang Zhuang then stopped.",
  "s0218": "Fan Zeng beckoned the waiter to come, wished to strike the jade ring as signal to attack.",
  "s0219": "The waiter understood, struck the jade ring.",
  "s0220": "Xiang Bo saw this, went out and told Zhang Liang.",
  "s0221": "Zhang Liang went in and told Liu Bang.",
  "s0222": "Liu Bang said: 'What to do?'",
  "s0223": "Zhang Liang said: 'Let me go out first.'",
  "s0224": "Zhang Liang went out, Fan Zeng entered, saw Liu Bang still sitting calmly drinking.",
  "s0225": "Fan Zeng said: 'The prince is brave!'",
  "s0226": "Then went out, called Xiang Zhuang to enter.",
  "s0227": "Xiang Zhuang entered, Fan Zeng blocked the door and said: 'The prince wishes to give you a sword dance.'",
  "s0228": "Xiang Zhuang danced with sword, Fan Zeng wished to strike Liu Bang.",
  "s0229": "Xiang Zhuang hesitated.",
  "s0230": "Liu Bang rose to relieve himself, wished to leave.",
  "s0231": "Fan Kuai said: 'Now the matter is urgent, let me go in and protect.'",
  "s0232": "Fan Kuai carried a sword and shield, entered the tent, sat with back to the wall, glared at Xiang Zhuang.",
  "s0233": "Xiang Zhuang stopped dancing.",
  "s0234": "Fan Kuai scolded Xiang Yu saying: 'My lord established you as king, you received the Chu king's order to attack Qin, now Qin is destroyed, you should divide the land to enfeoff the princes.",
  "s0235": "Now you wish to kill the meritorious, this is the way to destroy Chu.'",
  "s0236": "Xiang Yu could not reply, said: 'Sit and drink.'",
  "s0237": "Fan Kuai sat and drank with Liu Bang.",
  "s0238": "Liu Bang left to relieve himself, Fan Kuai followed out.",
  "s0239": "Liu Bang said: 'The matter is urgent, I cannot return.'",
  "s0240": "He called Zhang Liang to stay, gave him white jade ring as thanks to Xiang Yu.",
  "s0241": "Liu Bang rode alone, fled through Xiaopi.",
  "s0242": "Zhang Liang entered, Xiang Yu asked where Liu Bang was.",
  "s0243": "Zhang Liang said: 'He left suddenly, saying he had urgent business.'",
  "s0244": "Xiang Yu said: 'The prince is polite.'",
  "s0245": "Then gave the white jade ring to Zhang Liang.",
  "s0246": "Xiang Yu camped at Hongmen, Liu Bang camped at Bashang.",
  "s0247": "Xiang Yu made Liu Bang king of Han, with Bashang as capital.",
  "s0248": "Xiang Yu then returned east.",
  "s0249": "King Huai of Chu heard Xiang Yu had made kings in the west, was angry, wished to attack Xiang Yu.",
  "s0250": "Xiang Yu heard this, sent Ying Bu to kill King Huai at Chen, buried him at Yinling.",
  "s0251": "Xiang Yu then summoned the princes to Jibei to swear alliance.",
  "s0252": "He made Tian Rong king of Qi, with Linzi as capital.",
  "s0253": "Made Peng Yue king of Liang, with Xiapei as capital.",
  "s0254": "Made Han Xin king of Chu, with Chu as capital.",
  "s0255": "Made Ying Bu king of Jiujiang, with Jiujiang as capital.",
  "s0256": "Made Wu Rui king of Hengshan, with Hengshan as capital.",
  "s0257": "Made Gong Ao king of Linhuai, with Linhuai as capital.",
  "s0258": "Made Zang Tu king of Yan, with Yan as capital.",
  "s0259": "Made Zhang Er king of Changshan, with Changshan as capital.",
  "s0260": "Made Wei Bao king of Wei, with Pingyang as capital.",
  "s0261": "Made Sima Ang king of Dai, with Dai as capital."
}