{
  "s0199": "Therefore merchants middle families above generally broke, people secretly sweet food good clothing, not engaged in storing wealth property, county officials from salt iron string money reason, use increasingly abundant.",
  "s0200": "Additionally widened passes, established left right auxiliaries.",
  "s0201": "Initially, great agronomist managed salt iron officials spread many, established water balance, wished to oversee salt iron;",
  "s0202": "when Yang Ke informed string money, Shanglin wealth goods many, ordered water balance oversee Shanglin.",
  "s0203": "Shanglin already full, additionally widened.",
  "s0204": "At this time Yue wished with Han use ships battle pursue, greatly repaired Kunming Pool, viewing towers surrounded it.",
  "s0205": "Made tower ships, high ten plus zhang, banners flags added above, very grand.",
  "s0206": "Therefore emperor moved by it, made Bai Liang Terrace, high several tens zhang.",
  "s0207": "Palace chambers repair, from this daily beautiful.",
  "s0208": "Then divided string money various officials, water balance, lesser treasury, great agronomist, great stable each established farm officials, often near commanderies counties seized entered fields field them.",
  "s0209": "Their confiscated slaves girls, divided various parks raise dogs horses birds beasts, and with various officials.",
  "s0210": "Various officials increasingly mixed established many, convict slaves girls many, lower river transport passed four million shi, officials self bought then sufficient.",
  "s0211": "Shou Zhong said: 'World families sons rich people or fight chickens run dogs horses, hawk hunt gamble play, disorder proper people.'",
  "s0212": "Then conscripted various violators order, mutually implicated several thousand, named 'root send convicts'.",
  "s0213": "Entering wealth got supplement gentlemen, gentlemen selection declined.",
  "s0214": "At this time Shandong suffered river disasters, years not bountiful several years, people mutually ate each other, side one two thousand li.",
  "s0215": "Emperor pitied them, edict: 'Jiangnan fire farm water weed, order famine people able flow go eat between Yangtze Huai, wish stay, stay place.'",
  "s0216": "Sent envoys official carriages mutually connected on road, protected them, sent down Ba Shu grain to relieve them.",
  "s0217": "Next year, emperor began tour commanderies kingdoms.",
  "s0218": "East crossed Yellow River, Hedong governor not expected travel arrived, not prepared, committed suicide.",
  "s0219": "Went west passed Long, Longxi governor with travel toward troops, emperor following officials could not eat, Longxi governor committed suicide.",
  "s0220": "Therefore emperor north out Xiao Pass, followed tens of thousands cavalry, hunted new Qinzhong, to restrain border troops and return.",
  "s0221": "New Qinzhong some thousand li no pavilion outpost, executed north land governor below, ordered people able raise livestock border counties, officials loaned mare mothers, three years return, and interest ten percent, to eliminate inform string money, use fill inhabit new Qinzhong.",
  "s0222": "Having obtained precious ding, established Hou Tu, Tai Yi sacrifices, ministers discussed feng shan affairs, realm commanderies kingdoms all prepared treat roads bridges, repaired old palaces, to current relay road counties, counties prepared official stores, set up supplies, gazed to await fortunate.",
  "s0223": "Next year, Nanyue rebelled, western Qiang invaded borders as bandits.",
  "s0224": "Therefore emperor for Shandong not sufficient, pardoned realm prisoners, took southern tower ship troops over twenty thousand attacked Nanyue, several thousand sent Sanhe west cavalry attacked western Qiang, again several thousand crossed Yellow River built Ling Ju.",
  "s0225": "Initially established Zhangye, Jiuquan commanderies, Shangjun, Shuofang, Xihe, Hexi opened field officials, drove border troops sixty thousand garrison field them.",
  "s0226": "China repaired roads sent grain, far three thousand, near thousand plus li, all dependent on great agronomist.",
  "s0227": "Border troops insufficient, took military warehouse artisan official weapons to support them.",
  "s0228": "Chariots cavalry horses exhausted, county official money few, buy horses difficult obtain, issued order, ordered enfeoffed lords below to three hundred shi above officials, by grade send mares realm pavilions, pavilions have raise mares, yearly assess interest.",
  "s0229": "Qi chancellor Bu Shi memorialed: 'Minister heard lord worries minister disgraces.",
  "s0230": "Nanyue rebels, minister wishes father son with Qi practice ships go die them.'",
  "s0231": "Emperor issued edict: 'Bu Shi though personally farms pastures, not for profit, surplus then aids county officials use.",
  "s0232": "Now realm unfortunately has emergency, Shi arouses wishes father son die it, though not fought, can call righteousness shaped within.",
  "s0233": "Granted nobility Guan Nei Hou, gold sixty jin, fields ten qing.'",
  "s0234": "Cloth announced realm, realm none responded.",
  "s0235": "Marquises counted in hundreds, all not sought from army attack Qiang, Yue.",
  "s0236": "To wine offering, lesser treasury reduced gold, marquises sat wine gold lost marquis over one hundred people.",
  "s0237": "Appointed Shi as censor-in-chief.",
  "s0238": "Shi already in position, saw commanderies kingdoms many inconvenient county officials make salt iron, iron utensils bitter bad, merchants expensive, or forced ordered people buy sell them.",
  "s0239": "Boats had tax, merchants few, goods expensive, took Kong Jin speak boat tax affairs.",
  "s0240": "Emperor from this not pleased Bu Shi.",
  "s0241": "Han connected troops three years, punished Qiang, extinguished Nanyue, Panyu west to Shu south established initial commanderies seventeen, moreover with their old customs governed, no taxes.",
  "s0242": "Nanyang, Hanzhong past commanderies, each by land proportion supplied initial commanderies officials troops support food currency objects, relay carriages horses coverings equipment.",
  "s0243": "Initial commanderies often small rebelled, killed officials, Han sent southern officials troops go punish them, between years ten thousand plus people, expenses all dependent great agronomist.",
  "s0244": "Great agronomist with equal transport adjusted salt iron aided taxes, therefore could support them.",
  "s0245": "But troops passed counties, only with wealth supply no lacking, dared not speak privately tax laws.",
  "s0246": "Next year, Yuan Feng first year, Bu Shi demoted rank as crown prince great tutor.",
  "s0247": "Sang Hong Yang as govern grain capital commander, led great agronomist, completely replaced Jin managed realm salt iron.",
  "s0248": "Hong Yang because various officials each market themselves, mutually contended, goods therefore soared jumped, realm taxes transport or not repaid their hire expenses, requested establish great agronomist division vice several tens, divided divisions oversee commanderies kingdoms, each often counties established equal transport salt iron officials, ordered distant places each with their goods expensive time merchants traders transported sold as taxes, mutually irrigated transported.",
  "s0249": "Established equal standard in capital, all received realm consignments.",
  "s0250": "Summoned artisan officials make carriages various utensils, all dependent great agronomist.",
  "s0251": "Great agronomist's various officials all caged realm goods objects, expensive then sold them, cheap then bought them.",
  "s0252": "Thus, rich merchants great traders no place seek great profit, then returned to fundamentals, ten thousand things not able soar jump.",
  "s0253": "Therefore suppressed realm goods, named 'equal standard'.",
  "s0254": "Emperor considered correct, permitted it.",
  "s0255": "Therefore emperor north to Shuofang, east to Tai Shan, toured sea, along northern border returned.",
  "s0256": "Passed rewarded granted, used silk over one hundred thousand pieces, money gold counted vast millions, all took sufficient from great agronomist.",
  "s0257": "Hong Yang moreover requested order officials able enter grain supplement officials, criminals redeem crimes.",
  "s0258": "Ordered people able enter grain Ganquan each have differences, to exempt lifetime, not inform string money.",
  "s0259": "Other commanderies each transported urgent places, various farmers each delivered grain, Shandong transport additionally yearly six million shi.",
  "s0260": "One year within, great granary, Ganquan granary full.",
  "s0261": "Border surplus grain various goods equal transport silk five million pieces.",
  "s0262": "People not increased taxes but realm use abundant.",
  "s0263": "Therefore Hong Yang granted nobility left commoner, gold two hundred jin.",
  "s0264": "This year small drought, emperor ordered officials seek rain, Bu Shi said: 'County officials should eat rents wear taxes only, now Hong Yang makes officials sit market rows stores, vend goods seek profit.",
  "s0265": "Cook Hong Yang, heaven then rains.'",
  "s0267": "Grand Historian says: Farmer craftsman merchant exchange roads connected, turtle shells cowries gold money knife cloth currency arose.",
  "s0268": "Source came long distant, from Gao Xin Shi before still, cannot obtain record.",
  "s0269": "Therefore Classic wrote Tang Yu time, Poetry described Yin Zhou age, peaceful then long schools, first fundamentals last branches, with rites righteousness defended against profit;",
  "s0270": "affairs changed many troubles then also opposite.",
  "s0271": "Therefore things flourish then decline, time extreme then turn, one substance one pattern, beginning end changes.",
  "s0272": "Yu Gong nine provinces, each followed their land suitable, people many few delivered duties.",
  "s0273": "Tang Wu received exhaustion easily changed, made people not tired, each diligent so governed, gradually declined weakened.",
  "s0274": "Qi Huan Gong used Guan Zhong strategy, passed light heavy authority, seized mountains seas occupations, to make feudal lords court, used small small Qi displayed completed hegemon name.",
  "s0275": "Wei used Li Ke, exhausted land strength, became strong lord.",
  "s0276": "From this after, realm contended Warring States, honored deception force despised benevolence righteousness, first wealthy then yielded.",
  "s0277": "Therefore common people rich sometimes accumulated vast millions, poor sometimes not satisfied chaff bran;",
  "s0278": "having country strong sometimes annexed small groups to subject feudal lords, weak countries sometimes cut sacrifices extinguished generations.",
  "s0279": "To Qin, finally unified within seas.",
  "s0280": "Yu Xia currency, gold three grades, or yellow, or white, or red;",
  "s0281": "or money, or cloth, or knife, or turtle cowries.",
  "s0282": "To Qin, unified country's currency two grades, gold with overflow named, upper currency;",
  "s0283": "copper money marked half liang, heavy like inscription, lower currency.",
  "s0284": "Pearl jade, turtle cowries, silver tin kinds as utensil decorations treasures storage, not currency.",
  "s0285": "But each followed time light heavy no constant.",
  "s0286": "Therefore externally expelled barbarians, internally raised achievements, within seas scholars labored farmed insufficient food clothing, women spun wove insufficient clothing.",
  "s0287": "Ancient often exhausted realm wealth to serve above, still self considered insufficient.",
  "s0288": "No different so say, affairs trends flow, mutually stimulated made so, why sufficient strange."
}
