{
  "s0449": "Day sees and passes heaven, this called contend bright, strong states weak, small states strong, female lord prospers.",
  "s0450": "Kang is sparse temple, Tai Bai temple.",
  "s0451": "Tai Bai, great minister, its title upper duke.",
  "s0452": "Other names Yin Star, Tai Zheng, Ying Star, Guan Star, Gong Star, Ming Star, Da Shuai, Da Ze, Zhong Star, Da Xiang, Tian Hao, Xu Star, Yue Wei.",
  "s0453": "Great Marshal position carefully waits this.",
  "s0454": "Observe sun Chen meeting, to govern Chen Star position.",
  "s0455": "Called northern water, Tai Yin essence, governs winter, called Ren, Gui.",
  "s0456": "Punishment lost, punishment exits Chen Star, with its lodge determines state.",
  "s0457": "This rectifies four seasons: mid spring spring equinox, evening out suburbs Kui Lou Wei east five lodges, for Qi;",
  "s0458": "Mid summer summer solstice, evening out suburbs Dong Jing Yu Gui Liu east seven lodges, for Chu;",
  "s0459": "Mid autumn autumn equinox, evening out suburbs Jue Kang Di Fang east four lodges, for Han;",
  "s0460": "Mid winter winter solstice, morning out suburbs eastern, with Wei Ji Dou Qian Niu together west, for central states.",
  "s0461": "Its enter exit constantly with Chen Xu Chou Wei.",
  "s0462": "Its early, for moon eclipse;",
  "s0463": "Late, for comet and heaven premature.",
  "s0464": "Its time should appear not appear for lost, pursuing troops outside not battle.",
  "s0465": "One season not out, its season not harmonious;",
  "s0466": "Four seasons not out, all under heaven great famine.",
  "s0467": "Its should appear and out, color white for drought, yellow for five grains ripe, red for troops, black for water.",
  "s0468": "Out eastern, great and white, has troops at outside, resolves.",
  "s0469": "Constantly in eastern, its red, central states victorious;",
  "s0470": "Its west and red, outer states benefit.",
  "s0471": "No troops at outside and red, troops arise.",
  "s0472": "Its with Tai Bai together out eastern, both red and horns, outer states greatly defeated, central states victorious;",
  "s0473": "Its with Tai Bai together out western, both red and horns, outer states benefit.",
  "s0474": "Five stars divide heaven midst, accumulate at eastern, central states benefit;",
  "s0475": "Accumulate at western, outer states use troops benefit.",
  "s0476": "Five stars all follow Chen Star and gather at one lodge, its lodges state can with law bring all under heaven.",
  "s0477": "Chen Star not out, Tai Bai as guest;",
  "s0478": "Its out, Tai Bai as host.",
  "s0479": "Out and with Tai Bai not follow, fields though have army, not battle.",
  "s0480": "Out eastern, Tai Bai out western;",
  "s0481": "If out western, Tai Bai out eastern, for Ge, fields though have troops not battle.",
  "s0482": "Loses its time and out, for should cold contrary warm, should warm contrary cold.",
  "s0483": "Should out not out, this called strike troops, troops greatly arise.",
  "s0484": "Its enters Tai Bai midst and rises out, breaks army kills general, guest army victorious;",
  "s0485": "Down out, guest loses land.",
  "s0486": "Chen Star comes opposes Tai Bai, Tai Bai not goes, general dies.",
  "s0487": "Straight flag rises out, breaks army kills general, guest victorious;",
  "s0488": "Down out, guest loses land.",
  "s0489": "Observe flag pointed, to determine broken army.",
  "s0490": "Its circles Tai Bai, if with fights, great battle, guest victorious.",
  "s0491": "Rabbit passes Tai Bai, between can measure sword, small battle, guest victorious.",
  "s0492": "Rabbit dwells Tai Bai front, army stops;",
  "s0493": "Out Tai Bai left, small battle;",
  "s0494": "Grinds Tai Bai, has several ten thousand people battle, host officials die;",
  "s0495": "Out Tai Bai right, goes three chi, army urgent close battle.",
  "s0496": "Blue horns, troops worry;",
  "s0497": "Black horns, water.",
  "s0498": "Red goes exhausted troops place ends."
}
