{
  "s715": "Six. Year 7 month 10 Wu Chen day, Marquis Jing Xu Wen year 1.",
  "s716": "Seven",
  "s717": "One. Year 2, committed crime, extinct. Six. Year 3, re-enfeoffed Wen as before.",
  "s718": "Fourteen. Year 1, Marquis Jian Lu year 1. Nine. Year 15, Marquis Ai Chang year 1.",
  "s719": "Sixteen",
  "s720": "Seven. Yuanguang year 2, Marquis Gong An Ru year 1. Thirteen. Yuanshou year 3, Marquis Fu year 1. Five. Yuanding year 2, Marquis Fu committed crime, state abolished.",
  "s721": "Fifty-eight",
  "s722": "Zhong Shui.",
  "s723": "As palace attendant cavalry general Han King year 1 followed uprising in Haozhi, as Sima attacked Long Qu, again together beheaded Xiang Yu, became marquis, 1,500 households.",
  "s724": "Six. Year 7 month 1 Ji You day, Marquis Zhuang Lü Ma Tong year 1.",
  "s725": "Seven",
  "s726": "Eight",
  "s727": "Nine. Three. Year 10, Marquis Yi Jia year 1. Eleven. Year 13, Marquis Gong Qing Jian year 1.",
  "s728": "Sixteen",
  "s729": "Five. Jianyuan year 6, Marquis Jing De year 1. One. Yuanguang year 1, Marquis Yi Cheng year 1. Twenty-three. Yuanding year 5, Yi Cheng convicted of tribute gold, state abolished.",
  "s730": "One hundred one",
  "s731": "Duyan.",
  "s732": "As palace attendant cavalry Han King year 3 followed uprising in Xiapi, attached to Han Xin, followed Guan Ying together beheaded Xiang Yu, became marquis, 1,700 households.",
  "s733": "Six. Year 7 month 1 Ji You day, Marquis Zhuang Wang Yi year 1.",
  "s734": "Seven",
  "s735": "Five. Three. Year 6, Marquis Gong Fu year 1.",
  "s736": "Four. Seven. Year 5, Marquis Shi Chen year 1. Twelve. Year 12, Marquis Xi year 1.",
  "s737": "Twelve. Committed crime, extinct. Three. After year 1, re-enfeoffed Yi's son Marquis Qiang Ying Ren year 1.",
  "s738": "Nine. Yuanguang year 4, Marquis Ding Guo year 1. Twelve. Yuanshou year 4, Marquis Ding Guo committed crime, state abolished.",
  "s739": "One hundred two",
  "s740": "Chiquan.",
  "s741": "As palace attendant cavalry Han King year 2 followed uprising in Du, attached to Han Xin, later followed Guan Ying together beheaded Xiang Yu, became marquis, 1,900 households.",
  "s742": "Six. Year 7 month 1 Ji You day, Marquis Zhuang Yang Xi year 1.",
  "s743": "Seven",
  "s744": "Year 1, deprived, extinct. Seven. Year 2, re-enfeoffed.",
  "s745": "Eleven. Twelve. Year 12, Marquis Ding Yin year 1.",
  "s746": "Three. Year 4, Marquis Wu Hai year 1. Six. Committed crime, extinct. Linru five. Zhong year 5, re-enfeoffed Marquis Wu Hai year 1.",
  "s747": "Seven. Yuanguang year 2, Marquis Wu Hai committed crime, state abolished.",
  "s748": "One hundred three",
  "s749": " Xun.",
  "s750": "As Yan general Han King year 4 followed Cao Jiu's army, became Yan chancellor, reported Yan King Tea rebellion, became marquis, as Yan chancellor pacified Lunü, 1,900 households.",
  "s751": "Five. Year 8 month 10 Bing Chen day, Marquis Qing Wen Jie year 1.",
  "s752": "Seven",
  "s753": "Eight",
  "s754": "Five. Seventeen. Year 6, Marquis Wen Ren year 1. One. After year 7, Marquis He year 1.",
  "s755": "Ten. Zhong year 4, Marquis He committed crime, state abolished.",
  "s757": "Ninety-one",
  "s758": "Wuyuan.",
  "s759": "Han year 7, as Liang general initially followed attacking Han Xin, Chen Xi, Qing Bu with merit, became marquis, 2,800 households, meritorious service comparable to Gaoling.",
  "s760": "Five. Year 8 month 12 Ding Wei day, Marquis Jing Wei Qu year 1.",
  "s761": "Three. Four. Year 4, Marquis Gong Ji year 1.",
  "s762": "Eight",
  "s763": "Twenty-three",
  "s764": "Three. Year 4, Marquis Bu Hai year 1. Thirteen. After year 2, Bu Hai convicted of burial violating laws, state abolished.",
  "s766": "Ninety-three"
}
