{
  "s0051": {
    "literal": "Position above the Three Dukes.",
    "idiomatic": "Ranked above the Three Dukes."
  },
  "s0052": {
    "literal": "Grand Preceptor and Grand Guardian were both ancient offices, both first established in the first year of Yuanshi under Emperor Ping, with gold seals and purple ribbons.",
    "idiomatic": "The Grand Preceptor and Grand Guardian were both ancient offices, first established together in the first year of Yuanshi during Emperor Ping's reign, with gold seals and purple ribbons."
  },
  "s0053": {
    "literal": "Grand Preceptor ranked above Grand Tutor, Grand Guardian below Grand Tutor.",
    "idiomatic": "The Grand Preceptor ranked above the Grand Tutor, the Grand Guardian below the Grand Tutor."
  },
  "s0054": {
    "literal": "Front, rear, left, and right generals were all offices from the end of Zhou, Qin continued them, ranked as senior ministers, with gold seals and purple ribbons.",
    "idiomatic": "The generals of the front, rear, left, and right were all offices from the late Zhou period. Qin continued them, ranking them as senior ministers with gold seals and purple ribbons."
  },
  "s0055": {
    "literal": "Han did not constantly establish them, sometimes having front and rear, sometimes left and right, all overseeing troops and the four barbarians.",
    "idiomatic": "Han did not maintain them permanently—sometimes there were front and rear generals, sometimes left and right generals—all overseeing military forces and the four barbarian regions."
  },
  "s0056": {
    "literal": "They have a chief clerk, ranked at 1,000 bushels.",
    "idiomatic": "They each have a chief clerk with a salary of 1,000 bushels."
  },
  "s0057": {
    "literal": "Minister of Ceremonies was a Qin office, overseeing ancestral temples and rituals, has an assistant.",
    "idiomatic": "The Minister of Ceremonies was a Qin office overseeing ancestral temples and ceremonies, with an assistant."
  },
  "s0058": {
    "literal": "In the sixth year of Jingdi's middle reign, renamed Grand Minister of Ceremonies.",
    "idiomatic": "In the sixth year of Emperor Jing's middle reign, it was renamed Grand Minister of Ceremonies."
  },
  "s0059": {
    "literal": "Subordinate officials include the directors of Grand Music, Grand Sacrifices, Grand Steward, Grand Scribe, Grand Diviner, Grand Physician—six directors with assistants; also the directors of Equalization and Capital Waters—two chiefs with assistants; also the directors and chiefs of various temple sleeping quarters and gardens food supplies; the assistant to the Grand Steward of the Grain Storage, assistant to the Grand Sacrificer; each of the five altars has one captain...",
    "idiomatic": "Subordinate officials include six directors with assistants: Grand Music, Grand Sacrifices, Grand Steward, Grand Scribe, Grand Diviner, and Grand Physician. Also two chiefs with assistants: Equalization and Capital Waters. Plus directors and chiefs of food supplies for various temple sleeping quarters and gardens. Also assistants to the Grand Steward of Grain Storage and Grand Sacrificer. Each of the five altars has one captain..."
  },
  "s0060": {
    "literal": "Also the Erudites and all imperial tomb counties are subordinate to it.",
    "idiomatic": "The Erudites and all imperial tomb counties are also subordinate to it."
  },
  "s0061": {
    "literal": "In the sixth year of Jingdi's middle reign, Grand Sacrificer was renamed Sacrifices; in the first year of Wudi's Taichu, changed to Temple Sacrifices; initially established Grand Diviner.",
    "idiomatic": "In the sixth year of Emperor Jing's middle reign, the Grand Sacrificer was renamed Sacrifices Department. In the first year of Emperor Wu's Taichu reign, it was changed to Temple Sacrifices. The Grand Diviner was initially established."
  },
  "s0062": {
    "literal": "Erudites were a Qin office, overseeing knowledge of ancient and modern, ranked at 600 bushels equivalent, members up to several dozen people.",
    "idiomatic": "The Erudites were a Qin office overseeing knowledge of ancient and modern affairs, with a salary equivalent to 600 bushels. Their number reached up to several dozen people."
  },
  "s0063": {
    "literal": "In the fifth year of Wudi's Jianyuan, initially established Five Classics Erudites; in the first year of Xuandi's Huanglong, gradually increased to twelve people.",
    "idiomatic": "In the fifth year of Emperor Wu's Jianyuan reign, the Five Classics Erudites were initially established. In the first year of Emperor Xuan's Huanglong reign, their number was gradually increased to twelve."
  },
  "s0064": {
    "literal": "In the first year of Yuandi's Yongguang, divided the various tomb districts to belong to the Three Adjuncts.",
    "idiomatic": "In the first year of Emperor Yuan's Yongguang reign, the various imperial tomb districts were divided to belong to the Three Adjuncts."
  },
  "s0065": {
    "literal": "Wang Mang changed Grand Minister of Ceremonies to Director of the Ancestral Temples.",
    "idiomatic": "Wang Mang changed the Grand Minister of Ceremonies to Director of the Ancestral Temples."
  },
  "s0066": {
    "literal": "Commander of the Gentlemen was a Qin office, overseeing palace halls and side gates and doors, has an assistant.",
    "idiomatic": "The Commander of the Gentlemen was a Qin office overseeing palace halls, side gates, and doors, with an assistant."
  },
  "s0067": {
    "literal": "In the first year of Wudi's Taichu, renamed Brilliant Splendor Excellency.",
    "idiomatic": "In the first year of Emperor Wu's Taichu reign, it was renamed Brilliant Splendor Excellency."
  },
  "s0068": {
    "literal": "Subordinate officials include Grandees, Gentlemen, and Receptionists, all Qin offices.",
    "idiomatic": "Subordinate officials include the Grandees, Gentlemen, and Receptionists—all Qin offices."
  },
  "s0069": {
    "literal": "Also the Palace Gate and Feather Forest are subordinate to it.",
    "idiomatic": "The Palace Gate guards and Feather Forest guards are also subordinate to it."
  },
  "s0070": {
    "literal": "Grandees oversee discussion and debate, including Grand Palace Grandee, Palace Grandee, Remonstrance Grandee, all without fixed number, up to several dozen people.",
    "idiomatic": "The Grandees oversee discussion and debate, including Grand Palace Grandees, Palace Grandees, and Remonstrance Grandees. All have no fixed number, reaching up to several dozen people."
  }
}
