{
  "s0001": "Guan Shu Xian, Cai Shu Du, Zhou Wen Wang sons and Wu Wang younger brothers.",
  "s0002": "Wu Wang same mother brothers ten people.",
  "s0003": "Mother called Tai Si, Wen Wang proper wife.",
  "s0004": "Its eldest son called Bo Yi Kao, next Wu Wang Fa, next Guan Shu Xian, next Zhou Gong Dan, next Cai Shu Du, next Cao Shu Zhen Duo, next Cheng Shu Wu, next Huo Shu Chu, next Kang Shu Feng, next Ran Ji Zai.",
  "s0005": "Ran Ji Zai most young.",
  "s0006": "Same mother elder younger brothers ten people, only Fa, Dan worthy, left right assisted Wen Wang, so Wen Wang abandoned Bo Yi Kao made Fa crown prince.",
  "s0007": "To Wen Wang collapsed Fa established, this was Wu Wang.",
  "s0008": "Bo Yi Kao already previously died.",
  "s0009": "Wu Wang already conquered Yin Zhou, pacified world, enfeoffed meritorious ministers elder younger brothers.",
  "s0010": "Then enfeoffed Shu Xian at Guan, enfeoffed Shu Du at Cai: two people mutually Zhou son Wu Geng Lu Fu, governed Yin remaining people.",
  "s0011": "Enfeoffed Shu Dan at Lu and mutually Zhou, became Zhou Gong.",
  "s0012": "Enfeoffed Shu Zhen Duo at Cao, enfeoffed Shu Wu at Cheng, enfeoffed Shu Chu at Huo.",
  "s0013": "Kang Shu Feng, Ran Ji Zai all young, not obtained enfeoffment.",
  "s0014": "Wu Wang already collapsed, Cheng Wang young, Zhou Gong Dan monopolized Wang chamber.",
  "s0015": "Guan Shu, Cai Shu doubted Zhou Gong's being harmful to Cheng Wang, then supported Wu Geng made disorder.",
  "s0016": "Zhou Gong Dan received Cheng Wang command attacked executed Wu Geng, killed Guan Shu, banished Cai Shu, moved him, gave chariots ten, followers seventy people followed.",
  "s0017": "Divided Yin remaining people into two: its one enfeoffed Wei Zi Qi at Song, to continue Yin sacrifices;",
  "s0018": "its one enfeoffed Kang Shu as Wei lord, this was Wei Kang Shu.",
  "s0019": "Enfeoffed Ji Zai at Ran.",
  "s0020": "Ran Ji, Kang Shu all had gentle conduct, then Zhou Gong raised Kang Shu as Zhou Si Kou, Ran Ji as Zhou Si Kong, to assist Cheng Wang govern, all had good reputation in world.",
  "s0021": "Cai Shu Du already moved died.",
  "s0022": "His son called Hu, Hu then changed conduct, led virtue gentle good.",
  "s0023": "Zhou Gong heard it, raised Hu as Lu minister, Lu country governed.",
  "s0024": "Then Zhou Gong spoke to Cheng Wang, again enfeoffed Hu at Cai, to serve Cai Shu sacrifices, this was Cai Zhong.",
  "s0025": "Remaining five shu all went to states, no became heavenly son officials.",
  "s0026": "Cai Zhong died, son Cai Bo Huang established.",
  "s0027": "Cai Bo Huang died, son Gong Hou established.",
  "s0028": "Gong Hou died, son Li Hou established.",
  "s0029": "Li Hou died, son Wu Hou established.",
  "s0030": "Wu Hou time, Zhou Li Wang lost country, fled Zhu, republican administered government, feudal lords many rebelled Zhou.",
  "s0031": "Wu Hou died, son Yi Hou established.",
  "s0032": "Yi Hou eleven years, Zhou Xuan Wang ascended position.",
  "s0033": "Twenty-eight years, Yi Hou died, son Xi Hou Suo Shi established.",
  "s0034": "Xi Hou thirty-nine years, Zhou You Wang for Quan Rong assassinated, Zhou chamber lowly moved east.",
  "s0035": "Qin began ranked as feudal lords.",
  "s0036": "Forty-eight years, Xi Hou died, son Gong Hou Xing established.",
  "s0037": "Gong Hou second year died, son Dai Hou established.",
  "s0038": "Dai Hou tenth year died, son Xuan Hou Cuo Fu established.",
  "s0039": "Xuan Hou twenty-eight years, Lu Yin Gong initially established.",
  "s0040": "Thirty-five years, Xuan Hou died, son Huan Hou Feng Ren established.",
  "s0041": "Huan Hou third year, Lu assassinated their lord Yin Gong.",
  "s0042": "Twenty years, Huan Hou died, younger brother Ai Hou Xian Wu established.",
  "s0043": "Ai Hou eleven years, initially, Ai Hou married Chen, Xi Hou also married Chen.",
  "s0044": "Xi wife about return, passed Cai, Cai Hou not respectful.",
  "s0045": "Xi Hou angered, requested Chu Wen Wang: 'Come attack me, I seek save at Cai, Cai must come, Chu because attack it, can have merit.'",
  "s0046": "Chu Wen Wang followed it, captured Cai Ai Hou returned.",
  "s0047": "Ai Hou stayed nine years, died at Chu.",
  "s0048": "Altogether established twenty years died.",
  "s0049": "Cai people established his son Xi, this was Mu Hou."
}
