{
  "s0599": "Gui Xie out, must have return state people.",
  "s0600": "Stars, metal scattered qi, its root called fire.",
  "s0601": "Stars numerous, state auspicious;",
  "s0602": "Few then inauspicious.",
  "s0603": "Milky Way, also metal scattered qi, its root called water.",
  "s0604": "Milky Way, stars many, much water, few then drought, its great constant.",
  "s0605": "Heaven Drum, has sound like thunder not thunder, sound in ground and down reaches ground.",
  "s0606": "Its goes place, troops send its below.",
  "s0607": "Heaven Dog, shape like great running star, has sound, its below stops ground, resembles dog.",
  "s0608": "Where falls reaches, look like fire light bright bright rushes heaven.",
  "s0609": "Its below circle like several qing fields place, top Dui then has yellow color, thousand li breaks army kills general.",
  "s0610": "Ge Ze star, like flame fire shape.",
  "s0611": "Yellow white, rises ground and up.",
  "s0612": "Below great, top Dui.",
  "s0613": "Its appears, not plant and harvest;",
  "s0614": "Not has earth works, must have great harm.",
  "s0615": "Chi You flag, resembles comet but back curved, images flag.",
  "s0616": "Appears then king campaign conquers four directions.",
  "s0617": "Xun Shi, out at North Dipper side, shape like male chicken.",
  "s0618": "Its angry, blue black, images crouching turtle.",
  "s0619": "Wang Shi, resembles great shooting star, snake goes and storage black, looks like has hair feathers thus.",
  "s0620": "Chang Geng, like one bolt cloth covers heaven.",
  "s0621": "This star appears, troops arise.",
  "s0622": "Star falls to ground, then stone.",
  "s0623": "He Ji between, time has falling stars.",
  "s0624": "Heaven essence then appears Jing Star.",
  "s0625": "Jing Star, virtue star.",
  "s0626": "Its shape no constant, constantly out at has way states.",
  "s0627": "Generally observe cloud qi, face up observe, three four hundred li;",
  "s0628": "Level observe, at Sang Yu top, thousand remaining two thousand li;",
  "s0629": "Ascend high and observe, below belongs ground three thousand li.",
  "s0630": "Cloud qi has beast dwells top, victorious.",
  "s0631": "From China south, qi below black top red.",
  "s0632": "Song Gao, three He suburbs, qi precisely red.",
  "s0633": "Heng Shan north, qi below black below blue.",
  "s0634": "Bo, Jie, Hai, Dai between, qi all black.",
  "s0635": "Jiang, Huai between, qi all white.",
  "s0636": "Infantry qi white.",
  "s0637": "Earth works qi yellow.",
  "s0638": "Chariot qi suddenly high suddenly low, often and gather.",
  "s0639": "Cavalry qi low and spread.",
  "s0640": "Soldiers qi coiled.",
  "s0641": "Front low back high, urgent;",
  "s0642": "Front square back high, Dui;",
  "s0643": "Back Dui low, retreats.",
  "s0644": "Its qi level its goes slow.",
  "s0645": "Front high back low, not stop and return.",
  "s0646": "Qi meet, low overcomes high, Dui overcomes square.",
  "s0647": "Qi comes low and follows chariot path, not over three four days, goes five six li see.",
  "s0648": "Qi comes high seven eight chi, not over five six days, goes ten remaining li see.",
  "s0649": "Qi comes high zhang remaining two zhang, not over thirty forty days, goes fifty sixty li see.",
  "s0650": "Slight cloud pure white, its general fierce, its soldiers timid.",
  "s0651": "Its great root front breaks far, should battle.",
  "s0652": "Blue white, its front low, battle victorious;",
  "s0653": "Its front red upturned, battle not victorious.",
  "s0654": "Battle array cloud like standing wall.",
  "s0655": "Shuttle cloud resembles shuttle.",
  "s0656": "Axle cloud coiled two ends Dui.",
  "s0657": "Ladle cloud like rope, dwells front spans heaven, its half half heaven.",
  "s0658": "Its curved resembles tower flag thus.",
  "s0659": "Hook cloud hooked curved.",
  "s0660": "Various this cloud appears, with five colors combine divine.",
  "s0661": "And moist coiled dense, its appears moves people, then has divine;",
  "s0662": "Troops must arise, combine fight its straight.",
  "s0663": "King month waits, decides at sun side.",
  "s0664": "Sun side cloud qi, person lord image.",
  "s0665": "All like its shape to divine.",
  "s0666": "Thus north barbarians qi like group livestock arched gate, south barbarians qi resembles boats ships banners flags.",
  "s0667": "Great water place, defeated army field, broken state ruins, below has accumulated money, gold treasures top, all have qi, cannot not observe.",
  "s0668": "Sea side mirage qi images towers terraces;",
  "s0669": "Broad wild qi forms palace gates thus.",
  "s0670": "Cloud qi each images its mountains rivers people gathered accumulate.",
  "s0671": "Thus observe breath waste, enters state cities, view fief borders fields furrows proper governance, city walls chambers rooms gates moist luster, next to chariots clothes livestock produce essence flower.",
  "s0672": "Substantial breath auspicious;",
  "s0673": "Empty waste inauspicious."
}
