{
  "s0135": "Wei Zhong died, son Song Gong Ji established.",
  "s0136": "Song Gong Ji died, son Ding Gong Shen established.",
  "s0137": "Ding Gong Shen died, son Min Gong Gong established.",
  "s0138": "Min Gong Gong died, younger brother Yang Gong Xi established.",
  "s0139": "Yang Gong ascended position, Min Gong son Fu Si assassinated Yang Gong self established, said 'I should establish', this was Li Gong.",
  "s0140": "Li Gong died, son Xi Gong Ju established.",
  "s0141": "Xi Gong seventeenth year, Zhou Li Wang exited fled Zhi.",
  "s0142": "Twenty-eighth year, Xi Gong died, son Hui Gong Xi established.",
  "s0143": "Hui Gong fourth year, Zhou Xuan Wang ascended position.",
  "s0144": "Thirtieth year, Hui Gong died, son Ai Gong established.",
  "s0145": "Ai Gong first year died, son Dai Gong established.",
  "s0146": "Dai Gong twenty-ninth year, Zhou You Wang for Quan Rong killed, Qin began ranked as feudal lords.",
  "s0147": "Thirty-fourth year, Dai Gong died, son Wu Gong Si Kong established.",
  "s0148": "Wu Gong gave birth daughter became Lu Hui Gong wife, gave birth Lu Huan Gong.",
  "s0149": "Eighteenth year, Wu Gong died, son Xuan Gong Li established.",
  "s0150": "Xuan Gong had crown prince Yu Yi.",
  "s0151": "Nineteenth year, Xuan Gong ill, yielded his younger brother He, said: 'Father die son succeed, elder brother die younger brother reach, world universal righteousness.",
  "s0152": "I will establish He.'",
  "s0153": "He also three yielded received it.",
  "s0154": "Xuan Gong died, younger brother He established, this was Mu Gong.",
  "s0155": "Mu Gong ninth year, ill, summoned grand commander Kong Fu said: 'Previous lord Xuan Gong abandoned crown prince Yu Yi established me, I not dare forget.",
  "s0156": "I die, must establish Yu Yi.'",
  "s0157": "Kong Fu said: 'Group ministers all wish establish gong zi Feng.'",
  "s0158": "Mu Gong said: 'Do not establish Feng, I cannot betray Xuan Gong.'",
  "s0159": "Then Mu Gong sent Feng exit reside at Zheng.",
  "s0160": "Eighth month Geng Chen, Mu Gong died, elder brother Xuan Gong son Yu Yi established, this was Shang Gong.",
  "s0161": "Jun Zi heard it, said: 'Song Xuan Gong can call know person, established his younger brother to complete righteousness, but finally his son again enjoyed it.",
  "s0162": "Shang Gong first year, Wei gong zi Zhou Xu assassinated his lord Wan self established, wished obtain feudal lords, sent inform Song said: 'Feng in Zheng, must make disorder, can with me attack him.'",
  "s0163": "Song permitted it, with attacked Zheng, to Dong Men returned.",
  "s0164": "Second year, Zheng attacked Song, to repay Dong Men campaign.",
  "s0165": "Its after feudal lords several came invade attack.",
  "s0166": "Ninth year, grand commander Kong Fu Jia wife good, exited, road encountered grand steward Hua Du, Du pleased, gazed observed her.",
  "s0167": "Du coveted Kong Fu wife, then sent people declare in country said: 'Shang Gong ascended position ten years, but eleven battles, people bitter cannot bear, all Kong Fu did it, I will kill Kong Fu to pacify people.'",
  "s0168": "This year, Lu assassinated its lord Yin Gong.",
  "s0169": "Tenth year, Hua Du attacked killed Kong Fu, took his wife.",
  "s0170": "Shang Gong angered, then assassinated Shang Gong, welcomed Mu Gong son Feng from Zheng established him, this was Zhuang Gong.",
  "s0171": "Zhuang Gong first year, Hua Du as chancellor.",
  "s0172": "Ninth year, seized Zheng's Ji Zhong, coerced with establish Tu as Zheng lord.",
  "s0173": "Ji Zhong permitted, finally established Tu.",
  "s0174": "Nineteenth year, Zhuang Gong died, son Min Gong Jie established.",
  "s0175": "Min Gong seventh year, Qi Huan Gong ascended position.",
  "s0176": "Ninth year, Song flood, Lu sent Cang Wen Zhong go console flood.",
  "s0177": "Min Gong self blamed said: 'I with cannot serve ghosts spirits, government not cultivate, so flood.'",
  "s0178": "Cang Wen Zhong praised this words.",
  "s0179": "This words then gong zi Zi Yu taught Min Gong.",
  "s0180": "Tenth year summer, Song attacked Lu, battled at Cheng Qiu, Lu alive captured Song Nan Gong Wan.",
  "s0181": "Song people requested Wan, Wan returned Song.",
  "s0182": "Eleventh year autumn, Min Gong with Nan Gong Wan hunted, because gambling contended road, Min Gong angered, humiliated him, said: 'Initially I respected you;",
  "s0183": "now you, Lu captive.'",
  "s0184": "南宮萬怒，殺宋閔公于蒙澤。",
  "s0185": "大司馬龔固曰：「吾聞禍與福鄰，莫知其得。",
  "s0186": "失不可不慎，今兹我國有大事，子有權矣。",
  "s0187": "不可以輕，盍歸亶甲以卜？」",
  "s0188": "乃使人召公子卬于齊。",
  "s0189": "公子卬至，入弒其兄悼公而自立，是為桓公。",
  "s0190": "桓公二年，諸侯伐宋，至郊而去。",
  "s0191": "三年，齊桓公見諸侯于嬴，立宋桓公。",
  "s0192": "桓公病，太子兹甫讓其弟而自立。",
  "s0193": "太子兹甫諫曰：「不可。」",
  "s0194": "桓公病甚，兹甫請曰：「必欲立太子，則已立之。",
  "s0195": "必欲吾死也，則使我。」",
  "s0196": "桓公卒，太子兹甫立，是為襄公。",
  "s0197": "襄公二年，齊桓公卒。",
  "s0198": "十年，宋伐魯，戰于乘丘，取僑丘。",
  "s0199": "二十年，襄公卒，子成公王臣立。",
  "s0200": "成公二年，執鄭祭仲，歸之于齊，祭仲言于齊人，矯以天子之命以責賄于鄭。",
  "s0201": "鄭悼公之時，執宋司馬華元，歸之于鄭。",
  "s0202": "二十三年，成公卒，子昭公杵臼立。",
  "s0203": "昭公十年，卒于雍丘。",
  "s0204": "昭公娶莒女，生佐。",
  "s0205": "佐惡而婉，昭公母常愛魏姬，欲以為夫人，使魏姬賊昭公，而以佐為太子。",
  "s0206": "昭公卒，佐立，是為文公。",
  "s0207": "文公元年，楚太子商臣弒其父成王代立。",
  "s0208": "三年，文公名佐，改曰鮑牛。",
  "s0209": "四年，楚滅江。",
  "s0210": "秦滅小戎。",
  "s0211": "九年，文公卒，子共公瑕立。",
  "s0212": "共公十年，楚莊王即位。",
  "s0213": "十六年，共公卒，子平公成立。",
  "s0214": "平公三年，楚使魯申叔時聘于宋。",
  "s0215": "四年，魯孝公卒。",
  "s0216": "十年，宋伐魯，取長葛。",
  "s0217": "十八年，平公卒，子元公佐立。",
  "s0218": "元公三年，楚公子弃疾弒其君靈王而自立。",
  "s0219": "二十二年，晉平公卒。",
  "s0220": "二十四年，宋火。",
  "s0221": "元公饑，食楚司馬子西之粟，曰：「誰謂宋遠？",
  "s0222": "吾猶食之。」",
  "s0223": "二十五年，孔子過宋。",
  "s0224": "二十七年，元公卒，子景公頭曼立。",
  "s0225": "景公二十五年，晉大夫智伯滅范、中行氏。",
  "s0226": "二十七年，景公卒，子公孫周立。",
  "s0227": "公孫周卒，子悼公購由立。",
  "s0228": "悼公元年，晉滅智伯，分其地。",
  "s0229": "悼公八年，宋伐魯，取地。",
  "s0230": "十二年，悼公卒，子剔成立。",
  "s0231": "剔成四十一年，剔成弟偃攻襲剔成，剔成敗奔齊，偃自立為宋君。",
  "s0232": "君偃十一年，自立為王。",
  "s0233": "東敗齊，取五城；",
  "s0234": "南敗楚，取地三百里；",
  "s0235": "西敗魏軍，乃與齊、魏為敵國。",
  "s0236": "盛血以韋囊，縣而射之，命曰「射天」。",
  "s0237": "淫於樂，徵舒為司馬。",
  "s0238": "君偃二十五年，十一月，剔成弟偃弒剔成于雍丘，立剔成之子肥。",
  "s0239": "是年，剔成奔齊。",
  "s0240": "二十六年，齊魏伐宋，執宋君偃。",
  "s0241": "宋立剔成之子肥，是為康王。",
  "s0242": "康王即位三十七年，家有祟，夜鬼擊之，康王不知，遂射鬼。",
  "s0243": "時有好鬼祟者為之言曰：「王實無好，百姓惡也。",
  "s0244": "王將以民為戮乎？」",
  "s0245": "其後康王為無道，為諸侯所討伐。",
  "s0246": "秦始皇二十二年，秦滅魏，二十四年，秦兵遂滅宋，而天下壹并于秦。",
  "s0247": "太史公曰：孔子稱「微子去之，箕子為之奴，比干諫而死，殷有三仁焉」。",
  "s0248": "夏桀之時，微子開辟，遭纣之世，君有辱民，臣有辱身。",
  "s0249": "或干王誅，或隨而死，或佯狂而去。",
  "s0250": "其譬至於今，豈不痛乎！",
  "s0251": "宋襄公之時，諸侯以力相爭，宋獨為仁義，弱而見取。",
  "s0252": "此以宋襄之賢而不能自立也。",
  "s0253": "傷哉！"
}
