{
  "s0051": {
    "literal": "Gaozu was drunk and said, 'A brave man walks forward—what is there to fear!'",
    "idiomatic": "Gaozu, intoxicated, declared, 'A true warrior presses onward—what have we to dread!'"
  },
  "s0052": {
    "literal": "He went forward and drew his sword to cut the snake.",
    "idiomatic": "He advanced, drew his sword, and slew the serpent."
  },
  "s0053": {
    "literal": "The snake was divided into two, and the path was opened.",
    "idiomatic": "The serpent split in twain, clearing the way forward."
  },
  "s0054": {
    "literal": "He walked several li and lay down drunk and tired.",
    "idiomatic": "After traveling several li, overcome by wine and exhaustion, he collapsed in slumber."
  },
  "s0055": {
    "literal": "後人來至蛇所，一老嫗哭曰：「人殺吾子，故哭之。」",
    "idiomatic": "Later travelers arrived at the serpent's location; an old woman wept, saying, 'Someone has slain my son, hence I weep.'"
  },
  "s0056": {
    "literal": "人問曰：「何以殺之？」",
    "idiomatic": "The people asked, 'How did he kill it?'"
  },
  "s0057": {
    "literal": "嫗曰：「吾子，白帝子也，變為蛇，當道；今赤帝子殺之，故哭。」",
    "idiomatic": "The old woman said, 'My son is the son of the White Emperor; he transformed into a snake to block the path. Now the son of the Red Emperor has slain him, so I weep.'"
  },
  "s0058": {
    "literal": "人以為不誠，欲笞之；嫗因不見。",
    "idiomatic": "The people considered her dishonest and wanted to beat her; the old woman then vanished."
  },
  "s0059": {
    "literal": "後聞高祖覺，告以故。",
    "idiomatic": "Later, when Gaozu awoke, they told him what had happened."
  },
  "s0060": {
    "literal": "高祖心獨喜，自負。",
    "idiomatic": "Gaozu was secretly pleased in his heart and felt proud of himself."
  },
  "s0061": {
    "literal": "諸從者日益畏之。",
    "idiomatic": "His followers grew increasingly in awe of him."
  },
  "s0062": {
    "literal": "秦始皇帝常曰：「東南有天子氣。」",
    "idiomatic": "Qin Shihuang often said, 'There is imperial aura in the southeast.'"
  },
  "s0063": {
    "literal": "於是東游以厭之。",
    "idiomatic": "Therefore he traveled east to suppress it."
  },
  "s0064": {
    "literal": "高祖以亭長為縣送徒驪山，徒多亡。",
    "idiomatic": "As pavilion chief, Gaozu escorted convicts from the county to Mount Li; many convicts escaped."
  },
  "s0065": {
    "literal": "自度至皆亡，到豐西澤，縱所送徒，曰：「公等皆去，吾亦從此逝。」",
    "idiomatic": "He estimated that by the time they arrived all would have fled; upon reaching the western marshes of Feng, he released the convicts he was escorting, saying, 'You all go; I too shall depart from here.'"
  },
  "s0066": {
    "literal": "徒中壯士從者十餘人。",
    "idiomatic": "Among the convicts, about ten strong men followed him."
  },
  "s0067": {
    "literal": "高祖被酒，夜徑澤，行前者還曰：「前有大蛇當道，願還。」",
    "idiomatic": "Gaozu was drunk and traveled through the marshes at night; the one who went ahead returned, saying, 'There is a large snake blocking the path ahead; I wish to turn back.'"
  },
  "s0068": {
    "literal": "高祖曰：「壯士行，何畏！」",
    "idiomatic": "Gaozu said, 'A brave man walks forward—what is there to fear!'"
  },
  "s0069": {
    "literal": "乃前，拔劍斬蛇。",
    "idiomatic": "He went forward, drew his sword, and cut the snake."
  },
  "s0070": {
    "literal": "遂至咸陽，諸客皆喜。",
    "idiomatic": "He then arrived at Xianyang; all the guests were pleased."
  },
  "s0071": {
    "literal": "沛令後悔，聞高祖去，欲捕之。",
    "idiomatic": "The magistrate of Pei later regretted it; hearing that Gaozu had left, he wanted to arrest him."
  },
  "s0072": {
    "literal": "高祖恐，告沛令曰：「君賴我無fare，願勿捕。」",
    "idiomatic": "Gaozu was afraid and told the magistrate of Pei, 'You relied on me to avoid harm; I hope you won't arrest me.'"
  },
  "s0073": {
    "literal": "沛令乃止，不捕。",
    "idiomatic": "The magistrate of Pei then stopped and did not arrest him."
  },
  "s0074": {
    "literal": "沛公以呂后故，得不誅。",
    "idiomatic": "Because of Empress Lü, Prince Pei escaped execution."
  },
  "s0075": {
    "literal": "項籍已殺宋義，引兵而西。",
    "idiomatic": "Xiang Ji had already killed Song Yi and led his troops west."
  },
  "s0076": {
    "literal": "漢王之國，項王使卒三萬從。",
    "idiomatic": "When the Han King went to his fief, Xiang Wang sent thirty thousand soldiers to follow him."
  },
  "s0077": {
    "literal": "張良說漢王燒絕所過栈道，以示天下無還心。",
    "idiomatic": "Zhang Liang advised the Han King to burn all the plank roads he passed through, to show the world that he had no intention of returning."
  },
  "s0078": {
    "literal": "漢王引兵而西，蕭何守關中。",
    "idiomatic": "The Han King led his troops west while Xiao He defended Guanzhong."
  },
  "s0079": {
    "literal": "蕭何發關中老弱未傅者悉詣軍。",
    "idiomatic": "Xiao He mobilized all the elderly and weak in Guanzhong who had not yet been conscripted to join the army."
  },
  "s0080": {
    "literal": "漢王至南鄭，蕭何發步兵十二萬，後一歲，運糧給軍。",
    "idiomatic": "When the Han King reached Nanzheng, Xiao He had mobilized 120,000 infantry; after one year, he transported grain to supply the army."
  },
  "s0081": {
    "literal": "漢王數敗於項籍。",
    "idiomatic": "The Han King suffered several defeats at the hands of Xiang Ji."
  },
  "s0082": {
    "literal": "及項籍滅齊，引兵次於陳留，與漢王相距。",
    "idiomatic": "When Xiang Ji destroyed Qi, he led his troops and camped at Chenliu, confronting the Han King."
  },
  "s0083": {
    "literal": "漢王引軍而東，至彭城。",
    "idiomatic": "The Han King led his army east and arrived at Pengcheng."
  },
  "s0084": {
    "literal": "項籍亦引兵東擊漢，大破之。",
    "idiomatic": "Xiang Ji also led his troops east to attack Han and greatly defeated them."
  },
  "s0085": {
    "literal": "漢王遁而西走，收集散卒，復軍於滎陽。",
    "idiomatic": "The Han King fled west, gathered his scattered soldiers, and reformed his army at Xingyang."
  },
  "s0086": {
    "literal": "楚騎來衆，漢王擇軍中可使者，遣語大司馬曹參。",
    "idiomatic": "Chu cavalry arrived in great numbers; the Han King selected capable men from his army and sent them to speak with Grand Marshal Cao Can."
  },
  "s0087": {
    "literal": "參曰：「臣子不足與計事。」",
    "idiomatic": "Cao Can said, 'Your servant is not worthy to discuss matters with you.'"
  },
  "s0088": {
    "literal": "漢王曰：「吾非忘諸君也，特以為君所知耳。」",
    "idiomatic": "The Han King said, 'I have not forgotten you gentlemen; I merely thought this was something you already knew.'"
  },
  "s0089": {
    "literal": "參曰：「大王何以待天下士？」",
    "idiomatic": "Cao Can said, 'How does Your Majesty treat the scholars of the world?'"
  },
  "s0090": {
    "literal": "漢王曰：「吾能容之。」",
    "idiomatic": "The Han King said, 'I can accommodate them.'"
  },
  "s0091": {
    "literal": "參曰：「大王不能容，臣請以為大王陳之。」",
    "idiomatic": "Cao Can said, 'Your Majesty cannot truly accommodate them; allow me to explain this to Your Majesty.'"
  },
  "s0092": {
    "literal": "漢王曰：「善。」",
    "idiomatic": "The Han King said, 'Very well.'"
  },
  "s0093": {
    "literal": "參曰：「夫三秦王為秦將，將秦子弟數歲矣，所殺亡不可勝計，然終為漢家臣。」",
    "idiomatic": "Cao Can said, 'The three Qin kings served as Qin generals and led Qin youths for several years. The slain and lost cannot be counted, yet they ultimately became servants of the Han house.'"
  },
  "s0094": {
    "literal": "參曰：「又何以怨乎？」",
    "idiomatic": "Cao Can said, 'What reason is there to resent them?'"
  },
  "s0095": {
    "literal": "漢王曰：「善。」",
    "idiomatic": "The Han King said, 'Very well.'"
  },
  "s0096": {
    "literal": "乃以陳平金四萬斤與參，曰：「以給諸將。」",
    "idiomatic": "He then gave Cao Can 40,000 jin of gold, saying, 'Use this to supply the various generals.'"
  },
  "s0097": {
    "literal": "參以金遺諸將，得其死力。",
    "idiomatic": "Cao Can used the gold to reward the various generals and obtained their utmost loyalty."
  },
  "s0098": {
    "literal": "漢王自將軍中騎出入馳射，軍吏士卒皆隨之。",
    "idiomatic": "The Han King personally led the cavalry from the army, riding out and shooting arrows; all the military officials and soldiers followed him."
  },
  "s0099": {
    "literal": "漢王曰：「吾騎士可為楚騎乎？」",
    "idiomatic": "The Han King said, 'Can my cavalry match the Chu cavalry?'"
  },
  "s0100": {
    "literal": "曰：「不可也。」",
    "idiomatic": "They said, 'They cannot.'"
  }
}
