{
  "s822": "As soldier followed uprising in Xue, as crossbow general entered Han, as commandery captain attacked Xiang Yu, Dai, became marquis, 1,000 households.",
  "s823": "Five. Year 8 month 3 Bing Xu day, Marquis Jian Qin Tong year 1.",
  "s824": "Seven",
  "s825": "Eight",
  "s826": "Two. Twenty-one. Year 3, Marquis Dai Zhi year 1.",
  "s827": "Two. Year 3, Marquis Wu year 1. Eleven. After year 1, Marquis Wu committed crime, state abolished.",
  "s829": "Seventy",
  "s830": "Wu Fang.",
  "s831": "As palace attendant cavalry general Han King year 1 followed uprising in Xia Gui, attacked Yangxia, as commandery captain beheaded Xiang Yu, had merit, became marquis, 700 households.",
  "s832": "Five. Year 8 month 3 Xin Mao day, Marquis Zhuang Yang Wu year 1.",
  "s833": "Seven",
  "s834": "Eight",
  "s835": "Twelve. Eleven. Year 13, Marquis Qu Ji year 1.",
  "s836": "Fourteen. After year 1, Qu Ji committed crime, state abolished.",
  "s838": "Ninety-four",
  "s839": "Ning.",
  "s840": "As retainer followed uprising in Dang, entered Han, as commandery captain attacked Zang Tea with merit, became marquis, 1,000 households.",
  "s841": "Five. Year 8 month 4 Xin You day, Marquis Zhuang Wei Xuan year 1.",
  "s842": "Seven",
  "s843": "Eight",
  "s844": "Fifteen. Eight. Year 16, Marquis Gong Lian year 1.",
  "s845": "Three. Year 1, Marquis Zhi year 1. Four. Year 4, Marquis Zhi convicted of crossing national boundary, committed crime, state abolished.",
  "s847": "Seventy-eight",
  "s848": "Chang.",
  "s849": "As Qi general Han King year 4 followed Han Xin uprising in Wuyan, pacified Qi, attacked Ji and Han King Xin at Dai, became marquis, 1,000 households.",
  "s850": "Five. Year 8 month 6 Wu Shen day, Marquis Yu Lu Qing year 1.",
  "s851": "Seven",
  "s852": "Eight",
  "s853": "Fourteen. Nine. Year 15, Marquis Tong year 1.",
  "s854": "Two. Year 3, Marquis Tong rebelled, state abolished.",
  "s856": "One hundred nine",
  "s857": "Gong.",
  "s858": "As Qi general Han King year 4 followed Han Xin uprising in Linzi, attacked Ji and Han King Xin at Pingcheng with merit, became marquis, 1,200 households.",
  "s859": "Five. Year 8 month 6 Ren Zi day, Marquis Zhuang Lu Ba Shi year 1.",
  "s860": "Seven",
  "s861": "Eight",
  "s862": "Six. Year 7, Marquis Hui Dang year 1. Eight. Year 15, Marquis Huai Shang year 1. Five. After year 4, Marquis Shang died, no heir, state abolished.",
  "s865": "One hundred fourteen",
  "s866": "Yanzhi.",
  "s867": "As Dai Grand Commandant Han King year 3 surrendered, became Yanmen governor, as special general pacified Dai rebel bandits, became marquis, 1,000 households.",
  "s868": "Four. Year 8 month 6 Ren Zi day, Marquis Jie Feng Xie Gan year 1. One. Year 12, Marquis Gong Tuo year 1. Died, no heir, extinct.",
  "s871": "Fourteen. Year 2, enfeoffed Marquis Gong's posthumous son Marquis Wen Yi year 1. Eight. Year 16, Marquis Gong Sheng Zhi year 1.",
  "s872": "Five. Eleven. Year 6 BCE, Marquis Ping year 1.",
  "s873": "Twenty-eight. Yuanding year 5, Marquis Ping convicted of tribute gold, state abolished.",
  "s874": "One hundred",
  "s875": "Anqiu.",
  "s876": "As soldier followed uprising in Fangyu, attached to Wei Bao, year 2 month 5, entered Han with halberd, as Sima attacked Ji, as general pacified Dai, became marquis, 3,000 households.",
  "s877": "Five. Year 8 month 7 Gui You day, Marquis Yi Zhang Shuo year 1.",
  "s878": "Seven",
  "s879": "Eight"
}
