{
  "s0699": "Its west then Tang Zhong, several dozen li tiger enclosure.",
  "s0700": "Its north treated great pool, Jian Terrace high twenty plus zhang, named Taiye Pool, middle has Penglai, Fangzhang, Yingzhou, Huliang, resembling sea divine mountains turtle fish and such.",
  "s0701": "Its south has Jade Hall, Jade Gate, Great Bird and such.",
  "s0702": "Then established Divine Bright Terrace, Well Stem Tower, measured fifty zhang, relay roads connected.",
  "s0703": "Summer, Han changed calendar, made first month year's beginning, color upper yellow, official names changed seals with five characters, for Tai Chu first year.",
  "s0704": "This year, west attacked Da Yuan.",
  "s0705": "Locusts greatly arose.",
  "s0706": "Ding Lady, Luoyang Yu Chu and others with techniques sacrificed cursed Xiongnu, Da Yuan.",
  "s0707": "The next year, officials memorialized Yong five altars no cooked prepared utensils, fragrances not complete.",
  "s0708": "Therefore ordered sacrificial officials advance altar calf pen utensils, color food what overcomes, and used wooden dummy horses substitute colts.",
  "s0709": "Only fifth month taste colts, when going personally suburban used colts.",
  "s0710": "And various famous mountains rivers using colts, all used wooden dummy horses substitute.",
  "s0711": "When passing, then used colts.",
  "s0712": "Other rituals like before.",
  "s0713": "The next year, east toured sea, examined divine immortal and such, none verified.",
  "s0714": "Magicians had saying 'Huang Di time made five cities twelve towers, to wait divine people at Zhi Qi, named Welcome Year'.",
  "s0715": "Emperor approved made like method, named Ming Nian.",
  "s0716": "Emperor personally ritual sacrificed Supreme Deity.",
  "s0717": "Gong Yu belt said: 'Huang Di time though feng Mount Tai, yet Feng Hou, Feng Ju, Qi Bo made Huang Di feng east Mount Tai, shan Fan Mountain, match symbols, then not die.'",
  "s0718": "Emperor having ordered set sacrificial utensils, reached east Mount Tai, east Mount Tai low small, not match its reputation, then ordered sacrificial officials ritual it, not feng shan.",
  "s0719": "Afterward ordered belt maintain sacrifice wait divine things.",
  "s0720": "Summer, then returned Mount Tai, repaired five years ritual like before, added shan sacrifice Stone Gate.",
  "s0721": "Stone Gate is at Mount Tai foot southern side, magicians many said this immortal gate, so emperor personally shan.",
  "s0722": "After five years, again reached Mount Tai repaired feng.",
  "s0723": "Returned passed sacrificed Mount Heng.",
  "s0724": "Present emperor established sacrifices, Tai Yi, Hou Tu, three years personally suburban sacrifice, established Han house feng shan, five years one repair feng.",
  "s0725": "Bo Ji Tai Yi and Three Ones, Dark Sheep, Horse Walk, Red Star, five, Kuan Shu sacrificial officials with seasons perform rituals.",
  "s0726": "Altogether six sacrifices, all grand invocator oversees.",
  "s0727": "As for eight spirits various spirits, Ming Nian, Fan Mountain other named sacrifices, when passing then sacrifice, when leaving then stop.",
  "s0728": "Magicians established sacrifices, each oversees own, person ends then stops, sacrificial officials not oversee.",
  "s0729": "Other sacrifices all like before.",
  "s0730": "Present emperor feng shan, after twelve years returned, toured five peaks, four rivers.",
  "s0731": "Magicians waiting sacrificing divine people, entering sea seeking Penglai, finally none verified.",
  "s0732": "Gongsun Qing waiting spirits, still used great person traces as explanation, no effect.",
  "s0733": "Emperor increasingly weary magicians strange far-fetched words, yet maintained not cut off, hoped encounter true.",
  "s0734": "From this after, magicians speaking divine sacrifices increasingly many, but their effects visible.",
  "s0735": "Grand Historian said: I followed toured sacrificed heaven earth various spirits famous mountains rivers and feng shan.",
  "s0736": "Entered Shou Palace served divine words, thoroughly observed magicians sacrificial officials intentions, therefore retired discussed arranged from ancient since performing affairs with ghosts spirits, completely saw their exterior interior.",
  "s0737": "Later have gentlemen, can view it.",
  "s0738": "As for sacrificial stands vessels jade silks details, offering toasts rituals, then officials preserve."
}
