{
  "s0141": "With Qin's strength, attacking the newly established Zhao, they will certainly take Zhao.",
  "s0142": "If Zhao falls and Qin grows stronger, what exhaustion to inherit!",
  "s0143": "Moreover, the state's army was newly defeated, the king cannot sit at ease, sweeps the realm and entrusts it all to the general, the nation's safety and danger, depends on this one action.",
  "s0144": "Now not caring for the soldiers but indulging his private desires, not a minister of the state.'",
  "s0145": "Xiang Yu morning audience with Supreme General Song Yi, right in his tent beheaded Song Yi's head, issued orders in the army saying: 'Song Yi conspired with Qi to rebel against Chu, King Huai secretly ordered Yu to execute him.'",
  "s0146": "At this time, the generals all were awed and submissive, none dared to disobey.",
  "s0147": "All said: 'First to establish Chu was the general's family.",
  "s0148": "Now the general executes the traitor.'",
  "s0149": "They together established Yu as Acting Supreme General.",
  "s0150": "Sent people to pursue Song Yi's son, caught him in Qi, killed him.",
  "s0151": "Sent Huan Chu to report to King Huai.",
  "s0152": "King Huai then made Xiang Yu Supreme General, all the Chu army was under Xiang Yu's command.",
  "s0153": "When Xiang Yu heard that Qin had besieged Zhao at Julu, Xiang Yu wished to attack Qin.",
  "s0154": "He sent Ying Bu and Pu to lead two thousand cavalry, broke through the encirclement, entered Julu, rescued Zhao.",
  "s0155": "When the Qin army retreated, Xiang Yu pursued and attacked, greatly defeated Qin at Julu.",
  "s0156": "The Qin generals Wang Li surrendered, Xiang Yu made Wang Li and Sima Xin his subordinates.",
  "s0157": "At this time, the princes' armies numbered hundreds of thousands, all camped outside Julu's siege lines.",
  "s0158": "But none dared to fight Qin.",
  "s0159": "When Xiang Yu attacked Qin, none followed.",
  "s0160": "Xiang Yu said: 'The world is in chaos, ghosts and spirits are moving, it is the time for great action.'",
  "s0161": "He forged a letter from King Huai saying: 'Whoever attacks Qin first, their general will be made King of Western Chu.'",
  "s0162": "Xiang Yu then first crossed the Yellow River, sank boats, smashed cooking pots, burned tents, only carried three days rations, to show determination to fight to the death.",
  "s0163": "The army numbered twenty-eight thousand men, all Chu warriors, attacked Qin at Xin'an.",
  "s0164": "When the Chu army reached, the Qin army was still besieging Zhao at Julu.",
  "s0165": "Xiang Yu sent messengers to the princes saying: 'Our army has provisions for three days, please follow us to fight Qin.'",
  "s0166": "The princes said: 'We dare not advance, but hope the general will fight Qin.'",
  "s0167": "Xiang Yu then led twenty thousand men to fight Qin at Julu.",
  "s0168": "Xiang Yu's army was hungry and tired, but he made a great battle, defeated Qin forces.",
  "s0169": "Xiang Yu then led the princes' armies south, attacked Qin at Julu again.",
  "s0170": "Xiang Yu's army was at the front, the princes' armies followed behind.",
  "s0171": "When they reached the Yin Mountains, Xiang Yu ordered the princes' armies to cut paths through the mountains.",
  "s0172": "The princes' armies cut paths, Xiang Yu feared they would take advantage, secretly ordered the strong Chu army to follow behind and kill them.",
  "s0173": "When the princes' armies entered the passes, Xiang Yu sealed the passes, did not let them enter.",
  "s0174": "He stationed troops to guard the passes, then led the Chu army west alone.",
  "s0175": "When Xiang Yu reached Hangu Pass, the Qin forces were still many.",
  "s0176": "Xiang Yu attacked, defeated Qin, entered Hangu Pass.",
  "s0177": "Then advanced to Xianyang, attacked Qin forces at Xianyang.",
  "s0178": "Qin Er Shi sent Zhang Han to surrender.",
  "s0179": "Zhang Han said: 'Please allow me to report to the emperor.'",
  "s0180": "Zhang Han returned, Qin Er Shi hanged himself.",
  "s0181": "Zhang Han then surrendered to Xiang Yu at Xianyang.",
  "s0182": "Xiang Yu then burned and plundered Xianyang, killed Ziying, the Qin prince.",
  "s0183": "Xiang Yu then returned east, camped at Hongmen.",
  "s0184": "He ordered the princes to divide Qin territory.",
  "s0185": "He established Zhang Han as Yong King, with Yong as capital.",
  "s0186": "Established Sima Xin as Sai King, with Feiqiu as capital.",
  "s0187": "Established Dong Yi as Di King, with Gao as capital.",
  "s0188": "Established Zhao Xiong as Zhao King, with Zhao as capital.",
  "s0189": "Established Tian Rong as Qi King, with Qi as capital.",
  "s0190": "Established Han Guang as Yan King, with Ji as capital.",
  "s0191": "Established Wei Bao as Wei King, with Pingyang as capital.",
  "s0192": "Established Sima Ang as Dai King, with Dai as capital.",
  "s0193": "Established Zhang Er as Zhao King, with Zhao as capital.",
  "s0194": "Established Wu Chen as Hengshan King, with Hengshan as capital.",
  "s0195": "Established Gong Ao as Linhuai King, with Linhuai as capital.",
  "s0196": "Established Xiang Yu as Western Chu Overlord, with Pengcheng as capital.",
  "s0197": "Xiang Yu said: 'The world is in chaos, ghosts and spirits are moving, it is the time for great action.'",
  "s0198": "He forged a letter from King Huai saying: 'Whoever attacks Qin first, their general will be made King of Western Chu.'",
  "s0199": "Xiang Yu then first crossed the Yellow River, sank boats, smashed cooking pots, burned tents, only carried three days rations, to show determination to fight to the death.",
  "s0200": "The army numbered twenty-eight thousand men, all Chu warriors, attacked Qin at Xin'an."
}