{
  "s0051": {
    "chinese": "高祖醉，曰：「壯士行，何畏！」",
    "literal": "Gaozu was drunk, said: 'A brave man walks forward, what is there to fear!'",
    "idiomatic": "Gaozu, though drunk, declared, 'A real man presses forward—what's there to fear!'"
  },
  "s0052": {
    "chinese": "乃前，拔劍斬蛇。",
    "literal": "Then went forward, drew sword and cut the snake.",
    "idiomatic": "He pressed forward, drew his sword, and slashed at the snake."
  },
  "s0053": {
    "chinese": "蛇分為兩，道開。",
    "literal": "The snake divided into two, the path opened.",
    "idiomatic": "The snake split in two, clearing the path."
  },
  "s0054": {
    "chinese": "行數里， 醉困臥。",
    "literal": "Walked several li, drunk and weary lay down.",
    "idiomatic": "He walked a few li further, then collapsed in drunken exhaustion."
  },
  "s0055": {
    "chinese": "後人來至蛇所，有一老嫗夜哭。",
    "literal": "Later people came to the snake's location, there was an old woman crying at night.",
    "idiomatic": "Later, people came to the spot where the snake had been and found an old woman weeping there at night."
  },
  "s0056": {
    "chinese": "人問嫗何哭，嫗曰：「人殺吾子。」",
    "literal": "People asked the old woman why she cried, the old woman said: 'A person killed my son.'",
    "idiomatic": "They asked the old woman why she was crying. 'Someone killed my son,' she replied."
  },
  "s0057": {
    "chinese": "人曰：「嫗子何為見殺？」",
    "literal": "People said: 'Old woman's son why was he killed?'",
    "idiomatic": "They asked, 'How did your son come to be killed?'"
  },
  "s0058": {
    "chinese": "嫗曰：「吾子，白帝子也，化為蛇，當道，今者赤帝子斬 之，故哭。」",
    "literal": "Old woman said: 'My son was the son of the White Emperor, transformed into a snake, blocked the path, now the son of the Red Emperor cut him, therefore cry.'",
    "idiomatic": "The old woman replied, 'My son was the son of the White Emperor. He transformed into a snake to block the path, but now the son of the Red Emperor has slain him. That is why I weep.'"
  },
  "s0059": {
    "chinese": "人乃以嫗為不誠，欲苦之，嫗因忽不見。",
    "literal": "People then considered the old woman not sincere, wished to harm her, the old woman thus suddenly disappeared.",
    "idiomatic": "The people thought she was lying and wanted to beat her, but she suddenly vanished."
  },
  "s0060": {
    "chinese": "後人至，高祖覺。",
    "literal": "Later people arrived, Gaozu awoke.",
    "idiomatic": "When the others arrived, Gaozu awoke."
  },
  "s0061": {
    "chinese": "告高祖，高祖乃心獨喜，自負。",
    "literal": "Told Gaozu, Gaozu then in his heart alone rejoiced, considered himself superior.",
    "idiomatic": "They told Gaozu what happened. He was secretly thrilled and began to think highly of himself."
  },
  "s0062": {
    "chinese": "諸從者日益畏之。",
    "literal": "The various followers increasingly feared him.",
    "idiomatic": "His followers grew increasingly awed by him."
  },
  "s0063": {
    "chinese": "秦始皇帝嘗曰「東南有天子氣」，於是東游以猒當之。",
    "literal": "Qin Shi Huang often said 'there is emperor aura in the southeast', therefore traveled east to suppress it.",
    "idiomatic": "Qin Shi Huang had often said, 'There is imperial aura in the southeast.' Therefore he traveled east to suppress it."
  },
  "s0064": {
    "chinese": "高祖隱於芒、碭山澤間，呂后與人俱求，常得之。",
    "literal": "Gaozu hid in the mountains and marshes between Mang and Dang, Empress Lu and others together sought him, constantly found him.",
    "idiomatic": "Gaozu hid himself in the hills and marshes between Mang and Dang. Empress Lü and others searched for him together and always managed to find him."
  },
  "s0065": {
    "chinese": "高祖怪問之。",
    "literal": "Gaozu strangely questioned her.",
    "idiomatic": "Gaozu asked her curiously."
  },
  "s0066": {
    "chinese": "呂后曰：「季所居上常有雲氣，故從往常得季。」",
    "literal": "Empress Lu said: 'Where Ji resides above constantly has cloud aura, therefore following it constantly finds Ji.'",
    "idiomatic": "Empress Lü replied, 'Wherever you hide, Liu Ji, there's always a cloud of auspicious vapor above you. That's how we always find you.'"
  },
  "s0067": {
    "chinese": "高祖又喜。",
    "literal": "Gaozu again was happy.",
    "idiomatic": "Gaozu was pleased once more."
  },
  "s0068": {
    "chinese": "沛中子弟或聞之，多欲附者矣。",
    "literal": "Some of the youths in Pei heard of it, many wished to attach themselves.",
    "idiomatic": "Some of the young men in Pei heard about this and many wanted to join him."
  },
  "s0069": {
    "chinese": "於是樊噲從高祖來。",
    "literal": "Therefore Fan Kuai followed Gaozu and came.",
    "idiomatic": "Thus Fan Kuai came to join Gaozu."
  },
  "s0070": {
    "chinese": "沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。",
    "literal": "The Pei magistrate afterward regretted, feared there would be change, then closed the city gates and defended, wished to execute Xiao and Cao.",
    "idiomatic": "The magistrate of Pei later regretted his decision. Fearing trouble, he closed the city gates and prepared to defend against attack. He wanted to execute Xiao He and Cao Can."
  },
  "s0071": {
    "chinese": "蕭、曹恐，踰城保高祖。",
    "literal": "Xiao and Cao feared, climbed over the wall to protect Gaozu.",
    "idiomatic": "Xiao He and Cao Can, fearing for their lives, climbed over the wall to join Gaozu."
  },
  "s0072": {
    "chinese": "高祖乃書 帛射城上，與沛父老曰：「天下同苦秦久矣。",
    "literal": "Gaozu then wrote on silk and shot it onto the city wall, telling the Pei elders: 'The world together has suffered under Qin for a long time.'",
    "idiomatic": "Gaozu wrote a message on silk and shot it over the city wall to the elders of Pei: 'All under heaven have suffered long under Qin oppression.'"
  },
  "s0073": {
    "chinese": "今父老雖為沛令守，諸侯並起，今屠沛。",
    "literal": "Now although elders defend for the Pei magistrate, the feudal lords all rise, now will slaughter Pei.",
    "idiomatic": "'Though you elders defend the magistrate of Pei, the feudal lords are rising up everywhere. They will soon slaughter the people of Pei.'"
  },
  "s0074": {
    "chinese": "沛今共誅令，擇可立立之，以應諸侯，即室家完。",
    "literal": "Pei now together execute the magistrate, choose suitable one and establish him, to respond to the feudal lords, then families complete.",
    "idiomatic": "'If Pei executes the magistrate together and chooses a suitable leader to join the other feudal lords, your families will be safe.'"
  },
  "s0075": {
    "chinese": "不然，父子俱屠，無為 也。」",
    "literal": "If not, fathers and sons together slaughtered, useless.'",
    "idiomatic": "'Otherwise, fathers and sons will all be slaughtered—it will be pointless.'"
  },
  "s0076": {
    "chinese": "父老乃帥子弟共殺沛令，開城門迎高祖，欲以為沛令。",
    "literal": "The elders then led the young men together to kill the Pei magistrate, opened the city gates to welcome Gaozu, wished to make him Pei magistrate.",
    "idiomatic": "The elders led the young men to kill the magistrate and opened the city gates to welcome Gaozu. They wanted to make him the new magistrate of Pei."
  },
  "s0077": {
    "chinese": "高祖曰：「天下方擾，諸侯並起，令置將不善，一敗塗地。",
    "literal": "Gaozu said: 'The world is currently in chaos, feudal lords all rise, if the magistrate appoints generals poorly, one defeat and all lost.'",
    "idiomatic": "Gaozu replied, 'The realm is in turmoil with feudal lords rising everywhere. If the magistrate chooses poor generals, one defeat will destroy everything.'"
  },
  "s0078": {
    "chinese": "吾非敢自愛，恐能薄，不能完父兄子弟。",
    "literal": "I do not dare cherish myself, fear my abilities are meager, cannot protect fathers, elder brothers, younger brothers.",
    "idiomatic": "'I'm not trying to protect myself. I fear my abilities are insufficient to protect our fathers, brothers, and families.'"
  },
  "s0079": {
    "chinese": "此 大事，願吏擇可者。」",
    "literal": "This is a great matter, wish officials choose suitable one.'",
    "idiomatic": "'This is a grave responsibility. I hope the officials will choose someone suitable.'"
  },
  "s0080": {
    "chinese": "蕭、曹等皆文吏，自愛，恐事不就，後秦種族其家，盡讓高祖。",
    "literal": "Xiao, Cao and others all were civil officials, cherished themselves, feared the matter would not succeed, afterward Qin would exterminate their families, all yielded to Gaozu.",
    "idiomatic": "Xiao He, Cao Can, and the other civil officials, concerned for their own safety and fearing failure would lead to Qin exterminating their families, all deferred to Gaozu."
  },
  "s0081": {
    "chinese": "諸父老皆曰：「平生所聞劉季奇怪，當貴，且卜筮之，莫如劉季最吉。」",
    "literal": "All the elders said: 'In our lives we have heard Liu Ji is strange and extraordinary, should be noble, moreover divining it, none is more auspicious than Liu Ji.'",
    "idiomatic": "The elders all said, 'Throughout our lives we've heard that Liu Ji is extraordinary. He is destined for nobility. And when we consulted the divination, none showed more auspicious signs than Liu Ji.'"
  },
  "s0082": {
    "chinese": "高祖 數讓。",
    "literal": "Gaozu repeatedly declined.",
    "idiomatic": "Gaozu repeatedly declined the position."
  },
  "s0083": {
    "chinese": "眾莫肯為，高祖乃立為沛公。",
    "literal": "The crowd none would do it, Gaozu then was established as Pei Gong.",
    "idiomatic": "No one else would accept it, so Gaozu was established as Lord of Pei."
  },
  "s0084": {
    "chinese": "祠黃帝，祭蚩尤於沛廷，而釁鼓旗。",
    "literal": "Sacrificed to the Yellow Emperor, offered sacrifice to Chi You in the Pei court, and smeared blood on drums and flags.",
    "idiomatic": "He sacrificed to the Yellow Emperor and offered rites to Chi You in the Pei court, smearing the drums and banners with blood."
  },
  "s0085": {
    "chinese": "幟皆赤，由所殺蛇白帝子，所殺者赤帝子故也。",
    "literal": "The banners all red, because the killed snake was White Emperor's son, the one who killed was Red Emperor's son therefore.",
    "idiomatic": "All banners were red, because the snake he killed was the son of the White Emperor, and he who killed it was the son of the Red Emperor."
  },
  "s0086": {
    "chinese": "於是少年豪吏如蕭、曹、樊噲等皆為收沛子 弟，得三千人。",
    "literal": "Therefore young heroic officials like Xiao, Cao, Fan Kuai and others all recruited Pei youths, got three thousand.",
    "idiomatic": "The young leaders like Xiao He, Cao Can, Fan Kuai, and others recruited the young men of Pei and gathered three thousand troops."
  },
  "s0087": {
    "chinese": "是月，項梁與兄子羽起吳。",
    "literal": "This month, Xiang Liang and his brother's son Yu rose in Wu.",
    "idiomatic": "That month, Xiang Liang and his nephew Xiang Yu rose up in Wu."
  },
  "s0088": {
    "chinese": "田儋與從弟榮、橫起齊，自立為齊王。",
    "literal": "Tian Dan and his younger cousins Rong, Heng rose in Qi, self-established as Qi King.",
    "idiomatic": "Tian Dan and his cousins Tian Rong and Tian Heng rose up in Qi and proclaimed themselves King of Qi."
  },
  "s0089": {
    "chinese": "韓廣自立為燕王。",
    "literal": "Han Guang self-established as Yan King.",
    "idiomatic": "Han Guang proclaimed himself King of Yan."
  },
  "s0090": {
    "chinese": "魏咎自立為魏王。",
    "literal": "Wei Jiu self-established as Wei King.",
    "idiomatic": "Wei Jiu proclaimed himself King of Wei."
  },
  "s0091": {
    "chinese": "陳涉之將周章西入關，至戲，秦將章邯距破之。",
    "literal": "Chen Sheng's general Zhou Zhang entered the pass westward, arrived at Xi, Qin general Zhang Han resisted and defeated him.",
    "idiomatic": "Chen Sheng's general Zhou Zhang marched west through the pass and reached Xi, where Qin general Zhang Han met and defeated him."
  },
  "s0092": {
    "chinese": "秦二年十月，沛公攻胡陵、方與，還守豐。",
    "literal": "Qin second year tenth month, Pei Gong attacked Hu Ling and Fang Yu, returned to defend Feng.",
    "idiomatic": "In the tenth month of the second year of Qin, Lord Pei attacked Hu Ling and Fang Yu, then returned to defend Feng."
  },
  "s0093": {
    "chinese": "秦泗川監平將兵圍豐。",
    "literal": "Qin Sishui inspector Ping led troops to surround Feng.",
    "idiomatic": "Qin inspector Ping of Sishui commandery led troops to besiege Feng."
  },
  "s0094": {
    "chinese": "二日，出與戰，破之。",
    "literal": "Two days, went out and fought with them, defeated them.",
    "idiomatic": "Two days later, Lord Pei sallied forth to fight and defeated them."
  },
  "s0095": {
    "chinese": "令雍齒守豐。",
    "literal": "Ordered Yong Chi to defend Feng.",
    "idiomatic": "He ordered Yong Chi to defend Feng."
  },
  "s0096": {
    "chinese": "十 一月，沛公引兵之薜。",
    "literal": "Eleventh month, Pei Gong led troops to Xi.",
    "idiomatic": "In the eleventh month, Lord Pei led his troops to Xi."
  },
  "s0097": {
    "chinese": "秦泗川守壯兵敗於薛，走至戚，沛公左司馬得殺之。",
    "literal": "Qin Sishui defender Zhuang's troops defeated at Xue, fled to Qi, Pei Gong's left marshal captured and killed him.",
    "idiomatic": "The Qin defender Zhuang's troops were defeated at Xue and fled to Qi, where Lord Pei's left marshal captured and executed him."
  },
  "s0098": {
    "chinese": "沛公還軍亢父，至方與。",
    "literal": "Pei Gong returned his army to Kang Fu, arrived at Fang Yu.",
    "idiomatic": "Lord Pei withdrew his army to Kang Fu and arrived at Fang Yu."
  },
  "s0099": {
    "chinese": "趙王武臣為其將所殺。",
    "literal": "Zhao King Wu Chen was killed by his general.",
    "idiomatic": "King Wu Chen of Zhao was assassinated by one of his generals."
  },
  "s0100": {
    "chinese": "十二月，楚王陳涉為其御莊賈所殺。",
    "literal": "Twelfth month, Chu King Chen Sheng was killed by his charioteer Zhuang Jia.",
    "idiomatic": "In the twelfth month, King Chen Sheng of Chu was assassinated by his charioteer Zhuang Jia."
  }
}