{
  "s0447": "Envoys visited and supplied him continuously on the road.",
  "s0448": "From Da's chief generals and chancellors downward, all set wine in his house, presented gifts to him.",
  "s0449": "Therefore the emperor carved a jade seal saying 'Heavenly Dao General', sent envoys wearing feathered robes, standing on white thatch at night, Five Profits General also wore feathered robes, stood on white thatch at night to receive the seal, to show not being subjects.",
  "s0450": "Those who wore 'Heavenly Dao' would moreover guide heavenly spirits for the emperor.",
  "s0451": "Therefore Five Profits constantly sacrificed at night in his house, wishing to summon spirits.",
  "s0452": "Spirits had not yet come but a hundred ghosts gathered, yet he could somewhat control them.",
  "s0453": "Afterward he prepared travel, entered the sea eastward, seeking his teacher.",
  "s0454": "Da was seen for several months, wore six seals, his honor shook the realm, and along the sea between Yan and Qi, none did not roll up sleeves and claim to have forbidden techniques, could make divine immortals.",
  "s0455": "That summer in the sixth month, Fen Yin shaman Jin sacrificed to Hou Tu for the people beside Wei Zhi camp, saw ground like a hook shape, dug and inspected, obtained a ding.",
  "s0456": "The ding greatly differed from common dings, patterned and engraved without inscriptions, considered it strange, reported to officials.",
  "s0457": "Officials told Hedong governor Sheng, Sheng reported it.",
  "s0458": "The emperor sent envoys to verify the shaman obtained the ding without fraud, then sacrificed with rites, welcomed the ding to Ganquan, followed along, the emperor offered it.",
  "s0459": "Arriving at Zhongshan, it was warm and sunny, there was yellow cloud cover.",
  "s0460": "A muntjac passed, the emperor personally shot it, used it to sacrifice.",
  "s0461": "Arriving at Chang'an, the dukes and ministers all discussed requesting to honor the precious ding.",
  "s0462": "The emperor said: 'Recently the river overflowed, years had poor harvests, so I toured and sacrificed to Hou Tu, prayed for the people to grow grain.",
  "s0463": "Now the year has abundant harvests not yet repaid, why did the ding emerge?'",
  "s0464": "All officials said: 'Heard that formerly Tai Di raised one divine ding, one means unified, the end where heaven, earth, ten thousand things are tied.",
  "s0465": "Huang Di made three precious dings, resembling heaven, earth, man.",
  "s0466": "Yu collected nine provinces' metal, cast nine dings.",
  "s0467": "All once cooked and offered to the Supreme Deity and ghosts and spirits.",
  "s0468": "When sages encountered them they rose, dings moved to Xia and Shang.",
  "s0469": "Zhou virtue declined, Song's altar perished, dings then sank and disappeared, hidden and unseen.",
  "s0470": "The ode says 'From hall to foundation, from sheep to oxen;",
  "s0471": "great dings and small cauldrons, not noisy not arrogant, how examine their good fortune.'",
  "s0472": "Now ding arrives at Ganquan, bright and lustrous dragon transformations, receiving good fortune without bound.",
  "s0473": "Meets at Zhongshan, yellow white clouds descend covering, like beasts as symbols, road bows multiplied arrows, gathered obtained below the altar, report sacrifice great enjoyment.",
  "s0474": "Only those who receive the mandate and become emperors know its intention and match virtue.",
  "s0475": "The ding should appear at ancestral temples, stored in imperial courts, to match bright responses.'",
  "s0476": "Edict said: 'Approved.'",
  "s0478": "Those who entered the sea seeking Penglai said Penglai was not far, but those who could not reach it probably did not see its vapors.",
  "s0479": "The emperor then sent vapor observers to wait for its vapors.",
  "s0480": "That autumn, the emperor went to Yong, about to perform suburban sacrifice.",
  "s0481": "Some said 'The Five Emperors are Tai Yi's assistants, should establish Tai Yi and the emperor personally perform suburban sacrifice to him.'",
  "s0482": "The emperor was doubtful and undecided.",
  "s0483": "The Qi man Gongsun Qing said: 'This year obtained precious ding, this winter Xin Si new moon dawn winter solstice, equals Huang Di's time.'",
  "s0484": "Qing had bamboo slips book saying: 'Huang Di obtained precious ding at Wan Qu, asked Gui Yu Qu.",
  "s0485": "Gui Yu Qu answered: 'Huang Di obtained precious ding divine strategy, this year Ji You new moon dawn winter solstice, obtained heaven's cycle, end and begin again.'",
  "s0486": "Therefore Huang Di welcomed the sun and pushed the strategy, afterward led twenty years again new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years, Huang Di became immortal and ascended to heaven.'",
  "s0487": "Qing through Shou Zhong wished to memorialize it.",
  "s0488": "Shou Zhong saw the book was not orthodox, suspected it false writing, apologized saying: 'Precious ding matter already decided, what more to do!'",
  "s0489": "Qing through favored people memorialized it.",
  "s0490": "The emperor was greatly pleased, summoned and questioned Qing.",
  "s0491": "Answered: 'Received this book from Shen Gong, Shen Gong already died.'",
  "s0492": "The emperor said: 'Who is Shen Gong?'",
  "s0493": "Qing said: 'Shen Gong is a Qi man.",
  "s0494": "Communicated with An Qisheng, received Huang Di's words, no book, only has this ding book.",
  "s0495": "Says 'Han rise should again be like Huang Di's time'.",
  "s0496": "Says 'Han sage will be in Gaozu's grandson and great-grandson."
}
