{
  "s135": "Five. Three",
  "s138": "184",
  "s139": "Four",
  "s140": "Deposes Young Emperor, establishes Changshan King Hong as Emperor.",
  "s141": "Six. Four. Establishes Grand Commandant office.",
  "s142": "One. Jiang Hou Zhou Bo becomes Grand Commandant.",
  "s144": "183",
  "s145": "Five",
  "s146": "Eighth month, Huaiyang King passes away, establishes his younger brother Marquis of Huguan Wu as Huaiyang King. Orders garrison troops annual rotation.",
  "s147": "Seven. Five",
  "s148": "Two",
  "s150": "182",
  "s151": "Six",
  "s152": "Establishes Lü Chan as Lü King. Fourth month ding you, amnesty to all under heaven. Daytime eclipse.",
  "s153": "Eight. Six",
  "s154": "Three",
  "s156": "181",
  "s157": "Seven",
  "s158": "Zhao King dies in confinement, establishes Lü Lu as Zhao King. Liang King moves to Zhao, commits suicide.",
  "s159": "Nine. Seven",
  "s160": "Four",
  "s162": "180",
  "s163": "Eight",
  "s164": "Seventh month, Empress Gao passes away. Ninth month, executes all Lü clan. Ninth month after, Dai King arrives, ascends emperor position. Ninth month after, Shi Qi dismissed from chancellor.",
  "s165": "Ten. Seventh month xin si, becomes Emperor's Grand Tutor. Ninth month ren xu, again becomes Chancellor. Eight",
  "s166": "Five. Long Lü Hou Cao becomes general, strikes Nanyue.",
  "s167": "Imperial Secretary Cang.",
  "s168": "179",
  "s169": "Filial Wen first year",
  "s170": "Abolishes confiscation of family for crimes law. Establishes Crown Prince. Grants people nobility ranks.",
  "s171": "Eleven. Eleventh month xin si, Ping moves as Left Chancellor. Grand Commandant Jiang Hou Zhou Bo becomes Right Chancellor.",
  "s172": "Six. Bo becomes chancellor, Yingyin Hou Guan Ying becomes Grand Commandant.",
  "s174": "178",
  "s175": "Two",
  "s176": "Abolishes slander law. Imperial son Wu becomes Dai King, Shen becomes Taiyuan King, Yi becomes Liang King. Tenth month, Chancellor Ping passes away.",
  "s177": "One. Eleventh month yi hai, Jiang Hou Bo again becomes Chancellor.",
  "s178": "One",
  "s180": "177",
  "s181": "Three",
  "s182": "Moves Dai King Wu to Huaiyang King. Emperor visits Taiyuan. Jibei King rebels. Xiongnu greatly enter Shangjun. Gives all territory to Taiyuan, Taiyuan changes name to Dai. Eleventh month ren zi, Bo dismissed from chancellor, returns to state.",
  "s183": "One. Twelfth month yi hai, Grand Commandant Yingyin Hou Guan Ying becomes Chancellor. Abolishes Grand Commandant office.",
  "s184": "Two. Ji Pu Hou Chen Wu becomes Grand General, strikes Jibei. Chang Hou Lu Qing, Gong Hou Lu Ba Shi, Ning Hou Chi, Shen Ze Hou Jiang Ye all become generals, subordinate to Wu Qi Hou He, lead troops garrison at Xingyang.",
  "s186": "176",
  "s187": "Four",
  "s188": "Twelfth month ji si, Ying passes away.",
  "s189": "One. First month jia wu, Imperial Secretary Marquis of Beiping Zhang Cang becomes Chancellor.",
  "s190": "An Qiu Hou Zhang Yue becomes general, strikes Hu, exits Dai.",
  "s191": "Guanzhong Hou Shen Tu Jia becomes Imperial Secretary.",
  "s192": "175"
}
