{
  "s880": "Twelve. Eleven. Year 13, Marquis Gong Nu year 1.",
  "s881": "Two. One. Year 3, Marquis Jing Zhi year 1. Thirteen. Year 4, Marquis Kang Xin year 1.",
  "s882": "Eighteen. Yuanshou year 1, Marquis Zhi year 1. Nine. Yuanding year 4, Marquis Zhi convicted of entering Shanglin to steal deer, state abolished.",
  "s883": "Sixty-seven",
  "s884": "Heyang.",
  "s885": "Gaozu's elder brother. Troops initially rose, served Supreme Father guarding Feng, realm already pacified, year 6 month 1 established Zhong as Dai King. Gaozu year 8, Xiongnu attacked Dai, king abandoned country fled, demoted to Marquis of Heyang.",
  "s886": "Five. Year 8 month 9 Bing Zi day, Marquis Liu Zhong year 1.",
  "s887": "Two. Zhong's son Pi, became Wu King. Because of son being Wu King, honored Zhong's posthumous name as Dai Qing Hou.",
  "s893": "Xiangping.",
  "s894": "Troops initially rose, Ji Cheng as general followed attacking and breaking Qin, entered Han, pacified Three Qins, meritorious service comparable to Marquis of Pingding. Battled Haozhi, died in service. Son Tong inherited successful merit, became marquis.",
  "s895": "Five. Year 8 after month 9 Bing Wu day, Marquis Ji Tong year 1.",
  "s896": "Seven",
  "s897": "Eight",
  "s898": "Twenty-three",
  "s899": "Nine. Seven. Zhong year 3, Marquis Kang Xiang Fu year 1.",
  "s900": "Twelve. Yuanshuo year 1, Marquis Yi Wu year 1. Nineteen. Yuanfeng year 1, Yi Wu died, no heir, state abolished.",
  "s902": "Long.",
  "s903": "As soldier followed, Han King year 1 rose Baxiang, as ye zhe attacked Ji, beheaded Cao Jiu, became marquis, 1,000 households.",
  "s904": "Five. Year 8 after month 9 Ji Wei day, Marquis Jing Chen Shu year 1.",
  "s905": "Seven",
  "s906": "Six. Two. Year 7, Marquis Jian year 1.",
  "s907": "Sixteen. After year 1, Marquis Jian deprived of marquisate, state abolished.",
  "s910": "Eighty-four",
  "s911": "Fan.",
  "s912": "As Zhao cavalry general followed, Han year 3, followed attacking various lords, became marquis, comparable to Marquis of Wufang, 1,500 households.",
  "s913": "Four. Year 9 month 11 Ren Yin day, Marquis Zhuang Qiang Zhan year 1.",
  "s914": "Four. Three. Year 5, Marquis Kang Xu Du year 1.",
  "s915": "Eight",
  "s916": "Twenty-three",
  "s917": "Three. Six. Year 4 Marquis Ji year 1. Seven. Zhong year 3, Marquis An Guo year 1.",
  "s918": "Eighteen. Yuanshou year 1, An Guo killed by someone, state abolished.",
  "s919": "Ninety-five",
  "s920": "Lu Liang.",
  "s921": "Imperial edict made him a ranked marquis, self-established officials, received orders from King of Changsha.",
  "s922": "Three. Year 9 month 3 Bing Chen day, Marquis Xu Wu year 1. One. Year 12, Marquis Gong Sang year 1.",
  "s923": "Seven",
  "s924": "Eight",
  "s925": "Eighteen. Five. After year 3, Marquis Kang Qing Ji year 1.",
  "s926": "Year 1, Marquis Ran year 1. Sixteen",
  "s927": "Twenty-eight. Yuanding year 5, Marquis Ran convicted of tribute gold, state abolished.",
  "s928": "One hundred thirty-seven",
  "s929": "Gao Jing.",
  "s930": "Zhou Ke raised troops, as Interior Minister followed, attacked and broke Qin, became Grand Master of the Court, entered Han, besieged and took various lords, firmly defended Xingyang, meritorious service comparable to Biyang. Ke died in service as Grand Master of the Court. Son Cheng became heir, inherited marquisate.",
  "s931": "Four. Year 9 month 4 Wu Yin day, Marquis Zhou Cheng year 1.",
  "s932": "Seven",
  "s933": "Eight",
  "s934": "Twenty. After year 5, convicted of plotting rebellion, imprisoned and died, state abolished, extinct.",
  "s935": "Sheng. Zhong year 1, enfeoffed Cheng's grandson Ying year 1. Marquis Ping succeeded, did not get year.",
  "s936": "Yuanshou year 4, Ping convicted as Grand Master of Ceremonies not repairing imperial tombs, disrespectful, state abolished.",
  "s937": "Sixty"
}
