{
  "s0299": "Advance, for king not peaceful;",
  "s0300": "Its retreat, has army not return.",
  "s0301": "Tian Xing, its color yellow, nine spikes, sound called Huang Zhong Gong.",
  "s0302": "Its loses order up two three lodges called advance, has lord fate not complete, not then great floods.",
  "s0303": "Loses order down two three lodges called retreat, has queen sorrow, its year not return, not then heaven crack if earth move.",
  "s0304": "Dipper for civil great chamber, Tian Xing temple, son of heaven star.",
  "s0305": "Wood star with earth combines, for inner chaos.",
  "s0306": "Famine, lord not use battle, defeated;",
  "s0307": "Water then change plans and change affairs;",
  "s0308": "Fire for drought;",
  "s0309": "Metal for white clothes assembly if floods.",
  "s0310": "Metal in south called female male, year grain ripe, metal in north, year partial none.",
  "s0311": "Fire with water combines for quench, with metal combines for melt, for mourning, all cannot raise affairs, use troops greatly defeated.",
  "s0312": "Earth for worry, governs calamity ministers;",
  "s0313": "Great famine, battle defeated, for northern army, army distressed, raise affairs greatly defeated.",
  "s0314": "Earth with water combines, abundant and blocked stopped, has overturned army, its state cannot raise affairs.",
  "s0315": "Out, loses land;",
  "s0316": "Enter, gets land.",
  "s0317": "Metal for illness, for inner troops, loses land.",
  "s0318": "Three stars if combine, its lodge land state outer inner has troops and mourning, change establish duke king.",
  "s0319": "Four stars combine, troops mourning together arise, gentlemen worry, small people flow.",
  "s0320": "Five stars combine, this is easy conduct, has virtue, receives celebration, change establish great man, covers has four directions, sons grandsons numerous prosperous;",
  "s0321": "No virtue, receives calamity if perishes.",
  "s0322": "Five stars all great, its affairs also great;",
  "s0323": "All small, affairs also small.",
  "s0324": "Early out for advance, advance for guest.",
  "s0325": "Late out for retreat, retreat for host.",
  "s0326": "Must have heaven response appears at ladle star.",
  "s0327": "Same lodge for combine.",
  "s0328": "Mutually oppress for fight, seven cun within must it.",
  "s0329": "Five stars color white circle, for mourning drought;",
  "s0330": "Red circle, then middle not peaceful, for troops;",
  "s0331": "Blue circle, for worry floods;",
  "s0332": "Black circle, for illness, many die;",
  "s0333": "Yellow circle, then auspicious.",
  "s0334": "Red horns offend my city, yellow horns land dispute, white horns weeping crying sound, blue horns have troops worry, black horns then floods.",
  "s0335": "Intent, conduct exhausted troops place ends.",
  "s0336": "Five stars same color, all under heaven ceases troops, hundred surnames peaceful prosperous.",
  "s0337": "Spring wind autumn rain, winter cold summer heat, move shake constantly with this.",
  "s0338": "Tian Xing out hundred twenty days then contrary west goes, west goes hundred twenty days returns east goes.",
  "s0339": "Appears three hundred thirty days then enters, enters thirty days again out eastern.",
  "s0340": "Great year in Jia Yin, Zhen Xing in Dong Bi, thus in Ying Shi.",
  "s0341": "Observe sun conduct to place position Tai Bai.",
  "s0342": "Called western, autumn, governs troops month conduct and heaven arrow, called Geng Xin, governs kill.",
  "s0343": "Kill lost, punishment exits Tai Bai.",
  "s0344": "Tai Bai loses conduct, with its lodges determines state.",
  "s0345": "Its out conduct eighteen lodges two hundred forty days then enters.",
  "s0346": "Enters eastern, hidden goes eleven lodges hundred thirty days;",
  "s0347": "Its enters western, hidden goes three lodges sixteen days then out.",
  "s0348": "Should out not out, should enter not enter, this called loses lodge, not has broken army, must has state lord usurpation.",
  "s0349": "Its record upper yuan, with She Ti Ge year, with Ying Shi morning out eastern, to Jue then enters;",
  "s0350": "With Ying Shi evening out western, to Jue then enters;",
  "s0351": "With Jue morning out, enters Bi;",
  "s0352": "With Jue evening out, enters Bi;",
  "s0353": "With Bi morning out, enters Ji;",
  "s0354": "With Bi evening out, enters Ji;",
  "s0355": "With Ji morning out, enters Liu;",
  "s0356": "With Ji evening out, enters Liu;",
  "s0357": "With Liu morning out, enters Ying Shi;",
  "s0358": "With Liu evening out, enters Ying Shi.",
  "s0359": "Generally enter exit east west each five, for eight years, two hundred twenty days, again with Ying Shi morning out eastern.",
  "s0360": "Its great rate, year circles heaven.",
  "s0361": "Its begins out eastern, goes slow, rate day half degree, hundred twenty days, must contrary goes one two lodges;",
  "s0362": "Rises extreme then returns, east goes, goes day one degree half, hundred twenty days enters.",
  "s0363": "Its low, near sun, called Ming Xing, soft;",
  "s0364": "High, far sun, called Da Xiao, hard.",
  "s0365": "Its begins out western, goes urgent, rate day one degree half, hundred twenty days;",
  "s0366": "Rises extreme then goes slow, day half degree, hundred twenty days, dawn enters, must contrary goes one two lodges then enters.",
  "s0367": "Its low, near sun, called Da Bai, soft;",
  "s0368": "High, far sun, called Da Xiang, hard.",
  "s0369": "Out with Chen Xu, enters with Chou Wei.",
  "s0370": "Should out not out, not should enter and enter, all under heaven ceases troops, troops outside, enter.",
  "s0371": "Not should out and out, should enter and not enter, below raises troops, has broken state.",
  "s0372": "Its should period out, its state prosperous.",
  "s0373": "Its out east for east, enters east for northern;",
  "s0374": "Out west for west, enters west for southern.",
  "s0375": "Its dwells long, its region benefits;",
  "s0376": "Easy, its region inauspicious.",
  "s0377": "Out west contrary goes to east, precisely western states auspicious.",
  "s0378": "Out east to west, precisely eastern states auspicious.",
  "s0379": "Its out not passes heaven;",
  "s0380": "Passes heaven, all under heaven reforms governance.",
  "s0381": "Small with horns move, troops arise.",
  "s0382": "Begins out great, after small, troops weak;",
  "s0383": "Out small, after great, troops strong.",
  "s0384": "Out high, use troops deep auspicious, shallow inauspicious;",
  "s0385": "Low, shallow auspicious, deep inauspicious.",
  "s0386": "Sun square south metal dwells its south, sun square north metal dwells its north, called advance, marquises kings not peaceful, use troops advance auspicious retreat inauspicious.",
  "s0387": "Sun square south metal dwells its north, sun square north metal dwells its south, called retreat, marquises kings have worry, use troops retreat auspicious advance inauspicious.",
  "s0388": "Use troops imitate Tai Bai: Tai Bai goes urgent, urgent go;",
  "s0389": "Slow, slow go.",
  "s0390": "Horns, dare battle.",
  "s0391": "Move shake restless, restless.",
  "s0392": "Circle with still, still.",
  "s0393": "Follow horns pointed, auspicious;",
  "s0394": "Contrary, all inauspicious.",
  "s0395": "Out then out troops, enter then enter troops.",
  "s0396": "Red horns, have battle;",
  "s0397": "White horns, have mourning;"
}
