{
  "s0001": {
    "literal": "Yan Shigu said: 'According to Han regulations, the three dukes were honored with the title \"ten thousand bushels,\" their salaries each month were 350 bushels of grain.'",
    "idiomatic": "Yan Shigu said: 'According to Han dynasty regulations, the three dukes were honored with the title \"ten thousand bushels,\" each receiving a monthly salary of 350 bushels of grain.'"
  },
  "s0002": {
    "literal": "Those called \"middle two thousand bushels\" each received 180 bushels per month, those of two thousand bushels received 120 bushels, those comparable to two thousand bushels received 100 bushels, those of one thousand bushels received 90 bushels, those comparable to one thousand bushels received 80 bushels, those of six hundred bushels received 70 bushels, those comparable to six hundred bushels received 60 bushels, those of four hundred bushels received 50 bushels, those comparable to four hundred bushels received 45 bushels, those of three hundred bushels received 40 bushels, those comparable to three hundred bushels received 37 bushels, those of two hundred bushels received 30 bushels, those comparable to two hundred bushels received 27 bushels, those of one hundred bushels received 16 bushels.'",
    "idiomatic": "Officials ranked as 'middle two thousand bushels' received 180 bushels monthly; those ranked two thousand bushels received 120 bushels; those comparable to two thousand bushels received 100 bushels; one thousand bushels officials received 90 bushels; those comparable to one thousand bushels received 80 bushels; six hundred bushels officials received 70 bushels; those comparable to six hundred bushels received 60 bushels; four hundred bushels officials received 50 bushels; those comparable to four hundred bushels received 45 bushels; three hundred bushels officials received 40 bushels; those comparable to three hundred bushels received 37 bushels; two hundred bushels officials received 30 bushels; those comparable to two hundred bushels received 27 bushels; and one hundred bushels officials received 16 bushels.'"
  },
  "s0003": {
    "literal": "",
    "idiomatic": ""
  },
  "s0004": {
    "literal": "The Changes states that Fuxi, Shennong, and the Yellow Emperor created teachings to civilize the people, and they transmitted descriptions of their officials, making Fuxi have Dragon Master as the name for officials, Shennong have Fire Master as fire names, the Yellow Emperor have Cloud Master as cloud names, Shaohao have Bird Master as bird names.",
    "idiomatic": "The Book of Changes records that Fuxi, Shennong, and the Yellow Emperor established teachings to civilize the people, passing down descriptions of their officials. Fuxi used Dragon Master as the name for officials, Shennong used Fire Master as fire names, the Yellow Emperor used Cloud Master as cloud names, and Shaohao used Bird Master as bird names."
  },
  "s0005": {
    "literal": "From Zhuanxu onward, they became teachers of the people and were named according to human affairs, having the officials of Chongli, Goumang, Zhurong, Houtu, Rushe, and Xuanming, but these are already ancient.",
    "idiomatic": "From Emperor Zhuanxu onward, rulers became teachers of the people and officials were named according to human affairs, with positions like Chongli, Goumang, Zhurong, Houtu, Rushe, and Xuanming—but these are already from ancient times."
  },
  "s0006": {
    "literal": "The Documents record that in the time of Tang and Yu, Xihe and his four sons were commanded to follow the heavenly patterns and teach the people the seasons;",
    "idiomatic": "The Book of Documents records that during the reigns of Yao and Shun, Xihe and his four sons were commanded to follow the heavenly patterns and teach the people about the seasons."
  },
  "s0007": {
    "literal": "consulted the Four Peaks to raise worthy talents, promote those in obscurity;",
    "idiomatic": "they consulted the Four Peaks to promote worthy talents and raise up those who were obscure and unknown."
  },
  "s0008": {
    "literal": "the twelve pastors soothed the distant and brought close the near;",
    "idiomatic": "the twelve regional governors pacified distant lands and brought nearby territories under control."
  },
  "s0009": {
    "literal": "Yu served as Minister of Works, leveling the waters and soils;",
    "idiomatic": "Yu served as Minister of Works, controlling the floods and organizing the lands."
  },
  "s0010": {
    "literal": "Bo Yi served as Minister of Rites, overseeing the three ceremonies;",
    "idiomatic": "Bo Yi served as Minister of Rites, overseeing the three ceremonies."
  },
  "s0011": {
    "literal": "Chui served as Minister of Works, benefiting the use of tools;",
    "idiomatic": "Chui served as Minister of Works, benefiting the use of tools."
  },
  "s0012": {
    "literal": "Yi served as Minister of Agriculture, managing the plants, trees, birds, and beasts above and below;",
    "idiomatic": "Yi served as Minister of Agriculture, managing the plants, trees, birds, and beasts above and below."
  },
  "s0013": {
    "literal": "Kui oversaw music and educated the noble sons;",
    "idiomatic": "Kui oversaw music and educated the noble sons."
  },
  "s0014": {
    "literal": "Long served as Minister of the Interior, conveying the emperor's commands;",
    "idiomatic": "Long served as Minister of the Interior, conveying the emperor's commands."
  },
  "s0015": {
    "literal": "by the Xia and Shang dynasties, although the official names differed, their duties were the same.",
    "idiomatic": "by the Xia and Shang dynasties, although the official names differed, their duties remained the same."
  },
  "s0016": {
    "literal": "The Zhou system of officials was then complete.",
    "idiomatic": "The Zhou system of officials was then complete."
  },
  "s0017": {
    "literal": "The Ministers of Education, War, Works, Justice, and Crime oversaw the five relationships.",
    "idiomatic": "The Ministers of Education, War, Works, Justice, and Crime oversaw the five relationships."
  },
  "s0018": {
    "literal": "The Grand Preceptor, Grand Tutor, Grand Guardian, Junior Preceptor, Junior Tutor, Junior Guardian, the Masters and Guardians transmitted teachings and encouraged learning.",
    "idiomatic": "The Grand Preceptor, Grand Tutor, Grand Guardian, Junior Preceptor, Junior Tutor, Junior Guardian, the Masters and Guardians transmitted teachings and encouraged learning."
  },
  "s0019": {
    "literal": "The Inner Scribe, Grand Scribe, Inner Steward, Royal Secretary, and Imperial Scribe managed the king's written commands.",
    "idiomatic": "The Inner Scribe, Grand Scribe, Inner Steward, Royal Secretary, and Imperial Scribe managed the king's written commands."
  },
  "s0020": {
    "literal": "The Outer Scribe and Imperial Scribe managed the king's written orders.",
    "idiomatic": "The Outer Scribe and Imperial Scribe managed the king's written orders."
  },
  "s0021": {
    "literal": "The Junior Scribe and Imperial Scribe managed the state's written orders.",
    "idiomatic": "The Junior Scribe and Imperial Scribe managed the state's written orders."
  },
  "s0022": {
    "literal": "The senior, middle, and junior officers administered the three relationships.",
    "idiomatic": "The senior, middle, and junior officers administered the three relationships."
  },
  "s0023": {
    "literal": "The stewards, scribes, assistants, and laborers managed official affairs.",
    "idiomatic": "The stewards, scribes, assistants, and laborers managed official affairs."
  },
  "s0024": {
    "literal": "When Qin unified the empire, it established the title of emperor and set up the positions of the hundred officials.",
    "idiomatic": "When Qin unified the empire, it established the title of emperor and set up the positions of the hundred officials."
  },
  "s0025": {
    "literal": "Han followed this without change.",
    "idiomatic": "Han followed this without change."
  },
  "s0026": {
    "literal": "The Chancellor and Vice-Chancellor had green ribbons.",
    "idiomatic": "The Chancellor and Vice-Chancellor had green ribbons."
  },
  "s0027": {
    "literal": "During Lü Hou's time, the chancellor had a green ribbon; the green ribbon was also for the chancellor.",
    "idiomatic": "During Empress Lü's time, the chancellor had a green ribbon; the green ribbon was also for the chancellor."
  },
  "s0028": {
    "literal": "During Xiaohui and Empress Gao's time, the title was Chancellor, with green ribbon.",
    "idiomatic": "During Xiaohui and Empress Gao's time, the title was Chancellor, with green ribbon."
  },
  "s0029": {
    "literal": "In the first year of Xiaowen, it reverted to Vice-Chancellor.",
    "idiomatic": "In the first year of Xiaowen, it reverted to Vice-Chancellor."
  },
  "s0030": {
    "literal": "The Grand Commandant had a green ribbon.",
    "idiomatic": "The Grand Commandant had a green ribbon."
  }
}
