{
  "s1167": "Eight",
  "s1168": "Eight. Fifteen. Year 9, Marquis Chi year 1.",
  "s1169": "Eleven. Zhong year 5, Marquis Chi deprived of rank one level, state abolished.",
  "s1171": "Fifty-three",
  "s1172": "Yang Yi.",
  "s1173": "As Jing Lingyin Han King year 5 initially followed, attacked Zhongli Mei and Chen Gong Li Ji, defeated them, moved to become Han grand master, followed to Chen, captured Han Xin, returned as Commandant, followed attacking Bu, meritorious service led to marquisate, 2,000 households.",
  "s1174": "One. Year 12 month 10 Ren Yin day, Marquis Ding Ling Chang year 1.",
  "s1175": "Seven",
  "s1176": "Six. Two. Year 7, Marquis Gong He year 1.",
  "s1177": "Six. Year 7, Marquis Ai Sheng year 1. Six. Year 12, Marquis Sheng died, no heir, state abolished.",
  "s1180": "One hundred nineteen",
  "s1181": "Xiaxiang.",
  "s1182": "As guest followed uprising in Pei, used troops followed attacking defeated Qi Tian Jie army, as Chu Chancellor firmly defended Pengcheng, resisted Bu's army, meritorious service led to marquisate, 2,000 households.",
  "s1183": "One. Year 12 month 10 Ji You day, Marquis Zhuang Leng Er year 1.",
  "s1184": "Seven",
  "s1185": "Eight",
  "s1186": "Two. Twenty-one. Year 3 Marquis Shen year 1",
  "s1187": "Two. Year 3 month 3, Marquis Shen rebelled, state abolished.",
  "s1189": "Eighty-five",
  "s1190": "De.",
  "s1191": "As Dai Qing King son became marquis. Qing King, Wu King Pi's father also; Guang, Pi's younger brother also.",
  "s1192": "One. Year 12 month 11 Geng Chen day, Marquis Ai Liu Guang year 1.",
  "s1193": "Seven",
  "s1194": "Two. Six. Year 3, Marquis Qing Tong year 1.",
  "s1195": "Twenty-three",
  "s1196": "Five. Eleven. Year 6, Marquis Yin year 1.",
  "s1197": "Twenty-seven. Yuanding year 4, Marquis He year 1. One. Yuanding year 5, Marquis He convicted of tribute gold, state abolished.",
  "s1198": "One hundred twenty-seven",
  "s1199": "Gaoling.",
  "s1200": "As cavalry Sima Han King year 1 followed uprising in Fei Qiu, as commandery captain defeated Tian Heng, Long Qu, pursued Ji to Dongcheng, as general attacked Bu, 900 households.",
  "s1201": "One. Year 12 month 12 Ding Hai day, Marquis Yu Wang Zhou year 1.",
  "s1202": "Seven",
  "s1203": "Two. Six. Year 3, Marquis Hui Bing Gong year 1.",
  "s1204": "Twelve. Eleven. Year 13, Marquis Xing year 1.",
  "s1205": "Two. Year 3, rebelled, state abolished.",
  "s1207": "Ninety-two",
  "s1208": "Qisi.",
  "s1209": "Huainan King Bu central grand master, had alliance, submitted memorial reporting Bu rebellion, became marquis, 2,000 households. Bu completely killed his clan.",
  "s1210": "One. Year 12 month 12 Gui Mao day, Marquis Kang Fen He year 1.",
  "s1211": "Seven",
  "s1212": "Eight",
  "s1213": "Thirteen. Year 14, He died, no heir, state abolished.",
  "s1216": "One hundred thirty-two",
  "s1217": "Guling.",
  "s1218": "As soldier followed, year 2 BCE rose in Zhe, attacked Ji, pacified Dai, became general, meritorious service led to marquisate.",
  "s1219": "One. Year 12 month 1 Yi Chou day, Marquis Ding Feng Xi year 1.",
  "s1220": "Seven",
  "s1221": "Eight",
  "s1222": "Six. Seventeen. Year 7, Marquis Gong Xiong year 1.",
  "s1223": "Two. Two. Year 3, Marquis Yin Ang year 1. Twelve. Year 5, Marquis Xian Xie year 1."
}
