{
  "s0001": {
    "chinese": "周后稷，名棄。",
    "literal": "Zhou Houji was named Qi.",
    "idiomatic": "The Zhou ancestor Houji was named Qi."
  },
  "s0002": {
    "chinese": "其母有邰氏女，曰姜原。",
    "literal": "His mother was a woman of the Youtai clan, named Jiang Yuan.",
    "idiomatic": "His mother was a woman of the Youtai clan named Jiang Yuan."
  },
  "s0003": {
    "chinese": "姜原為帝嚳元妃。",
    "literal": "Jiang Yuan was the primary consort of Emperor Ku.",
    "idiomatic": "Jiang Yuan was the primary consort of Emperor Ku."
  },
  "s0004": {
    "chinese": "姜原出野，見巨人跡，心忻然說，欲踐之，踐之而身動如孕者。",
    "literal": "Jiang Yuan went out into the wilderness and saw giant footprints. Her heart was filled with joy; she wished to step on them, and when she did, her body moved as if she were pregnant.",
    "idiomatic": "Jiang Yuan went out into the wilderness and saw giant footprints. Her heart was filled with delight; she wished to step on them, and when she did, her body moved as if she were with child."
  },
  "s0005": {
    "chinese": "居期而生子，以為不祥，棄之隘巷，馬牛過者皆辟不踐；",
    "literal": "She carried the child to term and gave birth to a son, but considered it an ill omen and abandoned him in a narrow alley. Horses and oxen passing by all avoided stepping on him.",
    "idiomatic": "She carried the child to term and gave birth to a son, but considered it an ill omen and abandoned him in a narrow alley. Horses and oxen passing by all avoided stepping on him."
  },
  "s0006": {
    "chinese": "徙置之林中，適會山林多人，遷之；",
    "literal": "She moved him to the forest, but by chance met many woodcutters who moved him away.",
    "idiomatic": "She moved him to the forest, but by chance encountered many woodcutters who moved him elsewhere."
  },
  "s0007": {
    "chinese": "而棄渠中冰上，飛鳥以其翼覆薦之。",
    "literal": "She abandoned him in a ditch on the ice, but flying birds covered and protected him with their wings.",
    "idiomatic": "She abandoned him in a ditch on the ice, but flying birds covered and protected him with their wings."
  },
  "s0008": {
    "chinese": "姜原以為神，遂收養長之。",
    "literal": "Jiang Yuan considered this divine and took him in to raise and care for him.",
    "idiomatic": "Jiang Yuan considered this a divine sign and took him in to raise."
  },
  "s0009": {
    "chinese": "初欲棄之，因名曰棄。",
    "literal": "Initially she wanted to abandon him, so she named him Qi.",
    "idiomatic": "Since she had initially wanted to abandon him, she named him Qi."
  },
  "s0010": {
    "chinese": "棄為兒時，屹如巨人之志。",
    "literal": "When Qi grew up, he was skilled at sowing seeds. The people followed his example.",
    "idiomatic": "Even as a child, Qi had the aspirations of a giant."
  },
  "s0011": {
    "chinese": "其游戲，好種樹麻、菽，麻、菽美。",
    "literal": "In his play, he enjoyed planting hemp and beans; the hemp and beans grew beautiful.",
    "idiomatic": "In his play, he loved planting hemp and soybeans; they grew beautifully."
  },
  "s0012": {
    "chinese": "及為成人，遂好耕農，相地之宜，宜穀者稼穡焉，民皆法則之。",
    "literal": "When he became an adult, he loved farming. He assessed the suitability of the land; where grain was suitable he planted crops, and the people all followed his example.",
    "idiomatic": "When he became an adult, he loved farming. He assessed the suitability of the land; where grain grew well he planted crops, and the people all followed his example."
  },
  "s0013": {
    "chinese": "帝堯聞之，舉棄為農師，天下得其利，有功。",
    "literal": "Emperor Yao heard of this and appointed Qi as the Minister of Agriculture. All under Heaven benefited from this, and he had merit.",
    "idiomatic": "Emperor Yao heard of this and appointed Qi as Minister of Agriculture. All under Heaven benefited, and he achieved merit."
  },
  "s0014": {
    "chinese": "帝舜曰：「棄，黎民始饑，爾后稷播時百穀。」",
    "literal": "Emperor Shun said: 'Qi, when the black-haired people first went hungry, you, Houji, sowed the timely hundred grains.'",
    "idiomatic": "Emperor Shun said: 'Qi, when the black-haired people first suffered famine, you, Houji, sowed the timely hundred grains.'"
  },
  "s0015": {
    "chinese": "封棄於邰，號曰后稷，別姓姬氏。",
    "literal": "He enfeoffed Qi at Tai, titled him Houji, and established the Ji clan surname.",
    "idiomatic": "He enfeoffed Qi at Tai, titled him Houji, and established the Ji clan as a separate surname."
  },
  "s0016": {
    "chinese": "后稷之興，在陶唐﹑虞﹑夏之際，皆有令德。",
    "literal": "Houji's rise occurred during the time of Yao Tang, Yu, and Xia; all had excellent virtue.",
    "idiomatic": "Houji's rise occurred during the time of Yao Tang, Yu, and Xia; all possessed excellent virtue."
  },
  "s0017": {
    "chinese": "后稷卒，子不窋立。",
    "literal": "When the Xia declined, the worthy descendants of Houji continued to hold the title.",
    "idiomatic": "Houji died, and his son Bu Ku succeeded him."
  },
  "s0018": {
    "chinese": "不窋末年，夏后氏政衰，去稷不務，不窋以失其官而犇戎狄之間。",
    "literal": "When King Wen of Zhou arose, he examined the descendants of Houji and found Gong Liu.",
    "idiomatic": "In Bu Ku's later years, the Xia royal house's governance declined. They abandoned the office of Houji and neglected its duties. Bu Ku lost his position and fled among the Rong and Di barbarians."
  },
  "s0019": {
    "chinese": "不窋卒，子鞠立。",
    "literal": "Gong Liu had merit. He moved from Bin to Qi, and the people followed him.",
    "idiomatic": "Bu Ku died, and his son Ju succeeded him."
  },
  "s0020": {
    "chinese": "鞠卒，子公劉立。",
    "literal": "When King Wen observed Gong Liu, he said: 'My ancestor Houji founded our clan. I should restore the title of Houji.'",
    "idiomatic": "Ju died, and his son Gong Liu succeeded him."
}
}
