{
  "s0332": "King You second year, the Western Zhou three rivers all shook.",
  "s0333": "Bo Yangfu said: 'Zhou will perish.",
  "s0334": "The qi of heaven and earth do not lose their order;",
  "s0335": "If they lose their order, it is because the people are in chaos.",
  "s0336": "Yang is suppressed and cannot emerge, yin presses and cannot rise, therefore there are earthquakes.",
  "s0337": "Now the three rivers are shaking, this is yang losing its place and being filled by yin.",
  "s0338": "Yang is the ruler, yin is the minister; ruler yielding to minister, this is the Way of Zhou perishing.'",
  "s0339": "King You was fond of Bao Si, made her queen, deposed Shen Hou and the crown prince.",
  "s0340": "The crown prince's mother died early. Hui Queen gave birth to Shu Dai.",
  "s0341": "King You wanted to establish Shu Dai as crown prince, Shen Hou did not agree.",
  "s0342": "King You was angry, Shen Hou fled to Shen.",
  "s0343": "King You attacked Shen, Shen Hou called on the Quanrong to help.",
  "s0344": "The Quanrong attacked Zhou, captured King You at Li Mountain, killed him.",
  "s0345": "The Quanrong attacked Haojing, took Bao Si.",
  "s0346": "The common people made the crown prince Ji Nie king, this was King Ping.",
  "s0347": "King Ping moved east to Luoyi, this was the Eastern Zhou.",
  "s0348": "Shen Hou returned, became queen mother.",
  "s0349": "King Ping first year, the Quanrong again invaded the west.",
  "s0350": "Second year, attacked Yan.",
  "s0351": "Third year, attacked the Quanrong.",
  "s0352": "Fourth year, attacked the Jiang.",
  "s0353": "Fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0354": "Sixth year, Xi Fu Ren, a woman from Chen, passed through Cai, Cai did not show courtesy, hated her.",
  "s0355": "Chu attacked Cai, captured Duke Ai and returned.",
  "s0356": "Seventh year, Duke Huan of Song, Yu Yue, first year.",
  "s0357": "Son of Duke Zhuang.",
  "s0358": "Eighth year, attacked the Quanrong.",
  "s0359": "Ninth year, attacked the Quanrong.",
  "s0360": "Tenth year, attacked the Quanrong.",
  "s0361": "Eleventh year, Duke Xiang of Song, Zi Fu, first year.",
  "s0362": "Mu Yi as prime minister.",
  "s0363": "Twelfth year, Duke Xiang of Song, Zi Fu, first year.",
  "s0364": "Mu Yi as prime minister.",
  "s0365": "Thirteenth year, attacked the Quanrong.",
  "s0366": "Fourteenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0367": "Fifteenth year, Duke Mu of Qin, first year.",
  "s0368": "Sixteenth year, Xun Xi used treasures to borrow passage from Yu to attack Guo, extinguished Xia Yang.",
  "s0369": "Seventeenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0370": "Eighteenth year, Duke Zhuang of Zheng, Wu Sheng, first year.",
  "s0371": "Nineteenth year, solar eclipse, did not record the day, the officials lost it.",
  "s0373": "Twentieth year, Duke Wen of Qin, Fei Zi, first year.",
  "s0374": "Twenty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0375": "Twenty-second year, Duke Wen of Qin, Fei Zi, first year.",
  "s0376": "Twenty-third year, Duke Wen of Qin, Fei Zi, first year.",
  "s0377": "Twenty-fourth year, Duke Wen of Qin, Fei Zi, first year.",
  "s0378": "Twenty-fifth year, Duke Wen of Qin, Fei Zi, first year.",
  "s0379": "Twenty-sixth year, Duke Wen of Qin, Fei Zi, first year.",
  "s0380": "Twenty-seventh year, Duke Wen of Qin, Fei Zi, first year.",
  "s0381": "Twenty-eighth year, Xun Xi used treasures to borrow passage from Yu to attack Guo, extinguished Xia Yang.",
  "s0382": "Twenty-ninth year, solar eclipse, did not record the day, the officials lost it."
}