{
  "s0052": "Seventh year, Jin minister Pan Fu assassinated his lord Zhao Hou welcomed Qu Wo Huan Shu.",
  "s0053": "Huan Shu wished enter Jin, Jin people sent troops attacked Huan Shu.",
  "s0054": "Huan Shu defeated, returned to Qu Wo.",
  "s0055": "Jin people together established Zhao Hou son Ping as lord, this was Xiao Hou.",
  "s0056": "Executed Pan Fu.",
  "s0057": "Xiao Hou eighth year, Qu Wo Huan Shu died, son Jia Huan Shu, this was Qu Wo Zhuang Bo.",
  "s0058": "Xiao Hou fifteenth year, Qu Wo Zhuang Bo assassinated his lord Jin Xiao Hou at Yi.",
  "s0059": "Jin people attacked Qu Wo Zhuang Bo, Zhuang Bo again entered Qu Wo.",
  "s0060": "Jin people again established Xiao Hou son Xi as lord, this was E Hou.",
  "s0061": "E Hou sixth year died.",
  "s0062": "Qu Wo Zhuang Bo heard Jin E Hou died, then raised troops attacked Jin.",
  "s0063": "Zhou Ping Wang sent Guo Gong led troops attacked Qu Wo Zhuang Bo, Zhuang Bo fled protected Qu Wo.",
  "s0064": "Jin people together established E Hou son Guang, this was Ai Hou.",
  "s0065": "Ai Hou second year Qu Wo Zhuang Bo died, son Cheng replaced Zhuang Bo established, this was Qu Wo Wu Gong.",
  "s0066": "Ai Hou sixth year, Lu assassinated its lord Yin Gong.",
  "s0067": "Ai Hou eighth year, Jin invaded Xing Ting.",
  "s0068": "Xing Ting with Qu Wo Wu Gong plotted, ninth year, attacked Jin at Fen beside, captured Ai Hou.",
  "s0069": "Jin people then established Ai Hou son Xiao Zi as lord, this was Xiao Zi Hou.",
  "s0070": "Xiao Zi first year, Qu Wo Wu Gong sent Han Wan kill captured Jin Ai Hou.",
  "s0071": "Qu Wo increasingly strong, Jin no what to do.",
  "s0072": "Jin Xiao Zi fourth year, Qu Wo Wu Gong lured summoned Jin Xiao Zi killed him.",
  "s0073": "Zhou Huan Wang sent Guo Zhong attacked Qu Wo Wu Gong, Wu Gong entered Qu Wo, then established Jin Ai Hou younger brother Min as Jin Hou.",
  "s0074": "Jin Hou Min fourth year, Song seized Zheng Ji Zhong established Tu as Zheng lord.",
  "s0075": "Jin Hou nineteenth year, Qi person Guan Zhi Fu assassinated his lord Xiang Gong.",
  "s0076": "Jin Hou twenty-eighth year, Qi Huan Gong began hegemony.",
  "s0077": "Qu Wo Wu Gong attacked Jin Hou Min, extinguished him, completely with his precious vessels bribed presented to Zhou Xi Wang.",
  "s0078": "Xi Wang commanded Qu Wo Wu Gong as Jin lord, ranked as feudal lords, then completely united Jin land possessed it.",
  "s0079": "Qu Wo Wu Gong already ascended position thirty-seven years, changed number called Jin Wu Gong.",
  "s0080": "Jin Wu Gong began capital Jin country, previously ascended position Qu Wo, through years thirty-eight.",
  "s0081": "Wu Gong surnamed, first Jin Mu Hou great grandson, Qu Wo Huan Shu grandson.",
  "s0082": "Huan Shu, initially enfeoffed Qu Wo.",
  "s0083": "Wu Gong, Zhuang Bo son.",
  "s0084": "From Huan Shu initial enfeoffed Qu Wo to Wu Gong extinguished Jin, altogether sixty-seven years, finally replaced Jin became feudal lord.",
  "s0085": "Wu Gong replaced Jin two years, died.",
  "s0086": "With Qu Wo through years, ascended position altogether thirty-nine years died.",
  "s0087": "Son Xian Gong Gui Zhu established.",
  "s0088": "Xian Gong first year, Zhou Hui Wang younger brother Hui attacked Hui Wang, Hui Wang exited fled, resided Zheng Li Yi.",
  "s0089": "Fifth year, attacked Li Rong, obtained Li Ji, Li Ji younger brother, both loved favored them.",
  "s0090": "Eighth year, Shi Kui advised Gong said: 'Former Jin group gong zi many, not executed, disorder will rise.'",
  "s0091": "Then sent completely kill various gong zi, walled gathered capital it, named Jiang, began capital Jiang.",
  "s0092": "Ninth year, Jin group gong zi already fled to Guo, Guo with their reason twice attacked Jin, not conquered.",
  "s0093": "Tenth year, Jin wished attack Guo, Shi Kui said: 'Moreover wait their disorder.'",
  "s0095": "Twelfth year, Li Ji gave birth Xi Qi.",
  "s0096": "Xian Gong had intention abolish crown prince, then said: 'Qu Wo my first ancestor ancestral temple location, Pu borders Qin, Qu borders Di, not make various sons reside it, I fear.'",
  "s0097": "Then sent crown prince Shen Sheng reside Qu Wo, gong zi Chong Er reside Pu, gong zi Yi Wu reside Qu.",
  "s0098": "Xian Gong with Li Ji son Xi Qi resided Jiang.",
  "s0099": "Jin country with this knew crown prince not establish.",
  "s0100": "Crown prince Shen Sheng, his mother Qi Huan Gong woman, called Qi Jiang, early died.",
  "s0101": "Shen Sheng same mother younger sister became Qin Mu Gong wife."
}
