{
  "s0041": "The Guangling man Zhao Ping then served Chen Wang by attacking Guangling, but could not take it.",
  "s0042": "He heard Chen Wang had been defeated and fled, and Qin troops were about to arrive, so crossed the Yangtze, forged Chen Wang's order, appointed Liang as Chu King's 'Supreme Pillar of State'.",
  "s0043": "He said: 'Jiangdong is already pacified, urgently lead troops west to attack Qin.'",
  "s0044": "Xiang Liang then led eight thousand men across the Yangtze west.",
  "s0045": "He heard Chen Ying had taken Dongyang, sent messengers desiring to join forces and go west together.",
  "s0046": "Chen Ying was formerly a Dongyang county clerk, resided in the county, was always trustworthy and careful, called an elder.",
  "s0047": "Dongyang youths killed their magistrate, gathered several thousand, wished to appoint a leader, had no suitable person, so invited Chen Ying.",
  "s0048": "Ying declined saying he could not, but they forcibly established Ying as leader, those who followed from the county got twenty thousand men.",
  "s0049": "The youths wished to establish Ying directly as king, with different colored banners and special banners.",
  "s0050": "Chen Ying's mother said to Ying: 'Since I became your family's wife, I have never heard that your ancestors had nobles.",
  "s0051": "Now suddenly gaining great fame, it is not auspicious.",
  "s0052": "Do not accept the king title.'",
  "s0053": "Ying's strategist Qin Jia said: 'If you do not accept, the people will disperse.",
  "s0054": "If you accept, you will gain great merit.'",
  "s0055": "Chen Ying then established himself as king, appointed Qin Jia as prime minister.",
  "s0056": "Xiang Liang sent messengers to Chen Ying, wishing to join forces.",
  "s0057": "Chen Ying's mother said: 'I heard generals are like women's husbands, difficult to know.",
  "s0058": "If we join Xiang Liang, we will become his subordinates.",
  "s0059": "Better to go west alone.'",
  "s0060": "Chen Ying sent messengers to Xiang Liang saying: 'My mother said generals are difficult to know.",
  "s0061": "I wish to go west alone.'",
  "s0062": "Xiang Liang was angry, attacked Chen Ying, defeated him.",
  "s0063": "Chen Ying fled to Dongyang, Xiang Liang pursued and killed him.",
  "s0064": "Xiang Liang took Dongyang, incorporated Chen Ying's troops, his forces grew to twenty thousand.",
  "s0065": "Xiang Liang then led troops west, camped at Xiapi.",
  "s0066": "At this time, Liu Ji was serving as magistrate of Pei, recruited troops, got several thousand men.",
  "s0067": "Xiang Liang sent messengers to Liu Ji, wishing to join forces.",
  "s0068": "Liu Ji's counselor Cao Can said: 'Xiang Liang is brave and has merit, but cannot be subordinate to.'",
  "s0069": "Liu Ji was hesitant.",
  "s0070": "Cao Can said: 'If we go, we will become his subordinates; if we don't go, he will attack us.'",
  "s0071": "Liu Ji said: 'Then what to do?'",
  "s0072": "Cao Can said: 'Kill Xiang Liang, then the world will know your name.'",
  "s0073": "Liu Ji followed his plan, invited Xiang Liang to a banquet, killed him.",
  "s0074": "Xiang Liang's death caused the army to lose heart.",
  "s0075": "Xiang Ji heard of Xiang Liang's death, led troops east to Pengcheng.",
  "s0076": "He attacked Liu Ji at Xiapi, defeated him.",
  "s0077": "Liu Ji fled to Sui, Xiang Ji pursued and killed him.",
  "s0078": "Xiang Ji then gathered the Chu troops, established himself as general.",
  "s0079": "He sent Fan Zeng to Pengcheng to welcome King Huai.",
  "s0080": "King Huai made Xiang Ji 'Supreme General', ordered him to attack west."
}

