{
  "s0102": "Wei Ling Gong's wife was named Nan Zi, she sent someone to tell Confucius: 'Gentlemen from the four directions who do not consider it humiliating to become brothers with my lord must see my little lord.",
  "s0103": "My little lord wishes to see.'",
  "s0104": "Confucius declined politely, but had no choice and saw her.",
  "s0105": "The wife was in thin curtains.",
  "s0106": "Confucius entered the gate, faced north and bowed with hands to ground.",
  "s0107": "The wife bowed twice from within the curtains, her jade pendants clinking.",
  "s0108": "Confucius said: 'I wished not to see, having seen I respond with ritual.'",
  "s0109": "Zi Lu was displeased.",
  "s0110": "Confucius swore saying: 'If I have done wrong, Heaven reject me!",
  "s0111": "Heaven reject me!'",
  "s0112": "After staying in Wei over a month, Ling Gong and his wife rode in the same chariot, eunuch Yong Qu was the passenger, went out, made Confucius the next chariot, swaggered through the market past him.",
  "s0113": "Confucius said: 'I have never seen one who loves virtue like loving beauty.'",
  "s0114": "Thus he despised it and left Wei, passing through Cao.",
  "s0115": "This year, Lu Ding Gong died.",
  "s0116": "Confucius left Cao for Song, practicing ritual with disciples under a large tree.",
  "s0117": "Song commander Huan Tui wanted to kill Confucius, chopped down his tree.",
  "s0118": "Confucius left.",
  "s0119": "Disciples said: 'We can hurry.'",
  "s0120": "Confucius said: 'Heaven has endowed virtue in me, what can Huan Tui do to me!'",
  "s0121": "Confucius went to Zheng, became separated from his disciples, Confucius stood alone at the eastern gate of the outer wall.",
  "s0122": "A Zheng person told Zi Gong: 'There is a man at the eastern gate, his forehead resembles Yao, his neck resembles Gao Tao, his shoulders resemble Zi Chan, but from the waist down he is three cun shorter than Yu.",
  "s0123": "Wearily like a homeless dog.'",
  "s0124": "Zi Gong truthfully told Confucius.",
  "s0125": "Confucius smiled happily and said: 'Appearance is superficial.",
  "s0126": "But to say resembling a homeless dog, yes indeed!",
  "s0127": "Yes indeed!'",
  "s0128": "Confucius arrived at Chen, staying at the home of Director of Construction Zhen Zi.",
  "s0129": "Over a year, Wu King Fu Chai attacked Chen, took three cities and left.",
  "s0130": "Zhao Yang attacked Zhaoge.",
  "s0131": "Chu besieged Cai, Cai moved to Wu.",
  "s0132": "Wu defeated Yue King Gou Jian at Kuaiji.",
  "s0133": "A falcon gathered in the Chen court and died, pierced by a hu arrow, stone point, the arrow a chi and eight cun long.",
  "s0134": "Chen Min Gong sent an envoy to ask Confucius.",
  "s0135": "Confucius said: 'The falcon came from afar, this is a Su Shen arrow.",
  "s0136": "In the past when King Wu conquered Shang, he opened roads to the nine Yi and hundred Man, made each bring their local tribute to contribute, so they would not forget their duties.",
  "s0137": "Thus Su Shen contributed hu arrows and stone points, a chi and eight cun long.",
  "s0138": "The former kings wished to display their excellent virtue, divided the Su Shen arrows to give to Da Ji, matched with Yu Hu Gong and enfeoffed them at Chen.",
  "s0139": "Divided same surnames with precious jade to display closeness;",
  "s0140": "divided different surnames with distant duties so they would not forget submission.",
  "s0141": "Therefore divided Chen with Su Shen arrows.'",
  "s0142": "They tried seeking in the old treasury, indeed found them.",
  "s0143": "Confucius stayed in Chen three years, when Jin and Chu contended for strength, alternately attacking Chen, and Wu invaded Chen, Chen was constantly raided.",
  "s0144": "Confucius said: 'Return home!",
  "s0145": "Return home!",
  "s0146": "My party's youths are simple and ardent, advancing and gaining without forgetting their beginnings.'",
  "s0147": "Thus Confucius left Chen.",
  "s0148": "Passing through Pu, encountered Gong Shu clan rebelling with Pu, Pu people stopped Confucius.",
  "s0149": "Among disciples was Gong Liang Ru, who followed Confucius with five private chariots.",
  "s0150": "His character was tall and worthy, with courage and strength, he said: 'I once followed master and encountered difficulty at Kuang, now encounter difficulty here again, it is fate.",
  "s0151": "I and master have suffered difficulty twice, would rather fight and die.'"
}