{
  "s0172": {
    "chinese": "周公旦即王所，曰：「曷為不寐？」",
    "literal": "King Xiao died, King Li ascended.",
    "idiomatic": "The Duke of Zhou approached the king's quarters and said: 'Why can you not sleep?'"
  },
  "s0173": {
    "chinese": "王曰：「告女：維天不饗殷，自發未生於今六十年，麋鹿在牧，蜚鴻滿野。",
    "literal": "King Li was tyrannical, the common people rebelled.",
    "idiomatic": "The king said: 'I tell you: Heaven no longer accepts offerings from Yin. From the time Fa was born until now, sixty years have passed. Deer roam in the pastures, wild geese fill the fields."
  },
  "s0174": {
    "chinese": "天不享殷，乃今有成。",
    "literal": "King Li fled to Zhi, died there.",
    "idiomatic": "Heaven does not accept Yin's offerings, and now success has come.'"
  },
  "s0175": {
    "chinese": "維天建殷，其登名民三百六十夫，不顯亦不賓滅，以至今。",
    "literal": "The common people made Duke Wu of Gonghe regent.",
    "idiomatic": "Heaven established Yin, raising up worthy men numbering 360, but they were neither illustrious nor submissive to extinction, lasting until now.'"
  },
  "s0176": {
    "chinese": "我未定天保，何暇寐！」",
    "literal": "Fourteen years, King Xuan ascended, the Gonghe administration ended.",
    "idiomatic": "I have not yet secured Heaven's protection - how can I sleep!'"
  },
  "s0177": {
    "chinese": "王曰：「定天保，依天室，悉求夫惡，貶從殷王受。",
    "literal": "King Xuan revived Zhou's prosperity, moved the capital to Luoyi.",
    "idiomatic": "The king said: 'To secure Heaven's protection, rely on the heavenly abode, seek out all the evil ones, demote those who followed King Zhou of Yin."
  },
  "s0178": {
    "chinese": "日夜勞來定我西土，我維顯服，及德方明。",
    "literal": "He attacked the Quanrong, drove them out.",
    "idiomatic": "Day and night work to secure my western lands. I will be illustrious and submissive, and virtue will shine forth."
  },
  "s0179": {
    "chinese": "自洛汭延于伊汭，居易毋固，其有夏之居。",
    "literal": "He attacked the Jiang, defeated them.",
    "idiomatic": "From the Luo bend extending to the Yi bend, dwell peacefully without stubbornness, possessing the dwelling of Xia.'"
  },
  "s0180": {
    "chinese": "我南望三涂，北望嶽鄙，顧詹有河，粵詹雒、伊，毋遠天室。」",
    "literal": "He attacked the Xu Yan, captured their king.",
    "idiomatic": "I look south to Santu, north to the borders of Mount Yue, see the Yellow River, and also the Luo and Yi rivers, not far from the heavenly abode.'"
  },
  "s0181": {
    "chinese": "營周居于雒邑而後去。",
    "literal": "Two younger brothers of the same mother, Yi Zhongyan, gave birth to Gongsun Wuzhi.",
    "idiomatic": "He built the Zhou settlement at Luoyi and then departed."
  },
  "s0182": {
    "chinese": "縱馬於華山之陽，放牛於桃林之虛；",
    "literal": "He let horses run free on the southern slopes of Mount Hua, released oxen in the wilderness of Taolin;",
    "idiomatic": "He let horses run free on the southern slopes of Mount Hua, released oxen in the wilderness of Taolin;"
  },
  "s0183": {
    "chinese": "偃干戈，振兵釋旅：示天下不復用也。",
    "literal": "Laid down weapons and spears, rested the troops and dismissed the armies: showing the world they would not be used again.",
    "idiomatic": "Laid down weapons and spears, rested the troops and dismissed the armies: showing the world they would not be used again."
  },
  "s0184": {
    "chinese": "武王已克殷，後二年，問箕子殷所以亡。",
    "literal": "King Wu had already conquered Yin, two years later asked Jizi why Yin perished.",
    "idiomatic": "King Wu had already conquered Yin; two years later, he asked Ji Zi why Yin had perished."
  },
  "s0185": {
    "chinese": "箕子不忍言殷惡，以存亡國宜告。",
    "literal": "Jizi could not bear to speak of Yin's evils, so spoke of the principles for preserving and destroying states.",
    "idiomatic": "Ji Zi could not bear to speak of Yin's evils, so spoke of the principles for the preservation and destruction of states."
  },
  "s0186": {
    "chinese": "武王亦醜，故問以天道。",
    "literal": "King Wu also considered it shameful, so asked about the Way of Heaven.",
    "idiomatic": "King Wu also considered it shameful, so asked about the Way of Heaven."
  },
  "s0187": {
    "chinese": "武王病。",
    "literal": "King Wu died in the twelfth year, King Cheng ascended.",
    "idiomatic": "King Wu fell ill."
  },
  "s0188": {
    "chinese": "天下未集，群公懼，穆卜，周公乃祓齋，自為質，欲代武王，武王有瘳。",
    "literal": "King Cheng was young, the Duke of Zhou acted as regent.",
    "idiomatic": "The world was not yet settled, the nobles were afraid. They divined with the tortoise shell, and the Duke of Zhou purified himself and fasted, offered himself as hostage, wishing to take King Wu's place. King Wu recovered."
  },
  "s0189": {
    "chinese": "後而崩，太子誦代立，是為成王。",
    "literal": "The three guards rebelled, the Duke of Zhou put down the rebellion.",
    "idiomatic": "Later he died, and Crown Prince Song succeeded him, known as King Cheng."
  },
  "s0190": {
    "chinese": "成王少，周初定天下，周公恐諸侯畔周，公乃攝行政當國。",
    "literal": "He moved the Yin people to Luo, established the eastern capital.",
    "idiomatic": "King Cheng was young, Zhou had just pacified the world. The Duke of Zhou feared the feudal lords might rebel against Zhou, so he acted as regent and administered the government."
  },
  "s0191": {
    "chinese": "管叔、蔡叔群弟疑周公，與武庚作亂，畔周。",
    "literal": "He made the Shao Proclamation, established the ritual system.",
    "idiomatic": "Guan Shu, Cai Shu, and the other brothers suspected the Duke of Zhou, and together with Wu Geng they rebelled against Zhou."
}
}
