{
  "s5614": "Twenty-six, feared Chu, secretly summoned Wu people, begged to move to Zhou Lai, Zhou Lai near Wu.",
  "s5616": "Eight, rescued Fan and Zhong Xing clan, fought with Zhao Yang at Tie, defeated our army.",
  "s5622": "Three, earthquake.",
  "s5627": "Twenty-five, Confucius passed through Song, Huan Hui disliked him.",
  "s5628": "First year of Wei Chu Gong (Zhe)",
  "s5631": "Ten, Song attacked us.",
  "s5633": "First year of Duke Xian of Yan",
  "s5639": "Fifty-seven, begged to rescue Fan clan.",
  "s5640": "Twenty-one, Zhao Yang took Han Dan and Bo Ren, possessed them.",
  "s5641": "Ten, Duke Hui died.",
  "s5646": "Twenty-eight, grandees together executed Duke Zhao.",
  "s5655": "Fifty-eight, Duke Jing died. Established favored consort's son as crown prince.",
  "s5656": "Twenty-two, Zhao Yang defeated Fan Zhong Xing, Zhong Xing fled to Qi. Attacked Wei.",
  "s5657": "First year of Duke Dao of Qin",
  "s5660": "Three, Jin attacked us, because of rescuing Fan clan.",
  "s5662": "First year of Duke Cheng of Cai (Shuo)",
  "s5671": "First year of Qi Yan Ru Zi, Tian Qi falsely established Yang Sheng, killed Ru Zi.",
  "s5674": "Twenty-seven, rescued Chen, king died at Cheng Fu.",
  "s5675": "Twenty-eight, attacked Cao.",
  "s5677": "Thirteen, Wu attacked us, Chu came to rescue.",
  "s5679": "Thirteen, Song attacked us.",
  "s5682": "Seven, attacked Chen.",
  "s5686": "Seven, duke assembled with Wu king at Zeng. Wu demanded hundred sacrificial animals, Ji Kang Zi sent Zi Gong to decline.",
  "s5687": "First year of Duke Dao of Qi (Yang Sheng)",
  "s5688": "Twenty-four, invaded Wei.",
  "s5690": "First year of King Hui of Chu (Zhang)",
  "s5691": "Twenty-nine, invaded Zheng, besieged Cao.",
  "s5692": "Five, Jin invaded us.",
  "s5695": "Fourteen, Song besieged us, Zheng rescued us.",
  "s5698": "Eight, Lu assembled with us at Zeng.",
  "s5700": "Jia Yin",
  "s5702": "Eight, Wu for Zhu attacked us, reached city walls, made alliance and withdrew. Qi took our three towns.",
  "s5703": "Two, attacked Lu, took three towns.",
  "s5706": "Two, Zi Xi summoned Jian Zi Sheng from Wu, became Bai Gong.",
  "s5707": "Thirty, Cao doubled us, we extinguished them.",
  "s5711": "Fifteen, Song extinguished Cao, captured Bo Yang.",
  "s5714": "Nine, attacked Lu.",
  "s5722": "Three, attacked Chen, because of Chen and Wu alliance.",
  "s5723": "Thirty-one, Zheng besieged us, defeated them at Yong Qiu.",
  "s5725": "Sixteen, doubled Chu, allied with Wu.",
  "s5728": "Fifteen, besieged Song, defeated our army at Yong Qiu, attacked us.",
  "s5734": "Ten, with Wu attacked Qi.",
  "s5735": "Four, Wu and Lu attacked us. Bao Zi assassinated Duke Dao, Qi people established his son Ren as Duke Jian.",
  "s5736": "Twenty-seven, sent Zhao Yang to attack Qi.",
  "s5738": "Four, attacked Chen.",
  "s5739": "Thirty-two, attacked Zheng.",
  "s5740": "Eight, Confucius came from Chen.",
  "s5746": "Eleven, with Lu attacked Qi to rescue Chen. Executed Wu Yuan.",
  "s5750": "Eleven, Qi attacked us. Ran You spoke, therefore welcomed Confucius, Confucius returned.",
  "s5751": "First year of Duke Jian of Qi, Lu with Wu defeated us."
}