{
  "s0001": "When Han arose, following Qin's exhaustion, men served in the military, the old and weak transported provisions, labor was intense and wealth scarce. Even the emperor could not provide matched horses for his carriage, while generals and chancellors sometimes rode ox-carts, and the common people had no stored wealth.",
  "s0002": "Therefore they changed Qin's heavy and difficult money, ordering the people to cast money, one jin of gold equaling one piece, establishing laws with simplified prohibitions.",
  "s0003": "But lawless profit-seeking people accumulated surplus goods to manipulate market prices, goods soared in price, rice reached ten thousand cash per shi, a horse cost one hundred jin.",
  "s0004": "When the realm was pacified, Gaozu ordered merchants not to wear silk or ride carriages, heavily taxing them to distress and humiliate them.",
  "s0005": "During Emperor Hui and Empress Dowager Gao's time, as the realm was initially settled, they relaxed the laws against merchants and traders, but market children and descendants also could not serve as officials or clerks.",
  "s0006": "They measured officials' salaries, assessed government expenses, and levied taxes on the people.",
  "s0007": "Mountain, river, garden, pool, and market tax revenues, from the emperor down to the enfeoffed lords' bathing cities, each maintained their own private support, not overseen by the realm's regular expenses.",
  "s0008": "They transported Shandong grain to supply the capital officials, yearly not exceeding several tens of thousands of shi.",
  "s0009": "By Emperor Wen's time, Jia money increased greatly, becoming light, so they recast four zhu money, its inscription 'half liang', allowing people to freely cast money themselves.",
  "s0010": "Therefore Wu, a feudal lord, by casting money at the mountains, became as rich as the emperor, afterward finally rebelled.",
  "s0011": "Deng Tong, a grand master, became richer than kings through casting money.",
  "s0012": "Therefore Wu and Deng money circulated throughout the realm, and money-casting prohibitions arose.",
  "s0013": "The Xiongnu frequently invaded and plundered the northern borders, garrison troops were many, border grain insufficient to supply those who should eat.",
  "s0014": "Therefore they recruited people who could transport and deliver grain to the borders to grant nobility titles, nobility reaching great commoner.",
  "s0015": "During Emperor Jing's time, Shangjun and west suffered drought, also revived the sell nobility order, reducing prices to attract people;",
  "s0016": "and those who migrated and worked could deliver grain to county officials to erase crimes.",
  "s0017": "They increasingly created park horses to expand use, while palace chambers and viewing towers, carriages and horses increased repairs.",
  "s0018": "Until the present emperor ascended the throne several years, in the seventy plus years since Han arose, the state had no affairs, not encountering water or drought disasters, people had sufficient households, cities and countryside granaries were all full, government treasuries had surplus goods and wealth.",
  "s0019": "Capital money accumulated in vast tens of thousands, strings rotted and could not be counted.",
  "s0020": "Great granary grain piled layer upon layer, overflowing and exposed outside, rotting until inedible.",
  "s0021": "Common people in streets and lanes had horses, on paths between fields in groups, those riding castrated horses could not gather.",
  "s0022": "Gate guards ate fine grain and meat, officials' sons and grandsons grew up, those in office took it as clan names.",
  "s0023": "Therefore people naturally cherished themselves and feared breaking laws, practiced righteousness before worrying about shame and disgrace.",
  "s0024": "During this time, the net was loose and people rich, wealth overflowed with arrogance, some even became powerful bullies who arbitrarily decided in villages.",
  "s0025": "Imperial clan members from dukes, ministers, grand masters downward competed in luxury, chambers, carriages, clothing exceeded superiors, without limits.",
  "s0026": "Things flourish then decline, naturally their change.",
  "s0027": "From this after, Yan Xu, Zhu Mai Chen and others summoned Dong Ou, handled two Yue affairs, Jiang Huai region became desolate and troubled with expenses.",
  "s0028": "Tang Meng, Sima Xiangru opened roads to southwestern barbarians, chiseled mountains to open paths over a thousand li, to expand Ba Shu, Ba Shu people were exhausted.",
  "s0029": "Peng Wu Jia extinguished Chaoxian, established Cang Hai commandery, then Yan Qi region became active with mobilization.",
  "s0030": "When Wang Hui devised the Mai Yi strategy, Xiongnu cut off friendly relations, invaded and disturbed northern borders, wars connected without resolution, the realm suffered their labor, weapons increased daily.",
  "s0031": "Travelers carried provisions, residents sent off, inside and outside disturbed mutually supporting, people wearied to death using clever laws, bribes depleted without sufficiency.",
  "s0032": "Those bringing goods supplemented officials, those giving wealth erased crimes, selection declined, integrity and shame deceived each other, military strength advanced in use, laws strict and orders complete.",
  "s0033": "Profit-making ministers began from this.",
  "s0034": "Afterward Han generals yearly went out with tens of thousands of cavalry to attack Hu, and chariot cavalry general Wei Qing took Xiongnu Henan land, built Shuofang.",
  "s0035": "During this time, Han opened southwestern barbarian roads, workers tens of thousands, thousand li carrying burdens feeding grain, rate over ten zhong delivered one shi, scattered currency among Qiong Bo to gather them.",
  "s0036": "Several years road not passable, barbarians then frequently attacked, officials sent troops to punish them.",
  "s0037": "All Ba Shu taxes insufficient to replace them, so recruited rich people to farm southern barbarians, deliver grain to county officials, while receiving money from capital internally.",
  "s0038": "East to Cang Hai commandery, people transport expenses compared to southern barbarians.",
  "s0039": "Also raised over one hundred thousand to build guard Shuofang, transport very distant, from Shandong all suffered their labor, expenses tens to hundreds of vast millions, treasuries increasingly empty.",
  "s0040": "Therefore recruited people who could enter slave girls to get lifelong exemption, for gentleman increased rank, and entering sheep for gentleman, began from this.",
  "s0041": "After four years, Han sent great general leading six generals, army over one hundred thousand, attacked Right Wise King, captured heads and captives fifteen thousand.",
  "s0042": "Next year, great general led six generals again went out to attack Hu, got heads and captives nineteen thousand.",
  "s0043": "Soldiers who captured and beheaded received reward gold over twenty thousand jin, tens of thousands captives all got rich rewards, clothing and food dependent on county officials;",
  "s0044": "while Han army soldiers and horses dead over one hundred thousand, weapons and armor property transport expenses not included.",
  "s0045": "Therefore great agronomist Chen Cang money exhausted, taxes already depleted, still insufficient to support warriors.",
  "s0046": "Officials said: 'The emperor said 'I heard the five emperors' teachings not repeated but governed, Yu and Tang's methods different paths but became kings, origins different roads, but establishing virtue one.'",
  "s0047": "Northern border not peaceful, I greatly lament it.",
  "s0048": "Recently, great general attacked Xiongnu, beheaded captives nineteen thousand, remaining captives no food to eat.",
  "s0049": "Discuss ordering people to buy nobility and redeem forbidden imprisoned reduce crimes.'",
  "s0050": "Please establish reward officials, named martial merit nobility."
}
