{
  "s1003": "Two. Year 11 month 1 Ji Wei day, Marquis Xiao Gongsun Er year 1.",
  "s1004": "Seven",
  "s1005": "Eight",
  "s1006": "Four. Year 5, Marquis Huai Jian year 1. Nine. Year 14, Marquis Jian died, no heir, state abolished.",
  "s1009": "One hundred seventeen",
  "s1010": "Tangyang.",
  "s1011": "As attendant followed uprising in Pei, as palace attendant entered Han, as general attacked Ji, became Hui Hou. Convicted of guarding Xingyang surrendered to Chu dismissed. Later returned, as palace attendant attacked Ji, became Shangdang governor, attacked Xi, became marquis, 800 households.",
  "s1012": "Two. Year 11 month 1 Ji Wei day, Marquis Ai Sun Chi year 1.",
  "s1013": "Seven",
  "s1014": "Eight. Year 1, Marquis De year 1.",
  "s1015": "Twenty-three",
  "s1016": "Twelve. Zhong year 6, Marquis De committed crime, state abolished.",
  "s1018": "Seventy-seven",
  "s1019": "Zhu'a.",
  "s1020": "As guest followed uprising in Nie Sang, as upper detachment general entered Han, as general pacified Wei Taiyuan, broke Jingxing, attached to Han Xin, as Zhi Du army attacked Ji and attacked Xi, became marquis, 800 households.",
  "s1021": "Two. Year 11 month 1 Ji Wei day, Marquis Xiao Gao Yi year 1.",
  "s1022": "Seven",
  "s1023": "Eight",
  "s1024": "Four. Year 5, Marquis Cheng year 1. Fourteen. After year 3, Marquis Cheng convicted of affairs violating laws, state abolished.",
  "s1027": "Seventy-four",
  "s1028": "Changxiu.",
  "s1029": "As Han year 2 used Grand Master of the Court initially followed exiting passes, as Interior Minister attacked various lords, meritorious service comparable to Marquis of Xuchang, as Court Judge died in service, 1,900 households.",
  "s1030": "Two. Year 11 month 1 Bing Chen day, Marquis Ping Du Tian year 1.",
  "s1031": "Two. Five. Year 3, Marquis Huai Zhong year 1.",
  "s1032": "Eight",
  "s1033": "Four. Nineteen. Year 5, Marquis Xi year 1.",
  "s1034": "Eight. Committed crime extinct. Yangping five. Zhong year 5, re-enfeoffed; Marquis Xiang Fu year 1.",
  "s1035": "Thirty-three. Yuanfeng year 4, Marquis Xiang Fu convicted as Grand Master of Ceremonies together with Music Official Wu Ke Dang Zheng dancer arbitrarily used labor not according to regulations, secretly exited Hangu Pass, state abolished.",
  "s1036": "One hundred eight",
  "s1037": "Jiangyi.",
  "s1038": "As Han year 5 Grand Master of the Court, used clever strategy moved Grand Master of the Court Zhou Chang to Zhao chancellor and replaced him, followed attacking Chen Xi, meritorious service led to marquisate, 600 households.",
  "s1039": "Two. Year 11 month 1 Xin Wei day, Marquis Zhao Yao year 1.",
  "s1040": "Seven",
  "s1041": "Year 1, Marquis Yao committed crime, state abolished.",
  "s1046": "Yingling.",
  "s1047": "As Han year 3 palace attendant, attacked Xiang Yu, as general attacked Chen Xi, got Wang Huang, became marquis. Distant relative of Liu clan with Gaozu, generations served as Commandant of the Guards. 12,000 households.",
  "s1048": "Two. Year 11, Marquis Liu Ze year 1.",
  "s1049": "Seven",
  "s1050": "Five. Year 6, Marquis Ze became King of Langya, state abolished.",
  "s1054": "Eighty-eight",
  "s1055": "Tu Jun.",
  "s1056": "Gaozu year 6 as Zhongdi governor, as Court Judge attacked Chen Xi, became marquis, 1,200 households. Went to fief, later became Yan chancellor.",
  "s1057": "Two. Year 11 month 2 Ding Hai day, Marquis Wu Xuan Yi year 1.",
  "s1058": "Five. Two. Year 6, Marquis Xiao Mo Ru year 1.",
  "s1059": "Eight",
  "s1060": "Twenty-three",
  "s1061": "Two. Fourteen. Year 3, Marquis Kang Ping year 1.",
  "s1062": "Five. Jianyuan year 6, Marquis Sheng year 1. Eight. Yuanshuo year 2, Sheng convicted of adultery with someone's wife, state abolished.",
  "s1063": "One hundred twelve",
  "s1064": "Guang'e."
}
