{
  "s6": "206",
  "s7": "High Emperor first year",
  "s8": "Spring, Lord Pei becomes Han King, goes to Nanzheng. Autumn, returns and pacifies Yong.",
  "s9": "One. Chancellor Xiao He guards Hanzhong.",
  "s11": "Imperial Secretary Zhou Ke guards Xingyang.",
  "s12": "205",
  "s13": "Two",
  "s14": "Spring, pacifies Sai, Di, Wei, Henan, Han, Yin states. Summer, attacks Xiang Ji, reaches Pengcheng. Establishes Crown Prince. Returns and holds Xingyang.",
  "s15": "Two. Guards Guanzhong.",
  "s16": "One. Grand Commandant Marquis of Chang'an Lu Wan.",
  "s18": "204",
  "s19": "Three",
  "s20": "Wei Bao rebels. Sends Han Xin to separately pacify Wei, attacks Zhao. Chu surrounds our Xingyang.",
  "s21": "Three",
  "s22": "Two",
  "s24": "203",
  "s25": "Four",
  "s26": "Sends Han Xin to separately pacify Qi and Yan, Duke returns from Chu, establishes boundary with Chu at Hongqu.",
  "s27": "Four",
  "s28": "Three. Zhou Ke guards Xingyang, dies.",
  "s29": "Imperial Secretary Marquis of Fenyin Zhou Chang.",
  "s30": "202",
  "s31": "Five",
  "s32": "Winter, defeats Chu at Gaixia, kills Xiang Ji. Spring, King ascends emperor position at Dingtao. Enters capital at Guanzhong.",
  "s33": "Five. Abolishes Grand Commandant office.",
  "s34": "Four. Ninth month after, Wan becomes King of Yan.",
  "s36": "201",
  "s37": "Six",
  "s38": "Honors Duke as Taishang Huang. Liu Zhong becomes King of Dai. Establishes grand market. Renames Xianyang as Chang'an.",
  "s39": "Six. Sealed as Marquis of Tan. Zhang Cang becomes Minister of Accounts.",
  "s42": "200",
  "s43": "Seven",
  "s44": "Chang Le Palace completed, moves from Queyang to Chang'an. Attacks Xiongnu, Xiongnu surrounds our Pingcheng.",
  "s45": "Seven",
  "s48": "199",
  "s49": "Eight",
  "s50": "Strikes Han Xin rebel captives at Zhao city. Guan Gao creates disorder, next year discovered, executes him. Xiongnu attacks Dai King, Dai King abandons state and flees, deposed as Marquis of Heyang.",
  "s51": "Eight",
  "s54": "198",
  "s55": "Nine",
  "s56": "Weiyang Palace completed, holds banquet in front hall, Taishang Huang chariot enters and sits, Emperor offers jade cup and toasts longevity, says: 'Beginning I always considered subject inferior to Zhong's strength, now subject's merit compared to Zhong who has more?' Taishang Huang laughs, hall proclaims ten thousand years. Moves Qi Tian, Chu Zhao, Qu, Jing to Guanzhong.",
  "s57": "Nine. Promoted to Prime Minister.",
  "s59": "Imperial Secretary Chang becomes Zhao Chancellor.",
  "s60": "197",
  "s61": "Ten",
  "s62": "Taishang Huang passes away. Chen Xi rebels in Dai territory.",
  "s63": "Ten",
  "s65": "Imperial Secretary Marquis of Jiangyi Zhao Yao.",
  "s66": "196"
}
