{
  "s0001": {
    "chinese": "孝文皇帝，高祖中子也。",
    "literal": "Xiaowen Emperor, Gaozu middle son also.",
    "idiomatic": "Emperor Xiaowen was Gaozu's middle son."
  },
  "s0002": {
    "chinese": "高祖十一年春，已破陳豨軍，定代地，立為代王，都中都。",
    "literal": "Gaozu eleventh year spring, already broken Chen Xi army, pacified Dai lands, established as Dai King, capital Zhongdu.",
    "idiomatic": "In the spring of Gaozu's eleventh year, after defeating Chen Xi's army and pacifying the Dai region, he was established as King of Dai with his capital at Zhongdu."
  },
  "s0003": {
    "chinese": "太后薄氏子。",
    "literal": "Empress Dowager Bo clan son.",
    "idiomatic": "He was the son of Empress Dowager Bo."
  },
  "s0004": {
    "chinese": "即位十七年，高后八年七月，高后崩。",
    "literal": "Ascended throne seventeen years, Gao Hou eighth year seventh month, Gao Hou collapsed.",
    "idiomatic": "He ascended the throne in the seventeenth year of his reign. In the seventh month of Empress Gao's eighth year, Empress Gao passed away."
  },
  "s0005": {
    "chinese": "九月，諸呂呂產等欲為亂，以危劉氏，大臣共誅之，謀召立代王，事在呂后語中。",
    "literal": "Ninth month, various Lu Lu Chan etc. desired to make rebellion, to endanger Liu clan, ministers together executed them, plotted to summon and establish Dai King, matter in Lu Hou words midst.",
    "idiomatic": "In the ninth month, the Lü clansmen led by Lü Chan plotted rebellion to endanger the Liu clan. The ministers executed them together and plotted to summon and establish the King of Dai. This matter is detailed in the Lü Empress Dowager's biography."
  },
  "s0006": {
    "chinese": "丞相陳平、太尉周勃等使人迎代王。",
    "literal": "Chancellor Chen Ping, Grand Marshal Zhou Bo etc. sent people to welcome Dai King.",
    "idiomatic": "Chancellor Chen Ping, Grand Marshal Zhou Bo, and others sent people to welcome the King of Dai."
  },
  "s0007": {
    "chinese": "代王問左右郎中令張武等。",
    "literal": "Dai King asked left and right Chamberlain for Attendants Zhang Wu etc.",
    "idiomatic": "The King of Dai consulted with his attendants including Chamberlain for Attendants Zhang Wu."
  },
  "s0008": {
    "chinese": "張武等議曰：「漢大臣皆故高帝時大將，習兵，多謀詐，此其屬意非止此也，特畏高帝、呂太后威耳。",
    "literal": "Zhang Wu etc. discussed said: 'Han ministers all former Gao Di time great generals, practiced in arms, many stratagems and deceits, this their intentions not stop here also, especially feared Gao Di, Lu Empress Dowager awe only.",
    "idiomatic": "Zhang Wu and the others discussed: 'The Han ministers are all great generals from the time of Emperor Gao. They are experienced in warfare and full of stratagems. Their intentions go beyond this - they only fear the awe-inspiring presence of Emperor Gao and Empress Dowager Lü.'"
  },
  "s0009": {
    "chinese": "今已誅諸呂，新啑血京師，此以迎大王為名，實不可信。",
    "literal": "Now already executed various Lu, fresh blood stains capital, this with welcome great king as name, reality not trustworthy.",
    "idiomatic": "Now that the Lü clansmen have been executed and fresh blood stains the capital, their claim to welcome Your Majesty is just a pretense and cannot be trusted."
  },
  "s0010": {
    "chinese": "願大王稱疾毋往，以觀其變。」",
    "literal": "Wish great king claim illness do not go, to observe their changes.'",
    "idiomatic": "We urge Your Majesty to feign illness and not go, so we can observe how the situation develops.'"
  },
  "s0011": {
    "chinese": "中尉宋昌進曰：「群臣之議皆非也。",
    "literal": "Commandant Song Chang advanced said: 'The various ministers' discussions all wrong also.",
    "idiomatic": "Commandant Song Chang stepped forward and said: 'All the ministers' discussions are wrong."
  },
  "s0012": {
    "chinese": "夫秦失其政，諸侯豪桀并起，人人自以為得之者以萬數，然卒踐天子之位者，劉氏也，天下絕望，一矣。",
    "literal": "Indeed Qin lost its governance, feudal lords outstanding men rose together, everyone self considered obtain it ones by ten thousands count, yet finally trod Son of Heaven position ones Liu clan also, realm despaired, one also.",
    "idiomatic": "When Qin lost its mandate, feudal lords and outstanding men rose up together. Tens of thousands considered themselves worthy of the throne, yet in the end it was the Liu clan who ascended the imperial position. The realm had lost all hope - that was the first reason."
  },
  "s0013": {
    "chinese": "高帝封王子弟，地犬牙相制，此所謂盤石之宗也，天下服其彊，二矣。",
    "literal": "Gao Di enfeoffed sons and younger brothers, lands interlocking like dog teeth mutually controlled, this called bedrock clan also, realm submitted to its strength, two also.",
    "idiomatic": "Emperor Gao enfeoffed his sons and brothers with interlocking territories that controlled each other like interlocking dog teeth. This was what is called an unshakeable clan foundation. The realm submitted to its power - that was the second reason."
  },
  "s0014": {
    "chinese": "漢興，除秦苛政，約法令，施德惠，人人自安，難動搖，三矣。",
    "literal": "Han rose, eliminated Qin harsh governance, simplified laws and commands, applied virtue and favor, everyone self at peace, difficult to shake, three also.",
    "idiomatic": "When the Han arose, they eliminated Qin's harsh rule, simplified the laws and commands, and bestowed virtue and favor. Everyone lived in peace and was difficult to unsettle - that was the third reason."
  },
  "s0015": {
    "chinese": "夫以呂太后之嚴，立諸呂為三王，擅權專制，然而太尉以一節入北軍，一呼士皆左袒，為劉氏，叛諸呂，卒以滅之。",
    "literal": "Indeed with Lu Empress Dowager strictness, established various Lu as three kings, monopolized power and controlled exclusively, however Grand Marshal with one tally entered Northern Army, one shout soldiers all bared left arms, for Liu clan, rebelled against various Lu, finally with extinguished them.",
    "idiomatic": "Despite Empress Dowager Lü's strict rule and her establishment of three Lü kings who monopolized power, the Grand Marshal entered the Northern Army with just one tally. With one shout, all the soldiers bared their left arms for the Liu clan, rebelled against the Lü clan, and finally destroyed them."
  },
  "s0016": {
    "chinese": "此乃天授，非人力也。",
    "literal": "This then Heaven bestowed, not human strength also.",
    "idiomatic": "This was Heaven's gift, not achieved through human effort."
  },
  "s0017": {
    "chinese": "今大臣雖欲為變，百姓弗為使，其黨寧能專一邪？",
    "literal": "Now ministers although desire to make change, common people not for them make, their faction how able unified question?",
    "idiomatic": "Now even if the ministers wanted to rebel, the common people would not follow them. How could their faction remain united?"
  },
  "s0018": {
    "chinese": "方今內有朱虛、東牟之親，外畏吳、楚、淮南、瑯邪、齊、代之彊。",
    "literal": "Present time internally has Zhu Xu, Dong Mou relatives, externally fears Wu, Chu, Huainan, Langye, Qi, Dai strength.",
    "idiomatic": "At present, internally we have the support of relatives in Zhuxu and Dongmou, externally we fear the strength of Wu, Chu, Huainan, Langye, Qi, and Dai."
  },
  "s0019": {
    "chinese": "方今高帝子獨淮南王與大王，大王又長，賢聖仁孝，聞於天下，故大臣因天下之心而欲迎立大王，大王勿疑也。」",
    "literal": "Present time Gao Di sons only Huainan King and great king, great king moreover elder, worthy sage benevolent filial, heard throughout realm, therefore ministers follow realm heart and desire welcome establish great king, great king do not doubt also.'",
    "idiomatic": "Among Emperor Gao's surviving sons, only the King of Huainan and Your Majesty remain. Your Majesty is also the elder, and your worthiness, wisdom, benevolence, and filial piety are renowned throughout the realm. Therefore, the ministers, following the will of the people, wish to welcome and establish Your Majesty. Your Majesty should have no doubts.'"
  },
  "s0020": {
    "chinese": "代王報太后計之，猶與未定。",
    "literal": "Dai King reported to Empress Dowager planned it, still with undecided.",
    "idiomatic": "The King of Dai reported to Empress Dowager Bo and consulted her about it, but they were still undecided."
  },
  "s0021": {
    "chinese": "卜之龜，卦兆得大橫。",
    "literal": "Divined with turtle, hexagram signs obtained great horizontal.",
    "idiomatic": "They divined with a turtle shell and obtained the hexagram 'Great Horizontal.'"
  },
  "s0022": {
    "chinese": "占曰：「大橫庚庚，余為天王，夏啟以光。」",
    "literal": "Divination said: 'Great horizontal geng geng, I become Heaven King, Xia Qi with light.'",
    "idiomatic": "The divination said: 'Great horizontal, geng geng - I shall become the Heavenly King, like Xia Qi shining with light.'"
  },
  "s0023": {
    "chinese": "代王曰：「寡人固已為王矣，又何王？」",
    "literal": "Dai King said: 'I already solidly am king already, again what king?'",
    "idiomatic": "The King of Dai said: 'I am already a king. What other king could this mean?'"
  },
  "s0024": {
    "chinese": "卜人曰：「所謂天王者乃天子。」",
    "literal": "Diviner said: 'So-called Heaven King namely Son of Heaven.'",
    "idiomatic": "The diviner said: 'The so-called Heavenly King refers to the Son of Heaven.'"
  },
  "s0025": {
    "chinese": "於是代王乃遣太后弟薄昭往見絳侯，絳侯等具為昭言所以迎立王意。",
    "literal": "Thereupon Dai King then dispatched Empress Dowager younger brother Bo Zhao go see Jiang Hou, Jiang Hou etc. fully for Zhao spoke reason welcome establish king intention.",
    "idiomatic": "Thereupon the King of Dai dispatched Empress Dowager Bo's younger brother Bo Zhao to see the Marquis of Jiang. The Marquis of Jiang and others fully explained to Bo Zhao the reasons for welcoming and establishing the king."
  },
  "s0026": {
    "chinese": "薄昭還報曰：「信矣，毋可疑者。」",
    "literal": "Bo Zhao returned reported said: 'Trustworthy already, no can doubt ones.'",
    "idiomatic": "Bo Zhao returned and reported: 'It's trustworthy. There should be no doubts.'"
  },
  "s0027": {
    "chinese": "代王乃笑謂宋昌曰：「果如公言。」",
    "literal": "Dai King then laughed told Song Chang said: 'Indeed like gentleman words.'",
    "idiomatic": "The King of Dai then laughed and told Song Chang: 'Indeed, just as you said.'"
  },
  "s0028": {
    "chinese": "乃命宋昌參乘，張武等六人乘傳詣長安。",
    "literal": "Then ordered Song Chang ride as attendant, Zhang Wu etc. six people ride relay carriages go to Chang'an.",
    "idiomatic": "He then ordered Song Chang to ride as his chariot attendant, and Zhang Wu and five others to ride relay carriages to Chang'an."
  },
  "s0029": {
    "chinese": "至高陵休止，而使宋昌先馳之長安觀變。",
    "literal": "Reached Gaoling rested stopped, and made Song Chang first gallop to Chang'an observe changes.",
    "idiomatic": "They reached Gaoling and rested there, while sending Song Chang ahead to gallop to Chang'an and observe the situation."
  },
  "s0030": {
    "chinese": "昌至渭橋，丞相以下皆迎。",
    "literal": "Chang reached Wei Bridge, Chancellor and below all welcomed.",
    "idiomatic": "When Chang reached the Wei Bridge, the Chancellor and all below him came to welcome him."
  },
  "s0031": {
    "chinese": "宋昌還報。",
    "literal": "Song Chang returned reported.",
    "idiomatic": "Song Chang returned and reported."
  },
  "s0032": {
    "chinese": "代王馳至渭橋，群臣拜謁稱臣。",
    "literal": "Dai King galloped to Wei Bridge, ministers bowed and audience called minister.",
    "idiomatic": "The King of Dai galloped to the Wei Bridge, where the ministers bowed in audience and addressed him as minister."
  },
  "s0033": {
    "chinese": "代王下車拜。",
    "literal": "Dai King descended chariot bowed.",
    "idiomatic": "The King of Dai descended from his chariot and bowed."
  },
  "s0034": {
    "chinese": "太尉勃進曰：「願請閒言。」",
    "literal": "Grand Marshal Bo advanced said: 'Wish request private words.'",
    "idiomatic": "Grand Marshal Bo stepped forward and said: 'I wish to speak with you privately.'"
  },
  "s0035": {
    "chinese": "宋昌曰：「所言公，公言之。",
    "literal": "Song Chang said: 'What spoken public, gentleman speak it.",
    "idiomatic": "Song Chang said: 'If it's a public matter, speak it openly."
  },
  "s0036": {
    "chinese": "所言私，王者不受私。」",
    "literal": "What spoken private, king ones not receive private.'",
    "idiomatic": "If it's a private matter, kings do not accept private communications.'"
  },
  "s0037": {
    "chinese": "太尉乃跪上天子璽符。",
    "literal": "Grand Marshal then knelt presented Son of Heaven seal tally.",
    "idiomatic": "The Grand Marshal then knelt and presented the imperial seal and tally."
  },
  "s0038": {
    "chinese": "代王謝曰：「至代邸而議之。」",
    "literal": "Dai King declined said: 'Reach Dai residence then discuss it.'",
    "idiomatic": "The King of Dai declined and said: 'We will discuss it when we reach the Dai residence.'"
  }
}
