{
  "s716": "Son of Prince Ding of Changsha.",
  "s718": "Three. Fourth year third month yi chou, Marquis Liu Ze first year.",
  "s719": "Six",
  "s720": "Six",
  "s721": "Six",
  "s722": "First year, Marquis Ze committed usurpation death penalty, executed in market, state abolished.",
  "s723": "Tu Ling.",
  "s724": "Son of Prince Ding of Changsha.",
  "s726": "Three. Fourth year third month yi chou, Marquis Liu Xin first year.",
  "s727": "Six",
  "s728": "One. Five. Second year, Marquis Ai Yang first year.",
  "s729": "Six",
  "s730": "First year, Marquis Yang died, no posterity, state abolished.",
  "s731": "Jian Cheng.",
  "s732": "Son of Prince Ding of Changsha.",
  "s734": "Three. Fourth year second month yi chou, Marquis Liu Shi first year.",
  "s735": "Five. Sixth year, Marquis Shi convicted of not attending court, disrespect, state abolished.",
  "s739": "An Zhong.",
  "s740": "Son of Prince Ding of Changsha.",
  "s742": "Three. Fourth year third month yi chou, Marquis Kang Liu Dan first year.",
  "s743": "Six",
  "s744": "Six",
  "s745": "Five. One. Sixth year, current Marquis Shan Fu first year.",
  "s746": "Four",
  "s747": "Ye.",
  "s748": "Son of Prince Ding of Changsha.",
  "s750": "Three. Fourth year third month yi chou, Marquis Kang Liu Jia first year.",
  "s751": "Six",
  "s752": "Four. Fifth year, Marquis Jia convicted of tribute gold, state abolished.",
  "s755": "Li Xiang.",
  "s756": "Son of Prince Gong of Chengyang.",
  "s758": "Three. Fourth year third month yi chou, Marquis Kang Liu Ying first year.",
  "s759": "Two. Third year, Marquis Ying committed crime, state abolished.",
  "s763": "You Li.",
  "s764": "Son of Prince Gong of Chengyang.",
  "s766": "Three. Fourth year third month yi chou, Marquis Liu Ding first year.",
  "s767": "First year, Marquis Ding convicted of sending letter to Huainan calling himself subject, executed in market, state abolished.",
  "s771": "Dong Ping.",
  "s772": "Son of Prince Gong of Chengyang.",
  "s774": "Three. Fourth year third month yi chou, Marquis Liu Qing first year.",
  "s775": "Two. Third year, Marquis Qing convicted of incest with sisters, committed crime, state abolished.",
  "s779": "Yun Ping.",
  "s780": "Son of Prince Gong of Chengyang.",
  "s782": "Three. Fourth year third month yi chou, Marquis Liu Xin first year.",
  "s783": "Six",
  "s784": "Four. Fifth year, Marquis Xin convicted of tribute gold, state abolished.",
  "s787": "Shan Zhou.",
  "s788": "Son of Prince Gong of Chengyang.",
  "s790": "Three. Fourth year third month yi chou, Marquis Liu Chi first year."
}
