{
  "s0148": "The fifth is the Yang Lord, sacrificing at Fu.",
  "s0149": "The sixth is the Moon Lord, sacrificing at Mount Lai.",
  "s0150": "All are north of Qi, bordering the Bohai Sea.",
  "s0151": "The seventh is the Sun Lord, sacrificing at Mount Cheng.",
  "s0152": "Mount Cheng thrusts into the sea, located at the northeastern corner of Qi, to welcome the sunrise.",
  "s0153": "The eighth is the Four Seasons Lord, sacrificing at Langye.",
  "s0154": "Langye is in the eastern part of Qi, probably where the year begins.",
  "s0155": "All use one set of sacrificial animals for each sacrifice, but the shamans and invokers made additions and subtractions, with varying jade and silk offerings.",
  "s0156": "From the time of Duke Wei and Duke Xuan of Qi, Zou Zi's followers discussed and wrote about the cycles of the beginning and end of the five virtues. When Qin became emperor, the Qi people presented it, so Shi Huang adopted it.",
  "s0157": "Song Wuji, Zheng Boqiao, Chong Shang, Xianmen Gao were the last, all Yan people, practicing the way of immortals, bodily dissolution and transformation, relying on the affairs of ghosts and spirits.",
  "s0158": "Zou Yan became prominent among the feudal lords by mastering yin and yang, and the magicians along the Qi and Yan coasts transmitted his techniques but could not master them thoroughly. Nevertheless, the strange, far-fetched, flattering, and compromising followers arose from this, too numerous to count.",
  "s0159": "From the time of Wei, Xuan, and Yan Zhao, they sent people into the sea to seek Penglai, Fangzhang, and Yingzhou.",
  "s0160": "These three divine mountains, according to tradition, are in the Bohai Sea, not far from people;",
  "s0161": "but when about to arrive, the wind blows the ships away.",
  "s0162": "It is said that those who have reached them find immortals and medicines of immortality there.",
  "s0163": "Their birds and beasts are all white, and palaces are made of gold and silver.",
  "s0164": "Before arriving, they appear like clouds;",
  "s0165": "when arriving, the three divine mountains sink below the water.",
  "s0166": "When approaching them, the wind always blows them away, and in the end no one can reach them.",
  "s0167": "Every ruler has been devoted to them.",
  "s0168": "When Qin Shi Huang unified the realm and reached the sea, the magicians' words were too numerous to count.",
  "s0169": "Shi Huang considered himself to have reached the sea but feared he might not reach the mountains, so he sent people carrying boys and girls into the sea to seek them.",
  "s0170": "The ships met in the sea, all using wind as an excuse, saying they could not reach them but had glimpsed them.",
  "s0171": "The next year, Shi Huang toured the sea again, reaching Langye, passing Mount Heng, returning from Shangdang.",
  "s0172": "Three years later, he toured Mount Jie, examined the sea-going magicians, returned from Shang Commandery.",
  "s0173": "Five years later, Shi Huang went south to Mount Xiang, then ascended Mount Kuaiji, toured along the sea, hoping to encounter the marvelous medicines of the three divine mountains in the sea.",
  "s0174": "He did not obtain them, and on his return he collapsed at Shaqiu.",
  "s0175": "In the first year of the Second Emperor, he toured east to Mount Jie, toured south of the sea, passed Mount Tai, reached Mount Kuaiji, all performing rituals and sacrifices, and carved beside the stone inscriptions Shi Huang had erected, to proclaim Shi Huang's achievements and virtue.",
  "s0176": "That autumn, the feudal lords rebelled against Qin.",
  "s0177": "After three years, the Second Emperor was assassinated and died.",
  "s0178": "Twelve years after Shi Huang's feng and shan sacrifices, Qin perished.",
  "s0179": "The Confucian scholars resented Qin for burning the poems and books, slaughtering the literati, and the people resented their laws, so the realm rebelled against them, all falsely saying: 'Shi Huang ascended Mount Tai, was struck by violent wind and rain, could not perform the feng and shan.'",
  "s0180": "Is this not what is called performing the rituals without possessing virtue?",
  "s0181": "In ancient times, the capitals of the Three Dynasties were all between the Yellow River and Luo River, so Mount Song was the central peak, and the four peaks were each in their directions, and the four rivers were all east of the mountains.",
  "s0182": "When Qin declared itself emperor and made Xianyang the capital, then the five peaks and four rivers were all in the east.",
  "s0183": "From the Five Emperors to Qin, dynasties rose and declined alternately, famous mountains and great rivers were sometimes in the feudal lords' territories, sometimes in the Son of Heaven's domain, their rituals increased and decreased with each generation, impossible to record completely.",
  "s0184": "When Qin unified the realm, they ordered the sacrificial officials to constantly maintain the sacrifices to heaven, earth, famous mountains, great rivers, and ghosts and spirits that could be properly ordered.",
  "s0185": "Therefore, east of Xiao, five famous mountains and two great rivers were sacrificed to.",
  "s0186": "Called Tai Shi.",
  "s0187": "Tai Shi is Mount Song.",
  "s0188": "Mount Heng, Mount Tai, Mount Kuaiji, Mount Xiang.",
  "s0189": "Rivers called Ji, called Huai.",
  "s0190": "In spring they used dried meat and wine for the annual sacrifice, when the ice broke up; in autumn when water dried up; in winter for blocked prayers and sacrifices.",
  "s0191": "Their sacrificial animals used one calf each, with varying pens, jade, and silk.",
  "s0192": "West of Mount Hua, seven famous mountains and four famous rivers.",
  "s0193": "Called Mount Hua, Mount Bo.",
  "s0194": "Mount Bo is Mount Wei.",
  "s0195": "Mount Yue, Mount Qi, Mount Wu, Mount Hongzhong, Mount Du.",
  "s0196": "Mount Du is Shu's Mount Min."
}
