{
  "s0099": "Chu Zhao Wang attacked Cai, Cai feared, urgently told Wu.",
  "s0100": "Wu for Cai distant, allied moved to self close, exchanged to mutually save;",
  "s0101": "Zhao Hou privately permitted, not with grand masters planned.",
  "s0102": "Wu people came save Cai, because moved Cai to Zhou Lai.",
  "s0103": "Twenty-eighth year, Zhao Hou about court Wu, grand masters feared his again moved, then ordered thief Li kill Zhao Hou;",
  "s0104": "already then executed thief Li to resolve mistake, established Zhao Hou son Shuo, this was Cheng Hou.",
  "s0105": "Cheng Hou fourth year, Song extinguished Cao.",
  "s0106": "Tenth year, Qi Tian Chang assassinated their lord Jian Gong.",
  "s0107": "Thirteenth year, Chu extinguished Chen.",
  "s0108": "Nineteenth year, Cheng Hou died, son Sheng Hou Chan established.",
  "s0109": "Sheng Hou fifteenth year died, son Yuan Hou established.",
  "s0110": "Yuan Hou sixth year died, son Hou Qi established.",
  "s0111": "Hou Qi fourth year, Chu Hui Wang extinguished Cai, Cai Hou Qi fled, Cai then cut off sacrifices.",
  "s0112": "After Chen extinguished thirty-three years.",
  "s0113": "Bo Yi Kao, his after not known enfeoffed where.",
  "s0114": "Wu Wang Fa, his after became Zhou, has basic record speaks.",
  "s0115": "Guan Shu Xian made disorder executed died, no descendants.",
  "s0116": "Zhou Gong Dan, his after became Lu, has genealogy speaks.",
  "s0117": "Cai Shu Du, his after became Cai, has genealogy speaks.",
  "s0118": "Cao Shu Zhen Duo, has descendants became Cao, has genealogy speaks.",
  "s0119": "Cheng Shu Wu, his after generations nothing seen.",
  "s0120": "Huo Shu Chu, his after Jin Xian Gong time extinguished Huo.",
  "s0121": "Kang Shu Feng, his after became Wei, has genealogy speaks.",
  "s0122": "Ran Ji Zai, his after generations nothing seen.",
  "s0123": "Grand Historian said: Guan Cai made disorder, no worth recording.",
  "s0124": "But Zhou Wu Wang collapsed, Cheng Wang young, world already doubted, relied same mother younger brothers Cheng Shu, Ran Ji etc. ten people assisted protected, so feudal lords finally revered Zhou, so attached genealogy speaks.",
  "s0125": "Cao Shu Zhen Duo, Zhou Wu Wang younger brother.",
  "s0126": "Wu Wang already conquered Yin Zhou, enfeoffed Shu Zhen Duo at Cao.",
  "s0127": "Shu Zhen Duo died, son Tai Bo Pi established.",
  "s0128": "Tai Bo died, son Zhong Jun Ping established.",
  "s0129": "Zhong Jun Ping died, son Gong Bo Hou established.",
  "s0130": "Gong Bo Hou died, son Xiao Bo Yun established.",
  "s0131": "Xiao Bo Yun died, son Yi Bo Xi established.",
  "s0132": "Yi Bo twenty-third year, Zhou Li Wang fled Zhu.",
  "s0133": "Thirtieth year died, younger brother You Bo Qiang established.",
  "s0134": "You Bo ninth year, younger brother Su killed You Bo replaced established, this was Dai Bo.",
  "s0135": "Dai Bo first year, Zhou Xuan Wang already established three years.",
  "s0136": "Thirtieth year, Dai Bo died, son Hui Bo Si established.",
  "s0137": "Hui Bo twenty-fifth year, Zhou You Wang for Quan Rong assassinated, because east moved, increasingly lowly, feudal lords rebelled it.",
  "s0138": "Qin began ranked as feudal lords.",
  "s0139": "Thirty-sixth year, Hui Bo died, son Shi Fu established, his younger brother Wu killed him replaced established, this was Mu Gong.",
  "s0140": "Mu Gong third year died, son Huan Gong Zhong Sheng established.",
  "s0141": "Huan Gong thirty-fifth year, Lu Yin Gong established.",
  "s0142": "Forty-fifth year, Lu assassinated their lord Yin Gong.",
  "s0143": "Forty-sixth year, Song Hua Fu Du assassinated their lord Shang Gong, and Kong Fu.",
  "s0144": "Fifty-fifth year, Huan Gong died, son Zhuang Gong Xi Gu established.",
  "s0145": "Zhuang Gong twenty-third year, Qi Huan Gong began hegemon.",
  "s0146": "Thirty-first year, Zhuang Gong died, son Xi Gong Yi established.",
  "s0147": "Xi Gong ninth year died, son Zhao Gong Ban established."
}
