{
  "s0001": {
    "literal": "Gaozu was a person from Zhongyang Village, Fengyi Township, Pei County, and his surname was Liu.",
    "idiomatic": "Emperor Gaozu hailed from Zhongyang Village in Fengyi Township, Pei County, and bore the surname Liu."
  },
  "s0002": {
    "literal": "His mother once rested by the bank of Daze Marsh, and dreamed that she encountered a god.",
    "idiomatic": "His mother once rested by the shore of Daze Marsh and dreamt of meeting a divine being."
  },
  "s0003": {
    "literal": "At that time there was thunder and lightning, darkness and obscurity; his father Taigong went to look, and then saw two dragons mating above.",
    "idiomatic": "Thunder crashed and lightning flashed in the darkened heavens; his father Taigong went to investigate and witnessed two dragons entwined above."
  },
  "s0004": {
    "literal": "Soon after she became pregnant, and then gave birth to Gaozu.",
    "idiomatic": "She soon conceived and thereafter bore Emperor Gaozu."
  },
  "s0005": {
    "literal": "高祖為人，隆準而龍顏，美須髯，左股有七十二黑子。",
    "idiomatic": "Emperor Gaozu had a prominent nose and dragon-like features, beautiful whiskers and beard, and seventy-two black moles on his left thigh."
  },
  "s0006": {
    "literal": "仁而愛人，喜施，意豁如也。",
    "idiomatic": "He was benevolent and loved people, enjoyed giving charity, and had an open-hearted disposition."
  },
  "s0007": {
    "literal": "常有大度，不事家人生產作業。",
    "idiomatic": "He always had great generosity of spirit and did not engage in the family's farming and labor."
  },
  "s0008": {
    "literal": "及壯，學書不成，去；學劍，又不成。",
    "idiomatic": "When he grew to adulthood, he studied writing but did not succeed, so he left; he studied swordsmanship, but again did not succeed."
  },
  "s0009": {
    "literal": "嘆曰：「書劍終窮哉？」",
    "idiomatic": "He sighed and said, 'Will the paths of scholarship and swordsmanship ultimately lead nowhere?'"
  },
  "s0010": {
    "literal": "及見秦皇帝，車騎眾，覺其異，乃歎曰：「嗟乎，大丈夫當如此也！」",
    "idiomatic": "When he saw the Qin emperor with his many chariots and cavalry, he realized how extraordinary it was, and sighed, 'Alas, this is how a great man should be!'"
  },
  "s0011": {
    "literal": "單父人呂公善沛令，避仇，從之客，因家焉。",
    "idiomatic": "Lü Gong from Shanfu was friendly with the magistrate of Pei; to avoid his enemies, he became a guest there and settled his family."
  },
  "s0012": {
    "literal": "呂公女乃呂后也，生孝惠、魯元公主。",
    "idiomatic": "Lü Gong's daughter was Empress Lü, who gave birth to Emperor Hui and Princess Lu Yuan."
  },
  "s0013": {
    "literal": "及長，家貧，呂公女配高祖，生惠帝、魯元。",
    "idiomatic": "When she grew up, the family was poor; Lü Gong's daughter was married to Gaozu and bore Emperor Hui and Lu Yuan."
  },
  "s0014": {
    "literal": "沛中子弟或聞其異，皆嘲笑之。",
    "idiomatic": "Some of the young men of Pei heard of his unusual nature and all mocked and laughed at him."
  },
  "s0015": {
    "literal": "高祖每酤留飲，酒讎數倍。",
    "idiomatic": "Whenever Gaozu bought wine to drink, the tavern keeper charged him several times the amount."
  },
  "s0016": {
    "literal": "及見怪，歲竟，此兩家常折券棄責。",
    "idiomatic": "When they saw that he was unusual, at the end of each year these two families would tear up the debt contracts and forgive his obligations."
  },
  "s0017": {
    "literal": "高祖怪之，問曰：「何故而然？」",
    "idiomatic": "Gaozu was puzzled by this and asked, 'Why do you do this?'"
  },
  "s0018": {
    "literal": "兩家曰：「君何言之闇也！長者千金，子孫息，君衣帛，買爵，君何言之闇也！」",
    "idiomatic": "The two families said, 'How can you speak so ignorantly! When the elders give a thousand pieces of gold, their descendants multiply; you wear silk clothes and buy official ranks—how can you speak so ignorantly!'"
  },
  "s0019": {
    "literal": "高祖豁達大度，聞之，輒喜，自知者少。",
    "idiomatic": "Gaozu was broad-minded and magnanimous; hearing this, he was immediately pleased, realizing that few understood him."
  },
  "s0020": {
    "literal": "高祖常繇咸陽，縶亭長，灞上亭。",
    "idiomatic": "Gaozu often traveled the corvée road to Xianyang, stopping at the pavilion chief's station at Ba Terrace."
  },
  "s0021": {
    "literal": "亭長妻有從者，醉酒，夜徑澤中，行徑澤中。",
    "idiomatic": "The pavilion chief had a wife with attendants; getting drunk on wine, they traveled at night through the marshes, going through the marshes."
  },
  "s0022": {
    "literal": "令一人先行，前者還報曰：「前有大蛇當徑，願還。」",
    "idiomatic": "He ordered one person to go ahead; the one who went ahead returned and reported: 'There is a large snake blocking the path ahead; I wish to turn back.'"
  },
  "s0023": {
    "literal": "高祖醉，曰：「壯士行，何畏！」",
    "idiomatic": "Gaozu was drunk and said, 'A brave man walks forward—what is there to fear!'"
  },
  "s0024": {
    "literal": "乃前，拔劍擊斬蛇，徑分為兩。",
    "idiomatic": "He went forward, drew his sword, and struck down the snake, splitting it into two parts along the path."
  },
  "s0025": {
    "literal": "徑行至鰐蛇所，醉臥。",
    "idiomatic": "He walked along the path to where the snake had been and lay down drunk."
  },
  "s0026": {
    "literal": "後人來至蛇所，有一老嫗夜哭。",
    "idiomatic": "Later, people came to where the snake was, and there was an old woman crying at night."
  },
  "s0027": {
    "literal": "人問何哭，嫗曰：「人殺吾子，故哭之。」",
    "idiomatic": "People asked why she was crying; the old woman said, 'Someone killed my son, so I cry for him.'"
  },
  "s0028": {
    "literal": "人曰：「嫗子何為見殺？」",
    "idiomatic": "The people said, 'Old woman's son, why was he killed?'"
  },
  "s0029": {
    "literal": "嫗曰：「吾子，白帝子也，化為蛇，當徑，今為赤帝子斬之，故哭。」",
    "idiomatic": "The old woman said, 'My son is the son of the White Emperor; he transformed into a snake to block the path, but now he has been slain by the son of the Red Emperor, so I cry.'"
  },
  "s0030": {
    "literal": "人以嫗為不誠，欲笞之；嫗因忽不見。",
    "idiomatic": "The people considered the old woman dishonest and wanted to beat her; but the old woman suddenly disappeared."
  },
  "s0031": {
    "literal": "後人至，高祖覺，告之。",
    "idiomatic": "Later, when people arrived, Gaozu awoke and told them about it."
  },
  "s0032": {
    "literal": "高祖乃心獨喜，自負。",
    "idiomatic": "Gaozu was secretly pleased in his heart and felt self-confident."
  },
  "s0033": {
    "literal": "諸從者日益畏之。",
    "idiomatic": "His followers grew increasingly in awe of him."
  },
  "s0034": {
    "literal": "秦始皇帝常曰：「東南有天子氣。」",
    "idiomatic": "Qin Shihuang often said, 'There is imperial aura in the southeast.'"
  },
  "s0035": {
    "literal": "於是東游以厭當之。",
    "idiomatic": "Therefore he traveled east to suppress it."
  },
  "s0036": {
    "literal": "高祖以亭長為縣送徒騉山，徒多道亡。",
    "idiomatic": "Gaozu, as pavilion chief, escorted convicts from the county to Mount Li; many convicts escaped along the way."
  },
  "s0037": {
    "literal": "自度比至皆亡之，到豐西澤中，止飲，夜乃解縱所送徒。",
    "idiomatic": "He estimated that by the time they arrived, all would have escaped; when they reached the western marshes of Feng, he stopped for a drink, and at night released all the convicts he was escorting."
  },
  "s0038": {
    "literal": "曰：「公等皆去，吾亦從此逝矣！」",
    "idiomatic": "He said, 'You all go; I too will depart from here!'"
  },
  "s0039": {
    "literal": "徒中壯士願從者十餘人。",
    "idiomatic": "Among the convicts, about ten strong men wished to follow him."
  },
  "s0040": {
    "literal": "高祖被酒，夜徑澤中，令一人行前。",
    "idiomatic": "Gaozu was drunk and traveled through the marshes at night, ordering one person to go ahead."
  },
  "s0041": {
    "literal": "行前者還報曰：「前有大蛇當徑，願還。」",
    "idiomatic": "The one who went ahead returned and reported: 'There is a large snake blocking the path ahead; I wish to turn back.'"
  },
  "s0042": {
    "literal": "高祖醉，曰：「壯士行，何畏！」",
    "idiomatic": "Gaozu was drunk and said, 'A brave man walks forward—what is there to fear!'"
  },
  "s0043": {
    "literal": "乃前，拔劍擊斬蛇。",
    "idiomatic": "He went forward, drew his sword, and struck down the snake."
  },
  "s0044": {
    "literal": "高祖遂前，抵鹹陽。",
    "idiomatic": "Gaozu then proceeded forward and arrived at Xianyang."
  },
  "s0045": {
    "literal": "諸客遂追隨，高祖以辭去。",
    "idiomatic": "The various guests then followed him; Gaozu left with excuses."
  },
  "s0046": {
    "literal": "沛公奉項梁客軍，遮擊秦軍於東阿。",
    "idiomatic": "Prince Pei served under Xiang Liang's guest army and ambushed Qin forces at Dong'a."
  },
  "s0047": {
    "literal": "戰不利，項梁再破秦軍於東阿。",
    "idiomatic": "The battle went unfavorably; Xiang Liang again defeated the Qin army at Dong'a."
  },
  "s0048": {
    "literal": "沛公引兵西，遇彭越昌邑。",
    "idiomatic": "Prince Pei led his troops west and encountered Peng Yue at Changyi."
  },
  "s0049": {
    "literal": "項籍已殺宋義，引兵而西。",
    "idiomatic": "Xiang Ji had already killed Song Yi and led his troops west."
  },
  "s0050": {
    "literal": "漢王之國，項王使卒三萬人從。",
    "idiomatic": "When the Han King went to his fief, Xiang Wang sent thirty thousand soldiers to follow him."
  }
}
