{
  "s0448": "But all secretly knew gong zi Chong Er entered.",
  "s0449": "Only Hui Gong former noble ministers Lu, Xi clan not wished establish Chong Er.",
  "s0450": "Chong Er out perished altogether nineteen years obtained enter, time age sixty-two, Jin people many attached to him.",
  "s0451": "Wen Gong first year spring, Qin sent Chong Er to Yellow River.",
  "s0452": "Jiu Fan said: 'Minister follow lord revolve world, faults also many.",
  "s0453": "Minister still know it, moreover lord?",
  "s0454": "Please from this leave.'",
  "s0455": "Chong Er said: 'If return country, not with Zi Fan share, He Bo see it!'",
  "s0456": "Then threw jade river middle, to with Zi Fan ally.",
  "s0457": "At time Jie Zi Tui followed, in boat, then laughed said: 'Heaven truly open gong zi, Zi Fan with as own merit demand market at lord, indeed sufficient shame.",
  "s0458": "I not bear with same position.'",
  "s0459": "Then self hid crossed river.",
  "s0460": "Qin troops surrounded Ling Hu, Jin army at Lu Liu.",
  "s0461": "Second month Xin Chou, Jiu Fan with Qin Jin grand masters allied at Xun.",
  "s0462": "Ren Yin, Chong Er entered Jin army.",
  "s0463": "Bing Wu, entered Qu Wo.",
  "s0464": "Ding Wei, court at Wu Gong temple, ascended position as Jin lord, this was Wen Gong.",
  "s0465": "Group ministers all went.",
  "s0466": "Huai Gong Yu fled Gao Liang.",
  "s0467": "Wu Shen, sent people killed Huai Gong.",
  "s0468": "Huai Gong former ministers Lu Sheng, Xi Rui originally not attached Wen Gong, Wen Gong established, feared executed, then wished with their followers plot burn gong palace, kill Wen Gong.",
  "s0469": "Wen Gong not know.",
  "s0470": "Initially wished kill Wen Gong eunuch Lu Di knew their plot, wished inform Wen Gong, resolve previous crime, seek see Wen Gong.",
  "s0471": "Wen Gong not see, sent people reproached said: 'Pu city matter, you cut my sleeve.",
  "s0472": "Its after I follow Di lord hunt, you for Hui Gong come seek kill me.",
  "s0473": "Hui Gong with you period three days, you one day arrived, why fast?",
  "s0474": "You their think it.'",
  "s0475": "Eunuch said: 'Minister knife saw remaining, not dare with two hearts serve lord betray master, so obtain crime at lord.",
  "s0476": "Lord already return country, its no Pu, Di?",
  "s0477": "Moreover Guan Zhong shoot hook, Huan Gong with hegemony.",
  "s0478": "Now punishment remaining person with matter inform lord not see, calamity again will reach.'",
  "s0479": "Then saw him, then with Lu, Xi etc. informed Wen Gong.",
  "s0480": "Wen Gong wished summon Lu, Xi, Lu, Xi party many, Wen Gong feared initial enter country, country people sell self, then made secret travel, met Qin Mu Gong at Wang Cheng, country people not know.",
  "s0481": "Third month Ji Chou, Lu, Xi indeed rebelled, burned gong palace, not obtain Wen Gong.",
  "s0482": "Wen Gong guard troops with battled, Lu, Xi led troops wished flee, Qin Mu Gong lured Lu, Xi, killed at river above, Jin country peaceful Wen Gong obtained return.",
  "s0483": "Summer, welcomed wife at Qin, Qin granted Wen Gong wife died became wife.",
  "s0484": "Qin sent three thousand as guard, to prepare Jin disorder.",
  "s0485": "Wen Gong cultivated government, applied favor hundred clans.",
  "s0486": "Rewarded followed perished and merit ministers, great enfeoffed cities, small honored rank.",
  "s0487": "Not completely carried reward, Zhou Xiang Wang with younger brother Dai difficulty exited resided Zheng land, came informed urgent Jin.",
  "s0488": "Jin initially settled, wished send troops, feared other disorder rise, so reward followed perished not to hidden Jie Zi Tui.",
  "s0489": "Tui also not spoke salary, salary also not reached.",
  "s0490": "Tui said: 'Xian Gong sons nine people, only lord in.",
  "s0491": "Hui, Huai no relatives, outer inner abandoned them;",
  "s0492": "heaven not cut Jin, must have master, master Jin sacrifices, not lord who?",
  "s0493": "Heaven truly open it, two three sons with as own strength, not also false?",
  "s0494": "Steal person wealth, still said is thief, moreover greedy heaven merit as own strength?",
  "s0495": "Below risk its crime, above reward its wickedness, up down mutually deceive, difficult with reside!'",
  "s0496": "His mother said: 'Why also seek it, with die who resent?'"
}
