{
  "s62": "Supreme Emperor collapsed. Chen Xi rebelled in Dai territory.",
  "s65": "Imperial Secretary Grandee Jiang Yi Hou Zhao Yao.",
  "s68": "Executed Huai Yin, Peng Yue. Ying Bu rebelled.",
  "s70": "Zhou Bo became Grand Commandant. Attacked Dai. Later palaces reduced.",
  "s74": "Winter, struck Bu. Returned passing Pei. Summer, emperor collapsed, buried at Chang Ling.",
  "s79": "Xiao Hui first year",
  "s80": "Zhao Yin Wang Ru Yi died. First built Chang An city northwest. Removed feudal lords' chancellors to chancellors.",
  "s86": "Chu Yuan Wang, Qi Dao Hui Wang came to court. Seventh month Xin Wei, He died.",
  "s87": "Fourteen. Seventh month Gui Si, Qi chancellor Ping Yang Hou Cao Can became chancellor.",
  "s92": "First built Chang An city. Shu Jian Di rebelled. Struck them.",
  "s98": "Third month Jia Zi, amnesty, nothing to restore.",
  "s104": "For Gao Zu established temple at Pei city walls, placed singing boys one hundred twenty people. Eighth month Yi Chou, Can died.",
  "s110": "Seventh month, Qi Dao Hui Wang died. Established Grand Granary, Western Market.",
  "s111": "One. Tenth month Ji Si, An Guo Hou Wang Ling became right chancellor. Qu Ni Hou Chen Ping became left chancellor.",
  "s112": "Yao committed crime.",
  "s113": "Guang E Hou Ren Ao became Imperial Secretary Grandee.",
  "s116": "Emperor collapsed. Ministers used Zhang Pi Qiang's plan, Lu clan power heavy, made Lu Tai Lu Wang. Established Young Emperor. Ninth month Xin Si, buried at An Ling.",
  "s121": "Gao Hou first year",
  "s122": "Enfeoffed Xiao Hui's various sons. Established Xiao Ti Li Tian.",
  "s123": "Three. Eleventh month Jia Zi, moved Ping to right chancellor. Pi Yang Hou Shen Shi Ji became left chancellor.",
  "s128": "Twelfth month, Lu Wang Tai died, son Jia replaced as Lu Wang. Circulated eight zhu coins.",
  "s129": "Four. Ping. Two. Shi Ji.",
  "s131": "Ping Yang Hou Cao Tao became Imperial Secretary Grandee..",
  "s135": "Five. Three",
  "s140": "Deposed Young Emperor, changed established Chang Shan Wang Hong as emperor.",
  "s141": "Six. Four. Established Grand Commandant office.",
  "s142": "One. Jiang Hou Zhou Bo became Grand Commandant.",
  "s146": "Eighth month, Huai Yang Wang died, with his younger brother Hu Guan Hou Wu became Huai Yang Wang. Commanded garrison troops yearly rotate.",
  "s147": "Seven. Five",
  "s152": "Made Lu Chan Lu Wang. Fourth month Ding You, amnesty all under heaven. Day darkened.",
  "s153": "Eight. Six",
  "s158": "Zhao Wang You died, made Lu Lu Zhao Wang. Liang Wang moved to Zhao, suicide.",
  "s159": "Nine. Seven",
  "s164": "Seventh month, Gao Hou collapsed. Ninth month, executed various Lu. Later ninth month, Dai Wang arrived, ascended emperor position. Later ninth month, Shi Ji dismissed chancellor.",
  "s165": "Ten. Seventh month Xin Si, became emperor Grand Tutor. Ninth month Ren Xu, again became chancellor. Eight",
  "s166": "Five. Long Lu Hou Zao became general, struck Nan Yue.",
  "s167": "Imperial Secretary Grandee Cang.",
  "s169": "Xiao Wen first year",
  "s170": "Removed receiving nu mutually sitting law. Established crown prince. Granted people ranks.",
  "s171": "Eleven. Eleventh month Xin Si, Ping moved to left chancellor. Grand Commandant Jiang Hou Zhou Bo became right chancellor.",
  "s172": "Six. Bo became chancellor, Ying Yin Hou Guan Ying became Grand Commandant.",
  "s176": "Removed defamation law. Imperial son Wu became Dai Wang, Shen became Tai Yuan Wang, Yi became Liang Wang. Tenth month, chancellor Ping died.",
  "s177": "One. Eleventh month Yi Hai, Jiang Hou Bo again became chancellor.",
  "s182": "Moved Dai Wang Wu to Huai Yang Wang. Emperor visited Tai Yuan. Ji Bei Wang rebelled. Xiongnu greatly entered Shang Jun. Gave land all to Tai Yuan, Tai Yuan changed name Dai. Eleventh month Ren Zi, Bo dismissed chancellor, went to fief.",
  "s183": "One. Twelfth month Yi Hai, Grand Commandant Ying Yin Hou Guan Ying became chancellor. Abolished Grand Commandant office.",
  "s184": "Two. Ji Pu Hou Chen Wu became Grand General, struck Ji Bei. Chang Hou Lu Qing, Gong Hou Lu Ba Shi, Ning Hou Chi, Shen Ze Hou Jiang Ye all became generals, belonged to Wu Qi Hou He, led troops garrisoned Xing Yang.",
  "s188": "Twelfth month Ji Si, Ying died.",
  "s189": "One. First month Jia Wu, Imperial Secretary Grandee Bei Ping Hou Zhang Cang became chancellor.",
  "s190": "An Qiu Hou Zhang Yue became general, struck Hu, went out Dai."
}
