{
  "s0001": "The ancestors of the Zhao clan shared a common lineage with the Qin family.",
  "s0002": "During the time of Zhong Yan, he served as charioteer to Emperor Da Wu of the Shang dynasty.",
  "s0003": "His descendants included Fei Lian, who had two sons. He named one son E Lai, who served King Zhou and was killed by Zhou forces. His descendants became the Qin family.",
  "s0004": "E Lai's younger brother was named Ji Sheng, and his descendants became the Zhao family.",
  "s0005": "Ji Sheng fathered Meng Zeng.",
  "s0006": "Meng Zeng was favored by King Cheng of Zhou and was known as Zhai Gao Lang.",
  "s0007": "Gao Lang fathered Heng Fu, and Heng Fu fathered Zhao Fu.",
  "s0008": "Zhao Fu was favored by King Mu of Zhou.",
  "s0009": "Zhao Fu obtained several fine horses - the swift ones from Ji, along with Tao Lin's stolen Li, Hua Liu, and Lü Er - and presented them to King Mu.",
  "s0010": "King Mu had Zhao Fu drive for him on a western expedition, where he met the Queen Mother of the West and enjoyed himself so much he forgot to return.",
  "s0011": "Meanwhile, King Xu of Xu rebelled, so King Mu drove his thousand-li horses day and night to attack Xu, greatly defeating them.",
  "s0012": "Thus he granted Zhao Fu the city of Zhao, and from this the Zhao clan began.",
  "s0013": "From Zhao Fu down six generations to Yan Fu, called Gong Zhong. During King Xuan of Zhou's time, he drove in the campaign against the Rong tribes.",
  "s0014": "During the battle at Qian Mu, Yan Fu rescued King Xuan.",
  "s0015": "Yan Fu fathered Shu Dai.",
  "s0016": "During Shu Dai's time, King You of Zhou was tyrannical, so he left Zhou and went to Jin, serving Jin's Wen Hou. He first established the Zhao clan in the state of Jin.",
  "s0017": "From Shu Dai onward, the Zhao lineage grew increasingly prominent, and after five generations came Zhao Shu.",
  "s0018": "In the sixteenth year of Jin's Duke Xian, Zhao Shu led troops to attack Huo, Wei, and Geng.",
  "s0019": "The lord of Huo fled to Qi.",
  "s0020": "Jin suffered a great drought, and divination revealed: 'Mount Tai of Huo is causing the calamity.'",
  "s0021": "They had Zhao Shu summon the lord of Huo from Qi and restore him, to maintain the sacrifices to Mount Tai of Huo, and Jin again became fertile.",
  "s0022": "Duke Xian of Jin granted Zhao Shu the city of Geng.",
  "s0023": "Shu fathered Gong Meng, during the first year of Duke Min of Lu.",
  "s0024": "Gong Meng fathered Zhao Shuai, styled Zi Yu.",
  "s0025": "Zhao Shuai divined service to Duke Xian of Jin and the various princes, but none were auspicious.",
  "s0026": "When he divined service to Prince Chong Er, it was auspicious, so he served Chong Er.",
  "s0027": "Chong Er fled to the Di tribes due to the Li Ji affair, and Zhao Shuai followed him.",
  "s0028": "The Di attacked Mao Jiu Ru and captured two women. The Di married their younger daughter to Chong Er and their elder daughter to Zhao Shuai, who bore Dun.",
  "s0029": "Initially, when Chong Er was in Jin, Zhao Shuai's wife also bore Zhao Tong, Zhao Kuo, and Zhao Ying Qi.",
  "s0030": "Zhao Shuai followed Chong Er in exile for nineteen years before returning to the state.",
  "s0031": "Chong Er became Duke Wen of Jin, and Zhao Shuai became the magistrate of Yuan, residing in Yuan and managing state affairs.",
  "s0032": "The reasons Duke Wen returned to his state and became hegemon were mostly due to Zhao Shuai's plans and strategies, as recorded in the Jin annals.",
  "s0033": "After Zhao Shuai returned to Jin, his Jin wife insisted on welcoming back the Di wife, and established their son Dun as the legitimate heir, with the three sons of the Jin wife all serving him.",
  "s0034": "In the sixth year of Duke Xiang of Jin, Zhao Shuai died, receiving the posthumous title Cheng Ji.",
  "s0035": "Zhao Dun succeeded Cheng Ji and managed state affairs for two years before Duke Xiang died. The crown prince Yi Gao was young.",
  "s0036": "Dun, seeing the state's many difficulties, wished to establish Duke Xiang's younger brother Yong.",
  "s0037": "Yong was then in Qin, so they sent envoys to welcome him.",
  "s0038": "The crown prince's mother wept day and night, kowtowing to Zhao Dun and saying: 'What crime did the former lord commit that you would abandon his legitimate son and seek another lord?'",
  "s0039": "Zhao Dun was troubled by this, fearing his clan and the ministers would attack and kill him, so he proceeded to establish the crown prince as Duke Ling. He sent troops to block those welcoming Duke Xiang's younger brother from Qin.",
  "s0040": "After Duke Ling was established, Zhao Dun became even more monopolized in governing the state.",
  "s0041": "Duke Ling had been on the throne fourteen years and grew increasingly arrogant.",
  "s0042": "Zhao Dun repeatedly remonstrated, but Duke Ling would not listen.",
  "s0043": "When eating bear paws, the stew was not cooked thoroughly, so he killed the cook and carried the corpse out. Zhao Dun saw this.",
  "s0044": "Duke Ling was frightened by this and wished to kill Dun.",
  "s0045": "Dun was always benevolent and loved the people. Once he had fed a hungry man under a mulberry tree who later returned and protected Dun, allowing Dun to escape.",
  "s0046": "Before leaving the borders, Zhao Chuan assassinated Duke Ling and established Duke Xiang's younger brother Hei Tun, who became Duke Cheng.",
  "s0047": "Zhao Dun returned again and managed state affairs.",
  "s0048": "The gentlemen criticized Dun, saying 'As chief minister, when fleeing he did not leave the borders, and upon returning he did not punish the traitor,' so the Grand Historian wrote: 'Zhao Dun assassinated his ruler.'",
  "s0049": "During Duke Jing of Jin's time, Zhao Dun died, receiving the posthumous title Xuan Meng, and his son Shuo succeeded him.",
  "s0050": "Zhao Shuo, in the third year of Duke Jing of Jin, served as commander of Jin's lower army to rescue Zheng, and fought with Chu's King Zhuang on the Yellow River.",
  "s0051": "Shuo married Duke Cheng's sister as his wife.",
  "s0052": "In the third year of Duke Jing of Jin, the grand master Tu An Jia wished to exterminate the Zhao clan.",
  "s0053": "Initially, when Zhao Dun was alive, he dreamed of Uncle Dai holding his belt and weeping bitterly;",
  "s0054": "then he laughed, clapped his hands, and sang.",
  "s0055": "Zhao Dun divined it, and the omen was broken but then good.",
  "s0056": "Zhao historian Yuan interpreted it, saying: 'This dream is very ominous - not for your lordship's body, but for your son. However, it is also your lordship's fault.",
  "s0057": "By your grandson's generation, the Zhao lineage will increasingly decline.'",
  "s0058": "Tu An Jia had initially been favored by Duke Ling, and when he reached Duke Jing's time, Jia became Minister of Justice. He planned to make trouble, so he investigated Duke Ling's assassins to implicate Zhao Dun. He informed all the generals, saying: 'Although Dun may not have known, he was still the chief of the traitors.",
  "s0059": "For a minister to assassinate his ruler - how can we punish the crime if his descendants remain in court?'",
  "s0060": "Please exterminate them.'",
  "s0061": "Han Que said: 'When Duke Ling encountered the assassin, Zhao Dun was outside. My former lord considered him innocent, so he did not punish him.",
  "s0062": "Now you gentlemen wish to punish his descendants - this is not my former lord's intention, and now you rashly punish.",
  "s0063": "Rash punishment is called rebellion.",
  "s0064": "When ministers have great matters and the lord does not hear of them, there is no lord.'",
  "s0065": "Tu An Jia did not listen.",
  "s0066": "Han Que told Zhao Shuo to flee quickly.",
  "s0067": "Shuo refused, saying: 'You must not let the Zhao sacrifices be extinguished - I will die without regret.'",
  "s0068": "Han Que agreed and feigned illness without going out.",
  "s0069": "Jia, without requesting permission, arbitrarily led the generals to attack the Zhao clan at the Lower Palace, killing Zhao Shuo, Zhao Tong, Zhao Kuo, and Zhao Ying Qi, exterminating their entire clans.",
  "s0070": "Zhao Shuo's wife, Duke Cheng's sister, had a posthumous child and fled to hide in the duke's palace.",
  "s0071": "Zhao Shuo's guest named Gong Sun Chu Jiu, Chu Jiu told Shuo's friend Cheng Ying: 'Why not die?'",
  "s0072": "Cheng Ying said: 'Shuo's wife has a posthumous child. If fortunately it is a boy, I will raise him;",
  "s0073": "if a girl, then I will die later.'",
  "s0074": "After some time, Shuo's wife gave birth, bearing a boy.",
  "s0075": "Tu An Jia heard of it and searched the palace.",
  "s0076": "The wife placed the child in a crack in the wall and cursed: 'If the Zhao lineage is extinguished, cry out;",
  "s0077": "if not extinguished, make no sound.'",
  "s0078": "When they searched, the child made no sound at all.",
  "s0079": "After escaping, Cheng Ying told Gong Sun Chu Jiu: 'Now they didn't find him this time, but they will surely search again later - what to do?'",
  "s0080": "Gong Sun Chu Jiu said: 'Raising an orphan or dying - which is harder?'",
  "s0081": "Cheng Ying said: 'Dying is easy, raising an orphan is hard.'",
  "s0082": "Gong Sun Chu Jiu said: 'The Zhao family ancestors treated you generously. You take on the hard task, I will take the easy one - please let me die first.'",
  "s0083": "Thus the two plotted to take another person's infant, wrap it in embroidered cloth, and hide in the mountains.",
  "s0084": "Cheng Ying went out and falsely told the generals: 'I am unworthy and cannot establish the Zhao orphan.",
  "s0085": "Who will give me a thousand pieces of gold, and I will tell where the Zhao orphan is hidden.'",
  "s0086": "All the generals were delighted and agreed. They sent troops to follow Cheng Ying and attack Gong Sun Chu Jiu.",
  "s0087": "Chu Jiu falsely said: 'What a petty man is Cheng Ying!",
  "s0088": "In the past during the Lower Palace difficulty he could not die, and plotted with me to hide the Zhao orphan, now he sells me again.",
  "s0089": "Even if he cannot establish it, how can he bear to sell it!'",
  "s0090": "He embraced the child and called out: 'Heaven! Heaven!",
  "s0091": "What crime has the Zhao orphan committed?",
  "s0092": "Please let him live, and kill only Chu Jiu.'",
  "s0093": "The generals would not allow it, so they killed Chu Jiu and the infant.",
  "s0094": "The generals thought the Zhao orphan was truly dead and were all delighted.",
  "s0095": "However, the true Zhao orphan was actually still alive, and Cheng Ying finally hid with him in the mountains.",
  "s0096": "After fifteen years, Duke Jing of Jin fell ill. Divination revealed that descendants of great meritorious families who had their sacrifices cut off were causing the trouble.",
  "s0097": "Duke Jing asked Han Que, who knew the Zhao orphan existed, and said: 'Among the descendants of great meritorious families in Jin whose sacrifices were cut off, is it the Zhao clan?",
  "s0098": "For those from Zhong Yan are all of the Ying surname also.'",
  "s0099": "Duke Jing consulted the Jin ministers, and the ministers said: 'The Zhao clan served Jin meritoriously for generations, but Tu An Jia exterminated them without reason.",
  "s0100": "Now the divination points to descendants of meritorious families whose sacrifices were cut off - this must be the Zhao clan.'",
  "s0101": "Duke Jing then had Han Que restore the Zhao orphan.",
  "s0102": "Han Que had already died, so he had Wei Jiang restore him.",
  "s0103": "The Zhao orphan was then fifteen years old, and Duke Jing married him to his daughter, naming him Zhao Wu.",
  "s0104": "Tu An Jia fled to Qi.",
  "s0105": "In the fifteenth year of Duke Jing, Zhao Wu led troops to attack Qi, captured Tu An Jia, and returned.",
  "s0106": "Zhao Wu split Tu An Jia's body at the market.",
  "s0107": "Zhao Wu restored the Zhao clan, and the Zhao lineage became prominent again.",
  "s0108": "In the twenty-second year of Duke Jing, Zhao Wu died, and his son Zhao Jian succeeded him.",
  "s0109": "Zhao Jian served as chief minister.",
  "s0110": "In the twenty-seventh year of Duke Jing, Zhao Jian died, and his son Zhao Xiang succeeded him.",
  "s0111": "Zhao Xiang served as chief minister.",
  "s0112": "In the thirty-sixth year of Duke Jing, Zhao Xiang died, and his son Zhao Huan succeeded him.",
  "s0113": "Zhao Huan served as chief minister.",
  "s0114": "In the fifth year of Duke Li of Jin, Zhao Huan died, and his son Zhao Ying succeeded him.",
  "s0115": "Zhao Ying served as chief minister.",
  "s0116": "In the seventeenth year of Duke Li, Zhao Ying died, and his son Zhao Wu succeeded him.",
  "s0117": "Zhao Wu served as chief minister.",
  "s0118": "In the twenty-first year of Duke Li, Zhao Wu died, and his son Zhao Jia succeeded him.",
  "s0119": "Zhao Jia served as chief minister.",
  "s0120": "In the twenty-sixth year of Duke Li, Zhao Jia died, and his son Zhao Ji succeeded him.",
  "s0121": "Zhao Ji served as chief minister.",
  "s0122": "In the third year of Duke Dao of Jin, Zhao Ji died, and his son Zhao Wu succeeded him.",
  "s0123": "Zhao Wu served as chief minister.",
  "s0124": "In the twentieth year of Duke Dao, Zhao Wu died, and his son Zhao Yang succeeded him.",
  "s0125": "Zhao Yang served as chief minister.",
  "s0126": "In the twenty-fifth year of Duke Dao, Zhao Yang died, and his son Zhao Zhuang succeeded him.",
  "s0127": "Zhao Zhuang served as chief minister.",
  "s0128": "In the thirty-second year of Duke Dao, Zhao Zhuang died, and his son Zhao Rong succeeded him.",
  "s0129": "Zhao Rong served as chief minister.",
  "s0130": "In the first year of Duke Ping of Jin, Zhao Rong died, and his son Zhao Jian succeeded him.",
  "s0131": "Zhao Jian served as chief minister.",
  "s0132": "In the twelfth year of Duke Ping, Zhao Jian died, and his son Zhao Zhuang succeeded him.",
  "s0133": "Zhao Zhuang served as chief minister.",
  "s0134": "In the thirteenth year of Duke Ping, Zhao Zhuang died, and his son Zhao Jia succeeded him.",
  "s0135": "Zhao Jia served as chief minister.",
  "s0136": "In the fourteenth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0137": "Zhao Yang served as chief minister.",
  "s0138": "In the fifteenth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0139": "Zhao Wu served as chief minister.",
  "s0140": "In the sixteenth year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0141": "Zhao Bao served as chief minister.",
  "s0142": "In the seventeenth year of Duke Ping, Zhao Bao died, and his son Zhao Ping succeeded him.",
  "s0143": "Zhao Ping served as chief minister.",
  "s0144": "In the eighteenth year of Duke Ping, Zhao Ping died, and his son Zhao Jia succeeded him.",
  "s0145": "Zhao Jia served as chief minister.",
  "s0146": "In the nineteenth year of Duke Ping, Zhao Jia died, and his son Zhao Yang succeeded him.",
  "s0147": "Zhao Yang served as chief minister.",
  "s0148": "In the twentieth year of Duke Ping, Zhao Yang died, and his son Zhao Wu succeeded him.",
  "s0149": "Zhao Wu served as chief minister.",
  "s0150": "In the twenty-first year of Duke Ping, Zhao Wu died, and his son Zhao Bao succeeded him.",
  "s0151": "Zhao Bao served as chief minister."
}
