{
  "s0472": "Shi Juan drummed finished it.",
  "s0473": "Ping Gong said: 'Sound none more sorrowful?'",
  "s0474": "Shi Kuang said: 'Has.'",
  "s0475": "Ping Gong said: 'Can hear?'",
  "s0476": "Shi Kuang said: 'Lord virtue righteousness thin, cannot listen.'",
  "s0477": "Ping Gong said: 'I like sound, wish hear it.'",
  "s0478": "Shi Kuang had no choice, drew qin drummed it.",
  "s0479": "One play, had black cranes sixteen gathered corridor gate;",
  "s0480": "Twice play, stretched necks cried, spread wings danced.",
  "s0481": "Ping Gong greatly happy, rose gave Shi Kuang toast.",
  "s0482": "Returned sat, asked: 'Sound none more sorrowful?'",
  "s0483": "Shi Kuang said: 'Has.",
  "s0484": "Former Huang Di with great united ghosts spirits, now lord virtue righteousness thin, insufficient listen, listen will defeat.'",
  "s0485": "Ping Gong said: 'I old, like sound, wish continue hear.'",
  "s0486": "Shi Kuang had no choice, drew qin drummed it.",
  "s0487": "One play, had white clouds from northwest rise;",
  "s0488": "Twice play, great wind arrived rain followed, flew corridor tiles, left right all fled.",
  "s0489": "Ping Gong feared, hid corridor house between.",
  "s0490": "Jin state great drought, red earth three years.",
  "s0491": "Listeners sometimes auspicious sometimes inauspicious.",
  "s0492": "Music cannot recklessly arise.",
  "s0493": "Grand Historian says: Upper ancient enlightened kings raised music, not to entertain heart self joy, satisfy intent indulge desires, will want govern.",
  "s0494": "Correct teaching all begin sound, sound correct conduct correct.",
  "s0495": "Thus music, to move shake blood vessels, connect flow spirit harmonize correct heart.",
  "s0496": "Thus gong moves spleen harmonize correct sage, shang moves lung harmonize correct righteousness, jue moves liver harmonize correct benevolence, zhi moves heart harmonize correct ritual, yu moves kidney harmonize correct wisdom.",
  "s0497": "Thus music to inner aid correct heart outer distinguish noble base;",
  "s0498": "Above serve ancestral temple, below transform common people.",
  "s0499": "Qin long eight chi one cun, correct measure.",
  "s0500": "Strings large gong, reside central, ruler.",
  "s0501": "Shang stretched right side, remaining large small follow order, not lose order, then ruler minister positions correct.",
  "s0502": "Thus hear gong sound, make people warm comfortable broad;",
  "s0503": "Hear shang sound, make people square correct love righteousness;",
  "s0504": "Hear jue sound, make people compassionate love people;",
  "s0505": "Hear zhi sound, make people joy good give;",
  "s0506": "Hear yu sound, make people orderly love ritual.",
  "s0507": "Ritual from outside enter, music from inside out.",
  "s0508": "Thus gentleman cannot moment leave ritual, moment leave ritual then violent lazy conduct exhaust outside;",
  "s0509": "Cannot moment leave music, moment leave music then evil crooked conduct exhaust inside.",
  "s0510": "Thus music sound, gentleman nourish righteousness.",
  "s0511": "Ancient, Son of Heaven feudal lords listen bells chimes never left court, ministers officials listen qin se sound never left front, thus nourish conduct righteousness guard licentious dissipation."
}
