{
  "s0999": "Shu Xiang said: 'Jin duke house declined.'",
  "s1000": "Nineteenth year, thirty-eighth year, second year, thirty-seventh year, fifth year, thirtieth year, fourth year, sixteenth year, twenty-seventh year, summer, went Jin.",
  "s1001": "Winter, went Chu.",
  "s1002": "Sixth year, duke wished kill nobles establish favored minister, nobles executed favored minister, duke feared, fled Qi.",
  "s1003": "Ninth year",
  "s1004": "538 Seventh year, fourth year, claimed illness not assembled Chu.",
  "s1005": "Tenth year, twentieth year, thirty-ninth year, third year, summer, united feudal lords Song land, allied.",
  "s1006": "Attacked Wu Zhu Fang, executed Qing Feng.",
  "s1007": "Winter, repaid us, took three cities.",
  "s1008": "Thirty-eighth year, sixth year, claimed illness not assembled Chu.",
  "s1009": "Thirty-first year, fifth year, seventeenth year, claimed illness not assembled Chu.",
  "s1010": "Twenty-eighth year, Zi Chan said: three states not assembled.",
  "s1011": "Seventh year, tenth year, Chu executed Qing Feng.",
  "s1012": "537 Jiazi eighth year, fifth year, eleventh year, twenty-first year, Qin Hou Zi returned Qin.",
  "s1013": "Fortieth year, duke died.",
  "s1014": "Hou Zi from Jin returned.",
  "s1015": "Fourth year, led feudal lords attacked Wu.",
  "s1016": "Thirty-ninth year, seventh year, thirty-second year, sixth year, eighteenth year, twenty-ninth year, eighth year, eleventh year, Chu led feudal lords attacked us.",
  "s1017": "536 Ninth year, sixth year, twelfth year, duke went Jin, requested attack Yan, enter their ruler.",
  "s1018": "Twenty-second year, Qi Jing Gong came, requested attack Yan, enter their ruler.",
  "s1019": "Qin Ai Gong first year, fifth year, attacked Wu, stationed Gan Xi.",
  "s1020": "Fortieth year, eighth year, thirty-third year, seventh year, nineteenth year, thirtieth year, ninth year, Qi attacked us.",
  "s1021": "Twelfth year, Chu attacked us, stationed Gan Xi.",
  "s1022": "535 Tenth year, seventh year, Ji Wu Zi died.",
  "s1023": "Solar eclipse.",
  "s1024": "Thirteenth year, entered Yan ruler.",
  "s1025": "Twenty-third year, entered Yan ruler.",
  "s1026": "Second year, sixth year, arrested Yu Yin fled person entered Zhang Hua.",
  "s1027": "Forty-first year, ninth year, lady Jiang Shi had no son.",
  "s1028": "Thirty-fourth year, eighth year, twentieth year, thirty-first year, Yan Dao Gong first year, Hui Gong returned died.",
  "s1029": "Thirteenth year",
  "s1030": "534 Eleventh year, eighth year, duke went Chu, Chu detained him.",
  "s1031": "Congratulated Zhang Hua Tower.",
  "s1032": "Fourteenth year, twenty-fourth year, third year, seventh year, completed Zhang Hua Tower, inner fled persons filled it.",
  "s1033": "Extinguished Chen.",
  "s1034": "Forty-second year, Wei Ling Gong first year, thirty-fifth year, younger brother Zhao made chaos, Ai Gong suicide.",
  "s1035": "Ninth year, twenty-first year, thirty-second year, second year, fourteenth year",
  "s1036": "533 Twelfth year, ninth year, fifteenth year, twenty-fifth year, fourth year, eighth year, younger brother Qi Ji will troops pacify Chen.",
  "s1037": "Forty-third year, second year, Chen Hui Gong Wu first year, Ai Gong grandson.",
  "s1038": "Chu came pacify us.",
  "s1039": "Tenth year, twenty-second year, thirty-third year, third year, fifteenth year",
  "s1040": "532 Thirteenth year, tenth year, sixteenth year, twenty-sixth year, spring, had star came out Wu Nü.",
  "s1041": "Seventh month, duke died.",
  "s1042": "Fifth year, ninth year, forty-fourth year, Ping Gong died.",
  "s1043": "Third year, second year, eleventh year, twenty-third year, thirty-fourth year, fourth year, sixteenth year",
  "s1044": "531 Fourteenth year, eleventh year, seventeenth year, Jin Zhao Gong Yi first year, sixth year, tenth year, drunk killed Cai Hou, sent Qi Ji surrounded him.",
  "s1045": "Qi Ji dwelt it, as Cai Hou.",
  "s1046": "Song Yuan Gong Zuo first year, fourth year, third year, twelfth year, Ling Hou went Chu, Chu killed him, sent Qi Ji dwelt it, as Cai Hou.",
  "s1047": "Twenty-fourth year, thirty-fifth year, fifth year, seventeenth year",
  "s1048": "530 Fifteenth year, twelfth year, court Jin arrived river, Jin apologized returned him.",
  "s1049": "Eighteenth year, duke went Jin.",
  "s1050": "Second year, seventh year, eleventh year, king attacked Xu to frighten Wu, stationed Gan Xi.",
  "s1051": "People tired from service, resented king.",
  "s1052": "Second year, fifth year, duke went Jin, court successor ruler.",
  "s1053": "Fourth year, Cai Hou Lu first year, Jing Hou son.",
  "s1054": "Twenty-fifth year, thirty-sixth year, duke went Jin.",
  "s1055": "Sixth year, Wu Yu Mei first year",
  "s1056": "529 Sixteenth year, thirteenth year, nineteenth year, third year, eighth year, twelfth year, Qi Ji made chaos self-established, Ling Wang suicide.",
  "s1057": "Restored Chen, Cai.",
  "s1058": "Third year, sixth year, fifth year, Chu Ping Wang restored Chen, established Hui Gong.",
  "s1059": "Second year, Chu Ping Wang restored us, established Jing Hou son Lu.",
  "s1060": "Twenty-sixth year, Zheng Ding Gong Ning first year, seventh year, second year",
  "s1061": "528 Seventeenth year, fourteenth year, twentieth year, fourth year, ninth year, Chu Ping Wang Ju first year, Gong Wang son, hugged jade.",
  "s1062": "Fourth year, seventh year, sixth year, third year, twenty-seventh year, second year, Yan Gong Gong first year, third year",
  "s1063": "527 Jiaxu eighteenth year, later crown prince died.",
  "s1064": "Fifteenth year, solar eclipse.",
  "s1065": "Duke went Jin, Jin detained him burial, duke ashamed.",
  "s1066": "Twenty-first year, fifth year, tenth year, second year, king for crown prince took Qin woman, good, self took her.",
  "s1067": "Fifth year, eighth year, seventh year, fourth year, Cao Ping Gong Xu first year, third year, second year, fourth year",
  "s1068": "526 Nineteenth year, sixteenth year, twenty-second year, sixth year, duke died.",
  "s1069": "Six ministers strong, duke house declined.",
  "s1070": "Eleventh year, third year, sixth year, ninth year, eighth year, fifth year, second year, fourth year, third year, Wu Liao first year",
  "s1071": "525 Twentieth year, seventeenth year, fifth month first day, solar eclipse.",
  "s1072": "Comet appeared Chen.",
  "s1073": "Twenty-third year, Jin Qing Gong Qu Ji first year, twelfth year, fourth year, battled with Wu.",
  "s1074": "Seventh year, tenth year, ninth year, sixth year, third year, fifth year, fire, wished pray it, Zi Chan said: better cultivate virtue.",
  "s1075": "Fourth year, second year, battled with Chu.",
  "s1076": "524 Twenty-first year, eighteenth year, twenty-fourth year, second year, thirteenth year, fifth year, eighth year, fire.",
  "s1077": "Eleventh year, fire.",
  "s1078": "Tenth year, fire.",
  "s1079": "Seventh year, fourth year, Ping Gong died.",
  "s1080": "Sixth year, fire.",
  "s1081": "Fifth year, Gong Gong died.",
  "s1082": "Third year",
  "s1083": "523 Twenty-second year, nineteenth year, earthquake.",
  "s1084": "Twenty-fifth year, third year, fourteenth year, sixth year, ninth year, twelfth year, eleventh year, eighth year, Cao Dao Gong Wu first year, seventh year, Yan Ping Gong first year, fourth year",
  "s1085": "522 Twenty-third year, twentieth year, Qi Jing Gong with Yan Zi hunted, entered Lu asked propriety.",
  "s1086": "Twenty-sixth year, hunted Lu border, because entered Lu.",
  "s1087": "Fourth year, fifteenth year, seventh year, executed Wu She, Shang, crown prince Jian fled Song, Wu Xu fled Wu.",
  "s1088": "Tenth year, duke no trust.",
  "s1089": "Falsely killed various sons.",
  "s1090": "Chu crown prince Jian came fleeing, saw chaos, went Zheng.",
  "s1091": "Thirteenth year, twelfth year, ninth year, Ping Hou died.",
  "s1092": "Ling Hou grandson Dong Guo killed Ping Hou son self-established.",
  "s1093": "Second year, eighth year, Chu crown prince Jian from Song came fleeing.",
  "s1094": "Second year, fifth year, Wu Yuan came fleeing.",
  "s1095": "521 Twenty-fourth year, twenty-first year, duke went Jin arrived river, Jin apologized, returned.",
  "s1096": "Solar eclipse.",
  "s1097": "Twenty-seventh year, fifth year, sixteenth year, eighth year, Cai Hou came fleeing.",
  "s1098": "Seventh year, second year, sixth year, ninth year, seventh year, fifth year, second year, fourth year, fourth year"
}
