{
  "s4162": "Two, minister Wu came, plotted to attack Chu.",
  "s4168": "Seventeen, restored Zhao Wu's fields. Invaded Cai.",
  "s4174": "Nine, Jin attacked us.",
  "s4183": "Seventeen, Duke Qing died.",
  "s4184": "Eighteen, seized Zheng Duke Cheng, attacked Zheng. Qin attacked us.",
  "s4185": "Twenty-two, attacked Jin.",
  "s4186": "Nine, rescued Zheng. Winter, made alliance with Jin.",
  "s4192": "Three, made alliance with Chu. Duke went to Jin, duke seized and attacked us.",
  "s4198": "Ten, duke went to Jin for funeral, concealed it.",
  "s4199": "First year of Duke Ling of Qi (Huan)",
  "s4208": "Four, Jin led feudal lords to attack us.",
  "s4216": "First year of Duke Li of Jin (Shou Man)",
  "s4217": "Twenty-four, allied with Jin duke across river, returned and broke alliance.",
  "s4246": "Thirteen, assembled with Jin to attack Qin.",
  "s4247": "Four, attacked Qin.",
  "s4248": "Three, attacked Qin to Jing, defeated them, captured their general Cheng Chai.",
  "s4249": "Twenty-six, Jin led feudal lords to attack us.",
  "s4251": "Eleven, Jin led us to attack Qin.",
  "s4255": "Seventeen, Jin led us to attack Qin.",
  "s4256": "Seven, Jin led us to attack Qin.",
  "s4260": "Jia Shen",
  "s4268": "Twelve, Duke Ding died.",
  "s4271": "First year of Duke Cheng of Cao (Fu Chu)",
  "s4278": "Fifteen, began communicating with Wu, assembled at Zhong Li.",
  "s4280": "Five, three Xi slandered Bo Zong, assassinated him, Bo Zong was fond of direct remonstrance.",
  "s4281": "First year of Duke Jing of Qin",
  "s4282": "Fifteen, Xu feared Zheng, requested to move to Ye.",
  "s4283": "Thirteen, Hua Yuan fled to Jin, then returned.",
  "s4284": "First year of Duke Xian of Wei (Kan)",
  "s4287": "Two, Jin seized our duke and took him back.",
  "s4290": "Ten, assembled with Lu at Zhong Li.",
  "s4294": "Sixteen, Xuan Bo informed Jin, wished to kill Ji Wen Zi, Wen Zi escaped using righteousness.",
  "s4296": "Six, defeated Chu at Yan Ling.",
  "s4298": "Sixteen, rescued Zheng, unfavorable. Zi Fan drunk, army defeated, assassinated Zi Fan and returned.",
  "s4299": "First year of Duke Ping of Song (Cheng)",
  "s4304": "Ten, broke Jin alliance with Chu, Jin attacked us, Chu came to rescue.",
  "s4321": "Thirteen, Duke Zhao died.",
  "s4326": "Eighteen, Duke Cheng died.",
  "s4328": "Eight, Luan Shu and Zhong Xing Yan assassinated Duke Li, established Duke Xiang's great-grandson as Duke Dao.",
  "s4330": "Eighteen, made Yu Shi attack Song's Peng Cheng.",
  "s4331": "Three, Chu attacked Peng Cheng, enfeoffed Yu Shi.",
  "s4336": "Twelve, attacked Song with Chu.",
  "s4337": "First year of Duke Wu of Yan",
  "s4341": "Fourteen, King Jian died.",
  "s4342": "First year of Duke Xiang of Lu (Wu), besieged Song's Peng Cheng.",
  "s4343": "Ten, Jin attacked us, sent crown prince Guang as hostage to Jin.",
  "s4344": "First year of Duke Dao of Jin, besieged Song's Peng Cheng.",
  "s4346": "Nineteen, invaded Song, rescued Zheng.",
  "s4347": "Four, Chu invaded us, took Quan Qiu. Jin executed Yu Shi, returned Peng Cheng to us.",
  "s4348": "Five, besieged Song's Peng Cheng."
}