{
  "s0099": "Di, speak ten thousand things all arrive.",
  "s0100": "South to Kang.",
  "s0101": "Kang, speak ten thousand things kang appear.",
  "s0102": "South to Jue.",
  "s0103": "Jue, speak ten thousand things all have branches angles like jue.",
  "s0104": "Third month, pitch middle Gu Xi.",
  "s0105": "Gu Xi, speak ten thousand things wash born.",
  "s0106": "Its at twelve branches for Chen.",
  "s0107": "Chen, speak ten thousand things chen.",
  "s0108": "Qing Ming wind dwells southeast corner, governs wind blow ten thousand things west them.",
  "s0109": "To Zhen.",
  "s0110": "Zhen, speak ten thousand things increase big zhen zhen thus.",
  "s0111": "West to Yi.",
  "s0112": "Yi, speak ten thousand things all have feather wings.",
  "s0113": "Fourth month, pitch middle Zhong Lu.",
  "s0114": "Zhong Lu, speak ten thousand things all travel west go.",
  "s0115": "Its at twelve branches for Si.",
  "s0116": "Si, speak yang qi already exhausted.",
  "s0117": "West to Seven Stars.",
  "s0118": "Seven Stars, yang number complete at seven, thus called Seven Stars.",
  "s0119": "West to Zhang.",
  "s0120": "Zhang, speak ten thousand things all stretch.",
  "s0121": "West to Zhu.",
  "s0122": "Zhu, speak ten thousand things beginning decline, yang qi down zhu, thus called Zhu.",
  "s0123": "Fifth month, pitch middle Rui Bin.",
  "s0124": "Rui Bin, speak yin qi young few, thus rui;",
  "s0125": "Wei yang not use affairs, thus bin.",
  "s0126": "Jing wind dwells south.",
  "s0127": "Jing, speak yang qi way end, thus Jing wind.",
  "s0128": "Its at twelve branches for Wu.",
  "s0129": "Wu, yin yang intersect, thus Wu.",
  "s0130": "Its at ten mothers for Bing Ding.",
  "s0131": "Bing, speak yang way manifest bright, thus Bing;",
  "s0132": "Ding, speak ten thousand things ding strong, thus Ding.",
  "s0133": "West to Hu.",
  "s0134": "Hu, speak ten thousand things wu fall and approach death.",
  "s0135": "West to Lang.",
  "s0136": "Lang, speak ten thousand things can measure, cut ten thousand things, thus Lang.",
  "s0137": "Liang wind dwells southwest corner, governs earth.",
  "s0138": "Earth, sink seize ten thousand things qi.",
  "s0139": "Sixth month, pitch middle Lin Zhong.",
  "s0140": "Lin Zhong, speak ten thousand things approach death qi lin lin thus.",
  "s0141": "Its at twelve branches for Wei.",
  "s0142": "Wei, speak ten thousand things all complete, have flavors.",
  "s0143": "North to Fa.",
  "s0144": "Fa, speak ten thousand things qi seize can attack.",
  "s0145": "North to Shen.",
  "s0146": "Shen speak ten thousand things can shen, thus Shen.",
  "s0147": "Seventh month, pitch middle Yi Ze.",
  "s0148": "Yi Ze, speak yin qi harm ten thousand things."
}
