{
  "s0001": "Chen Hu Gong Man, Emperor Shun's descendant.",
  "s0002": "Formerly Shun as commoner time, Yao married him two daughters, resided at Gui Rui, his descendants therefore became clan surname, surname Gui clan.",
  "s0003": "Shun already collapsed, transmitted Yu world, Shun son Shang Jun made enfeoffed country.",
  "s0004": "Xia Hou time, or lost or continued.",
  "s0005": "To Zhou Wu Wang conquered Yin Zhou, then again sought Shun descendants, obtained Gui Man, enfeoffed at Chen, to serve Emperor Shun sacrifices, this was Hu Gong.",
  "s0006": "Hu Gong died, son Shen Gong Xi Hou established.",
  "s0007": "Shen Gong died, younger brother Xiang Gong Gao Yang established.",
  "s0008": "Xiang Gong died, established Shen Gong son Tu, this was Xiao Gong.",
  "s0009": "Xiao Gong died, son Shen Gong Yu Rong established.",
  "s0010": "Shen Gong during Zhou Li Wang time.",
  "s0011": "Shen Gong died, son You Gong Ning established.",
  "s0012": "You Gong twelfth year, Zhou Li Wang fled to Zhu.",
  "s0013": "Twenty-third year, You Gong died, son Xi Gong Xiao established.",
  "s0014": "Xi Gong sixth year, Zhou Xuan Wang ascended position.",
  "s0015": "Thirty-sixth year, Xi Gong died, son Wu Gong Ling established.",
  "s0016": "Wu Gong fifteenth year died, son Yi Gong Yue established.",
  "s0017": "This year, Zhou You Wang ascended position.",
  "s0018": "Yi Gong third year died, younger brother Ping Gong Xie established.",
  "s0019": "Ping Gong seventh year, Zhou You Wang for Quan Rong assassinated, Zhou east moved.",
  "s0020": "Qin began ranked as feudal lords.",
  "s0021": "Twenty-third year, Ping Gong died, son Wen Gong Yu established.",
  "s0022": "Wen Gong first year, took Cai woman, gave birth son Tuo.",
  "s0023": "Tenth year, Wen Gong died, eldest son Huan Gong Bao established.",
  "s0024": "Huan Gong twenty-third year, Lu Yin Gong initially established.",
  "s0025": "Twenty-sixth year, Wei killed their lord Zhou Xu.",
  "s0026": "Thirty-third year, Lu assassinated their lord Yin Gong.",
  "s0027": "Thirty-eighth year first month Jia Xu Ji Chou, Huan Gong Bao died.",
  "s0028": "Huan Gong younger brother Tuo, his mother Cai woman, so Cai people for Tuo killed Wu Fu and Huan Gong crown prince Mian established Tuo, this was Li Gong.",
  "s0029": "Huan Gong ill disorder arose, country people dispersed, so double announcement.",
  "s0030": "Li Gong second year, gave birth son Jing Zhong Wan.",
  "s0031": "Zhou great scribe passed Chen, Chen Li Gong made with Zhou Yi divine it, hexagram obtained Guan zhi Pi: 'This is observe country's light, beneficial guest king.",
  "s0032": "This his replace Chen have country?",
  "s0033": "Not at this, his at different country?",
  "s0034": "Not this his body, at his descendants.",
  "s0035": "If at different country, must Jiang surname.",
  "s0036": "Jiang surname, Tai Yue descendants.",
  "s0037": "Things cannot two great, Chen decline, this his prosper?'",
  "s0039": "Li Gong took Cai woman, Cai woman with Cai people lewd, Li Gong several went Cai lewd.",
  "s0040": "Seventh year, Li Gong killed Huan Gong crown prince Mian three younger brothers, eldest Yue, middle Lin, youngest Chu Jiu, together ordered Cai people lure Li Gong with beautiful woman, with Cai people together killed Li Gong established Yue, this was Li Gong.",
  "s0041": "Li Gong, Huan Gong son.",
  "s0042": "Li Gong established five months died, established middle younger brother Lin, this was Zhuang Gong.",
  "s0043": "Zhuang Gong seventh year died, youngest younger brother Chu Jiu established, this was Xuan Gong.",
  "s0044": "Xuan Gong third year, Chu Wu Wang died, Chu began strong.",
  "s0045": "Seventeenth year, Zhou Hui Wang married Chen woman as queen.",
  "s0046": "Twenty-first year, Xuan Gong favorite wife gave birth son Kuan, wished establish him, then killed his crown prince Yu Kou.",
  "s0047": "Yu Kou originally loved Li Gong son Wan, Wan feared calamity reach himself, then fled Qi.",
  "s0048": "Qi Huan Gong wished make Chen Wan minister, Wan said: 'Exiled subject, fortunately obtained avoid shoulder burden, lord's favor, not dare receive high position.'",
  "s0049": "Huan Gong made him artisan chief.",
  "s0050": "Qi Yi Zhong wished marry Chen Jing Zhong, divined it, omen said: 'This called phoenix fly, harmonious call clang clang."
}
