{
  "s0001": "When the Grand Historian read the Qin records, reaching the point where the Quanrong defeated King You and Zhou moved east to Luoyi, Duke Xiang of Qin was first enfeoffed as a feudal lord, built the Western Altar to serve the Supreme Deity—the first signs of presumption appeared.",
  "s0002": "The Rites say: 'The Son of Heaven sacrifices to Heaven and Earth, feudal lords sacrifice to the famous mountains and great rivers within their domains.'",
  "s0003": "Now Qin mixed the customs of the Rong and Di, putting violence and tyranny first, benevolence and righteousness after. Though positioned as a vassal minister, they performed suburban sacrifices—the gentlemen were alarmed.",
  "s0004": "When Duke Wen crossed the Long mountains, drove back the Yi and Di barbarians, honored Chen Bao, and camped between Qi and Yong, Duke Mu repaired his government, his eastern border reached the Yellow River, and thus he equaled the central states' feudal lords like Duke Huan of Qi and Duke Wen of Jin.",
  "s0005": "After this, attendants took charge of government, grand officers held hereditary stipends, the six ministers monopolized Jin's power, conducting campaigns and alliances, their authority greater than the feudal lords.",
  "s0006": "When Tian Chang killed Duke Jian and became chancellor of Qi, the feudal lords were complacently undisturbed, all under Heaven contended for military achievements.",
  "s0007": "The three states finally divided Jin, Tian He also extinguished Qi and possessed it—the flourishing of the six states began from this time.",
  "s0008": "Their efforts were devoted to strengthening troops and uniting against enemies, and the sayings of scheming, deception, and the vertical and horizontal alliances of long and short arose from this.",
  "s0009": "False pretenses swarmed like bees, oaths and covenants were not trusted, even placing hostages and splitting tallies could not bind them.",
  "s0010": "Qin began as a small, remote country, the various Xia treated it as a guest, compared it to the Rong and Di, until after Duke Xian it constantly dominated the feudal lords.",
  "s0011": "Discussing Qin's virtue and righteousness as inferior to the violent tyranny of Lu and Wei, measuring Qin's troops as not as strong as the three Jins, yet in the end it united all under Heaven—not necessarily because of dangerous fortifications, convenient terrain, or advantageous positions, but rather as if Heaven assisted it.",
  "s0012": "Some say 'Eastern things begin life there, western things mature there.'",
  "s0013": "Those who initiate affairs must do so in the southeast, those who gather actual merit are constantly in the northwest.",
  "s0014": "Thus Yu rose from the Western Qiang, Tang arose from Bo, Zhou's kings used Feng and Hao to attack Yin, Qin's emperors used Yong province to rise, Han's rise came from Shu and Han.",
  "s0015": "Qin, having achieved its ambitions, burned the poems and documents of all under Heaven, the feudal lords' historical records especially so, because they contained criticisms.",
  "s0016": "The reason the poems and documents reappeared was that many were hidden in people's homes, but the historical records were stored only in the Zhou court, so they were destroyed.",
  "s0017": "Alas, alas!",
  "s0018": "Only the Qin records remained, but they did not record dates and months, their text was brief and incomplete.",
  "s0019": "Yet the stratagems and changes of the Warring States also have much worth adopting—why must it be ancient times?",
  "s0020": "Qin took the world with much violence, yet eras change, great success was achieved.",
  "s0021": "The tradition says 'Follow later kings,' why is that?",
  "s0022": "Because they are close to us and their customs and changes are similar, their doctrines are humble and easy to implement.",
  "s0023": "Scholars are constrained by what they have heard, seeing Qin in the imperial position for few days, not examining its beginning and end, so they laugh at it, not daring to discuss it—this is no different from eating with the ears.",
  "s0024": "How lamentable!",
  "s0025": "I therefore followed the Qin records, continued after the Spring and Autumn Annals, beginning from King Yuan of Zhou, chronicled the affairs of the six states, ending with the Second Emperor, altogether 270 years, recording the causes of rise and fall that I have heard.",
  "s0026": "May future gentlemen use this to observe and reflect."
}
