{
  "s2": "He said: 'Alas, Master Zhi foresaw it!'",
  "s3": "When Zhou made ivory chopsticks, Jizi sighed.",
  "s4": "When the Zhou way declined, poets based themselves on the bedchamber, and 'Guan Ju' was composed.",
  "s5": "When benevolence and righteousness decayed, 'Lu Ming' criticized it.",
  "s6": "When it came to King Li, because he hated to hear of his faults, the ministers feared execution and disaster arose. King Li fled to Zhi, and disorder began in the capital. The Gonghe administered government.",
  "s7": "After this, some ruled by force, the strong oppressed the weak, they raised armies without asking the Son of Heaven.",
  "s8": "Yet upholding the righteousness of the royal house, they made punitive expeditions as lords of alliances. Politics came from the Five Hegemons, feudal lords acted wantonly, extravagant and lawless, traitorous ministers and usurping sons arose increasingly.",
  "s9": "Qi, Jin, Qin, and Chu were insignificant in the time of prosperous Zhou, their fiefs only a hundred li or fifty li.",
  "s10": "Jin blocked the three rivers, Qi faced the eastern sea, Chu bordered the Jiang and Huai, Qin relied on the defenses of Yong province. The four seas rose in succession, replacing each other as hegemonic lords. Those praised and greatly enfeoffed by Wen and Wu all inspired awe and submission.",
  "s11": "This is why Confucius clarified the way of kings, petitioned more than seventy rulers, but none could employ him. Therefore he observed the western Zhou court, discussed historical records and old traditions, arose in Lu and arranged the Spring and Autumn Annals, recording from Yin above to the capture of the unicorn in Ai below, condensing their wording and style, removing their tedious repetitions, to establish righteous principles. The way of kings was complete, human affairs thorough.",
  "s12": "The disciples of the seventy orally received his transmitted pointers, because there were writings of criticism, ridicule, praise, concealment, yielding, and reduction that could not be seen in writing.",
  "s13": "The Lu gentleman Zuo Qiuming feared that disciples would each follow different doctrines, each settle on their own intentions, lose the truth, so he comprehensively discussed their words based on Confucius's historical records, completing the Zuo Shi Spring and Autumn.",
  "s14": "Duo Jiao made a commentary for King Wei of Chu, because the king could not fully observe the Spring and Autumn, selected successes and failures, finally made forty chapters, becoming the Duo Shi subtle interpretation.",
  "s15": "During King Xiaocheng of Zhao's time, his chancellor Yu Qing gathered from the Spring and Autumn above, observed recent trends below, also wrote eight chapters, becoming the Yu Shi Spring and Autumn.",
  "s16": "Lu Buwei, chancellor of King Zhuangxiang of Qin, also observed ancient precedents above, collected and compiled the Spring and Autumn, gathered affairs of the six states, making eight surveys, six discussions, twelve records, becoming the Lu Shi Spring and Autumn.",
  "s17": "And like Xun Qing, Meng Zi, Gongsun Gu, and Han Fei and others, each often gathered texts from the Spring and Autumn to write books, different and surpassing records.",
  "s18": "The Han chancellor Zhang Cang calculated the spectrum of the five virtues, the upper grand master Dong Zhongshu promoted the righteousness of the Spring and Autumn, and wrote extensively.",
  "s19": "BCE",
  "s20": "Year",
  "s21": "Zhou",
  "s22": "Lu",
  "s23": "Qi",
  "s24": "Jin",
  "s25": "Qin",
  "s26": "Chu",
  "s27": "Song",
  "s28": "Wei",
  "s29": "Chen",
  "s30": "Cai",
  "s31": "Cao",
  "s32": "Zheng",
  "s33": "Yan",
  "s34": "Wu",
  "s51": "840",
  "s53": "2",
  "s54": "16",
  "s55": "11",
  "s56": "Duke Xi of Jin, Situ, first year",
  "s57": "5",
  "s58": "8",
  "s59": "19",
  "s60": "15",
  "s61": "15",
  "s62": "24",
  "s63": "25",
  "s65": "25",
  "s67": "839",
  "s69": "3",
  "s70": "17",
  "s71": "12",
  "s72": "Duke Xian of Jin, Ji, first year",
  "s73": "6",
  "s74": "9",
  "s75": "20",
  "s76": "16",
  "s77": "16",
  "s78": "25",
  "s79": "26",
  "s81": "26",
  "s83": "838",
  "s85": "4",
  "s86": "18",
  "s87": "13",
  "s88": "Duke Mu of Jin, Fei Wang, first year",
  "s89": "7",
  "s90": "10",
  "s91": "21",
  "s92": "17",
  "s93": "17",
  "s94": "26",
  "s95": "27",
  "s97": "27",
  "s99": "837"
}
