{
  "s0599": "Eighth year, Chu Zhuang Wang Lu first year, seventh year, twenty-second year, Chen Ling Gong Ping Guo first year, thirty-third year, fifth year, fifteenth year, fifth year",
  "s0600": "612 Kuang Wang first year, fifteenth year, sixth month Xin Chou, solar eclipse, Qi attacked us.",
  "s0601": "Qi Yi Gong Shang Ren first year, ninth year, we entered Cai.",
  "s0602": "Ninth year, second year, eighth year, twenty-third year, second year, thirty-fourth year, Jin attacked us.",
  "s0603": "Zhuang Hou died.",
  "s0604": "Sixth year, Qi entered our outer wall.",
  "s0605": "Sixteenth year, sixth year",
  "s0606": "611 Second year, sixteenth year, second year, did not obtain people's hearts.",
  "s0607": "Tenth year, tenth year, third year, extinguished Yong.",
  "s0608": "Ninth year, Xiang lady sent Wei Bo killed Zhao Gong.",
  "s0609": "Younger brother Bao established.",
  "s0610": "Twenty-fourth year, third year, Cai Wen Hou Shen first year, seventh year, seventeenth year, seventh year",
  "s0611": "610 Third year, seventeenth year, Qi attacked us.",
  "s0612": "Third year, attacked Lu.",
  "s0613": "Eleventh year, led feudal lords pacified Song.",
  "s0614": "Eleventh year, fourth year, Song Wen Gong Bao first year, Zhao Gong younger brother.",
  "s0615": "Jin led feudal lords pacified us.",
  "s0616": "Twenty-fifth year, fourth year, second year, eighth year, eighteenth year, eighth year",
  "s0617": "609 Fourth year, eighteenth year, Xiang Zhong killed legitimate, established concubine son as Xuan Gong.",
  "s0618": "Fourth year, duke cut off Bing Chou father and took Yan Zhi wife, two people together killed duke, established Huan Gong son Hui Gong.",
  "s0619": "Twelfth year, twelfth year, fifth year, second year, twenty-sixth year, fifth year, third year, ninth year, nineteenth year, ninth year",
  "s0620": "608 Fifth year, Lu Xuan Gong Chou first year, Lu established Xuan Gong, not correct, duke's house declined.",
  "s0621": "Qi Hui Gong Yuan first year, took Lu Ji west fields.",
  "s0622": "Thirteenth year, Zhao Dun rescued Chen, Song, attacked Zheng.",
  "s0623": "Qin Gong Gong He first year, sixth year, attacked Song, Chen, because they doubled our submission to Jin cause.",
  "s0624": "Third year, Chu, Zheng attacked us, because we doubled Chu cause.",
  "s0625": "Twenty-seventh year, sixth year, fourth year, tenth year, twentieth year, with Chu invaded Chen, then invaded Song.",
  "s0626": "Jin sent Zhao Dun attacked us, because we doubled Jin cause.",
  "s0627": "Tenth year",
  "s0628": "607 Jiajin sixth year, Kuang Wang died.",
  "s0629": "Second year, second year, Wang Zi Cheng Fu defeated Chang Di.",
  "s0630": "Fourteenth year, Zhao Chuan killed Ling Gong, Zhao Dun made Chuan welcome Gong Zi Hei Zhuo from Zhou, established him.",
  "s0631": "Zhao clan granted duke clan.",
  "s0632": "Second year, seventh year, fourth year, Hua Yuan because lamb stew cause trapped in Zheng.",
  "s0633": "Twenty-eighth year, seventh year, fifth year, eleventh year, twenty-first year, with Song army battled, captured Hua Yuan.",
  "s0634": "Eleventh year",
  "s0635": "606 Ding Wang first year, third year, third year, Jin Cheng Gong Hei Zhuo first year, attacked Zheng.",
  "s0636": "Third year, eighth year, attacked Lu Hun, reached Luo, asked ding weight.",
  "s0637": "Fifth year, ransomed Hua Yuan, fled returned.",
  "s0638": "Surrounded Cao.",
  "s0639": "Twenty-ninth year, eighth year, sixth year, twelfth year, Song surrounded us.",
  "s0640": "Twenty-second year, Hua Yuan fled returned.",
  "s0641": "Twelfth year",
  "s0642": "605 Second year, fourth year, fourth year, second year, fourth year, ninth year, Ruo Ao clan made chaos, extinguished them.",
  "s0643": "Attacked Zheng.",
  "s0644": "Sixth year, thirtieth year, ninth year, seventh year, thirteenth year, Zheng Ling Gong Yi first year, Gong Zi Gui Sheng with turtle cause killed Ling Gong.",
  "s0645": "Thirteenth year",
  "s0646": "604 Third year, fifth year, fifth year, third year, Zhong Xing Huan Zi Xun Lin Fu rescued Zheng, attacked Chen.",
  "s0647": "Fifth year, tenth year, seventh year, thirty-first year, tenth year, Chu attacked Zheng, with us pacified.",
  "s0648": "Jin Zhong Xing Huan Zi resisted Chu, rescued Zheng, attacked us.",
  "s0649": "Eighth year, fourteenth year, Zheng Xiang Gong Jian first year, Ling Gong concubine younger brother.",
  "s0650": "Chu attacked us, Jin came rescue.",
  "s0651": "Fourteenth year",
  "s0652": "603 Fourth year, sixth year, sixth year, fourth year, with Wei invaded Chen.",
  "s0653": "Qin Huan Gong first year, eleventh year, eighth year, thirty-second year, with Jin invaded Chen.",
  "s0654": "Eleventh year, Jin, Wei invaded us.",
  "s0655": "Ninth year, fifteenth year, second year, fifteenth year",
  "s0656": "602 Fifth year, seventh year, seventh year, fifth year, second year, twelfth year, ninth year, thirty-third year, twelfth year, tenth year, sixteenth year, third year, sixteenth year",
  "s0657": "601 Sixth year, eighth year, seventh month, solar eclipse.",
  "s0658": "Eighth year, sixth year, with Lu attacked Qin, captured Qin spy, killed in Jiang marketplace, six days then revived.",
  "s0659": "Third year, Jin attacked us, captured spy.",
  "s0660": "Thirteenth year, attacked Chen, extinguished Shu Liao.",
  "s0661": "Tenth year, thirty-fourth year, thirteenth year, Chu attacked us.",
  "s0662": "Eleventh year, seventeenth year, fourth year, Yan Xuan Gong first year",
  "s0663": "600 Seventh year, ninth year, ninth year, seventh year, sent Huan Zi attacked Chu.",
  "s0664": "With feudal lords army attacked Chen rescued Zheng.",
  "s0665": "Cheng Gong died.",
  "s0666": "Fourth year, fourteenth year, attacked Zheng, Jin Xi Que rescued Zheng, defeated us.",
  "s0667": "Eleventh year, thirty-fifth year, fourteenth year, twelfth year, eighteenth year, fifth year, Chu attacked us, Jin came rescue, defeated Chu army.",
  "s0668": "599 Eighth year, fourteenth month, solar eclipse.",
  "s0669": "Tenth year, duke died.",
  "s0670": "Cui Zhu had favor, Gao, Guo drove him, fled Wei.",
  "s0671": "Jin Jing Gong Ju first year, with Song attacked Zheng.",
  "s0672": "Fifth year, fifteenth year, twelfth year, Wei Mu Gong Chi first year, Qi Cui Zhu came fleeing.",
  "s0673": "Fifteenth year, Xia Zheng Shu with his mother shame, killed Ling Gong.",
  "s0674": "Thirteenth year, nineteenth year, sixth year, Jin, Song, Chu attacked us.",
  "s0675": "Third year",
  "s0676": "598 Ninth year, eleventh year, Qi Qing Gong Wu Ye first year, second year, sixth year, sixteenth year, led feudal lords executed Chen Xia Zheng Shu, established Chen Ling Gong son Wu.",
  "s0677": "Thirteenth year, second year, Chen Cheng Gong Wu first year, Ling Gong crown prince.",
  "s0678": "Fourteenth year, twentieth year, seventh year, fourth year",
  "s0679": "597 Jiazi tenth year, twelfth year, second year, third year, rescued Zheng, for Chu defeated Yellow River on.",
  "s0680": "Seventh year, seventeenth year, surrounded Zheng, Zheng Bo bare flesh apologized, released him.",
  "s0681": "Fourteenth year, attacked Chen.",
  "s0682": "Third year, second year, fifteenth year, twenty-first year, eighth year, Chu surrounded us, we humble words to resolve.",
  "s0683": "Fifth year",
  "s0684": "596 Eleventh year, thirteenth year, third year, fourth year, eighth year, eighteenth year, fifteenth year, fourth year, third year, sixteenth year, twenty-second year, ninth year, sixth year",
  "s0685": "595 Twelfth year, fourteenth year, fourth year, fifth year, attacked Zheng.",
  "s0686": "Ninth year, nineteenth year, surrounded Song, because killed envoy.",
  "s0687": "Sixteenth year, killed Chu envoy, Chu surrounded us.",
  "s0688": "Fifth year, fourth year, seventeenth year, twenty-third year, Wen Gong died.",
  "s0689": "Tenth year, Jin attacked us.",
  "s0690": "Seventh year",
  "s0691": "594 Thirteenth year, fifteenth year, began taxing mu.",
  "s0692": "Fifth year, sixth year, rescued Song, arrested Jie Yang, had envoy tally.",
  "s0693": "Qin attacked us.",
  "s0694": "Tenth year, twentieth year, surrounded Song.",
  "s0695": "Fifth month, Hua Yuan told Zi Fan with sincerity, Chu stopped.",
  "s0696": "Seventeenth year, Hua Yuan told Chu, Chu departed.",
  "s0697": "Sixth year, fifth year, eighteenth year, Cao Xuan Gong Lu first year, eleventh year, assisted Chu attacked Song, arrested Jie Yang.",
  "s0698": "Seventh year, twelfth year, twenty-fourth year, thirteenth year, fourteenth year, twenty-fourth year, eighth year, sixth year"
}
