{
  "s0197": "Rivers called the Yellow River, sacrificed at Linjin;",
  "s0198": "Mian, sacrificed at Hanzhong;",
  "s0199": "Jiao Abyss, sacrificed at Zhaona;",
  "s0200": "Yangtze River, sacrificed at Shu.",
  "s0201": "Also in spring they break up ice, in autumn dry up water, in winter blocked prayers and sacrifices, like the eastern famous mountains and rivers;",
  "s0202": "and the sacrificial animals were calves, with varying pens, jade, and silk.",
  "s0203": "And the four great tombs Hong, Qi, Wu, Yue, all had autumn grain sacrifices.",
  "s0204": "Chen Bao had seasonal sacrifices.",
  "s0205": "The Yellow River additionally had autumn wine sacrifices.",
  "s0206": "These were all in Yong province's domain, near the Son of Heaven's capital, so they added one carriage, four sorrel horses.",
  "s0207": "Ba, Chan, Changshui, Yong, Lao, Jing, Wei were not great rivers, but because they were near Xianyang, they all received mountain and river sacrifices, without additional offerings.",
  "s0208": "The two abysses of Qian and Luo, Mingze, Pushan, Yuexushan and others were small mountains and rivers, and all had annual prayers and sacrifices for blockages, ice breaking, and water drying, but the rituals were not necessarily the same.",
  "s0209": "Yong had more than a hundred temples for the sun, moon, Can, Shen, northern and southern dippers, Yinghuo, Taibai, Suixing, Tianshen, the twenty-eight constellations, wind lord, rain master, four seas, nine ministers, fourteen ministers, various spreading spirits, various strict spirits, various seeking spirits, and others.",
  "s0210": "The west also had several dozen sacrifices.",
  "s0211": "At the lake there was a temple for the Zhou Son of Heaven.",
  "s0212": "At Xia Gui there was a heaven spirit.",
  "s0213": "Yong and Chen had Zhao Ming and the Son of Heaven's secluded pool.",
  "s0214": "At Du and Bo there were sacrifices to the three altar lords and the longevity star;",
  "s0215": "and Yong's Jian temple also had a Du lord.",
  "s0216": "The Du lord was formerly Zhou's right general, and among Qin spirits, he was the least significant.",
  "s0217": "Each was sacrificed to according to the seasons.",
  "s0218": "Only Yong's four altars to the Supreme Deity were most honored, and what moved the people most was Chen Bao.",
  "s0219": "Therefore Yong's four altars: in spring they made annual prayers, when ice broke up; in autumn when water dried; in winter for blocked sacrifices; in the fifth month they tasted colts; and in the four mid-months they sacrificed if it was the month, and if Chen Bao's season came, they sacrificed once.",
  "s0220": "In spring and summer they used red horses, in autumn and winter they used black horses.",
  "s0221": "Altar colts were four horses each, wooden dragon-ornamented carriages one team, wooden carriages and horses one team each, each matching their emperor's color.",
  "s0222": "Yellow calves and lambs four each, jade and silk each had numbers, all buried alive, without sacrificial stands and vessels.",
  "s0223": "Once every three years for suburban sacrifices.",
  "s0224": "Qin made the tenth month of winter the year's beginning, so they constantly used the tenth month to lodge at the altar and see the suburban sacrifice, passed through Quan fire, bowed beside Xianyang, and wore upper white, their usage was like the regular sacrifices.",
  "s0225": "The western altar and qi altar were sacrificed to as before, the emperor did not personally go.",
  "s0226": "All these sacrifices were constantly overseen by the grand invocator, who sacrificed to them according to the seasons.",
  "s0227": "As for other famous mountains, rivers, various ghosts, and the eight spirits, when the emperor passed by he sacrificed, when he left he stopped.",
  "s0228": "Sacrifices to gods of distant commanderies and counties were maintained by the people themselves, not overseen by the Son of Heaven's invocator officials.",
  "s0229": "The invocator officials had secret prayers, and when there were calamities or good omens, they immediately prayed and transferred them downward.",
  "s0230": "When Han arose, during Gaozu's humble times, he once killed a large snake.",
  "s0231": "There was a voice that said: 'The snake is the White Emperor's son, but the killer is the Red Emperor's son.'",
  "s0232": "When Gaozu first rose up, he prayed at the Fengfen Yu Altar.",
  "s0233": "When he toured Pei, became Duke of Pei, he sacrificed to Chi You, smeared blood on drums and flags.",
  "s0234": "He then arrived at Bashang in the tenth month, pacified Xianyang with the feudal lords, and was established as King of Han.",
  "s0235": "Therefore he made the tenth month the year's beginning, and took red as the superior color.",
  "s0236": "In the second year, he attacked Xiang Ji eastward and returned, entering the passes, asked: 'What emperor did the former Qin sacrifice to the Supreme Deity?'",
  "s0237": "They answered: 'Four emperors, there were sacrifices to the White, Blue, Yellow, Red emperors.'",
  "s0238": "Gaozu said: 'I have heard heaven has five emperors, but there are four, why is that?'",
  "s0239": "No one knew the explanation.",
  "s0240": "Therefore Gaozu said: 'I understand it now, they were waiting for me to complete the five.'",
  "s0241": "He then established the Black Emperor sacrifice, named it the Northern Altar.",
  "s0242": "The officials conducted the sacrifice, the emperor did not personally go.",
  "s0243": "He summoned all the former Qin invocator officials, restored the grand invocator and grand steward, following their former ceremonies and rituals.",
  "s0244": "He ordered the counties to establish public altars.",
  "s0245": "He issued an edict saying: 'I greatly value sacrifices and respect offerings."
}
