{
  "s0383": "They killed King You at the foot of Li Mountain, captured Bao Si, took all Zhou's treasures and left.",
  "s0384": "Therefore the lords went to Shen Hou and together established the former King You's crown prince Yi Jiu, this was King Ping, to continue the Zhou sacrifices.",
  "s0385": "King Ping ascended, moved east to Luoyi, to avoid the Rong invaders.",
  "s0386": "In King Ping's time, the Zhou house declined and weakened, the lords strong annexed the weak, Qi, Chu, Qin, Jin began to grow great, government was by the regional lords.",
  "s0387": "Forty-ninth year, Duke Yin of Lu ascended.",
  "s0388": "Fifty-first year, Duke Huan of Lu ascended.",
  "s0389": "Fifty-second year, solar eclipse, did not record the day, the officials lost it.",
  "s0390": "Fifty-third year, Duke Zhuang of Lu ascended.",
  "s0391": "Fifty-fourth year, solar eclipse, did not record the day, the officials lost it.",
  "s0392": "Fifty-fifth year, Duke Xi of Lu ascended.",
  "s0393": "Fifty-sixth year, Duke Wen of Lu ascended.",
  "s0394": "Fifty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0395": "Fifty-eighth year, Duke Xuan of Lu ascended.",
  "s0396": "Fifty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0397": "Sixtieth year, Duke Cheng of Lu ascended.",
  "s0398": "Sixty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0399": "Sixty-second year, Duke Xiang of Lu ascended.",
  "s0400": "Sixty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0401": "Sixty-fourth year, Duke Zhao of Lu ascended.",
  "s0402": "Sixty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0403": "Sixty-sixth year, Duke Ding of Lu ascended.",
  "s0404": "Sixty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0405": "Sixty-eighth year, Duke Ai of Lu ascended.",
  "s0406": "Sixty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0407": "Seventieth year, Duke Dao of Lu ascended.",
  "s0408": "Seventy-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0409": "Seventy-second year, Duke Yuan of Lu ascended.",
  "s0410": "Seventy-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0411": "Seventy-fourth year, Duke Mu of Lu ascended.",
  "s0412": "Seventy-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0413": "Seventy-sixth year, Duke Gong of Lu ascended.",
  "s0414": "Seventy-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0415": "Seventy-eighth year, Duke Kang of Lu ascended.",
  "s0416": "Seventy-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0417": "Eightieth year, Duke Ding of Lu ascended.",
  "s0418": "Eighty-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0419": "Eighty-second year, Duke Ai of Lu ascended.",
  "s0420": "Eighty-third year, solar eclipse, did not record the day, the officials lost it.",
  "s0421": "Eighty-fourth year, Duke Dao of Lu ascended.",
  "s0422": "Eighty-fifth year, solar eclipse, did not record the day, the officials lost it.",
  "s0423": "Eighty-sixth year, Duke Yuan of Lu ascended.",
  "s0424": "Eighty-seventh year, solar eclipse, did not record the day, the officials lost it.",
  "s0425": "Eighty-eighth year, Duke Mu of Lu ascended.",
  "s0426": "Eighty-ninth year, solar eclipse, did not record the day, the officials lost it.",
  "s0427": "Ninetieth year, Duke Gong of Lu ascended.",
  "s0428": "Ninety-first year, solar eclipse, did not record the day, the officials lost it.",
  "s0429": "Ninety-second year, Duke Kang of Lu ascended.",
  "s0430": "Ninety-third year, solar eclipse, did not record the day, the officials lost it."
}