{
  "s778": "Twelfth month Geng Yin, Palace Attendant General Fan Ming You became Du Liao General, struck Wu Wan.",
  "s782": "Third month Jia Xu, Qian Qiu died.",
  "s783": "Third month Yi Chou, Imperial Secretary Grandee Wang Xin became chancellor, enfeoffed Fu Chun Hou.",
  "s785": "Imperial Secretary Grandee Yang Chang.",
  "s788": "Twelfth month Geng Xu, Xin died.",
  "s795": "Eleventh month Yi Chou, Imperial Secretary Grandee Yang Chang became chancellor, enfeoffed An Ping Hou.",
  "s796": "Ninth month Geng Yin, Wei Wei Ping Ling Hou Fan Ming You became Du Liao General, struck Wu Wan.",
  "s799": "Yuan Ping first year",
  "s800": "Chang died.",
  "s801": "Ninth month Wu Xu, Imperial Secretary Grandee Cai Yi became chancellor, enfeoffed Yang Ping Hou.",
  "s802": "Fourth month Jia Shen, Guang Lu Grandee Long Bang Hou Han Zeng became Front General. Fifth month Ding You, Water Balance Colonel Zhao Chong Guo became Rear General, Right General Zhang An Shi became Chariot Cavalry General.",
  "s803": "Imperial Secretary Grandee Chang Shui Hou Tian Guang Ming.",
  "s805": "Xiao Xuan Ben Shi first year",
  "s814": "Seventh month Geng Yin, Imperial Secretary Grandee Tian Guang Ming became Qi Lian General, Long Bang Hou Han Zeng became Rear General, Ying Ping Hou Zhao Chong Guo became Pu Lei General, Du Liao General Ping Ling Hou Fan Ming You became Yun Zhong Grand Administrator, Fu Min Hou Tian Shun became Hu Ya General: all struck Xiongnu.",
  "s818": "Third month Wu Zi, empress collapsed. Sixth month Yi Chou, Yi died.",
  "s819": "Sixth month Jia Chen, Chang Xin Shao Fu Wei Xian became chancellor, enfeoffed Fu Yang Hou. Tian Guang Ming, Tian Shun struck Hu returned, all suicide. Chong Guo deprived general seal.",
  "s821": "Imperial Secretary Grandee Wei Xiang.",
  "s824": "Tenth month Yi Mao, established Huo empress.",
  "s829": "Di Jie first year",
  "s837": "Four. Third month Geng Wu, General Guang died.",
  "s838": "Second month Ding Mao, Attendant, Palace Attendant General Huo Yu became Right General.",
  "s842": "Established crown prince. Fifth month Jia Shen, Xian old, granted gold one hundred jin.",
  "s843": "Sixth month Ren Chen, Imperial Secretary Grandee Wei Xiang became chancellor, enfeoffed Gao Ping Hou.",
  "s844": "Seventh month, An Shi became Grand Commandant, Wei General. Yu became Grand Commandant.",
  "s845": "Imperial Secretary Grandee Bing Ji.",
  "s849": "Two. Seventh month Ren Yin, Yu waist beheaded.",
  "s853": "Yuan Kang first year",
  "s873": "Six. Eighth month Bing Yin, An Shi died.",
  "s877": "Shen Jue first year",
  "s878": "Emperor suburban Gan Quan Tai Zhi, Fen Yin Hou Tu.",
  "s880": "Fourth month, Yue Cheng Hou Xu Yan Shou became Strong Crossbow General. Rear General Chong Guo struck Qiang. Jiu Quan Grand Administrator Xin Wu Xian became Break Qiang General. Han Zeng became Grand Commandant, Chariot Cavalry General.",
  "s884": "Emperor suburban Yong five zhi. Sacrificial altar produced precious jade bi jade vessels.",
  "s890": "Third month, Xiang died.",
  "s891": "Fourth month Wu Xu, Imperial Secretary Grandee Bing Ji became chancellor, enfeoffed Bo Yang Hou.",
  "s893": "Imperial Secretary Grandee Wang Zhi.",
  "s901": "Wu Feng first year",
  "s909": "Four. Fifth month Ji Chou, Zeng died.",
  "s910": "Fifth month, Yan Shou became Grand Commandant, Chariot Cavalry General.",
  "s911": "Imperial Secretary Grandee Ba.",
  "s914": "First month, Ji died.",
  "s915": "Third month Ren Shen, Imperial Secretary Grandee Huang Ba became chancellor, enfeoffed Jian Cheng Hou.",
  "s917": "Imperial Secretary Grandee Yan Nian.",
  "s925": "Gan Lu first year",
  "s927": "Three. Third month Ding Wei, Yan Shou died.",
  "s932": "Amnesty special death, granted high age and widowers widows orphans silk, women cattle wine.",
  "s935": "Imperial Secretary Grandee Ding Guo.",
  "s938": "Third month Ji Chou, Ba died.",
  "s939": "Seventh month Ding Si, Imperial Secretary Grandee Yu Ding Guo became chancellor, enfeoffed Xi Ping Hou.",
  "s941": "Grand Usher Chen Wan Nian became Imperial Secretary Grandee.",
  "s949": "Huang Long first year"
}
