{
  "s0050": "After Duke Xiang of Qin became a feudal lord, he resided in the western frontier. Considering himself the descendant of Shaohao's spirit, he built the Western Altar, sacrificing to the White Emperor, using a sorrel horse, yellow ox, and ram as offerings.",
  "s0051": "Sixteen years later, Duke Wen of Qin hunted east between the Qian and Wei rivers, and divination showed it was auspicious to settle there.",
  "s0052": "Duke Wen dreamed of a yellow serpent descending from heaven to earth, its mouth stopping at Fu Yan.",
  "s0053": "Duke Wen asked Shi Dun, who said: 'This is an omen from the Supreme Deity. Your lordship should sacrifice to it.'",
  "s0054": "Therefore he built the Fu Altar, using the three sacrificial animals to perform suburban sacrifices to the White Emperor.",
  "s0055": "Before building the Fu Altar, there were already the Wu Yang Wu Altar beside Yong, and the Hao Altar east of Yong, but all were abandoned without sacrifices.",
  "s0056": "Some say: 'Since ancient times, Yong province has accumulated height and is a secluded place for spirits, so altars were established to sacrifice to the Supreme Deity, and all the spirit sacrifices were gathered there.",
  "s0057": "It is said that during the Yellow Emperor's time they performed the rituals, and even in the late Zhou they performed suburban sacrifices.'",
  "s0058": "These words are not found in the classics, and the educated do not discuss them.",
  "s0059": "Nine years after building the Fu Altar, Duke Wen obtained a stone like clouds at Chen Cang's northern slope and built a city to sacrifice to it.",
  "s0060": "Its spirit sometimes did not come for a year, sometimes came several times. When it came, it was always at night, its brilliance like a shooting star, coming from the southeast to gather at the sacrificial city, making sounds like a male pheasant, with a resounding echo like wild chickens crowing at night.",
  "s0061": "He sacrificed with one pen of animals, naming it Chen Bao.",
  "s0062": "Seventy-eight years after building the Fu Altar, Duke De of Qin ascended the throne. He divined about settling in Yong: 'Later generations will drink horses at the river,' so he moved the capital to Yong.",
  "s0063": "The various sacrifices of Yong flourished from this time.",
  "s0064": "He used three hundred pens of animals at the Fu Altar.",
  "s0065": "He established the Hidden Sacrifice.",
  "s0066": "He tore dogs at the four gates of the city to ward off calamities.",
  "s0067": "Duke De died in his second year.",
  "s0068": "Four years later, Duke Xuan of Qin built the Mi Altar south of the Wei River, sacrificing to the Blue Emperor.",
  "s0069": "Fourteen years later, Duke Mu of Qin ascended the throne. He fell ill and lay unconscious for five days;",
  "s0070": "when he awoke, he said he dreamed of the Supreme Deity, who commanded Duke Mu to pacify the Jin disorder.",
  "s0071": "The scribe recorded and stored it in the archives.",
  "s0072": "Later generations all said Duke Mu of Qin ascended to heaven.",
  "s0073": "In the ninth year of Duke Mu of Qin's reign, after Duke Huan of Qi became hegemon, he assembled the feudal lords at Kuiqiu and wished to perform the feng and shan sacrifices.",
  "s0074": "Guan Zhong said: 'In ancient times, those who performed the feng sacrifice on Mount Tai and the shan sacrifice on Mount Li numbered seventy-two houses, and I have recorded twelve of them.",
  "s0075": "In ancient times, the Wu Huai clan performed feng on Mount Tai and shan on Yunyun;",
  "s0076": "Fu Xi performed feng on Mount Tai and shan on Yunyun;",
  "s0077": "Shen Nong performed feng on Mount Tai and shan on Yunyun;",
  "s0078": "Yan Di performed feng on Mount Tai and shan on Yunyun;",
  "s0079": "Huang Di performed feng on Mount Tai and shan on Tingting;",
  "s0080": "Zhuan Xu performed feng on Mount Tai and shan on Yunyun;",
  "s0081": "Di Ku performed feng on Mount Tai and shan on Yunyun;",
  "s0082": "Yao performed feng on Mount Tai and shan on Yunyun;",
  "s0083": "Shun performed feng on Mount Tai and shan on Yunyun;",
  "s0084": "Yu performed feng on Mount Tai and shan on Kuaiji;",
  "s0085": "Tang performed feng on Mount Tai and shan on Yunyun;",
  "s0086": "King Cheng of Zhou performed feng on Mount Tai and shan on Sheshou: all received the mandate before they could perform feng and shan.'",
  "s0087": "Duke Huan said: 'I have attacked the Shan Rong in the north, passing through Gu Zhu;",
  "s0088": "attacked Da Xia in the west, crossed the Flowing Sands, tied horses and hung carriages, ascended Mount Bei'er;",
  "s0089": "attacked south to Zhaoling, ascended Mount Xiong'er to gaze upon the Yangtze and Han rivers.",
  "s0090": "I have assembled chariots three times, assembled carriages six times, united the feudal lords nine times, corrected the realm once, and no feudal lord dares disobey me.",
  "s0091": "How is this different from when the Three Dynasties received the mandate?'",
  "s0092": "Therefore Guan Zhong, seeing that Duke Huan could not be persuaded with words, set forth practical reasons, saying: 'The ancient feng and shan sacrifices used millet from Xiang Shang, grain from Bei Li, which served as the abundance;",
  "s0093": "between the Yangtze and Huai rivers, one thatched hut with three ridges, which served as the mat.",
  "s0094": "The Eastern Sea brought forth the fish with united eyes, the Western Sea brought forth the birds with united wings, and then there were fifteen things that came without being summoned.",
  "s0095": "Now phoenixes and unicorns do not come, auspicious grains do not grow, but thorns and brambles flourish, owls appear frequently, and yet you wish to perform feng and shan - is this not impossible?'",
  "s0096": "Therefore Duke Huan stopped.",
  "s0097": "That year, Duke Mu of Qin welcomed the Jin lord Yi Wu.",
  "s0098": "Afterward he installed three Jin rulers and pacified their disorders."
}
