{
  "s0398": "Therefore they used the shaman as host, shut the doors to food and drink.",
  "s0399": "What she said, was carried out below.",
  "s0400": "He also established the Shou Palace and North Palace, spread feathered banners, set up offerings, to honor the divine lord.",
  "s0401": "What the divine lord said, the emperor sent people to receive and record her words in writing, named it 'painting method.'",
  "s0402": "What she discussed was what common people knew, nothing extraordinarily different, but the emperor was uniquely pleased in his heart.",
  "s0403": "The matters were secret, the world did not know them.",
  "s0404": "Three years later, the officials said the yuan should be named according to heavenly omens, not with one or two numbers.",
  "s0405": "'One yuan called 'Jian', two yuan with the long star called 'Guang', three yuan with suburban sacrifice obtaining a one-horned beast called 'Shou.'",
  "s0406": "The next year in winter, the emperor performed suburban sacrifice at Yong, discussed saying: 'Now I personally sacrifice to the Supreme Deity, but Hou Tu has no sacrifice, then the rites are not reciprocated.'",
  "s0407": "The officials together with the Grand Historian and sacrificial official Kuan Shu discussed: 'Heaven and earth sacrificial animals have curled horns and chestnut shells.",
  "s0408": "Now Your Majesty personally sacrifices to Hou Tu, Hou Tu should have five altars in a round hill in the marshes, each altar one yellow calf great sacrificial animals, after sacrifice completely bury them, and wear upper yellow for the following sacrifices.'",
  "s0409": "Therefore the emperor went east, first established Hou Tu sacrifice at Fen Yin's Zhi Qiu, as Kuan Shu and others discussed.",
  "s0410": "The emperor personally gazed and bowed, like the Supreme Deity ritual.",
  "s0411": "After the ritual finished, the emperor went to Xingyang and returned.",
  "s0412": "Passing Luoyang, he issued an edict: 'The Three Dynasties are distant, far off and difficult to preserve.",
  "s0413": "Enfeoff thirty li of land to the Zhou descendants as Zhou Zi Nan Jun, to maintain their ancestral sacrifices.'",
  "s0414": "This year, the emperor began touring the commanderies and counties, gradually approaching Mount Tai.",
  "s0415": "That spring, the Marquis of Lecheng submitted a memorial about Luan Da.",
  "s0416": "Luan Da was a Qi palace attendant, formerly studied with General Wencheng, afterward became the alchemist for King Shang of Qi.",
  "s0417": "The Marquis of Lecheng's sister was Queen Kang, had no sons.",
  "s0418": "King Kang died, another consort's son was established as king.",
  "s0419": "Queen Kang had lewd conduct, did not get along with the king, they endangered each other according to law.",
  "s0420": "Queen Kang heard Wencheng had died, wished to flatter the emperor herself, sent Luan Da through the Marquis of Lecheng to seek audience and speak of techniques.",
  "s0421": "The emperor had executed Wencheng, afterward regretted his early death, pitied his techniques were not exhausted, when he saw Luan Da, was greatly pleased.",
  "s0422": "Da was tall and handsome, spoke many strategies, and dared make great claims without doubt.",
  "s0423": "Da said: 'I constantly travel in the sea, see An Qi, Xianmen and others.",
  "s0424": "But they consider me lowly, do not trust me.",
  "s0425": "Also consider King Kang just a feudal lord, not worth giving techniques to.",
  "s0426": "I frequently spoke to King Kang, King Kang also did not use me.",
  "s0427": "My teacher said: 'Gold can be made, river breaches can be blocked, immortality medicine can be obtained, immortals can be summoned.'",
  "s0428": "But I fear suffering Wencheng's fate, then all magicians will shut their mouths, who would dare speak of techniques!'",
  "s0429": "The emperor said: 'Wencheng died from eating horse liver.",
  "s0430": "If you can truly perfect his techniques, what would I begrudge!'",
  "s0431": "Da said: 'My teacher does not seek people, people seek him.",
  "s0432": "If Your Majesty truly wishes to summon him, then honor his envoy, let him have relatives, treat him with guest rituals, do not demean him, make each wear their trust seal, then can make him communicate with divine people.",
  "s0433": "Divine people still might accept or not.",
  "s0434": "Make his envoy honored, then he can be summoned.'",
  "s0435": "Therefore the emperor tested small techniques, fighting chess pieces, the chess pieces fought each other.",
  "s0436": "At this time the emperor was worried about river breaches, and gold was not completed, so he appointed Da as Five Profits General.",
  "s0437": "After over a month, he obtained four seals, wore Heaven Knight General, Earth Knight General, Great Passage General seals.",
  "s0438": "Edict to the censor: 'Formerly Yu dredged nine rivers, breached four streams.",
  "s0439": "Recently the river overflowed Gao Lu, dike work never ceased.",
  "s0440": "I have ruled the realm twenty-eight years, heaven seems to send me a knight and greatly connect.",
  "s0441": "Qian says 'flying dragon', 'great gradual to pan', my intention perhaps approaches this.",
  "s0442": "Enfeoff two thousand households to Earth Knight General Da as Marquis of Letong.'",
  "s0443": "Granted marquis first rank residence, thousand servants.",
  "s0444": "Gave carriage, outrider carriage horses curtains furnishings to fill his house.",
  "s0445": "Also married the eldest princess Wei to him, gave ten thousand jin of gold, renamed his city Dangli Princess.",
  "s0446": "The emperor personally visited Five Profits' residence."
}
