{
  "s1545": "Nineteen, established altar to Chen Bao.",
  "s1547": "Song Xuan Gong Li first year",
  "s1576": "Jin Zhao Hou first year enfeoffed father's younger brother Cheng Shi at Quwo, Quwo larger than the state, gentleman criticized saying: 'Jin disorder begins from Quwo.'",
  "s1581": "Ten, Wen Gong died.",
  "s1597": "Chen Huan Gong first year",
  "s1616": "Zheng Zhuang Gong Wu Sheng first year, Ji Zhong as chancellor.",
  "s1644": "Seventeen, favored concubine son Zhou Xu, Zhou Xu fond of war.",
  "s1658": "Wu Wang established.",
  "s1672": "Pan Fu killed Zhao Hou, brought in Cheng Shi, did not succeed. Zhao Hou's son established, this was Xiao Hou.",
  "s1700": "Jia Chen",
  "s1740": "Twenty-three, consort had no sons, Huan Gong established.",
  "s1756": "Wei Huan Gong Wan first year",
  "s1772": "Two, younger brother Zhou Xu arrogant, Huan deposed him, fled.",
  "s1800": "Nine, Quwo Huan Shu Cheng Shi died, son Dai established, became Zhuang Bo.",
  "s1815": "Qi Xi Gong Lu Fu first year",
  "s1831": "Two, same mother younger brother Yi Zhong Yan gave birth to Gong Sun Wu Zhi.",
  "s1835": "Nineteen, duke died, commanded to establish younger brother He as Duke Mu.",
  "s1851": "Song Mu Gong He first year",
  "s1857": "Yan Mu Hou first year",
  "s1860": "Jia Yin",
  "s1912": "Sixteen, Quwo Zhuang Bo killed Xiao Hou, Jin people established Xiao Hou's son Que as E Hou.",
  "s1928": "Jin E Hou Que first year Quwo stronger than Jin.",
  "s1942": "Lu Yin Gong Xi Gu first year mother Sheng Zi.",
  "s1952": "Twenty-two, Duan rebelled, fled.",
  "s1968": "Twenty-three, duke regretted, thought of mother could not see her, dug tunnel to meet.",
  "s1974": "Three, second month, solar eclipse.",
  "s1979": "Nine, duke entrusted Kong Fu to establish Shang Gong. Feng fled to Zheng.",
  "s1984": "Twenty-four, invaded Zhou, took grain.",
  "s1989": "Huan Wang first year",
  "s1995": "Song Shang Gong Yu Yi first year",
  "s1996": "Sixteen, Zhou Xu assassinated duke self-established.",
  "s1997": "Twenty-six, Wei Shi Que came to announce, therefore seized Zhou Xu.",
  "s2005": "Two, sent Guo Gong to attack Jin's Quwo.",
  "s2006": "Five, duke viewed fish at Tang, gentleman criticized it.",
  "s2008": "Six, E Hou died. Quwo Zhuang Bo again attacked Jin. Established E Hou's son Guang as Ai Hou.",
  "s2011": "Two, Zheng attacked us. We attacked Zheng.",
  "s2012": "Wei Xuan Gong Jin first year jointly established him. Punished Zhou Xu.",
  "s2020": "Jia Zi",
  "s2022": "Six, Zheng people came to change the peace.",
  "s2024": "Jin Ai Hou Guang first year",
  "s2032": "Twenty-seven, first audience with king, king did not treat with courtesy.",
  "s2040": "Two, Zhuang Bo died, son Cheng established, became Wu Gong.",
  "s2054": "Eight, exchanged Xu fields, gentleman criticized it.",
  "s2057": "Qin Ning Gong first year",
  "s2064": "Twenty-nine, gave Beng to Lu, exchanged Xu fields.",
  "s2070": "Nine, third month, great hailstorm, thunder.",
  "s2078": "Cai Huan Hou Feng Ren first year",
  "s2091": "Seven, feudal lords defeated us. Our army with Wei people attacked Zheng.",
  "s2102": "Eleven, grandee Hui requested to kill Huan Gong, sought to be chancellor, duke did not listen, then killed duke.",
  "s2118": "Lu Huan Gong Yun first year mother Song Wu Gong's daughter, gave birth to Shou Wen as Lu consort."
}