{
  "s1899": "Twenty-three. Qin pulled our Jiang Pang rebelled against Qin.",
  "s1905": "Two. Qin pulled our two cities, army under Da Liang, Han came to rescue, made peace with Qin at Wen.",
  "s1906": "Twenty-one. Bao Yuan rescued Wei, defeated by Qin, fled to Kai Feng.",
  "s1914": "Three. Qin pulled our four cities, beheaded forty thousand.",
  "s1922": "Thirty-four. Bai Qi struck Wei Hua Yang army, Mang Mao fled, got three Jin generals, beheaded one hundred fifty thousand.",
  "s1923": "Four. Made peace with Qin at Nan Yang.",
  "s1932": "Five. Struck Yan.",
  "s1933": "Han Huan Hui Wang first year",
  "s1935": "Twenty-seven. Struck Yan. Lu Qing Gong first year.",
  "s1943": "Twenty-eight. Lin Xiang Ru attacked Qi, reached Ping Yi.",
  "s1945": "Yan Wu Cheng Wang first year",
  "s1951": "Three. Qin struck our Yan Yu city, not pulled.",
  "s1952": "Twenty-nine. Qin attacked Han Yan Yu. Zhao She led struck Qin, greatly defeated them, granted title Ma Fu.",
  "s1955": "Fourteen. Qin, Chu struck our Gang Shou.",
  "s1968": "Nine. Qin pulled our Huai city.",
  "s1976": "Forty. Crown prince hostage in Wei died, returned burial Zhi Yang.",
  "s1986": "Eleven. Qin pulled our Lin Qiu.",
  "s1994": "Forty-two. Xuan Tai Hou died. An Guo Jun became crown prince.",
  "s1997": "Zhao Xiao Cheng Wang first year. Qin pulled our three cities. Ping Yuan Jun chancellor.",
  "s1999": "Seven. Qi Tian Dan pulled Zhong Yang.",
  "s2005": "Nine. Qin pulled our Xing. Built Feng Pang city.",
  "s2009": "Qi Wang Jian first year",
  "s2012": "Forty-four. (Qin) attacked Han, took Nan Yang.",
  "s2014": "Ten. Qin struck our Tai Xing.",
  "s2021": "Forty-five. (Qin) attacked Han, took ten cities.",
  "s2025": "Chu Kao Lie Wang first year. Qin took our Zhou. Huang Xie became chancellor.",
  "s2030": "Forty-six. King went to Nan Zheng.",
  "s2033": "Five. Sent Lian Po to resist Qin at Chang Ping.",
  "s2039": "Forty-seven. Bai Qi broke Zhao at Chang Ping, killed soldiers four hundred fifty thousand.",
  "s2042": "Six. Sent Zhao Kuo to replace Lian Po to lead. Bai Qi broke Kuo forty-five thousand.",
  "s2066": "Fifty. Wang Yin, Zheng An Ping besieged Han Dan, and Yin returned army, pulled Xin Zhong.",
  "s2067": "Twenty. Gong Zi Wu Ji rescued Han Dan, Qin army withdrew.",
  "s2069": "Nine. Qin besieged our Han Dan, Chu, Wei rescued us.",
  "s2070": "Six. Chun Shen Jun rescued Zhao.",
  "s2071": "Yan Xiao Wang first year",
  "s2074": "Fifty-nine.. Nan Wang died.",
  "s2076": "Twenty-one. Han, Wei, Chu rescued Zhao Xin Zhong, Qin army stopped.",
  "s2077": "Seventeen. Qin struck our Yang Cheng, rescued Zhao Xin Zhong.",
  "s2079": "Seven. Rescued Zhao Xin Zhong.",
  "s2084": "Fifty-two.. Took Xi Zhou. Wang Ji executed in market.",
  "s2088": "Eight. Took Lu, Lu jun enfeoffed at Ju.",
  "s2098": "Yan Wang Xi first year",
  "s2106": "Ten. Moved to Ju Yang.",
  "s2112": "Twenty-five. Wei Yuan Jun first year.",
  "s2123": "Fifteen. Ping Yuan Jun died.",
  "s2124": "Twelve. Zhu Guo Jing Bo died.",
  "s2125": "Four. Attacked Zhao, Zhao broke our army, killed Li Fu.",
  "s2129": "Qin Xiao Wen Wang first year.",
  "s2138": "Qin Zhuang Xiang Wang Chu first year.. Meng Ao took Cheng Gao, Xing Yang. First established San Chuan jun. Lu Bu Wei chancellor. Took Dong Zhou.",
  "s2140": "Twenty-four. Qin pulled our Cheng Gao, Xing Yang."
}
