{
  "s0354": "Wei defeated us at Lin.",
  "s0355": "In the fourth year, we fought Qin at Gao'an and defeated them.",
  "s0356": "In the fifth year, we attacked Qi at Juan.",
  "s0357": "Wei defeated us at Huai.",
  "s0358": "We attacked Zheng, defeated them, and gave it to Han. Han gave us a long son.",
  "s0359": "In the sixth year, Zhongshan built the long wall.",
  "s0360": "We attacked Wei, defeated them at Mian Ze, and besieged King Hui of Wei.",
  "s0361": "In the seventh year, we invaded Qi, reaching the long wall.",
  "s0362": "We and Han attacked Zhou.",
  "s0363": "In the eighth year, we and Han divided Zhou into two.",
  "s0364": "In the ninth year, we fought Qi at E Xia.",
  "s0365": "In the tenth year, we attacked Wei and took Zhen.",
  "s0366": "In the eleventh year, Qin attacked Wei, and we rescued them at Shi E.",
  "s0367": "In the twelfth year, Qin attacked Wei's Shao Liang, and we rescued them.",
  "s0368": "In the thirteenth year, Qin Xian Gong sent the Grand Master Guo to attack Wei's Shao Liang, capturing their crown prince and Ang.",
  "s0369": "Wei defeated us at Hui, taking Pi Lao.",
  "s0370": "Marquis Cheng met with Marquis Zhao of Han at Shangdang.",
  "s0371": "In the fourteenth year, we and Han attacked Qin.",
  "s0372": "In the fifteenth year, we aided Wei in attacking Qi.",
  "s0373": "In the sixteenth year, we and Han and Wei divided Jin, enfeoffing the Jin lord with Duan Shi.",
  "s0374": "In the seventeenth year, Marquis Cheng met with King Hui of Wei at Ge Nie.",
  "s0375": "In the nineteenth year, we met with Qi and Song at Ping Lu, and met with Yan at E.",
  "s0376": "In the twentieth year, Wei offered rong chuan wood, and we used it to build Tan Terrace.",
  "s0377": "In the twenty-first year, Wei besieged our Handan.",
  "s0378": "In the twenty-second year, King Hui of Wei captured our Handan, and Qi also defeated Wei at Gui Ling.",
  "s0379": "In the twenty-fourth year, Wei returned our Handan to us, and we formed an alliance with Wei on the Zhang River.",
  "s0380": "Qin attacked our Lin.",
  "s0381": "In the twenty-fifth year, Marquis Cheng died.",
  "s0382": "Prince Xi and crown prince Su Hou contended for the throne. Xi was defeated and fled to Han.",
  "s0383": "In Su Hou's first year, we took Duan Shi from the Jin lord and moved him to Tun Liu.",
  "s0384": "In the second year, we met with King Hui of Wei at Yin Jin.",
  "s0385": "In the third year, Prince Fan attacked Handan but failed and died.",
  "s0386": "In the fourth year, we paid court to the Son of Heaven.",
  "s0387": "In the sixth year, we attacked Qi and captured Gao Tang.",
  "s0388": "In the seventh year, Prince Ke attacked Wei's Shou Yuan.",
  "s0389": "In the eleventh year, Qin Xiao Gong sent Shang Jun to attack Wei, capturing their general Prince Ang.",
  "s0390": "Zhao attacked Wei.",
  "s0391": "In the twelfth year, Qin Xiao Gong died, and Shang Jun died.",
  "s0392": "In the fifteenth year, we built Shou Ling.",
  "s0393": "King Hui of Wei died.",
  "s0394": "In the sixteenth year, Su Hou toured Da Ling, going out through Lu Men. Da Wu Wu held his horse and said: 'Farming matters are urgent - one day not worked means a hundred days without food.'",
  "s0395": "Su Hou got off his chariot and apologized.",
  "s0396": "In the seventeenth year, we besieged Wei's Huang but did not capture it.",
  "s0397": "We built the long wall.",
  "s0398": "In the eighteenth year, Qi and Wei attacked us. We released river water to flood them, and the troops withdrew.",
  "s0399": "In the twenty-second year, Zhang Yi became prime minister of Qin.",
  "s0400": "Zhao Ci fought Qin and was defeated. Qin killed Ci west of the river and took our Lin and Li Shi.",
  "s0401": "In the twenty-third year, Han Ju fought with Qi and Wei and died at Sang Qiu.",
  "s0402": "In the twenty-fourth year, Su Hou died.",
  "s0403": "His son Wu Hou ascended the throne.",
  "s0404": "Wu Hou's first year, we attacked Zhongshan.",
  "s0405": "In the second year, we attacked Yan.",
  "s0406": "In the fourth year, we attacked Qi and captured Yang Ping.",
  "s0407": "In the fifth year, Wu Hou died.",
  "s0408": "His son Wen Hou ascended the throne.",
  "s0409": "Wen Hou's first year, we attacked Zhongshan.",
  "s0410": "In the second year, we attacked Yan.",
  "s0411": "In the third year, we attacked Wei and captured Fan Wu.",
  "s0412": "In the fourth year, Wen Hou died.",
  "s0413": "His son Jing Hou ascended the throne.",
  "s0414": "Jing Hou's first year, we attacked Zhongshan.",
  "s0415": "In the second year, we attacked Yan.",
  "s0416": "In the third year, we attacked Wei and captured Shou Yuan.",
  "s0417": "In the fourth year, Jing Hou died.",
  "s0418": "His son Su Hou ascended the throne.",
  "s0419": "Su Hou's first year, we attacked Zhongshan.",
  "s0420": "In the second year, we attacked Yan.",
  "s0421": "In the third year, we attacked Wei and captured Fan Wu.",
  "s0422": "In the fourth year, Su Hou died.",
  "s0423": "His son Zhao Hou ascended the throne.",
  "s0424": "Zhao Hou's first year, we attacked Zhongshan.",
  "s0425": "In the second year, we attacked Yan.",
  "s0426": "In the third year, we attacked Wei and captured Shou Yuan.",
  "s0427": "In the fourth year, Zhao Hou died.",
  "s0428": "His son Xiaocheng Hou ascended the throne.",
  "s0429": "Xiaocheng Hou's first year, we attacked Zhongshan.",
  "s0430": "In the second year, we attacked Yan.",
  "s0431": "In the third year, we attacked Wei and captured Fan Wu.",
  "s0432": "In the fourth year, Xiaocheng Hou died.",
  "s0433": "His son Daoxiang Hou ascended the throne.",
  "s0434": "Daoxiang Hou's first year, we attacked Zhongshan.",
  "s0435": "In the second year, we attacked Yan.",
  "s0436": "In the third year, we attacked Wei and captured Shou Yuan.",
  "s0437": "In the fourth year, Daoxiang Hou died.",
  "s0438": "His son Wuling Hou ascended the throne.",
  "s0439": "Wuling Hou's first year, we attacked Zhongshan.",
  "s0440": "In the second year, we attacked Yan.",
  "s0441": "In the third year, we attacked Wei and captured Fan Wu.",
  "s0442": "In the fourth year, Wuling Hou died.",
  "s0443": "His son Huiwen Hou ascended the throne.",
  "s0444": "Huiwen Hou's first year, we attacked Zhongshan.",
  "s0445": "In the second year, we attacked Yan.",
  "s0446": "In the third year, we attacked Wei and captured Shou Yuan.",
  "s0447": "In the fourth year, Huiwen Hou died.",
  "s0448": "His son Xiaowen Hou ascended the throne.",
  "s0449": "Xiaowen Hou's first year, we attacked Zhongshan.",
  "s0450": "In the second year, we attacked Yan.",
  "s0451": "In the third year, we attacked Wei and captured Fan Wu.",
  "s0452": "In the fourth year, Xiaowen Hou died.",
  "s0453": "His son Su Hou ascended the throne."
}
