{
  "s414": "Two. Two. Third year, Marquis De first year.",
  "s415": "Liao.",
  "s416": "As Nanyue general surrendered, Marquis.",
  "s420": "One. Sixth year third month yi you, Marquis Bi Qu first year.",
  "s421": "Six",
  "s422": "Four",
  "s423": "Jiang Liang.",
  "s424": "As Tower Ship General attacked Nanyue, spearhead repelled enemy, Marquis.",
  "s428": "One. Sixth year third month yi you, Marquis Yang Pu first year.",
  "s429": "Three. Fourth year, Marquis Pu committed crime, state abolished.",
  "s431": "An Dao.",
  "s432": "As Nanyue Jieyang magistrate heard Han troops arrived self-pacified surrendered, Marquis.",
  "s436": "One. Sixth year third month yi you, Marquis Jieyang magistrate Shi Ding first year.",
  "s437": "Six",
  "s438": "Four",
  "s439": "Sui Tao.",
  "s440": "As Nanyue Cangwu king heard Han troops arrived surrendered, Marquis.",
  "s444": "One. Sixth year fourth month gui hai, Marquis Zhao Guang first year.",
  "s445": "Six",
  "s446": "Four",
  "s447": "Xiang Cheng.",
  "s448": "As Nanyue Guilin supervisor heard Han troops broke Panyu, persuaded Ouluo troops over forty thousand surrendered, Marquis.",
  "s452": "One. Sixth year fifth month ren shen, Marquis Jian Ju Weng first year.",
  "s453": "Six",
  "s454": "Four",
  "s455": "Hai Chang.",
  "s456": "As Fubo Major captured Nanyue king Jian De with merit, Marquis.",
  "s460": "One. Sixth year seventh month yi you, Marquis Zhuang Su Hong first year.",
  "s461": "Six",
  "s462": "Taichu first year, Marquis Hong died, no posterity, state abolished.",
  "s463": "Bei Shi.",
  "s464": "As former Dongyue Yan Hou assisted Yuwang beheaded Yu Shan with merit, Marquis.",
  "s469": "Six. First year first month ren wu, Marquis Wu Yang first year.",
  "s470": "Three. Taichu fourth year, current Marquis Shou first year.",
  "s471": "Xia Li.",
  "s472": "As former Ouluo Left General beheaded Xi Yu king with merit, Marquis.",
  "s477": "Six. First year fourth month ding you, Marquis Zuo Jiang Huang Tong first year.",
  "s478": "Four",
  "s479": "Liao Xi.",
  "s480": "As former colonel followed Horizontal Sea General Yue attacked Dongyue with merit, Marquis.",
  "s485": "One. First year fifth month ji mao, Marquis Liu Fu first year. Second year, Marquis Fu committed crime, state abolished.",
  "s487": "Wei Er.",
  "s488": "As army soldier beheaded Dongyue Xunbei general with merit, Marquis.",
  "s493": "Six. First year intercalary month gui mao, Marquis Zhuang Yuan Zhong Gu first year.",
  "s494": "Taichu first year, Zhong Gu died, no posterity, state abolished.",
  "s495": "Kai Ling.",
  "s496": "As former Dongyue Jiancheng Hou together with Yuwang beheaded Dongyue king Yu Shan with merit, Marquis.",
  "s609": "Bo Lu",
  "s610": "Huo Guang, family in Pingyang. Because elder brother Piaoyi General formerly noble. Previously served Emperor Wu, aware captured Palace Attendant plotting rebellion Ma He Luo and others with merit, Marquis, three thousand households. Assisted young lord Emperor Zhao, became Grand General. Careful trustworthy, handled affairs monopolized governance, honored as Grand Marshal, increased fief by ten thousand households. Later served Emperor Xuan. Served three lords, empire trusted and admired him, increased enfeoffment by twenty thousand households. Son Yu succeeded, plotted rebellion, clan exterminated, state abolished."
}
