{
  "s0399": "Blue circle small horns, worry, has wood affairs;",
  "s0400": "Yellow circle harmony horns, has earth affairs, has year.",
  "s0401": "Its already out three days then returns, has slight enter, enters three days then again flourishing out, this called soft, its below state has army defeated general flees north.",
  "s0402": "Its already entered three days again slight out, out three days then flourishing enter, its below state has worry;",
  "s0403": "Commander has grain army armor, abandons people use it;",
  "s0404": "Though troops numerous, general becomes person captive.",
  "s0405": "Its out west loses conduct, outer states defeated;",
  "s0406": "Its out east loses conduct, central states defeated.",
  "s0407": "Its color great circle yellow turbid, can do good affairs;",
  "s0408": "Its circle great red, troops flourish not battle.",
  "s0409": "Tai Bai white, compares Wolf;",
  "s0410": "Red, compares Xin;",
  "s0411": "Yellow, compares Shen left shoulder;",
  "s0412": "Blue, compares Shen right shoulder;",
  "s0413": "Black, compares Kui great star.",
  "s0414": "Five stars all follow Tai Bai and gather at one lodge, its below state can with troops follow all under heaven.",
  "s0415": "Dwells solid, has obtain;",
  "s0416": "Dwells empty, no obtain.",
  "s0417": "Conduct overcomes color, color overcomes position, has position overcomes no position, has color overcomes no color, conduct gets all overcomes them.",
  "s0418": "Out and stays Sang Yu between, sickens its below state.",
  "s0419": "Rises and urgent, not exhaust its day, passes Shen heaven, sickens its facing state.",
  "s0420": "Rises again down, down again rises, has contrary general.",
  "s0421": "Its enters moon, general will shame.",
  "s0422": "Gold wood stars combine, light, its below battle not combine, troops though rise not fight;",
  "s0423": "Combine mutually destroy, fields have broken army.",
  "s0424": "Out western, dusk out yin, yin troops strong;",
  "s0425": "Evening meal out, small weak;",
  "s0426": "Night half out, middle weak;",
  "s0427": "Chicken crow out, great weak: this called yin traps at yang.",
  "s0428": "Its in eastern, rides bright out yang, yang troops strong, chicken crow out, small weak;",
  "s0429": "Night half out, middle weak;",
  "s0430": "Dusk out, great weak: this called yang traps at yin.",
  "s0431": "Tai Bai hides, with out troops, troops have calamity.",
  "s0432": "Its out Mao south, south overcomes north;",
  "s0433": "Out Mao north, north overcomes south;",
  "s0434": "Precisely at Mao, eastern states benefit.",
  "s0435": "Out You north, north overcomes south;",
  "s0436": "Out You south, south overcomes north;",
  "s0437": "Precisely at You, western states victorious.",
  "s0438": "Its with column stars mutually offend, small battle;",
  "s0439": "Five stars, great battle.",
  "s0440": "Its mutually offend, Tai Bai out its south, southern states defeated;",
  "s0441": "Out its north, northern states defeated.",
  "s0442": "Goes urgent, martial;",
  "s0443": "Not goes, civil.",
  "s0444": "Color white five spikes, out early for moon eclipse, late for heaven premature and comet, general sends its state.",
  "s0445": "Out east for virtue, raise affairs left it meets it, auspicious.",
  "s0446": "Out west for punishment, raise affairs right it backs it, auspicious.",
  "s0447": "Contrary all inauspicious.",
  "s0448": "Tai Bai light appears shadow, battle victorious."
}
