{
  "s662": "Shi Zi Hui. With Emperor Xuan great maternal grandmother family enfeoffed as Marquis, two thousand six hundred households, with Platform Marquis brothers in row. Zi Hui wife Yi Jun, formerly Cheng Wang Sun, jealous, strangled killed serving maids over forty people, stole cut woman first childbirth child arms knees as charm way. Person memorialized spoke of, sentenced abandoned market. Zi Hui because maternal family reason, not lost marquisate.",
  "s663": "Ping Tai.",
  "s664": "Shi Zi Shu. With Emperor Xuan great maternal grandmother family enfeoffed as Marquis, two thousand five hundred households. Crown Prince time, Shi clan married one daughter to Crown Prince, married one daughter to Lu king, now seen Lu king also Shi clan daughter's son. Maternal family had relatives, therefore noble, frequently obtained rewards and bestowals.",
  "s665": "Le Ling.",
  "s666": "Shi Zi Chang. With Emperor Xuan great maternal grandmother family noble, Palace Attendant, substantial heavy loyal trustworthy. With discovered Huo clan plotting rebellion affair, enfeoffed three thousand five hundred households.",
  "s667": "Bo Cheng.",
  "s668": "Zhang Zhang, father formerly Yingchuan person, served as Chang'an pavilion chief. Lost office, went to north gate memorialized, lodged in Huo clan residence house, slept in horse stable midst, night heard horse raising slave mutually spoke, spoke various Huo clan sons and grandsons wanted plotting rebellion condition, therefore memorialized reported rebellion, became Marquis, enfeoffed three thousand households.",
  "s669": "Du Cheng.",
  "s670": "Jin An Shang, formerly Xiongnu. With discovered former Grand General Huo Guang son Yu etc. plotting rebellion affair had merit, enfeoffed Marquis, two thousand eight hundred households. An Shang was Carriage Escort Colonel Du Hou Cong Qun son. Conduct careful good, retired yielding self held, wished transmit merit virtue to descendants.",
  "s671": "Ping Tong.",
  "s672": "Yang Yun, family in Huayin, former Chancellor Yang Chang youngest son, appointed Palace Attendant. Loved scholars, self happy knew people, among crowd constantly with people countenance, therefore Gaochang Hou Dong Zhong led with screen spoke, spoke Huo clan plotting rebellion condition, together discovered reported rebellion, Marquis, two thousand households, became Guanglu Xun. Arrived Wufeng fourth year, made demonic words, great rebellion crime waist cut, state abolished.",
  "s673": "Gao Chang.",
  "s674": "Dong Zhong, father formerly Yingchuan Yangdi person, with practiced writing went to Chang'an. Zhong had talent strength, could ride shoot, used short weapons, gave service Qimen. With Zhang Zhang mutually practiced knew, Zhang told Zhong Huo Yu plotting rebellion condition, Zhong with spoke to Chang Shi Cavalry Attendant Yang Yun, together discovered reported rebellion, Marquis, two thousand households. Now as Brave Cavalry Colonel, Palace Attendant. Convicted of temple ancestral temple rode small carriage, stripped one hundred households.",
  "s675": "Yuan Qi",
  "s676": "Zhao Cheng. Used discovered Chu state affair, Marquis, two thousand three hundred households. Diji first year, Chu king with Guangling king plotted rebellion, Cheng discovered rebellion condition, Son of Heaven pushed favor spread virtue benevolence, issued edict saying 'no govern Guangling king', Guangling not changed. Later again convicted of prayers curses exterminated state, suicide, state abolished. Now emperor again established son as Guangling king.",
  "s677": "Zuo",
  "s678": "Diji third year, Son of Heaven issued edict saying: 'I heard Han's rise, Prime Minister Xiao He merit first, now completely no posterity, I very pity it, therefore with fief three thousand households enfeoff Xiao He great grandson Jian Shi as Zuo Hou'.",
  "s679": "Ping Chang",
  "s680": "Wang Chang Jun, family in Zhao state, Changshan Guangwang town person. Crown Prince time, married Crown Prince house, as Crown Prince male secretary Huang Sun match, gave birth to son male, completely not heard sound inquiry, conduct nearly forty remaining years, until now Yuankang first year middle, edict summoned, established as Marquis, enfeoffed five thousand households. Emperor Xuan maternal uncle father.",
  "s681": "Le Chang.",
  "s682": "Wang Zhi Jun, family in Zhao state, Changshan Guangwang town person. With Emperor Xuan maternal uncle father maternal family enfeoffed as Marquis, fief five thousand households. Pingchang Hou Wang Chang Jun younger brother.",
  "s683": "Qiong Cheng.",
  "s684": "Wang Feng Guang, family in Fangling. With daughter established as Emperor Xuan Empress, therefore enfeoffed one thousand five hundred households. Spoke Feng Guang first born time, night saw light above it, transmitters believed should be noble. Later indeed with daughter reason became Marquis.",
  "s685": "An Yuan.",
  "s686": "Zheng Ji, family in Kuaiji. With soldier commoner arose followed army became Palace Attendant, sent protect general released criminal soldiers Tian Quli. Met Xiongnu Chanyu died, state chaotic, mutually attacked, Rizhu king led multitude came surrendered Han, first sent spoke to Ji, Ji led officials soldiers several hundred went welcome. Multitude quite had those wanted return, beheaded killed their leaders, then with altogether entered Han. With military merit Marquis, two thousand households.",
  "s687": "Bo Yang.",
  "s688": "Bing Ji, family in Lu. Originally with governing prisons gave service became Judicial Official subordinate, gave service Grand General tent headquarters. Constantly bestowed old favor Emperor Xuan, promoted Grand Minister of Justice, enfeoffed Marquis, two thousand households. Shenjue second year, replaced Wei Xiang as Chancellor. Stood five years, died of illness. Son Weng Meng succeeded, became General, Palace Attendant. Ganlu first year, convicted of ancestral temple sacrifice not rode grand carriage but rode to temple gate, committed crime, title stripped, became Guan Nei Hou.",
  "s689": "Jian Cheng.",
  "s690": "Huang Ba, family in Yangxia, with corvee moved Yunyang. With incorruptible official became Henan governor assistant, promoted Judicial Official supervisor, acted Chancellor long historian affairs. Convicted of seeing knew Xiahou Sheng violated edict great disrespectful crime, long imprisoned three years, followed Sheng studied Shangshu. Met amnesty, with worthy good selected as Yangzhou inspector, Yingchuan grand administrator. Good transformation, male female different paths, plowmen yielded borders, bestowed yellow gold one hundred jin, rank middle two thousand shi. Resided Yingchuan, entered became Crown Prince tutor, promoted Grand Minister of Justice. Wufeng third year, replaced Bing Ji as Chancellor. Enfeoffed one thousand eight hundred households.",
  "s691": "Xi Ping.",
  "s692": "Yu Ding Guo, family in Donghai. Originally with governing prisons gave service became Judicial Official historian, gradually promoted Grand Minister of Justice middle captain. Memorialized admonished Changyi king, promoted Guanglu Dafu, became Judicial Official. Then teacher received Spring and Autumn, changed way practiced transformation, planned substantial loved people. Promoted Grand Minister of Justice, replaced Huang Ba as Chancellor."
}
