{
  "s0001": "Wei Zi Kai, Yin Di Yi's eldest son and Di Zhou's half elder brother.",
  "s0002": "Zhou already established, not enlightened, lewd chaos in government, Wei Zi several advised, Zhou not listened.",
  "s0003": "To Zu Yi with Zhou Xi Bo Chang's cultivated virtue, extinguished Li country, feared calamity arrived, informed Zhou.",
  "s0004": "Zhou said: 'I born not have mandate in heaven?",
  "s0005": "What able do!'",
  "s0006": "Then Wei Zi measured Zhou finally not able advised, wished die it, and leave, not able self decided, then asked Tai Shi, Shao Shi said: 'Yin not have govern government, not govern four directions.",
  "s0007": "My ancestor Sui displayed above, Zhou sunk drunk in wine, women used, chaotic defeated Tang virtue below.",
  "s0008": "Yin already small great good theft lewd rebellion, minister scholar teachers not measure, all have crime guilt, then no restraint obtain, small people then together rose, mutually became enemy foes.",
  "s0009": "Now Yin its model perished!",
  "s0010": "Like ford water no bank shore.",
  "s0011": "Yin then perished, exceeded to now.'",
  "s0012": "Said: 'Tai Shi, Shao Shi, I its issue go?",
  "s0013": "My family preserve at perished?",
  "s0014": "Now you without reason inform me, dizzy fall, how its?'",
  "s0015": "Tai Shi Ruo said: 'Wang Zi, heaven firmly under calamity perish Yin country, then no fear fear, not use old elders.",
  "s0016": "Now Yin people then vulgar lewd ghosts spirits sacrifices.",
  "s0017": "Now truly obtain govern country, country govern body die not hate.",
  "s0018": "For die, finally not obtain govern, not like go.'",
  "s0019": "Then fled.",
  "s0020": "Ji Zi, Zhou close relative.",
  "s0021": "Zhou began made ivory chopsticks, Ji Zi sighed said: 'He made ivory chopsticks, must make jade cups;",
  "s0022": "made cups, then must think distant places precious strange things bring them.",
  "s0023": "Chariots horses palaces chambers gradually from this began, not able recover.'",
  "s0024": "Zhou for lewd dissipation, Ji Zi advised, not listened.",
  "s0025": "Person or said: 'Can go.'",
  "s0026": "Ji Zi said: 'Be person minister advise not listen then go, is manifest lord bad self please to people, I not bear do.'",
  "s0027": "Then disheveled feigned mad became slave.",
  "s0028": "Then hid drum qin self sad, so transmitted called Ji Zi Cao.",
  "s0029": "Wang Zi Bi Gan, also Zhou close relative.",
  "s0030": "Saw Ji Zi advise not listen became slave, then said: 'Lord has excess not with death contend, then hundred clans what guilt!'",
  "s0031": "Then straight speak advised Zhou.",
  "s0032": "Zhou angered said: 'I heard sage person heart has seven apertures, believe have them?'",
  "s0033": "Then killed Wang Zi Bi Gan, disemboweled viewed his heart.",
  "s0034": "Wei Zi said: 'Father son have flesh bone, minister lord with righteousness belong.",
  "s0035": "So father has excess, son three advise not listen, then follow wail him;",
  "s0036": "person minister three advise not listen, then his righteousness can go.'",
  "s0037": "Then Tai Shi, Shao Shi urged Wei Zi go, then went.",
  "s0038": "Zhou Wu Wang attacked Zhou conquered Yin, Wei Zi then held his sacrificial vessels went to army gate, bare flesh face bound, left led sheep, right grasped thatch, knee walked forward informed.",
  "s0039": "Then Wu Wang released Wei Zi, restored his position as before.",
  "s0040": "Wu Wang enfeoffed Zhou son Wu Geng Lu Fu to continue Yin sacrifices, made Guan Shu, Cai Shu teach mutually him.",
  "s0041": "Wu Wang already conquered Yin, visited Ji Zi.",
  "s0042": "Wu Wang said: 'Oh!",
  "s0043": "Only heaven secretly settled lower people, mutually harmonize their residence, I not know its constant order where arranged.'",
  "s0045": "Ji Zi answered said: 'In former Gun blocked great flood, confused arrayed its five phases, emperor then thundered anger, not from great model nine grades, constant order where discarded.",
  "s0046": "Gun then executed died, Yu then succeeded rose.",
  "s0047": "Heaven then granted Yu great model nine grades, constant order where arranged.",
  "s0048": "'Initial one called five phases;",
  "s0049": "two called five affairs;",
  "s0050": "three called eight governments;",
  "s0051": "four called five records;",
  "s0052": "five called royal pole;",
  "s0053": "six called three virtues;",
  "s0054": "seven called稽疑;",
  "s0055": "eight called庶徵;",
  "s0056": "nine called wandu.'",
  "s0057": "初一曰五行：一曰水，二曰火，三曰木，四曰金，五曰土。",
  "s0058": "水曰潤下，火曰炎上，木曰曲直，金曰從革，土曰稼穡。",
  "s0059": "潤下作鹹，炎上作苦，曲直作酸，從革作辛，稼穡作甘。",
  "s0060": "二曰五事：一曰貌，二曰言，三曰視，四曰聽，五曰思。",
  "s0061": "貌曰恭，言曰從，視曰明，聽曰聰，思曰睿。",
  "s0062": "恭作肅，從作治，明作智，聰作謀，睿作聖。",
  "s0063": "三曰八政：一曰食，二曰貨，三曰祀，四曰司空，五曰司徒，六曰司寇，七曰賓，八曰師。",
  "s0064": "四曰五紀：一曰歲，二曰月，三曰日，四曰星辰，五曰曆數。",
  "s0065": "五曰皇極：皇建其有極，斂時五福，用傅錫其庶民。",
  "s0066": "六曰三德：一曰正直，二曰剛克，三曰柔克。",
  "s0067": "平康正直，彊弗友剛克，燮友柔克。",
  "s0068": "沉潛剛克，高明柔克。",
  "s0069": "七曰稽疑：擇建立卜筮人，乃命卜筮，曰雨，曰霽，曰蒙，曰驛，曰克，曰貞，曰悔，凡七。",
  "s0070": "卜五，占之用二，衍貣。",
  "s0071": "八曰庶徵：曰雨，曰暘，曰燠，曰寒，曰風，曰時。",
  "s0072": "五者來備，各以其敘，庶草蕃庑。",
  "s0073": "一極備，凶；一極亡，凶。",
  "s0074": "曰休徵：曰肅，時雨若，寧風若。",
  "s0075": "曰咎徵：曰僭，恒雨若，烝風若。",
  "s0076": "曰王省惟歲，卿士惟月，師尹惟日。",
  "s0077": "歲月日時無易，百穀用成，治用明，畯民用章，家用平康。",
  "s0078": "日月歲時既易，百穀用不成，治用昏不明，畯民用微，家用不寧。",
  "s0079": "庶民惟星，星有好風，星有好雨。",
  "s0080": "日月之行，有冬有夏。",
  "s0081": "月之從星，則以風雨。",
  "s0082": "九曰五福：一曰壽，二曰富，三曰康寧，四曰攸好德，五曰考終命。",
  "s0083": "六極：一曰凶短折，二曰疾，三曰憂，四曰貧，五曰惡，六曰弱。",
  "s0084": "於是武王乃封箕子於朝鮮而不臣也。"
}
