{
  "s0001": "Duke Huan of Zheng, named You, was the youngest son of King Li of Zhou and the younger half-brother of King Xuan.",
  "s0002": "King Xuan ascended the throne in the twenty-second year, and You was first enfeoffed in Zheng.",
  "s0003": "He was enfeoffed for thirty-three years, and all the common people found him convenient and loved him.",
  "s0004": "King You appointed him as Minister of Works.",
  "s0005": "He harmonized and gathered the Zhou people, and the Zhou people were all pleased. Between the Yellow River and Luo River, people conveniently remembered him.",
  "s0006": "He served as Minister of Works for one year, but King You, because of the Bao consort's influence, had many evil affairs in governing the royal house, and some feudal lords rebelled against him.",
  "s0007": "Thus Duke Huan asked Grand Historian Bo: 'The royal house has many troubles - where can I escape death?'",
  "s0008": "Grand Historian Bo replied: 'Only the eastern lands beyond Luo, south of the Yellow River and Ji River, are habitable.'",
  "s0009": "The duke said: 'Why?'",
  "s0010": "He replied: 'The land borders Guo and Huo. The lords of Guo and Huo are greedy and fond of profit, so the common people do not attach themselves to them.",
  "s0011": "Now you serve as Minister of Works, and the people all love you. If you sincerely request to reside there, the lords of Guo and Huo, seeing that you are in power, will lightly divide land for you.",
  "s0012": "If you sincerely reside there, the people of Guo and Huo will all become your people.'",
  "s0013": "The duke said: 'I want to go south to the Jiang River - how about that?'",
  "s0014": "He replied: 'In ancient times, Zhu Rong served as Minister of Fire under Gao Xin, and his merit was great, but during the Zhou period he had no rising descendants. Chu is his descendant.",
  "s0015": "When Zhou declines, Chu will surely rise.",
  "s0016": "Their rise would not be advantageous for Zheng.'",
  "s0017": "The duke said: 'I want to reside in the west - how about that?'",
  "s0018": "He replied: 'Their people are greedy and fond of profit - difficult to reside in for long.'",
  "s0019": "The duke said: 'When Zhou declines, which states will rise?'",
  "s0020": "He replied: 'Qi, Qin, Jin, Chu perhaps?",
  "s0021": "Qi is of the Jiang surname, descendants of Bo Yi. Bo Yi assisted Yao in managing rituals.",
  "s0022": "Qin is of the Ying surname, descendants of Bo Yi. Bo Yi assisted Shun in taming and harmonizing the hundred creatures.",
  "s0023": "And the ancestors of Chu also once had merit toward the world.",
  "s0024": "After King Wu of Zhou defeated Zhou, King Cheng enfeoffed Uncle Yu in Tang. That land is naturally defensible, and with virtue they will parallel Zhou's decline, so they will surely rise.'",
  "s0025": "Duke Huan said: 'Good.'",
  "s0026": "Thus he finally spoke to the king and moved his people east beyond Luo, and Guo and Huo indeed offered ten cities, completing the state.",
  "s0027": "Two years later, the Dog Rong killed King You at the foot of Li Shan and also killed Duke Huan.",
  "s0028": "The people of Zheng together established his son Jue Tu, who became Duke Wu.",
  "s0029": "In Duke Wu's tenth year, he took a daughter of the Marquis of Shen as his wife, named Wu Jiang.",
  "s0030": "She gave birth to the crown prince Wu Sheng, but the birth was difficult. After birth, the wife did not love him.",
  "s0031": "Later she gave birth to a younger son, Uncle Duan. Duan was born easily, so the wife loved him.",
  "s0032": "In the twenty-seventh year, Duke Wu fell ill.",
  "s0033": "The wife requested the duke to establish Duan as crown prince, but the duke would not listen.",
  "s0034": "That year Duke Wu died, and Wu Sheng succeeded him, becoming Duke Zhuang.",
  "s0035": "In Duke Zhuang's first year, he enfeoffed his younger brother Duan in Jing, calling him Uncle Tai.",
  "s0036": "Ji Zhong said: 'Jing is larger than the capital - this is not how to enfeoff a younger son.'",
  "s0037": "Duke Zhuang said: 'Wu Jiang wants it - I dare not refuse her.'",
  "s0038": "Duan went to Jing and prepared weapons and armor, plotting with his mother Wu Jiang to attack Zheng.",
  "s0039": "In the twenty-second year, Duan indeed attacked Zheng, with Wu Jiang as internal supporter.",
  "s0040": "Duke Zhuang sent troops to attack Duan, and Duan fled.",
  "s0041": "He attacked Jing, and the people of Jing rebelled against Duan. Duan fled to Yan.",
  "s0042": "Yan collapsed, and Duan fled to Gong.",
  "s0043": "Thus Duke Zhuang moved his mother Wu Jiang to Cheng Ying, swearing: 'Not until we reach the Yellow Springs shall we meet again.'",
  "s0044": "After living there more than a year, he already regretted and thought of his mother.",
  "s0045": "Kao Shu of Ying Gu had an offering to the duke, and the duke granted him food.",
  "s0046": "Kao Shu said: 'I have a mother - please let the duke's food be granted to my mother.'",
  "s0047": "Duke Zhuang said: 'I greatly miss my mother, but hate to break my oath - what can I do?'",
  "s0048": "Kao Shu said: 'Dig a tunnel to the Yellow Springs, then you can meet.'",
  "s0049": "Thus he followed this plan and met his mother.",
  "s0050": "Duke Zhuang reigned for forty-three years and died, and his son Li succeeded him, becoming Duke Zhao.",
  "s0051": "Duke Zhao's first year, he sent his younger brother Gong Shu Duan to govern the eastern border.",
  "s0052": "Gong Shu Duan was arrogant and extravagant, and the people did not attach to him.",
  "s0053": "In the fifth year, Prince Yi killed Duke Zhao at Dong Men.",
  "s0054": "The people of Zheng together established Gong Shu Duan, who became Duke Li.",
  "s0055": "Duke Li's first year, he sent Prince Yi to Chu.",
  "s0056": "In the fifth year, he sent his younger brother Yi to Chu.",
  "s0057": "In the fourteenth year, Duke Li returned from Chu.",
  "s0058": "In the fifteenth year, Prince Yi returned from Chu.",
  "s0059": "In the twentieth year, Duke Li died, and his son Yang succeeded him, becoming Duke Wen.",
  "s0060": "Duke Wen's first year, Si Chen assassinated Duke Li at Dong Li and established Duke Wen.",
  "s0061": "Duke Wen's third year, Chu invaded Zheng.",
  "s0062": "In the fifth year, Duke Wen died, and his son Shu succeeded him, becoming Duke Mu.",
  "s0063": "Duke Mu's first year, Song attacked Zheng and took the city of Long.",
  "s0064": "In the fifth year, Chu attacked Zheng.",
  "s0065": "In the ninth year, Duke Mu died, and his son Lan succeeded him, becoming Duke Ling.",
  "s0066": "Duke Ling's first year, Song attacked Zheng.",
  "s0067": "In the fifth year, Duke Ling died, and his son the Prince of Yu succeeded him, becoming Duke Xiang.",
  "s0068": "Duke Xiang's first year, Zheng attacked Song.",
  "s0069": "In the fifth year, Duke Xiang died, and his son the Prince of Gong succeeded him, becoming Duke Jian.",
  "s0070": "Duke Jian's first year, he married a woman from Song.",
  "s0071": "In the eighth year, Duke Jian died, and his son the Prince of Yin succeeded him, becoming Duke Gong.",
  "s0072": "Duke Gong's first year, Chu attacked Zheng.",
  "s0073": "In the fifth year, Duke Gong died, and his son the Prince of Fei succeeded him, becoming Duke Yi.",
  "s0074": "Duke Yi's first year, Chu attacked Zheng.",
  "s0075": "In the seventh year, Duke Yi died, and his son the Prince of Dai succeeded him, becoming Duke Huan.",
  "s0076": "Duke Huan's first year, Chu attacked Zheng.",
  "s0077": "In the eighteenth year, Duke Huan died, and his son the Prince of Si succeeded him, becoming Duke Zhuang.",
  "s0078": "Duke Zhuang's first year, Chu attacked Zheng.",
  "s0079": "In the third year, Duke Zhuang died, and his son the Prince of Ning succeeded him, becoming Duke Zhao.",
  "s0080": "Duke Zhao's first year, Chu attacked Zheng.",
  "s0081": "In the twelfth year, Duke Zhao died, and his son the Prince of Xin succeeded him, becoming Duke Ding.",
  "s0082": "Duke Ding's first year, Chu attacked Zheng.",
  "s0083": "In the fifth year, Duke Ding died, and his son the Prince of Yong succeeded him, becoming Duke Ai.",
  "s0084": "Duke Ai's first year, Chu attacked Zheng.",
  "s0085": "In the twenty-seventh year, Duke Ai died, and his son the Prince of Tai succeeded him, becoming Duke Gong.",
  "s0086": "Duke Gong's first year, Chu attacked Zheng.",
  "s0087": "In the ninth year, Duke Gong died, and his son the Prince of Yu succeeded him, becoming Duke Cheng.",
  "s0088": "Duke Cheng's first year, Chu attacked Zheng.",
  "s0089": "In the second year, Duke Cheng died, and his son the Prince of Lü succeeded him, becoming Duke Xiang.",
  "s0090": "Duke Xiang's first year, Chu attacked Zheng.",
  "s0091": "In the twelfth year, Duke Xiang died, and his son the Prince of Chou succeeded him, becoming Duke Jian.",
  "s0092": "Duke Jian's first year, Chu attacked Zheng.",
  "s0093": "In the fourteenth year, Duke Jian died, and his son the Prince of Jin succeeded him, becoming Duke Ding.",
  "s0094": "Duke Ding's first year, Chu attacked Zheng.",
  "s0095": "In the second year, Duke Ding died, and his son the Prince of Ning succeeded him, becoming Duke Ai.",
  "s0096": "Duke Ai's first year, Chu attacked Zheng.",
  "s0097": "In the ninth year, Duke Ai died, and his son the Prince of Gong succeeded him, becoming Duke Gong.",
  "s0098": "Duke Gong's first year, Chu attacked Zheng.",
  "s0099": "In the thirteenth year, Duke Gong died, and his son the Prince of Jia succeeded him, becoming Duke Cheng.",
  "s0100": "Duke Cheng's first year, Chu attacked Zheng.",
  "s0101": "In the second year, Duke Cheng died, and his son the Prince of Yin succeeded him, becoming Duke Xiang.",
  "s0102": "Duke Xiang's first year, Chu attacked Zheng.",
  "s0103": "In the fourteenth year, Duke Xiang died, and his son the Prince of Lü succeeded him, becoming Duke Jian.",
  "s0104": "Duke Jian's first year, Chu attacked Zheng.",
  "s0105": "In the twelfth year, Duke Jian died, and his son the Prince of Chou succeeded him, becoming Duke Ding.",
  "s0106": "Duke Ding's first year, Chu attacked Zheng.",
  "s0107": "In the fifth year, Duke Ding died, and his son the Prince of Yong succeeded him, becoming Duke Ai.",
  "s0108": "Duke Ai's first year, Chu attacked Zheng.",
  "s0109": "In the twenty-first year, Duke Ai died, and his son the Prince of Tai succeeded him, becoming Duke Gong.",
  "s0110": "Duke Gong's first year, Chu attacked Zheng.",
  "s0111": "In the fifteenth year, Duke Gong died, and his son the Prince of Yu succeeded him, becoming Duke Cheng.",
  "s0112": "Duke Cheng's first year, Chu attacked Zheng.",
  "s0113": "In the eighteenth year, Duke Cheng died, and his son the Prince of Lü succeeded him, becoming Duke Xiang.",
  "s0114": "Duke Xiang's first year, Chu attacked Zheng.",
  "s0115": "In the sixteenth year, Duke Xiang died, and his son the Prince of Chou succeeded him, becoming Duke Jian.",
  "s0116": "Duke Jian's first year, Chu attacked Zheng.",
  "s0117": "In the twenty-seventh year, Duke Jian died, and his son the Prince of Jin succeeded him, becoming Duke Ding.",
  "s0118": "Duke Ding's first year, Chu attacked Zheng.",
  "s0119": "In the twentieth year, Duke Ding died, and his son the Prince of Ning succeeded him, becoming Duke Ai.",
  "s0120": "Duke Ai's first year, Chu attacked Zheng."
}
