{
  "s459": "Five. Ping Ji Hou Xue Ze becomes Chancellor.",
  "s461": "Imperial Secretary Ou.",
  "s462": "130",
  "s463": "Five",
  "s464": "Tenth month, exterminates Guan Fu family, executes Wei Qi Hou in market.",
  "s465": "Two",
  "s468": "129",
  "s469": "Six",
  "s470": "Nan Yi first establishes postal stations.",
  "s471": "Three",
  "s472": "Grand Palace Attendant Wei Qing becomes Chariot Cavalry General, exits Shanggu; Guard Commander Li Guang becomes Brave Cavalry General, exits Yanmen; Grand Palace Attendant Gong Sun Ao becomes Cavalry General, exits Dai; Master of Carriages Gong Sun He becomes Light Chariot General, exits Yunzhong: all strike Xiongnu.",
  "s474": "128",
  "s475": "Yuan Shuo first year",
  "s476": "Wei Lady established as Empress.",
  "s477": "Four",
  "s478": "Chariot Cavalry General Qing exits Yanmen, strikes Xiongnu. Guard Commander Han An Guo becomes Garrison General, army Dai, next year, garrison Yu Yang passes away.",
  "s480": "127",
  "s481": "Two",
  "s483": "Five",
  "s484": "Spring, Chariot Cavalry General Wei Qing exits Yunzhong, reaches Gao Que, takes Henan territory.",
  "s486": "126",
  "s487": "Three",
  "s488": "Xiongnu kill Dai governor You.",
  "s489": "Six",
  "s491": "Imperial Secretary Hong.",
  "s492": "125",
  "s493": "Four",
  "s494": "Xiongnu enter Ding Xiang, Dai, Shangjun.",
  "s495": "Seven",
  "s498": "124",
  "s499": "Five",
  "s500": "Xiongnu kill Dai Commandant Zhu Ying. Ze dismissed from chancellor.",
  "s501": "Eight. Eleventh month yi chou, Imperial Secretary Gong Sun Hong becomes Chancellor, sealed as Ping Jin Hou.",
  "s502": "Spring, Chang Ping Hou Wei Qing becomes Grand General, strikes You Xian. Guard Commander Su Jian becomes Roaming Strike General, subordinate to Qing. Left Interior Minister Li Ju becomes Strong Crossbow General, Master of Carriages He becomes Chariot Cavalry General, Dai chancellor Li Cai becomes Light Chariot General, An Tou Hou Zhang Ci Gong becomes general, Grand Usher Xi becomes general: all subordinate to Grand General, strike Xiongnu.",
  "s504": "123",
  "s505": "Six",
  "s507": "Two",
  "s508": "Grand General Qing again exits Ding Xiang strikes Hu. He Qi Hou Gong Sun Ao becomes Middle General, Master of Carriages He becomes Left General, Palace Gentleman Commander Li Guang becomes Rear General. Xi Hou Zhao Xin becomes Front General, defeated surrenders to Xiongnu. Guard Commander Su Jian becomes Right General, defeated, body escapes. Left Interior Minister Ju becomes Qiang Nu General. All subordinate to Qing.",
  "s510": "122",
  "s511": "Yuan Shou first year",
  "s512": "Tenth month middle, Huainan King An, Hengshan King Ci plot rebellion, all commit suicide, states abolished.",
  "s513": "Three",
  "s515": "Imperial Secretary Cai.",
  "s516": "121",
  "s517": "Two",
  "s518": "Xiongnu enter Yanmen, Dai commandery. Jiangdu King Jian rebels. Jiaodong King son Qing established as Liu An King. Hong passes away.",
  "s519": "Four. Imperial Secretary Le An Hou Li Cai becomes Chancellor.",
  "s520": "Champion Hou Huo Qu Bing becomes Biao Qi General, strikes Hu, reaches Qi Lian; He Qi Hou Ao becomes general. Exits Beidi; Bo Wang Hou Zhang Qian, Palace Gentleman Commander Li Guang become generals, exit You Beiping.",
  "s521": "Imperial Secretary Tang."
}
