{
  "s0001": "The Grand Historian read the Spring and Autumn Annals, calendars, genealogies, and records, reaching King Li of Zhou, never failed to put down the book and sigh.",
  "s0002": "He said: 'Alas, Shi Zhi foresaw it!'",
  "s0003": "Zhou used ivory chopsticks and Jizi sighed.",
  "s0004": "Zhou way declined, poets based it on bed curtains, Guanjun was made.",
  "s0005": "Benevolence and righteousness declined, Lumning satirized it.",
  "s0006": "And when it came to King Li, because he hated hearing his faults criticized, the nobles feared execution and disaster arose, King Li then fled to Zhi, chaos began from the capital, and the Gonghe administered government.",
  "s0007": "After this, some used force to govern, strong oppressed weak, raised armies without requesting the Son of Heaven.",
  "s0008": "Yet holding the righteousness of the royal house, using punitive expeditions as covenant alliance leaders, government was by the five hegemons, feudal lords acted wantonly, extravagant and licentious without propriety, traitorous ministers and usurping sons arose increasingly.",
  "s0009": "Qi, Jin, Qin, Chu in the time of Chengzhou were very insignificant, enfeoffments of either one hundred li or fifty li.",
  "s0010": "Jin blocked the three rivers, Qi leaned on the eastern sea, Chu bordered Jiang and Huai, Qin relied on Yongzhou's fortifications, the four seas rose in succession, alternated as hegemonic lords, those whom Wen and Wu praised and greatly enfeoffed, all awed and submitted.",
  "s0011": "Therefore Confucius clarified the kingly way, visited over seventy rulers, none could employ him, therefore he went west to observe the Zhou house, discussed historical records and old traditions, began from Lu and arranged the Spring and Autumn Annals, above recording Yin, below reaching Ai's capture of the unicorn, condensed its wording, removed its complications, to establish righteous principles, the kingly way was complete, human affairs were thorough.",
  "s0012": "The seventy disciples' followers orally received his transmitted meanings, for there were satirical, critical, praising, taboo, diminishing words that could not be seen in writing.",
  "s0013": "Lu gentleman Zuo Qiuming feared disciples would each go to different doctrines, each comfortable in their own opinions, losing the truth, therefore following Confucius's historical records fully discussed their words, completed the Zuoshi Spring and Autumn Annals.",
  "s0014": "Duo Jiao made the transmission for Chu Wei Wang, for the king could not fully observe the Spring and Autumn Annals, selected successes and failures, in the end forty chapters, became the Duoshi minor work.",
  "s0015": "In Zhao Xiao Cheng Wang's time, his chancellor Yu Qing gathered above from Spring and Autumn, observed below recent trends, also wrote eight scrolls, became the Yu shi Spring and Autumn.",
  "s0016": "Lü Buwei, Qin Zhuang Xiang Wang's chancellor, also observed above ancient veneration, selected and gathered Spring and Autumn, collected six states' affairs, made eight views, six discussions, twelve records, became the Lü shi Spring and Autumn.",
  "s0017": "And like Xun Qing, Mengzi, Gongsun Gu, Han Fei and others, each often gathered Spring and Autumn's text to write books, different ways of counting.",
  "s0018": "Han chancellor Zhang Cang calendared the five virtues, upper grand master Dong Zhongshu pushed Spring and Autumn meanings, considerably wrote texts.",
  "s0019": "BCE Year Zhou Lu Qi Jin Qin Chu Song Wei Chen Cai Cao Zheng Yan Wu",
  "s0020": "841 Gengshen Gonghe first year, Li Wang's son dwelt in Zhao Gong's palace, this was King Xuan.",
  "s0021": "The king was young, ministers Gonghe administered government.",
  "s0022": "Zhen Gong Bi fifteenth year, one says fourteenth year, Wu Gong Shou tenth year, Jing Hou Yi Jiu eighteenth year, Qin Zhong fourth year, Xiong Yong",
  "s0023": "Seventh year, Xi Gong eighteenth year, Xi Hou fourteenth year, You Gong Ning fourteenth year, Wu Hou twenty-third year, Yi Bo twenty-fourth year, Hui Hou twenty-fourth year",
  "s0024": "840 Second year, sixteenth year, eleventh year, Jin Xi Hou Si Tu first year, fifth year, eighth year, nineteenth year, fifteenth year, fifteenth year, twenty-fourth year, twenty-fifth year, twenty-fifth year",
  "s0025": "839 Third year, seventeenth year, twelfth year, second year, sixth year, ninth year, twentieth year, sixteenth year, sixteenth year, twenty-fifth year, twenty-sixth year, twenty-sixth year",
  "s0026": "838 Fourth year, eighteenth year, thirteenth year, third year, seventh year, tenth year, twenty-first year, seventeenth year, seventeenth year, twenty-sixth year, twenty-seventh year, twenty-seventh year",
  "s0027": "837 Jiazi fifth year, nineteenth year, fourteenth year, fourth year, eighth year, Chu Xiong Yan first year, twenty-second year, eighteenth year, eighteenth year, Cai Yi Hou first year, twenty-eighth year, twenty-eighth year",
  "s0028": "836 Sixth year, twentieth year, fifteenth year, fifth year, ninth year, second year, twenty-third year, nineteenth year, nineteenth year, second year, twenty-ninth year, twenty-ninth year",
  "s0029": "835 Seventh year, twenty-first year, sixteenth year, sixth year, tenth year, third year, twenty-fourth year, twentieth year, twentieth year, third year, thirtieth year, thirtieth year",
  "s0030": "834 Eighth year, twenty-second year, seventeenth year, seventh year, eleventh year, fourth year, twenty-fifth year, twenty-first year, twenty-first year, fourth year, Cao You Bo Qiang first year, thirty-first year",
  "s0031": "833 Ninth year, twenty-third year, eighteenth year, eighth year, twelfth year, fifth year, twenty-sixth year, twenty-second year, twenty-second year, fifth year, second year, thirty-second year",
  "s0032": "832 Tenth year, twenty-fourth year, nineteenth year, ninth year, thirteenth year, sixth year, twenty-seventh year, twenty-third year, twenty-third year, sixth year, third year, thirty-third year",
  "s0033": "831 Eleventh year, twenty-fifth year, twentieth year, tenth year, fourteenth year, seventh year, twenty-eighth year, twenty-fourth year, Chen Xi Gong Xiao first year, seventh year, fourth year, thirty-fourth year",
  "s0034": "830 Twelfth year, twenty-sixth year, twenty-first year, eleventh year, fifteenth year, eighth year, Song Hui Gong Qi first year, twenty-fifth year, second year, eighth year, fifth year, thirty-fifth year",
  "s0035": "829 Thirteenth year, twenty-seventh year, twenty-second year, twelfth year, sixteenth year, ninth year, second year, twenty-sixth year, third year, ninth year, sixth year, thirty-sixth year",
  "s0036": "828 Fourteenth year, King Xuan ascended the throne, Gonghe ended.",
  "s0037": "Twenty-eighth year, twenty-third year, thirteenth year, seventeenth year, tenth year, third year, twenty-seventh year, fourth year, tenth year, seventh year, thirty-seventh year",
  "s0038": "827 Jiaxu King Xuan first year, twenty-ninth year, twenty-fourth year, fourteenth year, eighteenth year, Chu Xiong Shuang first year, fourth year, twenty-eighth year, fifth year, eleventh year, eighth year, thirty-eighth year",
  "s0039": "826 Second year, thirtieth year, twenty-fifth year, fifteenth year, nineteenth year, second year, fifth year, twenty-ninth year, sixth year, twelfth year, ninth year, Yan Xi Hou Zhuang first year",
  "s0040": "825 Third year, Lu Wu Gong Ao first year, twenty-sixth year, sixteenth year, twentieth year, third year, sixth year, thirtieth year, seventh year, thirteenth year, Cao Dai Bo Xian first year, second year",
  "s0041": "824 Fourth year, second year, Qi Li Gong Wu Ji first year, seventeenth year, twenty-first year, fourth year, seventh year, thirty-first year, eighth year, fourteenth year, second year, third year",
  "s0042": "823 Fifth year, third year, second year, eighteenth year, twenty-second year, fifth year, eighth year, thirty-second year, ninth year, fifteenth year, third year, fourth year",
  "s0043": "822 Sixth year, fourth year, third year, Jin Xian Hou Ji first year, twenty-third year, sixth year, ninth year, thirty-third year, tenth year, sixteenth year, fourth year, fifth year",
  "s0044": "821 Seventh year, fifth year, fourth year, second year, Qin Zhuang Gong Qi first year, Chu Xiong Xun first year, tenth year, thirty-fourth year, eleventh year, seventeenth year, fifth year, sixth year",
  "s0045": "820 Eighth year, sixth year, fifth year, third year, second year, second year, eleventh year, thirty-fifth year, twelfth year, eighteenth year, sixth year, seventh year",
  "s0046": "819 Ninth year, seventh year, sixth year, fourth year, third year, third year, twelfth year, thirty-sixth year, thirteenth year, nineteenth year, seventh year, eighth year",
  "s0047": "818 Tenth year, eighth year, seventh year, fifth year, fourth year, fourth year, thirteenth year, thirty-seventh year, fourteenth year, twentieth year, eighth year, ninth year",
  "s0048": "817 Jiashen eleventh year, ninth year, eighth year, sixth year, fifth year, fifth year, fourteenth year, thirty-eighth year, fifteenth year, twenty-first year, ninth year, tenth year",
  "s0049": "816 Twelfth year, tenth year, ninth year, seventh year, sixth year, sixth year, fifteenth year, thirty-ninth year, sixteenth year, twenty-second year, tenth year, eleventh year",
  "s0050": "815 Thirteenth year, Lu Yi Gong Xi first year, Qi Wen Gong Chi first year, eighth year, seventh year, seventh year, sixteenth year, fortieth year, seventeenth year, twenty-third year, eleventh year, twelfth year",
  "s0051": "814 Fourteenth year, second year, second year, ninth year, eighth year, eighth year, seventeenth year, forty-first year, eighteenth year, twenty-fourth year, twelfth year, thirteenth year",
  "s0052": "813 Fifteenth year, third year, third year, tenth year, ninth year, ninth year, eighteenth year, forty-second year, nineteenth year, twenty-fifth year, thirteenth year, fourteenth year",
  "s0053": "812 Sixteenth year, fourth year, fourth year, eleventh year, tenth year, tenth year, nineteenth year, Wei Wu Gong He first year, twentieth year, twenty-sixth year, fourteenth year, fifteenth year",
  "s0054": "811 Seventeenth year, fifth year, fifth year, Mu Hou Fu Sheng first year, eleventh year, eleventh year, twentieth year, second year, twenty-first year, twenty-seventh year, fifteenth year, sixteenth year",
  "s0055": "810 Eighteenth year, sixth year, sixth year, second year, twelfth year, twelfth year, twenty-first year, third year, twenty-second year, twenty-eighth year, sixteenth year, seventeenth year",
  "s0056": "809 Nineteenth year, seventh year, seventh year, third year, thirteenth year, thirteenth year, twenty-second year, fourth year, twenty-third year, Cai Xi Hou Suo Shi first year, seventeenth year, eighteenth year",
  "s0057": "808 Twentieth year, eighth year, eighth year, fourth year, took Qi woman as wife.",
  "s0058": "Fourteenth year, fourteenth year, twenty-third year, fifth year, twenty-fourth year, second year, eighteenth year, nineteenth year",
  "s0059": "807 Jiwu twenty-first year, ninth year, ninth year, fifth year, fifteenth year, fifteenth year, twenty-fourth year, sixth year, twenty-fifth year, third year, nineteenth year, twentieth year",
  "s0060": "806 Twenty-second year, Lu Xiao Gong Cheng first year, Bo Yu established as ruler, called various princes' son.",
  "s0061": "Bo Yu, Wu Gong's grandson.",
  "s0062": "Tenth year, sixth year, sixteenth year, sixteenth year, twenty-fifth year, seventh year, twenty-sixth year, fourth year, twentieth year, Zheng Huan Gong You first year began enfeoffment.",
  "s0063": "Zhou Xuan Wang's younger brother.",
  "s0064": "Twenty-first year",
  "s0065": "805 Twenty-third year, second year, eleventh year, seventh year attacked Tiao, gave birth to crown prince Chou.",
  "s0066": "Seventeenth year, seventeenth year, twenty-sixth year, eighth year, twenty-seventh year, fifth year, twenty-first year, second year, twenty-second year",
  "s0067": "804 Twenty-fourth year, third year, twelfth year, eighth year, eighteenth year, eighteenth year, twenty-seventh year, ninth year, twenty-eighth year, sixth year, twenty-second year, third year, twenty-third year",
  "s0068": "803 Twenty-fifth year, fourth year, Qi Cheng Gong Shuo first year, ninth year, nineteenth year, nineteenth year, twenty-eighth year, tenth year, twenty-ninth year, seventh year, twenty-third year, fourth year, twenty-fourth year",
  "s0069": "802 Twenty-sixth year, fifth year, second year, tenth year with thousand mu battle.",
  "s0070": "Gave birth to Chou's younger brother Cheng Shi.",
  "s0071": "Two sons named contradictory, superior men criticized it.",
  "s0072": "Later chaos.",
  "s0073": "Twentieth year, twentieth year, twenty-ninth year, eleventh year, thirtieth year, eighth year, twenty-fourth year, fifth year, twenty-fifth year",
  "s0074": "801 Twenty-seventh year, sixth year, third year, eleventh year, twenty-first year, twenty-first year, thirtieth year, twelfth year, thirty-first year, ninth year, twenty-fifth year, sixth year, twenty-sixth year",
  "s0075": "800 Twenty-eighth year, seventh year, fourth year, twelfth year, twenty-second year, Chu Xiong E first year, Song Hui Gong died.",
  "s0076": "Thirteenth year, thirty-second year, tenth year, twenty-sixth year, seventh year, twenty-seventh year",
  "s0077": "799 Twenty-ninth year, eighth year, fifth year, thirteenth year, twenty-third year, second year, Song Dai Gong established.",
  "s0078": "First year, fourteenth year, thirty-third year, eleventh year, twenty-seventh year, eighth year, twenty-eighth year",
  "s0079": "798 Thirtieth year, ninth year, sixth year, fourteenth year, twenty-fourth year, third year, second year, fifteenth year, thirty-fourth year, twelfth year, twenty-eighth year, ninth year, twenty-ninth year",
  "s0080": "797 Jichen thirty-first year, tenth year, seventh year, fifteenth year, twenty-fifth year, fourth year, third year, sixteenth year, thirty-fifth year, thirteenth year, twenty-ninth year, tenth year, thirtieth year",
  "s0081": "796 Thirty-second year, eleventh year, Zhou Xuan Wang executed Bo Yu, established his younger brother Cheng, this was Xiao Gong.",
  "s0082": "Eighth year, sixteenth year, twenty-sixth year, fifth year, fourth year, seventeenth year, thirty-sixth year, fourteenth year, thirtieth year, eleventh year, thirty-first year",
  "s0083": "795 Thirty-third year, twelfth year, ninth year, seventeenth year, twenty-seventh year, sixth year, fifth year, eighteenth year, Chen Wu Gong Ling first year, fifteenth year, Cao Hui Bo Zhi first year, twelfth year, thirty-second year",
  "s0084": "794 Thirty-fourth year, thirteenth year, Qi Zhuang Gong Shu",
  "s0085": "First year, eighteenth year, twenty-eighth year, seventh year, sixth year, nineteenth year, second year, sixteenth year, second year, thirteenth year, thirty-third year",
  "s0086": "793 Thirty-fifth year, fourteenth year, second year, nineteenth year, twenty-ninth year, eighth year, seventh year, twentieth year, third year, seventeenth year, third year, fourteenth year, thirty-fourth year",
  "s0087": "792 Thirty-sixth year, fifteenth year, third year, twentieth year, thirtieth year, ninth year, eighth year, twenty-first year, fourth year, eighteenth year, fourth year, fifteenth year, thirty-fifth year",
  "s0088": "791 Thirty-seventh year, sixteenth year, fourth year, twenty-first year, thirty-first year, tenth year, ninth year, twenty-second year, fifth year, nineteenth year, fifth year, sixteenth year, thirty-sixth year",
  "s0089": "790 Thirty-eighth year, seventeenth year, fifth year, twenty-second year, thirty-second year, Chu Ruo Ao first year, eleventh year, twenty-third year, sixth year, twentieth year, sixth year, seventeenth year, Yan Qing Hou first year",
  "s0090": "789 Thirty-ninth year, eighteenth year, sixth year, twenty-third year, thirty-third year, second year, twelfth year, twenty-fourth year, seventh year, twenty-first year, seventh year, eighteenth year, second year",
  "s0091": "788 Fortieth year, nineteenth year, seventh year, twenty-fourth year, thirty-fourth year, third year, thirteenth year, twenty-fifth year, eighth year, twenty-second year, eighth year, nineteenth year, third year",
  "s0092": "787 Jyin forty-first year, twentieth year, eighth year, twenty-fifth year, thirty-fifth year, fourth year, fourteenth year, twenty-sixth year, ninth year, twenty-third year, ninth year, twentieth year, fourth year",
  "s0093": "786 Forty-second year, twenty-first year, ninth year, twenty-sixth year, thirty-sixth year, fifth year, fifteenth year, twenty-seventh year, tenth year, twenty-fourth year, tenth year, twenty-first year, fifth year",
  "s0094": "785 Forty-third year, twenty-second year, tenth year, twenty-seventh year, Mu Hou died, younger brother Shang Shu self-established, crown prince Chou fled.",
  "s0095": "Thirty-seventh year, sixth year, sixteenth year, twenty-eighth year, eleventh year, twenty-fifth year, eleventh year, twenty-second year, sixth year",
  "s0096": "784 Forty-fourth year, twenty-third year, eleventh year, Jin Shang Shu first year, thirty-eighth year, seventh year, seventeenth year, twenty-ninth year, twelfth year, twenty-sixth year, twelfth year, twenty-third year, seventh year",
  "s0097": "783 Forty-fifth year, twenty-fourth year, twelfth year, second year, thirty-ninth year, eighth year, eighteenth year, thirtieth year, thirteenth year, twenty-seventh year, thirteenth year, twenty-fourth year, eighth year",
  "s0098": "782 Forty-sixth year, twenty-fifth year, thirteenth year, third year, fortieth year, ninth year, nineteenth year, thirty-first year, fourteenth year, twenty-eighth year, fourteenth year, twenty-fifth year, ninth year",
  "s0099": "781 You Wang first year, twenty-sixth year, fourteenth year, fourth year, Chou attacked and killed Shang Shu, established as Wen Hou.",
  "s0100": "Forty-first year, tenth year, nineteenth year, thirty-second year, fifteenth year, twenty-ninth year, fifteenth year, twenty-sixth year, tenth year"
}