{
  "s88": "As Xiongnu king surrendered, Marquis. As Marquis Changwu followed Piaoyi General attacked Left Wise King with merit, increased enfeoffment.",
  "s90": "Three. Fourth year tenth month geng shen, Marquis Jian Zhao An Ji first year.",
  "s91": "Six",
  "s92": "Six",
  "s93": "One. Five. Second year, Marquis Chong Guo first year.",
  "s94": "Taichu first year, Marquis Chong Guo died, no posterity, state abolished.",
  "s95": "Xiang Cheng.",
  "s96": "As Xiongnu prime minister surrendered, Marquis.",
  "s98": "Three. Fourth year tenth month geng shen, Marquis Wu Long first year.",
  "s99": "Six",
  "s100": "Six",
  "s101": "Six",
  "s102": "One. Taichu second year, Wu Long followed Marquis Zhuoye died in battle. Two. Third year, Marquis Bing Ji first year.",
  "s103": "Nan Ting.",
  "s104": "As Cavalry General followed Grand General Qing attacked Xiongnu obtained king with merit, Marquis. Taichu second year, as Chancellor enfeoffed as Marquis of Ge Yi.",
  "s106": "Two. Fifth year fourth month ding wei, Marquis Gong Sun He first year.",
  "s107": "Six",
  "s108": "Four. Fifth year, He convicted of tribute gold, state abolished, ended, seven years.",
  "s110": "Thirteen. Taichu second year third month ding mao, enfeoffed as Marquis of Ge Yi. Zhenghe second year, He's son Jing Sheng committed crime, state abolished.",
  "s111": "He Qi.",
  "s112": "As Protector Army Colonel three times followed Grand General attacked Xiongnu, to Right Wise King court, obtained king with merit, Marquis. Yuanshuo sixth year increased enfeoffment.",
  "s114": "Two. Fifth year fourth month ding wei, Marquis Gong Sun Ao first year.",
  "s115": "One. Second year, Marquis Ao led troops attacked Xiongnu, with Piaoyi General appointed time, late, cowardly, should be executed, ransomed as commoner, state abolished.",
  "s119": "Le An.",
  "s120": "As Light Chariot General twice followed Grand General Qing attacked Xiongnu obtained king with merit, Marquis.",
  "s122": "Two. Fifth year fourth month ding wei, Marquis Li Cai first year.",
  "s123": "Four. Fifth year, Marquis Cai as Chancellor stole Emperor Jing garden divine path border land crime, suicide, state abolished.",
  "s127": "Long Tang.",
  "s128": "As colonel followed Grand General Qing attacked Xiongnu obtained king with merit, Marquis. Yuanding sixth year, as Horizontal Sea General attacked Dongyue with merit, became Marquis of An Dao.",
  "s130": "Two. Fifth year fourth month ding wei, Marquis Han Yue first year.",
  "s131": "Six",
  "s132": "Four. Fifth year, Marquis Yue convicted of tribute gold, state ended. Two years restored marquisate.",
  "s133": "Six. First year fifth month ding mao, Marquis of An Dao Yue first year.",
  "s134": "Thirteen. Zhenghe second year, son Chang succeeded, committed crime, ended. Son Zeng again enfeoffed as Marquis of Long Tang.",
  "s135": "Sui Cheng.",
  "s136": "As colonel three times followed Grand General Qing attacked Xiongnu, attacked Nong Wu, first ascended stone fortress, obtained king with merit, Marquis.",
  "s138": "Two. Fifth year fourth month yi mao, Marquis Zhao Bu Yu first year.",
  "s139": "Three. Third year, Marquis Bu Yu convicted of as Grand Administrator of Dingxiang, Xiongnu defeated Grand Administrator, reported not according to reality, fraudulent, state abolished.",
  "s143": "Cong Ping.",
  "s144": "As colonel three times followed Grand General Qing attacked Xiongnu, to Right Wise King court, repeatedly as goose formation ascended stone mountain first ascended with merit, Marquis.",
  "s146": "Two. Fifth year fourth month yi mao, Gong Sun Rong Nu first year.",
  "s147": "One. Second year, Marquis Rong Nu convicted of as Grand Administrator of Shangjun mobilized troops attacked Xiongnu, not reported, fraudulent, state abolished.",
  "s151": "She Zhi.",
  "s152": "As colonel three times followed Grand General attacked Xiongnu, to Right Wise King court, obtained king, captured Yanzhi with merit, Marquis.",
  "s154": "Two. Fifth year fourth month ding wei, Marquis Li Shuo first year.",
  "s155": "First year, Marquis Shuo committed crime, state abolished.",
  "s159": "Yi Chun.",
  "s160": "With father's merit as Grand General Qing defeated Right Wise King, Marquis.",
  "s162": "Two. Fifth year fourth month ding wei, Marquis Wei Kang first year."
}
