{
  "s0428": "Duke Jing sat in Bai Resting Hall, sighed saying: 'Majestic!",
  "s0429": "Who has this?'",
  "s0430": "Assembled ministers all wept, Yan Zi laughed, duke angered.",
  "s0431": "Yan Zi said: 'Servant laughs assembled ministers flatter excessively.'",
  "s0432": "Duke Jing said: 'Comet appears northeast, should be Qi's region, I consider it worry.'",
  "s0433": "Yan Zi said: 'Lord has high towers deep pools, taxes and levies as if cannot obtain, punishments and penalties fear cannot overcome, ominous stars will appear, why fear comet?'",
  "s0434": "Duke said: 'Can exorcise it?'",
  "s0435": "Yan Zi said: 'If spirits can be prayed to come, also can be exorcised to go.",
  "s0436": "Common people suffer resentment in ten thousands, but lord commands one person to exorcise it, how can overcome the multitudes' mouths?'",
  "s0437": "At this time Duke Jing was fond of repairing palaces, gathering dogs and horses, extravagant, heavy taxes severe punishments, therefore Yan Zi advised with this.",
  "s0438": "Year 42, Wu King He Lu attacked Chu, entered Ying.",
  "s0439": "Year 47, Lu Yang Hu attacked his lord, did not win, fled to Qi, requested Qi attack Lu.",
  "s0440": "Bao Zi advised Duke Jing, then imprisoned Yang Hu.",
  "s0441": "Yang Hu escaped, fled to Jin.",
  "s0442": "Year 48, good meeting with Duke Ding of Lu at Jia Gu.",
  "s0443": "Li Chu said: 'Kong Qiu understands rites but is cowardly, please command Lai people to perform music, thus seize Lu lord, can achieve ambition.'",
  "s0444": "Duke Jing harmed Kong Qiu assisting Lu, feared his hegemony, therefore followed Li Chu's plan.",
  "s0445": "When meeting, advanced Lai music, Kong Qiu ascended the stairs, made officials seize Lai people and behead them, with rites yielded to Duke Jing.",
  "s0446": "Duke Jing ashamed, then returned Lu's invaded lands to apologize, and withdrew.",
  "s0447": "This year, Yan Ying passed away.",
  "s0448": "Year 55, Fan and Zhonghang rebelled against their lord in Jin, Jin attacked urgently, came requesting grain.",
  "s0449": "Tian Qi wished to cause disorder, planted faction among rebellious ministers, persuaded Duke Jing saying: 'Fan and Zhonghang repeatedly have virtue toward Qi, cannot not save.'",
  "s0450": "Then made Qi save and transport grain to them.",
  "s0451": "Year 58 summer, Duke Jing's wife Yan Ji's suitable son died.",
  "s0452": "Duke Jing's favored concubine Rui Ji gave birth to Zi Tu, Tu young, his mother base, without conduct, various grandees feared he would succeed, then said wished to select among sons the eldest worthy one as crown prince.",
  "s0453": "Duke Jing old, disliked speaking of succession matters, moreover loved Tu's mother, wished to establish him, dreaded speaking it, then told various grandees: 'For pleasure only, state what worry of lacking lord?'",
  "s0454": "Autumn, Duke Jing ill, commanded Guo Hui Zi, Gao Zhao Zi establish young son Tu as crown prince, drove out assembled princes, moved them to Lai.",
  "s0455": "Duke Jing passed away, crown prince Tu established, this was Yan Ru Zi.",
  "s0456": "Winter, not yet buried, assembled princes fearing execution, all fled out.",
  "s0457": "Tu's various different mother elder brothers Prince Shou, Ju, Qian fled to Wei, Prince Ju, Yang Sheng fled to Lu.",
  "s0458": "Lai people sang: 'Jing lord died not participate in burial, three armies' affairs not participate in planning, master master, why follow him?'",
  "s0460": "Yan Ru Zi year 1 spring, Tian Qi falsely served Gao and Guo, every morning, Qi drove chariot, said: 'You obtained lord, grandees all endanger themselves, wish to plot disorder.'",
  "s0461": "Also told various grandees: 'Gao Zhao Zi is fearsome, before not yet issued, first him.'",
  "s0462": "Grandees followed it.",
  "s0463": "Sixth month, Tian Qi, Bao Mu then with grandees entered duke's palace with troops, attacked Gao Zhao Zi.",
  "s0464": "Zhao Zi heard it, with Guo Hui Zi saved duke.",
  "s0465": "Duke's army defeated, Tian Qi's followers pursued them, Guo Hui Zi fled to Ju, then turned back killed Gao Zhao Zi.",
  "s0466": "Yan Yu fled to Lu.",
  "s0467": "Eighth month, Qi carried Yi Zi.",
  "s0468": "Tian Qi defeated two chancellors, then made people go to Lu summon Prince Yang Sheng.",
  "s0469": "Yang Sheng arrived in Qi, secretly hid in Tian Qi's house.",
  "s0470": "Tenth month wu zi day, Tian Qi requested various grandees: 'Chang's mother has fish and beans sacrifice, fortunate to come assemble and drink.'",
  "s0471": "Assembled drinking, Tian Qi filled Yang Sheng in bag, placed in seat center, opened bag brought out Yang Sheng, said: 'This is Qi lord!'",
  "s0472": "Grandees all prostrated and greeted.",
  "s0473": "About to ally with grandees and establish him, Bao Mu drunk, Qi slandered grandees saying: 'I and Bao Mu plotted together to establish Yang Sheng.'",
  "s0474": "Bao Mu angered saying: 'You forget Duke Jing's command?'",
  "s0475": "Various grandees looked at each other wishing to regret, Yang Sheng forward, knocked head saying: 'Can then establish him, cannot then stop.'",
  "s0476": "Bao Mu feared disaster would arise, then again said: 'All Duke Jing's sons, why cannot!'",
  "s0477": "Then allied with them, established Yang Sheng, this was Duke Dao.",
  "s0478": "Duke Dao entered palace, made people move Yan Ru Zi to Dai, killed him under the tent, and drove out Ru Zi's mother Rui Zi.",
  "s0479": "Rui Zi formerly base and Ru Zi young, therefore without authority, state people despised him.",
  "s0480": "Duke Dao year 1, Qi attacked Lu, took Chan, Chan.",
  "s0481": "Initially, Yang Sheng fled to Lu, Ji Kang Zi married his younger sister to him.",
  "s0482": "When returned and ascended throne, made welcome her.",
  "s0483": "Ji Ji communicated with Ji Fang Hou, spoke their affair, Lu dared not give, therefore Qi attacked Lu, finally welcomed Ji Ji.",
  "s0484": "Ji Ji favored, Qi again returned Lu's invaded lands.",
  "s0485": "Bao Zi had enmity with Duke Dao, not good.",
  "s0486": "Year 4, Wu and Lu attacked Qi southern border.",
  "s0487": "Bao Zi assassinated Duke Dao, reported to Wu.",
  "s0488": "Wu King Fu Chai wept at army gate outside three days, about to follow sea enter punish Qi.",
  "s0489": "Qi people defeated them, Wu army then left.",
  "s0490": "Jin Zhao Meng attacked Qi, reached Lai and left.",
  "s0491": "Qi people together established Duke Dao's son Ren, this was Duke Jian.",
  "s0492": "Duke Jian year 4 spring, initially, Duke Jian with father Yang Sheng both in Lu, Jian Zhi had favor.",
  "s0493": "When ascended throne, made govern affairs.",
  "s0494": "Tian Cheng Zi dreaded him, frequently glanced at court.",
  "s0495": "Yu Yang spoke to Duke Jian: 'Tian and Jian cannot be together, lord choose one.'",
  "s0496": "Did not listen.",
  "s0497": "Zi Wo evening, Tian Ni killed person, met him, then captured and entered.",
  "s0498": "Tian clan just harmonious, made prisoner ill and sent guard prisoner wine, drunk and killed guard, obtained escape.",
  "s0499": "Zi Wo allied various Tian at Chen Zong.",
  "s0500": "Initially, Tian Bao wished to be Zi Wo's minister, made Gong Sun speak to Bao, Bao had mourning and stopped.",
  "s0501": "Later finally became minister, fortunate with Zi Wo.",
  "s0502": "Zi Wo told him: 'I completely drive Tian clan and establish you, acceptable?'",
  "s0503": "Replied: 'I distant from Tian clan.",
  "s0504": "Moreover their opposers no more than several people, why completely drive?'",
  "s0505": "Then told Tian clan.",
  "s0506": "Zi Xing said: 'He obtains lord, if not first, certainly disaster you.'",
  "s0507": "Zi Xing lodged in duke's palace.",
  "s0508": "Summer fifth month ren shen day, Cheng Zi brothers four chariots went to duke.",
  "s0509": "Zi Wo in tent, came out to welcome them, then entered, closed door.",
  "s0510": "Eunuch drove chariot, Zi Xing killed eunuch.",
  "s0511": "Duke with woman drinking wine at Tan Platform, Cheng Zi moved them to bedchamber.",
  "s0512": "Duke grasped spear about to strike him, grand historian Zi Yu said: 'Not disadvantageous, will eliminate harm.'",
  "s0513": "Cheng Zi came out lodged in storehouse, heard duke still angered, about to exit, said: 'What place without lord!'",
  "s0514": "Zi Xing drew sword said: 'Wait, affair's traitor.",
  "s0515": "Who not Tian clan?",
  "s0516": "What not kill you has like Tian clan.'",
  "s0517": "Then stopped.",
  "s0518": "Zi Wo returned, commanded followers attack inner and main gates, all not win, then exited.",
  "s0519": "Tian clan pursued him.",
  "s0520": "Feng Qiu people seized Zi Wo to report, killed him at outer pass.",
  "s0521": "Cheng Zi about to kill Da Lu Zi Fang, Tian Ni requested and exempted him.",
  "s0522": "With duke's command took chariot on road, exited Yong Gate.",
  "s0523": "Tian Bao gave him chariot, not accepted, said: 'Ni requested for me, Bao gave me chariot, I have private matter.",
  "s0524": "Served Zi Wo and have private with his enemy, with what see Lu Wei scholars?'",
  "s0526": "Geng chen day, Tian Chang seized Duke Jian at Xu Zhou.",
  "s0527": "Duke said: 'I early followed Yu Yang's words, would not reach this.'",
  "s0528": "Jia wu day, Tian Chang assassinated Duke Jian at Xu Zhou.",
  "s0529": "Tian Chang then established Duke Jian's younger brother Ao, this was Duke Ping.",
  "s0530": "Duke Ping ascended throne, Tian Chang as chancellor, monopolized Qi governance, divided Qi Anping east as Tian clan fief.",
  "s0531": "Duke Ping year 8, Yue extinguished Wu.",
  "s0532": "Year 25 passed away, son Duke Xuan Ji established.",
  "s0533": "Duke Xuan year 51 passed away, son Duke Kang Dai established.",
  "s0534": "Tian Hui rebelled Lin Qiu.",
  "s0535": "Duke Kang year 2, Han, Wei, Zhao began listed as feudal lords.",
  "s0536": "Year 19, Tian Chang's great grandson Tian He began as feudal lord, moved Duke Kang to seacoast.",
  "s0537": "Year 26, Duke Kang passed away, Lü clan then extinguished their sacrifices."
}
