{
  "s0621": "Forty-second year, An Guo Jun became crown prince.",
  "s0622": "Tenth month, Xuan Taihou died, buried at Zhiyang Lishan.",
  "s0623": "Ninth month, Rang Hou was exiled to Tao.",
  "s0624": "Forty-third year, Wu An Jun Bai Qi attacked Han, took nine cities, beheaded 50,000.",
  "s0625": "Forty-fourth year, attacked Han Nanyang, took it.",
  "s0626": "Forty-fifth year, Wu Da Fu Ben attacked Han, took ten cities.",
  "s0627": "Forty-sixth year, attacked Zhao, took Guanglang.",
  "s0628": "Forty-seventh year, attacked Han, took Hua.",
  "s0629": "Forty-eighth year, attacked Zhao, took Wu'an.",
  "s0630": "Forty-ninth year, attacked Wei, took Gaoqiu.",
  "s0631": " Fiftieth year, attacked Han, took Chenggao.",
  "s0632": "Fifty-first year, Zhao Hao became prime minister of Qin.",
  "s0633": "Fifty-second year, attacked Wei, took Xiangling.",
  "s0634": "Fifty-third year, attacked Zhao, took Taiyuan.",
  "s0635": "Fifty-fourth year, attacked Wei, took Xincheng.",
  "s0636": "Fifty-fifth year, attacked Zhao, took Hequ.",
  "s0637": "Fifty-sixth year, attacked Wei, took Weibin.",
  "s0638": "Fifty-seventh year, attacked Han, took Yewang.",
  "s0639": "Fifty-eighth year, attacked Zhao, took Fushi.",
  "s0640": "Fifty-ninth year, attacked Wei, took Xincheng again.",
  "s0641": "Sixtieth year, attacked Han, took Yiyang.",
  "s0642": "Sixty-first year, attacked Zhao, took Pingyang.",
  "s0643": "Sixty-second year, attacked Wei, took Anyi.",
  "s0644": "Sixty-third year, attacked Han, took Chenggao again.",
  "s0645": "Sixty-fourth year, attacked Zhao, took Guangwu.",
  "s0646": "Sixty-fifth year, attacked Wei, took Weibin again.",
  "s0647": "Sixty-sixth year, attacked Han, took Yewang again.",
  "s0648": "Sixty-seventh year, attacked Zhao, took Fushi again.",
  "s0649": "Sixty-eighth year, attacked Wei, took Xincheng again.",
  "s0650": "Sixty-ninth year, attacked Han, took Yiyang again.",
  "s0651": "Seventieth year, attacked Zhao, took Pingyang again.",
  "s0652": "Seventy-first year, attacked Wei, took Anyi again.",
  "s0653": "Seventy-second year, attacked Han, took Chenggao again.",
  "s0654": "Seventy-third year, attacked Zhao, took Guangwu again.",
  "s0655": "Seventy-fourth year, attacked Wei, took Weibin again.",
  "s0656": "Seventy-fifth year, attacked Han, took Yewang again.",
  "s0657": "Seventy-sixth year, attacked Zhao, took Fushi again.",
  "s0658": "Seventy-seventh year, attacked Wei, took Xincheng again.",
  "s0659": "Seventy-eighth year, attacked Han, took Yiyang again.",
  "s0660": "Seventy-ninth year, attacked Zhao, took Pingyang again.",
  "s0661": "Eightieth year, attacked Wei, took Anyi again.",
  "s0662": "Eighty-first year, attacked Han, took Chenggao again.",
  "s0663": "Eighty-second year, attacked Zhao, took Guangwu again.",
  "s0664": "Eighty-third year, attacked Wei, took Weibin again.",
  "s0665": "Eighty-fourth year, attacked Han, took Yewang again.",
  "s0666": "Eighty-fifth year, attacked Zhao, took Fushi again.",
  "s0667": "Eighty-sixth year, attacked Wei, took Xincheng again.",
  "s0668": "Eighty-seventh year, attacked Han, took Yiyang again.",
  "s0669": "Eighty-eighth year, attacked Zhao, took Pingyang again.",
  "s0670": "Eighty-ninth year, attacked Wei, took Anyi again.",
  "s0671": "Ninetieth year, attacked Han, took Chenggao again.",
  "s0672": "Ninety-first year, attacked Zhao, took Guangwu again.",
  "s0673": "Ninety-second year, attacked Wei, took Weibin again.",
  "s0674": "Ninety-third year, attacked Han, took Yewang again.",
  "s0675": "Ninety-fourth year, attacked Zhao, took Fushi again.",
  "s0676": "Ninety-fifth year, attacked Wei, took Xincheng again.",
  "s0677": "Ninety-sixth year, attacked Han, took Yiyang again.",
  "s0678": "Ninety-seventh year, attacked Zhao, took Pingyang again.",
  "s0679": "Ninety-eighth year, attacked Wei, took Anyi again.",
  "s0680": "Ninety-ninth year, attacked Han, took Chenggao again.",
  "s0681": "One hundredth year, attacked Zhao, took Guangwu again.",
  "s0682": "One hundred first year, attacked Wei, took Weibin again.",
  "s0683": "One hundred second year, attacked Han, took Yewang again.",
  "s0684": "One hundred third year, attacked Zhao, took Fushi again.",
  "s0685": "One hundred fourth year, Duke Zhaoxiang died, his son King Xiaowen ascended."
}