{
  "s0111": {
    "chinese": "故今予發維共行天罰。",
    "literal": "Therefore now I Fa will jointly execute Heaven's punishment.",
    "idiomatic": "Therefore now I, Fa, will jointly execute Heaven's punishment.'"
  },
  "s0112": {
    "chinese": "勉哉夫子，不可再，不可三！」",
    "literal": "Strive, gentlemen, it cannot be done twice, cannot be done three times!'",
    "idiomatic": "Strive, gentlemen! This cannot be done twice, cannot be done three times!'"
  },
  "s0114": {
    "chinese": "二月甲子昧爽，武王朝至于商郊牧野，乃誓。",
    "literal": "In the second month, day jiazi at dawn, King Wu arrived at the Shang suburb of Muye, and made the oath.",
    "idiomatic": "In the second month, on jiazi day at dawn, King Wu arrived at the Shang suburb of Muye and made his oath."
  },
  "s0115": {
    "chinese": "武王左杖黃鉞，右秉白旄，以麾。",
    "literal": "King Wu held the yellow axe in his left hand, white banner in his right, to command.",
    "idiomatic": "King Wu held the yellow battle-axe in his left hand and the white yak-tail banner in his right, using them to direct his forces."
  },
  "s0116": {
    "chinese": "曰：「遠矣西土之人！」",
    "literal": "He said: 'Distant are the people of the western lands!'",
    "idiomatic": "He said: 'How distant are the people of the western lands!'"
  },
  "s0117": {
    "chinese": "武王曰：「嗟！",
    "literal": "King Wu said: 'Alas!",
    "idiomatic": "King Wu said: 'Alas!"
  },
  "s0118": {
    "chinese": "我有國冢君，司徒、司馬、司空，亞旅、師氏，千夫長、百夫長，及庸、蜀、羌、髳、微、纑、彭、濮人，稱爾戈，比爾干，立爾矛，予其誓。」",
    "literal": "I have the great lords of states, the Minister of Works, Minister of War, Minister of the Masses, subordinate officers, commanders, captains of a thousand, captains of a hundred, and the people of Yong, Shu, Qiang, Mao, Wei, Lu, Peng, and Pu. Raise your spears, array your shields, set your lances, I will make my oath.'",
    "idiomatic": "I have the great lords of states, the Ministers of Education, War, and Works, the subordinate officers and commanders, captains of a thousand and captains of a hundred, and the people of Yong, Shu, Qiang, Mao, Wei, Lu, Peng, and Pu. Raise your spears, array your shields, set your lances - I will make my oath.'"
  },
  "s0119": {
    "chinese": "王曰：「古人有言『牝雞無晨。",
    "literal": "The king said: 'The ancients had a saying: 'The hen does not crow at dawn.",
    "idiomatic": "The king said: 'The ancients had a saying: \"The hen does not crow at dawn.\""
  },
  "s0120": {
    "chinese": "牝雞之晨，惟家之索』。",
    "literal": "If the hen crows at dawn, it brings ruin to the family.'",
    "idiomatic": "If the hen crows at dawn, it brings ruin to the family.\"'"
  },
  "s0121": {
    "chinese": "今殷王紂維婦人言是用，自棄其先祖肆祀不答，昏棄其家國，遺其王父母弟不用，乃維四方之多罪逋逃是崇是長，是信是使，俾暴虐于百姓，以姦軌于商國。",
    "literal": "Now the Yin king Zhou only uses the words of women, abandons his ancestors' generous sacrifices without response, carelessly abandons his state and family, neglects his royal parents and brothers without employing them, but honors and promotes the many criminals and fugitives from the four directions, trusts and employs them, causing violence and oppression to the common people, bringing chaos and rebellion to the Shang state.'",
    "idiomatic": "Now the Yin king Zhou uses only the words of women, abandons his ancestors' generous sacrifices without response, carelessly abandons his state and family, neglects his royal parents and brothers without employing them, but honors and promotes the many criminals and fugitives from the four directions, trusts and employs them, causing violence and oppression to the common people, bringing chaos and rebellion to the Shang state.'"
  },
  "s0122": {
    "chinese": "今予發維共行天之罰。",
    "literal": "Now I Fa will jointly execute Heaven's punishment.",
    "idiomatic": "Now I, Fa, will jointly execute Heaven's punishment.'"
  },
  "s0123": {
    "chinese": "今日之事，不過六步七步，乃止齊焉，夫子勉哉！",
    "literal": "Today the battle must be decisive, we will not return until evening.'",
    "idiomatic": "Today's battle will be decided in six steps, seven steps - then we will stop and rally. Strive, gentlemen!'"
  },
  "s0124": {
    "chinese": "不過於四伐五伐六伐七伐，乃止齊焉，勉哉夫子！",
    "literal": "In the second month, day jiazi, the Zhou army defeated the Yin at Muye.",
    "idiomatic": "No more than four strikes, five strikes, six strikes, seven strikes - then stop and rally. Strive, gentlemen!'"
  },
  "s0125": {
    "chinese": "尚桓桓，如虎如羆，如豺如離，于商郊，不御克奔，以役西土，勉哉夫子！",
    "literal": "King Zhou fled, burned himself in the Deer Tower.",
    "idiomatic": "Be stern and resolute, like tigers and bears, like wolves and leopards, here in the Shang suburbs. Do not resist those who submit, do not pursue those who flee, to serve the western lands. Strive, gentlemen!'"
  },
  "s0126": {
    "chinese": "爾所不勉，其于爾身有戮。」",
    "literal": "King Wu cut off his head, hung it on a white banner.",
    "idiomatic": "If you do not strive, punishment will fall upon your persons.'"
  },
  "s0127": {
    "chinese": "誓已，諸侯兵會者車四千乘，陳師牧野。",
    "literal": "He attacked Yan, killed Bi Gan the loyal minister, released Mi Zi, restored Jizi.",
    "idiomatic": "After the oath, the feudal lords' assembled forces numbered 4,000 chariots, drawn up in battle array at Muye."
  },
  "s0128": {
    "chinese": "帝紂聞武王來，亦發兵七十萬人距武王。",
    "literal": "He divided the Yin lands, enfeoffed the Zhou lords.",
    "idiomatic": "When King Zhou heard that King Wu was coming, he also sent out 700,000 men to oppose King Wu."
  },
  "s0129": {
    "chinese": "武王使師尚父與百夫致師，以大卒馳帝紂師。",
    "literal": "He returned to Fenghao, the four directions all submitted.",
    "idiomatic": "King Wu sent Master Shangfu and the captains of a hundred to lead the advance, charging the main force against King Zhou's army."
  },
  "s0130": {
    "chinese": "紂師雖眾，皆無戰之心，心欲武王亟入。",
    "literal": "He made the Duke of Zhou prime minister, to govern the eastern regions.",
    "idiomatic": "Though King Zhou's army was numerous, none had the will to fight; their hearts wished for King Wu to enter quickly."
  },
  "s0131": {
    "chinese": "紂師皆倒兵以戰，以開武王。",
    "literal": "In the second year, King Wu toured the eastern regions.",
    "idiomatic": "King Zhou's troops all turned their weapons around to fight, opening the way for King Wu."
}
}
