{
  "s0001": "When Sima Qian read about the Qin-Chu period, he said: The initial uprising began with Chen She;",
  "s0002": "Tyrannical cruelty destroyed Qin, arose from the Xiang clan;",
  "s0003": "Eliminated chaos and executed tyrants, pacified the realm, finally ascended the imperial throne, accomplished by the Han house.",
  "s0004": "Within five years, commands and decrees changed three times.",
  "s0005": "Since the beginning of human life, never has the reception of the mandate been so urgent as this",
  "s0006": "In ancient times, when Yu and Xia rose to power, they accumulated goodness and achievements for several decades, their virtue permeated the people, they administered government affairs, tested it with Heaven, and then took the throne.",
  "s0007": "When Tang and Wu became kings, it was through Jie and Houji cultivating benevolence and righteousness for more than ten generations, unexpectedly gathering at Mengjin with eight hundred feudal lords, yet they still considered it not yet possible, and only afterward did they banish and assassinate.",
  "s0008": "Qin arose with Duke Xiang, flourished under Wen and Mu, after Xian and Xiao, gradually encroaching on the six states like silkworms eating mulberry leaves, for more than a hundred years, until the First Emperor was able to unite those who wore caps and belts.",
  "s0009": "With virtue like that, using force like this, indeed unifying is as difficult as this.",
  "s0010": "After Qin declared itself emperor, it worried that weapons would never cease because of the feudal lords, therefore there were no enfeoffments of even a foot of land, famous cities were demolished, weapons were melted down, powerful nobles were eliminated, to maintain peace for ten thousand generations.",
  "s0011": "Yet the rise of royal traces begins in alleyways, allied coalitions attack, surpassing the Three Dynasties, the Qin prohibitions actually only served to provide resources for the worthy to eliminate difficulties.",
  "s0012": "Therefore they were enraged at what made them hegemon of the realm, how could they not become king without territory?",
  "s0013": "Is this not what the transmissions call a great sage?",
  "s0014": "Is it not Heaven? Is it not Heaven!",
  "s0015": "Who but a great sage could receive this mandate and become emperor?",
  "s26": "Second Emperor first year",
  "s37": "Chu Yin Wang Chen She raised troops and entered Qin.",
  "s47": "Second year. Ge Ying acted for She in Jiujiang, established Xiang Qiang as Chu king.",
  "s49": "Wu Chen first arrived at Handan, established himself as Zhao king, beginning.",
  "s56": "Ninth month. Chu troops arrived at Xi.",
  "s57": "Third year. Zhou Wen's troops arrived at Xi, were defeated. Ge Ying heard that She was king, immediately killed Qiang.",
  "s58": "Xiang Liang styled himself Wu Xin Jun.",
  "s60": "Qi King Tian Dan beginning. Dan was a Di person. Various Tian clan relatives were strong. Younger cousin Rong, Rong's younger brother Heng.",
  "s61": "Pei Gong first rose.",
  "s62": "Han Guang conquered territory for Zhao to Ji, established himself as Yan king beginning.",
  "s63": "Wei King Jiu beginning. Jiu was in Chen, could not return to his state.",
  "s66": "Second year tenth month",
  "s67": "Fourth year. Executed Ge Ying.",
  "s70": "Second year. When Dan rose, he killed the Di magistrate and made himself king.",
  "s71": "Second year. Attacked Hu Ling and Fang Yu, defeated Qin's army supervisor.",
  "s76": "Eleventh month",
  "s77": "Fifth year. Zhou Wen died.",
  "s79": "Fourth year. Li Liang killed Wu Chen, Zhang Er and Chen Yu fled.",
  "s81": "Third year. Killed the Si River guard. Took west of Xue. Zhou Shi conquered east to Feng Pei area.",
  "s83": "Third year. Qi and Zhao together established Zhou Shi, Shi refused, said 'Must establish Wei Jiu' etc.",
  "s86": "Twelfth month",
  "s87": "Sixth year. Chen She died.",
  "s91": "Fourth year. Yong Chi rebelled against Pei Gong, surrendered Feng to Wei. Pei Gong returned and attacked Feng, could not take it.",
  "s93": "Fourth year. Jiu returned from Chen, was established.",
  "s97": "Chu King Jing Ju beginning, Qin Jia established him.",
  "s98": "Fifth year. She's general Zhao Ping falsely appointed Xiang Liang as Chu Zhu Guo, urgently attacked west against Qin.",
  "s99": "Zhao King Xie beginning, Zhang Er and Chen Yu established him.",
  "s100": "Fifth year. Reprimanded Jing Ju for presumptuously becoming king without consulting us.",
  "s101": "Fifth year. Pei Gong heard Jing Ju was king at Liu, went to follow him, together attacked Qin army west of Dang.",
  "s103": "Fifth year. Zhang Han had already defeated She, besieged Jiu at Lin Ji.",
  "s107": "Second year. Jia became supreme general.",
  "s108": "Sixth year. Liang crossed the Jiang, Chen Ying and Qing Bu both belonged to him.",
  "s110": "Sixth year. Jing Ju sent Gong Sun Qing to reprimand Qi, executed Qing.",
  "s111": "Sixth year. Attacked and took Dang, gathered 6,000 troops, together with previous made 9,000 total."
}