{
  "s0799": "Fourth year, twenty-sixth year, nineteenth year, fifth year, twelfth year, with Chu attacked Song.",
  "s0800": "Yan Wu Gong first year, thirteenth year",
  "s0801": "572 Fourteenth year, Jian Wang died.",
  "s0802": "Lu Xiang Gong Wu first year, surrounded Song Peng Cheng.",
  "s0803": "Tenth year, Jin attacked us, made crown prince Guang hostage in Jin.",
  "s0804": "Jin Dao Gong first year, surrounded Song Peng Cheng.",
  "s0805": "Fifth year, nineteenth year, invaded Song, rescued Zheng.",
  "s0806": "Fourth year, Chu invaded us, took Quan Qiu.",
  "s0807": "Jin executed Yu Shi, returned our Peng Cheng.",
  "s0808": "Fifth year, surrounded Song Peng Cheng.",
  "s0809": "Twenty-seventh year, twentieth year, sixth year, thirteenth year, Jin attacked defeated us, troops stationed Wei on, Chu came rescue.",
  "s0810": "Second year, fourteenth year",
  "s0811": "571 Ling Wang first year, gave birth had beard.",
  "s0812": "Second year, assembled Jin walled Hu Lao.",
  "s0813": "Eleventh year, second year, led feudal lords attacked Zheng, walled Hu Lao.",
  "s0814": "Sixth year, twentieth year, fifth year, sixth year, twenty-eighth year, twenty-first year, seventh year, fourteenth year, Cheng Gong died.",
  "s0815": "Jin led feudal lords attacked us.",
  "s0816": "Third year, fifteenth year",
  "s0817": "570 Second year, third year, twelfth year, third year, Wei Jiang humiliated Yang Gan.",
  "s0818": "Seventh year, twenty-first year, sent Zi Chong attacked Wu, arrived Heng Shan.",
  "s0819": "Sent He Ji invaded Chen.",
  "s0820": "Sixth year, seventh year, twenty-ninth year, doubled Chu alliance, Chu invaded us.",
  "s0821": "Twenty-second year, eighth year, Zheng Xi Gong Min first year, fourth year, sixteenth year, Chu attacked us.",
  "s0822": "569 Third year, fourth year, duke went Jin.",
  "s0823": "Thirteenth year, fourth year, Wei Jiang persuaded pacified Rong, Di, Di court Jin.",
  "s0824": "Eighth year, twenty-second year, attacked Chen.",
  "s0825": "Seventh year, eighth year, thirtieth year, Chu attacked us.",
  "s0826": "Cheng Gong died.",
  "s0827": "Twenty-third year, ninth year, second year, fifth year, seventeenth year",
  "s0828": "568 Fourth year, fifth year, Ji Wen Zi died.",
  "s0829": "Fourteenth year, fifth year, ninth year, twenty-third year, attacked Chen.",
  "s0830": "Eighth year, ninth year, Chen Ai Gong Ruo first year, twenty-fourth year, tenth year, third year, sixth year, eighteenth year",
  "s0831": "567 Jiawu fifth year, sixth year, fifteenth year, sixth year, tenth year, twenty-fourth year, ninth year, tenth year, second year, twenty-fifth year, eleventh year, fourth year, seventh year, nineteenth year",
  "s0832": "566 Sixth year, seventh year, sixteenth year, seventh year, eleventh year, twenty-fifth year, surrounded Chen.",
  "s0833": "Tenth year, eleventh year, third year, Chu surrounded us, because duke fled returned.",
  "s0834": "Twenty-sixth year, twelfth year, fifth year, Zi Si sent bandit night killed Xi Gong, falsely with illness died attended feudal lords.",
  "s0835": "Eighth year, twentieth year",
  "s0836": "565 Seventh year, eighth year, duke went Jin.",
  "s0837": "Seventeenth year, eighth year, twelfth year, twenty-sixth year, attacked Zheng.",
  "s0838": "Eleventh year, twelfth year, fourth year, twenty-seventh year, Zheng invaded us.",
  "s0839": "Thirteenth year, Zheng Jian Gong Jia first year, Xi Gong son.",
  "s0840": "Ninth year, twenty-first year",
  "s0841": "564 Eighth year, ninth year, allied with Jin attacked Zheng, assembled river on, asked duke age twelve, can capped, capped in Wei.",
  "s0842": "Eighteenth year, allied with Jin attacked Zheng.",
  "s0843": "Ninth year, led Qi, Lu, Song, Wei, Cao attacked Zheng.",
  "s0844": "Qin attacked us.",
  "s0845": "Thirteenth year, attacked Jin, Chu as our aid.",
  "s0846": "Twenty-seventh year, attacked Zheng, army at Wu Cheng, for Qin.",
  "s0847": "Twelfth year, Jin led us attacked Zheng.",
  "s0848": "Thirteenth year, Jin led us attacked Zheng.",
  "s0849": "Army Cao whipped Gong favored concubine.",
  "s0850": "Fifth year, twenty-eighth year, fourteenth year, Jin led us attacked Zheng.",
  "s0851": "Second year, executed Zi Si.",
  "s0852": "Jin led feudal lords attacked us, we allied with them.",
  "s0853": "Chu angry, attacked us.",
  "s0854": "Tenth year, twenty-second year",
  "s0855": "563 Ninth year, Wang Shu fled Jin.",
  "s0856": "Tenth year, Chu, Zheng invaded our western borders.",
  "s0857": "Nineteenth year, commanded crown prince Guang, Gao Hou assembled feudal lords Zhong Li.",
  "s0858": "Tenth year, led feudal lords attacked Zheng.",
  "s0859": "Xun Ying attacked Qin.",
  "s0860": "Fourteenth year, Jin attacked us.",
  "s0861": "Twenty-eighth year, sent Zi Nang rescued Zheng.",
  "s0862": "Thirteenth year, Zheng attacked us, Wei came rescue.",
  "s0863": "Fourteenth year, rescued Song.",
  "s0864": "Sixth year, twenty-ninth year, fifteenth year, third year, Jin led feudal lords attacked us, Chu came rescue.",
  "s0865": "Zi Kong made chaos, Zi Chan attacked him, eleventh year, twenty-third year",
  "s0866": "562 Tenth year, eleventh year, three Huan divided into three armies, each led army.",
  "s0867": "Twentieth year, eleventh year, led feudal lords attacked Zheng, Qin defeated us Yue.",
  "s0868": "Duke said: 'I used Wei Jiang nine assembled feudal lords,' granted him music.",
  "s0869": "Fifteenth year, we sent Shu Zhang Bao attacked Jin rescued Zheng, defeated them Yue.",
  "s0870": "Twenty-ninth year, allied with Zheng attacked Song.",
  "s0871": "Fourteenth year, Chu, Zheng attacked us.",
  "s0872": "Fifteenth year, attacked Zheng.",
  "s0873": "Seventh year, thirtieth year, sixteenth year, fourth year, allied with Chu attacked Song, Jin led feudal lords attacked us, Qin came rescue.",
  "s0874": "Twelfth year, twenty-fourth year",
  "s0875": "561 Eleventh year, twelfth year, duke went Jin.",
  "s0876": "Twenty-first year, twelfth year, sixteenth year, thirtieth year, fifteenth year, sixteenth year, eighth year, thirty-first year, seventeenth year, fifth year, thirteenth year, twenty-fifth year, Shou Meng died.",
  "s0877": "560 Twelfth year, thirteenth year, twenty-second year, thirteenth year, seventeenth year, thirty-first year, Wu attacked us, defeated them.",
  "s0878": "Gong Wang died.",
  "s0879": "Sixteenth year, seventeenth year, ninth year, thirty-second year, eighteenth year, sixth year, fourteenth year, Wu Zhu Fan first year, Chu defeated us.",
  "s0880": "559 Thirteenth year, fourteenth year, solar eclipse.",
  "s0881": "Twenty-third year, Wei Xian Gong came fleeing.",
  "s0882": "Fourteenth year, led feudal lords grand masters attacked Qin, defeated Yu Lin.",
  "s0883": "Eighteenth year, Jin feudal lords grand masters attacked us, defeated Yu Lin.",
  "s0884": "Chu Kang Wang Zhao first year, Gong Wang crown prince fled Wu.",
  "s0885": "Seventeenth year, eighteenth year, Sun Wen Zi attacked duke, duke fled Qi, established Ding Gong younger brother Di.",
  "s0886": "Tenth year, thirty-third year, nineteenth year, seventh year, fifteenth year, second year, Ji Zi yielded position.",
  "s0887": "Chu attacked us.",
  "s0888": "558 Fourteenth year, fifteenth year, solar eclipse.",
  "s0889": "Qi attacked us.",
  "s0890": "Twenty-fourth year, attacked Lu.",
  "s0891": "Fifteenth year, Dao Gong died.",
  "s0892": "Nineteenth year, second year, eighteenth year, Wei Shang Gong Di first year, Ding Gong younger brother.",
  "s0893": "Eleventh year, thirty-fourth year, twentieth year, eighth year, sixteenth year, third year",
  "s0894": "557 Jiachen fifteenth year, sixteenth year, Qi attacked us.",
  "s0895": "Earthquake.",
  "s0896": "Qi again attacked our northern borders.",
  "s0897": "Twenty-fifth year, attacked Lu.",
  "s0898": "Sixteenth year, third year, nineteenth year, Wei attacked us."
}
