{
  "s0041": "King Xiao wished to make him the legitimate heir of Daliang.",
  "s0042": "The daughter of Shen Hou became Daliang's wife, and gave birth to a son named Cheng as the legitimate heir.",
  "s0043": "Shen Hou then spoke to King Xiao saying: 'In ancient times, my ancestor from Li Mountain became the wife of Xuxuan the Rong, and gave birth to Zhongyan. Because of kinship ties, she returned to Zhou and protected the western border. The western border was harmonious because of this.",
  "s0044": "Now I again married my daughter to Daliang, giving birth to the legitimate son Cheng.",
  "s0045": "Shen and Liang have intermarried twice; the western Rong all submit. This is for the sake of the king.'",
  "s0046": "Please consider this.'",
  "s0047": "Therefore King Xiao said: 'In ancient times, Bai Yi raised livestock for Shun; the livestock greatly multiplied, therefore he received land and was granted the surname Ying.",
  "s0048": "Now his descendants also breed horses for me; I will divide land as a fief.'",
  "s0049": "He enfeoffed them at Qin, to continue the Ying clan sacrifices, titled Qin Ying.",
  "s0050": "He also did not reject Shen Hou's daughter as Daliang's legitimate wife, to pacify the western Rong.",
  "s0051": "Cheng's son was Duke Zhuang of Qin.",
  "s0052": "Duke Zhuang's son was Duke Xiang of Qin.",
  "s0053": "Duke Xiang's son was Duke Wen of Qin.",
  "s0054": "Duke Wen's son was Duke Ning of Qin.",
  "s0055": "Duke Ning's son was Duke Wu of Qin.",
  "s0056": "Duke Wu's son was Duke De of Qin.",
  "s0057": "Duke De's son was Duke Xuan of Qin.",
  "s0058": "Duke Xuan's son was Duke Cheng of Qin.",
  "s0059": "Duke Cheng's son was Duke Mu of Qin.",
  "s0060": "Duke Mu's son was Duke Kang of Qin.",
  "s0061": "Duke Kang's son was Duke Gong of Qin.",
  "s0062": "Duke Gong's son was Duke Huan of Qin.",
  "s0063": "Duke Huan's son was Duke Jing of Qin.",
  "s0064": "Duke Jing's son was Duke Ai of Qin.",
  "s0065": "Duke Ai's son was Duke Hui of Qin.",
  "s0066": "Duke Hui's son was Duke Dao of Qin.",
  "s0067": "Duke Dao's son was Duke Ligong of Qin.",
  "s0068": "Duke Ligong's son was Duke Zao of Qin.",
  "s0069": "Duke Zao's son was Duke Huai of Qin.",
  "s0070": "Duke Huai's son was Duke Ling of Qin.",
  "s0071": "Duke Ling's son was Duke Jian of Qin.",
  "s0072": "Duke Jian's son was Duke Huiwen of Qin.",
  "s0073": "Duke Huiwen's son was Duke Wu of Qin.",
  "s0074": "Duke Wu's son was Duke Zhaoxiang of Qin.",
  "s0075": "Duke Zhaoxiang's son was King Xiaowen of Qin.",
  "s0076": "King Xiaowen's son was King Zhuangxiang of Qin.",
  "s0077": "King Zhuangxiang's son was Qin Shi Huang.",
  "s0078": "Qin Shi Huang's son was Qin Er Shi.",
  "s0079": "Duke Zhuang of Qin first year.",
  "s0080": "Duke Zhuang of Qin second year, the Qin people moved to their new capital."
}

