{
  "s0001": {
    "literal": "Emperor Hui was Gaozu's crown prince, his mother was Empress Lü.",
    "idiomatic": "Emperor Hui was Gaozu's crown prince, with Empress Lü as his mother."
  },
  "s0002": {
    "literal": "The Emperor was five years old when Gaozu first became Han King.",
    "idiomatic": "The emperor was five years old when Gaozu first became King of Han."
  },
  "s0003": {
    "literal": "In the second year, he was established as crown prince.",
    "idiomatic": "In the second year, he was established as crown prince."
  },
  "s0004": {
    "literal": "In the twelfth year, fourth month, Gaozu passed away.",
    "idiomatic": "In the twelfth year, fourth month, Gaozu passed away."
  },
  "s0005": {
    "literal": "Fifth month, Bingyin day, the crown prince ascended the imperial throne, honoring the Empress as Empress Dowager.",
    "idiomatic": "In the fifth month, on the day Bingyin, the crown prince ascended the imperial throne and honored the empress as Empress Dowager."
  },
  "s0006": {
    "literal": "He granted the people one level of nobility rank.",
    "idiomatic": "He granted the people one level of nobility rank."
  },
  "s0007": {
    "literal": "元年，冬十二月，帝晨出射。",
    "idiomatic": "First year, winter, twelfth month, the Emperor went out early in the morning to hunt with bow and arrow."
  },
  "s0008": {
    "literal": "上林平樂館。",
    "idiomatic": "At the Shanglin Park's Pinglao Pavilion."
  },
  "s0009": {
    "literal": "虎圈獸搏，帝射虎，車駕馳入，虎搏殿上侍中侍郎。",
    "idiomatic": "At the tiger enclosure where beasts fought, the Emperor shot a tiger; the imperial carriage charged in, and the tiger attacked the attendants and court gentlemen on the palace hall."
  },
  "s0010": {
    "literal": "侍中郎中馳入，射中虎。",
    "idiomatic": "The attendants and palace gentlemen charged in and shot the tiger."
  },
  "s0011": {
    "literal": "明年，春，淮陽守申屠嘉心諫上曰：「周天子重於民上，諸侯重於附庸，卿大夫重於士，士重於農夫，皆所以崇民也。",
    "idiomatic": "The next year, spring, the governor of Huaiyang, Shen Tu Jia, sincerely remonstrated with the Emperor, saying: 'The Zhou Son of Heaven honored the people above himself, the feudal lords honored their dependencies, the ministers honored the scholars, and the scholars honored the farmers—all this was to elevate the people."
  },
  "s0012": {
    "literal": "今陛下春秋方二十，親自射虎，駭不測之淵。",
    "idiomatic": "Now Your Majesty is only twenty years old and personally shot a tiger, startling yourself with unforeseen dangers."
  },
  "s0013": {
    "literal": "若有狂夫之流，虎搏執輿，陛下何以救之？",
    "idiomatic": "If there were a madman among them and the tiger attacked the imperial carriage, how would Your Majesty save yourself?"
  },
  "s0014": {
    "literal": "事即有緩急，奈何？",
    "idiomatic": "If matters became urgent, what then?"
  },
  "s0015": {
    "literal": "臣願陛下法太宗，御史大夫周昌謹慎，未嘗不稱善也。",
    "idiomatic": "I wish Your Majesty would follow Emperor Taizong and Grandee Secretary Zhou Chang, who was cautious and never failed to be commended."
  },
  "s0016": {
    "literal": "臣嘉誠不足以知陛下，必謂陛下不隆於孝文。」",
    "idiomatic": "This subject Jia is truly inadequate to advise Your Majesty, but I must say that Your Majesty does not honor Emperor Xiaowen as much.'"
  },
  "s0017": {
    "literal": "上曰：「吾惟之。」",
    "idiomatic": "The Emperor said, 'I will consider this.'"
  },
  "s0018": {
    "literal": "壬午，赦天下。",
    "idiomatic": "On the day Renwu, he granted amnesty to the world."
  },
  "s0019": {
    "literal": "二年，春，正月，乙卯，地震，羌道、武都道山崩。",
    "idiomatic": "Second year, spring, first month, day Yimao, there was an earthquake; mountains collapsed in Qiang Prefecture and Wudu Prefecture."
  },
  "s0020": {
    "literal": "夏，旱。",
    "idiomatic": "Summer, drought."
  },
  "s0021": {
    "literal": "秋，九月，蝗。",
    "idiomatic": "Autumn, ninth month, locusts."
  },
  "s0022": {
    "literal": "三年，春，陇西地震。",
    "idiomatic": "Third year, spring, earthquake in Longxi."
  },
  "s0023": {
    "literal": "夏六月，丁未，赦。",
    "idiomatic": "Summer, sixth month, day Dingwei, amnesty."
  },
  "s0024": {
    "literal": "秋七月，辛亥，丞相臣平薨。",
    "idiomatic": "Autumn, seventh month, day Xinhai, Chancellor Chen Ping passed away."
  },
  "s0025": {
    "literal": "四年，冬十月，丙寅，立皇后張氏。",
    "idiomatic": "Fourth year, winter, tenth month, day Bingyin, he established Empress Zhang."
  },
  "s0026": {
    "literal": "五年，春，正月，甲子，帝崩于未央宮。",
    "idiomatic": "Fifth year, spring, first month, day Jiazi, the Emperor passed away in Weiyang Palace."
  },
  "s0027": {
    "literal": "時年二十四。",
    "idiomatic": "He was twenty-four years old at the time."
  },
  "s0028": {
    "literal": "葬安陵。",
    "idiomatic": "He was buried at Anling."
  },
  "s0029": {
    "literal": "贊曰：孝惠皇帝，高后稱制，政不出房戶，天下晏然。",
    "idiomatic": "Appraisal: Emperor Hui was filial; Empress Dowager Lü held the reins of government, but politics did not emerge from the women's quarters, and the world was peaceful."
  },
  "s0030": {
    "literal": "百姓務本，衣食滋殖。",
    "idiomatic": "The common people attended to fundamentals, and clothing and food increased abundantly."
  },
  "s0031": {
    "literal": "亡為兵革之變，民間無狗吠之警。",
    "idiomatic": "There were no changes of armor and weapons; among the people there were no alarms of barking dogs."
  },
  "s0032": {
    "literal": "天下晏然，不獨為惠，亦呂氏之力也。",
    "idiomatic": "The world was peaceful, not only due to Hui's virtue, but also the strength of the Lü clan."
  },
  "s0033": {
    "literal": "高后既立諸呂為三王，諸大夫躊躇不能有所發明。",
    "idiomatic": "After Empress Dowager Lü established the various Lü as three kings, the various ministers hesitated and could not initiate any action."
  },
  "s0034": {
    "literal": "以故孝惠崩，呂后為政，欲以呂氏為重臣。",
    "idiomatic": "Therefore, when Emperor Hui passed away and Empress Lü governed, she wished to make the Lü clan important ministers."
  },
  "s0035": {
    "literal": "終臣放弑，禍稔蕭牆。",
    "idiomatic": "In the end, subjects were banished and assassinated, calamity ripening within the inner walls."
  },
  "s0036": {
    "literal": "孝惠本好文學，然亦以不能持大政。",
    "idiomatic": "Emperor Hui was originally fond of literature, but also because he could not manage great governance."
  },
  "s0037": {
    "literal": "呂后攝政，王諸呂，權重於帝室。",
    "idiomatic": "Empress Lü took charge of government, enfeoffed the various Lü, and their power grew heavier than the imperial house."
  },
  "s0038": {
    "literal": "及呂后崩，宗室諸王共誅之。",
    "idiomatic": "When Empress Lü passed away, the imperial clansmen and various kings together executed them."
  },
  "s0039": {
    "literal": "豈非天邪？",
    "idiomatic": "Was this not heaven's will?"
  },
  "s0040": {
    "literal": "初，高祖不修文学，而性明達，好謀，能聽，自監門戍卒，史書，騎士，其所與游處，見之如舊。",
    "idiomatic": "Initially, Gaozu did not cultivate literature, but his nature was clear and understanding, fond of planning, able to listen; from palace gate guards, clerks, scribes, and cavalrymen, those he associated with, he saw them as old friends."
  },
  "s0041": {
    "literal": "及為帝王，天下無不欲陳事而見之。",
    "idiomatic": "When he became emperor and king, everyone in the world wished to present matters and meet with him."
  },
  "s0042": {
    "literal": "然高祖待人無顧藉，雖賤如己，不害其親厚。",
    "idiomatic": "Yet Gaozu treated people without reservations; even those as lowly as himself, he did not harm their close friendship."
  },
  "s0043": {
    "literal": "群臣非素富貴，無不敬而愛之。",
    "idiomatic": "The ministers who were not originally wealthy and noble, none failed to respect and love him."
  },
  "s0044": {
    "literal": "至於布衣冠軍之將，馳驅從之，撫之若子弟，故皆樂為之死。",
    "idiomatic": "As for the generals who were commoners and champions, they galloped following him; he caressed them like sons and younger brothers, so all were happy to die for him."
  },
  "s0045": {
    "literal": "至孝惠帝，恭讓自循，禮義不敢有所縱逸。",
    "idiomatic": "As for Emperor Hui, he was respectful and yielding, following proper conduct; in ritual and righteousness he dared not be at all indulgent or unrestrained."
  },
  "s0046": {
    "literal": "大臣親信心，無不愛而敬之。",
    "idiomatic": "The great ministers trusted and were close to him, none failed to love and respect him."
  },
  "s0047": {
    "literal": "百姓聞其風聲，爭自以為不如孝惠帝。",
    "idiomatic": "The common people heard of his reputation and competed to consider themselves inferior to Emperor Hui."
  },
  "s0048": {
    "literal": "而呂太后女主，天下無賢臣，宗室諸王王侯莫能為變。",
    "idiomatic": "But Empress Lü was the female ruler; the world had no worthy ministers, and the imperial clansmen and various kings and marquises could not create change."
  },
  "s0049": {
    "literal": "蓋所以禍至於此也。",
    "idiomatic": "This was how calamity came to this point."
  },
  "s0050": {
    "literal": "初，孝惠為太子，呂后為皇后。",
    "idiomatic": "Initially, when Hui was crown prince, Lü was empress."
  },
  "s0051": {
    "literal": "生魯元公主，後生孝惠帝。",
    "idiomatic": "She gave birth to Princess Lu Yuan, and later gave birth to Emperor Hui."
  },
  "s0052": {
    "literal": "孝惠元年，皇后無子。",
    "idiomatic": "In Emperor Hui's first year, the Empress had no children."
  },
  "s0053": {
    "literal": "秋，立皇后張氏。",
    "idiomatic": "Autumn, he established Empress Zhang."
  },
  "s0054": {
    "literal": "四年，冬十月，皇后張氏薨。",
    "idiomatic": "Fourth year, winter, tenth month, Empress Zhang passed away."
  },
  "s0055": {
    "literal": "五年，春，正月，丁亥，立皇后王氏。",
    "idiomatic": "Fifth year, spring, first month, day Dinghai, he established Empress Wang."
  },
  "s0056": {
    "literal": "皇后王氏，生太子。",
    "idiomatic": "Empress Wang gave birth to the crown prince."
  },
  "s0057": {
    "literal": "七年，冬，孝惠帝崩。",
    "idiomatic": "Seventh year, winter, Emperor Hui passed away."
  },
  "s0058": {
    "literal": "呂太后立皇后子為帝，名為弘。",
    "idiomatic": "Empress Lü established the Empress's son as emperor, naming him Hong."
  },
  "s0059": {
    "literal": "後崩，未葬，而諸呂欲為亂。",
    "idiomatic": "Later she passed away, not yet buried, and the various Lü wished to create disorder."
  },
  "s0060": {
    "literal": "丞相陳平，太尉周勃，大將軍灌嬰，朱虛侯劉章等謀誅呂氏。",
    "idiomatic": "Chancellor Chen Ping, Grand Commandant Zhou Bo, Grand General Guan Ying, Marquis of Zhu Xu Liu Zhang and others plotted to execute the Lü clan."
  },
  "s0061": {
    "literal": "初，孝惠崩，葬未央宮。",
    "idiomatic": "Initially, when Emperor Hui passed away, he was buried at Weiyang Palace."
  },
  "s0062": {
    "literal": "呂后哭而泣，不食，曰：「此豈人所為！",
    "idiomatic": "Empress Lü wept and cried, not eating, saying: 'How could a person do this!"
  },
  "s0063": {
    "literal": "顧帝竟以天下賂呂產邪？」",
    "idiomatic": "Did the Emperor ultimately bribe Lü Chan with the world?'"
  },
  "s0064": {
    "literal": "未葬，呂后崩。",
    "idiomatic": "Before burial, Empress Lü passed away."
  },
  "s0065": {
    "literal": "呂產、呂祿相謂曰：「呂氏之王，皇帝之約也。",
    "idiomatic": "Lü Chan and Lü Lu said to each other: 'The enfeoffment of the Lü clan was the emperor's agreement."
  },
  "s0066": {
    "literal": "今帝亡，雖少，孰敢亂者？」",
    "idiomatic": "Now the emperor is gone; though young, who would dare create disorder?'"
  }
}
