{
  "s0050": "The Marquis of Lai came to attack, contending with him for Yingqiu.",
  "s0248": "Ge Ying gave birth to Duke Zhao Pan;",
  "s0249": "Mi Ji gave birth to Duke Yi Shang Ren;",
  "s0250": "Song Hua Zi gave birth to Prince Yong.",
  "s0251": "Duke Huan and Guan Zhong entrusted Duke Xiao to Duke Xiang of Song, making him heir apparent.",
  "s0252": "Yong Wu was favored by Wei Gong Ji, and through the eunuch Shu Dao made rich offerings to Duke Huan, also gaining favor, so Duke Huan promised to establish Wu Gui.",
  "s0253": "When Guan Zhong died, the five princes all sought to be established.",
  "s0254": "Winter tenth month yi hai day, Duke Huan of Qi passed away.",
  "s0255": "Yi Ya entered, and together with Shu Dao used the inner favorites to kill the assembled officials, establishing Prince Wu Gui as ruler.",
  "s0256": "Crown Prince Zhao fled to Song.",
  "s0257": "When Duke Huan fell ill, the five princes each formed factions contending for establishment.",
  "s0258": "When Duke Huan died, they attacked each other, so the palace was empty, no one daring to coffin him.",
  "s0259": "Duke Huan's corpse lay on the bed sixty-seven days, corpse worms crawling out the door.",
  "s0260": "Twelfth month yi hai day, Wu Gui was established, then coffined and proceeded.",
  "s0261": "Xin si night, dressed and encoffined.",
  "s0262": "Duke Huan had more than ten sons, but those who later were established as the five: Wu Gui established three months then died, no posthumous name;",
  "s0263": "next Duke Xiao;",
  "s0264": "next Duke Zhao;",
  "s0265": "next Duke Yi;",
  "s0266": "next Duke Hui.",
  "s0267": "Duke Xiao year 1 third month, Duke Xiang of Song led the feudal lords' troops to send Crown Prince Zhao of Qi and attack Qi.",
  "s0268": "The people of Qi were afraid, killed their ruler Wu Gui.",
  "s0269": "The people of Qi were about to establish Crown Prince Zhao, but the four princes' followers attacked the crown prince, the crown prince fled to Song, Song then fought with Qi's four princes.",
  "s0270": "Fifth month, Song defeated the four princes' army and established Crown Prince Zhao, this was Duke Xiao of Qi.",
  "s0271": "Song came to attack because Duke Huan and Guan Zhong had entrusted him as crown prince.",
  "s0272": "Because of the disorder, eighth month then buried Duke Huan of Qi.",
  "s0273": "Year 6 spring, Qi attacked Song, because they did not ally with Qi.",
  "s0274": "Summer, Duke Xiang of Song passed away.",
  "s0275": "Year 7, Duke Wen of Jin was established.",
  "s0276": "Year 10, Duke Xiao passed away, Duke Xiao's younger brother Pan used Wei prince Kai Fang to kill Duke Xiao's son and establish Pan, this was Duke Zhao.",
  "s0277": "Duke Zhao was Duke Huan's son, his mother was Ge Ying.",
  "s0278": "Duke Zhao year 1, Duke Wen of Jin defeated Chu at Chengpu, and assembled the feudal lords at Jiantu, paid court to Zhou, the Son of Heaven caused Jin to be called hegemon.",
  "s0279": "Year 6, the Di invaded Qi.",
  "s0280": "Duke Wen of Jin passed away.",
  "s0281": "Qin troops were defeated at Xiao.",
  "s0282": "Year 12, Duke Mu of Qin passed away.",
  "s0283": "Year 19 fifth month, Duke Zhao passed away, his son She established as ruler of Qi.",
  "s0284": "She's mother had no favor with Duke Zhao, the state people did not fear him.",
  "s0285": "Duke Zhao's younger brother Shang Ren, because Duke Huan's death had contended for establishment but failed, secretly associated with worthy scholars, attached to and loved the common people, the common people were pleased.",
  "s0286": "When Duke Zhao died and his son She was established, weak and isolated, in the tenth month at the tomb they assassinated Lord She of Qi, and Shang Ren established himself, this was Duke Yi.",
  "s0287": "Duke Yi was Duke Huan's son, his mother was Mi Ji.",
  "s0288": "Duke Yi year 4 spring, initially, when Duke Yi was a prince, he hunted with Bing Rong's father, contended for the catch and did not win, when he ascended the throne, he cut off Bing Rong's father's feet, and made Bing Rong his groom.",
  "s0289": "Yong Zhi's wife was beautiful, the duke took her into the palace, made Yong Zhi his chariot driver.",
  "s0290": "Fifth month, Duke Yi toured Shen Pool, the two bathed, played.",
  "s0291": "Zhi said: 'Son of the severed feet!'",
  "s0292": "Rong said: 'Wife-stealer!'",
  "s0293": "Both resented these words.",
  "s0294": "They plotted to tour with the duke in the bamboo grove, the two assassinated Duke Yi on his chariot, abandoned him in the bamboo and fled.",
  "s0295": "Duke Yi's establishment was arrogant, the people did not attach.",
  "s0296": "The people of Qi deposed his son and welcomed Prince Yuan from Wei, established him, this was Duke Hui.",
  "s0297": "Duke Hui was Duke Huan's son.",
  "s0298": "His mother was a Wei woman, called Shao Wei Ji, avoided Qi's disorder, so was in Wei.",
  "s0299": "Duke Hui year 2, the Chang Di came, Prince Cheng Fu attacked and killed him, buried him at the north gate.",
  "s0300": "Zhao Chuan of Jin assassinated his lord Duke Ling.",
  "s0301": "Year 10, Duke Hui passed away, his son Duke Qing Wu Ye established.",
  "s0302": "Initially, Cui Zhu had favor with Duke Hui, Duke Hui died, Gao and Guo feared his oppression, drove him out, Cui Zhu fled to Wei.",
  "s0303": "Duke Qing year 1, King Zhuang of Chu was strong, attacked Chen;",
  "s0304": "Year 2, surrounded Zheng, the Lord of Zheng surrendered, then restored the Lord of Zheng's state.",
  "s0305": "Year 6 spring, Jin sent Xi Ke to Qi, Qi made the lady observe from behind curtains.",
  "s0306": "Xi Ke ascended, the lady laughed at him.",
  "s0307": "Xi Ke said: 'If not repaid, will not cross the river again!'",
  "s0308": "Returning, requested to attack Qi, the Jin lord did not permit.",
  "s0309": "Qi envoy arrived at Jin, Xi Ke seized four Qi envoys within the river, killed them.",
  "s0310": "Year 8.",
  "s0311": "Jin attacked Qi, Qi sent Prince Qiang as hostage to Jin, Jin troops withdrew.",
  "s0312": "Year 10 spring, Qi attacked Lu and Wei.",
  "s0313": "Lu and Wei grandees went to Jin to request troops, all through Xi Ke.",
  "s0314": "Jin made Xi Ke lead 800 chariots as central army commander, Shi Xie command upper army, Luan Shu command lower army, to save Lu and Wei, attack Qi.",
  "s0315": "Sixth month ren shen day, joined battle with Qi lord's troops below Mi Ji.",
  "s0316": "Gui you day, arrayed at Long, Pang Chou Fu as Duke Qing's right.",
  "s0317": "Duke Qing said: 'Charge them, break the Jin army and have breakfast.'",
  "s0318": "Shot and wounded Xi Ke, blood flowing to his shoes.",
  "s0319": "Ke wished to return to the wall, his driver said: 'I first entered, twice wounded, dared not speak of illness, feared to frighten the troops, wish you endure it.'",
  "s0320": "Then resumed battle.",
  "s0321": "In battle, Qi urgent, Chou Fu feared the Qi lord would be captured, so exchanged positions, Duke Qing became right, chariot caught on wood and stopped.",
  "s0322": "Jin's young commander Han Jue lay in ambush before the Qi lord's chariot, said 'My lord sent me to save Lu and Wei', mocked him.",
  "s0323": "Chou Fu made Duke Qing descend to get drink, thus he escaped, broke away, entered his army.",
  "s0324": "Jin Xi Ke wished to kill Chou Fu.",
  "s0325": "Chou Fu said: 'Substitute death for lord and be mutilated, then later ministers will have no loyal to their lords.'",
  "s0326": "Ke released him, Chou Fu then escaped and returned to Qi.",
  "s0327": "Then Jin army pursued Qi to Ma Ling.",
  "s0328": "Qi lord requested to apologize with precious vessels, not listened to;",
  "s0329": "must obtain the one who laughed at Ke, Xiao Tong Shu Zi, make Qi cede eastern fields.",
  "s0330": "Replied: 'Shu Zi is the Qi lord's mother.",
  "s0331": "Qi lord's mother is also like Jin lord's mother, how will you place her?",
  "s0332": "Moreover you attack with righteousness but follow with violence, how can this be?'",
  "s0333": "Then permitted, commanded to return Lu and Wei's invaded lands.",
  "s0334": "Year 11, Jin first established six ministers, rewarded An's merit.",
  "s0335": "Duke Qing of Qi paid court to Jin, wished to honor and make King Duke Jing of Jin, Duke Jing of Jin dared not accept, then returned.",
  "s0336": "Returning, Duke Qing relaxed the parks and preserves, lightened taxes and levies, relieved the orphaned and inquired of the ill, emptied granaries to save the people, the people also greatly pleased.",
  "s0337": "Thickly ritualed the feudal lords.",
  "s0338": "Finally Duke Qing passed away, the common people attached, feudal lords did not violate.",
  "s0339": "Year 17, Duke Qing passed away, his son Duke Ling Huan established.",
  "s0340": "Duke Ling year 9, Luan Shu of Jin assassinated his lord Duke Li.",
  "s0341": "Year 10, Duke Dao of Jin attacked Qi, Qi sent Prince Guang as hostage to Jin.",
  "s0342": "Year 19, established Zi Guang as crown prince, Gao Hou tutored him, commanded to assemble the feudal lords to ally at Zhongli.",
  "s0343": "Year 27, Jin sent Zhonghang Xian Zi to attack Qi.",
  "s0344": "Qi army defeated, Duke Ling fled into Linzi.",
  "s0345": "Yan Ying stopped Duke Ling, Duke Ling did not follow.",
  "s0346": "Said: 'Lord also has no courage!'",
  "s0347": "Jin troops then surrounded Linzi, Linzi city defended dared not go out, Jin burned the outer walls and left.",
  "s0348": "Year 28, initially, Duke Ling took a Lu woman, gave birth to Zi Guang, established as crown prince.",
  "s0349": "Zhong Ji, Rong Ji.",
  "s0350": "Rong Ji was favored, Zhong Ji gave birth to Zi Ya, entrusted to Rong Ji.",
  "s0351": "Rong Ji requested to establish as crown prince, the duke permitted it.",
  "s0352": "Zhong Ji said: 'Cannot.",
  "s0353": "Guang's establishment is listed among the feudal lords, now without cause depose him, lord will certainly regret it.'",
  "s0354": "The duke said: 'In my hands.'",
  "s0355": "Then deposed Crown Prince Guang, made Gao Hou tutor Ya as crown prince.",
  "s0356": "Duke Ling fell ill, Cui Zhu welcomed former crown prince Guang and established him, this was Duke Zhuang.",
  "s0357": "Duke Zhuang killed Rong Ji.",
  "s0358": "Fifth month ren chen day, Duke Ling passed away, Duke Zhuang ascended the throne, seized crown prince Ya at Gou Dou Hill, killed him.",
  "s0359": "Eighth month, Cui Zhu killed Gao Hou.",
  "s0360": "Jin heard of Qi's disorder, attacked Qi, reached Gao Tang.",
  "s0361": "Duke Zhuang year 3, Jin grandee Luan Ying fled to Qi, Duke Zhuang treated him thickly as guest.",
  "s0362": "Yan Ying, Tian Wen Zi advised, the duke did not listen.",
  "s0363": "Year 4, Duke Zhuang of Qi made Luan Ying secretly enter Jin Qu Wo as internal support, sent troops to follow, ascended Taihang, entered Meng Gate.",
  "s0364": "Luan Ying defeated, Qi troops returned, took Zhao Ge.",
  "s0365": "Year 6, initially, Tang Gong's wife was beautiful, Tang Gong died, Cui Zhu took her.",
  "s0366": "Duke Zhuang communicated with her, frequently went to Cui residence, gave Cui Zhu's hat to someone.",
  "s0367": "Attendant said: 'Cannot.'",
  "s0368": "Cui Zhu angered, because of attacking Jin, wished to conspire with Jin to raid Qi but could not find opportunity.",
  "s0369": "Duke Zhuang once flogged eunuch Jia Ju, Jia Ju again served, for Cui Zhu spied on the duke to repay resentment.",
  "s0370": "Fifth month, Ju lord paid court to Qi, Qi feasted him on jia xu day.",
  "s0371": "Cui Zhu claimed illness did not attend affairs.",
  "s0372": "Yi hai day, duke inquired of Cui Zhu's illness, then followed Cui Zhu's wife.",
  "s0373": "Cui Zhu's wife entered the chamber, with Cui Zhu closed the door and did not come out, duke leaned on pillar and sang.",
  "s0374": "Eunuch Jia Ju blocked the duke's following officials from entering, closed the door, Cui Zhu's followers held weapons and rose from within.",
  "s0375": "Duke ascended platform and requested release, not permitted;",
  "s0376": "requested alliance, not permitted;",
  "s0377": "requested to die by suicide in the temple, not permitted.",
  "s0378": "All said: 'Your servant Zhu is ill, cannot listen to commands.",
  "s0379": "Close to the duke's palace.",
  "s0380": "Attendant ministers rush to those with lewdness, do not know two commands.'",
  "s0381": "Duke climbed wall, shot hit duke's thigh, duke fell back, then assassinated him.",
  "s0382": "Yan Ying stood at Cui Zhu's gate, said: 'If lord dies for the altars of soil and grain then die for it, if flees for the altars of soil and grain then flee for it.",
  "s0383": "If dies for oneself or flees for oneself, not being privately intimate, who dares undertake it!'",
  "s0384": "Gate opened and entered, pillowed the duke's corpse and wept, three times leaped out.",
  "s0385": "People told Cui Zhu: 'Must kill him.'",
  "s0386": "Cui Zhu said: 'The people's hope, release him to gain the people.'",
  "s0388": "Ding chou day, Cui Zhu established Duke Zhuang's different mother younger brother Chu Jiu, this was Duke Jing.",
  "s0389": "Duke Jing's mother was the daughter of Shu Sun Xuan Bo of Lu.",
  "s0390": "Duke Jing established, made Cui Zhu right chancellor, Qing Feng left chancellor.",
  "s0391": "Two chancellors feared disorder would arise, then allied with the state people saying: 'Those not with Cui Qing die!'",
  "s0392": "Yan Zi gazed heavenward saying: 'Ying follows only those loyal to lord and beneficial to altars of soil and grain!'",
  "s0393": "Would not ally.",
  "s0394": "Qing Feng wished to kill Yan Zi, Cui Zhu said: 'Loyal minister, release him.'",
  "s0395": "Qi grand historian wrote 'Cui Zhu assassinated Duke Zhuang', Cui Zhu killed him.",
  "s0396": "His younger brother again wrote, Cui Zhu again killed him.",
  "s0397": "Youngest younger brother again wrote, Cui Zhu then released him.",
  "s0398": "Duke Jing year 1, initially, Cui Zhu gave birth to Zi Cheng and Qiang, his mother died, took Dong Guo woman, gave birth to Ming.",
  "s0399": "Dong Guo woman made her former husband Zi Wu Jiu and her younger brother Yan mutually support Cui clan.",
  "s0400": "Cheng had crime, two chancellors urgently punished him, established Ming as crown prince.",
  "s0401": "Cheng requested to retire in Cui, Cui Zhu permitted it, two chancellors did not listen, said: 'Cui is ancestral city, cannot.'",
  "s0402": "Cheng and Qiang angered, told Qing Feng.",
  "s0403": "Qing Feng had enmity with Cui Zhu, wished his defeat.",
  "s0404": "Cheng and Qiang killed Wu Jiu and Yan in Cui Zhu's house, household all fled and scattered.",
  "s0405": "Cui Zhu angered, had no people, made one eunuch drive, saw Qing Feng.",
  "s0406": "Qing Feng said: 'Please for you execute them.'",
  "s0407": "Made Cui Zhu's enemy Lu Pu Bi attack Cui clan, killed Cheng and Qiang, completely extinguished Cui clan, Cui Zhu's wife committed suicide.",
  "s0408": "Cui Zhu had no return, also committed suicide.",
  "s0409": "Qing Feng became chancellor, monopolized power.",
  "s0410": "Year 3 tenth month, Qing Feng went hunting.",
  "s0411": "Initially, Qing Feng having killed Cui Zhu, became increasingly arrogant, addicted to wine and fond of hunting, did not listen to government commands.",
  "s0412": "Qing She used government, already had internal enmity.",
  "s0413": "Tian Wen Zi told Jian Zi: 'Disorder will arise.'",
  "s0414": "Tian, Bao, Gao, Luan clans mutually plotted against Qing clan.",
  "s0415": "Qing She mobilized armor surrounding Qing Feng's palace, four families' followers together attacked and broke it.",
  "s0416": "Qing Feng returned, could not enter, fled to Lu.",
  "s0417": "Qi people rebuked Lu, Feng fled to Wu.",
  "s0418": "Wu gave him Zhu Fang, gathered his clan and dwelt there, richer than in Qi.",
  "s0419": "That autumn, Qi people moved and buried Duke Zhuang, mutilated Cui Zhu's corpse in the market to please the masses.",
  "s0420": "Year 9, Duke Jing sent Yan Ying to Jin, privately spoke with Shu Xiang saying: 'Qi governance finally returns to Tian clan.",
  "s0421": "Tian clan though without great virtue, with public power for private use, has virtue for the people, people love them.'",
  "s0422": "Year 12, duke went to Jin, saw Duke Ping, wished to attack Yan together.",
  "s0423": "Year 18, duke again went to Jin, saw Duke Zhao.",
  "s0424": "Year 26, hunted in Lu suburbs, thus entered Lu, with Yan Ying together inquired of Lu rites.",
  "s0425": "Year 31, Duke Zhao of Lu avoided Ji clan difficulty, fled to Qi.",
  "s0426": "Qi wished to seal him with thousand settlements, Zi Jia stopped Duke Zhao, Duke Zhao then requested Qi attack Lu, take Yun to house Duke Zhao.",
  "s0427": "Year 32, comet appeared.",
  "s0428": "Duke Jing sat in Bai Resting Hall, sighed saying: 'Majestic!",
  "s0429": "Who has this?'",
  "s0430": "Assembled ministers all wept, Yan Zi laughed, duke angered.",
  "s0431": "Yan Zi said: 'Servant laughs assembled ministers flatter excessively.'",
  "s0432": "Duke Jing said: 'Comet appears northeast, should be Qi's region, I consider it worry.'",
  "s0433": "Yan Zi said: 'Lord has high towers deep pools, taxes and levies as if cannot obtain, punishments and penalties fear cannot overcome, ominous stars will appear, why fear comet?'",
  "s0434": "Duke said: 'Can exorcise it?'",
  "s0435": "Yan Zi said: 'If spirits can be prayed to come, also can be exorcised to go.",
  "s0436": "Common people suffer resentment in ten thousands, but lord commands one person to exorcise it, how can overcome the multitudes' mouths?'",
  "s0437": "At this time Duke Jing was fond of repairing palaces, gathering dogs and horses, extravagant, heavy taxes severe punishments, therefore Yan Zi advised with this.",
  "s0438": "Year 42, Wu King He Lu attacked Chu, entered Ying.",
  "s0439": "Year 47, Lu Yang Hu attacked his lord, did not win, fled to Qi, requested Qi attack Lu.",
  "s0440": "Bao Zi advised Duke Jing, then imprisoned Yang Hu.",
  "s0441": "Yang Hu escaped, fled to Jin.",
  "s0442": "Year 48, good meeting with Duke Ding of Lu at Jia Gu.",
  "s0443": "Li Chu said: 'Kong Qiu understands rites but is cowardly, please command Lai people to perform music, thus seize Lu lord, can achieve ambition.'",
  "s0444": "Duke Jing harmed Kong Qiu assisting Lu, feared his hegemony, therefore followed Li Chu's plan.",
  "s0445": "When meeting, advanced Lai music, Kong Qiu ascended the stairs, made officials seize Lai people and behead them, with rites yielded to Duke Jing.",
  "s0446": "Duke Jing ashamed, then returned Lu's invaded lands to apologize, and withdrew.",
  "s0447": "This year, Yan Ying passed away.",
  "s0448": "Year 55, Fan and Zhonghang rebelled against their lord in Jin, Jin attacked urgently, came requesting grain.",
  "s0449": "Tian Qi wished to cause disorder, planted faction among rebellious ministers, persuaded Duke Jing saying: 'Fan and Zhonghang repeatedly have virtue toward Qi, cannot not save.'",
  "s0450": "Then made Qi save and transport grain to them.",
  "s0451": "Year 58 summer, Duke Jing's wife Yan Ji's suitable son died.",
  "s0452": "Duke Jing's favored concubine Rui Ji gave birth to Zi Tu, Tu young, his mother base, without conduct, various grandees feared he would succeed, then said wished to select among sons the eldest worthy one as crown prince.",
  "s0453": "Duke Jing old, disliked speaking of succession matters, moreover loved Tu's mother, wished to establish him, dreaded speaking it, then told various grandees: 'For pleasure only, state what worry of lacking lord?'",
  "s0454": "Autumn, Duke Jing ill, commanded Guo Hui Zi, Gao Zhao Zi establish young son Tu as crown prince, drove out assembled princes, moved them to Lai.",
  "s0455": "Duke Jing passed away, crown prince Tu established, this was Yan Ru Zi.",
  "s0456": "Winter, not yet buried, assembled princes fearing execution, all fled out.",
  "s0457": "Tu's various different mother elder brothers Prince Shou, Ju, Qian fled to Wei, Prince Ju, Yang Sheng fled to Lu.",
  "s0458": "Lai people sang: 'Jing lord died not participate in burial, three armies' affairs not participate in planning, master master, why follow him?'",
  "s0460": "Yan Ru Zi year 1 spring, Tian Qi falsely served Gao and Guo, every morning, Qi drove chariot, said: 'You obtained lord, grandees all endanger themselves, wish to plot disorder.'",
  "s0461": "Also told various grandees: 'Gao Zhao Zi is fearsome, before not yet issued, first him.'",
  "s0462": "Grandees followed it.",
  "s0463": "Sixth month, Tian Qi, Bao Mu then with grandees entered duke's palace with troops, attacked Gao Zhao Zi.",
  "s0464": "Zhao Zi heard it, with Guo Hui Zi saved duke.",
  "s0465": "Duke's army defeated, Tian Qi's followers pursued them, Guo Hui Zi fled to Ju, then turned back killed Gao Zhao Zi.",
  "s0466": "Yan Yu fled to Lu.",
  "s0467": "Eighth month, Qi carried Yi Zi.",
  "s0468": "Tian Qi defeated two chancellors, then made people go to Lu summon Prince Yang Sheng.",
  "s0469": "Yang Sheng arrived in Qi, secretly hid in Tian Qi's house.",
  "s0470": "Tenth month wu zi day, Tian Qi requested various grandees: 'Chang's mother has fish and beans sacrifice, fortunate to come assemble and drink.'",
  "s0471": "Assembled drinking, Tian Qi filled Yang Sheng in bag, placed in seat center, opened bag brought out Yang Sheng, said: 'This is Qi lord!'",
  "s0472": "Grandees all prostrated and greeted.",
  "s0473": "About to ally with grandees and establish him, Bao Mu drunk, Qi slandered grandees saying: 'I and Bao Mu plotted together to establish Yang Sheng.'",
  "s0474": "Bao Mu angered saying: 'You forget Duke Jing's command?'",
  "s0475": "Various grandees looked at each other wishing to regret, Yang Sheng forward, knocked head saying: 'Can then establish him, cannot then stop.'",
  "s0476": "Bao Mu feared disaster would arise, then again said: 'All Duke Jing's sons, why cannot!'",
  "s0477": "Then allied with them, established Yang Sheng, this was Duke Dao.",
  "s0478": "Duke Dao entered palace, made people move Yan Ru Zi to Dai, killed him under the tent, and drove out Ru Zi's mother Rui Zi.",
  "s0479": "Rui Zi formerly base and Ru Zi young, therefore without authority, state people despised him.",
  "s0480": "Duke Dao year 1, Qi attacked Lu, took Chan, Chan.",
  "s0481": "Initially, Yang Sheng fled to Lu, Ji Kang Zi married his younger sister to him.",
  "s0482": "When returned and ascended throne, made welcome her.",
  "s0483": "Ji Ji communicated with Ji Fang Hou, spoke their affair, Lu dared not give, therefore Qi attacked Lu, finally welcomed Ji Ji.",
  "s0484": "Ji Ji favored, Qi again returned Lu's invaded lands.",
  "s0485": "Bao Zi had enmity with Duke Dao, not good.",
  "s0486": "Year 4, Wu and Lu attacked Qi southern border.",
  "s0487": "Bao Zi assassinated Duke Dao, reported to Wu.",
  "s0488": "Wu King Fu Chai wept at army gate outside three days, about to follow sea enter punish Qi.",
  "s0489": "Qi people defeated them, Wu army then left.",
  "s0490": "Jin Zhao Meng attacked Qi, reached Lai and left.",
  "s0491": "Qi people together established Duke Dao's son Ren, this was Duke Jian.",
  "s0492": "Duke Jian year 4 spring, initially, Duke Jian with father Yang Sheng both in Lu, Jian Zhi had favor.",
  "s0493": "When ascended throne, made govern affairs.",
  "s0494": "Tian Cheng Zi dreaded him, frequently glanced at court.",
  "s0495": "Yu Yang spoke to Duke Jian: 'Tian and Jian cannot be together, lord choose one.'",
  "s0496": "Did not listen.",
  "s0497": "Zi Wo evening, Tian Ni killed person, met him, then captured and entered.",
  "s0498": "Tian clan just harmonious, made prisoner ill and sent guard prisoner wine, drunk and killed guard, obtained escape.",
  "s0499": "Zi Wo allied various Tian at Chen Zong.",
  "s0500": "Initially, Tian Bao wished to be Zi Wo's minister, made Gong Sun speak to Bao, Bao had mourning and stopped.",
  "s0501": "Later finally became minister, fortunate with Zi Wo.",
  "s0502": "Zi Wo told him: 'I completely drive Tian clan and establish you, acceptable?'",
  "s0503": "Replied: 'I distant from Tian clan.",
  "s0504": "Moreover their opposers no more than several people, why completely drive?'",
  "s0505": "Then told Tian clan.",
  "s0506": "Zi Xing said: 'He obtains lord, if not first, certainly disaster you.'",
  "s0507": "Zi Xing lodged in duke's palace.",
  "s0508": "Summer fifth month ren shen day, Cheng Zi brothers four chariots went to duke.",
  "s0509": "Zi Wo in tent, came out to welcome them, then entered, closed door.",
  "s0510": "Eunuch drove chariot, Zi Xing killed eunuch.",
  "s0511": "Duke with woman drinking wine at Tan Platform, Cheng Zi moved them to bedchamber.",
  "s0512": "Duke grasped spear about to strike him, grand historian Zi Yu said: 'Not disadvantageous, will eliminate harm.'",
  "s0513": "Cheng Zi came out lodged in storehouse, heard duke still angered, about to exit, said: 'What place without lord!'",
  "s0514": "Zi Xing drew sword said: 'Wait, affair's traitor.",
  "s0515": "Who not Tian clan?",
  "s0516": "What not kill you has like Tian clan.'",
  "s0517": "Then stopped.",
  "s0518": "Zi Wo returned, commanded followers attack inner and main gates, all not win, then exited.",
  "s0519": "Tian clan pursued him.",
  "s0520": "Feng Qiu people seized Zi Wo to report, killed him at outer pass.",
  "s0521": "Cheng Zi about to kill Da Lu Zi Fang, Tian Ni requested and exempted him.",
  "s0522": "With duke's command took chariot on road, exited Yong Gate.",
  "s0523": "Tian Bao gave him chariot, not accepted, said: 'Ni requested for me, Bao gave me chariot, I have private matter.",
  "s0524": "Served Zi Wo and have private with his enemy, with what see Lu Wei scholars?'",
  "s0526": "Geng chen day, Tian Chang seized Duke Jian at Xu Zhou.",
  "s0527": "Duke said: 'I early followed Yu Yang's words, would not reach this.'",
  "s0528": "Jia wu day, Tian Chang assassinated Duke Jian at Xu Zhou.",
  "s0529": "Tian Chang then established Duke Jian's younger brother Ao, this was Duke Ping.",
  "s0530": "Duke Ping ascended throne, Tian Chang as chancellor, monopolized Qi governance, divided Qi Anping east as Tian clan fief.",
  "s0531": "Duke Ping year 8, Yue extinguished Wu.",
  "s0532": "Year 25 passed away, son Duke Xuan Ji established.",
  "s0533": "Duke Xuan year 51 passed away, son Duke Kang Dai established.",
  "s0534": "Tian Hui rebelled Lin Qiu.",
  "s0535": "Duke Kang year 2, Han, Wei, Zhao began listed as feudal lords.",
  "s0536": "Year 19, Tian Chang's great grandson Tian He began as feudal lord, moved Duke Kang to seacoast.",
  "s0537": "Year 26, Duke Kang passed away, Lü clan then extinguished their sacrifices."
}
