{
  "s0037": "Gu Gong said: 'With people establish lord, will to benefit them.'",
  "s0045": "Make five officials have directors.",
  "s0050": "Long son Tai Bo, Yu Zhong know Gu Gong wish establish Ji Li to pass Chang, then two people flee go Jing Man, tattooed body cut hair, to yield Ji Li.",
  "s0054": "Xi Bo said Wen Wang, follow Hou Ji, Gong Liu work, then Gu Gong, Gong Ji method, devoted benevolence, respect old, pity young.",
  "s0057": "Bo Yi, Shu Qi at Gu Zhu, hear Xi Bo good nourish old, why not go return him.",
  "s0058": "Tai Dian, Hong Yao, San Yi Sheng, Yu Zi, Xin Jia grand master followers all go return him.",
  "s0061": "Chong Hou Hu slander Xi Bo at Yin Zhou said: 'Xi Bo accumulate good accumulate virtue, feudal lords all face him, will not benefit emperor.'",
  "s0066": "Zhou allow it.",
  "s0078": "Said: 'Distant! West earth people!'",
  "s0079": "Wu Wang said: 'Jie!",
  "s0080": "I have state grave lord, Si Tu, Si Ma, Si Kong, Ya Lu, Shi Shi, thousand husband long, hundred husband long, and Yong, Shu, Qiang, Mao, Wei, Lu, Peng, Pu people, raise your spear, compare your shield, stand your spear, I will oath.'",
  "s0082": "Wang said: 'Ancient people have speech 'female chicken no dawn.",
  "s0083": "Female chicken dawn, only home desolate'.",
  "s0088": "Now Yin wang Zhou only women speech is use, self abandon his previous ancestor unrestrained sacrifice not reply, muddle abandon his family state, leave his wang parents younger brother not use, then only four directions many crime fugitive is honor is long, is trust is make, cause violent tyrannical at hundred surnames, with crooked track at Shang state.",
  "s0089": "Now I Fa only together execute heaven punishment.",
  "s0093": "Today matter, not over six step seven step, then stop Qi, master encourage!",
  "s0095": "Not over four strike five strike six strike seven strike, then stop Qi, encourage master!",
  "s0097": "Still strong strong, like tiger like Xiong, like wolf like Li, at Shang suburbs, not resist conquer flee, to serve west earth, encourage master!",
  "s0100": "You not encourage, its at your body have execution.'",
  "s0103": "Oath already, feudal lords troops meet chariots four thousand ascend, arrange troops Mu Ye.",
  "s0104": "Emperor Zhou hear Wu Wang come, also send troops seventy thousand resist Wu Wang.",
  "s0107": "Wu Wang make Shi Shang Fu with hundred husband lead troops, with big soldiers charge emperor Zhou troops.",
  "s0109": "Zhou also again bow kowtow, then exit.",
  "s0117": "Seal Shang Zhou son Lu Fu Yin remain people.",
  "s0118": "Wu Wang for Yin initial pacify not gather, then make his younger brother Guan Shu Xian, Cai Shu Du assist Lu Fu govern Yin.",
  "s0120": "Already then command Zhao Gong release Ji Zi prisoner.",
  "s0121": "Command Bi Gong release hundred surnames prisoner, mark Shang Rong lane.",
  "s0123": "Command Nan Gong Kuo scatter Lu Tai wealth, issue Ju Qiao grain, to relieve poor weak sprout servant.",
  "s0124": "Command Nan Gong Kuo, Shi Yi display nine tripods preserve jade.",
  "s0125": "Command Hong Yao seal Bi Gan tomb.",
  "s0126": "Command Zong Zhu enjoy sacrifice at army.",
  "s0127": "Then stop troops west return.",
  "s0128": "Go hunt, record government affairs, make Wu Cheng.",
  "s0129": "Seal feudal lords, distribute grant ancestral vessels, make divide Yin utensils.",
  "s0130": "Wu Wang pursue think previous sage wang, then praise seal Shen Nong after at Jiao, Yellow Emperor after at Zhu, Emperor Yao after at Ji, Emperor Shun after at Chen, Da Yu after at Qi.",
  "s0131": "Then seal merit ministers plot scholars, yet Shi Shang Fu as first seal.",
  "s0132": "Seal Shang Fu at Ying Qiu, said Qi.",
  "s0133": "Seal younger brother Zhou Gong Dan at Qu Fu, said Lu.",
  "s0134": "Seal Zhao Gong Shi at Yan."
}

