{
  "metadata": {
    "book": "shiji",
    "chapter": "027",
    "file": "data/shiji/027.json"
  },
  "sentences": [
    {
      "id": "s0266",
      "chinese": "其南為丈夫［喪］，北為女子喪。",
      "literal": "Its south brings husband mourning, north brings wife mourning.",
      "idiomatic": ""
    },
    {
      "id": "s0267",
      "chinese": "若角動繞環之，及乍前乍後，左右，殃益大。",
      "literal": "If horns move and circle around it, or suddenly front then back, left and right, the calamity grows greater.",
      "idiomatic": ""
    },
    {
      "id": "s0269",
      "chinese": "不相逮，不害。",
      "literal": "When they do not reach each other, there is no harm.",
      "idiomatic": ""
    },
    {
      "id": "s0270",
      "chinese": "五星皆從而聚于一舍，其下國可以禮致天下。",
      "literal": "When all five planets follow and gather in one lodging, the state below can bring all under heaven through ritual.",
      "idiomatic": ""
    },
    {
      "id": "s0274",
      "chinese": "伏行五月，出東方。",
      "literal": "Travels hidden for five months, emerges in the east.",
      "idiomatic": ""
    },
    {
      "id": "s0276",
      "chinese": "東行急，一日行一度半。",
      "literal": "Its eastern movement is urgent, traveling one and a half degrees per day.",
      "idiomatic": ""
    },
    {
      "id": "s0277",
      "chinese": "其行東、西、南、北疾也。",
      "literal": "Its movements east, west, south, north are all urgent.",
      "idiomatic": ""
    },
    {
      "id": "s0279",
      "chinese": "用戰，順之勝，逆之敗。",
      "literal": "When using battle, following it brings victory, going against it brings defeat.",
      "idiomatic": ""
    },
    {
      "id": "s0281",
      "chinese": "離之，軍卻。",
      "literal": "When it separates, armies retreat.",
      "idiomatic": ""
    },
    {
      "id": "s0283",
      "chinese": "行其陽，有偏將戰。",
      "literal": "When it goes through its yang, there are partial generals battling.",
      "idiomatic": ""
    },
    {
      "id": "s0284",
      "chinese": "當其行，太白逮之，破軍殺將。",
      "literal": "When it moves and Taibai reaches it, armies are broken and generals killed.",
      "idiomatic": ""
    },
    {
      "id": "s0285",
      "chinese": "其入守犯太微、軒轅、營室，主命惡之。",
      "literal": "When it enters and guards or offends Taiwei, Xuanyuan, Ying Shi, those who govern fate hate it.",
      "idiomatic": ""
    },
    {
      "id": "s0286",
      "chinese": "心為明堂，熒惑廟也。",
      "literal": "Xin forms the Bright Hall, Yinghuo's temple.",
      "idiomatic": ""
    },
    {
      "id": "s0287",
      "chinese": "謹候此。",
      "literal": "Carefully observe this.",
      "idiomatic": ""
    },
    {
      "id": "s0288",
      "chinese": "歷斗之會以定填星之位。",
      "literal": "Use the Dipper's meetings to determine Tianxing's position.",
      "idiomatic": ""
    },
    {
      "id": "s0289",
      "chinese": "曰中央土，主季夏，日戊、己，黃帝，主德，女主象也。",
      "literal": "It is called Central Earth, governs late summer, called Wu and Ji, the Yellow Emperor, governs virtue, and is the image of the female lord.",
      "idiomatic": ""
    },
    {
      "id": "s0290",
      "chinese": "歲填一宿，其所居國吉。",
      "literal": "When Tianxing stays in one lodging for a year, the state where it dwells is auspicious.",
      "idiomatic": ""
    },
    {
      "id": "s0291",
      "chinese": "未當居而居，若已去而復還，還居之，其國得土，不乃得女。",
      "literal": "When it dwells where it should not, or has already gone and returns again to dwell there, its state obtains earth, or else obtains a female.",
      "idiomatic": ""
    },
    {
      "id": "s0292",
      "chinese": "若當居而不居，既已居之，又西東去，其國失土，不乃失女，不可舉事用兵。",
      "literal": "If it should dwell but does not, or after dwelling there goes west or east, its state loses earth, or else loses a female—one cannot raise affairs or use troops.",
      "idiomatic": ""
    },
    {
      "id": "s0294",
      "chinese": "易，福薄。",
      "literal": "When it moves easily, blessings are thin.",
      "idiomatic": ""
    },
    {
      "id": "s0295",
      "chinese": "其一名曰地侯，主歲。",
      "literal": "Its other name is Earth Marquis, governs the year.",
      "idiomatic": ""
    },
    {
      "id": "s0296",
      "chinese": "歲行十（二）［三］度百十二分度之五，日行二十八分度之一，二十八歲周天。",
      "literal": "The year travels thirteen degrees and one hundred twelve fifths of a degree, daily travels one twenty-eighth of a degree, completing the heavenly circuit in twenty-eight years.",
      "idiomatic": ""
    },
    {
      "id": "s0297",
      "chinese": "其所居，五星皆從而聚于一舍，其下之國，可［以］重致天下。",
      "literal": "Where it dwells, all five planets follow and gather in one lodging—the state below can heavily bring all under heaven.",
      "idiomatic": ""
    },
    {
      "id": "s0298",
      "chinese": "禮、德、義、殺、刑盡失，而填星乃為之動搖。",
      "literal": "When ritual, virtue, righteousness, killing, and punishment are all lost, then Tianxing moves and shakes for it.",
      "idiomatic": ""
    },
    {
      "id": "s0300",
      "chinese": "其縮，有軍不復。",
      "literal": "When retreating, there are armies that do not return.",
      "idiomatic": ""
    },
    {
      "id": "s0301",
      "chinese": "填星，其色黃，九芒，音曰黃鐘宮。",
      "literal": "Tianxing's color is yellow, with nine spikes; its sound is called Huangzhong Gong.",
      "idiomatic": ""
    },
    {
      "id": "s0302",
      "chinese": "其失次上二三宿曰贏，有主命不成，不乃大水。",
      "literal": "When it loses its order by two or three lodgings above, it is called advancing—there is incomplete lordly fate, or else great floods.",
      "idiomatic": ""
    },
    {
      "id": "s0303",
      "chinese": "失次下二三宿曰縮，有后戚，其歲不復，不乃天裂若地動。",
      "literal": "When it loses its order by two or three lodgings below, it is called retreating—there is queenly sorrow, the year does not return, or else heaven cracks or earth moves.",
      "idiomatic": ""
    },
    {
      "id": "s0304",
      "chinese": "斗為文太室，填星廟，天子之星也。",
      "literal": "The Dipper forms the civil great chamber, Tianxing's temple, the star of the Son of Heaven.",
      "idiomatic": ""
    },
    {
      "id": "s0305",
      "chinese": "木星與土合，為內亂。",
      "literal": "When the wood star combines with earth, it brings inner chaos.",
      "idiomatic": ""
    },
    {
      "id": "s0309",
      "chinese": "金為白衣會若水。",
      "literal": "Metal brings white-clothed assemblies or floods.",
      "idiomatic": ""
    },
    {
      "id": "s0310",
      "chinese": "金在南曰牝牡，年穀熟，金在北，歲偏無。",
      "literal": "When metal is in the south it is called female-male, the year's grain ripens; when metal is in the north, the year is partially without.",
      "idiomatic": ""
    },
    {
      "id": "s0311",
      "chinese": "火與水合為焠，與金合為鑠，為喪，皆不可舉事，用兵大敗。",
      "literal": "When fire combines with water it forms quenching, with metal forms melting, brings mourning—all cannot raise affairs, using troops brings great defeat.",
      "idiomatic": ""
    },
    {
      "id": "s0313",
      "chinese": "大饑，戰敗，為北軍，軍困，舉事大敗。",
      "literal": "Great famine, battle defeated, becomes northern army, army distressed, raising affairs brings great defeat.",
      "idiomatic": ""
    },
    {
      "id": "s0314",
      "chinese": "土與水合，穰而擁閼，有覆軍，其國不可舉事。",
      "literal": "When earth combines with water, abundant yet blocked and stopped, there are overturned armies, its state cannot raise affairs.",
      "idiomatic": ""
    },
    {
      "id": "s0316",
      "chinese": "入，得地。",
      "literal": "When entering, gains land.",
      "idiomatic": ""
    },
    {
      "id": "s0317",
      "chinese": "金為疾，為內兵，亡地。",
      "literal": "Metal brings illness, inner troops, loss of land.",
      "idiomatic": ""
    },
    {
      "id": "s0318",
      "chinese": "三星若合，其宿地國外內有兵與喪，改立公王。",
      "literal": "When three stars combine, in the land of its lodging state, outer and inner have troops and mourning, change and establish duke and king.",
      "idiomatic": ""
    },
    {
      "id": "s0319",
      "chinese": "四星合，兵喪并起，君子憂，小人流。",
      "literal": "When four stars combine, troops and mourning arise together, gentlemen worry, small people flee.",
      "idiomatic": ""
    },
    {
      "id": "s0321",
      "chinese": "無德，受殃若亡。",
      "literal": "Without virtue, receives calamity or perishes.",
      "idiomatic": ""
    },
    {
      "id": "s0323",
      "chinese": "皆小，事亦小。",
      "literal": "When all small, affairs are also small.",
      "idiomatic": ""
    },
    {
      "id": "s0324",
      "chinese": "蚤出者為贏，贏者為客。",
      "literal": "Early emergence is advancing, advancing is the guest.",
      "idiomatic": ""
    },
    {
      "id": "s0325",
      "chinese": "晚出者為縮，縮者為主人。",
      "literal": "Late emergence is retreating, retreating is the host.",
      "idiomatic": ""
    },
    {
      "id": "s0326",
      "chinese": "必有天應見於杓星。",
      "literal": "There must be a heavenly response appearing at the ladle star.",
      "idiomatic": ""
    },
    {
      "id": "s0327",
      "chinese": "同舍為合。",
      "literal": "Same lodging is combining.",
      "idiomatic": ""
    },
    {
      "id": "s0328",
      "chinese": "相陵為斗，七寸以內必之矣。",
      "literal": "Mutual oppression is fighting, within seven cun it must happen.",
      "idiomatic": ""
    },
    {
      "id": "s0333",
      "chinese": "黃圜，則吉。",
      "literal": "When yellow and circular, then auspicious.",
      "idiomatic": ""
    },
    {
      "id": "s0334",
      "chinese": "赤角犯我城，黃角地之爭，白角哭泣之聲，青角有兵憂，黑角則水。",
      "literal": "Red horns offend my city, yellow horns bring land disputes, white horns bring sounds of weeping and crying, blue horns bring troop worries, black horns bring floods.",
      "idiomatic": ""
    },
    {
      "id": "s0335",
      "chinese": "意，行窮兵之所終。",
      "literal": "Intent: conducts to the end place of exhausted troops.",
      "idiomatic": ""
    },
    {
      "id": "s0336",
      "chinese": "五星同色，天下偃兵，百姓寧昌。",
      "literal": "When five stars are same color, all under heaven ceases troops, the hundred surnames are peaceful and prosperous.",
      "idiomatic": ""
    }
  ]
}