{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "25-s0227",
      "originalId": "s0227",
      "blockIndex": 25,
      "chinese": "其感人深，其風移俗易，故先王著其教焉。",
      "literal": "Its moving people is deep, its wind shifts customs easily; therefore the former kings established their teachings.",
      "idiomatic": ""
    },
    {
      "id": "26-s0228",
      "originalId": "s0228",
      "blockIndex": 26,
      "chinese": "夫人有血氣心知之性，而無哀樂喜怒之常，應感起物而動，然後心術形焉。",
      "literal": "Indeed humans have blood qi heart knowing nature, but no constant of sorrow joy delight anger; responding to sensations arising from things and moving, then heart methods take form.",
      "idiomatic": ""
    },
    {
      "id": "26-s0229",
      "originalId": "s0229",
      "blockIndex": 26,
      "chinese": "是故志微焦衰之音作，而民思憂；",
      "literal": "Therefore when sounds of subtle anxious declining will arise, the people think sorrow;",
      "idiomatic": ""
    },
    {
      "id": "26-s0230",
      "originalId": "s0230",
      "blockIndex": 26,
      "chinese": "啴緩慢易繁文簡節之音作，而民康樂；",
      "literal": "When sounds of harmonious gentle slow easy ornate patterns simple sections arise, the people are peaceful and joyful;",
      "idiomatic": ""
    },
    {
      "id": "26-s0231",
      "originalId": "s0231",
      "blockIndex": 26,
      "chinese": "粗厲猛起奮末廣賁之音作，而民剛毅；",
      "literal": "When sounds of coarse harsh fierce rising aroused endings broad splendor arise, the people are firm and resolute;",
      "idiomatic": ""
    },
    {
      "id": "26-s0232",
      "originalId": "s0232",
      "blockIndex": 26,
      "chinese": "廉直經正莊誠之音作，而民肅敬；",
      "literal": "When sounds of upright straight canonical correct solemn sincere arise, the people are solemn and respectful;",
      "idiomatic": ""
    },
    {
      "id": "26-s0233",
      "originalId": "s0233",
      "blockIndex": 26,
      "chinese": "寬裕肉好順成和動之音作，而民慈愛；",
      "literal": "When sounds of generous ample fleshy good orderly accomplished harmonious moving arise, the people are benevolent and loving;",
      "idiomatic": ""
    },
    {
      "id": "26-s0234",
      "originalId": "s0234",
      "blockIndex": 26,
      "chinese": "流辟邪散狄成滌濫之音作，而民淫亂。",
      "literal": "When sounds of licentious deviant heretical dispersed barbaric accomplished washed overflowing arise, the people are licentious and chaotic.",
      "idiomatic": ""
    },
    {
      "id": "27-s0235",
      "originalId": "s0235",
      "blockIndex": 27,
      "chinese": "是故先王本之情性，稽之度數，制之禮義，合生氣之和，道五常之行，使之陽而不散，陰而不密，剛氣不怒，柔氣不懾，四暢交於中而發作於外，皆安其位而不相奪也。",
      "literal": "Therefore the former kings based them on emotional nature, checked them against measures and numbers, controlled them with ritual and righteousness, united the living qi harmony, guided the five constants' conduct; made them yang but not scattered, yin but not secretive, strong qi not angry, soft qi not frightened; four flows intersect in the center and erupt outside; all settle in their positions and do not mutually usurp.",
      "idiomatic": ""
    },
    {
      "id": "27-s0236",
      "originalId": "s0236",
      "blockIndex": 27,
      "chinese": "然後立之學等，廣其節奏，省其文采，以繩德厚也。",
      "literal": "Then established their learning ranks, broadened their rhythms, simplified their patterns and colors, to bind virtue thickly.",
      "idiomatic": ""
    },
    {
      "id": "27-s0237",
      "originalId": "s0237",
      "blockIndex": 27,
      "chinese": "類小大之稱，比終始之序，以象事行，使親疏貴賤長幼男女之理皆形見於樂：故曰「樂觀其深矣」。",
      "literal": "Categorized small and great appellations, compared beginning and end sequences, to imitate affairs and conduct; made close and distant noble and base elder and young male and female principles all visibly appear in music: therefore it is said 'Music observes its depth.'",
      "idiomatic": ""
    },
    {
      "id": "28-s0238",
      "originalId": "s0238",
      "blockIndex": 28,
      "chinese": "土敝則草木不長，水煩則魚鱉不大，氣衰則生物不育，世亂則禮廢而樂淫。",
      "literal": "When soil is exhausted then grasses and trees do not grow, when water is troubled then fish and turtles do not grow large, when qi declines then living things are not nurtured, when the age is chaotic then ritual is abandoned and music becomes licentious.",
      "idiomatic": ""
    },
    {
      "id": "28-s0239",
      "originalId": "s0239",
      "blockIndex": 28,
      "chinese": "是故其聲哀而不莊，樂而不安，慢易以犯節，流湎以忘本。",
      "literal": "Therefore its sound is sorrowful but not solemn, joyful but not peaceful, lax and easy to violate measure, licentious and dissipated to forget the root.",
      "idiomatic": ""
    },
    {
      "id": "28-s0240",
      "originalId": "s0240",
      "blockIndex": 28,
      "chinese": "廣則容姦。",
      "literal": "Broad then accommodates wickedness.",
      "idiomatic": ""
    },
    {
      "id": "28-s0241",
      "originalId": "s0241",
      "blockIndex": 28,
      "chinese": "狹則思欲，感滌蕩之氣而滅平和之德，是以君子賤之也。",
      "literal": "Narrow then thinks of desires, moved by washed away dissipating qi and extinguishes peaceful virtue; therefore gentlemen despise it.",
      "idiomatic": ""
    }
  ]
}