{
  "metadata": {
    "book": "hanshu",
    "chapter": "006",
    "file": "data/hanshu/006.json"
  },
  "sentences": [
    {
      "id": "s0061",
      "chinese": "二月壬子晦，日有食之。",
      "literal": "Second month, day Renzi of the new moon: There was an eclipse of the sun.",
      "idiomatic": "On the new moon day Renzi in the second month, there was a solar eclipse."
    },
    {
      "id": "s0062",
      "chinese": "諸將破七國，斬首十餘萬級。",
      "literal": "The various generals defeated the seven kingdoms, beheading more than 100,000 heads.",
      "idiomatic": "The imperial generals defeated the seven kingdoms, taking more than 100,000 heads."
    },
    {
      "id": "s0063",
      "chinese": "追斬吳王濞於丹徒。",
      "literal": "They pursued and beheaded King Pi of Wu at Dantu.",
      "idiomatic": "They pursued and executed King Pi of Wu at Dantu."
    },
    {
      "id": "s0064",
      "chinese": "膠西王卬、楚王戊、趙王遂、濟南王辟光、菑川王賢、 膠東王雄渠皆自殺。",
      "literal": "King of Jiaoxi Ang, King of Chu Wu, King of Zhao Sui, King of Jinan Bi Guang, King of Zichuan Xian, and King of Jiaodong Xiong Qu all committed suicide.",
      "idiomatic": "Kings Ang of Jiaoxi, Wu of Chu, Sui of Zhao, Bi Guang of Jinan, Xian of Zichuan, and Xiong Qu of Jiaodong all committed suicide."
    },
    {
      "id": "s0065",
      "chinese": "夏六月，詔曰：「乃者吳王濞等為逆，起兵相脅，詿誤吏民，吏民不得已。",
      "literal": "Summer, sixth month: He issued an edict saying: 'Recently King Pi of Wu and others committed rebellion, raised troops and coerced each other, deceived and misled officials and people, and officials and people had no choice.'",
      "idiomatic": "In the sixth month of summer, he issued an edict: 'Recently King Pi of Wu and others committed rebellion, raised troops and coerced one another, deceived and misled officials and civilians alike, leaving officials and people with no choice.'"
    },
    {
      "id": "s0066",
      "chinese": "今濞等已滅，吏民當坐濞等及逋逃亡軍者，皆赦之。",
      "literal": "Now Pi and others have been destroyed; officials and people who should be implicated for Pi and others, and deserters and those who fled the army, all shall be pardoned.'",
      "idiomatic": "Now that Pi and his confederates have been destroyed, all officials and civilians who were implicated with them, as well as deserters and those who fled military service, shall be pardoned.'"
    },
    {
      "id": "s0067",
      "chinese": "楚元王子蓺等與 濞等為逆，朕不忍加法，除其籍，毋令汙宗室。」",
      "literal": "King Yuan of Chu's son Yi and others joined Pi and others in rebellion; I cannot bear to apply the law to them, so I remove their names from the registers and do not let them defile the imperial clan.'",
      "idiomatic": "King Yuan of Chu's son Yi and others participated in Pi's rebellion. I cannot bear to apply the full force of the law to them, so I remove their names from the imperial registers to prevent them from tarnishing the imperial clan.'"
    },
    {
      "id": "s0068",
      "chinese": "立平陸侯劉禮為楚王，續元王後。",
      "literal": "He enfeoffed Pinglu Marquis Liu Li as King of Chu, continuing the line of King Yuan.",
      "idiomatic": "He enfeoffed Pinglu Marquis Liu Li as King of Chu to continue the line of King Yuan."
    },
    {
      "id": "s0069",
      "chinese": "立皇子端為膠西王，勝為中山王。",
      "literal": "He enfeoffed imperial son Duan as King of Jiaoxi, Sheng as King of Zhongshan.",
      "idiomatic": "He enfeoffed his imperial sons Duan as King of Jiaoxi and Sheng as King of Zhongshan."
    },
    {
      "id": "s0070",
      "chinese": "賜民爵一級。",
      "literal": "He granted the people advancement in noble rank by one level.",
      "idiomatic": "He granted all the people advancement in noble rank by one level."
    },
    {
      "id": "s0071",
      "chinese": "四年春，復置諸關用傳出入。",
      "literal": "In the fourth year, spring: He reestablished the use of travel documents for entering and leaving the various passes.",
      "idiomatic": "In spring of the fourth year, he reinstated the requirement for travel documents at all border passes."
    },
    {
      "id": "s0072",
      "chinese": "夏四月己巳，立皇子榮為皇太子，徹為膠東王。",
      "literal": "Summer, fourth month, day Jisi: He established imperial son Rong as crown prince, Che as King of Jiaodong.",
      "idiomatic": "On the day Jisi in the fourth month of summer, he established his imperial son Rong as crown prince and Che as King of Jiaodong."
    },
    {
      "id": "s0073",
      "chinese": "六月，赦天下，賜民爵一級。",
      "literal": "Sixth month: He granted amnesty to the world and advanced the people's noble ranks by one level.",
      "idiomatic": "In the sixth month, he granted general amnesty throughout the empire and advanced all the people's noble ranks by one level."
    },
    {
      "id": "s0074",
      "chinese": "秋七月，臨江王閼薨。",
      "literal": "Autumn, seventh month: King Yan of Linjiang died.",
      "idiomatic": "In the seventh month of autumn, King Yan of Linjiang passed away."
    },
    {
      "id": "s0075",
      "chinese": "十月戊戌晦，日有蝕之。",
      "literal": "Tenth month, day Wuxu of the new moon: There was an eclipse of the sun.",
      "idiomatic": "On the new moon day Wuxu in the tenth month, there was a solar eclipse."
    }
  ]
}