{
  "metadata": {
    "book": "shiji",
    "chapter": "050",
    "file": "data/shiji/050.json"
  },
  "sentences": [
    {
      "id": "1-s0004",
      "originalId": "s0004",
      "blockIndex": 1,
      "chinese": "嫂厭叔，叔與客來，嫂詳為羹盡，櫟釜，賓客以故去。",
      "literal": "The sister-in-law disliked her husband's younger brother. When he came with guests, she pretended the stew was gone and covered the pot, so the guests left.",
      "idiomatic": ""
    },
    {
      "id": "1-s0005",
      "originalId": "s0005",
      "blockIndex": 1,
      "chinese": "已而視釜中尚有羹，高祖由此怨其嫂。",
      "literal": "Later, when they checked the pot, there was still stew left. From this, Gaozu resented his sister-in-law.",
      "idiomatic": ""
    },
    {
      "id": "2-s0011",
      "originalId": "s0011",
      "blockIndex": 2,
      "chinese": "即位二十三年卒，子夷王郢立。",
      "literal": "He reigned for twenty-three years and died. His son, King Yi Ying, succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "2-s0012",
      "originalId": "s0012",
      "blockIndex": 2,
      "chinese": "夷王四年卒，子王戊立。",
      "literal": "King Yi reigned for four years and died. His son, King Wu, succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "3-s0013",
      "originalId": "s0013",
      "blockIndex": 3,
      "chinese": "王戊立二十年，冬，坐為薄太后服私姦，削東海郡。",
      "literal": "King Wu reigned for twenty years. In winter, he was convicted of committing adultery while mourning Empress Bo, and Donghai commandery was stripped from him.",
      "idiomatic": ""
    },
    {
      "id": "3-s0014",
      "originalId": "s0014",
      "blockIndex": 3,
      "chinese": "春，戊與吳王合謀反，其相張尚、太傅趙夷吾諫，不聽。",
      "literal": "In spring, Wu conspired with the King of Wu to rebel. His chancellor Zhang Shang and tutor Zhao Yiwu advised against it, but he wouldn't listen.",
      "idiomatic": ""
    },
    {
      "id": "3-s0015",
      "originalId": "s0015",
      "blockIndex": 3,
      "chinese": "戊則殺尚、夷吾，起兵與吳西攻梁，破棘壁。",
      "literal": "Wu then executed Shang and Yiwu, raised troops, and attacked west with Wu toward Liang, breaking through Jibi.",
      "idiomatic": ""
    },
    {
      "id": "3-s0016",
      "originalId": "s0016",
      "blockIndex": 3,
      "chinese": "至昌邑南，與漢將周亞夫戰。",
      "literal": "They reached south of Changyi and fought with the Han general Zhou Yafu.",
      "idiomatic": ""
    },
    {
      "id": "3-s0017",
      "originalId": "s0017",
      "blockIndex": 3,
      "chinese": "漢絕吳楚糧道，士卒饑，吳王走，楚王戊自殺，軍遂降漢。",
      "literal": "Han cut off Wu and Chu's supply lines. The soldiers grew hungry. The King of Wu fled. King Wu of Chu committed suicide. The army surrendered to Han.",
      "idiomatic": ""
    },
    {
      "id": "4-s0018",
      "originalId": "s0018",
      "blockIndex": 4,
      "chinese": "漢已平吳楚，孝景帝欲以德侯子續吳，以元王子禮續楚。",
      "literal": "After Han pacified Wu and Chu, Emperor Jing wanted to continue Wu with the son of Marquis De, and continue Chu with Prince Yuan's son Liu Li.",
      "idiomatic": ""
    },
    {
      "id": "4-s0021",
      "originalId": "s0021",
      "blockIndex": 4,
      "chinese": "不許吳，許立楚後。",
      "literal": "Wu was not allowed, but Chu was permitted to establish descendants.",
      "idiomatic": ""
    },
    {
      "id": "5-s0024",
      "originalId": "s0024",
      "blockIndex": 5,
      "chinese": "文王立三年卒，子安王道立。",
      "literal": "King Wen reigned for three years and died. His son, King An Dao, succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "5-s0025",
      "originalId": "s0025",
      "blockIndex": 5,
      "chinese": "安王二十二年卒，子襄王注立。",
      "literal": "King An reigned for twenty-two years and died. His son, King Xiang Zhu, succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "5-s0026",
      "originalId": "s0026",
      "blockIndex": 5,
      "chinese": "襄王立十四年卒，子王純代立。",
      "literal": "King Xiang reigned for fourteen years and died. His son, King Chun, succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "5-s0027",
      "originalId": "s0027",
      "blockIndex": 5,
      "chinese": "王純立，地節二年，中人上書告楚王謀反，王自殺，國除，入漢為彭城郡。",
      "literal": "King Chun ascended the throne. In the second year of the Dijie era, a palace attendant submitted a memorial accusing the King of Chu of plotting rebellion. The king committed suicide. The state was abolished and became Pengcheng commandery of Han.",
      "idiomatic": ""
    }
  ]
}