{
  "metadata": {
    "book": "shiji",
    "chapter": "039",
    "file": "data/shiji/039.json"
  },
  "sentences": [
    {
      "id": "s0325",
      "chinese": "初，惠公亡在梁，梁伯以其女妻之，生一男一女。",
      "literal": "Initially, when Hui Gong fled in Liang, Liang Bo married his daughter to him. She gave birth to one male and one female.",
      "idiomatic": "Initially, while Duke Hui was in exile in Liang, the Marquis of Liang gave him his daughter in marriage. She bore him one son and one daughter."
    },
    {
      "id": "s0326",
      "chinese": "梁伯卜之，男為人臣，女為人妾，故名男為圉，女為妾。",
      "literal": "Liang Bo divined it. The male would be a minister to others, the female a concubine to others. Therefore he named the male Yu and the female Concubine.",
      "idiomatic": "The Marquis of Liang consulted the oracle about them. The son would serve as a minister to others, the daughter as a concubine to others. Therefore he named the son Yu and the daughter Concubine."
    },
    {
      "id": "s0327",
      "chinese": "十年，秦滅梁。",
      "literal": "In the tenth year, Qin extinguished Liang.",
      "idiomatic": "In the tenth year, Qin destroyed Liang."
    },
    {
      "id": "s0329",
      "chinese": "十三年，晉惠公病，內有數子。",
      "literal": "In the thirteenth year, Jin Hui Gong was ill. He had several sons inside.",
      "idiomatic": "In the thirteenth year, Duke Hui of Jin fell ill. He had several sons."
    },
    {
      "id": "s0332",
      "chinese": "乃謀與其妻俱亡歸。",
      "literal": "He then plotted with his wife to together flee and return.",
      "idiomatic": "He then conspired with his wife to flee together and return home."
    },
    {
      "id": "s0334",
      "chinese": "秦使婢子侍，以固子之心。",
      "literal": "Qin made a maidservant attend, to strengthen your heart.",
      "idiomatic": "Qin sent a maidservant to attend you, to reassure your heart."
    },
    {
      "id": "s0336",
      "chinese": "子圉遂亡歸晉。",
      "literal": "Zi Yu then fled and returned to Jin.",
      "idiomatic": "Zi Yu then fled back to Jin."
    },
    {
      "id": "s0337",
      "chinese": "十四年九月，惠公卒，太子圉立，是為懷公。",
      "literal": "In the fourteenth year ninth month, Hui Gong died. Crown Prince Yu was established, who became Duke Huai.",
      "idiomatic": "In the ninth month of the fourteenth year, Duke Hui died. Crown Prince Yu ascended the throne, becoming Duke Huai."
    },
    {
      "id": "s0338",
      "chinese": "子圉之亡，秦怨之，乃求公子重耳，欲內之。",
      "literal": "Zi Yu fled. Qin resented it and then sought Prince Chong Er, desiring to bring him in.",
      "idiomatic": "Zi Yu's flight angered Qin, so they sought out Prince Chong Er, desiring to install him as ruler."
    },
    {
      "id": "s0339",
      "chinese": "子圉之立，畏秦之伐也。",
      "literal": "Zi Yu's establishment feared Qin's attack.",
      "idiomatic": "Zi Yu's enthronement was motivated by fear of a Qin invasion."
    },
    {
      "id": "s0340",
      "chinese": "乃令國中諸從重耳亡者與期，期盡不到者盡滅其家。",
      "literal": "He then commanded those in the state who had followed Chong Er in flight to set a deadline. Those who did not arrive by the deadline would have their families completely extinguished.",
      "idiomatic": "He then ordered all those in the state who had followed Chong Er into exile to report by a deadline. Those who failed to appear would have their entire families executed."
    },
    {
      "id": "s0341",
      "chinese": "狐突之子毛及偃從重耳在秦，弗肯召。",
      "literal": "Hu Tu's sons Mao and Yan followed Chong Er in Qin and were not willing to be summoned.",
      "idiomatic": "Hu Tu's sons Mao and Yan were with Chong Er in Qin and refused to answer the summons."
    },
    {
      "id": "s0342",
      "chinese": "懷公怒，囚狐突。",
      "literal": "Duke Huai was angered and imprisoned Hu Tu.",
      "idiomatic": "Duke Huai was furious and imprisoned Hu Tu."
    },
    {
      "id": "s0345",
      "chinese": "懷公卒殺狐突。",
      "literal": "Duke Huai finally killed Hu Tu.",
      "idiomatic": "Duke Huai eventually had Hu Tu executed."
    },
    {
      "id": "s0346",
      "chinese": "秦繆公乃發兵送內重耳，使人告欒、郤之黨為內應，殺懷公於高梁，入重耳。",
      "literal": "Qin Mu Gong then sent troops to bring in Chong Er. He made people tell the Luan and Xi party to act as inner support, killed Duke Huai at Gao Liang, and entered Chong Er.",
      "idiomatic": "Duke Mu of Qin then dispatched troops to escort Chong Er back. He instructed the factions of Luan and Xi to provide internal support, assassinated Duke Huai at Gaoliang, and installed Chong Er as ruler."
    }
  ]
}