{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "66-s0504",
      "originalId": "s0504",
      "blockIndex": 66,
      "chinese": "聞角音，使人惻隱而愛人；",
      "literal": "Hear jiao tone; makes people compassionate and loving toward others;",
      "idiomatic": ""
    },
    {
      "id": "66-s0505",
      "originalId": "s0505",
      "blockIndex": 66,
      "chinese": "聞徵音，使人樂善而好施；",
      "literal": "Hear zhi tone; makes people delight in goodness and enjoy giving;",
      "idiomatic": ""
    },
    {
      "id": "66-s0506",
      "originalId": "s0506",
      "blockIndex": 66,
      "chinese": "聞羽音，使人整齊而好禮。",
      "literal": "Hear yu tone; makes people orderly and fond of ritual.",
      "idiomatic": ""
    },
    {
      "id": "66-s0507",
      "originalId": "s0507",
      "blockIndex": 66,
      "chinese": "夫禮由外入，樂自內出。",
      "literal": "Indeed ritual enters from outside; music emerges from within.",
      "idiomatic": ""
    },
    {
      "id": "66-s0508",
      "originalId": "s0508",
      "blockIndex": 66,
      "chinese": "故君子不可須臾離禮，須臾離禮則暴慢之行窮外；",
      "literal": "Therefore the gentleman cannot for a moment leave ritual; for a moment leaving ritual then violent insolent conduct exhausts the exterior;",
      "idiomatic": ""
    },
    {
      "id": "66-s0509",
      "originalId": "s0509",
      "blockIndex": 66,
      "chinese": "不可須臾離樂，須臾離樂則姦邪之行窮內。",
      "literal": "Cannot for a moment leave music; for a moment leaving music then treacherous deviant conduct exhausts the interior.",
      "idiomatic": ""
    },
    {
      "id": "66-s0510",
      "originalId": "s0510",
      "blockIndex": 66,
      "chinese": "故樂音者，君子之所養義也。",
      "literal": "Therefore musical tones are what the gentleman uses to nurture righteousness.",
      "idiomatic": ""
    },
    {
      "id": "66-s0511",
      "originalId": "s0511",
      "blockIndex": 66,
      "chinese": "夫古者，天子諸侯聽鐘磬未嘗離於庭，卿大夫聽琴瑟之音未嘗離於前，所以養行義而防淫佚也。",
      "literal": "Indeed in ancient times, the Son of Heaven and lords listened to bells and chimes without ever leaving the courtyard; ministers and grand officers listened to qin and se music without ever leaving their presence; this was to nurture proper conduct and prevent licentious dissipation.",
      "idiomatic": ""
    },
    {
      "id": "66-s0512",
      "originalId": "s0512",
      "blockIndex": 66,
      "chinese": "夫淫佚生於無禮，故聖王使人耳聞雅頌之音，目視威儀之禮，足行恭敬之容，口言仁義之道。",
      "literal": "Indeed licentious dissipation arises from lack of ritual; therefore the sage kings made people hear the sounds of ya and song in their ears, see the rites of dignified bearing in their eyes, perform respectful demeanor with their feet, speak the way of benevolence and righteousness with their mouths.",
      "idiomatic": ""
    },
    {
      "id": "66-s0513",
      "originalId": "s0513",
      "blockIndex": 66,
      "chinese": "故君子終日言而邪辟無由入也。",
      "literal": "Therefore the gentleman speaks all day long and deviant ways have no way to enter.",
      "idiomatic": ""
    }
  ]
}