{
  "metadata": {
    "book": "shiji",
    "chapter": "100",
    "file": "data/shiji/100.json"
  },
  "sentences": [
    {
      "id": "s0102",
      "chinese": "燕齊之閒皆為欒布立社，號曰欒公社。",
      "literal": "Yan Qi between all for Luan Bu established shrines, styled Luan Gong shrines.",
      "idiomatic": "Between Yan and Qi, all established shrines for Luan Bu, calling them the Luan Gong shrines."
    },
    {
      "id": "s0103",
      "chinese": "景帝中五年薨。",
      "literal": "Jing Emperor middle fifth year passed away.",
      "idiomatic": "He passed away in the fifth year of Emperor Jing's reign."
    },
    {
      "id": "s0104",
      "chinese": "子賁嗣，為太常，犧牲不如令，國除。",
      "literal": "Son Ben succeeded, served as Grand Master of Ceremonies, sacrifices not according to regulations, fief eliminated.",
      "idiomatic": "His son Ben succeeded him and served as Grand Master of Ceremonies, but his sacrifices did not conform to regulations, so his fief was eliminated."
    },
    {
      "id": "s0105",
      "chinese": "太史公曰：以項羽之氣，而季布以勇顯於楚，身屨（典）軍搴旗者數矣，可謂壯士。",
      "literal": "Grand Historian said: With Xiang Yu's spirit, yet Ji Bu with bravery prominent in Chu, personally led troops seized banners several times, can be called stalwart warrior.",
      "idiomatic": "The Grand Historian said: With Xiang Yu's spirit, Ji Bu nonetheless became prominent in Chu through bravery, personally leading troops and seizing enemy banners on several occasions—he can truly be called a stalwart warrior."
    },
    {
      "id": "s0106",
      "chinese": "然至被刑戮，為人奴而不死，何其下也！",
      "literal": "However to suffered punishment execution, became person's slave yet not died, how lowly!",
      "idiomatic": "Yet to suffer punishment and execution, become someone's slave and not die—how lowly this was!"
    },
    {
      "id": "s0107",
      "chinese": "彼必自負其材，故受辱而不羞，欲有所用其未足也，故終為漢名將。",
      "literal": "He certainly self-relied on his talents, therefore accepted humiliation without shame, wished to have use for his insufficiency, therefore finally became Han famous general.",
      "idiomatic": "He certainly relied upon his own talents, therefore accepted humiliation without feeling shame, wishing to have some use for what was still insufficient, and therefore finally became a famous general of Han."
    },
    {
      "id": "s0108",
      "chinese": "賢者誠重其死。",
      "literal": "Worthy ones truly value their death.",
      "idiomatic": "Truly, the worthy value their death."
    },
    {
      "id": "s0109",
      "chinese": "夫婢妾賤人感慨而自殺者，非能勇也，其計畫無復之耳。",
      "literal": "Indeed concubines base people emotionally moved commit suicide, not able brave, their plans no recovery only.",
      "idiomatic": "Indeed, when concubines and base people are emotionally moved and commit suicide, it is not that they are able to be brave—their plans simply have no recovery."
    },
    {
      "id": "s0110",
      "chinese": "欒布哭彭越，趣湯如歸者，彼誠知所處，不自重其死。",
      "literal": "Luan Bu wept Peng Yue, hurried to cauldron as returning home, he truly knew his situation, not self-valued his death.",
      "idiomatic": "Luan Bu wept for Peng Yue and hurried to the cauldron as if returning home—he truly knew his situation and did not value his own death."
    },
    {
      "id": "s0111",
      "chinese": "雖往古烈士，何以加哉！",
      "literal": "Even past ancient fierce warriors, how to add!",
      "idiomatic": "Even the fierce warriors of past and ancient times—what could be added to this!"
    }
  ]
}