{
  "metadata": {
    "book": "shiji",
    "chapter": "028",
    "file": "data/shiji/028.json"
  },
  "sentences": [
    {
      "id": "s0002",
      "chinese": "蓋有無其應而用事者矣，未有睹符瑞見而不臻乎泰山者也。",
      "literal": "There have been those who performed the rites without the proper omens, but never those who saw auspicious signs appear and did not proceed to Mount Tai.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "雖受命而功不至，至梁父矣而德不洽，洽矣而日有不暇給，是以即事用希。",
      "literal": "Though they received the mandate, their achievements did not reach the required level; or reaching Liang Fu, their virtue was not in harmony; or being in harmony, they lacked the leisure time—so the rites were rarely performed.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "厥曠遠者千有餘載，近者數百載，故其儀闕然堙滅，其詳不可得而記聞云。",
      "literal": "The distant ones were over a thousand years ago, the nearer ones several hundred years ago—therefore their rites have gaps and are buried in oblivion; their details cannot be obtained and recorded, it is said.",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "《尚書》曰，舜在璇璣玉衡，以齊七政。",
      "literal": "The Shang Shu says: Shun was at the Xuan Ji and Yu Heng, using them to align the seven governances.",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "遂類于上帝，禋于六宗，望山川，遍群神。",
      "literal": "Then he offered sacrifices to the Supreme Deity, made yin offerings to the six ancestors, gazed at the mountains and rivers, and universally to all spirits.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "輯五瑞，擇吉月日，見四嶽諸牧，還瑞。",
      "literal": "He collected the five auspicious tokens, selected auspicious months and days, met with the four peak lords and all the shepherds, and returned the auspicious tokens.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "歲二月，東巡狩，至于岱宗。",
      "literal": "In the year's second month, he conducted the eastern inspection tour, arriving at Dai Zong.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "岱宗，泰山也。",
      "literal": "Dai Zong is Mount Tai.",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "柴，望秩于山川。",
      "literal": "He performed the chai sacrifice, gazing in order at the mountains and rivers.",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "遂覲東后。",
      "literal": "Then he held audience with the eastern lords.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "東后者，諸侯也。",
      "literal": "The eastern lords are the feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "合時月正日，同律度量衡，修五禮，五玉三帛二生一死贄。",
      "literal": "He harmonized the seasons, months, and first days; standardized the pitch pipes, measures, and balances; repaired the five rites; and prepared the five jades, three silks, two living animals, and one dead animal as tribute.",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "五月，巡狩至南嶽。",
      "literal": "In the fifth month, he conducted the inspection tour to the southern peak.",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "南嶽，衡山也。",
      "literal": "The southern peak is Mount Heng.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "八月，巡狩至西嶽。",
      "literal": "In the eighth month, he conducted the inspection tour to the western peak.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "西嶽，華山也。",
      "literal": "The western peak is Mount Hua.",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "十一月，巡狩至北嶽。",
      "literal": "In the eleventh month, he conducted the inspection tour to the northern peak.",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "北岳，恒山也。",
      "literal": "The northern peak is Mount Heng.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "中嶽，嵩高也。",
      "literal": "The central peak is Mount Song Gao.",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "五載一巡狩。",
      "literal": "Once every five years he conducted the inspection tour.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "禹遵之。",
      "literal": "Yu followed this practice.",
      "idiomatic": ""
    },
    {
      "id": "s0027",
      "chinese": "後十四世，至帝孔甲，淫德好神，神瀆，二龍去之。",
      "literal": "Fourteen generations later, Emperor Kong Jia had licentious virtue and was fond of spirits; he profaned the spirits, so the two dragons left him.",
      "idiomatic": ""
    },
    {
      "id": "s0028",
      "chinese": "其後三世，湯伐桀，欲遷夏社，不可，作夏社。",
      "literal": "Three generations later, Tang attacked Jie; he wished to move the Xia altar but it was not possible, so he made a Xia altar.",
      "idiomatic": ""
    },
    {
      "id": "s0029",
      "chinese": "後八世，至帝太戊，有桑谷生於廷，一暮大拱，懼。",
      "literal": "Eight generations later, Emperor Tai Wu had mulberry and grain growing in his court; in one evening they grew to embrace each other greatly, causing fear.",
      "idiomatic": ""
    },
    {
      "id": "s0031",
      "chinese": "太戊修德，桑谷死。",
      "literal": "Tai Wu cultivated virtue, and the mulberry and grain died.",
      "idiomatic": ""
    },
    {
      "id": "s0033",
      "chinese": "後十四世，帝武丁得傅說為相，殷復興焉，稱高宗。",
      "literal": "Fourteen generations later, Emperor Wu Ding obtained Fu Yue as his minister; Yin was revived thereupon, and he was called Gao Zong.",
      "idiomatic": ""
    },
    {
      "id": "s0034",
      "chinese": "有雉登鼎耳雊，武丁懼。",
      "literal": "A pheasant ascended the cauldron's ears and crowed; Wu Ding was afraid.",
      "idiomatic": ""
    },
    {
      "id": "s0035",
      "chinese": "祖己曰：「修德。」",
      "literal": "Zu Ji said: 'Cultivate virtue.'",
      "idiomatic": ""
    },
    {
      "id": "s0036",
      "chinese": "武丁從之，位以永寧。",
      "literal": "Wu Ding followed this advice, and his position was eternally peaceful.",
      "idiomatic": ""
    },
    {
      "id": "s0037",
      "chinese": "後五世，帝武乙慢神而震死。",
      "literal": "Five generations later, Emperor Wu Yi disrespected the spirits and was killed by thunder.",
      "idiomatic": ""
    },
    {
      "id": "s0038",
      "chinese": "後三世，帝紂淫亂，武王伐之。",
      "literal": "Three generations later, Emperor Zhou was licentious and chaotic; Wu Wang attacked him.",
      "idiomatic": ""
    },
    {
      "id": "s0039",
      "chinese": "由此觀之，始未嘗不肅祗，後稍怠慢也。",
      "literal": "From this we can see that at the beginning they were never not solemn and respectful, but later they became somewhat negligent.",
      "idiomatic": ""
    },
    {
      "id": "s0041",
      "chinese": "夏日至，祭地祗。",
      "literal": "when the summer solstice arrives, sacrifice to the earth spirits.",
      "idiomatic": ""
    },
    {
      "id": "s0042",
      "chinese": "皆用樂舞，而神乃可得而禮也。",
      "literal": "All use music and dance, and only then can the spirits be obtained and properly ritualized.",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "天子祭天下名山大川，五嶽視三公，四瀆視諸侯，諸侯祭其疆內名山大川。",
      "literal": "The Son of Heaven sacrifices to all the famous mountains and great rivers under heaven: the five peaks are treated like the three dukes; the four rivers are treated like the feudal lords; the feudal lords sacrifice to the famous mountains and great rivers within their territories.",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "四瀆者，江、河、淮、濟也。",
      "literal": "The four rivers are the Jiang, He, Huai, and Ji.",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "天子曰明堂、辟雍，諸侯曰泮宮。",
      "literal": "The Son of Heaven calls them the Bright Hall and Pi Yong; the feudal lords call them the Pan Palace.",
      "idiomatic": ""
    },
    {
      "id": "s0046",
      "chinese": "周公既相成王，郊祀后稷以配天，宗祀文王於明堂以配上帝。",
      "literal": "After Duke Zhou assisted Cheng Wang, he performed the suburban sacrifice to Hou Ji to match with Heaven, and the ancestral sacrifice to Wen Wang in the Bright Hall to match with the Supreme Deity.",
      "idiomatic": ""
    },
    {
      "id": "s0047",
      "chinese": "自禹興而修社祀，后稷稼穡，故有稷祠，郊社所從來尚矣。",
      "literal": "Since Yu rose and repaired the altar sacrifices, and Hou Ji handled farming and harvesting, therefore there is the Ji temple; the suburban and altar sacrifices have come from ancient times.",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "自周克殷後十四世，世益衰，禮樂廢，諸侯恣行，而幽王為犬戎所敗，周東徙雒邑。",
      "literal": "From Zhou's conquest of Yin, after fourteen generations, each generation increasingly declined; rites and music were wasted; feudal lords conducted themselves unrestrainedly; You Wang was defeated by the Quan Rong; Zhou moved east to Luo city.",
      "idiomatic": ""
    },
    {
      "id": "s0049",
      "chinese": "秦襄公攻戎救周，始列為諸侯。",
      "literal": "Qin Xiang Gong attacked the Rong to save Zhou, and began to be ranked among the feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0051",
      "chinese": "其後十六年，秦文公東獵汧渭之閒，卜居之而吉。",
      "literal": "Sixteen years later, Qin Wen Gong went east hunting between the Qian and Wei rivers; he divined about dwelling there and it was auspicious.",
      "idiomatic": ""
    },
    {
      "id": "s0052",
      "chinese": "文公夢黃蛇自天下屬地，其口止於鄜衍。",
      "literal": "Wen Gong dreamed of a yellow snake descending from heaven to earth, its mouth stopping at Fu Yan.",
      "idiomatic": ""
    },
    {
      "id": "s0054",
      "chinese": "於是作鄜畤，用三牲郊祭白帝焉。",
      "literal": "Thereupon he made the Fu zhi altar, using three sacrificial animals to perform the suburban sacrifice to the White Emperor.",
      "idiomatic": ""
    },
    {
      "id": "s0055",
      "chinese": "自未作鄜畤也，而雍旁故有吳陽武畤，雍東有好畤，皆廢無祠。",
      "literal": "Before the Fu zhi was made, beside Yong there were originally the Wu Yang Wu zhi and east of Yong the Hao zhi, but all were abandoned without sacrifice.",
      "idiomatic": ""
    },
    {
      "id": "s0058",
      "chinese": "其語不經見，縉紳者不道。",
      "literal": "These words are not seen in the classics; officials do not speak of them.",
      "idiomatic": ""
    },
    {
      "id": "s0059",
      "chinese": "作鄜畤後九年，文公獲若石雲，于陳倉北阪城祠之。",
      "literal": "Nine years after making the Fu zhi, Wen Gong obtained something like a stone cloud; he walled it at the north slope of Chen Cang and sacrificed to it.",
      "idiomatic": ""
    },
    {
      "id": "s0060",
      "chinese": "其神或歲不至，或歲數來，來也常以夜，光輝若流星，從東南來集于祠城，則若雄雞，其聲殷雲，野雞夜雊。",
      "literal": "Its spirit sometimes did not arrive for a year, sometimes came several times a year; when it came it was always at night, radiant like a shooting star, coming from the southeast to gather at the sacrificial walled area, crowing like a male chicken with a rumbling sound like thunder, and wild chickens crowing at night.",
      "idiomatic": ""
    },
    {
      "id": "s0061",
      "chinese": "以一牢祠，命曰陳寶。",
      "literal": "He sacrificed with one pen of sacrificial animals, naming it Chen Bao.",
      "idiomatic": ""
    },
    {
      "id": "s0064",
      "chinese": "用三百牢於鄜畤。",
      "literal": "He used three hundred pens of sacrificial animals at the Fu zhi.",
      "idiomatic": ""
    }
  ]
}