{
  "metadata": {
    "book": "hanshu",
    "chapter": "016",
    "file": "data/hanshu/016.json"
  },
  "sentences": [
    {
      "id": "146-s1170",
      "originalId": "s1170",
      "blockIndex": 146,
      "chinese": "彊圉侯留驸",
      "literal": "Qiang Yu Hou Liu Pu",
      "idiomatic": "Qiang Yu Hou Liu Pu"
    },
    {
      "id": "146-s1171",
      "originalId": "s1171",
      "blockIndex": 146,
      "chinese": "以客吏初起，從入漢，以都尉擊項籍、代，侯，比彭侯，千戶。",
      "literal": "As guest official initially rose, followed entered Han, as commander attacked Xiang Yu, Dai, made marquis, comparable to Peng Hou, one thousand households.",
      "idiomatic": "As guest official, he initially rose up and followed into Han service. As commander, he attacked Xiang Yu and Dai, for which he was made a marquis comparable to Peng Hou with one thousand households."
    },
    {
      "id": "146-s1172",
      "originalId": "s1172",
      "blockIndex": 146,
      "chinese": "三月丙戌封，三年薨。",
      "literal": "Third month Bing Xu day enfeoffed, third year died.",
      "idiomatic": "Enfeoffed on the Bing Xu day of the third month; died in the third year."
    },
    {
      "id": "146-s1173",
      "originalId": "s1173",
      "blockIndex": 146,
      "chinese": "七十二",
      "literal": "Seventy-two",
      "idiomatic": "Seventy-two"
    },
    {
      "id": "146-s1174",
      "originalId": "s1174",
      "blockIndex": 146,
      "chinese": "十一年，戴侯章復嗣，二十九年薨。",
      "literal": "Eleventh year, Dai Marquis Zhang again succeeded, twenty-ninth year died.",
      "idiomatic": "In the eleventh year, Dai Marquis Zhang again succeeded to the marquisate; died in the twenty-ninth year."
    },
    {
      "id": "146-s1175",
      "originalId": "s1175",
      "blockIndex": 146,
      "chinese": "孝文三年，侯復嗣，二年，有罪，免。",
      "literal": "Xiaowen third year, Marquis Fu succeeded, second year, guilty, dismissed.",
      "idiomatic": "In Emperor Wen's third year, Marquis Fu succeeded to the marquisate; in the second year, he was guilty and dismissed."
    },
    {
      "id": "146-s1176",
      "originalId": "s1176",
      "blockIndex": 146,
      "chinese": "元康四年，驸曾孫長安大夫定詔復家。",
      "literal": "Yuankang fourth year, Pu's great-grandson Chang'an Dafu Ding commanded to restore the family.",
      "idiomatic": "In the fourth year of Yuankang, Pu's great-grandson, Chang'an Dafu Ding, was commanded to restore the family line."
    },
    {
      "id": "147-s1178",
      "originalId": "s1178",
      "blockIndex": 147,
      "chinese": "彭簡侯秦同",
      "literal": "Peng Jian Hou Qin Tong",
      "idiomatic": "Peng Jian Hou Qin Tong"
    },
    {
      "id": "147-s1179",
      "originalId": "s1179",
      "blockIndex": 147,
      "chinese": "以卒從起薛，以弩將入漢，以都尉擊項羽、代，侯，千戶。",
      "literal": "As soldier followed uprising from Xue, as crossbow general entered Han, as commander attacked Xiang Yu, Dai, made marquis, one thousand households.",
      "idiomatic": "As a soldier, he followed the uprising from Xue. As crossbow general, he entered Han service. As commander, he attacked Xiang Yu and Dai, for which he was made a marquis with one thousand households."
    },
    {
      "id": "147-s1180",
      "originalId": "s1180",
      "blockIndex": 147,
      "chinese": "三月丙戌封，二十二年薨。",
      "literal": "Third month Bing Xu day enfeoffed, twenty-second year died.",
      "idiomatic": "Enfeoffed on the Bing Xu day of the third month; died in the twenty-second year."
    },
    {
      "id": "147-s1181",
      "originalId": "s1181",
      "blockIndex": 147,
      "chinese": "七十",
      "literal": "Seventy",
      "idiomatic": "Seventy"
    },
    {
      "id": "147-s1182",
      "originalId": "s1182",
      "blockIndex": 147,
      "chinese": "孝文三年，戴侯執嗣，二十三年薨。",
      "literal": "Xiaowen third year, Dai Marquis Zhi succeeded, twenty-third year died.",
      "idiomatic": "In Emperor Wen's third year, Dai Marquis Zhi succeeded to the marquisate; died in the twenty-third year."
    },
    {
      "id": "147-s1183",
      "originalId": "s1183",
      "blockIndex": 147,
      "chinese": "孝景三年，侯武嗣，十一年，後元年，有罪，免。",
      "literal": "Xiaojing third year, Marquis Wu succeeded, eleventh year, Hou first year, guilty, dismissed.",
      "idiomatic": "In Emperor Jing's third year, Marquis Wu succeeded to the marquisate; in the eleventh year, during the Hou first year, he was guilty and dismissed."
    },
    {
      "id": "147-s1184",
      "originalId": "s1184",
      "blockIndex": 147,
      "chinese": "曾孫",
      "literal": "Great-grandson",
      "idiomatic": "Great-grandson"
    },
    {
      "id": "147-s1185",
      "originalId": "s1185",
      "blockIndex": 147,
      "chinese": "元康四年，同玄孫費公士壽王詔復家。",
      "literal": "",
      "idiomatic": ""
    }
  ]
}