{
  "metadata": {
    "book": "shiji",
    "chapter": "043",
    "file": "data/shiji/043.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "趙氏之先，與秦共祖。",
      "literal": "The Zhao clan's ancestors shared a common ancestor with Qin.",
      "idiomatic": "The ancestors of the Zhao clan shared a common forebear with the Qin."
    },
    {
      "id": "0-s0002",
      "originalId": "s0002",
      "blockIndex": 0,
      "chinese": "至中衍，為帝大戊御。",
      "literal": "It reached Zhong Yan, who was Emperor Da Wu's charioteer.",
      "idiomatic": "The line descended to Zhong Yan, who served as charioteer to Emperor Da Wu."
    },
    {
      "id": "0-s0003",
      "originalId": "s0003",
      "blockIndex": 0,
      "chinese": "其後世蜚廉有子二人，而命其一子曰惡來，事紂，為周所殺，其後為秦。",
      "literal": "In later generations, Fei Lian had two sons. He named one son E Lai, who served King Zhou. E Lai was killed by the Zhou, and his descendants became the Qin clan.",
      "idiomatic": "In later generations, Feilian had two sons. He named one Elai, who served King Zhou but was executed by the Zhou dynasty. Elai's descendants became the Qin clan."
    },
    {
      "id": "0-s0004",
      "originalId": "s0004",
      "blockIndex": 0,
      "chinese": "惡來弟曰季勝，其後為趙。",
      "literal": "E Lai's younger brother was named Ji Sheng, whose descendants became the Zhao clan.",
      "idiomatic": "Elai's younger brother was named Jisheng. His descendants became the Zhao clan."
    },
    {
      "id": "1-s0005",
      "originalId": "s0005",
      "blockIndex": 1,
      "chinese": "季勝生孟增。",
      "literal": "Ji Sheng begat Meng Zeng.",
      "idiomatic": "Jisheng begat Mengzeng."
    },
    {
      "id": "1-s0006",
      "originalId": "s0006",
      "blockIndex": 1,
      "chinese": "孟增幸於周成王，是為宅皋狼。",
      "literal": "Meng Zeng found favor with King Cheng of Zhou. He was known as Zhai Gao Lang.",
      "idiomatic": "Mengzeng found favor with King Cheng of Zhou and became known as Zhaigaolang."
    },
    {
      "id": "1-s0007",
      "originalId": "s0007",
      "blockIndex": 1,
      "chinese": "皋狼生衡父，衡父生造父。",
      "literal": "Gao Lang begat Heng Fu, Heng Fu begat Zao Fu.",
      "idiomatic": "Gaolang begat Hengfu, who begat Zaofu."
    },
    {
      "id": "1-s0008",
      "originalId": "s0008",
      "blockIndex": 1,
      "chinese": "造父幸於周繆王。",
      "literal": "Zao Fu found favor with King Mu of Zhou.",
      "idiomatic": "Zaofu found favor with King Mu of Zhou."
    },
    {
      "id": "1-s0009",
      "originalId": "s0009",
      "blockIndex": 1,
      "chinese": "造父取驥之乘匹，與桃林盜驪、驊騮、綠耳，獻之繆王。",
      "literal": "Zao Fu obtained eight chariot horses from Ji, together with the stolen horses Li, Hua Liu, and Lu Er from Tao Lin, and presented them to King Mu.",
      "idiomatic": "Zaofu acquired eight fine chariot horses from Ji, along with the stolen horses Lilu, Hualiu, and Lver from Taolin, and presented them all to King Mu."
    },
    {
      "id": "1-s0010",
      "originalId": "s0010",
      "blockIndex": 1,
      "chinese": "繆王使造父御，西巡狩，見西王母，樂之忘歸。",
      "literal": "King Mu had Zao Fu drive the chariot on a western tour of inspection. They met the Queen Mother of the West, and he enjoyed it so much he forgot to return.",
      "idiomatic": "King Mu had Zaofu drive his chariot on a western inspection tour. They encountered the Queen Mother of the West, and the king enjoyed himself so much that he forgot to return home."
    },
    {
      "id": "1-s0011",
      "originalId": "s0011",
      "blockIndex": 1,
      "chinese": "而徐偃王反，繆王日馳千里馬，攻徐偃王，大破之。",
      "literal": "Meanwhile, King Yan of Xu rebelled. King Mu daily galloped his thousand-li horses and attacked King Yan of Xu, greatly defeating him.",
      "idiomatic": "Meanwhile, King Yan of Xu rebelled. King Mu rode his thousand-li horses each day to attack King Yan of Xu and decisively defeated him."
    },
    {
      "id": "1-s0012",
      "originalId": "s0012",
      "blockIndex": 1,
      "chinese": "乃賜造父以趙城，由此為趙氏。",
      "literal": "He then granted Zao Fu the city of Zhao. From this time onward, they became the Zhao clan.",
      "idiomatic": "He then granted Zaofu the city of Zhao as a reward. From this time onward, they became the Zhao clan."
    },
    {
      "id": "2-s0013",
      "originalId": "s0013",
      "blockIndex": 2,
      "chinese": "自造父已下六世至奄父，曰公仲，周宣王時伐戎，為御。",
      "literal": "Six generations after Zao Fu came Yan Fu, also known as Gong Zhong. During King Xuan of Zhou's time, he campaigned against the Rong and served as charioteer.",
      "idiomatic": "Six generations after Zaofu came Yanfu, also known as Gongzhong. During the reign of King Xuan of Zhou, he participated in the campaign against the Rong tribes and served as charioteer."
    },
    {
      "id": "2-s0014",
      "originalId": "s0014",
      "blockIndex": 2,
      "chinese": "及千畝戰，奄父脫宣王。",
      "literal": "When the battle at Qian Mu occurred, Yan Fu rescued King Xuan.",
      "idiomatic": "During the battle at Qianmu, Yanfu rescued King Xuan."
    },
    {
      "id": "2-s0015",
      "originalId": "s0015",
      "blockIndex": 2,
      "chinese": "奄父生叔帶。",
      "literal": "",
      "idiomatic": ""
    }
  ]
}