{
  "metadata": {
    "book": "shiji",
    "chapter": "032",
    "file": "data/shiji/032.json"
  },
  "sentences": [
    {
      "id": "s0337",
      "chinese": "厚禮諸侯。",
      "literal": "He treated the feudal lords with generous courtesy.",
      "idiomatic": ""
    },
    {
      "id": "s0338",
      "chinese": "竟頃公卒，百姓附，諸侯不犯。",
      "literal": "When Duke Qing finally died, the common people were devoted to him, and no feudal lord dared attack Qi.",
      "idiomatic": ""
    },
    {
      "id": "s0339",
      "chinese": "十七年，頃公卒，子靈公環立。",
      "literal": "In the seventeenth year, Duke Qing died and his son Duke Ling (Huan) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0340",
      "chinese": "靈公九年，晉欒書弒其君厲公。",
      "literal": "In Duke Ling's ninth year, Luan Shu of Jin assassinated his ruler Duke Li.",
      "idiomatic": ""
    },
    {
      "id": "s0341",
      "chinese": "十年，晉悼公伐齊，齊令公子光質晉。",
      "literal": "In the tenth year, Duke Dao of Jin attacked Qi, and Qi sent Prince Guang as a hostage to Jin.",
      "idiomatic": ""
    },
    {
      "id": "s0342",
      "chinese": "十九年，立子光為太子，高厚傅之，令會諸侯盟於鐘離。",
      "literal": "In the nineteenth year, Duke Ling established his son Guang as crown prince, with Gao Hou as his tutor, and ordered him to convene the feudal lords for an alliance at Zhong Li.",
      "idiomatic": ""
    },
    {
      "id": "s0343",
      "chinese": "二十七年，晉使中行獻子伐齊。",
      "literal": "In the twenty-seventh year, Jin sent Zhong Xing Xian Zi to attack Qi.",
      "idiomatic": ""
    },
    {
      "id": "s0344",
      "chinese": "齊師敗，靈公走入臨菑。",
      "literal": "The Qi army was defeated, and Duke Ling fled into Linzi.",
      "idiomatic": ""
    },
    {
      "id": "s0345",
      "chinese": "晏嬰止靈公，靈公弗從。",
      "literal": "Yan Ying tried to stop Duke Ling, but the duke refused.",
      "idiomatic": ""
    },
    {
      "id": "s0347",
      "chinese": "晉兵遂圍臨菑，臨菑城守不敢出，晉焚郭中而去。",
      "literal": "The Jin troops then surrounded Linzi. The city defenders dared not sally forth, so Jin burned the suburbs and withdrew.",
      "idiomatic": ""
    },
    {
      "id": "s0348",
      "chinese": "二十八年，初，靈公取魯女，生子光，以為太子。",
      "literal": "In the twenty-eighth year: originally, Duke Ling married a woman from Lu who bore him a son named Guang, whom he established as crown prince.",
      "idiomatic": ""
    },
    {
      "id": "s0349",
      "chinese": "仲姬，戎姬。",
      "literal": "Zhong Ji and Rong Ji.",
      "idiomatic": ""
    },
    {
      "id": "s0350",
      "chinese": "戎姬嬖，仲姬生子牙，屬之戎姬。",
      "literal": "Rong Ji was favored, and when Zhong Ji gave birth to a son named Ya, she entrusted him to Rong Ji's care.",
      "idiomatic": ""
    },
    {
      "id": "s0351",
      "chinese": "戎姬請以為太子，公許之。",
      "literal": "Rong Ji requested that Ya be established as crown prince, and the duke agreed.",
      "idiomatic": ""
    },
    {
      "id": "s0355",
      "chinese": "遂東太子光，使高厚傅牙為太子。",
      "literal": "So Duke Ling exiled Crown Prince Guang to the east and had Gao Hou tutor Ya as the new crown prince.",
      "idiomatic": ""
    },
    {
      "id": "s0356",
      "chinese": "靈公疾，崔杼迎故太子光而立之，是為莊公。",
      "literal": "When Duke Ling fell ill, Cui Zhu welcomed the former Crown Prince Guang back and installed him as ruler, who became Duke Zhuang.",
      "idiomatic": ""
    },
    {
      "id": "s0357",
      "chinese": "莊公殺戎姬。",
      "literal": "Duke Zhuang executed Rong Ji.",
      "idiomatic": ""
    },
    {
      "id": "s0358",
      "chinese": "五月壬辰，靈公卒，莊公即位，執太子牙於句竇之丘，殺之。",
      "literal": "On the ren chen day of the fifth month, Duke Ling died. Duke Zhuang ascended the throne, seized the crown prince Ya at Gou Dou Hill, and executed him.",
      "idiomatic": ""
    },
    {
      "id": "s0359",
      "chinese": "八月，崔杼殺高厚。",
      "literal": "In the eighth month, Cui Zhu assassinated Gao Hou.",
      "idiomatic": ""
    },
    {
      "id": "s0360",
      "chinese": "晉聞齊亂，伐齊，至高唐。",
      "literal": "Jin, hearing of the disorder in Qi, attacked Qi and reached Gao Tang.",
      "idiomatic": ""
    },
    {
      "id": "s0361",
      "chinese": "莊公三年，晉大夫欒盈奔齊，莊公厚客待之。",
      "literal": "In Duke Zhuang's third year, the Jin minister Luan Ying fled to Qi, and Duke Zhuang generously entertained him.",
      "idiomatic": ""
    },
    {
      "id": "s0362",
      "chinese": "晏嬰、田文子諫，公弗聽。",
      "literal": "Yan Ying and Tian Wen Zi advised against it, but the duke refused to listen.",
      "idiomatic": ""
    },
    {
      "id": "s0363",
      "chinese": "四年，齊莊公使欒盈閒入晉曲沃為內應，以兵隨之，上太行，入孟門。",
      "literal": "In the fourth year, Duke Zhuang of Qi sent Luan Ying to secretly enter Qu Wo in Jin as an internal ally, with Qi troops following. They ascended Tai Hang Mountain and entered Meng Gate.",
      "idiomatic": ""
    },
    {
      "id": "s0364",
      "chinese": "欒盈敗，齊兵還，取朝歌。",
      "literal": "Luan Ying was defeated, and the Qi troops retreated, capturing Zhao Ge on the way.",
      "idiomatic": ""
    },
    {
      "id": "s0365",
      "chinese": "六年，初，棠公妻好，棠公死，崔杼取之。",
      "literal": "In the sixth year: originally, the wife of Duke Tang was beautiful. After Duke Tang died, Cui Zhu married her.",
      "idiomatic": ""
    },
    {
      "id": "s0368",
      "chinese": "崔杼怒，因其伐晉，欲與晉合謀襲齊而不得閒。",
      "literal": "Cui Zhu was furious. He took advantage of Duke Zhuang's campaign against Jin to conspire with Jin to attack Qi, but could not find the right opportunity.",
      "idiomatic": ""
    },
    {
      "id": "s0369",
      "chinese": "莊公嘗笞宦者賈舉，賈舉復侍，為崔杼閒公以報怨。",
      "literal": "Duke Zhuang had once flogged the eunuch Jia Ju. Jia Ju continued to serve and spied on the duke for Cui Zhu to avenge this grudge.",
      "idiomatic": ""
    },
    {
      "id": "s0370",
      "chinese": "五月，莒子朝齊，齊以甲戌饗之。",
      "literal": "In the fifth month, the ruler of Ju paid homage to Qi. Qi hosted a banquet for him on jia xu day.",
      "idiomatic": ""
    },
    {
      "id": "s0371",
      "chinese": "崔杼稱病不視事。",
      "literal": "Cui Zhu feigned illness and did not attend to official duties.",
      "idiomatic": ""
    },
    {
      "id": "s0372",
      "chinese": "乙亥，公問崔杼病，遂從崔杼妻。",
      "literal": "On yi hai day, the duke went to inquire about Cui Zhu's illness, and then went to see Cui Zhu's wife.",
      "idiomatic": ""
    },
    {
      "id": "s0373",
      "chinese": "崔杼妻入室，與崔杼自閉戶不出，公擁柱而歌。",
      "literal": "Cui Zhu's wife entered the room and, together with Cui Zhu, locked themselves inside and did not come out. The duke embraced a pillar and sang.",
      "idiomatic": ""
    },
    {
      "id": "s0377",
      "chinese": "請自殺於廟，不許。",
      "literal": "He requested to commit suicide in the ancestral temple, but was refused.",
      "idiomatic": ""
    },
    {
      "id": "s0379",
      "chinese": "近於公宮。",
      "literal": "He is confined near the ducal palace.",
      "idiomatic": ""
    },
    {
      "id": "s0381",
      "chinese": "公踰墻，射中公股，公反墜，遂弒之。",
      "literal": "The duke tried to climb the wall to escape. An arrow struck his thigh, he fell back, and they assassinated him.",
      "idiomatic": ""
    },
    {
      "id": "s0384",
      "chinese": "門開而入，枕公尸而哭，三踴而出。",
      "literal": "The gate opened and he entered. He pillowed the duke's corpse and wept, then leaped three times and departed.",
      "idiomatic": ""
    },
    {
      "id": "s0388",
      "chinese": "丁丑，崔杼立莊公異母弟杵臼，是為景公。",
      "literal": "On ding chou day, Cui Zhu installed Zhuang Gong's half-brother Chu Jiu as ruler, who became Duke Jing.",
      "idiomatic": ""
    },
    {
      "id": "s0389",
      "chinese": "景公母，魯叔孫宣伯女也。",
      "literal": "Duke Jing's mother was the daughter of Shu Sun Xuan Bo of Lu.",
      "idiomatic": ""
    },
    {
      "id": "s0390",
      "chinese": "景公立，以崔杼為右相，慶封為左相。",
      "literal": "When Duke Jing ascended the throne, he appointed Cui Zhu as right chancellor and Qing Feng as left chancellor.",
      "idiomatic": ""
    },
    {
      "id": "s0393",
      "chinese": "不肯盟。",
      "literal": "He refused to take the covenant.",
      "idiomatic": ""
    },
    {
      "id": "s0396",
      "chinese": "其弟復書，崔杼復殺之。",
      "literal": "His younger brother wrote the same thing, and Cui Zhu killed him too.",
      "idiomatic": ""
    },
    {
      "id": "s0397",
      "chinese": "少弟復書，崔杼乃捨之。",
      "literal": "The youngest brother wrote the same thing, and Cui Zhu finally let him go.",
      "idiomatic": ""
    },
    {
      "id": "s0398",
      "chinese": "景公元年，初，崔杼生子成及彊，其母死，取東郭女，生明。",
      "literal": "In Duke Jing's first year: originally, Cui Zhu had sons named Cheng and Qiang. Their mother died, so he married a woman from the Dong Guo family who bore him a son named Ming.",
      "idiomatic": ""
    },
    {
      "id": "s0399",
      "chinese": "東郭女使其前夫子無咎與其弟偃相崔氏。",
      "literal": "The Dong Guo woman had her former husband Zi Wu Jiu and her younger brother Yan assist the Cui family.",
      "idiomatic": ""
    },
    {
      "id": "s0400",
      "chinese": "成有罪，二相急治之，立明為太子。",
      "literal": "When Cheng committed a crime, the two chancellors severely punished him and established Ming as crown prince instead.",
      "idiomatic": ""
    },
    {
      "id": "s0402",
      "chinese": "成、彊怒，告慶封。",
      "literal": "Cheng and Qiang, enraged, informed Qing Feng.",
      "idiomatic": ""
    },
    {
      "id": "s0403",
      "chinese": "慶封與崔杼有郤，欲其敗也。",
      "literal": "Qing Feng had enmity with Cui Zhu and wished for his downfall.",
      "idiomatic": ""
    },
    {
      "id": "s0404",
      "chinese": "成、彊殺無咎、偃於崔杼家，家皆奔亡。",
      "literal": "Cheng and Qiang killed Wu Jiu and Yan in Cui Zhu's residence. The entire household fled in panic.",
      "idiomatic": ""
    },
    {
      "id": "s0405",
      "chinese": "崔杼怒，無人，使一宦者御，見慶封。",
      "literal": "Cui Zhu was furious and had no attendants left. He had a single eunuch drive his chariot to see Qing Feng.",
      "idiomatic": ""
    },
    {
      "id": "s0407",
      "chinese": "使崔杼仇盧蒲嫳攻崔氏，殺成、彊，盡滅崔氏，崔杼婦自殺。",
      "literal": "He sent Cui Zhu's enemy Lu Pu Xian to attack the Cui family, killing Cheng and Qiang and exterminating the entire Cui clan. Cui Zhu's wife committed suicide.",
      "idiomatic": ""
    },
    {
      "id": "s0408",
      "chinese": "崔杼毋歸，亦自殺。",
      "literal": "Cui Zhu had nowhere to return to and committed suicide as well.",
      "idiomatic": ""
    }
  ]
}