{
  "metadata": {
    "book": "shiji",
    "chapter": "015",
    "file": "data/shiji/015.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "太史公讀秦記，至犬戎敗幽王，周東徙洛邑，秦襄公始封為諸侯，作西畤用事上帝，僭端見矣。",
      "literal": "When the Grand Historian read the Qin records, reaching the point where the Quanrong defeated King You and Zhou moved east to Luoyi, Duke Xiang of Qin was first enfeoffed as a feudal lord, built the Western Altar to serve the Supreme Deity—the first signs of presumption appeared.",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "《禮》曰：「天子祭天地，諸侯祭其域內名山大川。」",
      "literal": "The Rites say: 'The Son of Heaven sacrifices to Heaven and Earth, feudal lords sacrifice to the famous mountains and great rivers within their domains.'",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "今秦雜戎翟之俗，先暴戾，後仁義，位在藩臣而臚於郊祀，君子懼焉。",
      "literal": "Now Qin mixed the customs of the Rong and Di, putting violence and tyranny first, benevolence and righteousness after. Though positioned as a vassal minister, they performed suburban sacrifices—the gentlemen were alarmed.",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "及文公踰隴，攘夷狄，尊陳寶，營岐雍之閒，而穆公修政，東竟至河，則與齊桓、晉文中國侯伯侔矣。",
      "literal": "When Duke Wen crossed the Long mountains, drove back the Yi and Di barbarians, honored Chen Bao, and camped between Qi and Yong, Duke Mu repaired his government, his eastern border reached the Yellow River, and thus he equaled the central states' feudal lords like Duke Huan of Qi and Duke Wen of Jin.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "是後陪臣執政，大夫世祿，六卿擅晉權，征伐會盟，威重於諸侯。",
      "literal": "After this, attendants took charge of government, grand officers held hereditary stipends, the six ministers monopolized Jin's power, conducting campaigns and alliances, their authority greater than the feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "及田常殺簡公而相齊國，諸侯晏然弗討，海內爭於戰功矣。",
      "literal": "When Tian Chang killed Duke Jian and became chancellor of Qi, the feudal lords were complacently undisturbed, all under Heaven contended for military achievements.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "三國終之卒分晉，田和亦滅齊而有之，六國之盛自此始。",
      "literal": "The three states finally divided Jin, Tian He also extinguished Qi and possessed it—the flourishing of the six states began from this time.",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "務在彊兵并敵，謀詐用而從衡短長之說起。",
      "literal": "Their efforts were devoted to strengthening troops and uniting against enemies, and the sayings of scheming, deception, and the vertical and horizontal alliances of long and short arose from this.",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "矯稱蜂出，誓盟不信，雖置質剖符猶不能約束也。",
      "literal": "False pretenses swarmed like bees, oaths and covenants were not trusted, even placing hostages and splitting tallies could not bind them.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "秦始小國僻遠，諸夏賓之，比於戎翟，至獻公之後常雄諸侯。",
      "literal": "Qin began as a small, remote country, the various Xia treated it as a guest, compared it to the Rong and Di, until after Duke Xian it constantly dominated the feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "論秦之德義不如魯衛之暴戾者，量秦之兵不如三晉之彊也，然卒并天下，非必險固便形勢利也，蓋若天所助焉。",
      "literal": "Discussing Qin's virtue and righteousness as inferior to the violent tyranny of Lu and Wei, measuring Qin's troops as not as strong as the three Jins, yet in the end it united all under Heaven—not necessarily because of dangerous fortifications, convenient terrain, or advantageous positions, but rather as if Heaven assisted it.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "或曰「東方物所始生，西方物之成孰」。",
      "literal": "Some say 'Eastern things begin life there, western things mature there.'",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "夫作事者必於東南，收功實者常於西北。",
      "literal": "Those who initiate affairs must do so in the southeast, those who gather actual merit are constantly in the northwest.",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "故禹興於西羌，湯起於亳，周之王也以豐鎬伐殷，秦之帝用雍州興，漢之興自蜀漢。",
      "literal": "Thus Yu rose from the Western Qiang, Tang arose from Bo, Zhou's kings used Feng and Hao to attack Yin, Qin's emperors used Yong province to rise, Han's rise came from Shu and Han.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "秦既得意，燒天下詩書，諸侯史記尤甚，為其有所刺譏也。",
      "literal": "Qin, having achieved its ambitions, burned the poems and documents of all under Heaven, the feudal lords' historical records especially so, because they contained criticisms.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "詩書所以復見者，多藏人家，而史記獨藏周室，以故滅。",
      "literal": "The reason the poems and documents reappeared was that many were hidden in people's homes, but the historical records were stored only in the Zhou court, so they were destroyed.",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "惜哉，惜哉！",
      "literal": "Alas, alas!",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "獨有秦記，又不載日月，其文略不具。",
      "literal": "Only the Qin records remained, but they did not record dates and months, their text was brief and incomplete.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "然戰國之權變亦有可頗采者，何必上古。",
      "literal": "Yet the stratagems and changes of the Warring States also have much worth adopting—why must it be ancient times?",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "秦取天下多暴，然世異變，成功大。",
      "literal": "Qin took the world with much violence, yet eras change, great success was achieved.",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "傳曰「法後王」，何也？",
      "literal": "The tradition says 'Follow later kings,' why is that?",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "以其近己而俗變相類，議卑而易行也。",
      "literal": "Because they are close to us and their customs and changes are similar, their doctrines are humble and easy to implement.",
      "idiomatic": ""
    },
    {
      "id": "s0023",
      "chinese": "學者牽於所聞，見秦在帝位日淺，不察其終始，因舉而笑之，不敢道，此與以耳食無異。",
      "literal": "Scholars are constrained by what they have heard, seeing Qin in the imperial position for few days, not examining its beginning and end, so they laugh at it, not daring to discuss it—this is no different from eating with the ears.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "悲夫！",
      "literal": "How lamentable!",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "余於是因秦記，踵春秋之後，起周元王，表六國時事，訖二世，凡二百七十年，著諸所聞興壞之端。",
      "literal": "I therefore followed the Qin records, continued after the Spring and Autumn Annals, beginning from King Yuan of Zhou, chronicled the affairs of the six states, ending with the Second Emperor, altogether 270 years, recording the causes of rise and fall that I have heard.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "後有君子，以覽觀焉。",
      "literal": "May future gentlemen use this to observe and reflect.",
      "idiomatic": ""
    },
    {
      "id": "s84",
      "chinese": "公元前",
      "literal": "BCE",
      "idiomatic": ""
    },
    {
      "id": "s85",
      "chinese": "周",
      "literal": "Zhou",
      "idiomatic": ""
    },
    {
      "id": "s86",
      "chinese": "秦",
      "literal": "Qin",
      "idiomatic": ""
    },
    {
      "id": "s87",
      "chinese": "魏",
      "literal": "Wei",
      "idiomatic": ""
    },
    {
      "id": "s88",
      "chinese": "韓",
      "literal": "Han",
      "idiomatic": ""
    },
    {
      "id": "s89",
      "chinese": "趙",
      "literal": "Zhao",
      "idiomatic": ""
    },
    {
      "id": "s90",
      "chinese": "楚",
      "literal": "Chu",
      "idiomatic": ""
    },
    {
      "id": "s91",
      "chinese": "燕",
      "literal": "Yan",
      "idiomatic": ""
    },
    {
      "id": "s92",
      "chinese": "齊",
      "literal": "Qi",
      "idiomatic": ""
    },
    {
      "id": "s93",
      "chinese": "476",
      "literal": "476",
      "idiomatic": ""
    },
    {
      "id": "s94",
      "chinese": "元王元年。",
      "literal": "Yuan Wang first year.",
      "idiomatic": ""
    },
    {
      "id": "s95",
      "chinese": "厲共公元年。",
      "literal": "Li Gong Gong first year.",
      "idiomatic": ""
    },
    {
      "id": "s96",
      "chinese": "獻子。衛出公輒後元年。",
      "literal": "Xian Zi. Wei Chu Gong Zhe later first year.",
      "idiomatic": ""
    },
    {
      "id": "s97",
      "chinese": "宣子",
      "literal": "Xuan Zi",
      "idiomatic": ""
    },
    {
      "id": "s98",
      "chinese": "簡子。四十二。",
      "literal": "Jian Zi. Forty-two.",
      "idiomatic": ""
    },
    {
      "id": "s99",
      "chinese": "惠王章十三年。吳伐我。",
      "literal": "Hui Wang Zhang thirteen years. Wu attacked us.",
      "idiomatic": ""
    },
    {
      "id": "s100",
      "chinese": "獻公十七年。",
      "literal": "Xian Gong seventeen years.",
      "idiomatic": ""
    },
    {
      "id": "s101",
      "chinese": "平公驁五年。",
      "literal": "Ping Gong Ao five years.",
      "idiomatic": ""
    },
    {
      "id": "s102",
      "chinese": "475",
      "literal": "475",
      "idiomatic": ""
    },
    {
      "id": "s103",
      "chinese": "二",
      "literal": "2",
      "idiomatic": ""
    },
    {
      "id": "s104",
      "chinese": "二。蜀人來賂。",
      "literal": "Two. Shu people came with tribute.",
      "idiomatic": ""
    },
    {
      "id": "s105",
      "chinese": "晉定公卒。",
      "literal": "Jin Ding Gong died.",
      "idiomatic": ""
    },
    {
      "id": "s107",
      "chinese": "四十三",
      "literal": "43",
      "idiomatic": ""
    },
    {
      "id": "s108",
      "chinese": "十四。越圍吳，吳怨。",
      "literal": "Fourteen. Yue besieged Wu, Wu resented.",
      "idiomatic": ""
    }
  ]
}