{
  "metadata": {
    "book": "shiji",
    "chapter": "036",
    "file": "data/shiji/036.json"
  },
  "sentences": [
    {
      "id": "s0177",
      "chinese": "舜之後，周武王封之陳，至楚惠王滅之，有世家言。",
      "literal": "Shun's descendants—Zhou's King Wu enfeoffed them at Chen, until King Hui of Chu extinguished them. There are hereditary houses that speak of this.",
      "idiomatic": "Shun's descendants—Zhou's King Wu enfeoffed them at Chen; until King Hui of Chu extinguished them; there are hereditary houses that speak of this."
    },
    {
      "id": "s0178",
      "chinese": "禹之後，周武王封之杞，楚惠王滅之，有世家言。",
      "literal": "Yu's descendants—Zhou's King Wu enfeoffed them at Qi, until King Hui of Chu extinguished them. There are hereditary houses that speak of this.",
      "idiomatic": "Yu's descendants—Zhou's King Wu enfeoffed them at Qi; until King Hui of Chu extinguished them; there are hereditary houses that speak of this."
    },
    {
      "id": "s0179",
      "chinese": "契之後為殷，殷有本紀言。",
      "literal": "Qi's descendants became Yin. Yin has basic annals that speak of this.",
      "idiomatic": "Qi's descendants became Yin; Yin has basic annals that speak of this."
    },
    {
      "id": "s0180",
      "chinese": "殷破，周封其後於宋，齊湣王滅之，有世家言。",
      "literal": "Yin was broken. Zhou enfeoffed their descendants at Song. Duke Min of Qi extinguished them. There are hereditary houses that speak of this.",
      "idiomatic": "Yin was broken; Zhou enfeoffed their descendants at Song; Duke Min of Qi extinguished them; there are hereditary houses that speak of this."
    },
    {
      "id": "s0181",
      "chinese": "后稷之後為周，秦昭王滅之，有本紀言。",
      "literal": "Hou Ji's descendants became Zhou. King Zhao of Qin extinguished them. There are basic annals that speak of this.",
      "idiomatic": "Hou Ji's descendants became Zhou; King Zhao of Qin extinguished them; there are basic annals that speak of this."
    },
    {
      "id": "s0182",
      "chinese": "皋陶之後，或封英、六，楚穆王滅之，無譜。",
      "literal": "Gao Yao's descendants were sometimes enfeoffed at Ying and Liu. King Mu of Chu extinguished them. There is no genealogy.",
      "idiomatic": "Gao Yao's descendants were sometimes enfeoffed at Ying and Liu; King Mu of Chu extinguished them; there is no genealogy."
    },
    {
      "id": "s0183",
      "chinese": "伯夷之後，至周武王復封於齊，曰太公望，陳氏滅之，有世家言。",
      "literal": "Bo Yi's descendants were again enfeoffed at Qi by Zhou's King Wu, called Tai Gong Wang. The Chen clan extinguished them. There are hereditary houses that speak of this.",
      "idiomatic": "Bo Yi's descendants were again enfeoffed at Qi by Zhou's King Wu; called Tai Gong Wang; the Chen clan extinguished them; there are hereditary houses that speak of this."
    },
    {
      "id": "s0184",
      "chinese": "伯翳之後，至周平王時封為秦，項羽滅之，有本紀言。",
      "literal": "Bo Yi's descendants were enfeoffed as Qin during King Ping of Zhou's time. Xiang Yu extinguished them. There are basic annals that speak of this.",
      "idiomatic": "Bo Yi's descendants were enfeoffed as Qin during King Ping of Zhou's time; Xiang Yu extinguished them; there are basic annals that speak of this."
    },
    {
      "id": "s0185",
      "chinese": "垂、益、夔、龍，其後不知所封，不見也。",
      "literal": "Chui, Yi, Kui, and Long—their descendants are not known where they were enfeoffed and are not seen.",
      "idiomatic": ""
    },
    {
      "id": "s0188",
      "chinese": "滕、薛、騶，夏、殷、周之閒封也，小，不足齒列，弗論也。",
      "literal": "Teng, Xue, and Zou were enfeoffed between Xia, Yin, and Zhou. They were small and insufficient to rank with the teeth. They are not discussed.",
      "idiomatic": ""
    },
    {
      "id": "s0189",
      "chinese": "周武王時，侯伯尚千餘人。",
      "literal": "During Zhou's King Wu's time, there were still over a thousand hou and bo.",
      "idiomatic": ""
    },
    {
      "id": "s0190",
      "chinese": "及幽、厲之後，諸侯力攻相并。",
      "literal": "And after You and Li, the feudal lords attacked each other with force and annexed one another.",
      "idiomatic": ""
    },
    {
      "id": "s0193",
      "chinese": "禪位於夏，而後世血食者歷三代。",
      "literal": "He yielded the throne to Xia, and his later generations' blood sacrifices spanned three dynasties.",
      "idiomatic": ""
    },
    {
      "id": "s0194",
      "chinese": "及楚滅陳，而田常得政於齊，卒為建國，百世不絕，苗裔茲茲，有土者不乏焉。",
      "literal": "And when Chu extinguished Chen, Tian Chang obtained government in Qi. He finally established a state that has not ended for a hundred generations. His descendants flourish and flourish. Those with land are not lacking.",
      "idiomatic": ""
    },
    {
      "id": "s0195",
      "chinese": "至禹，於周則杞，微甚，不足數也。",
      "literal": "As for Yu, in Zhou it was Qi. It was extremely tiny and insufficient to count.",
      "idiomatic": ""
    }
  ]
}