{
  "metadata": {
    "book": "shiji",
    "chapter": "058",
    "file": "data/shiji/058.json"
  },
  "sentences": [
    {
      "id": "25-s0196",
      "originalId": "s0196",
      "blockIndex": 25,
      "chinese": "臣請見太后白之。」",
      "literal": "Your servants request to see the empress dowager and inform her."",
      "idiomatic": "We request an audience with the empress dowager to inform her."
    },
    {
      "id": "25-s0197",
      "originalId": "s0197",
      "blockIndex": 25,
      "chinese": "袁盎等入見太后：「太后言欲立梁王，梁王即終，欲誰立？」",
      "literal": "Yuan Ang and others entered to see the empress dowager: "The empress dowager speaks wishing to establish the King of Liang, if the King of Liang should die, wishes to establish whom?"",
      "idiomatic": "Yuan Ang and the others entered to see the empress dowager: "Your Majesty speaks of wishing to establish the King of Liang as heir. If the King of Liang should die, whom does Your Majesty wish to establish?""
    },
    {
      "id": "25-s0198",
      "originalId": "s0198",
      "blockIndex": 25,
      "chinese": "太后曰：「吾復立帝子。」",
      "literal": "The empress dowager said: "I will again establish the emperor"s son."",
      "idiomatic": "The empress dowager said: "I will establish another of the emperor"s sons."
    },
    {
      "id": "25-s0199",
      "originalId": "s0199",
      "blockIndex": 25,
      "chinese": "袁盎等以宋宣公不立正，生禍，禍亂後五世不絕，小不忍害大義狀報太后。",
      "literal": "Yuan Ang and others with Duke Xuan of Song not establishing properly, produced calamity, calamity and chaos after five generations not ceased, little intolerance harming great righteousness, reported to the empress dowager.",
      "idiomatic": "Yuan Ang and the others cited the example of Duke Xuan of Song who did not establish the proper heir, which produced calamity. That calamity and chaos continued for five generations without ceasing. They explained that a little intolerance for personal feelings harms the great righteousness of proper succession, and reported this to the empress dowager."
    },
    {
      "id": "25-s0200",
      "originalId": "s0200",
      "blockIndex": 25,
      "chinese": "太后乃解說，即使梁王歸就國。",
      "literal": "The empress dowager then dispelled her idea, immediately had the King of Liang return to his fief.",
      "idiomatic": "The empress dowager then abandoned her plan and immediately ordered the King of Liang to return to his kingdom."
    },
    {
      "id": "25-s0201",
      "originalId": "s0201",
      "blockIndex": 25,
      "chinese": "而梁王聞其義出於袁盎諸大臣所，怨望，使人來殺袁盎。",
      "literal": "And the King of Liang heard that the righteousness came from Yuan Ang and the various ministers, resented, sent men to come kill Yuan Ang.",
      "idiomatic": "The King of Liang heard that this "righteous" advice came from Yuan Ang and the other ministers. He resented them and sent assassins to kill Yuan Ang."
    },
    {
      "id": "25-s0202",
      "originalId": "s0202",
      "blockIndex": 25,
      "chinese": "袁盎顧之曰：「我所謂袁將軍者也，公得毋誤乎？」",
      "literal": "Yuan Ang looked at him saying: "The one called General Yuan is me, sir has not mistaken?"",
      "idiomatic": "Yuan Ang looked at him and said: "I am the one called General Yuan. Has the gentleman not mistaken me?""
    },
    {
      "id": "25-s0203",
      "originalId": "s0203",
      "blockIndex": 25,
      "chinese": "刺者曰：「是矣！」",
      "literal": "The assassin said: "Correct!"",
      "idiomatic": "The assassin said: "That"s correct!"
    },
    {
      "id": "25-s0204",
      "originalId": "s0204",
      "blockIndex": 25,
      "chinese": "刺之，置其劍，劍著身。",
      "literal": "Stabbed him, left his sword, the sword stuck in the body.",
      "idiomatic": "He stabbed him, left the sword in his body, and fled."
    },
    {
      "id": "25-s0205",
      "originalId": "s0205",
      "blockIndex": 25,
      "chinese": "視其劍，新治。",
      "literal": "Looked at his sword, newly forged.",
      "idiomatic": "They examined the sword—it was newly forged."
    },
    {
      "id": "25-s0206",
      "originalId": "s0206",
      "blockIndex": 25,
      "chinese": "問長安中削厲工，工曰：「梁郎某子來治此劍。」",
      "literal": "Asked Chang"an"s sword sharpening workers, the worker said: "A Liang attendant some son came to forge this sword."",
      "idiomatic": "They questioned the swordsmiths in Chang"an. A worker said: "A young attendant from Liang came to have this sword forged."
    },
    {
      "id": "25-s0207",
      "originalId": "s0207",
      "blockIndex": 25,
      "chinese": "以此知而發覺之，發使者捕逐之。",
      "literal": "With this knew and discovered it, sent envoys to capture and pursue them.",
      "idiomatic": "With this evidence, they knew and uncovered the plot, sending envoys to capture and pursue the assassins."
    },
    {
      "id": "25-s0208",
      "originalId": "s0208",
      "blockIndex": 25,
      "chinese": "獨梁王所欲殺大臣十餘人，文吏窮本之，謀反端頗見。",
      "literal": "Only the King of Liang desired to kill ministers more than ten, the civil officials investigated to the root, rebellion signs much appeared.",
      "idiomatic": "It was discovered that the King of Liang had planned to assassinate more than ten ministers. The civil officials investigated thoroughly and found many signs of rebellious intent."
    },
    {
      "id": "25-s0209",
      "originalId": "s0209",
      "blockIndex": 25,
      "chinese": "太后不食，日夜泣不止。",
      "literal": "The empress dowager did not eat, day and night wept without stopping.",
      "idiomatic": "The empress dowager refused to eat and wept ceaselessly day and night."
    },
    {
      "id": "25-s0210",
      "originalId": "s0210",
      "blockIndex": 25,
      "chinese": "景帝甚憂之，問公卿大臣，大臣以為遣經術吏往治之，乃可解。",
      "literal": "Emperor Jing greatly worried about it, asked the dukes and ministers, ministers considered sending classic versed officials to handle it, then could resolve.",
      "idiomatic": "Emperor Jing was greatly worried and consulted the nobles and ministers. They suggested sending officials versed in the classics to handle the matter, which would resolve it."
    }
  ]
}