{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "22-s0212",
      "originalId": "s0212",
      "blockIndex": 22,
      "chinese": "樂統同，禮別異，禮樂之說貫乎人情矣。",
      "literal": "Music unifies sameness, ritual distinguishes difference; ritual and music's doctrine penetrates human emotion.",
      "idiomatic": ""
    },
    {
      "id": "22-s0213",
      "originalId": "s0213",
      "blockIndex": 22,
      "chinese": "窮本知變，樂之情也；",
      "literal": "Exhausting the root and knowing change, music's essence;",
      "idiomatic": ""
    },
    {
      "id": "22-s0214",
      "originalId": "s0214",
      "blockIndex": 22,
      "chinese": "著誠去偽，禮之經也。",
      "literal": "Manifesting sincerity and removing falsity, ritual's canon.",
      "idiomatic": ""
    },
    {
      "id": "22-s0215",
      "originalId": "s0215",
      "blockIndex": 22,
      "chinese": "禮樂順天地之誠，達神明之德，降興上下之神，而凝是精粗之體，領父子君臣之節。",
      "literal": "Ritual and music follow heaven and earth's sincerity, reach the spirits' virtue, lower and raise the upper and lower spirits, and solidify this refined and coarse body, lead father-son ruler-minister relations.",
      "idiomatic": ""
    },
    {
      "id": "23-s0216",
      "originalId": "s0216",
      "blockIndex": 23,
      "chinese": "是故大人舉禮樂，則天地將為昭焉。",
      "literal": "Therefore when great men raise ritual and music, then heaven and earth will be enlightened.",
      "idiomatic": ""
    },
    {
      "id": "23-s0217",
      "originalId": "s0217",
      "blockIndex": 23,
      "chinese": "天地欣合，陰陽相得，煦嫗覆育萬物，然後草木茂，區萌達，羽翮奮，角觡生，蟄蟲昭穌，羽者嫗伏，毛者孕鬻，胎生者不殰而卵生者不殈，則樂之道歸焉耳。",
      "literal": "Heaven and earth joyfully unite, yin and yang mutually obtain; warm and nourish covering all things; then grasses and trees flourish, sprouts reach, winged ones soar, horned ones grow, hibernating insects become lively; feathered ones brood and nest, furred ones conceive and give birth, viviparous do not miscarry and oviparous do not break; then music's way returns there.",
      "idiomatic": ""
    },
    {
      "id": "24-s0218",
      "originalId": "s0218",
      "blockIndex": 24,
      "chinese": "樂者，非謂黃鐘大呂弦歌干揚也，樂之末節也，故童者舞之；",
      "literal": "Music is not speaking of yellow bell great lü string songs shield axe; music's final section; therefore children dance it;",
      "idiomatic": ""
    },
    {
      "id": "24-s0219",
      "originalId": "s0219",
      "blockIndex": 24,
      "chinese": "布筵席，陳樽俎，列籩豆，以升降為禮者，禮之末節也，故有司掌之。",
      "literal": "Spread mats and seats, arrange goblets and stands, arrange baskets and bowls; taking ascending and descending as ritual; ritual's final section; therefore officials manage it.",
      "idiomatic": ""
    },
    {
      "id": "24-s0220",
      "originalId": "s0220",
      "blockIndex": 24,
      "chinese": "樂師辯乎聲詩，故北面而弦；",
      "literal": "Music masters distinguish sound and poetry, therefore face north and play strings;",
      "idiomatic": ""
    },
    {
      "id": "24-s0221",
      "originalId": "s0221",
      "blockIndex": 24,
      "chinese": "宗祝辯乎宗廟之禮，故後尸；",
      "literal": "Ancestral invokers distinguish ancestral temple ritual, therefore follow the corpse;",
      "idiomatic": ""
    },
    {
      "id": "24-s0222",
      "originalId": "s0222",
      "blockIndex": 24,
      "chinese": "商祝辯乎喪禮，故後主人。",
      "literal": "Funeral invokers distinguish funeral ritual, therefore follow the host.",
      "idiomatic": ""
    },
    {
      "id": "24-s0223",
      "originalId": "s0223",
      "blockIndex": 24,
      "chinese": "是故德成而上，藝成而下；",
      "literal": "Therefore virtue completes and ascends, arts complete and descend;",
      "idiomatic": ""
    },
    {
      "id": "24-s0224",
      "originalId": "s0224",
      "blockIndex": 24,
      "chinese": "行成而先，事成而後。",
      "literal": "Conduct completes and comes first, affairs complete and come later.",
      "idiomatic": ""
    },
    {
      "id": "24-s0225",
      "originalId": "s0225",
      "blockIndex": 24,
      "chinese": "是故先王有上有下，有先有後，然後可以有制於天下也。",
      "literal": "Therefore the former kings had upper and lower, had first and last; then could have regulation over the world.",
      "idiomatic": ""
    },
    {
      "id": "25-s0226",
      "originalId": "s0226",
      "blockIndex": 25,
      "chinese": "樂者，聖人之所樂也，而可以善民心。",
      "literal": "Music is what sages take joy in, and can improve the people's hearts.",
      "idiomatic": ""
    }
  ]
}