{
  "metadata": {
    "book": "shiji",
    "chapter": "026",
    "file": "data/shiji/026.json"
  },
  "sentences": [
    {
      "id": "2-s0016",
      "originalId": "s0016",
      "blockIndex": 2,
      "chinese": "民是以能有信，神是以能有明德。",
      "literal": "People thus able have trust, spirits thus able have bright virtue.",
      "idiomatic": ""
    },
    {
      "id": "2-s0017",
      "originalId": "s0017",
      "blockIndex": 2,
      "chinese": "民神異業，敬而不瀆，故神降之嘉生，民以物享，災禍不生，所求不匱。",
      "literal": "People spirits different occupations, respect and not profane, therefore spirits descend auspicious births, people with things enjoy, disaster calamities not born, what sought not deficient.",
      "idiomatic": ""
    },
    {
      "id": "3-s0018",
      "originalId": "s0018",
      "blockIndex": 3,
      "chinese": "少暤氏之衰也，九黎亂德，民神雜擾，不可放物，禍菑薦至，莫盡其氣。",
      "literal": "Shaohao clan of decline also, Nine Li chaotic virtue, people spirits mixed disturbance, cannot release things, calamities repeatedly arrive, not exhaust their qi.",
      "idiomatic": ""
    },
    {
      "id": "3-s0019",
      "originalId": "s0019",
      "blockIndex": 3,
      "chinese": "顓頊受之，乃命南正重司天以屬神，命火正黎司地以屬民，使復舊常，無相侵瀆。",
      "literal": "Zhuanzu received it, thereupon commanded southern correct Chong govern heaven to belong spirits, commanded fire correct Li govern earth to belong people, made restore old constant, no mutually invade profane.",
      "idiomatic": ""
    },
    {
      "id": "4-s0020",
      "originalId": "s0020",
      "blockIndex": 4,
      "chinese": "其後三苗服九黎之德，故二官咸廢所職，而閏餘乖次，孟陬殄滅，攝提無紀，歷數失序。",
      "literal": "Their after Three Miao imitated Nine Li virtue, therefore two officials all abandoned their duties, and intercalary remainder wrong sequence, first month extinguished, Sheti no record, calendar numbers lost order.",
      "idiomatic": ""
    },
    {
      "id": "4-s0021",
      "originalId": "s0021",
      "blockIndex": 4,
      "chinese": "堯復遂重黎之後，不忘舊者，使復典之，而立羲和之官。",
      "literal": "Yao again continued Chong Li descendants, not forgot old ones, made again manage it, and established Xi He officials.",
      "idiomatic": ""
    },
    {
      "id": "4-s0022",
      "originalId": "s0022",
      "blockIndex": 4,
      "chinese": "明時正度，則陰陽調，風雨節，茂氣至，民無夭疫。",
      "literal": "Bright time correct measure, then yin yang harmonize, wind rain moderate, luxuriant qi arrives, people no premature epidemics.",
      "idiomatic": ""
    },
    {
      "id": "4-s0023",
      "originalId": "s0023",
      "blockIndex": 4,
      "chinese": "年耆禪舜，申戒文祖，云「天之歷數在爾躬」。",
      "literal": "Year old abdicated Shun, repeatedly admonished cultured ancestors, said \"heaven calendar numbers in your person\".",
      "idiomatic": ""
    },
    {
      "id": "4-s0024",
      "originalId": "s0024",
      "blockIndex": 4,
      "chinese": "舜亦以命禹。",
      "literal": "Shun also with commanded Yu.",
      "idiomatic": ""
    },
    {
      "id": "4-s0025",
      "originalId": "s0025",
      "blockIndex": 4,
      "chinese": "由是觀之，王者所重也。",
      "literal": "From this observe it, kings what value also.",
      "idiomatic": ""
    },
    {
      "id": "5-s0026",
      "originalId": "s0026",
      "blockIndex": 5,
      "chinese": "夏正以正月，殷正以十二月，周正以十一月。",
      "literal": "Xia calendar with first month, Yin calendar with twelfth month, Zhou calendar with eleventh month.",
      "idiomatic": ""
    },
    {
      "id": "5-s0027",
      "originalId": "s0027",
      "blockIndex": 5,
      "chinese": "蓋三王之正若循環，窮則反本。",
      "literal": "Indeed three kings calendar like cycle, exhausted then return root.",
      "idiomatic": ""
    },
    {
      "id": "5-s0028",
      "originalId": "s0028",
      "blockIndex": 5,
      "chinese": "天下有道，則不失紀序；",
      "literal": "Realm has way, then not lose record sequence;",
      "idiomatic": ""
    },
    {
      "id": "5-s0029",
      "originalId": "s0029",
      "blockIndex": 5,
      "chinese": "無道，則正朔不行於諸侯。",
      "literal": "Without the Way, the correct calendar does not circulate among the feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "6-s0030",
      "originalId": "s0030",
      "blockIndex": 6,
      "chinese": "幽、厲之後，周室微，陪臣執政，史不記時，君不告朔，故疇人子弟分散，或在諸夏，或在夷狄，是以其禨祥廢而不統。",
      "literal": "You, Li after, Zhou chamber weak, attendant ministers seized government, historians not record time, lords not announce new moon, therefore calendar officials sons dispersed, some in various Xia, some in Yi Di, therefore their good omens abandoned and not united.",
      "idiomatic": ""
    }
  ]
}