{
  "metadata": {
    "book": "shiji",
    "chapter": "026",
    "file": "data/shiji/026.json"
  },
  "sentences": [
    {
      "id": "6-s0031",
      "originalId": "s0031",
      "blockIndex": 6,
      "chinese": "周襄王二十六年閏三月，而春秋非之。",
      "literal": "Zhou Xiang King twenty six year intercalary third month, and Spring Autumns criticized it.",
      "idiomatic": ""
    },
    {
      "id": "6-s0032",
      "originalId": "s0032",
      "blockIndex": 6,
      "chinese": "先王之正時也，履端於始，舉正於中，歸邪於終。",
      "literal": "Former kings correct time also, step beginning at start, raise correct at middle, return evil at end.",
      "idiomatic": ""
    },
    {
      "id": "6-s0033",
      "originalId": "s0033",
      "blockIndex": 6,
      "chinese": "履端於始，序則不愆；",
      "literal": "Step beginning at start, sequence then not err;",
      "idiomatic": ""
    },
    {
      "id": "6-s0034",
      "originalId": "s0034",
      "blockIndex": 6,
      "chinese": "舉正於中，民則不惑；",
      "literal": "Raise correct at middle, people then not confused;",
      "idiomatic": ""
    },
    {
      "id": "6-s0035",
      "originalId": "s0035",
      "blockIndex": 6,
      "chinese": "歸邪於終，事則不悖。",
      "literal": "Return evil at end, affairs then not contrary.",
      "idiomatic": ""
    },
    {
      "id": "7-s0036",
      "originalId": "s0036",
      "blockIndex": 7,
      "chinese": "其後戰國并爭，在於彊國禽敵，救急解紛而已，豈遑念斯哉！",
      "literal": "Their after Warring States merged contended, existed in strong states capture enemies, save urgent resolve disputes only, how leisure think this!",
      "idiomatic": ""
    },
    {
      "id": "7-s0037",
      "originalId": "s0037",
      "blockIndex": 7,
      "chinese": "是時獨有鄒衍，明於五德之傳，而散消息之分，以顯諸侯。",
      "literal": "This time alone had Zou Yan, clear about five virtues transmission, and scattered wax wane divisions, to display feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "7-s0038",
      "originalId": "s0038",
      "blockIndex": 7,
      "chinese": "而亦因秦滅六國，兵戎極煩，又升至尊之日淺，未暇遑也。",
      "literal": "And also because Qin extinguished six states, weapons extremely troublesome, moreover ascended supreme days shallow, not leisure time also.",
      "idiomatic": ""
    },
    {
      "id": "7-s0039",
      "originalId": "s0039",
      "blockIndex": 7,
      "chinese": "而亦頗推五勝，而自以為獲水德之瑞，更名河曰「德水」，而正以十月，色上黑。",
      "literal": "And also somewhat extended five victories, and self considered obtained water virtue auspiciousness, changed name river called \"virtue water\", and calendar with tenth month, color top black.",
      "idiomatic": ""
    },
    {
      "id": "7-s0040",
      "originalId": "s0040",
      "blockIndex": 7,
      "chinese": "然歷度閏餘，未能睹其真也。",
      "literal": "Yet calendar measure intercalary remainder, not able see their truth also.",
      "idiomatic": ""
    },
    {
      "id": "8-s0041",
      "originalId": "s0041",
      "blockIndex": 8,
      "chinese": "漢興，高祖曰「北畤待我而起」，亦自以為獲水德之瑞。",
      "literal": "Han rose, Gaozu said \"northern altar awaited me and arose\", also self considered obtained water virtue auspiciousness.",
      "idiomatic": ""
    },
    {
      "id": "8-s0042",
      "originalId": "s0042",
      "blockIndex": 8,
      "chinese": "雖明習歷及張蒼等，咸以為然。",
      "literal": "Though bright practiced calendar and Zhang Cang etc, all considered it so.",
      "idiomatic": ""
    },
    {
      "id": "8-s0043",
      "originalId": "s0043",
      "blockIndex": 8,
      "chinese": "是時天下初定，方綱紀大基，高后女主，皆未遑，故襲秦正朔服色。",
      "literal": "This time realm newly settled, just establishing laws great foundation, Empress Gao female ruler, all not leisure, therefore inherited Qin calendar new moon clothing colors.",
      "idiomatic": ""
    },
    {
      "id": "9-s0044",
      "originalId": "s0044",
      "blockIndex": 9,
      "chinese": "至孝文時，魯人公孫臣以終始五德上書，言「漢得土德，宜更元，改正朔，易服色。",
      "literal": "Until Filial Wen time, Lu person Gongsun Chen with end beginning five virtues memorialized, said \"Han obtained earth virtue, should change yuan, correct new moon, change clothing colors.",
      "idiomatic": ""
    },
    {
      "id": "9-s0045",
      "originalId": "s0045",
      "blockIndex": 9,
      "chinese": "當有瑞，瑞黃龍見」。",
      "literal": "Should have auspiciousness, auspiciousness yellow dragon appear\".",
      "idiomatic": ""
    }
  ]
}