{
  "metadata": {
    "book": "shiji",
    "chapter": "023",
    "file": "data/shiji/023.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "太史公曰：洋洋美德乎！",
      "literal": "The Grand Historian said: How vast and beautiful is virtue!",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "宰制萬物，役使群眾，豈人力也哉？",
      "literal": "To control all things and employ the multitudes, how can this be done by human strength alone?",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "余至大行禮官，觀三代損益，乃知緣人情而制禮，依人性而作儀，其所由來尚矣。",
      "literal": "I came to the Grand Ceremonial Office and observed the gains and losses of the Three Dynasties, and thus knew that rites are established according to human feelings, and ceremonies are made according to human nature—their origins are ancient indeed.",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "人道經緯萬端，規矩無所不貫，誘進以仁義，束縛以刑罰，故德厚者位尊，祿重者寵榮，所以總一海內而整齊萬民也。",
      "literal": "Human affairs have myriad aspects, yet regulations must penetrate everything. People are guided forward with benevolence and righteousness, restrained with punishments. Thus those with profound virtue receive honored positions; those with heavy merit receive glorious rewards. This serves to unify the empire and regulate the myriad people.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "人體安駕乘，為之金輿錯衡以繁其飾；",
      "literal": "The human body delights in riding carriages, so golden chariots with inlaid yokes are made to enrich their adornment;",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "目好五色，為之黼黻文章以表其能；",
      "literal": "The eyes delight in the five colors, so embroidered patterns and designs are made to display their beauty;",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "耳樂鐘磬，為之調諧八音以蕩其心；",
      "literal": "The ears delight in bells and chimes, so the eight sounds are tuned to move their hearts;",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "口甘五味，為之庶羞酸咸以致其美；",
      "literal": "The mouth delights in the five flavors, so many delicacies of sour and salty are prepared to bring out their excellence;",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "情好珍善，為之琢磨圭璧以通其意。",
      "literal": "The emotions delight in treasures and goodness, so jade disks are polished to communicate their intentions.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "故大路越席，皮弁布裳，朱弦洞越，大羹玄酒，所以防其淫侈，救其彫敝。",
      "literal": "Therefore the great chariot and reed mat, the leather bonnet and cloth robe, the vermilion strings and penetrating tones, the great broth and plain wine—these all serve to prevent licentious extravagance and save from decay.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "是以君臣朝廷尊卑貴賤之序，下及黎庶車輿衣服宮室飲食嫁娶喪祭之分，事有宜適，物有節文。",
      "literal": "Thus the order of ruler and minister, court and official, honored and humble, noble and base—extending down to the common people with their carriages and clothing, palaces and chambers, food and drink, marriage and burial, mourning and sacrifice—each matter has what is suitable, each thing has its regulated form.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "仲尼曰：「褅自既灌而往者，吾不欲觀之矣。」",
      "literal": "Confucius said: 'For the sacrifice at the ancestral temple, once the libation has been poured, I no longer wish to watch it.'",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "周衰，禮廢樂壞，大小相踰，管仲之家，兼備三歸。",
      "literal": "When Zhou declined, rites were abandoned and music corrupted, great and small overstepped each other; Guan Zhong's household possessed the three returns in combination.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "循法守正者見侮於世，奢溢僭差者謂之顯榮。",
      "literal": "Those who followed the law and maintained correctness were insulted by the world, those who were extravagant and presumptuous were called glorious.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "自子夏，門人之高弟也，猶云「出見紛華盛麗而說，入聞夫子之道而樂，二者心戰，未能自決」，而況中庸以下，漸漬於失教，被服於成俗乎？",
      "literal": "Even Zi Xia, Confucius's most eminent disciple, still said: 'Going out I see the splendor and magnificence and am pleased; coming in I hear the Master's way and am joyful—these two battle in my heart, and I cannot decide myself.' Moreover, those of mediocre capacity and below gradually became soaked in lost teachings and clothed in established customs—what then?",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "孔子曰「必也正名」，於衛所居不合。",
      "literal": "Confucius said 'It is essential to correct names', but in Wei his dwelling was not in accord.",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "仲尼沒後，受業之徒沈湮而不舉，或適齊、楚，或入河海，豈不痛哉！",
      "literal": "After Confucius passed away, his disciples who received his teachings sank into obscurity and were not raised up; some went to Qi or Chu, some entered the rivers and seas—how painful it is!",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "至秦有天下，悉內六國禮儀，采擇其善，雖不合聖制，其尊君抑臣，朝廷濟濟，依古以來。",
      "literal": "When Qin possessed the empire, it took in all the rites and ceremonies of the six states, selecting their good points; although not in accord with the sage's system, it honored the ruler and suppressed ministers, the court was orderly, following ancient ways.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "至于高祖，光有四海，叔孫通頗有所增益減損，大抵皆襲秦故。",
      "literal": "Coming to Gaozu, who possessed the four seas, Shu Sun Tong considerably added to and reduced the rites, but on the whole they all inherited Qin's old ways.",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "自天子稱號下至佐僚及宮室官名，少所變改。",
      "literal": "From the emperor's title downward to aides and officials, and the names of palaces and offices, few were changed.",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "孝文即位，有司議欲定儀禮，孝文好道家之學，以為繁禮飾貌，無益於治，躬化謂何耳，故罷去之。",
      "literal": "When Filial Wen ascended the throne, the officials discussed wanting to establish ceremonial rites; Filial Wen delighted in Daoist learning, considering elaborate rites and adorned appearances useless for governance, how could personal transformation be done?—thus he dismissed it.",
      "idiomatic": ""
    },
    {
      "id": "s0023",
      "chinese": "孝景時，御史大夫晁錯明於世務刑名，數干諫孝景曰：「諸侯藩輔，臣子一例，古今之制也。",
      "literal": "In Filial Jing's time, Imperial Secretary Chun Cuo was clear about worldly affairs and legalist names, repeatedly remonstrated Filial Jing saying: 'The nobles are bulwarks, ministers and sons are one example, this is the system of ancient and modern times.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "今大國專治異政，不稟京師，恐不可傳後。」",
      "literal": "Now the great states monopolize different governance, not receiving from the capital, I fear it cannot be transmitted to posterity.'",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "孝景用其計，而六國畔逆，以錯首名，天子誅錯以解難。",
      "literal": "Filial Jing used his plan, and the six states rebelled in defiance, with Cuo as the first named, the Son of Heaven executed Cuo to resolve the difficulty.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "事在袁盎語中。",
      "literal": "The matter is in Yuan Ang's biography.",
      "idiomatic": ""
    },
    {
      "id": "s0027",
      "chinese": "是後官者養交安祿而已，莫敢復議。",
      "literal": "After this, officials nourished connections and secured salaries, none dared discuss again.",
      "idiomatic": ""
    },
    {
      "id": "s0028",
      "chinese": "今上即位，招致儒術之士，令共定儀，十餘年不就。",
      "literal": "Now when the present emperor ascended, he summoned Confucian scholars, ordered them to jointly establish ceremonies, over ten years not completed.",
      "idiomatic": ""
    },
    {
      "id": "s0029",
      "chinese": "或言古者太平，萬民和喜，瑞應辨至，乃采風俗，定制作。",
      "literal": "Some said in ancient times when there was great peace, the myriad people were harmonious and joyful, auspicious responses clearly arrived, then they gathered customs, established the system of making.",
      "idiomatic": ""
    },
    {
      "id": "s0030",
      "chinese": "上聞之，制詔御史曰：「蓋受命而王，各有所由興，殊路而同歸，謂因民而作，追俗為制也。",
      "literal": "The emperor heard this, issued an edict to the Imperial Secretary saying: 'Receiving the mandate and becoming king, each has its origin for rising, different paths but same destination, called following the people and making, pursuing customs to establish the system.",
      "idiomatic": ""
    },
    {
      "id": "s0031",
      "chinese": "議者咸稱太古，百姓何望？",
      "literal": "The discussers all praise great antiquity—what do the common people hope for?",
      "idiomatic": ""
    },
    {
      "id": "s0032",
      "chinese": "漢亦一家之事，典法不傳，謂子孫何？",
      "literal": "Han is also one family's matter, classical laws not transmitted—what to tell descendants?",
      "idiomatic": ""
    },
    {
      "id": "s0033",
      "chinese": "化隆者閎博，治淺者褊狹，可不勉與！」",
      "literal": "Those with flourishing transformation are broad and expansive, those with shallow governance are narrow and petty—can we not strive for it!'",
      "idiomatic": ""
    },
    {
      "id": "s0034",
      "chinese": "乃以太初之元改正朔，易服色，封太山，定宗廟百官之儀，以為典常，垂之於後云。",
      "literal": "Thus with the Tai Chu era they corrected the calendar, changed the robe colors, sealed Mount Tai, established the ancestral temple and hundred officials' ceremonies, to serve as eternal standards, handing them down to posterity.",
      "idiomatic": ""
    },
    {
      "id": "s0035",
      "chinese": "禮由人起。",
      "literal": "Rites arise from people.",
      "idiomatic": ""
    },
    {
      "id": "s0036",
      "chinese": "人生有欲，欲而不得則不能無忿，忿而無度量則爭，爭則亂。",
      "literal": "People are born with desires; desiring but not obtaining cannot but cause resentment, resentment without measure leads to contention, contention leads to disorder.",
      "idiomatic": ""
    },
    {
      "id": "s0037",
      "chinese": "先王惡其亂，故制禮義以養人之欲，給人之求，使欲不窮於物，物不屈於欲，二者相待而長，是禮之所起也。",
      "literal": "The former kings hated this disorder, thus established rites and righteousness to nourish people's desires, supply people's needs, make desires not exhaust things, things not bend to desires—the two support each other and grow, this is where rites arise.",
      "idiomatic": ""
    },
    {
      "id": "s0038",
      "chinese": "故禮者養也。",
      "literal": "Thus rites are nourishment.",
      "idiomatic": ""
    },
    {
      "id": "s0039",
      "chinese": "稻粱五味，所以養口也；",
      "literal": "Rice and millet, the five flavors—these nourish the mouth;",
      "idiomatic": ""
    },
    {
      "id": "s0040",
      "chinese": "椒蘭芬茝，所以養鼻也；",
      "literal": "Pepper and orchids, fragrant iris—these nourish the nose;",
      "idiomatic": ""
    },
    {
      "id": "s0041",
      "chinese": "鐘鼓管弦，所以養耳也；",
      "literal": "Bells and drums, pipes and strings—these nourish the ears;",
      "idiomatic": ""
    },
    {
      "id": "s0042",
      "chinese": "刻鏤文章，所以養目也；",
      "literal": "Carved and inlaid designs—these nourish the eyes;",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "疏房床笫几席，所以養體也：故禮者養也。",
      "literal": "Spacious chambers, beds and mats, tables and mats—these nourish the body: thus rites are nourishment.",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "君子既得其養，又好其辨也。",
      "literal": "The gentleman having obtained his nourishment, moreover delights in its distinctions.",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "所謂辨者，貴賤有等，長少有差，貧富輕重皆有稱也。",
      "literal": "What are called distinctions: noble and base have ranks, elder and younger have differences, rich and poor, light and heavy all have their proper measure.",
      "idiomatic": ""
    },
    {
      "id": "s0046",
      "chinese": "故天子大路越席，所以養體也；",
      "literal": "Thus the emperor's great chariot and reed mat nourish the body;",
      "idiomatic": ""
    },
    {
      "id": "s0047",
      "chinese": "側載臭茝，所以養鼻也；",
      "literal": "Carrying fragrant iris on the side nourishes the nose;",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "前有錯衡，所以養目也；",
      "literal": "Having inlaid yokes in front nourishes the eyes;",
      "idiomatic": ""
    },
    {
      "id": "s0049",
      "chinese": "和鸞之聲，步中武象，驟中韶濩，所以養耳也；",
      "literal": "The harmonious bell sounds, steps accord with Wu and Xiang, gallops accord with Shao and Hua—these nourish the ears;",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "龍旂九斿，所以養信也；",
      "literal": "The dragon banner with nine streamers nourishes trust;",
      "idiomatic": ""
    },
    {
      "id": "s0051",
      "chinese": "寢兕持虎，鮫韅彌龍，所以養威也。",
      "literal": "Sleeping rhinoceros holding tiger, shark skin dragon scales—so nourish awe.",
      "idiomatic": ""
    }
  ]
}