{
  "metadata": {
    "book": "shiji",
    "chapter": "028",
    "file": "data/shiji/028.json"
  },
  "sentences": [
    {
      "id": "s0716",
      "chinese": "上親禮祠上帝焉。",
      "literal": "The emperor personally performed rites and sacrificed to the Supreme Deity there.",
      "idiomatic": ""
    },
    {
      "id": "s0718",
      "chinese": "天子既令設祠具，至東泰山，［東］泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
      "literal": "The Son of Heaven had already commanded the setting up of sacrifice equipment, arrived at East Tai Mountain; East Tai Mountain was low and small, not matching its reputation, so he commanded the sacrifice officials to perform rites to it, but did not perform feng shan there.",
      "idiomatic": ""
    },
    {
      "id": "s0719",
      "chinese": "其後令帶奉祠候神物。",
      "literal": "Afterwards he commanded Dai to serve the sacrifice and await spirit things.",
      "idiomatic": ""
    },
    {
      "id": "s0720",
      "chinese": "夏，遂還泰山，修五年之禮如前，而加以禪祠石閭。",
      "literal": "In summer, he then returned to Tai Mountain, performed the five-year rites like before, and added a shan sacrifice at Stone Gate.",
      "idiomatic": ""
    },
    {
      "id": "s0721",
      "chinese": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。",
      "literal": "Stone Gate was at Tai Mountain's lower zi in the south; the method masters often said this was the gate of the immortal people, therefore the emperor personally performed shan there.",
      "idiomatic": ""
    },
    {
      "id": "s0722",
      "chinese": "其後五年，復至泰山修封。",
      "literal": "Five years later, he again arrived at Tai Mountain and repaired the feng.",
      "idiomatic": ""
    },
    {
      "id": "s0723",
      "chinese": "還過祭恒山。",
      "literal": "On his return he passed by and sacrificed at Heng Mountain.",
      "idiomatic": ""
    },
    {
      "id": "s0724",
      "chinese": "今天子所興祠，太一、后土，三年親郊祠，建漢家封禪，五年一修封。",
      "literal": "Now the sacrifices established by the Son of Heaven were Tai Yi and Hou Tu; every three years he personally performed suburban sacrifices, established the Han house feng shan, and every five years once repaired the feng.",
      "idiomatic": ""
    },
    {
      "id": "s0725",
      "chinese": "薄忌太一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
      "literal": "Bo Ji Tai Yi and the Three Ones, Dark Sheep, Horse Travel, Red Star—five in total—Kuan Shu's sacrifice officials presented rites according to the seasons of the year.",
      "idiomatic": ""
    },
    {
      "id": "s0726",
      "chinese": "凡六祠，皆太祝領之。",
      "literal": "Altogether six sacrifices, all were led by the Grand Blessing.",
      "idiomatic": ""
    },
    {
      "id": "s0727",
      "chinese": "至如八神諸神，明年、凡山他名祠，行過則祠，行去則已。",
      "literal": "As for the eight spirits and various spirits, Welcoming Year, Fan Mountain and other named sacrifices, when he traveled past them he sacrificed, when he traveled on he stopped.",
      "idiomatic": ""
    },
    {
      "id": "s0728",
      "chinese": "方士所興祠，各自主，其人終則已，祠官不主。",
      "literal": "The sacrifices established by method masters, each was self-managed; when the person ended, then it stopped; the sacrifice officials did not manage them.",
      "idiomatic": ""
    },
    {
      "id": "s0729",
      "chinese": "他祠皆如其故。",
      "literal": "Other sacrifices were all as before.",
      "idiomatic": ""
    },
    {
      "id": "s0730",
      "chinese": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
      "literal": "Now the emperor performed feng shan; twelve years later he returned, having been universal to the five peaks and four waterways.",
      "idiomatic": ""
    },
    {
      "id": "s0731",
      "chinese": "而方士之候祠神人，入海求蓬萊，終無有驗。",
      "literal": "And the method masters who awaited and sacrificed to spirit people, entered the sea seeking Peng Lai, but in the end none had verification.",
      "idiomatic": ""
    },
    {
      "id": "s0732",
      "chinese": "而公孫卿之候神者，猶以大人之跡為解，無有效。",
      "literal": "And Gong Sun Qing's spirit-awaiters still used the tracks of great persons as explanations, but none had any effect.",
      "idiomatic": ""
    },
    {
      "id": "s0733",
      "chinese": "天子益怠厭方士之怪迂語矣，然羈縻不絕，冀遇其真。",
      "literal": "The Son of Heaven increasingly grew weary and disgusted with the method masters' strange and circuitous words, however he kept them restrained but not cut off, hoping to encounter their true ones.",
      "idiomatic": ""
    },
    {
      "id": "s0734",
      "chinese": "自此之後，方士言神祠者彌眾，然其效可睹矣。",
      "literal": "From this time afterwards, the method masters who spoke of spirit sacrifices became increasingly many, however their effects could be clearly seen.",
      "idiomatic": ""
    },
    {
      "id": "s0736",
      "chinese": "入壽宮侍祠神語，究觀方士祠官之意，於是退而論次自古以來用事於鬼神者，具見其表裏。",
      "literal": "I entered the Longevity Palace and served the sacrifice spirit words; I thoroughly observed the intentions of the method masters and sacrifice officials; thereupon I withdrew and arranged in order those who had used matters with ghosts and spirits from ancient times onward, fully seeing their exterior and interior.",
      "idiomatic": ""
    },
    {
      "id": "s0737",
      "chinese": "後有君子，得以覽焉。",
      "literal": "Afterwards, superior men could obtain to view it there.",
      "idiomatic": ""
    },
    {
      "id": "s0738",
      "chinese": "若至俎豆珪幣之詳，獻酬之禮，則有司存。",
      "literal": "If it comes to the details of zu, dou, gui, and bi, the rites of xian and chou, then the officials preserve them.",
      "idiomatic": ""
    }
  ]
}