{
  "metadata": {
    "book": "shiji",
    "chapter": "043",
    "file": "data/shiji/043.json"
  },
  "sentences": [
    {
      "id": "s0540",
      "chinese": "趙與之陘，合軍曲陽，攻取丹丘、華陽、鴟之塞。",
      "literal": "Zhao met them at Xing, combined the army at Qu Yang, and attacked to take Dan Qiu, Hua Yang, and Chi's barrier.",
      "idiomatic": "Zhao engaged them at Xing, concentrated forces at Quyang, and attacked to capture Danqiu, Huayang, and the Chi pass."
    },
    {
      "id": "s0541",
      "chinese": "王軍取鄗、石邑、封龍、東垣。",
      "literal": "The Wang's army took Hao, Shi Yi, Feng Long, and Dong Yuan.",
      "idiomatic": "The king's army captured Hao, Shiyi, Fenglong, and Dongyuan."
    },
    {
      "id": "s0542",
      "chinese": "中山獻四邑和，王許之，罷兵。",
      "literal": "Zhongshan offered four cities for peace. The Wang permitted it and stopped the troops.",
      "idiomatic": ""
    },
    {
      "id": "s0543",
      "chinese": "二十三年，攻中山。",
      "literal": "In the twenty-third year, he attacked Zhongshan.",
      "idiomatic": ""
    },
    {
      "id": "s0544",
      "chinese": "二十五年，惠后卒。",
      "literal": "In the twenty-fifth year, Hui Hou died.",
      "idiomatic": ""
    },
    {
      "id": "s0545",
      "chinese": "使周袑胡服傅王子何。",
      "literal": "He sent Zhou Shan, who was Hu clothed, to instruct Prince Zi He.",
      "idiomatic": ""
    },
    {
      "id": "s0546",
      "chinese": "二十六年，復攻中山，攘地北至燕、代，西至雲中、九原。",
      "literal": "In the twenty-sixth year, he again attacked Zhongshan and seized lands north to Yan and Dai, west to Yun Zhong and Jiu Yuan.",
      "idiomatic": ""
    },
    {
      "id": "s0547",
      "chinese": "二十七年五月戊申，大朝於東宮，傳國，立王子何以為王。",
      "literal": "In the twenty-seventh year, fifth month, Wu Shen, great court at the east palace, transmitted the state, and established Prince Zi He as Wang.",
      "idiomatic": ""
    },
    {
      "id": "s0548",
      "chinese": "王廟見禮畢，出臨朝。",
      "literal": "The Wang had temple audience, rites finished, and went out to attend court.",
      "idiomatic": ""
    },
    {
      "id": "s0549",
      "chinese": "大夫悉為臣，肥義為相國，并傅王。",
      "literal": "All grandees became ministers. Fei Yi became chancellor and together instructed the Wang.",
      "idiomatic": ""
    },
    {
      "id": "s0550",
      "chinese": "是為惠文王。",
      "literal": "This was Hui Wen Wang.",
      "idiomatic": ""
    },
    {
      "id": "s0551",
      "chinese": "惠文王，惠后吳娃子也。",
      "literal": "Hui Wen Wang was Hui Hou Wu Wa's son.",
      "idiomatic": ""
    },
    {
      "id": "s0552",
      "chinese": "武靈王自號為主父。",
      "literal": "Wu Ling Wang self-called himself Lord Father.",
      "idiomatic": ""
    },
    {
      "id": "s0553",
      "chinese": "主父欲令子主治國，而身胡服將士大夫西北略胡地，而欲從雲中、九原直南襲秦，於是詐自為使者入秦。",
      "literal": "Lord Father desired to make his son mainly govern the country, but himself, Hu clothed, led the scholar officials to raid Hu lands northwest, and desired to attack Qin straight south from Yun Zhong and Jiu Yuan. Thereupon he deceived himself as an envoy and entered Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0554",
      "chinese": "秦昭王不知，已而怪其狀甚偉，非人臣之度，使人逐之，而主父馳已脫關矣。",
      "literal": "Qin Zhao Wang did not know. Afterwards he was strange at his very great appearance, not a minister's measure. He sent people to pursue him, but Lord Father had already galloped and escaped the pass.",
      "idiomatic": ""
    }
  ]
}