{
  "metadata": {
    "book": "shiji",
    "chapter": "097",
    "file": "data/shiji/097.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "酈生食其者，陳留高陽人也。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "好讀書，家貧落魄，無以為衣食業，為里監門吏。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "然縣中賢豪不敢役，縣中皆謂之狂生。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "及陳勝、項梁等起，諸將徇地過高陽者數十人，酈生聞其將皆握齱好苛禮自用，不能聽大度之言，酈生乃深自藏匿。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "後聞沛公將兵略地陳留郊，沛公麾下騎士適酈生裏中子也，沛公時時問邑中賢士豪俊。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "騎士歸，酈生見謂之曰：「吾聞沛公慢而易人，多大略，此真吾所願從游，莫為我先。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "若見沛公，謂曰『臣里中有酈生，年六十餘，長八尺，人皆謂之狂生，生自謂我非狂生』。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "騎士曰：「沛公不好儒，諸客冠儒冠來者，沛公輒解其冠，溲溺其中。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "與人言，常大罵。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "未可以儒生說也。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "酈生曰：「弟言之。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "騎士從容言如酈生所誡者。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "沛公至高陽傳舍，使人召酈生。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "酈生至，入謁，沛公方倨床使兩女子洗足，而見酈生。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "酈生入，則長揖不拜，曰：「足下欲助秦攻諸侯乎？",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "且欲率諸侯破秦也？」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "沛公罵曰：「豎儒！",
      "literal": "Pei Gong curse say: Low Confucian!",
      "idiomatic": "Pei Gong cursed and said: 'Lowly Confucian!'"
    },
    {
      "id": "s0018",
      "chinese": "夫天下同苦秦久矣，故諸侯相率而攻秦，何謂助秦攻諸侯乎？」",
      "literal": "Indeed all under heaven together suffer Qin long, therefore feudal lords mutually lead and attack Qin, what call help Qin attack feudal lords?",
      "idiomatic": "'Indeed all under heaven have suffered under Qin for a long time, therefore the feudal lords are leading each other to attack Qin. How does this mean helping Qin attack the feudal lords?'"
    },
    {
      "id": "s0019",
      "chinese": "酈生曰：「必聚徒合義兵誅無道秦，不宜倨見長者。」",
      "literal": "Li Sheng say: Must gather followers unite righteous troops execute unprincipled Qin, not proper haughty see elders.",
      "idiomatic": "Li Sheng said: 'One must gather followers and unite righteous troops to execute the unprincipled Qin. It is not proper to haughtily receive elders.'"
    },
    {
      "id": "s0020",
      "chinese": "於是沛公輟洗，起攝衣，延酈生上坐，謝之。",
      "literal": "Thereupon Pei Gong stop wash, rise gather clothes, invite Li Sheng upper seat, apologize him.",
      "idiomatic": "Thereupon Pei Gong stopped washing, rose and gathered his clothes, invited Li Sheng to the upper seat, and apologized to him."
    },
    {
      "id": "s0021",
      "chinese": "酈生因言六國從橫時。",
      "literal": "Li Sheng then speak Six States vertical horizontal time.",
      "idiomatic": "Li Sheng then spoke about the time of the Six States' alliances and conflicts."
    },
    {
      "id": "s0022",
      "chinese": "沛公喜，賜酈生食，問曰：「計將安出？」",
      "literal": "Pei Gong happy, grant Li Sheng food, ask say: Plan will where emerge?",
      "idiomatic": "Pei Gong was happy and granted Li Sheng food. He asked: 'Where will the plan emerge?'"
    },
    {
      "id": "s0023",
      "chinese": "酈生曰：「足下起糾合之眾，收散亂之兵，不滿萬人，欲以徑入彊秦，此所謂探虎口者也。",
      "literal": "Li Sheng say: Your excellency rise gather together of crowd, collect scattered disorderly of troops, not full ten thousand persons, wish with directly enter strong Qin, this called probe tiger mouth ones.",
      "idiomatic": "Li Sheng said: 'Your excellency has risen with a gathered crowd and collected scattered disorderly troops, not even ten thousand men, and wishes to directly enter the strong Qin. This is what is called probing the tiger's mouth.'"
    },
    {
      "id": "s0024",
      "chinese": "夫陳留，天下之衝，四通五達之郊也，今其城又多積粟。",
      "literal": "Indeed Chen Liu, all under heaven of thoroughfare, four directions five reach of suburbs, now its city moreover much accumulate grain.",
      "idiomatic": "'Indeed, Chenliu is the thoroughfare of all under heaven, the suburbs reached in four directions and five ways. Now its city moreover has much accumulated grain.'"
    },
    {
      "id": "s0025",
      "chinese": "臣善其令，請得使之，令下足下。",
      "literal": "Minister good its command, please obtain make him, command descend your excellency.",
      "idiomatic": "I am familiar with its commander. Please let me go make him submit. The command will come down to your excellency.'"
    },
    {
      "id": "s0026",
      "chinese": "即不聽，足下舉兵攻之，臣為內應。」",
      "literal": "Namely not listen, your excellency raise troops attack it, minister be internal response.",
      "idiomatic": "If he does not listen, your excellency raise troops to attack it, and I will be the internal responder.'"
    },
    {
      "id": "s0027",
      "chinese": "於是遣酈生行，沛公引兵隨之，遂下陳留。",
      "literal": "Thereupon dispatch Li Sheng go, Pei Gong lead troops follow him, then take Chen Liu.",
      "idiomatic": "Thereupon they dispatched Li Sheng to go, Pei Gong led troops to follow him, and then took Chenliu."
    },
    {
      "id": "s0028",
      "chinese": "號酈食其為廣野君。",
      "literal": "Title Li Yi Ji as Guang Ye lord.",
      "idiomatic": "They titled Li Yiji as Lord of Guangye."
    },
    {
      "id": "s0029",
      "chinese": "酈生言其弟酈商，使將數千人從沛公西南略地。",
      "literal": "Li Sheng speak his younger brother Li Shang, make lead several thousand persons follow Pei Gong southwest plunder territory.",
      "idiomatic": "Li Sheng spoke of his younger brother Li Shang, making him lead several thousand men to follow Pei Gong and plunder territory in the southwest."
    },
    {
      "id": "s0030",
      "chinese": "酈生常為說客，馳使諸侯。",
      "literal": "Li Sheng often be persuasion guest, gallop dispatch feudal lords.",
      "idiomatic": "Li Sheng often served as a persuasion envoy, galloping to dispatch the feudal lords."
    },
    {
      "id": "s0031",
      "chinese": "漢三年秋，項羽擊漢，拔滎陽，漢兵遁保鞏、洛。",
      "literal": "Han third year autumn, Xiang Yu strike Han, pull Xing Yang, Han troops flee protect Gong, Luo.",
      "idiomatic": "In the autumn of Han year three, Xiang Yu struck the Han, captured Xingyang, and the Han troops fled to defend Gong and Luo."
    },
    {
      "id": "s0032",
      "chinese": "楚人聞淮陰侯破趙，彭越數反梁地，則分兵救之。",
      "literal": "Chu people hear Huai Yin marquis break Zhao, Peng Yue several times rebel Liang territory, then divide troops save it.",
      "idiomatic": "The Chu people heard that Marquis Huaiyin had broken Zhao, and Peng Yue had several times rebelled in Liang territory, so they divided their troops to save it."
    },
    {
      "id": "s0033",
      "chinese": "淮陰方東擊齊，漢王數困滎陽、成皋，計欲捐成皋以東，屯鞏、洛以拒楚。",
      "literal": "Huai Yin just east strike Qi, Han king several times distressed Xing Yang, Cheng Gao, plan wish abandon Cheng Gao east, station Gong, Luo to resist Chu.",
      "idiomatic": "Huaiyin was just striking east at Qi. The Han king was several times distressed at Xingyang and Chenggao. He planned to abandon east of Chenggao and station at Gong and Luo to resist Chu."
    },
    {
      "id": "s0034",
      "chinese": "酈生因曰：「臣聞知天之天者，王事可成；",
      "literal": "Li Sheng then say: Minister hear know heaven of heaven ones, king affairs can accomplish;",
      "idiomatic": "Li Sheng then said: 'I have heard that those who know the heaven of heaven can accomplish kingly affairs;'"
    },
    {
      "id": "s0035",
      "chinese": "不知天之天者，王事不可成。",
      "literal": "Not know heaven of heaven ones, king affairs not can accomplish.",
      "idiomatic": "those who do not know the heaven of heaven cannot accomplish kingly affairs.'"
    },
    {
      "id": "s0036",
      "chinese": "王者以民人為天，而民人以食為天。",
      "literal": "Kings take people as heaven, but people take food as heaven.",
      "idiomatic": "Kings take the people as heaven, but the people take food as heaven.'"
    },
    {
      "id": "s0037",
      "chinese": "夫敖倉，天下轉輸久矣，臣聞其下乃有藏粟甚多。",
      "literal": "Indeed Ao Cang, all under heaven transport long, minister hear its below namely have store grain very many.",
      "idiomatic": "'Indeed Aocang has been transporting for all under heaven for a long time. I have heard that below it there is stored grain in great quantities.'"
    },
    {
      "id": "s0038",
      "chinese": "楚人拔滎陽，不堅守敖倉，乃引而東，令適卒分守成皋，此乃天所以資漢也。",
      "literal": "Chu people pull Xing Yang, not firmly guard Ao Cang, namely lead and east, command suitable soldiers divide guard Cheng Gao, this namely heaven so aid Han.",
      "idiomatic": "'The Chu people captured Xingyang but did not firmly guard Aocang. Instead they led east and commanded suitable soldiers to divide and guard Chenggao. This is heaven aiding the Han.'"
    },
    {
      "id": "s0039",
      "chinese": "方今楚易取而漢反卻，自奪其便，臣竊以為過矣。",
      "literal": "Just now Chu easy take but Han instead retreat, self seize its advantage, minister secretly think mistake.",
      "idiomatic": "'Right now Chu is easy to take but Han retreats instead, self-seizing its advantage. I secretly think this is a mistake.'"
    },
    {
      "id": "s0040",
      "chinese": "且兩雄不俱立，楚漢久相持不決，百姓騷動，海內搖蕩，農夫釋耒，工女下機，天下之心未有所定也。",
      "literal": "Moreover two heroes not both stand, Chu Han long mutually hold undecided, hundred surnames disturbance, sea within shake sway, farmers release plow, working women descend loom, all under heaven of heart not yet have what decide.",
      "idiomatic": "'Moreover two heroes cannot both stand. Chu and Han have long held each other in deadlock undecided. The common people are disturbed, within the seas there is shaking and swaying. Farmers release their plows, working women descend from their looms. The heart of all under heaven has not yet decided where to go.'"
    },
    {
      "id": "s0041",
      "chinese": "願足下急復進兵，收取滎陽，據敖倉之粟，塞成皋之險，杜大行之道，距蜚狐之口，守白馬之津，以示諸侯效實形制之勢，則天下知所歸矣。",
      "literal": "Wish your excellency urgent again advance troops, receive Xing Yang, occupy Ao Cang of grain, block Cheng Gao of defile, dam Da Xing of road, distance Fei Hu of mouth, guard Bai Ma of ford, to show feudal lords imitate reality form control of power, then all under heaven know where return.",
      "idiomatic": "'I wish your excellency to urgently advance troops again, receive Xingyang, occupy Aocang's grain, block Chenggao's defiles, dam Daxing's roads, distance Feihu's mouth, guard Baima's ford, to show the feudal lords the power of imitating reality and forming control, then all under heaven will know where to return.'"
    },
    {
      "id": "s0042",
      "chinese": "方今燕、趙已定，唯齊未下。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "今田廣據千里之齊，田閒將二十萬之眾，軍於歷城，諸田宗彊，負海阻河濟，南近楚，人多變詐，足下雖遣數十萬師，未可以歲月破也。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "臣請得奉明詔說齊王，使為漢而稱東藩。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "上曰：「善。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0047",
      "chinese": "乃從其畫，復守敖倉，而使酈生說齊王曰：「王知天下之所歸乎？」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "王曰：「不知也。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0049",
      "chinese": "曰：「王知天下之所歸，則齊國可得而有也；",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "若不知天下之所歸，即齊國未可得保也。」",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s0051",
      "chinese": "齊王曰：「天下何所歸？」",
      "literal": "",
      "idiomatic": ""
    }
  ]
}