{
  "metadata": {
    "book": "shiji",
    "chapter": "093",
    "file": "data/shiji/093.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "韓王信者，故韓襄王孽孫也，長八尺五寸。",
      "literal": "Han Wang Xin, former Han Xiang Wang bastard grandson, long eight chi five cun.",
      "idiomatic": ""
    },
    {
      "id": "0-s0002",
      "originalId": "s0002",
      "blockIndex": 0,
      "chinese": "及項梁之立楚後懷王也，燕、齊、趙、魏皆已前王，唯韓無有後，故立韓諸公子橫陽君成為韓王，欲以撫定韓故地。",
      "literal": "Reach Xiang Liang establish Chu after Huai Wang, Yan, Qi, Zhao, Wei all already before wang, only Han no have after, therefore establish Han various gong zi Heng Yang Jun Cheng become Han Wang, desire with pacify settle Han old land.",
      "idiomatic": ""
    },
    {
      "id": "0-s0003",
      "originalId": "s0003",
      "blockIndex": 0,
      "chinese": "項梁敗死定陶，成奔懷王。",
      "literal": "Xiang Liang defeat die Ding Tao, Cheng flee Huai Wang.",
      "idiomatic": ""
    },
    {
      "id": "0-s0004",
      "originalId": "s0004",
      "blockIndex": 0,
      "chinese": "沛公引兵擊陽城，使張良以韓司徒降下韓故地，得信，以為韓將，將其兵從沛公入武關。",
      "literal": "Pei Gong lead troops strike Yang Cheng, make Zhang Liang with Han si tu descend Han old land, obtain Xin, become Han jiang, lead his troops follow Pei Gong enter Wu Guan.",
      "idiomatic": ""
    },
    {
      "id": "1-s0005",
      "originalId": "s0005",
      "blockIndex": 1,
      "chinese": "沛公立為漢王，韓信從入漢中，乃說漢王曰：「項王王諸將近地，而王獨遠居此，此左遷也。",
      "literal": "Pei Gong establish become Han Wang, Han Xin follow enter Han Zhong, then say Han Wang said: 'Xiang Wang wang various jiang near land, yet wang alone far dwell this, this left move.'",
      "idiomatic": ""
    },
    {
      "id": "1-s0006",
      "originalId": "s0006",
      "blockIndex": 1,
      "chinese": "士卒皆山東人，跂而望歸，及其鋒東鄉，可以爭天下。」",
      "literal": "Shi zu all Shan Dong person, qi yet hope return, reach its front east xiang, able contend tian xia.'",
      "idiomatic": ""
    },
    {
      "id": "1-s0007",
      "originalId": "s0007",
      "blockIndex": 1,
      "chinese": "漢王還定三秦，乃許信為韓王，先拜信為韓太尉，將兵略韓地。",
      "literal": "Han Wang return settle three Qin, then allow Xin become Han Wang, first appoint Xin become Han tai wei, lead troops sweep Han land.",
      "idiomatic": ""
    },
    {
      "id": "2-s0008",
      "originalId": "s0008",
      "blockIndex": 2,
      "chinese": "項籍之封諸王皆就國，韓王成以不從無功，不遣就國，更以為列侯。",
      "literal": "Xiang Ji seal various wang all go country, Han Wang Cheng with not follow no merit, not send go country, change become lie hou.",
      "idiomatic": ""
    },
    {
      "id": "2-s0009",
      "originalId": "s0009",
      "blockIndex": 2,
      "chinese": "及聞漢遣韓信略韓地，乃令故項籍游吳時吳令鄭昌為韓王以距漢。",
      "literal": "Reach hear Han send Han Xin sweep Han land, then make former Xiang Ji you Wu time Wu ling Zheng Chang become Han Wang with resist Han.",
      "idiomatic": ""
    },
    {
      "id": "2-s0010",
      "originalId": "s0010",
      "blockIndex": 2,
      "chinese": "漢二年，韓信略定韓十餘城。",
      "literal": "Han two years, Han Xin sweep settle Han ten remain city.",
      "idiomatic": ""
    },
    {
      "id": "2-s0011",
      "originalId": "s0011",
      "blockIndex": 2,
      "chinese": "漢王至河南，韓信急擊韓王昌陽城。",
      "literal": "Han Wang reach He Nan, Han Xin urgent strike Han Wang Chang Yang Cheng.",
      "idiomatic": ""
    },
    {
      "id": "2-s0012",
      "originalId": "s0012",
      "blockIndex": 2,
      "chinese": "昌降，漢王乃立韓信為韓王，常將韓兵從。",
      "literal": "Chang descend, Han Wang then establish Han Xin become Han Wang, constant lead Han troops follow.",
      "idiomatic": ""
    },
    {
      "id": "2-s0013",
      "originalId": "s0013",
      "blockIndex": 2,
      "chinese": "三年，漢王出滎陽，韓王信、周苛等守滎陽。",
      "literal": "Three years, Han Wang out Xing Yang, Han Wang Xin, Zhou Ke wait guard Xing Yang.",
      "idiomatic": ""
    },
    {
      "id": "2-s0014",
      "originalId": "s0014",
      "blockIndex": 2,
      "chinese": "及楚敗滎陽，信降楚，已而得亡，復歸漢，漢復立以為韓王，竟從擊破項籍，天下定。",
      "literal": "Reach Chu defeat Xing Yang, Xin descend Chu, already yet obtain flee, again return Han, Han again establish become Han Wang, finally follow strike break Xiang Ji, tian xia settle.",
      "idiomatic": ""
    },
    {
      "id": "2-s0015",
      "originalId": "s0015",
      "blockIndex": 2,
      "chinese": "五年春，遂與剖符為韓王，王潁川。",
      "literal": "Five years spring, then with carve fu become Han Wang, wang Ying Chuan.",
      "idiomatic": ""
    }
  ]
}