{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "35-s0302",
      "originalId": "s0302",
      "blockIndex": 35,
      "chinese": "先王惡其亂，故制雅頌之聲以道之，使其聲足以樂而不流，使其文足以綸而不息，使其曲直繁省廉肉節奏，足以感動人之善心而已矣，不使放心邪氣得接焉，是先王立樂之方也。",
      "literal": "Former kings hated its chaos, therefore established ya and song sounds to guide it; made their sound sufficient for joy but not licentious; made their patterns sufficient to bind but not weary; made their curved straight, ornate simple, upright fleshy rhythms sufficient to move people's good hearts only; did not let dissolute heretical qi connect there; this is former kings' establishment of music's method.",
      "idiomatic": ""
    },
    {
      "id": "35-s0303",
      "originalId": "s0303",
      "blockIndex": 35,
      "chinese": "是故樂在宗廟之中，君臣上下同聽之，則莫不和敬；",
      "literal": "Therefore music in ancestral temple within, ruler and ministers superiors and inferiors together listen to it, then none not harmonious and respectful;",
      "idiomatic": ""
    },
    {
      "id": "35-s0304",
      "originalId": "s0304",
      "blockIndex": 35,
      "chinese": "在族長鄉里之中，長幼同聽之，則莫不和順；",
      "literal": "In clan leaders neighborhood within, elders and young together listen to it, then none not harmonious and obedient;",
      "idiomatic": ""
    },
    {
      "id": "35-s0305",
      "originalId": "s0305",
      "blockIndex": 35,
      "chinese": "在閨門之內，父子兄弟同聽之，則莫不和親。",
      "literal": "In inner chambers within, father son brothers together listen to it, then none not harmonious and intimate.",
      "idiomatic": ""
    },
    {
      "id": "35-s0306",
      "originalId": "s0306",
      "blockIndex": 35,
      "chinese": "故樂者，審一以定和，比物以飾節，節奏合以成文，所以合和父子君臣，附親萬民也，是先王立樂之方也。",
      "literal": "Therefore music: examines unity to establish harmony, compares things to adorn measure, rhythms combine to form patterns; thus unites and harmonizes father-son ruler-minister, attaches and intimates myriad people; this is former kings' establishment of music's method.",
      "idiomatic": ""
    },
    {
      "id": "35-s0307",
      "originalId": "s0307",
      "blockIndex": 35,
      "chinese": "故聽其雅頌之聲，志意得廣焉；",
      "literal": "Therefore listening to ya and song sounds, will and intention become broad;",
      "idiomatic": ""
    },
    {
      "id": "35-s0308",
      "originalId": "s0308",
      "blockIndex": 35,
      "chinese": "執其干戚，習其俯仰詘信，容貌得莊焉；",
      "literal": "Grasping their shield-axes, practicing their bowing raising bending extending, appearance becomes solemn;",
      "idiomatic": ""
    },
    {
      "id": "35-s0309",
      "originalId": "s0309",
      "blockIndex": 35,
      "chinese": "行其綴兆，要其節奏，行列得正焉，進退得齊焉。",
      "literal": "Follow their connected signs, grasp their rhythms, ranks and files become correct, advance retreat become orderly.",
      "idiomatic": ""
    },
    {
      "id": "35-s0310",
      "originalId": "s0310",
      "blockIndex": 35,
      "chinese": "故樂者天地之齊，中和之紀，人情之所不能免也。",
      "literal": "Therefore music is heaven and earth's equal, central harmony's record, human emotion's that which cannot be avoided.",
      "idiomatic": ""
    },
    {
      "id": "36-s0311",
      "originalId": "s0311",
      "blockIndex": 36,
      "chinese": "夫樂者，先王之所以飾喜也；",
      "literal": "Indeed music is former kings' means to adorn joy;",
      "idiomatic": ""
    },
    {
      "id": "36-s0312",
      "originalId": "s0312",
      "blockIndex": 36,
      "chinese": "軍旅鈇鉞者，先王之所以飾怒也。",
      "literal": "Military campaigns axes are former kings' means to adorn anger.",
      "idiomatic": ""
    },
    {
      "id": "36-s0313",
      "originalId": "s0313",
      "blockIndex": 36,
      "chinese": "故先王之喜怒皆得其齊矣。",
      "literal": "Therefore former kings' joy and anger all obtained their equal.",
      "idiomatic": ""
    },
    {
      "id": "36-s0314",
      "originalId": "s0314",
      "blockIndex": 36,
      "chinese": "喜則天下和之，怒則暴亂者畏之。",
      "literal": "Joy then all under heaven harmonize with it, anger then violent disorderly fear it.",
      "idiomatic": ""
    },
    {
      "id": "36-s0315",
      "originalId": "s0315",
      "blockIndex": 36,
      "chinese": "先王之道禮樂可謂盛矣。",
      "literal": "Former kings' way of ritual and music can be called flourishing.",
      "idiomatic": ""
    },
    {
      "id": "37-s0316",
      "originalId": "s0316",
      "blockIndex": 37,
      "chinese": "魏文侯問於子夏曰：「吾端冕而聽古樂則唯恐臥，聽鄭衛之音則不知倦。",
      "literal": "Duke Wen of Wei asked Zi Xia saying: 'I sit properly capped and listen to ancient music then only fear sleeping, listen to Zheng and Wei sounds then do not know weariness.",
      "idiomatic": ""
    }
  ]
}