{
  "metadata": {
    "book": "shiji",
    "chapter": "039",
    "file": "data/shiji/039.json"
  },
  "sentences": [
    {
      "id": "s0933",
      "chinese": "出公奔齊，道死。",
      "literal": "Chu Gong fled to Qi and died on the road.",
      "idiomatic": "Duke Chu fled to Qi but died en route."
    },
    {
      "id": "s0934",
      "chinese": "故知伯乃立昭公曾孫驕為晉君，是為哀公。",
      "literal": "Therefore Zhi Bo then established Zhao Gong's great-grandson Jiao as Jin lord. This was Ai Gong.",
      "idiomatic": "Therefore, Zhi Bo installed Zhao Gong's great-grandson Jiao as ruler of Jin. This was Duke Ai."
    },
    {
      "id": "s0935",
      "chinese": "哀公大父雍，晉昭公少子也，號為戴子。",
      "literal": "Ai Gong's grandfather Yong was Jin Zhao Gong's youngest son and was styled Dai Zi.",
      "idiomatic": "Duke Ai's grandfather Yong was Duke Zhao of Jin's youngest son and was known as Lord Dai."
    },
    {
      "id": "s0936",
      "chinese": "戴子生忌。",
      "literal": "Dai Zi begot Ji.",
      "idiomatic": "Lord Dai fathered Ji."
    },
    {
      "id": "s0937",
      "chinese": "忌善知伯，蚤死，故知伯欲盡并晉，未敢，乃立忌子驕為君。",
      "literal": "Ji was good to Zhi Bo but died early. Therefore Zhi Bo desired to completely annex Jin but did not dare, so he established Ji's son Jiao as lord.",
      "idiomatic": "Ji had been on good terms with Zhi Bo but died prematurely. Therefore Zhi Bo wanted to annex all of Jin but did not dare, so he installed Ji's son Jiao as ruler."
    },
    {
      "id": "s0939",
      "chinese": "知伯遂有范、中行地，最彊。",
      "literal": "Zhi Bo then possessed the Fan and Zhong Xing lands and was the strongest.",
      "idiomatic": "Zhi Bo then took possession of the Fan and Zhong Xing territories and became the most powerful."
    },
    {
      "id": "s0940",
      "chinese": "哀公四年，趙襄子、韓康子、魏桓子共殺知伯，盡并其地。",
      "literal": "In Ai Gong's fourth year, Zhao Xiang Zi, Han Kang Zi, and Wei Huan Zi together killed Zhi Bo and completely annexed his lands.",
      "idiomatic": "In the fourth year of Duke Ai's reign, Zhao Xiang Zi, Han Kang Zi, and Wei Huan Zi joined forces to kill Zhi Bo and annexed all his territories."
    },
    {
      "id": "s0941",
      "chinese": "十八年，哀公卒，子幽公柳立。",
      "literal": "In the eighteenth year, Ai Gong died, and his son You Gong Liu was established.",
      "idiomatic": "In the eighteenth year, Duke Ai passed away, and his son Liu ascended as Duke You."
    },
    {
      "id": "s0943",
      "chinese": "獨有絳、曲沃，餘皆入三晉。",
      "literal": "They only possessed Jiang and Qu Wo. The remainder all entered the three Jin.",
      "idiomatic": "They retained only Jiang and Quwo. All the rest fell to the three Jin states."
    },
    {
      "id": "s0944",
      "chinese": "十五年，魏文侯初立。",
      "literal": "In the fifteenth year, Wei Wen Hou was first established.",
      "idiomatic": "In the fifteenth year, Marquis Wen of Wei ascended the throne."
    },
    {
      "id": "s0945",
      "chinese": "十八年，幽公淫婦人，夜竊出邑中，盜殺幽公。",
      "literal": "In the eighteenth year, You Gong was licentious with women. At night he secretly left the city, and a thief killed You Gong.",
      "idiomatic": "In the eighteenth year, Duke You was debauched with women. One night he secretly left the city, where a robber assassinated him."
    },
    {
      "id": "s0946",
      "chinese": "魏文侯以兵誅晉亂，立幽公子止，是為烈公。",
      "literal": "Wei Wen Hou with troops executed Jin's disorder and established You Gong's son Zhi. This was Lie Gong.",
      "idiomatic": ""
    },
    {
      "id": "s0947",
      "chinese": "烈公十九年，周威烈王賜趙、韓、魏皆命為諸侯。",
      "literal": "In Lie Gong's nineteenth year, Zhou Wei Lie Wang granted Zhao, Han, and Wei all to be appointed as feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0948",
      "chinese": "二十七年，烈公卒，子孝公頎立。",
      "literal": "In the twenty-seventh year, Lie Gong died, and his son Xiao Gong Si was established.",
      "idiomatic": ""
    },
    {
      "id": "s0949",
      "chinese": "孝公九年，魏武侯初立，襲邯鄲，不勝而去。",
      "literal": "In Xiao Gong's ninth year, Wei Wu Hou was first established. He attacked Han Dan but was not victorious and departed.",
      "idiomatic": ""
    }
  ]
}