{
  "metadata": {
    "book": "shiji",
    "chapter": "037",
    "file": "data/shiji/037.json"
  },
  "sentences": [
    {
      "id": "s0018",
      "chinese": "嗣伯卒，子偼伯立。",
      "literal": "Si Bo died, and his son You Bo ascended.",
      "idiomatic": "Si Bo died; his son You Bo ascended."
    },
    {
      "id": "s0019",
      "chinese": "偼伯卒，子靖伯立。",
      "literal": "You Bo died, and his son Jing Bo ascended.",
      "idiomatic": "You Bo died; his son Jing Bo ascended."
    },
    {
      "id": "s0020",
      "chinese": "靖伯卒，子貞伯立。",
      "literal": "Jing Bo died, and his son Zhen Bo ascended.",
      "idiomatic": "Jing Bo died; his son Zhen Bo ascended."
    },
    {
      "id": "s0021",
      "chinese": "貞伯卒，子頃侯立。",
      "literal": "Zhen Bo died, and his son Duke Qing ascended.",
      "idiomatic": "Zhen Bo died; his son Duke Qing ascended."
    },
    {
      "id": "s0022",
      "chinese": "頃侯厚賂周夷王，夷王命衛為侯。",
      "literal": "Duke Qing thickly bribed King Yi of Zhou. King Yi commanded Wei to be a hou.",
      "idiomatic": "Duke Qing thickly bribed King Yi of Zhou; King Yi commanded Wei to be a hou."
    },
    {
      "id": "s0023",
      "chinese": "頃侯立十二年卒，子釐侯立。",
      "literal": "Duke Qing ascended for twelve years and died. His son Duke Xi ascended.",
      "idiomatic": "Duke Qing ascended for twelve years and died; his son Duke Xi ascended."
    },
    {
      "id": "s0024",
      "chinese": "釐侯十三年，周厲王出奔于彘，共和行政焉。",
      "literal": "In Duke Xi's thirteenth year, King Li of Zhou fled to Zhi, and the Gong He administered government there.",
      "idiomatic": "In Duke Xi's thirteenth year, King Li of Zhou fled to Zhi; and the Gong He administered government there."
    },
    {
      "id": "s0025",
      "chinese": "二十八年，周宣王立。",
      "literal": "In the twenty-eighth year, King Xuan of Zhou ascended.",
      "idiomatic": "In the twenty-eighth year, King Xuan of Zhou ascended."
    },
    {
      "id": "s0026",
      "chinese": "四十二年，釐侯卒，太子共伯餘立為君。",
      "literal": "In the forty-second year, Duke Xi died, and Crown Prince Gong Bo Yu ascended as lord.",
      "idiomatic": "In the forty-second year, Duke Xi died; and Crown Prince Gong Bo Yu ascended as lord."
    },
    {
      "id": "s0028",
      "chinese": "和以其賂賂士，以襲攻共伯於墓上，共伯入釐侯羨自殺。",
      "literal": "He used his bribes to bribe warriors, to suddenly attack Gong Bo at the tomb above. Gong Bo entered Duke Xi's pavilion and committed suicide.",
      "idiomatic": ""
    },
    {
      "id": "s0029",
      "chinese": "衛人因葬之釐侯旁，謚曰共伯，而立和為衛侯，是為武公。",
      "literal": "The Wei people therefore buried him beside Duke Xi, gave him the posthumous name Gong Bo, and established He as Wei's hou, who became Duke Wu.",
      "idiomatic": ""
    },
    {
      "id": "s0030",
      "chinese": "武公即位，修康叔之政，百姓和集。",
      "literal": "Duke Wu ascended the throne and repaired Kang Shu's policies. The people were harmonious and gathered together.",
      "idiomatic": ""
    },
    {
      "id": "s0031",
      "chinese": "四十二年，犬戎殺周幽王，武公將兵往佐周平戎，甚有功，周平王命武公為公。",
      "literal": "In the forty-second year, the Quan Rong killed King You of Zhou. Duke Wu led troops to assist Zhou in pacifying the Rong, and had great merit. King Ping of Zhou commanded Duke Wu to be a gong.",
      "idiomatic": ""
    },
    {
      "id": "s0032",
      "chinese": "五十五年，卒，子莊公揚立。",
      "literal": "In the fifty-fifth year, he died, and his son Duke Zhuang Yang ascended.",
      "idiomatic": ""
    },
    {
      "id": "s0033",
      "chinese": "莊公五年，取齊女為夫人，好而無子。",
      "literal": "In Duke Zhuang's fifth year, he took a Qi woman as his wife. He loved her but she had no son.",
      "idiomatic": ""
    }
  ]
}