{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "太史公曰：余每讀虞書，至於君臣相敕，維是几安，而股肱不良，萬事墮壞，未嘗不流涕也。",
      "literal": "The Grand Historian says: I every time read the Yu Shu, when reaching where ruler and minister mutually admonish each other, only thus being at ease on the cushion, but the limbs not being good, ten thousand affairs falling and ruining, have never not shed tears.",
      "idiomatic": ""
    },
    {
      "id": "0-s0002",
      "originalId": "s0002",
      "blockIndex": 0,
      "chinese": "成王作頌，推己懲艾，悲彼家難，可不謂戰戰恐懼，善守善終哉？",
      "literal": "King Cheng made the Ode, pushed himself to punish and restrain, sorrowed over that family's difficulty. Can it not be called fearful and cautious, good at guarding and good at ending?",
      "idiomatic": ""
    },
    {
      "id": "0-s0003",
      "originalId": "s0003",
      "blockIndex": 0,
      "chinese": "君子不為約則修德，滿則棄禮，佚能思初，安能惟始，沐浴膏澤而歌詠勤苦，非大德誰能如斯！",
      "literal": "The gentleman, when not constrained then cultivates virtue; when full then abandons ritual; at ease can think of the beginning; at peace can only the start; bathes in rich favors and sings of diligent hardships; not great virtue who can be like this!",
      "idiomatic": ""
    },
    {
      "id": "0-s0004",
      "originalId": "s0004",
      "blockIndex": 0,
      "chinese": "傳曰「治定功成，禮樂乃興」。",
      "literal": "The tradition says 'When governance is settled and merit achieved, then ritual and music arise'.",
      "idiomatic": ""
    },
    {
      "id": "0-s0005",
      "originalId": "s0005",
      "blockIndex": 0,
      "chinese": "海內人道益深，其德益至，所樂者益異。",
      "literal": "Within the seas, the way of humans becomes increasingly deep, their virtue becomes increasingly supreme, what they take joy in becomes increasingly different.",
      "idiomatic": ""
    },
    {
      "id": "0-s0006",
      "originalId": "s0006",
      "blockIndex": 0,
      "chinese": "滿而不損則溢，盈而不持則傾。",
      "literal": "Full but not diminished then overflows, complete but not held then topples.",
      "idiomatic": ""
    },
    {
      "id": "0-s0007",
      "originalId": "s0007",
      "blockIndex": 0,
      "chinese": "凡作樂者，所以節樂。",
      "literal": "All those who make music, it is for regulating joy.",
      "idiomatic": ""
    },
    {
      "id": "0-s0008",
      "originalId": "s0008",
      "blockIndex": 0,
      "chinese": "君子以謙退為禮，以損減為樂，樂其如此也。",
      "literal": "The gentleman takes modesty and retreat as ritual, takes diminution and reduction as joy, takes joy in it being thus.",
      "idiomatic": ""
    },
    {
      "id": "0-s0009",
      "originalId": "s0009",
      "blockIndex": 0,
      "chinese": "以為州異國殊，情習不同，故博采風俗，協比聲律，以補短移化，助流政教。",
      "literal": "Considering that provinces differ and states are disparate, feelings and habits are not the same, therefore broadly gather customs, harmonize and compare tone laws, to supplement shortcomings and shift transformations, assist in flowing governance and teachings.",
      "idiomatic": ""
    },
    {
      "id": "0-s0010",
      "originalId": "s0010",
      "blockIndex": 0,
      "chinese": "天子躬於明堂臨觀，而萬民咸蕩滌邪穢，斟酌飽滿，以飾厥性。",
      "literal": "The Son of Heaven personally in the Bright Hall oversees and watches, and the ten thousand people all wash away evil impurities, measure and fill to fullness, to adorn their natures.",
      "idiomatic": ""
    },
    {
      "id": "0-s0011",
      "originalId": "s0011",
      "blockIndex": 0,
      "chinese": "故云雅頌之音理而民正，嘄噭之聲興而士奮，鄭衛之曲動而心淫。",
      "literal": "Therefore it is said the sounds of ya and song order and the people are correct, the voices of yu and jiao arise and the scholars are aroused, the tunes of Zheng and Wei move and the hearts are licentious.",
      "idiomatic": ""
    },
    {
      "id": "0-s0012",
      "originalId": "s0012",
      "blockIndex": 0,
      "chinese": "及其調和諧合，鳥獸盡感，而況懷五常，含好惡，自然之勢也？",
      "literal": "When reaching its harmonious blending and musical union, birds and beasts all are moved, how much more those who harbor the five constants, contain likes and dislikes, it is the natural tendency.",
      "idiomatic": ""
    },
    {
      "id": "1-s0013",
      "originalId": "s0013",
      "blockIndex": 1,
      "chinese": "治道虧缺而鄭音興起，封君世辟，名顯鄰州，爭以相高。",
      "literal": "The way of governance is deficient and Zheng music arises, enfeoffed lords become hereditary ministers, names become illustrious in neighboring states, contending to surpass each other.",
      "idiomatic": ""
    },
    {
      "id": "1-s0014",
      "originalId": "s0014",
      "blockIndex": 1,
      "chinese": "自仲尼不能與齊優遂容於魯，雖退正樂以誘世，作五章以剌時，猶莫之化。",
      "literal": "Since Confucius could not together with the Qi entertainers find accommodation in Lu, although he retreated to correct music to guide the world, made five chapters to criticize the times, still none transformed them.",
      "idiomatic": ""
    },
    {
      "id": "1-s0015",
      "originalId": "s0015",
      "blockIndex": 1,
      "chinese": "陵遲以至六國，流沔沈佚，遂往不返，卒於喪身滅宗，并國於秦。",
      "literal": "Gradually declining to reach the Six States, flowing and sinking into dissipation, going forth never to return, finally resulting in losing life and destroying the lineage, merging states into Qin.",
      "idiomatic": ""
    }
  ]
}