{
  "metadata": {
    "book": "shiji",
    "chapter": "018",
    "file": "data/shiji/018.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "太史公曰：古者人臣功有五品，以德立宗廟定社稷曰勳，以言曰勞，用力曰功，明其等曰伐，積日曰閱。",
      "literal": "The Grand Historian says: In ancient times, ministers' achievements were ranked in five grades: establishing ancestral temples and stabilizing the state through virtue was called xun, through words was called lao, through physical effort was called gong, clarifying ranks was called fa, accumulating days was called yue.",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "封爵之誓曰：「使河如帶，泰山若厲。",
      "literal": "The oath for enfeoffing marquises said: 'May the Yellow River be as narrow as a belt, Mount Tai as easily crossed as a grindstone.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "國以永寧，爰及苗裔。」",
      "literal": "May the state be eternally peaceful, extending to descendants.'",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "始未嘗不欲固其根本，而枝葉稍陵夷衰微也。",
      "literal": "At first they did not fail to desire to strengthen their roots, but gradually the branches and leaves grew rampant and declined.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "余讀高祖侯功臣，察其首封，所以失之者，曰：異哉新聞！",
      "literal": "I have read about Gaozu's meritorious officials who became marquises, and examining their initial enfeoffments and how they lost them, I say: How strange! Such different customs!",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "《書》曰「協和萬國」，遷于夏商，或數千歲。",
      "literal": "The Book says 'harmonize the ten thousand states', moving from Xia to Shang, lasting several thousand years.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "蓋周封八百，幽厲之後，見於春秋。",
      "literal": "Zhou enfeoffed eight hundred, and after You and Li, they appear in the Spring and Autumn Annals.",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "尚書有唐虞之侯伯，歷三代千有餘載，自全以蕃衛天子，豈非篤於仁義，奉上法哉？",
      "literal": "The Documents has the marquises and earls of Tang and Yu, lasting three dynasties over a thousand years, preserving themselves to guard and protect the Son of Heaven—was this not devotion to benevolence and righteousness, revering and following the law?",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "漢興，功臣受封者百有餘人。",
      "literal": "When Han arose, over a hundred meritorious officials received enfeoffments.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "天下初定，故大城名都散亡，戶口可得而數者十二三，是以大侯不過萬家，小者五六百戶。",
      "literal": "The realm had just been pacified, so large cities and famous towns were scattered and ruined, the households that could be counted were only twelve or thirteen percent, therefore large marquises received no more than ten thousand households, small ones five or six hundred households.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "後數世，民咸歸鄉里，戶益息，蕭、曹、絳、灌之屬或至四萬，小侯自倍，富厚如之。",
      "literal": "After several generations, the people all returned to their native places, households increased, and the likes of Xiao, Cao, Jiang, Guan sometimes reached forty thousand, small marquises doubled, becoming wealthy like them.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "子孫驕溢，忘其先，淫嬖。",
      "literal": "Their descendants became arrogant and extravagant, forgetting their ancestors, indulging in debauchery.",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "至太初百年之閒，見侯五，餘皆坐法隕命亡國，秏矣。",
      "literal": "By the time of Taichu, within a century, only five marquises remain visible, the rest all perished through law violations, losing their lives and states, gone.",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "罔亦少密焉，然皆身無兢兢於當世之禁云。",
      "literal": "Perhaps they were somewhat lacking in caution, but all lacked vigilance regarding the prohibitions of their time.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "居今之世，志古之道，所以自鏡也，未必盡同。",
      "literal": "Living in the present age, observing the ways of antiquity, one may use them as a mirror, but they are not necessarily all the same.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "帝王者各殊禮而異務，要以成功為統紀，豈可緄乎？",
      "literal": "Emperors and kings each had different rituals and different affairs, but essentially they used success as their guiding principle—how could they be bound together?",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "觀所以得尊寵及所以廢辱，亦當世得失之林也，何必舊聞？",
      "literal": "Observing what brought honor and favor and what brought disgrace and humiliation, these are also the forest of gains and losses in their times, why must it be ancient hearsay?",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "於是謹其終始，表其文，頗有所不盡本末；",
      "literal": "Therefore I have carefully recorded their beginnings and ends, tabled their writings, though somewhat incomplete in roots and branches;",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "著其明，疑者闕之。",
      "literal": "Recorded what was clear, left doubtful matters blank.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "後有君子，欲推而列之，得以覽焉。",
      "literal": "If later gentlemen wish to investigate and list them, they may peruse this.",
      "idiomatic": ""
    },
    {
      "id": "s29",
      "chinese": "國名。",
      "literal": "State Name",
      "idiomatic": ""
    },
    {
      "id": "s30",
      "chinese": "侯功",
      "literal": "Marquis Merit",
      "idiomatic": ""
    },
    {
      "id": "s31",
      "chinese": "高祖十二",
      "literal": "Gaozu Year 12",
      "idiomatic": ""
    },
    {
      "id": "s32",
      "chinese": "孝惠七",
      "literal": "Xiaohui Year 7",
      "idiomatic": ""
    },
    {
      "id": "s33",
      "chinese": "高后八",
      "literal": "Gaohou Year 8",
      "idiomatic": ""
    },
    {
      "id": "s34",
      "chinese": "孝文二十三",
      "literal": "Xiaowen Year 23",
      "idiomatic": ""
    },
    {
      "id": "s35",
      "chinese": "孝景十六",
      "literal": "Xiaojing Year 16",
      "idiomatic": ""
    },
    {
      "id": "s36",
      "chinese": "建元至元封六年三十六，太初元年盡後元二年十八。",
      "literal": "Jian Yuan to Yuan Feng year 6: 36 years; Tai Chu year 1 to Hou Yuan year 2: 18 years",
      "idiomatic": ""
    },
    {
      "id": "s37",
      "chinese": "侯第。",
      "literal": "Marquis Rank",
      "idiomatic": ""
    },
    {
      "id": "s38",
      "chinese": "平陽。",
      "literal": "Pingyang",
      "idiomatic": ""
    },
    {
      "id": "s39",
      "chinese": "以中涓從起沛，至霸上，侯。以將軍入漢，以左丞相出征齊、魏，以右丞相為平陽侯，萬六百戶。",
      "literal": "As attendant-in-chief followed the uprising at Pei, reached Baxia, made marquis. As general entered Han, as Left Chancellor campaigned against Qi and Wei, as Right Chancellor made Pingyang Marquis, 16,600 households",
      "idiomatic": ""
    },
    {
      "id": "s40",
      "chinese": "七。六年十二月甲申，懿侯曹參元年。",
      "literal": "7th. Year 6, twelfth month, jia shen day, Yi Marquis Cao Can year 1",
      "idiomatic": ""
    },
    {
      "id": "s41",
      "chinese": "五。其二年為相國。。二。六年十月，靖侯窋元年。",
      "literal": "5th. His second year became Chancellor. 2nd. Year 6 tenth month, Jing Marquis Kuai year 1",
      "idiomatic": ""
    },
    {
      "id": "s42",
      "chinese": "八",
      "literal": "8th",
      "idiomatic": ""
    },
    {
      "id": "s43",
      "chinese": "十九。四。後四年，簡侯奇元年。",
      "literal": "19th. 4th. After 4 years, Jian Marquis Ji year 1",
      "idiomatic": ""
    },
    {
      "id": "s44",
      "chinese": "三。十三。四年，夷侯時。。元年。",
      "literal": "3rd. 13th. Year 4, Yi Marquis Shi year 1",
      "idiomatic": ""
    },
    {
      "id": "s45",
      "chinese": "十。十六。元光五年，恭侯襄元年。元鼎三年，今侯宗元年。",
      "literal": "10th. 16th. Yuan Guang year 5, Gong Marquis Xiang year 1. Yuan Ding year 3, current Marquis Zong year 1",
      "idiomatic": ""
    },
    {
      "id": "s46",
      "chinese": "二。",
      "literal": "2nd",
      "idiomatic": ""
    },
    {
      "id": "s47",
      "chinese": "信武。",
      "literal": "Xinwu",
      "idiomatic": ""
    },
    {
      "id": "s48",
      "chinese": "以中涓從起宛、朐，入漢，以騎都尉定三秦，擊項羽，別定江陵，侯，五千三百戶。以車騎將軍攻黥布、陳豨。",
      "literal": "As attendant-in-chief followed uprising at Wan and Qu, entered Han, as Cavalry Commandant pacified the Three Qins, attacked Xiang Yu, separately pacified Jiangling, made marquis, 5,300 households. As Cavalry General attacked Qing Bu and Chen Xi",
      "idiomatic": ""
    },
    {
      "id": "s49",
      "chinese": "七。六年十二月甲申，肅侯靳歙元年。",
      "literal": "7th. Year 6 twelfth month jia shen day, Su Marquis Jin Xi year 1",
      "idiomatic": ""
    },
    {
      "id": "s50",
      "chinese": "七",
      "literal": "7th",
      "idiomatic": ""
    },
    {
      "id": "s51",
      "chinese": "五。三。六年，夷侯亭元年。",
      "literal": "5th. 3rd. Year 6, Yi Marquis Ting year 1.",
      "idiomatic": ""
    },
    {
      "id": "s52",
      "chinese": "十八。後三年，侯亭坐事國人過律，奪侯，國除。",
      "literal": "18th. After 3 years, Marquis Ting convicted of affairs with state people exceeding law, marquisate stripped, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s55",
      "chinese": "十一",
      "literal": "11th",
      "idiomatic": ""
    },
    {
      "id": "s56",
      "chinese": "清陽。",
      "literal": "Qingyang",
      "idiomatic": ""
    },
    {
      "id": "s57",
      "chinese": "以中涓從起豐，至霸上，為騎郎將，入漢，以將軍擊項羽功，侯，三千一百戶。",
      "literal": "As attendant-in-chief followed uprising at Feng, reached Baxia, became Cavalry Commandant, entered Han, as general with merit attacking Xiang Yu, became marquis, 3,100 households",
      "idiomatic": ""
    },
    {
      "id": "s58",
      "chinese": "七。六年十二月甲申，定侯王吸元年。",
      "literal": "Seven. Year 6 twelfth month jia shen day, Ding Marquis Wang Xi year 1.",
      "idiomatic": ""
    },
    {
      "id": "s59",
      "chinese": "七",
      "literal": "7th",
      "idiomatic": ""
    },
    {
      "id": "s60",
      "chinese": "八",
      "literal": "8th",
      "idiomatic": ""
    }
  ]
}