{
  "metadata": {
    "book": "shiji",
    "chapter": "023",
    "file": "data/shiji/023.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "太史公曰：洋洋美德乎！",
      "literal": "Grand Historian says: Vast and beautiful virtue!",
      "idiomatic": ""
    },
    {
      "id": "0-s0002",
      "originalId": "s0002",
      "blockIndex": 0,
      "chinese": "宰制萬物，役使群眾，豈人力也哉？",
      "literal": "Controlling ten thousand things, employing the multitudes, how is it human power?",
      "idiomatic": ""
    },
    {
      "id": "0-s0003",
      "originalId": "s0003",
      "blockIndex": 0,
      "chinese": "余至大行禮官，觀三代損益，乃知緣人情而制禮，依人性而作儀，其所由來尚矣。",
      "literal": "I went to the Grand Procession rites official, observed the Three Dynasties' additions and subtractions, then knew that rites are established following human feelings, instruments are made relying on human nature, their origins have been ancient.",
      "idiomatic": ""
    },
    {
      "id": "1-s0004",
      "originalId": "s0004",
      "blockIndex": 1,
      "chinese": "人道經緯萬端，規矩無所不貫，誘進以仁義，束縛以刑罰，故德厚者位尊，祿重者寵榮，所以總一海內而整齊萬民也。",
      "literal": "Human way weaves ten thousand ends, rules and squares penetrate everything, entice forward with benevolence righteousness, bind with punishments, therefore virtue thick ones position honored, emolument heavy ones favor glorious, thus unifying the realm within the seas and orderly arranging the ten thousand people.",
      "idiomatic": ""
    },
    {
      "id": "1-s0005",
      "originalId": "s0005",
      "blockIndex": 1,
      "chinese": "人體安駕乘，為之金輿錯衡以繁其飾；",
      "literal": "Human body at ease riding driving, for it gold carriage inlaid yoke to multiply its ornaments;",
      "idiomatic": ""
    },
    {
      "id": "1-s0006",
      "originalId": "s0006",
      "blockIndex": 1,
      "chinese": "目好五色，為之黼黻文章以表其能；",
      "literal": "Eyes fond of five colors, for them embroidered patterned textiles to display their ability;",
      "idiomatic": ""
    },
    {
      "id": "1-s0007",
      "originalId": "s0007",
      "blockIndex": 1,
      "chinese": "耳樂鐘磬，為之調諧八音以蕩其心；",
      "literal": "Ears enjoy bells chimes, for them tuned harmonious eight sounds to stir their hearts;",
      "idiomatic": ""
    },
    {
      "id": "1-s0008",
      "originalId": "s0008",
      "blockIndex": 1,
      "chinese": "口甘五味，為之庶羞酸咸以致其美；",
      "literal": "Mouth sweetens five flavors, for it many delicacies sour salty to bring their beauty;",
      "idiomatic": ""
    },
    {
      "id": "1-s0009",
      "originalId": "s0009",
      "blockIndex": 1,
      "chinese": "情好珍善，為之琢磨圭璧以通其意。",
      "literal": "Emotions fond of precious good, for them polished jade tablets to communicate their intent.",
      "idiomatic": ""
    },
    {
      "id": "1-s0010",
      "originalId": "s0010",
      "blockIndex": 1,
      "chinese": "故大路越席，皮弁布裳，朱弦洞越，大羹玄酒，所以防其淫侈，救其彫敝。",
      "literal": "Therefore great carriage rush mats, leather caps cloth skirts, vermilion strings resonant zithers, great broth clear wine, thus to prevent their licentious extravagance, save their carved decay.",
      "idiomatic": ""
    },
    {
      "id": "1-s0011",
      "originalId": "s0011",
      "blockIndex": 1,
      "chinese": "是以君臣朝廷尊卑貴賤之序，下及黎庶車輿衣服宮室飲食嫁娶喪祭之分，事有宜適，物有節文。",
      "literal": "Therefore ruler minister court honored lowly noble base sequence, down to black-haired people carriages clothing palaces rooms food marriage funeral sacrifice divisions, matters have suitable adaptations, things have regulated patterns.",
      "idiomatic": ""
    },
    {
      "id": "1-s0012",
      "originalId": "s0012",
      "blockIndex": 1,
      "chinese": "仲尼曰：「褅自既灌而往者，吾不欲觀之矣。」",
      "literal": "Zhong Ni said: \"The di sacrifice from after the libation onward, I do not wish to observe it.\"",
      "idiomatic": ""
    },
    {
      "id": "2-s0014",
      "originalId": "s0014",
      "blockIndex": 2,
      "chinese": "周衰，禮廢樂壞，大小相踰，管仲之家，兼備三歸。",
      "literal": "Zhou declined, rites abandoned music ruined, great small mutually overstepped, Guan Zhong's household, combined prepared three returns.",
      "idiomatic": ""
    },
    {
      "id": "2-s0015",
      "originalId": "s0015",
      "blockIndex": 2,
      "chinese": "循法守正者見侮於世，奢溢僭差者謂之顯榮。",
      "literal": "Following law guarding upright ones seen insulted by the world, extravagant overflowing presumptuous differing ones called manifest glory.",
      "idiomatic": ""
    },
    {
      "id": "2-s0016",
      "originalId": "s0016",
      "blockIndex": 2,
      "chinese": "自子夏，門人之高弟也，猶云「出見紛華盛麗而說，入聞夫子之道而樂，二者心戰，未能自決」，而況中庸以下，漸漬於失教，被服於成俗乎？",
      "literal": "Even Zi Xia, disciples' high disciple, still said \"Going out seeing variegated splendor flourishing beauty and pleased, entering hearing Master Dao and happy, two things heart battle, unable self-decide\", moreover middle ordinary and below, gradually immersed in lost teaching, clothed in established customs?",
      "idiomatic": ""
    }
  ]
}