{
  "metadata": {
    "book": "shiji",
    "chapter": "013",
    "file": "data/shiji/013.json"
  },
  "sentences": [
    {
      "id": "s0002",
      "chinese": "自殷以前諸侯不可得而譜，周以來乃頗可著。",
      "literal": "From Yin before feudal lords cannot obtained and genealogized, Zhou since then considerably can recorded. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "孔子因史文次春秋，紀元年，正時日月，蓋其詳哉。",
      "literal": "Confucius followed historical texts arranged Spring Autumn, recorded first year, corrected seasons days months, indeed its detailed. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "或頗有，然多闕，不可錄。",
      "literal": "Some considerably had, yet many missing, cannot recorded. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "故疑則傳疑，蓋其慎也。",
      "literal": "Therefore doubt then transmit doubt, indeed its cautious. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "余讀諜記，黃帝以來皆有年數。",
      "literal": "I read secret records, Yellow Emperor since all have year numbers. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "稽其歷譜諜終始五德之傳，古文咸不同，乖異。",
      "literal": "Check their calendar genealogies secret records beginning end five virtues transmission, ancient texts all different, divergent. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "於是以五帝系諜、尚書集世紀黃帝以連山訖共和為世表。",
      "literal": "Thereupon with Five Emperors genealogical records, Documents of Antiquity collected century Yellow Emperor with Lianshan until Gonghe as generation table. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0041",
      "chinese": "詩言契生於卵，后稷人跡者，欲見其有天命精誠之意耳。",
      "literal": "Poetry speaks Jie born from egg, Hou Ji human footprints, wished to show they had heaven mandate sincere intentions only. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "一言有父，一言無父，信以傳信，疑以傳疑，故兩言之。",
      "literal": "One says has father, one says no father, believe to transmit believe, doubt to transmit doubt, therefore both speak. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "堯知契、稷皆賢人，天之所生，故封之契七十里，後十餘世至湯，王天下。",
      "literal": "Yao knew Jie, Ji all worthy people, heaven what born, therefore enfeoffed Jie seventy li, after ten more generations to Tang, king tianxia. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "堯知后稷子孫之後王也，故益封之百里，其後世且千歲，至文王而有天下。",
      "literal": "Yao knew Hou Ji descendants later kings also, therefore additionally enfeoffed him hundred li, his later generations nearly thousand years, to Wen Wang then had tianxia. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0047",
      "chinese": "契母與姊妹浴於玄丘水，有燕銜卵墮之，契母得，故含之，誤吞之，即生契。",
      "literal": "Jie mother with elder sisters bathed at Xuanqiu water, had swallow held egg fell it, Jie mother got, therefore held it, mistakenly swallowed it, immediately gave birth Jie. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "契生而賢，堯立為司徒，姓之曰子氏。",
      "literal": "Jie born and worthy, Yao established as Situ, surnamed him Zi clan. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "茲，益大也。",
      "literal": "Ci, increasingly great also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0052",
      "chinese": "商者質，殷號也。",
      "literal": "Shang what solid, Yin designation also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0053",
      "chinese": "文王之先為后稷，后稷亦無父而生。",
      "literal": "Wen Wang what ancestor Hou Ji, Hou Ji also no father born. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0054",
      "chinese": "后稷母為姜嫄，出見大人蹟而履踐之，知於身，則生后稷。",
      "literal": "Hou Ji mother was Jiang Yuan, went out saw great person footprints stepped on them, knew in body, then gave birth Hou Ji. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0055",
      "chinese": "姜嫄以為無父，賤而棄之道中，牛羊避不踐也。",
      "literal": "Jiang Yuan took as no father, lowly abandoned on road middle, cattle sheep avoided not trampled also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0056",
      "chinese": "抱之山中，山者養之。",
      "literal": "Embraced it mountain middle, mountain people nurtured it. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0057",
      "chinese": "又捐之大澤，鳥覆席食之。",
      "literal": "Again abandoned it great marsh, birds covered warmed fed it. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0058",
      "chinese": "姜嫄怪之，於是知其天子，乃取長之。",
      "literal": "Jiang Yuan wondered at it, thereupon knew its Son of Heaven, then took raised it. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0059",
      "chinese": "堯知其賢才，立以為大農，姓之曰姬氏。",
      "literal": "Yao knew his worthy talent, established as great farmer, surnamed him Ji clan. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0060",
      "chinese": "姬者，本也。",
      "literal": "Ji what root also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0063",
      "chinese": "命后稷為姬氏，為有文王也。",
      "literal": "Commanded Hou Ji as Ji clan, for had Wen Wang also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0064",
      "chinese": "大王命季歷，明天瑞也。",
      "literal": "Great King commanded Ji Li, made clear heaven auspicious also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0066",
      "chinese": "天命難言，非聖人莫能見。",
      "literal": "Heaven mandate difficult speak, not sage none can see. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0067",
      "chinese": "舜、禹、契、后稷皆黃帝子孫也。",
      "literal": "Shun, Yu, Jie, Hou Ji all Yellow Emperor descendants also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0068",
      "chinese": "黃帝策天命而治天下，德澤深後世，故其子孫皆復立為天子，是天之報有德也。",
      "literal": "Yellow Emperor tallied heaven mandate governed tianxia, virtue favor deep later generations, therefore his descendants all again established as Sons of Heaven, this heaven what repays virtuous also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0069",
      "chinese": "人不知，以為閒從布衣匹夫起耳。",
      "literal": "People not know, took as idly following plain clothed commoner arose only. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0074",
      "chinese": "黃帝是也。",
      "literal": "Yellow Emperor is this. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0075",
      "chinese": "五政明則修禮義，因天時舉兵征伐而利者王，有福千世。",
      "literal": "Five governments clear then repair ritual righteousness, follow heaven timing raise troops attack punish beneficial ones king, have fortune thousand generations. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0078",
      "chinese": "人君王者舉而觀之。",
      "literal": "Person ruler kings raise observe it. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0079",
      "chinese": "漢大將軍霍子孟名光者，亦黃帝後世也。",
      "literal": "Han great general Huo Zi Meng named Guang, also Yellow Emperor later generations also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0080",
      "chinese": "此可為博聞遠見者言，固難為淺聞者說也。",
      "literal": "This can for broad knowledge far vision ones speak, indeed difficult for shallow knowledge ones explain also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0082",
      "chinese": "古諸侯以國為姓。",
      "literal": "Ancient feudal lords with state as surname. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0083",
      "chinese": "霍者，國名也。",
      "literal": "Huo what state name also. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0084",
      "chinese": "武王封弟叔處於霍，後世晉獻公滅霍公，後世為庶民，往來居平陽。",
      "literal": "Martial King enfeoffed younger brother Shu Chu at Huo, later generations Jin Xian duke extinguished Huo duke, later generations became common people, came went resided Pingyang. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0085",
      "chinese": "平陽在河東，河東晉地，分為衛國。",
      "literal": "Pingyang at Hedong, Hedong Jin territory, divided into Wei state. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0086",
      "chinese": "以詩言之，亦可為周世。",
      "literal": "With Poetry speak it, also can for Zhou generations. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0087",
      "chinese": "周起后稷，后稷無父而生。",
      "literal": "Zhou arose Hou Ji, Hou Ji no father born. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0089",
      "chinese": "高辛，黃帝曾孫。",
      "literal": "Gao Xin, Yellow Emperor great grandson. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0091",
      "chinese": "霍將軍者，本居平陽（自）［白］燕。",
      "literal": "Huo general, originally resided Pingyang Bai Yan. (translated).",
      "idiomatic": ""
    },
    {
      "id": "s0092",
      "chinese": "臣為郎時，與方士考功會旗亭下，為臣言。",
      "literal": "Minister as lang time, with fangshi Kao Gong met at flag pavilion below, for minister spoke. (translated).",
      "idiomatic": ""
    }
  ]
}