{
  "metadata": {
    "book": "shiji",
    "chapter": "023",
    "file": "data/shiji/023.json"
  },
  "sentences": [
    {
      "id": "2-s0017",
      "originalId": "s0017",
      "blockIndex": 2,
      "chinese": "孔子曰「必也正名」，於衛所居不合。",
      "literal": "Confucius said \"It must be rectifying names\", at Wei his residence not harmonious.",
      "idiomatic": ""
    },
    {
      "id": "2-s0018",
      "originalId": "s0018",
      "blockIndex": 2,
      "chinese": "仲尼沒後，受業之徒沈湮而不舉，或適齊、楚，或入河海，豈不痛哉！",
      "literal": "Zhong Ni passed away after, received teachings disciples sunken submerged not raised, some went to Qi, Chu, some entered rivers seas, how not painful!",
      "idiomatic": ""
    },
    {
      "id": "3-s0019",
      "originalId": "s0019",
      "blockIndex": 3,
      "chinese": "至秦有天下，悉內六國禮儀，采擇其善，雖不合聖制，其尊君抑臣，朝廷濟濟，依古以來。",
      "literal": "Until Qin possessed the realm, entirely took in six states' rites ceremonies, selected their good, though not matching sage system, their honoring ruler suppressing minister, court flourishing flourishing, following ancient since.",
      "idiomatic": ""
    },
    {
      "id": "3-s0020",
      "originalId": "s0020",
      "blockIndex": 3,
      "chinese": "至于高祖，光有四海，叔孫通頗有所增益減損，大抵皆襲秦故。",
      "literal": "As for Gaozu, illuminated possessed four seas, Shusun Tong considerably had additions subtractions, generally all followed Qin old.",
      "idiomatic": ""
    },
    {
      "id": "3-s0021",
      "originalId": "s0021",
      "blockIndex": 3,
      "chinese": "自天子稱號下至佐僚及宮室官名，少所變改。",
      "literal": "From Son of Heaven titles down to assistants and palace room official names, little changed.",
      "idiomatic": ""
    },
    {
      "id": "3-s0022",
      "originalId": "s0022",
      "blockIndex": 3,
      "chinese": "孝文即位，有司議欲定儀禮，孝文好道家之學，以為繁禮飾貌，無益於治，躬化謂何耳，故罷去之。",
      "literal": "Filial Wen ascended throne, officials discussed wished establish ceremony rites, Filial Wen fond Daoist learning, considered elaborate rites decorated appearances, no benefit to governing, personal transformation what ear, therefore dismissed them.",
      "idiomatic": ""
    },
    {
      "id": "3-s0023",
      "originalId": "s0023",
      "blockIndex": 3,
      "chinese": "孝景時，御史大夫晁錯明於世務刑名，數干諫孝景曰：「諸侯藩輔，臣子一例，古今之制也。",
      "literal": "Filial Jing time, Imperial Secretary Chun Cuo clear about worldly affairs penal names, several times earnestly admonished Filial Jing saying: \"Feudal lords screen auxiliaries, minister sons one precedent, ancient present system also.\"",
      "idiomatic": ""
    },
    {
      "id": "3-s0024",
      "originalId": "s0024",
      "blockIndex": 3,
      "chinese": "今大國專治異政，不稟京師，恐不可傳後。」",
      "literal": "Now great states monopolize governance different administration, not report capital, fear cannot transmit posterity.\"",
      "idiomatic": ""
    },
    {
      "id": "3-s0025",
      "originalId": "s0025",
      "blockIndex": 3,
      "chinese": "孝景用其計，而六國畔逆，以錯首名，天子誅錯以解難。",
      "literal": "Filial Jing used his plan, then six states rebelled rebelled, with Cuo first named, Son of Heaven executed Cuo to resolve difficulty.",
      "idiomatic": ""
    },
    {
      "id": "3-s0026",
      "originalId": "s0026",
      "blockIndex": 3,
      "chinese": "事在袁盎語中。",
      "literal": "Matter in Yuan'ang words midst.",
      "idiomatic": ""
    },
    {
      "id": "3-s0027",
      "originalId": "s0027",
      "blockIndex": 3,
      "chinese": "是後官者養交安祿而已，莫敢復議。",
      "literal": "After this officials nourished connections secured stipends only, none dared again discuss.",
      "idiomatic": ""
    },
    {
      "id": "4-s0028",
      "originalId": "s0028",
      "blockIndex": 4,
      "chinese": "今上即位，招致儒術之士，令共定儀，十餘年不就。",
      "literal": "Present Majesty ascended throne, summoned Confucian arts scholars, ordered together establish ceremonies, ten several years not completed.",
      "idiomatic": ""
    },
    {
      "id": "4-s0029",
      "originalId": "s0029",
      "blockIndex": 4,
      "chinese": "或言古者太平，萬民和喜，瑞應辨至，乃采風俗，定制作。",
      "literal": "Some said ancient ones great peace, ten thousand people harmonious happy, auspicious responses clearly arrived, then collected customs, established creations.",
      "idiomatic": ""
    },
    {
      "id": "4-s0030",
      "originalId": "s0030",
      "blockIndex": 4,
      "chinese": "上聞之，制詔御史曰：「蓋受命而王，各有所由興，殊路而同歸，謂因民而作，追俗為制也。",
      "literal": "Above heard it, formulated edict imperial secretary saying: \"Probably received mandate became king, each had origin arose, different roads same return, means following people made, pursuing customs as system also.\"",
      "idiomatic": ""
    },
    {
      "id": "4-s0031",
      "originalId": "s0031",
      "blockIndex": 4,
      "chinese": "議者咸稱太古，百姓何望？",
      "literal": "Discussers all praised great antiquity, common people what hope?",
      "idiomatic": ""
    }
  ]
}