{
  "metadata": {
    "book": "shiji",
    "chapter": "032",
    "file": "data/shiji/032.json"
  },
  "sentences": [
    {
      "id": "s0002",
      "chinese": "其先祖嘗為四嶽，佐禹平水土甚有功。",
      "literal": "His forebears had served as the Four Peaks officials and helped the legendary Yu control the great floods, earning considerable merit.",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "或曰，太公博聞，嘗事紂。",
      "literal": "Some accounts say the Grand Duke was widely knowledgeable and had once served under King Zhou.",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "紂無道，去之。",
      "literal": "King Zhou was tyrannical, so he abandoned him.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "游說諸侯，無所遇，而卒西歸周西伯。",
      "literal": "He traveled among the feudal lords trying to persuade them, but found no one receptive, so he finally journeyed west to join the Zhou Western Earl.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "三人者為西伯求美女奇物，獻之於紂，以贖西伯。",
      "literal": "These three men found beautiful women and precious treasures for the Western Earl and presented them to King Zhou as ransom for his release.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "西伯得以出，反國。",
      "literal": "The Western Earl was thereby freed and returned to his domain.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "伐崇、密須、犬夷，大作豐邑。",
      "literal": "He conquered Chong, Mi Xu, and Quan Yi, and greatly expanded the city of Feng.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "文王崩，武王即位。",
      "literal": "King Wen died, and King Wu succeeded him as king.",
      "idiomatic": ""
    },
    {
      "id": "s0029",
      "chinese": "遂至盟津。",
      "literal": "They reached the Meng crossing.",
      "idiomatic": ""
    },
    {
      "id": "s0030",
      "chinese": "諸侯不期而會者八百諸侯。",
      "literal": "Eight hundred feudal lords assembled there spontaneously, without any prior coordination.",
      "idiomatic": ""
    },
    {
      "id": "s0033",
      "chinese": "還師，與太公作此太誓。",
      "literal": "He ordered the army to withdraw and, together with the Grand Duke, composed the Great Oath.",
      "idiomatic": ""
    },
    {
      "id": "s0034",
      "chinese": "居二年，紂殺王子比干，囚箕子。",
      "literal": "Two years passed, during which King Zhou executed his uncle Bi Gan and imprisoned his brother Ji Zi.",
      "idiomatic": ""
    },
    {
      "id": "s0035",
      "chinese": "武王將伐紂，卜龜兆，不吉，風雨暴至。",
      "literal": "As King Wu prepared to attack King Zhou, he consulted the oracle with turtle shells. The signs were unfavorable, and a violent storm suddenly broke out.",
      "idiomatic": ""
    },
    {
      "id": "s0036",
      "chinese": "群公盡懼，唯太公彊之勸武王，武王於是遂行。",
      "literal": "All the nobles were terrified, but only the Grand Duke forcefully encouraged King Wu to continue. King Wu pressed on.",
      "idiomatic": ""
    },
    {
      "id": "s0037",
      "chinese": "十一年正月甲子，誓於牧野，伐商紂。",
      "literal": "On the jiazi day of the first month in his eleventh year, King Wu swore the oath at Muye Plain and attacked King Zhou of Shang.",
      "idiomatic": ""
    },
    {
      "id": "s0039",
      "chinese": "紂反走，登鹿臺，遂追斬紂。",
      "literal": "King Zhou fled back to his palace, climbed the Deer Terrace, and was pursued and executed there.",
      "idiomatic": ""
    },
    {
      "id": "s0041",
      "chinese": "散鹿臺之錢，發鉅橋之粟，以振貧民。",
      "literal": "They distributed the treasure from the Deer Terrace and opened the granaries at Ju Bridge to aid the impoverished people.",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "遷九鼎，修周政，與天下更始。",
      "literal": "They transported the Nine Cauldrons, reformed Zhou administration, and inaugurated a new era for the empire.",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "於是武王已平商而王天下，封師尚父於齊營丘。",
      "literal": "Having conquered Shang and become ruler of the world, King Wu enfeoffed Master Shangfu in the state of Qi at Yingqiu.",
      "idiomatic": ""
    },
    {
      "id": "s0046",
      "chinese": "東就國，道宿行遲。",
      "literal": "He journeyed east to his new domain, stopping to rest along the way and traveling at a leisurely pace.",
      "idiomatic": ""
    },
    {
      "id": "s0049",
      "chinese": "太公聞之，夜衣而行，犁明至國。",
      "literal": "The Grand Duke heard this criticism, dressed in the night and set out, arriving at his domain by morning light.",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "萊侯來伐，與之爭營丘。",
      "literal": "The Marquis of Lai launched an attack, disputing control of Yingqiu with him.",
      "idiomatic": ""
    },
    {
      "id": "s0051",
      "chinese": "營丘邊萊。",
      "literal": "Yingqiu was adjacent to the state of Lai.",
      "idiomatic": ""
    },
    {
      "id": "s0053",
      "chinese": "太公至國，修政，因其俗，簡其禮，通商工之業，便魚鹽之利，而人民多歸齊，齊為大國。",
      "literal": "When the Grand Duke arrived in his domain, he reformed the administration, respected local customs, simplified ceremonies, promoted trade and manufacturing, developed the fishing and salt industries, and attracted many people to Qi. Thus Qi became a major power.",
      "idiomatic": ""
    },
    {
      "id": "s0055",
      "chinese": "齊由此得征伐，為大國。",
      "literal": "Through this, Qi gained the authority to wage war and became one of the great powers.",
      "idiomatic": ""
    },
    {
      "id": "s0056",
      "chinese": "都營丘。",
      "literal": "The capital city was Yingqiu.",
      "idiomatic": ""
    },
    {
      "id": "s0058",
      "chinese": "丁公卒，子乙公得立。",
      "literal": "Duke Ding died, and his son Duke Yi (De) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0059",
      "chinese": "乙公卒，子癸公慈母立。",
      "literal": "Duke Yi died, and his son Duke Gui (Ci Mu) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0060",
      "chinese": "癸公卒，子哀公不辰立。",
      "literal": "Duke Gui died, and his son Duke Ai (Bu Chen) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0065",
      "chinese": "九年，獻公卒，子武公壽立。",
      "literal": "Nine years later, Duke Xian died and his son Duke Wu (Shou) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0066",
      "chinese": "武公九年，周厲王出奔，居彘。",
      "literal": "In Duke Wu's ninth year, King Li of Zhou fled his capital and took refuge in Zhi.",
      "idiomatic": ""
    },
    {
      "id": "s0068",
      "chinese": "二十四年，周宣王初立。",
      "literal": "In the twenty-fourth year, King Xuan of Zhou ascended the throne.",
      "idiomatic": ""
    },
    {
      "id": "s0069",
      "chinese": "二十六年，武公卒，子厲公無忌立。",
      "literal": "Twenty-six years later, Duke Wu died and his son Duke Li (Wu Ji) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0073",
      "chinese": "文公十二年卒，子成公脫立。",
      "literal": "Duke Wen died in his twelfth year, and his son Duke Cheng (Tuo) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0074",
      "chinese": "成公九年卒，子莊公購立。",
      "literal": "Duke Cheng died in his ninth year, and his son Duke Zhuang (Gou) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0075",
      "chinese": "莊公二十四年，犬戎殺幽王，周東徙雒。",
      "literal": "In Duke Zhuang's twenty-fourth year, the Quan Rong barbarians killed King You of Zhou, forcing the Zhou court to relocate eastward to Luoyang.",
      "idiomatic": ""
    },
    {
      "id": "s0076",
      "chinese": "秦始列為諸侯。",
      "literal": "Qin was officially recognized as one of the feudal states.",
      "idiomatic": ""
    },
    {
      "id": "s0077",
      "chinese": "五十六年，晉弒其君昭侯。",
      "literal": "Fifty-six years later, the state of Jin assassinated their ruler Duke Zhao.",
      "idiomatic": ""
    },
    {
      "id": "s0078",
      "chinese": "六十四年，莊公卒，子釐公祿甫立。",
      "literal": "Sixty-four years later, Duke Zhuang died and his son Duke Xi (Lu Fu) succeeded him.",
      "idiomatic": ""
    },
    {
      "id": "s0079",
      "chinese": "釐公九年，魯隱公初立。",
      "literal": "In Duke Xi's ninth year, Duke Yin of Lu ascended the throne.",
      "idiomatic": ""
    },
    {
      "id": "s0080",
      "chinese": "十九年，魯桓公弒其兄隱公而自立為君。",
      "literal": "Nineteen years later, Duke Huan of Lu assassinated his brother Duke Yin and usurped the throne.",
      "idiomatic": ""
    },
    {
      "id": "s0081",
      "chinese": "二十五年，北戎伐齊。",
      "literal": "Twenty-five years later, the northern Rong barbarians invaded Qi.",
      "idiomatic": ""
    },
    {
      "id": "s0084",
      "chinese": "遂辭之。",
      "literal": "He therefore politely refused.",
      "idiomatic": ""
    },
    {
      "id": "s0086",
      "chinese": "其子曰公孫無知，釐公愛之，令其秩服奉養比太子。",
      "literal": "His son was named Gong Sun Wu Zhi. Duke Xi doted on him and granted him status, clothing, and maintenance equal to that of the crown prince.",
      "idiomatic": ""
    },
    {
      "id": "s0087",
      "chinese": "三十三年，釐公卒，太子諸兒立，是為襄公。",
      "literal": "Thirty-three years later, Duke Xi died and the crown prince Zhu Er succeeded him as Duke Xiang.",
      "idiomatic": ""
    },
    {
      "id": "s0089",
      "chinese": "四年，魯桓公與夫人如齊。",
      "literal": "Four years later, Duke Huan of Lu traveled to Qi with his wife.",
      "idiomatic": ""
    },
    {
      "id": "s0092",
      "chinese": "魯桓公知之，怒夫人，夫人以告齊襄公。",
      "literal": "Duke Huan discovered the affair and confronted his wife in anger. She informed Duke Xiang of Qi.",
      "idiomatic": ""
    },
    {
      "id": "s0094",
      "chinese": "魯人以為讓，而齊襄公殺彭生以謝魯。",
      "literal": "The people of Lu were outraged, so Duke Xiang executed Peng Sheng to appease them.",
      "idiomatic": ""
    },
    {
      "id": "s0095",
      "chinese": "八年，伐紀，紀遷去其邑。",
      "literal": "Eight years later, Qi attacked the state of Ji, forcing them to abandon their capital.",
      "idiomatic": ""
    },
    {
      "id": "s0096",
      "chinese": "十二年，初，襄公使連稱、管至父戍葵丘，瓜時而往，及瓜而代。",
      "literal": "Twelve years later: initially, Duke Xiang sent Lian Cheng and Guan Zhi Fu to garrison Kui Qiu. They were to go at melon-planting time and be replaced at melon-harvesting time.",
      "idiomatic": ""
    }
  ]
}