{
  "metadata": {
    "book": "shiji",
    "chapter": "007",
    "file": "data/shiji/007.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "項籍者，下相人也，字羽。",
      "literal": "Xiang Ji was a man from Xiaxiang, styled Yu.",
      "idiomatic": "Xiang Ji came from the town of Xiaxiang and was styled Yu."
    },
    {
      "id": "s0002",
      "chinese": "初起時，年二十四。",
      "literal": "When he first rose up, he was twenty-four years old.",
      "idiomatic": "When he first took up arms, he was twenty-four years old."
    },
    {
      "id": "s0003",
      "chinese": "其季父項梁，梁父即楚將項燕，為秦將王翦所戮者也。",
      "literal": "His youngest uncle Xiang Liang; Liang's father was precisely the Chu general Xiang Yan, who was executed by the Qin general Wang Jian.",
      "idiomatic": "His uncle Xiang Liang was the son of the Chu general Xiang Yan, who had been executed by the Qin general Wang Jian."
    },
    {
      "id": "s0004",
      "chinese": "項氏世世為楚將，封於項，故姓項氏。",
      "literal": "The Xiang clan generation after generation served as Chu generals, were enfeoffed at Xiang, therefore took the surname Xiang.",
      "idiomatic": "The Xiang family had served as generals for the state of Chu for generations. They were enfeoffed at Xiang, hence took the surname Xiang."
    },
    {
      "id": "s0005",
      "chinese": "項籍少時，學書不成，去學劍，又不成。",
      "literal": "When Xiang Ji was young, he studied writing but didn't succeed, then went to study swordsmanship, and again didn't succeed.",
      "idiomatic": "In his youth, Xiang Ji tried to learn calligraphy but failed. He then tried swordsmanship but failed at that too."
    },
    {
      "id": "s0006",
      "chinese": "項梁怒之。",
      "literal": "Xiang Liang was angry with him.",
      "idiomatic": "Xiang Liang grew angry with him."
    },
    {
      "id": "s0007",
      "chinese": "籍曰：「書足以記名姓而已。",
      "literal": "Ji said: 'Writing is sufficient only to record names and surnames.",
      "idiomatic": "Ji replied, 'Writing is only good for recording names and surnames."
    },
    {
      "id": "s0008",
      "chinese": "劍一人敵，不足學，學萬人敵。」",
      "literal": "A sword fights one person, not worth learning; learn to fight ten thousand people.'",
      "idiomatic": "A sword is for fighting one man—not worth studying. Learn to command armies of ten thousand.'"
    },
    {
      "id": "s0009",
      "chinese": "於是項梁乃教籍兵法，籍大喜，略知其意，又不肯竟學。",
      "literal": "Thereupon Xiang Liang taught Ji military strategy. Ji was greatly pleased, understood its general principles, but again refused to study it completely.",
      "idiomatic": "So Xiang Liang taught him the art of war. Xiang Ji was delighted and grasped the basic concepts, but refused to complete his studies."
    },
    {
      "id": "s0010",
      "chinese": "項梁嘗有櫟陽逮，乃請蘄獄掾曹咎書抵櫟陽獄掾司馬欣，以故事得已。",
      "literal": "Xiang Liang once had a Queyang arrest case, so he requested the Qi prison clerk Cao Jiu to write a letter to the Queyang prison clerk Sima Xin, and through precedents got it resolved.",
      "idiomatic": "Xiang Liang once faced arrest in Queyang. He asked the prison official Cao Jiu from Qi to write to the prison official Sima Xin in Queyang, and through legal precedents the matter was resolved."
    },
    {
      "id": "s0011",
      "chinese": "項梁殺人，與籍避仇於吳中。",
      "literal": "Xiang Liang killed someone, and together with Ji fled their enemies to Wu region.",
      "idiomatic": "Xiang Liang had killed a man, so he and Xiang Ji fled to the Wu region to escape their enemies."
    },
    {
      "id": "s0012",
      "chinese": "吳中賢士大夫皆出項梁下。",
      "literal": "The worthy scholars and officials in Wu all served under Xiang Liang.",
      "idiomatic": "All the worthy gentlemen and officials in the Wu region acknowledged Xiang Liang as their leader."
    },
    {
      "id": "s0013",
      "chinese": "每吳中有大繇役及喪，項梁常為主辦，陰以兵法部勒賓客及子弟，以是知其能。",
      "literal": "Whenever there were great labor services or funerals in Wu, Xiang Liang always took charge of organizing them, secretly using military methods to organize the guests and younger relatives, and through this people knew his abilities.",
      "idiomatic": "Whenever the Wu region had major labor projects or funerals, Xiang Liang always took charge. Secretly he organized the guests and young men using military discipline, and through this people recognized his capabilities."
    },
    {
      "id": "s0014",
      "chinese": "秦始皇帝游會稽，渡浙江，梁與籍俱觀。",
      "literal": "When the First Emperor of Qin toured Kuaiji and crossed the Zhejiang, Liang and Ji both watched.",
      "idiomatic": "When Qin Shi Huang toured Kuaiji and crossed the Zhejiang River, both Xiang Liang and Xiang Ji watched from the crowd."
    },
    {
      "id": "s0015",
      "chinese": "籍曰：「彼可取而代也。」",
      "literal": "Ji said: 'He can be taken and replaced.'",
      "idiomatic": "Xiang Ji said, 'That man can be seized and replaced.'"
    },
    {
      "id": "s0016",
      "chinese": "梁掩其口，曰：「毋妄言，族矣！」",
      "literal": "Liang covered his mouth, saying: 'Don't speak recklessly, you'll destroy the whole clan!'",
      "idiomatic": "Xiang Liang clapped his hand over Xiang Ji's mouth. 'Don't talk nonsense,' he said. 'You'll get our whole clan executed!'"
    },
    {
      "id": "s0017",
      "chinese": "梁以此奇籍。",
      "literal": "Liang considered Ji extraordinary because of this.",
      "idiomatic": "Xiang Liang regarded Xiang Ji as extraordinary because of this incident."
    },
    {
      "id": "s0018",
      "chinese": "籍長八尺餘，力能扛鼎，才氣過人，雖吳中子弟皆已憚籍矣。",
      "literal": "Ji was over eight chi tall, had the strength to lift tripods, and his talent and spirit surpassed others. Even the young men of Wu already feared Ji.",
      "idiomatic": "Xiang Ji stood over eight feet tall and had the strength to lift a bronze tripod. His talent and spirit were extraordinary. Even the young men of Wu feared him."
    },
    {
      "id": "s0019",
      "chinese": "秦二世元年七月，陳涉等起大澤中。",
      "literal": "In the first year of Qin Ershi, seventh month, Chen She and others rose up in Daze.",
      "idiomatic": "In the seventh month of the first year of Qin Ershi's reign, Chen She and others rose in rebellion from the Great Swamp."
    },
    {
      "id": "s0020",
      "chinese": "其九月，會稽守通謂梁曰：「江西皆反，此亦天亡秦之時也。",
      "literal": "In the ninth month, the Kuaiji governor Tong said to Liang: 'West of the Jiang are all rebelling, this is also the time when Heaven intends to destroy Qin.",
      "idiomatic": "In the ninth month, the governor of Kuaiji, Yin Tong, said to Xiang Liang, 'Everyone west of the Yangtze has rebelled. This is Heaven's time to destroy Qin.'"
    },
    {
      "id": "s0021",
      "chinese": "吾聞先即制人，後則為人所制。",
      "literal": "I have heard that he who strikes first controls others, he who strikes later is controlled by others.",
      "idiomatic": "I've heard it said that those who strike first control others, while those who strike later are controlled."
    },
    {
      "id": "s0022",
      "chinese": "吾欲發兵，使公及桓楚將。」",
      "literal": "I wish to raise troops, and have you and Huan Chu command them.'",
      "idiomatic": "I intend to raise an army and put you and Huan Chu in command.'"
    },
    {
      "id": "s0023",
      "chinese": "是時桓楚亡在澤中。",
      "literal": "At this time Huan Chu was hiding in the marshes.",
      "idiomatic": "At this time, Huan Chu was in hiding in the marshes."
    },
    {
      "id": "s0024",
      "chinese": "梁曰：「桓楚亡，人莫知其處，獨籍知之耳。」",
      "literal": "Liang said: 'Huan Chu is in hiding, no one knows his location, only Ji knows it.'",
      "idiomatic": "Xiang Liang replied, 'Huan Chu is in hiding. No one knows where he is—only Xiang Ji does.'"
    },
    {
      "id": "s0025",
      "chinese": "梁乃出，誡籍持劍居外待。",
      "literal": "Liang then went out and instructed Ji to hold his sword and wait outside.",
      "idiomatic": "Xiang Liang stepped out and told Xiang Ji to stand guard outside with his sword drawn."
    },
    {
      "id": "s0026",
      "chinese": "梁復入，與守坐，曰：「請召籍，使受命召桓楚。」",
      "literal": "Liang entered again, sat with the governor, and said: 'Please summon Ji so he can receive orders to summon Huan Chu.'",
      "idiomatic": "Xiang Liang returned inside and sat with the governor. 'Please summon Xiang Ji,' he said, 'so he can receive orders to call up Huan Chu.'"
    },
    {
      "id": "s0027",
      "chinese": "守曰：「諾。」",
      "literal": "The governor said: \"Very well.\"",
      "idiomatic": "The governor agreed."
    },
    {
      "id": "s0028",
      "chinese": "梁召籍入。",
      "literal": "Liang summoned Ji to enter.",
      "idiomatic": "Xiang Liang called Xiang Ji inside."
    },
    {
      "id": "s0029",
      "chinese": "須臾，梁眴籍曰：「可行矣！」",
      "literal": "After a moment, Liang winked at Ji and said: \"You may proceed!\"",
      "idiomatic": "A moment later, Xiang Liang winked at Xiang Ji and said, \"Do it!\""
    },
    {
      "id": "s0030",
      "chinese": "於是籍遂拔劍斬守頭。",
      "literal": "Thereupon Ji drew his sword and cut off the governor's head.",
      "idiomatic": "Xiang Ji then drew his sword and beheaded the governor."
    },
    {
      "id": "s0031",
      "chinese": "項梁持守頭，佩其印綬。",
      "literal": "Xiang Liang held the governor's head and wore his seal cord.",
      "idiomatic": "Xiang Liang took the governor's head and put on his official seal."
    },
    {
      "id": "s0032",
      "chinese": "門下大驚，擾亂，籍所擊殺數十百人。",
      "literal": "The gate guards were greatly alarmed, Ji struck and killed several dozen people.",
      "idiomatic": "The guards at the gate were terrified. Xiang Ji struck down dozens of them."
    },
    {
      "id": "s0033",
      "chinese": "一府中皆慴伏，莫敢起。",
      "literal": "Everyone in the headquarters was terrified and submissive, no one dared rise.",
      "idiomatic": "Everyone in the headquarters was cowed into submission. No one dared to resist."
    },
    {
      "id": "s0034",
      "chinese": "梁乃召故所知豪吏，諭以所為起大事，遂舉吳中兵。",
      "literal": "Liang then summoned the influential officials he had known before, and explained to them the great undertaking they were starting.",
      "idiomatic": "Xiang Liang summoned the powerful officials he knew and explained the great rebellion they were launching."
    },
    {
      "id": "s0035",
      "chinese": "使人收下縣，得精兵八千人。",
      "literal": "They then raised troops from Wu region, and sent people to gather from the subordinate counties, obtaining eight thousand elite soldiers.",
      "idiomatic": "They raised an army from the Wu region and sent recruiters to the neighboring counties, gathering eight thousand crack troops."
    },
    {
      "id": "s0036",
      "chinese": "梁部署吳中豪傑為校尉、候、司馬。",
      "literal": "Liang appointed the heroic figures of Wu as colonels, scouts, and adjutants.",
      "idiomatic": "Xiang Liang appointed the leading men of Wu as officers—colonels, scouts, and adjutants."
    },
    {
      "id": "s0037",
      "chinese": "有一人不得用，自言於梁。",
      "literal": "There was one person who did not get an official position, and spoke to Liang about it himself.",
      "idiomatic": "One man who didn't receive an appointment complained directly to Xiang Liang."
    },
    {
      "id": "s0038",
      "chinese": "梁曰：「前時某喪使公主某事，不能辦，以此不任用公。」",
      "literal": "Liang said: \"At such-and-such a time, for such-and-such a matter, I sent Merchant So-and-so, and he got heavy bribes, so I had no choice but to give him the position.\"",
      "idiomatic": "Xiang Liang replied, \"At a certain time, for a certain matter, I sent Merchant X on business. He received heavy bribes, so I had to give him the appointment.\""
    },
    {
      "id": "s0039",
      "chinese": "眾乃皆伏。",
      "literal": "Thereupon Ji cut off the merchant's head to make an example, saying: \"You all follow the army: the first to arrive become generals, next become adjutants, later ones become soldiers, those who wish to leave may do so.\"",
      "idiomatic": "Xiang Ji then beheaded the merchant as an example. \"All of you join the army,\" he announced. \"First to arrive become generals, next become adjutants, last become common soldiers. Those who wish to leave may go.\""
    },
    {
      "id": "s0040",
      "chinese": "於是梁為會稽守，籍為裨將，徇下縣。",
      "literal": "Thereupon those who wished to leave firmly stayed, those who wished to stay left.",
      "idiomatic": "Those who wanted to leave stayed put, while those who wanted to stay departed."
    },
    {
      "id": "s0041",
      "chinese": "廣陵人召平於是為陳王徇廣陵，未能下。",
      "literal": "Ji said: \"What sort of person is a stalwart warrior?\"",
      "idiomatic": "Xiang Ji asked, \"What kind of man is a true warrior?\""
    },
    {
      "id": "s0042",
      "chinese": "聞陳王敗走，秦兵又且至，乃渡江矯陳王命，拜梁為楚王上柱國。",
      "literal": "He stripped off his clothes and asked to be tattooed where the sword had struck.",
      "idiomatic": "He bared his body and asked to be tattooed at the spot where the sword had cut him."
    },
    {
      "id": "s0043",
      "chinese": "曰：「江東已定，急引兵西擊秦。」",
      "literal": "They tattooed him.",
      "idiomatic": "They tattooed him."
    },
    {
      "id": "s0044",
      "chinese": "項梁乃以八千人渡江而西。",
      "literal": "At this time, in all the commanderies and counties that suffered under Qin officials, they all punished their chief officials and killed them to respond to Chen She.",
      "idiomatic": "At this time, in all the commanderies and counties that suffered under Qin rule, the people executed their local officials to join Chen She's rebellion."
    },
    {
      "id": "s0045",
      "chinese": "聞陳嬰已下東陽，使使欲與連和俱西。",
      "literal": "They then made Liang governor of Kuaiji, and Ji assistant general.",
      "idiomatic": "They appointed Xiang Liang as governor of Kuaiji and Xiang Ji as his deputy general."
    },
    {
      "id": "s0046",
      "chinese": "陳嬰者，故東陽令史，居縣中，素信謹，稱為長者。",
      "literal": "They toured the subordinate counties.",
      "idiomatic": "They marched through the neighboring counties."
    },
    {
      "id": "s0047",
      "chinese": "東陽少年殺其令，相聚數千人，欲置長，無適用，乃請陳嬰。",
      "literal": "The Guangling man Zhao Ping was then campaigning for the King of Chen at Guangling, but could not conquer it.",
      "idiomatic": "Zhao Ping of Guangling was at this time campaigning for the King of Chen at Guangling, but failed to take it."
    },
    {
      "id": "s0048",
      "chinese": "嬰謝不能，遂彊立嬰為長，縣中從者得二萬人。",
      "literal": "Liang sent Ji to attack Guangling, and he broke it.",
      "idiomatic": "Xiang Liang sent Xiang Ji to attack Guangling, and he captured it."
    },
    {
      "id": "s0049",
      "chinese": "少年欲立嬰便為王，異軍蒼頭特起。",
      "literal": "He returned and reported to Liang, who was greatly pleased and entrusted all military affairs to Ji.",
      "idiomatic": "Xiang Ji returned and reported to Xiang Liang, who was delighted and put Xiang Ji in charge of all military operations."
    },
    {
      "id": "s0050",
      "chinese": "陳嬰母謂嬰曰：「自我為汝家婦，未嘗聞汝先古之有貴者。",
      "literal": "Ji then led troops to attack Yuanfu.",
      "idiomatic": "Xiang Ji then led his troops to attack Yuanfu."
    }
  ]
}