{
  "metadata": {
    "book": "shiji",
    "chapter": "025",
    "file": "data/shiji/025.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "王者制事立法，物度軌則，壹稟於六律，六律為萬事根本焉。",
      "literal": "Kings establish affairs make laws, things measure tracks rules, one receive from six pitchpipes, six pitchpipes are ten thousand affairs root there.",
      "idiomatic": ""
    },
    {
      "id": "1-s0002",
      "originalId": "s0002",
      "blockIndex": 1,
      "chinese": "其於兵械尤所重，故云「望敵知吉凶，聞聲效勝負」，百王不易之道也。",
      "literal": "Its at weapons especially what heavy, therefore say \"gaze enemy know auspicious inauspicious, hear sound imitate victory defeat\", hundred kings unchanging way also.",
      "idiomatic": ""
    },
    {
      "id": "2-s0003",
      "originalId": "s0003",
      "blockIndex": 2,
      "chinese": "武王伐紂，吹律聽聲，推孟春以至于季冬，殺氣相并，而音尚宮。",
      "literal": "Wu King attacked Zhou, blew pitchpipes listened sound, extended first spring to last winter, killing qi mutually joined, but sound still palace.",
      "idiomatic": ""
    },
    {
      "id": "2-s0004",
      "originalId": "s0004",
      "blockIndex": 2,
      "chinese": "同聲相從，物之自然，何足怪哉？",
      "literal": "Same sound mutually follow, things natural, what sufficient strange?",
      "idiomatic": ""
    },
    {
      "id": "3-s0005",
      "originalId": "s0005",
      "blockIndex": 3,
      "chinese": "兵者，聖人所以討彊暴，平亂世，夷險阻，救危殆。",
      "literal": "Weapons, sages thus punish strong violent, pacify chaotic age, level dangerous obstacles, save perilous dangerous.",
      "idiomatic": ""
    },
    {
      "id": "3-s0006",
      "originalId": "s0006",
      "blockIndex": 3,
      "chinese": "自含（血）［齒］戴角之獸見犯則校，而況於人懷好惡喜怒之氣？",
      "literal": "From contain teeth wear horns beasts see offense then fight, moreover about people harbor likes dislikes joy anger qi?",
      "idiomatic": ""
    },
    {
      "id": "3-s0007",
      "originalId": "s0007",
      "blockIndex": 3,
      "chinese": "喜則愛心生，怒則毒螫加，情性之理也。",
      "literal": "Happy then love heart born, angry then poison sting add, feelings nature principle also.",
      "idiomatic": ""
    },
    {
      "id": "4-s0008",
      "originalId": "s0008",
      "blockIndex": 4,
      "chinese": "昔黃帝有涿鹿之戰，以定火災；",
      "literal": "Former Yellow Emperor had Zhuolu battle, to settle fire disaster;",
      "idiomatic": ""
    },
    {
      "id": "4-s0009",
      "originalId": "s0009",
      "blockIndex": 4,
      "chinese": "顓頊有共工之陳，以平水害；",
      "literal": "Zhuanxu had Gonggong battle array, to pacify water harm;",
      "idiomatic": ""
    },
    {
      "id": "4-s0010",
      "originalId": "s0010",
      "blockIndex": 4,
      "chinese": "成湯有南巢之伐，以殄夏亂。",
      "literal": "Cheng Tang had Nanchao attack, to exterminate Xia chaos.",
      "idiomatic": ""
    },
    {
      "id": "4-s0011",
      "originalId": "s0011",
      "blockIndex": 4,
      "chinese": "遞興遞廢，勝者用事，所受於天也。",
      "literal": "Alternately rise alternately abandon, victors use affairs, what received from heaven also.",
      "idiomatic": ""
    },
    {
      "id": "5-s0012",
      "originalId": "s0012",
      "blockIndex": 5,
      "chinese": "自是之後，名士迭興，晉用咎犯，而齊用王子，吳用孫武，申明軍約，賞罰必信，卒伯諸侯，兼列邦土，雖不及三代之誥誓，然身寵君尊，當世顯揚，可不謂榮焉？",
      "literal": "From this after, famous scholars alternately rise, Jin used Jiu Fan, and Qi used Wang Zi, Wu used Sun Wu, explained clear army covenants, rewards punishments must trustworthy, troops hegemon feudal lords, combined listed state lands, though not reach three dynasties declarations oaths, however body favored lord honored, current age famous raised, can not call glory there?",
      "idiomatic": ""
    },
    {
      "id": "5-s0013",
      "originalId": "s0013",
      "blockIndex": 5,
      "chinese": "豈與世儒闇於大較，不權輕重，猥云德化，不當用兵，大至君辱失守，小乃侵犯削弱，遂執不移等哉！",
      "literal": "How with world Confucians dark about great outline, not weigh light heavy, foolishly say virtue transformation, not proper use weapons, great to lord humiliated lose defense, small then invade weaken, then hold not move equal!",
      "idiomatic": ""
    },
    {
      "id": "5-s0014",
      "originalId": "s0014",
      "blockIndex": 5,
      "chinese": "笔教笞不可廢於家，刑罰不可捐於國，誅伐不可偃於天下，用之有巧拙，行之有逆順耳。",
      "literal": "Writing teaching cane cannot abandon in family, punishments cannot discard in state, executions attacks cannot rest in realm, use have skillful clumsy, carry out have contrary compliant ears.",
      "idiomatic": ""
    },
    {
      "id": "6-s0015",
      "originalId": "s0015",
      "blockIndex": 6,
      "chinese": "夏桀、殷紂手搏豺狼，足追四馬，勇非微也；",
      "literal": "Xia Jie, Yin Zhou hand wrestled jackals wolves, feet chased four horses, bravery not small also;",
      "idiomatic": ""
    }
  ]
}