{
  "metadata": {
    "book": "shiji",
    "chapter": "017",
    "file": "data/shiji/017.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "太史公曰：殷以前尚矣。",
      "literal": "Grand Historian said: Yin before still ancient.",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "周封五等：公，侯，伯，子，男。",
      "literal": "Zhou enfeoffed five ranks: duke, marquis, earl, viscount, baron.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "然封伯禽、康叔於魯、衛，地各四百里，親親之義，褒有德也；",
      "literal": "However enfeoffed Bo Qin, Kang Shu at Lu, Wei, territories each four hundred li, love relatives principle, praise have virtue also;",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "太公於齊，兼五侯地，尊勤勞也。",
      "literal": "Tai Gong at Qi, combined five marquises territory, honor diligent labor also.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "武王、成、康所封數百，而同姓五十五，地上不過百里，下三十里，以輔衛王室。",
      "literal": "Wu Wang, Cheng, Kang enfeoffed several hundred, while same surname fifty-five, territory top not exceed hundred li, bottom thirty li, to assist protect royal house.",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "管、蔡、康叔、曹、鄭，或過或損。",
      "literal": "Guan, Cai, Kang Shu, Cao, Zheng, some exceed some reduce.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "厲、幽之後，王室缺，侯伯彊國興焉，天子微，弗能正。",
      "literal": "Li, You after, royal house deficient, marquises earls strong states rise there, Son of Heaven weak, not able correct.",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "非德不純，形勢弱也。",
      "literal": "Not virtue not pure, strategic position weak also.",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "漢興，序二等。",
      "literal": "Han rose, ranked two grades.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "高祖末年，非劉氏而王者，若無功上所不置而侯者，天下共誅之。",
      "literal": "Gao Zu end years, not Liu clan while king ones, if no merit emperor not establish while marquis ones, world together execute them.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "高祖子弟同姓為王者九國，雖獨長沙異姓，而功臣侯者百有餘人。",
      "literal": "Gao Zu sons brothers same surname become kings nine states, although only Changsha different surname, while meritorious ministers marquis ones hundred plus persons.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "自雁門、太原以東至遼陽，為燕代國；",
      "literal": "From Yanmen, Taiyuan east to Liaoyang, became Yan Dai states;",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "常山以南，大行左轉，度河、濟，阿、甄以東薄海，為齊、趙國；",
      "literal": "Changshan south, Taihang left turn, cross Yellow River, Ji, A, Zhen east reach sea, became Qi, Zhao states;",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "自陳以西，南至九疑，東帶江、淮、谷、泗，薄會稽，為梁、楚、淮南、長沙國：皆外接於胡、越。",
      "literal": "From Chen west, south to Jiuyi, east border Jiang, Huai, Gu, Si, reach Kuaiji, became Liang, Chu, Huainan, Changsha states: all externally connect to Hu, Yue.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "而內地北距山以東盡諸侯地，大者或五六郡，連城數十，置百官宮觀，僭於天子。",
      "literal": "While inner lands north border mountains east exhaust feudal lords territories, large ones or five six commanderies, connected cities dozens, established hundred officials palaces temples, presumptuously toward Son of Heaven.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "漢獨有三河、東郡、潁川、南陽，自江陵以西至蜀，北自雲中至隴西，與內史凡十五郡，而公主列侯頗食邑其中。",
      "literal": "Han alone had Sanhe, Dongjun, Yingchuan, Nanyang, from Jiangling west to Shu, north from Yunzhong to Longxi, with inner minister altogether fifteen commanderies, while princesses marquises considerably eat fiefs therein.",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "何者？",
      "literal": "Why?",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "天下初定，骨肉同姓少，故廣彊庶孽，以鎮撫四海，用承衛天子也。",
      "literal": "World initially pacified, close relatives same surname few, therefore extensively strengthened collateral branches, to pacify stabilize four seas, used to support protect Son of Heaven also.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "漢定百年之閒，親屬益疏，諸侯或驕奢，忕邪臣計謀為淫亂，大者叛逆，小者不軌于法，以危其命，殞身亡國。",
      "literal": "Han pacified hundred years interval, relatives increasingly distant, feudal lords some arrogant extravagant, followed evil ministers schemed for lewd disorder, large ones rebelled, small ones not followed by law, to endanger their lives, perished bodies lost states.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "天子觀於上古，然後加惠，使諸侯得推恩分子弟國邑，故齊分為七，趙分為六，梁分為五，淮南分三，及天子支庶子為王，王子支庶為侯，百有餘焉。",
      "literal": "Son of Heaven observed ancient times, then added favor, caused feudal lords able extend favor divide sons brothers state cities, therefore Qi divided into seven, Zhao into six, Liang into five, Huainan into three, and Son of Heaven collateral sons become kings, kings collateral sons become marquises, hundred plus thereupon.",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "吳楚時，前后諸侯或以適削地，是以燕、代無北邊郡，吳、淮南、長沙無南邊郡，齊、趙、梁、楚支郡名山陂海咸納於漢。",
      "literal": "Wu Chu time, before after feudal lords some because crimes reduced territories, therefore Yan, Dai no northern border commanderies, Wu, Huainan, Changsha no southern border commanderies, Qi, Zhao, Liang, Chu branch commanderies famous mountains ponds seas all submitted to Han.",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "諸侯稍微，大國不過十餘城，小侯不過數十里，上足以奉貢職，下足以供養祭祀，以蕃輔京師。",
      "literal": "Feudal lords slightly weakened, large states not exceed ten plus cities, small marquises not exceed several ten li, above sufficient pay tribute duties, below sufficient supply support sacrifices, to multiply assist capital.",
      "idiomatic": ""
    },
    {
      "id": "s0023",
      "chinese": "而漢郡八九十，形錯諸侯閒，犬牙相臨，秉其阸塞地利，彊本干，弱枝葉之勢，尊卑明而萬事各得其所矣。",
      "literal": "While Han commanderies eighty ninety, interlocked feudal lords between, interlocking teeth mutually adjacent, grasped their strategic passes terrain advantages, strengthened trunk root, weakened branches leaves posture, honor low clear and myriad matters each obtained their place.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "臣遷謹記高祖以來至太初諸侯，譜其下益損之時，令時世得覽。",
      "literal": "Minister Qian respectfully records Gao Zu since to Tai Chu feudal lords, tabulated their below increase decrease times, caused age world able view.",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "形勢雖彊，要之以仁義為本。",
      "literal": "Strategic position although strong, essential with benevolence righteousness as foundation.",
      "idiomatic": ""
    },
    {
      "id": "s53",
      "chinese": "公元前206",
      "literal": "206 BCE",
      "idiomatic": ""
    },
    {
      "id": "s54",
      "chinese": "高祖元年",
      "literal": "Gao Zu first year",
      "idiomatic": ""
    },
    {
      "id": "s55",
      "chinese": "楚。",
      "literal": "Chu.",
      "idiomatic": ""
    },
    {
      "id": "s58",
      "chinese": "齊。",
      "literal": "Qi.",
      "idiomatic": ""
    },
    {
      "id": "s65",
      "chinese": "荊。",
      "literal": "Jing.",
      "idiomatic": ""
    },
    {
      "id": "s66",
      "chinese": "淮南。",
      "literal": "Huainan.",
      "idiomatic": ""
    },
    {
      "id": "s67",
      "chinese": "燕。",
      "literal": "Yan.",
      "idiomatic": ""
    },
    {
      "id": "s68",
      "chinese": "趙。",
      "literal": "Zhao.",
      "idiomatic": ""
    },
    {
      "id": "s74",
      "chinese": "梁。",
      "literal": "Liang.",
      "idiomatic": ""
    },
    {
      "id": "s78",
      "chinese": "淮陽。",
      "literal": "Huaiyang.",
      "idiomatic": ""
    },
    {
      "id": "s79",
      "chinese": "代。",
      "literal": "Dai.",
      "idiomatic": ""
    },
    {
      "id": "s80",
      "chinese": "長沙。",
      "literal": "Changsha.",
      "idiomatic": ""
    },
    {
      "id": "s81",
      "chinese": "205",
      "literal": "205",
      "idiomatic": ""
    },
    {
      "id": "s82",
      "chinese": "二",
      "literal": "Two",
      "idiomatic": ""
    },
    {
      "id": "s83",
      "chinese": "都彭城。",
      "literal": "Capital Pengcheng.",
      "idiomatic": ""
    },
    {
      "id": "s86",
      "chinese": "都臨菑。",
      "literal": "Capital Linzi.",
      "idiomatic": ""
    },
    {
      "id": "s93",
      "chinese": "都吳。",
      "literal": "Capital Wu.",
      "idiomatic": ""
    },
    {
      "id": "s94",
      "chinese": "都壽春。",
      "literal": "Capital Shouchun.",
      "idiomatic": ""
    },
    {
      "id": "s95",
      "chinese": "都薊。",
      "literal": "Capital Ji.",
      "idiomatic": ""
    },
    {
      "id": "s96",
      "chinese": "都邯鄲。",
      "literal": "Capital Handan.",
      "idiomatic": ""
    },
    {
      "id": "s102",
      "chinese": "都淮陽。",
      "literal": "Capital Huaiyang.",
      "idiomatic": ""
    },
    {
      "id": "s106",
      "chinese": "都陳。",
      "literal": "Capital Chen.",
      "idiomatic": ""
    },
    {
      "id": "s107",
      "chinese": "十一月，初王韓信元年。都馬邑。",
      "literal": "Eleventh month, first king Han Xin first year. Capital Mayi.",
      "idiomatic": ""
    },
    {
      "id": "s109",
      "chinese": "204",
      "literal": "204",
      "idiomatic": ""
    },
    {
      "id": "s110",
      "chinese": "三",
      "literal": "Three",
      "idiomatic": ""
    }
  ]
}