{
  "metadata": {
    "book": "shiji",
    "chapter": "043",
    "file": "data/shiji/043.json"
  },
  "sentences": [
    {
      "id": "s0431",
      "chinese": "孟姚也。",
      "literal": "She was Meng Yao.",
      "idiomatic": "Her name was Meng Yao."
    },
    {
      "id": "s0432",
      "chinese": "孟姚甚有寵於王，是為惠后。",
      "literal": "Meng Yao was very favored by the Wang. She became Hui Hou.",
      "idiomatic": "Meng Yao was greatly favored by the king. She became Empress Hui."
    },
    {
      "id": "s0433",
      "chinese": "十七年，王出九門，為野臺，以望齊、中山之境。",
      "literal": "In the seventeenth year, the Wang went out the nine gates and made a wild terrace to overlook the borders of Qi and Zhongshan.",
      "idiomatic": "In the seventeenth year, the king went beyond the nine gates and built a viewing terrace to survey the borders of Qi and Zhongshan."
    },
    {
      "id": "s0434",
      "chinese": "十八年，秦武王與孟說舉龍文赤鼎，絕臏而死。",
      "literal": "In the eighteenth year, Qin Wu Wang with Meng Yue lifted the dragon-patterned red ding and broke his kneecap and died.",
      "idiomatic": "In the eighteenth year, King Wu of Qin, together with Meng Yue, tried to lift the dragon-patterned red ding. He ruptured his kneecap and died."
    },
    {
      "id": "s0435",
      "chinese": "趙王使代相趙固迎公子稷於燕，送歸，立為秦王，是為昭王。",
      "literal": "Zhao Wang sent Dai chancellor Zhao Gu to welcome Prince Ji from Yan, sent him back, and established him as Qin Wang. This was Zhao Wang.",
      "idiomatic": "King Zhao sent the chancellor of Dai, Zhao Gu, to fetch Prince Ji from Yan, escorted him back, and enthroned him as king of Qin. This was King Zhao."
    },
    {
      "id": "s0436",
      "chinese": "十九年春正月，大朝信宮。",
      "literal": "In the nineteenth year, spring, first month, great court at Xin Gong.",
      "idiomatic": "In the nineteenth year, spring, first month, grand court assembly at Xin Palace."
    },
    {
      "id": "s0437",
      "chinese": "召肥義與議天下，五日而畢。",
      "literal": "He summoned Fei Yi to discuss the world with him. They finished in five days.",
      "idiomatic": "He summoned Fei Yi to discuss affairs of the world with him. They concluded in five days."
    },
    {
      "id": "s0438",
      "chinese": "王北略中山之地，至於房子，遂之代，北至無窮，西至河，登黃華之上。",
      "literal": "The Wang raided Zhongshan's lands to the north, reaching Fang Zi, then Dai, north to the endless, west to the river, and ascended above Huang Hua.",
      "idiomatic": "The king campaigned north through Zhongshan's territories, reaching Fangzi, then proceeded to Dai, north to the boundless wastes, west to the Yellow River, and ascended Mount Huanghua."
    },
    {
      "id": "s0441",
      "chinese": "夫有高世之名，必有遺俗之累。",
      "literal": "Indeed, having a high world name certainly brings the burden of transcending custom.",
      "idiomatic": "Indeed, possessing a reputation that towers above the age necessarily brings the burden of transcending convention."
    },
    {
      "id": "s0442",
      "chinese": "吾欲胡服。」",
      "literal": "I desire Hu clothing.'",
      "idiomatic": "I wish to adopt Hu clothing.'"
    },
    {
      "id": "s0443",
      "chinese": "樓緩曰：「善。」",
      "literal": "Lou Huan said: 'Good.'",
      "idiomatic": "Lou Huan said: 'Excellent.'"
    },
    {
      "id": "s0444",
      "chinese": "群臣皆不欲。",
      "literal": "All the group ministers did not desire it.",
      "idiomatic": "All the ministers opposed it."
    },
    {
      "id": "s0446",
      "chinese": "為人臣者，寵有孝弟長幼順明之節，通有補民益主之業，此兩者臣之分也。",
      "literal": "Being a minister, favor has the sections of filial piety, respect for elders, orderly relationships, and clarity. Comprehensive has enterprises that supplement the people and benefit the lord. These two are the minister's duty.",
      "idiomatic": "As ministers, when favored we must observe the proprieties of filial piety, fraternal duty, respect for elders and juniors, obedience, and clarity. When employed, we must undertake works that benefit the people and advantage the lord. These two constitute a minister's proper role."
    },
    {
      "id": "s0447",
      "chinese": "今吾欲繼襄主之跡，開於胡、翟之鄉，而卒世不見也。",
      "literal": "Now I desire to continue Xiang lord's tracks, open to the regions of Hu and Di, but the lifetime world does not see it.",
      "idiomatic": "Now I wish to follow in Lord Xiang's footsteps and open up the regions of the Hu and Di peoples, but the world in its lifetime does not perceive this."
    },
    {
      "id": "s0448",
      "chinese": "為敵弱，用力少而功多，可以毋盡百姓之勞，而序往古之勳。",
      "literal": "Make the enemy weak, use little strength but gain much merit, can avoid exhausting the commoners' labor, and arrange the merits of past ancients.",
      "idiomatic": ""
    }
  ]
}