{
  "metadata": {
    "book": "shiji",
    "chapter": "019",
    "file": "data/shiji/019.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "太史公讀列封至便侯，曰：有以也夫！",
      "literal": "The Grand Historian read the list of enfeoffments down to the Marquis of Bian and said: 'There is a reason for this!'",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "長沙王者，著令甲，稱其忠焉。",
      "literal": "The King of Changsha was recorded in the statutes as one who demonstrated loyalty.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "昔高祖定天下，功臣非同姓疆土而王者八國。",
      "literal": "In the past, when Gaozu pacified the empire, among the meritorious ministers who were not of the same surname as the imperial family and were enfeoffed as kings, there were eight states.",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "至孝惠時，唯獨長江全，禪五世，禪五世，以無嗣絕，意無過，為藩守職，信矣。",
      "literal": "By the time of Emperor Hui, only the Jiang family remained complete, passing the throne through five generations. Because there was no heir, it came to an end. In intention there was no fault; they served as regional guardians with good faith.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "故其澤流枝庶，毋功而侯者數人。",
      "literal": "Therefore, their beneficence flowed to branches and descendants, and several persons became marquises without merit.",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "及孝惠訖孝景閒五十載，追修高祖時遣功臣，及從代來，吳楚之勞，諸侯子弟若肺腑，外國歸義，封者九十有餘。",
      "literal": "From Emperor Hui to the period between Emperor Hui and Emperor Jing, over fifty years, they pursued and honored the meritorious ministers from Gaozu's time, as well as those who followed from Dai, and the laborers of Wu and Chu, the sons of nobles like close relatives, and foreigners who submitted to righteousness. Those enfeoffed numbered more than ninety.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "咸表始終，當世仁義成功之著者也。",
      "literal": "All displayed their beginnings and ends, and were the prominent ones of contemporary benevolence, righteousness, achievement, and success.",
      "idiomatic": ""
    },
    {
      "id": "s15",
      "chinese": "國名",
      "literal": "State Name",
      "idiomatic": ""
    },
    {
      "id": "s16",
      "chinese": "侯功",
      "literal": "Marquis Merit",
      "idiomatic": ""
    },
    {
      "id": "s17",
      "chinese": "孝惠七",
      "literal": "Emperor Hui period (7 years)",
      "idiomatic": ""
    },
    {
      "id": "s18",
      "chinese": "高后八",
      "literal": "Empress Gao period (8 years)",
      "idiomatic": ""
    },
    {
      "id": "s19",
      "chinese": "孝文二十三",
      "literal": "Emperor Wen period (23 years)",
      "idiomatic": ""
    },
    {
      "id": "s20",
      "chinese": "孝景十六",
      "literal": "Emperor Jing period (16 years)",
      "idiomatic": ""
    },
    {
      "id": "s21",
      "chinese": "建元至元封六年三十六",
      "literal": "Jianyu to Yuanfeng period (36 years)",
      "idiomatic": ""
    },
    {
      "id": "s22",
      "chinese": "太初已後",
      "literal": "Taichu period and after",
      "idiomatic": ""
    },
    {
      "id": "s23",
      "chinese": "便。",
      "literal": "Bian",
      "idiomatic": ""
    },
    {
      "id": "s24",
      "chinese": "長沙王子，侯，二千戶。",
      "literal": "Prince of Changsha, became Marquis, 2,000 households.",
      "idiomatic": ""
    },
    {
      "id": "s25",
      "chinese": "七。元年九月，頃侯吳淺元年。",
      "literal": "Seven. First year, ninth month: Marquis Qing Wu Qian first year.",
      "idiomatic": ""
    },
    {
      "id": "s26",
      "chinese": "八",
      "literal": "Eight",
      "idiomatic": ""
    },
    {
      "id": "s27",
      "chinese": "二十二。一。後七年，恭侯信元年。",
      "literal": "Twenty-two. One. Later seventh year: Marquis Gong Xin first year.",
      "idiomatic": ""
    },
    {
      "id": "s28",
      "chinese": "五。十一。前六年，侯廣志元年。",
      "literal": "Five. Eleven. Former sixth year: Marquis Guang Zhi first year.",
      "idiomatic": ""
    },
    {
      "id": "s29",
      "chinese": "二十八。元鼎五年，侯千秋坐酎金，國除。",
      "literal": "Twenty-eight. Yuanding fifth year: Marquis Qian Qiu convicted of tribute gold deficiency, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s31",
      "chinese": "軑。",
      "literal": "Yan.",
      "idiomatic": ""
    },
    {
      "id": "s32",
      "chinese": "長沙相，侯，七百戶。",
      "literal": "Prime Minister of Changsha, Marquis, seven hundred households.",
      "idiomatic": ""
    },
    {
      "id": "s33",
      "chinese": "六。二年四月庚子，侯利倉元年。",
      "literal": "Six. Second year fourth month gengzi, Marquis Li Cang first year.",
      "idiomatic": ""
    },
    {
      "id": "s34",
      "chinese": "二。六。三年，侯豨元年。",
      "literal": "Two. Six. Third year, Marquis Xi first year.",
      "idiomatic": ""
    },
    {
      "id": "s35",
      "chinese": "十五。八。十六年，侯彭祖元年。",
      "literal": "Fifteen. Eight. Sixteenth year, Marquis Peng Zu first year.",
      "idiomatic": ""
    },
    {
      "id": "s36",
      "chinese": "十六",
      "literal": "Sixteen",
      "idiomatic": ""
    },
    {
      "id": "s37",
      "chinese": "三十。元封元年，侯秩為東海太守，行過不請，擅發卒兵為衛，當斬，會赦，國除。",
      "literal": "Thirty. Yuanfeng first year, Marquis Zhi served as Grand Administrator of Donghai, passed through without requesting permission, arbitrarily mobilized troops as escort, should be executed, but met amnesty, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s39",
      "chinese": "平都。",
      "literal": "Pingdu.",
      "idiomatic": ""
    },
    {
      "id": "s40",
      "chinese": "以齊將，高祖三年降，定齊，侯，千戶。",
      "literal": "As General of Qi, surrendered in Gaozu third year, pacified Qi, Marquis, one thousand households.",
      "idiomatic": ""
    },
    {
      "id": "s41",
      "chinese": "三。五年六月乙亥，孝侯劉到元年。",
      "literal": "Three. Fifth year sixth month yi hai, Marquis Xiao Liu Dao first year.",
      "idiomatic": ""
    },
    {
      "id": "s42",
      "chinese": "八",
      "literal": "Eight",
      "idiomatic": ""
    },
    {
      "id": "s43",
      "chinese": "二。二十一。三年，侯成元年。",
      "literal": "Two. Twenty-one. Third year, Marquis Cheng first year.",
      "idiomatic": ""
    },
    {
      "id": "s44",
      "chinese": "十四。後二年，侯成有罪，國除。",
      "literal": "Fourteen. Later second year, Marquis Cheng committed crime, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s54",
      "chinese": "扶柳。",
      "literal": "Fu Liu",
      "idiomatic": ""
    },
    {
      "id": "s55",
      "chinese": "高后姊長姁子，侯。",
      "literal": "Son of Empress Gao's elder sister Chang Xu, became Marquis.",
      "idiomatic": ""
    },
    {
      "id": "s57",
      "chinese": "七。元年四月庚寅，侯呂平元年。八年，侯平坐呂氏事誅，國除。",
      "literal": "Seven. First year, fourth month, gengyin day: Marquis Lü Ping first year. Eighth year: Marquis Ping convicted of Lü clan affairs, executed, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s61",
      "chinese": "郊。",
      "literal": "Jiao",
      "idiomatic": ""
    },
    {
      "id": "s62",
      "chinese": "呂后兄悼武王身佐高祖定天下，呂氏佐高祖治天下，天下大安，封武王少子產為郊侯。",
      "literal": "Empress Lü's elder brother King Dao Wu personally assisted Gaozu in pacifying the empire, the Lü clan assisted Gaozu in governing the empire, the empire greatly at peace, enfeoffed King Wu's youngest son Chan as Marquis of Jiao.",
      "idiomatic": ""
    },
    {
      "id": "s64",
      "chinese": "五。元年四月辛卯，侯呂產元年。六年七月壬辰，產為呂王，國除。八年九月，產以呂王為漢相，謀為不善。大臣誅產，遂滅諸呂。",
      "literal": "Five. First year, fourth month, xinmao day: Marquis Lü Chan first year. Sixth year, seventh month, renchen day: Chan became King of Lü, state abolished. Eighth year, ninth month: Chan as King of Lü became Han Chancellor, plotted evil. The ministers executed Chan, then exterminated all the Lü clan.",
      "idiomatic": ""
    },
    {
      "id": "s68",
      "chinese": "南宮。",
      "literal": "Nan Gong",
      "idiomatic": ""
    },
    {
      "id": "s69",
      "chinese": "以父越人為高祖騎將，從軍，以大中大夫侯。",
      "literal": "Father was a Yue native who served as Gaozu's cavalry general, followed the army, became Grand Master of Ceremonies, became Marquis.",
      "idiomatic": ""
    },
    {
      "id": "s71",
      "chinese": "七。元年四月丙寅，侯張買元年。八年，侯買坐呂氏事誅，國除。",
      "literal": "Seven. First year, fourth month, bingyin day: Marquis Zhang Mai first year. Eighth year: Marquis Mai convicted of Lü clan affairs, executed, state abolished.",
      "idiomatic": ""
    },
    {
      "id": "s75",
      "chinese": "梧。",
      "literal": "Wu",
      "idiomatic": ""
    },
    {
      "id": "s76",
      "chinese": "以軍匠從起郟，入漢，後為少府，作長樂、未央宮，築長安城，先就，功侯，五百戶。",
      "literal": "As military craftsman followed uprising at Ji, entered Han, later became Privy Treasurer, constructed Chang Le and Wei Yang palaces, built Chang'an city, completed first, meritorious Marquis, 500 households.",
      "idiomatic": ""
    },
    {
      "id": "s78",
      "chinese": "六。元年四月乙酉，齊侯陽成延元年。二。七年，敬侯去疾元年。",
      "literal": "Six. First year, fourth month, yiyou day: Marquis of Qi Yang Cheng Yan first year. Two. Seventh year: Marquis Jing Qu Ji first year.",
      "idiomatic": ""
    },
    {
      "id": "s79",
      "chinese": "二十三",
      "literal": "Twenty-three",
      "idiomatic": ""
    },
    {
      "id": "s80",
      "chinese": "九。七。中三年，靖侯偃元年。",
      "literal": "Nine. Seven. Zhong third year: Marquis Jing Yan first year.",
      "idiomatic": ""
    },
    {
      "id": "s81",
      "chinese": "八。元光三年，侯戎奴元年。十四。元狩五年，侯戎奴坐謀殺季父棄市，國除。",
      "literal": "Eight. Yuanguang third year: Marquis Rong Nu first year. Fourteen. Yuanshou fifth year: Marquis Rong Nu convicted of plotting to kill maternal uncle, executed in market, state abolished.",
      "idiomatic": ""
    }
  ]
}