{
  "metadata": {
    "book": "shiji",
    "chapter": "029",
    "file": "data/shiji/029.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "《夏書》曰：禹抑洪水十三年，過家不入門。",
      "literal": "The Xia Classic says: Yu controlled the floodwaters for thirteen years, passing by his home without entering the door.",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "陸行載車，水行載舟，泥行蹈毳，山行即橋。",
      "literal": "On land he rode in carriages, on water he sailed in boats, through mud he trod on rushes, over mountains he employed bridges.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "以別九州，隨山浚川，任土作貢。",
      "literal": "He divided the nine provinces, dredged rivers following the mountains, and established tribute according to the soil.",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "通九道，陂九澤，度九山。",
      "literal": "He opened nine routes, dammed nine marshes, and surveyed nine mountains.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "然河菑衍溢，害中國也尤甚。",
      "literal": "Yet the Yellow River's disasters overflowed and harmed China especially severely.",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "唯是為務。",
      "literal": "He made this his sole task.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "故道河自積石歷龍門，南到華陰，東下砥柱，及孟津、雒汭，至于大邳。",
      "literal": "Therefore he directed the Yellow River from Ji Shi through Long Men, south to Hua Yin, east down Dizhu, reaching Meng Jin and Luo Hui, arriving at Da Pei.",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "北載之高地，過降水，至于大陸，播為九河，同為逆河，入于勃海九川既疏，九澤既灑，諸夏艾安，功施于三代。",
      "literal": "North it carried to high ground, passing Jiang Shui, reaching Da Lu, spreading into nine rivers, all flowing back into the Yellow River, entering the Bohai Sea. The nine rivers being dredged, the nine marshes being cleared, all China peaceful, the merit extending to the Three Dynasties.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "自是之後，滎陽下引河東南為鴻溝，以通宋、鄭、陳、蔡、曹、衛，與濟、汝、淮、泗會。",
      "literal": "From this time on, from Xing Yang they diverted the Yellow River southeast to make the Hong Gou, connecting Song, Zheng, Chen, Cai, Cao, Wei, meeting with Ji, Ru, Huai, and Si.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "于楚，西方則通渠漢水、雲夢之野，東方則通［鴻］溝江淮之閒。",
      "literal": "In Chu, to the west they opened channels through the Han River and Yun Meng marshes, to the east they connected the Hong Gou between the Yangtze and Huai.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "於吳，則通渠三江、五湖。",
      "literal": "In Wu, they opened channels through the Three Rivers and Five Lakes.",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "於齊，則通菑濟之閒。",
      "literal": "In Qi, they opened channels between Zi and Ji.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "此渠皆可行舟，有餘則用溉浸，百姓饗其利。",
      "literal": "These canals could all carry boats; when there was surplus water they used it for irrigation, and the people enjoyed their benefits.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "至于所過，往往引其水益用溉田疇之渠，以萬億計，然莫足數也。",
      "literal": "Regarding the places passed, they often diverted their waters to additionally irrigate farmland canals, numbering in the tens of thousands, but cannot be fully counted.",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "西門豹引漳水溉鄴，以富魏之河內。",
      "literal": "Xi Men Bao diverted Zhang River water to irrigate Ye, enriching Wei's He Nei region.",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "而韓聞秦之好興事，欲罷之，毋令東伐，乃使水工鄭國閒說秦，令鑿涇水自中山西邸瓠口為渠，并北山東注洛三百餘里，欲以溉田。",
      "literal": "Han heard Qin liked to undertake projects, wished to stop them and not let them attack east, so sent water engineer Zheng Guo to secretly persuade Qin, ordering him to dig the Jing River from Zhong Shan west to Hu Kou as a canal, flowing north along the mountain east into Luo for over three hundred li, intending to irrigate fields.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "中作而覺，秦欲殺鄭國。",
      "literal": "Halfway through construction they discovered it, and Qin wished to kill Zheng Guo.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "鄭國曰：「始臣為閒，然渠成亦秦之利也。」",
      "literal": "Zheng Guo said: 'At first I was sent secretly, but the canal's completion will also benefit Qin.'",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "秦以為然，卒使就渠。",
      "literal": "Qin considered this correct and finally had him complete the canal.",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "渠就，用注填閼之水，溉澤鹵之地四萬餘頃，收皆畝一鐘。",
      "literal": "The canal completed, using it to divert accumulated water, irrigating saline-alkali land over forty thousand qing, with harvests of one zhong per mu.",
      "idiomatic": ""
    },
    {
      "id": "s0023",
      "chinese": "於是關中為沃野，無凶年，秦以富彊，卒并諸侯，因命曰鄭國渠。",
      "literal": "Therefore Guanzhong became fertile land, with no famine years; Qin grew rich and strong, finally unified the feudal lords, so named it Zheng Guo Canal.",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "其後四十有餘年，今天子元光之中，而河決於瓠子，東南注鉅野，通於淮、泗。",
      "literal": "Forty plus years later, during the present emperor's Yuan Guang period, the Yellow River breached at Hou Zi, southeast flowing into Ju Ye, connecting to Huai and Si.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "於是天子使汲黯、鄭當時興人徒塞之，輒復壞。",
      "literal": "Therefore the emperor sent Ji An and Zheng Dang Shi to raise people and troops to block it, but it repeatedly broke again.",
      "idiomatic": ""
    },
    {
      "id": "s0027",
      "chinese": "是時武安侯田蚡為丞相，其奉邑食鄃。",
      "literal": "At this time Wu An Hou Tian Fen was chancellor, his fief receiving income from Ju.",
      "idiomatic": ""
    },
    {
      "id": "s0028",
      "chinese": "鄃居河北，河決而南則鄃無水菑，邑收多。",
      "literal": "Ju was north of the Yellow River; if the river breached south then Ju had no water disaster, and fief income increased.",
      "idiomatic": ""
    },
    {
      "id": "s0030",
      "chinese": "而望氣用數者亦以為然。",
      "literal": "Those who observed vapors and used calculations also considered it so.",
      "idiomatic": ""
    },
    {
      "id": "s0031",
      "chinese": "於是天子久之不事復塞也。",
      "literal": "Therefore the emperor long did not undertake blocking it again.",
      "idiomatic": ""
    },
    {
      "id": "s0035",
      "chinese": "天子以為然，令齊人水工徐伯表，悉發卒數萬人穿漕渠，三歲而通。",
      "literal": "The emperor considered it correct, ordered the Qi water engineer Xu Bo to make the plan, completely raised troops several tens of thousands to dig the transport canal, and in three years it was connected.",
      "idiomatic": ""
    },
    {
      "id": "s0036",
      "chinese": "通，以漕，大便利。",
      "literal": "Connected, used for transport, greatly convenient.",
      "idiomatic": ""
    },
    {
      "id": "s0037",
      "chinese": "其後漕稍多，而渠下之民頗得以溉田矣。",
      "literal": "Afterward transport gradually increased, and the people below the canal could considerably irrigate their fields.",
      "idiomatic": ""
    },
    {
      "id": "s0039",
      "chinese": "穿渠引汾溉皮氏、汾陰下，引河溉汾陰、蒲阪下，度可得五千頃。",
      "literal": "Dig a canal to divert the Fen to irrigate Pi Shi and below Fen Yin, divert the Yellow River to irrigate below Fen Yin and Pu Ban, estimated can get five thousand qing.",
      "idiomatic": ""
    },
    {
      "id": "s0040",
      "chinese": "五千頃故盡河壖棄地，民茭牧其中耳，今溉田之，度可得穀二百萬石以上。",
      "literal": "Five thousand qing were formerly all abandoned land on the Yellow River banks; people only harvested reeds and pastured among them, but now irrigating the fields, estimated can get grain over two million shi.",
      "idiomatic": ""
    },
    {
      "id": "s0042",
      "chinese": "天子以為然，發卒數萬人作渠田。",
      "literal": "The emperor considered it correct and raised troops several tens of thousands to make canal fields.",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "數歲，河移徙，渠不利，則田者不能償種。",
      "literal": "Several years later, the Yellow River shifted, the canal became unfavorable, and farmers could not repay their seeds.",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "久之，河東渠田廢，予越人，令少府以為稍入。",
      "literal": "After a long time, the Hedong canal fields were abandoned, given to Yue people, and ordered the Lesser Treasury to use them as salary income.",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "其後人有上書欲通褒斜道及漕事，下御史大夫張湯。",
      "literal": "Afterward someone memorialized wishing to open the Bao Xie road and transport matters, so it was sent to Censor-in-Chief Zhang Tang.",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "而褒水通沔，斜水通渭，皆可以行船漕。",
      "literal": "Bao water connects to Mian, Xie water connects to Wei, all can carry boats for transport.",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "如此，漢中之穀可致，山東從沔無限，便於砥柱之漕。",
      "literal": "Thus, Hanzhong grain can be delivered, Shandong from Mian unlimited, convenient for Dizhu transport.",
      "idiomatic": ""
    },
    {
      "id": "s0053",
      "chinese": "道果便近，而水湍石，不可漕。",
      "literal": "The road was indeed convenient and near, but the water turbulent with rocks, cannot be used for transport.",
      "idiomatic": ""
    },
    {
      "id": "s0056",
      "chinese": "於是為發卒萬餘人穿渠，自徵引洛水至商顏山下。",
      "literal": "Therefore raised troops over ten thousand to dig a canal, diverting Luo water from Zheng to below Shang Yan mountain.",
      "idiomatic": ""
    },
    {
      "id": "s0057",
      "chinese": "岸善崩，乃鑿井，深者四十餘丈。",
      "literal": "The banks easily collapsed, so they dug wells, the deepest over forty zhang.",
      "idiomatic": ""
    },
    {
      "id": "s0058",
      "chinese": "往往為井，井下相通行水。",
      "literal": "Often they made wells, and below the wells the flowing water mutually connected.",
      "idiomatic": ""
    },
    {
      "id": "s0059",
      "chinese": "水穨以絕商顏，東至山嶺十餘里閒。",
      "literal": "The water was stopped to block Shang Yan, east to the mountain ridge over ten li between.",
      "idiomatic": ""
    },
    {
      "id": "s0060",
      "chinese": "井渠之生自此始。",
      "literal": "The origin of well canals began from this.",
      "idiomatic": ""
    },
    {
      "id": "s0061",
      "chinese": "穿渠得龍骨，故名曰龍首渠。",
      "literal": "Digging the canal they got dragon bones, so it was named Dragon Head Canal.",
      "idiomatic": ""
    },
    {
      "id": "s0062",
      "chinese": "作之十餘歲，渠頗通，猶未得其饒。",
      "literal": "They worked on it for over ten years; the canal was considerably connected, but still had not obtained its richness.",
      "idiomatic": ""
    },
    {
      "id": "s0063",
      "chinese": "自河決瓠子後二十餘歲，歲因以數不登，而梁楚之地尤甚。",
      "literal": "Over twenty years after the Yellow River breached at Hou Zi, the years repeatedly failed to be bountiful, with Liang and Chu lands especially severe.",
      "idiomatic": ""
    },
    {
      "id": "s0064",
      "chinese": "天子既封禪巡祭山川，其明年，旱，乾封少雨。",
      "literal": "The emperor having performed feng shan and toured to sacrifice to mountains and rivers, the next year there was drought, and the dry feng had little rain.",
      "idiomatic": ""
    },
    {
      "id": "s0065",
      "chinese": "天子乃使汲仁、郭昌發卒數萬人塞瓠子決。",
      "literal": "The emperor then sent Ji Ren and Guo Chang to raise troops several tens of thousands to block the Hou Zi breach.",
      "idiomatic": ""
    },
    {
      "id": "s0066",
      "chinese": "於是天子已用事萬里沙，則還自臨決河，沈白馬玉璧于河，令群臣從官自將軍已下皆負薪窴決河。",
      "literal": "Therefore the emperor, having performed affairs at Wan Li Sha, then returned personally to oversee the breached river, sank a white horse and jade bi in the river, and ordered all ministers and officials from generals down to carry firewood and fill the breached river.",
      "idiomatic": ""
    }
  ]
}