{
  "metadata": {
    "book": "shiji",
    "chapter": "008",
    "file": "data/shiji/008.json"
  },
  "sentences": [
    {
      "id": "s0636",
      "chinese": "高祖所教歌兒百二十人，皆令為吹樂，後有缺，輒補之。",
      "literal": "The one hundred twenty boys Gao Zu had taught to sing were all ordered to perform music; when later there were vacancies, they would always fill them.",
      "idiomatic": "The 120 boys Gaozu had taught to sing were all assigned to perform music. When vacancies occurred later, they were always filled."
    },
    {
      "id": "s0637",
      "chinese": "高帝八男：長庶齊悼惠王肥；",
      "literal": "The High Emperor had eight sons: the eldest, Concubine-born King Dao Hui of Qi, Fei;",
      "idiomatic": "The High Emperor had eight sons: the eldest by a concubine was King Daohui of Qi, Fei;"
    },
    {
      "id": "s0638",
      "chinese": "次孝惠，呂后子；",
      "literal": "next Emperor Xiaohui, son of Empress Lü;",
      "idiomatic": "next was Emperor Xiaohui, son of Empress Lü;"
    },
    {
      "id": "s0639",
      "chinese": "次戚夫人子趙隱王如意；",
      "literal": "next Consort Qi's son King Yin of Zhao, Ruyi;",
      "idiomatic": "next was Consort Qi's son, King Yin of Zhao, Ruyi;"
    },
    {
      "id": "s0640",
      "chinese": "次代王恒，已立為孝文帝，薄太后子；",
      "literal": "next King Heng of Dai, who was installed as Emperor Xiaowen, son of Grand Empress Dowager Bo;",
      "idiomatic": "next was King Heng of Dai, later installed as Emperor Xiaowen, son of Grand Empress Dowager Bo;"
    },
    {
      "id": "s0641",
      "chinese": "次梁王恢，呂太后時徙為趙共王；",
      "literal": "next King Hui of Liang, who in Empress Lü's time was moved to be King Gong of Zhao;",
      "idiomatic": "next was King Hui of Liang, who during Empress Lü's reign was moved to become King Gong of Zhao;"
    },
    {
      "id": "s0642",
      "chinese": "次淮陽王友，呂太后時徙為趙幽王；",
      "literal": "next King You of Huaiyang, who in Empress Lü's time was moved to be King You of Zhao;",
      "idiomatic": "next was King You of Huaiyang, who during Empress Lü's reign was moved to become King You of Zhao;"
    },
    {
      "id": "s0643",
      "chinese": "次淮南厲王長；",
      "literal": "next King Li of Huainan, Chang;",
      "idiomatic": "next was King Li of Huainan, Chang;"
    },
    {
      "id": "s0644",
      "chinese": "次燕王建。",
      "literal": "next King Jian of Yan.",
      "idiomatic": "next was King Jian of Yan."
    },
    {
      "id": "s0645",
      "chinese": "太史公曰：夏之政忠。",
      "literal": "The Grand Historian says: The governance of Xia was loyal.",
      "idiomatic": "The Grand Historian says: 'The Xia dynasty governed with loyalty.'"
    },
    {
      "id": "s0646",
      "chinese": "忠之敝，小人以野，故殷人承之以敬。",
      "literal": "When loyalty became corrupt, petty men became crude; therefore the Yin people succeeded it with reverence.",
      "idiomatic": "When loyalty decayed, the common people grew uncouth. The Yin dynasty therefore succeeded it with reverence.'"
    },
    {
      "id": "s0647",
      "chinese": "敬之敝，小人以鬼，故周人承之以文。",
      "literal": "When reverence became corrupt, petty men became superstitious; therefore the Zhou people succeeded it with culture.",
      "idiomatic": "When reverence decayed, the common people turned to superstition. The Zhou dynasty therefore succeeded it with ritual.'"
    },
    {
      "id": "s0648",
      "chinese": "文之敝，小人以僿，故救僿莫若以忠。",
      "literal": "When culture becomes corrupt, petty men become deceitful; therefore to rescue deceit nothing is better than loyalty.",
      "idiomatic": "When ritual decayed, the common people became deceitful. To remedy deceit, nothing works better than loyalty.'"
    },
    {
      "id": "s0649",
      "chinese": "三王之道若循環，終而復始。",
      "literal": "The Way of the Three Kings is like a cycle, ending and beginning again.",
      "idiomatic": "The Way of the Three Sovereigns is cyclical, ending only to begin anew.'"
    },
    {
      "id": "s0650",
      "chinese": "周秦之閒，可謂文敝矣。",
      "literal": "Between Zhou and Qin, it can be said culture had become corrupt.",
      "idiomatic": "Between the Zhou and Qin dynasties, ritual had clearly decayed.'"
    },
  ]
}