{
  "metadata": {
    "book": "shiji",
    "chapter": "014",
    "file": "data/shiji/014.json"
  },
  "sentences": [
    {
      "id": "s1",
      "chinese": "太史公讀春秋歷譜諜，至周厲王，未嘗不廢書而嘆也。",
      "literal": "The Grand Historian read the Spring and Autumn Annals, the chronological tables, and the secret records, but whenever he reached King Li of Zhou, he could not help but set down his book and sigh.",
      "idiomatic": ""
    },
    {
      "id": "s2",
      "chinese": "曰：鳴呼，師摯見之矣！",
      "literal": "He said: 'Alas, Master Zhi foresaw it!'",
      "idiomatic": ""
    },
    {
      "id": "s3",
      "chinese": "紂為象箸而箕子唏。",
      "literal": "When Zhou made ivory chopsticks, Jizi sighed.",
      "idiomatic": ""
    },
    {
      "id": "s4",
      "chinese": "周道缺，詩人本之衽席，關雎作。",
      "literal": "When the Zhou way declined, poets based themselves on the bedchamber, and 'Guan Ju' was composed.",
      "idiomatic": ""
    },
    {
      "id": "s5",
      "chinese": "仁義陵遲，鹿鳴刺焉。",
      "literal": "When benevolence and righteousness decayed, 'Lu Ming' criticized it.",
      "idiomatic": ""
    },
    {
      "id": "s6",
      "chinese": "及至厲王，以惡聞其過，公卿懼誅而禍作，厲王遂奔于彘，亂自京師始，而共和行政焉。",
      "literal": "When it came to King Li, because he hated to hear of his faults, the ministers feared execution and disaster arose. King Li fled to Zhi, and disorder began in the capital. The Gonghe administered government.",
      "idiomatic": ""
    },
    {
      "id": "s7",
      "chinese": "是後或力政，彊乘弱，興師不請天子。",
      "literal": "After this, some ruled by force, the strong oppressed the weak, they raised armies without asking the Son of Heaven.",
      "idiomatic": ""
    },
    {
      "id": "s8",
      "chinese": "然挾王室之義，以討伐為會盟主，政由五伯，諸侯恣行，淫侈不軌，賊臣篡子滋起矣。",
      "literal": "Yet upholding the righteousness of the royal house, they made punitive expeditions as lords of alliances. Politics came from the Five Hegemons, feudal lords acted wantonly, extravagant and lawless, traitorous ministers and usurping sons arose increasingly.",
      "idiomatic": ""
    },
    {
      "id": "s9",
      "chinese": "齊、晉、秦、楚其在成周微甚，封或百里或五十里。",
      "literal": "Qi, Jin, Qin, and Chu were insignificant in the time of prosperous Zhou, their fiefs only a hundred li or fifty li.",
      "idiomatic": ""
    },
    {
      "id": "s10",
      "chinese": "晉阻三河，齊負東海，楚介江淮，秦因雍州之固，四海迭興，更為伯主，文武所褒大封，皆威而服焉。",
      "literal": "Jin blocked the three rivers, Qi faced the eastern sea, Chu bordered the Jiang and Huai, Qin relied on the defenses of Yong province. The four seas rose in succession, replacing each other as hegemonic lords. Those praised and greatly enfeoffed by Wen and Wu all inspired awe and submission.",
      "idiomatic": ""
    },
    {
      "id": "s11",
      "chinese": "是以孔子明王道，干七十餘君，莫能用，故西觀周室，論史記舊聞，興於魯而次春秋，上記隱，下至哀之獲麟，約其辭文，去其煩重，以制義法，王道備，人事浹。",
      "literal": "This is why Confucius clarified the way of kings, petitioned more than seventy rulers, but none could employ him. Therefore he observed the western Zhou court, discussed historical records and old traditions, arose in Lu and arranged the Spring and Autumn Annals, recording from Yin above to the capture of the unicorn in Ai below, condensing their wording and style, removing their tedious repetitions, to establish righteous principles. The way of kings was complete, human affairs thorough.",
      "idiomatic": ""
    },
    {
      "id": "s12",
      "chinese": "七十子之徒口受其傳指，為有所刺譏褒諱挹損之文辭不可以書見也。",
      "literal": "The disciples of the seventy worthies orally received his transmitted teachings, for there were passages of criticism, mockery, praise, concealment, and depreciation in the wording that could not be shown in writing.",
      "idiomatic": ""
    },
    {
      "id": "s13",
      "chinese": "魯君子左丘明懼弟子人人異端，各安其意，失其真，故因孔子史記具論其語，成左氏春秋。",
      "literal": "The Lu gentleman Zuoqiu Ming feared that disciples would each follow different doctrines, each comfortable with their own opinions, losing the truth, so based on Confucius's historical records he comprehensively discussed their sayings, completing the Zuo Tradition Spring and Autumn Annals.",
      "idiomatic": ""
    },
    {
      "id": "s14",
      "chinese": "鐸椒為楚威王傳，為王不能盡觀春秋，采取成敗，卒四十章，為鐸氏微。",
      "literal": "Duo Jiao wrote a commentary for King Wei of Chu, but the king could not read the entire Spring and Autumn Annals, so he selected successes and failures, finally making forty chapters, calling it the Duo Family Annals.",
      "idiomatic": ""
    },
    {
      "id": "s15",
      "chinese": "趙孝成王時，其相虞卿上采春秋，下觀近勢，亦著八篇，為虞氏春秋。",
      "literal": "In the time of King Xiaocheng of Zhao, his chancellor Yu Qing selected from the Spring and Autumn Annals above and observed recent trends below, also writing eight chapters, calling it the Yu Family Spring and Autumn Annals.",
      "idiomatic": ""
    },
    {
      "id": "s16",
      "chinese": "呂不韋者，秦莊襄王相，亦上觀尚古，刪拾春秋，集六國時事，以為八覽、六論、十二紀，為呂氏春秋。",
      "literal": "Lü Buwei was chancellor to King Zhuangxiang of Qin, and also looked up to revere antiquity, edited and collected from the Spring and Autumn Annals, gathered events from the time of the six states, making them into eight surveys, six discussions, and twelve records, calling it the Lü Family Spring and Autumn Annals.",
      "idiomatic": ""
    },
    {
      "id": "s17",
      "chinese": "及如荀卿、孟子、公孫固、韓非之徒，各往往捃摭春秋之文以著書，不同勝紀。",
      "literal": "And like Xun Qing, Mencius, Gongsun Gu, and Han Fei and their followers, each collected fragments from the Spring and Autumn Annals' text to write books, differing greatly in their accounts.",
      "idiomatic": ""
    },
    {
      "id": "s18",
      "chinese": "漢相張蒼歷譜五德，上大夫董仲舒推春秋義，頗著文焉。",
      "literal": "The Han chancellor Zhang Cang calendared the five virtues, the senior grand master Dong Zhongshu expounded the Spring and Autumn Annals' principles, and wrote quite extensively about them.",
      "idiomatic": ""
    },
    {
      "id": "s19",
      "chinese": "公元前",
      "literal": "BCE",
      "idiomatic": ""
    },
    {
      "id": "s20",
      "chinese": "年",
      "literal": "Year",
      "idiomatic": ""
    },
    {
      "id": "s21",
      "chinese": "周",
      "literal": "Zhou",
      "idiomatic": ""
    },
    {
      "id": "s22",
      "chinese": "魯",
      "literal": "Lu",
      "idiomatic": ""
    },
    {
      "id": "s23",
      "chinese": "齊",
      "literal": "Qi",
      "idiomatic": ""
    },
    {
      "id": "s24",
      "chinese": "晉",
      "literal": "Jin",
      "idiomatic": ""
    },
    {
      "id": "s25",
      "chinese": "秦",
      "literal": "Qin",
      "idiomatic": ""
    },
    {
      "id": "s26",
      "chinese": "楚",
      "literal": "Chu",
      "idiomatic": ""
    },
    {
      "id": "s27",
      "chinese": "宋",
      "literal": "Song",
      "idiomatic": ""
    },
    {
      "id": "s28",
      "chinese": "衛",
      "literal": "Wei",
      "idiomatic": ""
    },
    {
      "id": "s29",
      "chinese": "陳",
      "literal": "Chen",
      "idiomatic": ""
    },
    {
      "id": "s30",
      "chinese": "蔡",
      "literal": "Cai",
      "idiomatic": ""
    },
    {
      "id": "s31",
      "chinese": "曹",
      "literal": "Cao",
      "idiomatic": ""
    },
    {
      "id": "s32",
      "chinese": "鄭",
      "literal": "Zheng",
      "idiomatic": ""
    },
    {
      "id": "s33",
      "chinese": "燕",
      "literal": "Yan",
      "idiomatic": ""
    },
    {
      "id": "s34",
      "chinese": "吳",
      "literal": "Wu",
      "idiomatic": ""
    },
    {
      "id": "s51",
      "chinese": "840",
      "literal": "840",
      "idiomatic": ""
    },
    {
      "id": "s53",
      "chinese": "二",
      "literal": "2",
      "idiomatic": ""
    },
    {
      "id": "s54",
      "chinese": "十六",
      "literal": "16",
      "idiomatic": ""
    },
    {
      "id": "s55",
      "chinese": "十一",
      "literal": "11",
      "idiomatic": ""
    },
    {
      "id": "s56",
      "chinese": "晉釐侯司徒元年",
      "literal": "Jin Li Hou Situ first year",
      "idiomatic": ""
    },
    {
      "id": "s57",
      "chinese": "五",
      "literal": "5",
      "idiomatic": ""
    },
    {
      "id": "s58",
      "chinese": "八",
      "literal": "8",
      "idiomatic": ""
    },
    {
      "id": "s59",
      "chinese": "十九",
      "literal": "19",
      "idiomatic": ""
    },
    {
      "id": "s60",
      "chinese": "十五",
      "literal": "15",
      "idiomatic": ""
    },
    {
      "id": "s61",
      "chinese": "十五",
      "literal": "15",
      "idiomatic": ""
    },
    {
      "id": "s62",
      "chinese": "二十四",
      "literal": "24",
      "idiomatic": ""
    },
    {
      "id": "s63",
      "chinese": "二十五",
      "literal": "25",
      "idiomatic": ""
    },
    {
      "id": "s65",
      "chinese": "二十五",
      "literal": "25",
      "idiomatic": ""
    },
    {
      "id": "s67",
      "chinese": "839",
      "literal": "839",
      "idiomatic": ""
    },
    {
      "id": "s69",
      "chinese": "三",
      "literal": "3",
      "idiomatic": ""
    },
    {
      "id": "s70",
      "chinese": "十七",
      "literal": "17",
      "idiomatic": ""
    }
  ]
}