{
  "metadata": {
    "book": "shiji",
    "chapter": "028",
    "file": "data/shiji/028.json"
  },
  "sentences": [
    {
      "id": "s0654",
      "chinese": "夏，有芝生殿房內中。",
      "literal": "In summer, mushrooms were born in the hall room's inner midst.",
      "idiomatic": ""
    },
    {
      "id": "s0657",
      "chinese": "其明年，伐朝鮮。",
      "literal": "The next year, he attacked Chao Xian.",
      "idiomatic": ""
    },
    {
      "id": "s0658",
      "chinese": "夏，旱。",
      "literal": "In summer, drought.",
      "idiomatic": ""
    },
    {
      "id": "s0663",
      "chinese": "其明年，上郊雍，通回中道，巡之。",
      "literal": "The next year, the emperor performed suburban sacrifice at Yong, opened the Hui Zhong way, and toured it.",
      "idiomatic": ""
    },
    {
      "id": "s0664",
      "chinese": "春，至鳴澤，從西河歸。",
      "literal": "In spring, he arrived at Ming Ze and returned following the Xi He.",
      "idiomatic": ""
    },
    {
      "id": "s0665",
      "chinese": "其明年冬，上巡南郡，至江陵而東。",
      "literal": "The next year in winter, the emperor toured the Nan commandery, arrived at Jiang Ling and went east.",
      "idiomatic": ""
    },
    {
      "id": "s0666",
      "chinese": "登禮灊之天柱山，號曰南岳。",
      "literal": "He ascended and performed rites at Qian's Tian Zhu Mountain, styling it Nan Yue.",
      "idiomatic": ""
    },
    {
      "id": "s0667",
      "chinese": "浮江，自尋陽出樅陽，過彭蠡，禮其名山川。",
      "literal": "He floated on the Jiang, from Xun Yang exited at Cong Yang, passed Peng Li, and performed rites to its famous mountains and rivers.",
      "idiomatic": ""
    },
    {
      "id": "s0668",
      "chinese": "北至瑯邪，并海上。",
      "literal": "He arrived north at Lang Ye, following above the sea.",
      "idiomatic": ""
    },
    {
      "id": "s0669",
      "chinese": "四月中，至奉高修封焉。",
      "literal": "In the fourth month's midst, he arrived at Feng Gao and repaired the feng there.",
      "idiomatic": ""
    },
    {
      "id": "s0670",
      "chinese": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
      "literal": "Initially, when the Son of Heaven performed feng at Tai Mountain, Tai Mountain's northeast zi in ancient times had a bright hall place; the place was dangerous and not spacious.",
      "idiomatic": ""
    },
    {
      "id": "s0671",
      "chinese": "上欲治明堂奉高旁，未曉其制度。",
      "literal": "The emperor wished to repair the bright hall beside Feng Gao, but had not yet clarified its system and regulations.",
      "idiomatic": ""
    },
    {
      "id": "s0672",
      "chinese": "濟南人公玊帶上黃帝時明堂圖。",
      "literal": "The Ji Nan man Gong Yu Dai presented a bright hall diagram from Yellow Emperor's time.",
      "idiomatic": ""
    },
    {
      "id": "s0673",
      "chinese": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
      "literal": "The bright hall diagram had one hall in the midst, four sides without walls, covered with thatch, connected to water, round palace wall made into a covered way, above had a tower, entered from the southwest, named Kun Lun; the Son of Heaven followed it and entered, to bow and sacrifice to the Supreme Deity there.",
      "idiomatic": ""
    },
    {
      "id": "s0674",
      "chinese": "於是上令奉高作明堂汶上，如帶圖。",
      "literal": "Thereupon the emperor commanded Feng Gao to make the bright hall above Wen, like Dai's diagram.",
      "idiomatic": ""
    },
    {
      "id": "s0675",
      "chinese": "及五年修封，則祠太一、五帝於明堂上坐，令高皇帝祠坐對之。",
      "literal": "And when five years later repairing the feng, then sacrificed to Tai Yi and the five emperors at the bright hall's upper seat, commanded Gao emperor's sacrifice seat to face it.",
      "idiomatic": ""
    },
    {
      "id": "s0676",
      "chinese": "祠后土於下房，以二十太牢。",
      "literal": "Sacrificed to Hou Tu at the lower chamber, with twenty tai lao.",
      "idiomatic": ""
    },
    {
      "id": "s0677",
      "chinese": "天子從昆侖道入，始拜明堂如郊禮。",
      "literal": "The Son of Heaven followed the Kun Lun way and entered, began bowing to the bright hall like suburban rites.",
      "idiomatic": ""
    },
    {
      "id": "s0678",
      "chinese": "禮畢，燎堂下。",
      "literal": "The rites completed, liao burned below the hall.",
      "idiomatic": ""
    },
    {
      "id": "s0679",
      "chinese": "而上又上泰山，自有祕祠其巔。",
      "literal": "And the emperor again ascended Tai Mountain, himself having a secret sacrifice at its peak.",
      "idiomatic": ""
    },
    {
      "id": "s0680",
      "chinese": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。",
      "literal": "And below Tai Mountain sacrificed to the five emperors, each according to their direction; the Yellow Emperor combined with the Red Emperor, and the officials served the sacrifice there.",
      "idiomatic": ""
    },
    {
      "id": "s0681",
      "chinese": "山上舉火，下悉應之。",
      "literal": "Above the mountain raised fire, below all responded to it.",
      "idiomatic": ""
    },
    {
      "id": "s0682",
      "chinese": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
      "literal": "Two years later, in the eleventh month Jia Zi new moon dawn winter solstice, the calendar pushers used the original system.",
      "idiomatic": ""
    },
    {
      "id": "s0683",
      "chinese": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，毋修封禪。",
      "literal": "The Son of Heaven personally arrived at Tai Mountain, on the eleventh month Jia Zi new moon dawn winter solstice day sacrificed to the Supreme Deity at the bright hall, without repairing feng shan.",
      "idiomatic": ""
    },
    {
      "id": "s0686",
      "chinese": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。",
      "literal": "He arrived east above the sea; examined those who entered the sea and method masters who sought spirits; none were verified, however he increased dispatches, hoping to encounter them.",
      "idiomatic": ""
    },
    {
      "id": "s0687",
      "chinese": "十一月乙酉，柏梁災。",
      "literal": "In the eleventh month Yi You, the Cypress Beam had a disaster.",
      "idiomatic": ""
    },
    {
      "id": "s0688",
      "chinese": "十二月甲午朔，上親禪高里，祠后土。",
      "literal": "On the twelfth month Jia Wu new moon, the emperor personally performed shan at Gao Li, sacrificing to Hou Tu.",
      "idiomatic": ""
    },
    {
      "id": "s0689",
      "chinese": "臨勃海，將以望祀蓬萊之屬，冀至殊廷焉。",
      "literal": "He faced Bo Hai, about to gaze and sacrifice to Peng Lai's kind, hoping to arrive at the special court there.",
      "idiomatic": ""
    },
    {
      "id": "s0690",
      "chinese": "上還，以柏梁災故，朝受計甘泉。",
      "literal": "The emperor returned; because of the Cypress Beam disaster, he received tallies in the morning at Gan Quan.",
      "idiomatic": ""
    },
    {
      "id": "s0693",
      "chinese": "方士多言古帝王有都甘泉者。",
      "literal": "The method masters often said that ancient emperor kings had capitals at Gan Quan.",
      "idiomatic": ""
    },
    {
      "id": "s0694",
      "chinese": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
      "literal": "Afterwards the Son of Heaven again received the feudal lords at Gan Quan; Gan Quan made feudal lords' mansions.",
      "idiomatic": ""
    },
    {
      "id": "s0696",
      "chinese": "於是作建章宮，度為千門萬戶。",
      "literal": "Thereupon he made the Jian Zhang Palace, measured as having thousand gates and ten thousand houses.",
      "idiomatic": ""
    },
    {
      "id": "s0697",
      "chinese": "前殿度高未央。",
      "literal": "The front hall was measured as high as Wei Yang.",
      "idiomatic": ""
    },
    {
      "id": "s0698",
      "chinese": "其東則鳳闕，高二十餘丈。",
      "literal": "To the east was the Phoenix Tower, over twenty zhang high.",
      "idiomatic": ""
    },
    {
      "id": "s0699",
      "chinese": "其西則唐中，數十里虎圈。",
      "literal": "To the west was Tangzhong, with tiger enclosures spanning several dozen li.",
      "idiomatic": ""
    },
    {
      "id": "s0700",
      "chinese": "其北治大池，漸臺高二十餘丈，命曰太液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
      "literal": "To the north, he had a large pool excavated, with a pavilion over twenty zhang high, named Taiye Pool. Within it were Penglai, Fangzhang, Yingzhou, and Hulu islands, modeled after the divine mountains and turtles and fish in the sea.",
      "idiomatic": ""
    },
    {
      "id": "s0701",
      "chinese": "其南有玉堂、璧門、大鳥之屬。",
      "literal": "To the south were the Jade Hall, the Jade Gate, and structures shaped like great birds.",
      "idiomatic": ""
    },
    {
      "id": "s0702",
      "chinese": "乃立神明臺、井幹樓，度五十丈，輦道相屬焉。",
      "literal": "Then he established the Spirit Bright Terrace and Well Shaft Tower, measured at fifty zhang, with palanquin ways connected there.",
      "idiomatic": ""
    },
    {
      "id": "s0703",
      "chinese": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字，為太初元年。",
      "literal": "In summer, the Han changed the calendar, making the first month the beginning of the year, and the color above yellow; official names and seal characters were changed with five words, making it the Tai Chu first year.",
      "idiomatic": ""
    },
    {
      "id": "s0704",
      "chinese": "是歲，西伐大宛。",
      "literal": "This year, they campaigned west against Da Yuan.",
      "idiomatic": ""
    },
    {
      "id": "s0705",
      "chinese": "蝗大起。",
      "literal": "A great locust plague arose.",
      "idiomatic": ""
    },
    {
      "id": "s0706",
      "chinese": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。",
      "literal": "Lady Ding, Yu Chu of Luo Yang, and others used methods to sacrifice and curse the Xiongnu and Da Yuan.",
      "idiomatic": ""
    },
    {
      "id": "s0707",
      "chinese": "其明年，有司上言雍五畤無牢熟具，芬芳不備。",
      "literal": "The next year, the officials presented a memorial that Yong's five zhi lacked lao and ripe equipment, and fragrant fragrances were not prepared.",
      "idiomatic": ""
    },
    {
      "id": "s0708",
      "chinese": "乃令祠官進畤犢牢具，色食所勝，而以木禺馬代駒焉。",
      "literal": "Then he commanded the sacrifice officials to advance calf lao equipment for the zhi, with colors and foods that conquered, and used wooden yu horses to substitute for colts.",
      "idiomatic": ""
    },
    {
      "id": "s0709",
      "chinese": "獨五月嘗駒，行親郊用駒。",
      "literal": "Only in the fifth month they tasted colts; when conducting the personal suburban sacrifice they used colts.",
      "idiomatic": ""
    },
    {
      "id": "s0710",
      "chinese": "及諸名山川用駒者，悉以木禺馬代。",
      "literal": "And for all the famous mountains and rivers that used colts, they all substituted wooden yu horses.",
      "idiomatic": ""
    },
    {
      "id": "s0711",
      "chinese": "行過，乃用駒。",
      "literal": "When the performance was over, then they used colts.",
      "idiomatic": ""
    },
    {
      "id": "s0712",
      "chinese": "他禮如故。",
      "literal": "Other rites were as before.",
      "idiomatic": ""
    },
    {
      "id": "s0713",
      "chinese": "其明年，東巡海上，考神僊之屬，未有驗者。",
      "literal": "The next year, he toured east above the sea, examining the spirit immortals and their kind, but there were none who had been verified.",
      "idiomatic": ""
    },
    {
      "id": "s0715",
      "chinese": "上許作之如方，命曰明年。",
      "literal": "The emperor permitted making it according to the method, naming it Welcoming Year.",
      "idiomatic": ""
    }
  ]
}