{
  "metadata": {
    "book": "shiji",
    "chapter": "095",
    "file": "data/shiji/095.json"
  },
  "sentences": [
    {
      "id": "s0201",
      "chinese": "楚騎來眾，漢王乃擇軍中可為（車）騎將者，皆推故秦騎士重泉人李必、駱甲習騎兵，今為校尉，可為騎將。",
      "literal": "Chu cavalry come numerous, Han wang then select army middle can be cavalry general, all push former Qin cavalry soldier Chong Quan person Li Bi, Luo Jia practiced cavalry, now be commandery captain, can be cavalry general.",
      "idiomatic": "The Chu cavalry came in great numbers. The Han king then selected from the army those who could serve as cavalry generals. All recommended the former Qin cavalry soldiers Li Bi and Luo Jia of Chongquan who were skilled with cavalry and now served as commandery captains, saying they could be cavalry generals."
    },
    {
      "id": "s0202",
      "chinese": "漢王欲拜之，必、甲曰：「臣故秦民，恐軍不信臣，臣願得大王左右善騎者傅之。」",
      "literal": "Han wang wish appoint them, Bi, Jia say: Minister former Qin people, fear army not trust minister, minister wish obtain great wang left right good cavalry teach them.",
      "idiomatic": "The Han king wished to appoint them. Li Bi and Luo Jia said: 'We ministers are former Qin people. We fear the army will not trust us. We wish to obtain Your Majesty's attendants who are skilled with cavalry to teach them.'"
    },
    {
      "id": "s0203",
      "chinese": "灌嬰雖少，然數力戰，乃拜灌嬰為中大夫，令李必、駱甲為左右校尉，將郎中騎兵擊楚騎於滎陽東，大破之。",
      "literal": "Guan Ying though young, however several times strength battle, then appoint Guan Ying as middle grand master, order Li Bi, Luo Jia as left right commandery captains, lead court gentleman cavalry strike Chu cavalry at Xing Yang east, greatly break it.",
      "idiomatic": "Although Guan Ying was young, he had battled fiercely several times. He was then appointed Middle Grand Master, and Li Bi and Luo Jia were made Left and Right Commandery Captains. Leading the court gentleman's cavalry, they struck the Chu cavalry east of Xingyang and greatly broke them."
    },
    {
      "id": "s0204",
      "chinese": "受詔別擊楚軍後，絕其餉道，起陽武至襄邑。",
      "literal": "Receive decree separately strike Chu army rear, cut off their provisions road, rise Yang Wu arrive Xiang Yi.",
      "idiomatic": "He received a decree to separately strike the Chu army's rear, cutting off their provisions road, from Yangwu to Xiangyi."
    },
    {
      "id": "s0205",
      "chinese": "擊項羽之將項冠於魯下，破之，所將卒斬右司馬、騎將各一人。",
      "literal": "Strike Xiang Yu of general Xiang Guan at Lu below, break it, what lead soldiers behead right marshal, cavalry general each one.",
      "idiomatic": "He struck Xiang Yu's general Xiang Guan below Lu, broke him, and the soldiers he led beheaded one Right Marshal and one cavalry general each."
    },
    {
      "id": "s0206",
      "chinese": "擊破柘公王武，軍於燕西，所將卒斬樓煩將五人，連尹一人。",
      "literal": "Strike break Zhe gong Wang Wu, army at Yan west, what lead soldiers behead Lou Fan general five people, Lian Yin one.",
      "idiomatic": "He struck and broke Duke Zhe Wang Wu, stationed his army west of Yan, and the soldiers he led beheaded five Loufan generals and one Lian Yin."
    },
    {
      "id": "s0207",
      "chinese": "擊王武別將桓嬰白馬下，破之，所將卒斬都尉一人。",
      "literal": "Strike Wang Wu separate general Huan Ying Bai Ma below, break it, what lead soldiers behead commandery captain one.",
      "idiomatic": "He struck Wang Wu's separate general Huan Ying below Baima, broke him, and the soldiers he led beheaded one commandery captain."
    },
    {
      "id": "s0208",
      "chinese": "以騎渡河南，送漢王到雒陽，使北迎相國韓信軍於邯鄲。",
      "literal": "With cavalry cross He south, send Han wang arrive Luo Yang, make north welcome prime minister Han Xin army at Han Dan.",
      "idiomatic": "With cavalry he crossed south of the He, sent the Han king to Luoyang, and went north to welcome Prime Minister Han Xin's army at Handan."
    },
    {
      "id": "s0209",
      "chinese": "還至敖倉，嬰遷為御史大夫。",
      "literal": "Return arrive Ao Cang, Ying move as censor grand master.",
      "idiomatic": "Upon returning to Aocang, Ying was moved to the position of Censor Grand Master."
    },
    {
      "id": "s0210",
      "chinese": "三年，以列侯食邑杜平鄉。",
      "literal": "Three years, with ranked marquis food fief Du Ping township.",
      "idiomatic": "After three years, as Ranked Marquis he was granted food fief at Duping township."
    },
    {
      "id": "s0211",
      "chinese": "以御史大夫受詔將郎中騎兵東屬相國韓信，擊破齊軍於歷下，所將卒虜車騎將軍華毋傷及將吏四十六人。",
      "literal": "With censor grand master receive decree lead court gentleman cavalry east belong prime minister Han Xin, strike break Qi army at Li Xia, what lead soldiers capture chariot cavalry general Hua Wu Shang and generals officials forty six people.",
      "idiomatic": "As Censor Grand Master he received a decree to lead the court gentleman's cavalry east to join Prime Minister Han Xin, struck and broke the Qi army at Lixia, and the soldiers he led captured the chariot cavalry general Hua Wushang and forty-six generals and officials."
    },
    {
      "id": "s0212",
      "chinese": "降下臨菑，得齊守相田光。",
      "literal": "Surrender take Lin Zi, obtain Qi defender chancellor Tian Guang.",
      "idiomatic": "He surrendered and took Linzi, obtaining the Qi defender chancellor Tian Guang."
    },
    {
      "id": "s0213",
      "chinese": "追齊相田橫至嬴、博，破其騎，所將卒斬騎將一人，生得騎將四人。",
      "literal": "Pursue Qi chancellor Tian Heng arrive Ying, Bo, break his cavalry, what lead soldiers behead cavalry general one, alive obtain cavalry general four.",
      "idiomatic": "He pursued Qi chancellor Tian Heng to Ying and Bo, broke his cavalry, and the soldiers he led beheaded one cavalry general and captured four cavalry generals alive."
    },
    {
      "id": "s0214",
      "chinese": "攻下嬴、博，破齊將軍田吸於千乘，所將卒斬吸。",
      "literal": "Attack take Ying, Bo, break Qi general Tian Xi at Qian Cheng, what lead soldiers behead Xi.",
      "idiomatic": "He attacked and took Ying and Bo, broke Qi general Tian Xi at Qiancheng, and the soldiers he led beheaded Xi."
    },
    {
      "id": "s0215",
      "chinese": "東從韓信攻龍且、留公旋於高密，卒斬龍且，生得右司馬、連尹各一人，樓煩將十人，身生得亞將周蘭。",
      "literal": "East follow Han Xin attack Long Ju, Liu gong Xuan at Gao Mi, soldiers behead Long Ju, alive obtain right marshal, Lian Yin each one, Lou Fan general ten, personally alive obtain deputy general Zhou Lan.",
      "idiomatic": "Following Han Xin east, he attacked Long Ju and Duke Liu Xuan at Gaomi. The soldiers beheaded Long Ju, captured alive one Right Marshal and one Lian Yin each, ten Loufan generals, and he personally captured deputy general Zhou Lan alive."
    },
    {
      "id": "s0216",
      "chinese": "齊地已定，韓信自立為齊王，使嬰別將擊楚將公杲於魯北，破之。",
      "literal": "Qi land already settle, Han Xin self establish as Qi wang, make Ying separately lead strike Chu general Gong Gao at Lu north, break it.",
      "idiomatic": "Once the Qi lands were settled, Han Xin established himself as King of Qi and sent Ying to separately lead in striking Chu general Gong Gao north of Lu, breaking him."
    },
    {
      "id": "s0217",
      "chinese": "轉南，破薛郡長，身虜騎將一人。",
      "literal": "Turn south, break Xue commandery chief, personally capture cavalry general one.",
      "idiomatic": "Turning south, he broke Xue commandery chief and personally captured one cavalry general."
    },
    {
      "id": "s0218",
      "chinese": "攻（博）［傅］陽，前至下相以東南僮、取慮、徐。",
      "literal": "Attack Fu Yang, advance arrive Xia Xiang southeast Tong, take Lu, Xu.",
      "idiomatic": "He attacked Fuyang, advanced to southeast of Xiaxiang at Tong, and took Lu and Xu."
    },
    {
      "id": "s0219",
      "chinese": "度淮，盡降其城邑，至廣陵。",
      "literal": "Cross Huai, exhaust surrender their city towns, arrive Guang Ling.",
      "idiomatic": "He crossed the Huai and completely surrendered their city towns, arriving at Guangling."
    },
    {
      "id": "s0220",
      "chinese": "項羽使項聲、薛公、郯公復定淮北。",
      "literal": "Xiang Yu make Xiang Sheng, Xue gong, Tan gong again settle Huai north.",
      "idiomatic": "Xiang Yu sent Xiang Sheng, Duke Xue, and Duke Tan to again settle north of the Huai."
    },
    {
      "id": "s0221",
      "chinese": "嬰度淮北，擊破項聲、郯公下邳，斬薛公，下下邳，擊破楚騎於平陽，遂降彭城，虜柱國項佗，降留、薛、沛、酂、蕭、相。",
      "literal": "Ying cross Huai north, strike break Xiang Sheng, Tan gong Xia Pi, behead Xue gong, take Xia Pi, strike break Chu cavalry at Ping Yang, then surrender Peng Cheng, capture pillar state Xiang Tuo, surrender Liu, Xue, Pei, Zuo, Xiao, Xiang.",
      "idiomatic": "Ying crossed north of the Huai, struck and broke Xiang Sheng and Duke Tan at Xiapi, beheaded Duke Xue, took Xiapi, struck and broke Chu cavalry at Pingyang, then surrendered Pengcheng, captured Pillar State Xiang Tuo, and surrendered Liu, Xue, Pei, Zuo, Xiao, and Xiang."
    },
    {
      "id": "s0222",
      "chinese": "攻苦、譙，復得亞將周蘭。",
      "literal": "Attack Ku, Qiao, again obtain deputy general Zhou Lan.",
      "idiomatic": "He attacked Ku and Qiao, and again obtained deputy general Zhou Lan."
    },
    {
      "id": "s0223",
      "chinese": "與漢王會頤鄉。",
      "literal": "With Han wang meet Yi Xiang.",
      "idiomatic": "He met with the Han king at Yixiang."
    },
    {
      "id": "s0224",
      "chinese": "從擊項籍軍於陳下，破之，所將卒斬樓煩將二人，虜騎將八人。",
      "literal": "Follow strike Xiang Ji army at Chen below, break it, what lead soldiers behead Lou Fan general two, capture cavalry general eight.",
      "idiomatic": "He followed in striking Xiang Ji's army below Chen, broke it, and the soldiers he led beheaded two Loufan generals and captured eight cavalry generals."
    },
    {
      "id": "s0225",
      "chinese": "賜益食邑二千五百戶。",
      "literal": "Grant increase food fief two thousand five hundred households.",
      "idiomatic": "He was granted an additional food fief of two thousand five hundred households."
    },
    {
      "id": "s0226",
      "chinese": "項籍敗垓下去也，嬰以御史大夫受詔將車騎別追項籍至東城，破之。",
      "literal": "Xiang Ji defeat Gai Xia go, Ying with censor grand master receive decree lead chariots cavalry separately pursue Xiang Ji arrive Dong Cheng, break it.",
      "idiomatic": "After Xiang Ji was defeated and fled from Gaixia, Ying as Censor Grand Master received a decree to lead chariots and cavalry separately pursuing Xiang Ji to Dongcheng, breaking him."
    },
    {
      "id": "s0227",
      "chinese": "所將卒五人共斬項籍，皆賜爵列侯。",
      "literal": "What lead soldiers five people together behead Xiang Ji, all grant nobility ranked marquis.",
      "idiomatic": "Five of the soldiers he led together beheaded Xiang Ji, and all were granted the nobility rank of Ranked Marquis."
    },
    {
      "id": "s0228",
      "chinese": "降左右司馬各一人，卒萬二千人，盡得其軍將吏。",
      "literal": "Surrender left right marshals each one, soldiers twelve thousand, exhaust obtain their army generals officials.",
      "idiomatic": "He surrendered one Left Marshal and one Right Marshal each, twelve thousand soldiers, and completely obtained their army's generals and officials."
    },
    {
      "id": "s0229",
      "chinese": "下東城、歷陽。",
      "literal": "Take Dong Cheng, Li Yang.",
      "idiomatic": "He took Dongcheng and Liyang."
    },
    {
      "id": "s0230",
      "chinese": "渡江，破吳郡長吳下，得吳守，遂定吳、豫章、會稽郡。",
      "literal": "Cross Jiang, break Wu commandery chief Wu below, obtain Wu defender, then settle Wu, Yu Zhang, Hui Ji commanderies.",
      "idiomatic": "He crossed the Jiang, broke Wu commandery chief below Wu, obtained the Wu defender, and thus settled the Wu, Yuzhang, and Huiji commanderies."
    },
    {
      "id": "s0231",
      "chinese": "還定淮北，凡五十二縣。",
      "literal": "Return settle Huai north, altogether fifty two counties.",
      "idiomatic": "He returned to settle north of the Huai, for a total of fifty-two counties."
    },
    {
      "id": "s0232",
      "chinese": "漢王立為皇帝，賜益嬰邑三千戶。",
      "literal": "Han wang establish as emperor, grant increase Ying fief three thousand households.",
      "idiomatic": "The Han king was established as emperor, and granted Ying an additional fief of three thousand households."
    },
    {
      "id": "s0233",
      "chinese": "其秋，以車騎將軍從擊破燕王臧荼。",
      "literal": "Its autumn, with chariot cavalry general follow strike break Yan wang Zang Tu.",
      "idiomatic": "That autumn, as Chariot Cavalry General he followed in striking and breaking Yan king Zang Tu."
    },
    {
      "id": "s0234",
      "chinese": "明年，從至陳，取楚王信。",
      "literal": "Next year, follow arrive Chen, take Chu wang Xin.",
      "idiomatic": "The next year, he followed to Chen and took Chu king Xin."
    },
    {
      "id": "s0235",
      "chinese": "還，剖符，世世勿絕，食潁陰二千五百戶，號曰潁陰侯。",
      "literal": "Return, split tally, generation generation not cut off, food Ying Yin two thousand five hundred households, title called Ying Yin marquis.",
      "idiomatic": "He returned, received a split tally for generations without end, food fief of two thousand five hundred households at Yingyin, and was titled Marquis of Yingyin."
    },
    {
      "id": "s0236",
      "chinese": "以車騎將軍從擊反韓王信於代，至馬邑，受詔別降樓煩以北六縣，斬代左相，破胡騎於武泉北。",
      "literal": "With chariot cavalry general follow strike rebel Han wang Xin at Dai, arrive Ma Yi, receive decree separately surrender Lou Fan north six counties, behead Dai left chancellor, break barbarian cavalry at Wu Quan north.",
      "idiomatic": "As Chariot Cavalry General he followed in striking the rebelling Han king Xin at Dai, arrived at Maiyi, received a decree to separately surrender six counties north of Loufan, beheaded the Dai left chancellor, and broke barbarian cavalry north of Wuquan."
    },
    {
      "id": "s0237",
      "chinese": "復從擊韓信胡騎晉陽下，所將卒斬胡白題將一人。",
      "literal": "Again follow strike Han Xin barbarian cavalry Jin Yang below, what lead soldiers behead barbarian white forehead general one.",
      "idiomatic": "He again followed in striking Han Xin's barbarian cavalry below Jinyang, and the soldiers he led beheaded one barbarian general with a white forehead mark."
    },
    {
      "id": "s0238",
      "chinese": "受詔并將燕、趙、齊、梁、楚車騎，擊破胡騎於硰石。",
      "literal": "Receive decree together lead Yan, Zhao, Qi, Liang, Chu chariots cavalry, strike break barbarian cavalry at Kong Shi.",
      "idiomatic": "He received a decree to together lead the chariots and cavalry of Yan, Zhao, Qi, Liang, and Chu, striking and breaking barbarian cavalry at Kongshi."
    },
    {
      "id": "s0239",
      "chinese": "至平城，為胡所圍，從還軍東垣。",
      "literal": "Arrive Ping Cheng, be barbarian surrounded, follow return army Dong Yuan.",
      "idiomatic": "He arrived at Pingcheng and was surrounded by barbarians, following in returning the army to Dongyuan."
    },
    {
      "id": "s0240",
      "chinese": "從擊陳豨，受詔別攻豨丞相侯敞軍曲逆下，破之，卒斬敞及特將五人。",
      "literal": "Follow strike Chen Xi, receive decree separately attack Xi chancellor Hou Chang army Qu Ni below, break it, soldiers behead Chang and special generals five.",
      "idiomatic": "He followed in striking Chen Xi, received a decree to separately attack Xi's chancellor Hou Chang's army below Qu Ni, broke it, and the soldiers beheaded Chang and five special generals."
    },
    {
      "id": "s0241",
      "chinese": "降曲逆、盧奴、上曲陽、安國、安平。",
      "literal": "Surrender Qu Ni, Lu Nu, Shang Qu Yang, An Guo, An Ping.",
      "idiomatic": "He surrendered Qu Ni, Lu Nu, Shang Qu Yang, An Guo, and An Ping."
    },
    {
      "id": "s0242",
      "chinese": "攻下東垣。",
      "literal": "Attack take Dong Yuan.",
      "idiomatic": "He attacked and took Dongyuan."
    },
    {
      "id": "s0243",
      "chinese": "黥布反，以車騎將軍先出，攻布別將於相，破之，斬亞將樓煩將三人。",
      "literal": "Qing Bu rebel, with chariot cavalry general first out, attack Bu separate general at Xiang, break it, behead deputy general Lou Fan general three.",
      "idiomatic": "When Qing Bu rebelled, as Chariot Cavalry General he went out first, attacked Bu's separate general at Xiang, broke him, and beheaded three deputy generals and Loufan generals."
    },
    {
      "id": "s0244",
      "chinese": "又進擊破布上柱國軍及大司馬軍。",
      "literal": "Again advance strike break Bu upper pillar state army and great marshal army.",
      "idiomatic": "He again advanced and struck, breaking Bu's Upper Pillar State army and Great Marshal army."
    },
    {
      "id": "s0245",
      "chinese": "又進破布別將肥誅。",
      "literal": "Again advance break Bu separate general Fei Zhu.",
      "idiomatic": "He again advanced and broke Bu's separate general Fei Zhu."
    },
    {
      "id": "s0246",
      "chinese": "嬰身生得左司馬一人，所將卒斬其小將十人，追北至淮上。",
      "literal": "Ying personally alive obtain left marshal one, what lead soldiers behead their small generals ten, pursue north arrive Huai above.",
      "idiomatic": "Ying personally captured one Left Marshal alive, the soldiers he led beheaded ten of their small generals, and pursued north to the Huai."
    },
    {
      "id": "s0247",
      "chinese": "益食二千五百戶。",
      "literal": "Increase food two thousand five hundred households.",
      "idiomatic": "He was granted an additional food fief of two thousand five hundred households."
    },
    {
      "id": "s0248",
      "chinese": "布已破，高帝歸，定令嬰食穎陰五千戶，除前所食邑。",
      "literal": "Bu already broken, Gao Di return, settle order Ying food Ying Yin five thousand households, remove previous food fief.",
      "idiomatic": "After Bu was broken and the Gao Emperor returned, he settled on ordering Ying a food fief of five thousand households at Yingyin, removing his previous food fief."
    },
    {
      "id": "s0249",
      "chinese": "凡從得二千石二人，別破軍十六，降城四十六，定國一，郡二，縣五十二，得將軍二人，柱國、相國各一人，二千石十人。",
      "literal": "Altogether follow obtain two thousand stone two, separately break armies sixteen, surrender cities forty six, settle states one, commanderies two, counties fifty two, obtain generals two, pillar state, prime minister each one, two thousand stone ten.",
      "idiomatic": "In total he followed and obtained two officials of two thousand stone, separately broke sixteen armies, surrendered forty-six cities, settled one state, two commanderies, and fifty-two counties, obtained two generals, one Pillar State and one Prime Minister each, and ten officials of two thousand stone."
    },
    {
      "id": "s0250",
      "chinese": "嬰自破布歸，高帝崩，嬰以列侯事孝惠帝及呂太后。",
      "literal": "Ying from break Bu return, Gao Di collapse, Ying with ranked marquis serve Xiao Hui emperor and Lu empress dowager.",
      "idiomatic": "After Ying returned from breaking Bu, the Gao Emperor collapsed, and Ying as Ranked Marquis served the Xiaohui emperor and Empress Dowager Lu."
    }
  ]
}