{
  "metadata": {
    "book": "shiji",
    "chapter": "012",
    "file": "data/shiji/012.json"
  },
  "sentences": [
    {
      "id": "s0001",
      "chinese": "孝武皇帝者，孝景中子也。",
      "literal": "Filial Wu emperor, Filial Jing middle son also.",
      "idiomatic": ""
    },
    {
      "id": "s0002",
      "chinese": "母曰王太后。",
      "literal": "Mother called Wang Empress Dowager.",
      "idiomatic": ""
    },
    {
      "id": "s0003",
      "chinese": "孝景四年，以皇子為膠東王。",
      "literal": "Filial Jing fourth year, with imperial son as Jiaodong King.",
      "idiomatic": ""
    },
    {
      "id": "s0004",
      "chinese": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
      "literal": "Filial Jing seventh year, Li Crown Prince deposed as Linjiang King, with Jiaodong King as Crown Prince.",
      "idiomatic": ""
    },
    {
      "id": "s0005",
      "chinese": "孝景十六年崩，太子即位，為孝武皇帝。",
      "literal": "Filial Jing sixteenth year collapsed, Crown Prince ascended throne, became Filial Wu emperor.",
      "idiomatic": ""
    },
    {
      "id": "s0006",
      "chinese": "孝武皇帝初即位，尤敬鬼神之祀。",
      "literal": "Filial Wu emperor initial ascension, especially respected ghosts spirits sacrifices.",
      "idiomatic": ""
    },
    {
      "id": "s0007",
      "chinese": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
      "literal": "First year, Han rising already sixty remaining years, realm pacified peaceful, scholar official kind all hoped Son of Heaven fengshan correct calendar measures.",
      "idiomatic": ""
    },
    {
      "id": "s0008",
      "chinese": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
      "literal": "And emperor favored Confucian arts, recruited worthy good, Zhao Wan, Wang Zang etc. with literature as ministers, wished discuss ancient establish Bright Hall south of city, to receive feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0009",
      "chinese": "草巡狩封禪改歷服色事未就。",
      "literal": "Draft imperial tours fengshan change calendar clothing colors matters not completed.",
      "idiomatic": ""
    },
    {
      "id": "s0010",
      "chinese": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。",
      "literal": "Met Empress Dowager Dou governed Huang Lao teachings, not liked Confucian arts, made person secretly obtained Zhao Wan etc. illicit profit matters, summoned investigated Wan, Zang, Wan, Zang committed suicide, all things they promoted all abolished.",
      "idiomatic": ""
    },
    {
      "id": "s0011",
      "chinese": "後六年，竇太后崩。",
      "literal": "After six years, Dou Empress Dowager collapsed.",
      "idiomatic": ""
    },
    {
      "id": "s0012",
      "chinese": "其明年，上徵文學之士公孫弘等。",
      "literal": "Next year, emperor summoned literature scholars Gongsun Hong etc.",
      "idiomatic": ""
    },
    {
      "id": "s0013",
      "chinese": "明年，上初至雍，郊見五畤。",
      "literal": "Next year, emperor first arrived Yong, suburban audience five altars.",
      "idiomatic": ""
    },
    {
      "id": "s0014",
      "chinese": "後常三歲一郊。",
      "literal": "Afterwards regularly three years one suburban sacrifice.",
      "idiomatic": ""
    },
    {
      "id": "s0015",
      "chinese": "是時上求神君，捨之上林中蹄氏觀。",
      "literal": "This time emperor sought divine lord, lodged in Shanglin middle Ti clan observation.",
      "idiomatic": ""
    },
    {
      "id": "s0016",
      "chinese": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
      "literal": "Divine lord, Changling woman, because son died sorrowful sorrow, therefore saw spirit at husband Wan Ruo.",
      "idiomatic": ""
    },
    {
      "id": "s0017",
      "chinese": "宛若祠之其室，民多往祠。",
      "literal": "Wan Ruo sacrificed to her room, people many went sacrificed.",
      "idiomatic": ""
    },
    {
      "id": "s0018",
      "chinese": "平原君往祠，其後子孫以尊顯。",
      "literal": "Pingyuan Jun went sacrificed, his later descendants with honor illustrious.",
      "idiomatic": ""
    },
    {
      "id": "s0019",
      "chinese": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
      "literal": "When Wudi ascended throne, then thick ritual placed sacrifice in inner palace, heard her words, not saw her person say.",
      "idiomatic": ""
    },
    {
      "id": "s0020",
      "chinese": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
      "literal": "This time Li Shaogun also with sacrificed stove, grain way, dispel old methods saw emperor, emperor honored him.",
      "idiomatic": ""
    },
    {
      "id": "s0021",
      "chinese": "少君者，故深澤侯入以主方。",
      "literal": "Shaogun, former Shenze Hou person with main methods.",
      "idiomatic": ""
    },
    {
      "id": "s0022",
      "chinese": "匿其年及所生長，常自謂七十，能使物，卻老。",
      "literal": "Concealed his age and place grown up, often self called seventy, able make things, dispel old.",
      "idiomatic": ""
    },
    {
      "id": "s0023",
      "chinese": "其游以方遍諸侯。",
      "literal": "His travels with methods everywhere feudal lords.",
      "idiomatic": ""
    },
    {
      "id": "s0024",
      "chinese": "無妻子。",
      "literal": "No wife children.",
      "idiomatic": ""
    },
    {
      "id": "s0025",
      "chinese": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
      "literal": "People heard his ability make things and immortality, moreover fed sent him, often surplus gold money silks clothing food.",
      "idiomatic": ""
    },
    {
      "id": "s0026",
      "chinese": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
      "literal": "People all considered not managed estates yet abundant supply, moreover not knew his what came from, even more believed, contended served him.",
      "idiomatic": ""
    },
    {
      "id": "s0027",
      "chinese": "少君資好方，善為巧發奇中。",
      "literal": "Shaogun natural good methods, skilled at clever revelation marvelous hits.",
      "idiomatic": ""
    },
    {
      "id": "s0028",
      "chinese": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
      "literal": "Once followed Wuan Hou drank, seated had ninety remaining years old man, Shaogun then spoke with his grandfather toured shot places, old man as child time followed his grandfather went, recognized those places, one gathering all astonished.",
      "idiomatic": ""
    },
    {
      "id": "s0029",
      "chinese": "少君見上，上有故銅器，問少君。",
      "literal": "Shaogun saw emperor, emperor had old bronze vessel, asked Shaogun.",
      "idiomatic": ""
    },
    {
      "id": "s0030",
      "chinese": "少君曰：「此器齊桓公十年陳於柏寢。」",
      "literal": "Shaogun said: 'This vessel Qi Huan Gong tenth year displayed at Bo resting place.'",
      "idiomatic": ""
    },
    {
      "id": "s0031",
      "chinese": "已而案其刻，果齊桓公器。",
      "literal": "Then examined its inscriptions, indeed Qi Huan Gong vessel.",
      "idiomatic": ""
    },
    {
      "id": "s0032",
      "chinese": "一宮盡駭，以少君為神，數百歲人也。",
      "literal": "One palace all startled, took Shaojun as spirit, several hundred years person also.",
      "idiomatic": ""
    },
    {
      "id": "s0033",
      "chinese": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
      "literal": "Shaojun spoke to emperor said: 'Sacrifice stove then bring things, bring things and cinnabar sand can transform into yellow gold, yellow gold completed as food drink vessels then increase longevity, increase longevity and sea middle Penglai immortals can be seen, seen with feng shan then not die, Yellow Emperor is this.'",
      "idiomatic": ""
    },
    {
      "id": "s0034",
      "chinese": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
      "literal": "Minister once toured sea above, saw An Qisheng, fed minister dates, big as melon.",
      "idiomatic": ""
    },
    {
      "id": "s0035",
      "chinese": "安期生僊者，通蓬萊中，合則見人，不合則隱。」",
      "literal": "An Qisheng immortal person, connects Penglai middle, harmonious then sees people, not harmonious then hides.'",
      "idiomatic": ""
    },
    {
      "id": "s0036",
      "chinese": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。",
      "literal": "Thereupon Son of Heaven began personally sacrifice stove, yet sent fangshi entered sea sought Penglai An Qisheng kind, yet undertook transforming cinnabar sand various medicines together into yellow gold.",
      "idiomatic": ""
    },
    {
      "id": "s0037",
      "chinese": "居久之，李少君病死。",
      "literal": "Stayed long time, Li Shaojun illness died.",
      "idiomatic": ""
    },
    {
      "id": "s0038",
      "chinese": "天子以為化去不死也，而使黃錘史寬舒受其方。",
      "literal": "Son of Heaven considered transformed departed immortal also, yet made Huangchui Scribe Kuanshu receive his methods.",
      "idiomatic": ""
    },
    {
      "id": "s0039",
      "chinese": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。",
      "literal": "Sought Penglai An Qisheng none able get, yet coastal Yan Qi strange far-fetched method masters many mutually imitated, moreover spoke divine matters.",
      "idiomatic": ""
    },
    {
      "id": "s0040",
      "chinese": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
      "literal": "Bo person Bo Youji memorialized sacrificed Taiyi method, said: 'Heaven spirits noble Taiyi, Taiyi assistants called Five Emperors.",
      "idiomatic": ""
    },
    {
      "id": "s0041",
      "chinese": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
      "literal": "Ancient Son of Heaven with spring autumn sacrificed Taiyi southeast suburban, used great sacrificial animals complete, seven days, made altar opened eight directions ghost paths.'",
      "idiomatic": ""
    },
    {
      "id": "s0042",
      "chinese": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
      "literal": "Thereupon Son of Heaven commanded Grand Invocator establish his sacrifice Chang'an southeast suburban, constantly conducted sacrifice like Youji method.",
      "idiomatic": ""
    },
    {
      "id": "s0043",
      "chinese": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
      "literal": "His later people had memorialized book, spoke 'Ancient Son of Heaven three years one used great sacrificial animals complete sacrificed spirits three one: heaven one, earth one, Taiyi one'.",
      "idiomatic": ""
    },
    {
      "id": "s0044",
      "chinese": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
      "literal": "Son of Heaven permitted it, commanded Grand Invocator led sacrificed at Youji Taiyi altar above, like his method.",
      "idiomatic": ""
    },
    {
      "id": "s0045",
      "chinese": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
      "literal": "Later people again had submit memorial, spoke 'Ancient ones Son of Heaven often with spring autumn solved sacrifices, sacrificed Yellow Emperor used one xiao broken mirror;",
      "idiomatic": ""
    },
    {
      "id": "s0046",
      "chinese": "冥羊用羊；",
      "literal": "Mingyang used sheep;",
      "idiomatic": ""
    },
    {
      "id": "s0047",
      "chinese": "祠馬行用一青牡馬；",
      "literal": "Sacrificed Maxing used one blue stallion;",
      "idiomatic": ""
    },
    {
      "id": "s0048",
      "chinese": "泰一、皋山山君、地長用牛；",
      "literal": "Taiyi, Gaoshan mountain lord, earth long used cattle;",
      "idiomatic": ""
    },
    {
      "id": "s0049",
      "chinese": "武夷君用乾魚；",
      "literal": "Wuyi Jun used dried fish;",
      "idiomatic": ""
    },
    {
      "id": "s0050",
      "chinese": "陰陽使者以一牛」。",
      "literal": "Yin yang envoys with one ox.'",
      "idiomatic": ""
    }
  ]
}