{
  "metadata": {
    "book": "hanshu",
    "chapter": "016",
    "file": "data/hanshu/016.json"
  },
  "sentences": [
    {
      "id": "177-s1419",
      "originalId": "s1419",
      "blockIndex": 177,
      "chinese": "以中涓從起沛，以郎入漢，以將軍擊項籍，為惠侯，坐守滎陽降楚，免，復來，以郎擊籍，為上黨守擊陳豨，侯，八百戶。",
      "literal": "As zhongjian followed uprising from Pei, as lang entered Han, as general attacked Xiang Yu, made Hui Hou, convicted of guarding Xingyang surrendered to Chu, dismissed, came back again, as lang attacked Yu, as Shangdang guard attacked Chen Xi, made marquis, eight hundred households.",
      "idiomatic": "As zhongjian, he followed the uprising from Pei; as lang, he entered Han service; as general, he attacked Xiang Yu and was made Hui Hou. Convicted of surrendering Xingyang to Chu while guarding it, he was dismissed, but came back; as lang, he attacked Yu; as Shangdang guard, he attacked Chen Xi, and was made a marquis with eight hundred households."
    },
    {
      "id": "177-s1420",
      "originalId": "s1420",
      "blockIndex": 177,
      "chinese": "正月己未封，九年薨。",
      "literal": "First month Ji Wei day enfeoffed, ninth year died.",
      "idiomatic": "Enfeoffed on the Ji Wei day of the first month; died in the ninth year."
    },
    {
      "id": "177-s1421",
      "originalId": "s1421",
      "blockIndex": 177,
      "chinese": "七十七",
      "literal": "Seventy-seven",
      "idiomatic": "Seventy-seven"
    },
    {
      "id": "177-s1422",
      "originalId": "s1422",
      "blockIndex": 177,
      "chinese": "高后元年，侯德嗣，四十三年，孝景中六年，有罪，免。",
      "literal": "Gao Hou first year, Marquis De succeeded, forty-third year, Xiaojing middle sixth year, guilty, dismissed.",
      "idiomatic": "In Empress Gao's first year, Marquis De succeeded to the marquisate; in the forty-third year, during Emperor Jing's middle sixth year, he was guilty and dismissed."
    },
    {
      "id": "177-s1423",
      "originalId": "s1423",
      "blockIndex": 177,
      "chinese": "孫",
      "literal": "Grandson",
      "idiomatic": "Grandson"
    },
    {
      "id": "177-s1424",
      "originalId": "s1424",
      "blockIndex": 177,
      "chinese": "元康四年，赤曾孫霸陵公乘明詔復家。",
      "literal": "Yuankang fourth year, Chi's great-grandson Baling Gongcheng Ming commanded to restore the family.",
      "idiomatic": "In the fourth year of Yuankang, Chi's great-grandson, Baling Gongcheng Ming, was commanded to restore the family line."
    },
    {
      "id": "178-s1426",
      "originalId": "s1426",
      "blockIndex": 178,
      "chinese": "祝阿孝侯高色",
      "literal": "Zhu E Xiao Hou Gao Se",
      "idiomatic": "Zhu E Xiao Hou Gao Se"
    },
    {
      "id": "178-s1427",
      "originalId": "s1427",
      "blockIndex": 178,
      "chinese": "以客從起齧桑，以上隊將入漢，以將軍擊魏太原、井陘，屬淮陰侯，罌度軍破項籍及豨，侯，千八百戶。",
      "literal": "As guest followed uprising from Nie Sang, as upper team commander entered Han, as general attacked Wei Taiyuan, Jingxing, belonged to Huaiyin Hou, Yingdu army broke Xiang Yu and Xi, made marquis, one thousand eight hundred households.",
      "idiomatic": "As a guest, he followed the uprising from Nie Sang; as upper team commander, he entered Han service; as general, he attacked Wei at Taiyuan and Jingxing, belonging to Huaiyin Hou; the Yingdu army broke Xiang Yu and Xi, and he was made a marquis with one thousand eight hundred households."
    },
    {
      "id": "178-s1428",
      "originalId": "s1428",
      "blockIndex": 178,
      "chinese": "正月己卯封，二十一年薨。",
      "literal": "First month Ji Mao day enfeoffed, twenty-first year died.",
      "idiomatic": "Enfeoffed on the Ji Mao day of the first month; died in the twenty-first year."
    },
    {
      "id": "178-s1429",
      "originalId": "s1429",
      "blockIndex": 178,
      "chinese": "七十四",
      "literal": "Seventy-four",
      "idiomatic": "Seventy-four"
    },
    {
      "id": "178-s1430",
      "originalId": "s1430",
      "blockIndex": 178,
      "chinese": "孝文五年，侯成嗣，十四年，後三年，坐事國人過律，免。",
      "literal": "Xiaowen fifth year, Marquis Cheng succeeded, fourteenth year, after three years, convicted of dealing with countrymen violating the law, dismissed.",
      "idiomatic": "In Emperor Wen's fifth year, Marquis Cheng succeeded to the marquisate; in the fourteenth year, three years later, he was convicted of dealing with countrymen in violation of the law and was dismissed."
    },
    {
      "id": "178-s1431",
      "originalId": "s1431",
      "blockIndex": 178,
      "chinese": "孫",
      "literal": "Grandson",
      "idiomatic": "Grandson"
    },
    {
      "id": "178-s1432",
      "originalId": "s1432",
      "blockIndex": 178,
      "chinese": "曾孫",
      "literal": "Grandson's son",
      "idiomatic": "Great-grandson"
    },
    {
      "id": "178-s1433",
      "originalId": "s1433",
      "blockIndex": 178,
      "chinese": "元康四年，色玄孫長陵上造弘詔復家。",
      "literal": "Yuankang fourth year, Se's great-great-grandson Changling Shangzao Hong commanded to restore the family.",
      "idiomatic": "In the fourth year of Yuankang, Se's great-great-grandson, Changling Shangzao Hong, was commanded to restore the family line."
    },
    {
      "id": "179-s1434",
      "originalId": "s1434",
      "blockIndex": 179,
      "chinese": "長脩平侯杜恬",
      "literal": "Changxiu Ping Hou Du Tian",
      "idiomatic": "Changxiu Ping Hou Du Tian"
    }
  ]
}