{
  "metadata": {
    "book": "shiji",
    "chapter": "036",
    "file": "data/shiji/036.json"
  },
  "sentences": [
    {
      "id": "s0062",
      "chinese": "十六年，晉文公敗楚師于城濮。",
      "literal": "In the sixteenth year, Duke Wen of Jin defeated Chu troops at Cheng Pu.",
      "idiomatic": "In the sixteenth year, Duke Wen of Jin defeated Chu's army at Cheng Pu."
    },
    {
      "id": "s0063",
      "chinese": "是歲，穆公卒，子共公朔立。",
      "literal": "In this year, Duke Mu died, and his son Duke Gong Shuo ascended.",
      "idiomatic": "That year, Duke Mu died; his son Duke Gong Shuo ascended."
    },
    {
      "id": "s0064",
      "chinese": "共公六年，楚太子商臣弒其父成王代立，是為穆王。",
      "literal": "In Duke Gong's sixth year, Chu's Crown Prince Shang Chen assassinated his father King Cheng and replaced him, becoming King Mu.",
      "idiomatic": "In Duke Gong's sixth year, Chu's Crown Prince Shang Chen assassinated his father King Cheng and took his place; this was King Mu."
    },
    {
      "id": "s0065",
      "chinese": "十一年，秦穆公卒。",
      "literal": "In the eleventh year, Duke Mu of Qin died.",
      "idiomatic": "In the eleventh year, Duke Mu of Qin died."
    },
    {
      "id": "s0066",
      "chinese": "十八年，共公卒，子靈公平國立。",
      "literal": "In the eighteenth year, Duke Gong died, and his son Duke Ling Ping Guo ascended.",
      "idiomatic": "In the eighteenth year, Duke Gong died; his son Duke Ling Ping Guo ascended."
    },
    {
      "id": "s0067",
      "chinese": "靈公元年，楚莊王即位。",
      "literal": "In Duke Ling's first year, King Zhuang of Chu ascended the throne.",
      "idiomatic": "In Duke Ling's first year, King Zhuang of Chu ascended the throne."
    },
    {
      "id": "s0068",
      "chinese": "六年，楚伐陳。",
      "literal": "In the sixth year, Chu attacked Chen.",
      "idiomatic": "In the sixth year, Chu attacked Chen."
    },
    {
      "id": "s0069",
      "chinese": "十年，陳及楚平。",
      "literal": "In the tenth year, Chen and Chu made peace.",
      "idiomatic": ""
    },
    {
      "id": "s0070",
      "chinese": "十四年，靈公與其大夫孔寧、儀行父皆通於夏姬，衷其衣以戲於朝。",
      "literal": "In the fourteenth year, Duke Ling and his grand officers Kong Ning and Yi Xing Fu all had relations with Xia Ji. They wore her undergarments to play in court.",
      "idiomatic": ""
    },
    {
      "id": "s0072",
      "chinese": "靈公以告二子，二子請殺泄冶，公弗禁，遂殺泄冶。",
      "literal": "Duke Ling told his two sons. The two sons requested to kill Xie Ye. The duke did not forbid it, so they killed Xie Ye.",
      "idiomatic": ""
    },
    {
      "id": "s0073",
      "chinese": "十五年，靈公與二子飲於夏氏。",
      "literal": "In the fifteenth year, Duke Ling drank with his two sons at the Xia clan.",
      "idiomatic": ""
    },
    {
      "id": "s0076",
      "chinese": "徵舒怒。",
      "literal": "Xia Zheng Shu was angered.",
      "idiomatic": ""
    },
    {
      "id": "s0077",
      "chinese": "靈公罷酒出，徵舒伏弩廏門射殺靈公。",
      "literal": "Duke Ling stopped drinking and went out. Xia Zheng Shu hid a crossbow at the stable gate and shot Duke Ling to death.",
      "idiomatic": ""
    },
    {
      "id": "s0078",
      "chinese": "孔寧、儀行父皆奔楚，靈公太子午奔晉。",
      "literal": "Kong Ning and Yi Xing Fu all fled to Chu. Duke Ling's crown prince Wu fled to Jin.",
      "idiomatic": ""
    },
    {
      "id": "s0079",
      "chinese": "徵舒自立為陳侯。",
      "literal": "Xia Zheng Shu established himself as Duke of Chen.",
      "idiomatic": ""
    }
  ]
}