{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "s0302",
      "chinese": "先王惡其亂，故制雅頌之聲以道之，使其聲足以樂而不流，使其文足以綸而不息，使其曲直繁省廉肉節奏，足以感動人之善心而已矣，不使放心邪氣得接焉，是先王立樂之方也。",
      "literal": "Former kings hated its chaos, thus formed ya song sounds to guide it, make its sounds sufficient for joy without flowing, make its patterns sufficient to bind without tiring, make its curved straight elaborate simple pure fleshy rhythms, sufficient to move people's good hearts only, not let wandering evil qi connect, this is former kings establishing music's method.",
      "idiomatic": ""
    },
    {
      "id": "s0303",
      "chinese": "是故樂在宗廟之中，君臣上下同聽之，則莫不和敬；",
      "literal": "Thus music in ancestral temple midst, ruler minister high low together hear it, then none not harmonious respectful;",
      "idiomatic": ""
    },
    {
      "id": "s0304",
      "chinese": "在族長鄉里之中，長幼同聽之，則莫不和順；",
      "literal": "In clan elder village hamlet midst, elder younger together hear it, then none not harmonious yielding;",
      "idiomatic": ""
    },
    {
      "id": "s0305",
      "chinese": "在閨門之內，父子兄弟同聽之，則莫不和親。",
      "literal": "In inner chambers within, father son brothers together hear it, then none not harmonious close.",
      "idiomatic": ""
    },
    {
      "id": "s0306",
      "chinese": "故樂者，審一以定和，比物以飾節，節奏合以成文，所以合和父子君臣，附親萬民也，是先王立樂之方也。",
      "literal": "Thus music examines one to settle harmony, compares things to adorn sections, rhythms combine to form patterns, thus unites harmonizes father son ruler minister, attaches close ten thousand people, this is former kings establishing music's method.",
      "idiomatic": ""
    },
    {
      "id": "s0307",
      "chinese": "故聽其雅頌之聲，志意得廣焉；",
      "literal": "Thus hear its ya song sounds, will intent gets broad;",
      "idiomatic": ""
    },
    {
      "id": "s0308",
      "chinese": "執其干戚，習其俯仰詘信，容貌得莊焉；",
      "literal": "Grasp its shield axe, practice its bow rise bend stretch, appearance gets solemn;",
      "idiomatic": ""
    },
    {
      "id": "s0309",
      "chinese": "行其綴兆，要其節奏，行列得正焉，進退得齊焉。",
      "literal": "Carry its connected ranks, grasp its rhythms, rows columns get correct, advance retreat get even.",
      "idiomatic": ""
    },
    {
      "id": "s0310",
      "chinese": "故樂者天地之齊，中和之紀，人情之所不能免也。",
      "literal": "Thus music is heaven earth's equal, central harmony's record, human feelings cannot avoid.",
      "idiomatic": ""
    },
    {
      "id": "s0311",
      "chinese": "夫樂者，先王之所以飾喜也；",
      "literal": "Music is former kings' way to adorn joy;",
      "idiomatic": ""
    },
    {
      "id": "s0312",
      "chinese": "軍旅鈇鉞者，先王之所以飾怒也。",
      "literal": "Military campaigns axes hatchets is former kings' way to adorn anger.",
      "idiomatic": ""
    },
    {
      "id": "s0313",
      "chinese": "故先王之喜怒皆得其齊矣。",
      "literal": "Thus former kings' joy anger all got their equal.",
      "idiomatic": ""
    },
    {
      "id": "s0314",
      "chinese": "喜則天下和之，怒則暴亂者畏之。",
      "literal": "Joy then world harmonizes it, anger then violent chaotic fear it.",
      "idiomatic": ""
    },
    {
      "id": "s0315",
      "chinese": "先王之道禮樂可謂盛矣。",
      "literal": "Former kings' way ritual music can be called flourishing.",
      "idiomatic": ""
    },
    {
      "id": "s0316",
      "chinese": "魏文侯問於子夏曰：「吾端冕而聽古樂則唯恐臥，聽鄭衛之音則不知倦。",
      "literal": "Wei Wen Hou asked Zi Xia saying: 'I properly capped robed hear ancient music then only fear sleeping, hear Zheng Wei sounds then not know tiredness.",
      "idiomatic": ""
    },
    {
      "id": "s0317",
      "chinese": "敢問古樂之如彼，何也？",
      "literal": "Dare ask ancient music like that, why?",
      "idiomatic": ""
    },
    {
      "id": "s0318",
      "chinese": "新樂之如此，何也？」",
      "literal": "New music like this, why?'",
      "idiomatic": ""
    },
    {
      "id": "s0320",
      "chinese": "子夏答曰：「今夫古樂，進旅而退旅，和正以廣，弦匏笙簧合守拊鼓，始奏以文，止亂以武，治亂以相，訊疾以雅。",
      "literal": "Zi Xia answered saying: 'Now ancient music, advance troops retreat troops, harmony correct to broad, strings gourds sheng reeds together guard beat drum, begin performance with pattern, stop chaos with martial, govern chaos with prime minister, interrogate haste with ya.",
      "idiomatic": ""
    },
    {
      "id": "s0321",
      "chinese": "君子於是語，於是道古，修身及家，平均天下：此古樂之發也。",
      "literal": "Gentleman thus discusses, thus explains ancient, cultivates self reaches family, evens world: this ancient music's expression.",
      "idiomatic": ""
    },
    {
      "id": "s0322",
      "chinese": "今夫新樂，進俯退俯，姦聲以淫，溺而不止，及優侏儒，獶雜子女，不知父子。",
      "literal": "Now new music, advance bow retreat bow, evil sounds with licentious, drown without stop, reach actors dwarfs, mingle mixed sons daughters, not know father son.",
      "idiomatic": ""
    },
    {
      "id": "s0323",
      "chinese": "樂終不可以語，不可以道古：此新樂之發也。",
      "literal": "Music end cannot discuss, cannot explain ancient: this new music's expression.",
      "idiomatic": ""
    },
    {
      "id": "s0324",
      "chinese": "今君之所問者樂也，所好者音也。",
      "literal": "Now lord's asked is music, what likes is sound.",
      "idiomatic": ""
    },
    {
      "id": "s0325",
      "chinese": "夫樂之與音，相近而不同。」",
      "literal": "Music and sound, close but different.'",
      "idiomatic": ""
    },
    {
      "id": "s0327",
      "chinese": "文侯曰：「敢問如何？」",
      "literal": "Wen Hou said: 'Dare ask how?'",
      "idiomatic": ""
    },
    {
      "id": "s0329",
      "chinese": "子夏答曰：「夫古者天地順而四時當，民有德而五穀昌，疾疢不作而無祅祥，此之謂大當。",
      "literal": "Zi Xia answered saying: 'Ancient heaven earth orderly four seasons proper, people have virtue five grains prosper, sickness not arise without evil omens, this called great proper.",
      "idiomatic": ""
    },
    {
      "id": "s0330",
      "chinese": "然後聖人作為父子君臣以為之紀綱，紀綱既正，天下大定，天下大定，然後正六律，和五聲，弦歌詩頌，此之謂德音，德音之謂樂。",
      "literal": "Then sage made father son ruler minister as framework, framework already correct, world greatly settled, world greatly settled, then correct six pitches, harmonize five sounds, string sing poem song, this called virtue sound, virtue sound called music.",
      "idiomatic": ""
    },
    {
      "id": "s0331",
      "chinese": "《詩》曰：『莫其德音，其德克明，克明克類，克長克君。",
      "literal": "Poem says: 'None his virtue sound, his virtue can bright, can bright can categorize, can elder can lord.",
      "idiomatic": ""
    },
    {
      "id": "s0332",
      "chinese": "王此大邦，克順克俾。",
      "literal": "Wang this great state, can yield can aid.",
      "idiomatic": ""
    },
    {
      "id": "s0333",
      "chinese": "俾於文王，其德靡悔。",
      "literal": "Aid to Wen Wang, his virtue no regret.",
      "idiomatic": ""
    },
    {
      "id": "s0334",
      "chinese": "既受帝祉，施于孫子。』",
      "literal": "Already received Di blessing, applied to grandson child.'",
      "idiomatic": ""
    },
    {
      "id": "s0335",
      "chinese": "此之謂也。",
      "literal": "This what called.",
      "idiomatic": ""
    },
    {
      "id": "s0336",
      "chinese": "今君之所好者，其溺音與？」",
      "literal": "Now lord's what likes, drown sound?'",
      "idiomatic": ""
    },
    {
      "id": "s0338",
      "chinese": "文侯曰：「敢問溺音者何從出也？」",
      "literal": "Wen Hou said: 'Dare ask drown sound from where come?'",
      "idiomatic": ""
    },
    {
      "id": "s0340",
      "chinese": "子夏答曰：「鄭音好濫淫志，宋音燕女溺志，衛音趣數煩志，齊音驁辟驕志，四者皆淫於色而害於德，是以祭祀不用也。",
      "literal": "Zi Xia answered saying: 'Zheng sound likes overflowing licentious will, Song sound Yan woman drown will, Wei sound hurried numerous troubled will, Qi sound haughty deviant proud will, four all licentious in color harm virtue, thus sacrifice not use.",
      "idiomatic": ""
    },
    {
      "id": "s0341",
      "chinese": "《詩》曰：『肅雍和鳴，先祖是聽。』",
      "literal": "Poem says: 'Solemn harmonious cry together, ancestors this listen.'",
      "idiomatic": ""
    },
    {
      "id": "s0342",
      "chinese": "夫肅肅，敬也；",
      "literal": "Solemn solemn, respect;",
      "idiomatic": ""
    },
    {
      "id": "s0343",
      "chinese": "雍雍，和也。",
      "literal": "Harmonious harmonious, harmony.",
      "idiomatic": ""
    },
    {
      "id": "s0344",
      "chinese": "夫敬以和，何事不行？",
      "literal": "Respect with harmony, what affair not carry?",
      "idiomatic": ""
    },
    {
      "id": "s0345",
      "chinese": "為人君者，謹其所好惡而已矣。",
      "literal": "As person lord, careful what like hate only.",
      "idiomatic": ""
    },
    {
      "id": "s0346",
      "chinese": "君好之則臣為之，上行之則民從之。",
      "literal": "Lord likes then minister does it, above carries then people follow.",
      "idiomatic": ""
    },
    {
      "id": "s0347",
      "chinese": "《詩》曰：『誘民孔易』，此之謂也。",
      "literal": "Poem says: 'Guide people very easy', this what called.",
      "idiomatic": ""
    },
    {
      "id": "s0348",
      "chinese": "然後聖人作為鞉鼓椌楬壎篪，此六者，德音之音也。",
      "literal": "Then sage made nao drum frame drums xun chi, these six, virtue sound's sounds.",
      "idiomatic": ""
    },
    {
      "id": "s0349",
      "chinese": "然後鐘磬竽瑟以和之，干戚旄狄以舞之。",
      "literal": "Then bells chimes yu se to harmonize it, shield axe banners standards to dance it.",
      "idiomatic": ""
    },
    {
      "id": "s0350",
      "chinese": "此所以祭先王之廟也，所以獻醻酳酢也，所以官序貴賤各得其宜也，此所以示後世有尊卑長幼序也。",
      "literal": "This to sacrifice former kings' temple, to present rewards pledges exchanges, to official order noble base each get suitable, this to show later generations have noble base elder younger order.",
      "idiomatic": ""
    },
    {
      "id": "s0351",
      "chinese": "鐘聲鏗，鏗以立號，號以立橫，橫以立武。",
      "literal": "Bell sound kong, kong to establish call, call to establish signal, signal to establish martial.",
      "idiomatic": ""
    },
    {
      "id": "s0352",
      "chinese": "君子聽鐘聲則思武臣。",
      "literal": "Gentleman hears bell sound then thinks martial ministers.",
      "idiomatic": ""
    },
    {
      "id": "s0353",
      "chinese": "石聲硁，硁以立別，別以致死。",
      "literal": "Stone sound qing, qing to establish distinction, distinction to cause death.",
      "idiomatic": ""
    },
    {
      "id": "s0354",
      "chinese": "君子聽磬聲則思死封疆之臣。",
      "literal": "Gentleman hears chime sound then thinks death border ministers.",
      "idiomatic": ""
    },
    {
      "id": "s0355",
      "chinese": "絲聲哀，哀以立廉，廉以立志。",
      "literal": "Silk sound sorrowful, sorrowful to establish purity, purity to establish will.",
      "idiomatic": ""
    },
    {
      "id": "s0356",
      "chinese": "君子聽琴瑟之聲則思志義之臣。",
      "literal": "Gentleman hears qin se sound then thinks will righteousness ministers.",
      "idiomatic": ""
    }
  ]
}