{
  "metadata": {
    "book": "hanshu",
    "chapter": "016",
    "file": "data/hanshu/016.json"
  },
  "sentences": [
    {
      "id": "s100",
      "chinese": "十二月甲申封，二十三年薨。",
      "literal": "Twelfth month Jia Shen day enfeoffed, twenty-third year died.",
      "idiomatic": "Enfeoffed on the Jia Shen day of the twelfth month; died in the twenty-third year."
    },
    {
      "id": "s101",
      "chinese": "十四",
      "literal": "Fourteen",
      "idiomatic": "Fourteen"
    },
    {
      "id": "s102",
      "chinese": "孝文元年，哀侯疆嗣。七年薨。",
      "literal": "Xiaowen first year, Ai Marquis Jiang succeeded. Died after seven years.",
      "idiomatic": "In Emperor Wen's first year, Ai Marquis Jiang succeeded to the marquisate. He died after seven years."
    },
    {
      "id": "s103",
      "chinese": "八年，孝侯伉嗣，二十年薨。",
      "literal": "Eighth year, Xiao Marquis Kang succeeded; died after twenty years.",
      "idiomatic": "In the eighth year, Xiao Marquis Kang succeeded to the marquisate; died after twenty years."
    },
    {
      "id": "s104",
      "chinese": "孝景五年，哀侯不害嗣，十九年，元光二年薨，亡後。",
      "literal": "Xiaojing fifth year, Ai Marquis Buhai succeeded; nineteenth year, Yuanguang second year died, no heir.",
      "idiomatic": "In Emperor Jing's fifth year, Ai Marquis Buhai succeeded to the marquisate; in the nineteenth year, during the second year of Yuanguang, he died with no heir."
    },
    {
      "id": "s105",
      "chinese": "元康四年，吸玄孫長安大夫充國詔復家。",
      "literal": "Yuankang fourth year, Wang Xi's great-great-grandson Chang'an Dafu Chongguo commanded to restore the family.",
      "idiomatic": "In the fourth year of Yuankang, Wang Xi's great-great-grandson, Chang'an Dafu Chongguo, was commanded to restore the family line."
    },
    {
      "id": "s110",
      "chinese": "元壽二年八月，詔賜吸代後爵關內侯，不言世。",
      "literal": "Yuanshou second year eighth month, commanded to grant Wang Xi's substitute heir the rank of Guan Nei Marquis, not specifying generations.",
      "idiomatic": "In the eighth month of the second year of Yuanshou, it was commanded that Wang Xi's substitute heir be granted the rank of Guan Nei Marquis, without specifying the number of generations."
    },
    {
      "id": "s114",
      "chinese": "陽陵景侯傅寬",
      "literal": "Yangling Jing Marquis Fu Kuan",
      "idiomatic": "Yangling Jing Marquis Fu Kuan"
    },
    {
      "id": "s115",
      "chinese": "以舍人從起橫陽，至霸上，為騎將，入漢，定三秦，屬淮陰，定齊，為齊丞相，侯，二千六百戶。",
      "literal": "As retainer followed uprising from Hengyang, to Baxiang, became cavalry general, entered Han, pacified the Three Qins, served under Huaiyin, pacified Qi, became Qi Chancellor, made marquis, two thousand six hundred households.",
      "idiomatic": "As a retainer, he followed the uprising from Hengyang to Baxiang and became a cavalry general. He entered Han service, pacified the Three Qin territories, served under Han Xin, pacified Qi, became Chancellor of Qi, and was made a marquis with two thousand six hundred households."
    },
    {
      "id": "s116",
      "chinese": "十二月甲申封，十二年薨。",
      "literal": "Twelfth month Jia Shen day enfeoffed, twelfth year died.",
      "idiomatic": "Enfeoffed on the Jia Shen day of the twelfth month; died in the twelfth year."
    },
    {
      "id": "s117",
      "chinese": "十位次曰武忠侯。",
      "literal": "Tenth in ranking called Martial Loyal Marquis.",
      "idiomatic": "He ranked tenth and was called the Martial Loyal Marquis."
    },
    {
      "id": "s118",
      "chinese": "孝惠六年，頃侯清嗣，二十二年薨。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s119",
      "chinese": "孝文十五年，共侯明嗣，二十二年薨。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s120",
      "chinese": "孝景四年，侯偃嗣，三十一年，元狩元年，坐與淮南王謀反，誅。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s121",
      "chinese": "玄孫",
      "literal": "",
      "idiomatic": ""
    }
  ]
}