{
  "metadata": {
    "book": "shiji",
    "chapter": "039",
    "file": "data/shiji/039.json"
  },
  "sentences": [
    {
      "id": "s0811",
      "chinese": "六年春，鄭倍晉與楚盟，晉怒。",
      "literal": "In the sixth year, spring, Zheng double-crossed Jin and allied with Chu. Jin was angered.",
      "idiomatic": "In the sixth year, during spring, Zheng betrayed Jin and formed an alliance with Chu. Jin was furious."
    },
    {
      "id": "s0813",
      "chinese": "乃發兵。",
      "literal": "They then dispatched troops.",
      "idiomatic": "They then mobilized their army."
    },
    {
      "id": "s0814",
      "chinese": "厲公自將，五月度河。",
      "literal": "Li Gong personally led the army. In the fifth month they crossed the river.",
      "idiomatic": "Duke Li personally commanded the expedition. In the fifth month, they crossed the Yellow River."
    },
    {
      "id": "s0815",
      "chinese": "聞楚兵來救，范文子請公欲還。",
      "literal": "They heard that Chu troops had come to save them. Fan Wen Zi requested that the duke return.",
      "idiomatic": "They heard that Chu troops were coming to Zheng's rescue. Fan Wen Zi urged the duke to turn back."
    },
    {
      "id": "s0817",
      "chinese": "遂與戰。",
      "literal": "They then battled with them.",
      "idiomatic": "They then engaged them in battle."
    },
    {
      "id": "s0818",
      "chinese": "癸巳，射中楚共王目，楚兵敗於鄢陵。",
      "literal": "On Gui Si, they shot and hit Chu Gong Wang's eye. Chu troops were defeated at Yan Ling.",
      "idiomatic": "On the day Guisi, an arrow struck King Gong of Chu in the eye. The Chu army was defeated at Yanling."
    },
    {
      "id": "s0819",
      "chinese": "子反收餘兵，拊循欲復戰，晉患之。",
      "literal": "Zi Fan gathered the remaining troops and stroked and consoled them, desiring to battle again. Jin was troubled by it.",
      "idiomatic": ""
    },
    {
      "id": "s0820",
      "chinese": "共王召子反，其侍者豎陽穀進酒，子反醉，不能見。",
      "literal": "Gong Wang summoned Zi Fan. His attendant Shu Yang Gu presented wine. Zi Fan got drunk and could not meet with him.",
      "idiomatic": ""
    },
    {
      "id": "s0821",
      "chinese": "王怒，讓子反，子反死。",
      "literal": "The wang was angered and reproached Zi Fan. Zi Fan died.",
      "idiomatic": ""
    },
    {
      "id": "s0822",
      "chinese": "王遂引兵歸。",
      "literal": "The wang then led the troops and returned.",
      "idiomatic": ""
    },
    {
      "id": "s0823",
      "chinese": "晉由此威諸侯，欲以令天下求霸。",
      "literal": "Jin from this awed the feudal lords and desired to command the world and seek hegemony.",
      "idiomatic": ""
    },
    {
      "id": "s0824",
      "chinese": "厲公多外嬖姬，歸，欲盡去群大夫而立諸姬兄弟。",
      "literal": "Li Gong had many external favored consorts. Upon returning, he desired to completely remove the group of grandees and establish his various consorts' brothers.",
      "idiomatic": ""
    },
    {
      "id": "s0825",
      "chinese": "寵姬兄曰胥童，嘗與郤至有怨，及欒書又怨郤至不用其計而遂敗楚，乃使人閒謝楚。",
      "literal": "The favored consort's brother was named Xu Tong. He once had resentment with Xi Zhi, and Luan Shu again resented Xi Zhi for not using his plan and then defeating Chu. He then sent people to secretly apologize to Chu.",
      "idiomatic": ""
    },
    {
      "id": "s0828",
      "chinese": "厲公告欒書。",
      "literal": "Li Gong told Luan Shu.",
      "idiomatic": ""
    },
    {
      "id": "s0829",
      "chinese": "欒書曰：「其殆有矣！",
      "literal": "Luan Shu said: 'It probably has it!",
      "idiomatic": ""
    }
  ]
}