{
  "metadata": {
    "book": "shiji",
    "chapter": "076",
    "file": "data/shiji/076.json"
  },
  "sentences": [
    {
      "id": "0-s0001",
      "originalId": "s0001",
      "blockIndex": 0,
      "chinese": "平原君趙勝者，趙之諸公子也。",
      "literal": "Lord Pingyuan, Zhao Sheng, was one of the noble scions of Zhao.",
      "idiomatic": ""
    },
    {
      "id": "0-s0002",
      "originalId": "s0002",
      "blockIndex": 0,
      "chinese": "諸子中勝最賢，喜賓客，賓客蓋至者數千人。",
      "literal": "Among the noble scions, Sheng was the most worthy. He delighted in guests, and the number of guests who came to him reached several thousand.",
      "idiomatic": ""
    },
    {
      "id": "0-s0003",
      "originalId": "s0003",
      "blockIndex": 0,
      "chinese": "平原君相趙惠文王及孝成王，三去相，三復位，封於東武城。",
      "literal": "Lord Pingyuan served as chancellor to Kings Huiwen and Xiaocheng of Zhao. Three times he resigned the chancellorship, three times he was restored to office, and he was enfeoffed at Dongwu City.",
      "idiomatic": ""
    },
    {
      "id": "1-s0004",
      "originalId": "s0004",
      "blockIndex": 1,
      "chinese": "平原君家樓臨民家。",
      "literal": "Lord Pingyuan's house tower overlooked a commoner's home.",
      "idiomatic": ""
    },
    {
      "id": "1-s0005",
      "originalId": "s0005",
      "blockIndex": 1,
      "chinese": "民家有躄者，槃散行汲。",
      "literal": "In the commoner's home lived a crippled man who, with his knees spread apart, crawled to draw water.",
      "idiomatic": ""
    },
    {
      "id": "1-s0006",
      "originalId": "s0006",
      "blockIndex": 1,
      "chinese": "平原君美人居樓上，臨見，大笑之。",
      "literal": "Lord Pingyuan's concubine was dwelling in the tower above, looked down and saw him, and burst out laughing.",
      "idiomatic": ""
    },
    {
      "id": "1-s0008",
      "originalId": "s0008",
      "blockIndex": 1,
      "chinese": "臣不幸有罷癃之病，而君之後宮臨而笑臣，臣願得笑臣者頭。」",
      "literal": "Alas, I suffer from a debilitating illness. Yet one of Your Lordship's concubines looked down upon me and laughed. I wish to have the head of the one who laughed at me.'",
      "idiomatic": ""
    },
    {
      "id": "1-s0011",
      "originalId": "s0011",
      "blockIndex": 1,
      "chinese": "終不殺。",
      "literal": "In the end, he did not kill her.",
      "idiomatic": ""
    },
    {
      "id": "1-s0012",
      "originalId": "s0012",
      "blockIndex": 1,
      "chinese": "居歲餘，賓客門下舍人稍稍引去者過半。",
      "literal": "More than a year passed, and gradually more than half of the retainers in his household had departed.",
      "idiomatic": ""
    },
    {
      "id": "1-s0015",
      "originalId": "s0015",
      "blockIndex": 1,
      "chinese": "於是平原君乃斬笑躄者美人頭，自造門進躄者，因謝焉。",
      "literal": "Thereupon Lord Pingyuan had the concubine who laughed at the cripple beheaded. He personally went to the gate and invited the cripple in, then apologized to him.",
      "idiomatic": ""
    },
    {
      "id": "1-s0016",
      "originalId": "s0016",
      "blockIndex": 1,
      "chinese": "其後門下乃復稍稍來。",
      "literal": "Afterward, his retainers gradually began to return once more.",
      "idiomatic": ""
    },
    {
      "id": "1-s0017",
      "originalId": "s0017",
      "blockIndex": 1,
      "chinese": "是時齊有孟嘗，魏有信陵，楚有春申，故爭相傾以待士。",
      "literal": "At this time, Qi had Lord Mengchang, Wei had Lord Xinling, and Chu had Lord Chunshen. Thus they vied with one another to attract worthy men with generous treatment.",
      "idiomatic": ""
    },
    {
      "id": "2-s0018",
      "originalId": "s0018",
      "blockIndex": 2,
      "chinese": "秦之圍邯鄲，趙使平原君求救，合從於楚，約與食客門下有勇力文武備具者二十人偕。",
      "literal": "When Qin besieged Handan, Zhao sent Lord Pingyuan to seek aid. He allied with Chu and brought along twenty of his retainers who possessed both martial valor and literary accomplishment.",
      "idiomatic": ""
    },
    {
      "id": "2-s0020",
      "originalId": "s0020",
      "blockIndex": 2,
      "chinese": "文不能取勝，則歃血於華屋之下，必得定從而還。",
      "literal": "If diplomacy cannot prevail, then we shall perform the blood oath beneath the ornate hall and secure a firm alliance before returning.'",
      "idiomatic": ""
    },
    {
      "id": "2-s0021",
      "originalId": "s0021",
      "blockIndex": 2,
      "chinese": "士不外索，取於食客門下足矣。」",
      "literal": "We shall not seek worthy men from outside; those among my retainers will suffice.'",
      "idiomatic": ""
    }
  ]
}