{
  "metadata": {
    "book": "shiji",
    "chapter": "069",
    "file": "data/shiji/069.json"
  },
  "sentences": [
    {
      "id": "s0053",
      "chinese": "請別白黑所以異，陰陽而已矣。",
      "literal": "Permit me to distinguish black and white, only yin and yang.",
      "idiomatic": ""
    },
    {
      "id": "s0054",
      "chinese": "君誠能聽臣，燕必致旃裘狗馬之地，齊必致魚鹽之海，楚必致橘柚之園，韓、魏、中山皆可使致湯沐之奉，而貴戚父兄皆可以受封侯。",
      "literal": "Your lordship truly can listen to minister, Yan must send felt fur dog horse lands, Qi must send fish salt seas, Chu must send orange pomelo gardens, Han Wei Zhong Shan all can be made to send hot water offerings, noble relatives fathers elder brothers all can receive enfeoffed marquises.",
      "idiomatic": ""
    },
    {
      "id": "s0055",
      "chinese": "夫割地包利，五伯之所以覆軍禽將而求也；",
      "literal": "Dividing land wrapping benefits, five hegemons therefore overturned armies captured generals to seek them;",
      "idiomatic": ""
    },
    {
      "id": "s0056",
      "chinese": "封侯貴戚，湯武之所以放弒而爭也。",
      "literal": "Enfeoffing marquises honoring relatives, Tang Wu therefore exiled killed to contend for them.",
      "idiomatic": ""
    },
    {
      "id": "s0057",
      "chinese": "今君高拱而兩有之，此臣之所以為君願也。",
      "literal": "Now your lordship with folded arms has both, this is minister reason for wishing for your lordship.",
      "idiomatic": ""
    },
    {
      "id": "s0058",
      "chinese": "「今大王與秦，則秦必弱韓、魏；",
      "literal": "Now great king allies with Qin, then Qin certainly weakens Han Wei;",
      "idiomatic": ""
    },
    {
      "id": "s0059",
      "chinese": "與齊，則齊必弱楚、魏。",
      "literal": "Allies with Qi, then Qi certainly weakens Chu Wei.",
      "idiomatic": ""
    },
    {
      "id": "s0060",
      "chinese": "魏弱則割河外，韓弱則效宜陽，宜陽效則上郡絕，河外割則道不通，楚弱則無援。",
      "literal": "Wei weakens then cedes beyond Yellow River, Han weakens then surrenders Yi Yang, Yi Yang surrenders then Shang Commandery cut off, beyond Yellow River cedes then roads not pass, Chu weakens then no aid.",
      "idiomatic": ""
    },
    {
      "id": "s0061",
      "chinese": "此三策者，不可不孰計也。",
      "literal": "These three strategies, cannot not carefully calculate.",
      "idiomatic": ""
    },
    {
      "id": "s0062",
      "chinese": "「夫秦下軹道，則南陽危；",
      "literal": "When Qin descends Zhi Road, then Nanyang endangered;",
      "idiomatic": ""
    },
    {
      "id": "s0063",
      "chinese": "劫韓包周，則趙氏自操兵；",
      "literal": "Coerces Han surrounds Zhou, then Zhao clan personally handles troops;",
      "idiomatic": ""
    },
    {
      "id": "s0064",
      "chinese": "據衛取卷，則齊必入朝秦。",
      "literal": "Occupies Wei takes Juan, then Qi must enter court Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0065",
      "chinese": "秦欲已得乎山東，則必舉兵而向趙矣。",
      "literal": "Qin desires to obtain Shandong, then must raise troops toward Zhao.",
      "idiomatic": ""
    },
    {
      "id": "s0066",
      "chinese": "秦甲渡河踰漳，據番吾，則兵必戰於邯鄲之下矣。",
      "literal": "Qin armor crosses Yellow River surpasses Zhang, occupies Fan Wu, then troops must battle below Handan.",
      "idiomatic": ""
    },
    {
      "id": "s0067",
      "chinese": "此臣之所為君患也。",
      "literal": "This minister reason for worrying for your lordship.",
      "idiomatic": ""
    },
    {
      "id": "s0068",
      "chinese": "「當今之時，山東之建國莫彊於趙。",
      "literal": "At present time, Shandong established states none stronger than Zhao.",
      "idiomatic": ""
    },
    {
      "id": "s0069",
      "chinese": "趙地方二千餘里，帶甲數十萬，車千乘，騎萬匹，粟支數年。",
      "literal": "Zhao territory two thousand li square, armored troops several tens of thousands, chariots thousand, cavalry ten thousand horses, grain sufficient several years.",
      "idiomatic": ""
    },
    {
      "id": "s0070",
      "chinese": "西有常山，南有河漳，東有清河，北有燕國。",
      "literal": "West has Chang Mountain, south has Yellow River Zhang, east has Qing River, north has Yan state.",
      "idiomatic": ""
    },
    {
      "id": "s0071",
      "chinese": "燕固弱國，不足畏也。",
      "literal": "Yan certainly weak state, not worth fearing.",
      "idiomatic": ""
    },
    {
      "id": "s0072",
      "chinese": "秦之所害於天下者莫如趙，然而秦不敢舉兵伐趙者，何也？",
      "literal": "Qin harm to world none like Zhao, yet Qin dares not raise troops attack Zhao, why?",
      "idiomatic": ""
    },
    {
      "id": "s0073",
      "chinese": "畏韓、魏之議其後也。",
      "literal": "Fears Han Wei discussing their rear.",
      "idiomatic": ""
    },
    {
      "id": "s0074",
      "chinese": "然則韓、魏，趙之南蔽也。",
      "literal": "Then Han Wei are Zhao southern screen.",
      "idiomatic": ""
    },
    {
      "id": "s0075",
      "chinese": "秦之攻韓、魏也，無有名山大川之限，稍蠶食之，傅國都而止。",
      "literal": "Qin attacks Han Wei, no famous mountains great rivers limit, gradually nibbling them, approaching national capitals then stops.",
      "idiomatic": ""
    },
    {
      "id": "s0076",
      "chinese": "韓、魏不能支秦，必入臣於秦。",
      "literal": "Han Wei cannot withstand Qin, must enter as ministers to Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0077",
      "chinese": "秦無韓、魏之規，則禍必中於趙矣。",
      "literal": "Qin without Han Wei monitoring, calamity must hit Zhao.",
      "idiomatic": ""
    },
    {
      "id": "s0078",
      "chinese": "此臣之所為君患也。",
      "literal": "This minister reason for worrying for your lordship.",
      "idiomatic": ""
    },
    {
      "id": "s0079",
      "chinese": "「臣聞堯無三夫之分，舜無咫尺之地，以有天下；",
      "literal": "Minister heard Yao without three men portion, Shun without foot inch land, to have world;",
      "idiomatic": ""
    },
    {
      "id": "s0080",
      "chinese": "禹無百人之聚，以王諸侯；",
      "literal": "Yu without hundred men gathering, to king feudal lords;",
      "idiomatic": ""
    },
    {
      "id": "s0081",
      "chinese": "湯武之士不過三千，車不過三百乘，卒不過三萬，立為天子：誠得其道也。",
      "literal": "Tang Wu soldiers not exceeding three thousand, chariots not exceeding three hundred, troops not exceeding thirty thousand, established as Son of Heaven: truly obtained their way.",
      "idiomatic": ""
    },
    {
      "id": "s0082",
      "chinese": "是故明主外料其敵之彊弱，內度其士卒賢不肖，不待兩軍相當而勝敗存亡之機固已形於胸中矣，豈揜於眾人之言而以冥冥決事哉！",
      "literal": "Therefore enlightened rulers externally measure enemy strength weakness, internally assess their soldiers worthy unworthy, not waiting for two armies to confront the victory defeat survival extinction mechanisms already formed in chest, how can they be obscured by crowd words and decide affairs in darkness!",
      "idiomatic": ""
    },
    {
      "id": "s0083",
      "chinese": "「臣竊以天下之地圖案之，諸侯之地五倍於秦，料度諸侯之卒十倍於秦，六國為一，并力西鄉而攻秦，秦必破矣。",
      "literal": "Minister secretly with world land maps examines it, feudal lords land five times Qin, estimate feudal lords troops ten times Qin, six states become one, combine strength west face attack Qin, Qin must break.",
      "idiomatic": ""
    },
    {
      "id": "s0084",
      "chinese": "今西面而事之，見臣於秦。",
      "literal": "Now west face serve them, see ministers in Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0085",
      "chinese": "夫破人之與破於人也，臣人之與臣於人也，豈可同日而論哉！",
      "literal": "Breaking others versus being broken by others, ministering others versus being ministered by others, how can be discussed same day!",
      "idiomatic": ""
    },
    {
      "id": "s0086",
      "chinese": "「夫衡人者，皆欲割諸侯之地以予秦。",
      "literal": "Those balancing people, all desire divide feudal lords land to give Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0087",
      "chinese": "秦成，則高臺榭，美宮室，聽竽瑟之音，前有樓闕軒轅，後有長姣美人，國被秦患而不與其憂。",
      "literal": "Qin succeeds, then high towers terraces, beautiful palaces, listen to reed flute zither sounds, front has tower gates carriages, rear has tall beauties, state suffers Qin calamity without sharing their worry.",
      "idiomatic": ""
    },
    {
      "id": "s0088",
      "chinese": "是故夫衡人日夜務以秦權恐愒諸侯以求割地，故願大王孰計之也。",
      "literal": "Therefore balancing people day night strive with Qin authority frighten threaten feudal lords to seek cede land, therefore wish great king carefully calculate it.",
      "idiomatic": ""
    },
    {
      "id": "s0089",
      "chinese": "「臣聞明主絕疑去讒，屏流言之跡，塞朋黨之門，故尊主廣地彊兵之計臣得陳忠於前矣。",
      "literal": "Minister heard enlightened rulers cut off doubts remove slanderers, block rumors tracks, close faction doors, therefore honorable lord broaden land strengthen troops plans minister can demonstrate loyalty before.",
      "idiomatic": ""
    },
    {
      "id": "s0090",
      "chinese": "故竊為大王計，莫如一韓、魏、齊、楚、燕、趙以從親，以畔秦。",
      "literal": "Therefore secretly for great king planning, none better than unite Han Wei Qi Chu Yan Zhao to form close alliance, to rebel against Qin.",
      "idiomatic": ""
    },
    {
      "id": "s0091",
      "chinese": "令天下之將相會於洹水之上，通質，刳白馬而盟。",
      "literal": "Order world generals ministers meet above Huan Water, exchange hostages, cut white horse make covenant.",
      "idiomatic": ""
    },
    {
      "id": "s0092",
      "chinese": "要約曰：『秦攻楚，齊、魏各出銳師以佐之，韓絕其糧道，趙涉河漳，燕守常山之北。",
      "literal": "Pact says: Qin attacks Chu, Qi Wei each send sharp troops to aid it, Han cut its grain roads, Zhao ford Yellow River Zhang, Yan guard Chang Mountain north.",
      "idiomatic": ""
    },
    {
      "id": "s0093",
      "chinese": "秦攻韓魏，則楚絕其後，齊出銳師而佐之，趙涉河漳，燕守雲中。",
      "literal": "Qin attacks Han Wei, then Chu cut its rear, Qi send sharp troops aid it, Zhao ford Yellow River Zhang, Yan guard Yun Zhong.",
      "idiomatic": ""
    },
    {
      "id": "s0094",
      "chinese": "秦攻齊，則楚絕其後，韓守城皋，魏塞其道，趙涉河漳、博關，燕出銳師以佐之。",
      "literal": "Qin attacks Qi, then Chu cut its rear, Han guard Cheng Gao, Wei block its roads, Zhao ford Yellow River Zhang Bo Pass, Yan send sharp troops aid it.",
      "idiomatic": ""
    },
    {
      "id": "s0095",
      "chinese": "秦攻燕，則趙守常山，楚軍武關，齊涉勃海，韓、魏皆出銳師以佐之。",
      "literal": "Qin attacks Yan, then Zhao guard Chang Mountain, Chu army Wu Pass, Qi ford Bo Sea, Han Wei all send sharp troops aid it.",
      "idiomatic": ""
    },
    {
      "id": "s0096",
      "chinese": "秦攻趙，則韓軍宜陽，楚軍武關，魏軍河外，齊涉清河，燕出銳師以佐之。",
      "literal": "Qin attacks Zhao, then Han army Yi Yang, Chu army Wu Pass, Wei army beyond Yellow River, Qi ford Qing River, Yan send sharp troops aid it.",
      "idiomatic": ""
    },
    {
      "id": "s0097",
      "chinese": "諸侯有不如約者，以五國之兵共伐之。』",
      "literal": "Feudal lords have not following pact, with five states troops together attack them.",
      "idiomatic": ""
    },
    {
      "id": "s0098",
      "chinese": "六國從親以賓秦，則秦甲必不敢出於函谷以害山東矣。",
      "literal": "Six states form close alliance to oppose Qin, then Qin armor certainly dares not emerge from Hangu to harm Shandong.",
      "idiomatic": ""
    },
    {
      "id": "s0099",
      "chinese": "如此，則霸王之業成矣。」",
      "literal": "Like this, then hegemon king enterprise completed.",
      "idiomatic": ""
    },
    {
      "id": "s0101",
      "chinese": "趙王曰：「寡人年少，立國日淺，未嘗得聞社稷之長計也。",
      "literal": "Zhao Wang said: \"I am young, established state not long, never heard state long plans.",
      "idiomatic": ""
    },
    {
      "id": "s0102",
      "chinese": "今上客有意存天下，安諸侯寡人敬以國從。」",
      "literal": "Now honored guest has intention preserve world, secure feudal lords I respectfully with state follow.\"",
      "idiomatic": ""
    },
    {
      "id": "s0103",
      "chinese": "乃飾車百乘，黃金千溢，白璧百雙，錦繡千純，以約諸侯。",
      "literal": "Then adorned chariots hundred, gold thousand yi, white jade hundred pairs, brocade thousand bolts, to make pact with feudal lords.",
      "idiomatic": ""
    }
  ]
}