{
  "metadata": {
    "book": "shiji",
    "chapter": "012",
    "file": "data/shiji/012.json"
  },
  "sentences": [
    {
      "id": "3-s0016",
      "originalId": "s0016",
      "blockIndex": 3,
      "chinese": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
      "literal": "Divine Lord was the Changling woman, because child died grieved, therefore appeared as spirit to husband Yanruo.",
      "idiomatic": "The Divine Lord was a woman from Changling who, grieving over her dead child, appeared as a spirit to her husband Yanruo."
    },
    {
      "id": "3-s0017",
      "originalId": "s0017",
      "blockIndex": 3,
      "chinese": "宛若祠之其室，民多往祠。",
      "literal": "Yanruo sacrificed to her in his chamber, people often went to sacrifice.",
      "idiomatic": "Yanruo sacrificed to her in his chamber, and many people came to make offerings."
    },
    {
      "id": "3-s0018",
      "originalId": "s0018",
      "blockIndex": 3,
      "chinese": "平原君往祠，其後子孫以尊顯。",
      "literal": "Lord of Pingyuan went to sacrifice, afterwards descendants became honored eminent.",
      "idiomatic": "The Lord of Pingyuan went to make offerings, and thereafter his descendants became honored and eminent."
    },
    {
      "id": "3-s0019",
      "originalId": "s0019",
      "blockIndex": 3,
      "chinese": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
      "literal": "When Emperor Wu ascended throne, then treated with great ceremony placed shrine in the inner palace, heard her words, did not see her person, it is said.",
      "idiomatic": "When Emperor Wu ascended the throne, he treated her with great ceremony and placed her shrine in the inner palace. Her words could be heard, but her person was never seen, so it was said."
    },
    {
      "id": "4-s0020",
      "originalId": "s0020",
      "blockIndex": 4,
      "chinese": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
      "literal": "This time Li Shaojun also with stove sacrifice, grain immortality, ward off old age methods appeared before the emperor, emperor honored him.",
      "idiomatic": "At this time, Li Shaojun also appeared before the emperor with methods for sacrificing to the stove, grain immortality, and warding off old age, and the emperor honored him."
    },
    {
      "id": "4-s0021",
      "originalId": "s0021",
      "blockIndex": 4,
      "chinese": "少君者，故深澤侯入以主方。",
      "literal": "Shaojun was former Marquis of Shenze's son who entered as master of recipes.",
      "idiomatic": "Shaojun was the son of the former Marquis of Shenze who entered court as a master of recipes."
    },
    {
      "id": "4-s0022",
      "originalId": "s0022",
      "blockIndex": 4,
      "chinese": "匿其年及所生長，常自謂七十，能使物，卻老。",
      "literal": "He concealed his age and birthplace, constantly claimed seventy, could manipulate things, ward off old age.",
      "idiomatic": "He concealed his age and birthplace, constantly claiming to be seventy. He could manipulate things and ward off old age."
    },
    {
      "id": "4-s0023",
      "originalId": "s0023",
      "blockIndex": 4,
      "chinese": "其游以方遍諸侯。",
      "literal": "His travels with recipes went throughout feudal lords.",
      "idiomatic": "His travels with his recipes took him throughout the domains of the feudal lords."
    },
    {
      "id": "4-s0024",
      "originalId": "s0024",
      "blockIndex": 4,
      "chinese": "無妻子。",
      "literal": "Had no wife children.",
      "idiomatic": "He had neither wife nor children."
    },
    {
      "id": "4-s0025",
      "originalId": "s0025",
      "blockIndex": 4,
      "chinese": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
      "literal": "People heard of his ability to manipulate things and immortality, moreover gave him gifts, constantly had surplus gold money silk clothing food.",
      "idiomatic": "People heard of his ability to manipulate things and achieve immortality, and moreover gave him gifts. He constantly had surplus gold, money, silk, clothing, and food."
    },
    {
      "id": "4-s0026",
      "originalId": "s0026",
      "blockIndex": 4,
      "chinese": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
      "literal": "People all thought he did not manage property but was wealthy, moreover did not know where his income came from, became even more believing, competed to serve him.",
      "idiomatic": "Everyone thought that he did not manage any property yet was wealthy, and moreover did not know where his income came from. They became even more believing and competed to serve him."
    },
    {
      "id": "4-s0027",
      "originalId": "s0027",
      "blockIndex": 4,
      "chinese": "少君資好方，善為巧發奇中。",
      "literal": "Shaojun had natural talent for recipes, skilled at making clever discoveries miraculously hit mark.",
      "idiomatic": "Shaojun had a natural talent for recipes and was skilled at making clever discoveries that miraculously hit their mark."
    },
    {
      "id": "4-s0028",
      "originalId": "s0028",
      "blockIndex": 4,
      "chinese": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
      "literal": "Once followed Marquis of Wuan drinking, seats had an old man ninety remaining years, Shaojun then spoke of places roamed hunted with his grandfather, old man as child followed his grandfather went, recognized places, whole gathering completely astonished.",
      "idiomatic": "Once when he was drinking with the Marquis of Wuan, there was an old man of more than ninety years among the guests. Shaojun spoke of places where he had roamed and hunted with the old man's grandfather. The old man, recalling how he had followed his grandfather as a child, recognized the places. The entire gathering was completely astonished."
    },
    {
      "id": "4-s0029",
      "originalId": "s0029",
      "blockIndex": 4,
      "chinese": "少君見上，上有故銅器，問少君。",
      "literal": "Shaojun appeared before emperor, emperor had old bronze vessel, asked Shaojun.",
      "idiomatic": "Shaojun appeared before the emperor, who had an old bronze vessel and asked Shaojun about it."
    },
    {
      "id": "4-s0030",
      "originalId": "s0030",
      "blockIndex": 4,
      "chinese": "少君曰：「此器齊桓公十年陳於柏寢。」",
      "literal": "Shaojun said: \"This vessel Duke Huan of Qi tenth year displayed in the Cypress Chamber.\"",
      "idiomatic": "Shaojun said: 'This vessel was displayed in the Cypress Chamber by Duke Huan of Qi in his tenth year.'"
    }
  ]
}