{
  "metadata": {
    "book": "hanshu",
    "chapter": "016",
    "file": "data/hanshu/016.json"
  },
  "sentences": [
    {
      "id": "s849",
      "chinese": "沛元始元年，惞玄孫護以詔書為次復禹同產弟子，死，亡子，絕。",
      "literal": "Pei Yuanshi first year, Ma's great-great-grandson Hu with edict as next restored Yu's same mother's younger brother disciple, died, had no son, ended.",
      "idiomatic": "In Pei, Yuanshi's first year, Ma's great-great-grandson Hu was restored as next in line with an edict, as Yu's same mother's younger brother disciple. He died and had no son, so it ended."
    },
    {
      "id": "s850",
      "chinese": "安平敬侯鄂秋",
      "literal": "Anping Jing Hou E Qiu",
      "idiomatic": "Anping Jing Hou E Qiu"
    },
    {
      "id": "s851",
      "chinese": "以謁者漢王三年初從，定諸侯，有功秩，舉蕭何功，因故侯，二千戶。",
      "literal": "As ye zhe Han King third year initially followed, pacified lords, had merited rank, recommended Xiao He merit, because of old marquis, two thousand households.",
      "idiomatic": "As a ye zhe, he initially followed the Han King in the third year. He pacified the other lords and had merited rank. He recommended Xiao He's merits and became a marquis because of an old connection, with two thousand households."
    },
    {
      "id": "s852",
      "chinese": "八月甲子封，十二年薨。",
      "literal": "Eighth month Jia Zi day enfeoffed, twelfth year died.",
      "idiomatic": "Enfeoffed on the Jia Zi day of the eighth month; died in the twelfth year."
    },
    {
      "id": "s853",
      "chinese": "六十一",
      "literal": "Sixty-one",
      "idiomatic": "Sixty-one"
    },
    {
      "id": "s854",
      "chinese": "孝惠三年，簡侯嘉嗣，九年薨。",
      "literal": "Xiaohui third year, Jian Marquis Jia succeeded, ninth year died.",
      "idiomatic": "In Emperor Hui's third year, Jian Marquis Jia succeeded to the marquisate; died in the ninth year."
    },
    {
      "id": "s855",
      "chinese": "高后八年，頃侯應嗣，十四年薨。",
      "literal": "Gao Hou eighth year, Qing Marquis Ying succeeded, fourteenth year died.",
      "idiomatic": "In Empress Gao's eighth year, Qing Marquis Ying succeeded to the marquisate; died in the fourteenth year."
    },
    {
      "id": "s856",
      "chinese": "孝文十四年，煬侯寄嗣，二十五年薨。",
      "literal": "Xiaowen fourteenth year, Yang Marquis Ji succeeded, twenty-fifth year died.",
      "idiomatic": "In Emperor Wen's fourteenth year, Yang Marquis Ji succeeded to the marquisate; died in the twenty-fifth year."
    },
    {
      "id": "s857",
      "chinese": "孝景後三年，侯但嗣，十九年，元狩元年，坐與淮南王安通，遺王書稱臣盡力，棄市。",
      "literal": "Xiaojing Hou third year, Marquis Dan succeeded, nineteenth year, Yuanshou first year, convicted of communicating with Huainan King An, sending king letter calling himself subject exerting all strength, executed in market.",
      "idiomatic": "In Xiaojing Hou's third year, Marquis Dan succeeded to the marquisate; in the nineteenth year, during the first year of Yuanshou, he was convicted of communicating with Huainan King An and sending the king a letter calling himself a subject exerting all strength. He was executed in the marketplace."
    },
    {
      "id": "s862",
      "chinese": "六世元康四年，秋玄孫之子解大夫后詔復家。",
      "literal": "Sixth generation Yuankang fourth year, Qiu's great-great-grandson's son Xie Dafu Hou commanded to restore the family.",
      "idiomatic": "In the sixth generation, fourth year of Yuankang, Qiu's great-great-grandson's son, Xie Dafu Hou, was commanded to restore the family line."
    },
    {
      "id": "s866",
      "chinese": "北平文侯張蒼",
      "literal": "Beiping Wen Hou Zhang Cang",
      "idiomatic": "Beiping Wen Hou Zhang Cang"
    },
    {
      "id": "s867",
      "chinese": "以客從起武陽，至霸上，為常山守，得陳餘，為代相，徙趙相，以代相侯，為計相四歲，淮南相十四歲。千二百戶。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s868",
      "chinese": "八月丁丑封，五十年薨。",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s869",
      "chinese": "六十五",
      "literal": "",
      "idiomatic": ""
    },
    {
      "id": "s870",
      "chinese": "孝景六年，康侯奉嗣，八年薨。",
      "literal": "",
      "idiomatic": ""
    }
  ]
}