{
  "metadata": {
    "book": "shiji",
    "chapter": "025",
    "file": "data/shiji/025.json"
  },
  "sentences": [
    {
      "id": "6-s0016",
      "originalId": "s0016",
      "blockIndex": 6,
      "chinese": "百戰克勝，諸侯懾服，權非輕也。",
      "literal": "Hundred battles overcome victory, feudal lords awed submit, authority not light also.",
      "idiomatic": ""
    },
    {
      "id": "6-s0017",
      "originalId": "s0017",
      "blockIndex": 6,
      "chinese": "秦二世宿軍無用之地，連兵於邊陲，力非弱也；",
      "literal": "Qin Second Generation stationed army useless lands, connected weapons at borders, strength not weak also;",
      "idiomatic": ""
    },
    {
      "id": "6-s0018",
      "originalId": "s0018",
      "blockIndex": 6,
      "chinese": "結怨匈奴，絓禍於越，勢非寡也。",
      "literal": "Formed resentment Xiongnu, implicated calamity in Yue, influence not few also.",
      "idiomatic": ""
    },
    {
      "id": "6-s0019",
      "originalId": "s0019",
      "blockIndex": 6,
      "chinese": "及其威盡勢極，閭巷之人為敵國，咎生窮武之不知足，甘得之心不息也。",
      "literal": "Until their awe exhausted influence extreme, alley lane people became enemy states, blame born from exhausting martial not knowing sufficiency, sweet gain heart not cease also.",
      "idiomatic": ""
    },
    {
      "id": "7-s0020",
      "originalId": "s0020",
      "blockIndex": 7,
      "chinese": "高祖有天下，三邊外畔；",
      "literal": "Gaozu possessed realm, three borders external rebelled;",
      "idiomatic": ""
    },
    {
      "id": "7-s0021",
      "originalId": "s0021",
      "blockIndex": 7,
      "chinese": "大國之王雖稱蕃輔，臣節未盡。",
      "literal": "Great states kings though called screen auxiliaries, minister conduct not complete.",
      "idiomatic": ""
    },
    {
      "id": "7-s0022",
      "originalId": "s0022",
      "blockIndex": 7,
      "chinese": "會高祖厭苦軍事，亦有蕭、張之謀，故偃武一休息，羈縻不備。",
      "literal": "Met Gaozu tired bitter military affairs, also had Xiao, Zhang plans, therefore rested martial one rest, restraint bridle not complete.",
      "idiomatic": ""
    },
    {
      "id": "8-s0023",
      "originalId": "s0023",
      "blockIndex": 8,
      "chinese": "歷至孝文即位，將軍陳武等議曰：「南越、朝鮮自全秦時內屬為臣子，後且擁兵阻阸，選蠕觀望。",
      "literal": "Passed to Filial Wen ascended throne, General Chen Wu etc discussed saying: \"Nanyue, Chaoxian from complete Qin time internally belonged as minister children, later moreover held weapons blocked defiles, selected moved observed waited.\"",
      "idiomatic": ""
    },
    {
      "id": "8-s0024",
      "originalId": "s0024",
      "blockIndex": 8,
      "chinese": "高祖時天下新定，人民小安，未可復興兵。",
      "literal": "Gaozu time realm newly settled, people slightly peaceful, not able again raise weapons.",
      "idiomatic": ""
    },
    {
      "id": "8-s0025",
      "originalId": "s0025",
      "blockIndex": 8,
      "chinese": "今陛下仁惠撫百姓，恩澤加海內，宜及士民樂用，征討逆黨，以一封疆。」",
      "literal": "Now Your Majesty benevolent kind caress common people, grace moisture add realm within, should take advantage scholar people happy use, campaign attack rebellious faction, to unify borders.\"",
      "idiomatic": ""
    },
    {
      "id": "8-s0026",
      "originalId": "s0026",
      "blockIndex": 8,
      "chinese": "孝文曰：「朕能任衣冠，念不到此。",
      "literal": "Filial Wen said: \"I can bear the cap gown, thought not reach this.\"",
      "idiomatic": ""
    },
    {
      "id": "8-s0027",
      "originalId": "s0027",
      "blockIndex": 8,
      "chinese": "會呂氏之亂，功臣宗室共不羞恥，誤居正位，常戰戰慄慄，恐事之不終。",
      "literal": "Met Lü clan chaos, meritorious ministers clan relatives together not ashamed, mistakenly occupied correct positions, constantly trembling fearful, feared matters not end.",
      "idiomatic": ""
    },
    {
      "id": "8-s0028",
      "originalId": "s0028",
      "blockIndex": 8,
      "chinese": "且兵凶器，雖克所願，動亦秏病，謂百姓遠方何？",
      "literal": "Moreover weapons ominous tools, though overcome wished, move also consume illness, say common people distant places what?",
      "idiomatic": ""
    },
    {
      "id": "8-s0029",
      "originalId": "s0029",
      "blockIndex": 8,
      "chinese": "又先帝知勞民不可煩，故不以為意。",
      "literal": "Also former emperor knew tiring people not able trouble, therefore not considered it.",
      "idiomatic": ""
    },
    {
      "id": "8-s0030",
      "originalId": "s0030",
      "blockIndex": 8,
      "chinese": "朕豈自謂能？",
      "literal": "I how self say able?",
      "idiomatic": ""
    }
  ]
}