{
  "metadata": {
    "book": "shiji",
    "chapter": "026",
    "file": "data/shiji/026.json"
  },
  "sentences": [
    {
      "id": "9-s0046",
      "originalId": "s0046",
      "blockIndex": 9,
      "chinese": "事下丞相張蒼，張蒼亦學律歷，以為非是，罷之。",
      "literal": "Matter sent down to Chancellor Zhang Cang, Zhang Cang also studied pitchpipes calendar, considered not correct, dismissed it.",
      "idiomatic": ""
    },
    {
      "id": "9-s0047",
      "originalId": "s0047",
      "blockIndex": 9,
      "chinese": "其後黃龍見成紀，張蒼自黜，所欲論著不成。",
      "literal": "Their after yellow dragon appeared Chengji, Zhang Cang self demoted, what desired discuss write not complete.",
      "idiomatic": ""
    },
    {
      "id": "9-s0048",
      "originalId": "s0048",
      "blockIndex": 9,
      "chinese": "而新垣平以望氣見，頗言正歷服色事，貴幸，後作亂，故孝文帝廢不復問。",
      "literal": "And Xinyuan Ping was seen through observing qi, extensively spoke of correcting calendar and clothing colors matters, was noble and favored. Later he made rebellion, therefore Emperor Wen abandoned it and did not inquire again.",
      "idiomatic": ""
    },
    {
      "id": "10-s0049",
      "originalId": "s0049",
      "blockIndex": 10,
      "chinese": "至今上即位，招致方士唐都，分其天部；",
      "literal": "Until current emperor ascended throne, summoned fangshi Tang Du, divided their heaven divisions;",
      "idiomatic": ""
    },
    {
      "id": "10-s0050",
      "originalId": "s0050",
      "blockIndex": 10,
      "chinese": "而巴落下閎運算轉歷，然後日辰之度與夏正同。",
      "literal": "And Bafall Xiaohong operated calculated rotating calendar, then sun day degrees with Xia calendar same.",
      "idiomatic": ""
    },
    {
      "id": "10-s0051",
      "originalId": "s0051",
      "blockIndex": 10,
      "chinese": "乃改元，更官號，封泰山。",
      "literal": "Thereupon changed yuan, changed official titles, sealed Taishan.",
      "idiomatic": ""
    },
    {
      "id": "10-s0052",
      "originalId": "s0052",
      "blockIndex": 10,
      "chinese": "因詔御史曰：「乃者，有司言星度之未定也，廣延宣問，以理星度，未能詹也。",
      "literal": "Therefore commanded Censor said: \"Formerly, officials spoke star degrees not yet settled also, broadly extended announced asked, to reason star degrees, not able reach also.\"",
      "idiomatic": ""
    },
    {
      "id": "10-s0053",
      "originalId": "s0053",
      "blockIndex": 10,
      "chinese": "蓋聞昔者黃帝合而不死，名察度驗，定清濁，起五部，建氣物分數。",
      "literal": "Indeed heard formerly Yellow Emperor united and not died, named examined degree verified, settled clear turbid, raised five divisions, established qi things divisions numbers.",
      "idiomatic": ""
    },
    {
      "id": "10-s0054",
      "originalId": "s0054",
      "blockIndex": 10,
      "chinese": "然蓋尚矣。",
      "literal": "Yet indeed still remote.",
      "idiomatic": ""
    },
    {
      "id": "10-s0055",
      "originalId": "s0055",
      "blockIndex": 10,
      "chinese": "書缺樂弛，朕甚閔焉。",
      "literal": "Documents lacking music relaxed, I greatly pity there.",
      "idiomatic": ""
    },
    {
      "id": "10-s0056",
      "originalId": "s0056",
      "blockIndex": 10,
      "chinese": "朕唯未能循明也，紬績日分，率應水德之勝。",
      "literal": "I only have not been able to follow the bright way, continuing and refining the daily divisions, generally responding to the water virtue's victory.",
      "idiomatic": ""
    },
    {
      "id": "10-s0057",
      "originalId": "s0057",
      "blockIndex": 10,
      "chinese": "今日順夏至，黃鐘為宮，林鐘為徵，太蔟為商，南呂為羽，姑洗為角。",
      "literal": "Today follow summer solstice, Huangzhong as palace, Linzhong as zheng, Tai Cu as shang, Nan Lü as yu, Gu Xi as jiao.",
      "idiomatic": ""
    },
    {
      "id": "10-s0058",
      "originalId": "s0058",
      "blockIndex": 10,
      "chinese": "自是以後，氣復正，羽聲復清，名復正變，以至子日當冬至，則陰陽離合之道行焉。",
      "literal": "From this after, qi again correct, yu sound again clear, names again correct changes, until zi day when winter solstice, then yin yang separate combine way proceeds there.",
      "idiomatic": ""
    },
    {
      "id": "10-s0059",
      "originalId": "s0059",
      "blockIndex": 10,
      "chinese": "十一月甲子朔旦冬至已詹，其更以七年為太初元年。",
      "literal": "Eleventh month Jiazi new moon dawn winter solstice already reached, their change with seventh year as Tai Chu first year.",
      "idiomatic": ""
    },
    {
      "id": "10-s0060",
      "originalId": "s0060",
      "blockIndex": 10,
      "chinese": "年名『焉逢攝提格』，月名『畢聚』，日得甲子，夜半朔旦冬至。」",
      "literal": "Year named 'Yanfeng Shetige', month named 'Biju', day got Jiazi, midnight new moon dawn winter solstice.\"",
      "idiomatic": ""
    }
  ]
}