{
  "metadata": {
    "book": "shiji",
    "chapter": "043",
    "file": "data/shiji/043.json"
  },
  "sentences": [
    {
      "id": "s0244",
      "chinese": "范、中行餘邑入于晉。",
      "literal": "The remaining cities of Fan and Zhonghang entered Jin.",
      "idiomatic": "The remaining cities of Fan and Zhonghang came under Jin's control."
    },
    {
      "id": "s0245",
      "chinese": "趙名晉卿，實專晉權，奉邑侔於諸侯。",
      "literal": "Zhao was nominally a Jin minister, but actually monopolized Jin's authority. His fief cities equaled those of feudal lords.",
      "idiomatic": "Zhao was nominally a Jin minister, but in reality monopolized Jin's power. His fiefs equaled those of the feudal lords."
    },
    {
      "id": "s0246",
      "chinese": "晉定公三十年，定公與吳王夫差爭長於黃池，趙簡子從晉定公，卒長吳。",
      "literal": "In the thirtieth year of Duke Ding of Jin, Ding Gong contended for precedence with King Fu Chai of Wu at Huang Chi. Zhao Jian Zi followed Jin Ding Gong and finally gave precedence to Wu.",
      "idiomatic": "In Duke Ding of Jin's thirtieth year, Ding Gong contended for precedence with King Fu Chai of Wu at Huang Chi. Zhao Jian Zi followed Duke Ding and finally yielded precedence to Wu."
    },
    {
      "id": "s0247",
      "chinese": "定公三十七年卒，而簡子除三年之喪，期而已。",
      "literal": "Ding Gong died in the thirty-seventh year. Jian Zi removed the three-year mourning period and made it only one year.",
      "idiomatic": ""
    },
    {
      "id": "s0248",
      "chinese": "是歲，越王句踐滅吳。",
      "literal": "This year, King Gou Jian of Yue extinguished Wu.",
      "idiomatic": ""
    },
    {
      "id": "s0249",
      "chinese": "晉出公十一年，知伯伐鄭。",
      "literal": "In the eleventh year of Duke Chu of Jin, Zhi Bo attacked Zheng.",
      "idiomatic": ""
    },
    {
      "id": "s0250",
      "chinese": "趙簡子疾，使太子毋卹將而圍鄭。",
      "literal": "Zhao Jian Zi was ill and sent Crown Prince Wu Zhi to lead the army and surround Zheng.",
      "idiomatic": ""
    },
    {
      "id": "s0251",
      "chinese": "知伯醉，以酒灌擊毋卹。",
      "literal": "Zhi Bo was drunk and poured wine while striking Wu Zhi.",
      "idiomatic": ""
    },
    {
      "id": "s0252",
      "chinese": "毋卹群臣請死之。",
      "literal": "Wu Zhi's group of ministers requested to die for him.",
      "idiomatic": ""
    },
    {
      "id": "s0254",
      "chinese": "然亦慍知伯。",
      "literal": "Yet he also resented Zhi Bo.",
      "idiomatic": ""
    },
    {
      "id": "s0255",
      "chinese": "知伯歸，因謂簡子，使廢毋卹，簡子不聽。",
      "literal": "Zhi Bo returned and then told Jian Zi to depose Wu Zhi. Jian Zi did not listen.",
      "idiomatic": ""
    },
    {
      "id": "s0256",
      "chinese": "毋卹由此怨知伯。",
      "literal": "Wu Zhi from this resented Zhi Bo.",
      "idiomatic": ""
    },
    {
      "id": "s0257",
      "chinese": "晉出公十七年，簡子卒，太子毋卹代立，是為襄子。",
      "literal": "In the seventeenth year of Duke Chu of Jin, Jian Zi died. Crown Prince Wu Zhi succeeded and was established. This was Xiang Zi.",
      "idiomatic": ""
    },
    {
      "id": "s0258",
      "chinese": "趙襄子元年，越圍吳。",
      "literal": "In Zhao Xiang Zi's first year, Yue surrounded Wu.",
      "idiomatic": ""
    },
    {
      "id": "s0259",
      "chinese": "襄子降喪食，使楚隆問吳王。",
      "literal": "Xiang Zi reduced his mourning food and sent Chu Long to inquire about the Wu Wang.",
      "idiomatic": ""
    }
  ]
}