{
  "metadata": {
    "book": "shiji",
    "chapter": "024",
    "file": "data/shiji/024.json"
  },
  "sentences": [
    {
      "id": "29-s0242",
      "originalId": "s0242",
      "blockIndex": 29,
      "chinese": "凡姦聲感人而逆氣應之，逆氣成象而淫樂興焉。",
      "literal": "All wicked sounds move people and perverse qi responds to them, perverse qi forms images and licentious music arises there.",
      "idiomatic": ""
    },
    {
      "id": "29-s0243",
      "originalId": "s0243",
      "blockIndex": 29,
      "chinese": "正聲感人而順氣應之，順氣成象而和樂興焉。",
      "literal": "Correct sounds move people and compliant qi responds to them, compliant qi forms images and harmonious music arises there.",
      "idiomatic": ""
    },
    {
      "id": "29-s0244",
      "originalId": "s0244",
      "blockIndex": 29,
      "chinese": "倡和有應，回邪曲直各歸其分，而萬物之理以類相動也。",
      "literal": "Leading and following have response, returning deviant curved straight each return to their portion, and ten thousand things' principle move each other by kind.",
      "idiomatic": ""
    },
    {
      "id": "30-s0245",
      "originalId": "s0245",
      "blockIndex": 30,
      "chinese": "是故君子反情以和其志，比類以成其行。",
      "literal": "Therefore gentlemen return to emotion to harmonize their will, compare kinds to complete their conduct.",
      "idiomatic": ""
    },
    {
      "id": "30-s0246",
      "originalId": "s0246",
      "blockIndex": 30,
      "chinese": "姦聲亂色不留聰明，淫樂廢禮不接於心術，惰慢邪辟之氣不設於身體，使耳目鼻口心知百體皆由順正，以行其義。",
      "literal": "Wicked sounds chaotic colors do not detain intelligence, licentious music abandons ritual does not connect to heart methods, lazy lax heretical deviant qi not established in the body; make ears eyes nose mouth heart knowing hundred bodies all follow orderly correctness, to carry out their righteousness.",
      "idiomatic": ""
    },
    {
      "id": "30-s0247",
      "originalId": "s0247",
      "blockIndex": 30,
      "chinese": "然後發以聲音，文以琴瑟，動以干戚，飾以羽旄，從以簫管，奮至德之光，動四氣之和，以著萬物之理。",
      "literal": "Then express with sound and tone, pattern with zither and se, move with shield and axe, adorn with feather banners, follow with flute pipes; arouse supreme virtue's light, move four qi harmony, to manifest ten thousand things' principle.",
      "idiomatic": ""
    },
    {
      "id": "30-s0248",
      "originalId": "s0248",
      "blockIndex": 30,
      "chinese": "是故清明象天，廣大象地，終始象四時，周旋象風雨；",
      "literal": "Therefore clear brightness imitates heaven, vast greatness imitates earth, beginning and end imitate four seasons, circling imitates wind and rain;",
      "idiomatic": ""
    },
    {
      "id": "30-s0249",
      "originalId": "s0249",
      "blockIndex": 30,
      "chinese": "五色成文而不亂，八風從律而不姦，百度得數而有常；",
      "literal": "Five colors form patterns and are not chaotic, eight winds follow laws and are not wicked, hundred measures obtain numbers and have constancy;",
      "idiomatic": ""
    },
    {
      "id": "30-s0250",
      "originalId": "s0250",
      "blockIndex": 30,
      "chinese": "小大相成，終始相生，倡和清濁，代相為經。",
      "literal": "Small and great mutually complete, beginning and end mutually give birth, leading following clear turbid, alternating become canons.",
      "idiomatic": ""
    },
    {
      "id": "30-s0251",
      "originalId": "s0251",
      "blockIndex": 30,
      "chinese": "故樂行而倫清，耳目聰明，血氣和平，移風易俗，天下皆寧。",
      "literal": "Therefore when music proceeds relationships are clear, ears and eyes intelligent, blood qi peaceful, shift winds change customs, all under heaven peaceful.",
      "idiomatic": ""
    },
    {
      "id": "30-s0252",
      "originalId": "s0252",
      "blockIndex": 30,
      "chinese": "故曰「樂者樂也」。",
      "literal": "Therefore it is said 'Music is joy.'",
      "idiomatic": ""
    },
    {
      "id": "30-s0253",
      "originalId": "s0253",
      "blockIndex": 30,
      "chinese": "君子樂得其道，小人樂得其欲。",
      "literal": "Gentlemen take joy in obtaining their way, small people take joy in obtaining their desires.",
      "idiomatic": ""
    },
    {
      "id": "30-s0254",
      "originalId": "s0254",
      "blockIndex": 30,
      "chinese": "以道制欲，則樂而不亂；",
      "literal": "Using way to control desires, then joyful but not chaotic;",
      "idiomatic": ""
    },
    {
      "id": "30-s0255",
      "originalId": "s0255",
      "blockIndex": 30,
      "chinese": "以欲忘道，則惑而不樂。",
      "literal": "Using desires to forget way, then confused and not joyful.",
      "idiomatic": ""
    },
    {
      "id": "30-s0256",
      "originalId": "s0256",
      "blockIndex": 30,
      "chinese": "是故君子反情以和其志，廣樂以成其教，樂行而民鄉方，可以觀德矣。",
      "literal": "Therefore gentlemen return to emotion to harmonize their will, broaden music to complete their teachings; when music proceeds and people face the square, virtue can be observed.",
      "idiomatic": ""
    }
  ]
}