{
  "s0602": "Gao Xin immediately fought with the king.",
  "s0603": "Prince Cheng and Li Dui came from the state, then raised the four yi troops to enter and resist the difficulty, killed Prince Zhang and Tian Bu Li, extinguished their party traitors and stabilized the royal house.",
  "s0604": "Prince Cheng became chancellor, styled Anping Jun, Li Dui became judicial minister.",
  "s0605": "After Prince Zhang's defeat, he fled to the Chief Father, the Chief Father wanted to pardon him, Cheng and Dui then surrounded the Chief Father's palace.",
  "s0606": "Prince Zhang died, Prince Cheng and Li Dui plotted: 'Because of Zhang we surrounded the Chief Father, if we withdraw troops, we will be exterminated.'",
  "s0607": "So they continued to surround the Chief Father.",
  "s0608": "Ordered palace people 'those who come out later will be exterminated', palace people all came out.",
  "s0609": "Chief Father wanted to come out but could not, also could not get food, reached for sparrows and ate them, after three months more starved to death in Sha Qiu palace.",
  "s0610": "After Chief Father was definitely dead, then announced mourning and notified the feudal lords.",
  "s0611": "At this time the king was young, Cheng and Dui monopolized government, feared execution, therefore surrounded Chief Father.",
  "s0612": "Chief Father initially made eldest son Zhang crown prince, later obtained Wu Wa, loved her, for several years would not come out, gave birth to son Zi He, then deposed crown prince Zhang and established Zi He as king.",
  "s0613": "Wu Wa died, love ceased, pitied former crown prince, wanted to have two kings, hesitated undecided, therefore rebellion arose, leading to father and son both dying, becoming the world's laughingstock, was this not painful!",
  "s0614": "(Chief Father died Hui Wen Wang ascended) Fifth year, traded Yan Dan and Yi.",
  "s0615": "Eighth year, walled Nan Xing Tang.",
  "s0616": "Ninth year, Zhao Liang led, together with Qi combined army attacked Han, reached Lu Guan below.",
  "s0617": "By tenth year, Qin established himself as Western Emperor."
}
