{
  "s266": "Xin Yuan Ping falsely spoke of fang shi, aware, executed him.",
  "s273": "Fifteenth month. Eighth month Geng Wu, Imperial Secretary Grandee Shen Tu Jia became chancellor, enfeoffed Gu An Hou.",
  "s298": "Used Interior Grandee Ling Mian as Chariot Cavalry General, army Fei Hu, former Chu chancellor Su Yi as general, army Gou Zhu; general Zhang Wu garrisoned Bei Di; He Nei governor Zhou Ya Fu as general, army Xi Liu; Zong Zheng Liu Li army Ba Shang; Zhu Zi Hou Xu Li army Ji Men: to prepare for Hu. Several months, Hu withdrew, also abolished.",
  "s302": "Sixth month Ji Hai, Xiao Wen emperor collapsed. Ding Wei, crown prince established. People went out to mourn three days, buried at Ba Ling.",
  "s304": "Commandant Ya Fu as Chariot Cavalry General, Lang Zhong Ling Zhang Wu as Restore Earth General, Shu Guo Han as Garrison General. Jian Shi Rong Nu as Chariot Cavalry General, served Tai Hou.",
  "s512": "Tenth month, Huai Nan Wang An, Heng Shan Wang Ci plotted rebellion, all suicide, states eliminated.",
  "s537": "Four. Crown prince Junior Tutor Wu Qiang Hou Zhuang Qing Di became chancellor.",
  "s542": "Fourth month Yi Si, imperial son Hong became Qi Wang, Dan became Yan Wang, Xu became Guang Ling Wang.",
  "s554": "Qing Di had crime, suicide.",
  "s566": "Established Chang Shan Xian Wang Zi Ping as Zhen Ding Wang, Shang as Si Shui Wang. Sixth month middle, He Dong Fen Yin got precious ding.",
  "s572": "Third month middle, Nan Yue chancellor Jia rebelled, assassinated their wang and Han envoy. Eighth month, Zhou sat on brewing gold, suicide.",
  "s573": "Four. Ninth month Xin Si, Imperial Secretary Grandee Shi Qing became chancellor, enfeoffed Mu Qiu Hou.",
  "s574": "Wei Wei Lu Bo De became Fu Bo General, went out Gui Yang; Lord of Fiefdom Yang Pu became Lou Ship General, went out Yu Zhang: all broke Nan Yue.",
  "s580": "Former Long Bang Hou Han Yue became Heng Hai General, went out Hui Ji; Lou Ship General Yang Pu went out Yu Zhang; Commandant Wang Wen Shu went out Hui Ji: all broke Dong Yue.",
  "s583": "Yuan Feng first year.",
  "s592": "Autumn, Lou Ship General Yang Pu, Left General Xun Zhi went out Liao Dong, struck Chao Xian.",
  "s619": "Tai Chu first year",
  "s627": "Ten. Third month Ding Mao, Grand Usher Gong Sun He became chancellor, enfeoffed Ge Yi Hou.",
  "s664": "Spring, Er Shi General Li Guang Li went out Shuo Fang, reached Yu Wu Shui; Roaming Strike General Han Yue went out Wu Yuan; Yin Zhu General Gong Sun Ao: all struck Xiongnu."
}
