{
  "s996": "Eleven. Wei, Han, Zhao extinguished Jin, ended without descendants.",
  "s1222": "Eight. Shen Bu Hai became chancellor.",
  "s1229": "Twelve. First gathered small yi to make thirty-one xian, ordered. For fields opened qian mo.",
  "s1301": "Twenty. Feudal lords all congratulated. Met feudal lords at Ze. Court the Son of Heaven.",
  "s1316": "Two. Defeated Wei at Ma Ling. Tian Ji, Tian Ying, Tian Chou led, Sun Zi became teacher.",
  "s1337": "Twenty-four. (Qin) Da Li besieged He Yang. Xiao Gong died. Shang Jun rebelled, died at Tong Di.",
  "s1529": "Nine. Struck Qin with Han, Wei. Qi defeated us at Guan Ze.",
  "s1554": "Five. Qin pulled our Qu Wo, returned its people. Xi Shou fled to An Men.",
  "s1562": "Twelve. Chu Li Zi struck Lin Yang, captured Zhao general. Gong Zi You through enfeoffment Shu.",
  "s1572": "Seven. Struck Qi, captured Sheng Zi at Pu. Struck Yan with Qin.",
  "s1833": "Thirteen. Qin pulled our An Cheng, troops reached Da Liang then returned.",
  "s1859": "Twenty-seven. Struck Zhao, beheaded thirty thousand. Earth shook, damaged city.",
  "s1863": "Nineteen. Qin struck us, gave Qin Han Bei and Shang Yong land.",
  "s1877": "Twenty-nine. Bai Qi struck Chu, pulled Ying, then east to Jing Ling, made Nan Jun.",
  "s1881": "Twenty-one. Qin pulled our Ying, burned Yi Ling, wang fled went to Chen.",
  "s1905": "Two. Qin pulled our two cities, army under Da Liang, Han came to rescue, made peace with Qin at Wen.",
  "s1997": "Zhao Xiao Cheng Wang first year. Qin pulled our three cities. Ping Yuan Jun chancellor.",
  "s2246": "Ten. Chancellor Lu Bu Wei dismissed. Qi, Zhao came, set up wine. Tai Hou entered Xian Yang. Great search.",
  "s2255": "Eleven. Lu Bu Wei of He Nan. Wang Jian struck Ye, Yan Yu, took nine cities.",
  "s2264": "Twelve. Sent four jun troops assisted Wei struck Chu. Lu Bu Wei died. Again restored Lao Ai retainers moved Shu.",
  "s2273": "Thirteen. Huan Yi struck Ping Yang, killed Zhao Hu Zhe, beheaded one hundred thousand, then east struck. Zhao Wang of He Nan. Comet appeared.",
  "s2276": "Two. Qin pulled our Ping Yang, defeated Hu Zhe, . beheaded one hundred thousand.",
  "s2307": "Seventeen. Attacked Han, took Yang Cheng, Fu Shu. Broke Zhao army.",
  "s2313": "Seventeen. Han Wang gave land submitted seal, requested to be vassal minister, sent Han Fei to visit. Qin people detained Fei, then killed him.",
  "s2318": "Eighteen. Han Fei envoy to Qin, Qin killed Fei.",
  "s2322": "Nineteen. Huan Yi attacked Zhao, defeated Zhao army at Ping Yang.",
  "s2342": "Twenty-two. Wang Jian attacked Chu, took Chen south to Ping Yu.",
  "s2346": "Fourteen. Qin pulled our Chen south to Ping Yu.",
  "s2360": "Twenty-four. Wang Jian attacked Chu, broke Chu army, beheaded thirty thousand.",
  "s2372": "Thirty-four. Qin took our Yan Ying."
}
