{
  "s0001": "Prince Xiao of Liang, Liu Wu, was a son of Emperor Xiaowen, and shared the same mother as Emperor Xiaojing.",
  "s0002": "Their mother was Empress Dowager Dou.",
  "s0003": "Emperor Xiaowen had four sons altogether: the eldest son was the Crown Prince, who became Emperor Xiaojing;",
  "s0004": "the second son was Wu;",
  "s0005": "the third son was Shen;",
  "s0006": "the fourth son was Sheng.",
  "s0007": "Emperor Xiaowen ascended the throne in year 2, enfeoffing Wu as King of Dai, Shen as King of Taiyuan, Sheng as King of Liang.",
  "s0008": "Two years later, he transferred the King of Dai to be King of Huaiyang.",
  "s0009": "He gave all of Dai to the King of Taiyuan, who was then titled King of Dai.",
  "s0010": "Shen reigned seventeen years, died in the second year after Xiaowen, posthumous title King Xiao.",
  "s0011": "His son Deng succeeded him, becoming King Gong of Dai.",
  "s0012": "He reigned twenty-nine years, died in Yuanguang year 2.",
  "s0013": "His son Yi succeeded him, becoming King of Dai.",
  "s0014": "Nineteen years later, Han expanded the passes, using Changshan as the boundary, and transferred the King of Dai to rule Qinghe.",
  "s0015": "The King of Qinghe's transfer was in Yuanding year 3.",
  "s0016": "Initially, Wu served as King of Huaiyang for ten years, while the King of Liang Sheng died, posthumous title King Huai of Liang.",
  "s0017": "King Huai was the youngest son, loved and favored differently from the other sons.",
  "s0018": "The next year, he transferred the King of Huaiyang Wu to be King of Liang.",
  "s0019": "The King of Liang's first enfeoffment in Liang was in Emperor Xiaowen's twelfth year.",
  "s0020": "The King of Liang, from his initial enfeoffment to now, had experienced eleven years.",
  "s0021": "In the King of Liang's fourteenth year, he entered court.",
  "s0022": "In years seventeen and eighteen, he entered court consecutively, remained, and only the next year returned to his fief.",
  "s0023": "In year twenty-one, he entered court.",
  "s0024": "In year twenty-two, Emperor Xiaowen passed away.",
  "s0025": "In year twenty-four, he entered court.",
  "s0026": "In year twenty-five, he entered court again.",
  "s0027": "At this time the emperor had not yet established a crown prince.",
  "s0028": "The emperor and the King of Liang were feasting, and once casually said: 'After a thousand autumns and ten thousand years I will pass it to the king.'",
  "s0029": "The king declined politely.",
  "s0030": "Though he knew these were not serious words, in his heart he was inwardly pleased.",
  "s0031": "The empress dowager was the same.",
  "s0032": "That spring, Wu, Chu, Qi, and Zhao—the seven kingdoms—rebelled.",
  "s0033": "Wu and Chu first attacked Liang's Ji Wall, killing tens of thousands.",
  "s0034": "Prince Xiao of Liang defended the city of Suiyang, and sent Han Anguo, Zhang Yu and others as grand generals to resist Wu and Chu.",
  "s0035": "Wu and Chu used Liang as their limit, dared not cross west, and confronted Grand Commandant Yafu and others for three months.",
  "s0036": "Wu and Chu were defeated, and Liang's captured, killed, and plundered was shared equally with Han.",
  "s0037": "The next year, Han established the crown prince.",
  "s0038": "Afterwards Liang was closest, had merit, was also a great kingdom, occupying the fertile lands of the realm.",
  "s0039": "Its territory bordered Mount Tai in the north, reached Gaoyang in the west, over forty cities, all with many large counties.",
  "s0040": "Prince Xiao was Empress Dowager Dou's youngest son, she loved him, rewards and grants beyond counting.",
  "s0041": "Thus Prince Xiao built the Eastern Park, covering over three hundred li square.",
  "s0042": "He expanded Suiyang city seventy li.",
  "s0043": "He greatly constructed palaces, built covered walkways connecting from the palace to the Platform for over thirty li.",
  "s0044": "He received the emperor's banners and flags as grants, went out followed by a thousand chariots and ten thousand cavalry.",
  "s0045": "He galloped hunting east and west, comparable to the Son of Heaven.",
  "s0046": "When going out he used 'clear the way,' when entering he used 'be alert.'",
  "s0047": "He recruited and welcomed heroes and outstanding men from the four directions, wandering persuaders from east of the mountains.",
  "s0048": "None failed to arrive completely—men from Qi like Yang Sheng, Gongsun Gui, Zou Yang and such.",
  "s0049": "Gongsun Gui had many strange and crooked schemes, first meeting the king, granted a thousand jin, office reaching Commandant of the Guards, Liang titled him General Gongsun, Liang made many weapons—crossbows, bows, spears—several tens of thousands, while the treasury had gold and cash nearly a hundred million, pearls, jade, and precious objects more than the capital.",
  "s0050": "In year twenty-nine, tenth month, Prince Xiao of Liang entered court."
}