{
  "s0001": "Guan Zhong, whose courtesy name was Yi Wu, was a man of Ying Shang.",
  "s0002": "In his youth he often traveled with Bao Shu Ya, Bao Shu knew his worth.",
  "s0003": "Guan Zhong was impoverished, often deceived Bao Shu, Bao Shu in the end treated him well, did not take it amiss.",
  "s0004": "Soon after Bao Shu served Qi prince Xiao Bai, Guan Zhong served prince Jiu.",
  "s0005": "When Xiao Bai established as Duke Huan, prince Jiu died, Guan Zhong was imprisoned.",
  "s0006": "Bao Shu then recommended Guan Zhong.",
  "s0007": "Guan Zhong having been employed, took charge of government in Qi, Duke Huan of Qi became hegemon, nine times assembled the feudal lords, once set the world in order, it was Guan Zhong's strategy.",
  "s0008": "Guan Zhong said: 'When I first was in difficulty, I once traded with Bao Shu, divided profits took much for myself, Bao Shu did not consider me greedy, knew I was poor.",
  "s0009": "I once planned affairs for Bao Shu and became even more impoverished, Bao Shu did not consider me foolish, knew there are times of advantage and disadvantage.",
  "s0010": "I once served three times and three times was dismissed by lords, Bao Shu did not consider me unworthy, knew I did not meet the times.",
  "s0011": "I once fought three times and fled three times, Bao Shu did not consider me cowardly, knew I had an aged mother.",
  "s0012": "Prince Jiu was defeated, Zhao Hu died for him, I was imprisoned and humiliated, Bao Shu did not consider me shameless, knew I was not ashamed of small humiliations but ashamed that merit and fame would not be displayed in the world.'",
  "s0013": "Those who gave birth to me are my parents, the one who knows me is Bao Zi.'",
  "s0015": "Bao Shu having recommended Guan Zhong, humbled himself below him.",
  "s0016": "His descendants received hereditary stipends in Qi, those with fiefs numbered over ten generations, always were famous grand officers.",
  "s0017": "The world does not praise Guan Zhong's worthiness so much as praises Bao Shu's ability to recognize people.",
  "s0018": "Guan Zhong having taken charge of government as prime minister of Qi, with tiny Qi by the seacoast, circulated wealth accumulated riches, enriched the state strengthened the army, shared likes and dislikes with the customs.",
  "s0019": "Therefore his saying: 'Granaries full then know ritual and propriety, clothing and food sufficient then know honor and shame, superiors observe standards then the six relatives are secure.",
  "s0020": "The four cardinal principles not upheld, the state then perishes.",
  "s0021": "Issue orders like the source of flowing water, orders follow the people's hearts.'"
}