{
  "s0152": "Emperor Jing year 3, Wu and Chu rebelled.",
  "s0153": "Yafu as Commandant of the Guards became Grand Commandant, east attacked Wu and Chu.",
  "s0154": "Thus personally requested the emperor saying: 'Chu troops are fierce and swift, difficult to contend with directly.",
  "s0155": "Wish to entrust Liang to them, cut off their grain routes, then can control them.'",
  "s0156": "The emperor permitted it.",
  "s0157": "The Grand Commandant having assembled troops at Xingyang, Wu was attacking Liang, Liang was urgent, requested rescue.",
  "s0158": "The Grand Commandant led troops northeast to Changyi, entrenched deeply and defended.",
  "s0159": "Liang daily sent envoys to request the Grand Commandant, the Grand Commandant held to what was advantageous, would not go.",
  "s0160": "Liang submitted a memorial to Emperor Jing, Emperor Jing sent envoys to decree rescue Liang.",
  "s0161": "The Grand Commandant did not obey the decree, firmly entrenched without going out, but sent light cavalry general Gonggao Hou and others to cut off Wu and Chu troops' rear grain routes.",
  "s0162": "Wu troops lacked grain, hungry, several times wished to challenge, ultimately did not come out.",
  "s0163": "At night, the army was alarmed, internally attacked each other in confusion, reaching the Grand Commandant's tent.",
  "s0164": "The Grand Commandant lay still without rising.",
  "s0165": "After a moment, again settled.",
  "s0166": "Later Wu fled toward the southeast corner of the wall, the Grand Commandant had them prepare northwest.",
  "s0167": "Soon their elite troops indeed fled northwest, could not enter.",
  "s0168": "Wu troops having starved, then led away.",
  "s0169": "The Grand Commandant sent out elite troops to pursue and strike, greatly broke them.",
  "s0170": "Wu King Bi abandoned his army, and with several thousand strong men fled and ran, defended in Jiangnan Dantu.",
  "s0171": "Han troops thus took advantage of victory, completely captured them, surrendered their troops, offered thousand jin bounty for Wu King.",
  "s0172": "More than a month, Yue people beheaded Wu King to report.",
  "s0173": "Altogether attacked and defended three months, Wu and Chu were broken and pacified.",
  "s0174": "Thus the generals considered the Grand Commandant's strategy correct.",
  "s0175": "From this Liang Xiaowang had resentment toward the Grand Commandant.",
  "s0176": "Returned, again established the Grand Commandant office.",
  "s0177": "Five years, promoted to chancellor, Emperor Jing greatly valued him.",
  "s0178": "Emperor Jing deposed Crown Prince Li, the chancellor firmly contended against it, could not prevail.",
  "s0179": "Emperor Jing from this distanced him.",
  "s0180": "Moreover Liang Xiaowang each court audience, often spoke of Marquis Tiao's faults to the empress dowager.",
  "s0181": "Empress Dowager Dou said: 'The queen's elder brother Wang Xin can be made marquis.'",
  "s0182": "Emperor Jing declined saying: 'Originally Nanpi and Zhangwu marquises the late emperor did not make marquises, when I ascended the throne then made them marquises.",
  "s0183": "Xin has not yet received enfeoffment.'",
  "s0184": "Empress Dowager Dou said: 'Rulers each act according to their time.",
  "s0185": "From when Dou Changjun was alive, ultimately could not become marquis, after death then [enfeoffed] his son Pengzu and he became marquis.",
  "s0186": "I greatly resent it.",
  "s0187": "Your majesty quickly make Xin marquis!'",
  "s0188": "Emperor Jing said: 'Please allow me to discuss with the chancellor.'",
  "s0189": "Discussed with the chancellor, Yafu said: 'Gaozu's covenant \"non-Liu clan may not become kings, without merit may not become marquises.",
  "s0190": "If not follow the covenant, the realm together will attack them\".'",
  "s0191": "Now Xin though queen's elder brother, without merit, make him marquis, not follow the covenant.'",
  "s0192": "Emperor Jing was silent and stopped.",
  "s0193": "Afterwards Xiongnu kings [Wei] Xu Lu and others five people surrendered, Emperor Jing wished to make them marquises to encourage later surrenders.",
  "s0194": "Chancellor Yafu said: 'They betrayed their lord and surrendered to your majesty, your majesty makes them marquises, then how to blame ministers who do not maintain loyalty?'",
  "s0195": "Emperor Jing said: 'The chancellor's counsel cannot be used.'",
  "s0196": "Thus all enfeoffed [Wei] Xu Lu and others as nobles.",
  "s0197": "Yafu thus pleaded illness.",
  "s0198": "Emperor Jing middle year 3, because of illness dismissed from chancellor.",
  "s0199": "Shortly after, Emperor Jing resided in the inner palace, summoned Marquis Tiao, granted food.",
  "s0200": "Alone placed a large joint of meat, no knife for cutting, also did not place chopsticks.",
  "s0201": "Marquis Tiao's heart was not at peace, turned and told the food attendant to get chopsticks."
}