{
  "s0151": "The Duke of Zhou heard it, advanced and saw saying: 'The Heavenly King enfeoffs his younger brother, very good.'",
  "s0152": "King Cheng said: 'I was just playing with him.'",
  "s0153": "The Duke of Zhou said: 'A ruler has no erroneous actions, should not have joking words—words spoken must be carried out.'",
  "s0154": "Thus he enfeoffed the young brother with Ying county.",
  "s0155": "After this King Cheng to the end of his life dared not have joking words, words spoken must be carried out.",
  "s0156": "The Classic of Filial Piety says: 'Do not speak what is not according to law, do not act what is not according to the Way.'",
  "s0157": "This is the legal words of the sages.",
  "s0158": "Now the sovereign should not speak favorable words to the King of Liang.",
  "s0159": "The King of Liang above has the empress dowager's weight, arrogant and willful for a long time, repeatedly heard Emperor Jing's favorable words that after a thousand autumns and ten thousand years he would pass to the king, yet in reality not carried out.",
  "s0160": "Moreover feudal lords' kings attending court to see the Son of Heaven, Han law generally should be four audiences.",
  "s0161": "First arrival, enter for small audience;",
  "s0162": "Arrive at New Year's first dawn, present leather and recommend jade discs to congratulate New Year, formal audience;",
  "s0163": "Three days later, set wine for the king, grant gold money and valuables;",
  "s0164": "Two days later, again enter for small audience, take leave and depart.",
  "s0165": "Altogether remaining in Chang'an not over twenty days.",
  "s0166": "Small audience means banquet meeting within the forbidden gates, drinking in the administration quarters, not where scholars can enter.",
  "s0167": "Now the King of Liang comes west to court, thus stays, nearly half a year.",
  "s0168": "Entering rides in the same chariot as the ruler, going out rides in the same carriage.",
  "s0169": "Shows a precedent with great words yet in reality does not give, causes resentful words to come out, plots rebellion and reversal, then follows to worry about it—isn't this far-reaching!",
  "s0170": "If not a great worthy person, does not know yielding and retreating.",
  "s0171": "Now Han's ritual law, those attending court and congratulating New Year, normally one king with four marquises together attend court, once every ten or more years.",
  "s0172": "Now the King of Liang constantly attends court consecutively, stays long.",
  "s0173": "The vulgar saying goes 'spoiled son is unfilial', not evil words.",
  "s0174": "Therefore feudal kings should be given good tutors and chancellors, loyal speaking officials, like Ji An, Han Changru and such, who dare to speak directly and remonstrate extremely—how can there be calamity and harm!",
  "s0175": "I heard that the King of Liang entered west to court, greeted Empress Dowager Dou, banquet meeting, together with Emperor Jing served and sat before the empress dowager, private language pleased.",
  "s0176": "The empress dowager told the emperor: 'I heard Yin way loves relatives, Zhou way honors superiors, their meanings are one.",
  "s0177": "Peaceful carriage great procession, use Prince Xiao of Liang as the heir.'",
  "s0178": "Emperor Jing knelt on the mat and raised his body saying: 'Yes.'",
  "s0179": "Finished the wine and went out, the emperor summoned Yuan Ang and various ministers versed in classics saying: 'The empress dowager speaks like this, what does it mean?'",
  "s0180": "All replied: 'The empress dowager intends to establish the King of Liang as imperial crown prince.'",
  "s0181": "The emperor asked the circumstances, Yuan Ang and others said: 'Yin way loves relatives establishes younger brother.",
  "s0182": "Zhou way honors superiors establishes son.",
  "s0183": "Yin way substantial, substantial follows Heaven, loves those close to it, thus establishes younger brother.",
  "s0184": "Zhou way cultured, cultured follows Earth, honor means respect, respects its origin, thus establishes eldest son.",
  "s0185": "Zhou way, crown prince dies, establishes proper grandson.",
  "s0186": "Yin way.",
  "s0187": "Crown prince dies, establishes his younger brother.'",
  "s0188": "The emperor said: 'To you gentlemen what is it?'",
  "s0189": "All replied: 'Now the Han house follows Zhou, Zhou way cannot establish younger brother, should establish son.",
  "s0190": "Therefore the Spring and Autumn Annals criticizes Duke Xuan of Song.",
  "s0191": "Duke Xuan of Song died, did not establish son but gave to younger brother.",
  "s0192": "Younger brother received the state died, again returned it to elder brother's son.",
  "s0193": "Younger brother's son contended for it, considering I should succeed father's place, thus stabbed and killed elder brother's son.",
  "s0194": "Therefore the state was chaotic, calamities did not cease.",
  "s0195": "Therefore the Spring and Autumn Annals says 'The gentleman greatly occupies correctness, Song's calamity Duke Xuan made it.'",
  "s0196": "Your servants request to see the empress dowager and inform her.'",
  "s0197": "Yuan Ang and others entered to see the empress dowager: 'The empress dowager speaks wishing to establish the King of Liang, if the King of Liang should die, wishes to establish whom?'",
  "s0198": "The empress dowager said: 'I will again establish the emperor's son.'",
  "s0199": "Yuan Ang and others with Duke Xuan of Song not establishing properly, produced calamity, calamity and chaos after five generations not ceased, little intolerance harming great righteousness, reported to the empress dowager.",
  "s0200": "The empress dowager then dispelled her idea, immediately had the King of Liang return to his fief."
}