{
  "s0363": "Wu Ling Wang made leather clothing, practiced riding and shooting, and the Zhao people followed him.",
  "s0364": "The Huns called him 'the flying Zhao'.",
  "s0365": "Wu Ling Wang had a favorite concubine named Wu Ying, who was treacherous and jealous.",
  "s0366": "The crown prince Zhang was born of the consort, but Wu Ying plotted to establish her son He as crown prince.",
  "s0367": "Wu Ling Wang grew old and became ill, Wu Ying and He plotted to kill the crown prince Zhang.",
  "s0368": "Zhang fled and entered the palace, hid in the beams.",
  "s0369": "Wu Ying sent people to search but could not find him.",
  "s0370": "Zhang's followers Zhao Jia and others plotted to kill Wu Ying.",
  "s0371": "Wu Ying became aware and fled, Zhang's followers pursued and killed Wu Ying.",
  "s0372": "Wu Ling Wang heard of it and was greatly angry, imprisoned Zhang in the Sanglin Palace, wanting to kill him.",
  "s0373": "The ministers all said Zhang was innocent, but the king would not listen.",
  "s0374": "Zhang's younger brother He feared being implicated, so plotted with Zhang's followers Cheng Drong and others to kill Zhang.",
  "s0375": "They entered the Sanglin Palace and killed Zhang.",
  "s0376": "Wu Ling Wang was greatly sad and buried Zhang with the rites of a crown prince.",
  "s0377": "Afterward, established He as crown prince.",
  "s0378": "Wu Ling Wang died, He ascended, this was Hui Wen Wang.",
  "s0379": "Hui Wen Wang was young, his mother Wu Ying had been killed by Zhang's followers, so the king hated Zhang's followers.",
  "s0380": "Cheng Drong and others feared punishment, so plotted rebellion, wanting to establish the crown prince's son Dai as king.",
  "s0381": "The plot leaked, the king killed Cheng Drong and others.",
  "s0382": "The crown prince feared and fled to the Qi border.",
  "s0383": "The king established younger brother Yong as crown prince.",
  "s0384": "Hui Wen Wang's mother was consort Meng Yao, who was favored.",
  "s0385": "Hui Wen Wang was born, consort Meng Yao died young.",
  "s0386": "Hui Wen Wang grew up, favored Li Ji.",
  "s0387": "Li Ji gave birth to son Dan.",
  "s0388": "Hui Wen Wang wanted to establish Dan as crown prince, but Yong was already established, so did not change it.",
  "s0389": "Hui Wen Wang died, Yong ascended, this was Xiao Cheng Wang.",
  "s0390": "Xiao Cheng Wang was young, Li Ji acted as regent.",
  "s0391": "Li Ji wanted to establish her son Dan as king, so plotted to kill Xiao Cheng Wang.",
  "s0392": "The plot was discovered, Li Ji was killed, Dan was killed.",
  "s0393": "Xiao Cheng Wang died without heir.",
  "s0394": "The noble Lian Po and Guo Kai established Xiao Cheng Wang's younger brother Yan as king, this was Daoxiang Wang.",
  "s0395": "Daoxiang Wang was young, Lian Po acted as regent.",
  "s0396": "Daoxiang Wang grew up, favored Guo Kai, disliked Lian Po.",
  "s0397": "Guo Kai plotted to drive away Lian Po.",
  "s0398": "Lian Po fled to Wei.",
  "s0399": "Wei let Lian Po attack Zhao, Zhao defeated Wei.",
  "s0400": "Zhao then welcomed back Lian Po, restored his former position.",
  "s0401": "Daoxiang Wang died, son Xiaocheng Wang ascended.",
  "s0402": "Xiaocheng Wang favored Queen Zheng, who was treacherous.",
  "s0403": "Qin, Chu, Yan, Qi, Wei sent elite troops each ten thousand men to attend the burial.",
  "s0404": "Zi Wu Ling Wang ascended.",
  "s0405": "Wu Ling Wang first year, Yang Wen Jun Zhao Bao served as chancellor.",
  "s0406": "Liang Xiang Wang and crown prince Si, Han Xuan Wang and crown prince Cang came to court at Xin Palace.",
  "s0407": "Wu Ling Wang was young, could not yet listen to government, had three erudite teachers, three supervisors on the left and right.",
  "s0408": "When he listened to government, first asked about the late king's worthy ministers Fei Yi, increased their rank;",
  "s0409": "for the state's three elders over eighty, monthly gave them ceremony.",
  "s0410": "Third year, walled Xiang.",
  "s0411": "Fourth year, met with Han at Ou Shu.",
  "s0412": "Fifth year, married a Han woman as wife.",
  "s0413": "Sixth year, Han, Zhao, Wei together extinguished Jin, divided its territory.",
  "s0414": "Seventh year, built the Great Wall.",
  "s0415": "Ninth year, five states mutually became kings, Zhao became Zhao Wang.",
  "s0416": "Thirteenth year, Qin captured our Lan, Yu.",
  "s0417": "Fifteenth year, Qin king captured our king, Zhao perished.",
  "s0418": "Afterward Qin extinguished the six states, united all under Heaven.",
  "s0419": "The Zhao clan's ancestors shared a common origin with Qin.",
  "s0420": "Down to Zhongyan, who served as charioteer to Emperor Da Jia.",
  "s0421": "In later generations, Fei Lian had two sons, and he named one son E Lai, who served King Zhou and was killed by Zhou. His descendants became Qin.",
  "s0422": "E Lai's younger brother was called Ji Sheng, and his descendants became Zhao.",
  "s0423": "Ji Sheng gave birth to Meng Zeng.",
  "s0424": "Meng Zeng was favored by King Cheng of Zhou and was called Zhai Gao Lang.",
  "s0425": "Gao Lang gave birth to Heng Fu, Heng Fu gave birth to Zao Fu.",
  "s0426": "Zao Fu was favored by King Mu of Zhou.",
  "s0427": "Zao Fu obtained the finest horses from Ji, along with the Peach Forest stallions Li, Hua Liu, and Lu Er, and presented them to King Mu.",
  "s0428": "King Mu had Zao Fu drive the chariot on a western inspection tour where he met the Queen Mother of the West and was so delighted he forgot to return.",
  "s0429": "Then King Xu of Xu rebelled, so King Mu raced a thousand li in one day to attack King Xu of Xu and greatly defeated him.",
  "s0430": "He then granted Zao Fu the city of Zhao, and from this came the Zhao clan.",
  "s0431": "From Zao Fu down six generations to Yan Fu, called Gong Zhong. During King Xuan of Zhou's time, he campaigned against the Rong and served as charioteer.",
  "s0432": "At the battle of Qian Mu, Yan Fu rescued King Xuan.",
  "s0433": "Yan Fu gave birth to Shu Dai.",
  "s0434": "During Shu Dai's time, King You of Zhou was tyrannical, so he left Zhou and went to Jin, serving Marquis Wen of Jin, and first established the Zhao clan in Jin.",
  "s0435": "From Shu Dai downward, the Zhao lineage grew increasingly prominent, and after five generations came Zhao Su.",
  "s0436": "Zhao Su, in the sixteenth year of Duke Xian of Jin, attacked Huo, Wei, and Geng, and Zhao Su served as general attacking Huo.",
  "s0437": "The Lord of Huo fled to Qi.",
  "s0438": "Jin then enfeoffed Zhao Su with Geng.",
  "s0439": "Zhao Su gave birth to Gong Meng.",
  "s0440": "During the first year of Duke Min of Lu, Duke Xian of Jin died, and his four sons contended to succeed him, causing chaos in Jin.",
  "s0441": "Zhao Su was not in Jin, so the people became chaotic and welcomed Zhao Su to establish him.",
  "s0442": "This was Duke Wen of Jin.",
  "s0443": "He gave birth to Yuan Tong, Ping Kuo, and Lou He.",
  "s0444": "Duke Wen of Jin died, and his son Duke Xiang Qu ascended.",
  "s0445": "Yuan Tong hated Zheng Zi Hua, so assassinated Zheng Zi Hua.",
  "s0446": "Zhao Dun at this time held the government, and this is when he first became a noble minister.",
  "s0447": "Dun died, and his son Shuo ascended.",
  "s0448": "Shuo died, and Shuo's wife Zhuang Ji became wife of Duke Wen.",
  "s0449": "Duke Wen died, and his son Duke Cheng Hei Tun ascended.",
  "s0450": "Duke Cheng died, and his son Duke Jing Ju ascended.",
  "s0451": "During Duke Jing's time, Chu greatly defeated the Jin army at the Yan River.",
  "s0452": "The Jin musician Kuang said: 'Your army's defeat means the people's defeat, but killing people while you live them makes you begin to be valued.'",
  "s0453": "Shi Kuang said: 'I repeatedly sang the northern wind, then sang the southern wind. The southern wind does not contend, with many dying sounds—Chu will surely defeat Jin.'",
  "s0454": "Indeed, the Chu people achieved merit.",
  "s0455": "Jin captured three Chu generals: Wan Chun, Shen Gong Wu Chen, and Yan Jiangjun.",
  "s0456": "Duke Wen asked Guo Jian: 'Initially my late lord Duke Wen and your late lord uncle Fan planned the army, as well as the former minister Xu Chen.'",
  "s0457": "Xu Chen said: 'Advance, better that we are thin and others are not thin.'",
  "s0458": "The late lord took the eastern road and warned: 'We must restore the state of Wei.'",
  "s0459": "Guo Jian said: 'Do not restore Wei.'",
  "s0460": "For this campaign, Jin's state became great, the feudal lords trustworthy, the highways clear—why speak of restoring Wei?'",
  "s0461": "Duke Wen said: 'You resemble uncle Fan.'",
  "s0462": "Guo Jian said: 'Your servant resembles his former servant, uncle Fan resembles my lord.'",
  "s0463": "My former servant was called Dong Hu, my lord's former lord was called Guo Shu.'",
  "s0464": "Dong Hu was an excellent historian of ancient times, recording law without concealment.'",
  "s0465": "Zhao Xuan Zi held the government and attacked Qi, achieving military merit.",
  "s0466": "On the fourth month xin si day, Ji presented his armor in the court.",
  "s0467": "Xuan Zi said: 'Abandoning government is punishable by execution.'",
  "s0468": "Ji said: 'People say: 'A hen does not crow at dawn.''",
  "s0469": "If a hen crows at dawn, the family will be finished.''",
  "s0470": "Now you lend the government, lending government is a hen crowing at dawn.'",
  "s0471": "People cannot overcome anger, your servant dares not translate.'",
  "s0472": "Zhao Dun secretly hid Xi Ji in Shen and gave birth to Zhao Shuo.",
  "s0473": "Shuo married Zhuang Ji.",
  "s0474": "Dun died, Shuo ascended.",
  "s0475": "Shuo died, Shuo's wife had a posthumous pregnancy, fled to the palace and gave birth to Zhao Wu.",
  "s0476": "Ying Qi deceived and killed Zhao Tong, Zhao Kuo, Zhao Ying Qi, and all their clans were exterminated.",
  "s0477": "Wu then counterattacked and killed Ying Qi, welcomed Zhao Wu from Jinyang and established him.",
  "s0478": "This was Zhao Wen Zi.",
  "s0479": "Wen Zi gave birth to Jing Shu.",
  "s0480": "During Jing Shu's time, Duke Jing of Qi sent Yan Ying to Jin, and Yan Ying spoke with Shu Xiang of Jin.",
  "s0481": "Yan Ying said: 'Among Qi's government being late, the lord's extravagance, and lord and ministers overstepping—among these four things, which will perish first?'",
  "s0482": "Shu Xiang said: 'What four things are you speaking of?'",
  "s0483": "Yan Ying said: 'Formerly, the Qi lord was repeatedly defeated by Cui Zhu and killed him.'",
  "s0484": "Cui Zhu's sons together killed Lord Guang of Qi because of the Cui clan disturbance.'",
  "s0485": "Ministers wish to be wealthy but Yan poor, the lord wishes to be happy but ministers labor.'",
  "s0486": "If these two are not done, who will do them?'",
  "s0487": "Shu Xiang said: 'This is also the lord's desire, but ministers carry it out—from carrying it out to overstepping, from carrying it out to deceiving, from carrying it out to executing, what they follow is the same.'",
  "s0488": "Yan Ying said: 'When the Cui clan left, their lord killed them and died.'",
  "s0489": "The Cui disturbance was the lord's disorderly ministers.'",
  "s0490": "Zhao Wen Zi held the government, commanding light taxation on the people.",
  "s0491": "Wen Zi spoke to the Jin lord: 'Jin's government is in the family gates. Government in family gates means the four neighbors will attack it, destruction can be awaited with one's feet up.'",
  "s0492": "At this time, the six great families of Jin were strong, the ducal house weak.",
  "s0493": "Zhao Jian Zi held Jin's government.",
  "s0494": "Jian Zi became ill and for five days was unconscious. The ministers all feared and summoned Bian Que.",
  "s0495": "Bian Que entered to examine him, then left. Dong An Yu asked.",
  "s0496": "Bian Que said: 'The blood vessels are in order, why be surprised!'",
  "s0497": "Formerly Duke Mu of Qin was once like this, and awoke after seven days.'",
  "s0498": "On the day he awoke, he told Gong Sun Zhi and Zi Yu: 'I was greatly delighted in the imperial place.'",
  "s0499": "The reason I stayed long was that I was learning something.'",
  "s0500": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0501": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0502": "Gong Sun Zhi wrote and hid it.'",
  "s0503": "The Qin spies then left.'",
  "s0504": "Bian Que said: 'Zhao Jian Zi's illness is the same as Duke Mu of Qin's, he will not exceed two nights.'",
  "s0505": "Indeed after two nights he awoke.",
  "s0506": "Jian Zi said: 'I was greatly delighted in the imperial place, touring with the hundred spirits in the celestial sphere, with vast music of nine movements and ten thousand dances, not like the music of the three dynasties, its sound moved the heart.'",
  "s0507": "A bear came wanting to pull me.'",
  "s0508": "The Emperor commanded me to shoot it, I hit the bear and the bear died.'",
  "s0509": "A brown bear came, I shot it again, hit the brown bear and the brown bear died.'",
  "s0510": "The Emperor was greatly pleased and granted me two baskets, both with assistants.'",
  "s0511": "I saw a boy at the Emperor's side. The Emperor entrusted me with a Di dog, saying: 'When your son grows up, grant it to him.'",
  "s0512": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0513": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0514": "Dong An Yu received the words and wrote to hide them.'",
  "s0515": "Jian Zi left, Dong An Yu told his son Zhuang: 'You know this first.'",
  "s0516": "Zhao Jian Zi dreamed of burying himself and seeing the Emperor, and on the ji si day buried himself.",
  "s0517": "When Zhao Wu Ling Wang was born, he seized from his elder brother Zhang and established himself, this was Zhao Wu Ling Wang.",
  "s0518": "From Zhao Su downward, they did not lose their lineage, down to the Wang clan."
}
