{
  "s0001": "Since ancient times, emperors and kings who received the mandate of heaven, as well as those who succeeded to the throne and maintained the established institutions, did not rely solely on their own virtuous character, but also received assistance from their maternal relatives.",
  "s0002": "The Xia dynasty rose to power thanks to Tushan, but Jie was overthrown because of Moyi.",
  "s0003": "The Yin dynasty rose to power thanks to Youxiong, but Zhou was killed because of his infatuation with Daji.",
  "s0004": "The Zhou dynasty rose to power thanks to Jiangyuan and Tai Ren, but King You was captured because of his licentious affair with Baosi.",
  "s0005": "Therefore, the Book of Changes takes Qian and Kun as its foundation, the Book of Odes begins with Guan Ju, the Book of Documents praises the proper bestowal of honors, and the Spring and Autumn Annals criticizes those who do not personally welcome their brides.",
  "s0006": "The relationship between husband and wife is the greatest of human relationships.",
  "s0007": "Of all the applications of ritual propriety, none requires such careful attention as marriage.",
  "s0008": "When music is properly attuned, the four seasons harmonize, and this is the fundamental principle governing the transformations of yin and yang and the ordering of all things.",
  "s0009": "How can this not be approached with the utmost care?",
  "s0010": "Though a person may strive to broaden the Way, there is nothing they can do about fate.",
  "s0011": "How profound is the love between husband and wife! A ruler cannot obtain such devotion from his ministers, nor can a father obtain it from his sons—what hope then for those in inferior positions?",
  "s0012": "Even when a couple has joyfully united, they may not be able to produce offspring;",
  "s0013": "Even when they have produced offspring, they may not be able to enjoy a full life together. Is this not the working of fate?",
  "s0014": "Confucius rarely spoke of fate, for it is difficult to discuss.",
  "s0015": "Without penetrating the transformations between the dark and the bright, how can one understand the nature of life and fate?",
  "s0016": "The Grand Historian says: The period before the Qin dynasty is rather sketchy in detail, and there is little that can be recorded with precision.",
  "s0017": "When the Han dynasty arose, Lü Ehu became Gaozu's principal wife and bore him a son who became the crown prince.",
  "s0018": "In her later years, as her beauty faded and the emperor's affection waned, the imperial concubine Qi had his favor, and her son Ruyi came close to replacing the crown prince on several occasions.",
  "s0019": "When Gaozu passed away, Empress Lü exterminated the Qi clan and executed King Zhao, while among Gaozu's palace women, only those who were unloved and distant remained unharmed.",
  "s0020": "Empress Lü's eldest daughter became the wife of Marquis Xuanping Zhang Ao, and Ao's daughter became Empress Xiaohui.",
  "s0021": "Because of their close kinship, Empress Lü desired that the empress bear children by any means necessary. In the end, she bore no children, so she fraudulently took a son from one of the palace women and claimed him as her own.",
  "s0022": "When Emperor Xiaohui passed away, the realm had only recently been pacified and the succession was unclear.",
  "s0023": "Therefore, she honored her maternal relatives, enfeoffed the various Lü clansmen as kings to serve as supporters, and made Lü Lü's daughter the consort of the young emperor, wishing to firmly establish and strengthen their family foundation. However, it was of no avail.",
  "s0024": "When Empress Gao passed away, she was buried alongside Gaozu in Changling tomb.",
  "s0025": "Lü Lü and Lü Chan and the others, fearing execution, plotted rebellion.",
  "s0026": "The ministers attacked them, and heaven brought disorder to their plans, finally exterminating the Lü clan.",
  "s0027": "Only Empress Xiaohui was left residing in the Northern Palace.",
  "s0028": "They welcomed and established the King of Dai, who became Emperor Xiaowen, and he maintained the Han ancestral temples.",
  "s0029": "Was this not the will of heaven?",
  "s0030": "Who but heaven could have brought this about?",
  "s0031": "Empress Bo's father was from Wu, surnamed Bo. During the Qin dynasty, he had relations with Wei Fu, a woman from the clan of the former King of Wei, and she bore Empress Bo. Bo An died in Shanyin and was buried there.",
  "s0032": "When the feudal lords rebelled against Qin, Wei Bao established himself as King of Wei, and Wei Fu brought her daughter into the Wei palace.",
  "s0033": "Wei Fu had Xu Fu divine for her, and Xu Fu divined for Empress Bo, saying she would bear a son who would become emperor.",
  "s0034": "At this time, Xiang Yu was contending with the Han king at Xingyang, and the realm had not yet been decided.",
  "s0035": "At first Bao had joined with Han to attack Chu, but when he heard Xu Fu's words, he was secretly delighted, so he betrayed Han and rebelled, taking a neutral position and instead allied with Chu.",
  "s0036": "Han sent Cao Can and others to attack and capture King Wei Bao, making his state into a commandery, and Empress Bo was sent to the weaving rooms.",
  "s0037": "After Bao died, the Han king entered the weaving rooms and, seeing that Empress Bo was beautiful, ordered her brought into the rear palace. For more than a year she did not receive his favor.",
  "s0038": "When the lady was young, she was close friends with Lady Guan and Zhao Zier, and they made a pact: 'Whoever becomes noble first must not forget the others.'",
  "s0039": "Later, Lady Guan and Zhao Zier first received the Han king's favor.",
  "s0040": "The Han king was sitting in the Henan Palace on the Chenggao Tower when these two beauties laughed together about Empress Bo's earlier pact.",
  "s0041": "The Han king heard this and asked the reason, and the two women told him the whole truth.",
  "s0042": "The Han king felt sorrowful and pitied Empress Bo, and that very day summoned her and favored her.",
  "s0043": "Empress Bo said: 'Last night I dreamt that a green dragon coiled around my belly.'",
  "s0044": "The Supreme Emperor said: 'This is an auspicious sign of nobility. I will fulfill it for you.'",
  "s0045": "From this one favor she bore a son, who became the King of Dai.",
  "s0046": "Afterward, Empress Bo rarely saw Gaozu.",
  "s0047": "When Gaozu passed away, Empress Lü was angry at all the favored consorts like Concubine Qi, and imprisoned them all so they could not leave the palace.",
  "s0048": "But because Empress Bo was rarely seen, she was allowed to leave and follow her son to Dai, becoming the Queen Dowager of Dai.",
  "s0049": "The Queen Dowager's younger brother Bo Zhao followed her to Dai.",
  "s0050": "The King of Dai was established for seventeen years, then Empress Gao passed away."
}