{
  "s0718": "The Empress Dowager said: \"Your lordship is wrong, it is not as serious as with Chang'an Jun.\"",
  "s0719": "The Left Minister Tang Ju said: \"Parents who love their children plan deeply for them.",
  "s0720": "When the old woman sent off the Yan Queen, holding her heels, weeping for her, thinking of her distance, it was also pitiable.",
  "s0721": "After she left, it is not that she did not think of her, at sacrifices she prayed saying 'May she never return', was this not planning for the long term, for her sons and grandsons to succeed as kings?\"",
  "s0722": "The Empress Dowager said: \"Yes.\"",
  "s0723": "The Left Minister said: \"Now going back three generations, among the sons and grandsons of Zhao lords who became marquises, are there any whose succession still exists?\"",
  "s0724": "She said: \"There are none.\"",
  "s0725": "He said: \"Not only Zhao, are there any among the feudal lords whose succession still exists?\"",
  "s0726": "She said: \"This old woman has not heard of any.\"",
  "s0727": "He said: \"This is because those close suffered calamity in their own persons, those far suffered calamity in their sons and grandsons.",
  "s0728": "Is it that the sons of lords who become marquises are not good?",
  "s0729": "Their position is honored but without merit, their emolument is generous but without labor, and they monopolize many heavy treasures.",
  "s0730": "Now your ladyship honors Chang'an Jun's position, and enfeoffs him with fertile lands, gives him many heavy treasures, but does not make him have merit for the state now. Once the mountain tomb collapses, how will Chang'an Jun entrust himself to Zhao?",
  "s0731": "This old minister considers your ladyship's planning for Chang'an Jun to be short-sighted, therefore considers your love for him inferior to the Yan Queen's.\"",
  "s0732": "The Empress Dowager said: \"Yes, I leave it to your lordship to do as you wish.\"",
  "s0733": "Thereupon they prepared a hundred chariots for Chang'an Jun, sent him as hostage to Qi, and Qi troops then came out.",
  "s0734": "Zi Yi heard of it and said: \"The sons of lords, flesh and blood relatives, still cannot hold honored positions without merit, generous emoluments without labor, and guard golden jade treasures, how much more so for me?\"",
  "s0736": "Qi Anping Jun Tian Dan led Zhao troops and attacked Yan Zhongyang, capturing it.",
  "s0737": "Again attacked Han Zhu Ren, capturing it.",
  "s0738": "Seventeenth year, together with Wei and Chu struck Qin.",
  "s0739": "Qin defeated our Wu Sui, beheaded ten thousand.",
  "s0740": "Yan king pitied them, so returned the Yan Empress Dowager.",
  "s0741": "The Zhao family all celebrated.",
  "s0742": "Eighteenth year, Qin captured our Shi Cheng.",
  "s0743": "Nineteenth year, Qin captured nine of our Ye cities.",
  "s0744": "Twentieth year, Yan crown prince Dan was hostage in Qin and requested to return.",
  "s0745": "Zhao did not treat him with courtesy.",
  "s0746": "Twenty-first year, Qin pressed Wang Jian, broke Zhao army at He Jian, beheaded ten thousand.",
  "s0747": "Then surrounded Handan.",
  "s0748": "Twenty-second year, Wang Qian led troops to strike Qin army, Qin army withdrew.",
  "s0749": "Twenty-third year, Qin again attacked Wang Qian, Zhao Li Mu rescued him.",
  "s0750": "Li Mu repeatedly broke Qin army.",
  "s0751": "Twenty-fourth year, Qin greatly broke our army in four or five commanderies.",
  "s0752": "Twenty-fifth year, Yan using crown prince Dan's plan, sent Jing Ke to assassinate Qin king.",
  "s0753": "Qin king became aware, killed Ke, extinguished Yan.",
  "s0754": "Zhao people celebrated.",
  "s0755": "Twenty-sixth year, Qin greatly broke Zhao at Chang Ping, killed Zhao Kuo, beheaded over 400,000.",
  "s0756": "Twenty-seventh year, Dao Xiang Wang died, son You Mu Wang Qian ascended.",
  "s0757": "Qin attacked Zhao, captured Wu Sui and Chi Li.",
  "s0758": "Twenty-eighth year, Qin attacked Wu Cheng.",
  "s0759": "Twenty-ninth year, Qin captured our Ying Du.",
  "s0760": "Thirtieth year, Qin attacked Fan Wu, Li Mu and Sima Shang defended it.",
  "s0761": "Qin gave much gold to Zhao king's favored minister Guo Kai, to sow dissension, saying Li Mu and Sima Shang wanted to rebel.",
  "s0762": "Zhao king sent Zhao Cong and Qi general Yan Ju to replace them.",
  "s0763": "Li Mu did not accept the order, Zhao king sent people to secretly arrest Li Mu and execute him.",
  "s0764": "Dismissed Sima Shang.",
  "s0765": "Thirty-first year, Qin attacked Zhao, Zhao Cong's army was broken, Yan Ju fled.",
  "s0766": "Qin took Zhao's Handan, Zhao king Qian surrendered.",
  "s0767": "Qian was hostage in Qin, Qin king made Qian Yang An Jun.",
  "s0768": "Qin general Wang Jian went to Chu, Qian pleaded illness and did not go.",
  "s0769": "Qin Zhao Wang died, son Xiao Wen Wang ascended.",
  "s0770": "Qian was hostage in Qin for altogether three years.",
  "s0771": "Xiao Wen Wang died, son Zhuang Xiang Wang ascended.",
  "s0772": "Third year, Qian was hostage in Qin for altogether six years.",
  "s0773": "Zhuang Xiang Wang died, son Zheng ascended, this was Qin Shi Huang.",
  "s0774": "Qian was hostage in Qin for altogether eight years.",
  "s0775": "Qin Shi Huang sent Lu Buwei to kidnap Qian at Yong, Qian then used Yan crown prince Dan's plan to repay Qin.",
  "s0776": "Killed Qin envoys, raised troops to attack Qin Xianyang, took Qin king's mother the Empress Dowager and her children.",
  "s0777": "Qin troops arrived, Zhao people killed Qian.",
  "s0778": "The Zhao family line was cut off, succeeding six generations.",
  "s0779": "The Grand Historian says: Zhao's former lords shared the same ancestor as Qin.",
  "s0780": "Until Zhong Yan became emperor, Xuan Wang became king, all had good reputations.",
  "s0781": "Until Xian Hou's time, they began to have a foundation.",
  "s0782": "Until Wu Ling Wang, changed customs to Hunnic clothing, opened and expanded territory, north extinguished Lin Hu and Lou Fan.",
  "s0783": "Built the long wall, from Dai along the Yin Shan mountains below, to Gao Que as the barrier.",
  "s0784": "And established Yun Zhong, Yan Men, Dai commandery.",
  "s0785": "Afterwards Yan had worthy general Qin Kai, who was hostage in Han, but was intimate with Yan king.",
  "s0786": "Yan king trusted Qin Kai, sent him to attack Zhao, broke Zhao army at Dai and Wu Quan.",
  "s0787": "Then surrounded Dai city.",
  "s0788": "Dai king requested peace, Qin Kai then attacked and broke Yan army, credited the merit to Yan king.",
  "s0789": "Qin Kai became Yan northern territory guardian, Yan king made Kai national defender.",
  "s0790": "Afterwards, Qin Kai again broke Zhao army at Yun Zhong and Jiu Yuan.",
  "s0791": "Qin Kai served as general, Yan army generals who died numbered over seventy.",
  "s0792": "Yan king enfeoffed Qin Kai as Wu An Jun.",
  "s0793": "Afterwards, Qin Kai again broke Hu at Dai.",
  "s0794": "Qin Kai was skilled in using troops, incorruptible and fair, Zhao people sang of him saying: \"General Qin rides a yellow horse, armor and sword.",
  "s0795": "In front saves Zhao troops, behind strikes Hu captives.\"",
  "s0796": "The common people sang: \"Sir do not cross the river, sir insistently crosses the river.",
  "s0797": "Crosses the river and dies, what can we do for sir!\"",
  "s0798": "Afterwards, Zhao Dao Xiang Wang sent Yue Cheng to replace Lian Po, broke Yan army at Xiang.",
  "s0799": "Yan general Gong Sun Cao killed Dao Xiang Wang.",
  "s0800": "Afterwards, Zhao Dao Xiang Wang again sent Li Mu to attack Yan, captured Wu Sui and Fang Cheng.",
  "s0801": "Lian Po was dismissed as commoner.",
  "s0802": "The Grand Historian says: Knowing death is certain yet brave, bravery means though dead still alive.",
  "s0803": "Li Mu served as Zhao general, stationed on the border, the army market rents all he used to feed his soldiers.",
  "s0804": "Rewards and punishments decided externally, not from central oversight.",
  "s0805": "Delegated authority and held responsible for success, therefore Li Mu was able to exhaust his intelligence and ability, selecting 1,300 chariots, 13,000 crossbow cavalry, 100,000 elite troops.",
  "s0806": "Therefore north he drove away the Shan Yu, broke Dong Hu, extinguished Dan Lin,",
  "s0807": "west he pressed strong Qin, south propped up Han and Wei.",
  "s0808": "At this time, Zhao nearly became hegemon.",
  "s0809": "Afterwards when Qin surrounded Handan urgently, Li Mu arrived, Qin army retreated.",
  "s0810": "When Qin surrounded Handan and those who died numbered over 200,000.",
  "s0811": "Li Mu one sortie, Qin army retreated fifty li.",
  "s0812": "Afterwards Zhao king Qian did not use Li Mu, finally broke Zhao.",
  "s0813": "Li Mu died, Zhao perished.",
  "s0814": "The Grand Historian says: With Li Mu's worthiness, Zhao king Qian did not use him, broke Zhao.",
  "s0815": "Zhao perished, Qian destroyed himself.",
  "s0816": "Qian was hostage in Qin, Qin king made him Yang An Jun.",
  "s0817": "Qin king sent Qian to strike Yan Ying, Qian did not go.",
  "s0818": "Qin king made Qian crown prince."
}