{
  "s0152": "Replied: 'In the beginning of Qin there were over 30,000 households, but in the intervening time wars rose repeatedly, many fled and hid, now there are only 5,000 households.'",
  "s0153": "Thus commanded the imperial secretary to change and make Chen Ping Marquis of Qu Ni, eating all of it, removing the previous Huyou he ate.",
  "s0154": "Afterwards constantly as Protector of the Army Commandant followed in attacking Chen Xi and Ying Bu.",
  "s0155": "Altogether six times put forth extraordinary strategies, each time increased his fief, altogether six increases in enfeoffment.",
  "s0156": "The extraordinary strategies were somewhat secret, the world could not hear them.",
  "s0157": "Gaozu following the defeat of Bu's army returned, wounded by arrows, slowly traveled to Chang'an.",
  "s0158": "King Yan Lu Wan rebelled, the emperor sent Fan Kuai as prime minister leading troops to attack him.",
  "s0159": "Having gone, someone spoke ill of Kuai.",
  "s0160": "Gaozu angered said: 'Kuai seeing my illness, hopes I die.'",
  "s0161": "Using Chen Ping's strategy summoned Marquis Jiang Zhou Bo to receive the decree under the bed, said: 'Chen Ping urgently gallop by relay, carry Bo to replace Kuai as general, Ping arriving in the army immediately behead Kuai!'",
  "s0162": "The two having received the decree, galloped by relay not yet reaching the army, discussed it saying: 'Fan Kuai is the emperor's old friend, merits many, moreover is the husband of Empress Lü's younger brother Lü Chan, has close relations and is noble, the emperor in anger wishes to behead him, then fears regret.",
  "s0163": "Better to imprison and deliver to the emperor, the emperor himself will execute him.'",
  "s0164": "Before reaching the army, built an altar, summoned Fan Kuai with the tally.",
  "s0165": "Kuai received the decree, immediately was bound with hands behind back and loaded in a caged carriage, transported to Chang'an, while commanding Marquis Jiang Bo to replace as general, leading troops to pacify Yan's rebellious counties.",
  "s0166": "Ping on the way heard Gaozu had collapsed, Ping fearing Empress Lü and Lü Chan would slander in anger, so galloped by relay ahead.",
  "s0167": "Met envoys decreeing Ping and Guan Ying to station at Xingyang.",
  "s0168": "Ping received the decree, immediately galloped again to the palace, wept very mournfully, thus memorialized affairs before the funeral.",
  "s0169": "Empress Lü pitied him, said: 'Sir is weary, go out and rest.'",
  "s0170": "Ping fearing slander would reach him, thus firmly requested to be among the palace guards.",
  "s0171": "The empress then made him Commandant of the Langzhong, said: 'Tutor and teach Xiaohui.'",
  "s0172": "After this Lü Chan's slander could not be carried out.",
  "s0173": "Fan Kuai arrived, then was pardoned and restored rank and fief.",
  "s0174": "Emperor Xiaohui year 6, prime minister Cao Can died, made Marquis Anguo Wang Ling right chancellor, Chen Ping left chancellor.",
  "s0175": "Wang Ling was originally from Pei, began as a county bully, when Gaozu was humble, treated Ling as elder brother.",
  "s0176": "Ling was little educated, impetuous, liked direct speech.",
  "s0177": "When Gaozu rose from Pei, entered to Xianyang, Ling also gathered several thousand followers, resided in Nanyang, would not follow Duke Pei.",
  "s0178": "When the King of Han returned to attack Xiang Ji, Ling then attached his troops to Han.",
  "s0179": "Xiang Yu took Ling's mother and placed her in the army, when Ling's envoy arrived, then sat Ling's mother facing east, wishing to summon Ling.",
  "s0180": "Ling's mother having secretly sent the envoy, wept saying: 'For this old concubine tell Ling, serve the King of Han carefully.",
  "s0181": "The King of Han is a gentleman, do not because of this old concubine hold divided loyalties.",
  "s0182": "This concubine sends the envoy with death.'",
  "s0183": "Thus fell on her sword and died.",
  "s0184": "Xiang Wang angered, boiled Ling's mother.",
  "s0185": "Ling ultimately followed the King of Han to settle the realm.",
  "s0186": "Because he was on good terms with Yong Chi—Chi was Gaozu's enemy—and Ling originally had no intention to follow Gaozu, therefore was enfeoffed late, as Marquis of Anguo.",
  "s0187": "Marquis Anguo having become right chancellor, two years, Emperor Xiaohui collapsed.",
  "s0188": "Empress Gao wished to establish various Lü as kings, asked Wang Ling, Wang Ling said: 'Cannot.'",
  "s0189": "Asked Chen Ping, Chen Ping said: 'Can.'",
  "s0190": "Empress Lü angered, pretended to transfer Ling to be imperial tutor, actually did not use Ling.",
  "s0191": "Ling angered, pleaded illness and resigned, closed his door and never attended court audiences, seven years and died.",
  "s0192": "When Ling resigned as chancellor, Empress Lü then transferred Ping to be right chancellor, made Marquis Piyang Shen Yiji left chancellor.",
  "s0193": "The left chancellor did not manage affairs, constantly served in the palace.",
  "s0194": "Yiji was also from Pei.",
  "s0195": "When the King of Han was defeated west of Pengcheng, Chu took the Supreme Ancestor and Empress Lü as hostages, Yiji as attendant served Empress Lü.",
  "s0196": "Afterwards followed in defeating Xiang Ji became marquis, was favored by Empress Lü.",
  "s0197": "When became chancellor, resided in the palace, all officials decided affairs through him.",
  "s0198": "Lü Chan often because Ping had earlier strategized for Gaozu to seize Fan Kuai, frequently slandered saying: 'Chen Ping as chancellor does not manage affairs, daily drinks strong wine, plays with women.'",
  "s0199": "Chen Ping hearing it, did it increasingly.",
  "s0200": "Empress Lü hearing it, privately was alone pleased.",
  "s0201": "Confronted Lü Chan about Chen Ping saying: 'The vulgar saying goes 'children and women's mouths cannot be used', but consider sir and me what relation.'"
}