{
  "s0001": "Marquis Jiang Zhou Bo was a native of Pei.",
  "s0002": "His ancestors were from Juan, migrated to Pei.",
  "s0003": "Bo made his living weaving reed mats, often played flute for people's funerals, served as a skilled crossbowman in the reserves.",
  "s0004": "When Gaozu as Duke Pei first rose up, Bo as attendant followed in attacking Hu Ling, captured Fangyu.",
  "s0005": "Fangyu rebelled, fought with them, drove them back.",
  "s0006": "Attacked Feng.",
  "s0007": "Struck Qin army east of Dang.",
  "s0008": "Returned army to Liu and Xiao.",
  "s0009": "Again attacked Dang, broke it.",
  "s0010": "Captured Xiayi, first to ascend the walls.",
  "s0011": "Granted rank of Grandee of the Fifth Degree.",
  "s0012": "Attacked Meng and Yu, took them.",
  "s0013": "Struck Zhang Han's chariots and cavalry, brought up the rear.",
  "s0014": "Pacified Wei territory.",
  "s0015": "Attacked Yuanqi and Dongmin, proceeding to Li, took it.",
  "s0016": "Attacked Nie Sang, first to ascend.",
  "s0017": "Struck Qin army below E, broke it.",
  "s0018": "Pursued to Puyang, captured Zhen city.",
  "s0019": "Attacked Duchuan and Dingtao, raided and took Wanju, captured Shanfu magistrate.",
  "s0020": "Night raided and took Linji, attacked Zhang, advancing first to Juan, broke it.",
  "s0021": "Struck Li You's army below Yongqiu.",
  "s0022": "Attacked Kaifeng, first to reach the city walls with the most.",
  "s0023": "Later Zhang Han defeated and killed Xiang Liang, Duke Pei and Xiang Yu led troops east to Dang.",
  "s0024": "From first rising in Pei returning to Dang, one year two months.",
  "s0025": "King Huai of Chu enfeoffed Duke Pei with the title Peaceful Martial Marquis, made him magistrate of Dang commandery.",
  "s0026": "Duke Pei appointed Bo as Commander of the Tiger Braves, as commander followed Duke Pei to pacify Wei territory.",
  "s0027": "Attacked the East Commandery Governor at Chengwu, broke him.",
  "s0028": "Struck Wang Li's army, broke it.",
  "s0029": "Attacked Changshe, first to ascend.",
  "s0030": "Attacked Yingyang and Goushi, cut off the river crossing.",
  "s0031": "Struck Zhao Ben's army north of Shi.",
  "s0032": "South attacked Nanyang Governor Yi, broke Wuguan and Yaoguan.",
  "s0033": "Broke Qin army at Lantian, reached Xianyang, extinguished Qin.",
  "s0034": "Xiang Yu arrived, made Duke Pei King of Han.",
  "s0035": "The King of Han granted Bo rank as Martial Marquis.",
  "s0036": "Followed in entering Hanzhong, appointed as general.",
  "s0037": "Returned to pacify the Three Qins, reached Qin, granted fief in Huaide.",
  "s0038": "Attacked Huaili and Haozhi, first in merit.",
  "s0039": "Struck Zhao Ben and Chamberlain Bao at Xianyang, first in merit.",
  "s0040": "North attacked Qi.",
  "s0041": "Struck Zhang Ping and Yao Ang's army.",
  "s0042": "West pacified Qian.",
  "s0043": "Returned and captured Mei and Fenyang.",
  "s0044": "Besieged Zhang Han at Fei Qiu.",
  "s0045": "Broke the Western Chamberlain.",
  "s0046": "Struck the bandit Ba army, broke it.",
  "s0047": "Attacked Shangui.",
  "s0048": "East guarded Yaoguan.",
  "s0049": "Turned to strike Xiang Ji.",
  "s0050": "Attacked Qu Ni, first in merit."
}