{
  "s0123": "Therefore remonstrating persuaders cannot not examine the lord's loves and hates then persuade him.",
  "s0124": "The dragon as an insect, can be disturbed and familiarly ridden.",
  "s0125": "Yet its throat below has reverse scales one foot across, if a person touches them, then certainly kills the person.",
  "s0126": "The ruler also has reverse scales, persuaders who can avoid touching the ruler's reverse scales, then nearly succeed.",
  "s0127": "Someone transmitted his book to Qin.",
  "s0128": "Qin king saw Lonely Indignation, Five Parasites book, said: 'Alas, I could see this person and travel with him, die without regret!'",
  "s0129": "Li Si said: 'This is Han Fei's written book.'",
  "s0130": "Qin thus urgently attacked Han.",
  "s0131": "Han king initially did not use Fei, when urgent, then sent Fei as envoy to Qin.",
  "s0132": "Qin king pleased with him, not yet employed.",
  "s0133": "Li Si, Yao Jia harmed him, slandered saying: 'Han Fei is Han's various princes.",
  "s0134": "Now king wishes to annex the feudal lords, Fei ultimately for Han not for Qin, this is human feeling.",
  "s0135": "Now king does not employ, long detain and return him, this leaves disaster for oneself, not as good as executing by false law.'",
  "s0136": "Qin king considered it so, sent officials to treat Fei.",
  "s0137": "Li Si sent men to give Fei medicine, made him commit suicide.",
  "s0138": "Han Fei wished to explain himself, could not be seen.",
  "s0139": "Qin king later regretted it, sent men to pardon him, Fei already dead.",
  "s0140": "Shen Zi, Han Zi both wrote books, transmitted to later generations, scholars have many.",
  "s0141": "I alone pity Han Zi wrote Difficulty of Persuasion yet could not save himself.",
  "s0142": "The Grand Historian says: Laozi valued the Dao, emptiness nothingness, responding to changes at non-action, therefore his book words speak of subtle mystery difficult to recognize.",
  "s0143": "Zhuangzi scattered morality and virtue, unrestrained discussions, in essentials also return to naturalness.",
  "s0144": "Shen Zi lowly and humble, applied to name and reality.",
  "s0145": "Han Zi drew ink lines, cut affairs, clarified right and wrong, his extreme harsh cruel lacking mercy.",
  "s0146": "All originated from morality and virtue's intent, yet Laozi profound and far-reaching."
}