{
  "s0152": "Although Chen Sheng was already dead, the marquises, kings, generals, and chancellors he appointed and sent ultimately destroyed Qin, because She started the affair.",
  "s0153": "During the reign of Gaozu, thirty families were established at Dang to guard Chen She's tomb, and they still receive sacrifices today.",
  "s0154": "Master Chu said: 'Difficult terrain and dangerous passes make a state secure;",
  "s0155": "arms and armor, punishments and laws make a state orderly.",
  "s0156": "Yet these are not enough to rely on.",
  "s0157": "The former kings took benevolence and righteousness as their foundation, and fortifications and laws as branches and leaves—was this not so!'",
  "s0158": "I have heard Jia Sheng say:",
  "s0159": "Duke Xiao of Qin occupied the secure passes of Xiao and Han, possessed Yong province, and lord and ministers held firm to spy on the Zhou court.",
  "s0160": "He had the intention to sweep up all under heaven, encompass the world, gather the four seas, and swallow the eight wastes.",
  "s0161": "At that time, Lord Shang assisted him, establishing laws and measures internally, emphasizing farming and weaving, preparing for defense and war;",
  "s0162": "externally using alliances to fight the feudal lords.",
  "s0163": "Thus Qin easily took the land west of the Yellow River.",
  "s0164": "After Duke Xiao died, Kings Huiwen, Wu, and Zhao inherited the legacy, following the old strategy: south they took Hanzhong, west they took Bashu, east they divided the fertile lands and collected the strategic commanderies.",
  "s0165": "The feudal lords were terrified, gathered in alliance and plotted to weaken Qin.",
  "s0166": "They spared no precious vessels, heavy treasures, or fertile lands to attract the world's scholars.",
  "s0167": "They formed vertical alliances and made pacts, uniting as one.",
  "s0168": "At this time, Qi had Lord Mengchang, Zhao had Lord Pingyuan, Chu had Lord Chunshen, Wei had Lord Xinling: these four lords were all wise and trustworthy, broad-minded and loving, honoring the worthy and respecting scholars.",
  "s0169": "They formed vertical alliances and horizontal connections, combining the forces of Han, Wei, Yan, Zhao, Song, Wei, and Zhongshan.",
  "s0170": "Thus the scholars of the six states had Ning Yue, Xu Shang, Su Qin, Du He and others to plan for them, Qi Ming, Zhou Ju, Chen Zhen, Shao Hua, Lou Huan, Di Jing, Su Li, Yue Yi and others to convey their intentions, Wu Qi, Sun Bin, Dai Ta, Er Liang, Wang Liao, Tian Ji, Lian Po, Zhao She and others to command their armies.",
  "s0171": "They once used ten times the territory and million-man armies, looking up at the pass to attack Qin.",
  "s0172": "Qin opened the pass and invited the enemy, the armies of the nine states fled and dared not advance.",
  "s0173": "Qin spent not an arrow or arrowhead, yet the world was already exhausted.",
  "s0174": "Thus the alliances scattered and pacts failed, they competed to divide land and bribe Qin.",
  "s0175": "Qin had surplus strength to exploit their exhaustion, pursued the fleeing and chased the routed, leaving a million corpses, blood flowing to float oars, taking advantage of opportunities, carving up the world, splitting mountains and rivers, strong states seeking submission, weak states coming to court.",
  "s0176": "This continued to Kings Xiaowen and Zhuangxiang, who reigned for short periods with no national affairs.",
  "s0177": "When it came to the First Emperor, he wielded the remaining glory of six generations, brandished the long whip to control the world, swallowed the two Zhou and destroyed the feudal lords, ascended the supreme position and controlled the six directions, held the knotted cane to lash the world, his might shaking the four seas.",
  "s0178": "South he took the land of Baiyue, making Guilin and Xiang commanderies, the Baiyue lords bowed their heads and bound their necks, entrusting their fate to lowly officials.",
  "s0179": "He had Meng Tian build the Great Wall north to guard the frontier, repelling the Xiongnu seven hundred li, the barbarians dared not come south to graze their horses, soldiers dared not draw their bows to avenge grievances.",
  "s0180": "Thus he discarded the former kings' way, burned the hundred schools' writings, to make the common people foolish.",
  "s0181": "He demolished famous cities, killed outstanding men, gathered the world's weapons in Xianyang, melted the sharp blades and cast twelve golden statues, to weaken the world's people.",
  "s0182": "Then he trampled Mount Hua as his city wall, used the river as his moat, occupied the hundred-thousand-zhang city, overlooking the unfathomable gorge for security.",
  "s0183": "Good generals and strong crossbows guarded strategic places, trusted ministers and elite troops displayed sharp weapons and challenged intruders.",
  "s0184": "The world now pacified, the First Emperor's heart considered Guanzhong's security a golden city of a thousand li, an imperial enterprise for his descendants for ten thousand generations.",
  "s0185": "After the First Emperor died, his remaining might shook distant lands.",
  "s0186": "Yet Chen She was the son of a thatched-window, rope-hinge house, a peasant serf, a conscripted laborer.",
  "s0187": "His talent and ability were below average, he did not have Confucius or Mozi's wisdom, Tao Zhu or Yi Dun's wealth.",
  "s0188": "Treading among the ranks of soldiers, bending and bowing among the officers, leading exhausted scattered troops, commanding a few hundred men, he turned and attacked Qin.",
  "s0189": "Cutting wood for weapons, raising poles as flags, the world gathered like clouds in response, carrying grain and following his shadow, the Shandong heroes all rose together and destroyed the Qin clan.",
  "s0190": "Moreover, the world was not small and weak;",
  "s0191": "Yong province's land, Xiao and Han's fortifications remained as before.",
  "s0192": "Chen She's position was not more honored than the lords of Qi, Chu, Yan, Zhao, Han, Wei, Song, Wei, and Zhongshan;",
  "s0193": "hoe handles and thorn spears were not sharper than hooked halberds and long lances;",
  "s0194": "the conscripted crowds were not equal to the nine states' armies;",
  "s0195": "deep plans and far-reaching considerations, the way of marching and using troops, were not equal to the scholars of former times.",
  "s0196": "Yet success and failure changed, achievements were opposite.",
  "s0197": "If one were to have the Shandong states compare length and measure size with Chen She, weigh authority and measure strength, they could not be mentioned in the same year.",
  "s0198": "Yet Qin with a mere small territory.",
  "s0199": "achieved the authority of ten thousand chariots, suppressed the eight provinces and made peers come to court, for more than a hundred years.",
  "s0200": "Then took the six directions as home, Xiao and Han as palace.",
  "s0201": "One man rose in rebellion and the seven ancestral temples fell, his body died by human hands, becoming a laughingstock for the world—what was the reason?"
}