{
  "s0123": "Qi said: 'Govern hundred officials, close ten thousand people, fill treasuries storehouses, you which with Qi?'",
  "s0124": "Wen said: 'Not as good as you.'",
  "s0125": "Qi said: 'Guard Xihé and Qin troops dare not east face, Han Zhao submit follow, you which with Qi?'",
  "s0126": "Wen said: 'Not as good as you.'",
  "s0127": "Qi said: 'These three, you all below me, yet position above me, why?'",
  "s0128": "Wen said: 'Lord young state doubtful, ministers not attached, people not trusting, at this time, entrust to you or entrust to me?'",
  "s0129": "Qi silent good long while, said: 'Entrust to you.'",
  "s0130": "Wen said: 'This is why I reside above you.'",
  "s0131": "Wu Qi then self knew not as good as Tian Wen.",
  "s0132": "Tian Wen having died, Gong Shu became chancellor, married Wei princess, yet harmed Wu Qi.",
  "s0133": "Gong Shu's servant said: 'Qi easy to remove.'",
  "s0134": "Gong Shu said: 'How?'",
  "s0135": "His servant said: 'Wu Qi as person principled frugal yet self loves reputation.",
  "s0136": "Lord thus first with Wu Hou speak: 'Wu Qi worthy person, yet Hou's state small, moreover with strong Qin borders, subject secretly fear Qi has no staying heart.'",
  "s0137": "Wu Hou immediately said: 'How?'",
  "s0138": "Lord thus told Wu Hou: 'Try betroth with princess, Qi has staying heart then certainly accepts.",
  "s0139": "No staying heart then certainly declines.",
  "s0140": "With this divine it.'",
  "s0141": "Lord thus summoned Wu Qi and betrothed with him, immediately made princess angry and belittle lord.",
  "s0142": "Wu Qi seeing princess belittles lord, then certainly declines.'",
  "s0143": "Thus Wu Qi seeing princess belittles Wei chancellor, indeed declined Wei Wu Hou.",
  "s0144": "Wu Hou doubted it yet not believed.",
  "s0145": "Wu Qi feared obtaining crime, thus departed, went to Chu.",
  "s0146": "Chu Dao Wang originally heard Qi worthy, arrived then made chancellor of Chu.",
  "s0147": "Clarified laws examined commands, discarded not urgent officials, abolished ducal clan distant ones, to nurture fighting soldiers.",
  "s0148": "Essentials in strengthening troops, broke galloping persuaders' words of alliances.",
  "s0149": "Thus south pacified hundred Yue;",
  "s0150": "north annexed Chen Cai, repelled three Jin;",
  "s0151": "west attacked Qin."
}