{
  "s0101": "The officials gradually humiliated him.",
  "s0102": "Bo gave a thousand jin of gold to the prison officials, the prison officials then wrote on the back of the documents to show him, saying 'Use the princess as witness.'",
  "s0103": "The princess was Emperor Xiaowen's daughter, Bo's heir Shengzhi married her, so the prison officials taught to cite her as witness.",
  "s0104": "Bo's increased enfeoffments and rewards, all gave to Bo Zhao.",
  "s0105": "When the imprisonment was urgent, Bo Zhao spoke to Empress Bo, the empress also considered there was no rebellion matter.",
  "s0106": "In Emperor Wen's court, the empress lifted Emperor Wen by the front of his robe, said: 'The Marquis of Jiang grasped the emperor's seal, led troops in the northern army, did not rebel at that time, now resides in a small county, why would he want to rebel!'",
  "s0107": "Emperor Wen having seen the Marquis of Jiang's prison statement, then apologized saying: 'The official matters are being verified and he will be released.'",
  "s0108": "Thus sent envoys holding the tally to pardon the Marquis of Jiang, restored rank and fief.",
  "s0109": "The Marquis of Jiang having been released, said: 'I once commanded a million troops, yet how could I know the preciousness of prison officials!'",
  "s0111": "The Marquis of Jiang again went to his fief.",
  "s0112": "Emperor Xiaowen year 11 died, posthumous title Marquis Wu.",
  "s0113": "Son Shengzhi succeeded to the marquisate.",
  "s0114": "Six years, married the princess, did not get along, because of killing someone, state abolished.",
  "s0115": "Cut off for one year, Emperor Wen then selected the Marquis of Jiang's son the worthy one, Hedong governor Yafu, enfeoffed as Marquis of Tiao, continued the Marquis of Jiang's line.",
  "s0116": "Marquis Tiao Yafu from when not yet marquis served as Hedong governor, Xu Fu physiognomized him, said: 'Sir after three years will be marquis.",
  "s0117": "Marquis eight years will be general and chancellor, hold the state's reins, honored and important, among ministers unparalleled.",
  "s0118": "Afterwards nine years sir will starve to death.'",
  "s0119": "Yafu laughed saying: 'My elder brother has already succeeded father as marquis, if he dies, his son should succeed, why would Yafu become marquis?",
  "s0120": "Yet if already honored as Fu said, why speak of starving to death?",
  "s0121": "Show me.'",
  "s0122": "Xu Fu pointed to his mouth saying: 'There is a vertical line entering the mouth, this is the method of starving to death.'",
  "s0123": "After three years, his elder brother Marquis Jiang Shengzhi committed a crime, Emperor Xiaowen selected the Marquis of Jiang's worthy sons, all recommended Yafu, so enfeoffed Yafu as Marquis of Tiao, continued the Marquis of Jiang's line.",
  "s0124": "Six years after Emperor Wen, the Xiongnu greatly invaded the border.",
  "s0125": "Thus appointed the Imperial Clan Court Minister Liu Li as general, stationed at Bashang;",
  "s0126": "Marquis Zhuzi Xu Li as general, stationed at Jimen;",
  "s0127": "appointed Hedong governor Yafu as general, stationed at Xiliu: to prepare against the Xiongnu.",
  "s0128": "The emperor personally inspected the troops.",
  "s0129": "Arriving at Bashang and Jimen armies, drove straight in, the generals and below rode to greet.",
  "s0130": "Soon went to the Xiliu army, the soldiers and officers wore armor, sharpened weapons and blades, drew bows and crossbows, held them at full draw.",
  "s0131": "The emperor's advance guard arrived, could not enter.",
  "s0132": "The advance guard said: 'The Son of Heaven is about to arrive!'",
  "s0133": "The army gate commandery lieutenant said: 'The general's order says \"in the army hear the general's command, not hear the Son of Heaven's decree\".'",
  "s0134": "Shortly after, the emperor arrived, again could not enter.",
  "s0135": "Thus the emperor sent envoys holding the tally to decree the general: 'I wish to enter and inspect the army.'",
  "s0136": "Yafu then transmitted orders to open the rampart gate.",
  "s0137": "The rampart gate soldiers and officers told the following chariots and cavalry: 'The general's agreement—no driving and galloping in the army.'",
  "s0138": "Thus the Son of Heaven held the reins and walked slowly.",
  "s0139": "Arriving at the camp, General Yafu held his weapon and bowed saying: 'Armored soldiers do not bow, please receive with military ritual.'",
  "s0140": "The Son of Heaven was moved, changed expression and stood in the chariot.",
  "s0141": "Had someone convey thanks: 'The emperor respectfully inspects the general.'",
  "s0142": "Completed the ritual and left.",
  "s0143": "Having left the army gate, all the ministers were astonished.",
  "s0144": "Emperor Wen said: 'Alas, this is truly a general!",
  "s0145": "Previously the Bashang and Jimen armies were like children's play, their generals could certainly be surprised and captured.",
  "s0146": "As for Yafu, can he be offended?'",
  "s0147": "Praised him for a long time.",
  "s0148": "More than a month, the three armies were all disbanded.",
  "s0149": "Thus appointed Yafu as Commandant of the Guards.",
  "s0150": "When Emperor Xiaowen was about to pass away, admonished the crown prince saying: 'If there is emergency, Zhou Yafu truly can be entrusted to lead troops.'",
  "s0151": "Emperor Wen passed away, appointed Yafu as Chariot and Cavalry General."
}