{
  "s0102": "Thus entered the passes, gathered scattered troops and again went east.",
  "s0103": "The next year, Marquis Huaiyin defeated Qi, established himself as King of Qi, sent envoys to inform the King of Han.",
  "s0104": "The King of Han greatly angered and cursed, Chen Ping stepped on the King of Han's foot.",
  "s0105": "The King of Han also awoke, then treated the Qi envoy generously, had Zhang Zifang finally establish Xin as King of Qi.",
  "s0106": "Enfeoffed Ping with Huyou township.",
  "s0107": "Used his extraordinary strategies, ultimately extinguished Chu.",
  "s0108": "Constantly as Protector of the Army Commandant followed in pacifying King Yan Zang Tu.",
  "s0109": "Han year 6, someone submitted a memorial accusing King Chu Han Xin of rebellion.",
  "s0110": "Gaozu asked the generals, the generals said: 'Urgently dispatch troops and bury the bastard.'",
  "s0111": "Gaozu was silent.",
  "s0112": "Asked Chen Ping, Ping firmly declined and apologized, said: 'What do the generals say?'",
  "s0113": "The emperor fully told him.",
  "s0114": "Chen Ping said: 'The person who submitted the memorial saying Xin rebels—does anyone know about it?'",
  "s0115": "Said: 'None.'",
  "s0116": "Said: 'Does Xin know about it?'",
  "s0117": "Said: 'Does not know.'",
  "s0118": "Chen Ping said: 'Your majesty's elite troops compared to Chu's?'",
  "s0119": "The emperor said: 'Cannot surpass.'",
  "s0120": "Ping said: 'Your majesty's generals who use troops—any who surpass Han Xin?'",
  "s0121": "The emperor said: 'None match.'",
  "s0122": "Ping said: 'Now troops are not as elite as Chu's, generals cannot match, yet raise troops to attack him—this is rushing him into battle, I secretly worry for your majesty.'",
  "s0123": "The emperor said: 'What to do?'",
  "s0124": "Ping said: 'In ancient times the Son of Heaven toured and inspected, assembled the feudal lords.",
  "s0125": "In the south there is Yunmeng, your majesty should go out pretending to tour Yunmeng, assemble the feudal lords at Chen.",
  "s0126": "Chen is Chu's western border, Xin hearing the Son of Heaven goes out on a pleasure tour, by necessity he will have no affairs and come to welcome and greet in the suburbs.",
  "s0127": "When he greets, your majesty then captures him—this is particularly the work of one strongman.'",
  "s0128": "Gaozu considered it right, so sent envoys to inform the feudal lords to assemble at Chen, 'I will tour south to Yunmeng.'",
  "s0129": "The emperor then followed to go.",
  "s0130": "Before reaching Chen, King Chu Xin indeed came to welcome in the suburbs on the road.",
  "s0131": "Gaozu had prepared warriors in advance, seeing Xin arrive, immediately seized and bound him, loaded him in the rear carriage.",
  "s0132": "Xin called out: 'The realm is already settled, I certainly should be boiled!'",
  "s0133": "Gaozu turned and told Xin: 'You be silent!",
  "s0134": "Your rebellion is clear!'",
  "s0135": "The warriors bound him with hands behind back.",
  "s0136": "Thus assembled the feudal lords at Chen, completely pacified Chu territory.",
  "s0137": "Returned to Luoyang, pardoned Xin to be Marquis of Huaiyin, and with the meritorious officials shared the tally and determined enfeoffments.",
  "s0138": "Thus shared the tally with Ping, never to be extinguished generation after generation, as Marquis of Huyou.",
  "s0139": "Ping declined, saying: 'This is not your servant's merit.'",
  "s0140": "The emperor said: 'I used sir's strategies, won victories and conquered enemies—what is this if not merit?'",
  "s0141": "Ping said: 'Without Wei Wuzhi how could your servant advance?'",
  "s0142": "The emperor said:",
  "s0143": "'You can be called one who does not forget his roots.'",
  "s0144": "Thus again rewarded Wei Wuzhi.",
  "s0145": "The next year, as Protector of the Army Commandant followed in attacking the rebel King Han Xin in Dai.",
  "s0146": "Ultimately reached Pingcheng, was surrounded by the Xiongnu, seven days without food.",
  "s0147": "Gaozu used Chen Ping's extraordinary strategy, sent gifts to the Chanyu's consort, the siege thus lifted.",
  "s0148": "Gaozu having left, the strategy was secret, the world could not hear it.",
  "s0149": "Gaozu passing south through Qu Ni, ascended its city wall, saw its buildings were very large, said: 'Magnificent county!",
  "s0150": "I have traveled the realm, only seen Luoyang and this.'",
  "s0151": "Turned and asked the imperial secretary: 'How many households does Qu Ni have?'"
}