{
  "s0201": "Wu Xu returned and said: 'I have already obtained the tally.'",
  "s0202": "Jian Zi said: 'Play it.'",
  "s0519": "Therefore ritual does not necessarily follow one path, and what benefits the state does not necessarily follow antiquity.",
  "s0520": "When sages arise they do not imitate each other and become kings, when Xia and Yin declined they did not change rituals and perish.",
  "s0521": "Thus returning to antiquity cannot be criticized, and following ritual is not sufficiently praiseworthy.",
  "s0522": "Moreover, wearing strange clothing leads to licentious ambitions, but this means Zou and Lu have no extraordinary conduct;",
  "s0523": "when customs are deviant the people are easily led astray, but this means Wu and Yue have no outstanding scholars.",
  "s0524": "Moreover, sages call benefiting the body 'clothing', call facilitating affairs 'ritual'.",
  "s0525": "The regulations of advancing and retreating, the systems of clothing—these are for regulating ordinary people, not for discussing worthy people.",
  "s0526": "Therefore ordinary people follow customs and flow with them, worthy people follow change together with it.",
  "s0527": "Therefore the proverb says 'Using books to control chariots does not exhaust the horse's feelings, using ancient systems to control the present does not reach the changes of affairs.'",
  "s0528": "Following law's merit is not sufficient to stand above the age;",
  "s0529": "studying antiquity is not sufficient to control the present.",
  "s0530": "You do not understand this.'",
  "s0531": "So he adopted Hunnic clothing and recruited cavalry archers.",
  "s0532": "In the twentieth year, the king attacked Zhongshan territory, reaching Ning Jia;",
  "s0533": "west he attacked Hu territory, reaching Yu Zhong.",
  "s0534": "The Lin Hu king offered horses.",
  "s0535": "Returning, he sent Lou Huan to Qin, Qiu Ye to Han, Wang Ben to Chu, Fu Ding to Wei, Zhao Jue to Qi.",
  "s0536": "He had merchants carry money and valuables out to the Hu and Di.",
  "s0537": "In the twenty-first year, he attacked Zhongshan.",
  "s0538": "Zhao Chan served as right army, Xu Ju served as left army, Prince Zhang served as center army, Wang Jian served as assistant general.",
  "s0539": "He took Eyang city, attacked Chi Li and Yi An.",
  "s0540": "Li Dui led Hu and Di troops as assistant general.",
  "s0541": "With ten thousand troops he attacked Zhongshan and captured it.",
  "s0542": "Zhao Qi served as commander for attacking and taking, together with Yan Ju attacked Xiang and captured it.",
  "s0543": "Then captured Yan army, burned Qi boats.",
  "s0544": "In the twenty-third year, he attacked Song.",
  "s0545": "Prince Chao served as right army, Sima Kui led left army, Su Li served as assistant general.",
  "s0546": "They took Song minister Niu Shou.",
  "s0547": "In the twenty-fourth year, he attacked Wei.",
  "s0548": "Jian served as commander of the generals, defeated Wei army, beheaded fifteen thousand.",
  "s0549": "Took Wei Miao Qiu, Yu Qiu, Xu Zhou.",
  "s0550": "In the twenty-fifth year, Empress Hui died.",
  "s0551": "He sent Zhou Chan in Hunnic clothing to escort Prince Zi He.",
  "s0552": "Prince Zi He did not return for three years.",
  "s0553": "In the twenty-sixth year, he again attacked Zhongshan, expanded territory north to Yan and Dai, west to Yun Zhong and Jiu Yuan.",
  "s0554": "In the twenty-seventh year, fifth month wu shen day, grand court at Wu Ling Palace.",
  "s0555": "He transmitted the state, established Prince Zi He as Hui Wen Wang.",
  "s0556": "And he himself was called Chief Father.",
  "s0557": "Chief Father wanted his son to govern the state, while he wore Hunnic clothing and practiced cavalry archery to prepare against Yan and the three Jin, north to seize Hu territory.",
  "s0558": "But Crown Prince Hui Wen Wang was young, married a woman from Wei whose surname was Hui Empress.",
  "s0559": "Hui Wen Wang died, son Xiao Cheng Wang ascended.",
  "s0560": "Chief Father died, buried at Fei.",
  "s0561": "His ministers and sons all wore Hunnic clothing.",
  "s0562": "In the twenty-ninth year, first month new moon day, there was a solar eclipse.",
  "s0563": "Xiao Cheng Wang first year, he changed the crown prince.",
  "s0564": "At this time, Yan Ji Shi Fu rebelled, killed Yan crown prince Dan.",
  "s0565": "Xiao Cheng Wang second year, attacked Yan, captured Zhong Yang.",
  "s0566": "Third year, attacked Zhao Wang.",
  "s0567": "Fourth year, General Zhu Shi attacked Yan, took Liao Dong.",
  "s0568": "Fifth year, Yan general Cheng An Jun Gong Sun Cao killed Chief Father.",
  "s0569": "Sixth year, enfeoffed eldest son Zhang as Dai An Jun.",
  "s0570": "Ninth year, Zhao Liang general defeated Wei Jia Yi.",
  "s0571": "Eleventh year, walled Yuan Shi, made it a county.",
  "s0572": "Qin attacked Wei, took our Ye.",
  "s0573": "Twelfth year, the crown prince followed the army attacking Wei, Gan Mao killed Guang.",
  "s0574": "Xiao Cheng Wang died, son Dao Xiang Wang ascended.",
  "s0575": "Dao Xiang Wang first year, great amnesty.",
  "s0576": "Second year, summoned Prince Jia from Yan, brought him back.",
  "s0577": "Third year, the crown prince died.",
  "s0578": "Fourth year, the crown prince newly ascended as king.",
  "s0579": "Sixth year, enfeoffed Prince Jia as Zhao Wang.",
  "s0580": "Made Fei Yi chancellor, concurrently tutor to the king.",
  "s0581": "Fei Yi advised: 'Exceeding and being able to return, though lowly will certainly be noble;",
  "s0582": "losing and not being able to return, though noble will certainly be lowly.",
  "s0583": "Now your servant can raise his clan, your servant considers it a goblet of respect.",
  "s0584": "The Odes say 'There is no one who does not have a beginning, few can have an end.''",
  "s0585": "Your servant wishes to have an end.'",
  "s0586": "Seventh year, Yan attacked Sha Qiu.",
  "s0587": "Eighth year, walled Nan Xing Tang.",
  "s0588": "Ninth year, Zhao Liang general defeated Yan army at Li.",
  "s0589": "Tenth year, attacked Yan, took Li and Yang Cheng.",
  "s0590": "Yan made peace.",
  "s0591": "Eleventh year, Qin attacked Wei, took our two cities.",
  "s0592": "Twelfth year, Qin attacked Wei, took our Ye, returned it to Wei.",
  "s0593": "Thirteenth year, Qin attacked Ding Jing, took Zhao Ru Nan.",
  "s0594": "Fourteenth year, Qin troops took our Lan and Yu.",
  "s0595": "Fifteenth year, grand court at Handan, summoned feudal lords as assistants.",
  "s0596": "Sixteenth year, Qin extinguished Zhou.",
  "s0597": "Dao Xiang Wang died, son You Mu Wang Qian ascended.",
  "s0598": "First year, walled Bo Ren.",
  "s0599": "Second year, Qin attacked Yan, took Li and Yang Cheng.",
  "s0600": "Third year, Qin attacked Wei, took our An Yi.",
  "s0601": "Fourth year, Qin attacked Han, took Zhao city."
}
