{
  "s0051": "When the empress dowager passed away, King Langye Ze said: 'The emperor is young, the various Lü hold power, the Liu clan is isolated and weak.'",
  "s0052": "He then led troops west in conspiracy with the King of Qi, wishing to execute the various Lü.",
  "s0053": "When they reached Liang, hearing that Han had sent General Guan to garrison Xingyang, Ze returned his troops to defend the western border, then galloped swiftly to Chang'an.",
  "s0054": "The King of Dai also arrived from Dai.",
  "s0055": "The various generals together with the King of Langye commonly established the King of Dai as Son of Heaven.",
  "s0056": "The Son of Heaven then moved Ze to become King of Yan, and returned Langye to Qi, restoring the old territory.",
  "s0057": "Ze ruled Yan for two years, passed away, and was given the posthumous title King Jing.",
  "s0058": "He passed the throne to his son Jia, who became King Kang.",
  "s0059": "Down to his grandson Dingguo, who committed adultery with his father King Kang's concubine, fathering one son.",
  "s0060": "He seized his younger brother's wife as a concubine.",
  "s0061": "He committed adultery with three daughters.",
  "s0062": "Dingguo wished to execute a minister Fei, so he ordered the man from Ying to do it. The man from Ying and others informed on Dingguo, so Dingguo ordered the usher to indict and arrest them on other charges, executing them to silence them.",
  "s0063": "In Yuanshuo year 1, the man from Ying's brothers submitted another memorial fully detailing Dingguo's secret affairs, and thus it was discovered.",
  "s0064": "The edict was issued to the ministers, and all discussed saying: 'Dingguo's conduct is that of beasts, disrupting human relationships, opposing heaven—he should be executed.'",
  "s0065": "The emperor approved it.",
  "s0066": "Dingguo committed suicide, and the state was abolished to become a commandery.",
  "s0067": "The Grand Historian says: King Jing became king because in the early Han, when the realm was not yet settled, thus although Liu Jia was distantly related, he was nevertheless made king through strategy, filling the region between the Jiang and Huai.",
  "s0068": "Liu Ze's kingship was provoked by the Lü clan's power, yet Liu Ze ultimately faced south and claimed isolation for three generations.",
  "s0069": "The events that occurred were significant—how can this not be considered remarkable!"
}