{
  "s0001": "Emperor Xiaojing's sons who became kings altogether numbered thirteen, with five mothers—those of the same mother were clan relatives.",
  "s0002": "Consort Li's sons were Rong, De, and A Yu.",
  "s0003": "Consort Cheng's sons were Yu, Fei, and Duan.",
  "s0004": "Lady Jia's sons were Pengzu and Sheng.",
  "s0005": "Consort Tang's son was Fa.",
  "s0006": "Lady Wang, née Xu's sons were Yue, Ji, Cheng, and Shun.",
  "s0007": "King Xian of Hejian, De, was made King of Hejian as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0008": "He loved Confucian learning, in his clothing and hasty actions he always followed Confucian scholars.",
  "s0009": "Confucian scholars of Shandong mostly followed him in study.",
  "s0010": "He died in year 26, his son King Gong Bu Hai succeeded.",
  "s0011": "He died in year 4, his son King Gang Ji succeeded.",
  "s0012": "He died in year 12, his son King Qing Shou succeeded.",
  "s0013": "King Ai of Linjiang, A Yu, was made King of Linjiang as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0014": "He died in year 3, no heirs, kingdom abolished to become a commandery.",
  "s0015": "King Min of Linjiang, Rong, was made crown prince in Emperor Xiaojing's fourth year before his reign, deposed in year 4, made King of Linjiang using the former crown prince.",
  "s0016": "In year 4, because he encroached on the temple boundary wall to make palaces, the emperor summoned Rong.",
  "s0017": "Rong departed, took leave at Jiangling's north gate.",
  "s0018": "Having already boarded the carriage, the axle broke and the carriage was ruined.",
  "s0019": "The elders of Jiangling wept secretly saying: 'Our king will not return!'",
  "s0020": "Rong arrived, went to the Commandant's office for registration.",
  "s0021": "Commandant Zhi Du interrogated the king, the king feared, committed suicide.",
  "s0022": "Buried in Lantian.",
  "s0023": "Several ten thousand swallows carried earth and placed it on the tomb, the people pitied him.",
  "s0024": "Rong was the eldest, died without heirs, kingdom abolished, territory entered Han, became Nanhun commandery.",
  "s0025": "The above three kingdoms—the original kings were all Consort Li's sons.",
  "s0026": "King Gong of Lu, Yu, was made King of Huaiyang as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0027": "In year 2, after Wu and Chu rebellion was defeated, in Emperor Xiaojing's third year before his reign he was transferred to be King of Lu.",
  "s0028": "He loved constructing palaces, parks, gardens, dogs, and horses.",
  "s0029": "In his later years he loved music, did not like literary debate.",
  "s0030": "As a person he was gluttonous.",
  "s0031": "He died in year 26, his son Guang succeeded as king.",
  "s0032": "Initially he loved music and carriages and horses;",
  "s0033": "in his later years he was miserly, fearing only insufficiency of wealth.",
  "s0034": "King Yi of Jiangdu, Fei, was made King of Runan as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0035": "When Wu and Chu rebelled, Fei at age 15 had talent and strength, submitted a memorial wishing to attack Wu.",
  "s0036": "Emperor Jing granted Fei the general's seal, attacked Wu.",
  "s0037": "Wu already defeated, two years later, transferred to be King of Jiangdu, governing Wu's former kingdom, granted the Son of Heaven's banners and flags for military merit.",
  "s0038": "Yuanguang year 5, Xiongnu greatly invaded Han as bandits, Fei submitted memorial wishing to attack Xiongnu, the emperor did not permit.",
  "s0039": "Fei loved martial valor, constructed palaces and towers, recruited heroes and outstanding men from the four directions, extremely arrogant and extravagant.",
  "s0040": "Reigned 26 years died, his son Jian Li succeeded as king.",
  "s0041": "Seven years later committed suicide.",
  "s0042": "When Huainan and Hengshan plotted rebellion, Jian heard much of their plotting.",
  "s0043": "Considering his kingdom near Huainan, fearing one day they would rise and be annexed by them, he secretly made weapons, and often wore his father-granted general's seal, carried the Son of Heaven's flags when going out.",
  "s0044": "King Yi died not yet buried, Jian was attracted to King Yi's favored beauty Nao Ji, at night sent men to welcome her and have illicit relations in the mourning residence.",
  "s0045": "When Huainan matters arose, investigating the conspirators included Jian and King Jian of Jiangdu.",
  "s0046": "Jian feared, thus sent men carrying much gold and money to settle and end the case.",
  "s0047": "And moreover trusted sorcerers and shamans, had men pray and sacrifice with reckless words.",
  "s0048": "Jian moreover had illicit relations with all his sisters and younger brothers.",
  "s0049": "The matters having been heard, Han dukes and ministers requested to arrest and punish Jian.",
  "s0050": "The Son of Heaven could not bear it, sent ministers to interrogate the king on site."
}