{
  "s0201": "Emperor Wu then personally went to welcome and take her.",
  "s0202": "Clearing the way, first sending out the feathered cavalry from the Hengcheng Gate, the imperial carriage galloped to Changling.",
  "s0203": "At the small market, west into the alley, the alley gate was closed, they forcibly opened the gate, the imperial carriage went straight into this alley, proceeding until stopping outside the Jin family's gate, ordering armed cavalry to surround their residence, fearing she would flee, personally going to fetch her so she could not escape.",
  "s0204": "He then ordered the ministers on his left and right to enter and call for her.",
  "s0205": "The family was alarmed and terrified, the girl fled and hid under the bed inside.",
  "s0206": "They supported her out the door and ordered her to make obeisance.",
  "s0207": "Emperor Wu alighted from his carriage and wept, saying: \"Ah!",
  "s0208": "Elder sister, why did you hide so deeply!\"",
  "s0209": "He ordered the secondary carriage to carry her, turned the carriage around and galloped back, going straight into Changlegong Palace.",
  "s0210": "He issued orders to the gate officials to record her name and permit passage to audience with the empress dowager.",
  "s0211": "The empress dowager said: \"The emperor is weary, where has he come from?\"",
  "s0212": "The emperor said: \"Today I went to Changling and obtained my subject-sister, and have come together with her.\"",
  "s0213": "He turned and said: \"Audience with the empress dowager!\"",
  "s0214": "The empress dowager said: \"Are you so-and-so's daughter?\"",
  "s0215": "She said: \"Yes.\"",
  "s0216": "The empress dowager wept below, and the girl also prostrated herself and wept.",
  "s0217": "Emperor Wu presented wine and toasted her longevity, bestowed ten million cash, three hundred slaves and maids, one hundred qing of public fields, and an armored residence, to grant to his sister.",
  "s0218": "The empress dowager declined, saying: \"This costs the emperor too much.\"",
  "s0219": "Therefore, he summoned Princess Pingyang, Princess Nangong, and Princess Linlü, the three of them, to come and audience with their sister, and thus styled her Lord Xiucheng.",
  "s0220": "She had one son and one daughter.",
  "s0221": "The son was styled Xiuchengzi Zhong, the daughter became queen consort to various feudal kings.",
  "s0222": "These two children were not of the Liu clan, therefore the empress dowager pitied them.",
  "s0223": "Xiuchengzi Zhong was arrogant and unrestrained, bullying officials and people, all suffered bitterly from him.",
  "s0224": "Wei Zifu was established as empress, her younger brother Wei Qing styled Zhongqing, as Grand General was enfeoffed as Marquis of Changping.",
  "s0225": "He had four sons: the eldest son Kang became heir to the marquisate, the heir to the marquisate often served in attendance, honored and favored.",
  "s0226": "His three younger brothers were all enfeoffed as marquises, each with thirteen hundred households: one called Marquis of Yin'an, two called Marquis of Fagan, three called Marquis of Yichun, their honor shook the realm.",
  "s0227": "The realm sang of it, saying: \"No joy in bearing sons, no anger in bearing daughters, don't you see Wei Zifu dominating the realm!\"",
  "s0229": "At this time Princess Pingyang lived as a widow, and should marry a marquis to become princess consort.",
  "s0230": "The princess discussed with her attendants which marquises in Chang'an could become her husband, and all said the Grand General could.",
  "s0231": "The princess laughed and said: \"This man came from my household, he always rode as an escort following me in and out, how could I take him as husband?\"",
  "s0232": "The attendants serving on the left and right said: \"Now the Grand General's sister is empress, his three sons are marquises, their wealth and honor shake the realm—princess, what could you exchange for this?\"",
  "s0233": "Therefore the princess agreed to it.",
  "s0234": "She spoke of it to the empress, who informed Emperor Wu, and he issued an edict that General Wei should marry Princess Pingyang.",
  "s0235": "Master Chu says: A husband undergoes dragon transformation.",
  "s0236": "The tradition says: \"When a snake transforms into a dragon, it does not change its patterns;",
  "s0237": "When a family transforms into a state, it does not change its surname.\"",
  "s0238": "When a husband at the time achieves wealth and honor, all evils are eliminated, brilliance and glory flourish—what burden is poverty and lowliness!",
  "s0239": "During Emperor Wu's time, Lady Yin the Pure Consort was favored.",
  "s0240": "Lady Xing was styled Jiao'e, people called her \"Jiao He.\"",
  "s0241": "Jiao He ranked equivalent to middle two thousand piculs, Ronghua ranked equivalent to two thousand piculs, Pure Consort ranked equivalent to marquises.",
  "s0242": "It was customary to promote from Pure Consort to empress.",
  "s0243": "Lady Yin and Lady Xing were favored at the same time, with an edict that they should not meet each other.",
  "s0244": "Lady Yin personally requested Emperor Wu, wishing to see Lady Xing, and the emperor permitted it.",
  "s0245": "He immediately ordered another lady to be adorned, with several dozen carriage attendants, to come forward as Lady Xing.",
  "s0246": "Lady Yin came forward and saw her, saying: \"This is not Lady Xing's body.\"",
  "s0247": "The emperor said: \"How do you know?\"",
  "s0248": "She replied: \"Looking at her body, appearance, and form, they are insufficient to match the ruler.\"",
  "s0249": "Therefore the emperor issued an edict ordering Lady Xing to wear her old clothes and come forward alone.",
  "s0250": "Lady Yin gazed upon her and said: \"This is truly she.\"",
  "s0251": "Therefore she lowered her head and wept, pained that she herself was inferior."
}