{
  "s0520": "Entering the duke's gate, bowing like;",
  "s0521": "hurrying forward, winged like.",
  "s0522": "Lord summoned to act as host, color stern like.",
  "s0523": "Lord commanded summon, did not wait for harness departed.",
  "s0524": "Fish spoiled, meat rotten, cut not proper, not eat.",
  "s0525": "Mat not proper, not sit.",
  "s0526": "Eating at the side of mourners, never full.",
  "s0527": "That day cried, then not sing.",
  "s0528": "Seeing mourning garments, blind people, though children must change.",
  "s0529": "'Three walking, must get my teacher.'",
  "s0530": "'Virtue not cultivated, learning not lectured, hearing righteousness cannot move, not good cannot change, this is my worry.'",
  "s0531": "Made people sing, good, then made repeat, then harmonized with it.",
  "s0532": "Did not speak of: strange, force, disorder, spirits.",
  "s0533": "Zi Gong said: 'The Master's culture can be heard.",
  "s0534": "The Master speaking of heavenly way and human nature, cannot be heard.'",
  "s0535": "Yan Yuan sighed deeply: 'Gaze up increasingly high, drill increasingly firm.",
  "s0536": "Look ahead, suddenly behind.",
  "s0537": "The Master step by step skillfully guides people, broadens me with culture, restrains me with ritual, wish to stop cannot.",
  "s0538": "Having exhausted my talent, as if standing, outstanding.",
  "s0539": "Though wish to follow, no way.'",
  "s0540": "Da Xiang village child said: 'Great indeed Confucius, broadly learned yet has no accomplished name.'",
  "s0541": "Heard it, said: 'What do I hold?",
  "s0542": "Hold charioteering?",
  "s0543": "Hold archery?",
  "s0544": "I hold charioteering.'",
  "s0545": "Lao said: 'Master said \"not tested, thus arts\".'",
  "s0547": "Lu Ai Gong fourteenth year spring, hunted Great Wilds.",
  "s0548": "Shusun family charioteer Zi Chu Shang captured beast, considered inauspicious.",
  "s0549": "Zhong Ni viewed it, said: 'A qilin.'",
  "s0550": "Took it.",
  "s0551": "Said: 'River does not produce diagram, Luo does not produce book, I am finished!'",
  "s0552": "Yan Yuan died, Confucius said: 'Heaven destroys me!'",
  "s0553": "When western hunt saw qilin, said: 'My Way is exhausted!'",
  "s0554": "Sighed deeply: 'None know me!'",
  "s0555": "Zi Gong said: 'Why none know master?'",
  "s0556": "Said: 'Not resent heaven, not blame people, study below reach above, those who know me, heaven!'",
  "s0558": "'Not lower their will, not disgrace their person, Bo Yi, Shu Qi!'",
  "s0559": "Said 'Liu Xia Hui, Shao Lian lowered will disgraced person.'",
  "s0560": "Said 'Yu Zhong, Yi Yi hidden dwelling loose words, conduct midst pure, abandoned midst balance'.",
  "s0561": "'I then different from this, no can no cannot.'",
  "s0563": "Said: 'Alas alas, gentleman grieves dying in age and name not fitting.",
  "s0564": "My Way not practiced, how can I appear to later generations?'",
  "s0565": "Thus based on historical records composed Spring and Autumn, above to Yin Gong, below ends Ai Gong fourteenth year, twelve dukes.",
  "s0566": "Based on Lu, close to Zhou, thus Yin, moved through three dynasties.",
  "s0567": "Concised their words pointed broadly.",
  "s0568": "Therefore Wu Chu lords self-called kings, but Spring and Autumn demoted them as 'zi';",
  "s0569": "Jian Tu meeting actually summoned Zhou Son of Heaven, but Spring and Autumn euphemized as 'Heavenly King hunted at He Yang': push this category to bind the present age.",
  "s0570": "Demote damage meanings, later kings will raise and expand them.",
  "s0571": "Spring and Autumn meanings practiced, then All Under Heaven's rebellious ministers and villainous sons fear.",
  "s0572": "Confucius in position heard lawsuits, literary phrases had what could be shared with others, not possessed alone."
}