{
  "s0001": "The ancestors of the Zhao clan shared a common origin with Qin.",
  "s0002": "Down to Zhongyan, who served as charioteer to Emperor Da Jia.",
  "s0003": "In later generations, Fei Lian had two sons, and he named one son E Lai, who served King Zhou and was killed by Zhou. His descendants became Qin.",
  "s0004": "E Lai's younger brother was called Ji Sheng, and his descendants became Zhao.",
  "s0005": "Ji Sheng gave birth to Meng Zeng.",
  "s0006": "Meng Zeng was favored by King Cheng of Zhou and was called Zhai Gao Lang.",
  "s0007": "Gao Lang gave birth to Heng Fu, Heng Fu gave birth to Zao Fu.",
  "s0008": "Zao Fu was favored by King Mu of Zhou.",
  "s0009": "Zao Fu obtained the finest horses from Ji, along with the Peach Forest stallions Li, Hua Liu, and Lu Er, and presented them to King Mu.",
  "s0010": "King Mu had Zao Fu drive the chariot on a western inspection tour where he met the Queen Mother of the West and was so delighted he forgot to return.",
  "s0011": "Then King Xu of Xu rebelled, so King Mu raced a thousand li in one day to attack King Xu of Xu and greatly defeated him.",
  "s0012": "He then granted Zao Fu the city of Zhao, and from this came the Zhao clan.",
  "s0013": "From Zao Fu down six generations to Yan Fu, called Gong Zhong. During King Xuan of Zhou's time, he campaigned against the Rong and served as charioteer.",
  "s0014": "At the battle of Qian Mu, Yan Fu rescued King Xuan.",
  "s0015": "Yan Fu gave birth to Shu Dai.",
  "s0016": "During Shu Dai's time, King You of Zhou was tyrannical, so he left Zhou and went to Jin, serving Marquis Wen of Jin, and first established the Zhao clan in Jin.",
  "s0017": "From Shu Dai downward, the Zhao lineage grew increasingly prominent, and after five generations came Zhao Su.",
  "s0018": "Zhao Su, in the sixteenth year of Duke Xian of Jin, attacked Huo, Wei, and Geng, and Zhao Su served as general attacking Huo.",
  "s0019": "The Lord of Huo fled to Qi.",
  "s0020": "Jin suffered a great drought, they divined it, saying 'Mount Tai of Huo is causing the trouble.'",
  "s0021": "They had Zhao Su summon the Lord of Huo from Qi and restore him, to maintain the sacrifices to Mount Tai of Huo, and Jin again became fertile.",
  "s0022": "Duke Xian of Jin granted Zhao Su Geng.",
  "s0023": "Su gave birth to Gong Meng, during the first year of Duke Min of Lu.",
  "s0024": "Gong Meng gave birth to Zhao Shuai, courtesy name Zi Yu.",
  "s0025": "Zhao Shuai divined serving Duke Xian of Jin and the various princes, none were auspicious;",
  "s0026": "divining serving Prince Chong Er was auspicious, so he served Chong Er.",
  "s0027": "Chong Er fled to the Di due to the Li Ji disturbance, Zhao Shuai followed.",
  "s0028": "The Di attacked Mao Jiu Ru, obtained two women, the Di married the younger daughter to Chong Er, the elder daughter to Zhao Shuai who gave birth to Dun.",
  "s0029": "Initially, when Chong Er was in Jin, Zhao Shuai's wife also gave birth to Zhao Tong, Zhao Kuo, Zhao Ying Qi.",
  "s0030": "Zhao Shuai followed Chong Er in exile, altogether nineteen years, and returned to the state.",
  "s0031": "Chong Er became Duke Wen of Jin, Zhao Shuai became minister of Yuan, resided in Yuan, managed state affairs.",
  "s0032": "The reasons Duke Wen returned to the state and became hegemon were mostly Zhao Shuai's strategies, as recorded in the Jin affairs.",
  "s0033": "After Zhao Shuai returned to Jin, Jin's wife insisted on welcoming the Di wife, and established her son Dun as the proper heir, Jin's wife's three sons all served him below.",
  "s0034": "In the sixth year of Duke Xiang of Jin, Zhao Shuai died, posthumously titled Cheng Ji.",
  "s0035": "Zhao Dun succeeded Cheng Ji in managing state affairs for two years when Duke Xiang of Jin died, Crown Prince Yi Gao was young.",
  "s0036": "Dun, because the state had many difficulties, wanted to establish Duke Xiang's younger brother Yong.",
  "s0037": "Yong was then in Qin, sent envoys to welcome him.",
  "s0038": "The crown prince's mother day and night wept, kowtowing to Zhao Dun saying: 'What crime did my late lord commit, abandoning his proper son and seeking another lord?'",
  "s0039": "Zhao Dun was troubled by this, fearing his clan and the ministers would attack and execute him, so he established the crown prince, this was Duke Ling, and sent troops to block those welcoming Duke Xiang's younger brother from Qin.",
  "s0040": "After Duke Ling ascended, Zhao Dun increasingly monopolized state affairs.",
  "s0041": "Duke Ling ascended for fourteen years, becoming increasingly arrogant.",
  "s0042": "Zhao Dun repeatedly remonstrated, Duke Ling did not listen.",
  "s0043": "When eating bear paw, it was not cooked thoroughly, he killed the cook, held the corpse out, Zhao Dun saw it.",
  "s0044": "Duke Ling from this became fearful, wanting to kill Dun.",
  "s0045": "Dun was always benevolent and loved people, once a hungry person he fed under the mulberry tree later defended and saved Dun, Dun thereby escaped.",
  "s0046": "Before leaving the borders, Zhao Chuan assassinated Duke Ling and established Duke Xiang's younger brother Hei Tun, this was Duke Cheng.",
  "s0047": "Zhao Dun returned again, managed state affairs.",
  "s0048": "The gentleman criticizes Dun 'as chief minister, in exile did not leave the borders, returning did not punish the traitor', therefore the Grand Historian wrote 'Zhao Dun assassinated his lord.'",
  "s0049": "During Duke Jing of Jin's time Zhao Dun died, posthumously titled Xuan Meng, son Shuo succeeded.",
  "s0050": "Zhao Shuo, in the third year of Duke Jing of Jin, Shuo served as Jin's lower army general to save Zheng, battled Chu King Zhuang on the river.",
  "s0051": "Shuo married Duke Cheng of Jin's elder sister as wife.",
  "s0052": "In the third year of Duke Jing of Jin, minister Tu An Jia wanted to execute the Zhao clan.",
  "s0053": "Initially, when Zhao Dun was alive, he dreamed of Shu Dai holding his waist and crying, very sorrowful;",
  "s0054": "then laughed, clapped hands and sang.",
  "s0055": "Dun divined it, the omen was broken then good.",
  "s0056": "Zhao historian Yuan interpreted it, saying: 'This dream is very bad, not for your body, but for your son, yet it is also your fault.'",
  "s0057": "To the grandson, the Zhao lineage will increasingly decline.'",
  "s0058": "Tu An Jia, initially favored by Duke Ling, by Duke Jing's time Jia was Minister of Justice, about to create disorder, so he investigated Duke Ling's assassins to implicate Zhao Dun, widely told the generals: 'Though Dun did not know, he was still the head of the traitors.'",
  "s0059": "With ministers assassinating their lord, descendants in court, how to punish crime?'",
  "s0060": "Please execute them.'",
  "s0061": "Han Jue said: 'Duke Ling encountered assassins, Zhao Dun was abroad, my late lord considered him innocent, therefore did not execute.'",
  "s0062": "Now you gentlemen will execute his descendants, this is not my late lord's intention but now rashly executing.'",
  "s0063": "Rash execution is called chaos.'",
  "s0064": "Ministers have great matters but the lord does not hear, this is having no lord.'",
  "s0065": "Tu An Jia did not listen.",
  "s0066": "Han Jue told Zhao Shuo to quickly flee.",
  "s0067": "Shuo refused, saying: 'You must not cut off the Zhao sacrifices, Shuo dies without regret.'",
  "s0068": "Han Jue promised, feigned illness and did not go out.",
  "s0069": "Jia without permission arbitrarily with the generals attacked the Zhao clan at the Lower Palace, killed Zhao Shuo, Zhao Tong, Zhao Kuo, Zhao Ying Qi, all exterminated their clans.",
  "s0070": "Zhao Shuo's wife was Duke Cheng's elder sister, had a posthumous pregnancy, fled to the palace and hid.",
  "s0071": "Zhao Shuo's guest named Gong Sun Chu Jiu, Chu Jiu told Shuo's friend Cheng Ying: 'Why not die?'",
  "s0072": "Cheng Ying said: 'Shuo's wife has a posthumous pregnancy, if luckily a boy, I will support him;'",
  "s0073": "if a girl, I will slowly die.'",
  "s0074": "After not long, Shuo's wife gave birth, bore a boy.",
  "s0075": "Tu An Jia heard of it, searched in the palace.",
  "s0076": "The lady placed the child and cursed the crack diviner saying: 'If the Zhao lineage is extinguished, cry;'",
  "s0077": "if not extinguished, make no sound.'",
  "s0078": "When searched, the child ultimately made no sound.",
  "s0079": "Already escaped, Cheng Ying told Gong Sun Chu Jiu: 'Now one search did not find, later must search again, what to do?'",
  "s0080": "Gong Sun Chu Jiu said: 'Establishing the orphan or dying, which is harder?'",
  "s0081": "Cheng Ying said: 'Dying is easy, establishing the orphan is hard.'",
  "s0082": "Gong Sun Chu Jiu said: 'The Zhao clan's late lords treated you generously, you be strong for the hard one, I will do the easy one, please let me die first.'",
  "s0083": "So the two plotted to take another's infant child and carry it, clothed in embroidered robe, hid in the mountains.",
  "s0084": "Cheng Ying went out, falsely told the generals: 'Ying is unworthy, cannot establish the Zhao orphan.'",
  "s0085": "Who can give me a thousand jin, I will tell the Zhao orphan's location.'",
  "s0086": "The generals all rejoiced, promised him, dispatched troops following Cheng Ying to attack Gong Sun Chu Jiu.",
  "s0087": "Chu Jiu falsely said: 'Petty man Cheng Ying!'",
  "s0088": "Formerly in the Lower Palace difficulty could not die, conspired with me to hide the Zhao orphan child, now again sells me.'",
  "s0089": "Even if cannot establish, how can bear to sell!'",
  "s0090": "Holding the child called: 'Heaven, heaven!'",
  "s0091": "What crime has the Zhao orphan?'",
  "s0092": "Please let him live, killing Chu Jiu alone is acceptable.'",
  "s0093": "The generals did not permit, so killed Chu Jiu and the orphan child.",
  "s0094": "The generals thought the Zhao orphan was truly dead, all rejoiced.",
  "s0095": "But the Zhao true orphan was actually elsewhere, Cheng Ying ultimately hid with him in the mountains.",
  "s0096": "After fifteen years, Duke Jing of Jin became ill, divined it, the descendants of great enterprises who did not succeed were causing trouble.",
  "s0097": "Duke Jing asked Han Jue, Jue knew the Zhao orphan was there, so said: 'Among the descendants of great enterprises in Jin who cut off sacrifices, is it the Zhao clan?'",
  "s0098": "Indeed from Zhongyan all are Ying surname.'",
  "s0099": "Zhongyan had human face bird beak, descended to assist Yin Emperor Da Jia, and Zhou kings, all had bright virtue.'",
  "s0100": "Down to Kings You and Li without way, and Shu Dai left Zhou went to Jin, served my late lord Wen Hou, down to Duke Cheng, generations established merit, never cut off sacrifices."
}