{
  "s0203": "Empress Lü was fearful, did not know what to do.",
  "s0204": "Someone told Empress Lü: 'The Marquis of Liu is skilled at planning strategies, the emperor trusts and employs him.'",
  "s0205": "Empress Lü then sent Marquis Jiancheng Lü Ze to coerce the Marquis of Liu, saying: 'You have constantly been the emperor's planning minister, now the emperor wishes to change the crown prince—how can you lie high with pillow and sleep peacefully?'",
  "s0206": "The Marquis of Liu said: 'At first the emperor was several times in dire straits, luckily used your servant's strategies.",
  "s0207": "Now the realm is peaceful and stable, to change the crown prince out of favoritism—in family matters, even if we ministers number over a hundred, what benefit?'",
  "s0208": "Lü Ze strongly urged: 'Plan for me.'",
  "s0209": "The Marquis of Liu said: 'This cannot be disputed with words.",
  "s0210": "There are four people in the realm whom the emperor cannot summon.",
  "s0211": "These four people are old, all because they considered the emperor to slight and insult people, thus fled and hid in the mountains, righteously would not be Han ministers.",
  "s0212": "Yet the emperor esteems these four people.",
  "s0213": "Now if you can truly not spare gold, jade, walls, and silks, have the crown prince write a letter, humble words and comfortable carriage, moreover send eloquent officials to firmly request—they should come.",
  "s0214": "When they come, treat them as guests, have them frequently accompany into court, let the emperor see them, then he will certainly regard them unusually and question them.",
  "s0215": "When questioned, the emperor knowing these four are worthy, then it will be one help.'",
  "s0216": "Thus Empress Lü commanded Lü Ze to send people carrying the crown prince's letter, humble words and generous gifts, to welcome these four people.",
  "s0217": "The four people arrived, were guests at the Marquis of Jiancheng's residence.",
  "s0218": "Han year 11, Ying Bu rebelled, the emperor was ill, wished to have the crown prince lead troops, go attack him.",
  "s0219": "The four people discussed among themselves: 'We came in general to preserve the crown prince.",
  "s0220": "If the crown prince leads troops, the matter is dangerous.'",
  "s0221": "Thus they advised the Marquis of Jiancheng: 'If the crown prince leads troops and has merit, his position will not benefit the crown prince;",
  "s0222": "if no merit and returns, then from this he will receive disaster.",
  "s0223": "Moreover the various generals accompanying the crown prince have all once been fierce generals who pacified the realm with the emperor, now to have the crown prince command them—this is no different from making a sheep lead wolves, they will all be unwilling to exert full effort, it will certainly be no merit.",
  "s0224": "Your servant has heard 'a mother who loves her child embraces him', now Lady Qi serves day and night, King Zhao You Yi is constantly held in front, the emperor says 'I will never let an unworthy son be placed above a beloved son', clearly his replacing the crown prince's position is certain.",
  "s0225": "Why don't you urgently request Empress Lü to seize the opportunity and weepingly tell the emperor: 'Ying Bu is a fierce general of the realm, skilled in using troops, now the various generals are all your majesty's former equals, to command the crown prince to lead these people is no different from making a sheep lead wolves, none will be willing to be employed, moreover if Bu hears of it, he will drum and advance west.",
  "s0226": "Although your majesty is ill, force yourself to ride in the baggage cart, lie down and supervise them, the various generals will dare not not exert full effort.",
  "s0227": "Although your majesty suffers, for the sake of wife and children force yourself.'",
  "s0228": "Thus Lü Ze that night saw Empress Lü, Empress Lü seized the opportunity and weeping told the emperor, as the four people's intention.",
  "s0229": "The emperor said: 'I only considered the brat certainly insufficient to send, so I must go myself.'",
  "s0230": "Thus the emperor personally led troops east, the ministers remained to guard, all escorted to Bashang.",
  "s0231": "The Marquis of Liu was ill, forced himself to rise, arrived at Quyü, saw the emperor and said: 'Your servant should follow, but illness is severe.",
  "s0232": "Chu people are fierce and swift, I wish your majesty not to contend with Chu people at the spearpoint.'",
  "s0233": "Thus he advised the emperor: 'Have the crown prince serve as general, oversee Guanzhong troops.'",
  "s0234": "The emperor said: 'Zifang although ill, force yourself to lie down and instruct the crown prince.'",
  "s0235": "At this time Shu Sun Tong served as Grand Tutor, the Marquis of Liu performed Junior Tutor duties.",
  "s0236": "Han year 12, the emperor returned from attacking and defeating Bu's army, illness grew worse, even more wished to change the crown prince.",
  "s0237": "The Marquis of Liu remonstrated, not listened to, thus due to illness did not handle affairs.",
  "s0238": "Grand Tutor Shu Sun cited and explained ancient and modern to contend for the crown prince to the death.",
  "s0239": "The emperor pretended to permit it, yet still wished to change him.",
  "s0240": "When feasting, set up wine, the crown prince attended.",
  "s0241": "The four people followed the crown prince, ages all over eighty, beards and eyebrows white, clothing and caps extremely magnificent.",
  "s0242": "The emperor was astonished, asked: 'Who are those?'",
  "s0243": "The four people advanced and replied, each stated name and surname: Dongyuan Gong, Jiali Xiansheng, Qili Ji, Xiahuaing Gong.",
  "s0244": "The emperor then greatly astonished, said: 'I have sought you gentlemen for several years, you gentlemen avoided and fled me, now why do you gentlemen follow my son in leisure?'",
  "s0245": "The four people all said: 'Your majesty lightly esteems scholars and is good at cursing, we servants righteously would not accept insult, thus feared and fled into hiding.",
  "s0246": "We secretly heard the crown prince is humane and filial, respectful and loves scholars, the realm none do not crane necks desiring to die for the crown prince, thus we servants came.'",
  "s0247": "The emperor said: 'I trouble you gentlemen to happily finally protect and care for the crown prince.'",
  "s0249": "The four people having made toasts finished, hurried away.",
  "s0250": "The emperor watched them depart, summoned Lady Qi and pointed to the four people saying: 'I wished to change him, those four people assist him, wings are already formed, difficult to move.",
  "s0251": "Empress Lü is truly the master.'",
  "s0252": "Lady Qi wept, the emperor said: 'Dance the Chu dance for me, I will sing the Chu song for you.'",
  "s0253": "He sang: 'Wild geese fly high, one flight a thousand li."
}