{
  "s0052": "Chen Sheng then established himself as king, calling himself Zhang Chu.",
  "s0053": "At this time, the various commanderies and counties suffering under Qin officials all punished their chief officials and killed them to respond to Chen Sheng.",
  "s0054": "He then made Wu Shu acting king to supervise the generals in attacking Xingyang to the west.",
  "s0055": "He ordered the men from Chen—Wu Chen, Zhang Er, and Chen Yu—to take Zhao territory, and ordered Deng Zong from Ruyin to take Jiujiang commandery.",
  "s0056": "At this time, Chu forces gathered in groups of several thousand, too many to count.",
  "s0057": "Ge Ying reached Dongcheng and established Xiang Qiang as Chu king.",
  "s0058": "Later Ge Ying heard that the Chen king had already been established, so he killed Xiang Qiang and returned to report.",
  "s0059": "When he reached Chen, the Chen king executed Ge Ying.",
  "s0060": "The Chen king ordered Zhou Shi, a Wei man, to go north and take Wei territory.",
  "s0061": "Wu Guang besieged Xingyang.",
  "s0062": "Li You was governor of Sanchuan and defended Xingyang; Wu Shu could not capture it.",
  "s0063": "The Chen king summoned the nation's leaders to consult with them, and made Fang Jun Cai Ci from Shangcai the Grand Marshal.",
  "s0064": "Zhou Wen, a worthy man from Chen, had once observed the stars for Xiang Yan's army and served Chunshen Jun. He claimed to be skilled in military matters, so the Chen king gave him a general's seal to attack Qin to the west.",
  "s0065": "Marching and recruiting troops, they reached the pass with a thousand chariots and hundreds of thousands of soldiers, arriving at Xi and encamping there.",
  "s0066": "Qin ordered the Chamberlain for the Imperial Revenues Zhang Han to release the convicts from Mount Li and slave children, and send them all to attack the great Chu army, completely defeating them.",
  "s0067": "Zhou Wen was defeated and fled out of the pass, stopping at Caoyang for two or three months.",
  "s0068": "Zhang Han pursued and defeated him again; he fled again and stopped at Mianchi for more than ten days.",
  "s0069": "Zhang Han attacked and greatly defeated him.",
  "s0070": "Zhou Wen committed suicide, and the army then surrendered without fighting.",
  "s0071": "Wu Chen reached Handan and established himself as Zhao king, with Chen Yu as grand general and Zhang Er and Zhao Sao as left and right chancellors.",
  "s0072": "The Chen king was angry, arrested Wu Chen and others' families, wanting to execute them.",
  "s0073": "The Grand Marshal said: 'While Qin has not yet perished, executing the Zhao king's generals' and chancellors' families—this creates another Qin.",
  "s0074": "Better to acknowledge and confirm their positions.'",
  "s0075": "The Chen king then sent envoys to congratulate Zhao, moved Wu Chen and others' families into the palace, and enfeoffed Zhang Er's son Zhang Ao as Lord of Chengdu, urging the Zhao troops to quickly enter the pass.",
  "s0076": "The Zhao king's generals and chancellors consulted together, saying: 'To king ourselves over Zhao was not Chu's intention.",
  "s0077": "If Chu destroys Qin, they will surely turn their troops against Zhao.",
  "s0078": "The best plan is not to send troops west, but to send envoys north to take Yan territory and expand ourselves.",
  "s0079": "Zhao controls the Yellow River to the south and will have Yan and Dai to the north. Even if Chu defeats Qin, they won't dare control Zhao.",
  "s0080": "If Chu doesn't defeat Qin, they will certainly value Zhao.",
  "s0081": "Zhao can take advantage of Qin's exhaustion and achieve its ambitions under heaven.'",
  "s0082": "The Zhao king agreed, so they didn't send troops west, but sent the former county clerk of Shanggu, Han Guang, to lead troops north to take Yan territory.",
  "s0083": "Yan's former nobles and leaders said to Han Guang: 'Chu has already established a king, Zhao has also established a king.",
  "s0084": "Yan, though small, is also a state of ten thousand chariots. We wish for you, general, to establish yourself as Yan king.'",
  "s0085": "Han Guang said: 'My mother is in Zhao, I cannot.'",
  "s0086": "The Yan people said: 'Zhao is worried about Qin to the west and Chu to the south—their strength cannot stop us.",
  "s0087": "Moreover, despite Chu's strength, they don't dare harm the Zhao king's generals' and chancellors' families, so how would Zhao dare harm your family!'",
  "s0088": "Han Guang agreed and established himself as Yan king.",
  "s0089": "After several months, Zhao escorted the Yan king's mother and family back to Yan.",
  "s0090": "At this time, the generals taking territory were too many to count.",
  "s0091": "Zhou Shi went north taking territory to Di. The Di man Tian Dan killed the Di magistrate and established himself as Qi king, using Qi forces to counterattack Zhou Shi.",
  "s0092": "Zhou Shi's army scattered and returned to Wei territory, wanting to establish the former Lord of Ningling, Jiu, as Wei king (the descendant of the Wei royal house).",
  "s0093": "At the time, Jiu was with the Chen king and could not be brought to Wei.",
  "s0094": "Wei territory was already pacified; they wanted to establish Zhou Shi as Wei king together, but Zhou Shi refused.",
  "s0095": "Envoys went back and forth five times, then the Chen king established Lord Ningling Jiu as Wei king and sent him to his state.",
  "s0096": "Zhou Shi eventually became chancellor.",
  "s0097": "The generals Tian Zang and others consulted together, saying: 'Zhou Wen's army has already been defeated; Qin troops will arrive any moment. We besiege Xingyang city but cannot capture it. When Qin troops arrive, we will surely be greatly defeated.",
  "s0098": "Better to leave a small force sufficient to hold Xingyang, and send all our best troops to meet the Qin army.",
  "s0099": "Now the acting king is arrogant and doesn't understand military strategy. We cannot consult with him. If we don't execute him, our cause will surely fail.'",
  "s0100": "So they forged the king's orders to execute Wu Shu and presented his head to the Chen king.",
  "s0101": "The Chen king sent envoys to bestow upon Tian Zang the seal of Chu's prime minister, making him supreme commander."
}