{
  "s0051": "The ministers discussed establishing a successor, and were concerned about the powerful L端 maternal relatives, so they all praised the Bo clan's benevolence and goodness. Therefore, they welcomed the King of Dai and established him as Emperor Xiaowen, while the Queen Dowager changed her title to Empress Dowager, and her younger brother Bo Zhao was enfeoffed as Marquis of Zhi.",
  "s0052": "Empress Bo's mother had also died earlier and was buried north of Cuo Yang.",
  "s0053": "Therefore, they posthumously honored Bo An as Marquis Lingwen, established a funerary estate of 300 households in Kuaiji commandery, with officials from the estate director down to guard the tomb, and provided sacrifices in the resting temple according to ritual regulations.",
  "s0054": "North of Cuo Yang they also established a funerary estate for Marquis Lingwen's wife, following the same procedures as Marquis Lingwen's estate.",
  "s0055": "Empress Bo considered that her maternal family were descendants of the King of Wei, and that she had lost her parents early. Those from Wei who had served Empress Bo diligently were summoned, and the Wei clan was restored, with honors and rewards bestowed according to their closeness of kinship.",
  "s0056": "Altogether one person from the Bo clan became a marquis.",
  "s0057": "Empress Bo passed away in the second year of Emperor Wen, corresponding to the second year before Emperor Jing's reign, and was buried at Nanling.",
  "s0058": "Because Empress L端 was buried alongside Gaozu in Changling, she specially built her own tomb nearby Emperor Xiaowen's Baliang tomb.",
  "s0059": "Empress Dou was from Guanjin in Qinghe, Zhao.",
  "s0060": "During Empress L端's time, Dou Ji entered the palace as a daughter of a good family to serve the empress.",
  "s0061": "The empress distributed palace women as gifts to the various kings, five each, and Dou Ji was among them.",
  "s0062": "Dou Ji's home was in Qinghe, and wanting to go to Zhao which was closer to home, she asked her supervisor to send a eunuch official: 'You must place my name in the Zhao group.'",
  "s0063": "The eunuch forgot and mistakenly placed her name in the Dai group.",
  "s0064": "The roster was submitted, the edict approved, and she was to depart.",
  "s0065": "Dou Ji wept bitterly, resented the eunuch, and did not want to go, but was forced and finally agreed to depart.",
  "s0066": "When she arrived in Dai, the King of Dai exclusively favored Dou Ji, who bore a daughter named Piao, and later bore two sons.",
  "s0067": "The King of Dai's queen bore four sons.",
  "s0068": "Before the King of Dai ascended to become emperor, the queen passed away.",
  "s0069": "When the King of Dai became emperor, the four sons born by the queen all subsequently died of illness.",
  "s0070": "Several months after Emperor Xiaowen ascended the throne, the ministers requested establishing a crown prince, and since Dou Ji's eldest son was the oldest, he was established as crown prince.",
  "s0071": "Dou Ji was established as empress, and her daughter Piao became the eldest princess.",
  "s0072": "The following year, her youngest son Wu was established as King of Dai, but later was moved to Liang, becoming King Xiaoxiao of Liang.",
  "s0073": "Empress Dou's mother died early and was buried in Guanjin.",
  "s0074": "Therefore, Empress Bo issued an edict to the officials, posthumously honoring Empress Dou's father as Marquis Ancheng, and her mother as Lady Ancheng.",
  "s0075": "She ordered Qinghe to establish a funerary estate of 200 households, with officials to guard it, following the same procedures as the Lingwen estate.",
  "s0076": "Empress Dou's elder brother was Dou Changjun, and her younger brother was Dou Guangguo, styled Shaogun.",
  "s0077": "When Shaogun was four or five years old, the family was poor, and he was abducted and sold by someone, and his family did not know where he was.",
  "s0078": "He was passed through more than ten households, arriving at Yiyang, where he entered the mountains to make charcoal for his master. In the evening, more than a hundred people slept under a cliff, the cliff collapsed, killing all who slept there, but Shaogun alone escaped and survived.",
  "s0079": "He divined for himself that within several days he would become a marquis, and followed his master's household to Chang'an.",
  "s0080": "He heard that Empress Dou had recently been established, that her home was in Guanjin, and that her surname was Dou.",
  "s0081": "Although Guangguo had been young when he left, he remembered the name of the county and the surname, and he often gathered mulberry fruits with his sister, using this as a token of recognition. He submitted a memorial presenting himself.",
  "s0082": "Empress Dou spoke of this to Emperor Wen, who summoned him for an audience and questioned him. He fully explained the circumstances, and it was indeed true.",
  "s0083": "The emperor asked again what other proof there was.",
  "s0084": "He replied: 'When my sister left me to go west, we parted in the relay station, she begged to wash me, washed me, begged to feed me, fed me, and then left.'",
  "s0085": "Empress Dou held him and wept, tears streaming down.",
  "s0086": "The attendants on the left and right all prostrated themselves and wept, sharing in the empress's sorrow.",
  "s0087": "He was richly rewarded with fields, residences, and money, and his brothers were enfeoffed, establishing their household in Chang'an.",
  "s0088": "Marquis Jiang and General Guan Ying and others said: 'If we had not died, fate would indeed hang on these two people.",
  "s0089": "These two came from humble origins, so we must choose tutors and retainers for them, lest they repeat the great affair of the L端 clan.'",
  "s0090": "Therefore, they selected elder scholars of integrity and good conduct to live with them.",
  "s0091": "Dou Changjun and Shaogun thereby became gentlemen of retirement and yielding, not daring to behave arrogantly because of their honored position.",
  "s0092": "Empress Dou fell ill and lost her sight.",
  "s0093": "Emperor Wen favored Lady Shen of Handan and Lady Yin Ji, but both were childless.",
  "s0094": "When Emperor Xiaowen passed away and Emperor Xiaojing ascended, Guangguo was enfeoffed as Marquis of Zhangwu.",
  "s0095": "Changjun had died earlier, so his son Pengzu was enfeoffed as Marquis of Nanpi.",
  "s0096": "During the Wu-Chu rebellion, Empress Dou's nephew Dou Ying, who delighted in acting as a knight-errant, led troops and was enfeoffed as Marquis of Weiqi for his military merits.",
  "s0097": "Altogether three people from the Dou clan became marquises.",
  "s0098": "Empress Dou favored the teachings of the Yellow Emperor and Laozi, so the emperor and the crown prince and the various Dous all had to study the Yellow Emperor and Laozi, honoring their teachings.",
  "s0099": "Empress Dou passed away six years after Emperor Xiaojing (in the sixth year of Jianyuan), and was buried alongside him in Baliang tomb.",
  "s0100": "Her testament directed that all the money, valuables, and property from the Eastern Palace be given to the eldest princess Piao."
}