{
  "s0001": "Prince Yuan of Chu, Liu Jiao, was Gaozu's younger brother by the same mother, styled You.",
  "s0002": "Gaozu had four brothers: the eldest was Bo, who died young.",
  "s0003": "When Gaozu was still of humble status, he once avoided official duties and frequently went with guests to eat at his elder brother's wife's house.",
  "s0004": "The sister-in-law disliked her brother-in-law, and when the brother-in-law came with guests, she pretended the stew was finished, covered the pot, and the guests left because of this.",
  "s0005": "Later, when they looked in the pot there was still stew, and Gaozu resented his sister-in-law from this.",
  "s0006": "When Gaozu became emperor, he enfeoffed his brothers, but Bo's son alone did not receive an enfeoffment.",
  "s0007": "The Supreme Emperor spoke of this, and Gaozu said: \"It's not that I forgot to enfeoff him, but because his mother was not virtuous.\"",
  "s0008": "Therefore, he enfeoffed Bo's son Xin as Marquis of Gengjie.",
  "s0009": "The prince's second brother Zhong was established in Dai.",
  "s0010": "In Gaozu's sixth year, after capturing the Chu king Han Xin at Chen, he made his brother Jiao King of Chu, with his capital at Pengcheng.",
  "s0011": "He reigned for twenty-three years and died, his son King Yi Ying ascended the throne.",
  "s0012": "King Yi reigned for four years and died, his son King Wu ascended the throne.",
  "s0013": "King Wu reigned for twenty years, in winter he was convicted of illicit sexual relations while mourning Empress Bo, and Donghai commandery was stripped from him.",
  "s0014": "In spring, Wu conspired with the King of Wu to rebel, his chancellor Zhang Shang and tutor Zhao Yiwu advised against it, but he did not listen.",
  "s0015": "Wu then executed Shang and Yiwu, raised troops and attacked west with Wu toward Liang, breaking through Jibi.",
  "s0016": "They reached south of Changyi, and fought with the Han general Zhou Yafu.",
  "s0017": "Han cut off the Wu and Chu supply lines, the soldiers were hungry, the King of Wu fled, King Wu of Chu committed suicide, and the army surrendered to Han.",
  "s0018": "After Han had pacified Wu and Chu, Emperor Jing wished to continue Wu with the son of Marquis De, and continue Chu with the son of Prince Yuan, Liu Li.",
  "s0019": "Empress Dou said: \"The King of Wu was an old man, he should have been compliant and virtuous within the imperial clan.",
  "s0020": "Now he was the first to lead the seven states in throwing the realm into chaos—how can we continue his descendants!\"",
  "s0021": "Wu was not permitted, but Chu was permitted to establish descendants.",
  "s0022": "At this time Li served as Han's Director of the Imperial Clan.",
  "s0023": "He was appointed King of Chu to maintain Prince Yuan's ancestral temples, and became King Wen of Chu.",
  "s0024": "King Wen reigned for three years and died, his son King An Dao ascended the throne.",
  "s0025": "King An reigned for twenty-two years and died, his son King Xiang Zhu ascended the throne.",
  "s0026": "King Xiang reigned for fourteen years and died, his son King Chun succeeded him.",
  "s0027": "King Chun ascended the throne, in the second year of Dijie, a palace attendant submitted a memorial accusing the King of Chu of plotting rebellion. The king committed suicide, the state was abolished, and it became Pengcheng commandery of Han.",
  "s0028": "King Zhao Liu Sui—his father was Gaozu's middle son, named You, posthumously titled \"You.\"",
  "s0029": "King You died of sorrow, hence \"You.\"",
  "s0030": "Empress Gao established Lü Lü as king in Zhao, and after one year Empress Gao passed away.",
  "s0031": "The ministers executed the various Lü clansmen including Lü Lü, and established King You's son Sui as King of Zhao.",
  "s0032": "In the second year of Emperor Wen's reign, he established Sui's younger brother Piqiang, taking Zhao's Hejian commandery to make him King of Hejian, who became King Wen.",
  "s0033": "He reigned for thirteen years and died, his son King Ai Fu ascended the throne.",
  "s0034": "He reigned for one year and died without sons, the line was extinguished, the state abolished, and it reverted to Han.",
  "s0035": "Sui had been king of Zhao for twenty-six years, during Emperor Jing's time he was convicted through Chao Cuo's machinations and had the King of Zhao's Changshan commandery stripped away.",
  "s0036": "When Wu and Chu rebelled, King Zhao Sui conspired with them and raised troops.",
  "s0037": "His chancellor Jiande and interior minister Wang Han advised against it, but he did not listen.",
  "s0038": "Sui burned and killed Jiande and Wang Han, sent troops to garrison his western border, wishing to wait for Wu to advance west together.",
  "s0039": "He sent envoys north to the Xiongnu to ally with them and attack Han.",
  "s0040": "Han sent Marquis Quzhou Li Ji to attack him.",
  "s0041": "King Zhao Sui returned and defended Handan, they confronted each other for seven months.",
  "s0042": "Wu and Chu were defeated at Liang and could not advance west.",
  "s0043": "The Xiongnu heard of this and also stopped, refusing to enter Han territory.",
  "s0044": "Luan Bu returned from defeating Qi and combined forces to divert water and flood Zhao city.",
  "s0045": "Zhao city was breached, King Zhao committed suicide, and Handan surrendered.",
  "s0046": "The line of King Zhao You was extinguished.",
  "s0047": "The Grand Historian says: When a state is about to flourish, there will certainly be auspicious omens, the worthy are employed and the petty withdraw.",
  "s0048": "When a state is about to perish, the worthy hide themselves and traitors are honored.",
  "s0049": "If King Chu Wu had not executed Master Shen and followed his advice, and Zhao had employed Fang and the masters, how could there have been plots of usurpation and murder, bringing disgrace upon the realm?",
  "s0050": "Ah, the worthy! Ah, the worthy!"}
