{
  "s0102": "Officials who spoke of literary precision and harshness, desiring to pursue reputation, he immediately dismissed them.",
  "s0103": "Day and night he drank strong wine.",
  "s0104": "Ministers, grandees, and lower officials as well as guests saw Cao Can doing nothing, visitors all wished to speak.",
  "s0105": "Those who arrived, Cao Can always gave them strong wine to drink, made them relaxed—if they wished to speak, gave them more to drink, they left drunk, never able to speak their minds, this became the norm.",
  "s0106": "The prime minister's residence back garden was near the official quarters, the official quarters daily drank and sang loudly.",
  "s0107": "The attendants hated it, but could do nothing about it, so they requested Cao Can to stroll in the garden, hearing the officials drunk singing loudly, hoping the prime minister would summon and investigate them.",
  "s0108": "Instead he brought wine and spread mats to sit and drink, also singing loudly in response and harmony.",
  "s0109": "When Cao Can saw people with minor faults, he specially concealed and covered them up, the office had no affairs.",
  "s0110": "Cao Can's son Jiu served as middle grandee.",
  "s0111": "Emperor Hui was surprised the prime minister did not handle affairs, thinking 'Is it that he despises me?'",
  "s0112": "He then told Jiu: 'When you return, try privately and leisurely ask your father: 'Gaozu has newly abandoned the ministers, the emperor is young, you serve as prime minister, daily drinking, having no affairs to request, how do you worry about the realm?'",
  "s0113": "However do not say I told you.'",
  "s0114": "Jiu having bathed and returned, while attending, privately followed his instructions to remonstrate with Cao Can.",
  "s0115": "Cao Can was angry and caned Jiu two hundred strokes, saying: 'Hurry and enter to attend—the affairs of the realm are not for you to speak of.'",
  "s0116": "At court, Emperor Hui reproached Cao Can: 'Why did you cane Jiu?",
  "s0117": "It was I who sent him to remonstrate with you.'",
  "s0118": "Cao Can removed his cap and apologized: 'Your majesty yourself examine—whose sagely martial qualities compare with Gaozu's?'",
  "s0119": "The emperor said: 'How would I dare aspire to the former emperor!'",
  "s0120": "He said: 'Your majesty observe—whose ability compares with Xiao He's worthiness?'",
  "s0121": "The emperor said: 'You seem not to match him.'",
  "s0122": "Cao Can said: 'Your majesty's words are correct.",
  "s0123": "Moreover Gaozu and Xiao He pacified the realm, laws and ordinances already clear, now your majesty hangs sleeves and does nothing, we and others guard our positions, follow without losing them—is this not acceptable?'",
  "s0124": "Emperor Hui said: 'Good.",
  "s0125": "You are excused!'",
  "s0127": "Cao Can served as Han prime minister for three years coming and going.",
  "s0128": "He died, given the posthumous title Marquis Yi.",
  "s0129": "His son Jiu succeeded as marquis.",
  "s0130": "The people sang of him: 'Xiao He made the laws, precise as if drawn by rule;",
  "s0131": "Cao Can succeeded him, guarded without losing.",
  "s0132": "Carried his clarity and purity, the people achieved peace and unity.'",
  "s0134": "Marquis Pingyang Jiu during Empress Gao's time served as superintendent of trials.",
  "s0135": "When Emperor Wen was established, he was dismissed to become marquis.",
  "s0136": "He reigned twenty-nine years and died, given the posthumous title Marquis Jing.",
  "s0137": "His son Qi succeeded as marquis, reigned seven years and died, given the posthumous title Marquis Jian.",
  "s0138": "His son Dai succeeded as marquis.",
  "s0139": "Dai married Princess Pingyang, fathering son Xiang.",
  "s0140": "Dai fell ill and returned to his state.",
  "s0141": "He reigned twenty-three years and died, given the posthumous title Marquis Yi.",
  "s0142": "His son Xiang succeeded as marquis.",
  "s0143": "Xiang married Princess Chang Wei, fathering son Zong.",
  "s0144": "He reigned sixteen years and died, given the posthumous title Marquis Gong.",
  "s0145": "His son Zong succeeded as marquis.",
  "s0146": "In Zhenghe year 2, Zong was implicated in the crown prince's death, the state abolished.",
  "s0147": "The Grand Historian says: Chancellor Cao Can's merits in attacking cities and field battles could be so many because he was together with the Marquis of Huaiyin.",
  "s0148": "When Xin was already extinguished, while the marquises achieved success, only Cao Can monopolized the name.",
  "s0149": "Cao Can as Han prime minister, his clarity and tranquility reached the extreme of accord with the Way.",
  "s0150": "Yet the people after departing Qin cruelty, Cao Can participated in resting them with non-action, thus the realm all praised his beauty."
}