{
  "s0091": "Lu lord doubted him, declined Wu Qi.",
  "s0092": "Wu Qi thus heard Wei Wen Hou worthy, wished to serve him.",
  "s0093": "Wen Hou asked Li Ke: 'Wu Qi what kind of person?'",
  "s0094": "Li Ke said: 'Qi greedy and fond of sex, yet using troops Sima Rangju cannot surpass.'",
  "s0095": "Thus Wei Wen Hou made him general, attacked Qin, captured five cities.",
  "s0096": "Qi's as general, with soldiers lowest ones shared clothing food.",
  "s0097": "Slept not set mat, marched not rode carriage, personally wrapped dried rations, with soldiers shared toil bitterness.",
  "s0098": "Soldier had sick carbuncle, Qi sucked it for him.",
  "s0099": "Soldier's mother heard and wept for him.",
  "s0100": "Person said: 'Your son soldier, yet general personally sucks his carbuncle, why weep?'",
  "s0101": "Mother said: 'Not so.",
  "s0102": "Past year Wu Gong sucked his father, his father fought not turned heels, thus died among enemies.",
  "s0103": "Wu Gong now again sucks his son, I do not know his death place.",
  "s0104": "Therefore weep for him.'",
  "s0106": "Wen Hou because Wu Qi good at using troops, frugal upright, completely could obtain soldiers' hearts, thus made him Xihé governor, to resist Qin, Han.",
  "s0107": "Wei Wen Hou having died, Qi served his son Wu Hou.",
  "s0108": "Wu Hou floated Xihé and descended, middle stream, turned and told Wu Qi: 'Beautiful indeed mountains rivers' solidity, this Wei state's treasure!'",
  "s0109": "Qi answered: 'In virtue not in danger.",
  "s0110": "Formerly San Miao clan left Dongting, right Pengli, virtue righteousness not cultivated, Yu extinguished them.",
  "s0111": "Xia Jie residence, left He Ji, right Tai Hua, Yi Que in its south, Yang Chang in its north, cultivated governance not benevolent, Tang exiled him.",
  "s0112": "Yin Zhou state, left Meng Men, right Tai Hang, Chang Shan in its north, great river through its south, cultivated governance not virtuous, Wu Wang killed him.",
  "s0113": "From this observe, in virtue not in danger.",
  "s0114": "If lord not cultivate virtue, boat middle people all become enemy states.'",
  "s0115": "Wu Hou said: 'Good.'",
  "s0117": "Enfeoffed Wu Qi as Xihé governor, very had reputation.",
  "s0118": "Wei established chancellor, chancellor Tian Wen.",
  "s0119": "Wu Qi not pleased, told Tian Wen: 'Please with you discuss merit, acceptable?'",
  "s0120": "Tian Wen said: 'Acceptable.'",
  "s0121": "Qi said: 'Lead three armies, make soldiers happily die, enemy states dare not plot, you which with Qi?'",
  "s0122": "Wen said: 'Not as good as you.'"
}