{
  "s0103": "In Duke Ding's ninth year, Yang Hu was defeated, fled to Qi.",
  "s0104": "At this time Confucius was fifty years old.",
  "s0105": "Gong Shan Bu Niu rebelled against the Ji family with Bi, sent someone to summon Confucius.",
  "s0106": "Confucius had followed the Way for a long time, gently without being tested, none could employ him, said: 'Perhaps Zhou Wen and Wu arose from Feng and Hao to become kings, now Bi though small, perhaps I can manage it!'",
  "s0107": "He wished to go.",
  "s0108": "Zi Lu was displeased, stopped Confucius.",
  "s0109": "Confucius said: 'Those who summon me, is it for nothing?",
  "s0110": "If they employ me, it will be an Eastern Zhou!'",
  "s0111": "Yet in the end he did not go.",
  "s0112": "After this Duke Ding appointed Confucius as Zhongdu magistrate, in one year the four directions all emulated him.",
  "s0113": "From Zhongdu magistrate he became Director of Works, from Director of Works became Grand Minister of Justice.",
  "s0114": "In Duke Ding's tenth year spring, made peace with Qi.",
  "s0115": "Summer, Qi minister Li Chu spoke to Duke Jing saying: 'Lu employs Kong Qiu, this threatens Qi.'",
  "s0116": "Thus sent an envoy to inform Lu of a friendly meeting, meeting at Jiagu.",
  "s0117": "Duke Ding of Lu was about to go with a chariot in friendship.",
  "s0118": "Confucius acted as prime minister, said: 'I have heard that those who have civil affairs must have military preparations, those who have military affairs must have civil preparations.",
  "s0119": "In ancient times when feudal lords left their territory, they must have complete officials accompany them.",
  "s0120": "Please prepare left and right marshals.'",
  "s0121": "Duke Ding said: 'Very well.'",
  "s0122": "Prepared left and right marshals.",
  "s0123": "Met the Qi duke at Jiagu, established altar positions, earthen steps three levels, met with meeting etiquette, bowed and yielded and ascended.",
  "s0124": "The offering and toasting rituals completed, Qi officials hurried forward saying: 'Please perform the music of the four directions.'",
  "s0125": "Duke Jing said: 'Very well.'",
  "s0126": "Thus banners, yak tails, feathers, halberds, spears, swords, shields, drums, and shouting arrived.",
  "s0127": "Confucius hurried forward, ascended the steps without completing one level, raised his sleeve and spoke: 'Our two lords make a friendly meeting, why is barbarian music here!",
  "s0128": "Please command the officials!'",
  "s0129": "The officials repelled them, they did not leave, then looked left and right at Yan Ying and Duke Jing.",
  "s0130": "Duke Jing was ashamed in heart, waved them away.",
  "s0131": "After a while, Qi officials hurried forward saying: 'Please perform inner palace music.'",
  "s0132": "Duke Jing said: 'Very well.'",
  "s0133": "Actors and dwarfs performed plays and advanced.",
  "s0134": "Confucius hurried forward, ascended the steps without completing one level, said: 'Common fellows who deceive feudal lords, their crime deserves execution!",
  "s0135": "Please command the officials!'",
  "s0136": "The officials applied the law, hands and feet separated.",
  "s0137": "Duke Jing was fearful and moved, knew righteousness was inferior, returned and greatly feared, told his ministers: 'Lu assists its lord with the way of gentlemen, but you alone teach me the way of barbarians, causing me to offend the Lu lord, what can be done?'",
  "s0138": "The officials advanced replying: 'Gentlemen apologize for mistakes with sincerity, petty men apologize for mistakes with words.",
  "s0139": "If your lordship regrets it, then apologize with sincerity.'",
  "s0140": "Thus the Qi duke returned the invaded Lu territories of Yun, Wen Yang, and Gui Yin to apologize for the offense.",
  "s0141": "In Duke Ding's thirteenth year summer, Confucius spoke to Duke Ding: 'Ministers should not store armor, great officers should not have cities of one hundred mou.'",
  "s0142": "Had Zhong You serve as Ji family magistrate, about to destroy the three cities.",
  "s0143": "Thus the Shusun family first destroyed Hou.",
  "s0144": "The Ji family was about to destroy Bi, Gong Shan Bu Niu and Shusun Zhe led the Bi people to attack Lu.",
  "s0145": "The duke and the three families entered the Ji family palace, ascended Wu Zi's terrace.",
  "s0146": "The Bi people attacked them, could not conquer, entered and reached the duke's side.",
  "s0147": "Confucius ordered Shen Ju Xu and Yue Yi to descend and attack them, the Bi people fled north.",
  "s0148": "The state people pursued them, defeated them at Gu Mie.",
  "s0149": "The two men fled to Qi, thus destroyed Bi.",
  "s0150": "About to destroy Cheng, Duke Lian Chu Fu told Meng Sun: 'Destroying Cheng, the Qi people will certainly reach the north gate.",
  "s0151": "Moreover Cheng is the Meng family's protective barrier, without Cheng there is no Meng family.",
  "s0152": "I will not destroy it.'"
}
