{
  "s0256": "Made covenant with them, released Confucius out the east gate.",
  "s0257": "Confucius thus went to Wei.",
  "s0258": "Zi Gong said: 'Can covenants be broken?'",
  "s0259": "Confucius said: 'It was a forced covenant, the spirits do not accept it.'",
  "s0261": "Wei Ling Gong heard Confucius was coming, was pleased, welcomed him at the suburbs.",
  "s0262": "Asked: 'Can Pu be attacked?'",
  "s0263": "Replied: 'It can.'",
  "s0264": "Ling Gong said: 'My ministers think it cannot.",
  "s0265": "Now Pu is what Wei uses to deal with Jin and Chu, to attack it with Wei, is it not impossible?'",
  "s0266": "Confucius said: 'Its men have the will to die, its women have the will to defend the west river.",
  "s0267": "Those I would attack are no more than four or five people.'",
  "s0268": "Ling Gong said: 'Good.'",
  "s0269": "Yet did not attack Pu.",
  "s0270": "Ling Gong was old, neglected government affairs, did not employ Confucius.",
  "s0271": "Confucius sighed deeply: 'If someone would employ me, in one month there would be results, in three years achievement.'",
  "s0272": "Confucius departed.",
  "s0273": "Fo Xi was magistrate of Zhongmu.",
  "s0274": "Zhao Jian Zi attacked Fan and Zhong Xing, attacked Zhongmu.",
  "s0275": "Fo Xi rebelled, sent someone to summon Confucius.",
  "s0276": "Confucius wished to go.",
  "s0277": "Zi Lu said: 'I heard from the master, \"Gentlemen do not enter where those who personally do evil are.\"",
  "s0278": "Now Fo Xi personally rebels with Zhongmu, master wishes to go, how is this?'",
  "s0279": "Confucius said: 'There are these words.",
  "s0280": "Does it not say firm, ground but not worn;",
  "s0281": "does it not say white, dyed but not blackened.",
  "s0282": "Am I a bitter gourd, how can I hang without being eaten?'",
  "s0284": "Confucius played the chime.",
  "s0285": "Someone carrying a hoe passed the gate, said: 'There is purpose here, playing the chime!",
  "s0286": "Clang clang, none know me, that's all!'",
  "s0288": "Confucius studied playing the lute with Master Xiang Zi, ten days without progressing.",
  "s0289": "Master Xiang Zi said: 'You can add to it.'",
  "s0290": "Confucius said: 'I have practiced the melody, but have not gotten its rhythm.'",
  "s0291": "After a while, said: 'Have practiced the rhythm, you can add to it.'",
  "s0292": "Confucius said: 'I have not gotten its intent.'",
  "s0293": "After a while, said: 'Have gotten the intent, you can add to it.'",
  "s0294": "Confucius said: 'I have not gotten the person.'",
  "s0295": "After a while, there was something solemn and deep in thought, something cheerful and gazing high with far-reaching ambition.",
  "s0296": "Said: 'I have gotten the person, dark and black, tall and long, eyes like gazing sheep, like ruling the four directions, who but King Wen could do this!'",
  "s0297": "Master Xiang Zi moved his mat and bowed twice, said: 'The master indeed said it is King Wen's piece.'",
  "s0299": "Confucius having been unable to be employed in Wei, was about to go west to see Zhao Jian Zi.",
  "s0300": "Reached the river and heard of Dou Ming Du and Shun Hua's deaths, by the river sighed: 'Beautiful indeed water, vast!",
  "s0301": "My not crossing this, it is fate!'",
  "s0302": "Zi Gong hurried forward: 'May I ask what this means?'",
  "s0303": "Confucius said: 'Dou Ming Du, Shun Hua, Jin's worthy ministers.",
  "s0304": "When Zhao Jian Zi had not yet achieved his ambitions, he depended on these two men then conducted affairs;",
  "s0305": "when he had achieved his ambitions, killed them then conducted affairs.",
  "s0306": "I have heard: cut open fetuses and kill the young, then qilin do not come to the suburbs;",
  "s0307": "drain ponds and dry up fisheries, then dragons do not harmonize yin and yang;",
  "s0308": "overturn nests and destroy eggs, then phoenixes do not soar.",
  "s0309": "Why is this?'"
}
