{
  "s0191": "Yang province guards borders, in Three Dynasties time, compelled to make follow Central States customs and clothing, not greatly reaching with governance and teaching, only control with intention.",
  "s0192": "Do not be ignorant fond of leisure, do not approach villains, follow law as rule.",
  "s0193": "Do not long love leisure pleasure racing hunting indulgence, and approach small men.",
  "s0194": "Always think of law and standards, then there will be no shame and humiliation.'",
  "s0195": "The three rivers and five lakes have fish and salt profits, copper mountain wealth, what the world looks up to.",
  "s0196": "Therefore warned saying 'ministers do not create blessings' means do not let them circulate wealth and currency, give thick rewards, to establish reputation, become what four directions return to.",
  "s0197": "Also saying 'ministers do not create awe' means do not let them because of lightness double righteousness.",
  "s0198": "When Xiaowu Emperor passed away, Xiao Zhao Emperor first established, first summoned King Xu of Guangling, thickly rewarded gold money wealth currency, worth over 30 million, increased land 100 li, townships 10,000 households.",
  "s0199": "When Zhao Emperor passed away, Xuan Emperor first established, following benevolence practicing righteousness, in Benshi first year middle, split Han territory, all to enfeoff King Xu of Guangling's four sons: one son as Chaoyang Marquis;",
  "s0200": "one son as Pingqu Marquis;",
  "s0201": "one son as Nanli Marquis;",
  "s0202": "most loved youngest son Hong, established as King of Gaomi.",
  "s0203": "Afterwards Xu indeed created awe and blessings, communicated with King of Chu's envoys.",
  "s0204": "King of Chu openly declared: 'My ancestor King Yuan, Gao Emperor's younger brother, enfeoffed 32 cities.",
  "s0205": "Now land and townships increasingly few, I wish to together with King Xu of Guangling raise troops.'",
  "s0206": "Establish King Xu of Guangling as supreme, I again rule Chu 32 cities, like King Yuan time.'",
  "s0207": "Matter discovered, dukes and ministers officials requested to carry out punishment and execution.",
  "s0208": "Son of Heaven because of flesh and blood, could not bear to apply law to Xu, issued edict not to punish King Xu of Guangling, alone execute chief evil King of Chu.",
  "s0209": "Tradition says 'puff growing among hemp, without support straightens itself;",
  "s0210": "white sand in mud, with it all black', land and civilization make it so.",
  "s0211": "Afterwards Xu again cursed and plotted rebellion, committed suicide, kingdom abolished.",
  "s0212": "Yan land is uneven and barren, north presses Xiongnu, their people brave but little thought, therefore warned saying 'Xiongnu clan has no filial conduct but beast heart, with theft invades border people.",
  "s0213": "I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered banners fled army.",
  "s0214": "Xiongnu moved territory far away, northern provinces thus pacified.'",
  "s0215": "'Use all your heart, do not create resentment' means do not let them follow customs to resent and hope.",
  "s0216": "'Do not pity virtue' means do not let king turn back on virtue.",
  "s0217": "'Do not neglect preparations' means do not lack martial preparations, constantly prepare for Xiongnu.",
  "s0218": "'Non-educated men may not follow expedition' means non-accustomed to rites and righteousness may not be at the side.",
  "s0219": "When Wudi grew old, and the crown prince unfortunately died, not yet established successor, yet Dan sent to submit memorial, requesting personally enter guard duty in Chang'an.",
  "s0220": "Xiaowu seeing his memorial, struck ground, angry saying: 'Giving birth to son should place in Qi Lu rites and righteousness lands, yet placed in Yan Zhao, indeed has contending heart, unyielding beginning appears.'",
  "s0221": "Thus sent envoys immediately behead his envoy at the palace gate.",
  "s0222": "When Wudi passed away, Zhao Emperor first established, Dan indeed created resentment and hoped from ministers.",
  "s0223": "Considering himself eldest son should establish, with Qi king's son Liu Ze and others plotted rebellion, spoke saying: 'How can I have younger brother alive!",
  "s0224": "Now established is the Grand General's son.'",
  "s0225": "Wished to raise troops.",
  "s0226": "Matter discovered, should be executed.",
  "s0227": "Zhao Emperor following benevolence tolerant, suppressed case not publicized.",
  "s0228": "Dukes and ministers had ministers request, sent Chamberlain for the Imperial Clan and Grand Palace Attendant Gong Hu Man Yi, two censors, together go as envoys to Yan, indirectly admonish him.",
  "s0229": "Arrived in Yan, each different day, alternately saw and reproached the king.",
  "s0230": "Chamberlain for the Imperial Clan, manages imperial clan various Liu genealogy, first saw king, listed and explained Zhao Emperor truly Wudi's son situation.",
  "s0231": "Attendant Censor then again saw king, reproached with proper law, asked: 'King wishes to raise troops crime name clear, should condemn him.",
  "s0232": "Han house has proper law, king commits tiny small offense, immediately carries out law straight judgment, how can pardon king.'",
  "s0233": "Shocked and moved with statutes and laws.",
  "s0234": "King's intent increasingly lowered, heart feared.",
  "s0235": "Gong Hu Man Yi versed in classics, last saw king, cited ancient and modern universal principles, state great rites, writings elegant and proper.",
  "s0236": "Told king: 'Anciently Son of Heaven must have different surname officials within, thus to correct flesh and blood;",
  "s0237": "without have same surname officials, thus to correct different clans.",
  "s0238": "Duke of Zhou assisted King Cheng, executed his two younger brothers, thus orderly.",
  "s0239": "Wudi in his time, still could pardon king.",
  "s0240": "Now Zhao Emperor first established, year young, rich in springtime, not yet administering government, entrusts ministers.",
  "s0241": "Anciently executions and punishments did not favor relatives, thus world orderly.",
  "s0242": "Now ministers assist government, follow law straight action, none dare favor, fear cannot pardon king.",
  "s0243": "King can be careful himself, not cause body die kingdom extinguish, become world's laughter.'",
  "s0244": "Thus King Dan of Yan then feared and submitted to crime, kowtowed apologized for offense.",
  "s0245": "Ministers wished to harmonize flesh and blood, difficult to harm with law.",
  "s0246": "Afterwards Dan again with Left General Shangguan Jie and others plotted rebellion, declared 'I am next crown prince, crown prince not present, I should establish, ministers together suppress me' and so on.",
  "s0247": "Grand General Guang assisted government, with dukes and ministers discussed: 'King Dan of Yan does not change error repent righteousness, practices evil unchanging.'",
  "s0248": "Thus followed law straight judgment, carried out punishment execution.",
  "s0249": "Dan committed suicide, kingdom abolished, as the charter indicated.",
  "s0250": "Officials requested to execute Dan's wife and children."
}