{
  "s0093": "He himself braves his decisions, then do not anger him with his enemies;",
  "s0094": "he himself boasts his strength, then do not overwhelm him with its difficulty.",
  "s0095": "Plan different affairs with same plan, praise different people with same travelers, then adorn them without harm.",
  "s0096": "Have those with same losses, then clearly adorn their no loss.",
  "s0097": "Great loyalty has no opposing awakening, flowery words have no attacking repelling, only then extend his eloquence and wisdom.",
  "s0098": "This is why close and intimate without suspicion, thoroughly knowing the difficulty.",
  "s0099": "Obtain broad days increasingly long, and favor already abundant, deep plans without suspicion, contending without crime, only then clarify plan advantages and disadvantages to achieve its merit, directly point right and wrong to adorn his person, with this mutually holding, this is persuasion's success.",
  "s0100": "Yi Yin became cook, Bai Li Xi became captive, all the paths by which they petitioned their superiors.",
  "s0101": "Therefore these two sons, all sages, yet could not avoid debasing their persons and entering the world in such filth, then this is not what able service establishes.",
  "s0102": "Song had a rich man, heaven rained wall collapsed.",
  "s0103": "His son said 'not repair and moreover have thieves', his neighbor's father also said so, evening and indeed greatly lost their wealth, his family greatly trusted his son yet suspected the neighbor's father.",
  "s0104": "In ancient times Zheng Wu Gong wished to attack Hu, thus married his son to them.",
  "s0105": "Then asked the ministers: 'I wish to use troops, who can be attacked?'",
  "s0106": "Guan Qi Si said: 'Hu can be attacked.'",
  "s0107": "Thus executed Guan Qi Si, said: 'Hu is brother state, you speak of attacking it, why?'",
  "s0108": "Hu lord heard it, considered Zheng close to himself and did not prepare against Zheng.",
  "s0109": "Zheng people attacked Hu, took it.",
  "s0110": "These two persuaders, their knowledge all appropriate, yet the severe one executed, the light one suspected.",
  "s0111": "Not that knowledge is difficult, but applying knowledge is difficult.",
  "s0112": "In ancient times Mi Zi Xia was loved by Wei lord.",
  "s0113": "Wei state's law, stealing the lord's carriage drivers punished by amputation.",
  "s0114": "Soon Mi Zi's mother ill, people heard, went at night to inform him, Mi Zi falsely took the lord's carriage and went out.",
  "s0115": "Lord heard and considered him worthy saying: 'Filial indeed, for mother's sake violates amputation punishment!'",
  "s0116": "With lord touring orchard, Mi Zi ate peach and sweet, not finished and presented to lord.",
  "s0117": "Lord said: 'Loves me indeed, forgets his mouth and thinks of me!'",
  "s0118": "When Mi Zi appearance declined and love slackened, offended the lord.",
  "s0119": "Lord said: 'This once falsely took my carriage, also once fed me with his remaining peach.'",
  "s0120": "Therefore Mi Zi's conduct not changed from beginning, previously seen as worthy yet later obtained crime, love and hate's extreme change.",
  "s0121": "Therefore have favor with lord, then knowledge appropriate and add closeness;",
  "s0122": "seen as hated by lord, then crime appropriate and add distance."
}