{
  "s0032": "His learning overlooked nothing, yet its essentials fundamentally returned to Laozi's words.",
  "s0033": "Thus his written books over one hundred thousand words, for the most part allegorical tales.",
  "s0034": "Made Fisherman, Robber Zhi, Cutting Open Boxes, to mock and ridicule Confucius's followers, to clarify Laozi's techniques.",
  "s0035": "Fearful Burden Void, Kang Sang Zi and the like, all empty words without actual events.",
  "s0036": "Yet good at connecting books and separating phrases, pointing to affairs and analogizing feelings, using to strip Confucians and Mohists, even contemporary veteran scholars could not exempt themselves.",
  "s0037": "His words vast and unrestrained to suit himself, therefore even kings and great men could not value him.",
  "s0038": "Chu Wei King heard Zhuang Zhou was worthy, sent envoys with rich gifts to welcome him, promised to make him prime minister.",
  "s0039": "Zhuang Zhou laughing told Chu envoy: 'Thousand gold, heavy profit;",
  "s0040": "prime minister, honored position.",
  "s0041": "You alone have not seen the suburban sacrifice's sacrificial ox?",
  "s0042": "Raised and fed several years, clothed in embroidered patterns, to enter the great temple.",
  "s0043": "At that time, though wishing to be a lone piglet, how could it be obtained?",
  "s0044": "You quickly go, do not defile me.",
  "s0045": "I would rather frolic in mud and filth to please myself, not be restrained by rulers of states, lifelong not serve, to delight my ambitions.'",
  "s0047": "Shen Buhai was a Jing man, formerly Zheng's humble minister.",
  "s0048": "Used learning and technique to petition Han Zhao Hou, Zhao Hou employed him as prime minister.",
  "s0049": "Within repaired governance and teaching, without responded to feudal lords, fifteen years.",
  "s0050": "Throughout Shen Zi's lifetime, state orderly troops strong, none invaded Han.",
  "s0051": "Shen Zi's learning based on Huang Lao yet emphasized punishment and name.",
  "s0052": "Wrote books in two chapters, called Shen Zi.",
  "s0053": "Han Fei was one of Han's various princes.",
  "s0054": "Delighted in punishment-name law-technique learning, yet his foundation returned to Huang Lao.",
  "s0055": "Fei had a stutter, could not speak fluently, yet was good at writing books.",
  "s0056": "Together with Li Si served Xun Qing, Si considered himself inferior to Fei.",
  "s0057": "Fei saw Han's weakening and reduction, repeatedly with writings remonstrated Han King, Han King could not use him.",
  "s0058": "Thus Han Fei resented governing the state not striving to clarify its legal system, grasp power to control ministers below, enrich state strengthen troops yet seek others to appoint the worthy, instead raise floating licentious parasites and place them above actual merit.",
  "s0059": "Considered Confucians use writing to disorder law, while knights use martial force to violate prohibitions.",
  "s0060": "Relaxed then favor men of reputation, urgent then use armored warriors.",
  "s0061": "Now what is nurtured is not what is used, what is used is not what is nurtured.",
  "s0062": "Pitied uprightness not tolerated by crooked ministers, observed past gains and losses changes, thus wrote Lonely Indignation, Five Parasites, Inner and Outer Stores, Forest of Sayings, Difficulty of Persuasion over one hundred thousand words."
}