{
  "s0001": "'Grand Marshal subject Qubing, risking death, bows twice and submits memorial to Emperor Your Majesty: Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored.",
  "s0002": "I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants.",
  "s0003": "The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials.",
  "s0004": "Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties.",
  "s0005": "Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions.",
  "s0006": "Only may Your Majesty be so gracious as to examine this.",
  "s0007": "Subject Qubing risks death, bows twice, to inform Emperor Your Majesty.'",
  "s0008": "Third month, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat memorialized at Weiyang Palace.",
  "s0009": "Imperial command: 'Send to the Censor.'",
  "s0011": "Year 6, third month, day wu-shen first day, day yi-hai, Censor subject Guang acting as Minister of the Imperial Secretariat and Aide Fei, sent the censor memorial, saying: Chancellor subject Qing Que, Censor-in-Chief subject Tang, Grand Master of Ceremonies subject Chong, Grand Herald subject Xi, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan, risking death submit: Grand Marshal Qubing submitted memorial saying: 'Your Majesty has favored me excessively, allowing subject Qubing to await punishment in the ranks of the honored.",
  "s0012": "I should focus my thoughts solely on border defenses, yet even exposing my bones in the wilderness cannot repay, yet I dare contemplate other matters to interfere with those handling affairs, sincerely seeing Your Majesty toil for the world, pity the people to the point of forgetting yourself, reducing meals and diminishing pleasures, cutting the number of attendants.",
  "s0013": "The imperial sons rely on heaven, able to dress and make formal bows, yet to this day have no titles, positions, tutors, or officials.",
  "s0014": "Your Majesty is respectfully modest and does not worry, the ministers privately hope, but dare not speak beyond their duties.",
  "s0015": "Subject secretly cannot contain my dog and horse heart, risking death wish Your Majesty command the officials, taking advantage of the auspicious summer season to establish the imperial sons' positions.",
  "s0016": "Only may Your Majesty be so gracious as to examine this.'",
  "s0017": "Imperial command: 'Send to the Censor.'",
  "s0018": "Subjects respectfully with the central two thousand shi and two thousand shi subject He and others discuss: In ancient times, territory was divided to establish states, establishing feudal lords together to receive heaven's mandate, thus to honor the ancestral temple and weight the altars of soil and grain.",
  "s0019": "Now subject Qubing submits memorial, does not forget his duty, thus proclaims benevolence, moreover states the Son of Heaven's humble yielding and self-deprecation to labor for the world, concerned the imperial sons have no titles.",
  "s0020": "Subjects Qing Que, Tang and others should uphold righteousness and follow duty, foolishly dull and not up to affairs.",
  "s0021": "Now is the auspicious summer season, subjects Qing Que, Tang and others risking death request to establish imperial sons subject Hong, subject Dan, subject Xu as feudal kings.",
  "s0022": "Risking death request the names of the states to establish.'",
  "s0024": "Imperial command: 'I have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, some were viscounts, barons, or dependencies.",
  "s0025": "The rites say 'branch sons do not sacrifice'.",
  "s0026": "Saying establishing feudal lords together is to weight the altars of soil and grain, I have not heard this.",
  "s0027": "Moreover heaven does not give birth to the people for the ruler's sake.",
  "s0028": "My lack of virtue, the realm within the seas is not yet harmonious, yet to force those not yet educated to rule connected cities, then what encouragement for the limbs and bones?",
  "s0029": "Have them discuss again to establish them as marquises.'",
  "s0031": "Third month, day bing-zi, memorialized at Weiyang Palace.",
  "s0032": "'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects respectfully with Marquis subject Ying Qi, central two thousand shi and two thousand shi subject He, Remonstrance Official and Erudite subject An and others discuss: We have heard that Zhou enfeoffed eight hundred, the Ji surname stood together, supporting the Son of Heaven.",
  "s0033": "Kang Shu attained prominence through his ancestors, while Bo Qin was established by the Duke of Zhou, both became feudal lords of states, to mutually assist as help.",
  "s0034": "The hundred officials uphold the constitution, each follows their duty, and the state system is complete.",
  "s0035": "We secretly consider that establishing feudal lords together to weight the altars of soil and grain means the feudal lords of the four seas each offer tribute and sacrifices according to their duties.",
  "s0036": "Branch sons may not offer sacrifices to the ancestral temple, this is ritual.",
  "s0037": "Feudalism causes them to guard the border states, this is how emperors support virtue and spread civilization.",
  "s0038": "Your Majesty upholds heaven's mandate, clearly opens the holy succession, honors the worthy and displays merit, revives the extinguished and continues the broken.",
  "s0039": "Continues the line of Xiao Wen Zhong at Ju, rewards and encourages ministers like Pingjin Marquis and others.",
  "s0040": "Illuminates the order of the six relatives, makes clear the relationships of heaven's grace, causes feudal kings and enfeoffed lords to extend private benevolence to divide household and townships to younger brothers and sons, bestow titles and honorably establish over one hundred countries.",
  "s0041": "Yet to make the imperial sons marquises, then noble and base are confused, positions lose order, cannot be passed down to ten thousand generations.",
  "s0042": "Subjects request to establish subjects Hong, Dan, Xu as feudal kings.'",
  "s0043": "Third month, day bing-zi, memorialized at Weiyang Palace.",
  "s0044": "Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue.",
  "s0045": "The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals.",
  "s0046": "The various dukes had no hair, distinguishing worthy and unworthy.",
  "s0047": "'High mountains are looked up to, brilliant conduct is followed', I greatly admire this.",
  "s0048": "Therefore I suppress the immature, establishing them as marquises is acceptable.'",
  "s0050": "Fourth month, day wu-yin, memorialized at Weiyang Palace.",
  "s0051": "'Chancellor subject Qing Que, Censor-in-Chief subject Tang risking death speak: Subjects Qing Que and others with marquises, officials of two thousand shi, remonstrance officials, erudites subject Qing and others discuss: Risking death memorialize requesting to establish imperial sons as feudal kings.",
  "s0052": "Imperial command: 'Kang Shu among ten relatives was honored alone because he praised virtue.",
  "s0053": "The Duke of Zhou sacrificed to heaven at the suburban altar, thus Lu had white male and red strong sacrificial animals.",
  "s0054": "The various dukes had no hair, distinguishing worthy and unworthy.",
  "s0055": "'High mountains are looked up to, brilliant conduct is followed', I greatly admire this.",
  "s0056": "Therefore I suppress the immature, establishing them as marquises is acceptable.'",
  "s0057": "Subjects Qing Que, Tang, Erudite subject Jiang Xing and others have heard that Kang Shu had ten relatives, King Wu succeeded to the throne, Duke of Zhou assisted King Cheng, eight of them were established as great states by the honor of their ancestors.",
  "s0058": "Kang Shu was young in years, Duke of Zhou held the position of one of the three dukes, yet Bo Qin held the state at Lu, probably at the time of receiving the title, they had not yet reached adulthood.",
  "s0059": "Later Kang Shu defended against the disaster of Lu Fu, Bo Qin extinguished the rebellion of the Huai Yi.",
  "s0060": "In ancient times the Five Emperors had different systems, Zhou had five ranks, Spring and Autumn had three ranks, all ordered noble and base according to the times.",
  "s0061": "Gao Emperor brought order to the chaotic world and returned to correctness, displayed supreme virtue, pacified within the seas, enfeoffed feudal lords, with two ranks of nobility.",
  "s0062": "Imperial sons sometimes were established as feudal kings while still in swaddling clothes, supporting the Son of Heaven, as a model for ten thousand generations, cannot be changed.",
  "s0063": "Your Majesty personally practices benevolence and righteousness, embodies and practices holy virtue, both inside and outside civil and martial.",
  "s0064": "Displays the conduct of filial piety, broadens the path for the worthy and able."
}