{
  "s0152": "He released oxen in Taolin's shade, to show no more transporting provisions.",
  "s0153": "Now can your majesty release oxen and no more transport provisions?'",
  "s0154": "Said: 'Cannot.'",
  "s0155": "'This is the seventh reason it cannot be done.",
  "s0156": "Moreover, the wandering scholars of the realm have left their relatives, abandoned their graves, departed from old acquaintances, following your majesty—these all desire day and night to hope for a foot of land.",
  "s0157": "Now if the six states are restored, establishing the descendants of Han, Wei, Yan, Zhao, Qi, and Chu, the wandering scholars of the realm will each return to serve their lords, follow their relatives, return to their old acquaintances' graves— with whom will your majesty take the realm?",
  "s0158": "This is the eighth reason it cannot be done.",
  "s0159": "Moreover, Chu is the only one without strength—if the six states are established, they will again bend and follow Chu, how can your majesty make them subjects?",
  "s0160": "If you truly use the guest's plan, your majesty's affairs are finished.'",
  "s0161": "The King of Han stopped eating and spat out his food, cursed saying: 'Base Confucian, nearly ruined our public affairs!'",
  "s0162": "Commanded to hurry and destroy the seals.",
  "s0163": "Han year 4, Han Xin defeated Qi and wished to establish himself as King of Qi, the King of Han was angry.",
  "s0164": "Zhang Liang advised the King of Han, the King of Han had Liang grant Han Xin the seal of King of Qi—the account is in the Huaiyin affairs.",
  "s0165": "That autumn, the King of Han pursued Chu to south of Yangxia, battle was unfavorable so he entrenched at Gulang, the feudal lords did not arrive at the appointed time.",
  "s0166": "Liang advised the King of Han, the King of Han used his plan, all the feudal lords arrived.",
  "s0167": "The account is in Xiang Ji's affairs.",
  "s0168": "Han year 6 first month, enfeoffed the meritorious officials.",
  "s0169": "Liang had never had battle merit, Gaozu said: 'Planning strategies within the tent, deciding victories a thousand li away— this is Zifang's merit.",
  "s0170": "Choose for yourself 30,000 households from Qi.'",
  "s0171": "Liang said: 'At first your servant rose from Xiapi, met the emperor at Liu—this was heaven granting your servant to the emperor.",
  "s0172": "The emperor used your servant's plans, luckily they sometimes hit the mark, your servant wishes only to be enfeoffed in Liu, does not dare to receive 30,000 households.'",
  "s0173": "Thus he enfeoffed Zhang Liang as Marquis of Liu, enfeoffed together with Xiao He and others.",
  "s0174": "[Year 6] The emperor had already enfeoffed over twenty great meritorious officials, the remainder day and night disputed merits undecided, could not carry out enfeoffments.",
  "s0175": "The emperor was in Luoyang's southern palace, from the elevated walkway saw the various generals often sitting together in the sand speaking.",
  "s0176": "The emperor said: 'What are they speaking of?'",
  "s0177": "The Marquis of Liu said: 'Does your majesty not know?",
  "s0178": "This is plotting rebellion.'",
  "s0179": "The emperor said: 'The realm is just now peaceful and stable, why rebel?'",
  "s0180": "The Marquis of Liu said: 'Your majesty rose from commoner status, used these people to take the realm, now your majesty is Son of Heaven, but those enfeoffed are all Xiao and Cao's old friends and loved ones, while those executed are all lifelong enemies.",
  "s0181": "Now the military officers calculate merits, considering the realm insufficient to enfeoff all, these people fear your majesty cannot fully enfeoff them, fear they will again be suspected of lifelong faults and executed, thus they gather together to plot rebellion.'",
  "s0182": "The emperor then worried, said: 'What to do about it?'",
  "s0183": "The Marquis of Liu said: 'Among those the emperor has always hated, whom the ministers all know—who is the most hated?'",
  "s0184": "The emperor said: 'Yong Chi and I are old acquaintances, several times he has distressed and humiliated me.",
  "s0185": "I wished to kill him, but because his merit is great, I could not bear to.'",
  "s0186": "The Marquis of Liu said: 'Now urgently first enfeoff Yong Chi to show the ministers, when the ministers see Yong Chi enfeoffed, then each person will be self-assured.'",
  "s0187": "Thus the emperor set up wine, enfeoffed Yong Chi as Marquis of Shifang, and urgently urged the chancellor and superintendent to determine merits and carry out enfeoffments.",
  "s0188": "The ministers finished the wine, all rejoiced saying: 'Yong Chi is still made marquis, we have no worries.'",
  "s0190": "Liu Jing advised Gaozu: 'Establish the capital in Guanzhong.'",
  "s0191": "The emperor doubted it.",
  "s0192": "The ministers around him were all Shandong people, many advised the emperor to establish capital in Luoyang: 'Luoyang east has Chenggao, west has Xiaomeng, with the Yellow River behind, facing Yi and Luo—its fortifications are also sufficient to rely on.'",
  "s0193": "The Marquis of Liu said: 'Although Luoyang has these fortifications, within it is small, no more than several hundred li, the fields and soil are poor, four sides receive enemies—this is not a country for using arms.",
  "s0194": "Guanzhong has Xiao to the left, Han to the right, fertile plains a thousand li, south has Bashu's wealth, north has the Xiongnu's advantages, blocking three sides to defend, alone using one side east to control the feudal lords.",
  "s0195": "When feudal lords are peaceful, Yellow River and Wei transport supplies for the realm, west supplying the capital;",
  "s0196": "when feudal lords rebel, following the current down, sufficient for transporting supplies.",
  "s0197": "This is called a golden city of a thousand li, a heavenly storehouse country—Liu Jing's words are correct.'",
  "s0198": "Thus Gaozu that day drove west, establishing the capital in Guanzhong.",
  "s0199": "The Marquis of Liu followed into the passes.",
  "s0200": "The Marquis of Liu by nature was often ill, thus practiced guiding and pulling exercises, did not eat grain, shut his door and did not go out for over a year.",
  "s0201": "The emperor wished to depose the crown prince, establish Lady Qi's son King Zhao of You.",
  "s0202": "Ministers many remonstrated and disputed, but could not obtain a firm decision."
}