{
  "s0001": "The Marquis of Liu Zhang Liang was originally from the state of Han.",
  "s0002": "His grandfather Kai Di served as chancellor to Han kings Zhao Hou, Xuan Hui Wang, and Xiang Ai Wang.",
  "s0003": "His father Ping served as chancellor to Xi Wang and Dao Hui Wang.",
  "s0004": "In Dao Hui Wang year 23, Ping died.",
  "s0005": "Twenty years after his death, Qin destroyed Han.",
  "s0006": "Liang was young and had not yet taken office to serve Han.",
  "s0007": "When Han was destroyed, Liang had three hundred household slaves, his younger brother died unburied, he used all his family wealth to hire assassins to stab the Qin king, to avenge Han, because his grandfather and father had served as chancellors of Han for five generations.",
  "s0008": "Liang once studied ritual in Huaiyang.",
  "s0009": "He went east to see Lord Cang Hai.",
  "s0010": "He obtained a strongman and had an iron mace made weighing 120 jin.",
  "s0011": "When the Qin emperor traveled east, Liang and his companions ambushed the Qin emperor at Bo Lang Sha, but mistakenly hit the escort carriage.",
  "s0012": "The Qin emperor was greatly angered, conducted a great search throughout the realm, urgently seeking the assassins, all because of Zhang Liang.",
  "s0013": "Liang then changed his name and surname, fled and hid in Xiapi.",
  "s0014": "Liang once idly strolled leisurely on the bridge at Xiapi, when an old man in coarse clothing came to where Liang was, directly dropped his shoe down into the bridge, turned and told Liang: 'Young man, go down and get my shoe!'",
  "s0015": "Liang was astonished and wanted to beat him.",
  "s0016": "Because he was old, he forcibly endured it and went down to get the shoe.",
  "s0017": "The old man said: 'Put it on me!'",
  "s0018": "Liang having already gotten the shoe, knelt straight and put it on him.",
  "s0019": "The old man accepted it with his foot, laughed and left.",
  "s0020": "Liang was extremely astonished and followed him with his eyes.",
  "s0021": "The old man had gone about a li when he returned, saying: 'Young man can be taught.",
  "s0022": "In five days at dawn, meet me here.'",
  "s0023": "Liang was puzzled by this and knelt, saying: 'Yes.'",
  "s0024": "In five days at dawn, Liang went.",
  "s0025": "The old man was already there first, angry, saying: 'Meeting with an old man, being late—why?'",
  "s0026": "He left, saying: 'In five days come early.'",
  "s0027": "In five days at cockcrow, Liang went.",
  "s0028": "The old man was there first again, again angry, saying: 'Late—why?'",
  "s0029": "He left, saying: 'In five days come even earlier.'",
  "s0030": "In five days, Liang went before midnight was half over.",
  "s0031": "After a while, the old man also came, pleased, saying: 'It should be like this.'",
  "s0032": "He took out a bound book, saying: 'Read this and you will be a king's teacher.",
  "s0033": "After ten years you will rise.",
  "s0034": "In thirteen years the young man will see me in Jibei, under Gucheng Mountain—the yellow stone will be me.'",
  "s0035": "He then left, with no other words, never seen again.",
  "s0036": "The next day he examined the book—it was the military methods of Taigong.",
  "s0037": "Liang considered it extraordinary and constantly practiced and recited it.",
  "s0038": "He lived in Xiapi and became a knight-errant.",
  "s0039": "Xiang Bo often killed people and hid with Liang.",
  "s0040": "Ten years later, Chen She and others raised troops, Liang also gathered over a hundred youths.",
  "s0041": "Jing Ju established himself as acting king of Chu in Liu.",
  "s0042": "Liang wished to go follow him, but on the way encountered Duke Pei.",
  "s0043": "Duke Pei led several thousand men, was raiding west of Xiapi, so Liang attached himself to him.",
  "s0044": "Duke Pei appointed Liang as stable master.",
  "s0045": "Liang frequently explained Taigong's military methods to Duke Pei, Duke Pei liked them and often used his strategies.",
  "s0046": "When Liang explained to others, they all did not understand.",
  "s0047": "Liang said: 'Duke Pei is probably heaven-sent.'",
  "s0048": "Therefore he followed him and did not go see Jing Ju.",
  "s0049": "When Duke Pei went to Xue, he saw Xiang Liang.",
  "s0050": "Xiang Liang established King Huai of Chu."
}