{
  "s0310": "Gentlemen avoid harming their kind.",
  "s0311": "Even birds and beasts know to avoid injustice, how much more so I!",
  "s0312": "Thus returned and rested in Zou village, composed the Zou melody to mourn him.",
  "s0313": "Then returned to Wei, entered and stayed at Qu Bo Yu's home.",
  "s0314": "Another day, Ling Gong asked about military formations.",
  "s0315": "Confucius said: 'Ritual matters I have heard of, military matters I have not studied.'",
  "s0316": "The next day, spoke with Confucius, saw flying geese, gazed up at them, his color was not on Confucius.",
  "s0317": "Confucius thus departed, returned to Chen.",
  "s0318": "Summer, Wei Ling Gong died, established grandson Jie, who became Wei Chu Gong.",
  "s0319": "Sixth month, Zhao Yang brought crown prince Kuai Kui inside Qi.",
  "s0320": "Yang Hu made the crown prince wear mourning clothes, eight people in mourning attire, falsely as those welcoming from Wei, crying as they entered, thus resided there.",
  "s0321": "Winter, Cai moved to Zhou Lai.",
  "s0322": "This year was Lu Ai Gong's third year, Confucius was sixty years old.",
  "s0323": "Qi helped Wei besiege Qi because crown prince Kuai Kui was there.",
  "s0324": "Summer, Lu Huan Xi temple burned, Nan Gong Jing Shu saved the fire.",
  "s0325": "Confucius in Chen heard of it, said: 'The disaster must be at Huan Xi temple?'",
  "s0326": "Soon indeed so.",
  "s0327": "Autumn, Ji Huan Zi fell ill and was carried to view Lu's city walls. He sighed deeply, saying: 'In the past this state was nearly prosperous, but because I offended Confucius, it did not prosper.'",
  "s0328": "Looking back at his heir Kang Zi said: 'I will die soon, you must govern Lu;",
  "s0329": "governing Lu, must summon Zhong Ni.'",
  "s0330": "After several days, Huan Zi died, Kang Zi succeeded.",
  "s0331": "After burial, wished to summon Zhong Ni.",
  "s0332": "Gong Yu Yu said: 'In the past our former lord employed him but not to the end, finally became the laughingstock of the feudal lords.",
  "s0333": "Now employing him again, if cannot finish, this is again becoming the laughingstock of the feudal lords.'",
  "s0334": "Kang Zi said: 'Then who can be summoned?'",
  "s0335": "Said: 'Must summon Ran Qiu.'",
  "s0336": "Thus sent envoys to summon Ran Qiu.",
  "s0337": "Ran Qiu about to go, Confucius said: 'Lu people summon Qiu, not for small use, will greatly use him.'",
  "s0338": "That day, Confucius said: 'Return home! Return home!",
  "s0339": "My party's youths are ardent and simple, their patterns are brilliant, I do not know how to cut them.'",
  "s0340": "Zi Gong knew Confucius wished to return, sent Ran Qiu, admonishing to 'if employed, use Confucius as the banner.'",
  "s0341": "Ran Qiu having left, next year, Confucius from Chen moved to Cai.",
  "s0342": "Cai Zhao Gong about to go to Wu, Wu summoned him.",
  "s0343": "Previously Zhao Gong deceived his ministers to move Zhou Lai, now about to go, ministers feared he would move again, Gong Sun Pian shot and killed Zhao Gong.",
  "s0344": "Chu invaded Cai.",
  "s0345": "Autumn, Qi Jing Gong died.",
  "s0346": "Next year, Confucius from Cai went to Ye.",
  "s0347": "Ye Gong asked about governance, Confucius said: 'Governance lies in attracting the distant and attaching the near.'",
  "s0348": "Another day, Ye Gong asked Confucius to Zi Lu, Zi Lu did not answer.",
  "s0349": "Confucius heard of it, said: 'You, why not answer saying \"His character is: studies the Way without tiring, teaches others without wearying, becomes indignant and forgets food, joyful and forgets worry, does not know old age is approaching\" thus.'",
  "s0351": "Left Ye, returned to Cai.",
  "s0352": "Chang Ju and Jie Ni were plowing together, Confucius considered them recluses, sent Zi Lu to ask for directions.",
  "s0353": "Chang Ju said: 'That one holding the reins, who is he?'",
  "s0354": "Zi Lu said: 'Kong Qiu.'",
  "s0355": "Said: 'Is he Lu Kong Qiu?'",
  "s0356": "Said: 'Yes.'",
  "s0357": "Said: 'He knows the directions.'",
  "s0358": "Jie Ni told Zi Lu: 'Who are you?'",
  "s0359": "Said: 'Zhong You.'",
  "s0360": "Said: 'Are you Kong Qiu's disciple?'"
}
