{
  "s0252": "The proverb says: \"When a beautiful woman enters the household, she becomes the enemy of ugly women.\"",
  "s0254": "Master Chu says: Bathing need not be in the Jiang or Hai rivers, the important thing is to remove filth;",
  "s0255": "Horses need not be Qiji steeds, the important thing is that they run well;",
  "s0256": "Scholars need not be worthy of their age, the important thing is that they know the Way;",
  "s0257": "Women need not be of noble birth, the important thing is that they are chaste and good.",
  "s0258": "The tradition says: \"Women, regardless of beauty or ugliness, when they enter the household are envied;",
  "s0259": "Scholars, regardless of worthiness or unworthiness, when they enter court are resented.\"",
  "s0260": "Beautiful women are the enemies of ugly women.",
  "s0261": "Is this not so?",
  "s0262": "Lady Gouyi was surnamed Zhao, from Hejian.",
  "s0263": "She received Emperor Wu's favor and bore one son, who was Emperor Zhao.",
  "s0264": "Emperor Wu was seventy years old when he fathered Emperor Zhao.",
  "s0265": "When Emperor Zhao ascended, he was only five years old.",
  "s0266": "After the Wei crown prince was deposed, no crown prince was re-established.",
  "s0267": "King Yan Dan submitted a memorial, wishing to return to his state and enter the palace guard.",
  "s0268": "Emperor Wu was angry and immediately executed his envoy at the Northern Gate.",
  "s0269": "The emperor resided in Ganquan Palace and summoned painters to depict the Duke of Zhou carrying King Cheng.",
  "s0270": "Therefore the ministers on his left and right knew Emperor Wu intended to establish his younger son.",
  "s0271": "Several days later, the emperor reproached Lady Gouyi.",
  "s0272": "The lady removed her hairpins and earrings and knocked her head.",
  "s0273": "The emperor said: \"Lead her away and send her to the Rear Court Prison!\"",
  "s0274": "The lady looked back, and the emperor said: \"Hurry and go, you will not live!\"",
  "s0275": "The lady died in Yunyang Palace.",
  "s0276": "At the time violent winds raised dust, and the people were sorrowful.",
  "s0277": "Envoys carried the coffin at night to bury her, sealing and marking the place.",
  "s0278": "Afterward, when the emperor was at leisure, he asked those on his left and right: \"What do people say?\"",
  "s0279": "Those on his left and right replied: \"People say he will establish his son, so why did he kill his mother?\"",
  "s0280": "The emperor said: \"Yes.",
  "s0281": "These are matters that you children and foolish people do not understand.",
  "s0282": "In ancient times states became disordered because the ruler was young and the mother was strong.",
  "s0283": "Female rulers living alone become arrogant and stubborn, indulging in licentious disorder, with none able to restrain them.",
  "s0284": "Have you not heard of Empress Lü?\"",
  "s0285": "Therefore, all who bore sons for Emperor Wu, regardless of male or female children, their mothers without exception were reproached to death—can this be said not to be worthy and sage-like!",
  "s0286": "Clearly seeing far ahead, planning for future generations, this is indeed beyond what shallow scholars and foolish Confucians can attain.",
  "s0287": "His posthumous title was \"Wu\"—how could it be in vain!"
}