{
  "s0151": "Wu Ling Wang made leather clothing, practiced riding and shooting, and the Zhao people followed him.",
  "s0152": "The Huns called him 'the flying Zhao'.",
  "s0153": "Wu Ling Wang had a favorite concubine named Wu Ying, who was treacherous and jealous.",
  "s0154": "The crown prince Zhang was born of the consort, but Wu Ying plotted to establish her son He as crown prince.",
  "s0155": "Wu Ling Wang grew old and became ill, Wu Ying and He plotted to kill the crown prince Zhang.",
  "s0156": "Zhang fled and entered the palace, hid in the beams.",
  "s0157": "Wu Ying sent people to search but could not find him.",
  "s0158": "Zhang's followers Zhao Jia and others plotted to kill Wu Ying.",
  "s0159": "Wu Ying became aware and fled, Zhang's followers pursued and killed Wu Ying.",
  "s0160": "Wu Ling Wang heard of it and was greatly angry, imprisoned Zhang in the Sanglin Palace, wanting to kill him.",
  "s0161": "The ministers all said Zhang was innocent, but the king would not listen.",
  "s0162": "Zhang's younger brother He feared being implicated, so plotted with Zhang's followers Cheng Drong and others to kill Zhang.",
  "s0163": "They entered the Sanglin Palace and killed Zhang.",
  "s0164": "Wu Ling Wang was greatly sad and buried Zhang with the rites of a crown prince.",
  "s0165": "Afterward, established He as crown prince.",
  "s0166": "Wu Ling Wang died, He ascended, this was Hui Wen Wang.",
  "s0167": "Hui Wen Wang was young, his mother Wu Ying had been killed by Zhang's followers, so the king hated Zhang's followers.",
  "s0168": "Cheng Drong and others feared punishment, so plotted rebellion, wanting to establish the crown prince's son Dai as king.",
  "s0169": "The plot leaked, the king killed Cheng Drong and others.",
  "s0170": "The crown prince feared and fled to the Qi border.",
  "s0171": "The king established younger brother Yong as crown prince.",
  "s0172": "Hui Wen Wang's mother was consort Meng Yao, who was favored.",
  "s0173": "Hui Wen Wang was born, consort Meng Yao died young.",
  "s0174": "Hui Wen Wang grew up, favored Li Ji.",
  "s0175": "Li Ji gave birth to son Dan.",
  "s0176": "Hui Wen Wang wanted to establish Dan as crown prince, but Yong was already established, so did not change it.",
  "s0177": "Hui Wen Wang died, Yong ascended, this was Xiao Cheng Wang.",
  "s0178": "Xiao Cheng Wang was young, Li Ji acted as regent.",
  "s0179": "Li Ji wanted to establish her son Dan as king, so plotted to kill Xiao Cheng Wang.",
  "s0180": "The plot was discovered, Li Ji was killed, Dan was killed.",
  "s0181": "Xiao Cheng Wang died without heir.",
  "s0182": "The noble Lian Po and Guo Kai established Xiao Cheng Wang's younger brother Yan as king, this was Daoxiang Wang.",
  "s0183": "Daoxiang Wang was young, Lian Po acted as regent.",
  "s0184": "Daoxiang Wang grew up, favored Guo Kai, disliked Lian Po.",
  "s0185": "Guo Kai plotted to drive away Lian Po.",
  "s0186": "Lian Po fled to Wei.",
  "s0187": "Wei let Lian Po attack Zhao, Zhao defeated Wei.",
  "s0188": "Zhao then welcomed back Lian Po, restored his former position.",
  "s0189": "Daoxiang Wang died, son Xiaocheng Wang ascended.",
  "s0190": "Xiaocheng Wang favored Queen Zheng, who was treacherous.",
  "s0191": "Xiaocheng Wang died, son Huiwen Wang ascended.",
  "s0192": "Huiwen Wang's mother was Queen Zheng, who acted as regent.",
  "s0193": "Huiwen Wang died, son Xiaowen Wang ascended.",
  "s0194": "Xiaowen Wang died, son Huiwen Wang ascended.",
  "s0195": "Huiwen Wang died, son Zhao Wang ascended.",
  "s0196": "Zhao Wang was defeated by Qin, the state was lost, this was the end of Zhao.",
  "s0197": "Zhao Wang's younger brother Jia fled to Dai commandery.",
  "s0198": "Dai people established Jia as Zhao Jia Wang.",
  "s0199": "Zhao Jia Wang died, son Zhao Xie Wang ascended.",
  "s0200": "Zhao Xie Wang died, the Zhao lineage ended."
}
