{
  "s0416": "Zi Gong went out, Yan Hui entered to see.",
  "s0417": "Confucius said: 'Hui, the Poetry says \"Not rhinoceros not tiger, following that wilderness\".",
  "s0418": "Is my Way not right?",
  "s0419": "Why am I here?'",
  "s0420": "Yan Hui said: 'The Master's Way is extremely great, therefore All Under Heaven cannot contain it.",
  "s0421": "Although this is so, the Master pushes forward and practices it, not being contained is no illness, not being contained then sees the gentleman!",
  "s0422": "The Way not being cultivated is our shame.",
  "s0423": "The Way having been greatly cultivated yet not employed is the shame of those who have states.",
  "s0424": "Not being contained is no illness, not being contained then sees the gentleman!'",
  "s0425": "Confucius smiled happily, said: 'There are such words, Yan family's son!",
  "s0426": "If you had much wealth, I would be your steward.'",
  "s0428": "Thus sent Zi Gong to Chu.",
  "s0429": "Chu Zhao Wang raised troops to welcome Confucius, then obtained release.",
  "s0430": "Zhao Wang wished to enfeoff Confucius with seven hundred li of book land.",
  "s0431": "Chu prime minister Zi Xi said: 'The king's envoys to feudal lords have ones like Zi Gong?'",
  "s0432": "Said: 'None have.'",
  "s0433": "'The king's assistants and ministers have ones like Yan Hui?'",
  "s0434": "Said: 'None have.'",
  "s0435": "'The king's generals have ones like Zi Lu?'",
  "s0436": "Said: 'None have.'",
  "s0437": "'The king's officials have ones like Zai Yu?'",
  "s0438": "Said: 'None have.'",
  "s0439": "'Moreover Chu's ancestors were enfeoffed by Zhou, numbered as zi and nan with fifty li.",
  "s0440": "Now Kong Qiu expounds the laws of the Three and Five, clarifies Zhou and Shao's achievements, the king if employs him, then how can Chu generation after generation maintain its grandness of several thousand li?",
  "s0441": "King Wen was in Feng, King Wu in Hao, lords of one hundred li ultimately became kings of All Under Heaven.",
  "s0442": "Now if Kong Qiu obtains land, with worthy disciples as aides, it is not Chu's fortune.'",
  "s0443": "Zhao Wang thus stopped.",
  "s0444": "That autumn, Chu Zhao Wang died at Cheng Fu.",
  "s0445": "The Chu madman Jie Yu sang as he passed Confucius, saying: 'Phoenix!",
  "s0446": "Phoenix!",
  "s0447": "Why has virtue declined?",
  "s0448": "The past cannot be admonished, the future can still be pursued!",
  "s0449": "Enough, enough!",
  "s0450": "Those who govern today are in peril!'",
  "s0451": "Confucius descended, wished to speak with him.",
  "s0452": "He hurried away, could not speak with him.",
  "s0453": "Thus Confucius from Chu returned to Wei.",
  "s0454": "This year, Confucius was sixty-three, Lu Ai Gong's sixth year.",
  "s0455": "The next year, Wu and Lu met at Zong, demanded one hundred cattle.",
  "s0456": "Grand Steward Kuai summoned Ji Kang Zi.",
  "s0457": "Kang Zi sent Zi Gong to go, then was relieved.",
  "s0458": "Confucius said: 'Lu and Wei's governance are like brothers.'",
  "s0459": "At this time, Wei lord Jie Fu could not be established, was outside, feudal lords frequently reproached for it.",
  "s0460": "Confucius's disciples many served in Wei, Wei lord wished to get Confucius for governance.",
  "s0461": "Zi Lu said: 'Wei lord awaits master for governance, what will master put first?'",
  "s0462": "Confucius said: 'Certainly rectifying names!'",
  "s0463": "Zi Lu said: 'Is there such a thing! Master's pedantry!",
  "s0464": "How proper is it?'",
  "s0465": "Confucius said: 'Rustic indeed are you!",
  "s0466": "If names are not correct then speech is not orderly, speech not orderly then affairs are not accomplished, affairs not accomplished then ritual and music do not flourish, ritual and music not flourishing then punishments are not appropriate, punishments not appropriate then people have nowhere to put hand and foot."
}
