{
  "s0001": "Chancellor Xiao He was a native of Pei and Feng counties.",
  "s0002": "He served as an assistant to the Pei county magistrate because of his literacy and harmless character.",
  "s0003": "When Gaozu was still a commoner, He frequently used his official duties to protect Gaozu.",
  "s0004": "When Gaozu became a village head, He was constantly at his side.",
  "s0005": "When Gaozu was sent to Xianyang on official business, while other officials all sent three cash as tribute, He alone sent five.",
  "s0006": "A Qin imperial secretary who was supervising the commandery and working with him always defended him.",
  "s0007": "He then served as secretary to the Sishui warden, and was first in merit.",
  "s0008": "The Qin imperial secretary wanted to go in and recommend recruiting He, but He firmly requested not to go.",
  "s0009": "When Gaozu rose up to become Duke of Pei, He constantly served as assistant and oversaw affairs.",
  "s0010": "When the Duke of Pei reached Xianyang, all the generals rushed to the treasuries storing gold, silks, and valuables to divide them up, but He alone first entered and collected the Qin chancellor's and imperial secretary's laws, ordinances, maps, and books to store them away.",
  "s0011": "When the Duke of Pei became King of Han, he appointed He as chancellor.",
  "s0012": "Xiang Yu and the feudal lords slaughtered and burned Xianyang and left.",
  "s0013": "The King of Han was able to fully know the strategic passes of the realm, the number of households and population, strong and weak areas, and what the people suffered from, because He had obtained all the Qin maps and books.",
  "s0014": "He recommended Han Xin, and the King of Han appointed Xin as supreme general.",
  "s0015": "The account is in the affairs of the Marquis of Huaiyin.",
  "s0016": "The King of Han led troops east to pacify the Three Qins, while He as chancellor stayed behind to receive and organize Bashu, filling and comforting them with proclamations, enabling them to supply the army with food.",
  "s0017": "In Han year 2, the King of Han attacked Chu together with the feudal lords, while He guarded Guanzhong, attended the crown prince, and governed Queyang.",
  "s0018": "He established laws and regulations, erected ancestral temples, altars to the gods of soil and grain, palaces, and county seats, always memorializing upward—if approved, he was permitted to proceed;",
  "s0019": "if there was no time to memorialize upward, he would act according to what was expedient, and report it when the emperor returned.",
  "s0020": "For Guanzhong affairs, he calculated households and population, transported grain to supply the army. The King of Han frequently lost armies and fled, but He constantly raised Guanzhong troops to fill the gaps.",
  "s0021": "Because of this, the emperor specially entrusted all Guanzhong matters to He alone.",
  "s0022": "In Han year 3, the King of Han confronted Xiang Yu between Jing and Suo, and the emperor repeatedly sent envoys to console and thank Chancellor He.",
  "s0023": "Bao Sheng told the chancellor: 'The king exposes himself to wind and rain, repeatedly sending envoys to console and thank you—there must be suspicion in his heart toward you.",
  "s0024": "For your sake, it would be best to send your sons, grandsons, and brothers who can bear arms to all go to the army camp—the king will certainly trust you even more.'",
  "s0025": "Thus He followed this plan, and the King of Han was greatly pleased.",
  "s0026": "In Han year 5, after killing Xiang Yu and pacifying the realm, they discussed merits and carried out enfeoffments.",
  "s0027": "The ministers disputed over merits, and for more than a year merits were not decided.",
  "s0028": "Gaozu considered Xiao He's merit the greatest, enfeoffing him as Marquis of Wan, with a large fief.",
  "s0029": "All the meritorious officials said: 'We have worn armor and wielded sharp weapons, the most fought over a hundred battles, the least several dozen engagements, attacking cities and seizing territory, with greater and lesser distinctions.",
  "s0030": "Now Xiao He has never had the labor of sweating horses, just holding documents and making plans, without fighting, yet he is placed above us all—why is this?'",
  "s0031": "The emperor said: 'Do you gentlemen know hunting?'",
  "s0032": "They said: 'We know it.'",
  "s0033": "'Do you know hunting dogs?'",
  "s0034": "They said: 'We know them.'",
  "s0035": "The emperor said: 'In hunting, the ones who chase and kill beasts and rabbits are the dogs, while the ones who find the tracks and point out where the beasts are are the people.",
  "s0036": "Now you gentlemen can only catch running beasts, your merit is that of dogs.",
  "s0037": "As for Xiao He, he finds tracks and points them out, his merit is that of people.",
  "s0038": "Moreover, you gentlemen alone follow me with your bodies, the most are two or three people.",
  "s0039": "Now Xiao He has brought his entire clan of dozens of people to follow me—his merit cannot be forgotten.'",
  "s0040": "All the ministers dared not speak.",
  "s0041": "After all the marquises had received their enfeoffments, when memorializing about rank order, they all said: 'Marquis Pingyang Cao Can has suffered seventy wounds on his body, attacked cities and seized territory, his merit is the greatest, he should be first.'",
  "s0042": "The emperor had already bent the meritorious officials and given Xiao He much in enfeoffment, but regarding rank order he had no way to rebut the difficulty, yet in his heart he wanted He to be first.",
  "s0043": "Marquis within the Passes E Jun advanced and said: 'All the ministers' discussions are mistaken.",
  "s0044": "Although Cao Can has the merit of campaigning and seizing territory in the wilds, this is just a temporary matter.",
  "s0045": "The emperor has confronted Chu for five years, frequently losing armies and troops, escaping and fleeing several times.",
  "s0046": "Yet Xiao He constantly sent armies from Guanzhong to fill the gaps, not summoned by the emperor's edicts, and tens of thousands gathered to supply what the emperor lacked several times.",
  "s0047": "Han and Chu confronted each other at Xingyang for several years, the army had no visible grain, but Xiao He transported grain from Guanzhong, never lacking in provisions.",
  "s0048": "Although the emperor several times lost Shandong, Xiao He always kept Guanzhong intact to wait for the emperor—this is merit for ten thousand generations.",
  "s0049": "Now even if we lacked a hundred Cao Cans, what harm would it do to Han?",
  "s0050": "Han obtaining them is not necessary for completeness.'"
}