{
  "s0001": "Sun Tzu Wu was a Qi man.",
  "s0002": "With military methods appeared before Wu King Helu.",
  "s0003": "Helu said: 'Your thirteen chapters, I have completely viewed them, can make a small test restraining troops?'",
  "s0004": "Answered: 'Acceptable.'",
  "s0005": "Helu said: 'Can test with women?'",
  "s0006": "Said: 'Acceptable.'",
  "s0007": "Thus permitted it, took palace beauties, obtained one hundred eighty persons.",
  "s0008": "Sun Tzu divided into two teams, with the king's favored consorts two as team leaders each, all commanded to hold halberds.",
  "s0009": "Commanded them saying: 'You know your heart and left right hand back?'",
  "s0010": "Women said: 'Know it.'",
  "s0011": "Sun Tzu said: 'Forward, then look at heart;",
  "s0012": "left, look at left hand;",
  "s0013": "right, look at right hand;",
  "s0014": "back, then look at back.'",
  "s0015": "Women said: 'Yes.'",
  "s0016": "Regulations having been issued, then set up axe and battle-axe, immediately three commands five declarations.",
  "s0017": "Thus drummed right, women greatly laughed.",
  "s0018": "Sun Tzu said: 'Regulations unclear, declared commands not familiar, general's crime.'",
  "s0019": "Again three commands five declarations and drummed left, women again greatly laughed.",
  "s0020": "Sun Tzu said: 'Regulations unclear, declared commands not familiar, general's crime;",
  "s0021": "having already been clear yet not following method, officers and soldiers' crime.'",
  "s0022": "Thus wished to behead left right team leaders.",
  "s0023": "Wu king from platform observed, saw about to behead beloved consorts, greatly alarmed.",
  "s0024": "Hastily sent envoy to issue command saying: 'I already know general can use troops.",
  "s0025": "I without these two consorts, food not sweet, wish not to behead.'",
  "s0026": "Sun Tzu said: 'Subject having already received command as general, general in army, lord's commands have some not accepted.'",
  "s0027": "Thus beheaded two team leaders to show.",
  "s0028": "Used their seconds as team leaders, thus again drummed.",
  "s0029": "Women left right forward back kneel rise all hit compass square ink-line, none dared make sound.",
  "s0030": "Thus Sun Tzu sent envoy to report king saying: 'Troops already orderly, king can try descend to observe, as king wishes to use them, though go to water fire still acceptable.'"
}