{
  "s0051": "How can one want to add merit for ten thousand generations with merit from a single day!",
  "s0052": "Xiao He first, Cao Can second.'",
  "s0053": "Gaozu said: 'Good.'",
  "s0054": "Thus he ordered Xiao He [first], granting him the right to wear sword and shoes while ascending the hall, and not to hasten when entering court.",
  "s0055": "The emperor said: 'I have heard that recommending the worthy receives the highest reward.",
  "s0056": "Although Xiao He's merit is high, obtaining E Jun makes it even clearer.'",
  "s0057": "Thus he enfeoffed E Jun with the marquisate within the passes he had been eating as a marquis, making him Marquis of Anping.",
  "s0058": "On that day, he fully enfeoffed He's father, sons, and brothers more than ten people, all with fiefs.",
  "s0059": "He further increased He's fief by 2000 households, because when the emperor was once sent to Xianyang on official business, He sent me money that was uniquely extra.",
  "s0060": "In Han year 11, Chen Xi rebelled, Gaozu personally led troops and arrived at Handan.",
  "s0061": "Before returning, the Marquis of Huaiyin plotted rebellion in Guanzhong, Empress Lü used Xiao He's plan to execute the Marquis of Huaiyin—the account is in the Huaiyin affairs.",
  "s0062": "The emperor had heard of the Marquis of Huaiyin's execution and sent an envoy to appoint Chancellor He as prime minister, increasing his fief by 5000 households, commanding 500 troops with a commandery lieutenant as prime minister's guard.",
  "s0063": "All the gentlemen congratulated him, but Zhao Ping alone mourned.",
  "s0064": "Zhao Ping was formerly the Qin Marquis of Dongling.",
  "s0065": "After Qin was destroyed, he became a commoner, poor, grew melons east of Chang'an city, the melons were delicious, so common people call them 'Dongling melons', taking Zhao Ping as their name.",
  "s0066": "Zhao Ping told the prime minister: 'Disaster begins from this.",
  "s0067": "The emperor is exposed outdoors while you guard within, not involved in arrow and stone matters yet increasing your fief and setting up guards—because recently the Marquis of Huaiyin rebelled within, there is suspicion toward your heart.",
  "s0068": "Setting up guards to guard you is not to favor you.",
  "s0069": "I wish you would decline the fief and not accept it, use all your private wealth to aid the army, then the emperor's heart will be pleased.'",
  "s0070": "The prime minister followed his plan, and Gaozu was greatly pleased.",
  "s0071": "In autumn of Han year 12, Ying Bu rebelled, the emperor personally led troops to attack him, repeatedly sending envoys to ask what the prime minister was doing.",
  "s0072": "The prime minister, because the emperor was in the army, stroked and encouraged the people, using all he had to aid the army, like during Chen Xi's time.",
  "s0073": "A guest advised the prime minister: 'Your clan will be extinguished soon.",
  "s0074": "Your position is prime minister, merit first—can it be added to further?",
  "s0075": "Yet when you first entered Guanzhong, you gained the people's hearts, more than ten years ago, all are attached to you, and you constantly diligently obtain the people's harmony.",
  "s0076": "The reason the emperor repeatedly asks about you is fear that you will shake Guanzhong.",
  "s0077": "Now why don't you buy more fields and lend money cheaply to defile yourself?",
  "s0078": "Then the emperor's heart will be at peace.'",
  "s0079": "Thus the prime minister followed his plan, and the emperor was greatly pleased.",
  "s0080": "The emperor dismissed the Bu army and returned, people along the road intercepted him and presented memorials, saying the prime minister bought people's fields and houses cheaply and forcibly for several thousand.",
  "s0081": "The emperor arrived, and the prime minister came to greet him.",
  "s0082": "The emperor laughed and said: 'The prime minister is benefiting the people!'",
  "s0083": "He gave all the people's memorials to the prime minister, saying: 'You personally thank the people.'",
  "s0084": "The prime minister then requested for the people: 'Chang'an land is narrow, there is much empty land in Shanglin Park, abandoned—wish to allow people to enter and farm it, not collect the stubble for birds and beasts to eat.'",
  "s0085": "The emperor greatly angered, said: 'The prime minister has received much wealth from merchants and is requesting my park for them!'",
  "s0086": "He sent the prime minister to the superintendent of trials, shackled and imprisoned him.",
  "s0087": "Several days later, the imperial guard commander attended and asked in front: 'What great crime has the prime minister committed that your majesty imprisons him so violently?'",
  "s0088": "The emperor said: 'I heard that Li Si served as chancellor to the Qin emperor, attributed good to the ruler, took evil upon himself.",
  "s0089": "Now the prime minister has received much gold from merchant lackeys and is requesting my park for the people to ingratiate himself with the people, thus I imprison and investigate him.'",
  "s0090": "The imperial guard commander said: 'If in official duties one finds what benefits the people and requests it, this is truly a prime minister's business—why does your majesty suspect the prime minister received merchants' money!'",
  "s0091": "Moreover, your majesty confronted Chu for several years, Chen Xi and Ying Bu rebelled, your majesty personally led troops and went, at that time the prime minister guarded Guanzhong—if he shook his foot then west of the passes would not be yours.",
  "s0092": "The prime minister did not take advantage at that time, now would he take advantage of merchants' gold?",
  "s0093": "Moreover Qin perished because it did not hear its faults, Li Si's dividing faults—what is worthy of imitating?",
  "s0094": "Why does your majesty have such shallow suspicion of the prime minister.'",
  "s0095": "Gaozu was displeased.",
  "s0096": "That day he sent an envoy holding the tally to pardon and release the prime minister.",
  "s0097": "The prime minister was old, habitually respectful and cautious, entered barefoot to apologize.",
  "s0098": "Gaozu said: 'Prime minister, enough!",
  "s0099": "The prime minister requested the park for the people, I did not permit it—I am no more than a Jie or Zhou ruler, while the prime minister is a worthy prime minister.",
  "s0100": "I deliberately imprisoned the prime minister to let the people hear of my faults.'"
}