{
  "s0052": "He led the retreat, gathered the scattered troops to Xingyang, appointed Ping as second-in-command, subordinate to King Han Xin, stationed at Guangwu.",
  "s0053": "Marquis Jiang, Guan Ying and others all slandered Chen Ping, saying: 'Ping though a handsome man, is like a jade crown—perhaps beautiful outside but empty within.",
  "s0054": "Your servants have heard that when Ping lived at home, he stole his sister-in-law;",
  "s0055": "served Wei but was not tolerated, fled to join Chu;",
  "s0056": "joined Chu but was not appreciated, again fled to join Han.",
  "s0057": "Now the great king honors him with office, commands him to protect the army.",
  "s0058": "Your servants have heard Ping accepts gold from the generals—those who give much gold get good positions, those who give little gold get bad positions.",
  "s0059": "Ping is a fickle rebellious minister, we wish the king to examine him.'",
  "s0060": "The King of Han doubted it, summoned and reproached Wei Wuzhi.",
  "s0061": "Wuzhi said: 'What your servant spoke of was ability;",
  "s0062": "what your majesty asks about is conduct.",
  "s0063": "Now if there are men with the conduct of Wei Sheng or Xiao Ji but no benefit for the calculations of victory and defeat, why would your majesty have time to employ them?",
  "s0064": "Chu and Han confront each other, your servant advances men of extraordinary strategy, only considering whether their plans can truly benefit the state.",
  "s0065": "Moreover, stealing sister-in-law and accepting gold—what is there to doubt?'",
  "s0066": "The King of Han summoned and reproached Ping: 'Sir served Wei without success, then served Chu and left, now again follows my wanderings—faithful people are certainly suspicious?'",
  "s0067": "Ping said: 'Your servant served the King of Wei, the King of Wei could not use your servant's advice, so left to serve Xiang Wang.",
  "s0068": "Xiang Wang cannot trust people, those he appoints and loves are either various Xiangs or his wife's brothers and sisters—even if there are extraordinary scholars he cannot employ, so Ping left Chu.",
  "s0069": "Heard the King of Han can employ people, so returned to the great king.",
  "s0070": "Your servant came naked, without accepting gold could not provide for himself.",
  "s0071": "If your servant's plans have anything worth adopting, [I wish] the great king would use them;",
  "s0072": "if there is nothing usable, the gold is all here, please seal and deliver to the treasury, allow your servant to request his old bones.'",
  "s0073": "The King of Han then apologized, richly rewarded him, appointed him Protector of the Army Commandant, overseeing all generals.",
  "s0074": "The generals then dared not speak again.",
  "s0075": "Afterwards, Chu urgently attacked, cut off the Han covered walkway, besieged the King of Han in Xingyang city.",
  "s0076": "After a long time, the King of Han was troubled by it, requested to cede west of Xingyang for peace.",
  "s0077": "Xiang Wang would not listen.",
  "s0078": "The King of Han told Chen Ping: 'The realm is in chaos, when will it be settled?'",
  "s0079": "Chen Ping said: 'Xiang Wang as a person is respectful and loves people, scholars who are incorruptible and value ritual mostly go to him.",
  "s0080": "As for rewarding merit with ranks and fiefs, he is stingy with them, scholars also do not attach because of this.",
  "s0081": "Now the great king is arrogant and lacks ritual, incorruptible scholars do not come;",
  "s0082": "yet the great king can enrich people with ranks and fiefs, scholars who are dull, greedy for profit, and shameless also mostly go to Han.",
  "s0083": "If we truly each abandon our two shortcomings and adopt our two strengths, the realm will be settled at a wave of the hand.",
  "s0084": "Yet the great king indulges in insulting people, cannot obtain incorruptible scholars.",
  "s0085": "But Chu has vulnerabilities to exploit—Xiang Wang's unyielding ministers like Yafu, Zhongli Mei, Long Ju, Zhou Yin and such are no more than several people.",
  "s0086": "If the great king can truly put out tens of thousands of jin of gold, employ reverse espionage, sow discord among their ruler and ministers to make their hearts suspicious, Xiang Wang as a person is suspicious and believes slander, they will certainly slaughter each other internally.",
  "s0087": "Han will then raise troops and attack them, defeating Chu is certain.'",
  "s0088": "The King of Han considered it right, so put out 40,000 jin of yellow gold, gave it to Chen Ping, let him do as he wished, not questioning his comings and goings.",
  "s0089": "Chen Ping having used much gold to spread reverse espionage in the Chu army, proclaiming that generals like Zhongli Mei served as Xiang Wang's generals with great merit, yet ultimately could not split off land and become kings, wished to unite with Han to extinguish the Xiang clan and divide their land as kingdoms.",
  "s0090": "Xiang Yu indeed began to distrust Zhongli Mei and others.",
  "s0091": "The Lord of Chu having suspected them, sent envoys to Han.",
  "s0092": "The King of Han prepared a grand feast, presented it.",
  "s0093": "Seeing the Chu envoy, he pretended to be shocked: 'I thought it was Yafu's envoy, but it's Xiang Wang's envoy!'",
  "s0094": "Then took it away, changed to poor grass provisions to present to the Chu envoy.",
  "s0095": "The Chu envoy returned and fully reported to Xiang Wang.",
  "s0096": "Xiang Wang indeed greatly suspected Yafu.",
  "s0097": "Yafu wished to urgently attack and capture Xingyang city, Xiang Wang did not trust him, would not listen.",
  "s0098": "Yafu heard Xiang Wang suspected him, then angered: 'The realm's affairs are greatly settled, your majesty do it yourself!",
  "s0099": "I wish to request my old bones and return!'",
  "s0100": "Returning before reaching Pengcheng, a carbuncle erupted on his back and he died.",
  "s0101": "Chen Ping then at night sent out 2000 women from Xingyang city's east gate, Chu thus attacked them, Chen Ping then with the King of Han went out from the west gate at night."
}