{
  "s0065": "Within praising virtue, without attacking the strong and violent.",
  "s0066": "Reached the Northern Sea, west to the Yuezhi, Xiongnu and Western Regions, the entire state supports the army.",
  "s0067": "The costs of chariots and weapons, not levied from the people.",
  "s0068": "Emptied the imperial storehouse to reward the chief warriors, opened forbidden granaries to relieve the poor, reduced garrison troops by half.",
  "s0069": "The rulers of the hundred barbarian tribes, none do not face the wind, following the current and fulfilling intentions.",
  "s0070": "Distant regions with different customs come to court through multiple translations, benevolence extends beyond the borders.",
  "s0071": "Thus precious beasts arrive, auspicious grains flourish, heaven's response is very clear.",
  "s0072": "Now feudal lords' branch sons are enfeoffed as feudal kings, yet to make imperial sons marquises, subjects Qing Que, Tang and others secretly and prostrate consider it, all think noble and base lose order, causing the world to lose hope, cannot.",
  "s0073": "Subjects request to establish subjects Hong, Dan, Xu as feudal kings.'",
  "s0074": "Fourth month, day gui-wei, memorialized at Weiyang Palace, kept in the palace not sent down.",
  "s0075": "'Chancellor subject Qing Que, Grand Coachman subject He, acting as Censor-in-Chief Grand Master of Ceremonies subject Chong, Crown Prince Junior Tutor subject An acting as Chamberlain for the Imperial Clan risking death speak: Subjects Qing Que and others previously memorialized Grand Marshal subject Qubing submitted memorial saying imperial sons have no titles, subjects respectfully with Censor-in-Chief subject Tang, central two thousand shi, two thousand shi, remonstrance officials, erudites subject Qing and others risking death request to establish imperial sons subject Hong and others as feudal kings.",
  "s0076": "Your Majesty yields civil and martial, personally frugal, including imperial sons not educated.",
  "s0077": "The ministers' discussions, Confucian scholars praise their methods, some contradict their hearts.",
  "s0078": "Your Majesty firmly declined not permitting, established imperial sons as marquises.",
  "s0079": "Subjects Qing Que and others secretly with Marquis subject Shou Cheng and twenty-seven others discuss, all say noble and base lose order.",
  "s0080": "Gao Emperor established the world, as Han Taizu, enfeoffed sons and grandsons, broadened branches as auxiliaries.",
  "s0081": "Previous emperor's regulations not changed, thus to proclaim supreme honor.",
  "s0082": "Subjects request to command the historians to choose an auspicious day, prepare ceremonies and submit, Censor memorializes territory maps, all else as previous precedents.'",
  "s0083": "Imperial command: 'Acceptable.'",
  "s0085": "Fourth month, day bing-shen, memorialized at Weiyang Palace.",
  "s0086": "'Grand Coachman subject He acting as Censor-in-Chief risking death speaks: Grand Master of Ceremonies subject Chong says the divination entered fourth month twenty-eighth day yi-si, acceptable to establish feudal kings.",
  "s0087": "Subject risking death memorializes territory maps, requests the names of states to establish.",
  "s0088": "Ceremonies to be memorialized separately.",
  "s0089": "Subject risking death requests.'",
  "s0091": "Imperial command: 'Establish imperial son Hong as King of Qi, Dan as King of Yan, Xu as King of Guangling.'",
  "s0093": "Fourth month, day ding-you, memorialized at Weiyang Palace.",
  "s0094": "Year 6, fourth month, day wu-yin first day, day gui-mao, Censor-in-Chief Tang sent to Chancellor, Chancellor sent to central two thousand shi, two thousand shi sent to commandery governors and feudal chancellors, chancellor documents sent to those who should use them.",
  "s0095": "As per regulations and commands.",
  "s0096": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Hong as King of Qi in the ancestral temple.",
  "s0097": "Saying: Ah, young son Hong, receive this blue altar!",
  "s0098": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the eastern lands, generation after generation as Han's border auxiliary.",
  "s0099": "Ah, remember this!",
  "s0100": "Cherish my command, the mandate is not constant.",
  "s0101": "People who love virtue can clearly shine brightly.",
  "s0102": "Righteousness not planned for, causes the worthy to be indolent.",
  "s0103": "Use all your heart, faithfully hold to the center, heaven's favor will forever end.",
  "s0104": "If there are faults not good, then disaster to your state, harm to your person.",
  "s0105": "Ah, protect the state and cherish the people, can you not be respectful!",
  "s0106": "King, take heed of this.'",
  "s0108": "Above is King of Qi's charter.",
  "s0109": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Dan as King of Yan in the ancestral temple.",
  "s0110": "Saying: Ah, young son Dan, receive this black altar!",
  "s0111": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the northern lands, generation after generation as Han's border auxiliary.",
  "s0112": "Ah!",
  "s0113": "The Hun You clan cruel aged beast heart, invading as bandits and thieves, moreover treacherous at the border settlements.",
  "s0114": "Ah!",
  "s0115": "I commanded generals to go punish their crimes, ten thousand man leaders, thousand man leaders, thirty-two lords all came, surrendered and fled the army.",
  "s0116": "Hun You moved their territory, northern provinces thus pacified.",
  "s0117": "Use all your heart, do not create resentment, do not pity virtue, do not then neglect preparations.",
  "s0118": "Non-educated men may not follow the expedition.",
  "s0119": "Ah, protect the state and cherish the people, can you not be respectful!",
  "s0120": "King, take heed of this.'",
  "s0122": "Above is King of Yan's charter.",
  "s0123": "'In year 6, fourth month, day yi-si, the Emperor sent Censor-in-Chief Tang to establish son Xu as King of Guangling in the ancestral temple.",
  "s0124": "Saying: Ah, young son Xu, receive this red altar!",
  "s0125": "I succeed the ancestors, examining antiquity establish your state, enfeoff in the southern lands, generation after generation as Han's border auxiliary.",
  "s0126": "Ancient people have said: 'South of the great river, between the five lakes, their people are light-hearted.",
  "s0127": "Yang province guards the borders, three dynasties' important territory, not reached by administration.'",
  "s0128": "Ah!",
  "s0129": "Use all your heart, be cautious and fearful, be benevolent and compliant, do not be ignorant and fond of excess, do not approach villains, follow law and rules."
}