{
  "s0467": "Gentlemen make it certainly nameable, speak it certainly practicable.",
  "s0468": "Gentlemen regarding their words have nothing careless.'",
  "s0470": "The next year, Ran You served as Ji family general, fought Qi at Lang, conquered them.",
  "s0471": "Ji Kang Zi said: 'Regarding military affairs, did you learn it?",
  "s0472": "Is it natural?'",
  "s0473": "Ran You said: 'Learned it from Confucius.'",
  "s0474": "Ji Kang Zi said: 'What kind of person is Confucius?'",
  "s0475": "Replied: 'Employing him brings fame;",
  "s0476": "broadcast to the people, tested against ghosts and spirits without regret.",
  "s0477": "Seeking to the utmost this Way, though burdening a thousand altars, the Master would not take profit.'",
  "s0478": "Kang Zi said: 'I wish to summon him, may I?'",
  "s0479": "Replied: 'Wishing to summon him, then do not restrain him with petty men, then it can be.'",
  "s0480": "Wei Kong Wen Zi was about to attack Tai Shu, asked strategy from Zhong Ni.",
  "s0481": "Zhong Ni declined not knowing, retired and ordered to load the cart and depart, said: 'Birds can choose trees, how can trees choose birds!'",
  "s0482": "Wen Zi firmly stopped him.",
  "s0483": "Met Ji Kang Zi expel Gong Hua, Gong Bin, Gong Lin, with gifts welcomed Confucius, Confucius returned to Lu.",
  "s0484": "Confucius's departure from Lu was fourteen years in total when he returned to Lu.",
  "s0485": "Lu Ai Gong asked about governance, replied: 'Governance lies in selecting ministers.'",
  "s0486": "Ji Kang Zi asked about governance, said: 'Raise the straight and place over the crooked, then the crooked become straight.'",
  "s0487": "Kang Zi worried about thieves, Confucius said: 'If you do not desire, though rewarding them they will not steal.'",
  "s0488": "Yet Lu ultimately could not employ Confucius, Confucius also did not seek office.",
  "s0489": "In Confucius's time, Zhou house was weak and ritual music decayed, poetry and documents deficient.",
  "s0490": "He traced the rituals of the three dynasties, ordered documents and commentaries, above recording from Tang Yu's time, below reaching Qin Mu, edited their affairs.",
  "s0491": "Said: 'Xia rituals I can speak of, Qi is insufficient to verify.",
  "s0492": "Yin rituals I can speak of, Song is insufficient to verify.",
  "s0493": "Sufficient, then I can verify them.'",
  "s0494": "Observed Yin and Xia additions and subtractions, said: 'Later though a hundred generations can be known, with one culture one plainness.",
  "s0495": "Zhou monitored the two dynasties, flourishing with culture!",
  "s0496": "I follow Zhou.'",
  "s0497": "Therefore Book Commentaries, Ritual Records are from the Kong family.",
  "s0498": "Confucius told Lu Grand Master: 'Music can be known.",
  "s0499": "Beginning harmonious like, extending pure like, clear like, continuous like, thus complete.'",
  "s0500": "'I from Wei returned to Lu, then music was corrected, Ya and Song each obtained their place.'",
  "s0502": "Ancient poetry was over three thousand pieces, until Confucius, removed duplicates, took what could be applied to ritual and righteousness, above gathered from Xie and Hou Ji, middle described Yin Zhou's flourishing, to You Li's decline, beginning from bed curtains, thus said 'Guan Ju's disorder begins the feng, Lu Ming begins the little ya, Wen Wang begins the great ya, Qing Miao begins the song'.",
  "s0503": "Three hundred five pieces Confucius all played on strings and sang, to seek harmony with Shao Wu ya song sounds.",
  "s0504": "Ritual and music from this can be obtained and expounded, to prepare the kingly way, complete the six arts.",
  "s0505": "Confucius late and delighted in Yi, ordered the tuan, xi, xiang, shuo gua, wen yan.",
  "s0506": "Read Yi, leather straps broke three times.",
  "s0507": "Said: 'Grant me a few more years, thus I at Yi would be refined.'",
  "s0509": "Confucius taught with poetry documents ritual music, disciples altogether three thousand, those proficient in six arts seventy-two persons.",
  "s0510": "Like Yan Zhu Zou's group, those who received teaching were very many.",
  "s0511": "Confucius taught four things: culture, conduct, loyalty, faith.",
  "s0512": "Abstained from four: no intention, no certainty, no rigidity, no selfishness.",
  "s0513": "What careful: fasting, war, illness.",
  "s0514": "Rarely spoke of profit and fate and benevolence.",
  "s0515": "Not indignant not enlightened, lift one corner not using three corners reverse, then not repeat.",
  "s0516": "In his village, cautious like unable to speak.",
  "s0517": "In ancestral temples and courts, eloquent speech, only careful.",
  "s0518": "At court, speaking with upper ministers, solemn like;",
  "s0519": "speaking with lower ministers, upright like."
}