{
  "s0254": "Feathers and wings already formed, spanning across the four seas.",
  "s0255": "Spanning across the four seas, what can be done about it!",
  "s0256": "Even if there are arrows and strings, where can they still be applied!'",
  "s0257": "He sang several stanzas, Lady Qi sobbed and wept, the emperor rose and left, the banquet ended.",
  "s0258": "In the end he did not change the crown prince—the Marquis of Liu originally summoned these four people's strength.",
  "s0259": "The Marquis of Liu followed the emperor attacking Dai, put forth extraordinary plans at Maiyi, and when establishing Xiao He as prime minister, the affairs of the realm he discussed leisurely with the emperor were very many, but they were not the realm's matters of survival and extinction, thus not recorded.",
  "s0260": "The Marquis of Liu then said: 'My family for generations served as chancellors of Han, and when Han was extinguished, I did not spare ten thousand jin of wealth, to avenge Han I strongly opposed Qin, shaking the realm.",
  "s0261": "Now with three cun tongue I serve as the emperor's teacher, enfeoffed with ten thousand households, position as marquis—this is the extreme for a commoner, sufficient for Liang.",
  "s0262": "I wish to abandon worldly affairs, desire to follow Master Chisong in roaming.'",
  "s0263": "Thus he studied avoiding grain, guiding and pulling to lighten the body.",
  "s0264": "When Gaozu passed away, Empress Lü appreciated the Marquis of Liu, thus forced him to eat, saying: 'A person's life in the world is like a white colt passing through a crack, why go so far as to torment yourself like this!'",
  "s0265": "The Marquis of Liu had no choice, strongly listened and ate.",
  "s0266": "Eight years later he died, given the posthumous title Marquis Wen Cheng.",
  "s0267": "His son Buyi succeeded as marquis.",
  "s0268": "Zifang at first saw the old man on the Xiapi bridge who gave him the Taigong book—thirteen years later following Gaozu passing Jibei, indeed saw the yellow stone under Gucheng Mountain, took it and treasured and sacrificed to it.",
  "s0269": "When the Marquis of Liu died, he was buried together with the yellow stone tomb.",
  "s0270": "Every time ascending the tomb at winter sacrifices, he sacrificed to the yellow stone.",
  "s0271": "The Marquis of Liu Buyi, in Emperor Wen year 5, was convicted of disrespect, the state abolished.",
  "s0272": "The Grand Historian says: Scholars mostly say there are no ghosts and spirits, yet they speak of having things.",
  "s0273": "As for the Marquis of Liu seeing the old man give the book, it can also be considered strange.",
  "s0274": "Gaozu departed from difficulties several times, yet the Marquis of Liu constantly had meritorious strength—how can this not be called heaven?",
  "s0275": "The emperor said: 'Planning strategies within the tent, deciding victories a thousand li away—I am not equal to Zifang.'",
  "s0276": "I considered this person in planning to be stalwart and extraordinary, until seeing his portrait, his appearance was like a woman or beautiful girl.",
  "s0277": "As Confucius said: 'To take people by appearance loses Zi Yu.'",
  "s0278": "The Marquis of Liu was also thus."
}