{
  "s0101": "Arrived at Pengcheng, Han was defeated and returned.",
  "s0102": "Arrived at Xiayi, the King of Han dismounted and sat on his saddle asking: 'I wish to abandon everything east of the passes—who can share merit with me?'",
  "s0103": "Liang advanced and said: 'King Jiu Jiang Ying Bu is a fierce Chu general, has a grudge with Xiang Wang;",
  "s0104": "Peng Yue is rebelling in Liang territory with King Qi Tian Rong: these two can be urgently employed.",
  "s0105": "Among the King of Han's generals, only Han Xin can be entrusted with great matters, to hold one front.",
  "s0106": "If you wish to abandon it, abandon it to these three men, then Chu can be broken.'",
  "s0107": "The King of Han then sent Sui He to persuade King Jiu Jiang Bu, and sent people to contact Peng Yue.",
  "s0108": "When King Wei Bao rebelled, he had Han Xin lead troops to attack him, thus raising Yan, Dai, Qi, and Zhao.",
  "s0109": "Yet those who ultimately broke Chu were these three men's strength.",
  "s0110": "Zhang Liang was often ill, never specially commanded troops, constantly drew up strategies, sometimes followed the King of Han.",
  "s0111": "Han year 3, Xiang Yu urgently besieged the King of Han at Xingyang, the King of Han was fearful and worried, consulted with Li Yiji about weakening Chu's power.",
  "s0112": "Li Yiji said: 'In ancient times Tang attacked Jie and enfeoffed his descendants in Qi.",
  "s0113": "King Wu attacked Zhou and enfeoffed his descendants in Song.",
  "s0114": "Now Qin lost virtue and abandoned righteousness, invaded the feudal lords' altars of soil and grain, extinguished the six states' descendants, leaving them with no place to stand a spike.",
  "s0115": "If your majesty can truly restore the six states' descendants, once they have all received seals, their lords and ministers and common people will certainly all wear your majesty's virtue, none will not turn toward the wind and admire righteousness, wishing to be subjects and concubines.",
  "s0116": "Once virtue and righteousness are practiced, your majesty facing south will proclaim hegemony, Chu will certainly gather robes and come to court.'",
  "s0117": "The King of Han said: 'Good.",
  "s0118": "Hurry and carve the seals, sir go and carry them.'",
  "s0120": "Li Yiji had not yet departed when Zhang Liang came from outside to greet.",
  "s0121": "The King of Han was eating, said: 'Zifang come forward!",
  "s0122": "There is a guest who has planned for me to weaken Chu's power.'",
  "s0123": "He told him Li Yiji's words, said: 'What does Zifang think of this?'",
  "s0124": "Liang said: 'Who devised this plan for your majesty?",
  "s0125": "Your majesty's affairs are finished.'",
  "s0126": "The King of Han said: 'Why?'",
  "s0127": "Zhang Liang replied: 'Your servant requests to borrow the eating sticks in front to plan for the great king.'",
  "s0128": "He said: 'In ancient times Tang attacked Jie and enfeoffed his descendants in Qi because he assessed he could control Jie's fate.",
  "s0129": "Now can your majesty control Xiang Ji's fate?'",
  "s0130": "Said: 'Cannot.'",
  "s0131": "'This is the first reason it cannot be done.",
  "s0132": "King Wu attacked Zhou and enfeoffed his descendants in Song because he assessed he could obtain Zhou's head.",
  "s0133": "Now can your majesty obtain Xiang Ji's head?'",
  "s0134": "Said: 'Cannot.'",
  "s0135": "'This is the second reason it cannot be done.",
  "s0136": "When King Wu entered Yin, he honored Shang Rong's gate, released Ji Zi's imprisonment, sealed Bi Gan's grave.",
  "s0137": "Now can your majesty seal sages' graves, honor worthies' gates, bow to the wise's doors?'",
  "s0138": "Said: 'Cannot.'",
  "s0139": "'This is the third reason it cannot be done.",
  "s0140": "He opened Ju Qiao's granaries, scattered Lu Tai's money, to grant to the poor.",
  "s0141": "Now can your majesty scatter the treasuries to grant to the poor?'",
  "s0142": "Said: 'Cannot.'",
  "s0143": "'This is the fourth reason it cannot be done.",
  "s0144": "When Yin affairs were finished, he laid aside armor for carriages, placed weapons upside down, covered them with tiger skins, to show the realm no longer used troops.",
  "s0145": "Now can your majesty lay aside arms and practice civility, no longer use troops?'",
  "s0146": "Said: 'Cannot.'",
  "s0147": "'This is the fifth reason it cannot be done.",
  "s0148": "He rested horses on Mount Hua's north slope, showing he had nothing to do.",
  "s0149": "Now can your majesty rest horses with nothing to use them for?'",
  "s0150": "Said: 'Cannot.'",
  "s0151": "'This is the sixth reason it cannot be done.'"
}