{
  "s0573": "As for composing the Spring and Autumn Annals, what should be written was written, what should be deleted was deleted, even Zi Xia's disciples could not add a single word.",
  "s0574": "The disciples received the Spring and Autumn Annals, Confucius said: 'Later generations who know Qiu will do so through the Spring and Autumn Annals, and those who condemn Qiu will also do so through the Spring and Autumn Annals.'",
  "s0576": "The next year, Zi Lu died in Wei.",
  "s0577": "Confucius fell ill, Zi Gong requested to see him.",
  "s0578": "Confucius was leaning on his staff strolling at the gate, said: 'Ci, why have you come so late?'",
  "s0579": "Confucius thus sighed, sang: 'Great Mountain collapses!",
  "s0580": "Rafters break!",
  "s0581": "Wise man withers!'",
  "s0582": "Thus tears flowed down.",
  "s0583": "He told Zi Gong: 'The world has lacked the Way for a long time, none can follow me.",
  "s0584": "Xia people encoffined on the eastern steps, Zhou people on the western steps, Yin people between the two pillars.",
  "s0585": "Last night I dreamed I sat enshrined between the two pillars, I began as a Yin person.'",
  "s0586": "After seven days he died.",
  "s0587": "Confucius was seventy-three years old, died in the fourth month on ji-chou day of Duke Ai of Lu's sixteenth year.",
  "s0588": "Duke Ai eulogized him saying: 'Heaven does not bless, does not pity and leave one elder, causing me alone to remain in position, solitary I am in mourning.",
  "s0589": "Alas, alas!",
  "s0590": "Ni Father, do not restrain yourself!'",
  "s0591": "Zi Gong said: 'Your lordship will not be forgotten in Lu!",
  "s0592": "The Master's words say: \"When ritual is lost then confusion, when names are lost then error.",
  "s0593": "Losing the will is confusion, losing the place is error.\"'",
  "s0594": "While alive he could not be employed, when dead he is eulogized, this is not ritual.",
  "s0595": "Calling himself 'I alone', this is not the name.'",
  "s0597": "Confucius was buried north of Lu city on the Si River, disciples all mourned for three years.",
  "s0598": "After three years the mourning in heart was complete, they bid farewell and left, then wept, each exhausting their grief;",
  "s0599": "some remained again.",
  "s0600": "Only Zi Gong built a hut on the tomb, for six years in all, then left.",
  "s0601": "Disciples and Lu people who moved to live by the tomb numbered over one hundred households, thus named Kong Village.",
  "s0602": "Lu generation after generation transmitted to offer sacrifice to Confucius's tomb at the seasons, while Confucian scholars also lectured on ritual, rural feasts, and great archery at Confucius's tomb.",
  "s0603": "Confucius's tomb was one qing in size.",
  "s0604": "Therefore in the hall where he resided among disciples, later generations accordingly made a temple to store Confucius's clothes, hat, zither, chariot, books, continuing to the Han for over two hundred years without cease.",
  "s0605": "The Supreme Emperor passed through Lu, sacrificed to him with the great牢.",
  "s0606": "Feudal lords and ministers arriving, always first visited then conducted affairs.",
  "s0607": "Confucius fathered Li, styled Bo Yu.",
  "s0608": "Bo Yu at age fifty died before Confucius.",
  "s0609": "Bo Yu fathered Ji, styled Zi Si, age sixty-two.",
  "s0610": "Once was besieged in Song.",
  "s0611": "Zi Si composed the Doctrine of the Mean.",
  "s0612": "Zi Si fathered Bai, styled Zi Shang, age forty-seven.",
  "s0613": "Zi Shang fathered Qiu, styled Zi Jia, age forty-five.",
  "s0614": "Zi Jia fathered Ji, styled Zi Jing, age forty-six.",
  "s0615": "Zi Jing fathered Chuan, styled Zi Gao, age fifty-one.",
  "s0616": "Zi Gao fathered Chong, styled Zi Gao, age fifty-seven, once served as Wei chancellor.",
  "s0617": "Zi Gao fathered Fu, age fifty-seven, died in Chen serving Chen King Fu as doctor.",
  "s0618": "Fu's disciple Xiang, age fifty-seven.",
  "s0619": "Once served as doctor to Emperor Hui of Han, moved to become governor of Changsha.",
  "s0620": "Nine chi six cun tall.",
  "s0621": "Zi Xiang fathered Zhong, age fifty-seven.",
  "s0622": "Zhong fathered Wu, Wu fathered Yan Nian and An Guo.",
  "s0623": "An Guo served as doctor to the current emperor, went to be governor of Linhuai, died young.",
  "s0624": "An Guo fathered Ang, Ang fathered Huan."
}
