{
  "s0001": "Chen Sheng was from Yangcheng, with the courtesy name She.",
  "s0002": "Wu Guang was from Yangxia, with the courtesy name Shu.",
  "s0003": "When Chen Sheng was young, he once worked as a hired laborer plowing fields. Stopping on a ridge, he sighed for a long time and said: 'If we become wealthy and noble, don't forget each other.'",
  "s0004": "The other laborers laughed and replied: 'You work as a hired hand plowing fields—how could you become wealthy and noble?'",
  "s0005": "Chen Sheng sighed deeply and said: 'Alas, how could mere sparrows understand the ambitions of a swan?'",
  "s0007": "In the first year of the Second Emperor's reign, seventh month, they conscripted the lower classes to serve at the garrison in Yuyang, and 900 men were stationed at Daze Township.",
  "s0008": "Chen Sheng and Wu Guang were both selected to go and made company commanders.",
  "s0009": "Just then there was a great rainstorm, the roads became impassable, and they realized they would miss their deadline.",
  "s0010": "Missing the deadline meant execution by law.",
  "s0011": "Chen Sheng and Wu Guang then conspired, saying: 'Now, fleeing means death, but starting a great enterprise also means death. Since death is certain either way, why not die for our country?'",
  "s0012": "Chen Sheng said: 'The world has suffered under Qin rule for a long time.",
  "s0013": "I have heard that the Second Emperor is the younger son and should not have ascended. The one who should have been emperor is Prince Fusu.'",
  "s0014": "Because Fusu frequently remonstrated, the First Emperor sent him to command troops on the frontier.",
  "s0015": "Now it is rumored that he was innocent, but the Second Emperor killed him.",
  "s0016": "The common people have heard much of his virtue, but do not know he is dead.",
  "s0017": "Xiang Yan was a Chu general who achieved many victories, loved his soldiers, and the Chu people pitied him.",
  "s0018": "Some think he is dead, others think he has fled.",
  "s0019": "Now if we use our forces to falsely claim to be Prince Fusu and Xiang Yan, and start the uprising for all under heaven, many should respond to us.'",
  "s0020": "Wu Guang agreed.",
  "s0021": "So they consulted an oracle.",
  "s0022": "The diviner knew their intentions and said: 'Your affairs will all succeed and you will achieve merit.",
  "s0023": "However, you are consulting the spirits!'",
  "s0024": "Chen Sheng and Wu Guang were delighted, thinking about the spirits, and said: 'This teaches us to first awe the masses.'",
  "s0025": "So they wrote in cinnabar on silk 'Chen Sheng will be king' and placed it in the belly of a fish someone was netting.",
  "s0026": "The soldiers bought the fish and cooked it, finding the writing in the belly, and were already amazed by it.",
  "s0027": "They also forced Wu Guang to go to the shrine in the bushes by their camp, where at night he lit torches and imitated a fox's cry shouting 'Great Chu rises, Chen Sheng will be king.'",
  "s0028": "The soldiers were all frightened that night.",
  "s0029": "The next day, the soldiers whispered among themselves, all pointing at Chen Sheng.",
  "s0030": "Wu Guang had always been kind to people, so many soldiers were willing to serve him.",
  "s0031": "The officer was drunk, Wu Guang deliberately spoke several times about wanting to escape, angering the officer, who insulted him, in order to incite the troops.",
  "s0032": "The officer indeed beat Wu Guang.",
  "s0033": "The officer drew his sword, Wu Guang stood up, seized it and killed the officer.",
  "s0034": "Chen Sheng helped him, and they killed both officers.",
  "s0035": "They summoned their followers and said: 'Gentlemen, because of the rain, you have all missed the deadline, and missing the deadline means execution.",
  "s0036": "Even if by luck the order doesn't execute you, going to the frontier means sixteen or seven out of ten will die.",
  "s0037": "Moreover, a heroic man either doesn't die or dies for a great cause. Are kings, marquises, generals, and ministers born with it in their blood?'",
  "s0038": "The followers all said: 'We respectfully accept your command.'",
  "s0039": "So they falsely claimed to be Prince Fusu and Xiang Yan, following the people's wishes.",
  "s0040": "They bared their right shoulders and proclaimed Great Chu.",
  "s0041": "They built an altar and swore an oath, using the officer's head as sacrifice.",
  "s0042": "Chen Sheng made himself general, Wu Guang vice-commander.",
  "s0043": "They attacked Daze Township, captured it, and attacked Qi.",
  "s0044": "Qi fell, so they ordered Ge Ying of Fuli to lead troops and take the areas east of Qi.",
  "s0045": "They attacked Zhi, Zang, Ku, Zhe, and Qiao—all fell.",
  "s0046": "They marched while recruiting troops.",
  "s0047": "By the time they reached Chen, they had six or seven hundred chariots, over a thousand cavalry, and tens of thousands of soldiers.",
  "s0048": "They attacked Chen. The governor and magistrate were not there, only the deputy fought them at Qiao Gate.",
  "s0049": "He could not defeat them, the deputy died, so they entered and occupied Chen.",
  "s0050": "After several days, they issued orders summoning the elders and local leaders to come meet and discuss matters.",
  "s0051": "The elders and leaders all said: 'General, you have worn armor and wielded weapons, attacked the unrighteous, punished the violent Qin, and restored the Chu state's altars. Your merit deserves kingship.'"
}