{
  "s0001": "King Jing Liu Jia was one of the various Liu clansmen; no one knows which branch he belonged to during the initial uprising.",
  "s0002": "In the first year of Han King, after pacifying the Three Qins, Liu Jia served as a general, secured the border regions, and followed east to attack Xiang Yu.",
  "s0003": "In Han year 4, when the Han King was defeated at Chenggao and crossed north over the river, obtaining the armies of Zhang Er and Han Xin, he stationed at Xiuwu with deep moats and high ramparts, commanding Liu Jia to lead 20,000 men and several hundred cavalry across the Baima Ford into Chu territory, burning their grain stores to disrupt their livelihoods and prevent them from supplying Xiang Yu's army with food.",
  "s0004": "Soon after, Chu troops attacked Liu Jia, but Jia entrenched himself and refused battle, instead holding out with Peng Yue.",
  "s0005": "In Han year 5, the Han King pursued Xiang Yu to Gulang, commanding Liu Jia to cross south over the Huai and besiege Shouchun.",
  "s0006": "On the return, he sent agents to secretly recruit Chu's Grand Marshal Zhou Yin.",
  "s0007": "Zhou Yin defected from Chu and assisted Liu Jia in capturing Jiujiang, welcoming King Wu Ying Bu's troops, all gathering at Gaixia to jointly attack Xiang Yu.",
  "s0008": "The Han King then commanded Liu Jia to lead the Jiujiang troops southwest with Grand Marshal Lu Wan to attack King Linjiang Gong Wei.",
  "s0009": "Gong Wei had already died, so Linjiang was made into Nanguo commandery.",
  "s0010": "In spring of Han year 6, he assembled the feudal lords at Chen, deposed King Chu Xin, imprisoned him, and divided his territory into two kingdoms.",
  "s0011": "At this time, Gaozu's sons were young, his brothers few, and moreover not worthy, so he wished to enfeoff kings from the same surname to stabilize the realm. He issued an edict saying: 'General Liu Jia has merit, and I will select clansmen who can be made kings.'",
  "s0012": "All the ministers said: 'Establish Liu Jia as King of Jing, ruling over 52 cities east of the Huai;",
  "s0013": "Gaozu's younger brother Jiao as King of Chu, ruling over 36 cities west of the Huai.'",
  "s0014": "He then established his son Fei as King of Qi.",
  "s0015": "This began the enfeoffment of brothers from the Liu clan.",
  "s0016": "In autumn of Gaozu year 11, King Huainan Ying Bu rebelled and attacked Jing to the east.",
  "s0017": "King Jing Jia fought him but was defeated, fled to Fuling, and was killed by Bu's army.",
  "s0018": "Gaozu personally attacked and defeated Bu.",
  "s0019": "In year 12, he established Marquis Pei Liu Pi as King of Wu, ruling over the former Jing territory.",
  "s0020": "King Yan Liu Ze was a distant relation of the various Liu clansmen.",
  "s0021": "In Gaozu year 3, Ze served as a palace attendant.",
  "s0022": "In Gaozu year 11, Ze as a general attacked Chen Xi, captured Wang Huang, and was made Marquis of Yingling.",
  "s0023": "During Empress Gao's time, a man from Qi named Tian Sheng, traveling without funds, sought patronage from Marquis Yingling Ze with his paintings.",
  "s0024": "Ze was greatly pleased with him and used 200 jin of gold to celebrate Tian Sheng's birthday.",
  "s0025": "After Tian Sheng received the gold, he immediately returned to Qi.",
  "s0026": "Two years later, Ze sent someone to tell Tian Sheng: 'The matter is finished.'",
  "s0027": "Tian Sheng went to Chang'an but did not see Ze. Instead, he rented a large residence and had his son seek service with Zhang Ziqing, the Grand Usher favored by Empress Lü.",
  "s0028": "After several months, Tian Sheng's son invited Zhang Qing to visit, preparing elaborate arrangements personally.",
  "s0029": "Zhang Qing agreed to go.",
  "s0030": "Tian Sheng prepared lavish curtains and furnishings, comparable to those of marquises.",
  "s0031": "Zhang Qing was astonished.",
  "s0032": "When the wine flowed freely, he dismissed the attendants and spoke confidentially to Zhang Qing: 'I have observed that the sons and younger brothers of the feudal kings in the various mansions number over a hundred, all of them Gaozu's founding meritorious officials.",
  "s0033": "Now the Lü clan, being old acquaintances, originally helped push Gaozu to obtain the realm, their merit is extremely great, and moreover they have the weighty kinship of being the empress dowager's relatives.",
  "s0034": "The empress dowager is advanced in years, the various Lü are weak, the empress dowager wishes to establish Lü Chan as king of Lü, ruling Dai.",
  "s0035": "The empress dowager repeatedly brings this up, fearing the ministers will not listen.",
  "s0036": "Now you are most favored, respected by the ministers—why not sound out the ministers to inform the empress dowager? The empress dowager will certainly be pleased.",
  "s0037": "Once the various Lü are kings, a marquisate of ten thousand households will also be yours.",
  "s0038": "The empress dowager desires this in her heart, and you as an inner minister, if you do not act quickly, disaster may befall you.'",
  "s0039": "Zhang Qing greatly approved and began sounding out the ministers to speak to the empress dowager.",
  "s0040": "At court, the empress dowager questioned the ministers.",
  "s0041": "The ministers requested establishing Lü Chan as King of Lü.",
  "s0042": "The empress dowager granted Zhang Qing a thousand jin of gold, and Zhang Qing gave half of it to Tian Sheng.",
  "s0043": "Tian Sheng did not accept it, and instead advised him: 'Lü Chan is now king, but the various ministers are not yet greatly convinced.",
  "s0044": "Now Marquis Yingling Ze, of the various Liu, serves as Grand General, and only he still feels disappointed.",
  "s0045": "If you speak to the empress dowager now and have her enfeoff him as king of more than ten counties, he will obtain kingship, leave happily, and the various Lü kingships will be even more secure.'",
  "s0046": "Zhang Qing went in and spoke, and the empress dowager agreed to it.",
  "s0047": "Thus Marquis Yingling Liu Ze was made King of Langye.",
  "s0048": "The King of Langye then went to his kingdom with Tian Sheng.",
  "s0049": "Tian Sheng urged Ze to proceed quickly without delay.",
  "s0050": "They passed through the passes, and the empress dowager indeed sent people to pursue and stop them, but they had already left, so they returned."
}