{
  "s0202": "Emperor Jing watched and laughed saying: 'This is not enough for sir?'",
  "s0203": "Marquis Tiao removed his cap and apologized.",
  "s0204": "The emperor rose, Marquis Tiao thus hurried out.",
  "s0205": "Emperor Jing followed with his eyes, said: 'This discontented one is not a minister for a young lord!'",
  "s0207": "After not long, Marquis Tiao's son for father bought from the artisan office Shangfang five hundred suits of armor and shields that could be used for burial.",
  "s0208": "Took laborers to work them hard, did not give money.",
  "s0209": "The laborers knew they were illicitly buying government equipment, angered and reported the irregularity, accusing the son, the matter implicated and defiled Marquis Tiao.",
  "s0210": "The memorial having reached the emperor, sent down officials.",
  "s0211": "The officials interrogated Marquis Tiao according to the records, Marquis Tiao did not answer.",
  "s0212": "Emperor Jing cursed saying: 'I will not employ you.'",
  "s0213": "Summoned to the Chamberlain for Law Enforcement.",
  "s0214": "The Chamberlain for Law Enforcement interrogated saying: 'Marquis wishes to rebel?'",
  "s0215": "Yafu said: 'What your servant bought were burial items, why speak of rebellion?'",
  "s0216": "The officials said: 'Even if marquis does not rebel on the earth, he wishes to rebel under the earth.'",
  "s0217": "The officials pressed him increasingly urgently.",
  "s0218": "Initially when officials arrested Marquis Tiao, Marquis Tiao wished to commit suicide, his wife stopped him, because of this could not die, thus entered the Chamberlain for Law Enforcement.",
  "s0219": "Thus did not eat for five days, vomited blood and died.",
  "s0220": "State abolished.",
  "s0221": "Cut off for one year, Emperor Jing then re-enfeoffed Marquis Jiang Bo's other son Jian as Marquis of Pingqu, continued the Marquis of Jiang's line.",
  "s0222": "Nineteen years died, posthumous title Marquis Gong.",
  "s0223": "Son Jiande succeeded to the marquisate, thirteen years, served as crown prince tutor.",
  "s0224": "Because of unsatisfactory tribute wine, Yuanding year 5, had crime, state abolished.",
  "s0225": "Marquis Tiao indeed starved to death.",
  "s0226": "After death, Emperor Jing then enfeoffed Wang Xin as Marquis of Gai.",
  "s0227": "The Grand Historian says: Marquis Jiang Zhou Bo when beginning as commoner, was a vulgar rustic, ability no more than ordinary.",
  "s0228": "When followed Gaozu to settle the realm, in general and chancellor position, the various Lü wished to make rebellion, Bo rectified the state's difficulties, returned it to correctness.",
  "s0229": "Even Yi Yin and Zhou Gong, what could surpass this!",
  "s0230": "Yafu's use of troops, held authority and weight, grasped firm blade, Rang Ju what could surpass this!",
  "s0231": "Self-sufficient without learning, maintained integrity without yielding, ultimately ended in poverty.",
  "s0232": "Alas!"
}