{
  "s0001": "Laozi was a man of Qu Ren Village, Li Township, Ku County, Chu, surname Li, name Er, courtesy name Dan, Zhou's keeper of the archives.",
  "s0002": "Confucius went to Zhou, about to ask about rites from Laozi.",
  "s0003": "Laozi said: 'What you speak of, their persons and bones have all rotted away, only their words remain.",
  "s0004": "Moreover gentlemen getting their time then drive, not getting their time then roll along like tumbleweed.",
  "s0005": "I have heard that good merchants deeply hide as if empty, gentlemen of great virtue appear foolish in countenance.",
  "s0006": "Rid yourself of arrogant airs and many desires, affected expressions and licentious ambitions, these are all of no benefit to your person.",
  "s0007": "What I tell you is only this.'",
  "s0008": "Confucius left, told his disciples: 'Birds, I know they can fly;",
  "s0009": "fish, I know they can swim;",
  "s0010": "beasts, I know they can run.",
  "s0011": "Runners can be netted, swimmers can be lined, flyers can be arrowed.",
  "s0012": "As for dragons, I cannot know how they ride wind and clouds up to heaven.",
  "s0013": "I today saw Laozi, it was like a dragon!'",
  "s0015": "Laozi cultivated morality and virtue, his learning took self-concealment and namelessness as its purpose.",
  "s0016": "Stayed in Zhou for a long time, seeing Zhou's decline, then departed.",
  "s0017": "Arrived at the pass, the pass commander Yin Xi said: 'You will hide yourself, force yourself to write a book for me.'",
  "s0018": "Thus Laozi wrote a book in upper and lower chapters, speaking of the meaning of morality and virtue in over five thousand words and departed, none know where he ended.",
  "s0019": "Some say: Lao Lai Zi was also a Chu man, wrote fifteen chapters, speaking of Daoist applications, contemporary with Confucius.",
  "s0020": "Laozi was over one hundred sixty years old, some say over two hundred years, because he cultivated the Dao and nurtured longevity.",
  "s0021": "After Confucius died 129 years, and the records say Zhou Grand Historian Tan saw Qin Lord Xian saying: 'Originally Qin and Zhou united, united five hundred years and separated, separated seventy years and a hegemon-king will emerge.'",
  "s0022": "Some say Tan was Laozi, some say not, the world does not know if it was so or not.",
  "s0023": "Laozi was a concealed gentleman.",
  "s0024": "Laozi's son named Zong, Zong was Wei general, enfeoffed at Duan Gan.",
  "s0025": "Zong's son Zhu, Zhu's son Gong, Gong's great-grandson Jia, Jia served Han Xiaowen Emperor.",
  "s0026": "Jia's son Xie was Jiaoxi King Ang's tutor, thus established household in Qi.",
  "s0027": "Those in the world who study Laozi then belittle Confucian learning, Confucian learning also belittles Laozi.",
  "s0028": "'Ways different do not plan for each other', is this what is meant?",
  "s0029": "Li Er non-action self-transforms, pure quiet self-corrects.",
  "s0030": "Zhuangzi was a Meng man, named Zhou.",
  "s0031": "Zhou once was Meng lacquer garden official, contemporary with Liang Hui King and Qi Xuan King."
}