{
  "s0203": "Wu Xu said: 'From Mount Changshan overlooking Dai, Dai can be taken.'",
  "s0204": "Jian Zi then knew Wu Xu was indeed worthy, so deposed crown prince Bo Lu, and made Wu Xu crown prince.",
  "s0205": "Two years later, in the fourteenth year of Duke Ding of Jin, Fan and Zhonghang rebelled.",
  "s0206": "The next year in spring, Jian Zi told Handan minister Wu: 'Return to me five hundred families of Wei soldiers, I will station them in Jinyang.'",
  "s0207": "Wu promised, returned and his father and brothers did not listen, went back on his word.",
  "s0208": "Zhao Yang captured Wu, imprisoned him in Jinyang.",
  "s0209": "Then told the Handan people: 'I am personally executing Wu, whom do you gentlemen want to establish?'",
  "s0210": "So killed Wu.",
  "s0211": "Zhao Ji and She Bin with Handan rebelled.",
  "s0212": "The Jin lord sent Ji Qin to besiege Handan.",
  "s0213": "Xun Yin and Fan Ji She were friendly with Wu, did not want to help Qin and plotted rebellion, Dong An Yu knew of it.",
  "s0214": "Tenth month, Fan and Zhonghang attacked Zhao Yang, Yang fled to Jinyang, Jin people besieged it.",
  "s0215": "Fan Ji She's enemy Wei Xiang and others plotted to drive out Xun Yin, using Liang Ying Fu to replace him;",
  "s0216": "drove out Ji She, using Fan Gao Yi to replace him.",
  "s0217": "Xun Yue spoke to the Jin lord: 'Your lordship commands ministers, those who start disorder die.'",
  "s0218": "Now these three ministers started disorder but only drove out Yang, using punishment unequally, please drive them all out.'",
  "s0219": "Eleventh month, Xun Yue, Han Bu Ning, Wei Duo following the lord's command attacked Fan and Zhonghang, did not succeed.",
  "s0220": "Fan and Zhonghang counterattacked the lord, the lord struck them, Fan and Zhonghang defeated and fled.",
  "s0221": "Ding wei day, the two sons fled to Chaoge.",
  "s0222": "Fan Ji She fled to Zhongqiu.",
  "s0223": "Qi Wu said: 'Formerly my worthy uncle and the Handan difficulty, the Zhao clan truly consolidated it.'",
  "s0224": "With Zhao clan then there is Qi clan, without Zhao clan then there is no Qi clan.'",
  "s0225": "Leave it, why?'",
  "s0226": "So stopped.",
  "s0227": "The Zhao clan exile did not leave Jin borders, ended with Zhao Yang.",
  "s0228": "Twelfth year, Zhao Yang died, son Jian Zi Guan ascended.",
  "s0229": "Jian Zi third year, moved to Jinyang.",
  "s0230": "Fifth year, attacked Wei, took Zhong Mou.",
  "s0231": "Seventh year, attacked Qi, reached the Great Wall.",
  "s0232": "Jian Zi died, son Wu Hou ascended.",
  "s0233": "Wu Hou first year, Prince Chao rebelled, did not succeed, fled to Wei.",
  "s0234": "Prince Sheng attacked Jinyang, Wu Hou personally led to strike him, defeated Prince Sheng, Prince Sheng fled to Sui.",
  "s0235": "Third year, Wu Hou with troops besieged Sui.",
  "s0236": "Zhao Yang and She Bin served as generals, stationed at Ju, and Sui surrendered.",
  "s0237": "Fifth year, besieged Zheng, Zheng surrendered.",
  "s0238": "Zi Kang ascended.",
  "s0239": "Kang fourth year, attacked Zheng, took nine cities.",
  "s0240": "Fifth year, Zheng lord killed his minister Zi Yang.",
  "s0241": "Sixth year, attacked Song, captured Song lord.",
  "s0242": "Seventh year, attacked Qi, took Rao An.",
  "s0243": "Eighth year, Zi Yan ascended.",
  "s0244": "Yan fifth year, attacked Zheng, defeated Zheng army, beheaded and captured eight thousand.",
  "s0245": "Sixth year, attacked Wei, took Ji Pu.",
  "s0246": "Eighth year, captured Wei Pi Shi, abandoned it.",
  "s0247": "Ninth year, attacked Han, took Chang Zi.",
  "s0248": "Tenth year, Zi Xiu ascended.",
  "s0249": "Eleventh year, attacked Han, took Ji Pu.",
  "s0250": "Twelfth year, Zi Tan ascended.",
  "s0251": "Twenty-third year, Zi Zhang ascended.",
  "s0252": "Twenty-eighth year, Yan died, Zi Chao ascended.",
  "s0253": "Chao fourth year, attacked Zheng, took nine cities.",
  "s0254": "Sixth year, attacked Qi, captured their crown prince.",
  "s0255": "Seventh year, attacked Wei, took An Yi.",
  "s0256": "Eighth year, Zi Li ascended.",
  "s0257": "Li sixth year, battled Qin at Changping, army defeated, dead exceeding half.",
  "s0258": "Zhao troops were surrounded by Qin, those pit-killed exceeding four hundred thousand.",
  "s0259": "Dao Xiang Wang first year, besieged Handan.",
  "s0260": "Second year, Handan surrendered to Qin.",
  "s0261": "Zhao Wang Qian, moved to He Nei.",
  "s0262": "Third year, Qin general Wang Jian attacked Zhao, captured Zhao Wang Qian, extinguished Zhao.",
  "s0263": "The Zhao clan's ancestors shared a common origin with Qin.",
  "s0264": "Down to Zhongyan, who served as charioteer to Emperor Da Jia.",
  "s0265": "In later generations, Fei Lian had two sons, and he named one son E Lai, who served King Zhou and was killed by Zhou. His descendants became Qin.",
  "s0266": "E Lai's younger brother was called Ji Sheng, and his descendants became Zhao.",
  "s0267": "Ji Sheng gave birth to Meng Zeng.",
  "s0268": "Meng Zeng was favored by King Cheng of Zhou and was called Zhai Gao Lang.",
  "s0269": "Gao Lang gave birth to Heng Fu, Heng Fu gave birth to Zao Fu.",
  "s0270": "Zao Fu was favored by King Mu of Zhou.",
  "s0271": "Zao Fu obtained the finest horses from Ji, along with the Peach Forest stallions Li, Hua Liu, and Lu Er, and presented them to King Mu.",
  "s0272": "King Mu had Zao Fu drive the chariot on a western inspection tour where he met the Queen Mother of the West and was so delighted he forgot to return.",
  "s0273": "Then King Xu of Xu rebelled, so King Mu raced a thousand li in one day to attack King Xu of Xu and greatly defeated him.",
  "s0274": "He then granted Zao Fu the city of Zhao, and from this came the Zhao clan.",
  "s0275": "From Zao Fu down six generations to Yan Fu, called Gong Zhong. During King Xuan of Zhou's time, he campaigned against the Rong and served as charioteer.",
  "s0276": "At the battle of Qian Mu, Yan Fu rescued King Xuan.",
  "s0277": "Yan Fu gave birth to Shu Dai.",
  "s0278": "During Shu Dai's time, King You of Zhou was tyrannical, so he left Zhou and went to Jin, serving Marquis Wen of Jin, and first established the Zhao clan in Jin.",
  "s0279": "From Shu Dai downward, the Zhao lineage grew increasingly prominent, and after five generations came Zhao Su.",
  "s0280": "Zhao Su, in the sixteenth year of Duke Xian of Jin, attacked Huo, Wei, and Geng, and Zhao Su served as general attacking Huo.",
  "s0281": "The Lord of Huo fled to Qi.",
  "s0282": "Jin then enfeoffed Zhao Su with Geng.",
  "s0283": "Zhao Su gave birth to Gong Meng.",
  "s0284": "During the first year of Duke Min of Lu, Duke Xian of Jin died, and his four sons contended to succeed him, causing chaos in Jin.",
  "s0285": "Zhao Su was not in Jin, so the people became chaotic and welcomed Zhao Su to establish him.",
  "s0286": "This was Duke Wen of Jin.",
  "s0287": "He gave birth to Yuan Tong, Ping Kuo, and Lou He.",
  "s0288": "Duke Wen of Jin died, and his son Duke Xiang Qu ascended.",
  "s0289": "Yuan Tong hated Zheng Zi Hua, so assassinated Zheng Zi Hua.",
  "s0290": "Zhao Dun at this time held the government, and this is when he first became a noble minister.",
  "s0291": "Dun died, and his son Shuo ascended.",
  "s0292": "Shuo died, and Shuo's wife Zhuang Ji became wife of Duke Wen.",
  "s0293": "Duke Wen died, and his son Duke Cheng Hei Tun ascended.",
  "s0294": "Duke Cheng died, and his son Duke Jing Ju ascended.",
  "s0295": "During Duke Jing's time, Chu greatly defeated the Jin army at the Yan River.",
  "s0296": "The Jin musician Kuang said: 'Your army's defeat means the people's defeat, but killing people while you live them makes you begin to be valued.'",
  "s0297": "Shi Kuang said: 'I repeatedly sang the northern wind, then sang the southern wind. The southern wind does not contend, with many dying sounds—Chu will surely defeat Jin.'",
  "s0298": "Indeed, the Chu people achieved merit.",
  "s0299": "Jin captured three Chu generals: Wan Chun, Shen Gong Wu Chen, and Yan Jiangjun.",
  "s0300": "Duke Wen asked Guo Jian: 'Initially my late lord Duke Wen and your late lord uncle Fan planned the army, as well as the former minister Xu Chen.'",
  "s0301": "Xu Chen said: 'Advance, better that we are thin and others are not thin.'",
  "s0302": "The late lord took the eastern road and warned: 'We must restore the state of Wei.'",
  "s0303": "Guo Jian said: 'Do not restore Wei.'",
  "s0304": "For this campaign, Jin's state became great, the feudal lords trustworthy, the highways clear—why speak of restoring Wei?'",
  "s0305": "Duke Wen said: 'You resemble uncle Fan.'",
  "s0306": "Guo Jian said: 'Your servant resembles his former servant, uncle Fan resembles my lord.'",
  "s0307": "My former servant was called Dong Hu, my lord's former lord was called Guo Shu.'",
  "s0308": "Dong Hu was an excellent historian of ancient times, recording law without concealment.'",
  "s0309": "Zhao Xuan Zi held the government and attacked Qi, achieving military merit.",
  "s0310": "On the fourth month xin si day, Ji presented his armor in the court.",
  "s0311": "Xuan Zi said: 'Abandoning government is punishable by execution.'",
  "s0312": "Ji said: 'People say: 'A hen does not crow at dawn.''",
  "s0313": "If a hen crows at dawn, the family will be finished.''",
  "s0314": "Now you lend the government, lending government is a hen crowing at dawn.'",
  "s0315": "People cannot overcome anger, your servant dares not translate.'",
  "s0316": "Zhao Dun secretly hid Xi Ji in Shen and gave birth to Zhao Shuo.",
  "s0317": "Shuo married Zhuang Ji.",
  "s0318": "Dun died, Shuo ascended.",
  "s0319": "Shuo died, Shuo's wife had a posthumous pregnancy, fled to the palace and gave birth to Zhao Wu.",
  "s0320": "Ying Qi deceived and killed Zhao Tong, Zhao Kuo, Zhao Ying Qi, and all their clans were exterminated.",
  "s0321": "Wu then counterattacked and killed Ying Qi, welcomed Zhao Wu from Jinyang and established him.",
  "s0322": "This was Zhao Wen Zi.",
  "s0323": "Wen Zi gave birth to Jing Shu.",
  "s0324": "During Jing Shu's time, Duke Jing of Qi sent Yan Ying to Jin, and Yan Ying spoke with Shu Xiang of Jin.",
  "s0325": "Yan Ying said: 'Among Qi's government being late, the lord's extravagance, and lord and ministers overstepping—among these four things, which will perish first?'",
  "s0326": "Shu Xiang said: 'What four things are you speaking of?'",
  "s0327": "Yan Ying said: 'Formerly, the Qi lord was repeatedly defeated by Cui Zhu and killed him.'",
  "s0328": "Cui Zhu's sons together killed Lord Guang of Qi because of the Cui clan disturbance.'",
  "s0329": "Ministers wish to be wealthy but Yan poor, the lord wishes to be happy but ministers labor.'",
  "s0330": "If these two are not done, who will do them?'",
  "s0331": "Shu Xiang said: 'This is also the lord's desire, but ministers carry it out—from carrying it out to overstepping, from carrying it out to deceiving, from carrying it out to executing, what they follow is the same.'",
  "s0332": "Yan Ying said: 'When the Cui clan left, their lord killed them and died.'",
  "s0333": "The Cui disturbance was the lord's disorderly ministers.'",
  "s0334": "Zhao Wen Zi held the government, commanding light taxation on the people.",
  "s0335": "Wen Zi spoke to the Jin lord: 'Jin's government is in the family gates. Government in family gates means the four neighbors will attack it, destruction can be awaited with one's feet up.'",
  "s0336": "At this time, the six great families of Jin were strong, the ducal house weak.",
  "s0337": "Zhao Jian Zi held Jin's government.",
  "s0338": "Jian Zi became ill and for five days was unconscious. The ministers all feared and summoned Bian Que.",
  "s0339": "Bian Que entered to examine him, then left. Dong An Yu asked.",
  "s0340": "Bian Que said: 'The blood vessels are in order, why be surprised!'",
  "s0341": "Formerly Duke Mu of Qin was once like this, and awoke after seven days.'",
  "s0342": "On the day he awoke, he told Gong Sun Zhi and Zi Yu: 'I was greatly delighted in the imperial place.'",
  "s0343": "The reason I stayed long was that I was learning something.'",
  "s0344": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0345": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0346": "Gong Sun Zhi wrote and hid it.'",
  "s0347": "The Qin spies then left.'",
  "s0348": "Bian Que said: 'Zhao Jian Zi's illness is the same as Duke Mu of Qin's, he will not exceed two nights.'",
  "s0349": "Indeed after two nights he awoke.",
  "s0350": "Jian Zi said: 'I was greatly delighted in the imperial place, touring with the hundred spirits in the celestial sphere, with vast music of nine movements and ten thousand dances, not like the music of the three dynasties, its sound moved the heart.'",
  "s0351": "A bear came wanting to pull me.'",
  "s0352": "The Emperor commanded me to shoot it, I hit the bear and the bear died.'",
  "s0353": "A brown bear came, I shot it again, hit the brown bear and the brown bear died.'",
  "s0354": "The Emperor was greatly pleased and granted me two baskets, both with assistants.'",
  "s0355": "I saw a boy at the Emperor's side. The Emperor entrusted me with a Di dog, saying: 'When your son grows up, grant it to him.'",
  "s0356": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0357": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0358": "Dong An Yu received the words and wrote to hide them.'",
  "s0359": "Jian Zi left, Dong An Yu told his son Zhuang: 'You know this first.'",
  "s0360": "Zhao Jian Zi dreamed of burying himself and seeing the Emperor, and on the ji si day buried himself.",
  "s0361": "When Zhao Wu Ling Wang was born, he seized from his elder brother Zhang and established himself, this was Zhao Wu Ling Wang.",
  "s0362": "From Zhao Su downward, they did not lose their lineage, down to the Wang clan."
}
