{
  "s0051": "He attacked Yu Ying at Kunyang, pursuing to Ye.",
  "s0052": "He returned attacking Wujiang, thus reaching Xingyang.",
  "s0053": "Cao Can from Hanzhong served as General Commandant, following to attack the feudal lords, and when Xiang Yu was defeated, returned to Xingyang, altogether two years.",
  "s0054": "In Gaozu year 2, he was appointed Acting Left Chancellor, entering to station troops in Guanzhong.",
  "s0055": "After more than a month, King Wei Bao rebelled, so as Acting Left Chancellor he separately went east with Han Xin to attack Wei general Sun Ju's army at Dongzhang, greatly defeating it.",
  "s0056": "He then attacked Anyi, capturing Wei general Wang Xiang.",
  "s0057": "He attacked the King of Wei at Quyang, pursuing to Wuyuan, capturing the King of Wei Bao alive.",
  "s0058": "He captured Pingyang, obtaining the King of Wei's mother, wife, and children, completely pacifying Wei territory, altogether fifty-two cities.",
  "s0059": "He was granted fief income in Pingyang.",
  "s0060": "He then followed Han Xin attacking Chancellor of Zhao Xia Yue's army east of Wu, greatly defeating it, beheading Xia Yue.",
  "s0061": "Han Xin and former King Changshan Zhang Er led troops down Jingxing, attacking Lord Cheng'an, while ordering Cao Can to return and besiege Zhao's separate general Lord Qi in Wu city.",
  "s0062": "Lord Qi fled, he pursued and beheaded him.",
  "s0063": "He then led troops to Aocang where the King of Han was located.",
  "s0064": "Han Xin had already defeated Zhao, became Chancellor, attacking Qi to the east.",
  "s0065": "Cao Can as Right Chancellor under Han Xin attacked and broke the Qi army at Lixia, thus capturing Linzi.",
  "s0066": "He returned to pacify Jibei commandery, attacking Zhu, Taoyin, Pingyuan, Ge, and Lu.",
  "s0067": "Soon after he followed Han Xin attacking Long Ju's army at Shang Jiami, greatly defeating it, beheading Long Ju, capturing his general Zhou Lan.",
  "s0068": "He pacified Qi, altogether obtaining over seventy counties.",
  "s0069": "He captured former Qi King Tian Guang's chancellor Tian Guang, his defending chancellor Xu Zhang, and former Qi Jiaodong general Tian Ji.",
  "s0070": "Han Xin became King of Qi, led troops to Chen, together with the King of Han defeated Xiang Yu, while Cao Can remained to pacify those in Qi who had not submitted.",
  "s0071": "After Xiang Ji died and the realm was pacified, the King of Han became emperor, Han Xin was moved to King of Chu, Qi became a commandery.",
  "s0072": "Cao Can returned the Han chancellorship seal.",
  "s0073": "Gaozu made his eldest son Fei King of Qi, and appointed Cao Can as Qi's prime minister.",
  "s0074": "In Gaozu year 6 he was granted marquis rank, sharing the tally with feudal lords, never to be extinguished generation after generation.",
  "s0075": "His fief income was Pingyang with 16,630 households, titled Marquis of Pingyang, removing his previous fief income.",
  "s0076": "As Qi prime minister he attacked Chen Xi's general Zhang Chun's army, defeating it.",
  "s0077": "Ying Bu rebelled, Cao Can as Qi prime minister followed King Daohui leading troops and chariots of 120,000 men, meeting with Gaozu to attack Ying Bu's army, greatly defeating it.",
  "s0078": "He went south to Qi, returning to pacify Zhuyi, Xiang, Xiao, and Liu.",
  "s0079": "Cao Can's merits: Altogether conquered two states, 122 counties;",
  "s0080": "captured two kings, three chancellors, six generals, one Grand Moao, one commandery governor, one marshal, one noble, one imperial secretary each.",
  "s0081": "In Emperor Hui year 1, the law for feudal lords' prime ministers was abolished, changing Cao Can to Qi chancellor.",
  "s0082": "When Cao Can served as chancellor of Qi, Qi had seventy cities.",
  "s0083": "The realm had just been pacified, King Daohui was young, Cao Can summoned all the elders and scholars, asking how to pacify and gather the people, scholars of Qi custom numbered in the hundreds, each speaking differently, Cao Can did not know what to decide.",
  "s0084": "He heard there was Master Gai in Jiaoxi who was skilled in Huang-Lao teachings, sent people with generous gifts to invite him.",
  "s0085": "When he met Master Gai, Master Gai spoke of the way of governance valuing tranquility and the people naturally settling, elaborating on this category comprehensively.",
  "s0086": "Thus Cao Can vacated the main hall and housed Master Gai there.",
  "s0087": "His governance essentials used Huang-Lao methods, thus serving as chancellor of Qi for nine years, Qi was pacified and stable, greatly acclaimed as a worthy chancellor.",
  "s0088": "In Emperor Hui year 2, Xiao He died.",
  "s0089": "Cao Can heard of it, told his retainers to quickly prepare for travel, 'I will enter as prime minister.'",
  "s0090": "Before long, envoys indeed summoned Cao Can.",
  "s0091": "Cao Can departed, instructing his successor chancellor: 'Consider Qi's prisons and markets as entrusted, do not disturb them.'",
  "s0092": "The successor chancellor said: 'Is there nothing more important than this in governance?'",
  "s0093": "Cao Can said: 'Not so.",
  "s0094": "Prisons and markets are for containing all sorts—now if you disturb them, where will wicked people find containment?",
  "s0095": "This is why I put it first.'",
  "s0097": "Cao Can from humble beginnings was on good terms with Xiao He;",
  "s0098": "when they became generals and chancellors, there was some distance.",
  "s0099": "When Xiao He was about to die, the worthy he recommended was only Cao Can.",
  "s0100": "Cao Can succeeded Xiao He as Han prime minister, in handling affairs he changed nothing, strictly following Xiao He's regulations.",
  "s0101": "He selected commandery and state officials who were clumsy with literary phrases, solid and mature elders, immediately summoning and appointing them as chancellor secretaries."
}