{
  "s0051": "Returned to guard Aocang, pursued Xiang Ji.",
  "s0052": "Ji was already dead, thus east pacified Chu territory Sizui and Donghai commandery, altogether obtained twenty-two counties.",
  "s0053": "Returned to guard Luoyang and Yueyang, granted to share eating Zhongli with Marquis Yingyin.",
  "s0054": "As general followed Gaozu against the rebel King Yan Zang Tu, broke him at Yi Xia.",
  "s0055": "The troops he led facing the imperial roadway were the most numerous.",
  "s0056": "Granted rank of noble, shared the tally never to be extinguished generation after generation.",
  "s0057": "Ate Jiang with eight thousand one hundred eighty households, titled Marquis of Jiang.",
  "s0058": "As general followed Gaozu to strike the rebel King Han Xin in Dai, surrendered and captured Huo people.",
  "s0059": "Advancing first to Wuquan, struck Xiongnu cavalry, broke them north of Wuquan.",
  "s0060": "Turned to attack Han Xin's army at Tongdi, broke it.",
  "s0061": "Returned, surrendered six cities in Taiyuan.",
  "s0062": "Struck Han Xin's Xiongnu cavalry below Jinyang, broke it, captured Jinyang.",
  "s0063": "Later struck Han Xin's army at Langshi, broke it, pursued the defeated for eighty li.",
  "s0064": "Returned to attack three cities in Loufan, thus struck Xiongnu cavalry below Pingcheng, the troops he led facing the imperial roadway were the most numerous.",
  "s0065": "Bo was promoted to Grand Commandant.",
  "s0066": "Struck Chen Xi, slaughtered Maiyi.",
  "s0067": "The troops he led beheaded Xi's general Riding Horse Chi.",
  "s0068": "Struck Han Xin, Chen Xi, Zhao Li's army at Loufan, broke it.",
  "s0069": "Captured Xi's generals Song Zui, Yanmen governor Chou.",
  "s0070": "Thus turned to attack and captured Yunzhong governor Su, chancellor Ji Si, general Xun.",
  "s0071": "Pacified Yanmen commandery seventeen counties, Yunzhong commandery twelve counties.",
  "s0072": "Thus again struck Xi at Lingqiu, broke it, beheaded Xi, captured Xi's chancellor Cheng Zong, general Chen Wu, commandery lieutenant Gao Si.",
  "s0073": "Pacified Dai commandery nine counties.",
  "s0074": "King Yan Lu Wan rebelled, Bo as prime minister replaced Fan Kuai as general, struck and captured Ji, obtained Wan's great general Di, chancellor Yan, guard Xing, grand commandant Ruo, censor-in-chief Shi, slaughtered Hundu.",
  "s0075": "Broke Wan's army at Shanglan, again struck and broke Wan's army at Juyang.",
  "s0076": "Pursued to the Great Wall, pacified Shanggu twelve counties, Youbeiping sixteen counties, Liaoxi and Liaodong twenty-nine counties, Yuyang twenty-two counties.",
  "s0077": "First following Gaozu obtained one prime minister, two chancellors, generals and officials of 2000 shi each three each;",
  "s0078": "Separately broke armies two, captured cities three, pacified commanderies five, counties seventy-nine, captured chancellor and great general each one.",
  "s0079": "Bo as a person was stolid, strong, and honest, Gaozu considered him reliable for important matters.",
  "s0080": "Bo did not like literature, whenever he summoned scholars and persuaders, sat facing east and urged them: 'Quickly speak for me.'",
  "s0081": "His simple lack of polish was like this.",
  "s0082": "Bo having pacified Yan and returned, Gaozu had already passed away, served Emperor Xiaohui as a noble.",
  "s0083": "Emperor Xiaohui year 6, established the office of Grand Commandant, appointed Bo as Grand Commandant.",
  "s0084": "Ten years, Empress Gao passed away.",
  "s0085": "Lu Lu as King of Zhao became Han Supreme General, Lu Chan as King Lu became Han Chancellor, wielded Han power, wished to endanger the Liu clan.",
  "s0086": "Bo as Grand Commandant, could not enter the army gates.",
  "s0087": "Chen Ping as Chancellor, could not manage affairs.",
  "s0088": "Thus Bo and Ping plotted, ultimately executed the various Lu and established Emperor Xiaowen.",
  "s0089": "The conversation is in the Empress Lu and Xiaowen affairs.",
  "s0090": "Emperor Wen having been established, appointed Bo as right chancellor, granted five thousand jin of gold, fief of ten thousand households.",
  "s0091": "After more than a month, someone advised Bo: 'Sir having executed the various Lu and established the King of Dai, your prestige shakes the realm, yet sir receives rich rewards, holds honored position in favor—after a long time calamity will reach your person.'",
  "s0092": "Bo feared, also felt endangered, so apologized and requested to return the chancellor seal.",
  "s0093": "The emperor permitted it.",
  "s0094": "More than a year, Chancellor Ping died, the emperor again appointed Bo as chancellor.",
  "s0095": "More than ten months, the emperor said: 'Previously I commanded the nobles to go to their fiefs, some perhaps could not go, the chancellor I value greatly, let him lead them.'",
  "s0096": "Thus dismissed from chancellor and went to his fief.",
  "s0097": "More than a year, whenever the Hedong governor on circuit inspection reached Jiang, Marquis Jiang Bo fearing execution, always wore armor, ordered his family to hold weapons to see him.",
  "s0098": "Afterwards someone submitted a memorial accusing Bo of intending rebellion, sent to the Chamberlain for Law Enforcement.",
  "s0099": "The Chamberlain for Law Enforcement sent the matter to Chang'an, arrested Bo for investigation.",
  "s0100": "Bo was terrified, did not know how to respond."
}