{
  "s0101": "Now my lord alone extinguished the Zhao lineage, the people of the state pity it, therefore appears in the turtle and milfoil.'",
  "s0102": "Only my lord decide it.'",
  "s0103": "Duke Jing asked: 'Does Zhao still have descendants?'",
  "s0104": "Han Jue fully told him the truth.",
  "s0105": "Duke Jing then conspired with Han Jue to establish the Zhao orphan, summoned and hid him in the palace.",
  "s0106": "The generals entered to inquire about the illness, Duke Jing used Han Jue's forces to threaten the generals and show them the Zhao orphan.",
  "s0107": "The Zhao orphan was named Wu.",
  "s0108": "The generals had no choice but said: 'The former Lower Palace difficulty, Tu An Jia did it, forged the lord's command, and commanded all ministers.'",
  "s0109": "If not so, who would dare create disorder!'",
  "s0110": "Without my lord's illness, the ministers would certainly have requested to establish the Zhao successor.'",
  "s0111": "Now my lord has command, it is the ministers' wish.'",
  "s0112": "Then summoned Zhao Wu and Cheng Ying to bow to all the generals, then turned and with Cheng Ying and Zhao Wu attacked Tu An Jia, exterminated his clan.",
  "s0113": "Restored Zhao Wu's fields and cities as before.",
  "s0114": "When Zhao Wu came of age, became an adult, Cheng Ying then resigned from the ministers, told Zhao Wu: 'In the former Lower Palace difficulty, all could die.'",
  "s0115": "I was not unable to die, I thought of establishing the Zhao successor.'",
  "s0116": "Now Zhao Wu is already established, has become an adult, restored to his former position, I will go below to report to Zhao Xuan Meng and Gong Sun Chu Jiu.'",
  "s0117": "Zhao Wu wept and kowtowed repeatedly begging, saying: 'Wu wishes to exhaust muscles and bones to repay you until death, but how can you bear to leave me and die!'",
  "s0118": "Cheng Ying said: 'Cannot.'",
  "s0119": "They considered me able to accomplish matters, therefore died before me;'",
  "s0120": "now if I do not repay, this makes my matters unaccomplished.'",
  "s0121": "Therefore repay them first, then kill myself.'",
  "s0122": "Reporting favors to Zhao has no precedence or posteriority.'",
  "s0123": "Moreover after I die, Zhao still has foundation.'",
  "s0124": "When Zhao Wu came of age, all the ministers said: 'What benefit do our deaths bring to the Zhao successor?'",
  "s0125": "So all went to secluded places.'",
  "s0126": "Zhao Jian Zi became ill and for five days was unconscious. The ministers all feared and summoned Bian Que.",
  "s0127": "Bian Que entered to examine him, then left. Dong An Yu asked.",
  "s0128": "Bian Que said: 'The blood vessels are in order, why be surprised!'",
  "s0129": "Formerly Duke Mu of Qin was once like this, and awoke after seven days.'",
  "s0130": "On the day he awoke, he told Gong Sun Zhi and Zi Yu: 'I was greatly delighted in the imperial place.'",
  "s0131": "The reason I stayed long was that I was learning something.'",
  "s0132": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0133": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0134": "Gong Sun Zhi wrote and hid it.'",
  "s0135": "The Qin spies then left.'",
  "s0136": "Bian Que said: 'Zhao Jian Zi's illness is the same as Duke Mu of Qin's, he will not exceed two nights.'",
  "s0137": "Indeed after two nights he awoke.",
  "s0138": "Jian Zi said: 'I was greatly delighted in the imperial place, touring with the hundred spirits in the celestial sphere, with vast music of nine movements and ten thousand dances, not like the music of the three dynasties, its sound moved the heart.'",
  "s0139": "A bear came wanting to pull me.'",
  "s0140": "The Emperor commanded me to shoot it, I hit the bear and the bear died.'",
  "s0141": "A brown bear came, I shot it again, hit the brown bear and the brown bear died.'",
  "s0142": "The Emperor was greatly pleased and granted me two baskets, both with assistants.'",
  "s0143": "I saw a boy at the Emperor's side. The Emperor entrusted me with a Di dog, saying: 'When your son grows up, grant it to him.'",
  "s0144": "The Emperor told me: 'The state of Jin will greatly disorder, five generations without peace, afterward it will be hegemonic, die before old age.'",
  "s0145": "The hegemon's son will moreover make your state have no distinction between men and women.'",
  "s0146": "Dong An Yu received the words and wrote to hide them.'",
  "s0147": "Jian Zi left, Dong An Yu told his son Zhuang: 'You know this first.'",
  "s0148": "Zhao Jian Zi dreamed of burying himself and seeing the Emperor, and on the ji si day buried himself.",
  "s0149": "When Zhao Wu Ling Wang was born, he seized from his elder brother Zhang and established himself, this was Zhao Wu Ling Wang.",
  "s0150": "From Zhao Su downward, they did not lose their lineage, down to the Wang clan."
}
