{
  "s0151": "Princess Pingyang sought out more than ten daughters from good families, adorned them, and placed them in her household.",
  "s0152": "Emperor Wu performed the purification ritual at Bashang and returned, passing by Princess Pingyang's residence.",
  "s0153": "The princess presented the beauties in her service.",
  "s0154": "The emperor was not pleased.",
  "s0155": "After drinking, the singers came forward, and the emperor caught sight of them, but was particularly pleased with Wei Zifu alone.",
  "s0156": "That day, Emperor Wu rose to change his clothes, and Zifu attended him in the carriage for court robes, where she received his favor.",
  "s0157": "The emperor returned to his seat, extremely delighted.",
  "s0158": "He granted Princess Pingyang a thousand jin of gold.",
  "s0159": "The princess then memorialized to send Zifu into the palace.",
  "s0160": "When Zifu boarded the carriage, Princess Pingyang patted her back and said: \"Go now, eat well, exert yourself!",
  "s0161": "When you become noble, do not forget me.\"",
  "s0162": "She entered the palace for more than a year, but was never favored again.",
  "s0163": "Emperor Wu selected palace women who were not useful and expelled them to return home.",
  "s0164": "Wei Zifu was able to be seen, wept and requested to leave.",
  "s0165": "The emperor pitied her, favored her again, and she became pregnant, her honored favor increasing daily.",
  "s0166": "He summoned her brother Wei Changjun and younger brother Qing to serve as attendants in the palace.",
  "s0167": "Later Zifu was greatly favored and had honor, altogether bearing three daughters and one son.",
  "s0168": "The son was named Ju.",
  "s0169": "At first, when the emperor was crown prince, he married the eldest princess's daughter as his consort.",
  "s0170": "When he ascended as emperor, the consort was established as empress, surnamed Chen, and had no children.",
  "s0171": "The eldest princess had exerted great effort in the emperor's succession, therefore Empress Chen was arrogant and haughty.",
  "s0172": "When she heard that Wei Zifu was greatly favored, she was furious, nearly dying several times.",
  "s0173": "The emperor became even more angry.",
  "s0174": "Empress Chen practiced women's seductive arts, and the matter became quite apparent, therefore Empress Chen was deposed, and Wei Zifu was established as empress.",
  "s0175": "Empress Chen's mother was the eldest princess, Emperor Jing's sister, who frequently reproached Emperor Wu's sister Princess Pingyang, saying: \"The emperor could not have ascended without me, yet now he abandons and discards my daughter—why is he so displeased and turns against his roots!\"",
  "s0176": "Princess Pingyang said: \"She was deposed because she had no children.\"",
  "s0177": "Empress Chen sought a child, giving doctors altogether ninety million cash, but in the end had no child.",
  "s0178": "After Wei Zifu was established as empress, Wei Changjun had already died, so Wei Qing was made a general, achieved merit attacking the Xiongnu, and was enfeoffed as Marquis of Changping.",
  "s0179": "Qing's three sons, still in swaddling clothes, were all enfeoffed as marquises.",
  "s0180": "As for Empress Wei's so-called sister Wei Shaorer, Shaorer bore a son Huo Qubing, who for military merit was enfeoffed as Marquis of Guanju, and styled General Champion.",
  "s0181": "Qing was styled Grand General.",
  "s0182": "Empress Wei's son Ju was established as crown prince.",
  "s0183": "The Wei clan branches rose through military merit, five people became marquises.",
  "s0184": "When Empress Wei's beauty faded, Lady Wang of Zhao was favored, had a son who became King of Qi.",
  "s0185": "Lady Wang died early.",
  "s0186": "Lady Li of Zhongshan was favored, had one son who became King of Changyi.",
  "s0187": "Lady Li died early, her brother Li Yannian was favored for his music, styled Coordinator of Pitch Pipes.",
  "s0188": "Coordinator of Pitch Pipes was formerly a performer.",
  "s0189": "The brothers were all executed for licentiousness, their clan exterminated.",
  "s0190": "At this time their eldest brother Guangli was General Ershi, attacked Dayuan, did not participate in the execution, returned, and the emperor, having already exterminated the Li clan, later pitied their family and enfeoffed him as Marquis of Haixi.",
  "s0191": "Other consorts' two sons became King of Yan and King of Guangling.",
  "s0192": "Their mothers had no favor and died of sorrow.",
  "s0193": "After Lady Li died, then there were the likes of Lady Yin the Pure Consort who were favored again.",
  "s0194": "However, they all gained favor through performance, not being daughters of kings or marquises with territory, which cannot be matched with the ruler.",
  "s0195": "Master Chu says: When I was a court gentleman, I asked Zhongli Sheng, who was familiar with Han court precedents.",
  "s0196": "He said: Empress Wang, when she was among the common people, bore one daughter, whose father was Jin Wangsun.",
  "s0197": "Wangsun had already died, after Emperor Jing's passing, Emperor Wu had already ascended, Empress Wang was alone.",
  "s0198": "Han Wangsun named Yan had long been favored by Emperor Wu, and taking advantage of a moment, informed him that the empress had a daughter in Changling.",
  "s0199": "Emperor Wu said: \"Why didn't you speak earlier!\"",
  "s0200": "He sent envoys to first inspect her, and she was in their home."
}