{
  "s0130": "The Book says: 'Ministers do not create awe, do not create blessings, there will be no later shame.'",
  "s0131": "Ah, protect the state and cherish the people, can you not be respectful!",
  "s0132": "King, take heed of this.'",
  "s0134": "Above is King of Guangling's charter.",
  "s0135": "The Grand Historian says: Ancient people have said 'Love them wish them rich, be close wish them noble'.",
  "s0136": "Therefore kings pile earth and establish states, enfeoff and establish sons and younger brothers, thus to praise close relatives, order flesh and blood, honor ancestors, value branches and limbs, spread same surname throughout the world.",
  "s0137": "Therefore the situation is strong and the royal house secure.",
  "s0138": "From ancient times to now, what has come from this is long established.",
  "s0139": "No difference, therefore not discussed and recorded.",
  "s0140": "Yan and Qi matters have nothing worth collecting.",
  "s0141": "However establishing the three kings, the Son of Heaven is respectfully modest, ministers uphold righteousness, the literary style is brilliant, very worthy of observation, therefore attached to the hereditary houses.",
  "s0142": "Master Chu says: Subject fortunately became a literary attendant, likes to view and observe the Grand Historian's biographies.",
  "s0143": "The biographies mention the Three Kings hereditary house literary style worthy of observation, sought its hereditary house ultimately could not obtain.",
  "s0144": "Secretly from elders who love precedents took their enfeoffment charter writings, arranged and transmitted their matters, causing later generations to observe the wise ruler's intentions.",
  "s0145": "I have heard that in Xiaowu Emperor's time, on the same day all three sons were appointed as kings: enfeoffed one son in Qi, one son in Guangling, one son in Yan.",
  "s0146": "Each according to the son's talent strength intelligence, and the land's hardness softness, people's lightness heaviness, made charters to earnestly warn them.",
  "s0147": "Telling the kings: 'Generation after generation as Han's border auxiliaries, protect the state govern the people, can you not be respectful!",
  "s0148": "Kings, take heed of this.'",
  "s0149": "What wise rulers make, certainly not what shallow learners can know, not what broad learning strong memory gentlemen cannot thoroughly understand the intent.",
  "s0150": "Even the sequence divisions and breaks, the up and down of writing, the uneven lengths of slips, all have meaning, people cannot know it.",
  "s0151": "Respectfully arranged their true draft edicts, compiled on the left side.",
  "s0152": "Cause viewers to connect their meaning and explain it themselves.",
  "s0153": "Lady Wang was a woman of Zhao, together with Lady Wei both favored by Wudi, and bore son Hong.",
  "s0154": "When Hong was about to be established as king, his mother was ill, Wudi personally visited and asked her.",
  "s0155": "Saying: 'Son should become king, where do you wish to place him?'",
  "s0156": "Lady Wang said: 'Your Majesty is alive, what else can subject wife say.'",
  "s0157": "The emperor said: 'Although this, what is your intention, in what place do you wish to make him king?'",
  "s0158": "Lady Wang said: 'Wish to place him in Luoyang.'",
  "s0159": "Wudi said: 'Luoyang has the armory and Ao granary, world's thoroughfare, Han's great capital.",
  "s0160": "From previous emperors, no son has been made king in Luoyang.",
  "s0161": "Except Luoyang, the rest are all acceptable.'",
  "s0162": "Lady Wang did not respond.",
  "s0163": "Wudi said: 'Among the Guandong states none is greater than Qi.",
  "s0164": "Qi east faces the sea with great city walls, in ancient times Linzi alone had 100,000 households, the world's fertile lands none more prosperous than Qi.'",
  "s0165": "Lady Wang struck her head with her hand, thanked saying: 'Very fortunate.'",
  "s0166": "Lady Wang died and the emperor grieved for her, sent envoys to confer saying: 'The Emperor respectfully sends Grand Palace Attendant Ming to present one jade disk, granting Lady to be Queen Mother of King of Qi.'",
  "s0167": "Son Hong ruled Qi, young, had no sons, established, unfortunately died early, kingdom extinguished, became a commandery.",
  "s0168": "The world says Qi is not suitable for kings.",
  "s0169": "What is called 'receive this earth' means feudal kings first enfeoffed must receive earth at the Son of Heaven's altar, return and establish it as the state altar, sacrifice to it seasonally.",
  "s0170": "Spring and Autumn Grand Tradition says: 'The Son of Heaven's state has the Great Altar.",
  "s0171": "East blue, south red, west white, north black, above yellow.'",
  "s0172": "Therefore those to be enfeoffed in the east take blue earth, enfeoffed in the south take red earth, enfeoffed in the west take white earth, enfeoffed in the north take black earth, enfeoffed above take yellow earth.",
  "s0173": "Each takes their color objects, wrapped in white thatch, enfeoff as altar.",
  "s0174": "This is those first receiving enfeoffment from the Son of Heaven.",
  "s0175": "This is called ruling earth.",
  "s0176": "Ruling earth means establishing altar and honoring it.",
  "s0177": "'I succeed ancestors and fathers', ancestors mean predecessors, fathers mean fathers.",
  "s0178": "'Examining antiquity', examining means measuring, thinking, examining means matching, matching to follow ancient ways.",
  "s0179": "Qi land has much deceit and deception, not accustomed to rites and righteousness, therefore warned saying 'Cherish my edict, the mandate cannot be constant.",
  "s0180": "People who love virtue can clearly shine brightly.",
  "s0181": "Not planning for righteousness causes the worthy to be indolent.",
  "s0182": "Use all your heart, faithfully hold to the center, heaven's favor will long end.",
  "s0183": "If there are faults not good, then disaster to your state, harm to your person.'",
  "s0184": "The King of Qi's rule, left and right maintained with rites and righteousness, unfortunately died young in middle age.",
  "s0185": "However kept body without faults, as the charter intended.",
  "s0186": "The tradition says 'Blue comes from indigo but is bluer than indigo', teaching makes it so.",
  "s0187": "Far indeed the wise ruler, clearly seeing alone: warned King of Qi to be careful within;",
  "s0188": "warned King of Yan not to create resentment, not to cultivate virtue;",
  "s0189": "warned King of Guangling to be careful without, not to create awe and blessings.",
  "s0190": "Now Guangling is in Wu and Yue lands, their people are clever and light, therefore warned saying 'Between the rivers and lakes, their people are light-hearted."
}