{
  "s0061": "Wei general Pang Juan heard it, left Han and returned, Qi army having already passed and went west.",
  "s0062": "Sun Tzu told Tian Ji: 'Those three Jin states' troops originally fierce brave and belittle Qi, Qi called cowardly, good warriors follow their momentum and beneficially guide it.",
  "s0063": "Military methods, those who hasten for profit hundred li stumble chief general, fifty li hasten for profit army half arrives.",
  "s0064": "Make Qi army enter Wei territory make ten myriad stoves, next day five myriad stoves, again next day three myriad stoves.'",
  "s0065": "Pang Juan marched three days, greatly delighted, said: 'I originally knew Qi army cowardly, entered my territory three days, soldiers fled over half.'",
  "s0066": "Thus abandoned his infantry, with his light sharp doubled days parallel marched pursued them.",
  "s0067": "Sun Tzu calculated his march, evening should reach Maling.",
  "s0068": "Maling path narrow, and sides many narrow defiles, can ambush troops, thus chopped big tree white and wrote on it 'Pang Juan dies under this tree.'",
  "s0069": "Thus commanded Qi army good archers ten thousand crossbows, flank road and lie in wait, appointed saying 'Evening see fire raise and all fire.'",
  "s0070": "Pang Juan indeed night arrived chopped tree below, saw white writing, thus drilled fire illuminated it.",
  "s0071": "Read its writing not finished, Qi army ten thousand crossbows all fired, Wei army greatly disordered mutually lost.",
  "s0072": "Pang Juan self knew wisdom exhausted troops defeated, thus self stabbed, said: 'Accomplished boy's name!'",
  "s0073": "Qi thus rode victory completely broke their army, captured Wei crown prince Shen to return.",
  "s0074": "Sun Bin with this name illustrious world, world transmits his military methods.",
  "s0075": "Wu Qi was a Wei man, good at using troops.",
  "s0076": "Once studied under Zeng Zi, served Lu lord.",
  "s0077": "Qi people attacked Lu, Lu wished to make Wu Qi general, Wu Qi took Qi woman as wife, yet Lu doubted him.",
  "s0078": "Wu Qi thus wished to establish reputation, thus killed his wife, to clarify not with Qi.",
  "s0079": "Lu ultimately made him general.",
  "s0080": "As general attacked Qi, greatly broke them.",
  "s0081": "Lu people some hated Wu Qi saying: 'Qi as person, suspicious cruel person.",
  "s0082": "His youth, family accumulated thousand gold, sought office not successful, thus broke his family, village and ward laughed at him, Wu Qi killed those who slandered him over thirty people, and east went out Wei outer gate.",
  "s0083": "With his mother parted, bit arm and swore: 'Qi not become chancellor prime minister, not again enter Wei.'",
  "s0084": "Thus served Zeng Zi.",
  "s0085": "Stayed period, his mother died, Qi ultimately not return.",
  "s0086": "Zeng Zi despised him, and broke with Qi.",
  "s0087": "Qi then went to Lu, studied military methods to serve Lu lord.",
  "s0088": "Lu lord doubted him, Qi killed wife to seek generalship.",
  "s0089": "Now Lu small state, yet has victorious name, then feudal lords plot against Lu.",
  "s0090": "Moreover Lu Wei brother states, yet lord uses Qi, then abandons Wei.'"
}