{
  "s0361": "Said: 'Yes.'",
  "s0362": "Jie Ni said: 'The whole world is flooded, who can change it?",
  "s0363": "Rather than follow those who avoid certain people, better to follow those who avoid the world!'",
  "s0364": "Planted his hoe and would not speak.",
  "s0365": "Zi Lu returned and told Confucius, Confucius sadly said: 'One cannot herd with birds and beasts.",
  "s0366": "If the world has the Way, I will not change it.'",
  "s0368": "Another day, Zi Lu was walking, encountered an old man carrying a hoe, said: 'Have you seen my master?'",
  "s0369": "The old man said: 'Your four limbs are not diligent, five grains not distinguished, who is your master!'",
  "s0370": "Planted his staff and weeded.",
  "s0371": "Zi Lu returned and told Confucius, Confucius said: 'A recluse.'",
  "s0372": "Went back again, but he had left.",
  "s0373": "Confucius stayed in Cai three years, Wu attacked Chen.",
  "s0374": "Chu rescued Chen, camped at Cheng Fu.",
  "s0375": "Heard Confucius was between Chen and Cai, Chu sent someone to invite Confucius.",
  "s0376": "Confucius was about to go and perform the ritual visit, Chen and Cai ministers plotted: 'Confucius is worthy, his criticisms all hit the feudal lords' illnesses.",
  "s0377": "Now he has stayed long between Chen and Cai, all the conduct set by the ministers is not according to Zhong Ni's intent.",
  "s0378": "Now Chu is a great state, comes to invite Confucius.",
  "s0379": "If Confucius is employed in Chu, then Chen and Cai's governing ministers will be in danger.'",
  "s0380": "Thus together raised laborers and surrounded Confucius in the wilds.",
  "s0381": "Could not proceed, cut off provisions.",
  "s0382": "Followers were ill, none could rise.",
  "s0383": "Confucius lectured and recited, played strings and sang without decline.",
  "s0384": "Zi Lu indignantly appeared, said: 'Do gentlemen also have poverty?'",
  "s0385": "Confucius said: 'Gentlemen are indeed poor, petty men when poor then become unruly.'",
  "s0387": "Zi Gong's color changed.",
  "s0388": "Confucius said: 'Ci, do you take me for one who has learned much and knows it?'",
  "s0389": "Said: 'Yes.",
  "s0390": "Is it not so?'",
  "s0391": "Confucius said: 'Not so.",
  "s0392": "I unify it with one.'",
  "s0394": "Confucius knew his disciples had resentful hearts, thus summoned Zi Lu and asked: 'The Poetry says \"Not rhinoceros not tiger, following that wilderness\".",
  "s0395": "Is my Way not right?",
  "s0396": "Why am I here?'",
  "s0397": "Zi Lu said: 'Perhaps we are not yet benevolent?",
  "s0398": "People do not trust me.",
  "s0399": "Perhaps we do not yet know?",
  "s0400": "People do not practice it.'",
  "s0401": "Confucius said: 'There are these words!",
  "s0402": "You, supposing benevolent people must be trusted, how would there be Bo Yi and Shu Qi?",
  "s0403": "Supposing knowledgeable people must be practiced, how would there be Prince Bi Gan?'",
  "s0405": "Zi Lu went out, Zi Gong entered to see.",
  "s0406": "Confucius said: 'Ci, the Poetry says \"Not rhinoceros not tiger, following that wilderness\".",
  "s0407": "Is my Way not right?",
  "s0408": "Why am I here?'",
  "s0409": "Zi Gong said: 'The Master's Way is extremely great, therefore All Under Heaven cannot contain the Master.",
  "s0410": "The Master should perhaps lower himself a bit?'",
  "s0411": "Confucius said: 'Ci, good farmers can plant but cannot harvest, good craftsmen can be skillful but cannot be compliant.",
  "s0412": "Gentlemen can cultivate their Way, outline and record it, unify and govern it, but cannot make accommodation.",
  "s0413": "Now you do not cultivate your Way but seek accommodation.",
  "s0414": "Ci, your ambitions are not far-reaching!'"
}
