{
  "s0051": "Liang then advised Xiang Liang: 'You have already established the Chu successor, but among the Han princes Lord Hengyang Cheng Xian can be established as king, to further build alliances.'",
  "s0052": "Xiang Liang sent Liang to seek Han Cheng, establishing him as King of Han.",
  "s0053": "He appointed Liang as Han envoy, with the King of Han leading over a thousand men raiding Han territory to the west, capturing several cities, but Qin always recaptured them, going back and forth as roaming troops in Yingchuan.",
  "s0054": "When Duke Pei came from Luoyang south out of Xuan Yuan, Liang led troops following Duke Pei, capturing over ten Han cities, defeating Yang Xiong's army.",
  "s0055": "Duke Pei then ordered King Han Cheng to remain guarding Yangdi, and went south with Liang, attacking and capturing Wan, entering Wu Pass to the west.",
  "s0056": "Duke Pei wished to use 20,000 troops to attack the Qin army at Yao Pass, Liang advised: 'Qin troops are still strong, cannot be taken lightly.",
  "s0057": "Your servant has heard their general is a butcher's son, a merchant lackey easily moved by profit.",
  "s0058": "I wish Duke Pei would for now stay encamped, send people ahead to prepare provisions for 50,000 men, moreover place banners and flags on the various mountains as feigned troops, command Li Yiji to hold heavy treasures to bribe the Qin general.'",
  "s0059": "The Qin general indeed defected, wishing to ally and together attack Xianyang to the west, Duke Pei wished to listen to him.",
  "s0060": "Liang said: 'This is only their general wishing to rebel, I fear the soldiers will not follow.",
  "s0061": "If they do not follow it will certainly be dangerous, better to take advantage of their relaxation to attack them.'",
  "s0062": "Duke Pei then led troops to attack the Qin army, greatly defeating them.",
  "s0063": "Pursued north to Lantian, fought again, Qin troops utterly defeated.",
  "s0064": "Thus reached Xianyang, Qin prince Zi Ying surrendered to Duke Pei.",
  "s0065": "Duke Pei entered the Qin palace, palaces and chambers, curtains and canopies, dogs and horses, heavy treasures and women numbered in the thousands, he intended to stay and live there.",
  "s0066": "Fan Kuai remonstrated Duke Pei to leave the palace, Duke Pei would not listen.",
  "s0067": "Liang said: 'Qin was without the Way, therefore Duke Pei was able to reach here.",
  "s0068": "To eliminate cruel tyrants for the realm, one should take plain silk as provision.",
  "s0069": "Now just entering Qin and enjoying its pleasures—this is called 'helping Jie be tyrannical'.",
  "s0070": "Moreover 'loyal words grate on the ear but benefit conduct, bitter medicine hurts the mouth but benefits the illness'—I wish Duke Pei would listen to Fan Kuai's words.'",
  "s0071": "Duke Pei then returned his army to Bashang.",
  "s0072": "Xiang Yu arrived at Hongmen, wishing to attack Duke Pei, Xiang Bo then galloped into Duke Pei's army at night, privately saw Zhang Liang, wishing to leave with him.",
  "s0073": "Liang said: 'Your servant escorted Duke Pei for the King of Han, now affairs are urgent, fleeing would be unrighteous.'",
  "s0074": "He fully told Duke Pei.",
  "s0075": "Duke Pei was greatly alarmed, said: 'What to do about commanding?'",
  "s0076": "Liang said: 'Does Duke Pei truly wish to betray Xiang Yu?'",
  "s0077": "Duke Pei said: 'The petty man taught me to close the passes and not let in the feudal lords, the Qin lands could all be made kingdoms, therefore I listened.'",
  "s0078": "Liang said: 'Duke Pei yourself assess—can you repel Xiang Yu?'",
  "s0079": "Duke Pei was silent for a long time, said: 'Certainly cannot.",
  "s0080": "Now what to do?'",
  "s0081": "Liang then firmly detained Xiang Bo.",
  "s0082": "Xiang Bo saw Duke Pei.",
  "s0083": "Duke Pei drank toasts with him and formed marriage ties.",
  "s0084": "He commanded Xiang Bo to fully explain that Duke Pei dared not betray Xiang Yu, the reason for closing the passes was to guard against other bandits.",
  "s0085": "When he later saw Xiang Yu the misunderstanding was resolved—the account is in Xiang Yu's affairs.",
  "s0086": "Han year 1 first month, Duke Pei became King of Han, ruling Bashu.",
  "s0087": "The King of Han granted Liang 100 yi of gold, two dou of pearls, Liang fully presented them to Xiang Bo.",
  "s0088": "The King of Han also commanded Liang to generously send gifts to Xiang Bo, to request Hanzhong territory.",
  "s0089": "Xiang Wang then permitted it, thus obtained Hanzhong territory.",
  "s0090": "When the King of Han went to his state, Liang escorted him to Baozhong, sent Liang back to Han.",
  "s0091": "Liang then advised the King of Han: 'Why doesn't your majesty burn and destroy the plank roads you pass through, showing the realm you have no intention of returning, to strengthen Xiang Wang's confidence.'",
  "s0092": "He then sent Liang back.",
  "s0093": "On the way, he burned and destroyed the plank roads.",
  "s0094": "Liang arrived in Han, King Han Cheng because Liang had followed the King of Han, Xiang Wang would not send Cheng to his state, had him follow and go east together.",
  "s0095": "Liang advised Xiang Wang: 'The King of Han has burned the plank roads, he has no intention of returning.'",
  "s0096": "He then used the matter of King Qi Tian Rong rebelling to write and inform Xiang Wang.",
  "s0097": "Xiang Wang because of this had no western worries about Han's intentions, and dispatched troops north to attack Qi.",
  "s0098": "Xiang Wang ultimately refused to send the King of Han, made him a marquis instead, then killed him at Pengcheng.",
  "s0099": "Liang fled, secretly traveled back to the King of Han, the King of Han had also returned and pacified the Three Qins.",
  "s0100": "Again appointed Liang as Marquis of Chengxin, following east to attack Chu."
}