{
  "s0201": "And the King of Liang heard that the righteousness came from Yuan Ang and the various ministers, resented, sent men to come kill Yuan Ang.",
  "s0202": "Yuan Ang looked at him saying: 'The one called General Yuan is me, sir has not mistaken?'",
  "s0203": "The assassin said: 'Correct!'",
  "s0204": "Stabbed him, left his sword, the sword stuck in the body.",
  "s0205": "Looked at his sword, newly forged.",
  "s0206": "Asked Chang'an's sword sharpening workers, the worker said: 'A Liang attendant some son came to forge this sword.'",
  "s0207": "With this knew and discovered it, sent envoys to capture and pursue them.",
  "s0208": "Only the King of Liang desired to kill ministers more than ten, the civil officials investigated to the root, rebellion signs much appeared.",
  "s0209": "The empress dowager did not eat, day and night wept without stopping.",
  "s0210": "Emperor Jing greatly worried about it, asked the dukes and ministers, ministers considered sending classic versed officials to handle it, then could resolve.",
  "s0211": "Thus sent Tian Shu, Lu Jizhu to handle it.",
  "s0212": "These two both versed in classics, knew great ritual.",
  "s0213": "Coming back, arrived at Bachang stable, took fire and completely burned Liang's rebellion documents, but came with empty hands to answer Emperor Jing.",
  "s0214": "Emperor Jing said: 'What is it like?'",
  "s0215": "Replied: 'Says the King of Liang did not know.",
  "s0216": "Those who fabricated it were only his favored ministers Yang Sheng, Gongsun Gui and such did it.",
  "s0217": "Respectfully they should be executed by law, the King of Liang is fine.'",
  "s0218": "Emperor Jing pleased and happy, said: 'Quickly go announce to the empress dowager.'",
  "s0219": "The empress dowager heard it, immediately rose and sat drinking, her energy calmed and recovered.",
  "s0220": "Therefore it is said, if not versed in classics and knowing ancient and modern great ritual, cannot serve as three dukes and left and right close ministers.",
  "s0221": "People of little knowledge are like peeking at heaven from a tube."
}