{
  "s0101": "Initially, when Prince Xiao was alive, there was a lei zun vessel, worth a thousand jin.",
  "s0102": "Prince Xiao admonished later generations to carefully preserve the lei zun, not to give it to anyone.",
  "s0103": "Queen Ren heard and desired to obtain the lei zun.",
  "s0104": "King Ping's paternal grandmother Empress Dowager Li said: 'The former king had commands, not to give the lei zun to anyone.",
  "s0105": "Other things though a hundred million, still at your own discretion.'",
  "s0106": "Queen Ren absolutely desired to obtain it.",
  "s0107": "King Ping Xiang directly sent men to open the treasury and take the lei zun, granting it to Queen Ren.",
  "s0108": "Empress Dowager Li greatly angered, Han envoys came, wished to speak herself, King Ping Xiang and Queen Ren blocked and stopped her, closed the gate, Empress Dowager Li contended at the gate, pointed and cursed, thus could not see the Han envoys.",
  "s0109": "Empress Dowager Li also privately had illicit relations with the food official chief and Gentleman-in-Attendance Yin Ba and other scholars, while the king and Queen Ren used this to send people to warn and stop Empress Dowager Li, Empress Dowager Li internally had lewd conduct, and that was all.",
  "s0110": "Later she fell ill and died.",
  "s0111": "When ill, Queen Ren never inquired about the illness;",
  "s0112": "When she died, moreover did not observe mourning.",
  "s0113": "In Yuanshuo period, among Suiyang people there was one Lei Qian who was rebellious, someone had insulted his father, and he went out in the same carriage as the Huaiyang governor's guest.",
  "s0114": "The governor's guest got out and descended from the carriage, Lei Qian stabbed and killed his enemy on the carriage and left.",
  "s0115": "The Huaiyang governor angered, rebuked Liang's two thousand shi officials.",
  "s0116": "The two thousand shi officials and below sought the rebel very urgently, arrested the rebel's relatives.",
  "s0117": "The rebel knew the state's secret matters, thus reported the irregularity, fully informed of the king and paternal grandmother contending over the zun vessel situation.",
  "s0118": "At the time the chancellor and below saw and knew it, wished to harm Liang's senior officials, the memorial reached the Son of Heaven.",
  "s0119": "The Son of Heaven sent officials to investigate and question, it was true.",
  "s0120": "The dukes and ministers requested to depose Xiang as commoner.",
  "s0121": "The Son of Heaven said: 'Empress Dowager Li had lewd conduct, and Liang King Xiang had no good tutors, thus fell into unrighteousness.'",
  "s0122": "Thus he cut away eight Liang cities, beheaded Queen Ren in the market.",
  "s0123": "Liang still had ten cities remaining.",
  "s0124": "Xiang reigned thirty-nine years and died, posthumous title King Ping.",
  "s0125": "His son Wushang succeeded as King of Liang.",
  "s0126": "King Ming of Jichuan was Prince Xiao's son, as Marquis of Huanyi in Xiaojing middle year 6 became King of Jichuan.",
  "s0127": "Seven years, because he shot and killed his commandery lieutenant, Han officials requested execution, the Son of Heaven could not bear to execute, deposed Ming as commoner.",
  "s0128": "Relocated to Fangling, the land entered Han as a commandery.",
  "s0129": "King Pengli of Jidong was Prince Xiao's son, in Xiaojing middle year 6 became King of Jidong.",
  "s0130": "Twenty-nine years, Pengli was arrogant and fierce, without ruler's ritual, at dusk privately went with his slaves and fugitive youths several dozen people to plunder and kill people, taking wealth as pleasure.",
  "s0131": "Those killed and discovered were over a hundred people, the kingdom all knew it, none dared travel at night.",
  "s0132": "The one killed submitted a memorial to report.",
  "s0133": "Han officials requested execution, the emperor could not bear it, deposed as commoner, relocated to Shangyong, land entered Han, became Dahe commandery.",
  "s0134": "King Ai Ding of Shanyang was Prince Xiao's son, in Xiaojing middle year 6 became King of Shanyang.",
  "s0135": "Nine years died, no son, kingdom abolished, land entered Han, became Shanyang commandery.",
  "s0136": "King Ai Bushi of Jiyin was Prince Xiao's son, in Xiaojing middle year 6 became King of Jiyin.",
  "s0137": "One year died, no son, kingdom abolished, land entered Han, became Jiyin commandery.",
  "s0138": "The Grand Historian says: Though Prince Xiao of Liang because of close affection was enfeoffed with fertile lands, yet meeting when the Han house was flourishing, people wealthy, thus could accumulate his wealth, expand palaces, carriages and robes comparable to the Son of Heaven.",
  "s0139": "Yet it was also presumptuous.",
  "s0140": "Master Chu says: When your servant was a gentleman, heard it from old gentleman officials in the palace halls who liked history relating it.",
  "s0141": "I privately consider that causing Prince Xiao of Liang to resent and wish to do evil, the matter arose from within.",
  "s0142": "Now the empress dowager is a female ruler, because she loved the youngest son, wished to make the King of Liang crown prince.",
  "s0143": "Ministers did not timely correctly speak of the impropriety, flattered and handled trifles, privately spoke pleasing words to receive rewards and grants, not loyal ministers.",
  "s0144": "How like Marquis Weiqi Dou Ying's correct speech—what future calamity would there be?",
  "s0145": "Emperor Jing and the king met in banquet, serving the empress dowager drinking, Emperor Jing said: 'After a thousand autumns and ten thousand years I will pass it to the king.'",
  "s0146": "The empress dowager was pleased and happy.",
  "s0147": "Dou Ying was in front, struck the ground and said: 'The Han law's covenant is to pass to son and grandson, now how can the emperor pass to younger brother, arbitrarily disrupt Gaozu's covenant!'",
  "s0148": "Thus Emperor Jing was silent without sound.",
  "s0149": "The empress dowager's intent was displeased.",
  "s0150": "Thus King Cheng stood with his young weak brother under a tree, took one paulownia leaf and gave it to him, saying: 'I will use this to enfeoff you.'"
}