{
  "s0063": "Yet Han Fei knew persuasion's difficulty, his Difficulty of Persuasion book very complete, ultimately died in Qin, could not save himself.",
  "s0064": "Difficulty of Persuasion says:",
  "s0065": "The difficulty of all persuasion is not that my knowledge has difficulty in what to persuade;",
  "s0066": "also not that my eloquence has difficulty in clarifying my intent;",
  "s0067": "also not that my courage has difficulty in thoroughly exhausting it.",
  "s0068": "The difficulty of all persuasion lies in knowing the persuaded one's heart, so my persuasion can match it.",
  "s0069": "The persuaded emerges from seeking high name, yet persuade with thick profit, then seen as lowly conduct encountering humble position, certainly abandoned and distanced.",
  "s0070": "The persuaded emerges from thick profit.",
  "s0071": "Yet persuade with high name, then seen as without heart and far from affairs, certainly not accepted.",
  "s0072": "The persuaded in reality for thick profit yet appears as high name, yet persuade with high name, then superficially accepts his person yet in reality distances him;",
  "s0073": "if persuade with thick profit, then secretly uses his words yet superficially abandons his person.",
  "s0074": "This cannot not be known.",
  "s0075": "Affairs succeed through secrecy, words fail through leakage.",
  "s0076": "Not necessarily his own person leaks it, yet words touch on affairs he conceals, like this the person is in danger.",
  "s0077": "Noble has fault beginnings, yet persuader clearly speaks good plans to push his evils, then person in danger.",
  "s0078": "Favor not yet abundant yet speaks extreme knowledge, persuasion succeeds and has merit then virtue lost, persuasion does not succeed and has defeat then seen as suspicious, like this person in danger.",
  "s0079": "Noble obtains plan and wishes to consider it his own merit, persuader shares knowledge of it, then person in danger.",
  "s0080": "He superficially has emerged affairs, actually considers them his own doing, persuader shares knowledge of it, then person in danger.",
  "s0081": "Force him with what he certainly will not do, stop him with what he cannot help but do, person in danger.",
  "s0082": "Therefore said: Discuss great men with him, then considers you interfering with him;",
  "s0083": "discuss petty men with him, then considers you selling influence.",
  "s0084": "Discuss what he loves, then considers you borrowing capital;",
  "s0085": "discuss what he hates, then considers you testing him.",
  "s0086": "Direct and concise words, then ignorant and bends you;",
  "s0087": "broad and extensive writings, then many and long of them.",
  "s0088": "Compliant with affairs expressing intent, then says cowardly and not thorough;",
  "s0089": "considering affairs broadly unrestrained, then says rustic and insolent.",
  "s0090": "This persuasion difficulty cannot not be known.",
  "s0091": "The essentials of all persuasion lie in knowing to adorn what the persuaded respects, and extinguish what he finds ugly.",
  "s0092": "He himself knows his plans, then do not press him with his losses;"
}