{
  "s0051": "With this he attained it, though becoming king was possible, his hegemony was but small.'",
  "s0052": "Duke Jing was pleased.",
  "s0053": "Confucius was thirty-five when Ji Ping Zi and Hou Zhao Bo offended Duke Zhao of Lu over a cockfight, Duke Zhao led troops to attack Ping Zi, Ping Zi together with the Meng and Shusun families attacked Duke Zhao, Duke Zhao's troops were defeated, he fled to Qi, Qi settled him at Qianhou.",
  "s0054": "After a short while, Lu was in chaos.",
  "s0055": "Confucius went to Qi, became a minister in Gao Zhao Zi's household, wishing to gain access to Duke Jing.",
  "s0056": "He discussed music with the Qi Grand Master, heard the Shao music, studied it, for three months did not know the taste of meat, the Qi people praised him.",
  "s0057": "Duke Jing asked Confucius about governance, Confucius said: 'The lord acts as lord, the minister as minister, the father as father, the son as son.'",
  "s0058": "Duke Jing said: 'Excellent!",
  "s0059": "If indeed the lord is not lord, minister not minister, father not father, son not son, though there is grain, how could I eat it!'",
  "s0060": "Another day he again asked Confucius about governance, Confucius said: 'Governance lies in economizing expenditures.'",
  "s0061": "Duke Jing was pleased, wished to enfeoff Confucius with Nixi fields.",
  "s0062": "Yan Ying advanced saying: 'Scholars are glib and cannot be made into laws;",
  "s0063": "arrogant and self-satisfied, they cannot serve as subordinates;",
  "s0064": "they honor mourning and pursue grief, ruin their families with lavish burials, they cannot serve as customs;",
  "s0065": "wandering about persuading and begging, they cannot serve the state.",
  "s0066": "From the descendants of great sages, the Zhou house has declined, rituals and music have lapsed for a time.",
  "s0067": "Now Confucius abundantly displays his appearance, multiplies the rituals of ascending and descending, makes detailed the steps of advancing and withdrawing, generations cannot exhaust his learning, in a year cannot complete his rituals.",
  "s0068": "Your lordship wishes to employ him to change Qi customs, this is not how to give precedence to the common people.'",
  "s0069": "After this Duke Jing respectfully received Confucius, but did not question him about ritual.",
  "s0070": "Another day, Duke Jing stopped Confucius saying: 'I cannot present you to the Ji family.'",
  "s0071": "He treated him between the Ji and Meng families.",
  "s0072": "Qi ministers wished to harm Confucius, Confucius heard of it.",
  "s0073": "Duke Jing said: 'I am old, cannot employ him.'",
  "s0074": "Confucius thus departed, returned to Lu.",
  "s0075": "Confucius was forty-two, Duke Zhao of Lu died at Qianhou, Duke Ding succeeded.",
  "s0076": "Duke Ding succeeded for five years, summer, Ji Ping Zi died, Huan Zi succeeded.",
  "s0077": "Ji Huan Zi dug a well and obtained an earthen jar, inside resembled a sheep, asked Confucius saying 'got a dog'.",
  "s0078": "Confucius said: 'From what Qiu has heard, a sheep.",
  "s0079": "Qiu has heard that wood and stone monsters are Kui and Wang Liang, water monsters are dragons and Wang Xiang, earth monsters are burial sheep.'",
  "s0081": "Wu attacked Yue, destroyed Kuaiji, obtained bone joints filling a cart.",
  "s0082": "Wu sent an envoy to ask Confucius: 'Which bone is the largest?'",
  "s0083": "Confucius said: 'Yu assembled the gods at Kuaiji Mountain, Fangfeng Shi arrived late, Yu killed and exposed him, his joints fill a cart, this is the largest.'",
  "s0084": "The Wu guest said: 'Who are the gods?'",
  "s0085": "Confucius said: 'Mountain and river gods are sufficient to regulate All Under Heaven, their guardians are gods, altars of soil and grain are dukes and marquises, all belong to the Son of Heaven.'",
  "s0086": "The guest said: 'What does Fangfeng guard?'",
  "s0087": "Confucius said: 'The lord of Wang Mang clan guards Mount Feng and Mount Yu, is of Xi surname.",
  "s0088": "In Yu and Xia and Shang he was Wang Mang, in Zhou he is Chang Di, now called the great man.'",
  "s0089": "The guest said: 'How tall are people?'",
  "s0090": "Confucius said: 'The Jiao Yao clan are three chi, the shortest to the utmost.",
  "s0091": "The tallest do not exceed ten times that, the limit of numbers.'",
  "s0092": "Thus the Wu guest said: 'Excellent, sage!'",
  "s0094": "Huan Zi's favorite minister was Zhong Liang Huai, who was at odds with Yang Hu.",
  "s0095": "Yang Hu wished to expel Huai, Gong Shan Bu Niu stopped him.",
  "s0096": "That autumn, Huai became even more arrogant, Yang Hu seized Huai.",
  "s0097": "Huan Zi was angry, Yang Hu thus imprisoned Huan Zi, made covenant and released him.",
  "s0098": "Yang Hu from this even more disrespected the Ji family.",
  "s0099": "The Ji family also usurped from the ducal house, retainers grasped state power, thus Lu from the great officers down all usurped and departed from the proper way.",
  "s0100": "Therefore Confucius did not serve, retired and studied poetry, documents, rituals, and music, disciples increasingly many, coming from distant places, all received instruction.",
  "s0101": "In Duke Ding's eighth year, Gong Shan Bu Niu was dissatisfied with the Ji family, because of Yang Hu's rebellion, wished to abolish the legitimate heirs of the three Huans, establish Yang Hu's favorites among the concubines, thus seized Ji Huan Zi.",
  "s0102": "Huan Zi deceived him, obtained release."
}
