{
  "s0101": "Empress Wang was from Huaili, and her mother was named Zang Er.",
  "s0102": "Zang Er was the granddaughter of the former King of Yan, Zang Shu.",
  "s0103": "Zang Er married Wang Zhong of Huaili as his wife, bearing a son named Xin, and two daughters.",
  "s0104": "After Zhong died, Zang Er remarried a Tian clansman of Changling, bearing sons Fen and Sheng.",
  "s0105": "Zang Er's eldest daughter married into the Jin family as Jin Wangsun's wife, and already bore a daughter, but Zang Er divined for them and said both daughters would be noble.",
  "s0106": "Therefore, wishing to make her two daughters exceptional, she took the daughter back from the Jin family.",
  "s0107": "The Jin family was angry and refused to give her up, so she brought her into the crown prince's palace.",
  "s0108": "The crown prince favored and loved her, and she bore three daughters and one son.",
  "s0109": "While the son was still in her womb, Lady Wang dreamt that the sun entered her bosom.",
  "s0110": "She told this to the crown prince, who said: \"This is an auspicious sign of nobility.\"",
  "s0111": "Before the child was born, Emperor Xiaowen passed away, Emperor Xiaojing ascended the throne, and Lady Wang bore a son.",
  "s0112": "Previously, Zang Er had also brought in her youngest daughter Er Xu, who bore four sons.",
  "s0113": "When Emperor Jing was crown prince, Empress Bo made a Bo family daughter his consort.",
  "s0114": "When Emperor Jing ascended, he established the consort as Empress Bo.",
  "s0115": "The empress had no children and received no favor.",
  "s0116": "When Empress Bo passed away, Empress Bo was deposed.",
  "s0117": "Emperor Jing's eldest son Rong had as his mother Lady Li.",
  "s0118": "Lady Li was from Qi.",
  "s0119": "Rong was established as crown prince.",
  "s0120": "The eldest princess Piao had a daughter whom she wished to give as consort.",
  "s0121": "Lady Li was jealous, and all of Emperor Jing's beauties were introduced to Emperor Jing through the eldest princess and obtained honored favor, all surpassing Lady Li. Lady Li daily resented and was angry, declining the eldest princess, refusing permission.",
  "s0122": "The eldest princess wished to give her to Lady Wang, and Lady Wang agreed.",
  "s0123": "The eldest princess was angry and daily slandered Lady Li's faults to Emperor Jing, saying: \"Lady Li meets with the various honored ladies and favored consorts, and constantly makes attendants curse and spit on their backs, practicing witchcraft and seductive arts.\"",
  "s0124": "Because of this, Emperor Jing came to despise her.",
  "s0125": "Once when Emperor Jing was physically unwell and unhappy in heart, he entrusted his sons who would become kings to Lady Li, saying: \"After a hundred years, care for them well.\"",
  "s0126": "Lady Li was angry and refused to respond, speaking disrespectfully.",
  "s0127": "Emperor Jing was furious, harbored resentment in his heart but did not yet act on it.",
  "s0128": "The eldest princess daily praised the beauty of Lady Wang's son, and Emperor Jing also considered him worthy, moreover there was the previous dream of the sun as an omen, so his plans were not yet decided.",
  "s0129": "Lady Wang knew the emperor despised Lady Li, and since his anger had not subsided, she secretly sent people to urge the ministers to establish Lady Li as empress.",
  "s0130": "The Chamberlain for Ceremonials, having finished reporting on affairs, said: 'The saying goes \"The son is honored because of the mother, the mother is honored because of the son.\" Now the crown prince's mother has no title, she should be established as empress.'",
  "s0131": "Emperor Jing was angry and said: \"Is this something you should say!\"",
  "s0132": "He immediately investigated and executed the Chamberlain for Ceremonials, and deposed the crown prince to become King of Linjiang.",
  "s0133": "Lady Li became even more resentful and furious, was not allowed to see him, and died of sorrow.",
  "s0134": "Finally Lady Wang was established as empress, her son as crown prince, and the empress's brother Xin was enfeoffed as Marquis of Gai.",
  "s0135": "When Emperor Jing passed away, the crown prince succeeded to the throne as emperor.",
  "s0136": "The Empress Dowager's mother Zang Er was honored as Lord of Pingyuan.",
  "s0137": "Tian Fen was enfeoffed as Marquis of Wu'an, and Sheng as Marquis of Zhouyang.",
  "s0138": "Emperor Jing had thirteen sons: one became emperor, twelve became kings.",
  "s0139": "Er Xu died early, but her four sons all became kings.",
  "s0140": "Empress Wang's eldest daughter was styled Princess Pingyang, the second Princess Nangong, the third Princess Linlü.",
  "s0141": "Marquis Gai Xin was fond of wine.",
  "s0142": "Tian Fen and Sheng were greedy, skillful with written compositions.",
  "s0143": "Wang Zhong died early and was buried in Huaili, posthumously honored as Marquis Gong, with a funerary estate of 200 households established.",
  "s0144": "When Lord Pingyuan passed away, she was buried with the Tian clan in Changling, with an estate comparable to Marquis Gong's estate.",
  "s0145": "Empress Wang passed away sixteen years after Emperor Jing, in the fourth year of Yuanshuo, and was buried alongside him in Yangling tomb.",
  "s0146": "Altogether three people from Empress Wang's family became marquises.",
  "s0147": "Empress Wei, styled Zifu, was born of humble origins.",
  "s0148": "Her family was called the Wei clan, from the domain of Marquis Pingyang.",
  "s0149": "Zifu was a singer for Princess Pingyang.",
  "s0150": "When Emperor Wu first ascended the throne, for several years he had no sons."
}