{
  "s0036": {
    "chinese": "老父已去，高祖適從旁舍來，呂后具言客有過，相我子母皆大貴。",
    "literal": "The old father had already left, the Supreme Ancestor just then came from the side house, Empress Lü fully told him a guest had passed by, read my children and mother's faces all greatly noble.",
    "idiomatic": "The old man had already left. Emperor Gaozu had just come from the side house. Empress Lü told him in full: \"A guest passed by and read the faces of my children and mother - all are greatly noble.\""
  },
  "s0037": {
    "chinese": "高祖問， 曰：「未遠。」",
    "literal": "The Supreme Ancestor asked, said: \"Not far.\"",
    "idiomatic": "Emperor Gaozu asked where he had gone. She said: \"Not far.\""
  },
  "s0038": {
    "chinese": "乃追及，問老父。",
    "literal": "Thereupon he pursued and caught up, asked the old father.",
    "idiomatic": "So he pursued and caught up with him, asking the old man."
  },
  "s0039": {
    "chinese": "老父曰：「鄉者夫人兒子皆以君，君相貴不可言。」",
    "literal": "The old father said: \"Just now Madame and children all take after you, your appearance noble beyond words.\"",
    "idiomatic": "The old man said: \"Just now, Madame and the children all take after you. Your appearance shows nobility beyond words.\""
  },
  "s0040": {
    "chinese": "高祖乃謝曰：「誠如父言，不敢忘德。」",
    "literal": "The Supreme Ancestor then thanked him and said: \"If indeed as father says, I dare not forget the virtue.\"",
    "idiomatic": "Emperor Gaozu then thanked him and said: \"If what you say is true, I won't forget your kindness.\""
  },
  "s0041": {
    "chinese": "及高祖貴，遂不知老父處。",
    "literal": "When the Supreme Ancestor became noble, then did not know the old father's location.",
    "idiomatic": "When Emperor Gaozu rose to power, he could no longer find the old man."
  },
  "s0042": {
    "chinese": "高祖為亭長，乃鲈竹皮為冠，令求盜之薛治，時時冠之，及貴常冠，所謂「劉氏冠」也。",
    "literal": "The Supreme Ancestor was pavilion chief, then used bamboo skin to make a crown, commanded to seek bandits in the Xuezhi, sometimes wore it, and when noble constantly wore it, what is called \"Liu clan crown.\"",
    "idiomatic": "While Emperor Gaozu was the local magistrate, he made a crown from bamboo bark. He was ordered to hunt bandits in Xuezhi and sometimes wore it. Even after rising to power, he wore it constantly. This became known as the \"Liu Family Crown.\""
  },
  "s0043": {
    "chinese": "高祖以亭長為縣送徒驪山，徒多道亡。",
    "literal": "The Supreme Ancestor as pavilion chief for the county escorted convicts to Mount Lishan, the convicts mostly fled along the way.",
    "idiomatic": "As the local magistrate, Emperor Gaozu was assigned by the county to escort convicts to Mount Lishan. Most of the convicts escaped along the way."
  },
  "s0044": {
    "chinese": "自度比至皆亡之，到豐西澤中止飲，釋所送徒。",
    "literal": "He estimated that by the time they arrived all would have fled, arrived at Feng West Marsh and stopped to drink, released the convicts he was escorting.",
    "idiomatic": "He figured that by the time they arrived, all would have fled. When they reached the western marsh of Feng, he stopped for a drink and released the remaining convicts."
  },
  "s0045": {
    "chinese": "徒中識者十餘人隨從。",
    "literal": "Among the convicts those who recognized him were more than ten people who followed him.",
    "idiomatic": "Over ten of the convicts who recognized him decided to follow him instead."
  }
}