{
  "s0102": "King Ding of Changsha, Fa, Fa's mother Consort Tang, formerly Consort Cheng's attendant.",
  "s0103": "Emperor Jing summoned Consort Cheng, Consort Cheng had some taboo, did not wish to advance, and adorned the attendant Tang Er to advance at night.",
  "s0104": "The emperor was drunk and did not know, considered her Consort Cheng and favored her, thus became pregnant.",
  "s0105": "Only then realized she was not Consort Cheng.",
  "s0106": "When the son was born, thus named him Fa.",
  "s0107": "In Emperor Xiaojing's second year before his reign was made King of Changsha as imperial son.",
  "s0108": "Because his mother was lowly, without favor, thus ruled a low, damp, poor kingdom.",
  "s0109": "Reigned 27 years died, his son King Kang Yong succeeded.",
  "s0110": "28 years, died, his son Fu Wei succeeded as King of Changsha.",
  "s0111": "The above one kingdom—the original king was Consort Tang's son.",
  "s0112": "King Hui of Guangchuan, Yue, in Emperor Xiaojing middle year 2 was made King of Guangchuan as imperial son.",
  "s0113": "12 years died, his son Qi succeeded as king.",
  "s0114": "Qi had favored minister Sang Ju.",
  "s0115": "Soon after had crime, wished to execute Ju, Ju fled, the king thus captured his clan.",
  "s0116": "Ju resented the king, thus submitted memorial accusing King Qi of having illicit relations with uterine sister.",
  "s0117": "From this after, King Qi repeatedly submitted memorials accusing Han dukes and ministers and favored ministers like Suo Zhong and others.",
  "s0118": "King Kang of Jiaodong, Ji, in Emperor Xiaojing middle year 2 was made King of Jiaodong as imperial son.",
  "s0119": "28 years died.",
  "s0120": "When King Huainan plotted rebellion, Ji slightly heard of the matter, privately made tower chariots, feathered arrows, battle defense preparations, awaited Huainan's rising.",
  "s0121": "When officials investigated Huainan's matters, the confession revealed it.",
  "s0122": "Ji was closest to the emperor, his intent injured it, fell ill and died, dared not establish heir, thus the emperor heard.",
  "s0123": "Ji had eldest son named Xian, mother without favor;",
  "s0124": "youngest son named Qing, mother loved and favored, Ji often wished to establish him, because improper, moreover had faults, thus spoke no more.",
  "s0125": "The emperor pitied him, thus made Xian King of Jiaodong to continue King Kang's line, and enfeoffed Qing in former Hengshan territory, as King of Liu'an.",
  "s0126": "King Xian of Jiaodong reigned 14 years died, posthumous title King Ai.",
  "s0127": "His son Qing became king.",
  "s0128": "King Qing of Liu'an, in Yuanshu year 2 was made King of Liu'an using King Kang of Jiaodong's son.",
  "s0129": "King Ai of Qinghe, Cheng, in Emperor Xiaojing middle year 3 was made King of Qinghe as imperial son.",
  "s0130": "12 years died, no heirs, kingdom abolished, territory entered Han, became Qinghe commandery.",
  "s0131": "King Xian of Changshan, Shun, in Emperor Xiaojing middle year 5 was made King of Changshan as imperial son.",
  "s0132": "Shun was closest, Emperor Jing's youngest son, arrogant and indolent with much lewdness, repeatedly violated prohibitions, the emperor constantly leniently released him.",
  "s0133": "Reigned 32 years died, Crown Prince Bo succeeded as king.",
  "s0134": "Initially, King Xian Shun had an unfavored consort who bore eldest son Zhuai.",
  "s0135": "Zhuai because his mother had no favor, also did not obtain favor from the king.",
  "s0136": "Queen Xiu bore Crown Prince Bo.",
  "s0137": "The king had many inner consorts, favored consorts bore sons Ping and Shang, Queen rarely obtained favor.",
  "s0138": "When King Xian was gravely ill, various favored consorts constantly attended the illness, thus Queen also because of jealousy did not constantly attend illness, then returned to residence.",
  "s0139": "Physician administered medicine, Crown Prince Bo did not personally taste medicine, moreover did not stay overnight attending illness.",
  "s0140": "When the king died, Queen and Crown Prince then arrived.",
  "s0141": "King Xian naturally did not count eldest son Zhuai as a person, and when died, moreover did not divide and give him wealth.",
  "s0142": "An attendant advised Crown Prince and Queen to have various sons share wealth with eldest son Zhuai, Crown Prince and Queen did not listen.",
  "s0143": "Crown Prince succeeded as king, moreover did not receive and relieve Zhuai.",
  "s0144": "Zhuai resented Queen and Crown Prince.",
  "s0145": "Han envoy inspected King Xian's funeral, Zhuai personally spoke that when King Xian was ill, Queen and Crown Prince did not attend, and when died, six days left residence, Crown Prince Bo privately had illicit relations, drank wine, gambled, struck zhu, with women rode swiftly, circled city passed market, entered prison inspected prisoners.",
  "s0146": "The Son of Heaven sent Grand Messenger Qian to verify Queen and interrogate King Bo, requested to arrest Bo's illicit relations various witnesses and accomplices, the king moreover hid them.",
  "s0147": "Officials urgently sought to capture Bo, sent people to strike, flog, and plunder, arbitrarily released Han's suspected prisoners.",
  "s0148": "Officials requested to execute King Xian's Queen Xiu and King Bo.",
  "s0149": "The emperor considering Xiu originally had no conduct, made Zhuai frame her with crimes, Bo had no good tutors, could not bear to execute.",
  "s0150": "Officials requested to depose Queen Xiu, relocate King Bo with family to Fangling, the emperor permitted it.",
  "s0151": "Bo was king several months, moved to Fangling, kingdom abolished."
}