{
  "s0041": "Heaven's reward and punishment for good people, what is it like?",
  "s0042": "Dao Zhi daily killed the innocent, devoured people's flesh, tyrannical and arrogant, gathered bands of several thousand men rampaging the world, ultimately died of old age.",
  "s0043": "This followed what virtue?",
  "s0044": "This is the especially great, clear, obvious, and evident case.",
  "s0045": "If to the recent age, conduct and behavior not on track, specially violating taboos, yet lifelong leisurely pleasure, wealth and thickness continuing generations without end.",
  "s0046": "Some choose places and tread them, speak only after the time, walk not by crooked paths, not indignant unless just and upright, yet those who encounter calamities cannot be counted.",
  "s0047": "I am greatly confused about this, perhaps what is called heaven's way, is it so or not?",
  "s0048": "The Master said 'Ways different do not plan for each other', each also follows their will.",
  "s0049": "Therefore said 'If wealth and nobility can be sought, though holding the whip as servant, I also will do it.",
  "s0050": "If cannot be sought, follow my likes.'",
  "s0051": "'Year's cold, then know pine and cypress wither late.'",
  "s0052": "The whole world turbid and mixed, clear gentlemen then appear.",
  "s0053": "Is it because their weight is like that, their lightness like this?",
  "s0054": "'Gentlemen hate dying in the world with name not fitting.'",
  "s0055": "Master Jia said: 'Greedy men pursue wealth, ardent knights pursue fame, boasters die for power, the masses rely on life.'",
  "s0056": "'Same brightness mutually illuminate, same kind mutually seek.'",
  "s0057": "Clouds follow dragon, wind follows tiger, sages arise and ten thousand things are seen.'",
  "s0058": "Bo Yi and Shu Qi though worthy, obtained the Master and their name became more illustrious.",
  "s0059": "Yan Yuan though diligently studied, attached to horse's tail and conduct became more prominent.",
  "s0060": "Mountain cave gentlemen, advance and retreat sometimes like this, their kind names buried and extinguished without being called, alas!"
}