{
  "s0051": "The king admitted his crimes, thus committed suicide.",
  "s0052": "Kingdom abolished, territory entered Han, became Guangling commandery.",
  "s0053": "King Yu of Jiaoxi, Duan, after Wu and Chu seven kingdoms rebellion was defeated in Emperor Xiaojing's third year before his reign, Duan was made King of Jiaoxi as imperial son.",
  "s0054": "Duan as a person was treacherous and fierce, moreover had impotence, once approaching a woman, fell ill for several months.",
  "s0055": "And had a favored young man as attendant.",
  "s0056": "The attendant soon after had illicit relations with the rear palace, Duan captured and exterminated him, and killed his mother and child.",
  "s0057": "Frequently violated imperial law, Han dukes and ministers repeatedly requested to execute Duan, the Son of Heaven for brotherhood's sake could not bear it, yet Duan's actions became increasingly severe.",
  "s0058": "Officials repeatedly requested to cut his kingdom, remove more than half.",
  "s0059": "Duan's heart resented, thus made limitless expenditures.",
  "s0060": "The treasury rotted and leaked completely, decayed valuables counted in millions, ultimately could not collect or move them.",
  "s0061": "Ordered officials not to collect taxes and levies.",
  "s0062": "Duan removed all his guards, sealed his palace gates, went out touring from one gate.",
  "s0063": "Frequently changed his name and surname, dressed as commoner, went to other commanderies and kingdoms.",
  "s0064": "Chancellors and two thousand shi who came, following Han law to govern, Duan would seek their crimes and report them, those without crime he falsely poisoned and killed them.",
  "s0065": "His schemes for fraud and thorough changes, strength enough to resist remonstrance, wisdom enough to cover faults.",
  "s0066": "Chancellors and two thousand shi following the king to govern, then Han would bind them with law.",
  "s0067": "Therefore Jiaoxi small kingdom, yet those killed and injured among two thousand shi were very many.",
  "s0068": "Reigned 47 years, died, ultimately no male to succeed, kingdom abolished, territory entered Han, became Jiaoxi commandery.",
  "s0069": "The above three kingdoms—the original kings were all Consort Cheng's sons.",
  "s0070": "King Pengzu of Zhao, in Emperor Xiaojing's second year before his reign was made King of Guangchuan as imperial son.",
  "s0071": "After King Sui of Zhao's rebellion was defeated, Pengzu ruled Guangchuan.",
  "s0072": "In year 4, transferred to be King of Zhao.",
  "s0073": "In year 15, Emperor Xiaojing passed away.",
  "s0074": "Pengzu as a person was crafty, flattering, obsequious, outwardly respectful but inwardly deeply harsh.",
  "s0075": "Loved law, used sophistry to entrap people.",
  "s0076": "Pengzu had many favored consorts and descendants within.",
  "s0077": "Chancellors and two thousand shi wishing to follow Han law to govern, would harm the king's household.",
  "s0078": "Therefore whenever chancellors and two thousand shi arrived, Pengzu wore black cloth clothing, personally went to welcome them, cleared the two thousand shi residences, set up many doubtful matters to provoke and move them, obtained two thousand shi speaking wrongly, touching taboos, then recorded it.",
  "s0079": "When two thousand shi wished to govern, then used this to coerce and threaten them;",
  "s0080": "if not listened to, then submitted memorials to accuse, and defiled them with illicit profit matters.",
  "s0081": "Pengzu reigned over 50 years, chancellors and two thousand shi none could complete two years, then left with crimes, major ones died, minor ones punished, therefore two thousand shi dared not govern.",
  "s0082": "Yet King Zhao monopolized power, sent envoys to counties to act as merchants monopolizing markets, income more than the kingdom's regular taxes.",
  "s0083": "Therefore King Zhao's household had much gold and money, yet what he granted to consorts and various sons also exhausted it.",
  "s0084": "Pengzu took the Nao Ji whom King Jian of Jiangdu stole and had illicit relations with as consort, loved her greatly.",
  "s0085": "Pengzu did not like constructing palaces and seeking auspicious omens, liked handling official matters.",
  "s0086": "Submitted memorial wishing to supervise bandits and thieves in the kingdom.",
  "s0087": "Often at night followed foot soldiers patrolling Handan.",
  "s0088": "Various envoys and passing guests considering Pengzu dangerous and treacherous, none dared stay in Handan.",
  "s0089": "His crown prince Dan had illicit relations with his daughter and uterine sister, had enmity with his guest Jiang Chong.",
  "s0090": "Chong accused Dan, Dan therefore was deposed.",
  "s0091": "Zhao changed and established crown prince.",
  "s0092": "King Jing of Zhongshan, Sheng, in Emperor Xiaojing's third year before his reign was made King of Zhongshan as imperial son.",
  "s0093": "In year 14, Emperor Xiaojing passed away.",
  "s0094": "Sheng as a person loved wine and women, had branch descendants over 120 people.",
  "s0095": "Often disputed with his brother King Zhao, saying: 'Elder brother as king exclusively handles administrative matters.",
  "s0096": "Kings should daily listen to music and enjoy beauty.'",
  "s0097": "King Zhao also disputed him, saying: 'King Zhongshan only daily indulges, does not assist the Son of Heaven in comforting and governing the people, how can he be called a feudal minister!'",
  "s0099": "Reigned 42 years died, his son King Ai Chang succeeded.",
  "s0100": "One year died, his son Kun Chi succeeded as King of Zhongshan.",
  "s0101": "The above two kingdoms—the original kings were all Lady Jia's sons."
}