{
  "s0102": "Tian Zang then ordered the generals Li Gui and others to defend Xingyang city, while he himself led elite troops west to meet the Qin army at Ao Granary.",
  "s0103": "They fought, Tian Zang died, and the army was defeated.",
  "s0104": "Zhang Han advanced and attacked Li Gui and others beneath Xingyang, defeated them, and Li Gui and others died.",
  "s0105": "Deng Shuo from Yangcheng, commanding troops stationed at Tan, was attacked by Zhang Han's lieutenant general, his army scattered and fled to Chen.",
  "s0106": "Wu Xu from Zhi, commanding troops stationed at Xu, was attacked by Zhang Han, his army all scattered and fled to Chen.",
  "s0107": "The Chen king executed Deng Shuo.",
  "s0108": "When the Chen king was first established, Qin Jia from Ling, Dong Shen from Zhi, Zhu Jishi from Fuli, Zheng Bu from Qulu, Ding Ji from Xu and others all rose up independently, leading troops to besiege Donghai governor Qing at Tan.",
  "s0109": "The Chen king heard of this and sent Lord Wuping Pan as general to supervise the army besieging Tan.",
  "s0110": "Qin Jia did not accept the orders, establishing himself as Grand Commander, refusing to subordinate himself to Lord Wuping.",
  "s0111": "He told the army officers: 'Lord Wuping is young and doesn't understand military affairs—don't listen to him!'",
  "s0112": "So he forged the king's orders to kill Lord Wuping Pan.",
  "s0113": "Zhang Han had already defeated Wu Xu and attacked Chen; the Grand Marshal Lord Fang died.",
  "s0114": "Zhang Han again advanced to attack Zhang He's army west of Chen.",
  "s0115": "The Chen king went out to oversee the battle; the army was defeated and Zhang He died.",
  "s0116": "In the twelfth month, the Chen king went to Ruyin, and on his return to Xiachengfu, his charioteer Zhuang Jia killed him and surrendered to Qin.",
  "s0117": "Chen Sheng was buried at Dang with the posthumous title of Hidden King.",
  "s0118": "The Chen king's former attendant general Lü Chen raised an army of slaves, starting from Xinyang, attacked Chen and captured it, killed Zhuang Jia, and restored Chen as Chu.",
  "s0119": "Initially, when the Chen king reached Chen, he ordered Song Liu from Zhi to lead troops to pacify Nanyang and enter Wuguan Pass.",
  "s0120": "Song Liu had already taken Nanyang, but when he heard the Chen king was dead, Nanyang reverted to Qin.",
  "s0121": "Song Liu could not enter Wuguan Pass, so he went east to Xincai, encountered Qin troops, and Song Liu surrendered his army to Qin.",
  "s0122": "Qin transported Song Liu to Xianyang and executed him by tearing apart his chariot as a warning.",
  "s0123": "When Qin Jia and others heard that the Chen king's army was defeated and fleeing, they established Jing Ju as Chu king, led troops to Fangyu, wanting to attack the Qin army at Dingtao.",
  "s0124": "They sent Gongsun Qing as envoy to the Qi king, wanting to combine forces and advance together.",
  "s0125": "The Qi king said: 'I heard the Chen king was defeated, but I don't know if he's dead or alive. How can Chu establish a king without consulting me!'",
  "s0126": "Gongsun Qing said: 'Qi didn't consult Chu when establishing its king, so why should Chu consult Qi when establishing its king!",
  "s0127": "Moreover, Chu started this affair and should command the world.'",
  "s0128": "Tian Dan executed Gongsun Qing.",
  "s0129": "Qin's left and right guard units again attacked Chen and captured it.",
  "s0130": "General Lü fled but gathered troops again.",
  "s0131": "The Poyang bandits and Lord Dangyang Xiang Yu's troops joined together, again attacked Qin's left and right guard units, defeated them at Qingbo, and restored Chen as Chu.",
  "s0132": "Just then, Xiang Liang established King Huai's grandson Xin as Chu king.",
  "s0133": "Chen Sheng reigned as king for six months in total.",
  "s0134": "He had already become king, ruling over Chen.",
  "s0135": "His old friend who had once worked as a hired laborer with him heard this and went to Chen, knocking on the palace gate saying: 'I want to see She.'",
  "s0136": "The palace gate guard wanted to bind him.",
  "s0137": "He explained himself repeatedly, so they let him go but refused to announce him.",
  "s0138": "The Chen king came out and blocked the road calling for She.",
  "s0139": "The Chen king heard this and summoned him for an audience, riding back to the palace together with him.",
  "s0140": "Entering the palace and seeing the hall, curtains, and canopies, the guest said: 'Wow!",
  "s0141": "She has become king in grand style!'",
  "s0142": "Chu people call much 'huo', so the saying spread throughout the world: 'huo She became king', starting from Chen She.",
  "s0143": "The guest came and went more freely, speaking of the Chen king's old feelings.",
  "s0144": "Someone advised the Chen king: 'This guest is foolish and ignorant, monopolizes conversations, and treats your majesty lightly.'",
  "s0145": "The Chen king executed him.",
  "s0146": "All the Chen king's old friends then withdrew of their own accord; from this point on, no one was close to the Chen king.",
  "s0147": "The Chen king made Zhu Fang the Chief Justice and Hu Wu the Supervisor of Officials, to oversee all the ministers.",
  "s0148": "When generals took territory and arrived, if their orders weren't followed, he bound and punished them, considering harsh scrutiny as loyalty.",
  "s0149": "Those he disliked, he didn't hand over to officials but personally handled their punishment.",
  "s0150": "The Chen king trusted them.",
  "s0151": "Because of this, the generals were not close to him—this was why he failed."
}