{
  "s0001": "Sima Rangju was Tian Wan's descendant.",
  "s0002": "In Qi Jing Gong's time, Jin attacked A and Zhen, while Yan invaded the river region, Qi army suffered defeat.",
  "s0003": "Jing Gong worried about it.",
  "s0004": "Yan Ying then recommended Tian Rangju saying: 'Rangju though Tian clan's bastard branch, yet his civil ability attaches the masses, martial ability awes enemies, wish Your Majesty test him.'",
  "s0005": "Jing Gong summoned Rangju, spoke with him about military affairs, greatly pleased, made him general, led troops to defend against Yan and Jin armies.",
  "s0006": "Rangju said: 'Subject originally lowly, Your Majesty raised me from the ranks, placed me above grand officers, soldiers not yet attached, people not yet trusting, person lowly authority light, wish to obtain Your Majesty's favored minister, the state's honored one, to supervise the army, then acceptable.'",
  "s0007": "Thus Jing Gong permitted it, sent Zhuang Jia to go.",
  "s0008": "Rangju having taken leave, made agreement with Zhuang Jia saying: 'Tomorrow noon meet at army gate.'",
  "s0009": "Rangju first galloped to army, erected pole set water clock awaited Jia.",
  "s0010": "Jia originally arrogant noble, considered the general his own army yet himself the supervisor, not very urgent;",
  "s0011": "relatives and attendants sent him, stayed drinking.",
  "s0012": "At noon Jia not arrived.",
  "s0013": "Rangju then overturned pole broke water clock, entered, conducted army restrained troops, explained regulations.",
  "s0014": "Regulations established, evening time, Zhuang Jia then arrived.",
  "s0015": "Rangju said: 'Why late?'",
  "s0016": "Jia apologized saying: 'Unworthy grand officer's relatives sent me, thus stayed.'",
  "s0017": "Rangju said: 'General receiving command day then forgets his home, facing army regulations then forgets his relatives, grasping drumsticks' urgency then forgets his body.",
  "s0018": "Now enemy states deeply invade, state within disturbed, soldiers exposed on border, lord sleeps not at ease on mat, eats not sweet flavor, people's lives all hang on lord, what called sending off!'",
  "s0019": "Summoned army officer asked saying: 'Military law arriving after appointed time what?'",
  "s0020": "Answered: 'Should behead.'"
}