{
  "s0202": "Do not fear Lü Chan's slander.'",
  "s0204": "Empress Lü established various Lü as kings, Chen Ping pretended to approve.",
  "s0205": "When Empress Lü collapsed, Ping and Grand Commandant Bo together plotted, ultimately executed various Lü, established Emperor Xiaowen, Chen Ping was the original plotter.",
  "s0206": "Shen Yiji was dismissed from chancellor.",
  "s0207": "Emperor Xiaowen established, considered that Grand Commandant Bo personally with troops executed the Lü clan, merits many;",
  "s0208": "Chen Ping wished to yield the honored position to Bo, so pleaded illness.",
  "s0209": "Emperor Xiaowen newly established, was surprised Ping was ill, asked him.",
  "s0210": "Ping said: 'In Gaozu's time, Bo's merits were not equal to your servant Ping.",
  "s0211": "When executing various Lü, your servant's merits also not equal to Bo.",
  "s0212": "Wish to yield the right chancellorship to Bo.'",
  "s0213": "Thus Emperor Xiaowen made Marquis Jiang Bo right chancellor, position first;",
  "s0214": "Ping transferred to left chancellor, position second.",
  "s0215": "Granted Ping a thousand jin of gold, increased enfeoffment by three thousand households.",
  "s0216": "After a short time, Emperor Xiaowen having increasingly become familiar with state affairs, in court asked right chancellor Bo: 'Throughout the realm, how many cases are decided in a year?'",
  "s0217": "Bo apologized saying: 'Do not know.'",
  "s0218": "Asked: 'Throughout the realm, how much money and grain enter and exit in a year?'",
  "s0219": "Bo again apologized did not know, sweat soaked his back, ashamed could not answer.",
  "s0220": "Thus the emperor also asked left chancellor Ping.",
  "s0221": "Ping said: 'There are those who are responsible.'",
  "s0222": "The emperor said: 'Those responsible mean who?'",
  "s0223": "Ping said: 'Your majesty if asks about deciding cases, blame the Chamberlain for Law Enforcement;",
  "s0224": "asks about money and grain, blame the Chamberlain for the Granaries.'",
  "s0225": "The emperor said: 'If each has those responsible, then what affairs does sir oversee?'",
  "s0226": "Ping apologized saying: 'Oversee your servant!",
  "s0227": "Your majesty does not know my incompetence, makes me await punishment as chancellor.",
  "s0228": "The chancellor above assists the Son of Heaven to order yin and yang, follow the four seasons, below nurtures what is suitable for the ten thousand things, externally soothes and controls the four barbarians and feudal lords, internally draws close and attaches the people, makes the ministers and grandees each able to carry out their duties.'",
  "s0229": "Emperor Xiaowen then praised it as good.",
  "s0230": "The right chancellor greatly ashamed, went out and reproached Chen Ping saying: 'Sir alone did not usually teach me to answer!'",
  "s0231": "Chen Ping laughed saying: 'Sir occupies that position, does not know its responsibilities?'",
  "s0232": "Moreover if the emperor asks the number of bandits and thieves in Chang'an, does sir wish to forcibly answer?'",
  "s0233": "Thus Marquis Jiang himself knew his ability was far inferior to Ping's.",
  "s0234": "After a short time, Marquis Jiang pleaded illness and requested to resign chancellor, Chen Ping alone became chancellor.",
  "s0235": "Emperor Xiaowen year 2, Chancellor Chen Ping died, posthumous title Marquis Xian.",
  "s0236": "Son Marquis Gong Mai succeeded to the marquisate.",
  "s0237": "Two years died, son Marquis Jian Hui succeeded to the marquisate.",
  "s0238": "Twenty-three years died, son He succeeded to the marquisate.",
  "s0239": "Twenty-three years, He because of abducting someone's wife, executed in market, state abolished.",
  "s0240": "Originally Chen Ping said: 'I have many secret plots, this is what the Daoists prohibit.",
  "s0241": "My descendants will be abolished, that is all, ultimately cannot rise again, because I have many secret misfortunes.'",
  "s0242": "Yet afterwards his great-grandson Chen Zhang because of Wei clan close relatives being noble relatives, wished to continue enfeoffing the Chen clan, yet ultimately could not.",
  "s0243": "The Grand Historian says: Chancellor Chen Ping in youth, originally liked the arts of the Yellow Emperor and Laozi.",
  "s0244": "When he was dividing meat on the chopping block, his intentions were already far-reaching.",
  "s0245": "Careering and struggling between Chu and Wei, ultimately returned to Gaozu.",
  "s0246": "Constantly put forth extraordinary strategies, rescued difficulties of entanglements, relieved the state's calamities.",
  "s0247": "When Empress Lü's time, affairs were greatly troubled, yet Ping ultimately freed himself, stabilized the ancestral temple, ended with honored name, called wise chancellor—how good a beginning and good ending!",
  "s0248": "If not knowledgeable strategy, who could match this?"
}
