{
  "s0031": "Wu king said: 'General rest return to quarters, I do not wish to descend observe.'",
  "s0032": "Sun Tzu said: 'King merely likes its words, cannot use its reality.'",
  "s0033": "Thus Helu knew Sun Tzu could use troops, ultimately made him general.",
  "s0034": "West broke strong Chu, entered Ying, north awed Qi Jin, displayed name among feudal lords, Sun Tzu had strength therein.",
  "s0035": "Sun Wu having died, after over hundred years had Sun Bin.",
  "s0036": "Bin born between A and Juan, Bin also Sun Wu's later generation descendants.",
  "s0037": "Sun Bin once together with Pang Juan studied military methods.",
  "s0038": "Pang Juan having served Wei, obtained as Hui Wang general, yet considered his ability not equal to Sun Bin, thus secretly sent to summon Sun Bin.",
  "s0039": "Bin arrived, Pang Juan feared his worthiness exceeded himself, resented him, then with legal punishment severed his two feet and tattooed him, wished to hide not see.",
  "s0040": "Qi envoy to Liang, Sun Bin as punished prisoner secretly saw, persuaded Qi envoy.",
  "s0041": "Qi envoy considered it wondrous, secretly carried with him to Qi.",
  "s0042": "Qi general Tian Ji favored and guest treated him.",
  "s0043": "Ji often with Qi various princes raced chased heavy bets.",
  "s0044": "Sun Tzu saw their horse feet not very far apart, horses had upper, middle, lower grades.",
  "s0045": "Thus Sun Tzu told Tian Ji: 'Lord gambles heavily, subject can make lord win.'",
  "s0046": "Tian Ji believed it so, with king and various princes gambled thousand gold.",
  "s0047": "When reaching the bet, Sun Tzu said: 'Now use lord's lower team against their upper team, take lord's upper team against their middle team, take lord's middle team against their lower team.'",
  "s0048": "Having raced three grades finished, Tian Ji one not win two wins, ultimately obtained king thousand gold.",
  "s0049": "Thus Ji advanced Sun Bin to Wei Wang.",
  "s0050": "Wei Wang asked military methods, thus took him as teacher.",
  "s0051": "Afterwards Wei attacked Zhao, Zhao urgent, requested aid from Qi.",
  "s0052": "Qi Wei Wang wished to make Sun Bin general, Bin declined apologized: 'Punished remnant person unacceptable.'",
  "s0053": "Thus made Tian Ji general, Sun Tzu as teacher, resided in baggage cart, sat making plans.",
  "s0054": "Tian Ji wished to lead troops to Zhao, Sun Tzu said: 'Those who resolve tangled disorder disputes do not grasp cudgel, those who save fighters do not strike fists, strike the solid attack the empty, form blocks momentum restrains, then self resolves.",
  "s0055": "Now Liang Zhao attack each other, light troops sharp soldiers must exhaust externally, old weak tired internally.",
  "s0056": "Lord not as good as lead troops hasten to Daliang, occupy its thoroughfares, attack its just empty, they must release Zhao and self rescue.",
  "s0057": "This is our one action resolves Zhao's siege and gains crippled from Wei.'",
  "s0058": "Tian Ji followed it, Wei indeed left Handan, fought Qi at Guiling, greatly broke Liang army.",
  "s0059": "Thirteen years later, Wei with Zhao attacked Han, Han urgently informed Qi.",
  "s0060": "Qi sent Tian Ji as general to go, directly hasten to Daliang."
}