{
  "s0051": "Emperor Jing sent envoys holding the tally with imperial chariot and four horses, to welcome the King of Liang at the pass.",
  "s0052": "Having attended court, he submitted a memorial requesting to remain, because of the empress dowager's close relation.",
  "s0053": "When the king entered he served Emperor Jing in the same chariot, when going out they rode in the same carriage hunting, shooting birds and beasts in Shanglin Park.",
  "s0054": "Liang's attendants-in-ordinary, gentlemen, and ushers were registered and led in and out of the Son of Heaven's palace gates, no different from Han eunuchs.",
  "s0055": "In the eleventh month, the emperor deposed Crown Prince Li, Empress Dowager Dou's heart wished to make Prince Xiao the successor.",
  "s0056": "Ministers and Yuan Ang and others had discussions with Emperor Jing, Empress Dowager Dou's sense of righteousness blocked it, and thus no longer spoke of making the King of Liang successor—from this point.",
  "s0057": "Because the matter was secret, the world did not know.",
  "s0058": "Thus he took leave and returned to his fief.",
  "s0059": "That summer, fourth month, the emperor established the King of Jiaodong as crown prince.",
  "s0060": "The King of Liang resented Yuan Ang and the discussing ministers, so secretly sent men with Yang Sheng, Gongsun Gui and others to assassinate Yuan Ang and more than ten other discussing ministers.",
  "s0061": "They pursued the assassins, did not catch them.",
  "s0062": "Thus the Son of Heaven suspected the King of Liang, pursuing the assassins—indeed it was Liang who sent them.",
  "s0063": "Thus he sent envoys with coronets and canopies meeting each other on the road, to investigate Liang, arresting Gongsun Gui and Yang Sheng.",
  "s0064": "Gongsun Gui and Yang Sheng hid in the king's rear palace.",
  "s0065": "The envoys pressed the two thousand shi officials urgently, Liang chancellor Xuanqiu Bao and Chamberlain Han Anguo advanced to remonstrate with the king, the king then ordered Sheng and Gui both to commit suicide, and handed them out.",
  "s0066": "The emperor from this resented and distrusted the King of Liang.",
  "s0067": "The King of Liang feared, so sent Han Anguo through the eldest princess to apologize to the empress dowager, then was released.",
  "s0068": "The emperor's anger slightly eased, thus he submitted a memorial requesting to attend court.",
  "s0069": "Having reached the pass, Mao Lan advised the king to ride a cloth carriage, enter following two riders, hide in the eldest princess's garden.",
  "s0070": "Han sent envoys to welcome the king, the king had already entered the pass, chariots and cavalry all stayed outside, did not know the king's location.",
  "s0071": "The empress dowager wept saying: 'The emperor has killed my son!'",
  "s0072": "Emperor Jing was worried and fearful.",
  "s0073": "Thus the King of Liang prostrated himself with axe and block at the palace gate, apologized for his crimes, then the empress dowager and Emperor Jing greatly rejoiced, wept together, restored as before.",
  "s0074": "All summoned the king's following officials into the pass.",
  "s0075": "Yet Emperor Jing increasingly distanced the king, no longer rode in the same chariot.",
  "s0076": "In year thirty-five, winter, he attended court again.",
  "s0077": "He submitted a memorial desiring to remain, the emperor did not permit.",
  "s0078": "Returned to his fief, his thoughts were melancholy and unhappy.",
  "s0079": "He hunted north at Liangshan, someone presented a cow whose feet came out its back, Prince Xiao considered it ominous.",
  "s0080": "In the sixth month, he fell ill with fever, died after six days, posthumous title Prince Xiao.",
  "s0081": "Prince Xiao was filial and kind, whenever he heard the empress dowager was ill, could not eat, lived and slept restlessly, constantly wished to remain in Chang'an serving the empress dowager.",
  "s0082": "The empress dowager also loved him.",
  "s0083": "When she heard the King of Liang had died, Empress Dowager Dou cried extremely mournfully, did not eat, said: 'The emperor indeed killed my son!'",
  "s0084": "Emperor Jing was sorrowful and fearful, did not know what to do.",
  "s0085": "Consulted with the eldest princess, then divided Liang into five kingdoms, all enfeoffing Prince Xiao's five sons as kings, five daughters all received bath and grooming fiefs.",
  "s0086": "Thus memorialized to the empress dowager, the empress dowager then was pleased, added one extra drink for the emperor.",
  "s0087": "Prince Xiao's eldest son Mai became King of Liang, this was King Gong;",
  "s0088": "son Ming became King of Jichuan;",
  "s0089": "son Pengli became King of Jidong;",
  "s0090": "son Ding became King of Shanyang;",
  "s0091": "son Bushi became King of Jiyin.",
  "s0092": "Before Prince Xiao died, his wealth was counted in millions, beyond numbering.",
  "s0093": "When he died, the treasury still had over 400,000 jin of yellow gold remaining, other valuables matched this.",
  "s0094": "In Liang King Gong's third year, Emperor Jing passed away.",
  "s0095": "King Gong reigned seven years and died, his son Xiang succeeded him, becoming King Ping.",
  "s0096": "Liang King Ping Xiang's fourteenth year, his mother was called Empress Dowager Chen.",
  "s0097": "King Gong's mother was called Empress Dowager Li.",
  "s0098": "Empress Dowager Li was King Ping's paternal grandmother.",
  "s0099": "And King Ping's queen was surnamed Ren, called Queen Ren.",
  "s0100": "Queen Ren was greatly favored by King Ping Xiang."
}