{
  "s0819": "Then sent him away.",
  "s0820": "Walled Han Gao.",
  "s0821": "Third year, Pang Juan led, attacked Yan, captured their general Ju Xin.",
  "s0822": "Fourth year, Pang Juan led Zhao, Chu, Wei, Yan's elite troops, attacked Qin Zhui, did not capture it;",
  "s0823": "shifted to attack Qi, took Rao An.",
  "s0824": "Fifth year, Fu Di led, resided at Ping Yi;",
  "s0825": "Qing She led Dongyang Hedong troops, guarded He Liang.",
  "s0826": "Sixth year, enfeoffed Chang'an Jun with Rao.",
  "s0827": "Wei gave Ye to Zhao.",
  "s0828": "Ninth year, Zhao attacked Yan, took Li and Yang Cheng.",
  "s0829": "Troops not yet withdrawn, Qin attacked Ye, captured it.",
  "s0830": "Dao Xiang Wang died, son You Mu Wang Qian ascended.",
  "s0831": "You Mu Wang Qian first year, walled Bo Ren.",
  "s0832": "Second year, Qin attacked Wu Cheng, Hu Zhe led troops to rescue it, army defeated, died there.",
  "s0833": "Third year, Qin attacked Chi Li and Yi An, Li Mu led troops and fought them at Fei, repelled them.",
  "s0834": "Enfeoffed Mu as Wu An Jun.",
  "s0835": "Fourth year, Qin attacked Fan Wu, Li Mu fought them, repelled them.",
  "s0836": "Fifth year, Dai territory greatly shook, from Le Xu westward, north to Ping Yin, towers houses walls mostly destroyed, ground cracked east-west 130 paces.",
  "s0837": "Sixth year, great famine, people falsely said: 'Zhao will wail, Qin will laugh.",
  "s0838": "If you do not believe, look at the ground growing hair.'",
  "s0840": "Seventh year, Qin attacked Zhao, Zhao great general Li Mu, general Sima Shang led, struck them.",
  "s0841": "Li Mu executed, Sima Shang dismissed, Zhao Cong and Qi general Yan Ju replaced them.",
  "s0842": "Zhao Cong's army broken, Yan Ju fled away.",
  "s0843": "King Qian surrendered.",
  "s0844": "Eighth year tenth month, Handan became Qin.",
  "s0845": "The Grand Historian says.",
  "s0846": "I heard Feng Wang Sun say: 'Zhao king Qian, his mother was a singing girl, favored by Dao Xiang Wang.",
  "s0847": "Dao Xiang Wang deposed rightful son Jia and established Qian.",
  "s0848": "Qian originally had no conduct, believed slander, therefore executed his good general Li Mu, used Guo Kai.'",
  "s0849": "Was this not absurd!",
  "s0850": "Qin having captured Qian, Zhao's fugitive officials together established Jia as king, reigned in Dai for six years, Qin advanced troops broke Jia, then extinguished Zhao to make it a commandery."
}
