{
  "s0001": "Marquis Pingyang Cao Can was a native of Pei.",
  "s0002": "During Qin times he served as assistant jailer in Pei, while Xiao He was the chief clerk—they were both outstanding officials in the county.",
  "s0003": "When Gaozu rose as Duke of Pei, Cao Can followed as an attendant.",
  "s0004": "He led attacks on Huling and Fangyu, assaulting the Qin Inspector's army and greatly defeating it.",
  "s0005": "He advanced east to Xue, attacking the garrison of the Si River warden west of Xue's outer walls.",
  "s0006": "He attacked Huling again and captured it.",
  "s0007": "He was transferred to defend Fangyu.",
  "s0008": "Fangyu defected to Wei, so he attacked it.",
  "s0009": "Feng defected to Wei, so he attacked it.",
  "s0010": "He was granted the rank of Seventh Rank Noble.",
  "s0011": "He attacked the Qin Marshal Yi's army east of Dang, defeated it, and captured Dang, Hufu, and Qishanzhi.",
  "s0012": "He further attacked west from Xiayi to Yu, attacking Zhang Han's chariots and cavalry.",
  "s0013": "He attacked Yuanqi and Kangfu, being first to scale the walls.",
  "s0014": "He was promoted to Fifth Rank Noble.",
  "s0015": "He went north to rescue E, attacked Zhang Han's army, broke through their formations, and pursued to Puyang.",
  "s0016": "He attacked Dingtao and captured Linji.",
  "s0017": "He went south to rescue Yongqiu.",
  "s0018": "He attacked Li You's army, defeated it, killed Li You, and captured one Qin noble.",
  "s0019": "When Qin general Zhang Han defeated and killed Xiang Liang, the Duke of Pei and Xiang Yu led their armies east.",
  "s0020": "King Huai of Chu appointed the Duke of Pei as governor of Dang commandery to lead Dang commandery troops.",
  "s0021": "Thus he enfeoffed Cao Can as Holder of Silk, with the title Lord Jiancheng.",
  "s0022": "He was promoted to Duke of Qi, belonging to Dang commandery.",
  "s0023": "Afterwards he followed in attacking the Dongjun warden's army, defeating it south of Chengwu.",
  "s0024": "He attacked Wang Li's army south of Chengyang, then attacked it again at Gangli, greatly defeating it.",
  "s0025": "He pursued north, west to Kaifeng, attacked Zhao Ben's army, defeated it, and besieged Zhao Ben in Kaifeng city.",
  "s0026": "He attacked General Yang Xiong's army at Quyü to the west, defeated it, and captured one Qin marshal and one imperial secretary each.",
  "s0027": "He was promoted to Holder of Jade.",
  "s0028": "He followed in attacking Yangwu, captured Xuanyuan and Goushi, cut off the river crossings, returned to attack Zhao Ben's army north of Shi, and defeated it.",
  "s0029": "He followed south attacking Yan, fought with the Nanyang warden Yi east of Yangcheng's outer walls, broke through formations, captured Wan, captured Yi, and completely pacified Nanyang commandery.",
  "s0030": "He followed west attacking Wuguan and Yaoguan, capturing them.",
  "s0031": "He advanced attacking the Qin army south of Lantian, then at night attacked its north, the Qin army was greatly defeated, thus reaching Xianyang and destroying Qin.",
  "s0032": "When Xiang Yu arrived, he made the Duke of Pei King of Han.",
  "s0033": "The King of Han enfeoffed Cao Can as Marquis of Jiancheng.",
  "s0034": "He followed to Hanzhong, promoted to general.",
  "s0035": "He followed returning to pacify the Three Qins, initially attacking and capturing Bian, Gudao, Yong, and Lai.",
  "s0036": "He attacked Zhang Ping's army south of Haozhi, defeated it, besieged Haozhi, and captured Rangxiang.",
  "s0037": "He attacked the Three Qins army east of Rang and at Gaoque, defeating it.",
  "s0038": "He besieged Zhang Ping again, Zhang Ping fled from Haozhi.",
  "s0039": "He then attacked Zhao Ben and Grand Administrator Bao's army, defeating it.",
  "s0040": "He captured Xianyang to the east, renaming it New City.",
  "s0041": "Cao Can led troops guarding Jingling for twenty days, the Three Qins sent Zhang Ping and others to attack Cao Can, Cao Can sallied to attack, greatly defeating them.",
  "s0042": "He was granted fief income in Ningqin.",
  "s0043": "Cao Can as general led troops besieging Zhang Han at Fei Qiu.",
  "s0044": "As Commandant he followed the King of Han out of Linjin Pass.",
  "s0045": "Arriving in Hebei, he captured Xiuwu, crossed at Wei Jin, attacked Long Ju and Xiang Ta at Dingtao to the east, defeating them.",
  "s0046": "He captured Dang, Xiao, and Pengcheng to the east.",
  "s0047": "He attacked Xiang Yu's army, the Han army suffered great defeat and fled.",
  "s0048": "Cao Can as Commandant besieged and captured Yongqiu.",
  "s0049": "Wang Wu rebelled at Waihuang, Cheng Chu rebelled at Yan, he went to attack them, completely defeating both.",
  "s0050": "Marquis Zhutian rebelled at Yanshi, he advanced and defeated and captured Yanshi."
}