{
  "s0153": "Twelfth month, the duke besieged Cheng but could not conquer it.",
  "s0154": "Duke Ding's fourteenth year, Confucius was fifty-six, from Grand Minister of Justice acted as prime minister, showing happy expression.",
  "s0155": "Disciples said: 'We have heard that gentlemen do not fear when disaster comes, do not rejoice when fortune arrives.'",
  "s0156": "Confucius said: 'There are these words.",
  "s0157": "Does it not say \"delight in using nobility to humble oneself\"?'",
  "s0158": "Thus he executed Lu minister who disturbed the government, Shao Zheng Mao.",
  "s0159": "Participated in national affairs three months, those selling lambs and pigs did not inflate prices;",
  "s0160": "men and women walking kept to separate paths;",
  "s0161": "nothing was picked up and kept from the roads;",
  "s0162": "travelers from the four directions arriving at towns did not seek officials, all given what they needed to return home.",
  "s0163": "Qi people heard and feared, said: 'If Confucius governs he will certainly become hegemon, if hegemon then our territory is close, we will be the first annexed.",
  "s0164": "Why not offer territory?'",
  "s0165": "Li Chu said: 'Please first try to obstruct him;",
  "s0166": "if obstructing him proves impossible then offer territory, how late would that be!'",
  "s0167": "Thus selected eighty beautiful women from Qi, all clothed in embroidered garments dancing Kang Le, thirty teams of fine horses, sent to Lu lord.",
  "s0168": "Displayed female musicians and fine horses outside Lu city's south high gate, Ji Huan Zi in plain clothes went to view several times, about to accept, then told Lu lord to travel Zhou roads, went to view all day, neglected government affairs.",
  "s0169": "Zi Lu said: 'Master can leave.'",
  "s0170": "Confucius said: 'Lu now will perform the suburban sacrifice, if they offer the sacrificial meat to ministers, then I can still remain.'",
  "s0171": "Huan Zi finally accepted Qi's female musicians, three days did not attend to government;",
  "s0172": "at the suburban sacrifice, also did not offer sacrificial meats to ministers.",
  "s0173": "Confucius thus left, lodged at Tun.",
  "s0174": "Shi Yi sent him off, said: 'Master is not at fault.'",
  "s0175": "Confucius said: 'May I sing?'",
  "s0176": "Sang: 'That woman's mouth can make one flee;",
  "s0177": "that woman's flattery can lead to death and defeat.",
  "s0178": "Alas, wandering wandering, just to end the year!'",
  "s0179": "Shi Yi returned, Huan Zi said: 'What did Confucius say?'",
  "s0180": "Shi Yi truthfully told him.",
  "s0181": "Huan Zi sighed deeply: 'Master blames me because of the female slaves!'",
  "s0183": "Confucius thus went to Wei, stayed at Zi Lu's wife's brother Yan Zhu Zou's home.",
  "s0184": "Wei Ling Gong asked Confucius: 'When living in Lu, how much salary did you receive?'",
  "s0185": "Replied: 'Six hundred thousand bushels of grain.'",
  "s0186": "Wei people also gave six hundred thousand bushels.",
  "s0187": "After staying a while, someone slandered Confucius to Wei Ling Gong.",
  "s0188": "Ling Gong made Gong Sun Yu monitor his comings and goings.",
  "s0189": "Confucius feared being convicted, after ten months, left Wei.",
  "s0190": "About to go to Chen, passed through Kuang, Yan Ke as servant, pointed with his whip saying: 'Formerly I entered here, through that gap.'",
  "s0191": "Kuang people heard it, thought he was Lu's Yang Hu.",
  "s0192": "Yang Hu had once oppressed Kuang people, Kuang people thus stopped Confucius.",
  "s0193": "Confucius's appearance resembled Yang Hu, imprisoned five days, Yan Yuan arrived later, Confucius said: 'I thought you had died.'",
  "s0194": "Yan Yuan said: 'Master is here, how dare I die!'",
  "s0195": "Kuang people imprisoned Confucius even more urgently, disciples feared.",
  "s0196": "Confucius said: 'Since King Wen has passed, is culture not here?",
  "s0197": "If Heaven will lose this culture, later deaths cannot participate in this culture.",
  "s0198": "If Heaven has not lost this culture, what can Kuang people do to me!'",
  "s0199": "Confucius made followers serve as Ning Wu Zi's ministers in Wei, then was able to leave.",
  "s0200": "Left and passed through Pu.",
  "s0201": "Over a month, returned to Wei, stayed at Qu Bo Yu's home.",
  "s0202": "Wei Ling Gong's wife was named Nan Zi, she sent someone to tell Confucius: 'Gentlemen from the four directions who do not consider it humiliating to become brothers with my lord must see my little lord.",
  "s0203": "My little lord wishes to see.'"
}
