{
  "s0001": "Zhang Yi was a native of Wei.",
  "s0002": "In his youth, he studied alongside Su Qin under Master Guigu, learning the arts of persuasion. Su Qin always considered himself inferior to Zhang Yi.",
  "s0003": "Once Zhang Yi had mastered diplomatic persuasion, he traveled among the feudal lords.",
  "s0004": "He once drank with the Prime Minister of Chu. Later, the prime minister discovered his precious jade disc was missing. His attendants suspected Zhang Yi, saying, 'Zhang Yi is poor and of questionable character—he must have stolen the prime minister's jade disc.'",
  "s0005": "They seized Zhang Yi and beat him several hundred lashes. He refused to confess, so they branded him.",
  "s0006": "His wife said, 'Alas!",
  "s0007": "If you hadn't studied and traveled as a persuader, how would you have come to this humiliation?'",
  "s0008": "Zhang Yi asked his wife, 'Is my tongue still there?'",
  "s0009": "His wife laughed and said, 'It's still there.'",
  "s0010": "Zhang Yi replied, 'That's enough.'",
  "s0012": "After Su Qin had persuaded the King of Zhao and secured alliances with neighboring states, he worried that Qin might attack the other lords and break the alliances. Thinking of who might be useful in Qin, he secretly sent someone to tempt Zhang Yi: 'You were once close to Su Qin. Now Qin holds power—why not go there to seek your fortune?'",
  "s0013": "Zhang Yi then went to Zhao and requested an audience with Su Qin.",
  "s0014": "Su Qin ordered his attendants not to let him in, and kept him waiting for several days.",
  "s0015": "Finally, when he received him, he seated Zhang Yi in the main hall below the platform and served him the food given to servants and concubines.",
  "s0016": "Then he repeatedly rebuked him: 'With your talents and abilities, you've brought yourself to this state of destitution and humiliation.",
  "s0017": "I could speak on your behalf and make you wealthy and honored, but you're not worth saving.'",
  "s0018": "He dismissed him.",
  "s0019": "Zhang Yi had come expecting to be treated as an old friend and receive assistance. Instead he was humiliated. Angry, he realized no other lord would take him in—only Qin could challenge Zhao. So he went to Qin.",
  "s0020": "Later, Su Qin told his attendants: 'Zhang Yi is the most talented man in the world. I am no match for him.",
  "s0021": "Fortunately, I was employed first. The only one who can wield Qin's power is Zhang Yi.",
  "s0022": "But he is poor and has no way to advance.",
  "s0023": "I fear he might be content with small gains and not achieve great things, so I summoned and humiliated him to stir his ambition.",
  "s0024": "Secretly support him for me.'",
  "s0025": "He spoke to the King of Zhao, who provided gold, coins, chariots, and horses. Su Qin sent people to secretly follow Zhang Yi, share his lodging, gradually get close to him, and provide him with chariots, horses, gold, and money—whatever he needed, without telling him who was behind it.",
  "s0026": "Thus Zhang Yi was able to meet King Hui of Qin.",
  "s0027": "King Hui appointed him as a guest minister and consulted with him on attacking the feudal lords.",
  "s0028": "Su Qin's attendants then took their leave.",
  "s0029": "Zhang Yi said, 'Thanks to you I have become prominent. I was just about to repay your kindness—why are you leaving?'",
  "s0030": "The attendant said, 'I don't know you— I know Su Qin.",
  "s0031": "Su Qin worried that Qin would attack Zhao and break the alliances. He believed no one but you could control Qin's power, so he provoked you with anger and had me secretly support and provide for you, carrying out all of Su Qin's plans.",
  "s0032": "Now that you are employed, let me return and report.'",
  "s0033": "Zhang Yi said, 'Alas, this was within my calculations but I didn't realize it. I am not as perceptive as Su Qin!",
  "s0034": "I have just been appointed—how can I plot against Zhao?",
  "s0035": "Please apologize to Su Qin for me. While Su Qin lives, how dare I speak of such things.",
  "s0036": "As long as Su Qin lives, how could I possibly rival him!'",
  "s0037": "Once Zhang Yi became prime minister of Qin, he sent a formal declaration to the prime minister of Chu: 'When I drank with you, I didn't steal your jade disc, yet you had me beaten.",
  "s0038": "If you guard your state well, I might just steal your cities instead!'",
  "s0040": "The rulers of Shu and Ba attacked each other and both appealed urgently to Qin for help.",
  "s0041": "King Hui of Qin wanted to send troops to attack Shu, but the road was dangerous and narrow, making it hard to reach. Meanwhile, Han was invading Qin. King Hui wanted to attack Han first, then Shu, but feared it would be disadvantageous. He wanted to attack Shu first, but worried Han would attack Qin while it was weakened.",
  "s0042": "He hesitated and couldn't decide.",
  "s0043": "Sima Cuo and Zhang Yi debated before King Hui. Sima Cuo wanted to attack Shu; Zhang Yi said, 'Better to attack Han.'",
  "s0044": "The king said, 'Let me hear your reasoning.'",
  "s0046": "Zhang Yi said: 'Ally with Wei and befriend Chu. Send troops down to Sanchuan, block the Shigu pass, occupy the Tunliu road. Cut off Nanyang from Wei, have Chu threaten Nandun. Qin attacks Xincheng and Yiyang to approach the suburbs of the two Zhous. Punish the Zhou king's crimes, invade Chu and Wei territory.",
  "s0047": "Zhou will know it cannot save itself and will certainly surrender the Nine Tripods and precious vessels.",
  "s0048": "Seize the Nine Tripods, control the maps and registers, hold the Son of Heaven hostage to command the world—none would dare disobey. This is the work of a true king.'",
  "s0049": "'Now Shu is a remote western land inhabited by barbarians. Wasting troops and exhausting the people there would not bring fame; gaining its territory would bring no benefit.'",
  "s0050": "'I have heard that those who compete for fame do so at court; those who compete for profit do so in the marketplace.'",
  "s0051": "'Now Sanchuan and Zhou are the court and marketplace of the world. Yet Your Majesty does not compete there, instead competing with barbarians—that is far from true kingship.'",
  "s0053": "Sima Cuo said: 'Not so.",
  "s0054": "I have heard that those who wish to enrich their state must expand its territory; those who wish to strengthen their armies must enrich their people; those who wish to become kings must broaden their virtue. When these three are prepared, kingship will follow.'",
  "s0099": "'Now the allies unite the world, swearing brotherhood, slaughtering white horses to make covenants on the Mian River to strengthen their bonds.'",
  "s0055": "'Your Majesty's territory is small and the people poor, so I wish to start with what is easy.'",
  "s0056": "'Shu is a remote western land, the chief of the barbarians, plagued by chaos like Jie and Zhou.'",
  "s0057": "'For Qin to attack it would be like sending wolves to hunt sheep.'",
  "s0058": "'Gaining its territory would expand our state; seizing its wealth would enrich our people and repair our armies. We wouldn't exhaust our troops, yet they would submit.'",
  "s0059": "'Conquering one state without the world calling it violent; benefiting from the western seas without being called greedy—this single action would bring both fame and profit, plus the reputation of suppressing violence and ending chaos.'",
  "s0060": "'Attacking Han would mean coercing the Son of Heaven—that brings evil fame and uncertain profit, plus the reputation of injustice. Attacking what the world opposes is dangerous.'",
  "s0061": "'Let me explain the reasons: Zhou is the ancestral temple of the world;'",
  "s0062": "'Qi is Han's ally.'",
  "s0063": "'Zhou knows it will lose the Nine Tripods; Han knows it will lose Sanchuan. The two states will combine forces to seek relief through Qi and Zhao, giving the tripods to Chu and land to Wei. Your Majesty cannot stop this.'",
  "s0064": "'This is what I call danger.'",
  "s0065": "'Better to attack Shu and complete the task.'",
  "s0067": "King Hui said, 'Excellent. I will follow your advice.'",
  "s0068": "He finally raised troops to attack Shu. In ten months they took it, pacified Shu, demoted the king of Shu to a marquis, and appointed Chen Zhuang as prime minister of Shu.",
  "s0069": "With Shu now belonging to Qin, Qin grew even stronger and wealthier, looking down on the other feudal lords.",
  "s0070": "In the tenth year of King Hui's reign, he sent Prince Hua and Zhang Yi to besiege Puyang, which surrendered.",
  "s0071": "Zhang Yi then proposed that Qin reconcile with Wei and send Prince You as hostage to Wei.",
  "s0072": "Zhang Yi then persuaded the King of Wei: 'The King of Qin treats Wei very generously. Wei cannot be discourteous.'",
  "s0073": "Wei therefore ceded Shangdun and Shaoliang to thank King Hui of Qin.",
  "s0074": "King Hui then appointed Zhang Yi as prime minister and renamed Shaoliang to Xiayang.",
  "s0075": "Zhang Yi served as Qin prime minister four years, established King Hui as king.",
  "s0076": "After one year, he served as Qin's general and took Xie.",
  "s0077": "He built fortifications at Shangdun.",
  "s0078": "Two years later, he met with the prime ministers of Qi and Chu at Yaosang.",
  "s0079": "On his return east, he was dismissed as prime minister. He became prime minister of Wei to serve Qin, hoping Wei would submit to Qin first so other lords would follow.",
  "s0080": "The King of Wei refused to listen to Zhang Yi.",
  "s0081": "The King of Qin was angry and attacked Wei's Quwo and Pingzhou. He secretly increased his support for Zhang Yi even more.",
  "s0082": "Zhang Yi was ashamed and had nothing to show for his efforts.",
  "s0083": "He remained in Wei four years until King Xiang of Wei died and King Ai ascended.",
  "s0084": "Zhang Yi again persuaded King Ai, but he wouldn't listen.",
  "s0085": "Zhang Yi secretly ordered Qin to attack Wei.",
  "s0086": "Wei fought Qin and was defeated.",
  "s0087": "The next year, Qi again defeated Wei at Guanjin.",
  "s0088": "Qin wanted to attack Wei again. First they defeated Han's Shen Chai army, beheading eighty thousand. The feudal lords were terrified.",
  "s0089": "Zhang Yi again persuaded the King of Wei: 'Wei's territory is not even a thousand li square, with troops not exceeding three hundred thousand.'",
  "s0090": "'The land is flat all around, with roads from the feudal lords converging like spokes to a hub, without famous mountains or great rivers as barriers.'",
  "s0091": "'From Zheng to Liang is only two hundred li—chariots race and men run, arriving without effort.'",
  "s0092": "'Liang borders Chu to the south, Han to the west, Zhao to the north, Qi to the east. Garrisons man the borders in all directions, with no fewer than ten thousand troops guarding the watchtowers and barriers.'",
  "s0093": "'Given Liang's geographical position, it is naturally a battlefield.'",
  "s0094": "'If Liang allies with Chu but not Qi, Qi will attack from the east;'",
  "s0095": "'If allied with Qi but not Zhao, Zhao will attack from the north;'",
  "s0096": "'If not united with Han, Han will attack from the west;'",
  "s0097": "'If not close to Chu, Chu will attack from the south. This is what is called the path to being divided into four pieces.'",
  "s0098": "'Moreover, when the feudal lords form alliances, it is to secure their altars of soil and grain, honor their rulers, strengthen their armies, and make their names illustrious.'",
  "s0100": "'Yet even true brothers from the same parents still fight over money and property. To rely on deception and betrayal, reviving the failed schemes of Su Qin—the impossibility of success is clear.'",
  "s0101": "'If Your Majesty does not serve Qin, Qin will send troops to attack beyond the Yellow River, occupy Juan, Yan, and Suzao, coerce Wei and take Yangjin. Then Zhao won't go south, and if Zhao doesn't go south, Wei won't go north. If Wei doesn't go north, the alliance routes will be cut. With the alliance routes cut, it will be impossible for Your Majesty's state to avoid danger.'",
  "s0102": "'Qin will defeat Han and attack Wei. Han fears Qin, so Qin and Han become one—Wei's destruction can be expected immediately.'",
  "s0103": "'This is what I fear for Your Majesty.'",
  "s0104": "'For Your Majesty's sake, nothing is better than serving Qin.'",
  "s0105": "'Serving Qin means Chu and Han will certainly not dare move;'",
  "s0111": "'Cede land from Chu to benefit Wei, harm Chu to help Qin, transfer disaster to secure the state—this is the way to serve well.'",
  "s0112": "'If Your Majesty does not listen to me, Qin will send armored troops east to attack. Even if you then wish to serve Qin, it will be impossible.'",
  "s0113": "'Moreover, alliance advocates use bold words but deliver little trust. Persuading one feudal lord brings a marquis's fief—so wandering persuaders all day and night clench their fists and glare, grinding their teeth to speak of alliance benefits, persuading rulers.'",
  "s0114": "'Rulers admire their eloquence and are drawn by their words—how can they not be dazzled?'",
  "s0115": "'I have heard that accumulated feathers sink boats, gathered light breaks axles, many mouths melt metal, accumulated slander destroys bone. So I wish Your Majesty to carefully determine your plans, and grant me leave to retire from Wei.'",
  "s0117": "King Ai then abandoned the alliance and through Zhang Yi sought peace with Qin.",
  "s0118": "Zhang Yi returned and again became prime minister of Qin.",
  "s0119": "Three years later, Wei again abandoned Qin for alliances.",
  "s0120": "Qin attacked Wei and took Quwo.",
  "s0121": "The next year, Wei again served Qin.",
  "s0122": "Qin wanted to attack Qi. Qi and Chu were allied, so Zhang Yi went to become prime minister of Chu.",
  "s0123": "King Huai of Chu heard Zhang Yi was coming and prepared the finest guest quarters to house him personally.",
  "s0124": "He said, 'This is a remote and backward country—what teachings do you bring?'",
  "s0125": "Zhang Yi persuaded the King of Chu: 'If Your Majesty truly listens to me, close your borders and break relations with Qi. I will present the land of Shangyu, six hundred li square, so Qin women may become Your Majesty's broom-wielding concubines. Qin and Chu will exchange brides, becoming brother states forever.'",
  "s0126": "'This weakens Qi to the north while benefiting Qin to the west—no plan could be better.'",
  "s0127": "The King of Chu was greatly pleased and agreed.",
  "s0128": "All the ministers congratulated him, but Chen Zhen alone mourned.",
  "s0129": "The King of Chu was angry: 'I obtained six hundred li of land without raising troops or sending armies. All ministers congratulate me, yet you alone mourn—why?'",
  "s0130": "Chen Zhen replied: 'Not so. In my view, the land of Shangyu cannot be obtained, yet Qi and Qin will unite—disaster will certainly come.'",
  "s0131": "The King of Chu said, 'Do you have an explanation?'",
  "s0132": "Chen Zhen replied: 'Qin's reason for valuing Chu is because Chu has Qi as an ally.'",
  "s0133": "'Now closing borders and breaking with Qi leaves Chu isolated.'",
  "s0134": "'Why would Qin covet an isolated state and give it six hundred li of Shangyu land?'",
  "s0135": "'Zhang Yi will return to Qin and certainly betray Your Majesty—this cuts off Qi relations to the north and creates trouble with Qin to the west. The troops of both countries will certainly attack together.'",
  "s0136": "'A good plan for Your Majesty would be to secretly unite while openly breaking with Qi, sending someone to follow Zhang Yi.'",
  "s0137": "'If they give us the land, breaking with Qi is not too late;'",
  "s0138": "'If they don't give us the land, we maintain the secret alliance.'",
  "s0139": "The King of Chu said, 'I wish you would shut your mouth and stop speaking, waiting for me to get the land.'",
  "s0140": "He gave the prime minister's seal to Zhang Yi and richly bribed him.",
  "s0141": "Chu then closed its borders and broke relations with Qi, sending one general to follow Zhang Yi.",
  "s0142": "Zhang Yi returned to Qin, pretending to lose his reins and fall from his chariot, not appearing at court for three months.",
  "s0143": "The King of Chu heard this and said, 'Is Zhang Yi thinking my break with Qi is not complete enough?'",
  "s0144": "He sent brave warriors to Song, borrowing Song's credentials, to go north and curse the King of Qi.",
  "s0145": "The King of Qi was furious and humbled himself to submit to Qin.",
  "s0146": "With Qin and Qi allied, Zhang Yi appeared at court and told the Chu envoy: 'I have a fief of six li— I wish to present it to Your Majesty's attendants.'",
  "s0147": "The Chu envoy said, 'I received orders from the king for six hundred li of Shangyu land, not six li.'",
  "s0148": "He returned and reported to the King of Chu, who was furious and sent troops to attack Qin.",
  "s0149": "Chen Zhen said, 'May I now speak?'",
  "s0150": "'Attacking is not as good as ceding land to bribe Qin, uniting troops to attack Qi—this gives land to Qin but takes compensation from Qi. Your Majesty's kingdom can still survive.'",
  "s0151": "The King of Chu wouldn't listen and sent troops with General Qu Gai to attack Qin.",
  "s0152": "Qin and Qi together attacked Chu, beheading eighty thousand, killing Qu Gai, and taking Danyang and Hanzhong.",
  "s0153": "Chu again raised more troops to attack Qin, reaching Lantian. In a great battle, Chu was badly defeated. Chu then ceded two cities to make peace with Qin.",
  "s0154": "Qin pressed Chu for Qianzhong land, offering to exchange Wuguan.",
  "s0155": "The King of Chu said, 'I don't want to exchange land—I want Zhang Yi and will cede Qianzhong.'",
  "s0156": "The King of Qin wanted to send him but couldn't bear to say it.",
  "s0157": "Zhang Yi volunteered to go.",
  "s0158": "King Hui said, 'The King of Chu is angry at your betrayal over Shangyu land—he will surely vent his anger on you.'",
  "s0159": "Zhang Yi said, 'Qin is strong and Chu weak. I am close to Jin Shang, who serves Lady Zheng Xiu. Whatever she says is followed.'",
  "s0160": "'Moreover, I carry Your Majesty's credentials to Chu—how dare Chu execute me.'",
  "s0161": "'Even if they execute me and Qin gets Qianzhong, that would fulfill my greatest wish.'",
  "s0162": "He went to Chu.",
  "s0163": "The King of Chu imprisoned Zhang Yi and prepared to kill him.",
  "s0164": "Jin Shang said to Zheng Xiu: 'Do you know how lowly you are to the king?'",
  "s0165": "Zheng Xiu said, 'Why?'",
  "s0166": "Jin Shang said: 'The King of Qin loves Zhang Yi greatly and doesn't want to send him. Now he offers six counties of Shangyong land to bribe Chu, and sends beautiful women as brides, with palace singers as attendants.'",
  "s0167": "'The King of Chu values the land and respects Qin—Qin women will certainly be honored while you, madam, will be cast aside.'",
  "s0168": "'Better to speak on his behalf to save him.'",
  "s0169": "Zheng Xiu then day and night spoke to King Huai: 'Ministers each serve their own lord.'",
  "s0170": "'Now the land has not yet gone to Qin, yet Qin sends Zhang Yi, showing great respect for the king.'",
  "s0171": "'The king has shown no courtesy but wants to kill Zhang Yi—Qin will certainly be furious and attack Chu.'",
  "s0172": "'I beg you and my son to move to south of the Yangtze, lest we become Qin's fish and meat.'",
  "s0173": "King Huai regretted it, pardoned Zhang Yi, and treated him with the same generous hospitality.",
  "s0174": "Zhang Yi had not yet left when he heard Su Qin had died. He then persuaded the King of Chu: 'Qin controls half the world, with troops rivaling four states, protected by dangerous terrain and the Yellow River, secured by four natural barriers.'",
  "s0175": "'With fierce warriors over a million, a thousand chariots, ten thousand cavalry, grain piled like mountains.'",
  "s0176": "'Laws are clear, soldiers face hardship and death with joy. The ruler is enlightened and strict, generals intelligent and brave. Even without mobilizing troops, Qin can roll up the dangers of Mount Chang and break the world's backbone. Those who submit late will perish first.'",
  "s0177": "'Moreover, forming alliances is no different from driving a flock of sheep to attack a fierce tiger—the tiger and sheep cannot fight, that's clear.'",
  "s0178": "'Now Your Majesty does not ally with the fierce tiger but with the flock of sheep—I secretly think Your Majesty's plan is wrong.'",
  "s0179": "'Throughout the world, the strong states are either Qin or Chu—there are no others. Qin and Chu contend, their power cannot allow both to stand.'",
  "s0180": "'If Your Majesty does not ally with Qin, Qin will send troops to occupy Yiyang—Han's upper lands will be cut off.'",
  "s0181": "'Then cross Hedong, take Chenggao—Han will certainly submit as vassals. Wei will follow like the wind.'",
  "s0182": "'Qin attacks Chu's west, Han and Wei attack its north—how can the altars of soil and grain avoid danger?'",
  "s0183": "'Moreover, forming alliances means gathering weak states to attack the strongest, not assessing the enemy but fighting lightly, exhausting poor states with frequent wars—this is the way to danger and destruction.'",
  "s0184": "'I have heard: do not challenge those with superior troops, do not engage in prolonged war with those who have more grain.'",
  "s0185": "'Alliance advocates decorate their words with empty rhetoric, raising the ruler's resolve, speaking of benefits but not harms. In the end, Qin's disaster comes too late to prevent.'",
  "s0186": "'So I wish Your Majesty to carefully consider this.'",
  "s0187": "'Qin has Bashu to the west, with large boats carrying grain, starting from Mount Wen, floating down the Yangtze to Chu—over three thousand li.'",
  "s0188": "'Warships carry soldiers—one ship holds fifty men with three months' food. Going downstream, one day covers three hundred li. Though the distance is great, it doesn't exhaust oxen or horses. In less than ten days they reach the Wu Pass.'",
  "s0189": "'Once the Wu Pass is alarmed, all cities east of the border will be fortified. Qianzhong and Wujun will no longer belong to the king.'",
  "s0190": "'Qin mobilizes troops from Wuguan, facing south to attack—then the northern lands are cut off.'",
  "s0191": "'When Qin attacks Chu, the crisis comes within three months. Chu waiting for feudal lord rescue takes over six months—their situations cannot match.'",
  "s0192": "'Relying on weak states for rescue while forgetting strong Qin's disaster—this is what I fear for Your Majesty.'",
  "s0193": "'Your Majesty once fought Wu, winning three of five battles—your frontline troops were all lost;'",
  "s0194": "'Guarding Xincheng on the flank, the surviving people suffered bitterly.'",
  "s0195": "'I have heard that great merit brings easy danger, exhausted people resent their rulers.'",
  "s0196": "'Guarding precarious merit while opposing strong Qin's intentions—I secretly fear this for Your Majesty.'",
  "s0197": "'Moreover, Qin has not sent troops from Hangu Pass for fifteen years to attack Qi and Zhao because they secretly plan to unite the world.'",
  "s0198": "'Chu once fought Qin at Hanzhong—Chu did not win, seventy nobles holding jade tablets died, losing Hanzhong.'",
  "s0199": "'The King of Chu was furious, raised troops to attack Qin, fighting at Lantian.'",
  "s0200": "'This is what is called two tigers fighting each other.'",
  "s0201": "'While Qin and Chu exhaust each other, Han and Wei take the opportunity to control them from behind—no plan is more dangerous than this.'",
  "s0202": "'I wish Your Majesty to carefully consider.'",
  "s0203": "'Qin mobilizes troops to attack Wei's Yangjin, certainly blocking the world's throat.'",
  "s0204": "'If Your Majesty raises all troops to attack Song, in less than a few months Song can be taken. Taking Song and pointing east, then the twelve lords along the Si River will all belong to the king.'",
  "s0205": "'Throughout the world, Su Qin was the one who used trustworthy alliances to unite states as brothers.'",
  "s0206": "'He was enfeoffed as Lord Wu'an, became prime minister of Yan, then secretly plotted with the King of Yan to attack and destroy Qi, dividing its land.'",
  "s0207": "'He pretended to have committed a crime and fled to Qi. The King of Qi accepted and appointed him prime minister.'",
  "s0208": "'After two years they discovered the truth. The King of Qi was furious and had Su Qin torn apart by chariots in the marketplace.'",
  "s0209": "'Using one deceitful Su Qin to try to manage the world and unite the feudal lords—the impossibility of success is clear.'",
  "s0210": "'If Your Majesty truly listens to me, I will have the Qin crown prince become hostage in Chu, the Chu crown prince become hostage in Qin. I will make Qin women become Your Majesty's broom-wielding concubines, present a city of ten thousand households as a bathing town. Let us be brother states forever, never attacking each other.'",
  "s0211": "'I consider no plan more advantageous than this.'",
  "s0212": "'I consider no plan more advantageous than this.'",
  "s0246": "'Alliance advocates persuading Your Majesty will certainly say: \"Qi has strong Zhao to the west, Han and Wei to the south.\"'",
  "s0247": "'\"Qi is a maritime state with broad territory, numerous people, strong troops, and brave soldiers. Even with a hundred Qins, what could they do to Qi?\"'",
  "s0250": "'I have heard that Qi fought Lu three times and Lu won three times, yet the state faced danger and extinction afterward. Though having the name of victory, it had the reality of a perished state.'",
  "s0251": "'Why?'",
  "s0252": "'Qi is large and Lu is small.'",
  "s0253": "'Now Qin compared to Qi is like Qi compared to Lu.'",
  "s0254": "'Qin and Zhao fought at the He and Zhang rivers—two battles and Zhao won Qin twice;'",
  "s0255": "'fought at Fanwu below—two battles and again won Qin.'",
  "s0256": "'After four battles, Zhao's perished troops numbered several hundred thousand. Handan barely survived. Though having victory's name, the state was already broken.'",
  "s0257": "'Why?'",
  "s0258": "'Qin is strong and Zhao is weak.'",
  "s0259": "'Now Qin and Chu exchange women as brides, becoming brother states.'",
  "s0260": "'Han offers Yiyang;'",
  "s0261": "'Wei presents Hedong;'",
  "s0262": "'Zhao enters court at Mianchi, cedes Hejian to serve Qin.'",
  "s0263": "'If Your Majesty does not serve Qin, Qin will drive Han and Wei to attack Qi's southern lands, send all Zhao troops to cross Qing River, point to Bo Pass—Linzi and Jimou will not belong to the king.'",
  "s0264": "'The state attacked for one day, even wishing to serve Qin later will be impossible.'",
  "s0265": "'Therefore I wish Your Majesty to carefully consider.'",
  "s0267": "The King of Qi said: 'Qi is remote and backward, hidden by the eastern sea. I have never heard of the long-term benefit of the altars of soil and grain.'",
  "s0268": "He agreed to Zhang Yi.",
  "s0269": "Zhang Yi left, going west to persuade the King of Zhao: 'My humble state's King of Qin sent me to present foolish plans to Your Majesty.'",
  "s0270": "'Your Majesty gathering the world to make Qin submit—Qin troops dared not emerge from Hangu Pass for fifteen years.'",
  "s0271": "'Your Majesty's might spread through Shandong. My humble state feared and trembled, repaired armor, sharpened weapons, prepared chariots and cavalry, practiced riding and shooting, worked fields and stored grain, guarded within the four borders, anxiously dwelling in fear, not daring to stir—only awaiting Your Majesty's intention to chastise.'",
  "s0272": "'Now with Your Majesty's strength, raise Bashu, annex Hanzhong, surround the two Zhous, move the Nine Tripods, guard Baima Ford.'",
  "s0273": "'Qin though remote, has long harbored resentment and anger.'",
  "s0274": "'Now Qin has worn armor and blunted weapons, camped at Mianchi, wishes to cross the Yellow River and Zhang, occupy Fanwu, meet below Handan, wishes to clash at Jiazi day to correct Yin and Zhou's affairs, respectfully sends envoy to inform Your Majesty's attendants.'",
  "s0275": "'All Your Majesty trusts as alliance advocates rely on Su Qin.'",
  "s0276": "'Su Qin dazzled the feudal lords, calling wrong right and right wrong, wishing to overturn Qi and had himself torn apart by chariots in the marketplace.'",
  "s0277": "'That the world cannot be united is clear.'",
  "s0278": "'Now Chu and Qin are brother states, Han and Wei called eastern vassal ministers, Qi offers fish and salt lands—this cuts off Zhao's right arm.'",
  "s0279": "'Cutting off the right arm to fight others, losing allies and standing alone—wishing not to be in danger, how can it be obtained?'",
  "s0280": "'Now Qin sends three generals: one army blocks Wudao, tells Qi envoy to raise troops cross Qing River, camp east of Handan;'",
  "s0281": "'one army camps at Chenggao, drives Han and Wei troops beyond the Yellow River;'",
  "s0282": "'one army camps at Mianchi.'",
  "s0283": "'Agrees four states unite to attack Zhao. Zhao defeated, certainly divide its land in four.'",
  "s0284": "'Therefore not daring to hide intention conceal situation, first inform Your Majesty's attendants.'",
  "s0285": "'I secretly plan for Your Majesty, nothing better than meeting the Qin king at Mianchi, face to face and mouth to mouth, requesting to halt troops without attack.'",
  "s0286": "'I wish Your Majesty to decide.'",
  "s0288": "The King of Zhao said: 'In my father's time, Lord Yangyang monopolized power and influence, deceived my father, alone controlled affairs. I resided as heir apparent under tutors, not participating in state planning.'",
  "s0289": "'My father abandoned the ministers. I was young, newly performing sacrifices, my heart secretly doubted, thinking one alliance not serving Qin was not the state's long-term benefit.'",
  "s0290": "'I was about to change heart and thought, cede land to apologize for past errors and serve Qin.'",
  "s0291": "'Just preparing chariots to hurry there, I fortunately heard the envoy's enlightened decree.'",
  "s0292": "The King of Zhao agreed to Zhang Yi. Zhang Yi then left.",
  "s0293": "He went north to Yan, persuading King Zhao of Yan: 'None whom Your Majesty esteems exceed Zhao.'",
  "s0294": "'Formerly Zhao Xiangzi once made his sister wife to the King of Dai, wishing to annex Dai, agreeing to meet the King of Dai at Guju pass.'",
  "s0295": "'He ordered craftsmen make a gold ladle, lengthening its handle so it could strike people.'",
  "s0296": "'Drinking with the King of Dai, secretly told the cook: \"When wine is abundant and joy high, advance hot soup, turn the ladle to strike him.\"'",
  "s0297": "'Then wine abundant joy high, advance hot soup, cook advances pours, turns ladle strikes King of Dai, kills him, brain splatters ground.'",
  "s0298": "'His sister hears, grinds hairpin to stab herself, therefore until now has Moya mountain.'",
  "s0299": "'Dai king's extinction, world none not hear.'",
  "s0300": "'Zhao king's cruel disloyalty without kin, Your Majesty clearly sees, moreover with Zhao king considers can close?'",
  "s0301": "'Zhao raises troops attacks Yan, twice surrounds Yan capital coerces Your Majesty, Your Majesty cedes ten cities apologizes.'",
  "s0302": "'Now Zhao king already enters court Mianchi, presents Hejian serves Qin.'",
  "s0303": "'Now Your Majesty not serves Qin, Qin lowers armor Yunzhong Jiuyuan, drives Zhao attacks Yan, then Yisui Changcheng not Your Majesty has.'",
  "s0304": "'Moreover now Zhao to Qin like jun county, not dares rashly raises troops attacks invades.'",
  "s0305": "'Now wang serves Qin, Qin wang certainly happy, Zhao not dares rashly moves, is west has strong Qin aid, south no Qi Zhao trouble, is therefore wishes Your Majesty carefully plans.'",
  "s0307": "Yan wang says: 'My person barbarian remote place, though big man only like infant, words not sufficient to adopt correct plan.'",
  "s0308": "'Now upper guest fortunately teaches, please west faces serves Qin, offers Hengshan tail five cities.'",
  "s0309": "Yan wang listens Yi.",
  "s0310": "Yi returns reports, not arrives Xian Yang yet Qin Hui Wang dies, Wu Wang stands.",
  "s0311": "Wu Wang from is crown prince time not likes Zhang Yi, reaches ascends throne, ministers many slander Zhang Yi: 'No trust, left right sells state takes favor.'",
  "s0312": "'Qin certainly again uses him, fears for world laughs.'",
  "s0313": "Feudal lords hear Zhang Yi has rejects Wu Wang, all betrays alliance, again unites vertical.",
  "s0314": "Qin Wu Wang first year, ministers day night dislikes Zhang Yi not stops, Qi rebuke moreover arrives.",
  "s0315": "Zhang Yi fears executes, then because tells Qin Wu Wang: 'Yi has foolish plan, wishes presents.'",
  "s0316": "Wang says: 'How?'",
  "s0317": "Answers: 'For Qin altars soil grain plans, east has big change, then wang can many divides obtains land.'",
  "s0318": "'Now hears Qi wang very hates Yi, Yi where, certainly raises troops attacks it.'",
  "s0319": "'Therefore Yi wishes begs his not worthy body to Liang, Qi certainly raises troops attacks Liang.'",
  "s0320": "'Liang Qi troops connects at city below not can departs, wang with its interval attacks Han, enters Sanchuan, emerges troops Han Gu not attacks, to faces Zhou, sacrifice vessels certainly emerges.'",
  "s0321": "'Holds Son of Heaven, presses maps registers, this wang enterprise.'",
  "s0322": "Qin wang considers correct, then prepares leather chariots thirty rides, enters Yi to Liang.",
  "s0323": "Qi indeed raises troops attacks it.",
  "s0324": "Liang Ai Wang fears.",
  "s0325": "Zhang Yi says: 'Wang not worries, please makes stops Qi troops.'",
  "s0326": "Then makes his house person Feng Xi to Chu, borrows makes to Qi, tells Qi wang: 'Wang very hates Zhang Yi;'",
  "s0327": "'Although, also thick wang trusts Yi at Qin.'",
  "s0328": "Qi wang says: 'My person hates Yi, Yi where, certainly raises troops attacks it, why trusts Yi?'",
  "s0329": "Answers: 'Is wang trusts Yi.'",
  "s0330": "'Yi emerges, solid with Qin wang agrees: As wang plans, east has big change, then wang can many divides obtains land.'",
  "s0331": "'Now Qi wang very hates Yi, Yi where, certainly raises troops attacks it.'",
  "s0332": "'Therefore Yi wishes begs his not worthy body to Liang, Qi certainly raises troops attacks Liang.'",
  "s0333": "'Qi Liang troops connects at city below not can departs, wang with its interval attacks Han, enters Sanchuan, emerges troops Han Gu not attacks, to faces Zhou, sacrifice vessels certainly emerges.'",
  "s0334": "'Holds Son of Heaven, presses maps registers, this wang enterprise.'",
  "s0335": "'Qin wang considers correct, therefore prepares leather chariots thirty rides enters to Liang.'",
  "s0336": "'Now Yi enters Liang, wang indeed attacks it, is wang inner exhausts state outer attacks ally country, broad neighbor enemy with inner self faces, believes Yi at Qin wang.'",
  "s0337": "'This minister so called trusts Yi.'",
  "s0338": "Qi wang says: 'Good.'",
  "s0339": "Then makes relieves troops.",
  "s0340": "Zhang Yi chancellor Wei one year, dies at Wei.",
  "s0341": "Chen Zhen, travel speaks scholar.",
  "s0342": "With Zhang Yi together serves Qin Hui Wang, all noble heavy, contends favor.",
  "s0343": "Zhang Yi dislikes Chen Zhen at Qin wang: 'Zhen heavy currency light makes Qin Chu interval, will for country connects.'",
  "s0344": "'Now Chu not adds good at Qin yet goods Zhen, Zhen self makes thick for wang thin.'",
  "s0345": "'Moreover Zhen wishes departs Qin goes Chu, wang why not listens?'",
  "s0346": "Wang tells Chen Zhen: 'I hears you wishes departs my Qin goes Chu, has?'",
  "s0347": "Zhen says: 'Correct.'",
  "s0348": "Wang says: 'Yi words indeed believes.'",
  "s0349": "Zhen says: 'Not only Yi knows, travel road scholars all knows.'",
  "s0350": "'Former Wu Yun loyal to his jun yet world contends considers minister, Zeng Shen filial to his parents yet world wishes considers son.'",
  "s0351": "'Therefore sells male female not emerges alley lane yet sells, good male female;'",
  "s0352": "'emerges woman marries at village quarter, good woman.'",
  "s0353": "'Now Zhen not loyal his jun, Chu also why with Zhen as loyal?'",
  "s0354": "'Loyal moreover sees abandons, Zhen not goes Chu where returns?'",
  "s0355": "Wang with his words considers correct, then good treats him.",
  "s0356": "Dwells Qin one year, Qin Hui Wang finally chancellor Zhang Yi, Chen Zhen flees Chu.",
  "s0357": "Chu not heavy him, makes Chen Zhen envoy to Qin.",
  "s0358": "Passes Liang, wishes sees Xi Shou.",
  "s0359": "Xi Shou declines not sees.",
  "s0360": "Zhen says: 'I for affairs comes, jun not sees Zhen, Zhen will goes, not obtains waits different day.'",
  "s0361": "Xi Shou sees him.",
  "s0362": "Chen Zhen says: 'Jun why good drinks?'",
  "s0363": "Xi Shou says: 'No affairs.'",
  "s0364": "Says: 'I requests makes jun satiates affairs can?'",
  "s0365": "Says: 'How?'",
  "s0366": "Says: 'Tian Xu binds feudal lords from close, Chu wang suspects it, not believes.'",
  "s0367": "'Jun tells wang: Minister with Yan Zhao wang has old, several makes person comes, says no affairs why not mutually sees, wishes requests travels at wang.'",
  "s0368": "'Wang though permits jun, jun requests not many chariots, with chariots thirty rides, can arranges at court, bright speaks Yan Zhao.'",
  "s0369": "Yan Zhao guests hears, gallops chariots tells their wang, makes person welcomes Xi Shou.",
  "s0370": "Chu wang hears greatly angers: 'Tian Xu with my binds, Xi Shou Yan Zhao, is deceives I.'",
  "s0371": "Angers not listens his affairs.",
  "s0372": "Qi hears Xi Shou north, makes person with affairs entrusts.",
  "s0373": "Xi Shou then goes, three countries mutually affairs all breaks at Xi Shou.",
  "s0374": "Zhen then arrives Qin.",
  "s0375": "Han Wei mutually attacks, one year not resolves.",
  "s0376": "Qin Hui Wang wishes saves it, asks left right.",
  "s0377": "Left right or says saves convenient, or says not saves convenient, Hui Wang not able decides.",
  "s0378": "Chen Zhen suitable arrives Qin, Hui Wang says: 'You depart my Chu, also thinks me not?'",
  "s0379": "Chen Zhen answers: 'Wang hears Yue person Zhuang Xi?'",
  "s0380": "Wang says: 'Not hears.'",
  "s0381": "Says: 'Yue person Zhuang Xi serves Chu holds jade, has moment then ill.'",
  "s0382": "'Chu wang says: Xi originally Yue low small person, now serves Chu holds jade, noble rich, also thinks Yue not?'",
  "s0383": "'Zhong thanks answers: All person thinks old, at his ill.'",
  "s0384": "'He thinks Yue then Yue sound, not thinks Yue then Chu sound.'",
  "s0385": "'Makes person goes listens, still Yue sound.'",
  "s0386": "'Now minister though abandons pursues to Chu, how can no Qin sound!'",
  "s0387": "Hui Wang says: 'Good.'",
  "s0388": "'Now Han Wei mutually attacks, one year not resolves, or says my saves convenient, or says not saves convenient, my not can decides, wishes you for you jun plans remaining, for my plans.'",
  "s0389": "Chen Zhen answers: 'Also once has with Bian Zhuang Zi stabs tiger hears wang?'",
  "s0390": "'Zhuang Zi wishes stabs tiger, inn young child stops him: Two tigers just eats cow, eats sweet certainly contends, contends then certainly fights, fights then big hurts, small dies, from hurts stabs it, one raises certainly has double tiger name.'",
  "s0391": "'Bian Zhuang Zi considers correct, stands awaits.'",
  "s0392": "'Has moment, two tigers indeed fights, big hurts, small dies.'",
  "s0393": "'Zhuang Zi from hurts stabs it, one raises certainly has double tiger merit.'",
  "s0394": "'Now Han Wei mutually attacks, one year not resolves, is certainly big country hurts, small country perishes, from hurts attacks it, one raises certainly has two solid.'",
  "s0395": "'This still Zhuang Zi stabs tiger class.'",
  "s0396": "'Minister jun with wang what different.'",
  "s0397": "Hui Wang says: 'Good.'",
  "s0398": "Finally not saves.",
  "s0399": "Big country indeed hurts, small country perishes, Qin raises troops attacks, greatly conquers it.",
  "s0400": "This Chen Zhen plan.",
  "s0401": "Xi Shou, Wei Yin Jin person, name Yan, surname Gong Sun.",
  "s0402": "With Zhang Yi not good.",
  "s0403": "Zhang Yi for Qin Wei, Wei wang chancellor Zhang Yi.",
  "s0404": "Xi Shou not benefits, therefore makes person tells Han Gong Shu: 'Zhang Yi already unites Qin Wei, his words: Wei attacks Nan Yang, Qin attacks Sanchuan.'",
  "s0405": "'Wei wang so nobles Zhang Zi, wishes obtains Han land.'",
  "s0406": "'Moreover Han Nan Yang already raises, you why not little yields to makes Yan merit, then Qin Wei friendship can mistakes.'",
  "s0407": "'Then Wei certainly schemes Qin abandons Yi, collects Han chancellors Yan.'",
  "s0408": "Gong Shu considers convenient, because yields to Xi Shou makes merit.",
  "s0409": "Indeed chancellor Wei.",
  "s0410": "Zhang Yi goes.",
  "s0411": "Yi Qu jun courts at Wei.",
  "s0412": "Xi Shou hears Zhang Yi again chancellor Qin, harms him.",
  "s0413": "Xi Shou then tells Yi Qu jun: 'Road far not obtains again passes, please requests affairs.'",
  "s0414": "Says: 'China no affairs, Qin obtains burns grasps burns gathers jun country;'",
  "s0415": "'has affairs, Qin will light makes heavy currency serves jun country.'",
  "s0416": "After five countries attacks Qin.",
  "s0417": "Meets Chen Zhen tells Qin wang: 'Yi Qu jun, barbarian yi worthy jun, not as bribes with pacifies his ambition.'",
  "s0418": "Qin wang says: 'Good.'",
  "s0419": "Then with literary embroider thousand pure, women hundred people sends Yi Qu jun.",
  "s0420": "Yi Qu jun assembles ministers plans: 'This Gong Sun Yan so called?'",
  "s0421": "Then raises troops attacks Qin, greatly defeats Qin people Li Bo below.",
  "s0422": "Zhang Yi already dies after, Xi Shou enters chancellor Qin.",
  "s0423": "Once wears five countries chancellor seal, for binds long.",
  "s0424": "Grand Historian says: Three Jin many power changes scholars, speaks vertical horizontal strong Qin generally all three Jin people.",
  "s0425": "Zhang Yi conduct affairs very surpasses Su Qin, yet world dislikes Su Qin, with his first dies, Yi vibrates exposes his short supports his says, completes his horizontal way.",
  "s0426": "Summarizes, this two people true inclines dangerous scholars!"
}