{
  "chapter": "008",
  "translations": [
    {
      "id": "s0051",
      "chinese": "乃前，拔劍擊斬蛇。",
      "literal": "He then went forward, drew his sword, and struck and beheaded the snake.",
      "idiomatic": "He stepped forward, drew his sword, and cut off the snake's head."
    },
    {
      "id": "s0053",
      "chinese": "行數里，醉，因臥。",
      "literal": "After traveling several li, drunk, he lay down to sleep.",
      "idiomatic": "After walking several miles, drunk as he was, he lay down to sleep."
    },
    {
      "id": "s0061",
      "chinese": "諸從者日益畏之。",
      "literal": "Those who followed him grew daily more in awe of him.",
      "idiomatic": "His followers grew more awestruck with each passing day."
    },
    {
      "id": "s0068",
      "chinese": "沛中子弟或聞之，多欲附者矣。",
      "literal": "Some of the young men of Pei heard of this and many wished to attach themselves to him.",
      "idiomatic": "Some young men from Pei heard about this and many wanted to join him."
    },
    {
      "id": "s0074",
      "chinese": "乃令樊噲召劉季。",
      "literal": "He then ordered Fan Kuai to summon Liu Ji.",
      "idiomatic": "He ordered Fan Kuai to summon Liu Ji."
    },
    {
      "id": "s0089",
      "chinese": "於是劉季數讓。",
      "literal": "Thereupon Liu Ji declined several times.",
      "idiomatic": "Liu Ji repeatedly declined the offer."
    },
    {
      "id": "s0098",
      "chinese": "命雍齒守豐，引兵之薛。",
      "literal": "He ordered Yong Chi to defend Feng and led his troops to Xue.",
      "idiomatic": "He ordered Yong Chi to defend Feng while he led his troops to Xue."
    },
    {
      "id": "s0108",
      "chinese": "沛公病，還之沛。",
      "literal": "The Duke of Pei fell ill and returned to Pei.",
      "idiomatic": "The Duke of Pei fell ill and went back to Pei."
    },
    {
      "id": "s0115",
      "chinese": "還軍豐。",
      "literal": "They returned the army to Feng.",
      "idiomatic": "They brought the army back to Feng."
    },
    {
      "id": "s0118",
      "chinese": "沛公還，引兵攻豐。",
      "literal": "The Duke of Pei returned and led troops to attack Feng.",
      "idiomatic": "The Duke of Pei came back and led his troops to attack Feng."
    },
    {
      "id": "s0120",
      "chinese": "項梁盡召別將居薛。",
      "literal": "Xiang Liang summoned all the separate generals to assemble at Xue.",
      "idiomatic": "Xiang Liang called together all the independent generals at Xue."
    },
    {
      "id": "s0121",
      "chinese": "聞陳王定死，因立楚後懷王孫心為楚王，治盱臺。",
      "literal": "Hearing that King Chen had definitely died, they consequently installed Xin, grandson of the former King Huai of Chu, as King of Chu, governing from Xutai.",
      "idiomatic": "Upon learning that King Chen was definitely dead, they installed Xin—grandson of the former King Huai of Chu—as King of Chu, governing from Xutai."
    },
    {
      "id": "s0134",
      "chinese": "呂臣軍彭城東，項羽軍彭城西，沛公軍碭。",
      "literal": "Lü Chen's army was east of Pengcheng, Xiang Yu's army west of Pengcheng, and the Duke of Pei's army at Dang.",
      "idiomatic": "Lü Chen's forces were east of Pengcheng, Xiang Yu's west of Pengcheng, and the Duke of Pei's at Dang."
    },
    {
      "id": "s0139",
      "chinese": "封項羽為長安侯，號為魯公。",
      "literal": "He enfeoffed Xiang Yu as Marquis of Chang'an and gave him the title Duke of Lu.",
      "idiomatic": "He enfeoffed Xiang Yu as Marquis of Chang'an with the title Duke of Lu."
    },
    {
      "id": "s0151",
      "chinese": "今項羽彊悍，今不可遣。",
      "literal": "Now Xiang Yu is fierce and violent; he cannot be sent.",
      "idiomatic": "Xiang Yu is too fierce and violent to be sent away."
    },
    {
      "id": "s0161",
      "chinese": "乃求見說沛公。",
      "literal": "He then sought an audience to persuade the Duke of Pei.",
      "idiomatic": "He requested an audience to persuade the Duke of Pei."
    },
    {
      "id": "s0164",
      "chinese": "於是沛公起，攝衣謝之，延上坐。",
      "literal": "Thereupon the Duke of Pei rose, adjusted his clothing, apologized, and invited him to the seat of honor.",
      "idiomatic": "The Duke of Pei stood up, straightened his clothes, apologized, and invited him to the seat of honor."
    },
    {
      "id": "s0165",
      "chinese": "食其說沛公襲陳留，得秦積粟。",
      "literal": "Li Yiji persuaded the Duke of Pei to attack Chenliu and obtain Qin's accumulated grain.",
      "idiomatic": "Li Yiji persuaded the Duke of Pei to raid Chenliu and seize Qin's stockpiled grain."
    },
    {
      "id": "s0188",
      "chinese": "乃以宛守為殷侯，封陳恢千戶。",
      "literal": "He then made the Administrator of Wan Marquis of Yin and enfeoffed Chen Hui with a thousand households.",
      "idiomatic": "He made the Administrator of Wan Marquis of Yin and granted Chen Hui fiefs worth a thousand households."
    },
    {
      "id": "s0190",
      "chinese": "至丹水，高武侯鰓、襄侯王陵降西陵。",
      "literal": "Reaching Danshui, Marquis Gaowu Sai and Marquis Xiang Wang Ling surrendered at Xiling.",
      "idiomatic": "Upon reaching Danshui, Marquis Gaowu Sai and Marquis Xiang Wang Ling surrendered at Xiling."
    },
    {
      "id": "s0192",
      "chinese": "遣魏人甯昌使秦，使者未來。",
      "literal": "They dispatched Ning Chang of Wei as envoy to Qin, but the envoy had not yet returned.",
      "idiomatic": "They sent Ning Chang of Wei as an envoy to Qin, but he had not yet returned."
    },
    {
      "id": "s0193",
      "chinese": "是時章邯已以軍降項羽於趙矣。",
      "literal": "At this time Zhang Han had already surrendered his army to Xiang Yu at Zhao.",
      "idiomatic": "By this time, Zhang Han had already surrendered his army to Xiang Yu in Zhao."
    },
    {
      "id": "s0195",
      "chinese": "及趙高已殺二世，使人來，欲約分王關中。",
      "literal": "When Zhao Gao had already killed the Second Emperor, he sent men to come wishing to make an agreement to divide and rule Guanzhong.",
      "idiomatic": "When Zhao Gao had already assassinated the Second Emperor, he sent messengers wanting to negotiate dividing Guanzhong between them."
    },
    {
      "id": "s0202",
      "chinese": "諸將或言誅秦王。",
      "literal": "Some generals spoke of executing the King of Qin.",
      "idiomatic": "Some generals suggested executing the King of Qin."
    },
    {
      "id": "s0205",
      "chinese": "乃以秦王屬吏，遂西入咸陽。",
      "literal": "He then handed the King of Qin over to officials and proceeded west into Xianyang.",
      "idiomatic": "He turned the King of Qin over to the officials and proceeded west into Xianyang."
    },
    {
      "id": "s0210",
      "chinese": "餘悉除去秦法。",
      "literal": "All the rest of Qin's laws are eliminated.",
      "idiomatic": "All remaining Qin laws are abolished."
    },
    {
      "id": "s0211",
      "chinese": "諸吏人皆案堵如故。",
      "literal": "All officials and people shall remain peacefully as before.",
      "idiomatic": "All officials and people are to stay peacefully in their places as before."
    },
    {
      "id": "s0212",
      "chinese": "凡吾所以來，為父老除害，非有所侵暴，無恐！",
      "literal": "The reason I have come is to eliminate harm for the elders, not to invade or commit violence—have no fear!",
      "idiomatic": "I have come to eliminate harm for you elders, not to invade or commit violence—have no fear!"
    },
    {
      "id": "s0215",
      "chinese": "秦人大喜，爭持牛羊酒食獻饗軍士。",
      "literal": "The Qin people were greatly pleased and competed to bring oxen, sheep, wine, and food to offer feasts for the soldiers.",
      "idiomatic": "The Qin people were overjoyed and vied to bring cattle, sheep, wine, and food to feast the soldiers."
    },
    {
      "id": "s0217",
      "chinese": "人又益喜，唯恐沛公不為秦王。",
      "literal": "The people were even more pleased and only feared the Duke of Pei would not become King of Qin.",
      "idiomatic": "The people were even more delighted and feared only that the Duke of Pei might not become King of Qin."
    },
    {
      "id": "s0219",
      "chinese": "今聞章邯降項羽，項羽乃號為雍王，王關中。",
      "literal": "Now I hear Zhang Han has surrendered to Xiang Yu, and Xiang Yu has taken the title King of Yong to rule Guanzhong.",
      "idiomatic": "Now I hear that Zhang Han has surrendered to Xiang Yu, who has styled himself King of Yong to rule Guanzhong."
    },
    {
      "id": "s0222",
      "chinese": "沛公然其計，從之。",
      "literal": "The Duke of Pei agreed with this plan and followed it.",
      "idiomatic": "The Duke of Pei approved this plan and adopted it."
    },
    {
      "id": "s0223",
      "chinese": "十一月中，項羽果率諸侯兵西，欲入關，關門閉。",
      "literal": "In the eleventh month, Xiang Yu indeed led the feudal lords' troops west wishing to enter the passes, but the pass gates were closed.",
      "idiomatic": "In the eleventh month, Xiang Yu indeed led the feudal lords' troops west to enter the passes, but the gates were closed."
    },
    {
      "id": "s0224",
      "chinese": "聞沛公已定關中，大怒，使黥布等攻破函谷關。",
      "literal": "Hearing that the Duke of Pei had already settled Guanzhong, he was greatly enraged and sent Qing Bu and others to attack and break through Hangu Pass.",
      "idiomatic": "Upon hearing that the Duke of Pei had already pacified Guanzhong, he flew into a rage and sent Qing Bu and others to smash through Hangu Pass."
    },
    {
      "id": "s0225",
      "chinese": "十二月中，遂至戲。",
      "literal": "In the twelfth month, they then reached Xi.",
      "idiomatic": "By the twelfth month, they had reached Xi."
    },
    {
      "id": "s0227",
      "chinese": "欲以求封。",
      "literal": "He wished to seek enfeoffment by this.",
      "idiomatic": "He wanted to use this to seek a fief."
    },
    {
      "id": "s0228",
      "chinese": "亞父勸項羽擊沛公。",
      "literal": "The Second Father urged Xiang Yu to strike the Duke of Pei.",
      "idiomatic": "Fan Zeng urged Xiang Yu to attack the Duke of Pei."
    },
    {
      "id": "s0229",
      "chinese": "方饗士，旦日合戰。",
      "literal": "They were feasting the troops and would join battle the next day.",
      "idiomatic": "They were hosting a banquet for the troops, with battle planned for the next day."
    },
    {
      "id": "s0230",
      "chinese": "是時項羽兵四十萬，號百萬。",
      "literal": "At that time Xiang Yu had four hundred thousand troops, claimed to be a million.",
      "idiomatic": "At that time Xiang Yu had 400,000 troops, though he claimed a million."
    },
    {
      "id": "s0231",
      "chinese": "沛公兵十萬，號二十萬，力不敵。",
      "literal": "The Duke of Pei had one hundred thousand troops, claimed to be two hundred thousand; in strength they were no match.",
      "idiomatic": "The Duke of Pei had 100,000 troops, though he claimed 200,000; their strength was no match."
    },
    {
      "id": "s0233",
      "chinese": "沛公從百餘騎，驅之鴻門，見謝項羽。",
      "literal": "The Duke of Pei with over a hundred cavalry galloped to Hongmen to see and apologize to Xiang Yu.",
      "idiomatic": "The Duke of Pei rode with over a hundred cavalrymen to Hongmen to meet Xiang Yu and offer apologies."
    },
    {
      "id": "s0236",
      "chinese": "沛公以樊噲、張良故，得解歸。",
      "literal": "The Duke of Pei through Fan Kuai and Zhang Liang's efforts was able to be released and return.",
      "idiomatic": "Thanks to Fan Kuai and Zhang Liang, the Duke of Pei was able to slip away and return home."
    },
    {
      "id": "s0237",
      "chinese": "歸，立誅曹無傷。",
      "literal": "Returning, he immediately executed Cao Wushang.",
      "idiomatic": "Upon returning, he immediately had Cao Wushang executed."
    },
    {
      "id": "s0239",
      "chinese": "秦人大失望，然恐，不敢不服耳。",
      "literal": "The Qin people were greatly disappointed but were afraid and dared not disobey.",
      "idiomatic": "The Qin people were bitterly disappointed, but fear kept them obedient."
    },
    {
      "id": "s0240",
      "chinese": "項羽使人還報懷王。",
      "literal": "Xiang Yu sent men to report back to King Huai.",
      "idiomatic": "Xiang Yu sent messengers back to report to King Huai."
    },
    {
      "id": "s0242",
      "chinese": "項羽怨懷王不肯令與沛公俱西入關，而北救趙，後天下約。",
      "literal": "Xiang Yu resented that King Huai would not permit him to go west into the passes together with the Duke of Pei, but instead went north to rescue Zhao, coming after the agreement about all under Heaven.",
      "idiomatic": "Xiang Yu resented King Huai for not letting him enter the passes with the Duke of Pei, but instead sending him north to rescue Zhao after the agreement on dividing the empire."
    },
    {
      "id": "s0245",
      "chinese": "乃詳尊懷王為義帝，實不用其命。",
      "literal": "He then outwardly honored King Huai as the Righteous Emperor but actually did not use his commands.",
      "idiomatic": "He paid lip service to King Huai as the Righteous Emperor but ignored his orders."
    },
    {
      "id": "s0246",
      "chinese": "正月，項羽自立為西楚霸王，王梁、楚地九郡，都彭城。",
      "literal": "In the first month, Xiang Yu made himself King of Western Chu, ruling nine commanderies of Liang and Chu, with his capital at Pengcheng.",
      "idiomatic": "In the first month, Xiang Yu proclaimed himself Hegemon-King of Western Chu, ruling nine commanderies of Liang and Chu lands with his capital at Pengcheng."
    },
    {
      "id": "s0247",
      "chinese": "負約，更立沛公為漢王，王巴、蜀、漢中，都南鄭。",
      "literal": "Breaking the agreement, he instead installed the Duke of Pei as King of Han, to rule Ba, Shu, and Hanzhong, with his capital at Nanzheng.",
      "idiomatic": "Breaking the agreement, he instead made the Duke of Pei King of Han, giving him Ba, Shu, and Hanzhong to rule with his capital at Nanzheng."
    },
    {
      "id": "s0248",
      "chinese": "三分關中，立秦三將：章邯為雍王，都廢丘；",
      "literal": "He divided Guanzhong into three parts and installed the three Qin generals: Zhang Han as King of Yong, with his capital at Feiqiu;",
      "idiomatic": "He divided Guanzhong into three parts and installed the three Qin generals: Zhang Han as King of Yong with his capital at Feiqiu;"
    },
    {
      "id": "s0249",
      "chinese": "司馬欣為塞王，都櫟陽；",
      "literal": "Sima Xin as King of Sai, with his capital at Liyang;",
      "idiomatic": "Sima Xin as King of Sai with his capital at Liyang;"
    },
    {
      "id": "s0250",
      "chinese": "董翳為翟王，都高奴。",
      "literal": "Dong Yi as King of Di, with his capital at Gaonu.",
      "idiomatic": "Dong Yi as King of Di with his capital at Gaonu."
    },
    {
      "id": "s0251",
      "chinese": "楚將瑕丘申陽為河南王，都洛陽。",
      "literal": "Chu general Shen Yang of Xiaqiu as King of Henan, with his capital at Luoyang.",
      "idiomatic": "Chu general Shen Yang of Xiaqiu as King of Henan with his capital at Luoyang."
    },
    {
      "id": "s0252",
      "chinese": "趙將司馬卬為殷王，都朝歌。",
      "literal": "Zhao general Sima Ang as King of Yin, with his capital at Chaoge.",
      "idiomatic": "Zhao general Sima Ang as King of Yin with his capital at Chaoge."
    },
    {
      "id": "s0253",
      "chinese": "趙王歇徙王代。",
      "literal": "King Xie of Zhao was moved to be King of Dai.",
      "idiomatic": "King Xie of Zhao was transferred to rule Dai."
    },
    {
      "id": "s0254",
      "chinese": "趙相張耳為常山王，都襄國。",
      "literal": "Zhao's Prime Minister Zhang Er as King of Changshan, with his capital at Xiangguo.",
      "idiomatic": "Zhao's prime minister Zhang Er as King of Changshan with his capital at Xiangguo."
    },
    {
      "id": "s0255",
      "chinese": "當陽君黥布為九江王，都六。",
      "literal": "Lord Dangyang Qing Bu as King of Jiujiang, with his capital at Liu.",
      "idiomatic": "Lord Dangyang Qing Bu as King of Jiujiang with his capital at Liu."
    },
    {
      "id": "s0256",
      "chinese": "懷王柱國共敖為臨江王，都江陵。",
      "literal": "King Huai's Supreme Pillar of State Gong Ao as King of Linjiang, with his capital at Jiangling.",
      "idiomatic": "King Huai's Supreme Pillar of State Gong Ao as King of Linjiang with his capital at Jiangling."
    },
    {
      "id": "s0257",
      "chinese": "番君吳芮為衡山王，都邾。",
      "literal": "Lord Fan Wu Rui as King of Hengshan, with his capital at Zhu.",
      "idiomatic": "Lord Fan Wu Rui as King of Hengshan with his capital at Zhu."
    },
    {
      "id": "s0258",
      "chinese": "燕將臧荼為燕王，都薊。",
      "literal": "Yan general Zang Tu as King of Yan, with his capital at Ji.",
      "idiomatic": "Yan general Zang Tu as King of Yan with his capital at Ji."
    },
    {
      "id": "s0259",
      "chinese": "故燕王韓廣徙王遼東。",
      "literal": "The former King of Yan Han Guang was moved to be King of Liaodong.",
      "idiomatic": "The former King of Yan Han Guang was transferred to rule Liaodong."
    },
    {
      "id": "s0260",
      "chinese": "廣不聽，臧荼攻殺之無終。",
      "literal": "Guang would not obey; Zang Tu attacked and killed him at Wuzhong.",
      "idiomatic": "Guang refused to obey; Zang Tu attacked and killed him at Wuzhong."
    },
    {
      "id": "s0261",
      "chinese": "封成安君陳餘河閒三縣，居南皮。",
      "literal": "He enfeoffed Lord Chengan Chen Yu with three counties of Hejian, residing at Nanpi.",
      "idiomatic": "He enfeoffed Lord Chengan Chen Yu with three counties in Hejian, making his residence at Nanpi."
    },
    {
      "id": "s0262",
      "chinese": "封梅鋗十萬戶。",
      "literal": "He enfeoffed Mei Xuan with a hundred thousand households.",
      "idiomatic": "He granted Mei Xuan a fief of 100,000 households."
    },
    {
      "id": "s0263",
      "chinese": "四月，兵罷戲下，諸侯各就國。",
      "literal": "In the fourth month, the troops were dismissed below Xi; the feudal lords each went to their states.",
      "idiomatic": "In the fourth month, the troops were disbanded below Xi; each feudal lord went to his own state."
    },
    {
      "id": "s0265",
      "chinese": "去輒燒絕棧道，以備諸侯盜兵襲之，亦示項羽無東意。",
      "literal": "As they departed they immediately burned and severed the plank roads to prepare against the feudal lords' troops raiding them, and also to show Xiang Yu they had no intention of going east.",
      "idiomatic": "As they left, they immediately burned and destroyed the plank roads to guard against the feudal lords raiding them, and also to show Xiang Yu they had no plans to advance east."
    },
    {
      "id": "s0269",
      "chinese": "天下已定，人皆自寧，不可復用。",
      "literal": "Once all under Heaven is settled, people will all seek their own comfort and cannot be used again.",
      "idiomatic": "Once the empire is pacified, people will settle into complacency and won't be fit for service again."
    },
    {
      "id": "s0272",
      "chinese": "項羽出關，使人徙義帝。",
      "literal": "Xiang Yu having left the passes sent men to relocate the Righteous Emperor.",
      "idiomatic": "After leaving the passes, Xiang Yu sent men to relocate the Righteous Emperor."
    },
    {
      "id": "s0275",
      "chinese": "項羽怨田榮，立齊將田都為齊王。",
      "literal": "Xiang Yu resented Tian Rong and installed Qi general Tian Du as King of Qi.",
      "idiomatic": "Xiang Yu resented Tian Rong and installed the Qi general Tian Du as King of Qi."
    },
    {
      "id": "s0276",
      "chinese": "田榮怒，因自立為齊王，殺田都而反楚；",
      "literal": "Tian Rong was angry and consequently made himself King of Qi, killed Tian Du, and rebelled against Chu;",
      "idiomatic": "Tian Rong was furious and consequently proclaimed himself King of Qi, killed Tian Du, and rebelled against Chu;"
    },
    {
      "id": "s0281",
      "chinese": "迎趙王歇於代，復立為趙王。",
      "literal": "They welcomed King Xie of Zhao from Dai and again installed him as King of Zhao.",
      "idiomatic": "They welcomed King Xie of Zhao back from Dai and restored him as King of Zhao."
    },
    {
      "id": "s0282",
      "chinese": "趙王因立陳餘為代王。",
      "literal": "The King of Zhao consequently installed Chen Yu as King of Dai.",
      "idiomatic": "The King of Zhao consequently installed Chen Yu as King of Dai."
    },
    {
      "id": "s0283",
      "chinese": "項羽大怒，北擊齊。",
      "literal": "Xiang Yu was greatly enraged and attacked Qi to the north.",
      "idiomatic": "Xiang Yu flew into a rage and attacked Qi to the north."
    },
    {
      "id": "s0287",
      "chinese": "漢王遂定雍地。",
      "literal": "The King of Han then settled the territory of Yong.",
      "idiomatic": "The King of Han then pacified the territory of Yong."
    },
    {
      "id": "s0289",
      "chinese": "令將軍薛歐、王吸出武關，因王陵兵南陽，以迎太公、呂後於沛。",
      "literal": "He ordered generals Xue Ou and Wang Xi to go out through Wuguan, use Wang Ling's troops at Nanyang, to welcome the Grand Duke and Empress Lü at Pei.",
      "idiomatic": "He ordered generals Xue Ou and Wang Xi to exit through Wuguan Pass, link up with Wang Ling's troops in Nanyang, and escort his father and Empress Lü from Pei."
    },
    {
      "id": "s0290",
      "chinese": "楚聞之，發兵距之陽夏，不得前。",
      "literal": "Chu heard of this and sent troops to resist them at Yangxia; they could not advance.",
      "idiomatic": "Chu got wind of this and dispatched troops to block them at Yangxia; they couldn't proceed."
    },
    {
      "id": "s0291",
      "chinese": "令故吳令鄭昌為韓王，距漢兵。",
      "literal": "He ordered the former magistrate of Wu, Zheng Chang, to be King of Han to resist the Han troops.",
      "idiomatic": "He ordered the former magistrate of Wu, Zheng Chang, to become King of Han and resist the Han troops."
    },
    {
      "id": "s0294",
      "chinese": "於是置隴西、北地、上郡、渭南、河上、中地郡；",
      "literal": "Thereupon he established Longxi, Beidi, Shangjun, Weinan, Heshang, and Zhongdi commanderies;",
      "idiomatic": "Thereupon he established the commanderies of Longxi, Beidi, Shangjun, Weinan, Heshang, and Zhongdi;"
    },
    {
      "id": "s0296",
      "chinese": "更立韓太尉信為韓王。",
      "literal": "He reinstalled Han's Grand Commandant Xin as King of Han.",
      "idiomatic": "He restored Han's Grand Commandant Xin as King of Han."
    },
    {
      "id": "s0297",
      "chinese": "諸將以萬人若以一郡降者，封萬戶。",
      "literal": "Generals who surrendered with ten thousand men or with a commandery were enfeoffed with ten thousand households.",
      "idiomatic": "Generals who surrendered with 10,000 men or an entire commandery were granted fiefs of 10,000 households."
    },
    {
      "id": "s0298",
      "chinese": "繕治河上塞。",
      "literal": "They repaired and constructed the fortifications along the Yellow River.",
      "idiomatic": "They repaired and reinforced the river defenses."
    },
    {
      "id": "s0300",
      "chinese": "大赦罪人。",
      "literal": "They granted a great amnesty to criminals.",
      "idiomatic": "A general amnesty was declared for all criminals."
    },
    {
      "id": "s0302",
      "chinese": "二月，令除秦社稷，更立漢社稷。",
      "literal": "In the second month, he ordered the elimination of Qin's altars of soil and grain and the establishment anew of Han's altars of soil and grain.",
      "idiomatic": "In the second month, he ordered Qin's altars of soil and grain demolished and new Han altars established in their place."
    },
    {
      "id": "s0304",
      "chinese": "下河內，虜殷王，置河內郡。",
      "literal": "He took Henei, captured the King of Yin, and established Henei Commandery.",
      "idiomatic": "He conquered Henei, captured the King of Yin, and established Henei as a commandery."
    },
    {
      "id": "s0305",
      "chinese": "南渡平陰津，至雒陽。",
      "literal": "He crossed south over Pingyin ford and reached Luoyang.",
      "idiomatic": "He crossed south at Pingyin Ford and reached Luoyang."
    },
    {
      "id": "s0306",
      "chinese": "新城三老董公遮說漢王以義帝死故。",
      "literal": "Elder Dong Gong of Xincheng blocked the way and persuaded the King of Han with the story of the Righteous Emperor's death.",
      "idiomatic": "Elder Dong Gong of Xincheng barred his path and persuaded the King of Han with the tale of the Righteous Emperor's death."
    },
    {
      "id": "s0307",
      "chinese": "漢王聞之，袒而大哭。",
      "literal": "The King of Han heard this, bared his torso, and wept loudly.",
      "idiomatic": "The King of Han heard this, bared his chest in mourning, and wailed loudly."
    },
    {
      "id": "s0308",
      "chinese": "遂為義帝發喪，臨三日。",
      "literal": "He then announced mourning for the Righteous Emperor and mourned for three days.",
      "idiomatic": "He then proclaimed mourning rites for the Righteous Emperor and observed three days of mourning."
    },
    {
      "id": "s0316",
      "chinese": "齊皆降楚。",
      "literal": "All of Qi surrendered to Chu.",
      "idiomatic": "All of Qi submitted to Chu."
    },
    {
      "id": "s0317",
      "chinese": "楚因焚燒其城郭，系虜其子女。",
      "literal": "Chu consequently burned their city walls and took their sons and daughters as captives.",
      "idiomatic": "Chu then burned their cities to the ground and carried off their children as captives."
    },
    {
      "id": "s0318",
      "chinese": "齊人叛之。",
      "literal": "The Qi people rebelled against them.",
      "idiomatic": "The people of Qi rose up against them."
    },
    {
      "id": "s0320",
      "chinese": "項羽雖聞漢東，既已連齊兵，欲遂破之而擊漢。",
      "literal": "Though Xiang Yu heard Han had gone east, having already engaged Qi's troops, he wished to completely break them before striking Han.",
      "idiomatic": "Though Xiang Yu heard that Han had gone east, he was already engaged with Qi's forces and wanted to finish them off before turning on Han."
    },
    {
      "id": "s0321",
      "chinese": "漢王以故得劫五諸侯兵，遂入彭城。",
      "literal": "The King of Han because of this was able to coerce the troops of five feudal lords and then entered Pengcheng.",
      "idiomatic": "Thanks to this development, the King of Han was able to commandeer the armies of five feudal lords and marched into Pengcheng."
    },
    {
      "id": "s0323",
      "chinese": "乃取漢王父母妻子於沛，置之軍中以為質。",
      "literal": "He then took the King of Han's father, mother, wife, and children at Pei and placed them in the army as hostages.",
      "idiomatic": "He then seized the King of Han's parents and family from Pei and held them in the army camp as hostages."
    },
    {
      "id": "s0325",
      "chinese": "塞王欣亡入楚。",
      "literal": "King Xin of Sai fled and entered Chu.",
      "idiomatic": "King Xin of Sai fled into Chu territory."
    },
    {
      "id": "s0326",
      "chinese": "呂后兄周呂侯為漢將兵，居下邑。",
      "literal": "Empress Lü's elder brother Lord Zhou Lü commanded Han troops, stationed at Xiayi.",
      "idiomatic": "Empress Lü's elder brother, Lord Zhou Lü, commanded Han troops stationed at Xiayi."
    },
    {
      "id": "s0327",
      "chinese": "漢王從之，稍收士卒，軍碭。",
      "literal": "The King of Han joined him and gradually gathered officers and troops, encamping at Dang.",
      "idiomatic": "The King of Han joined him and gradually rallied soldiers and officers, making camp at Dang."
    },
    {
      "id": "s0328",
      "chinese": "漢王乃西過梁地，至虞。",
      "literal": "The King of Han then went west through the land of Liang and reached Yu.",
      "idiomatic": "The King of Han then marched west through Liang territory and reached Yu."
    },
    {
      "id": "s0332",
      "chinese": "楚使龍且往擊之。",
      "literal": "Chu sent Long Ju to strike him.",
      "idiomatic": "Chu dispatched Long Ju to attack him."
    },
    {
      "id": "s0337",
      "chinese": "更名廢丘為槐里。",
      "literal": "They renamed Feiqiu as Huaili.",
      "idiomatic": "They renamed Feiqiu to Huaili."
    },
    {
      "id": "s0338",
      "chinese": "於是令祠官祀天地四方上帝山川，以時祀之。",
      "literal": "Thereupon he ordered the sacrificial officials to make offerings to Heaven, Earth, the Four Directions, the Supreme Deity, mountains, and rivers, sacrificing to them at the proper times.",
      "idiomatic": "Thereupon he ordered the sacrificial officials to perform rites to Heaven, Earth, the Four Quarters, the Supreme Deity, mountains, and rivers at the appropriate seasons."
    },
    {
      "id": "s0339",
      "chinese": "興關內卒乘塞。",
      "literal": "He mobilized troops from within the passes to man the fortifications.",
      "idiomatic": "He raised troops from within the passes to garrison the defenses."
    },
    {
      "id": "s0340",
      "chinese": "是時九江王布與龍且戰，不勝，與隨何閒行歸漢。",
      "literal": "At this time King Bu of Jiujiang fought with Long Ju, did not win, and traveled secretly with Sui He to return to Han.",
      "idiomatic": "At this time, King Bu of Jiujiang battled Long Ju but was defeated, and secretly slipped away with Sui He to return to Han."
    },
    {
      "id": "s0343",
      "chinese": "漢王使酈生說豹，豹不聽。",
      "literal": "The King of Han sent Li Sheng to persuade Bao, but Bao would not listen.",
      "idiomatic": "The King of Han sent Li Sheng to try to persuade Bao, but Bao refused to listen."
    },
    {
      "id": "s0345",
      "chinese": "遂定魏地，置三郡，曰河東、太原、上黨。",
      "literal": "They then settled the territory of Wei, establishing three commanderies: Hedong, Taiyuan, and Shangdang.",
      "idiomatic": "They then pacified Wei territory and established three commanderies: Hedong, Taiyuan, and Shangdang."
    },
    {
      "id": "s0347",
      "chinese": "其明年，立張耳為趙王。",
      "literal": "The next year, he installed Zhang Er as King of Zhao.",
      "idiomatic": "The following year, he installed Zhang Er as King of Zhao."
    },
    {
      "id": "s0348",
      "chinese": "漢王軍滎陽南，筑甬道屬之河，以取敖倉。",
      "literal": "The King of Han's army was south of Yingyang, constructing a walled supply road connecting it to the river to obtain grain from Ao Granary.",
      "idiomatic": "The King of Han's army camped south of Yingyang and built a covered causeway connecting to the river to access the grain stores at Ao Granary."
    },
    {
      "id": "s0349",
      "chinese": "與項羽相距歲餘。",
      "literal": "They confronted Xiang Yu for over a year.",
      "idiomatic": "They faced off against Xiang Yu for more than a year."
    },
    {
      "id": "s0351",
      "chinese": "漢王請和，割滎陽以西者為漢。",
      "literal": "The King of Han requested peace, offering to cede Yingyang and westward as Han.",
      "idiomatic": "The King of Han sued for peace, offering to cede everything west of Yingyang to Han."
    },
    {
      "id": "s0352",
      "chinese": "項王不聽。",
      "literal": "King Xiang would not listen.",
      "idiomatic": "King Xiang refused to listen."
    },
    {
      "id": "s0354",
      "chinese": "於是項羽乃疑亞父。",
      "literal": "Thereupon Xiang Yu became suspicious of the Second Father.",
      "idiomatic": "Thereupon Xiang Yu grew suspicious of Fan Zeng."
    },
    {
      "id": "s0358",
      "chinese": "令御史大夫周苛、魏豹、樅公守滎陽。",
      "literal": "He ordered Imperial Secretary Zhou Ke, Wei Bao, and Duke Cong to defend Yingyang.",
      "idiomatic": "He ordered Imperial Secretary Zhou Ke, Wei Bao, and Duke Cong to defend Yingyang."
    },
    {
      "id": "s0359",
      "chinese": "諸將卒不能從者，盡在城中。",
      "literal": "All generals and troops who could not follow were entirely in the city.",
      "idiomatic": "All the generals and soldiers who couldn't follow him were left behind in the city."
    },
    {
      "id": "s0361",
      "chinese": "因殺魏豹。",
      "literal": "They consequently killed Wei Bao.",
      "idiomatic": "They consequently executed Wei Bao."
    },
    {
      "id": "s0362",
      "chinese": "漢王之出滎陽入關，收兵欲復東。",
      "literal": "When the King of Han left Yingyang and entered the passes, he gathered troops wishing to go east again.",
      "idiomatic": "When the King of Han left Yingyang and entered the passes, he rallied troops intending to march east again."
    },
    {
      "id": "s0367",
      "chinese": "漢王從其計，出軍宛葉閒，與黥布行收兵。",
      "literal": "The King of Han followed his plan, sent out his army between Wan and Ye, and traveled with Qing Bu gathering troops.",
      "idiomatic": "The King of Han adopted his strategy, deployed his army between Wan and Ye, and traveled with Qing Bu recruiting troops."
    },
    {
      "id": "s0368",
      "chinese": "項羽聞漢王在宛，果引兵南。",
      "literal": "Xiang Yu heard the King of Han was at Wan and indeed led troops south.",
      "idiomatic": "Xiang Yu learned that the King of Han was at Wan and immediately marched south."
    },
    {
      "id": "s0369",
      "chinese": "漢王堅壁不與戰。",
      "literal": "The King of Han entrenched firmly and would not engage in battle.",
      "idiomatic": "The King of Han fortified his position and refused battle."
    },
    {
      "id": "s0371",
      "chinese": "項羽乃引兵東擊彭越。",
      "literal": "Xiang Yu then led troops east to strike Peng Yue.",
      "idiomatic": "Xiang Yu then marched east to attack Peng Yue."
    },
    {
      "id": "s0372",
      "chinese": "漢王亦引兵北軍成皋。",
      "literal": "The King of Han also led troops north to encamp at Chenggao.",
      "idiomatic": "The King of Han also marched north and made camp at Chenggao."
    },
    {
      "id": "s0375",
      "chinese": "自稱使者，晨馳入張耳、韓信壁，而奪之軍。",
      "literal": "Calling himself an envoy, at dawn he galloped into Zhang Er and Han Xin's encampment and seized their army.",
      "idiomatic": "Claiming to be an envoy, he charged at dawn into Zhang Er and Han Xin's camp and took command of their army."
    },
    {
      "id": "s0376",
      "chinese": "乃使張耳北益收兵趙地，使韓信東擊齊。",
      "literal": "He then sent Zhang Er north to further gather troops in Zhao territory and sent Han Xin east to strike Qi.",
      "idiomatic": "He sent Zhang Er north to recruit more troops in Zhao territory and Han Xin east to attack Qi."
    },
    {
      "id": "s0377",
      "chinese": "漢王得韓信軍，則復振。",
      "literal": "The King of Han having obtained Han Xin's army then rallied again.",
      "idiomatic": "With Han Xin's army now under his command, the King of Han regained his strength."
    },
    {
      "id": "s0379",
      "chinese": "郎中鄭忠乃說止漢王，使高壘深塹，勿與戰。",
      "literal": "Gentleman Zheng Zhong then persuaded and stopped the King of Han, having him build high ramparts and dig deep trenches and not engage in battle.",
      "idiomatic": "Gentleman Zheng Zhong then persuaded the King of Han to hold back, building high fortifications and deep trenches instead of giving battle."
    },
    {
      "id": "s0383",
      "chinese": "韓信用蒯通計，遂襲破齊。",
      "literal": "Han Xin used Kuai Tong's stratagem and then launched a surprise attack and broke Qi.",
      "idiomatic": "Han Xin followed Kuai Tong's strategy and launched a surprise attack that shattered Qi."
    },
    {
      "id": "s0384",
      "chinese": "齊王烹酈生，東走高密。",
      "literal": "The King of Qi boiled Li Sheng alive and fled east to Gaomi.",
      "idiomatic": "The King of Qi had Li Sheng boiled alive and fled east to Gaomi."
    },
    {
      "id": "s0387",
      "chinese": "齊王廣奔彭越。",
      "literal": "King Guang of Qi fled to Peng Yue.",
      "idiomatic": "King Guang of Qi fled to Peng Yue for refuge."
    },
    {
      "id": "s0388",
      "chinese": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。",
      "literal": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
      "idiomatic": "At this time, Peng Yue commanded troops based in Liang territory, constantly harassing the Chu forces and severing their supply lines."
    },
    {
      "id": "s0392",
      "chinese": "乃行擊陳留、外黃、睢陽，下之。",
      "literal": "He then marched to strike Chenliu, Waihuang, and Suiyang, taking them.",
      "idiomatic": "He marched on Chenliu, Waihuang, and Suiyang, capturing them all."
    },
    {
      "id": "s0394",
      "chinese": "士卒半渡，漢擊之，大破楚軍，盡得楚國金玉貨賂。",
      "literal": "When half the officers and troops had crossed, Han struck them, greatly broke the Chu army, and completely obtained all Chu's gold, jade, wealth, and bribes.",
      "idiomatic": "When half the soldiers had crossed, Han attacked, routing the Chu army and seizing all their gold, jade, treasures, and valuables."
    },
    {
      "id": "s0395",
      "chinese": "大司馬咎、長史欣皆自剄汜水上。",
      "literal": "Grand Marshal Jiu and Chief Clerk Xin both slit their own throats at the Fan River.",
      "idiomatic": "Grand Marshal Jiu and Chief Clerk Xin both committed suicide by the Fan River."
    },
    {
      "id": "s0399",
      "chinese": "漢王欲攻之。",
      "literal": "The King of Han wished to attack him.",
      "idiomatic": "The King of Han wanted to attack him."
    },
    {
      "id": "s0401",
      "chinese": "乃遣張良操印綬立韓信為齊王。",
      "literal": "He then dispatched Zhang Liang bearing the seal and ribbons to install Han Xin as King of Qi.",
      "idiomatic": "He sent Zhang Liang with the royal seal and sashes to install Han Xin as King of Qi."
    },
    {
      "id": "s0403",
      "chinese": "韓信不聽。",
      "literal": "Han Xin would not listen.",
      "idiomatic": "Han Xin refused."
    },
    {
      "id": "s0405",
      "chinese": "漢王項羽相與臨廣武之閒而語。",
      "literal": "The King of Han and Xiang Yu faced each other between Guangwu and spoke.",
      "idiomatic": "The King of Han and Xiang Yu stood facing each other across the Guangwu River and spoke."
    },
    {
      "id": "s0406",
      "chinese": "項羽欲與漢王獨身挑戰。",
      "literal": "Xiang Yu wished to challenge the King of Han to single combat.",
      "idiomatic": "Xiang Yu wanted to challenge the King of Han to personal combat."
    },
    {
      "id": "s0408",
      "chinese": "秦項羽矯殺卿子冠軍而自尊，罪二。",
      "literal": "Xiang Yu falsely killed Lord Superior to Ministers and exalted himself—crime two.",
      "idiomatic": "Xiang Yu falsely executed Lord Superior to Ministers and exalted himself—crime two."
    },
    {
      "id": "s0411",
      "chinese": "又彊殺秦降王子嬰，罪五。",
      "literal": "He also forcibly killed the surrendered King of Qin, Ziying—crime five.",
      "idiomatic": "He also brutally murdered the surrendered King of Qin, Ziying—crime five."
    },
    {
      "id": "s0412",
      "chinese": "詐阬秦子弟新安二十萬，王其將，罪六。",
      "literal": "He deceitfully buried alive two hundred thousand Qin sons and younger brothers at Xin'an and made their generals kings—crime six.",
      "idiomatic": "He deceitfully massacred 200,000 Qin soldiers at Xin'an by burying them alive, then enfeoffed their generals—crime six."
    },
    {
      "id": "s0415",
      "chinese": "項羽使人陰弒義帝江南，罪九。",
      "literal": "Xiang Yu sent men to secretly assassinate the Righteous Emperor south of the Yangtze—crime nine.",
      "idiomatic": "Xiang Yu sent assassins to murder the Righteous Emperor south of the Yangtze—crime nine."
    },
    {
      "id": "s0422",
      "chinese": "病愈，西入關，至櫟陽，存問父老，置酒，梟故塞王欣頭櫟陽市。",
      "literal": "When his illness improved, he went west into the passes, reached Liyang, inquired after the elders, held a banquet, and displayed the former King of Sai Xin's severed head in the Liyang marketplace.",
      "idiomatic": "Once recovered, he marched west through the passes to Liyang, visited the elders, held a banquet, and had the former King of Sai Xin's head displayed in the marketplace."
    },
    {
      "id": "s0423",
      "chinese": "留四日，復如軍，軍廣武。",
      "literal": "He remained four days, then returned to the army and encamped at Guangwu.",
      "idiomatic": "He stayed four days, then returned to his army and made camp at Guangwu."
    },
    {
      "id": "s0424",
      "chinese": "關中兵益出。",
      "literal": "Troops from within the passes increasingly came out.",
      "idiomatic": "More troops kept emerging from within the passes."
    },
    {
      "id": "s0425",
      "chinese": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。",
      "literal": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
      "idiomatic": "At this time, Peng Yue commanded troops based in Liang territory, constantly raiding Chu forces and severing their supply lines."
    },
    {
      "id": "s0426",
      "chinese": "田橫往從之。",
      "literal": "Tian Heng went to join him.",
      "idiomatic": "Tian Heng went to join his cause."
    },
    {
      "id": "s0428",
      "chinese": "項羽恐，乃與漢王約，中分天下，割鴻溝而西者為漢，鴻溝而東者為楚。",
      "literal": "Xiang Yu was afraid and then made an agreement with the King of Han to divide all under Heaven in the middle: those west of the Hong Canal would be Han, those east of the Hong Canal would be Chu.",
      "idiomatic": "Terrified, Xiang Yu negotiated a truce with the King of Han, dividing the empire along the Hong Canal: west would be Han, east would be Chu."
    },
    {
      "id": "s0430",
      "chinese": "項羽解而東歸。",
      "literal": "Xiang Yu was released and returned eastward.",
      "idiomatic": "Xiang Yu was set free and headed back east."
    },
    {
      "id": "s0432",
      "chinese": "至固陵，不會。",
      "literal": "Reaching Guling, they did not meet.",
      "idiomatic": "When they reached Guling, the meeting never happened."
    },
    {
      "id": "s0433",
      "chinese": "楚擊漢軍，大破之。",
      "literal": "Chu struck the Han army and greatly broke them.",
      "idiomatic": "Chu attacked the Han army and routed it completely."
    },
    {
      "id": "s0434",
      "chinese": "漢王復入壁，深塹而守之。",
      "literal": "The King of Han again entered his ramparts, dug deep trenches, and defended.",
      "idiomatic": "The King of Han retreated behind his fortifications, dug deep trenches, and held his position."
    },
    {
      "id": "s0435",
      "chinese": "用張良計，於是韓信、彭越皆往。",
      "literal": "Using Zhang Liang's plan, thereupon Han Xin and Peng Yue both went.",
      "idiomatic": "Following Zhang Liang's strategy, Han Xin and Peng Yue both arrived."
    },
    {
      "id": "s0437",
      "chinese": "立武王布為淮南王。",
      "literal": "He installed King Wu Bu as King of Huainan.",
      "idiomatic": "He installed King Wu Bu as King of Huainan."
    },
    {
      "id": "s0438",
      "chinese": "五年，高祖與諸侯兵共擊楚軍，與項羽決勝垓下。",
      "literal": "In the fifth year, Gao Zu together with the feudal lords' troops jointly struck the Chu army and decided victory with Xiang Yu at Gaixia.",
      "idiomatic": "In the fifth year, Gao Zu joined forces with the feudal lords to attack the Chu army and settle matters with Xiang Yu at Gaixia."
    },
    {
      "id": "s0440",
      "chinese": "項羽之卒可十萬。",
      "literal": "Xiang Yu's troops numbered about a hundred thousand.",
      "idiomatic": "Xiang Yu had around 100,000 troops."
    },
    {
      "id": "s0441",
      "chinese": "淮陰先合，不利，卻。",
      "literal": "Huaiyin first engaged, went unfavorably, and retreated.",
      "idiomatic": "Huaiyin engaged first but fared poorly and withdrew."
    },
    {
      "id": "s0444",
      "chinese": "使騎將灌嬰追殺項羽東城，斬首八萬，遂略定楚地。",
      "literal": "He sent cavalry general Guan Ying to pursue and kill Xiang Yu at Dongcheng, behead eighty thousand, and then take and settle the lands of Chu.",
      "idiomatic": "He sent cavalry general Guan Ying to pursue and kill Xiang Yu at Dongcheng, taking 80,000 heads, then conquered and pacified Chu territory."
    },
    {
      "id": "s0445",
      "chinese": "魯為楚堅守不下。",
      "literal": "Lu firmly defended for Chu and would not surrender.",
      "idiomatic": "Lu held out staunchly for Chu and refused to surrender."
    },
    {
      "id": "s0447",
      "chinese": "遂以魯公號葬項羽穀城。",
      "literal": "They then buried Xiang Yu at Gucheng with the rites of Duke of Lu.",
      "idiomatic": "They buried Xiang Yu at Gucheng with the honors due a Duke of Lu."
    },
    {
      "id": "s0448",
      "chinese": "還至定陶，馳入齊王壁，奪其軍。",
      "literal": "Returning to reach Dingtao, he galloped into the King of Qi's encampment and seized his army.",
      "idiomatic": "Upon returning to Dingtao, he charged into the King of Qi's camp and took command of his army."
    },
    {
      "id": "s0449",
      "chinese": "正月，諸侯及將相相與共請尊漢王為皇帝。",
      "literal": "In the first month, the feudal lords and generals and ministers together jointly requested to honor the King of Han as Emperor.",
      "idiomatic": "In the first month, the feudal lords and high officials jointly petitioned to honor the King of Han as Emperor."
    },
    {
      "id": "s0452",
      "chinese": "大王不尊號，皆疑不信。",
      "literal": "If great king not take honored title, all doubt not believe.",
      "idiomatic": "If Your Majesty does not accept the imperial title, everyone will remain suspicious and distrustful."
    },
    {
      "id": "s0455",
      "chinese": "甲午，乃即皇帝位汜水之陽。",
      "literal": "On the jiawu day, he then assumed the position of Emperor north of the Fan River.",
      "idiomatic": "On the jiawu day, he ascended the imperial throne north of the Fan River."
    },
    {
      "id": "s0456",
      "chinese": "皇帝曰義帝無後。",
      "literal": "The Emperor said the Righteous Emperor had no descendants.",
      "idiomatic": "The Emperor declared that the Righteous Emperor had no heirs."
    },
    {
      "id": "s0457",
      "chinese": "齊王韓信習楚風俗，徙為楚王，都下邳。",
      "literal": "King Han Xin of Qi was familiar with Chu customs and was moved to be King of Chu, with his capital at Xiapei.",
      "idiomatic": "Since King Han Xin of Qi was familiar with Chu customs, he was transferred to become King of Chu with his capital at Xiapei."
    },
    {
      "id": "s0458",
      "chinese": "立建成侯彭越為梁王，都定陶。",
      "literal": "He installed Marquis of Jiancheng Peng Yue as King of Liang, with his capital at Dingtao.",
      "idiomatic": "He installed Marquis of Jiancheng Peng Yue as King of Liang with his capital at Dingtao."
    },
    {
      "id": "s0459",
      "chinese": "故韓王信為韓王，都陽翟。",
      "literal": "The former King Xin of Han remained King of Han, with his capital at Yangzhai.",
      "idiomatic": "The former King Xin of Han remained as King of Han with his capital at Yangzhai."
    },
    {
      "id": "s0460",
      "chinese": "徙衡山王吳芮為長沙王，都臨湘。",
      "literal": "He moved King Wu Rui of Hengshan to be King of Changsha, with his capital at Linxiang.",
      "idiomatic": "He transferred King Wu Rui of Hengshan to become King of Changsha with his capital at Linxiang."
    },
    {
      "id": "s0462",
      "chinese": "淮南王布、燕王臧荼、趙王敖皆如故。",
      "literal": "King Bu of Huainan, King Zang Tu of Yan, and King Ao of Zhao all remained as before.",
      "idiomatic": "King Bu of Huainan, King Zang Tu of Yan, and King Ao of Zhao all kept their positions unchanged."
    },
    {
      "id": "s0463",
      "chinese": "天下大定。",
      "literal": "All under Heaven was greatly settled.",
      "idiomatic": "The empire was now firmly established."
    },
    {
      "id": "s0466",
      "chinese": "數月而降，殺之雒陽。",
      "literal": "After several months he surrendered and they killed him at Luoyang.",
      "idiomatic": "After several months he surrendered, and they executed him at Luoyang."
    },
    {
      "id": "s0467",
      "chinese": "五月，兵皆罷歸家。",
      "literal": "In the fifth month, all troops were dismissed to return home.",
      "idiomatic": "In the fifth month, all troops were disbanded and sent home."
    },
    {
      "id": "s0469",
      "chinese": "高祖置酒雒陽南宮。",
      "literal": "Gao Zu held a banquet at the Southern Palace of Luoyang.",
      "idiomatic": "Gao Zu hosted a banquet at the Southern Palace in Luoyang."
    },
    {
      "id": "s0471",
      "chinese": "吾所以有天下者何？",
      "literal": "Why is it that I possess all under Heaven?",
      "idiomatic": "How did I come to rule the empire?"
    },
    {
      "id": "s0484",
      "chinese": "六月，大赦天下。",
      "literal": "In the sixth month, they granted a great amnesty to all under Heaven.",
      "idiomatic": "In the sixth month, a general amnesty was declared throughout the empire."
    },
    {
      "id": "s0485",
      "chinese": "十月，燕王臧荼反，攻下代地。",
      "literal": "In the tenth month, King Zang Tu of Yan rebelled and attacked and took the land of Dai.",
      "idiomatic": "In the tenth month, King Zang Tu of Yan rebelled and conquered the territory of Dai."
    },
    {
      "id": "s0486",
      "chinese": "高祖自將擊之，得燕王臧荼。",
      "literal": "Gao Zu personally commanded to strike him and captured King Zang Tu of Yan.",
      "idiomatic": "Gao Zu personally led the attack and captured King Zang Tu of Yan."
    },
    {
      "id": "s0487",
      "chinese": "即立太尉盧綰為燕王。",
      "literal": "He immediately installed Grand Commandant Lu Wan as King of Yan.",
      "idiomatic": "He immediately installed Grand Commandant Lu Wan as King of Yan."
    },
    {
      "id": "s0488",
      "chinese": "使丞相噲將兵攻代。",
      "literal": "He sent Prime Minister Kuai to lead troops to attack Dai.",
      "idiomatic": "He sent Prime Minister Kuai to lead an army against Dai."
    },
    {
      "id": "s0490",
      "chinese": "利幾者，項氏之將。",
      "literal": "Li Ji was a general of the Xiang clan.",
      "idiomatic": "Li Ji was one of Xiang Yu's generals."
    },
    {
      "id": "s0493",
      "chinese": "六年，高祖五日一朝太公，如家人父子禮。",
      "literal": "In the sixth year, Gao Zu every five days would have an audience with the Grand Duke, following the rites of father and son in an ordinary family.",
      "idiomatic": "In the sixth year, Gao Zu would visit his father every five days, treating him with the simple respect of father and son in a common family."
    },
    {
      "id": "s0499",
      "chinese": "後高祖朝，太公擁篲，迎門卻行。",
      "literal": "Later when Gao Zu came to audience, the Grand Duke held a broom, welcomed him at the gate, and walked backward.",
      "idiomatic": "Later when Gao Zu came for an audience, his father greeted him at the gate holding a broom and backed away respectfully."
    },
    {
      "id": "s0500",
      "chinese": "高祖大驚，下扶太公。",
      "literal": "Gao Zu was greatly shocked and got down to support the Grand Duke.",
      "idiomatic": "Gao Zu was horrified and dismounted to help his father up."
    },
    {
      "id": "s0502",
      "chinese": "於是高祖乃尊太公為太上皇。",
      "literal": "Thereupon Gao Zu then honored the Grand Duke as Grand Supreme Sovereign.",
      "idiomatic": "Thereupon Gao Zu honored his father as the Supreme Retired Emperor."
    },
    {
      "id": "s0506",
      "chinese": "是日，大赦天下。",
      "literal": "That day, they granted a great amnesty to all under Heaven.",
      "idiomatic": "That day, a general amnesty was declared throughout the empire."
    },
    {
      "id": "s0508",
      "chinese": "秦，形勝之國，帶河山之險，縣隔千里，持戟百萬，秦得百二焉。",
      "literal": "Qin is a state of natural advantage, girded by the dangers of rivers and mountains, separated by a thousand li, wielding a million halberds—Qin obtains a hundred to two advantage.",
      "idiomatic": "Qin is a naturally fortified state, protected by perilous rivers and mountains, spanning a thousand li, with a million soldiers under arms—Qin enjoys a 50-to-1 advantage."
    },
    {
      "id": "s0510",
      "chinese": "夫齊，東有瑯邪、即墨之饒，南有泰山之固，西有濁河之限，北有勃海之利。",
      "literal": "As for Qi, to the east it has the wealth of Langye and Jimo, to the south the stronghold of Mount Tai, to the west the barrier of the Turbid River, to the north the benefits of the Bohai.",
      "idiomatic": "As for Qi, to the east it has the riches of Langye and Jimo, to the south the impregnable Mount Tai, to the west the barrier of the muddy Yellow River, to the north the bounty of Bohai Bay."
    },
    {
      "id": "s0511",
      "chinese": "地方二千里，持戟百萬，縣隔千里之外，齊得十二焉。",
      "literal": "Its territory is two thousand li square, wielding a million halberds, separated a thousand li away—Qi obtains a ten to two advantage.",
      "idiomatic": "Its territory spans 2,000 square li, with a million soldiers, and lies a thousand li distant—Qi enjoys a 5-to-1 advantage."
    },
    {
      "id": "s0512",
      "chinese": "故此東西秦也。",
      "literal": "Therefore this is the eastern Qin.",
      "idiomatic": "Therefore Qi is another Qin in the east."
    },
    {
      "id": "s0515",
      "chinese": "賜黃金五百斤。",
      "literal": "He bestowed five hundred jin of gold.",
      "idiomatic": "He awarded him 500 jin of gold."
    },
    {
      "id": "s0516",
      "chinese": "後十餘日，封韓信為淮陰侯，分其地為二國。",
      "literal": "After over ten days, he enfeoffed Han Xin as Marquis of Huaiyin and divided his territory into two states.",
      "idiomatic": "More than ten days later, he enfeoffed Han Xin as Marquis of Huaiyin and split his territory into two kingdoms."
    },
    {
      "id": "s0518",
      "chinese": "弟交為楚王，王淮西。",
      "literal": "His younger brother Jiao became King of Chu, ruling west of the Huai.",
      "idiomatic": "His younger brother Jiao became King of Chu, ruling the area west of the Huai River."
    },
    {
      "id": "s0519",
      "chinese": "子肥為齊王，王七十餘城，民能齊言者皆屬齊。",
      "literal": "His son Fei became King of Qi, ruling over seventy cities; all people who could speak the Qi language belonged to Qi.",
      "idiomatic": "His son Fei became King of Qi, ruling over 70 cities; all people who spoke the Qi dialect were assigned to Qi."
    },
    {
      "id": "s0520",
      "chinese": "乃論功，與諸列侯剖符行封。",
      "literal": "He then evaluated merits and with all the ranked marquises divided tallies and carried out enfeoffments.",
      "idiomatic": "He then assessed everyone's merits and granted fiefs to the marquises, dividing the tally tallies as proof."
    },
    {
      "id": "s0521",
      "chinese": "徙韓王信太原。",
      "literal": "He moved King Xin of Han to Taiyuan.",
      "idiomatic": "He transferred King Xin of Han to Taiyuan."
    },
    {
      "id": "s0522",
      "chinese": "七年，匈奴攻韓王信馬邑，信因與謀反太原。",
      "literal": "In the seventh year, the Xiongnu attacked King Xin of Han at Mayi; Xin consequently plotted rebellion with them at Taiyuan.",
      "idiomatic": "In the seventh year, the Xiongnu attacked King Xin of Han at Mayi; Xin took this opportunity to plot rebellion with them at Taiyuan."
    },
    {
      "id": "s0523",
      "chinese": "白土曼丘臣、王黃立故趙將趙利為王以反，高祖自往擊之。",
      "literal": "Man Qiu Chen of Baitu and Wang Huang installed the former Zhao general Zhao Li as king to rebel; Gao Zu personally went to strike them.",
      "idiomatic": "Man Qiu Chen of Baitu and Wang Huang set up the former Zhao general Zhao Li as king to rebel; Gao Zu personally went to attack them."
    },
    {
      "id": "s0524",
      "chinese": "會天寒，士卒墮指者什二三，遂至平城。",
      "literal": "Meeting cold weather, two or three out of ten officers and troops lost fingers; they then reached Pingcheng.",
      "idiomatic": "They encountered bitterly cold weather, and 20-30% of the soldiers suffered frostbite and lost fingers; they finally reached Pingcheng."
    },
    {
      "id": "s0525",
      "chinese": "匈奴圍我平城，七日而後罷去。",
      "literal": "The Xiongnu surrounded us at Pingcheng for seven days before withdrawing.",
      "idiomatic": "The Xiongnu besieged us at Pingcheng for seven days before finally withdrawing."
    },
    {
      "id": "s0526",
      "chinese": "令樊噲止定代地。",
      "literal": "He ordered Fan Kuai to remain and settle the land of Dai.",
      "idiomatic": "He ordered Fan Kuai to stay behind and pacify the territory of Dai."
    },
    {
      "id": "s0527",
      "chinese": "立兄劉仲為代王。",
      "literal": "He installed his elder brother Liu Zhong as King of Dai.",
      "idiomatic": "He installed his elder brother Liu Zhong as King of Dai."
    },
    {
      "id": "s0528",
      "chinese": "二月，高祖自平城過趙、雒陽，至長安。",
      "literal": "In the second month, Gao Zu from Pingcheng passed through Zhao and Luoyang and reached Chang'an.",
      "idiomatic": "In the second month, Gao Zu traveled from Pingcheng through Zhao and Luoyang to reach Chang'an."
    },
    {
      "id": "s0529",
      "chinese": "長樂宮成，丞相已下徙治長安。",
      "literal": "Changle Palace was completed; the prime minister and below moved to govern at Chang'an.",
      "idiomatic": "Changle Palace was completed; the prime minister and all officials below him moved their administration to Chang'an."
    },
    {
      "id": "s0530",
      "chinese": "八年，高祖東擊韓王信餘反寇於東垣。",
      "literal": "In the eighth year, Gao Zu went east to strike the remaining rebel bandits of King Xin of Han at Dongyuan.",
      "idiomatic": "In the eighth year, Gao Zu marched east to crush the remaining rebel forces of King Xin of Han at Dongyuan."
    },
    {
      "id": "s0531",
      "chinese": "蕭丞相營作未央宮，立東闕、北闕、前殿、武庫、太倉。",
      "literal": "Prime Minister Xiao constructed Weiyang Palace, establishing the Eastern Tower, Northern Tower, Front Hall, Armory, and Great Granary.",
      "idiomatic": "Prime Minister Xiao oversaw the construction of Weiyang Palace, including the Eastern Gate Tower, Northern Gate Tower, Front Hall, Armory, and Great Granary."
    },
    {
      "id": "s0535",
      "chinese": "高祖乃說。",
      "literal": "Gao Zu was then pleased.",
      "idiomatic": "Gao Zu was greatly pleased."
    },
    {
      "id": "s0536",
      "chinese": "高祖之東垣，過柏人，趙相貫高等謀弒高祖，高祖心動，因不留。",
      "literal": "When Gao Zu went to Dongyuan and passed through Bairen, Zhao Prime Minister Guan Gao and others plotted to assassinate Gao Zu; Gao Zu's heart was stirred and consequently he did not remain.",
      "idiomatic": "As Gao Zu traveled to Dongyuan and passed through Bairen, Zhao Prime Minister Guan Gao and others plotted to assassinate him; Gao Zu had a premonition and pressed on without stopping."
    },
    {
      "id": "s0537",
      "chinese": "代王劉仲棄國亡，自歸雒陽，廢以為合陽侯。",
      "literal": "King Liu Zhong of Dai abandoned his state and fled, returning on his own to Luoyang; he was demoted to be Marquis of Heyang.",
      "idiomatic": "King Liu Zhong of Dai abandoned his kingdom and fled, surrendering himself at Luoyang; he was demoted to Marquis of Heyang."
    },
    {
      "id": "s0538",
      "chinese": "九年，趙相貫高等事發覺，夷三族。",
      "literal": "In the ninth year, the affair of Zhao Prime Minister Guan Gao and others was discovered; their three clans were exterminated.",
      "idiomatic": "In the ninth year, the plot by Zhao Prime Minister Guan Gao and others was uncovered; their entire clans were wiped out."
    },
    {
      "id": "s0539",
      "chinese": "廢趙王敖為宣平侯。",
      "literal": "They demoted King Ao of Zhao to be Marquis of Xuanping.",
      "idiomatic": "They stripped King Ao of Zhao of his title and made him Marquis of Xuanping."
    },
    {
      "id": "s0540",
      "chinese": "是歲，徙貴族楚昭、屈、景、懷、齊田氏關中。",
      "literal": "That year, they relocated noble clans—the Zhao, Qu, Jing, and Huai of Chu, and the Tian clan of Qi—to Guanzhong.",
      "idiomatic": "That year, they relocated noble clans—the Zhao, Qu, Jing, and Huai families of Chu, and the Tian clan of Qi—to Guanzhong."
    },
    {
      "id": "s0541",
      "chinese": "未央宮成。",
      "literal": "Weiyang Palace was completed.",
      "idiomatic": "Weiyang Palace was completed."
    },
    {
      "id": "s0542",
      "chinese": "高祖大朝諸侯群臣，置酒未央前殿。",
      "literal": "Gao Zu held a great court with the feudal lords and assembled ministers and held a banquet in the front hall of Weiyang.",
      "idiomatic": "Gao Zu held a grand court audience with all the feudal lords and ministers, hosting a banquet in the front hall of Weiyang Palace."
    },
    {
      "id": "s0545",
      "chinese": "殿上群臣皆呼萬歲，大笑為樂。",
      "literal": "All the assembled ministers in the hall shouted 'Long live!' and laughed greatly in merriment.",
      "idiomatic": "All the ministers assembled in the hall shouted 'Long live the Emperor!' and roared with laughter in high spirits."
    },
    {
      "id": "s0546",
      "chinese": "十年十月，淮南王黥布、梁王彭越、燕王盧綰、荊王劉賈、楚王劉交、齊王劉肥、長沙王吳芮皆來朝長樂宮。",
      "literal": "In the tenth month of the tenth year, King Bu of Huainan, King Peng Yue of Liang, King Lu Wan of Yan, King Liu Jia of Jing, King Liu Jiao of Chu, King Liu Fei of Qi, and King Wu Rui of Changsha all came to court at Changle Palace.",
      "idiomatic": "In the tenth month of the tenth year, King Bu of Huainan, King Peng Yue of Liang, King Lu Wan of Yan, King Liu Jia of Jing, King Liu Jiao of Chu, King Liu Fei of Qi, and King Wu Rui of Changsha all came to pay court at Changle Palace."
    },
    {
      "id": "s0547",
      "chinese": "春夏無事。",
      "literal": "In spring and summer there were no events.",
      "idiomatic": "Spring and summer passed uneventfully."
    },
    {
      "id": "s0548",
      "chinese": "七月，太上皇崩櫟陽宮。",
      "literal": "In the seventh month, the Grand Supreme Sovereign died at Liyang Palace.",
      "idiomatic": "In the seventh month, the Supreme Retired Emperor passed away at Liyang Palace."
    },
    {
      "id": "s0549",
      "chinese": "楚王、梁王皆來送葬。",
      "literal": "The King of Chu and King of Liang both came to attend the funeral.",
      "idiomatic": "The King of Chu and King of Liang both came to attend the funeral rites."
    },
    {
      "id": "s0550",
      "chinese": "赦櫟陽囚。",
      "literal": "They pardoned prisoners of Liyang.",
      "idiomatic": "All prisoners in Liyang were granted amnesty."
    },
    {
      "id": "s0551",
      "chinese": "更命酈邑曰新豐。",
      "literal": "They renamed Li township as Xinfeng.",
      "idiomatic": "They renamed Li township to Xinfeng."
    },
    {
      "id": "s0552",
      "chinese": "八月，趙相國陳豨反代地。",
      "literal": "In the eighth month, Zhao Prime Minister Chen Xi rebelled in the land of Dai.",
      "idiomatic": "In the eighth month, Zhao Prime Minister Chen Xi rose in rebellion in Dai territory."
    },
    {
      "id": "s0555",
      "chinese": "代地吏民非有罪也。",
      "literal": "The officials and people of the land of Dai are not guilty.",
      "idiomatic": "The officials and people of Dai territory bear no guilt."
    },
    {
      "id": "s0557",
      "chinese": "九月，上自東往擊之。",
      "literal": "In the ninth month, the superior personally went east to strike him.",
      "idiomatic": "In the ninth month, His Majesty personally marched east to attack him."
    },
    {
      "id": "s0572",
      "chinese": "立子恢為梁王，子友為淮陽王。",
      "literal": "He installed his son Hui as King of Liang and his son You as King of Huaiyang.",
      "idiomatic": "He installed his son Hui as King of Liang and his son You as King of Huaiyang."
    },
    {
      "id": "s0575",
      "chinese": "立子長為淮南王。",
      "literal": "He installed his son Chang as King of Huainan.",
      "idiomatic": "He installed his son Chang as King of Huainan."
    }
  ]
}