{
  "chapter": "008",
  "book": "shiji",
  "extractedAt": "2026-01-18T05:05:05.918Z",
  "translations": [
    {
      "id": "s0001",
      "type": "paragraph",
      "chinese": "高祖，沛豐邑中陽裏人，姓劉氏，字季。",
      "literal": "Gao Zu was from Zhongyangli in Feng township, Pei, with the surname Liu and given name Ji.",
      "idiomatic": "Emperor Gaozu was born in Zhongyang Village, Feng Township, Pei County. His surname was Liu, and his given name was Ji.",
      "context": {
        "next": "父曰太公，母曰劉媼。"
      }
    },
    {
      "id": "s0002",
      "type": "paragraph",
      "chinese": "父曰太公，母曰劉媼。",
      "literal": "His father was called the Grand Duke; his mother was called Dame Liu.",
      "idiomatic": "His father was known as the Grand Duke, and his mother as Dame Liu.",
      "context": {
        "previous": "高祖，沛豐邑中陽裏人，姓劉氏，字季。",
        "next": "其先劉媼嘗息大澤之陂，夢與神遇。"
      }
    },
    {
      "id": "s0003",
      "type": "paragraph",
      "chinese": "其先劉媼嘗息大澤之陂，夢與神遇。",
      "literal": "Previously his mother Dame Liu was resting by the embankment of a great marsh and dreamed she encountered a spirit.",
      "idiomatic": "Earlier, his mother Dame Liu had been resting by the dike of a great marsh when she dreamed she encountered a spirit.",
      "context": {
        "previous": "父曰太公，母曰劉媼。",
        "next": "是時雷電晦冥，太公往視，則見蛟龍於其上。"
      }
    },
    {
      "id": "s0004",
      "type": "paragraph",
      "chinese": "是時雷電晦冥，太公往視，則見蛟龍於其上。",
      "literal": "At that time there was thunder and lightning with darkness; the Grand Duke went to look and saw a scaly dragon above her.",
      "idiomatic": "At that moment, thunder crashed and lightning flashed in the darkness. The Grand Duke went to check and saw a horned dragon hovering above her.",
      "context": {
        "previous": "其先劉媼嘗息大澤之陂，夢與神遇。",
        "next": "已而有身，遂產高祖。"
      }
    },
    {
      "id": "s0005",
      "type": "paragraph",
      "chinese": "已而有身，遂產高祖。",
      "literal": "Soon after she became pregnant and gave birth to Gao Zu.",
      "idiomatic": "Soon after, she became pregnant and gave birth to Emperor Gaozu.",
      "context": {
        "previous": "是時雷電晦冥，太公往視，則見蛟龍於其上。"
      }
    },
    {
      "id": "s0006",
      "type": "paragraph",
      "chinese": "高祖為人，隆準而龍顏，美須髯，左股有七十二黑子。",
      "literal": "Gao Zu as a person had a high-bridged nose and dragon-like countenance, fine whiskers and beard, and seventy-two black moles on his left thigh.",
      "idiomatic": "Emperor Gaozu had a high-bridged nose and dragon-like features, with fine whiskers and beard. On his left thigh were seventy-two black moles.",
      "context": {
        "next": "仁而愛人，喜施，意豁如也。"
      }
    },
    {
      "id": "s0007",
      "type": "paragraph",
      "chinese": "仁而愛人，喜施，意豁如也。",
      "literal": "He was benevolent and loved people, delighted in giving, and his spirit was open and expansive.",
      "idiomatic": "He was benevolent and loved people, took delight in generosity, and had an open, expansive spirit.",
      "context": {
        "previous": "高祖為人，隆準而龍顏，美須髯，左股有七十二黑子。",
        "next": "常有大度，不事家人生產作業。"
      }
    },
    {
      "id": "s0008",
      "type": "paragraph",
      "chinese": "常有大度，不事家人生產作業。",
      "literal": "He always had a generous nature and did not attend to his family's productive work.",
      "idiomatic": "He always had a generous disposition and paid no attention to his family's farming and labor.",
      "context": {
        "previous": "仁而愛人，喜施，意豁如也。",
        "next": "及壯，試為吏，為泗水亭長，廷中吏無所不狎侮，好酒及色。"
      }
    },
    {
      "id": "s0009",
      "type": "paragraph",
      "chinese": "及壯，試為吏，為泗水亭長，廷中吏無所不狎侮，好酒及色。",
      "literal": "When he grew up, he tested for official service and became Pavilion Head of Sishui; among the clerks of the court there was none he did not treat familiarly or make sport of; he loved wine and women.",
      "idiomatic": "When he came of age, he took the civil service exam and became Pavilion Chief of Sishui County. Among the court clerks, there was none he didn't treat familiarly or tease. He loved wine and women.",
      "context": {
        "previous": "常有大度，不事家人生產作業。",
        "next": "常從王媼、武負貰酒，醉臥，武負、王媼見其上常有龍，怪之。"
      }
    },
    {
      "id": "s0010",
      "type": "paragraph",
      "chinese": "常從王媼、武負貰酒，醉臥，武負、王媼見其上常有龍，怪之。",
      "literal": "He often bought wine on credit from Dame Wang and Wu Fu; when drunk and lying down, Wu Fu and Dame Wang saw that above him there was always a dragon—they found this strange.",
      "idiomatic": "He often bought wine on credit from Dame Wang and Wu Fu. When drunk and lying down, Wu Fu and Dame Wang saw a dragon always hovering above him—they found this very strange.",
      "context": {
        "previous": "及壯，試為吏，為泗水亭長，廷中吏無所不狎侮，好酒及色。",
        "next": "高祖每酤留飲，酒讎數倍。"
      }
    },
    {
      "id": "s0011",
      "type": "paragraph",
      "chinese": "高祖每酤留飲，酒讎數倍。",
      "literal": "Whenever Gao Zu bought and lingered drinking, the wine debt would be multiplied several times.",
      "idiomatic": "Whenever Emperor Gaozu bought wine and lingered drinking, his tab would multiply several times over.",
      "context": {
        "previous": "常從王媼、武負貰酒，醉臥，武負、王媼見其上常有龍，怪之。",
        "next": "及見怪，歲竟，此兩家常折券棄責。"
      }
    },
    {
      "id": "s0012",
      "type": "paragraph",
      "chinese": "及見怪，歲竟，此兩家常折券棄責。",
      "literal": "When they saw these strange signs, at year's end these two households would always tear up the debt markers and forgive the debt.",
      "idiomatic": "But when they saw these strange signs, at year's end both households would tear up the IOUs and forgive his debts.",
      "context": {
        "previous": "高祖每酤留飲，酒讎數倍。"
      }
    },
    {
      "id": "s0013",
      "type": "paragraph",
      "chinese": "高祖常繇咸陽，縱觀，觀秦皇帝，喟然太息曰：「嗟乎，大丈夫當如此也！」",
      "literal": "Gao Zu once went on corvée duty to Xianyang and took the opportunity to observe; seeing the Emperor of Qin, he sighed deeply and said: \"Ah, a great man should be like this!\"",
      "idiomatic": "Emperor Gaozu once went on corvée labor to Xianyang and took the chance to observe the sights. When he saw the Emperor of Qin, he sighed deeply and said: 'Ah, a true man should be like this!'",
      "context": {}
    },
    {
      "id": "s0015",
      "type": "paragraph",
      "chinese": "單父人呂公善沛令，避仇從之客，因家沛焉。",
      "literal": "Lü Gong of Shanfu was on good terms with the Pei magistrate; fleeing from a vendetta he came to lodge with him and consequently made his home in Pei.",
      "idiomatic": "Lü Gong of Shanfu was on good terms with the Pei county magistrate. Fleeing a feud, he came to stay with him and eventually settled in Pei.",
      "context": {
        "next": "沛中豪桀吏聞令有重客，皆往賀。"
      }
    },
    {
      "id": "s0016",
      "type": "paragraph",
      "chinese": "沛中豪桀吏聞令有重客，皆往賀。",
      "literal": "The heroic gentlemen and officials of Pei heard that the magistrate had an important guest and all went to offer congratulations.",
      "idiomatic": "The local worthies and officials of Pei heard the magistrate had an important guest and all came to offer congratulations.",
      "context": {
        "previous": "單父人呂公善沛令，避仇從之客，因家沛焉。",
        "next": "蕭何為主吏，主進，令諸大夫曰：「進不滿千錢，坐之堂下。」"
      }
    },
    {
      "id": "s0017",
      "type": "paragraph",
      "chinese": "蕭何為主吏，主進，令諸大夫曰：「進不滿千錢，坐之堂下。」",
      "literal": "Xiao He was the supervising clerk in charge of reception; he issued orders to all the gentlemen saying: \"Those whose gifts are less than a thousand cash shall sit in the lower hall.\"",
      "idiomatic": "Xiao He, as chief clerk overseeing the reception, issued orders to all the gentlemen: 'Those whose congratulatory gifts are less than a thousand cash shall sit in the lower hall.'",
      "context": {
        "previous": "沛中豪桀吏聞令有重客，皆往賀。",
        "next": "高祖為亭長，素易諸吏，乃紿為謁曰「賀錢萬」，實不持一錢。"
      }
    },
    {
      "id": "s0018",
      "type": "paragraph",
      "chinese": "高祖為亭長，素易諸吏，乃紿為謁曰「賀錢萬」，實不持一錢。",
      "literal": "Gao Zu as Pavilion Head had always treated the officials casually, so he falsely wrote on his visiting card 'Gift of ten thousand cash,' though he actually carried not a single coin.",
      "idiomatic": "Emperor Gaozu, as pavilion chief, had always treated officials casually. So he boldly wrote on his calling card 'Congratulatory gift: ten thousand cash,' though he actually brought not a single coin.",
      "context": {
        "previous": "蕭何為主吏，主進，令諸大夫曰：「進不滿千錢，坐之堂下。」",
        "next": "謁入，呂公大驚，起，迎之門。"
      }
    },
    {
      "id": "s0019",
      "type": "paragraph",
      "chinese": "謁入，呂公大驚，起，迎之門。",
      "literal": "When the card was sent in, Lü Gong was greatly surprised, rose, and welcomed him at the gate.",
      "idiomatic": "When the calling card was presented, Lü Gong was greatly astonished. He rose and went out to welcome him at the gate.",
      "context": {
        "previous": "高祖為亭長，素易諸吏，乃紿為謁曰「賀錢萬」，實不持一錢。",
        "next": "呂公者，好相人，見高祖狀貌，因重敬之，引入坐。"
      }
    },
    {
      "id": "s0020",
      "type": "paragraph",
      "chinese": "呂公者，好相人，見高祖狀貌，因重敬之，引入坐。",
      "literal": "Lü Gong liked reading people's physiognomy; seeing Gao Zu's appearance, he consequently held him in high regard, invited him in, and seated him.",
      "idiomatic": "Lü Gong was fond of reading physiognomy. Seeing Emperor Gaozu's features, he came to hold him in great respect, invited him inside, and seated him.",
      "context": {
        "previous": "謁入，呂公大驚，起，迎之門。",
        "next": "蕭何曰：「劉季固多大言，少成事。」"
      }
    },
    {
      "id": "s0021",
      "type": "paragraph",
      "chinese": "蕭何曰：「劉季固多大言，少成事。」",
      "literal": "Xiao He said: \"Liu Ji is always full of grand talk but accomplishes little.\"",
      "idiomatic": "Xiao He said: 'Liu Ji is certainly full of big talk but accomplishes little.'",
      "context": {
        "previous": "呂公者，好相人，見高祖狀貌，因重敬之，引入坐。",
        "next": "高祖因狎侮諸客，遂坐上坐，無所詘。"
      }
    },
    {
      "id": "s0022",
      "type": "paragraph",
      "chinese": "高祖因狎侮諸客，遂坐上坐，無所詘。",
      "literal": "Gao Zu then treated the guests familiarly and sat in the seat of honor without any humility.",
      "idiomatic": "Emperor Gaozu then treated all the guests familiarly and took the seat of honor without any deference.",
      "context": {
        "previous": "蕭何曰：「劉季固多大言，少成事。」",
        "next": "酒闌，呂公因目固留高祖。"
      }
    },
    {
      "id": "s0023",
      "type": "paragraph",
      "chinese": "酒闌，呂公因目固留高祖。",
      "literal": "As the banquet ended, Lü Gong signaled with his eyes to firmly detain Gaozu.",
      "idiomatic": "As the banquet drew to a close, Lü Gong signaled with his eyes to keep Gaozu there.",
      "context": {
        "previous": "高祖因狎侮諸客，遂坐上坐，無所詘。",
        "next": "高祖竟酒，後。"
      }
    },
    {
      "id": "s0024",
      "type": "paragraph",
      "chinese": "高祖竟酒，後。",
      "literal": "Gao Zu finished the wine and remained after.",
      "idiomatic": "Emperor Gaozu finished his wine and stayed behind after the others left.",
      "context": {
        "previous": "酒闌，呂公因目固留高祖。",
        "next": "呂公曰：「臣少好相人，相人多矣，無如季相，願季自愛。"
      }
    },
    {
      "id": "s0025",
      "type": "paragraph",
      "chinese": "呂公曰：「臣少好相人，相人多矣，無如季相，願季自愛。",
      "literal": "Lü Gong said: \"I have long liked reading physiognomy and have read many people, but none compare to Ji's; I hope Ji will take care of himself.",
      "idiomatic": "Lü Gong said: 'I have long enjoyed reading physiognomy and have read many people, but none can compare to Ji's features. I hope Ji will take good care of himself.'",
      "context": {
        "previous": "高祖竟酒，後。",
        "next": "臣有息女，願為季箕帚妾。」"
      }
    },
    {
      "id": "s0026",
      "type": "paragraph",
      "chinese": "臣有息女，願為季箕帚妾。」",
      "literal": "I have a daughter and wish her to be Ji's humble wife.\"",
      "idiomatic": "I have a daughter and wish her to be Ji's humble wife.''",
      "context": {
        "previous": "呂公曰：「臣少好相人，相人多矣，無如季相，願季自愛。",
        "next": "酒罷，呂媼怒呂公曰：「公始常欲奇此女，與貴人。"
      }
    },
    {
      "id": "s0027",
      "type": "paragraph",
      "chinese": "酒罷，呂媼怒呂公曰：「公始常欲奇此女，與貴人。",
      "literal": "When the wine ended, Dame Lü was angry at Lü Gong, saying: \"You always wanted to treat this daughter as exceptional and give her to a noble person.",
      "idiomatic": "After the banquet ended, Dame Lü angrily rebuked Lü Gong: 'You always wanted to treat this daughter as special and marry her to a nobleman.'",
      "context": {
        "previous": "臣有息女，願為季箕帚妾。」",
        "next": "沛令善公，求之不與，何自妄許與劉季？」"
      }
    },
    {
      "id": "s0028",
      "type": "paragraph",
      "chinese": "沛令善公，求之不與，何自妄許與劉季？」",
      "literal": "The Pei magistrate is on good terms with you and sought her but you did not give her—why do you rashly promise her to Liu Ji?\"",
      "idiomatic": "The Pei county magistrate is on good terms with you and asked for her, but you refused. Why do you rashly promise her to Liu Ji?''",
      "context": {
        "previous": "酒罷，呂媼怒呂公曰：「公始常欲奇此女，與貴人。",
        "next": "呂公曰：「此非兒女子所知也。」"
      }
    },
    {
      "id": "s0029",
      "type": "paragraph",
      "chinese": "呂公曰：「此非兒女子所知也。」",
      "literal": "Lü Gong said: \"This is not something children and women can understand.\"",
      "idiomatic": "Lü Gong said: 'This is not something for children and women to understand.''",
      "context": {
        "previous": "沛令善公，求之不與，何自妄許與劉季？」",
        "next": "卒與劉季。"
      }
    },
    {
      "id": "s0030",
      "type": "paragraph",
      "chinese": "卒與劉季。",
      "literal": "He finally gave her to Liu Ji.",
      "idiomatic": "In the end, he gave her to Liu Ji.",
      "context": {
        "previous": "呂公曰：「此非兒女子所知也。」",
        "next": "呂公女乃呂后也，生孝惠帝、魯元公主。"
      }
    },
    {
      "id": "s0031",
      "type": "paragraph",
      "chinese": "呂公女乃呂后也，生孝惠帝、魯元公主。",
      "literal": "Lü Gong's daughter was Empress Lü; she gave birth to Emperor Xiaohui and Princess Lu Yuan.",
      "idiomatic": "Lü Gong's daughter became Empress Lü. She gave birth to Emperor Xiaohui and Princess Lu Yuan.",
      "context": {
        "previous": "卒與劉季。"
      }
    },
    {
      "id": "s0032",
      "type": "paragraph",
      "chinese": "高祖為亭長時，常告歸之田。",
      "literal": "When Gao Zu was Pavilion Head, he would often request leave to return to his fields.",
      "idiomatic": "When Emperor Gaozu was pavilion chief, he would often request leave to return to his farm.",
      "context": {
        "next": "呂后與兩子居田中耨，有一老父過請飲，呂后因餔之。"
      }
    },
    {
      "id": "s0033",
      "type": "paragraph",
      "chinese": "呂后與兩子居田中耨，有一老父過請飲，呂后因餔之。",
      "literal": "Empress Lü with her two children were in the fields weeding when an old man passed by and requested a drink; Empress Lü consequently fed him.",
      "idiomatic": "Empress Lü was in the fields weeding with her two children when an old man passed by and asked for a drink. Empress Lü fed him.",
      "context": {
        "previous": "高祖為亭長時，常告歸之田。",
        "next": "老父相呂后曰：「夫人天下貴人。」"
      }
    },
    {
      "id": "s0034",
      "type": "paragraph",
      "chinese": "老父相呂后曰：「夫人天下貴人。」",
      "literal": "The old man read Empress Lü's physiognomy and said: \"Madam will be the most noble person under Heaven.\"",
      "idiomatic": "The old man read Empress Lü's physiognomy and said: 'Madam will be the most noble person in the world.''",
      "context": {
        "previous": "呂后與兩子居田中耨，有一老父過請飲，呂后因餔之。",
        "next": "令相兩子，見孝惠，曰：「夫人所以貴者，乃此男也。」"
      }
    },
    {
      "id": "s0035",
      "type": "paragraph",
      "chinese": "令相兩子，見孝惠，曰：「夫人所以貴者，乃此男也。」",
      "literal": "He asked to read the two children's physiognomy; seeing Xiaohui, he said: \"The reason Madam will be noble is because of this boy.\"",
      "idiomatic": "He asked to read the physiognomy of both children. Looking at Xiaohui, he said: 'The reason Madam will be noble is this boy.''",
      "context": {
        "previous": "老父相呂后曰：「夫人天下貴人。」",
        "next": "相魯元，亦皆貴。"
      }
    },
    {
      "id": "s0036",
      "type": "paragraph",
      "chinese": "相魯元，亦皆貴。",
      "literal": "Reading Lu Yuan's physiognomy, she would also be noble.",
      "idiomatic": "Reading Lu Yuan's physiognomy, he said she would also be noble.",
      "context": {
        "previous": "令相兩子，見孝惠，曰：「夫人所以貴者，乃此男也。」",
        "next": "老父已去，高祖適從旁舍來，呂后具言客有過，相我子母皆大貴。"
      }
    },
    {
      "id": "s0037",
      "type": "paragraph",
      "chinese": "老父已去，高祖適從旁舍來，呂后具言客有過，相我子母皆大貴。",
      "literal": "After the old man left, Gao Zu happened to come from a neighboring house; Empress Lü fully told him that a guest had passed by and read the physiognomy of her and the children, all predicting great nobility.",
      "idiomatic": "After the old man left, Emperor Gaozu happened to come from a neighboring house. Empress Lü told him in detail that a guest had passed by and read the physiognomy of her and the children, predicting great nobility for all of them.",
      "context": {
        "previous": "相魯元，亦皆貴。",
        "next": "高祖問，曰：「未遠。」"
      }
    },
    {
      "id": "s0038",
      "type": "paragraph",
      "chinese": "高祖問，曰：「未遠。」",
      "literal": "Gao Zu asked where he was; she said: \"Not far.\"",
      "idiomatic": "Emperor Gaozu asked where he was. She said: 'Not far.''",
      "context": {
        "previous": "老父已去，高祖適從旁舍來，呂后具言客有過，相我子母皆大貴。",
        "next": "乃追及，問老父。"
      }
    },
    {
      "id": "s0039",
      "type": "paragraph",
      "chinese": "乃追及，問老父。",
      "literal": "He then pursued and caught up with the old man and questioned him.",
      "idiomatic": "He then pursued and caught up with the old man, questioning him.",
      "context": {
        "previous": "高祖問，曰：「未遠。」",
        "next": "老父曰：「鄉者夫人嬰兒皆似君，君相貴不可言。」"
      }
    },
    {
      "id": "s0040",
      "type": "paragraph",
      "chinese": "老父曰：「鄉者夫人嬰兒皆似君，君相貴不可言。」",
      "literal": "The old man said: \"Earlier your wife and children all resemble you; your physiognomy indicates nobility beyond description.\"",
      "idiomatic": "The old man said: 'Earlier your wife and children all resemble you. Your physiognomy indicates nobility beyond description.''",
      "context": {
        "previous": "乃追及，問老父。",
        "next": "高祖乃謝曰：「誠如父言，不敢忘德。」"
      }
    },
    {
      "id": "s0041",
      "type": "paragraph",
      "chinese": "高祖乃謝曰：「誠如父言，不敢忘德。」",
      "literal": "Gao Zu then bowed and said: \"If it is truly as you say, I dare not forget this kindness.\"",
      "idiomatic": "Emperor Gaozu then bowed and said: 'If it is truly as you say, I dare not forget this kindness.''",
      "context": {
        "previous": "老父曰：「鄉者夫人嬰兒皆似君，君相貴不可言。」",
        "next": "及高祖貴，遂不知老父處。"
      }
    },
    {
      "id": "s0042",
      "type": "paragraph",
      "chinese": "及高祖貴，遂不知老父處。",
      "literal": "When Gao Zu became noble, they never found where the old man was.",
      "idiomatic": "When Emperor Gaozu became noble, they could never find where the old man was.",
      "context": {
        "previous": "高祖乃謝曰：「誠如父言，不敢忘德。」"
      }
    },
    {
      "id": "s0043",
      "type": "paragraph",
      "chinese": "高祖為亭長，乃以竹皮為冠，令求盜之薛治之，時時冠之，及貴常冠，所謂「劉氏冠」乃是也。",
      "literal": "When Gao Zu was Pavilion Head, he made a cap of bamboo bark and had the cap-maker of Xue craft it; he wore it from time to time, and when he became noble he always wore it—the so-called 'Liu cap' is this.",
      "idiomatic": "When Emperor Gaozu was pavilion chief, he made a hat from bamboo bark and had the hat-maker of Xue craft it. He wore it from time to time, and when he became noble he always wore it. This is the so-called 'Liu hat.''",
      "context": {}
    },
    {
      "id": "s0044",
      "type": "paragraph",
      "chinese": "高祖以亭長為縣送徒酈山，徒多道亡。",
      "literal": "As Pavilion Head, Gao Zu escorted convicts for the county to Mount Li; many escaped on the road.",
      "idiomatic": "As pavilion chief, Emperor Gaozu escorted convicts for the county to Mount Li. Many escaped along the way.",
      "context": {
        "next": "自度比至皆亡之，到豐西澤中，止飲，夜乃解縱所送徒。"
      }
    },
    {
      "id": "s0045",
      "type": "paragraph",
      "chinese": "自度比至皆亡之，到豐西澤中，止飲，夜乃解縱所送徒。",
      "literal": "He estimated that by the time they arrived all would have fled, so reaching the marshes west of Feng, he stopped to drink, and at night released all the convicts he was escorting.",
      "idiomatic": "He estimated that by the time they arrived, all would have fled. Reaching the marshes west of Feng, he stopped to drink, and at night released all the convicts he was escorting.",
      "context": {
        "previous": "高祖以亭長為縣送徒酈山，徒多道亡。",
        "next": "曰：「公等皆去，吾亦從此逝矣！」"
      }
    },
    {
      "id": "s0046",
      "type": "paragraph",
      "chinese": "曰：「公等皆去，吾亦從此逝矣！」",
      "literal": "He said: \"You may all go; I too will depart from here!\"",
      "idiomatic": "He said: 'You may all go. I too will depart from here!''",
      "context": {
        "previous": "自度比至皆亡之，到豐西澤中，止飲，夜乃解縱所送徒。",
        "next": "徒中壯士願從者十餘人。"
      }
    },
    {
      "id": "s0047",
      "type": "paragraph",
      "chinese": "徒中壯士願從者十餘人。",
      "literal": "Among the convicts over ten brave men wished to follow him.",
      "idiomatic": "Among the convicts, over ten brave men wished to follow him.",
      "context": {
        "previous": "曰：「公等皆去，吾亦從此逝矣！」",
        "next": "高祖被酒，夜徑澤中，令一人行前。"
      }
    },
    {
      "id": "s0048",
      "type": "paragraph",
      "chinese": "高祖被酒，夜徑澤中，令一人行前。",
      "literal": "Gao Zu, intoxicated, traveled by night through the marshes and ordered one man to go ahead.",
      "idiomatic": "Emperor Gaozu, intoxicated, traveled by night through the marshes and ordered one man to go ahead.",
      "context": {
        "previous": "徒中壯士願從者十餘人。",
        "next": "行前者還報曰：「前有大蛇當徑，願還。」"
      }
    },
    {
      "id": "s0049",
      "type": "paragraph",
      "chinese": "行前者還報曰：「前有大蛇當徑，願還。」",
      "literal": "The man going ahead returned and reported: \"There is a great snake blocking the path ahead; we should turn back.\"",
      "idiomatic": "The man going ahead returned and reported: 'There is a great snake blocking the path ahead. We should turn back.''",
      "context": {
        "previous": "高祖被酒，夜徑澤中，令一人行前。",
        "next": "高祖醉，曰：「壯士行，何畏！」"
      }
    },
    {
      "id": "s0050",
      "type": "paragraph",
      "chinese": "高祖醉，曰：「壯士行，何畏！」",
      "literal": "Gao Zu, drunk, said: \"A brave man goes forward—what is there to fear!\"",
      "idiomatic": "Emperor Gaozu, drunk, said: 'A brave man goes forward—what is there to fear!''",
      "context": {
        "previous": "行前者還報曰：「前有大蛇當徑，願還。」",
        "next": "乃前，拔劍擊斬蛇。"
      }
    },
    {
      "id": "s0051",
      "type": "paragraph",
      "chinese": "乃前，拔劍擊斬蛇。",
      "literal": "He then went forward, drew his sword, and struck and beheaded the snake.",
      "idiomatic": "He stepped forward, drew his sword, and cut off the snake's head.",
      "context": {
        "previous": "高祖醉，曰：「壯士行，何畏！」",
        "next": "蛇遂分為兩，徑開。"
      }
    },
    {
      "id": "s0052",
      "type": "paragraph",
      "chinese": "蛇遂分為兩，徑開。",
      "literal": "The snake was split in two and the path opened.",
      "idiomatic": "The snake split in two and the path opened.",
      "context": {
        "previous": "乃前，拔劍擊斬蛇。",
        "next": "行數里，醉，因臥。"
      }
    },
    {
      "id": "s0053",
      "type": "paragraph",
      "chinese": "行數里，醉，因臥。",
      "literal": "After traveling several li, drunk, he lay down to sleep.",
      "idiomatic": "After walking several miles, drunk as he was, he lay down to sleep.",
      "context": {
        "previous": "蛇遂分為兩，徑開。",
        "next": "後人來至蛇所，有一老嫗夜哭。"
      }
    },
    {
      "id": "s0054",
      "type": "paragraph",
      "chinese": "後人來至蛇所，有一老嫗夜哭。",
      "literal": "People coming after arrived at the snake's location; there was an old woman crying at night.",
      "idiomatic": "People coming later arrived at where the snake had been; there was an old woman crying at night.",
      "context": {
        "previous": "行數里，醉，因臥。",
        "next": "人問何哭，嫗曰：「人殺吾子，故哭之。」"
      }
    },
    {
      "id": "s0055",
      "type": "paragraph",
      "chinese": "人問何哭，嫗曰：「人殺吾子，故哭之。」",
      "literal": "People asked why she cried; the old woman said: \"Someone killed my son, therefore I cry.\"",
      "idiomatic": "People asked why she cried. The old woman said: 'Someone killed my son, therefore I cry.''",
      "context": {
        "previous": "後人來至蛇所，有一老嫗夜哭。",
        "next": "人曰：「嫗子何為見殺？」"
      }
    },
    {
      "id": "s0056",
      "type": "paragraph",
      "chinese": "人曰：「嫗子何為見殺？」",
      "literal": "People said: \"Why was your son killed?\"",
      "idiomatic": "People said: 'Why was your son killed?''",
      "context": {
        "previous": "人問何哭，嫗曰：「人殺吾子，故哭之。」",
        "next": "嫗曰：「吾，白帝子也，化為蛇，當道，今為赤帝子斬之，故哭。」"
      }
    },
    {
      "id": "s0057",
      "type": "paragraph",
      "chinese": "嫗曰：「吾，白帝子也，化為蛇，當道，今為赤帝子斬之，故哭。」",
      "literal": "The old woman said: \"My son is the son of the White Emperor; he transformed into a snake and blocked the road; now he was beheaded by the son of the Red Emperor, therefore I cry.\"",
      "idiomatic": "The old woman said: 'My son is the son of the White Emperor. He transformed into a snake and blocked the road. Now he was beheaded by the son of the Red Emperor, therefore I cry.''",
      "context": {
        "previous": "人曰：「嫗子何為見殺？」",
        "next": "人乃以嫗為不誠，欲告之，嫗因忽不見。"
      }
    },
    {
      "id": "s0058",
      "type": "paragraph",
      "chinese": "人乃以嫗為不誠，欲告之，嫗因忽不見。",
      "literal": "People thought the old woman was lying and wanted to punish her, but the old woman suddenly disappeared.",
      "idiomatic": "People thought the old woman was lying and wanted to report her, but the old woman suddenly disappeared.",
      "context": {
        "previous": "嫗曰：「吾，白帝子也，化為蛇，當道，今為赤帝子斬之，故哭。」",
        "next": "後人至，高祖覺。"
      }
    },
    {
      "id": "s0059",
      "type": "paragraph",
      "chinese": "後人至，高祖覺。",
      "literal": "When the people behind arrived, Gao Zu awoke.",
      "idiomatic": "When the people behind arrived, Emperor Gaozu awoke.",
      "context": {
        "previous": "人乃以嫗為不誠，欲告之，嫗因忽不見。",
        "next": "後人告高祖，高祖乃心獨喜，自負。"
      }
    },
    {
      "id": "s0060",
      "type": "paragraph",
      "chinese": "後人告高祖，高祖乃心獨喜，自負。",
      "literal": "The people behind told Gao Zu; Gao Zu was secretly delighted in his heart and felt self-assured.",
      "idiomatic": "The people behind told Emperor Gaozu. He was secretly delighted in his heart and felt self-assured.",
      "context": {
        "previous": "後人至，高祖覺。",
        "next": "諸從者日益畏之。"
      }
    },
    {
      "id": "s0061",
      "type": "paragraph",
      "chinese": "諸從者日益畏之。",
      "literal": "Those who followed him grew daily more in awe of him.",
      "idiomatic": "His followers grew more awestruck with each passing day.",
      "context": {
        "previous": "後人告高祖，高祖乃心獨喜，自負。"
      }
    },
    {
      "id": "s0062",
      "type": "paragraph",
      "chinese": "秦始皇帝常曰「東南有天子氣」，於是因東游以厭之。",
      "literal": "The First Emperor of Qin often said \"In the southeast there is the qi of a Son of Heaven,\" and consequently made eastern tours to suppress it.",
      "idiomatic": "The First Emperor of Qin often said: 'In the southeast there is the qi of a Son of Heaven.' Consequently, he made eastern tours to suppress it.",
      "context": {
        "next": "高祖即自疑，亡匿，隱於芒、碭山澤巖石之閒。"
      }
    },
    {
      "id": "s0063",
      "type": "paragraph",
      "chinese": "高祖即自疑，亡匿，隱於芒、碭山澤巖石之閒。",
      "literal": "Gao Zu then suspected it was himself, fled and hid, concealing himself among the cliffs and rocks of the marshes and mountains of Mang and Dang.",
      "idiomatic": "Emperor Gaozu then suspected it referred to himself. He fled and hid, concealing himself among the cliffs and rocks of the marshes and mountains of Mang and Dang.",
      "context": {
        "previous": "秦始皇帝常曰「東南有天子氣」，於是因東游以厭之。",
        "next": "呂后與人俱求，常得之。"
      }
    },
    {
      "id": "s0064",
      "type": "paragraph",
      "chinese": "呂后與人俱求，常得之。",
      "literal": "Empress Lü with others sought him and always found him.",
      "idiomatic": "Empress Lü searched for him along with others and always found him.",
      "context": {
        "previous": "高祖即自疑，亡匿，隱於芒、碭山澤巖石之閒。",
        "next": "高祖怪問之。"
      }
    },
    {
      "id": "s0065",
      "type": "paragraph",
      "chinese": "高祖怪問之。",
      "literal": "Gao Zu found this strange and questioned her.",
      "idiomatic": "Emperor Gaozu found this strange and questioned her.",
      "context": {
        "previous": "呂后與人俱求，常得之。",
        "next": "呂后曰：「季所居上常有雲氣，故從往常得季。」"
      }
    },
    {
      "id": "s0066",
      "type": "paragraph",
      "chinese": "呂后曰：「季所居上常有雲氣，故從往常得季。」",
      "literal": "Empress Lü said: \"Where Ji resides there is always cloud qi above, so following it I always find Ji.\"",
      "idiomatic": "Empress Lü said: 'Where Ji resides, there is always cloud qi above. By following it, I always find Ji.''",
      "context": {
        "previous": "高祖怪問之。",
        "next": "高祖心喜。"
      }
    },
    {
      "id": "s0067",
      "type": "paragraph",
      "chinese": "高祖心喜。",
      "literal": "Gao Zu was pleased in his heart.",
      "idiomatic": "Emperor Gaozu was pleased in his heart.",
      "context": {
        "previous": "呂后曰：「季所居上常有雲氣，故從往常得季。」",
        "next": "沛中子弟或聞之，多欲附者矣。"
      }
    },
    {
      "id": "s0068",
      "type": "paragraph",
      "chinese": "沛中子弟或聞之，多欲附者矣。",
      "literal": "Some of the young men of Pei heard of this and many wished to attach themselves to him.",
      "idiomatic": "Some young men from Pei heard about this and many wanted to join him.",
      "context": {
        "previous": "高祖心喜。"
      }
    },
    {
      "id": "s0069",
      "type": "paragraph",
      "chinese": "秦二世元年秋，陳勝等起蘄，至陳而王，號為「張楚」。",
      "literal": "In autumn of the first year of the Second Emperor of Qin, Chen Sheng and others arose at Qi, reached Chen and became king, with the title 'Zhang Chu.'",
      "idiomatic": "In the autumn of the first year of Qin's Second Emperor, Chen Sheng and others rose up at Qi. They reached Chen and he became king, taking the title 'Zhang Chu.'",
      "context": {
        "next": "諸郡縣皆多殺其長吏以應陳涉。"
      }
    },
    {
      "id": "s0070",
      "type": "paragraph",
      "chinese": "諸郡縣皆多殺其長吏以應陳涉。",
      "literal": "The commanderies and counties mostly all killed their magistrates to respond to Chen She.",
      "idiomatic": "The commanderies and counties mostly killed their chief officials to respond to Chen She.",
      "context": {
        "previous": "秦二世元年秋，陳勝等起蘄，至陳而王，號為「張楚」。",
        "next": "沛令恐，欲以沛應涉。"
      }
    },
    {
      "id": "s0071",
      "type": "paragraph",
      "chinese": "沛令恐，欲以沛應涉。",
      "literal": "The Pei magistrate was afraid and wished to have Pei respond to She.",
      "idiomatic": "The Pei county magistrate was afraid and wished to have Pei respond to Chen She.",
      "context": {
        "previous": "諸郡縣皆多殺其長吏以應陳涉。",
        "next": "掾、主吏蕭何、曹參乃曰：「君為秦吏，今欲背之，率沛子弟，恐不聽。"
      }
    },
    {
      "id": "s0072",
      "type": "paragraph",
      "chinese": "掾、主吏蕭何、曹參乃曰：「君為秦吏，今欲背之，率沛子弟，恐不聽。",
      "literal": "Assistant clerks and supervising officials Xiao He and Cao Can then said: \"You are a Qin official; now if you wish to betray it and lead the sons and younger brothers of Pei, I fear they will not obey.",
      "idiomatic": "Assistant clerks and supervising officials Xiao He and Cao Can then said: 'You are a Qin official. Now if you wish to betray Qin and lead the young men of Pei, I fear they will not obey.''",
      "context": {
        "previous": "沛令恐，欲以沛應涉。",
        "next": "願君召諸亡在外者，可得數百人，因劫眾，眾不敢不聽。」"
      }
    },
    {
      "id": "s0073",
      "type": "paragraph",
      "chinese": "願君召諸亡在外者，可得數百人，因劫眾，眾不敢不聽。」",
      "literal": "We hope you will summon those who are fugitives outside—you can obtain several hundred men to coerce the masses, and the masses will not dare disobey.\"",
      "idiomatic": "We hope you will summon the fugitives outside. You can obtain several hundred men to coerce the masses, and the masses will not dare disobey.''",
      "context": {
        "previous": "掾、主吏蕭何、曹參乃曰：「君為秦吏，今欲背之，率沛子弟，恐不聽。",
        "next": "乃令樊噲召劉季。"
      }
    },
    {
      "id": "s0074",
      "type": "paragraph",
      "chinese": "乃令樊噲召劉季。",
      "literal": "He then ordered Fan Kuai to summon Liu Ji.",
      "idiomatic": "He ordered Fan Kuai to summon Liu Ji.",
      "context": {
        "previous": "願君召諸亡在外者，可得數百人，因劫眾，眾不敢不聽。」",
        "next": "劉季之眾已數十百人矣。"
      }
    },
    {
      "id": "s0075",
      "type": "paragraph",
      "chinese": "劉季之眾已數十百人矣。",
      "literal": "Liu Ji's followers already numbered several tens or hundreds.",
      "idiomatic": "Liu Ji's followers already numbered dozens or hundreds.",
      "context": {
        "previous": "乃令樊噲召劉季。"
      }
    },
    {
      "id": "s0076",
      "type": "paragraph",
      "chinese": "於是樊噲從劉季來。",
      "literal": "Thereupon Fan Kuai followed Liu Ji and came.",
      "idiomatic": "Thereupon Fan Kuai went with Liu Ji and came.",
      "context": {
        "next": "沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。"
      }
    },
    {
      "id": "s0077",
      "type": "paragraph",
      "chinese": "沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。",
      "literal": "The Pei magistrate later regretted it, fearing there would be trouble, so he closed the city gates to defend the city and wished to execute Xiao and Cao.",
      "idiomatic": "The Pei magistrate later regretted his decision, fearing trouble would arise. He closed the city gates to defend the city and wanted to execute Xiao He and Cao Can.",
      "context": {
        "previous": "於是樊噲從劉季來。",
        "next": "蕭、曹恐，踰城保劉季。"
      }
    },
    {
      "id": "s0078",
      "type": "paragraph",
      "chinese": "蕭、曹恐，踰城保劉季。",
      "literal": "Xiao and Cao were afraid and climbed over the wall to join Liu Ji.",
      "idiomatic": "Xiao He and Cao Can were afraid and climbed over the city wall to join Liu Ji.",
      "context": {
        "previous": "沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。",
        "next": "劉季乃書帛射城上，謂沛父老曰：「天下苦秦久矣。"
      }
    },
    {
      "id": "s0079",
      "type": "paragraph",
      "chinese": "劉季乃書帛射城上，謂沛父老曰：「天下苦秦久矣。",
      "literal": "Liu Ji then wrote on silk and shot it over the city wall, saying to the elders of Pei: \"All under Heaven has long suffered under Qin.",
      "idiomatic": "Liu Ji then wrote on silk and shot it over the city wall, telling the elders of Pei: 'All under Heaven has long suffered under Qin.''",
      "context": {
        "previous": "蕭、曹恐，踰城保劉季。",
        "next": "今父老雖為沛令守，諸侯并起，今屠沛。"
      }
    },
    {
      "id": "s0080",
      "type": "paragraph",
      "chinese": "今父老雖為沛令守，諸侯并起，今屠沛。",
      "literal": "Now though the elders support the Pei magistrate in defending, the feudal lords are rising together and will now massacre Pei.",
      "idiomatic": "Although you elders are defending for the Pei magistrate, the feudal lords are rising together and will now massacre Pei.'",
      "context": {
        "previous": "劉季乃書帛射城上，謂沛父老曰：「天下苦秦久矣。",
        "next": "沛今共誅令，擇子弟可立者立之，以應諸侯，則家室完。"
      }
    },
    {
      "id": "s0081",
      "type": "paragraph",
      "chinese": "沛今共誅令，擇子弟可立者立之，以應諸侯，則家室完。",
      "literal": "If Pei now together executes the magistrate and chooses from among the sons and younger brothers one who can be installed and installs him to respond to the feudal lords, then households will be preserved intact.",
      "idiomatic": "If Pei now together executes the magistrate and selects one of the young men to install as leader to respond to the feudal lords, then your households will be preserved intact.'",
      "context": {
        "previous": "今父老雖為沛令守，諸侯并起，今屠沛。",
        "next": "不然，父子俱屠，無為也。」"
      }
    },
    {
      "id": "s0082",
      "type": "paragraph",
      "chinese": "不然，父子俱屠，無為也。」",
      "literal": "If not, fathers and sons will all be massacred—there is no point.\"",
      "idiomatic": "Otherwise, fathers and sons will all be massacred—there is no point.''",
      "context": {
        "previous": "沛今共誅令，擇子弟可立者立之，以應諸侯，則家室完。",
        "next": "父老乃率子弟共殺沛令，開城門迎劉季，欲以為沛令。"
      }
    },
    {
      "id": "s0083",
      "type": "paragraph",
      "chinese": "父老乃率子弟共殺沛令，開城門迎劉季，欲以為沛令。",
      "literal": "The elders then led the sons and younger brothers to together kill the Pei magistrate, opened the city gates, and welcomed Liu Ji, wishing to make him Pei magistrate.",
      "idiomatic": "The elders then led the young men to kill the Pei magistrate together. They opened the city gates and welcomed Liu Ji, wanting to make him the Pei magistrate.",
      "context": {
        "previous": "不然，父子俱屠，無為也。」",
        "next": "劉季曰：「天下方擾，諸侯并起，今置將不善，壹敗涂地。"
      }
    },
    {
      "id": "s0084",
      "type": "paragraph",
      "chinese": "劉季曰：「天下方擾，諸侯并起，今置將不善，壹敗涂地。",
      "literal": "Liu Ji said: \"All under Heaven is in chaos; the feudal lords are rising together; now if we install a general who is not good, with one defeat all will be lost.",
      "idiomatic": "Liu Ji said: 'All under Heaven is in chaos. The feudal lords are rising together. If we install a general who is not competent, one defeat will destroy everything.''",
      "context": {
        "previous": "父老乃率子弟共殺沛令，開城門迎劉季，欲以為沛令。",
        "next": "吾非敢自愛，恐能薄，不能完父兄子弟。"
      }
    },
    {
      "id": "s0085",
      "type": "paragraph",
      "chinese": "吾非敢自愛，恐能薄，不能完父兄子弟。",
      "literal": "It is not that I dare be selfish, but I fear my abilities are meager and I cannot keep safe the fathers, elder brothers, sons, and younger brothers.",
      "idiomatic": "I'm not being selfish—I fear my abilities are insufficient and I cannot protect your fathers, brothers, sons, and families.''",
      "context": {
        "previous": "劉季曰：「天下方擾，諸侯并起，今置將不善，壹敗涂地。",
        "next": "此大事，願更相推擇可者。」"
      }
    },
    {
      "id": "s0086",
      "type": "paragraph",
      "chinese": "此大事，願更相推擇可者。」",
      "literal": "This is a great matter; I hope you will again recommend and choose someone suitable.\"",
      "idiomatic": "This is a grave matter. I hope you will reconsider and choose someone more suitable.''",
      "context": {
        "previous": "吾非敢自愛，恐能薄，不能完父兄子弟。",
        "next": "蕭、曹等皆文吏，自愛，恐事不就，後秦種族其家，盡讓劉季。"
      }
    },
    {
      "id": "s0087",
      "type": "paragraph",
      "chinese": "蕭、曹等皆文吏，自愛，恐事不就，後秦種族其家，盡讓劉季。",
      "literal": "Xiao, Cao, and the others were all civil clerks who cherished themselves; fearing that if the affair did not succeed Qin would later exterminate their clans, they all deferred to Liu Ji.",
      "idiomatic": "Xiao He, Cao Can, and the others were all civil officials who valued their own lives. Fearing that if the rebellion failed, Qin would later exterminate their clans, they all deferred to Liu Ji.",
      "context": {
        "previous": "此大事，願更相推擇可者。」",
        "next": "諸父老皆曰：「平生所聞劉季諸珍怪，當貴，且卜筮之，莫如劉季最吉。」"
      }
    },
    {
      "id": "s0088",
      "type": "paragraph",
      "chinese": "諸父老皆曰：「平生所聞劉季諸珍怪，當貴，且卜筮之，莫如劉季最吉。」",
      "literal": "All the elders said: \"Throughout life we have heard of the various strange and wondrous signs about Liu Ji; he should be noble; moreover, divining by oracle, none is as auspicious as Liu Ji.\"",
      "idiomatic": "All the elders said: 'Throughout our lives we have heard of the various strange and wondrous signs about Liu Ji. He is destined for nobility. Moreover, divination shows that none is more auspicious than Liu Ji.''",
      "context": {
        "previous": "蕭、曹等皆文吏，自愛，恐事不就，後秦種族其家，盡讓劉季。",
        "next": "於是劉季數讓。"
      }
    },
    {
      "id": "s0089",
      "type": "paragraph",
      "chinese": "於是劉季數讓。",
      "literal": "Thereupon Liu Ji declined several times.",
      "idiomatic": "Liu Ji repeatedly declined the offer.",
      "context": {
        "previous": "諸父老皆曰：「平生所聞劉季諸珍怪，當貴，且卜筮之，莫如劉季最吉。」",
        "next": "眾莫敢為，乃立季為沛公。"
      }
    },
    {
      "id": "s0090",
      "type": "paragraph",
      "chinese": "眾莫敢為，乃立季為沛公。",
      "literal": "Since none of the multitude dared take it, they installed Ji as Duke of Pei.",
      "idiomatic": "Since none of the multitude dared take the position, they installed Ji as Duke of Pei.",
      "context": {
        "previous": "於是劉季數讓。",
        "next": "祠黃帝，祭蚩尤於沛庭，而釁鼓旗，幟皆赤。"
      }
    },
    {
      "id": "s0091",
      "type": "paragraph",
      "chinese": "祠黃帝，祭蚩尤於沛庭，而釁鼓旗，幟皆赤。",
      "literal": "They made offerings to the Yellow Emperor, sacrificed to Chiyou in the courtyard of Pei, and consecrated drums and flags—all banners were red.",
      "idiomatic": "They made offerings to the Yellow Emperor and sacrificed to Chiyou in the Pei courtyard. They consecrated the drums and flags—all banners were red.",
      "context": {
        "previous": "眾莫敢為，乃立季為沛公。",
        "next": "由所殺蛇白帝子，殺者赤帝子，故上赤。"
      }
    },
    {
      "id": "s0092",
      "type": "paragraph",
      "chinese": "由所殺蛇白帝子，殺者赤帝子，故上赤。",
      "literal": "Because the snake he killed was the son of the White Emperor and the killer was the son of the Red Emperor, therefore they honored red.",
      "idiomatic": "Because the snake he killed was the son of the White Emperor and the killer was the son of the Red Emperor, they honored red.",
      "context": {
        "previous": "祠黃帝，祭蚩尤於沛庭，而釁鼓旗，幟皆赤。",
        "next": "於是少年豪吏如蕭、曹、樊噲等皆為收沛子弟二三千人，攻胡陵、方與，還守豐。"
      }
    },
    {
      "id": "s0093",
      "type": "paragraph",
      "chinese": "於是少年豪吏如蕭、曹、樊噲等皆為收沛子弟二三千人，攻胡陵、方與，還守豐。",
      "literal": "Thereupon young heroes and officials like Xiao, Cao, and Fan Kuai all gathered two or three thousand sons and younger brothers of Pei, attacked Huling and Fangyu, and returned to defend Feng.",
      "idiomatic": "Thereupon young heroes and officials like Xiao He, Cao Can, and Fan Kuai gathered two or three thousand young men from Pei. They attacked Huling and Fangyu, then returned to defend Feng.",
      "context": {
        "previous": "由所殺蛇白帝子，殺者赤帝子，故上赤。"
      }
    },
    {
      "id": "s0094",
      "type": "paragraph",
      "chinese": "秦二世二年，陳涉之將周章軍西至戲而還。",
      "literal": "In the second year of the Second Emperor of Qin, Chen She's general Zhou Zhang's army went west reaching Xi and returned.",
      "idiomatic": "In the second year of Qin's Second Emperor, Chen She's general Zhou Zhang led his army west as far as Xi, then turned back.",
      "context": {
        "next": "燕、趙、齊、魏皆自立為王。"
      }
    },
    {
      "id": "s0095",
      "type": "paragraph",
      "chinese": "燕、趙、齊、魏皆自立為王。",
      "literal": "Yan, Zhao, Qi, and Wei all made themselves kings.",
      "idiomatic": "Yan, Zhao, Qi, and Wei all proclaimed themselves kingdoms.",
      "context": {
        "previous": "秦二世二年，陳涉之將周章軍西至戲而還。",
        "next": "項氏起吳。"
      }
    },
    {
      "id": "s0096",
      "type": "paragraph",
      "chinese": "項氏起吳。",
      "literal": "The Xiang clan arose in Wu.",
      "idiomatic": "The Xiang clan rose up in Wu.",
      "context": {
        "previous": "燕、趙、齊、魏皆自立為王。",
        "next": "秦泗川監平將兵圍豐，二日，出與戰，破之。"
      }
    },
    {
      "id": "s0097",
      "type": "paragraph",
      "chinese": "秦泗川監平將兵圍豐，二日，出與戰，破之。",
      "literal": "The Supervisor of Sichuan, Ping, led troops to surround Feng for two days; they came out to do battle and broke them.",
      "idiomatic": "The Qin supervisor of Sichuan, Ping, led troops to besiege Feng for two days. The defenders came out to fight and defeated them.",
      "context": {
        "previous": "項氏起吳。",
        "next": "命雍齒守豐，引兵之薛。"
      }
    },
    {
      "id": "s0098",
      "type": "paragraph",
      "chinese": "命雍齒守豐，引兵之薛。",
      "literal": "He ordered Yong Chi to defend Feng and led his troops to Xue.",
      "idiomatic": "He ordered Yong Chi to defend Feng while he led his troops to Xue.",
      "context": {
        "previous": "秦泗川監平將兵圍豐，二日，出與戰，破之。",
        "next": "泗州守壯敗於薛，走至戚，沛公左司馬得泗川守壯，殺之。"
      }
    },
    {
      "id": "s0099",
      "type": "paragraph",
      "chinese": "泗州守壯敗於薛，走至戚，沛公左司馬得泗川守壯，殺之。",
      "literal": "The Administrator of Sizhou, Zhuang, was defeated at Xue and fled to Qi; the Duke of Pei's Left Major captured Administrator Zhuang of Sichuan and killed him.",
      "idiomatic": "The Qin administrator of Sizhou, Zhuang, was defeated at Xue and fled to Qi. The Duke of Pei's Left Major captured Administrator Zhuang of Sichuan and killed him.",
      "context": {
        "previous": "命雍齒守豐，引兵之薛。",
        "next": "沛公還軍亢父，至方與，（周市來攻方與）未戰。"
      }
    },
    {
      "id": "s0100",
      "type": "paragraph",
      "chinese": "沛公還軍亢父，至方與，（周市來攻方與）未戰。",
      "literal": "The Duke of Pei returned his army to Kangfu, reached Fangyu, and had not yet fought.",
      "idiomatic": "The Duke of Pei returned his army to Kangfu and reached Fangyu, but had not yet fought.",
      "context": {
        "previous": "泗州守壯敗於薛，走至戚，沛公左司馬得泗川守壯，殺之。",
        "next": "陳王使魏人周市略地。"
      }
    },
    {
      "id": "s0101",
      "type": "paragraph",
      "chinese": "陳王使魏人周市略地。",
      "literal": "King Chen sent Zhou Shi of Wei to take territory.",
      "idiomatic": "King Chen sent Zhou Shi of Wei to seize territory.",
      "context": {
        "previous": "沛公還軍亢父，至方與，（周市來攻方與）未戰。",
        "next": "周市使人謂雍齒曰：「豐，故梁徙也。"
      }
    },
    {
      "id": "s0102",
      "type": "paragraph",
      "chinese": "周市使人謂雍齒曰：「豐，故梁徙也。",
      "literal": "Zhou Shi sent someone to say to Yong Chi: \"Feng was formerly a Liang relocated town.",
      "idiomatic": "Zhou Shi sent someone to tell Yong Chi: 'Feng was formerly a relocated town from Liang.'",
      "context": {
        "previous": "陳王使魏人周市略地。",
        "next": "今魏地已定者數十城。"
      }
    },
    {
      "id": "s0103",
      "type": "paragraph",
      "chinese": "今魏地已定者數十城。",
      "literal": "Now the Wei territory that has been settled numbers several tens of cities.",
      "idiomatic": "Wei has already pacified dozens of cities.'",
      "context": {
        "previous": "周市使人謂雍齒曰：「豐，故梁徙也。",
        "next": "齒今下魏，魏以齒為侯守豐。"
      }
    },
    {
      "id": "s0104",
      "type": "paragraph",
      "chinese": "齒今下魏，魏以齒為侯守豐。",
      "literal": "If Chi now surrenders to Wei, Wei will make Chi a marquis defending Feng.",
      "idiomatic": "If Yong Chi surrenders to Wei now, Wei will make him Marquis of Feng.'",
      "context": {
        "previous": "今魏地已定者數十城。",
        "next": "不下，且屠豐。」"
      }
    },
    {
      "id": "s0105",
      "type": "paragraph",
      "chinese": "不下，且屠豐。」",
      "literal": "If you do not surrender, we will massacre Feng.\"",
      "idiomatic": "If you don't surrender, we'll massacre Feng.''",
      "context": {
        "previous": "齒今下魏，魏以齒為侯守豐。",
        "next": "雍齒雅不欲屬沛公，及魏招之，即反為魏守豐。"
      }
    },
    {
      "id": "s0106",
      "type": "paragraph",
      "chinese": "雍齒雅不欲屬沛公，及魏招之，即反為魏守豐。",
      "literal": "Yong Chi had long been unwilling to be subordinate to the Duke of Pei; when Wei recruited him, he immediately rebelled and defended Feng for Wei.",
      "idiomatic": "Yong Chi had long been unwilling to serve under the Duke of Pei. When Wei recruited him, he immediately defected and defended Feng for Wei.",
      "context": {
        "previous": "不下，且屠豐。」",
        "next": "沛公引兵攻豐，不能取。"
      }
    },
    {
      "id": "s0107",
      "type": "paragraph",
      "chinese": "沛公引兵攻豐，不能取。",
      "literal": "The Duke of Pei led troops to attack Feng but could not take it.",
      "idiomatic": "The Duke of Pei led troops to attack Feng but could not capture it.",
      "context": {
        "previous": "雍齒雅不欲屬沛公，及魏招之，即反為魏守豐。",
        "next": "沛公病，還之沛。"
      }
    },
    {
      "id": "s0108",
      "type": "paragraph",
      "chinese": "沛公病，還之沛。",
      "literal": "The Duke of Pei fell ill and returned to Pei.",
      "idiomatic": "The Duke of Pei fell ill and went back to Pei.",
      "context": {
        "previous": "沛公引兵攻豐，不能取。",
        "next": "沛公怨雍齒與豐子弟叛之，聞東陽甯君、秦嘉立景駒為假王，在留，乃往從之，欲請兵以攻豐。"
      }
    },
    {
      "id": "s0109",
      "type": "paragraph",
      "chinese": "沛公怨雍齒與豐子弟叛之，聞東陽甯君、秦嘉立景駒為假王，在留，乃往從之，欲請兵以攻豐。",
      "literal": "The Duke of Pei resented that Yong Chi and the sons and younger brothers of Feng had betrayed him; hearing that Lord Ning of Dongyang and Qin Jia had installed Jing Ju as Provisional King at Liu, he went to join them, wishing to request troops to attack Feng.",
      "idiomatic": "The Duke of Pei resented Yong Chi and the young men of Feng for betraying him. Hearing that Lord Ning of Dongyang and Qin Jia had installed Jing Ju as Provisional King at Liu, he went to join them, hoping to request troops to attack Feng.",
      "context": {
        "previous": "沛公病，還之沛。",
        "next": "是時秦將章邯從陳，別將司馬夷將兵北定楚地，屠相，至碭。"
      }
    },
    {
      "id": "s0110",
      "type": "paragraph",
      "chinese": "是時秦將章邯從陳，別將司馬夷將兵北定楚地，屠相，至碭。",
      "literal": "At this time Qin general Zhang Han came from Chen; a separate general, Sima Yi, led troops to pacify Chu territory to the north, massacred Xiang, and reached Dang.",
      "idiomatic": "At this time, Qin general Zhang Han came from Chen. A separate commander, Sima Yi, led troops to pacify northern Chu territory, massacred Xiang, and reached Dang.",
      "context": {
        "previous": "沛公怨雍齒與豐子弟叛之，聞東陽甯君、秦嘉立景駒為假王，在留，乃往從之，欲請兵以攻豐。",
        "next": "東陽甯君、沛公引兵西，與戰蕭西，不利。"
      }
    },
    {
      "id": "s0111",
      "type": "paragraph",
      "chinese": "東陽甯君、沛公引兵西，與戰蕭西，不利。",
      "literal": "Lord Ning of Dongyang and the Duke of Pei led troops west and fought with them west of Xiao; it went unfavorably.",
      "idiomatic": "Lord Ning of Dongyang and the Duke of Pei led troops west and fought Qin forces west of Xiao, but were defeated.",
      "context": {
        "previous": "是時秦將章邯從陳，別將司馬夷將兵北定楚地，屠相，至碭。",
        "next": "還收兵聚留，引兵攻碭，三日乃取碭。"
      }
    },
    {
      "id": "s0112",
      "type": "paragraph",
      "chinese": "還收兵聚留，引兵攻碭，三日乃取碭。",
      "literal": "They returned to gather troops and assembled at Liu, then led troops to attack Dang, taking it after three days.",
      "idiomatic": "They retreated to gather troops and assembled at Liu, then led troops to attack Dang, capturing it after three days.",
      "context": {
        "previous": "東陽甯君、沛公引兵西，與戰蕭西，不利。",
        "next": "因收碭兵，得五六千人。"
      }
    },
    {
      "id": "s0113",
      "type": "paragraph",
      "chinese": "因收碭兵，得五六千人。",
      "literal": "Consequently gathering Dang's troops, they obtained five or six thousand men.",
      "idiomatic": "They consequently recruited troops from Dang, obtaining five or six thousand men.",
      "context": {
        "previous": "還收兵聚留，引兵攻碭，三日乃取碭。",
        "next": "攻下邑，拔之。"
      }
    },
    {
      "id": "s0114",
      "type": "paragraph",
      "chinese": "攻下邑，拔之。",
      "literal": "They attacked Xiayi and took it.",
      "idiomatic": "They attacked Xiayi and captured it.",
      "context": {
        "previous": "因收碭兵，得五六千人。",
        "next": "還軍豐。"
      }
    },
    {
      "id": "s0115",
      "type": "paragraph",
      "chinese": "還軍豐。",
      "literal": "They returned the army to Feng.",
      "idiomatic": "They brought the army back to Feng.",
      "context": {
        "previous": "攻下邑，拔之。",
        "next": "聞項梁在薛，從騎百餘往見之。"
      }
    },
    {
      "id": "s0116",
      "type": "paragraph",
      "chinese": "聞項梁在薛，從騎百餘往見之。",
      "literal": "Hearing that Xiang Liang was at Xue, he went with over a hundred cavalry to see him.",
      "idiomatic": "Hearing that Xiang Liang was at Xue, he went with over a hundred cavalry to meet him.",
      "context": {
        "previous": "還軍豐。",
        "next": "項梁益沛公卒五千人，五大夫將十人。"
      }
    },
    {
      "id": "s0117",
      "type": "paragraph",
      "chinese": "項梁益沛公卒五千人，五大夫將十人。",
      "literal": "Xiang Liang augmented the Duke of Pei's troops with five thousand men and ten commanders of the fifth rank.",
      "idiomatic": "Xiang Liang augmented the Duke of Pei's forces with five thousand troops and ten commanders of the fifth rank.",
      "context": {
        "previous": "聞項梁在薛，從騎百餘往見之。",
        "next": "沛公還，引兵攻豐。"
      }
    },
    {
      "id": "s0118",
      "type": "paragraph",
      "chinese": "沛公還，引兵攻豐。",
      "literal": "The Duke of Pei returned and led troops to attack Feng.",
      "idiomatic": "The Duke of Pei came back and led his troops to attack Feng.",
      "context": {
        "previous": "項梁益沛公卒五千人，五大夫將十人。"
      }
    },
    {
      "id": "s0119",
      "type": "paragraph",
      "chinese": "從項梁月餘，項羽已拔襄城還。",
      "literal": "Following Xiang Liang for over a month, Xiang Yu had already taken Xiangcheng and returned.",
      "idiomatic": "He followed Xiang Liang for over a month, during which Xiang Yu had already captured Xiangcheng and returned.",
      "context": {
        "next": "項梁盡召別將居薛。"
      }
    },
    {
      "id": "s0120",
      "type": "paragraph",
      "chinese": "項梁盡召別將居薛。",
      "literal": "Xiang Liang summoned all the separate generals to assemble at Xue.",
      "idiomatic": "Xiang Liang called together all the independent generals at Xue.",
      "context": {
        "previous": "從項梁月餘，項羽已拔襄城還。",
        "next": "聞陳王定死，因立楚後懷王孫心為楚王，治盱臺。"
      }
    },
    {
      "id": "s0121",
      "type": "paragraph",
      "chinese": "聞陳王定死，因立楚後懷王孫心為楚王，治盱臺。",
      "literal": "Hearing that King Chen had definitely died, they consequently installed Xin, grandson of the former King Huai of Chu, as King of Chu, governing from Xutai.",
      "idiomatic": "Upon learning that King Chen was definitely dead, they installed Xin—grandson of the former King Huai of Chu—as King of Chu, governing from Xutai.",
      "context": {
        "previous": "項梁盡召別將居薛。",
        "next": "項梁號武信君。"
      }
    },
    {
      "id": "s0122",
      "type": "paragraph",
      "chinese": "項梁號武信君。",
      "literal": "Xiang Liang took the title Lord of Martial Trust.",
      "idiomatic": "Xiang Liang took the title Lord Wu Xin.",
      "context": {
        "previous": "聞陳王定死，因立楚後懷王孫心為楚王，治盱臺。",
        "next": "居數月，北攻亢父，救東阿，破秦軍。"
      }
    },
    {
      "id": "s0123",
      "type": "paragraph",
      "chinese": "居數月，北攻亢父，救東阿，破秦軍。",
      "literal": "After several months, they attacked Kangfu to the north, rescued Dong'e, and broke the Qin army.",
      "idiomatic": "After several months, they attacked Kangfu to the north, rescued Dong'e, and defeated the Qin army.",
      "context": {
        "previous": "項梁號武信君。",
        "next": "齊軍歸，楚獨追北，使沛公、項羽別攻城陽，屠之。"
      }
    },
    {
      "id": "s0124",
      "type": "paragraph",
      "chinese": "齊軍歸，楚獨追北，使沛公、項羽別攻城陽，屠之。",
      "literal": "The Qi army returned; only Chu pursued northward, sending the Duke of Pei and Xiang Yu separately to attack Chengyang and massacre it.",
      "idiomatic": "The Qi army retreated. Only Chu pursued northward, sending the Duke of Pei and Xiang Yu separately to attack Chengyang and massacre its inhabitants.",
      "context": {
        "previous": "居數月，北攻亢父，救東阿，破秦軍。",
        "next": "軍濮陽之東，與秦軍戰，破之。"
      }
    },
    {
      "id": "s0125",
      "type": "paragraph",
      "chinese": "軍濮陽之東，與秦軍戰，破之。",
      "literal": "They encamped east of Puyang and fought with the Qin army, breaking them.",
      "idiomatic": "They encamped east of Puyang and fought the Qin army, defeating them.",
      "context": {
        "previous": "齊軍歸，楚獨追北，使沛公、項羽別攻城陽，屠之。"
      }
    },
    {
      "id": "s0126",
      "type": "paragraph",
      "chinese": "秦軍復振，守濮陽，環水。",
      "literal": "The Qin army rallied again, defended Puyang, and surrounded by water.",
      "idiomatic": "The Qin army rallied again, defended Puyang, and was surrounded by water.",
      "context": {
        "next": "楚軍去而攻定陶，定陶未下。"
      }
    },
    {
      "id": "s0127",
      "type": "paragraph",
      "chinese": "楚軍去而攻定陶，定陶未下。",
      "literal": "The Chu army departed and attacked Dingtao, but Dingtao did not fall.",
      "idiomatic": "The Chu army departed and attacked Dingtao, but could not capture it.",
      "context": {
        "previous": "秦軍復振，守濮陽，環水。",
        "next": "沛公與項羽西略地至雍丘之下，與秦軍戰，大破之，斬李由。"
      }
    },
    {
      "id": "s0128",
      "type": "paragraph",
      "chinese": "沛公與項羽西略地至雍丘之下，與秦軍戰，大破之，斬李由。",
      "literal": "The Duke of Pei and Xiang Yu went west taking territory to below Yongqiu, fought with the Qin army, greatly broke them, and beheaded Li You.",
      "idiomatic": "The Duke of Pei and Xiang Yu went west seizing territory as far as below Yongqiu. They fought the Qin army, decisively defeated them, and beheaded Li You.",
      "context": {
        "previous": "楚軍去而攻定陶，定陶未下。",
        "next": "還攻外黃，外黃未下。"
      }
    },
    {
      "id": "s0129",
      "type": "paragraph",
      "chinese": "還攻外黃，外黃未下。",
      "literal": "Returning they attacked Waihuang, but Waihuang did not fall.",
      "idiomatic": "Returning, they attacked Waihuang, but could not capture it.",
      "context": {
        "previous": "沛公與項羽西略地至雍丘之下，與秦軍戰，大破之，斬李由。"
      }
    },
    {
      "id": "s0130",
      "type": "paragraph",
      "chinese": "項梁再破秦軍，有驕色。",
      "literal": "Xiang Liang twice broke the Qin army and showed an arrogant bearing.",
      "idiomatic": "Xiang Liang had twice defeated the Qin army and showed an arrogant demeanor.",
      "context": {
        "next": "宋義諫，不聽。"
      }
    },
    {
      "id": "s0131",
      "type": "paragraph",
      "chinese": "宋義諫，不聽。",
      "literal": "Song Yi remonstrated, but he did not listen.",
      "idiomatic": "Song Yi advised him against it, but he did not listen.",
      "context": {
        "previous": "項梁再破秦軍，有驕色。",
        "next": "秦益章邯兵，夜銜枚擊項梁，大破之定陶，項梁死。"
      }
    },
    {
      "id": "s0132",
      "type": "paragraph",
      "chinese": "秦益章邯兵，夜銜枚擊項梁，大破之定陶，項梁死。",
      "literal": "Qin reinforced Zhang Han's troops; by night with gags in their mouths they struck Xiang Liang, greatly broke him at Dingtao; Xiang Liang died.",
      "idiomatic": "Qin reinforced Zhang Han's troops. By night, with gags in their mouths to maintain silence, they struck Xiang Liang, decisively defeating him at Dingtao. Xiang Liang died.",
      "context": {
        "previous": "宋義諫，不聽。",
        "next": "沛公與項羽方攻陳留，聞項梁死，引兵與呂將軍俱東。"
      }
    },
    {
      "id": "s0133",
      "type": "paragraph",
      "chinese": "沛公與項羽方攻陳留，聞項梁死，引兵與呂將軍俱東。",
      "literal": "The Duke of Pei and Xiang Yu were attacking Chenliu when they heard of Xiang Liang's death; they led their troops eastward together with General Lü.",
      "idiomatic": "The Duke of Pei and Xiang Yu were in the midst of attacking Chenliu when they heard of Xiang Liang's death. They led their troops eastward together with General Lü.",
      "context": {
        "previous": "秦益章邯兵，夜銜枚擊項梁，大破之定陶，項梁死。",
        "next": "呂臣軍彭城東，項羽軍彭城西，沛公軍碭。"
      }
    },
    {
      "id": "s0134",
      "type": "paragraph",
      "chinese": "呂臣軍彭城東，項羽軍彭城西，沛公軍碭。",
      "literal": "Lü Chen's army was east of Pengcheng, Xiang Yu's army west of Pengcheng, and the Duke of Pei's army at Dang.",
      "idiomatic": "Lü Chen's forces were east of Pengcheng, Xiang Yu's west of Pengcheng, and the Duke of Pei's at Dang.",
      "context": {
        "previous": "沛公與項羽方攻陳留，聞項梁死，引兵與呂將軍俱東。"
      }
    },
    {
      "id": "s0135",
      "type": "paragraph",
      "chinese": "章邯已破項梁軍，則以為楚地兵不足憂，乃渡河，北擊趙，大破之。",
      "literal": "Having broken Xiang Liang's army, Zhang Han considered that Chu territory's troops were not worth worrying about, so he crossed the Yellow River and attacked Zhao to the north, greatly breaking them.",
      "idiomatic": "Having defeated Xiang Liang's army, Zhang Han considered Chu's troops no longer a threat. He crossed the Yellow River north and attacked Zhao, decisively defeating them.",
      "context": {
        "next": "當是之時，趙歇為王，秦將王離圍之鉅鹿城，此所謂河北之軍也。"
      }
    },
    {
      "id": "s0136",
      "type": "paragraph",
      "chinese": "當是之時，趙歇為王，秦將王離圍之鉅鹿城，此所謂河北之軍也。",
      "literal": "At that time, Zhao Xie was king; Qin general Wang Li surrounded him at Julu city—this was called the army north of the Yellow River.",
      "idiomatic": "At that time, Zhao Xie was king. Qin general Wang Li besieged him at Julu city—this was called the army north of the Yellow River.",
      "context": {
        "previous": "章邯已破項梁軍，則以為楚地兵不足憂，乃渡河，北擊趙，大破之。"
      }
    },
    {
      "id": "s0137",
      "type": "paragraph",
      "chinese": "秦二世三年，楚懷王見項梁軍破，恐，徙盱臺都彭城，并呂臣、項羽軍自將之。",
      "literal": "In the third year of the Second Emperor of Qin, King Huai of Chu saw that Xiang Liang's army was broken and was afraid; he moved from Xutai and made his capital at Pengcheng, combining Lü Chen's and Xiang Yu's armies to command them himself.",
      "idiomatic": "In the third year of Qin's Second Emperor, King Huai of Chu saw that Xiang Liang's army had been defeated and grew fearful. He moved his capital from Xutai to Pengcheng and personally took command of Lü Chen's and Xiang Yu's combined armies.",
      "context": {
        "next": "以沛公為碭郡長，封為武安侯，將碭郡兵。"
      }
    },
    {
      "id": "s0138",
      "type": "paragraph",
      "chinese": "以沛公為碭郡長，封為武安侯，將碭郡兵。",
      "literal": "He made the Duke of Pei Administrator of Dang Commandery, enfeoffed him as Marquis of Wu'an, and had him command the troops of Dang Commandery.",
      "idiomatic": "He appointed the Duke of Pei as Governor of Dang Commandery, enfeoffed him as Marquis of Wu'an, and put him in command of Dang's troops.",
      "context": {
        "previous": "秦二世三年，楚懷王見項梁軍破，恐，徙盱臺都彭城，并呂臣、項羽軍自將之。",
        "next": "封項羽為長安侯，號為魯公。"
      }
    },
    {
      "id": "s0139",
      "type": "paragraph",
      "chinese": "封項羽為長安侯，號為魯公。",
      "literal": "He enfeoffed Xiang Yu as Marquis of Chang'an and gave him the title Duke of Lu.",
      "idiomatic": "He enfeoffed Xiang Yu as Marquis of Chang'an with the title Duke of Lu.",
      "context": {
        "previous": "以沛公為碭郡長，封為武安侯，將碭郡兵。",
        "next": "呂臣為司徒，其父呂青為令尹。"
      }
    },
    {
      "id": "s0140",
      "type": "paragraph",
      "chinese": "呂臣為司徒，其父呂青為令尹。",
      "literal": "Lü Chen was made Minister of Ceremonies, and his father Lü Qing Grand Councillor.",
      "idiomatic": "Lü Chen was appointed Minister of Ceremonies, and his father Lü Qing became Grand Councillor.",
      "context": {
        "previous": "封項羽為長安侯，號為魯公。"
      }
    },
    {
      "id": "s0141",
      "type": "paragraph",
      "chinese": "趙數請救，懷王乃以宋義為上將軍，項羽為次將，范增為末將，北救趙。",
      "literal": "Zhao repeatedly requested rescue; King Huai then made Song Yi Supreme General, Xiang Yu second general, and Fan Zeng final general, to rescue Zhao to the north.",
      "idiomatic": "Zhao repeatedly requested rescue. King Huai then appointed Song Yi as Supreme General, Xiang Yu as Deputy General, and Fan Zeng as Rear General, to go north and rescue Zhao.",
      "context": {
        "next": "令沛公西略地入關。"
      }
    },
    {
      "id": "s0142",
      "type": "paragraph",
      "chinese": "令沛公西略地入關。",
      "literal": "He ordered the Duke of Pei to go west taking territory and enter the passes.",
      "idiomatic": "He ordered the Duke of Pei to go west, seize territory, and enter the passes.",
      "context": {
        "previous": "趙數請救，懷王乃以宋義為上將軍，項羽為次將，范增為末將，北救趙。",
        "next": "與諸將約，先入定關中者王之。"
      }
    },
    {
      "id": "s0143",
      "type": "paragraph",
      "chinese": "與諸將約，先入定關中者王之。",
      "literal": "Making an agreement with all the generals: he who first enters and settles Guanzhong shall be its king.",
      "idiomatic": "He made an agreement with all the generals: whoever first enters and pacifies Guanzhong shall be made its king.",
      "context": {
        "previous": "令沛公西略地入關。"
      }
    },
    {
      "id": "s0144",
      "type": "paragraph",
      "chinese": "當是時，秦兵彊，常乘勝逐北，諸將莫利先入關。",
      "literal": "At that time, Qin troops were strong and constantly rode victory pursuing northward; none of the generals found it advantageous to enter the passes first.",
      "idiomatic": "At that time, Qin troops were strong and constantly pressing their victories northward. None of the generals saw advantage in entering the passes first.",
      "context": {
        "next": "獨項羽怨秦破項梁軍，奮，願與沛公西入關。"
      }
    },
    {
      "id": "s0145",
      "type": "paragraph",
      "chinese": "獨項羽怨秦破項梁軍，奮，願與沛公西入關。",
      "literal": "Only Xiang Yu resented that Qin had broken Xiang Liang's army and was determined, wishing to go west into the passes with the Duke of Pei.",
      "idiomatic": "Only Xiang Yu, resentful that Qin had destroyed his uncle Xiang Liang's army, was determined and wished to go west into the passes with the Duke of Pei.",
      "context": {
        "previous": "當是時，秦兵彊，常乘勝逐北，諸將莫利先入關。",
        "next": "懷王諸老將皆曰：「項羽為人彊悍猾賊。"
      }
    },
    {
      "id": "s0146",
      "type": "paragraph",
      "chinese": "懷王諸老將皆曰：「項羽為人彊悍猾賊。",
      "literal": "King Huai's various old generals all said: \"Xiang Yu as a person is fierce, violent, cunning, and cruel.",
      "idiomatic": "King Huai's veteran generals all said: 'Xiang Yu is fierce, violent, cunning, and cruel.'",
      "context": {
        "previous": "獨項羽怨秦破項梁軍，奮，願與沛公西入關。",
        "next": "項羽嘗攻襄城，襄城無遺類，皆阬之，諸所過無不殘滅。"
      }
    },
    {
      "id": "s0147",
      "type": "paragraph",
      "chinese": "項羽嘗攻襄城，襄城無遺類，皆阬之，諸所過無不殘滅。",
      "literal": "When Xiang Yu attacked Xiangcheng, none of Xiangcheng's population remained—all were buried alive; wherever he passes he completely destroys everything.",
      "idiomatic": "When Xiang Yu attacked Xiangcheng, he left no survivors—all were buried alive. Wherever he goes, he completely destroys everything.",
      "context": {
        "previous": "懷王諸老將皆曰：「項羽為人彊悍猾賊。",
        "next": "且楚數進取，前陳王、項梁皆敗。"
      }
    },
    {
      "id": "s0148",
      "type": "paragraph",
      "chinese": "且楚數進取，前陳王、項梁皆敗。",
      "literal": "Moreover, Chu has repeatedly advanced offensively; previously King Chen and Xiang Liang both were defeated.",
      "idiomatic": "Moreover, Chu has repeatedly gone on the offensive, but previously King Chen and Xiang Liang both were defeated.",
      "context": {
        "previous": "項羽嘗攻襄城，襄城無遺類，皆阬之，諸所過無不殘滅。",
        "next": "不如更遣長者扶義而西，告諭秦父兄。"
      }
    },
    {
      "id": "s0149",
      "type": "paragraph",
      "chinese": "不如更遣長者扶義而西，告諭秦父兄。",
      "literal": "It would be better to send an elder to uphold righteousness and go west, to inform and instruct the fathers and elder brothers of Qin.",
      "idiomatic": "It would be better to send an elder to uphold righteousness and go west, to inform and persuade the fathers and brothers of Qin.",
      "context": {
        "previous": "且楚數進取，前陳王、項梁皆敗。",
        "next": "秦父兄苦其主久矣，今誠得長者往，毋侵暴，宜可下。"
      }
    },
    {
      "id": "s0150",
      "type": "paragraph",
      "chinese": "秦父兄苦其主久矣，今誠得長者往，毋侵暴，宜可下。",
      "literal": "The fathers and elder brothers of Qin have long suffered under their lord; now if we truly obtain an elder to go who does not invade or commit violence, they should be amenable to surrender.",
      "idiomatic": "The fathers and brothers of Qin have long suffered under their ruler. If we truly send a benevolent elder who commits no violence, they should be amenable to surrender.",
      "context": {
        "previous": "不如更遣長者扶義而西，告諭秦父兄。",
        "next": "今項羽彊悍，今不可遣。"
      }
    },
    {
      "id": "s0151",
      "type": "paragraph",
      "chinese": "今項羽彊悍，今不可遣。",
      "literal": "Now Xiang Yu is fierce and violent; he cannot be sent.",
      "idiomatic": "Xiang Yu is too fierce and violent to be sent away.",
      "context": {
        "previous": "秦父兄苦其主久矣，今誠得長者往，毋侵暴，宜可下。",
        "next": "獨沛公素寬大長者，可遣。」"
      }
    },
    {
      "id": "s0152",
      "type": "paragraph",
      "chinese": "獨沛公素寬大長者，可遣。」",
      "literal": "Only the Duke of Pei has always been generous and magnanimous, an elder; he can be sent.\"",
      "idiomatic": "Only the Duke of Pei has always been generous and magnanimous, a true elder. He can be sent.''",
      "context": {
        "previous": "今項羽彊悍，今不可遣。",
        "next": "卒不許項羽，而遣沛公西略地，收陳王、項梁散卒。"
      }
    },
    {
      "id": "s0153",
      "type": "paragraph",
      "chinese": "卒不許項羽，而遣沛公西略地，收陳王、項梁散卒。",
      "literal": "In the end they did not permit Xiang Yu, but sent the Duke of Pei west to take territory and gather the scattered troops of King Chen and Xiang Liang.",
      "idiomatic": "In the end they did not permit Xiang Yu, but sent the Duke of Pei west to seize territory and gather the scattered troops of King Chen and Xiang Liang.",
      "context": {
        "previous": "獨沛公素寬大長者，可遣。」",
        "next": "乃道碭至成陽，與杠裏秦軍夾壁，破（魏）［秦］二軍。"
      }
    },
    {
      "id": "s0154",
      "type": "paragraph",
      "chinese": "乃道碭至成陽，與杠裏秦軍夾壁，破（魏）［秦］二軍。",
      "literal": "They then went by way of Dang to Chengyang and with Qin troops at Gangli faced each other across ramparts, breaking the two Qin armies.",
      "idiomatic": "They then went by way of Dang to Chengyang and faced off against Qin troops at Gangli across ramparts, defeating the two Qin armies.",
      "context": {
        "previous": "卒不許項羽，而遣沛公西略地，收陳王、項梁散卒。",
        "next": "楚軍出兵擊王離，大破之。"
      }
    },
    {
      "id": "s0155",
      "type": "paragraph",
      "chinese": "楚軍出兵擊王離，大破之。",
      "literal": "The Chu army sent out troops to strike Wang Li and greatly broke him.",
      "idiomatic": "The Chu army sent out troops to attack Wang Li and decisively defeated him.",
      "context": {
        "previous": "乃道碭至成陽，與杠裏秦軍夾壁，破（魏）［秦］二軍。"
      }
    },
    {
      "id": "s0156",
      "type": "paragraph",
      "chinese": "沛公引兵西，遇彭越昌邑，因與俱攻秦軍，戰不利。",
      "literal": "The Duke of Pei led troops west and met Peng Yue at Changyi; consequently they together attacked the Qin army, but the battle went unfavorably.",
      "idiomatic": "The Duke of Pei led troops west and met Peng Yue at Changyi. They consequently attacked the Qin army together, but the battle went unfavorably.",
      "context": {
        "next": "還至栗，遇剛武侯，奪其軍，可四千餘人，并之。"
      }
    },
    {
      "id": "s0157",
      "type": "paragraph",
      "chinese": "還至栗，遇剛武侯，奪其軍，可四千餘人，并之。",
      "literal": "Returning to reach Li, he met Marquis Gangwu, seized his army of over four thousand men, and combined them.",
      "idiomatic": "Returning to Li, he met Marquis Gangwu, seized his army of over four thousand men, and incorporated them.",
      "context": {
        "previous": "沛公引兵西，遇彭越昌邑，因與俱攻秦軍，戰不利。",
        "next": "與魏將皇欣、魏申徒武蒲之軍并攻昌邑，昌邑未拔。"
      }
    },
    {
      "id": "s0158",
      "type": "paragraph",
      "chinese": "與魏將皇欣、魏申徒武蒲之軍并攻昌邑，昌邑未拔。",
      "literal": "Together with Wei generals Huang Xin, Wei Shentu, and the army of Wu Pu, they jointly attacked Changyi, but Changyi did not fall.",
      "idiomatic": "Together with Wei generals Huang Xin, Wei Shentu, and Wu Pu's army, they jointly attacked Changyi, but could not capture it.",
      "context": {
        "previous": "還至栗，遇剛武侯，奪其軍，可四千餘人，并之。",
        "next": "西過高陽。"
      }
    },
    {
      "id": "s0159",
      "type": "paragraph",
      "chinese": "西過高陽。",
      "literal": "Going west they passed Gaoyang.",
      "idiomatic": "Going west, they passed Gaoyang.",
      "context": {
        "previous": "與魏將皇欣、魏申徒武蒲之軍并攻昌邑，昌邑未拔。",
        "next": "酈食其（謂）［為］監門，曰：「諸將過此者多，吾視沛公大人長者。」"
      }
    },
    {
      "id": "s0160",
      "type": "paragraph",
      "chinese": "酈食其（謂）［為］監門，曰：「諸將過此者多，吾視沛公大人長者。」",
      "literal": "Li Yiji was gate guard and said: \"Many generals have passed through here; I observe that the Duke of Pei is a great man and elder.\"",
      "idiomatic": "Li Yiji was gate guard and said: 'Many generals have passed through here. I observe that the Duke of Pei is a great man and true elder.''",
      "context": {
        "previous": "西過高陽。",
        "next": "乃求見說沛公。"
      }
    },
    {
      "id": "s0161",
      "type": "paragraph",
      "chinese": "乃求見說沛公。",
      "literal": "He then sought an audience to persuade the Duke of Pei.",
      "idiomatic": "He requested an audience to persuade the Duke of Pei.",
      "context": {
        "previous": "酈食其（謂）［為］監門，曰：「諸將過此者多，吾視沛公大人長者。」",
        "next": "沛公方踞床，使兩女子洗足。"
      }
    },
    {
      "id": "s0162",
      "type": "paragraph",
      "chinese": "沛公方踞床，使兩女子洗足。",
      "literal": "The Duke of Pei was squatting on the bed having two women wash his feet.",
      "idiomatic": "The Duke of Pei was sitting cross-legged on the bed, having two women wash his feet.",
      "context": {
        "previous": "乃求見說沛公。",
        "next": "酈生不拜，長揖，曰：「足下必欲誅無道秦，不宜踞見長者。」"
      }
    },
    {
      "id": "s0163",
      "type": "paragraph",
      "chinese": "酈生不拜，長揖，曰：「足下必欲誅無道秦，不宜踞見長者。」",
      "literal": "Li Sheng did not bow but made a long salute, saying: \"If you wish to execute the lawless Qin, you should not squat to receive an elder.\"",
      "idiomatic": "Li Sheng did not bow but made a deep bow, saying: 'If you wish to execute the lawless Qin, you should not sit cross-legged to receive an elder.''",
      "context": {
        "previous": "沛公方踞床，使兩女子洗足。",
        "next": "於是沛公起，攝衣謝之，延上坐。"
      }
    },
    {
      "id": "s0164",
      "type": "paragraph",
      "chinese": "於是沛公起，攝衣謝之，延上坐。",
      "literal": "Thereupon the Duke of Pei rose, adjusted his clothing, apologized, and invited him to the seat of honor.",
      "idiomatic": "The Duke of Pei stood up, straightened his clothes, apologized, and invited him to the seat of honor.",
      "context": {
        "previous": "酈生不拜，長揖，曰：「足下必欲誅無道秦，不宜踞見長者。」",
        "next": "食其說沛公襲陳留，得秦積粟。"
      }
    },
    {
      "id": "s0165",
      "type": "paragraph",
      "chinese": "食其說沛公襲陳留，得秦積粟。",
      "literal": "Li Yiji persuaded the Duke of Pei to attack Chenliu and obtain Qin's accumulated grain.",
      "idiomatic": "Li Yiji persuaded the Duke of Pei to raid Chenliu and seize Qin's stockpiled grain.",
      "context": {
        "previous": "於是沛公起，攝衣謝之，延上坐。",
        "next": "乃以酈食其為廣野君，酈商為將，將陳留兵，與偕攻開封，開封未拔。"
      }
    },
    {
      "id": "s0166",
      "type": "paragraph",
      "chinese": "乃以酈食其為廣野君，酈商為將，將陳留兵，與偕攻開封，開封未拔。",
      "literal": "He then made Li Yiji Lord of Guangye and Li Shang a general to command the troops of Chenliu and together attack Kaifeng, but Kaifeng did not fall.",
      "idiomatic": "He then made Li Yiji Lord of Guangye and Li Shang a general to command Chenliu's troops. Together they attacked Kaifeng, but could not capture it.",
      "context": {
        "previous": "食其說沛公襲陳留，得秦積粟。",
        "next": "西與秦將楊熊戰白馬，又戰曲遇東，大破之。"
      }
    },
    {
      "id": "s0167",
      "type": "paragraph",
      "chinese": "西與秦將楊熊戰白馬，又戰曲遇東，大破之。",
      "literal": "Going west they fought with Qin general Yang Xiong at Baima, and again fought east of Quyu, greatly breaking them.",
      "idiomatic": "Going west, they fought Qin general Yang Xiong at Baima, and again fought east of Quyu, decisively defeating them.",
      "context": {
        "previous": "乃以酈食其為廣野君，酈商為將，將陳留兵，與偕攻開封，開封未拔。",
        "next": "楊熊走之滎陽，二世使使者斬以徇。"
      }
    },
    {
      "id": "s0168",
      "type": "paragraph",
      "chinese": "楊熊走之滎陽，二世使使者斬以徇。",
      "literal": "Yang Xiong fled to Yingyang; the Second Emperor sent an envoy to behead him as a warning.",
      "idiomatic": "Yang Xiong fled to Yingyang. The Second Emperor sent an envoy to behead him as a public warning.",
      "context": {
        "previous": "西與秦將楊熊戰白馬，又戰曲遇東，大破之。",
        "next": "南攻潁陽，屠之。"
      }
    },
    {
      "id": "s0169",
      "type": "paragraph",
      "chinese": "南攻潁陽，屠之。",
      "literal": "They attacked Yingyang to the south and massacred it.",
      "idiomatic": "They attacked Yingyang to the south and massacred its inhabitants.",
      "context": {
        "previous": "楊熊走之滎陽，二世使使者斬以徇。",
        "next": "因張良遂略韓地轘轅。"
      }
    },
    {
      "id": "s0170",
      "type": "paragraph",
      "chinese": "因張良遂略韓地轘轅。",
      "literal": "Through Zhang Liang they then took the territory of Han at Huanyuan.",
      "idiomatic": "Through Zhang Liang they then seized Han territory at Huanyuan.",
      "context": {
        "previous": "南攻潁陽，屠之。"
      }
    },
    {
      "id": "s0171",
      "type": "paragraph",
      "chinese": "當是時，趙別將司馬卬方欲渡河入關，沛公乃北攻平陰，絕河津。",
      "literal": "At that time, Zhao's separate general Sima Ang was about to cross the Yellow River to enter the passes; the Duke of Pei then attacked Pingyin to the north, cutting off the river ford.",
      "idiomatic": "At that time, Zhao's separate general Sima Ang was about to cross the Yellow River into the passes. The Duke of Pei then attacked Pingyin to the north, cutting off the river crossing.",
      "context": {
        "next": "南，戰雒陽東，軍不利，還至陽城，收軍中馬騎，與南陽守齮戰犨東，破之。"
      }
    },
    {
      "id": "s0172",
      "type": "paragraph",
      "chinese": "南，戰雒陽東，軍不利，還至陽城，收軍中馬騎，與南陽守齮戰犨東，破之。",
      "literal": "Going south, they fought east of Luoyang; the army went unfavorably, so they returned to Yangcheng, gathered cavalry within the army, and fought with Nanyang Administrator Qi east of Chu, breaking him.",
      "idiomatic": "Going south, they fought east of Luoyang, but the army fared poorly. They returned to Yangcheng, gathered cavalry from their forces, and fought Nanyang Administrator Qi east of Chu, defeating him.",
      "context": {
        "previous": "當是時，趙別將司馬卬方欲渡河入關，沛公乃北攻平陰，絕河津。",
        "next": "略南陽郡，南陽守齮走，保城守宛。"
      }
    },
    {
      "id": "s0173",
      "type": "paragraph",
      "chinese": "略南陽郡，南陽守齮走，保城守宛。",
      "literal": "They took Nanyang Commandery; Administrator Qi fled and defended and held the city of Wan.",
      "idiomatic": "They seized Nanyang Commandery. Administrator Qi fled and defended the city of Wan.",
      "context": {
        "previous": "南，戰雒陽東，軍不利，還至陽城，收軍中馬騎，與南陽守齮戰犨東，破之。",
        "next": "沛公引兵過而西。"
      }
    },
    {
      "id": "s0174",
      "type": "paragraph",
      "chinese": "沛公引兵過而西。",
      "literal": "The Duke of Pei led his troops to pass by and go west.",
      "idiomatic": "The Duke of Pei led his troops past and continued west.",
      "context": {
        "previous": "略南陽郡，南陽守齮走，保城守宛。",
        "next": "張良諫曰：「沛公雖欲急入關，秦兵尚眾，距險。"
      }
    },
    {
      "id": "s0175",
      "type": "paragraph",
      "chinese": "張良諫曰：「沛公雖欲急入關，秦兵尚眾，距險。",
      "literal": "Zhang Liang remonstrated, saying: \"Though the Duke of Pei wishes to urgently enter the passes, Qin troops are still numerous and hold dangerous positions.",
      "idiomatic": "Zhang Liang remonstrated, saying: 'Though the Duke of Pei wishes to urgently enter the passes, Qin troops are still numerous and hold dangerous defensive positions.'",
      "context": {
        "previous": "沛公引兵過而西。",
        "next": "今不下宛，宛從後擊，彊秦在前，此危道也。」"
      }
    },
    {
      "id": "s0176",
      "type": "paragraph",
      "chinese": "今不下宛，宛從後擊，彊秦在前，此危道也。」",
      "literal": "Now if we do not take Wan, Wan will strike from behind, while strong Qin is ahead—this is a dangerous path.\"",
      "idiomatic": "If we don't take Wan now, Wan will strike from behind while strong Qin forces are ahead—this is a dangerous path.''",
      "context": {
        "previous": "張良諫曰：「沛公雖欲急入關，秦兵尚眾，距險。",
        "next": "於是沛公乃夜引兵從他道還，更旗幟，黎明，圍宛城三匝。"
      }
    },
    {
      "id": "s0177",
      "type": "paragraph",
      "chinese": "於是沛公乃夜引兵從他道還，更旗幟，黎明，圍宛城三匝。",
      "literal": "Thereupon the Duke of Pei led his troops by night from another road and returned, changed flags and banners, and at dawn surrounded Wan city three times round.",
      "idiomatic": "Thereupon the Duke of Pei led his troops by night along another road back, changed the flags and banners, and at dawn surrounded Wan city three times over.",
      "context": {
        "previous": "今不下宛，宛從後擊，彊秦在前，此危道也。」",
        "next": "南陽守欲自剄。"
      }
    },
    {
      "id": "s0178",
      "type": "paragraph",
      "chinese": "南陽守欲自剄。",
      "literal": "The Administrator of Nanyang wished to slit his own throat.",
      "idiomatic": "The Administrator of Nanyang wished to commit suicide.",
      "context": {
        "previous": "於是沛公乃夜引兵從他道還，更旗幟，黎明，圍宛城三匝。",
        "next": "其舍人陳恢曰：「死未晚也。」"
      }
    },
    {
      "id": "s0179",
      "type": "paragraph",
      "chinese": "其舍人陳恢曰：「死未晚也。」",
      "literal": "His retainer Chen Hui said: \"It is not too late to die.\"",
      "idiomatic": "His retainer Chen Hui said: 'It is not too late to die.''",
      "context": {
        "previous": "南陽守欲自剄。",
        "next": "乃踰城見沛公，曰：「臣聞足下約，先入咸陽者王之。"
      }
    },
    {
      "id": "s0180",
      "type": "paragraph",
      "chinese": "乃踰城見沛公，曰：「臣聞足下約，先入咸陽者王之。",
      "literal": "He then climbed over the city wall to see the Duke of Pei and said: \"I have heard of your agreement: he who first enters Xianyang shall be its king.",
      "idiomatic": "He then climbed over the city wall to see the Duke of Pei and said: 'I have heard of your agreement: whoever first enters Xianyang shall be made its king.'",
      "context": {
        "previous": "其舍人陳恢曰：「死未晚也。」",
        "next": "今足下留守宛。"
      }
    },
    {
      "id": "s0181",
      "type": "paragraph",
      "chinese": "今足下留守宛。",
      "literal": "Now you remain besieging Wan.",
      "idiomatic": "Now you remain besieging Wan.'",
      "context": {
        "previous": "乃踰城見沛公，曰：「臣聞足下約，先入咸陽者王之。",
        "next": "宛，大郡之都也，連城數十，人民眾，積蓄多，吏人自以為降必死，故皆堅守乘城。"
      }
    },
    {
      "id": "s0182",
      "type": "paragraph",
      "chinese": "宛，大郡之都也，連城數十，人民眾，積蓄多，吏人自以為降必死，故皆堅守乘城。",
      "literal": "Wan is the capital of a great commandery with dozens of connected cities, numerous people, and abundant stores; the officials and people believe that if they surrender they will certainly die, therefore all firmly defend and man the walls.",
      "idiomatic": "Wan is the capital of a major commandery with dozens of connected cities, numerous people, and abundant supplies. The officials and people believe that if they surrender they will certainly die, so they all defend firmly and man the walls.",
      "context": {
        "previous": "今足下留守宛。",
        "next": "今足下盡日止攻，士死傷者必多；"
      }
    },
    {
      "id": "s0183",
      "type": "paragraph",
      "chinese": "今足下盡日止攻，士死傷者必多；",
      "literal": "Now if you spend the whole day attacking, officers and troops who die or are wounded will certainly be many;",
      "idiomatic": "If you spend the whole day attacking now, many officers and troops will certainly die or be wounded;",
      "context": {
        "previous": "宛，大郡之都也，連城數十，人民眾，積蓄多，吏人自以為降必死，故皆堅守乘城。",
        "next": "引兵去宛，宛必隨足下後：足下前則失咸陽之約，後又有彊宛之患。"
      }
    },
    {
      "id": "s0184",
      "type": "paragraph",
      "chinese": "引兵去宛，宛必隨足下後：足下前則失咸陽之約，後又有彊宛之患。",
      "literal": "if you lead troops away from Wan, Wan will certainly follow behind you; ahead you will lose the agreement about Xianyang, and behind you will have the trouble of strong Wan.",
      "idiomatic": "if you lead troops away from Wan, Wan will certainly follow behind you. Ahead you will lose the agreement about Xianyang, and behind you will have the trouble of strong Wan.",
      "context": {
        "previous": "今足下盡日止攻，士死傷者必多；",
        "next": "為足下計，莫若約降，封其守，因使止守，引其甲卒與之西。"
      }
    },
    {
      "id": "s0185",
      "type": "paragraph",
      "chinese": "為足下計，莫若約降，封其守，因使止守，引其甲卒與之西。",
      "literal": "Planning for you, nothing would be better than to agree to accept surrender, enfeoff their administrator, consequently have him remain defending, and lead his armored troops with you westward.",
      "idiomatic": "Planning for you, nothing would be better than to agree to accept their surrender, enfeoff their administrator, have him remain defending, and lead his armored troops westward with you.",
      "context": {
        "previous": "引兵去宛，宛必隨足下後：足下前則失咸陽之約，後又有彊宛之患。",
        "next": "諸城未下者，聞聲爭開門而待，足下通行無所累。」"
      }
    },
    {
      "id": "s0186",
      "type": "paragraph",
      "chinese": "諸城未下者，聞聲爭開門而待，足下通行無所累。」",
      "literal": "Cities that have not yet surrendered, hearing the news, will compete to open their gates and wait; you will pass through everywhere without obstruction.\"",
      "idiomatic": "Cities that have not yet surrendered, hearing this news, will compete to open their gates and wait for you. You will pass through everywhere without obstruction.''",
      "context": {
        "previous": "為足下計，莫若約降，封其守，因使止守，引其甲卒與之西。",
        "next": "沛公曰：「善。」"
      }
    },
    {
      "id": "s0187",
      "type": "paragraph",
      "chinese": "沛公曰：「善。」",
      "literal": "The Duke of Pei said: \"Excellent.\"",
      "idiomatic": "The Duke of Pei said: 'Excellent.''",
      "context": {
        "previous": "諸城未下者，聞聲爭開門而待，足下通行無所累。」",
        "next": "乃以宛守為殷侯，封陳恢千戶。"
      }
    },
    {
      "id": "s0188",
      "type": "paragraph",
      "chinese": "乃以宛守為殷侯，封陳恢千戶。",
      "literal": "He then made the Administrator of Wan Marquis of Yin and enfeoffed Chen Hui with a thousand households.",
      "idiomatic": "He made the Administrator of Wan Marquis of Yin and granted Chen Hui fiefs worth a thousand households.",
      "context": {
        "previous": "沛公曰：「善。」",
        "next": "引兵西，無不下者。"
      }
    },
    {
      "id": "s0189",
      "type": "paragraph",
      "chinese": "引兵西，無不下者。",
      "literal": "Leading troops westward, there were none that did not surrender.",
      "idiomatic": "Leading troops westward, none failed to surrender.",
      "context": {
        "previous": "乃以宛守為殷侯，封陳恢千戶。",
        "next": "至丹水，高武侯鰓、襄侯王陵降西陵。"
      }
    },
    {
      "id": "s0190",
      "type": "paragraph",
      "chinese": "至丹水，高武侯鰓、襄侯王陵降西陵。",
      "literal": "Reaching Danshui, Marquis Gaowu Sai and Marquis Xiang Wang Ling surrendered at Xiling.",
      "idiomatic": "Upon reaching Danshui, Marquis Gaowu Sai and Marquis Xiang Wang Ling surrendered at Xiling.",
      "context": {
        "previous": "引兵西，無不下者。",
        "next": "還攻胡陽，遇番君別將梅鋗，與皆，降析、酈。"
      }
    },
    {
      "id": "s0191",
      "type": "paragraph",
      "chinese": "還攻胡陽，遇番君別將梅鋗，與皆，降析、酈。",
      "literal": "Returning they attacked Huyang, met Lord Fan's separate general Mei Xuan, went together with them, and accepted the surrender of Xi and Li.",
      "idiomatic": "Returning, they attacked Huyang, met Lord Fan's separate general Mei Xuan, joined forces with them, and accepted the surrender of Xi and Li.",
      "context": {
        "previous": "至丹水，高武侯鰓、襄侯王陵降西陵。",
        "next": "遣魏人甯昌使秦，使者未來。"
      }
    },
    {
      "id": "s0192",
      "type": "paragraph",
      "chinese": "遣魏人甯昌使秦，使者未來。",
      "literal": "They dispatched Ning Chang of Wei as envoy to Qin, but the envoy had not yet returned.",
      "idiomatic": "They sent Ning Chang of Wei as an envoy to Qin, but he had not yet returned.",
      "context": {
        "previous": "還攻胡陽，遇番君別將梅鋗，與皆，降析、酈。",
        "next": "是時章邯已以軍降項羽於趙矣。"
      }
    },
    {
      "id": "s0193",
      "type": "paragraph",
      "chinese": "是時章邯已以軍降項羽於趙矣。",
      "literal": "At this time Zhang Han had already surrendered his army to Xiang Yu at Zhao.",
      "idiomatic": "By this time, Zhang Han had already surrendered his army to Xiang Yu in Zhao.",
      "context": {
        "previous": "遣魏人甯昌使秦，使者未來。"
      }
    },
    {
      "id": "s0194",
      "type": "paragraph",
      "chinese": "初，項羽與宋義北救趙，及項羽殺宋義，代為上將軍，諸將黥布皆屬，破秦將王離軍，降章邯，諸侯皆附。",
      "literal": "Initially, Xiang Yu with Song Yi had gone north to rescue Zhao; when Xiang Yu killed Song Yi and replaced him as Supreme General, all the generals including Qing Bu were subordinated to him; he broke Qin general Wang Li's army, accepted Zhang Han's surrender, and all the feudal lords attached themselves.",
      "idiomatic": "Initially, Xiang Yu and Song Yi had gone north to rescue Zhao. When Xiang Yu killed Song Yi and replaced him as Supreme General, all the generals including Qing Bu were subordinated to him. He defeated Qin general Wang Li's army, accepted Zhang Han's surrender, and all the feudal lords attached themselves.",
      "context": {
        "next": "及趙高已殺二世，使人來，欲約分王關中。"
      }
    },
    {
      "id": "s0195",
      "type": "paragraph",
      "chinese": "及趙高已殺二世，使人來，欲約分王關中。",
      "literal": "When Zhao Gao had already killed the Second Emperor, he sent men to come wishing to make an agreement to divide and rule Guanzhong.",
      "idiomatic": "When Zhao Gao had already assassinated the Second Emperor, he sent messengers wanting to negotiate dividing Guanzhong between them.",
      "context": {
        "previous": "初，項羽與宋義北救趙，及項羽殺宋義，代為上將軍，諸將黥布皆屬，破秦將王離軍，降章邯，諸侯皆附。",
        "next": "沛公以為詐，乃用張良計，使酈生、陸賈往說秦將，啗以利，因襲攻武關，破之。"
      }
    },
    {
      "id": "s0196",
      "type": "paragraph",
      "chinese": "沛公以為詐，乃用張良計，使酈生、陸賈往說秦將，啗以利，因襲攻武關，破之。",
      "literal": "The Duke of Pei considered this deceitful, so he used Zhang Liang's stratagem, sending Li Sheng and Lu Jia to persuade the Qin generals, enticing them with benefits, and consequently launched a surprise attack on Wuguan, breaking it.",
      "idiomatic": "The Duke of Pei considered this deceitful, so he used Zhang Liang's stratagem. He sent Li Sheng and Lu Jia to persuade the Qin generals, enticing them with benefits, and consequently launched a surprise attack on Wuguan, breaking through it.",
      "context": {
        "previous": "及趙高已殺二世，使人來，欲約分王關中。",
        "next": "又與秦軍戰於藍田南，益張疑兵旗幟，諸所過毋得掠鹵，秦人喜，秦軍解，因大破之。"
      }
    },
    {
      "id": "s0197",
      "type": "paragraph",
      "chinese": "又與秦軍戰於藍田南，益張疑兵旗幟，諸所過毋得掠鹵，秦人喜，秦軍解，因大破之。",
      "literal": "They again fought with the Qin army south of Lantian, increased deceptive troop flags and banners; wherever they passed they were not to plunder; the Qin people were pleased, the Qin army relaxed, and they consequently greatly broke them.",
      "idiomatic": "They again fought the Qin army south of Lantian, increased their deceptive troop flags and banners. Wherever they passed they were forbidden to plunder. The Qin people were pleased, the Qin army relaxed, and they consequently decisively defeated them.",
      "context": {
        "previous": "沛公以為詐，乃用張良計，使酈生、陸賈往說秦將，啗以利，因襲攻武關，破之。",
        "next": "又戰其北，大破之。"
      }
    },
    {
      "id": "s0198",
      "type": "paragraph",
      "chinese": "又戰其北，大破之。",
      "literal": "Again fighting to their north, they greatly broke them.",
      "idiomatic": "Again fighting to the north, they decisively defeated them.",
      "context": {
        "previous": "又與秦軍戰於藍田南，益張疑兵旗幟，諸所過毋得掠鹵，秦人喜，秦軍解，因大破之。",
        "next": "乘勝，遂破之。"
      }
    },
    {
      "id": "s0199",
      "type": "paragraph",
      "chinese": "乘勝，遂破之。",
      "literal": "Riding victory, they then broke them completely.",
      "idiomatic": "Riding their victory, they then broke them completely.",
      "context": {
        "previous": "又戰其北，大破之。"
      }
    },
    {
      "id": "s0200",
      "type": "paragraph",
      "chinese": "漢元年十月，沛公兵遂先諸侯至霸上。",
      "literal": "In the tenth month of the first year of Han, the Duke of Pei's troops were thus first among the feudal lords to reach Bashang.",
      "idiomatic": "In the tenth month of the first year of Han, the Duke of Pei's troops thus arrived first among the feudal lords at Bashang.",
      "context": {
        "next": "秦王子嬰素車白馬，系頸以組，封皇帝璽符節，降軹道旁。"
      }
    },
    {
      "id": "s0201",
      "type": "paragraph",
      "chinese": "秦王子嬰素車白馬，系頸以組，封皇帝璽符節，降軹道旁。",
      "literal": "The King of Qin, Ziying, in a plain chariot drawn by white horses, with a cord tied around his neck, sealed the Emperor's seal, tallies, and tokens, and surrendered by the side of Zhidao.",
      "idiomatic": "The King of Qin Ziying, in a plain chariot drawn by white horses with a cord tied around his neck, sealed the Emperor's seal, tallies, and tokens, and surrendered by the side of Zhidao.",
      "context": {
        "previous": "漢元年十月，沛公兵遂先諸侯至霸上。",
        "next": "諸將或言誅秦王。"
      }
    },
    {
      "id": "s0202",
      "type": "paragraph",
      "chinese": "諸將或言誅秦王。",
      "literal": "Some generals spoke of executing the King of Qin.",
      "idiomatic": "Some generals suggested executing the King of Qin.",
      "context": {
        "previous": "秦王子嬰素車白馬，系頸以組，封皇帝璽符節，降軹道旁。",
        "next": "沛公曰：「始懷王遣我，固以能寬容；"
      }
    },
    {
      "id": "s0203",
      "type": "paragraph",
      "chinese": "沛公曰：「始懷王遣我，固以能寬容；",
      "literal": "The Duke of Pei said: \"At first when King Huai sent me, it was precisely because I am capable of being tolerant and magnanimous;",
      "idiomatic": "The Duke of Pei said: 'At first when King Huai sent me, it was precisely because I am capable of being tolerant and magnanimous;'",
      "context": {
        "previous": "諸將或言誅秦王。",
        "next": "且人已服降，又殺之，不祥。」"
      }
    },
    {
      "id": "s0204",
      "type": "paragraph",
      "chinese": "且人已服降，又殺之，不祥。」",
      "literal": "moreover, the man has already submitted in surrender—to kill him again would be inauspicious.\"",
      "idiomatic": "moreover, the man has already submitted and surrendered—to kill him now would be inauspicious.''",
      "context": {
        "previous": "沛公曰：「始懷王遣我，固以能寬容；",
        "next": "乃以秦王屬吏，遂西入咸陽。"
      }
    },
    {
      "id": "s0205",
      "type": "paragraph",
      "chinese": "乃以秦王屬吏，遂西入咸陽。",
      "literal": "He then handed the King of Qin over to officials and proceeded west into Xianyang.",
      "idiomatic": "He turned the King of Qin over to the officials and proceeded west into Xianyang.",
      "context": {
        "previous": "且人已服降，又殺之，不祥。」",
        "next": "欲止宮休舍，樊噲、張良諫，乃封秦重寶財物府庫，還軍霸上。"
      }
    },
    {
      "id": "s0206",
      "type": "paragraph",
      "chinese": "欲止宮休舍，樊噲、張良諫，乃封秦重寶財物府庫，還軍霸上。",
      "literal": "He wished to stop and rest in the palaces, but Fan Kuai and Zhang Liang remonstrated; he then sealed Qin's precious treasures, wealth, and goods in the treasuries, and returned his army to Bashang.",
      "idiomatic": "He wished to stop and rest in the palaces, but Fan Kuai and Zhang Liang remonstrated. He then sealed Qin's precious treasures and wealth in the treasuries and returned his army to Bashang.",
      "context": {
        "previous": "乃以秦王屬吏，遂西入咸陽。",
        "next": "召諸縣父老豪桀曰：「父老苦秦苛法久矣，誹謗者族，偶語者棄市。"
      }
    },
    {
      "id": "s0207",
      "type": "paragraph",
      "chinese": "召諸縣父老豪桀曰：「父老苦秦苛法久矣，誹謗者族，偶語者棄市。",
      "literal": "He summoned the elders and heroes of the various counties and said: \"The elders have long suffered under Qin's harsh laws; those who spoke ill had their clans exterminated, those who spoke together in pairs were executed in the marketplace.",
      "idiomatic": "He summoned the elders and heroes of the various counties and said: 'The elders have long suffered under Qin's harsh laws. Those who spoke ill had their clans exterminated, those who spoke together in pairs were executed in the marketplace.'",
      "context": {
        "previous": "欲止宮休舍，樊噲、張良諫，乃封秦重寶財物府庫，還軍霸上。",
        "next": "吾與諸侯約，先入關者王之，吾當王關中。"
      }
    },
    {
      "id": "s0208",
      "type": "paragraph",
      "chinese": "吾與諸侯約，先入關者王之，吾當王關中。",
      "literal": "I made an agreement with the feudal lords: he who first enters the passes shall be its king; I should be king of Guanzhong.",
      "idiomatic": "I made an agreement with the feudal lords: whoever first enters the passes shall be its king. I should be king of Guanzhong.",
      "context": {
        "previous": "召諸縣父老豪桀曰：「父老苦秦苛法久矣，誹謗者族，偶語者棄市。",
        "next": "與父老約，法三章耳：殺人者死，傷人及盜抵罪。"
      }
    },
    {
      "id": "s0209",
      "type": "paragraph",
      "chinese": "與父老約，法三章耳：殺人者死，傷人及盜抵罪。",
      "literal": "I make an agreement with the elders—laws of only three articles: he who kills shall die, he who wounds others or steals shall be punished accordingly.",
      "idiomatic": "I make an agreement with the elders—laws of only three articles: whoever kills shall die, whoever wounds others or steals shall be punished accordingly.",
      "context": {
        "previous": "吾與諸侯約，先入關者王之，吾當王關中。",
        "next": "餘悉除去秦法。"
      }
    },
    {
      "id": "s0210",
      "type": "paragraph",
      "chinese": "餘悉除去秦法。",
      "literal": "All the rest of Qin's laws are eliminated.",
      "idiomatic": "All remaining Qin laws are abolished.",
      "context": {
        "previous": "與父老約，法三章耳：殺人者死，傷人及盜抵罪。",
        "next": "諸吏人皆案堵如故。"
      }
    },
    {
      "id": "s0211",
      "type": "paragraph",
      "chinese": "諸吏人皆案堵如故。",
      "literal": "All officials and people shall remain peacefully as before.",
      "idiomatic": "All officials and people are to stay peacefully in their places as before.",
      "context": {
        "previous": "餘悉除去秦法。",
        "next": "凡吾所以來，為父老除害，非有所侵暴，無恐！"
      }
    },
    {
      "id": "s0212",
      "type": "paragraph",
      "chinese": "凡吾所以來，為父老除害，非有所侵暴，無恐！",
      "literal": "The reason I have come is to eliminate harm for the elders, not to invade or commit violence—have no fear!",
      "idiomatic": "I have come to eliminate harm for you elders, not to invade or commit violence—have no fear!",
      "context": {
        "previous": "諸吏人皆案堵如故。",
        "next": "且吾所以還軍霸上，待諸侯至而定約束耳。」"
      }
    },
    {
      "id": "s0213",
      "type": "paragraph",
      "chinese": "且吾所以還軍霸上，待諸侯至而定約束耳。」",
      "literal": "Moreover, the reason I have returned my army to Bashang is to wait for the feudal lords to arrive and establish agreements.\"",
      "idiomatic": "Moreover, the reason I have returned my army to Bashang is to wait for the feudal lords to arrive and establish agreements.''",
      "context": {
        "previous": "凡吾所以來，為父老除害，非有所侵暴，無恐！",
        "next": "乃使人與秦吏行縣鄉邑，告諭之。"
      }
    },
    {
      "id": "s0214",
      "type": "paragraph",
      "chinese": "乃使人與秦吏行縣鄉邑，告諭之。",
      "literal": "He then sent people with Qin officials to go through the counties, districts, and townships to inform and instruct them.",
      "idiomatic": "He then sent people along with Qin officials to go through the counties, districts, and townships to inform and instruct them.",
      "context": {
        "previous": "且吾所以還軍霸上，待諸侯至而定約束耳。」",
        "next": "秦人大喜，爭持牛羊酒食獻饗軍士。"
      }
    },
    {
      "id": "s0215",
      "type": "paragraph",
      "chinese": "秦人大喜，爭持牛羊酒食獻饗軍士。",
      "literal": "The Qin people were greatly pleased and competed to bring oxen, sheep, wine, and food to offer feasts for the soldiers.",
      "idiomatic": "The Qin people were overjoyed and vied to bring cattle, sheep, wine, and food to feast the soldiers.",
      "context": {
        "previous": "乃使人與秦吏行縣鄉邑，告諭之。",
        "next": "沛公又讓不受，曰：「倉粟多，非乏，不欲費人。」"
      }
    },
    {
      "id": "s0216",
      "type": "paragraph",
      "chinese": "沛公又讓不受，曰：「倉粟多，非乏，不欲費人。」",
      "literal": "The Duke of Pei again declined and would not accept, saying: \"The granaries have abundant grain; there is no scarcity—I do not wish to burden the people.\"",
      "idiomatic": "The Duke of Pei again declined and would not accept, saying: 'The granaries have abundant grain; there is no scarcity—I do not wish to burden the people.''",
      "context": {
        "previous": "秦人大喜，爭持牛羊酒食獻饗軍士。",
        "next": "人又益喜，唯恐沛公不為秦王。"
      }
    },
    {
      "id": "s0217",
      "type": "paragraph",
      "chinese": "人又益喜，唯恐沛公不為秦王。",
      "literal": "The people were even more pleased and only feared the Duke of Pei would not become King of Qin.",
      "idiomatic": "The people were even more delighted and feared only that the Duke of Pei might not become King of Qin.",
      "context": {
        "previous": "沛公又讓不受，曰：「倉粟多，非乏，不欲費人。」"
      }
    },
    {
      "id": "s0218",
      "type": "paragraph",
      "chinese": "或說沛公曰：「秦富十倍天下，地形彊。",
      "literal": "Someone persuaded the Duke of Pei, saying: \"Qin is ten times richer than all under Heaven, and its terrain is strong.",
      "idiomatic": "Someone persuaded the Duke of Pei, saying: 'Qin is ten times richer than all under Heaven, and its terrain is strong.'",
      "context": {
        "next": "今聞章邯降項羽，項羽乃號為雍王，王關中。"
      }
    },
    {
      "id": "s0219",
      "type": "paragraph",
      "chinese": "今聞章邯降項羽，項羽乃號為雍王，王關中。",
      "literal": "Now I hear Zhang Han has surrendered to Xiang Yu, and Xiang Yu has taken the title King of Yong to rule Guanzhong.",
      "idiomatic": "Now I hear that Zhang Han has surrendered to Xiang Yu, who has styled himself King of Yong to rule Guanzhong.",
      "context": {
        "previous": "或說沛公曰：「秦富十倍天下，地形彊。",
        "next": "今則來，沛公恐不得有此。"
      }
    },
    {
      "id": "s0220",
      "type": "paragraph",
      "chinese": "今則來，沛公恐不得有此。",
      "literal": "Now if he comes, Duke of Pei fears cannot possess this.",
      "idiomatic": "Now if he comes, Duke of Pei fears he cannot possess this.",
      "context": {
        "previous": "今聞章邯降項羽，項羽乃號為雍王，王關中。",
        "next": "可急使兵守函谷關，無內諸侯軍，稍徵關中兵以自益，距之。」"
      }
    },
    {
      "id": "s0221",
      "type": "paragraph",
      "chinese": "可急使兵守函谷關，無內諸侯軍，稍徵關中兵以自益，距之。」",
      "literal": "You should urgently send troops to defend Hangu Pass, not admit the feudal lords' armies, and gradually conscript troops from Guanzhong to strengthen yourself and resist them.\"",
      "idiomatic": "You should urgently send troops to defend Hangu Pass, not admit the feudal lords' armies, gradually conscript troops from Guanzhong to strengthen yourself, and resist them.''",
      "context": {
        "previous": "今則來，沛公恐不得有此。",
        "next": "沛公然其計，從之。"
      }
    },
    {
      "id": "s0222",
      "type": "paragraph",
      "chinese": "沛公然其計，從之。",
      "literal": "The Duke of Pei agreed with this plan and followed it.",
      "idiomatic": "The Duke of Pei approved this plan and adopted it.",
      "context": {
        "previous": "可急使兵守函谷關，無內諸侯軍，稍徵關中兵以自益，距之。」",
        "next": "十一月中，項羽果率諸侯兵西，欲入關，關門閉。"
      }
    },
    {
      "id": "s0223",
      "type": "paragraph",
      "chinese": "十一月中，項羽果率諸侯兵西，欲入關，關門閉。",
      "literal": "In the eleventh month, Xiang Yu indeed led the feudal lords' troops west wishing to enter the passes, but the pass gates were closed.",
      "idiomatic": "In the eleventh month, Xiang Yu indeed led the feudal lords' troops west to enter the passes, but the gates were closed.",
      "context": {
        "previous": "沛公然其計，從之。",
        "next": "聞沛公已定關中，大怒，使黥布等攻破函谷關。"
      }
    },
    {
      "id": "s0224",
      "type": "paragraph",
      "chinese": "聞沛公已定關中，大怒，使黥布等攻破函谷關。",
      "literal": "Hearing that the Duke of Pei had already settled Guanzhong, he was greatly enraged and sent Qing Bu and others to attack and break through Hangu Pass.",
      "idiomatic": "Upon hearing that the Duke of Pei had already pacified Guanzhong, he flew into a rage and sent Qing Bu and others to smash through Hangu Pass.",
      "context": {
        "previous": "十一月中，項羽果率諸侯兵西，欲入關，關門閉。",
        "next": "十二月中，遂至戲。"
      }
    },
    {
      "id": "s0225",
      "type": "paragraph",
      "chinese": "十二月中，遂至戲。",
      "literal": "In the twelfth month, they then reached Xi.",
      "idiomatic": "By the twelfth month, they had reached Xi.",
      "context": {
        "previous": "聞沛公已定關中，大怒，使黥布等攻破函谷關。",
        "next": "沛公左司馬曹無傷聞項王怒，欲攻沛公，使人言項羽曰：「沛公欲王關中，令子嬰為相，珍寶盡有之。」"
      }
    },
    {
      "id": "s0226",
      "type": "paragraph",
      "chinese": "沛公左司馬曹無傷聞項王怒，欲攻沛公，使人言項羽曰：「沛公欲王關中，令子嬰為相，珍寶盡有之。」",
      "literal": "The Duke of Pei's Left Major Cao Wushang heard that King Xiang was angry and wished to attack the Duke of Pei, so he sent someone to tell Xiang Yu: \"The Duke of Pei wishes to be king of Guanzhong, make Ziying prime minister, and possess all the precious treasures.\"",
      "idiomatic": "The Duke of Pei's Left Major Cao Wushang heard that King Xiang was angry and wished to attack the Duke of Pei, so he sent someone to tell Xiang Yu: 'The Duke of Pei wishes to be king of Guanzhong, make Ziying prime minister, and possess all the precious treasures.''",
      "context": {
        "previous": "十二月中，遂至戲。",
        "next": "欲以求封。"
      }
    },
    {
      "id": "s0227",
      "type": "paragraph",
      "chinese": "欲以求封。",
      "literal": "He wished to seek enfeoffment by this.",
      "idiomatic": "He wanted to use this to seek a fief.",
      "context": {
        "previous": "沛公左司馬曹無傷聞項王怒，欲攻沛公，使人言項羽曰：「沛公欲王關中，令子嬰為相，珍寶盡有之。」",
        "next": "亞父勸項羽擊沛公。"
      }
    },
    {
      "id": "s0228",
      "type": "paragraph",
      "chinese": "亞父勸項羽擊沛公。",
      "literal": "The Second Father urged Xiang Yu to strike the Duke of Pei.",
      "idiomatic": "Fan Zeng urged Xiang Yu to attack the Duke of Pei.",
      "context": {
        "previous": "欲以求封。",
        "next": "方饗士，旦日合戰。"
      }
    },
    {
      "id": "s0229",
      "type": "paragraph",
      "chinese": "方饗士，旦日合戰。",
      "literal": "They were feasting the troops and would join battle the next day.",
      "idiomatic": "They were hosting a banquet for the troops, with battle planned for the next day.",
      "context": {
        "previous": "亞父勸項羽擊沛公。",
        "next": "是時項羽兵四十萬，號百萬。"
      }
    },
    {
      "id": "s0230",
      "type": "paragraph",
      "chinese": "是時項羽兵四十萬，號百萬。",
      "literal": "At that time Xiang Yu had four hundred thousand troops, claimed to be a million.",
      "idiomatic": "At that time Xiang Yu had 400,000 troops, though he claimed a million.",
      "context": {
        "previous": "方饗士，旦日合戰。",
        "next": "沛公兵十萬，號二十萬，力不敵。"
      }
    },
    {
      "id": "s0231",
      "type": "paragraph",
      "chinese": "沛公兵十萬，號二十萬，力不敵。",
      "literal": "The Duke of Pei had one hundred thousand troops, claimed to be two hundred thousand; in strength they were no match.",
      "idiomatic": "The Duke of Pei had 100,000 troops, though he claimed 200,000; their strength was no match.",
      "context": {
        "previous": "是時項羽兵四十萬，號百萬。",
        "next": "會項伯欲活張良，夜往見良，因以文諭項羽，項羽乃止。"
      }
    },
    {
      "id": "s0232",
      "type": "paragraph",
      "chinese": "會項伯欲活張良，夜往見良，因以文諭項羽，項羽乃止。",
      "literal": "It happened that Xiang Bo wished to save Zhang Liang's life; by night he went to see Liang and consequently with elegant words persuaded Xiang Yu, and Xiang Yu then desisted.",
      "idiomatic": "It happened that Xiang Bo wished to save Zhang Liang's life. By night he went to see Liang and consequently with elegant words persuaded Xiang Yu, and Xiang Yu then desisted.",
      "context": {
        "previous": "沛公兵十萬，號二十萬，力不敵。",
        "next": "沛公從百餘騎，驅之鴻門，見謝項羽。"
      }
    },
    {
      "id": "s0233",
      "type": "paragraph",
      "chinese": "沛公從百餘騎，驅之鴻門，見謝項羽。",
      "literal": "The Duke of Pei with over a hundred cavalry galloped to Hongmen to see and apologize to Xiang Yu.",
      "idiomatic": "The Duke of Pei rode with over a hundred cavalrymen to Hongmen to meet Xiang Yu and offer apologies.",
      "context": {
        "previous": "會項伯欲活張良，夜往見良，因以文諭項羽，項羽乃止。",
        "next": "項羽曰：「此沛公左司馬曹無傷言之。"
      }
    },
    {
      "id": "s0234",
      "type": "paragraph",
      "chinese": "項羽曰：「此沛公左司馬曹無傷言之。",
      "literal": "Xiang Yu said: \"This was told by the Duke of Pei's Left Major Cao Wushang.",
      "idiomatic": "Xiang Yu said: 'This was told by the Duke of Pei's Left Major Cao Wushang.'",
      "context": {
        "previous": "沛公從百餘騎，驅之鴻門，見謝項羽。",
        "next": "不然，籍何以生此！」"
      }
    },
    {
      "id": "s0235",
      "type": "paragraph",
      "chinese": "不然，籍何以生此！」",
      "literal": "If not, how would I have come to this suspicion!\"",
      "idiomatic": "If not, how would I have come to this suspicion!''",
      "context": {
        "previous": "項羽曰：「此沛公左司馬曹無傷言之。",
        "next": "沛公以樊噲、張良故，得解歸。"
      }
    },
    {
      "id": "s0236",
      "type": "paragraph",
      "chinese": "沛公以樊噲、張良故，得解歸。",
      "literal": "The Duke of Pei through Fan Kuai and Zhang Liang's efforts was able to be released and return.",
      "idiomatic": "Thanks to Fan Kuai and Zhang Liang, the Duke of Pei was able to slip away and return home.",
      "context": {
        "previous": "不然，籍何以生此！」",
        "next": "歸，立誅曹無傷。"
      }
    },
    {
      "id": "s0237",
      "type": "paragraph",
      "chinese": "歸，立誅曹無傷。",
      "literal": "Returning, he immediately executed Cao Wushang.",
      "idiomatic": "Upon returning, he immediately had Cao Wushang executed.",
      "context": {
        "previous": "沛公以樊噲、張良故，得解歸。"
      }
    },
    {
      "id": "s0238",
      "type": "paragraph",
      "chinese": "項羽遂西，屠燒咸陽秦宮室，所過無不殘破。",
      "literal": "Xiang Yu then went west, massacred and burned Xianyang and the Qin palace chambers; wherever he passed he completely destroyed everything.",
      "idiomatic": "Xiang Yu then went west, massacred and burned Xianyang and the Qin palace chambers. Wherever he passed he completely destroyed everything.",
      "context": {
        "next": "秦人大失望，然恐，不敢不服耳。"
      }
    },
    {
      "id": "s0239",
      "type": "paragraph",
      "chinese": "秦人大失望，然恐，不敢不服耳。",
      "literal": "The Qin people were greatly disappointed but were afraid and dared not disobey.",
      "idiomatic": "The Qin people were bitterly disappointed, but fear kept them obedient.",
      "context": {
        "previous": "項羽遂西，屠燒咸陽秦宮室，所過無不殘破。"
      }
    },
    {
      "id": "s0240",
      "type": "paragraph",
      "chinese": "項羽使人還報懷王。",
      "literal": "Xiang Yu sent men to report back to King Huai.",
      "idiomatic": "Xiang Yu sent messengers back to report to King Huai.",
      "context": {
        "next": "懷王曰：「如約。」"
      }
    },
    {
      "id": "s0241",
      "type": "paragraph",
      "chinese": "懷王曰：「如約。」",
      "literal": "King Huai said: \"According to the agreement.\"",
      "idiomatic": "King Huai said: 'According to the agreement.''",
      "context": {
        "previous": "項羽使人還報懷王。",
        "next": "項羽怨懷王不肯令與沛公俱西入關，而北救趙，後天下約。"
      }
    },
    {
      "id": "s0242",
      "type": "paragraph",
      "chinese": "項羽怨懷王不肯令與沛公俱西入關，而北救趙，後天下約。",
      "literal": "Xiang Yu resented that King Huai would not permit him to go west into the passes together with the Duke of Pei, but instead went north to rescue Zhao, coming after the agreement about all under Heaven.",
      "idiomatic": "Xiang Yu resented King Huai for not letting him enter the passes with the Duke of Pei, but instead sending him north to rescue Zhao after the agreement on dividing the empire.",
      "context": {
        "previous": "懷王曰：「如約。」",
        "next": "乃曰：「懷王者，吾家項梁所立耳，非有功伐，何以得主約！"
      }
    },
    {
      "id": "s0243",
      "type": "paragraph",
      "chinese": "乃曰：「懷王者，吾家項梁所立耳，非有功伐，何以得主約！",
      "literal": "He then said: \"King Huai was merely installed by my kinsman Xiang Liang; he has no achievements or victories—how can he preside over the agreement!",
      "idiomatic": "He then said: 'King Huai was merely installed by my kinsman Xiang Liang; he has no achievements or victories—how can he preside over the agreement!'",
      "context": {
        "previous": "項羽怨懷王不肯令與沛公俱西入關，而北救趙，後天下約。",
        "next": "本定天下，諸將及籍也。」"
      }
    },
    {
      "id": "s0244",
      "type": "paragraph",
      "chinese": "本定天下，諸將及籍也。」",
      "literal": "Those who originally settled all under Heaven were the various generals and I.\"",
      "idiomatic": "Those who originally settled all under Heaven were the various generals and I.''",
      "context": {
        "previous": "乃曰：「懷王者，吾家項梁所立耳，非有功伐，何以得主約！",
        "next": "乃詳尊懷王為義帝，實不用其命。"
      }
    },
    {
      "id": "s0245",
      "type": "paragraph",
      "chinese": "乃詳尊懷王為義帝，實不用其命。",
      "literal": "He then outwardly honored King Huai as the Righteous Emperor but actually did not use his commands.",
      "idiomatic": "He paid lip service to King Huai as the Righteous Emperor but ignored his orders.",
      "context": {
        "previous": "本定天下，諸將及籍也。」"
      }
    },
    {
      "id": "s0246",
      "type": "paragraph",
      "chinese": "正月，項羽自立為西楚霸王，王梁、楚地九郡，都彭城。",
      "literal": "In the first month, Xiang Yu made himself King of Western Chu, ruling nine commanderies of Liang and Chu, with his capital at Pengcheng.",
      "idiomatic": "In the first month, Xiang Yu proclaimed himself Hegemon-King of Western Chu, ruling nine commanderies of Liang and Chu lands with his capital at Pengcheng.",
      "context": {
        "next": "負約，更立沛公為漢王，王巴、蜀、漢中，都南鄭。"
      }
    },
    {
      "id": "s0247",
      "type": "paragraph",
      "chinese": "負約，更立沛公為漢王，王巴、蜀、漢中，都南鄭。",
      "literal": "Breaking the agreement, he instead installed the Duke of Pei as King of Han, to rule Ba, Shu, and Hanzhong, with his capital at Nanzheng.",
      "idiomatic": "Breaking the agreement, he instead made the Duke of Pei King of Han, giving him Ba, Shu, and Hanzhong to rule with his capital at Nanzheng.",
      "context": {
        "previous": "正月，項羽自立為西楚霸王，王梁、楚地九郡，都彭城。",
        "next": "三分關中，立秦三將：章邯為雍王，都廢丘；"
      }
    },
    {
      "id": "s0248",
      "type": "paragraph",
      "chinese": "三分關中，立秦三將：章邯為雍王，都廢丘；",
      "literal": "He divided Guanzhong into three parts and installed the three Qin generals: Zhang Han as King of Yong, with his capital at Feiqiu;",
      "idiomatic": "He divided Guanzhong into three parts and installed the three Qin generals: Zhang Han as King of Yong with his capital at Feiqiu;",
      "context": {
        "previous": "負約，更立沛公為漢王，王巴、蜀、漢中，都南鄭。",
        "next": "司馬欣為塞王，都櫟陽；"
      }
    },
    {
      "id": "s0249",
      "type": "paragraph",
      "chinese": "司馬欣為塞王，都櫟陽；",
      "literal": "Sima Xin as King of Sai, with his capital at Liyang;",
      "idiomatic": "Sima Xin as King of Sai with his capital at Liyang;",
      "context": {
        "previous": "三分關中，立秦三將：章邯為雍王，都廢丘；",
        "next": "董翳為翟王，都高奴。"
      }
    },
    {
      "id": "s0250",
      "type": "paragraph",
      "chinese": "董翳為翟王，都高奴。",
      "literal": "Dong Yi as King of Di, with his capital at Gaonu.",
      "idiomatic": "Dong Yi as King of Di with his capital at Gaonu.",
      "context": {
        "previous": "司馬欣為塞王，都櫟陽；",
        "next": "楚將瑕丘申陽為河南王，都洛陽。"
      }
    },
    {
      "id": "s0251",
      "type": "paragraph",
      "chinese": "楚將瑕丘申陽為河南王，都洛陽。",
      "literal": "Chu general Shen Yang of Xiaqiu as King of Henan, with his capital at Luoyang.",
      "idiomatic": "Chu general Shen Yang of Xiaqiu as King of Henan with his capital at Luoyang.",
      "context": {
        "previous": "董翳為翟王，都高奴。",
        "next": "趙將司馬卬為殷王，都朝歌。"
      }
    },
    {
      "id": "s0252",
      "type": "paragraph",
      "chinese": "趙將司馬卬為殷王，都朝歌。",
      "literal": "Zhao general Sima Ang as King of Yin, with his capital at Chaoge.",
      "idiomatic": "Zhao general Sima Ang as King of Yin with his capital at Chaoge.",
      "context": {
        "previous": "楚將瑕丘申陽為河南王，都洛陽。",
        "next": "趙王歇徙王代。"
      }
    },
    {
      "id": "s0253",
      "type": "paragraph",
      "chinese": "趙王歇徙王代。",
      "literal": "King Xie of Zhao was moved to be King of Dai.",
      "idiomatic": "King Xie of Zhao was transferred to rule Dai.",
      "context": {
        "previous": "趙將司馬卬為殷王，都朝歌。",
        "next": "趙相張耳為常山王，都襄國。"
      }
    },
    {
      "id": "s0254",
      "type": "paragraph",
      "chinese": "趙相張耳為常山王，都襄國。",
      "literal": "Zhao's Prime Minister Zhang Er as King of Changshan, with his capital at Xiangguo.",
      "idiomatic": "Zhao's prime minister Zhang Er as King of Changshan with his capital at Xiangguo.",
      "context": {
        "previous": "趙王歇徙王代。",
        "next": "當陽君黥布為九江王，都六。"
      }
    },
    {
      "id": "s0255",
      "type": "paragraph",
      "chinese": "當陽君黥布為九江王，都六。",
      "literal": "Lord Dangyang Qing Bu as King of Jiujiang, with his capital at Liu.",
      "idiomatic": "Lord Dangyang Qing Bu as King of Jiujiang with his capital at Liu.",
      "context": {
        "previous": "趙相張耳為常山王，都襄國。",
        "next": "懷王柱國共敖為臨江王，都江陵。"
      }
    },
    {
      "id": "s0256",
      "type": "paragraph",
      "chinese": "懷王柱國共敖為臨江王，都江陵。",
      "literal": "King Huai's Supreme Pillar of State Gong Ao as King of Linjiang, with his capital at Jiangling.",
      "idiomatic": "King Huai's Supreme Pillar of State Gong Ao as King of Linjiang with his capital at Jiangling.",
      "context": {
        "previous": "當陽君黥布為九江王，都六。",
        "next": "番君吳芮為衡山王，都邾。"
      }
    },
    {
      "id": "s0257",
      "type": "paragraph",
      "chinese": "番君吳芮為衡山王，都邾。",
      "literal": "Lord Fan Wu Rui as King of Hengshan, with his capital at Zhu.",
      "idiomatic": "Lord Fan Wu Rui as King of Hengshan with his capital at Zhu.",
      "context": {
        "previous": "懷王柱國共敖為臨江王，都江陵。",
        "next": "燕將臧荼為燕王，都薊。"
      }
    },
    {
      "id": "s0258",
      "type": "paragraph",
      "chinese": "燕將臧荼為燕王，都薊。",
      "literal": "Yan general Zang Tu as King of Yan, with his capital at Ji.",
      "idiomatic": "Yan general Zang Tu as King of Yan with his capital at Ji.",
      "context": {
        "previous": "番君吳芮為衡山王，都邾。",
        "next": "故燕王韓廣徙王遼東。"
      }
    },
    {
      "id": "s0259",
      "type": "paragraph",
      "chinese": "故燕王韓廣徙王遼東。",
      "literal": "The former King of Yan Han Guang was moved to be King of Liaodong.",
      "idiomatic": "The former King of Yan Han Guang was transferred to rule Liaodong.",
      "context": {
        "previous": "燕將臧荼為燕王，都薊。",
        "next": "廣不聽，臧荼攻殺之無終。"
      }
    },
    {
      "id": "s0260",
      "type": "paragraph",
      "chinese": "廣不聽，臧荼攻殺之無終。",
      "literal": "Guang would not obey; Zang Tu attacked and killed him at Wuzhong.",
      "idiomatic": "Guang refused to obey; Zang Tu attacked and killed him at Wuzhong.",
      "context": {
        "previous": "故燕王韓廣徙王遼東。",
        "next": "封成安君陳餘河閒三縣，居南皮。"
      }
    },
    {
      "id": "s0261",
      "type": "paragraph",
      "chinese": "封成安君陳餘河閒三縣，居南皮。",
      "literal": "He enfeoffed Lord Chengan Chen Yu with three counties of Hejian, residing at Nanpi.",
      "idiomatic": "He enfeoffed Lord Chengan Chen Yu with three counties in Hejian, making his residence at Nanpi.",
      "context": {
        "previous": "廣不聽，臧荼攻殺之無終。",
        "next": "封梅鋗十萬戶。"
      }
    },
    {
      "id": "s0262",
      "type": "paragraph",
      "chinese": "封梅鋗十萬戶。",
      "literal": "He enfeoffed Mei Xuan with a hundred thousand households.",
      "idiomatic": "He granted Mei Xuan a fief of 100,000 households.",
      "context": {
        "previous": "封成安君陳餘河閒三縣，居南皮。"
      }
    },
    {
      "id": "s0263",
      "type": "paragraph",
      "chinese": "四月，兵罷戲下，諸侯各就國。",
      "literal": "In the fourth month, the troops were dismissed below Xi; the feudal lords each went to their states.",
      "idiomatic": "In the fourth month, the troops were disbanded below Xi; each feudal lord went to his own state.",
      "context": {
        "next": "漢王之國，項王使卒三萬人從，楚與諸侯之慕從者數萬人，從杜南入蝕中。"
      }
    },
    {
      "id": "s0264",
      "type": "paragraph",
      "chinese": "漢王之國，項王使卒三萬人從，楚與諸侯之慕從者數萬人，從杜南入蝕中。",
      "literal": "When the King of Han went to his state, King Xiang sent thirty thousand troops to follow; those from Chu and the feudal lords who admired and followed numbered several tens of thousands; they entered Shizh from south of Du.",
      "idiomatic": "When the King of Han went to his state, King Xiang sent thirty thousand troops to follow. Those from Chu and the feudal lords who admired and followed numbered several tens of thousands. They entered Shizh from south of Du.",
      "context": {
        "previous": "四月，兵罷戲下，諸侯各就國。",
        "next": "去輒燒絕棧道，以備諸侯盜兵襲之，亦示項羽無東意。"
      }
    },
    {
      "id": "s0265",
      "type": "paragraph",
      "chinese": "去輒燒絕棧道，以備諸侯盜兵襲之，亦示項羽無東意。",
      "literal": "As they departed they immediately burned and severed the plank roads to prepare against the feudal lords' troops raiding them, and also to show Xiang Yu they had no intention of going east.",
      "idiomatic": "As they left, they immediately burned and destroyed the plank roads to guard against the feudal lords raiding them, and also to show Xiang Yu they had no plans to advance east.",
      "context": {
        "previous": "漢王之國，項王使卒三萬人從，楚與諸侯之慕從者數萬人，從杜南入蝕中。",
        "next": "至南鄭，諸將及士卒多道亡歸，士卒皆歌思東歸。"
      }
    },
    {
      "id": "s0266",
      "type": "paragraph",
      "chinese": "至南鄭，諸將及士卒多道亡歸，士卒皆歌思東歸。",
      "literal": "Reaching Nanzheng, many generals and officers and troops escaped on the road and returned; the officers and troops all sang songs longing to return east.",
      "idiomatic": "Reaching Nanzheng, many generals and officers and troops escaped on the road and returned. The officers and troops all sang songs longing to return east.",
      "context": {
        "previous": "去輒燒絕棧道，以備諸侯盜兵襲之，亦示項羽無東意。",
        "next": "韓信說漢王曰：「項羽王諸將之有功者，而王獨居南鄭，是遷也。"
      }
    },
    {
      "id": "s0267",
      "type": "paragraph",
      "chinese": "韓信說漢王曰：「項羽王諸將之有功者，而王獨居南鄭，是遷也。",
      "literal": "Han Xin persuaded the King of Han, saying: \"Xiang Yu made kings of generals who had achievements, while the king alone resides at Nanzheng—this is exile.",
      "idiomatic": "Han Xin persuaded the King of Han, saying: 'Xiang Yu made kings of generals who had achievements, while the king alone resides at Nanzheng—this is exile.'",
      "context": {
        "previous": "至南鄭，諸將及士卒多道亡歸，士卒皆歌思東歸。",
        "next": "軍吏士卒皆山東之人也，日夜跂而望歸，及其鋒而用之，可以有大功。"
      }
    },
    {
      "id": "s0268",
      "type": "paragraph",
      "chinese": "軍吏士卒皆山東之人也，日夜跂而望歸，及其鋒而用之，可以有大功。",
      "literal": "The military officers and troops are all men from east of the mountains; day and night they stand on tiptoe longing to return—use them while they are at their peak and you can achieve great merit.",
      "idiomatic": "The military officers and troops are all men from east of the mountains. Day and night they stand on tiptoe longing to return—use them while they are at their peak and you can achieve great merit.",
      "context": {
        "previous": "韓信說漢王曰：「項羽王諸將之有功者，而王獨居南鄭，是遷也。",
        "next": "天下已定，人皆自寧，不可復用。"
      }
    },
    {
      "id": "s0269",
      "type": "paragraph",
      "chinese": "天下已定，人皆自寧，不可復用。",
      "literal": "Once all under Heaven is settled, people will all seek their own comfort and cannot be used again.",
      "idiomatic": "Once the empire is pacified, people will settle into complacency and won't be fit for service again.",
      "context": {
        "previous": "軍吏士卒皆山東之人也，日夜跂而望歸，及其鋒而用之，可以有大功。",
        "next": "不如決策東鄉，爭權天下。」"
      }
    },
    {
      "id": "s0270",
      "type": "paragraph",
      "chinese": "不如決策東鄉，爭權天下。」",
      "literal": "It would be better to make a decisive plan to face east and contend for authority over all under Heaven.\"",
      "idiomatic": "It would be better to make a decisive plan to face east and contend for authority over all under Heaven.''",
      "context": {
        "previous": "天下已定，人皆自寧，不可復用。"
      }
    },
    {
      "id": "s0272",
      "type": "paragraph",
      "chinese": "項羽出關，使人徙義帝。",
      "literal": "Xiang Yu having left the passes sent men to relocate the Righteous Emperor.",
      "idiomatic": "After leaving the passes, Xiang Yu sent men to relocate the Righteous Emperor.",
      "context": {
        "next": "曰：「古之帝者地方千里，必居上游。」"
      }
    },
    {
      "id": "s0273",
      "type": "paragraph",
      "chinese": "曰：「古之帝者地方千里，必居上游。」",
      "literal": "He said: \"Ancient emperors had territories a thousand li square and must reside at the upper reaches.\"",
      "idiomatic": "He said: 'Ancient emperors had territories a thousand li square and must reside at the upper reaches.''",
      "context": {
        "previous": "項羽出關，使人徙義帝。",
        "next": "乃使使徙義帝長沙郴縣，趣義帝行，群臣稍倍叛之，乃陰令衡山王、臨江王擊之，殺義帝江南。"
      }
    },
    {
      "id": "s0274",
      "type": "paragraph",
      "chinese": "乃使使徙義帝長沙郴縣，趣義帝行，群臣稍倍叛之，乃陰令衡山王、臨江王擊之，殺義帝江南。",
      "literal": "He then sent envoys to relocate the Righteous Emperor to Chen County in Changsha, urged the Righteous Emperor to travel; the assembled ministers gradually betrayed and rebelled against him, and he then secretly ordered the King of Hengshan and King of Linjiang to strike and kill the Righteous Emperor south of the Yangtze.",
      "idiomatic": "He then sent envoys to relocate the Righteous Emperor to Chen County in Changsha and urged the Righteous Emperor to travel. The assembled ministers gradually betrayed and rebelled against him, and he then secretly ordered the King of Hengshan and King of Linjiang to strike and kill the Righteous Emperor south of the Yangtze.",
      "context": {
        "previous": "曰：「古之帝者地方千里，必居上游。」",
        "next": "項羽怨田榮，立齊將田都為齊王。"
      }
    },
    {
      "id": "s0275",
      "type": "paragraph",
      "chinese": "項羽怨田榮，立齊將田都為齊王。",
      "literal": "Xiang Yu resented Tian Rong and installed Qi general Tian Du as King of Qi.",
      "idiomatic": "Xiang Yu resented Tian Rong and installed the Qi general Tian Du as King of Qi.",
      "context": {
        "previous": "乃使使徙義帝長沙郴縣，趣義帝行，群臣稍倍叛之，乃陰令衡山王、臨江王擊之，殺義帝江南。",
        "next": "田榮怒，因自立為齊王，殺田都而反楚；"
      }
    },
    {
      "id": "s0276",
      "type": "paragraph",
      "chinese": "田榮怒，因自立為齊王，殺田都而反楚；",
      "literal": "Tian Rong was angry and consequently made himself King of Qi, killed Tian Du, and rebelled against Chu;",
      "idiomatic": "Tian Rong was furious and consequently proclaimed himself King of Qi, killed Tian Du, and rebelled against Chu;",
      "context": {
        "previous": "項羽怨田榮，立齊將田都為齊王。",
        "next": "予彭越將軍印，令反梁地。"
      }
    },
    {
      "id": "s0277",
      "type": "paragraph",
      "chinese": "予彭越將軍印，令反梁地。",
      "literal": "Gave Peng Yue general seal, ordered him to rebel in Liang lands.",
      "idiomatic": "He gave Peng Yue a general's seal and ordered him to rebel in Liang territory.",
      "context": {
        "previous": "田榮怒，因自立為齊王，殺田都而反楚；",
        "next": "楚令蕭公角擊彭越，彭越大破之。"
      }
    },
    {
      "id": "s0278",
      "type": "paragraph",
      "chinese": "楚令蕭公角擊彭越，彭越大破之。",
      "literal": "Chu ordered Xiao Gongjiao to strike Peng Yue; Peng Yue greatly broke him.",
      "idiomatic": "Chu ordered Xiao Gongjiao to strike Peng Yue; Peng Yue decisively defeated him.",
      "context": {
        "previous": "予彭越將軍印，令反梁地。",
        "next": "陳餘怨項羽之弗王己也，令夏說說田榮，請兵擊張耳。"
      }
    },
    {
      "id": "s0279",
      "type": "paragraph",
      "chinese": "陳餘怨項羽之弗王己也，令夏說說田榮，請兵擊張耳。",
      "literal": "Chen Yu resented that Xiang Yu had not made him king; he had Xia Shuo persuade Tian Rong to request troops to strike Zhang Er.",
      "idiomatic": "Chen Yu resented that Xiang Yu had not made him king. He had Xia Shuo persuade Tian Rong to request troops to strike Zhang Er.",
      "context": {
        "previous": "楚令蕭公角擊彭越，彭越大破之。",
        "next": "齊予陳餘兵，擊破常山王張耳，張耳亡歸漢。"
      }
    },
    {
      "id": "s0280",
      "type": "paragraph",
      "chinese": "齊予陳餘兵，擊破常山王張耳，張耳亡歸漢。",
      "literal": "Qi gave Chen Yu troops; he struck and broke King Zhang Er of Changshan; Zhang Er fled and submitted to Han.",
      "idiomatic": "Qi gave Chen Yu troops. He struck and broke King Zhang Er of Changshan. Zhang Er fled and submitted to Han.",
      "context": {
        "previous": "陳餘怨項羽之弗王己也，令夏說說田榮，請兵擊張耳。",
        "next": "迎趙王歇於代，復立為趙王。"
      }
    },
    {
      "id": "s0281",
      "type": "paragraph",
      "chinese": "迎趙王歇於代，復立為趙王。",
      "literal": "They welcomed King Xie of Zhao from Dai and again installed him as King of Zhao.",
      "idiomatic": "They welcomed King Xie of Zhao back from Dai and restored him as King of Zhao.",
      "context": {
        "previous": "齊予陳餘兵，擊破常山王張耳，張耳亡歸漢。",
        "next": "趙王因立陳餘為代王。"
      }
    },
    {
      "id": "s0282",
      "type": "paragraph",
      "chinese": "趙王因立陳餘為代王。",
      "literal": "The King of Zhao consequently installed Chen Yu as King of Dai.",
      "idiomatic": "The King of Zhao consequently installed Chen Yu as King of Dai.",
      "context": {
        "previous": "迎趙王歇於代，復立為趙王。",
        "next": "項羽大怒，北擊齊。"
      }
    },
    {
      "id": "s0283",
      "type": "paragraph",
      "chinese": "項羽大怒，北擊齊。",
      "literal": "Xiang Yu was greatly enraged and attacked Qi to the north.",
      "idiomatic": "Xiang Yu flew into a rage and attacked Qi to the north.",
      "context": {
        "previous": "趙王因立陳餘為代王。"
      }
    },
    {
      "id": "s0284",
      "type": "paragraph",
      "chinese": "八月，漢王用韓信之計，從故道還，襲雍王章邯。",
      "literal": "In the eighth month, the King of Han used Han Xin's stratagem, returned from the old road, and launched a surprise attack on King Zhang Han of Yong.",
      "idiomatic": "In the eighth month, the King of Han used Han Xin's stratagem. He returned from the old road and launched a surprise attack on King Zhang Han of Yong.",
      "context": {
        "next": "邯迎擊漢陳倉，雍兵敗，還走；"
      }
    },
    {
      "id": "s0285",
      "type": "paragraph",
      "chinese": "邯迎擊漢陳倉，雍兵敗，還走；",
      "literal": "Han met and struck Han at Chencang; the Yong troops were defeated and fled back;",
      "idiomatic": "Zhang Han met and struck the Han forces at Chencang. The Yong troops were defeated and fled back;",
      "context": {
        "previous": "八月，漢王用韓信之計，從故道還，襲雍王章邯。",
        "next": "止戰好畤，又復敗，走廢丘。"
      }
    },
    {
      "id": "s0286",
      "type": "paragraph",
      "chinese": "止戰好畤，又復敗，走廢丘。",
      "literal": "they made a stand and fought at Haozhi, were again defeated, and fled to Feiqiu.",
      "idiomatic": "They made a stand and fought at Haozhi, were again defeated, and fled to Feiqiu.",
      "context": {
        "previous": "邯迎擊漢陳倉，雍兵敗，還走；",
        "next": "漢王遂定雍地。"
      }
    },
    {
      "id": "s0287",
      "type": "paragraph",
      "chinese": "漢王遂定雍地。",
      "literal": "The King of Han then settled the territory of Yong.",
      "idiomatic": "The King of Han then pacified the territory of Yong.",
      "context": {
        "previous": "止戰好畤，又復敗，走廢丘。",
        "next": "東至咸陽，引兵圍雍王廢丘，而遣諸將略定隴西、北地、上郡。"
      }
    },
    {
      "id": "s0288",
      "type": "paragraph",
      "chinese": "東至咸陽，引兵圍雍王廢丘，而遣諸將略定隴西、北地、上郡。",
      "literal": "Going east to Xianyang, he led troops to besiege King of Yong at Feiqiu, and dispatched various generals to take and settle Longxi, Beidi, and Shangjun.",
      "idiomatic": "Going east to Xianyang, he led troops to besiege the King of Yong at Feiqiu, and dispatched various generals to seize and settle Longxi, Beidi, and Shangjun.",
      "context": {
        "previous": "漢王遂定雍地。",
        "next": "令將軍薛歐、王吸出武關，因王陵兵南陽，以迎太公、呂後於沛。"
      }
    },
    {
      "id": "s0289",
      "type": "paragraph",
      "chinese": "令將軍薛歐、王吸出武關，因王陵兵南陽，以迎太公、呂後於沛。",
      "literal": "He ordered generals Xue Ou and Wang Xi to go out through Wuguan, use Wang Ling's troops at Nanyang, to welcome the Grand Duke and Empress Lü at Pei.",
      "idiomatic": "He ordered generals Xue Ou and Wang Xi to exit through Wuguan Pass, link up with Wang Ling's troops in Nanyang, and escort his father and Empress Lü from Pei.",
      "context": {
        "previous": "東至咸陽，引兵圍雍王廢丘，而遣諸將略定隴西、北地、上郡。",
        "next": "楚聞之，發兵距之陽夏，不得前。"
      }
    },
    {
      "id": "s0290",
      "type": "paragraph",
      "chinese": "楚聞之，發兵距之陽夏，不得前。",
      "literal": "Chu heard of this and sent troops to resist them at Yangxia; they could not advance.",
      "idiomatic": "Chu got wind of this and dispatched troops to block them at Yangxia; they couldn't proceed.",
      "context": {
        "previous": "令將軍薛歐、王吸出武關，因王陵兵南陽，以迎太公、呂後於沛。",
        "next": "令故吳令鄭昌為韓王，距漢兵。"
      }
    },
    {
      "id": "s0291",
      "type": "paragraph",
      "chinese": "令故吳令鄭昌為韓王，距漢兵。",
      "literal": "He ordered the former magistrate of Wu, Zheng Chang, to be King of Han to resist the Han troops.",
      "idiomatic": "He ordered the former magistrate of Wu, Zheng Chang, to become King of Han and resist the Han troops.",
      "context": {
        "previous": "楚聞之，發兵距之陽夏，不得前。"
      }
    },
    {
      "id": "s0292",
      "type": "paragraph",
      "chinese": "二年，漢王東略地，塞王欣、翟王翳、河南王申陽皆降。",
      "literal": "In the second year, the King of Han went east taking territory; King Xin of Sai, King Yi of Di, and King Shen Yang of Henan all surrendered.",
      "idiomatic": "In the second year, the King of Han went east taking territory. King Xin of Sai, King Yi of Di, and King Shen Yang of Henan all surrendered.",
      "context": {
        "next": "韓王昌不聽，使韓信擊破之。"
      }
    },
    {
      "id": "s0293",
      "type": "paragraph",
      "chinese": "韓王昌不聽，使韓信擊破之。",
      "literal": "King Chang of Han would not obey; he sent Han Xin to strike and break him.",
      "idiomatic": "King Chang of Han would not obey. He sent Han Xin to strike and break him.",
      "context": {
        "previous": "二年，漢王東略地，塞王欣、翟王翳、河南王申陽皆降。",
        "next": "於是置隴西、北地、上郡、渭南、河上、中地郡；"
      }
    },
    {
      "id": "s0294",
      "type": "paragraph",
      "chinese": "於是置隴西、北地、上郡、渭南、河上、中地郡；",
      "literal": "Thereupon he established Longxi, Beidi, Shangjun, Weinan, Heshang, and Zhongdi commanderies;",
      "idiomatic": "Thereupon he established the commanderies of Longxi, Beidi, Shangjun, Weinan, Heshang, and Zhongdi;",
      "context": {
        "previous": "韓王昌不聽，使韓信擊破之。",
        "next": "關外置河南郡。"
      }
    },
    {
      "id": "s0295",
      "type": "paragraph",
      "chinese": "關外置河南郡。",
      "literal": "outside the passes he established Henan Commandery.",
      "idiomatic": "Outside the passes he established Henan Commandery.",
      "context": {
        "previous": "於是置隴西、北地、上郡、渭南、河上、中地郡；",
        "next": "更立韓太尉信為韓王。"
      }
    },
    {
      "id": "s0296",
      "type": "paragraph",
      "chinese": "更立韓太尉信為韓王。",
      "literal": "He reinstalled Han's Grand Commandant Xin as King of Han.",
      "idiomatic": "He restored Han's Grand Commandant Xin as King of Han.",
      "context": {
        "previous": "關外置河南郡。",
        "next": "諸將以萬人若以一郡降者，封萬戶。"
      }
    },
    {
      "id": "s0297",
      "type": "paragraph",
      "chinese": "諸將以萬人若以一郡降者，封萬戶。",
      "literal": "Generals who surrendered with ten thousand men or with a commandery were enfeoffed with ten thousand households.",
      "idiomatic": "Generals who surrendered with 10,000 men or an entire commandery were granted fiefs of 10,000 households.",
      "context": {
        "previous": "更立韓太尉信為韓王。",
        "next": "繕治河上塞。"
      }
    },
    {
      "id": "s0298",
      "type": "paragraph",
      "chinese": "繕治河上塞。",
      "literal": "They repaired and constructed the fortifications along the Yellow River.",
      "idiomatic": "They repaired and reinforced the river defenses.",
      "context": {
        "previous": "諸將以萬人若以一郡降者，封萬戶。",
        "next": "諸故秦苑囿園池，皆令人得田之，正月，虜雍王弟章平。"
      }
    },
    {
      "id": "s0299",
      "type": "paragraph",
      "chinese": "諸故秦苑囿園池，皆令人得田之，正月，虜雍王弟章平。",
      "literal": "All the former Qin parks, gardens, and ponds were permitted for people to farm; in the first month, they captured Chapter Ping, younger brother of the King of Yong.",
      "idiomatic": "All the former Qin parks, gardens, and ponds were permitted for people to farm. In the first month, they captured Zhang Ping, younger brother of the King of Yong.",
      "context": {
        "previous": "繕治河上塞。",
        "next": "大赦罪人。"
      }
    },
    {
      "id": "s0300",
      "type": "paragraph",
      "chinese": "大赦罪人。",
      "literal": "They granted a great amnesty to criminals.",
      "idiomatic": "A general amnesty was declared for all criminals.",
      "context": {
        "previous": "諸故秦苑囿園池，皆令人得田之，正月，虜雍王弟章平。"
      }
    },
    {
      "id": "s0301",
      "type": "paragraph",
      "chinese": "漢王之出關至陜，撫關外父老，還，張耳來見，漢王厚遇之。",
      "literal": "When the King of Han left the passes and reached Shan, he consoled the fathers and elders outside the passes, returned, and Zhang Er came to see him; the King of Han treated him generously.",
      "idiomatic": "When the King of Han left the passes and reached Shan, he consoled the fathers and elders outside the passes. He returned, and Zhang Er came to see him. The King of Han treated him generously.",
      "context": {}
    },
    {
      "id": "s0302",
      "type": "paragraph",
      "chinese": "二月，令除秦社稷，更立漢社稷。",
      "literal": "In the second month, he ordered the elimination of Qin's altars of soil and grain and the establishment anew of Han's altars of soil and grain.",
      "idiomatic": "In the second month, he ordered Qin's altars of soil and grain demolished and new Han altars established in their place.",
      "context": {}
    },
    {
      "id": "s0303",
      "type": "paragraph",
      "chinese": "三月，漢王從臨晉渡，魏王豹將兵從。",
      "literal": "In the third month, the King of Han crossed from Linjin; King Bao of Wei led troops to follow.",
      "idiomatic": "In the third month, the King of Han crossed from Linjin. King Bao of Wei led troops to follow.",
      "context": {
        "next": "下河內，虜殷王，置河內郡。"
      }
    },
    {
      "id": "s0304",
      "type": "paragraph",
      "chinese": "下河內，虜殷王，置河內郡。",
      "literal": "He took Henei, captured the King of Yin, and established Henei Commandery.",
      "idiomatic": "He conquered Henei, captured the King of Yin, and established Henei as a commandery.",
      "context": {
        "previous": "三月，漢王從臨晉渡，魏王豹將兵從。",
        "next": "南渡平陰津，至雒陽。"
      }
    },
    {
      "id": "s0305",
      "type": "paragraph",
      "chinese": "南渡平陰津，至雒陽。",
      "literal": "He crossed south over Pingyin ford and reached Luoyang.",
      "idiomatic": "He crossed south at Pingyin Ford and reached Luoyang.",
      "context": {
        "previous": "下河內，虜殷王，置河內郡。",
        "next": "新城三老董公遮說漢王以義帝死故。"
      }
    },
    {
      "id": "s0306",
      "type": "paragraph",
      "chinese": "新城三老董公遮說漢王以義帝死故。",
      "literal": "Elder Dong Gong of Xincheng blocked the way and persuaded the King of Han with the story of the Righteous Emperor's death.",
      "idiomatic": "Elder Dong Gong of Xincheng barred his path and persuaded the King of Han with the tale of the Righteous Emperor's death.",
      "context": {
        "previous": "南渡平陰津，至雒陽。",
        "next": "漢王聞之，袒而大哭。"
      }
    },
    {
      "id": "s0307",
      "type": "paragraph",
      "chinese": "漢王聞之，袒而大哭。",
      "literal": "The King of Han heard this, bared his torso, and wept loudly.",
      "idiomatic": "The King of Han heard this, bared his chest in mourning, and wailed loudly.",
      "context": {
        "previous": "新城三老董公遮說漢王以義帝死故。",
        "next": "遂為義帝發喪，臨三日。"
      }
    },
    {
      "id": "s0308",
      "type": "paragraph",
      "chinese": "遂為義帝發喪，臨三日。",
      "literal": "He then announced mourning for the Righteous Emperor and mourned for three days.",
      "idiomatic": "He then proclaimed mourning rites for the Righteous Emperor and observed three days of mourning.",
      "context": {
        "previous": "漢王聞之，袒而大哭。",
        "next": "發使者告諸侯曰：「天下共立義帝，北面事之。"
      }
    },
    {
      "id": "s0309",
      "type": "paragraph",
      "chinese": "發使者告諸侯曰：「天下共立義帝，北面事之。",
      "literal": "He sent envoys to inform the feudal lords, saying: \"All under Heaven together installed the Righteous Emperor and faced north to serve him.",
      "idiomatic": "He sent envoys to inform the feudal lords, saying: 'All under Heaven together installed the Righteous Emperor and faced north to serve him.'",
      "context": {
        "previous": "遂為義帝發喪，臨三日。",
        "next": "今項羽放殺義帝於江南，大逆無道。"
      }
    },
    {
      "id": "s0310",
      "type": "paragraph",
      "chinese": "今項羽放殺義帝於江南，大逆無道。",
      "literal": "Now Xiang Yu has banished and killed the Righteous Emperor south of the Yangtze—this is great rebellion and lawlessness.",
      "idiomatic": "Now Xiang Yu has banished and killed the Righteous Emperor south of the Yangtze—this is great rebellion and lawlessness.''",
      "context": {
        "previous": "發使者告諸侯曰：「天下共立義帝，北面事之。",
        "next": "寡人親為發喪，諸侯皆縞素。"
      }
    },
    {
      "id": "s0311",
      "type": "paragraph",
      "chinese": "寡人親為發喪，諸侯皆縞素。",
      "literal": "I personally have announced mourning; may all the feudal lords wear white mourning garments.",
      "idiomatic": "I personally have announced mourning; may all the feudal lords wear white mourning garments.''",
      "context": {
        "previous": "今項羽放殺義帝於江南，大逆無道。",
        "next": "悉發關內兵，收三河士，南浮江漢以下，願從諸侯王擊楚之殺義帝者。」"
      }
    },
    {
      "id": "s0312",
      "type": "paragraph",
      "chinese": "悉發關內兵，收三河士，南浮江漢以下，願從諸侯王擊楚之殺義帝者。」",
      "literal": "Mobilize all troops within the passes, gather the gentlemen of the Three Rivers, float south down the Yangtze and Han rivers; I wish to follow the feudal lord kings to strike those of Chu who killed the Righteous Emperor.\"",
      "idiomatic": "Mobilize all troops within the passes, gather the gentlemen of the Three Rivers, float south down the Yangtze and Han rivers. I wish to follow the feudal lord kings to strike those of Chu who killed the Righteous Emperor.''",
      "context": {
        "previous": "寡人親為發喪，諸侯皆縞素。"
      }
    },
    {
      "id": "s0314",
      "type": "paragraph",
      "chinese": "是時項王北擊齊，田榮與戰城陽。",
      "literal": "At this time King Xiang was attacking Qi to the north; Tian Rong fought with him at Chengyang.",
      "idiomatic": "At this time King Xiang was attacking Qi to the north. Tian Rong fought with him at Chengyang.",
      "context": {
        "next": "田榮敗，走平原，平原民殺之。"
      }
    },
    {
      "id": "s0315",
      "type": "paragraph",
      "chinese": "田榮敗，走平原，平原民殺之。",
      "literal": "Tian Rong was defeated and fled to Pingyuan; the people of Pingyuan killed him.",
      "idiomatic": "Tian Rong was defeated and fled to Pingyuan. The people of Pingyuan killed him.",
      "context": {
        "previous": "是時項王北擊齊，田榮與戰城陽。",
        "next": "齊皆降楚。"
      }
    },
    {
      "id": "s0316",
      "type": "paragraph",
      "chinese": "齊皆降楚。",
      "literal": "All of Qi surrendered to Chu.",
      "idiomatic": "All of Qi submitted to Chu.",
      "context": {
        "previous": "田榮敗，走平原，平原民殺之。",
        "next": "楚因焚燒其城郭，系虜其子女。"
      }
    },
    {
      "id": "s0317",
      "type": "paragraph",
      "chinese": "楚因焚燒其城郭，系虜其子女。",
      "literal": "Chu consequently burned their city walls and took their sons and daughters as captives.",
      "idiomatic": "Chu then burned their cities to the ground and carried off their children as captives.",
      "context": {
        "previous": "齊皆降楚。",
        "next": "齊人叛之。"
      }
    },
    {
      "id": "s0318",
      "type": "paragraph",
      "chinese": "齊人叛之。",
      "literal": "The Qi people rebelled against them.",
      "idiomatic": "The people of Qi rose up against them.",
      "context": {
        "previous": "楚因焚燒其城郭，系虜其子女。",
        "next": "田榮弟橫立榮子廣為齊王，齊王反楚城陽。"
      }
    },
    {
      "id": "s0319",
      "type": "paragraph",
      "chinese": "田榮弟橫立榮子廣為齊王，齊王反楚城陽。",
      "literal": "Tian Rong's younger brother Heng installed Rong's son Guang as King of Qi; the King of Qi rebelled against Chu at Chengyang.",
      "idiomatic": "Tian Rong's younger brother Heng installed Rong's son Guang as King of Qi. The King of Qi rebelled against Chu at Chengyang.",
      "context": {
        "previous": "齊人叛之。",
        "next": "項羽雖聞漢東，既已連齊兵，欲遂破之而擊漢。"
      }
    },
    {
      "id": "s0320",
      "type": "paragraph",
      "chinese": "項羽雖聞漢東，既已連齊兵，欲遂破之而擊漢。",
      "literal": "Though Xiang Yu heard Han had gone east, having already engaged Qi's troops, he wished to completely break them before striking Han.",
      "idiomatic": "Though Xiang Yu heard that Han had gone east, he was already engaged with Qi's forces and wanted to finish them off before turning on Han.",
      "context": {
        "previous": "田榮弟橫立榮子廣為齊王，齊王反楚城陽。",
        "next": "漢王以故得劫五諸侯兵，遂入彭城。"
      }
    },
    {
      "id": "s0321",
      "type": "paragraph",
      "chinese": "漢王以故得劫五諸侯兵，遂入彭城。",
      "literal": "The King of Han because of this was able to coerce the troops of five feudal lords and then entered Pengcheng.",
      "idiomatic": "Thanks to this development, the King of Han was able to commandeer the armies of five feudal lords and marched into Pengcheng.",
      "context": {
        "previous": "項羽雖聞漢東，既已連齊兵，欲遂破之而擊漢。",
        "next": "項羽聞之，乃引兵去齊，從魯出胡陵，至蕭，與漢大戰彭城靈壁東睢水上，大破漢軍，多殺士卒，睢水為之不流。"
      }
    },
    {
      "id": "s0322",
      "type": "paragraph",
      "chinese": "項羽聞之，乃引兵去齊，從魯出胡陵，至蕭，與漢大戰彭城靈壁東睢水上，大破漢軍，多殺士卒，睢水為之不流。",
      "literal": "Xiang Yu heard of this and led his troops away from Qi, came out from Lu through Huling, reached Xiao, and fought a great battle with Han at Pengcheng, east of Lingbi on the Sui River, greatly breaking the Han army, killing many officers and troops—the Sui River stopped flowing because of them.",
      "idiomatic": "Xiang Yu heard of this and led his troops away from Qi. He came out from Lu through Huling, reached Xiao, and fought a great battle with Han at Pengcheng, east of Lingbi on the Sui River. He greatly broke the Han army, killing many officers and troops—the Sui River stopped flowing because of them.",
      "context": {
        "previous": "漢王以故得劫五諸侯兵，遂入彭城。",
        "next": "乃取漢王父母妻子於沛，置之軍中以為質。"
      }
    },
    {
      "id": "s0323",
      "type": "paragraph",
      "chinese": "乃取漢王父母妻子於沛，置之軍中以為質。",
      "literal": "He then took the King of Han's father, mother, wife, and children at Pei and placed them in the army as hostages.",
      "idiomatic": "He then seized the King of Han's parents and family from Pei and held them in the army camp as hostages.",
      "context": {
        "previous": "項羽聞之，乃引兵去齊，從魯出胡陵，至蕭，與漢大戰彭城靈壁東睢水上，大破漢軍，多殺士卒，睢水為之不流。",
        "next": "當是時，諸侯見楚彊漢敗，還皆去漢復為楚。"
      }
    },
    {
      "id": "s0324",
      "type": "paragraph",
      "chinese": "當是時，諸侯見楚彊漢敗，還皆去漢復為楚。",
      "literal": "At that time, the feudal lords saw Chu was strong and Han defeated; they all turned away from Han and again became Chu.",
      "idiomatic": "At that time, the feudal lords saw Chu was strong and Han defeated. They all turned away from Han and again became Chu.",
      "context": {
        "previous": "乃取漢王父母妻子於沛，置之軍中以為質。",
        "next": "塞王欣亡入楚。"
      }
    },
    {
      "id": "s0325",
      "type": "paragraph",
      "chinese": "塞王欣亡入楚。",
      "literal": "King Xin of Sai fled and entered Chu.",
      "idiomatic": "King Xin of Sai fled into Chu territory.",
      "context": {
        "previous": "當是時，諸侯見楚彊漢敗，還皆去漢復為楚。"
      }
    },
    {
      "id": "s0326",
      "type": "paragraph",
      "chinese": "呂后兄周呂侯為漢將兵，居下邑。",
      "literal": "Empress Lü's elder brother Lord Zhou Lü commanded Han troops, stationed at Xiayi.",
      "idiomatic": "Empress Lü's elder brother, Lord Zhou Lü, commanded Han troops stationed at Xiayi.",
      "context": {
        "next": "漢王從之，稍收士卒，軍碭。"
      }
    },
    {
      "id": "s0327",
      "type": "paragraph",
      "chinese": "漢王從之，稍收士卒，軍碭。",
      "literal": "The King of Han joined him and gradually gathered officers and troops, encamping at Dang.",
      "idiomatic": "The King of Han joined him and gradually rallied soldiers and officers, making camp at Dang.",
      "context": {
        "previous": "呂后兄周呂侯為漢將兵，居下邑。",
        "next": "漢王乃西過梁地，至虞。"
      }
    },
    {
      "id": "s0328",
      "type": "paragraph",
      "chinese": "漢王乃西過梁地，至虞。",
      "literal": "The King of Han then went west through the land of Liang and reached Yu.",
      "idiomatic": "The King of Han then marched west through Liang territory and reached Yu.",
      "context": {
        "previous": "漢王從之，稍收士卒，軍碭。",
        "next": "使謁者隨何之九江王布所，曰：「公能令布舉兵叛楚，項羽必留擊之。"
      }
    },
    {
      "id": "s0329",
      "type": "paragraph",
      "chinese": "使謁者隨何之九江王布所，曰：「公能令布舉兵叛楚，項羽必留擊之。",
      "literal": "He sent the herald Sui He to the King of Jiujiang Bu's location, saying: \"If you can make Bu raise troops and rebel against Chu, Xiang Yu will certainly remain to strike him.",
      "idiomatic": "He sent the herald Sui He to the King of Jiujiang Bu's location, saying: 'If you can make Bu raise troops and rebel against Chu, Xiang Yu will certainly remain to strike him.'",
      "context": {
        "previous": "漢王乃西過梁地，至虞。",
        "next": "得留數月，吾取天下必矣。」"
      }
    },
    {
      "id": "s0330",
      "type": "paragraph",
      "chinese": "得留數月，吾取天下必矣。」",
      "literal": "If we can keep him there for several months, my taking of all under Heaven is certain.\"",
      "idiomatic": "If we can keep him there for several months, my taking of all under Heaven is certain.''",
      "context": {
        "previous": "使謁者隨何之九江王布所，曰：「公能令布舉兵叛楚，項羽必留擊之。",
        "next": "隨何往說九江王布，布果背楚。"
      }
    },
    {
      "id": "s0331",
      "type": "paragraph",
      "chinese": "隨何往說九江王布，布果背楚。",
      "literal": "Sui He went and persuaded King Bu of Jiujiang; Bu indeed turned his back on Chu.",
      "idiomatic": "Sui He went and persuaded King Bu of Jiujiang. Bu indeed turned his back on Chu.",
      "context": {
        "previous": "得留數月，吾取天下必矣。」",
        "next": "楚使龍且往擊之。"
      }
    },
    {
      "id": "s0332",
      "type": "paragraph",
      "chinese": "楚使龍且往擊之。",
      "literal": "Chu sent Long Ju to strike him.",
      "idiomatic": "Chu dispatched Long Ju to attack him.",
      "context": {
        "previous": "隨何往說九江王布，布果背楚。"
      }
    },
    {
      "id": "s0333",
      "type": "paragraph",
      "chinese": "漢王之敗彭城而西，行使人求家室，家室亦亡，不相得。",
      "literal": "When the King of Han was defeated at Pengcheng and went west, he sent people on the road to seek his family, but his family had also disappeared and they could not find each other.",
      "idiomatic": "When the King of Han was defeated at Pengcheng and went west, he sent people on the road to seek his family. But his family had also disappeared and they could not find each other.",
      "context": {
        "next": "敗後乃獨得孝惠，六月，立為太子，大赦罪人。"
      }
    },
    {
      "id": "s0334",
      "type": "paragraph",
      "chinese": "敗後乃獨得孝惠，六月，立為太子，大赦罪人。",
      "literal": "After the defeat he alone found Xiaohui; in the sixth month, he installed him as Crown Prince and granted a great amnesty to criminals.",
      "idiomatic": "After the defeat he alone found Xiaohui. In the sixth month, he installed him as Crown Prince and granted a great amnesty to criminals.",
      "context": {
        "previous": "漢王之敗彭城而西，行使人求家室，家室亦亡，不相得。",
        "next": "令太子守櫟陽，諸侯子在關中者皆集櫟陽為衛。"
      }
    },
    {
      "id": "s0335",
      "type": "paragraph",
      "chinese": "令太子守櫟陽，諸侯子在關中者皆集櫟陽為衛。",
      "literal": "He ordered the Crown Prince to defend Liyang; all sons of feudal lords who were in Guanzhong assembled at Liyang to serve as guards.",
      "idiomatic": "He ordered the Crown Prince to defend Liyang. All sons of feudal lords who were in Guanzhong assembled at Liyang to serve as guards.",
      "context": {
        "previous": "敗後乃獨得孝惠，六月，立為太子，大赦罪人。",
        "next": "引水灌廢丘，廢丘降，章邯自殺。"
      }
    },
    {
      "id": "s0336",
      "type": "paragraph",
      "chinese": "引水灌廢丘，廢丘降，章邯自殺。",
      "literal": "They diverted water to flood Feiqiu; Feiqiu surrendered and Zhang Han committed suicide.",
      "idiomatic": "They diverted water to flood Feiqiu. Feiqiu surrendered and Zhang Han committed suicide.",
      "context": {
        "previous": "令太子守櫟陽，諸侯子在關中者皆集櫟陽為衛。",
        "next": "更名廢丘為槐里。"
      }
    },
    {
      "id": "s0337",
      "type": "paragraph",
      "chinese": "更名廢丘為槐里。",
      "literal": "They renamed Feiqiu as Huaili.",
      "idiomatic": "They renamed Feiqiu to Huaili.",
      "context": {
        "previous": "引水灌廢丘，廢丘降，章邯自殺。",
        "next": "於是令祠官祀天地四方上帝山川，以時祀之。"
      }
    },
    {
      "id": "s0338",
      "type": "paragraph",
      "chinese": "於是令祠官祀天地四方上帝山川，以時祀之。",
      "literal": "Thereupon he ordered the sacrificial officials to make offerings to Heaven, Earth, the Four Directions, the Supreme Deity, mountains, and rivers, sacrificing to them at the proper times.",
      "idiomatic": "Thereupon he ordered the sacrificial officials to perform rites to Heaven, Earth, the Four Quarters, the Supreme Deity, mountains, and rivers at the appropriate seasons.",
      "context": {
        "previous": "更名廢丘為槐里。",
        "next": "興關內卒乘塞。"
      }
    },
    {
      "id": "s0339",
      "type": "paragraph",
      "chinese": "興關內卒乘塞。",
      "literal": "He mobilized troops from within the passes to man the fortifications.",
      "idiomatic": "He raised troops from within the passes to garrison the defenses.",
      "context": {
        "previous": "於是令祠官祀天地四方上帝山川，以時祀之。"
      }
    },
    {
      "id": "s0340",
      "type": "paragraph",
      "chinese": "是時九江王布與龍且戰，不勝，與隨何閒行歸漢。",
      "literal": "At this time King Bu of Jiujiang fought with Long Ju, did not win, and traveled secretly with Sui He to return to Han.",
      "idiomatic": "At this time, King Bu of Jiujiang battled Long Ju but was defeated, and secretly slipped away with Sui He to return to Han.",
      "context": {
        "next": "漢王稍收士卒，與諸將及關中卒益出，是以兵大振滎陽，破楚京、索閒。"
      }
    },
    {
      "id": "s0341",
      "type": "paragraph",
      "chinese": "漢王稍收士卒，與諸將及關中卒益出，是以兵大振滎陽，破楚京、索閒。",
      "literal": "The King of Han gradually gathered officers and troops; together with the various generals and troops from within the passes they increasingly came out, so that the troops greatly rallied at Yingyang and broke Chu between Jing and Suo.",
      "idiomatic": "The King of Han gradually gathered officers and troops. Together with the various generals and troops from within the passes they increasingly came out. So that the troops greatly rallied at Yingyang and broke Chu between Jing and Suo.",
      "context": {
        "previous": "是時九江王布與龍且戰，不勝，與隨何閒行歸漢。"
      }
    },
    {
      "id": "s0342",
      "type": "paragraph",
      "chinese": "三年，魏王豹謁歸視親疾，至即絕河津，反為楚。",
      "literal": "In the third year, King Bao of Wei requested leave to return to visit his ailing relatives; when he arrived he immediately cut off the Yellow River ford and rebelled to become Chu.",
      "idiomatic": "In the third year, King Bao of Wei requested leave to return to visit his ailing relatives. When he arrived he immediately cut off the Yellow River ford and rebelled to become Chu.",
      "context": {
        "next": "漢王使酈生說豹，豹不聽。"
      }
    },
    {
      "id": "s0343",
      "type": "paragraph",
      "chinese": "漢王使酈生說豹，豹不聽。",
      "literal": "The King of Han sent Li Sheng to persuade Bao, but Bao would not listen.",
      "idiomatic": "The King of Han sent Li Sheng to try to persuade Bao, but Bao refused to listen.",
      "context": {
        "previous": "三年，魏王豹謁歸視親疾，至即絕河津，反為楚。",
        "next": "漢王遣將軍韓信擊，大破之，虜豹。"
      }
    },
    {
      "id": "s0344",
      "type": "paragraph",
      "chinese": "漢王遣將軍韓信擊，大破之，虜豹。",
      "literal": "The King of Han dispatched General Han Xin to strike, greatly broke him, and captured Bao.",
      "idiomatic": "The King of Han dispatched General Han Xin to strike. He greatly broke him and captured Bao.",
      "context": {
        "previous": "漢王使酈生說豹，豹不聽。",
        "next": "遂定魏地，置三郡，曰河東、太原、上黨。"
      }
    },
    {
      "id": "s0345",
      "type": "paragraph",
      "chinese": "遂定魏地，置三郡，曰河東、太原、上黨。",
      "literal": "They then settled the territory of Wei, establishing three commanderies: Hedong, Taiyuan, and Shangdang.",
      "idiomatic": "They then pacified Wei territory and established three commanderies: Hedong, Taiyuan, and Shangdang.",
      "context": {
        "previous": "漢王遣將軍韓信擊，大破之，虜豹。",
        "next": "漢王乃令張耳與韓信遂東下井陘擊趙，斬陳餘、趙王歇。"
      }
    },
    {
      "id": "s0346",
      "type": "paragraph",
      "chinese": "漢王乃令張耳與韓信遂東下井陘擊趙，斬陳餘、趙王歇。",
      "literal": "The King of Han then ordered Zhang Er and Han Xin to proceed east down Jingxing to strike Zhao, behead Chen Yu and King Xie of Zhao.",
      "idiomatic": "The King of Han then ordered Zhang Er and Han Xin to proceed east down Jingxing to strike Zhao. They beheaded Chen Yu and King Xie of Zhao.",
      "context": {
        "previous": "遂定魏地，置三郡，曰河東、太原、上黨。",
        "next": "其明年，立張耳為趙王。"
      }
    },
    {
      "id": "s0347",
      "type": "paragraph",
      "chinese": "其明年，立張耳為趙王。",
      "literal": "The next year, he installed Zhang Er as King of Zhao.",
      "idiomatic": "The following year, he installed Zhang Er as King of Zhao.",
      "context": {
        "previous": "漢王乃令張耳與韓信遂東下井陘擊趙，斬陳餘、趙王歇。"
      }
    },
    {
      "id": "s0348",
      "type": "paragraph",
      "chinese": "漢王軍滎陽南，筑甬道屬之河，以取敖倉。",
      "literal": "The King of Han's army was south of Yingyang, constructing a walled supply road connecting it to the river to obtain grain from Ao Granary.",
      "idiomatic": "The King of Han's army camped south of Yingyang and built a covered causeway connecting to the river to access the grain stores at Ao Granary.",
      "context": {
        "next": "與項羽相距歲餘。"
      }
    },
    {
      "id": "s0349",
      "type": "paragraph",
      "chinese": "與項羽相距歲餘。",
      "literal": "They confronted Xiang Yu for over a year.",
      "idiomatic": "They faced off against Xiang Yu for more than a year.",
      "context": {
        "previous": "漢王軍滎陽南，筑甬道屬之河，以取敖倉。",
        "next": "項羽數侵奪漢甬道，漢軍乏食，遂圍漢王。"
      }
    },
    {
      "id": "s0350",
      "type": "paragraph",
      "chinese": "項羽數侵奪漢甬道，漢軍乏食，遂圍漢王。",
      "literal": "Xiang Yu repeatedly raided and seized Han's supply road; the Han army lacked food and was then besieged by the King of Han.",
      "idiomatic": "Xiang Yu repeatedly raided and seized Han's supply road. The Han army lacked food and was then besieged.",
      "context": {
        "previous": "與項羽相距歲餘。",
        "next": "漢王請和，割滎陽以西者為漢。"
      }
    },
    {
      "id": "s0351",
      "type": "paragraph",
      "chinese": "漢王請和，割滎陽以西者為漢。",
      "literal": "The King of Han requested peace, offering to cede Yingyang and westward as Han.",
      "idiomatic": "The King of Han sued for peace, offering to cede everything west of Yingyang to Han.",
      "context": {
        "previous": "項羽數侵奪漢甬道，漢軍乏食，遂圍漢王。",
        "next": "項王不聽。"
      }
    },
    {
      "id": "s0352",
      "type": "paragraph",
      "chinese": "項王不聽。",
      "literal": "King Xiang would not listen.",
      "idiomatic": "King Xiang refused to listen.",
      "context": {
        "previous": "漢王請和，割滎陽以西者為漢。",
        "next": "漢王患之，乃用陳平之計，予陳平金四萬斤，以閒疏楚君臣。"
      }
    },
    {
      "id": "s0353",
      "type": "paragraph",
      "chinese": "漢王患之，乃用陳平之計，予陳平金四萬斤，以閒疏楚君臣。",
      "literal": "The King of Han was troubled by this, so he used Chen Ping's stratagem, giving Chen Ping forty thousand jin of gold to sow discord between Chu's lord and ministers.",
      "idiomatic": "The King of Han was troubled by this, so he used Chen Ping's stratagem. He gave Chen Ping forty thousand jin of gold to sow discord between Chu's lord and ministers.",
      "context": {
        "previous": "項王不聽。",
        "next": "於是項羽乃疑亞父。"
      }
    },
    {
      "id": "s0354",
      "type": "paragraph",
      "chinese": "於是項羽乃疑亞父。",
      "literal": "Thereupon Xiang Yu became suspicious of the Second Father.",
      "idiomatic": "Thereupon Xiang Yu grew suspicious of Fan Zeng.",
      "context": {
        "previous": "漢王患之，乃用陳平之計，予陳平金四萬斤，以閒疏楚君臣。",
        "next": "亞父是時勸項羽遂下滎陽，及其見疑，乃怒，辭老，願賜骸骨歸卒伍，未至彭城而死。"
      }
    },
    {
      "id": "s0355",
      "type": "paragraph",
      "chinese": "亞父是時勸項羽遂下滎陽，及其見疑，乃怒，辭老，願賜骸骨歸卒伍，未至彭城而死。",
      "literal": "At that time the Second Father urged Xiang Yu to take Yingyang; when he saw himself suspected, he became angry, pleaded old age, requested to be granted his aged bones to return to the ranks; he died before reaching Pengcheng.",
      "idiomatic": "At that time the Second Father urged Xiang Yu to take Yingyang. When he saw himself suspected, he became angry, pleaded old age, and requested to be granted his aged bones to return to the ranks. He died before reaching Pengcheng.",
      "context": {
        "previous": "於是項羽乃疑亞父。"
      }
    },
    {
      "id": "s0356",
      "type": "paragraph",
      "chinese": "漢軍絕食，乃夜出女子東門二千餘人，被甲，楚因四面擊之。",
      "literal": "The Han army was cut off from food, so by night they sent out over two thousand women from the east gate wearing armor; Chu consequently attacked them from four sides.",
      "idiomatic": "The Han army was cut off from food, so by night they sent out over two thousand women from the east gate wearing armor. Chu consequently attacked them from four sides.",
      "context": {
        "next": "將軍紀信乃乘王駕，詐為漢王，誑楚，楚皆呼萬歲，之城東觀，以故漢王得與數十騎出西門遁。"
      }
    },
    {
      "id": "s0357",
      "type": "paragraph",
      "chinese": "將軍紀信乃乘王駕，詐為漢王，誑楚，楚皆呼萬歲，之城東觀，以故漢王得與數十騎出西門遁。",
      "literal": "General Ji Xin then rode in the king's chariot, pretended to be the King of Han, and deceived Chu; all the Chu troops shouted 'Long live!' and went to observe east of the city; because of this the King of Han was able to escape out the west gate with several tens of riders.",
      "idiomatic": "General Ji Xin then rode in the king's chariot, pretended to be the King of Han, and deceived Chu. All the Chu troops shouted 'Long live!' and went to observe east of the city. Because of this the King of Han was able to escape out the west gate with several tens of riders.",
      "context": {
        "previous": "漢軍絕食，乃夜出女子東門二千餘人，被甲，楚因四面擊之。",
        "next": "令御史大夫周苛、魏豹、樅公守滎陽。"
      }
    },
    {
      "id": "s0358",
      "type": "paragraph",
      "chinese": "令御史大夫周苛、魏豹、樅公守滎陽。",
      "literal": "He ordered Imperial Secretary Zhou Ke, Wei Bao, and Duke Cong to defend Yingyang.",
      "idiomatic": "He ordered Imperial Secretary Zhou Ke, Wei Bao, and Duke Cong to defend Yingyang.",
      "context": {
        "previous": "將軍紀信乃乘王駕，詐為漢王，誑楚，楚皆呼萬歲，之城東觀，以故漢王得與數十騎出西門遁。",
        "next": "諸將卒不能從者，盡在城中。"
      }
    },
    {
      "id": "s0359",
      "type": "paragraph",
      "chinese": "諸將卒不能從者，盡在城中。",
      "literal": "All generals and troops who could not follow were entirely in the city.",
      "idiomatic": "All the generals and soldiers who couldn't follow him were left behind in the city.",
      "context": {
        "previous": "令御史大夫周苛、魏豹、樅公守滎陽。",
        "next": "周苛、樅公相謂曰：「反國之王，難與守城。」"
      }
    },
    {
      "id": "s0360",
      "type": "paragraph",
      "chinese": "周苛、樅公相謂曰：「反國之王，難與守城。」",
      "literal": "Zhou Ke and Duke Cong said to each other: \"A king who has rebelled against his state is difficult to defend a city with.\"",
      "idiomatic": "Zhou Ke and Duke Cong said to each other: 'A king who has rebelled against his state is difficult to defend a city with.''",
      "context": {
        "previous": "諸將卒不能從者，盡在城中。",
        "next": "因殺魏豹。"
      }
    },
    {
      "id": "s0361",
      "type": "paragraph",
      "chinese": "因殺魏豹。",
      "literal": "They consequently killed Wei Bao.",
      "idiomatic": "They consequently executed Wei Bao.",
      "context": {
        "previous": "周苛、樅公相謂曰：「反國之王，難與守城。」"
      }
    },
    {
      "id": "s0362",
      "type": "paragraph",
      "chinese": "漢王之出滎陽入關，收兵欲復東。",
      "literal": "When the King of Han left Yingyang and entered the passes, he gathered troops wishing to go east again.",
      "idiomatic": "When the King of Han left Yingyang and entered the passes, he rallied troops intending to march east again.",
      "context": {
        "next": "袁生說漢王曰：「漢與楚相距滎陽數歲，漢常困。"
      }
    },
    {
      "id": "s0363",
      "type": "paragraph",
      "chinese": "袁生說漢王曰：「漢與楚相距滎陽數歲，漢常困。",
      "literal": "Yuan Sheng persuaded the King of Han, saying: \"Han and Chu have confronted each other at Yingyang for several years; Han has constantly been in difficulty.",
      "idiomatic": "Yuan Sheng persuaded the King of Han, saying: 'Han and Chu have confronted each other at Yingyang for several years. Han has constantly been in difficulty.'",
      "context": {
        "previous": "漢王之出滎陽入關，收兵欲復東。",
        "next": "願君王出武關，項羽必引兵南走，王深壁，令滎陽成皋閒且得休。"
      }
    },
    {
      "id": "s0364",
      "type": "paragraph",
      "chinese": "願君王出武關，項羽必引兵南走，王深壁，令滎陽成皋閒且得休。",
      "literal": "I hope the king will go out through Wuguan; Xiang Yu will certainly lead troops south in pursuit; the king should entrench deeply, allowing those between Yingyang and Chenggao to obtain some rest.",
      "idiomatic": "I hope the king will go out through Wuguan. Xiang Yu will certainly lead troops south in pursuit. The king should entrench deeply, allowing those between Yingyang and Chenggao to obtain some rest.",
      "context": {
        "previous": "袁生說漢王曰：「漢與楚相距滎陽數歲，漢常困。",
        "next": "使韓信等輯河北趙地，連燕齊，君王乃復走滎陽，未晚也。"
      }
    },
    {
      "id": "s0365",
      "type": "paragraph",
      "chinese": "使韓信等輯河北趙地，連燕齊，君王乃復走滎陽，未晚也。",
      "literal": "Have Han Xin and others pacify the territory of Zhao north of the Yellow River, connect with Yan and Qi, then the king can return to Yingyang—it will not be too late.",
      "idiomatic": "Have Han Xin and others pacify the territory of Zhao north of the Yellow River, connect with Yan and Qi. Then the king can return to Yingyang—it will not be too late.",
      "context": {
        "previous": "願君王出武關，項羽必引兵南走，王深壁，令滎陽成皋閒且得休。",
        "next": "如此，則楚所備者多，力分，漢得休，復與之戰，破楚必矣。」"
      }
    },
    {
      "id": "s0366",
      "type": "paragraph",
      "chinese": "如此，則楚所備者多，力分，漢得休，復與之戰，破楚必矣。」",
      "literal": "If this is done, then what Chu must prepare for will be many places, their strength divided; Han will obtain rest and fight with them again—breaking Chu will be certain.\"",
      "idiomatic": "If this is done, then what Chu must prepare for will be many places, their strength divided. Han will obtain rest and fight with them again—breaking Chu will be certain.''",
      "context": {
        "previous": "使韓信等輯河北趙地，連燕齊，君王乃復走滎陽，未晚也。",
        "next": "漢王從其計，出軍宛葉閒，與黥布行收兵。"
      }
    },
    {
      "id": "s0367",
      "type": "paragraph",
      "chinese": "漢王從其計，出軍宛葉閒，與黥布行收兵。",
      "literal": "The King of Han followed his plan, sent out his army between Wan and Ye, and traveled with Qing Bu gathering troops.",
      "idiomatic": "The King of Han adopted his strategy, deployed his army between Wan and Ye, and traveled with Qing Bu recruiting troops.",
      "context": {
        "previous": "如此，則楚所備者多，力分，漢得休，復與之戰，破楚必矣。」"
      }
    },
    {
      "id": "s0368",
      "type": "paragraph",
      "chinese": "項羽聞漢王在宛，果引兵南。",
      "literal": "Xiang Yu heard the King of Han was at Wan and indeed led troops south.",
      "idiomatic": "Xiang Yu learned that the King of Han was at Wan and immediately marched south.",
      "context": {
        "next": "漢王堅壁不與戰。"
      }
    },
    {
      "id": "s0369",
      "type": "paragraph",
      "chinese": "漢王堅壁不與戰。",
      "literal": "The King of Han entrenched firmly and would not engage in battle.",
      "idiomatic": "The King of Han fortified his position and refused battle.",
      "context": {
        "previous": "項羽聞漢王在宛，果引兵南。",
        "next": "是時彭越渡睢水，與項聲、薛公戰下邳，彭越大破楚軍。"
      }
    },
    {
      "id": "s0370",
      "type": "paragraph",
      "chinese": "是時彭越渡睢水，與項聲、薛公戰下邳，彭越大破楚軍。",
      "literal": "At this time Peng Yue crossed the Sui River and fought with Xiang Sheng and Xue Gong at Xiapei; Peng Yue greatly broke the Chu army.",
      "idiomatic": "At this time Peng Yue crossed the Sui River and fought with Xiang Sheng and Xue Gong at Xiapei. Peng Yue greatly broke the Chu army.",
      "context": {
        "previous": "漢王堅壁不與戰。",
        "next": "項羽乃引兵東擊彭越。"
      }
    },
    {
      "id": "s0371",
      "type": "paragraph",
      "chinese": "項羽乃引兵東擊彭越。",
      "literal": "Xiang Yu then led troops east to strike Peng Yue.",
      "idiomatic": "Xiang Yu then marched east to attack Peng Yue.",
      "context": {
        "previous": "是時彭越渡睢水，與項聲、薛公戰下邳，彭越大破楚軍。",
        "next": "漢王亦引兵北軍成皋。"
      }
    },
    {
      "id": "s0372",
      "type": "paragraph",
      "chinese": "漢王亦引兵北軍成皋。",
      "literal": "The King of Han also led troops north to encamp at Chenggao.",
      "idiomatic": "The King of Han also marched north and made camp at Chenggao.",
      "context": {
        "previous": "項羽乃引兵東擊彭越。",
        "next": "項羽已破走彭越，聞漢王復軍成皋，乃復引兵西，拔滎陽，誅周苛、樅公，而虜韓王信，遂圍成皋。"
      }
    },
    {
      "id": "s0373",
      "type": "paragraph",
      "chinese": "項羽已破走彭越，聞漢王復軍成皋，乃復引兵西，拔滎陽，誅周苛、樅公，而虜韓王信，遂圍成皋。",
      "literal": "Having broken and driven off Peng Yue, Xiang Yu heard the King of Han had again encamped at Chenggao, so he again led troops west, took Yingyang, executed Zhou Ke and Duke Cong, captured King Xin of Han as prisoner, and then besieged Chenggao.",
      "idiomatic": "Having broken and driven off Peng Yue, Xiang Yu heard the King of Han had again encamped at Chenggao. So he again led troops west, took Yingyang, executed Zhou Ke and Duke Cong, captured King Xin of Han as prisoner, and then besieged Chenggao.",
      "context": {
        "previous": "漢王亦引兵北軍成皋。"
      }
    },
    {
      "id": "s0374",
      "type": "paragraph",
      "chinese": "漢王跳，獨與滕公共車出成皋玉門，北渡河，馳宿修武。",
      "literal": "The King of Han leaped out, alone with Duke Teng sharing a chariot going out Chenggao's Jade Gate, crossed the Yellow River to the north, and galloped to lodge at Xiuwu.",
      "idiomatic": "The King of Han leaped out, alone with Duke Teng sharing a chariot going out Chenggao's Jade Gate. He crossed the Yellow River to the north and galloped to lodge at Xiuwu.",
      "context": {
        "next": "自稱使者，晨馳入張耳、韓信壁，而奪之軍。"
      }
    },
    {
      "id": "s0375",
      "type": "paragraph",
      "chinese": "自稱使者，晨馳入張耳、韓信壁，而奪之軍。",
      "literal": "Calling himself an envoy, at dawn he galloped into Zhang Er and Han Xin's encampment and seized their army.",
      "idiomatic": "Claiming to be an envoy, he charged at dawn into Zhang Er and Han Xin's camp and took command of their army.",
      "context": {
        "previous": "漢王跳，獨與滕公共車出成皋玉門，北渡河，馳宿修武。",
        "next": "乃使張耳北益收兵趙地，使韓信東擊齊。"
      }
    },
    {
      "id": "s0376",
      "type": "paragraph",
      "chinese": "乃使張耳北益收兵趙地，使韓信東擊齊。",
      "literal": "He then sent Zhang Er north to further gather troops in Zhao territory and sent Han Xin east to strike Qi.",
      "idiomatic": "He sent Zhang Er north to recruit more troops in Zhao territory and Han Xin east to attack Qi.",
      "context": {
        "previous": "自稱使者，晨馳入張耳、韓信壁，而奪之軍。",
        "next": "漢王得韓信軍，則復振。"
      }
    },
    {
      "id": "s0377",
      "type": "paragraph",
      "chinese": "漢王得韓信軍，則復振。",
      "literal": "The King of Han having obtained Han Xin's army then rallied again.",
      "idiomatic": "With Han Xin's army now under his command, the King of Han regained his strength.",
      "context": {
        "previous": "乃使張耳北益收兵趙地，使韓信東擊齊。",
        "next": "引兵臨河，南饗軍小修武南，欲復戰。"
      }
    },
    {
      "id": "s0378",
      "type": "paragraph",
      "chinese": "引兵臨河，南饗軍小修武南，欲復戰。",
      "literal": "He led troops to the Yellow River, feasted the army to the south at Little Xiuwu to the south, wishing to fight again.",
      "idiomatic": "He led troops to the Yellow River, feasted the army to the south at Little Xiuwu, wishing to fight again.",
      "context": {
        "previous": "漢王得韓信軍，則復振。",
        "next": "郎中鄭忠乃說止漢王，使高壘深塹，勿與戰。"
      }
    },
    {
      "id": "s0379",
      "type": "paragraph",
      "chinese": "郎中鄭忠乃說止漢王，使高壘深塹，勿與戰。",
      "literal": "Gentleman Zheng Zhong then persuaded and stopped the King of Han, having him build high ramparts and dig deep trenches and not engage in battle.",
      "idiomatic": "Gentleman Zheng Zhong then persuaded the King of Han to hold back, building high fortifications and deep trenches instead of giving battle.",
      "context": {
        "previous": "引兵臨河，南饗軍小修武南，欲復戰。",
        "next": "漢王聽其計，使盧綰、劉賈將卒二萬人，騎數百，渡白馬津，入楚地，與彭越復擊破楚軍燕郭西，遂復下梁地十餘城。"
      }
    },
    {
      "id": "s0380",
      "type": "paragraph",
      "chinese": "漢王聽其計，使盧綰、劉賈將卒二萬人，騎數百，渡白馬津，入楚地，與彭越復擊破楚軍燕郭西，遂復下梁地十餘城。",
      "literal": "The Han king listened to their plan, sent Lu Wan and Liu Jia to lead twenty thousand troops and several hundred cavalry, cross the Bai Ma ford, enter Chu territory, and together with Peng Yue again strike and break Chu army at Yan Guo west, then recapture over ten Liang cities.",
      "idiomatic": "The Han king listened to their plan, sent Lu Wan and Liu Jia to lead twenty thousand troops and several hundred cavalry. They crossed the Bai Ma ford, entered Chu territory, and together with Peng Yue again struck and broke Chu army at Yan Guo west, then recaptured over ten Liang cities.",
      "context": {
        "previous": "郎中鄭忠乃說止漢王，使高壘深塹，勿與戰。"
      }
    },
    {
      "id": "s0381",
      "type": "paragraph",
      "chinese": "淮陰已受命東，未渡平原。",
      "literal": "Marquis of Huaiyin already received orders east, not yet crossed Pingyuan.",
      "idiomatic": "The Marquis of Huaiyin had already received orders to go east but had not yet crossed Pingyuan.",
      "context": {
        "next": "漢王使酈生往說齊王田廣，廣叛楚，與漢和，共擊項羽。"
      }
    },
    {
      "id": "s0382",
      "type": "paragraph",
      "chinese": "漢王使酈生往說齊王田廣，廣叛楚，與漢和，共擊項羽。",
      "literal": "The King of Han sent Li Sheng to persuade King Tian Guang of Qi; Guang rebelled against Chu and made peace with Han to together strike Xiang Yu.",
      "idiomatic": "The King of Han sent Li Sheng to persuade King Tian Guang of Qi. Guang rebelled against Chu and made peace with Han to together strike Xiang Yu.",
      "context": {
        "previous": "淮陰已受命東，未渡平原。",
        "next": "韓信用蒯通計，遂襲破齊。"
      }
    },
    {
      "id": "s0383",
      "type": "paragraph",
      "chinese": "韓信用蒯通計，遂襲破齊。",
      "literal": "Han Xin used Kuai Tong's stratagem and then launched a surprise attack and broke Qi.",
      "idiomatic": "Han Xin followed Kuai Tong's strategy and launched a surprise attack that shattered Qi.",
      "context": {
        "previous": "漢王使酈生往說齊王田廣，廣叛楚，與漢和，共擊項羽。",
        "next": "齊王烹酈生，東走高密。"
      }
    },
    {
      "id": "s0384",
      "type": "paragraph",
      "chinese": "齊王烹酈生，東走高密。",
      "literal": "The King of Qi boiled Li Sheng alive and fled east to Gaomi.",
      "idiomatic": "The King of Qi had Li Sheng boiled alive and fled east to Gaomi.",
      "context": {
        "previous": "韓信用蒯通計，遂襲破齊。",
        "next": "項羽聞韓信已舉河北兵破齊、趙，且欲擊楚，則使龍且、周蘭往擊之。"
      }
    },
    {
      "id": "s0385",
      "type": "paragraph",
      "chinese": "項羽聞韓信已舉河北兵破齊、趙，且欲擊楚，則使龍且、周蘭往擊之。",
      "literal": "Xiang Yu heard that Han Xin had already raised troops north of the Yellow River and broken Qi and Zhao and was about to strike Chu, so he sent Long Ju and Zhou Lan to strike him.",
      "idiomatic": "Xiang Yu heard that Han Xin had already raised troops north of the Yellow River and broken Qi and Zhao and was about to strike Chu. So he sent Long Ju and Zhou Lan to strike him.",
      "context": {
        "previous": "齊王烹酈生，東走高密。",
        "next": "韓信與戰，騎將灌嬰擊，大破楚軍，殺龍且。"
      }
    },
    {
      "id": "s0386",
      "type": "paragraph",
      "chinese": "韓信與戰，騎將灌嬰擊，大破楚軍，殺龍且。",
      "literal": "Han Xin engaged in battle; cavalry general Guan Ying struck and greatly broke the Chu army, killing Long Ju.",
      "idiomatic": "Han Xin engaged in battle. Cavalry general Guan Ying struck and greatly broke the Chu army, killing Long Ju.",
      "context": {
        "previous": "項羽聞韓信已舉河北兵破齊、趙，且欲擊楚，則使龍且、周蘭往擊之。",
        "next": "齊王廣奔彭越。"
      }
    },
    {
      "id": "s0387",
      "type": "paragraph",
      "chinese": "齊王廣奔彭越。",
      "literal": "King Guang of Qi fled to Peng Yue.",
      "idiomatic": "King Guang of Qi fled to Peng Yue for refuge.",
      "context": {
        "previous": "韓信與戰，騎將灌嬰擊，大破楚軍，殺龍且。",
        "next": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。"
      }
    },
    {
      "id": "s0388",
      "type": "paragraph",
      "chinese": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。",
      "literal": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
      "idiomatic": "At this time, Peng Yue commanded troops based in Liang territory, constantly harassing the Chu forces and severing their supply lines.",
      "context": {
        "previous": "齊王廣奔彭越。"
      }
    },
    {
      "id": "s0389",
      "type": "paragraph",
      "chinese": "四年，項羽乃謂海春侯大司馬曹咎曰：「謹守成皋。",
      "literal": "In the fourth year, Xiang Yu then said to Marquis of Haichun Grand Marshal Cao Jiu: \"Carefully defend Chenggao.",
      "idiomatic": "In the fourth year, Xiang Yu then said to Marquis of Haichun Grand Marshal Cao Jiu: 'Carefully defend Chenggao.'",
      "context": {
        "next": "若漢挑戰，慎勿與戰，無令得東而已。"
      }
    },
    {
      "id": "s0390",
      "type": "paragraph",
      "chinese": "若漢挑戰，慎勿與戰，無令得東而已。",
      "literal": "If Han challenges to battle, be cautious not to engage in battle, and do not let them get east—that is all.",
      "idiomatic": "If Han challenges to battle, be cautious not to engage in battle, and do not let them get east—that is all.''",
      "context": {
        "previous": "四年，項羽乃謂海春侯大司馬曹咎曰：「謹守成皋。",
        "next": "我十五日必定梁地，復從將軍。」"
      }
    },
    {
      "id": "s0391",
      "type": "paragraph",
      "chinese": "我十五日必定梁地，復從將軍。」",
      "literal": "In fifteen days I will certainly settle the land of Liang and return to join the generals.\"",
      "idiomatic": "In fifteen days I will certainly settle the land of Liang and return to join the generals.''",
      "context": {
        "previous": "若漢挑戰，慎勿與戰，無令得東而已。",
        "next": "乃行擊陳留、外黃、睢陽，下之。"
      }
    },
    {
      "id": "s0392",
      "type": "paragraph",
      "chinese": "乃行擊陳留、外黃、睢陽，下之。",
      "literal": "He then marched to strike Chenliu, Waihuang, and Suiyang, taking them.",
      "idiomatic": "He marched on Chenliu, Waihuang, and Suiyang, capturing them all.",
      "context": {
        "previous": "我十五日必定梁地，復從將軍。」",
        "next": "漢果數挑楚軍，楚軍不出，使人辱之五六日，大司馬怒，度兵汜水。"
      }
    },
    {
      "id": "s0393",
      "type": "paragraph",
      "chinese": "漢果數挑楚軍，楚軍不出，使人辱之五六日，大司馬怒，度兵汜水。",
      "literal": "Han indeed repeatedly challenged the Chu army to battle; the Chu army would not come out; they sent men to insult them for five or six days; the Grand Marshal was enraged and crossed his troops over the Fan River.",
      "idiomatic": "Han indeed repeatedly challenged the Chu army to battle. The Chu army would not come out. They sent men to insult them for five or six days. The Grand Marshal was enraged and crossed his troops over the Fan River.",
      "context": {
        "previous": "乃行擊陳留、外黃、睢陽，下之。",
        "next": "士卒半渡，漢擊之，大破楚軍，盡得楚國金玉貨賂。"
      }
    },
    {
      "id": "s0394",
      "type": "paragraph",
      "chinese": "士卒半渡，漢擊之，大破楚軍，盡得楚國金玉貨賂。",
      "literal": "When half the officers and troops had crossed, Han struck them, greatly broke the Chu army, and completely obtained all Chu's gold, jade, wealth, and bribes.",
      "idiomatic": "When half the soldiers had crossed, Han attacked, routing the Chu army and seizing all their gold, jade, treasures, and valuables.",
      "context": {
        "previous": "漢果數挑楚軍，楚軍不出，使人辱之五六日，大司馬怒，度兵汜水。",
        "next": "大司馬咎、長史欣皆自剄汜水上。"
      }
    },
    {
      "id": "s0395",
      "type": "paragraph",
      "chinese": "大司馬咎、長史欣皆自剄汜水上。",
      "literal": "Grand Marshal Jiu and Chief Clerk Xin both slit their own throats at the Fan River.",
      "idiomatic": "Grand Marshal Jiu and Chief Clerk Xin both committed suicide by the Fan River.",
      "context": {
        "previous": "士卒半渡，漢擊之，大破楚軍，盡得楚國金玉貨賂。",
        "next": "項羽至睢陽，聞海春侯破，乃引兵還。"
      }
    },
    {
      "id": "s0396",
      "type": "paragraph",
      "chinese": "項羽至睢陽，聞海春侯破，乃引兵還。",
      "literal": "Xiang Yu reached Suiyang and heard that Marquis of Haichun was broken, so he led his troops back.",
      "idiomatic": "Xiang Yu reached Suiyang and heard that Marquis of Haichun was broken. So he led his troops back.",
      "context": {
        "previous": "大司馬咎、長史欣皆自剄汜水上。",
        "next": "漢軍方圍鐘離眛於滎陽東，項羽至，盡走險阻。"
      }
    },
    {
      "id": "s0397",
      "type": "paragraph",
      "chinese": "漢軍方圍鐘離眛於滎陽東，項羽至，盡走險阻。",
      "literal": "The Han army was besieging Zhongli Mo east of Yingyang; when Xiang Yu arrived, they all fled to dangerous terrain.",
      "idiomatic": "The Han army was besieging Zhongli Mo east of Yingyang. When Xiang Yu arrived, they all fled to dangerous terrain.",
      "context": {
        "previous": "項羽至睢陽，聞海春侯破，乃引兵還。"
      }
    },
    {
      "id": "s0398",
      "type": "paragraph",
      "chinese": "韓信已破齊，使人言曰：「齊邊楚，權輕，不為假王，恐不能安齊。」",
      "literal": "Han Xin having already broken Qi sent someone to say: \"Qi borders Chu; authority is light—if I am not made provisional king, I fear I cannot stabilize Qi.\"",
      "idiomatic": "Han Xin having already broken Qi sent someone to say: 'Qi borders Chu; authority is light—if I am not made provisional king, I fear I cannot stabilize Qi.''",
      "context": {
        "next": "漢王欲攻之。"
      }
    },
    {
      "id": "s0399",
      "type": "paragraph",
      "chinese": "漢王欲攻之。",
      "literal": "The King of Han wished to attack him.",
      "idiomatic": "The King of Han wanted to attack him.",
      "context": {
        "previous": "韓信已破齊，使人言曰：「齊邊楚，權輕，不為假王，恐不能安齊。」",
        "next": "留侯曰：「不如因而立之，使自為守。」"
      }
    },
    {
      "id": "s0400",
      "type": "paragraph",
      "chinese": "留侯曰：「不如因而立之，使自為守。」",
      "literal": "The Marquis of Liu said: \"It would be better to consequently install him and have him defend on his own.\"",
      "idiomatic": "The Marquis of Liu said: 'It would be better to consequently install him and have him defend on his own.''",
      "context": {
        "previous": "漢王欲攻之。",
        "next": "乃遣張良操印綬立韓信為齊王。"
      }
    },
    {
      "id": "s0401",
      "type": "paragraph",
      "chinese": "乃遣張良操印綬立韓信為齊王。",
      "literal": "He then dispatched Zhang Liang bearing the seal and ribbons to install Han Xin as King of Qi.",
      "idiomatic": "He sent Zhang Liang with the royal seal and sashes to install Han Xin as King of Qi.",
      "context": {
        "previous": "留侯曰：「不如因而立之，使自為守。」"
      }
    },
    {
      "id": "s0402",
      "type": "paragraph",
      "chinese": "項羽聞龍且軍破，則恐，使盱臺人武涉往說韓信。",
      "literal": "Xiang Yu heard that Long Ju's army was broken and was then afraid, sending Wu She of Xutai to persuade Han Xin.",
      "idiomatic": "Xiang Yu heard that Long Ju's army was broken and was then afraid. He sent Wu She of Xutai to persuade Han Xin.",
      "context": {
        "next": "韓信不聽。"
      }
    },
    {
      "id": "s0403",
      "type": "paragraph",
      "chinese": "韓信不聽。",
      "literal": "Han Xin would not listen.",
      "idiomatic": "Han Xin refused.",
      "context": {
        "previous": "項羽聞龍且軍破，則恐，使盱臺人武涉往說韓信。"
      }
    },
    {
      "id": "s0404",
      "type": "paragraph",
      "chinese": "楚漢久相持未決，丁壯苦軍旅，老弱罷轉馕。",
      "literal": "Chu and Han long confronted each other without resolution; the able-bodied suffered from military service, the old and weak were exhausted transporting grain.",
      "idiomatic": "Chu and Han long confronted each other without resolution. The able-bodied suffered from military service, the old and weak were exhausted transporting grain.",
      "context": {
        "next": "漢王項羽相與臨廣武之閒而語。"
      }
    },
    {
      "id": "s0405",
      "type": "paragraph",
      "chinese": "漢王項羽相與臨廣武之閒而語。",
      "literal": "The King of Han and Xiang Yu faced each other between Guangwu and spoke.",
      "idiomatic": "The King of Han and Xiang Yu stood facing each other across the Guangwu River and spoke.",
      "context": {
        "previous": "楚漢久相持未決，丁壯苦軍旅，老弱罷轉馕。",
        "next": "項羽欲與漢王獨身挑戰。"
      }
    },
    {
      "id": "s0406",
      "type": "paragraph",
      "chinese": "項羽欲與漢王獨身挑戰。",
      "literal": "Xiang Yu wished to challenge the King of Han to single combat.",
      "idiomatic": "Xiang Yu wanted to challenge the King of Han to personal combat.",
      "context": {
        "previous": "漢王項羽相與臨廣武之閒而語。",
        "next": "漢王數項羽曰：「始與項羽俱受命懷王，曰先入定關中者王之，項羽負約，王我於蜀漢，罪一。"
      }
    },
    {
      "id": "s0407",
      "type": "paragraph",
      "chinese": "漢王數項羽曰：「始與項羽俱受命懷王，曰先入定關中者王之，項羽負約，王我於蜀漢，罪一。",
      "literal": "The King of Han enumerated Xiang Yu's crimes, saying: \"At first Xiang Yu and I both received orders from King Huai saying he who first enters and settles Guanzhong shall be its king; Xiang Yu broke the agreement and made me king in Shu and Han—crime one.",
      "idiomatic": "The King of Han enumerated Xiang Yu's crimes, saying: 'At first Xiang Yu and I both received orders from King Huai saying he who first enters and settles Guanzhong shall be its king. Xiang Yu broke the agreement and made me king in Shu and Han—crime one.'",
      "context": {
        "previous": "項羽欲與漢王獨身挑戰。",
        "next": "秦項羽矯殺卿子冠軍而自尊，罪二。"
      }
    },
    {
      "id": "s0408",
      "type": "paragraph",
      "chinese": "秦項羽矯殺卿子冠軍而自尊，罪二。",
      "literal": "Xiang Yu falsely killed Lord Superior to Ministers and exalted himself—crime two.",
      "idiomatic": "Xiang Yu falsely executed Lord Superior to Ministers and exalted himself—crime two.",
      "context": {
        "previous": "漢王數項羽曰：「始與項羽俱受命懷王，曰先入定關中者王之，項羽負約，王我於蜀漢，罪一。",
        "next": "項羽已救趙，當還報，而擅劫諸侯兵入關，罪三。"
      }
    },
    {
      "id": "s0409",
      "type": "paragraph",
      "chinese": "項羽已救趙，當還報，而擅劫諸侯兵入關，罪三。",
      "literal": "Having already rescued Zhao, Xiang Yu should have returned to report, but instead he seized the feudal lords' troops without authorization and entered the passes—crime three.",
      "idiomatic": "Having already rescued Zhao, Xiang Yu should have returned to report. But instead he seized the feudal lords' troops without authorization and entered the passes—crime three.",
      "context": {
        "previous": "秦項羽矯殺卿子冠軍而自尊，罪二。",
        "next": "懷王約入秦無暴掠，項羽燒秦宮室，掘始皇帝冢，私收其財物，罪四。"
      }
    },
    {
      "id": "s0410",
      "type": "paragraph",
      "chinese": "懷王約入秦無暴掠，項羽燒秦宮室，掘始皇帝冢，私收其財物，罪四。",
      "literal": "King Huai's agreement was that in entering Qin there should be no violence or plunder; Xiang Yu burned the Qin palace chambers, dug up the First Emperor's tomb, and privately took its wealth and goods—crime four.",
      "idiomatic": "King Huai's agreement was that in entering Qin there should be no violence or plunder. Xiang Yu burned the Qin palace chambers, dug up the First Emperor's tomb, and privately took its wealth and goods—crime four.",
      "context": {
        "previous": "項羽已救趙，當還報，而擅劫諸侯兵入關，罪三。",
        "next": "又彊殺秦降王子嬰，罪五。"
      }
    },
    {
      "id": "s0411",
      "type": "paragraph",
      "chinese": "又彊殺秦降王子嬰，罪五。",
      "literal": "He also forcibly killed the surrendered King of Qin, Ziying—crime five.",
      "idiomatic": "He also brutally murdered the surrendered King of Qin, Ziying—crime five.",
      "context": {
        "previous": "懷王約入秦無暴掠，項羽燒秦宮室，掘始皇帝冢，私收其財物，罪四。",
        "next": "詐阬秦子弟新安二十萬，王其將，罪六。"
      }
    },
    {
      "id": "s0412",
      "type": "paragraph",
      "chinese": "詐阬秦子弟新安二十萬，王其將，罪六。",
      "literal": "He deceitfully buried alive two hundred thousand Qin sons and younger brothers at Xin'an and made their generals kings—crime six.",
      "idiomatic": "He deceitfully massacred 200,000 Qin soldiers at Xin'an by burying them alive, then enfeoffed their generals—crime six.",
      "context": {
        "previous": "又彊殺秦降王子嬰，罪五。",
        "next": "項羽皆王諸將善地，而徙逐故主，令臣下爭叛逆，罪七。"
      }
    },
    {
      "id": "s0413",
      "type": "paragraph",
      "chinese": "項羽皆王諸將善地，而徙逐故主，令臣下爭叛逆，罪七。",
      "literal": "Xiang Yu made kings of all the generals in good lands while moving and expelling the former lords, causing ministers and subordinates to compete in rebellion and treason—crime seven.",
      "idiomatic": "Xiang Yu made kings of all the generals in good lands while moving and expelling the former lords. He caused ministers and subordinates to compete in rebellion and treason—crime seven.",
      "context": {
        "previous": "詐阬秦子弟新安二十萬，王其將，罪六。",
        "next": "項羽出逐義帝彭城，自都之，奪韓王地，并王梁楚，多自予，罪八。"
      }
    },
    {
      "id": "s0414",
      "type": "paragraph",
      "chinese": "項羽出逐義帝彭城，自都之，奪韓王地，并王梁楚，多自予，罪八。",
      "literal": "Xiang Yu expelled the Righteous Emperor from Pengcheng and made it his own capital, seized the King of Han's territory, and combined to rule Liang and Chu, taking much for himself—crime eight.",
      "idiomatic": "Xiang Yu expelled the Righteous Emperor from Pengcheng and made it his own capital. He seized the King of Han's territory and combined to rule Liang and Chu, taking much for himself—crime eight.",
      "context": {
        "previous": "項羽皆王諸將善地，而徙逐故主，令臣下爭叛逆，罪七。",
        "next": "項羽使人陰弒義帝江南，罪九。"
      }
    },
    {
      "id": "s0415",
      "type": "paragraph",
      "chinese": "項羽使人陰弒義帝江南，罪九。",
      "literal": "Xiang Yu sent men to secretly assassinate the Righteous Emperor south of the Yangtze—crime nine.",
      "idiomatic": "Xiang Yu sent assassins to murder the Righteous Emperor south of the Yangtze—crime nine.",
      "context": {
        "previous": "項羽出逐義帝彭城，自都之，奪韓王地，并王梁楚，多自予，罪八。",
        "next": "夫為人臣而弒其主，殺已降，為政不平，主約不信，天下所不容，大逆無道，罪十也。"
      }
    },
    {
      "id": "s0416",
      "type": "paragraph",
      "chinese": "夫為人臣而弒其主，殺已降，為政不平，主約不信，天下所不容，大逆無道，罪十也。",
      "literal": "Being a minister who assassinates his lord, kills those who have already surrendered, governs unjustly, does not keep agreements with his lord—these all under Heaven cannot tolerate; this is great rebellion and lawlessness—crime ten.",
      "idiomatic": "Being a minister who assassinates his lord, kills those who have already surrendered, governs unjustly, does not keep agreements with his lord—these all under Heaven cannot tolerate. This is great rebellion and lawlessness—crime ten.",
      "context": {
        "previous": "項羽使人陰弒義帝江南，罪九。",
        "next": "吾以義兵從諸侯誅殘賊，使刑餘罪人擊殺項羽，何苦乃與公挑戰！」"
      }
    },
    {
      "id": "s0417",
      "type": "paragraph",
      "chinese": "吾以義兵從諸侯誅殘賊，使刑餘罪人擊殺項羽，何苦乃與公挑戰！」",
      "literal": "I with righteous troops follow the feudal lords to execute cruel rebels; I will have criminals with sentences of mutilation strike and kill Xiang Yu—why would I suffer to challenge you to combat!\"",
      "idiomatic": "I with righteous troops follow the feudal lords to execute cruel rebels. I will have criminals with sentences of mutilation strike and kill Xiang Yu—why would I suffer to challenge you to combat!''",
      "context": {
        "previous": "夫為人臣而弒其主，殺已降，為政不平，主約不信，天下所不容，大逆無道，罪十也。",
        "next": "項羽大怒，伏弩射中漢王。"
      }
    },
    {
      "id": "s0418",
      "type": "paragraph",
      "chinese": "項羽大怒，伏弩射中漢王。",
      "literal": "Xiang Yu greatly enraged, hidden crossbow shot hit King of Han.",
      "idiomatic": "Xiang Yu greatly enraged, his hidden crossbow shot hit the King of Han.",
      "context": {
        "previous": "吾以義兵從諸侯誅殘賊，使刑餘罪人擊殺項羽，何苦乃與公挑戰！」",
        "next": "漢王傷匈，乃捫足曰：「虜中吾指！」"
      }
    },
    {
      "id": "s0419",
      "type": "paragraph",
      "chinese": "漢王傷匈，乃捫足曰：「虜中吾指！」",
      "literal": "The King of Han was wounded in the chest but grasped his foot and said: \"The bandit hit my toe!\"",
      "idiomatic": "The King of Han was wounded in the chest but grasped his foot and said: 'The bandit hit my toe!''",
      "context": {
        "previous": "項羽大怒，伏弩射中漢王。",
        "next": "漢王病創臥，張良彊請漢王起行勞軍，以安士卒，毋令楚乘勝於漢。"
      }
    },
    {
      "id": "s0420",
      "type": "paragraph",
      "chinese": "漢王病創臥，張良彊請漢王起行勞軍，以安士卒，毋令楚乘勝於漢。",
      "literal": "The King of Han lay ill from the wound; Zhang Liang strongly requested the King of Han to rise and go comfort the army to reassure the officers and troops and not let Chu take advantage of Han.",
      "idiomatic": "The King of Han lay ill from the wound. Zhang Liang strongly requested the King of Han to rise and go comfort the army to reassure the officers and troops and not let Chu take advantage of Han.",
      "context": {
        "previous": "漢王傷匈，乃捫足曰：「虜中吾指！」",
        "next": "漢王出行軍，病甚，因馳入成皋。"
      }
    },
    {
      "id": "s0421",
      "type": "paragraph",
      "chinese": "漢王出行軍，病甚，因馳入成皋。",
      "literal": "The King of Han went out to tour the army; his illness was severe, so he galloped into Chenggao.",
      "idiomatic": "The King of Han went out to tour the army. His illness was severe, so he galloped into Chenggao.",
      "context": {
        "previous": "漢王病創臥，張良彊請漢王起行勞軍，以安士卒，毋令楚乘勝於漢。"
      }
    },
    {
      "id": "s0422",
      "type": "paragraph",
      "chinese": "病愈，西入關，至櫟陽，存問父老，置酒，梟故塞王欣頭櫟陽市。",
      "literal": "When his illness improved, he went west into the passes, reached Liyang, inquired after the elders, held a banquet, and displayed the former King of Sai Xin's severed head in the Liyang marketplace.",
      "idiomatic": "Once recovered, he marched west through the passes to Liyang, visited the elders, held a banquet, and had the former King of Sai Xin's head displayed in the marketplace.",
      "context": {
        "next": "留四日，復如軍，軍廣武。"
      }
    },
    {
      "id": "s0423",
      "type": "paragraph",
      "chinese": "留四日，復如軍，軍廣武。",
      "literal": "He remained four days, then returned to the army and encamped at Guangwu.",
      "idiomatic": "He stayed four days, then returned to his army and made camp at Guangwu.",
      "context": {
        "previous": "病愈，西入關，至櫟陽，存問父老，置酒，梟故塞王欣頭櫟陽市。",
        "next": "關中兵益出。"
      }
    },
    {
      "id": "s0424",
      "type": "paragraph",
      "chinese": "關中兵益出。",
      "literal": "Troops from within the passes increasingly came out.",
      "idiomatic": "More troops kept emerging from within the passes.",
      "context": {
        "previous": "留四日，復如軍，軍廣武。"
      }
    },
    {
      "id": "s0425",
      "type": "paragraph",
      "chinese": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。",
      "literal": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
      "idiomatic": "At this time, Peng Yue commanded troops based in Liang territory, constantly raiding Chu forces and severing their supply lines.",
      "context": {
        "next": "田橫往從之。"
      }
    },
    {
      "id": "s0426",
      "type": "paragraph",
      "chinese": "田橫往從之。",
      "literal": "Tian Heng went to join him.",
      "idiomatic": "Tian Heng went to join his cause.",
      "context": {
        "previous": "當此時，彭越將兵居梁地，往來苦楚兵，絕其糧食。",
        "next": "項羽數擊彭越等，齊王信又進擊楚。"
      }
    },
    {
      "id": "s0427",
      "type": "paragraph",
      "chinese": "項羽數擊彭越等，齊王信又進擊楚。",
      "literal": "Xiang Yu repeatedly struck Peng Yue and others; King Xin of Qi also advanced to strike Chu.",
      "idiomatic": "Xiang Yu repeatedly struck Peng Yue and others. King Xin of Qi also advanced to strike Chu.",
      "context": {
        "previous": "田橫往從之。",
        "next": "項羽恐，乃與漢王約，中分天下，割鴻溝而西者為漢，鴻溝而東者為楚。"
      }
    },
    {
      "id": "s0428",
      "type": "paragraph",
      "chinese": "項羽恐，乃與漢王約，中分天下，割鴻溝而西者為漢，鴻溝而東者為楚。",
      "literal": "Xiang Yu was afraid and then made an agreement with the King of Han to divide all under Heaven in the middle: those west of the Hong Canal would be Han, those east of the Hong Canal would be Chu.",
      "idiomatic": "Terrified, Xiang Yu negotiated a truce with the King of Han, dividing the empire along the Hong Canal: west would be Han, east would be Chu.",
      "context": {
        "previous": "項羽數擊彭越等，齊王信又進擊楚。",
        "next": "項王歸漢王父母妻子，軍中皆呼萬歲，乃歸而別去。"
      }
    },
    {
      "id": "s0429",
      "type": "paragraph",
      "chinese": "項王歸漢王父母妻子，軍中皆呼萬歲，乃歸而別去。",
      "literal": "King Xiang returned the King of Han's father, mother, wife, and children; the army all shouted 'Long live!'; they then returned and parted ways.",
      "idiomatic": "King Xiang returned the King of Han's father, mother, wife, and children. The army all shouted 'Long live!' They then returned and parted ways.",
      "context": {
        "previous": "項羽恐，乃與漢王約，中分天下，割鴻溝而西者為漢，鴻溝而東者為楚。"
      }
    },
    {
      "id": "s0430",
      "type": "paragraph",
      "chinese": "項羽解而東歸。",
      "literal": "Xiang Yu was released and returned eastward.",
      "idiomatic": "Xiang Yu was set free and headed back east.",
      "context": {
        "next": "漢王欲引而西歸，用留侯、陳平計，乃進兵追項羽，至陽夏南止軍，與齊王信、建成侯彭越期會而擊楚軍。"
      }
    },
    {
      "id": "s0431",
      "type": "paragraph",
      "chinese": "漢王欲引而西歸，用留侯、陳平計，乃進兵追項羽，至陽夏南止軍，與齊王信、建成侯彭越期會而擊楚軍。",
      "literal": "The King of Han wished to lead his troops and return westward, but using the plans of the Marquis of Liu and Chen Ping, he then advanced his troops to pursue Xiang Yu, reached south of Yangxia and stopped his army, making an appointment with King Xin of Qi and Marquis of Jiancheng Peng Yue to meet and strike the Chu army.",
      "idiomatic": "The King of Han wished to lead his troops and return westward, but using the plans of the Marquis of Liu and Chen Ping, he then advanced his troops to pursue Xiang Yu. He reached south of Yangxia and stopped his army, making an appointment with King Xin of Qi and Marquis of Jiancheng Peng Yue to meet and strike the Chu army.",
      "context": {
        "previous": "項羽解而東歸。",
        "next": "至固陵，不會。"
      }
    },
    {
      "id": "s0432",
      "type": "paragraph",
      "chinese": "至固陵，不會。",
      "literal": "Reaching Guling, they did not meet.",
      "idiomatic": "When they reached Guling, the meeting never happened.",
      "context": {
        "previous": "漢王欲引而西歸，用留侯、陳平計，乃進兵追項羽，至陽夏南止軍，與齊王信、建成侯彭越期會而擊楚軍。",
        "next": "楚擊漢軍，大破之。"
      }
    },
    {
      "id": "s0433",
      "type": "paragraph",
      "chinese": "楚擊漢軍，大破之。",
      "literal": "Chu struck the Han army and greatly broke them.",
      "idiomatic": "Chu attacked the Han army and routed it completely.",
      "context": {
        "previous": "至固陵，不會。",
        "next": "漢王復入壁，深塹而守之。"
      }
    },
    {
      "id": "s0434",
      "type": "paragraph",
      "chinese": "漢王復入壁，深塹而守之。",
      "literal": "The King of Han again entered his ramparts, dug deep trenches, and defended.",
      "idiomatic": "The King of Han retreated behind his fortifications, dug deep trenches, and held his position.",
      "context": {
        "previous": "楚擊漢軍，大破之。",
        "next": "用張良計，於是韓信、彭越皆往。"
      }
    },
    {
      "id": "s0435",
      "type": "paragraph",
      "chinese": "用張良計，於是韓信、彭越皆往。",
      "literal": "Using Zhang Liang's plan, thereupon Han Xin and Peng Yue both went.",
      "idiomatic": "Following Zhang Liang's strategy, Han Xin and Peng Yue both arrived.",
      "context": {
        "previous": "漢王復入壁，深塹而守之。",
        "next": "及劉賈入楚地，圍壽春，漢王敗碧陵，乃使使者召大司馬周殷舉九江兵而迎（之）武王，行屠城父，隨（何）劉賈、齊梁諸侯皆大會垓下。"
      }
    },
    {
      "id": "s0436",
      "type": "paragraph",
      "chinese": "及劉賈入楚地，圍壽春，漢王敗碧陵，乃使使者召大司馬周殷舉九江兵而迎（之）武王，行屠城父，隨（何）劉賈、齊梁諸侯皆大會垓下。",
      "literal": "When Liu Jia entered Chu territory and besieged Shouchun, the King of Han was defeated at Biling, so he sent envoys to summon Grand Marshal Zhou Yin to raise the troops of Jiujiang and welcome King Wu, marched and massacred Chengfu, following Liu Jia; the feudal lords of Qi and Liang all assembled in great numbers at Gaixia.",
      "idiomatic": "When Liu Jia entered Chu territory and besieged Shouchun, the King of Han was defeated at Biling. So he sent envoys to summon Grand Marshal Zhou Yin to raise the troops of Jiujiang and welcome King Wu. He marched and massacred Chengfu, following Liu Jia. The feudal lords of Qi and Liang all assembled in great numbers at Gaixia.",
      "context": {
        "previous": "用張良計，於是韓信、彭越皆往。",
        "next": "立武王布為淮南王。"
      }
    },
    {
      "id": "s0437",
      "type": "paragraph",
      "chinese": "立武王布為淮南王。",
      "literal": "He installed King Wu Bu as King of Huainan.",
      "idiomatic": "He installed King Wu Bu as King of Huainan.",
      "context": {
        "previous": "及劉賈入楚地，圍壽春，漢王敗碧陵，乃使使者召大司馬周殷舉九江兵而迎（之）武王，行屠城父，隨（何）劉賈、齊梁諸侯皆大會垓下。"
      }
    },
    {
      "id": "s0438",
      "type": "paragraph",
      "chinese": "五年，高祖與諸侯兵共擊楚軍，與項羽決勝垓下。",
      "literal": "In the fifth year, Gao Zu together with the feudal lords' troops jointly struck the Chu army and decided victory with Xiang Yu at Gaixia.",
      "idiomatic": "In the fifth year, Gao Zu joined forces with the feudal lords to attack the Chu army and settle matters with Xiang Yu at Gaixia.",
      "context": {
        "next": "淮陰侯將三十萬自當之，孔將軍居左，費將軍居右，皇帝在後，絳侯、柴將軍在皇帝後。"
      }
    },
    {
      "id": "s0439",
      "type": "paragraph",
      "chinese": "淮陰侯將三十萬自當之，孔將軍居左，費將軍居右，皇帝在後，絳侯、柴將軍在皇帝後。",
      "literal": "The Marquis of Huaiyin led three hundred thousand and directly opposed them; General Kong was on the left, General Fei on the right, the Emperor behind, and Marquis of Jiang and General Chai behind the Emperor.",
      "idiomatic": "The Marquis of Huaiyin led three hundred thousand and directly opposed them. General Kong was on the left, General Fei on the right, the Emperor behind, and Marquis of Jiang and General Chai behind the Emperor.",
      "context": {
        "previous": "五年，高祖與諸侯兵共擊楚軍，與項羽決勝垓下。",
        "next": "項羽之卒可十萬。"
      }
    },
    {
      "id": "s0440",
      "type": "paragraph",
      "chinese": "項羽之卒可十萬。",
      "literal": "Xiang Yu's troops numbered about a hundred thousand.",
      "idiomatic": "Xiang Yu had around 100,000 troops.",
      "context": {
        "previous": "淮陰侯將三十萬自當之，孔將軍居左，費將軍居右，皇帝在後，絳侯、柴將軍在皇帝後。",
        "next": "淮陰先合，不利，卻。"
      }
    },
    {
      "id": "s0441",
      "type": "paragraph",
      "chinese": "淮陰先合，不利，卻。",
      "literal": "Huaiyin first engaged, went unfavorably, and retreated.",
      "idiomatic": "Huaiyin engaged first but fared poorly and withdrew.",
      "context": {
        "previous": "項羽之卒可十萬。",
        "next": "孔將軍、費將軍縱，楚兵不利，淮陰侯復乘之，大敗垓下。"
      }
    },
    {
      "id": "s0442",
      "type": "paragraph",
      "chinese": "孔將軍、費將軍縱，楚兵不利，淮陰侯復乘之，大敗垓下。",
      "literal": "General Kong and General Fei were released; the Chu troops went unfavorably, and the Marquis of Huaiyin again rode upon them, greatly defeating them at Gaixia.",
      "idiomatic": "General Kong and General Fei were released. The Chu troops went unfavorably, and the Marquis of Huaiyin again rode upon them, greatly defeating them at Gaixia.",
      "context": {
        "previous": "淮陰先合，不利，卻。",
        "next": "項羽卒聞漢軍之楚歌，以為漢盡得楚地，項羽乃敗而走，是以兵大敗。"
      }
    },
    {
      "id": "s0443",
      "type": "paragraph",
      "chinese": "項羽卒聞漢軍之楚歌，以為漢盡得楚地，項羽乃敗而走，是以兵大敗。",
      "literal": "Xiang Yu's troops heard the Han army's Chu songs and thought Han had completely obtained the lands of Chu; Xiang Yu was then defeated and fled; because of this the troops were greatly defeated.",
      "idiomatic": "Xiang Yu's troops heard the Han army's Chu songs and thought Han had completely obtained the lands of Chu. Xiang Yu was then defeated and fled. Because of this the troops were greatly defeated.",
      "context": {
        "previous": "孔將軍、費將軍縱，楚兵不利，淮陰侯復乘之，大敗垓下。",
        "next": "使騎將灌嬰追殺項羽東城，斬首八萬，遂略定楚地。"
      }
    },
    {
      "id": "s0444",
      "type": "paragraph",
      "chinese": "使騎將灌嬰追殺項羽東城，斬首八萬，遂略定楚地。",
      "literal": "He sent cavalry general Guan Ying to pursue and kill Xiang Yu at Dongcheng, behead eighty thousand, and then take and settle the lands of Chu.",
      "idiomatic": "He sent cavalry general Guan Ying to pursue and kill Xiang Yu at Dongcheng, taking 80,000 heads, then conquered and pacified Chu territory.",
      "context": {
        "previous": "項羽卒聞漢軍之楚歌，以為漢盡得楚地，項羽乃敗而走，是以兵大敗。",
        "next": "魯為楚堅守不下。"
      }
    },
    {
      "id": "s0445",
      "type": "paragraph",
      "chinese": "魯為楚堅守不下。",
      "literal": "Lu firmly defended for Chu and would not surrender.",
      "idiomatic": "Lu held out staunchly for Chu and refused to surrender.",
      "context": {
        "previous": "使騎將灌嬰追殺項羽東城，斬首八萬，遂略定楚地。",
        "next": "漢王引諸侯兵北，示魯父老項羽頭，魯乃降。"
      }
    },
    {
      "id": "s0446",
      "type": "paragraph",
      "chinese": "漢王引諸侯兵北，示魯父老項羽頭，魯乃降。",
      "literal": "The King of Han led the feudal lords' troops north and showed Xiang Yu's head to the fathers and elders of Lu; Lu then surrendered.",
      "idiomatic": "The King of Han led the feudal lords' troops north and showed Xiang Yu's head to the fathers and elders of Lu. Lu then surrendered.",
      "context": {
        "previous": "魯為楚堅守不下。",
        "next": "遂以魯公號葬項羽穀城。"
      }
    },
    {
      "id": "s0447",
      "type": "paragraph",
      "chinese": "遂以魯公號葬項羽穀城。",
      "literal": "They then buried Xiang Yu at Gucheng with the rites of Duke of Lu.",
      "idiomatic": "They buried Xiang Yu at Gucheng with the honors due a Duke of Lu.",
      "context": {
        "previous": "漢王引諸侯兵北，示魯父老項羽頭，魯乃降。",
        "next": "還至定陶，馳入齊王壁，奪其軍。"
      }
    },
    {
      "id": "s0448",
      "type": "paragraph",
      "chinese": "還至定陶，馳入齊王壁，奪其軍。",
      "literal": "Returning to reach Dingtao, he galloped into the King of Qi's encampment and seized his army.",
      "idiomatic": "Upon returning to Dingtao, he charged into the King of Qi's camp and took command of his army.",
      "context": {
        "previous": "遂以魯公號葬項羽穀城。"
      }
    },
    {
      "id": "s0449",
      "type": "paragraph",
      "chinese": "正月，諸侯及將相相與共請尊漢王為皇帝。",
      "literal": "In the first month, the feudal lords and generals and ministers together jointly requested to honor the King of Han as Emperor.",
      "idiomatic": "In the first month, the feudal lords and high officials jointly petitioned to honor the King of Han as Emperor.",
      "context": {
        "next": "漢王曰：「吾聞帝賢者有也，空言虛語，非所守也，吾不敢當帝位。」"
      }
    },
    {
      "id": "s0450",
      "type": "paragraph",
      "chinese": "漢王曰：「吾聞帝賢者有也，空言虛語，非所守也，吾不敢當帝位。」",
      "literal": "The King of Han said: \"I have heard that the title of Emperor is something the worthy possess; empty words and vain speech are not what I uphold—I dare not accept the position of Emperor.\"",
      "idiomatic": "The King of Han said: 'I have heard that the title of Emperor is something the worthy possess. Empty words and vain speech are not what I uphold—I dare not accept the position of Emperor.''",
      "context": {
        "previous": "正月，諸侯及將相相與共請尊漢王為皇帝。",
        "next": "群臣皆曰：「大王起微細，誅暴逆，平定四海，有功者輒裂地而封為王侯。"
      }
    },
    {
      "id": "s0451",
      "type": "paragraph",
      "chinese": "群臣皆曰：「大王起微細，誅暴逆，平定四海，有功者輒裂地而封為王侯。",
      "literal": "The assembled ministers all said: \"The great king arose from humble and minor beginnings, executed the violent and rebellious, pacified the four seas; those with achievements were immediately given divided territory and enfeoffed as kings and marquises.",
      "idiomatic": "The assembled ministers all said: 'The great king arose from humble and minor beginnings, executed the violent and rebellious, pacified the four seas. Those with achievements were immediately given divided territory and enfeoffed as kings and marquises.'",
      "context": {
        "previous": "漢王曰：「吾聞帝賢者有也，空言虛語，非所守也，吾不敢當帝位。」",
        "next": "大王不尊號，皆疑不信。"
      }
    },
    {
      "id": "s0452",
      "type": "paragraph",
      "chinese": "大王不尊號，皆疑不信。",
      "literal": "If great king not take honored title, all doubt not believe.",
      "idiomatic": "If Your Majesty does not accept the imperial title, everyone will remain suspicious and distrustful.",
      "context": {
        "previous": "群臣皆曰：「大王起微細，誅暴逆，平定四海，有功者輒裂地而封為王侯。",
        "next": "臣等以死守之。」"
      }
    },
    {
      "id": "s0453",
      "type": "paragraph",
      "chinese": "臣等以死守之。」",
      "literal": "We your ministers will defend this to the death.\"",
      "idiomatic": "We your ministers will defend this to the death.''",
      "context": {
        "previous": "大王不尊號，皆疑不信。",
        "next": "漢王三讓，不得已，曰：「諸君必以為便，便國家。」"
      }
    },
    {
      "id": "s0454",
      "type": "paragraph",
      "chinese": "漢王三讓，不得已，曰：「諸君必以為便，便國家。」",
      "literal": "The King of Han declined three times; unable to refuse, he said: \"If you lords must consider it convenient and beneficial to the state.\"",
      "idiomatic": "The King of Han declined three times. Unable to refuse, he said: 'If you lords must consider it convenient and beneficial to the state.''",
      "context": {
        "previous": "臣等以死守之。」",
        "next": "甲午，乃即皇帝位汜水之陽。"
      }
    },
    {
      "id": "s0455",
      "type": "paragraph",
      "chinese": "甲午，乃即皇帝位汜水之陽。",
      "literal": "On the jiawu day, he then assumed the position of Emperor north of the Fan River.",
      "idiomatic": "On the jiawu day, he ascended the imperial throne north of the Fan River.",
      "context": {
        "previous": "漢王三讓，不得已，曰：「諸君必以為便，便國家。」"
      }
    },
    {
      "id": "s0456",
      "type": "paragraph",
      "chinese": "皇帝曰義帝無後。",
      "literal": "The Emperor said the Righteous Emperor had no descendants.",
      "idiomatic": "The Emperor declared that the Righteous Emperor had no heirs.",
      "context": {
        "next": "齊王韓信習楚風俗，徙為楚王，都下邳。"
      }
    },
    {
      "id": "s0457",
      "type": "paragraph",
      "chinese": "齊王韓信習楚風俗，徙為楚王，都下邳。",
      "literal": "King Han Xin of Qi was familiar with Chu customs and was moved to be King of Chu, with his capital at Xiapei.",
      "idiomatic": "Since King Han Xin of Qi was familiar with Chu customs, he was transferred to become King of Chu with his capital at Xiapei.",
      "context": {
        "previous": "皇帝曰義帝無後。",
        "next": "立建成侯彭越為梁王，都定陶。"
      }
    },
    {
      "id": "s0458",
      "type": "paragraph",
      "chinese": "立建成侯彭越為梁王，都定陶。",
      "literal": "He installed Marquis of Jiancheng Peng Yue as King of Liang, with his capital at Dingtao.",
      "idiomatic": "He installed Marquis of Jiancheng Peng Yue as King of Liang with his capital at Dingtao.",
      "context": {
        "previous": "齊王韓信習楚風俗，徙為楚王，都下邳。",
        "next": "故韓王信為韓王，都陽翟。"
      }
    },
    {
      "id": "s0459",
      "type": "paragraph",
      "chinese": "故韓王信為韓王，都陽翟。",
      "literal": "The former King Xin of Han remained King of Han, with his capital at Yangzhai.",
      "idiomatic": "The former King Xin of Han remained as King of Han with his capital at Yangzhai.",
      "context": {
        "previous": "立建成侯彭越為梁王，都定陶。",
        "next": "徙衡山王吳芮為長沙王，都臨湘。"
      }
    },
    {
      "id": "s0460",
      "type": "paragraph",
      "chinese": "徙衡山王吳芮為長沙王，都臨湘。",
      "literal": "He moved King Wu Rui of Hengshan to be King of Changsha, with his capital at Linxiang.",
      "idiomatic": "He transferred King Wu Rui of Hengshan to become King of Changsha with his capital at Linxiang.",
      "context": {
        "previous": "故韓王信為韓王，都陽翟。",
        "next": "番君之將梅鋗有功，從入武關，故德番君。"
      }
    },
    {
      "id": "s0461",
      "type": "paragraph",
      "chinese": "番君之將梅鋗有功，從入武關，故德番君。",
      "literal": "Lord Fan's general Mei Xuan had achievements and followed them entering Wuguan, therefore he favored Lord Fan.",
      "idiomatic": "Lord Fan's general Mei Xuan had achievements and followed them entering Wuguan. Therefore he favored Lord Fan.",
      "context": {
        "previous": "徙衡山王吳芮為長沙王，都臨湘。",
        "next": "淮南王布、燕王臧荼、趙王敖皆如故。"
      }
    },
    {
      "id": "s0462",
      "type": "paragraph",
      "chinese": "淮南王布、燕王臧荼、趙王敖皆如故。",
      "literal": "King Bu of Huainan, King Zang Tu of Yan, and King Ao of Zhao all remained as before.",
      "idiomatic": "King Bu of Huainan, King Zang Tu of Yan, and King Ao of Zhao all kept their positions unchanged.",
      "context": {
        "previous": "番君之將梅鋗有功，從入武關，故德番君。"
      }
    },
    {
      "id": "s0463",
      "type": "paragraph",
      "chinese": "天下大定。",
      "literal": "All under Heaven was greatly settled.",
      "idiomatic": "The empire was now firmly established.",
      "context": {
        "next": "高祖都雒陽，諸侯皆臣屬。"
      }
    },
    {
      "id": "s0464",
      "type": "paragraph",
      "chinese": "高祖都雒陽，諸侯皆臣屬。",
      "literal": "Gao Zu made capital Luoyang, feudal lords all became ministers subordinates.",
      "idiomatic": "Gao Zu made capital Luoyang. Feudal lords all became ministers and subordinates.",
      "context": {
        "previous": "天下大定。",
        "next": "故臨江王驩為項羽叛漢，令盧綰、劉賈圍之，不下。"
      }
    },
    {
      "id": "s0465",
      "type": "paragraph",
      "chinese": "故臨江王驩為項羽叛漢，令盧綰、劉賈圍之，不下。",
      "literal": "The former King Huan of Linjiang rebelled against Han for Xiang Yu; he ordered Lu Wan and Liu Jia to besiege him, but he did not surrender.",
      "idiomatic": "The former King Huan of Linjiang rebelled against Han for Xiang Yu. He ordered Lu Wan and Liu Jia to besiege him, but he did not surrender.",
      "context": {
        "previous": "高祖都雒陽，諸侯皆臣屬。",
        "next": "數月而降，殺之雒陽。"
      }
    },
    {
      "id": "s0466",
      "type": "paragraph",
      "chinese": "數月而降，殺之雒陽。",
      "literal": "After several months he surrendered and they killed him at Luoyang.",
      "idiomatic": "After several months he surrendered, and they executed him at Luoyang.",
      "context": {
        "previous": "故臨江王驩為項羽叛漢，令盧綰、劉賈圍之，不下。"
      }
    },
    {
      "id": "s0467",
      "type": "paragraph",
      "chinese": "五月，兵皆罷歸家。",
      "literal": "In the fifth month, all troops were dismissed to return home.",
      "idiomatic": "In the fifth month, all troops were disbanded and sent home.",
      "context": {
        "next": "諸侯子在關中者復之十二歲，其歸者復之六歲，食之一歲。"
      }
    },
    {
      "id": "s0468",
      "type": "paragraph",
      "chinese": "諸侯子在關中者復之十二歲，其歸者復之六歲，食之一歲。",
      "literal": "Sons of feudal lords who were in Guanzhong were exempted from taxes for twelve years; those who returned were exempted for six years and provided food for one year.",
      "idiomatic": "Sons of feudal lords who were in Guanzhong were exempted from taxes for twelve years. Those who returned were exempted for six years and provided food for one year.",
      "context": {
        "previous": "五月，兵皆罷歸家。"
      }
    },
    {
      "id": "s0469",
      "type": "paragraph",
      "chinese": "高祖置酒雒陽南宮。",
      "literal": "Gao Zu held a banquet at the Southern Palace of Luoyang.",
      "idiomatic": "Gao Zu hosted a banquet at the Southern Palace in Luoyang.",
      "context": {
        "next": "高祖曰：「列侯諸將無敢隱朕，皆言其情。"
      }
    },
    {
      "id": "s0470",
      "type": "paragraph",
      "chinese": "高祖曰：「列侯諸將無敢隱朕，皆言其情。",
      "literal": "Gao Zu said: \"Ranked marquises and various generals, do not hide from me; all speak your true feelings.",
      "idiomatic": "Gao Zu said: 'Ranked marquises and various generals, do not hide from me. All speak your true feelings.'",
      "context": {
        "previous": "高祖置酒雒陽南宮。",
        "next": "吾所以有天下者何？"
      }
    },
    {
      "id": "s0471",
      "type": "paragraph",
      "chinese": "吾所以有天下者何？",
      "literal": "Why is it that I possess all under Heaven?",
      "idiomatic": "How did I come to rule the empire?",
      "context": {
        "previous": "高祖曰：「列侯諸將無敢隱朕，皆言其情。",
        "next": "項氏之所以失天下者何？」"
      }
    },
    {
      "id": "s0472",
      "type": "paragraph",
      "chinese": "項氏之所以失天下者何？」",
      "literal": "Why is it that the Xiang clan lost all under Heaven?\"",
      "idiomatic": "Why is it that the Xiang clan lost all under Heaven?''",
      "context": {
        "previous": "吾所以有天下者何？",
        "next": "高起、王陵對曰：「陛下慢而侮人，項羽仁而愛人。"
      }
    },
    {
      "id": "s0473",
      "type": "paragraph",
      "chinese": "高起、王陵對曰：「陛下慢而侮人，項羽仁而愛人。",
      "literal": "Gao Qi and Wang Ling replied: \"Your Majesty is informal and makes light of people; Xiang Yu was benevolent and loved people.",
      "idiomatic": "Gao Qi and Wang Ling replied: 'Your Majesty is informal and makes light of people. Xiang Yu was benevolent and loved people.'",
      "context": {
        "previous": "項氏之所以失天下者何？」",
        "next": "然陛下使人攻城略地，所降下者因以予之，與天下同利也。"
      }
    },
    {
      "id": "s0474",
      "type": "paragraph",
      "chinese": "然陛下使人攻城略地，所降下者因以予之，與天下同利也。",
      "literal": "Yet Your Majesty has men attack cities and take territory; those who are subdued and surrender are consequently given it—you share benefits with all under Heaven.",
      "idiomatic": "Yet Your Majesty has men attack cities and take territory. Those who are subdued and surrender are consequently given it—you share benefits with all under Heaven.'",
      "context": {
        "previous": "高起、王陵對曰：「陛下慢而侮人，項羽仁而愛人。",
        "next": "項羽妒賢嫉能，有功者害之，賢者疑之，戰勝而不予人功，得地而不予人利，此所以失天下也。」"
      }
    },
    {
      "id": "s0475",
      "type": "paragraph",
      "chinese": "項羽妒賢嫉能，有功者害之，賢者疑之，戰勝而不予人功，得地而不予人利，此所以失天下也。」",
      "literal": "Xiang Yu was jealous of the worthy and envious of the able; those with achievements he harmed, the worthy he suspected; when battles were won he would not give others credit, when territory was obtained he would not give others benefits—this is why he lost all under Heaven.\"",
      "idiomatic": "Xiang Yu was jealous of the worthy and envious of the able. Those with achievements he harmed, the worthy he suspected. When battles were won he would not give others credit, when territory was obtained he would not give others benefits—this is why he lost all under Heaven.''",
      "context": {
        "previous": "然陛下使人攻城略地，所降下者因以予之，與天下同利也。",
        "next": "高祖曰：「公知其一，未知其二。"
      }
    },
    {
      "id": "s0476",
      "type": "paragraph",
      "chinese": "高祖曰：「公知其一，未知其二。",
      "literal": "Gao Zu said: \"You know one aspect but do not know the second.",
      "idiomatic": "Gao Zu said: 'You know one aspect but do not know the second.'",
      "context": {
        "previous": "項羽妒賢嫉能，有功者害之，賢者疑之，戰勝而不予人功，得地而不予人利，此所以失天下也。」",
        "next": "夫運籌策帷帳之中，決勝於千里之外，吾不如子房。"
      }
    },
    {
      "id": "s0477",
      "type": "paragraph",
      "chinese": "夫運籌策帷帳之中，決勝於千里之外，吾不如子房。",
      "literal": "In devising strategies within the command tent and deciding victory a thousand li away, I am not equal to Zifang.",
      "idiomatic": "In devising strategies within the command tent and deciding victory a thousand li away, I am not equal to Zifang.'",
      "context": {
        "previous": "高祖曰：「公知其一，未知其二。",
        "next": "鎮國家，撫百姓，給餽馕，不絕糧道，吾不如蕭何。"
      }
    },
    {
      "id": "s0478",
      "type": "paragraph",
      "chinese": "鎮國家，撫百姓，給餽馕，不絕糧道，吾不如蕭何。",
      "literal": "In stabilizing the state, comforting the hundred clans, providing provisions and grain, and not severing the supply routes, I am not equal to Xiao He.",
      "idiomatic": "In stabilizing the state, comforting the hundred clans, providing provisions and grain, and not severing the supply routes, I am not equal to Xiao He.'",
      "context": {
        "previous": "夫運籌策帷帳之中，決勝於千里之外，吾不如子房。",
        "next": "連百萬之軍，戰必勝，攻必取，吾不如韓信。"
      }
    },
    {
      "id": "s0479",
      "type": "paragraph",
      "chinese": "連百萬之軍，戰必勝，攻必取，吾不如韓信。",
      "literal": "In commanding armies of a million, certainly winning battles and certainly taking what is attacked, I am not equal to Han Xin.",
      "idiomatic": "In commanding armies of a million, certainly winning battles and certainly taking what is attacked, I am not equal to Han Xin.'",
      "context": {
        "previous": "鎮國家，撫百姓，給餽馕，不絕糧道，吾不如蕭何。",
        "next": "此三者，皆人傑也，吾能用之，此吾所以取天下也。"
      }
    },
    {
      "id": "s0480",
      "type": "paragraph",
      "chinese": "此三者，皆人傑也，吾能用之，此吾所以取天下也。",
      "literal": "These three are all heroes among men, and I was able to employ them—this is why I took all under Heaven.",
      "idiomatic": "These three are all heroes among men, and I was able to employ them—this is why I took all under Heaven.'",
      "context": {
        "previous": "連百萬之軍，戰必勝，攻必取，吾不如韓信。",
        "next": "項羽有一范增而不能用，此其所以為我擒也。」"
      }
    },
    {
      "id": "s0481",
      "type": "paragraph",
      "chinese": "項羽有一范增而不能用，此其所以為我擒也。」",
      "literal": "Xiang Yu had one Fan Zeng but could not employ him—this is why he became my captive.\"",
      "idiomatic": "Xiang Yu had one Fan Zeng but could not employ him—this is why he became my captive.''",
      "context": {
        "previous": "此三者，皆人傑也，吾能用之，此吾所以取天下也。"
      }
    },
    {
      "id": "s0483",
      "type": "paragraph",
      "chinese": "高祖欲長都雒陽，齊人劉敬說，乃留侯勸上入都關中，高祖是日駕，入都關中。",
      "literal": "Gao Zu wished to make Luoyang his permanent capital; the Qi man Liu Jing persuaded him, and the Marquis of Liu urged the superior to make his capital within the passes; Gao Zu that very day took his carriage and went in to make his capital within the passes.",
      "idiomatic": "Gao Zu wished to make Luoyang his permanent capital. The Qi man Liu Jing persuaded him, and the Marquis of Liu urged the superior to make his capital within the passes. Gao Zu that very day took his carriage and went in to make his capital within the passes.",
      "context": {
        "next": "六月，大赦天下。"
      }
    },
    {
      "id": "s0484",
      "type": "paragraph",
      "chinese": "六月，大赦天下。",
      "literal": "In the sixth month, they granted a great amnesty to all under Heaven.",
      "idiomatic": "In the sixth month, a general amnesty was declared throughout the empire.",
      "context": {
        "previous": "高祖欲長都雒陽，齊人劉敬說，乃留侯勸上入都關中，高祖是日駕，入都關中。"
      }
    },
    {
      "id": "s0485",
      "type": "paragraph",
      "chinese": "十月，燕王臧荼反，攻下代地。",
      "literal": "In the tenth month, King Zang Tu of Yan rebelled and attacked and took the land of Dai.",
      "idiomatic": "In the tenth month, King Zang Tu of Yan rebelled and conquered the territory of Dai.",
      "context": {
        "next": "高祖自將擊之，得燕王臧荼。"
      }
    },
    {
      "id": "s0486",
      "type": "paragraph",
      "chinese": "高祖自將擊之，得燕王臧荼。",
      "literal": "Gao Zu personally commanded to strike him and captured King Zang Tu of Yan.",
      "idiomatic": "Gao Zu personally led the attack and captured King Zang Tu of Yan.",
      "context": {
        "previous": "十月，燕王臧荼反，攻下代地。",
        "next": "即立太尉盧綰為燕王。"
      }
    },
    {
      "id": "s0487",
      "type": "paragraph",
      "chinese": "即立太尉盧綰為燕王。",
      "literal": "He immediately installed Grand Commandant Lu Wan as King of Yan.",
      "idiomatic": "He immediately installed Grand Commandant Lu Wan as King of Yan.",
      "context": {
        "previous": "高祖自將擊之，得燕王臧荼。",
        "next": "使丞相噲將兵攻代。"
      }
    },
    {
      "id": "s0488",
      "type": "paragraph",
      "chinese": "使丞相噲將兵攻代。",
      "literal": "He sent Prime Minister Kuai to lead troops to attack Dai.",
      "idiomatic": "He sent Prime Minister Kuai to lead an army against Dai.",
      "context": {
        "previous": "即立太尉盧綰為燕王。"
      }
    },
    {
      "id": "s0489",
      "type": "paragraph",
      "chinese": "其秋，利幾反，高祖自將兵擊之，利幾走。",
      "literal": "That autumn, Li Ji rebelled; Gao Zu personally led troops to strike him; Li Ji fled.",
      "idiomatic": "That autumn, Li Ji rebelled. Gao Zu personally led troops to strike him. Li Ji fled.",
      "context": {
        "next": "利幾者，項氏之將。"
      }
    },
    {
      "id": "s0490",
      "type": "paragraph",
      "chinese": "利幾者，項氏之將。",
      "literal": "Li Ji was a general of the Xiang clan.",
      "idiomatic": "Li Ji was one of Xiang Yu's generals.",
      "context": {
        "previous": "其秋，利幾反，高祖自將兵擊之，利幾走。",
        "next": "項氏敗，利幾為陳公，不隨項羽，亡降高祖，高祖侯之潁川。"
      }
    },
    {
      "id": "s0491",
      "type": "paragraph",
      "chinese": "項氏敗，利幾為陳公，不隨項羽，亡降高祖，高祖侯之潁川。",
      "literal": "When the Xiang clan was defeated, Li Ji was Duke of Chen and did not follow Xiang Yu; he fled and surrendered to Gao Zu, and Gao Zu made him a marquis at Yingchuan.",
      "idiomatic": "When the Xiang clan was defeated, Li Ji was Duke of Chen and did not follow Xiang Yu. He fled and surrendered to Gao Zu, and Gao Zu made him a marquis at Yingchuan.",
      "context": {
        "previous": "利幾者，項氏之將。",
        "next": "高祖至雒陽，舉通侯籍召之，而利幾恐，故反。"
      }
    },
    {
      "id": "s0492",
      "type": "paragraph",
      "chinese": "高祖至雒陽，舉通侯籍召之，而利幾恐，故反。",
      "literal": "When Gao Zu reached Luoyang, he raised the register of ranked marquises and summoned him; Li Ji was afraid and therefore rebelled.",
      "idiomatic": "When Gao Zu reached Luoyang, he raised the register of ranked marquises and summoned him. Li Ji was afraid and therefore rebelled.",
      "context": {
        "previous": "項氏敗，利幾為陳公，不隨項羽，亡降高祖，高祖侯之潁川。"
      }
    },
    {
      "id": "s0493",
      "type": "paragraph",
      "chinese": "六年，高祖五日一朝太公，如家人父子禮。",
      "literal": "In the sixth year, Gao Zu every five days would have an audience with the Grand Duke, following the rites of father and son in an ordinary family.",
      "idiomatic": "In the sixth year, Gao Zu would visit his father every five days, treating him with the simple respect of father and son in a common family.",
      "context": {
        "next": "太公家令說太公曰：「天無二日，土無二王。"
      }
    },
    {
      "id": "s0494",
      "type": "paragraph",
      "chinese": "太公家令說太公曰：「天無二日，土無二王。",
      "literal": "The Grand Duke's steward persuaded the Grand Duke, saying: \"Heaven has no two suns; the land has no two kings.",
      "idiomatic": "The Grand Duke's steward persuaded the Grand Duke, saying: 'Heaven has no two suns. The land has no two kings.'",
      "context": {
        "previous": "六年，高祖五日一朝太公，如家人父子禮。",
        "next": "今高祖雖子，人主也；"
      }
    },
    {
      "id": "s0495",
      "type": "paragraph",
      "chinese": "今高祖雖子，人主也；",
      "literal": "Now though Gao Zu is your son, he is the lord of men;",
      "idiomatic": "Now though Gao Zu is your son, he is the lord of men;'",
      "context": {
        "previous": "太公家令說太公曰：「天無二日，土無二王。",
        "next": "太公雖父，人臣也。"
      }
    },
    {
      "id": "s0496",
      "type": "paragraph",
      "chinese": "太公雖父，人臣也。",
      "literal": "though the Grand Duke is his father, you are a minister of men.",
      "idiomatic": "though the Grand Duke is his father, you are a minister of men.'",
      "context": {
        "previous": "今高祖雖子，人主也；",
        "next": "柰何令人主拜人臣！"
      }
    },
    {
      "id": "s0497",
      "type": "paragraph",
      "chinese": "柰何令人主拜人臣！",
      "literal": "How can you have the lord of men bow to a minister of men!",
      "idiomatic": "How can you have the lord of men bow to a minister of men!''",
      "context": {
        "previous": "太公雖父，人臣也。",
        "next": "如此，則威重不行。」"
      }
    },
    {
      "id": "s0498",
      "type": "paragraph",
      "chinese": "如此，則威重不行。」",
      "literal": "If this continues, authority and dignity will not function.\"",
      "idiomatic": "If this continues, authority and dignity will not function.''",
      "context": {
        "previous": "柰何令人主拜人臣！",
        "next": "後高祖朝，太公擁篲，迎門卻行。"
      }
    },
    {
      "id": "s0499",
      "type": "paragraph",
      "chinese": "後高祖朝，太公擁篲，迎門卻行。",
      "literal": "Later when Gao Zu came to audience, the Grand Duke held a broom, welcomed him at the gate, and walked backward.",
      "idiomatic": "Later when Gao Zu came for an audience, his father greeted him at the gate holding a broom and backed away respectfully.",
      "context": {
        "previous": "如此，則威重不行。」",
        "next": "高祖大驚，下扶太公。"
      }
    },
    {
      "id": "s0500",
      "type": "paragraph",
      "chinese": "高祖大驚，下扶太公。",
      "literal": "Gao Zu was greatly shocked and got down to support the Grand Duke.",
      "idiomatic": "Gao Zu was horrified and dismounted to help his father up.",
      "context": {
        "previous": "後高祖朝，太公擁篲，迎門卻行。",
        "next": "太公曰：「帝，人主也，柰何以我亂天下法！」"
      }
    },
    {
      "id": "s0501",
      "type": "paragraph",
      "chinese": "太公曰：「帝，人主也，柰何以我亂天下法！」",
      "literal": "The Grand Duke said: \"The Emperor is the lord of men—how can you use me to disorder the laws of all under Heaven!\"",
      "idiomatic": "The Grand Duke said: 'The Emperor is the lord of men—how can you use me to disorder the laws of all under Heaven!'",
      "context": {
        "previous": "高祖大驚，下扶太公。",
        "next": "於是高祖乃尊太公為太上皇。"
      }
    },
    {
      "id": "s0502",
      "type": "paragraph",
      "chinese": "於是高祖乃尊太公為太上皇。",
      "literal": "Thereupon Gao Zu then honored the Grand Duke as Grand Supreme Sovereign.",
      "idiomatic": "Thereupon Gao Zu honored his father as the Supreme Retired Emperor.",
      "context": {
        "previous": "太公曰：「帝，人主也，柰何以我亂天下法！」",
        "next": "心善家令言，賜金五百斤。"
      }
    },
    {
      "id": "s0503",
      "type": "paragraph",
      "chinese": "心善家令言，賜金五百斤。",
      "literal": "In heart approved steward words, bestowed five hundred jin gold.",
      "idiomatic": "In his heart he approved the steward's words and bestowed five hundred jin of gold.",
      "context": {
        "previous": "於是高祖乃尊太公為太上皇。"
      }
    },
    {
      "id": "s0504",
      "type": "paragraph",
      "chinese": "十二月，人有上變事告楚王信謀反，上問左右，左右爭欲擊之。",
      "literal": "In the twelfth month, someone submitted a report accusing the King of Chu Xin of plotting rebellion; the superior asked those around him, and those around him competed to attack him.",
      "idiomatic": "In the twelfth month, someone submitted a report accusing the King of Chu Xin of plotting rebellion. The superior asked those around him, and those around him competed to attack him.",
      "context": {
        "next": "用陳平計，乃偽遊雲夢，會諸侯於陳，楚王信迎，即因執之。"
      }
    },
    {
      "id": "s0505",
      "type": "paragraph",
      "chinese": "用陳平計，乃偽遊雲夢，會諸侯於陳，楚王信迎，即因執之。",
      "literal": "Using Chen Ping's plan, he then pretended to make a tour to Yunmeng and assembled the feudal lords at Chen; the King of Chu Xin came to welcome him and was consequently seized.",
      "idiomatic": "Using Chen Ping's plan, he then pretended to make a tour to Yunmeng and assembled the feudal lords at Chen. The King of Chu Xin came to welcome him and was consequently seized.",
      "context": {
        "previous": "十二月，人有上變事告楚王信謀反，上問左右，左右爭欲擊之。",
        "next": "是日，大赦天下。"
      }
    },
    {
      "id": "s0506",
      "type": "paragraph",
      "chinese": "是日，大赦天下。",
      "literal": "That day, they granted a great amnesty to all under Heaven.",
      "idiomatic": "That day, a general amnesty was declared throughout the empire.",
      "context": {
        "previous": "用陳平計，乃偽遊雲夢，會諸侯於陳，楚王信迎，即因執之。",
        "next": "田肯賀，因說高祖曰：「陛下得韓信，又治秦中。"
      }
    },
    {
      "id": "s0507",
      "type": "paragraph",
      "chinese": "田肯賀，因說高祖曰：「陛下得韓信，又治秦中。",
      "literal": "Tian Ken congratulated him and consequently persuaded Gao Zu, saying: \"Your Majesty has obtained Han Xin and also governs the Qin heartland.",
      "idiomatic": "Tian Ken congratulated him and consequently persuaded Gao Zu, saying: 'Your Majesty has obtained Han Xin and also governs the Qin heartland.'",
      "context": {
        "previous": "是日，大赦天下。",
        "next": "秦，形勝之國，帶河山之險，縣隔千里，持戟百萬，秦得百二焉。"
      }
    },
    {
      "id": "s0508",
      "type": "paragraph",
      "chinese": "秦，形勝之國，帶河山之險，縣隔千里，持戟百萬，秦得百二焉。",
      "literal": "Qin is a state of natural advantage, girded by the dangers of rivers and mountains, separated by a thousand li, wielding a million halberds—Qin obtains a hundred to two advantage.",
      "idiomatic": "Qin is a naturally fortified state, protected by perilous rivers and mountains, spanning a thousand li, with a million soldiers under arms—Qin enjoys a 50-to-1 advantage.",
      "context": {
        "previous": "田肯賀，因說高祖曰：「陛下得韓信，又治秦中。",
        "next": "地勢便利，其以下兵於諸侯，譬猶居高屋之上建瓴水也。"
      }
    },
    {
      "id": "s0509",
      "type": "paragraph",
      "chinese": "地勢便利，其以下兵於諸侯，譬猶居高屋之上建瓴水也。",
      "literal": "The terrain is convenient and advantageous; using it to send down troops against the feudal lords is like residing atop a tall building pouring water from a roof.\"",
      "idiomatic": "The terrain is convenient and advantageous; using it to send down troops against the feudal lords is like residing atop a tall building pouring water from a roof.''",
      "context": {
        "previous": "秦，形勝之國，帶河山之險，縣隔千里，持戟百萬，秦得百二焉。",
        "next": "夫齊，東有瑯邪、即墨之饒，南有泰山之固，西有濁河之限，北有勃海之利。"
      }
    },
    {
      "id": "s0510",
      "type": "paragraph",
      "chinese": "夫齊，東有瑯邪、即墨之饒，南有泰山之固，西有濁河之限，北有勃海之利。",
      "literal": "As for Qi, to the east it has the wealth of Langye and Jimo, to the south the stronghold of Mount Tai, to the west the barrier of the Turbid River, to the north the benefits of the Bohai.",
      "idiomatic": "As for Qi, to the east it has the riches of Langye and Jimo, to the south the impregnable Mount Tai, to the west the barrier of the muddy Yellow River, to the north the bounty of Bohai Bay.",
      "context": {
        "previous": "地勢便利，其以下兵於諸侯，譬猶居高屋之上建瓴水也。",
        "next": "地方二千里，持戟百萬，縣隔千里之外，齊得十二焉。"
      }
    },
    {
      "id": "s0511",
      "type": "paragraph",
      "chinese": "地方二千里，持戟百萬，縣隔千里之外，齊得十二焉。",
      "literal": "Its territory is two thousand li square, wielding a million halberds, separated a thousand li away—Qi obtains a ten to two advantage.",
      "idiomatic": "Its territory spans 2,000 square li, with a million soldiers, and lies a thousand li distant—Qi enjoys a 5-to-1 advantage.",
      "context": {
        "previous": "夫齊，東有瑯邪、即墨之饒，南有泰山之固，西有濁河之限，北有勃海之利。",
        "next": "故此東西秦也。"
      }
    },
    {
      "id": "s0512",
      "type": "paragraph",
      "chinese": "故此東西秦也。",
      "literal": "Therefore this is the eastern Qin.",
      "idiomatic": "Therefore Qi is another Qin in the east.",
      "context": {
        "previous": "地方二千里，持戟百萬，縣隔千里之外，齊得十二焉。",
        "next": "非親子弟，莫可使王齊矣。」"
      }
    },
    {
      "id": "s0513",
      "type": "paragraph",
      "chinese": "非親子弟，莫可使王齊矣。」",
      "literal": "Unless it is your own sons and younger brothers, none should be sent to be king of Qi.\"",
      "idiomatic": "Unless it is your own sons and younger brothers, none should be sent to be king of Qi.''",
      "context": {
        "previous": "故此東西秦也。",
        "next": "高祖曰：「善。」"
      }
    },
    {
      "id": "s0514",
      "type": "paragraph",
      "chinese": "高祖曰：「善。」",
      "literal": "Gao Zu said: \"Excellent.\"",
      "idiomatic": "Gao Zu said: 'Excellent.''",
      "context": {
        "previous": "非親子弟，莫可使王齊矣。」",
        "next": "賜黃金五百斤。"
      }
    },
    {
      "id": "s0515",
      "type": "paragraph",
      "chinese": "賜黃金五百斤。",
      "literal": "He bestowed five hundred jin of gold.",
      "idiomatic": "He awarded him 500 jin of gold.",
      "context": {
        "previous": "高祖曰：「善。」"
      }
    },
    {
      "id": "s0516",
      "type": "paragraph",
      "chinese": "後十餘日，封韓信為淮陰侯，分其地為二國。",
      "literal": "After over ten days, he enfeoffed Han Xin as Marquis of Huaiyin and divided his territory into two states.",
      "idiomatic": "More than ten days later, he enfeoffed Han Xin as Marquis of Huaiyin and split his territory into two kingdoms.",
      "context": {
        "next": "高祖曰將軍劉賈數有功，以為荊王，王淮東。"
      }
    },
    {
      "id": "s0517",
      "type": "paragraph",
      "chinese": "高祖曰將軍劉賈數有功，以為荊王，王淮東。",
      "literal": "Gao Zu said General Liu Jia had repeatedly achieved merit and made him King of Jing, ruling east of the Huai.",
      "idiomatic": "Gao Zu said: 'General Liu Jia has repeatedly achieved merit and made him King of Jing, ruling east of the Huai.'",
      "context": {
        "previous": "後十餘日，封韓信為淮陰侯，分其地為二國。",
        "next": "弟交為楚王，王淮西。"
      }
    },
    {
      "id": "s0518",
      "type": "paragraph",
      "chinese": "弟交為楚王，王淮西。",
      "literal": "His younger brother Jiao became King of Chu, ruling west of the Huai.",
      "idiomatic": "His younger brother Jiao became King of Chu, ruling the area west of the Huai River.",
      "context": {
        "previous": "高祖曰將軍劉賈數有功，以為荊王，王淮東。",
        "next": "子肥為齊王，王七十餘城，民能齊言者皆屬齊。"
      }
    },
    {
      "id": "s0519",
      "type": "paragraph",
      "chinese": "子肥為齊王，王七十餘城，民能齊言者皆屬齊。",
      "literal": "His son Fei became King of Qi, ruling over seventy cities; all people who could speak the Qi language belonged to Qi.",
      "idiomatic": "His son Fei became King of Qi, ruling over 70 cities; all people who spoke the Qi dialect were assigned to Qi.",
      "context": {
        "previous": "弟交為楚王，王淮西。",
        "next": "乃論功，與諸列侯剖符行封。"
      }
    },
    {
      "id": "s0520",
      "type": "paragraph",
      "chinese": "乃論功，與諸列侯剖符行封。",
      "literal": "He then evaluated merits and with all the ranked marquises divided tallies and carried out enfeoffments.",
      "idiomatic": "He then assessed everyone's merits and granted fiefs to the marquises, dividing the tally tallies as proof.",
      "context": {
        "previous": "子肥為齊王，王七十餘城，民能齊言者皆屬齊。",
        "next": "徙韓王信太原。"
      }
    },
    {
      "id": "s0521",
      "type": "paragraph",
      "chinese": "徙韓王信太原。",
      "literal": "He moved King Xin of Han to Taiyuan.",
      "idiomatic": "He transferred King Xin of Han to Taiyuan.",
      "context": {
        "previous": "乃論功，與諸列侯剖符行封。"
      }
    },
    {
      "id": "s0522",
      "type": "paragraph",
      "chinese": "七年，匈奴攻韓王信馬邑，信因與謀反太原。",
      "literal": "In the seventh year, the Xiongnu attacked King Xin of Han at Mayi; Xin consequently plotted rebellion with them at Taiyuan.",
      "idiomatic": "In the seventh year, the Xiongnu attacked King Xin of Han at Mayi; Xin took this opportunity to plot rebellion with them at Taiyuan.",
      "context": {
        "next": "白土曼丘臣、王黃立故趙將趙利為王以反，高祖自往擊之。"
      }
    },
    {
      "id": "s0523",
      "type": "paragraph",
      "chinese": "白土曼丘臣、王黃立故趙將趙利為王以反，高祖自往擊之。",
      "literal": "Man Qiu Chen of Baitu and Wang Huang installed the former Zhao general Zhao Li as king to rebel; Gao Zu personally went to strike them.",
      "idiomatic": "Man Qiu Chen of Baitu and Wang Huang set up the former Zhao general Zhao Li as king to rebel; Gao Zu personally went to attack them.",
      "context": {
        "previous": "七年，匈奴攻韓王信馬邑，信因與謀反太原。",
        "next": "會天寒，士卒墮指者什二三，遂至平城。"
      }
    },
    {
      "id": "s0524",
      "type": "paragraph",
      "chinese": "會天寒，士卒墮指者什二三，遂至平城。",
      "literal": "Meeting cold weather, two or three out of ten officers and troops lost fingers; they then reached Pingcheng.",
      "idiomatic": "They encountered bitterly cold weather, and 20-30% of the soldiers suffered frostbite and lost fingers; they finally reached Pingcheng.",
      "context": {
        "previous": "白土曼丘臣、王黃立故趙將趙利為王以反，高祖自往擊之。",
        "next": "匈奴圍我平城，七日而後罷去。"
      }
    },
    {
      "id": "s0525",
      "type": "paragraph",
      "chinese": "匈奴圍我平城，七日而後罷去。",
      "literal": "The Xiongnu surrounded us at Pingcheng for seven days before withdrawing.",
      "idiomatic": "The Xiongnu besieged us at Pingcheng for seven days before finally withdrawing.",
      "context": {
        "previous": "會天寒，士卒墮指者什二三，遂至平城。",
        "next": "令樊噲止定代地。"
      }
    },
    {
      "id": "s0526",
      "type": "paragraph",
      "chinese": "令樊噲止定代地。",
      "literal": "He ordered Fan Kuai to remain and settle the land of Dai.",
      "idiomatic": "He ordered Fan Kuai to stay behind and pacify the territory of Dai.",
      "context": {
        "previous": "匈奴圍我平城，七日而後罷去。",
        "next": "立兄劉仲為代王。"
      }
    },
    {
      "id": "s0527",
      "type": "paragraph",
      "chinese": "立兄劉仲為代王。",
      "literal": "He installed his elder brother Liu Zhong as King of Dai.",
      "idiomatic": "He installed his elder brother Liu Zhong as King of Dai.",
      "context": {
        "previous": "令樊噲止定代地。"
      }
    },
    {
      "id": "s0528",
      "type": "paragraph",
      "chinese": "二月，高祖自平城過趙、雒陽，至長安。",
      "literal": "In the second month, Gao Zu from Pingcheng passed through Zhao and Luoyang and reached Chang'an.",
      "idiomatic": "In the second month, Gao Zu traveled from Pingcheng through Zhao and Luoyang to reach Chang'an.",
      "context": {
        "next": "長樂宮成，丞相已下徙治長安。"
      }
    },
    {
      "id": "s0529",
      "type": "paragraph",
      "chinese": "長樂宮成，丞相已下徙治長安。",
      "literal": "Changle Palace was completed; the prime minister and below moved to govern at Chang'an.",
      "idiomatic": "Changle Palace was completed; the prime minister and all officials below him moved their administration to Chang'an.",
      "context": {
        "previous": "二月，高祖自平城過趙、雒陽，至長安。"
      }
    },
    {
      "id": "s0530",
      "type": "paragraph",
      "chinese": "八年，高祖東擊韓王信餘反寇於東垣。",
      "literal": "In the eighth year, Gao Zu went east to strike the remaining rebel bandits of King Xin of Han at Dongyuan.",
      "idiomatic": "In the eighth year, Gao Zu marched east to crush the remaining rebel forces of King Xin of Han at Dongyuan.",
      "context": {}
    },
    {
      "id": "s0531",
      "type": "paragraph",
      "chinese": "蕭丞相營作未央宮，立東闕、北闕、前殿、武庫、太倉。",
      "literal": "Prime Minister Xiao constructed Weiyang Palace, establishing the Eastern Tower, Northern Tower, Front Hall, Armory, and Great Granary.",
      "idiomatic": "Prime Minister Xiao oversaw the construction of Weiyang Palace, including the Eastern Gate Tower, Northern Gate Tower, Front Hall, Armory, and Great Granary.",
      "context": {
        "next": "高祖還，見宮闕壯甚，怒，謂蕭何曰：「天下匈匈苦戰數歲，成敗未可知，是何治宮室過度也？」"
      }
    },
    {
      "id": "s0532",
      "type": "paragraph",
      "chinese": "高祖還，見宮闕壯甚，怒，謂蕭何曰：「天下匈匈苦戰數歲，成敗未可知，是何治宮室過度也？」",
      "literal": "When Gao Zu returned and saw the palace towers were exceedingly grand, he was angry and said to Xiao He: \"All under Heaven has suffered bitterly fighting for several years; success or failure cannot yet be known—why do you govern palace chambers to excess?\"",
      "idiomatic": "When Gao Zu returned and saw the palace towers were exceedingly grand, he was angry and said to Xiao He: 'All under Heaven has suffered bitterly fighting for several years; success or failure cannot yet be known—why do you govern palace chambers to excess?'",
      "context": {
        "previous": "蕭丞相營作未央宮，立東闕、北闕、前殿、武庫、太倉。",
        "next": "蕭何曰：「天下方未定，故可因遂就宮室。"
      }
    },
    {
      "id": "s0533",
      "type": "paragraph",
      "chinese": "蕭何曰：「天下方未定，故可因遂就宮室。",
      "literal": "Xiao He said: \"Precisely because all under Heaven is not yet settled, we can consequently proceed to complete the palace chambers.",
      "idiomatic": "Xiao He said: 'Precisely because all under Heaven is not yet settled, we can consequently proceed to complete the palace chambers.'",
      "context": {
        "previous": "高祖還，見宮闕壯甚，怒，謂蕭何曰：「天下匈匈苦戰數歲，成敗未可知，是何治宮室過度也？」",
        "next": "且夫天子四海為家，非壯麗無以重威，且無令後世有以加也。」"
      }
    },
    {
      "id": "s0534",
      "type": "paragraph",
      "chinese": "且夫天子四海為家，非壯麗無以重威，且無令後世有以加也。」",
      "literal": "Moreover, the Son of Heaven has the four seas as his home; without grandeur and magnificence there is no way to give weight to authority, and moreover we must not allow later generations to have anything to add.\"",
      "idiomatic": "Moreover, the Son of Heaven has the four seas as his home; without grandeur and magnificence there is no way to give weight to authority, and moreover we must not allow later generations to have anything to add.''",
      "context": {
        "previous": "蕭何曰：「天下方未定，故可因遂就宮室。",
        "next": "高祖乃說。"
      }
    },
    {
      "id": "s0535",
      "type": "paragraph",
      "chinese": "高祖乃說。",
      "literal": "Gao Zu was then pleased.",
      "idiomatic": "Gao Zu was greatly pleased.",
      "context": {
        "previous": "且夫天子四海為家，非壯麗無以重威，且無令後世有以加也。」"
      }
    },
    {
      "id": "s0536",
      "type": "paragraph",
      "chinese": "高祖之東垣，過柏人，趙相貫高等謀弒高祖，高祖心動，因不留。",
      "literal": "When Gao Zu went to Dongyuan and passed through Bairen, Zhao Prime Minister Guan Gao and others plotted to assassinate Gao Zu; Gao Zu's heart was stirred and consequently he did not remain.",
      "idiomatic": "As Gao Zu traveled to Dongyuan and passed through Bairen, Zhao Prime Minister Guan Gao and others plotted to assassinate him; Gao Zu had a premonition and pressed on without stopping.",
      "context": {
        "next": "代王劉仲棄國亡，自歸雒陽，廢以為合陽侯。"
      }
    },
    {
      "id": "s0537",
      "type": "paragraph",
      "chinese": "代王劉仲棄國亡，自歸雒陽，廢以為合陽侯。",
      "literal": "King Liu Zhong of Dai abandoned his state and fled, returning on his own to Luoyang; he was demoted to be Marquis of Heyang.",
      "idiomatic": "King Liu Zhong of Dai abandoned his kingdom and fled, surrendering himself at Luoyang; he was demoted to Marquis of Heyang.",
      "context": {
        "previous": "高祖之東垣，過柏人，趙相貫高等謀弒高祖，高祖心動，因不留。"
      }
    },
    {
      "id": "s0538",
      "type": "paragraph",
      "chinese": "九年，趙相貫高等事發覺，夷三族。",
      "literal": "In the ninth year, the affair of Zhao Prime Minister Guan Gao and others was discovered; their three clans were exterminated.",
      "idiomatic": "In the ninth year, the plot by Zhao Prime Minister Guan Gao and others was uncovered; their entire clans were wiped out.",
      "context": {
        "next": "廢趙王敖為宣平侯。"
      }
    },
    {
      "id": "s0539",
      "type": "paragraph",
      "chinese": "廢趙王敖為宣平侯。",
      "literal": "They demoted King Ao of Zhao to be Marquis of Xuanping.",
      "idiomatic": "They stripped King Ao of Zhao of his title and made him Marquis of Xuanping.",
      "context": {
        "previous": "九年，趙相貫高等事發覺，夷三族。",
        "next": "是歲，徙貴族楚昭、屈、景、懷、齊田氏關中。"
      }
    },
    {
      "id": "s0540",
      "type": "paragraph",
      "chinese": "是歲，徙貴族楚昭、屈、景、懷、齊田氏關中。",
      "literal": "That year, they relocated noble clans—the Zhao, Qu, Jing, and Huai of Chu, and the Tian clan of Qi—to Guanzhong.",
      "idiomatic": "That year, they relocated noble clans—the Zhao, Qu, Jing, and Huai families of Chu, and the Tian clan of Qi—to Guanzhong.",
      "context": {
        "previous": "廢趙王敖為宣平侯。"
      }
    },
    {
      "id": "s0541",
      "type": "paragraph",
      "chinese": "未央宮成。",
      "literal": "Weiyang Palace was completed.",
      "idiomatic": "Weiyang Palace was completed.",
      "context": {
        "next": "高祖大朝諸侯群臣，置酒未央前殿。"
      }
    },
    {
      "id": "s0542",
      "type": "paragraph",
      "chinese": "高祖大朝諸侯群臣，置酒未央前殿。",
      "literal": "Gao Zu held a great court with the feudal lords and assembled ministers and held a banquet in the front hall of Weiyang.",
      "idiomatic": "Gao Zu held a grand court audience with all the feudal lords and ministers, hosting a banquet in the front hall of Weiyang Palace.",
      "context": {
        "previous": "未央宮成。",
        "next": "高祖奉玉卮，起為太上皇壽，曰：「始大人常以臣無賴，不能治產業，不如仲力。"
      }
    },
    {
      "id": "s0543",
      "type": "paragraph",
      "chinese": "高祖奉玉卮，起為太上皇壽，曰：「始大人常以臣無賴，不能治產業，不如仲力。",
      "literal": "Gao Zu presented a jade cup, rose to offer a toast for the Grand Supreme Sovereign, and said: \"At first the great man always considered me worthless, unable to manage productive work, not as capable as Zhong.",
      "idiomatic": "Gao Zu presented a jade cup, rose to offer a toast for the Grand Supreme Sovereign, and said: 'At first the great man always considered me worthless, unable to manage productive work, not as capable as Zhong.'",
      "context": {
        "previous": "高祖大朝諸侯群臣，置酒未央前殿。",
        "next": "今某之業所就孰與仲多？」"
      }
    },
    {
      "id": "s0544",
      "type": "paragraph",
      "chinese": "今某之業所就孰與仲多？」",
      "literal": "Now whose achievements are greater, mine or Zhong's?\"",
      "idiomatic": "Now whose achievements are greater, mine or Zhong's?''",
      "context": {
        "previous": "高祖奉玉卮，起為太上皇壽，曰：「始大人常以臣無賴，不能治產業，不如仲力。",
        "next": "殿上群臣皆呼萬歲，大笑為樂。"
      }
    },
    {
      "id": "s0545",
      "type": "paragraph",
      "chinese": "殿上群臣皆呼萬歲，大笑為樂。",
      "literal": "All the assembled ministers in the hall shouted 'Long live!' and laughed greatly in merriment.",
      "idiomatic": "All the ministers assembled in the hall shouted 'Long live the Emperor!' and roared with laughter in high spirits.",
      "context": {
        "previous": "今某之業所就孰與仲多？」"
      }
    },
    {
      "id": "s0546",
      "type": "paragraph",
      "chinese": "十年十月，淮南王黥布、梁王彭越、燕王盧綰、荊王劉賈、楚王劉交、齊王劉肥、長沙王吳芮皆來朝長樂宮。",
      "literal": "In the tenth month of the tenth year, King Bu of Huainan, King Peng Yue of Liang, King Lu Wan of Yan, King Liu Jia of Jing, King Liu Jiao of Chu, King Liu Fei of Qi, and King Wu Rui of Changsha all came to court at Changle Palace.",
      "idiomatic": "In the tenth month of the tenth year, King Bu of Huainan, King Peng Yue of Liang, King Lu Wan of Yan, King Liu Jia of Jing, King Liu Jiao of Chu, King Liu Fei of Qi, and King Wu Rui of Changsha all came to pay court at Changle Palace.",
      "context": {
        "next": "春夏無事。"
      }
    },
    {
      "id": "s0547",
      "type": "paragraph",
      "chinese": "春夏無事。",
      "literal": "In spring and summer there were no events.",
      "idiomatic": "Spring and summer passed uneventfully.",
      "context": {
        "previous": "十年十月，淮南王黥布、梁王彭越、燕王盧綰、荊王劉賈、楚王劉交、齊王劉肥、長沙王吳芮皆來朝長樂宮。"
      }
    },
    {
      "id": "s0548",
      "type": "paragraph",
      "chinese": "七月，太上皇崩櫟陽宮。",
      "literal": "In the seventh month, the Grand Supreme Sovereign died at Liyang Palace.",
      "idiomatic": "In the seventh month, the Supreme Retired Emperor passed away at Liyang Palace.",
      "context": {
        "next": "楚王、梁王皆來送葬。"
      }
    },
    {
      "id": "s0549",
      "type": "paragraph",
      "chinese": "楚王、梁王皆來送葬。",
      "literal": "The King of Chu and King of Liang both came to attend the funeral.",
      "idiomatic": "The King of Chu and King of Liang both came to attend the funeral rites.",
      "context": {
        "previous": "七月，太上皇崩櫟陽宮。",
        "next": "赦櫟陽囚。"
      }
    },
    {
      "id": "s0550",
      "type": "paragraph",
      "chinese": "赦櫟陽囚。",
      "literal": "They pardoned prisoners of Liyang.",
      "idiomatic": "All prisoners in Liyang were granted amnesty.",
      "context": {
        "previous": "楚王、梁王皆來送葬。",
        "next": "更命酈邑曰新豐。"
      }
    },
    {
      "id": "s0551",
      "type": "paragraph",
      "chinese": "更命酈邑曰新豐。",
      "literal": "They renamed Li township as Xinfeng.",
      "idiomatic": "They renamed Li township to Xinfeng.",
      "context": {
        "previous": "赦櫟陽囚。"
      }
    },
    {
      "id": "s0552",
      "type": "paragraph",
      "chinese": "八月，趙相國陳豨反代地。",
      "literal": "In the eighth month, Zhao Prime Minister Chen Xi rebelled in the land of Dai.",
      "idiomatic": "In the eighth month, Zhao Prime Minister Chen Xi rose in rebellion in Dai territory.",
      "context": {
        "next": "上曰：「豨嘗為吾使，甚有信。"
      }
    },
    {
      "id": "s0553",
      "type": "paragraph",
      "chinese": "上曰：「豨嘗為吾使，甚有信。",
      "literal": "The superior said: \"Xi was once my envoy and was very trustworthy.",
      "idiomatic": "The superior said: 'Xi was once my envoy and was very trustworthy.'",
      "context": {
        "previous": "八月，趙相國陳豨反代地。",
        "next": "代地吾所急也，故封豨為列侯，以相國守代，今乃與王黃等劫掠代地！"
      }
    },
    {
      "id": "s0554",
      "type": "paragraph",
      "chinese": "代地吾所急也，故封豨為列侯，以相國守代，今乃與王黃等劫掠代地！",
      "literal": "The land of Dai is what I urgently need; therefore I enfeoffed Xi as a ranked marquis to serve as prime minister defending Dai—now he actually joins with Wang Huang and others to rob and plunder the land of Dai!",
      "idiomatic": "The land of Dai is what I urgently need; therefore I enfeoffed Xi as a ranked marquis to serve as prime minister defending Dai—now he actually joins with Wang Huang and others to rob and plunder the land of Dai!'",
      "context": {
        "previous": "上曰：「豨嘗為吾使，甚有信。",
        "next": "代地吏民非有罪也。"
      }
    },
    {
      "id": "s0555",
      "type": "paragraph",
      "chinese": "代地吏民非有罪也。",
      "literal": "The officials and people of the land of Dai are not guilty.",
      "idiomatic": "The officials and people of Dai territory bear no guilt.",
      "context": {
        "previous": "代地吾所急也，故封豨為列侯，以相國守代，今乃與王黃等劫掠代地！",
        "next": "其赦代吏民。」"
      }
    },
    {
      "id": "s0556",
      "type": "paragraph",
      "chinese": "其赦代吏民。」",
      "literal": "Pardon the officials and people of Dai.\"",
      "idiomatic": "Pardon the officials and people of Dai.''",
      "context": {
        "previous": "代地吏民非有罪也。",
        "next": "九月，上自東往擊之。"
      }
    },
    {
      "id": "s0557",
      "type": "paragraph",
      "chinese": "九月，上自東往擊之。",
      "literal": "In the ninth month, the superior personally went east to strike him.",
      "idiomatic": "In the ninth month, His Majesty personally marched east to attack him.",
      "context": {
        "previous": "其赦代吏民。」",
        "next": "至邯鄲，上喜曰：「豨不南據邯鄲而阻漳水，吾知其無能為也。」"
      }
    },
    {
      "id": "s0558",
      "type": "paragraph",
      "chinese": "至邯鄲，上喜曰：「豨不南據邯鄲而阻漳水，吾知其無能為也。」",
      "literal": "Reaching Handan, the superior was pleased and said: \"Xi did not occupy Handan to the south and block the Zhang River—I know he is incapable.\"",
      "idiomatic": "Reaching Handan, the superior was pleased and said: 'Xi did not occupy Handan to the south and block the Zhang River—I know he is incapable.''",
      "context": {
        "previous": "九月，上自東往擊之。",
        "next": "聞豨將皆故賈人也，上曰：「吾知所以與之。」"
      }
    },
    {
      "id": "s0559",
      "type": "paragraph",
      "chinese": "聞豨將皆故賈人也，上曰：「吾知所以與之。」",
      "literal": "Hearing that Xi's generals were all former merchants, the superior said: \"I know how to deal with them.\"",
      "idiomatic": "Hearing that Xi's generals were all former merchants, the superior said: 'I know how to deal with them.''",
      "context": {
        "previous": "至邯鄲，上喜曰：「豨不南據邯鄲而阻漳水，吾知其無能為也。」",
        "next": "乃多以金啗豨將，豨將多降者。"
      }
    },
    {
      "id": "s0560",
      "type": "paragraph",
      "chinese": "乃多以金啗豨將，豨將多降者。",
      "literal": "He then enticed Xi's generals with much gold; many of Xi's generals surrendered.",
      "idiomatic": "He then bribed Xi's generals with large sums of gold; many of them surrendered.",
      "context": {
        "previous": "聞豨將皆故賈人也，上曰：「吾知所以與之。」"
      }
    },
    {
      "id": "s0561",
      "type": "paragraph",
      "chinese": "十一年，高祖在邯鄲誅豨等未畢，豨將侯敞將萬餘人游行，王黃軍曲逆，張春渡河擊聊城。",
      "literal": "In the eleventh year, when Gao Zu at Handan had not yet finished executing Xi and others, Xi's general Hou Chang led over ten thousand men traveling and marching; Wang Huang's army was at Quyi; Zhang Chun crossed the Yellow River to strike Liaocheng.",
      "idiomatic": "In the eleventh year, while Gao Zu was still executing Xi and others at Handan, Xi's general Hou Chang led over ten thousand troops in a roaming campaign; Wang Huang's army held Quyi; and Zhang Chun crossed the Yellow River to attack Liaocheng.",
      "context": {
        "next": "漢使將軍郭蒙與齊將擊，大破之。"
      }
    },
    {
      "id": "s0562",
      "type": "paragraph",
      "chinese": "漢使將軍郭蒙與齊將擊，大破之。",
      "literal": "Han sent General Guo Meng with Qi generals to strike and greatly break them.",
      "idiomatic": "Han dispatched General Guo Meng along with Qi generals to attack and decisively defeat them.",
      "context": {
        "previous": "十一年，高祖在邯鄲誅豨等未畢，豨將侯敞將萬餘人游行，王黃軍曲逆，張春渡河擊聊城。",
        "next": "太尉周勃道太原入，定代地。"
      }
    },
    {
      "id": "s0563",
      "type": "paragraph",
      "chinese": "太尉周勃道太原入，定代地。",
      "literal": "Grand Commandant Zhou Bo went by way of Taiyuan and entered to settle the land of Dai.",
      "idiomatic": "Grand Commandant Zhou Bo passed through Taiyuan and entered Dai territory to pacify it.",
      "context": {
        "previous": "漢使將軍郭蒙與齊將擊，大破之。",
        "next": "至馬邑，馬邑不下，即攻殘之。"
      }
    },
    {
      "id": "s0564",
      "type": "paragraph",
      "chinese": "至馬邑，馬邑不下，即攻殘之。",
      "literal": "Reaching Mayi, Mayi would not surrender, so he attacked and devastated it.",
      "idiomatic": "When he reached Mayi and the city refused to surrender, he attacked and destroyed it.",
      "context": {
        "previous": "太尉周勃道太原入，定代地。"
      }
    },
    {
      "id": "s0565",
      "type": "paragraph",
      "chinese": "豨將趙利守東垣，高祖攻之，不下。",
      "literal": "Xi's general Zhao Li defended Dongyuan; Gao Zu attacked it but it did not fall.",
      "idiomatic": "Xi's general Zhao Li held Dongyuan against Gao Zu's attacks, and the city did not fall.",
      "context": {
        "next": "月餘，卒罵高祖，高祖怒。"
      }
    },
    {
      "id": "s0566",
      "type": "paragraph",
      "chinese": "月餘，卒罵高祖，高祖怒。",
      "literal": "After over a month, the troops reviled Gao Zu; Gao Zu was angry.",
      "idiomatic": "After more than a month, the soldiers cursed Gao Zu, and he became furious.",
      "context": {
        "previous": "豨將趙利守東垣，高祖攻之，不下。",
        "next": "城降，令出罵者斬之，不罵者原之。"
      }
    },
    {
      "id": "s0567",
      "type": "paragraph",
      "chinese": "城降，令出罵者斬之，不罵者原之。",
      "literal": "When the city surrendered, he ordered those who had reviled to be beheaded; those who had not reviled were pardoned.",
      "idiomatic": "When the city finally surrendered, he ordered the execution of those who had cursed him and pardoned those who had not.",
      "context": {
        "previous": "月餘，卒罵高祖，高祖怒。",
        "next": "於是乃分趙山北，立子恒以為代王，都晉陽。"
      }
    },
    {
      "id": "s0568",
      "type": "paragraph",
      "chinese": "於是乃分趙山北，立子恒以為代王，都晉陽。",
      "literal": "Thereupon he divided the mountains north of Zhao and installed his son Heng as King of Dai, with his capital at Jinyang.",
      "idiomatic": "He then divided the territory north of Zhao's mountains and installed his son Heng as King of Dai with his capital at Jinyang.",
      "context": {
        "previous": "城降，令出罵者斬之，不罵者原之。"
      }
    },
    {
      "id": "s0569",
      "type": "paragraph",
      "chinese": "春，淮陰侯韓信謀反關中，夷三族。",
      "literal": "In spring, the Marquis of Huaiyin Han Xin plotted rebellion in Guanzhong; his three clans were exterminated.",
      "idiomatic": "In spring, Han Xin, Marquis of Huaiyin, plotted rebellion in Guanzhong and his entire clan was wiped out.",
      "context": {}
    },
    {
      "id": "s0570",
      "type": "paragraph",
      "chinese": "夏，梁王彭越謀反，廢遷蜀；",
      "literal": "In summer, King Peng Yue of Liang plotted rebellion and was demoted and exiled to Shu;",
      "idiomatic": "In summer, King Peng Yue of Liang plotted rebellion and was stripped of his title and exiled to Shu;",
      "context": {
        "next": "復欲反，遂夷三族。"
      }
    },
    {
      "id": "s0571",
      "type": "paragraph",
      "chinese": "復欲反，遂夷三族。",
      "literal": "wishing to rebel again, his three clans were thereupon exterminated.",
      "idiomatic": "but when he tried to rebel again, his entire clan was exterminated.",
      "context": {
        "previous": "夏，梁王彭越謀反，廢遷蜀；",
        "next": "立子恢為梁王，子友為淮陽王。"
      }
    },
    {
      "id": "s0572",
      "type": "paragraph",
      "chinese": "立子恢為梁王，子友為淮陽王。",
      "literal": "He installed his son Hui as King of Liang and his son You as King of Huaiyang.",
      "idiomatic": "He installed his son Hui as King of Liang and his son You as King of Huaiyang.",
      "context": {
        "previous": "復欲反，遂夷三族。"
      }
    },
    {
      "id": "s0573",
      "type": "paragraph",
      "chinese": "秋七月，淮南王黥布反，東并荊王劉賈地，北渡淮，楚王交走入薛。",
      "literal": "In the seventh month of autumn, King Bu of Huainan rebelled, absorbed the territory of King Liu Jia of Jing to the east, crossed the Huai to the north; the King of Chu Jiao fled and entered Xue.",
      "idiomatic": "In the seventh month of autumn, King Bu of Huainan rebelled, annexed King Liu Jia's Jing territory to the east, crossed north over the Huai River, and King Jiao of Chu fled to Xue.",
      "context": {
        "next": "高祖自往擊之。"
      }
    },
    {
      "id": "s0574",
      "type": "paragraph",
      "chinese": "高祖自往擊之。",
      "literal": "Gao Zu personally went to strike him.",
      "idiomatic": "Gao Zu went in person to attack him.",
      "context": {
        "previous": "秋七月，淮南王黥布反，東并荊王劉賈地，北渡淮，楚王交走入薛。",
        "next": "立子長為淮南王。"
      }
    },
    {
      "id": "s0575",
      "type": "paragraph",
      "chinese": "立子長為淮南王。",
      "literal": "He installed his son Chang as King of Huainan.",
      "idiomatic": "He installed his son Chang as King of Huainan.",
      "context": {
        "previous": "高祖自往擊之。"
      }
    },
    {
      "id": "s0576",
      "type": "paragraph",
      "chinese": "十二年，十月，高祖已擊布軍會甀，布走，令別將追之。",
      "literal": "In the tenth month of the twelfth year, Gao Zu having struck Bu's army met at Kuai; Bu fled and he ordered separate generals to pursue him.",
      "idiomatic": "In the tenth month of the twelfth year, after defeating Bu's army and meeting at Kuai, Bu fled and Gao Zu ordered other generals to pursue him.",
      "context": {}
    },
    {
      "id": "s0577",
      "type": "paragraph",
      "chinese": "高祖還歸，過沛，留。",
      "literal": "Gao Zu returned, passing through Pei, and remained.",
      "idiomatic": "On his return home, Gao Zu passed through Pei and stayed there.",
      "context": {
        "next": "置酒沛宮，悉召故人父老子弟縱酒，發沛中兒得百二十人，教之歌。"
      }
    },
    {
      "id": "s0578",
      "type": "paragraph",
      "chinese": "置酒沛宮，悉召故人父老子弟縱酒，發沛中兒得百二十人，教之歌。",
      "literal": "He held a banquet at Pei Palace, summoned all his old friends, fathers, elders, sons, and younger brothers to drink without restraint, and gathered one hundred twenty boys from Pei and taught them to sing.",
      "idiomatic": "He held a banquet at Pei Palace and summoned all his old friends, family, and elders for unrestrained drinking. He gathered 120 boys from Pei and taught them to sing.",
      "context": {
        "previous": "高祖還歸，過沛，留。",
        "next": "酒酣，高祖擊筑，自為歌詩曰：「大風起兮雲飛揚，威加海內兮歸故鄉，安得猛士兮守四方！」"
      }
    },
    {
      "id": "s0579",
      "type": "paragraph",
      "chinese": "酒酣，高祖擊筑，自為歌詩曰：「大風起兮雲飛揚，威加海內兮歸故鄉，安得猛士兮守四方！」",
      "literal": "When the wine was flowing, Gao Zu struck the zhu and composed a song himself, saying: \"The great wind rises and clouds fly; authority extends over the seas and I return to my native place; where can I find brave men to defend the four quarters!\"",
      "idiomatic": "As the wine flowed freely, Gao Zu played the zhu and composed his own song: 'A great wind rises, scattering the clouds; my authority spans the realm as I return home. Where can I find brave warriors to guard the four corners?'",
      "context": {
        "previous": "置酒沛宮，悉召故人父老子弟縱酒，發沛中兒得百二十人，教之歌。",
        "next": "令兒皆和習之。"
      }
    },
    {
      "id": "s0580",
      "type": "paragraph",
      "chinese": "令兒皆和習之。",
      "literal": "He had the boys all harmonize and practice it.",
      "idiomatic": "He had all the boys join in the chorus and practice the song.",
      "context": {
        "previous": "酒酣，高祖擊筑，自為歌詩曰：「大風起兮雲飛揚，威加海內兮歸故鄉，安得猛士兮守四方！」",
        "next": "高祖乃起舞，慷慨傷懷，泣數行下。"
      }
    },
    {
      "id": "s0581",
      "type": "paragraph",
      "chinese": "高祖乃起舞，慷慨傷懷，泣數行下。",
      "literal": "Gao Zu then rose to dance, impassioned and moved in feeling, weeping tears streaming down.",
      "idiomatic": "Gao Zu then began to dance, filled with passion and deep emotion, his tears flowing freely.",
      "context": {
        "previous": "令兒皆和習之。",
        "next": "謂沛父兄曰：「游子悲故鄉。"
      }
    },
    {
      "id": "s0582",
      "type": "paragraph",
      "chinese": "謂沛父兄曰：「游子悲故鄉。",
      "literal": "He said to the fathers and elder brothers of Pei: \"A traveler grieves for his native place.",
      "idiomatic": "He said to Pei's elders: 'A wanderer longs for his homeland.'",
      "context": {
        "previous": "高祖乃起舞，慷慨傷懷，泣數行下。",
        "next": "吾雖都關中，萬歲後吾魂魄猶樂思沛。"
      }
    },
    {
      "id": "s0583",
      "type": "paragraph",
      "chinese": "吾雖都關中，萬歲後吾魂魄猶樂思沛。",
      "literal": "Though I have made my capital in Guanzhong, after ten thousand years my spirit and soul will still delight in longing for Pei.",
      "idiomatic": "Though I've established my capital in Guanzhong, even after a thousand years my soul will still yearn for Pei.'",
      "context": {
        "previous": "謂沛父兄曰：「游子悲故鄉。",
        "next": "且朕自沛公以誅暴逆，遂有天下，其以沛為朕湯沐邑，復其民，世世無有所與。」"
      }
    },
    {
      "id": "s0584",
      "type": "paragraph",
      "chinese": "且朕自沛公以誅暴逆，遂有天下，其以沛為朕湯沐邑，復其民，世世無有所與。」",
      "literal": "Moreover, I from being Duke of Pei executed the violent and rebellious and consequently possessed all under Heaven; let Pei be my bathing estate, exempt its people, generation after generation never having to contribute anything.\"",
      "idiomatic": "Moreover, I started as Duke of Pei and executed the tyrants and rebels, thus gaining dominion over the realm. Let Pei be my private estate, with its people exempt from taxes forever.'",
      "context": {
        "previous": "吾雖都關中，萬歲後吾魂魄猶樂思沛。",
        "next": "沛父兄諸母故人日樂飲極驩，道舊故為笑樂。"
      }
    },
    {
      "id": "s0585",
      "type": "paragraph",
      "chinese": "沛父兄諸母故人日樂飲極驩，道舊故為笑樂。",
      "literal": "The fathers, elder brothers, mothers, and old friends of Pei daily delighted in drinking to extreme joy, recounting old times for laughter and pleasure.",
      "idiomatic": "Pei's elders, womenfolk, and old friends drank and reveled every day, reminiscing about the past for joy and laughter.",
      "context": {
        "previous": "且朕自沛公以誅暴逆，遂有天下，其以沛為朕湯沐邑，復其民，世世無有所與。」",
        "next": "十餘日，高祖欲去，沛父兄固請留高祖。"
      }
    },
    {
      "id": "s0586",
      "type": "paragraph",
      "chinese": "十餘日，高祖欲去，沛父兄固請留高祖。",
      "literal": "After over ten days, Gao Zu wished to leave; the fathers and elder brothers of Pei firmly requested Gao Zu to remain.",
      "idiomatic": "After more than ten days, when Gao Zu wanted to leave, Pei's elders insisted he stay.",
      "context": {
        "previous": "沛父兄諸母故人日樂飲極驩，道舊故為笑樂。",
        "next": "高祖曰：「吾人眾多，父兄不能給。」"
      }
    },
    {
      "id": "s0587",
      "type": "paragraph",
      "chinese": "高祖曰：「吾人眾多，父兄不能給。」",
      "literal": "Gao Zu said: \"My people are numerous; the fathers and elder brothers cannot provide for them.\"",
      "idiomatic": "Gao Zu replied: 'I have too many followers; you elders can't support them all.'",
      "context": {
        "previous": "十餘日，高祖欲去，沛父兄固請留高祖。",
        "next": "乃去。"
      }
    },
    {
      "id": "s0588",
      "type": "paragraph",
      "chinese": "乃去。",
      "literal": "He then departed.",
      "idiomatic": "So he left.",
      "context": {
        "previous": "高祖曰：「吾人眾多，父兄不能給。」",
        "next": "沛中空縣皆之邑西獻。"
      }
    },
    {
      "id": "s0589",
      "type": "paragraph",
      "chinese": "沛中空縣皆之邑西獻。",
      "literal": "The entire county of Pei went to the west of the township to present offerings.",
      "idiomatic": "The whole county of Pei gathered west of the town to present farewell gifts.",
      "context": {
        "previous": "乃去。",
        "next": "高祖復留止，張飲三日。"
      }
    },
    {
      "id": "s0590",
      "type": "paragraph",
      "chinese": "高祖復留止，張飲三日。",
      "literal": "Gao Zu again remained and stopped, holding banquets and drinking for three days.",
      "idiomatic": "Gao Zu stayed again and pitched camp, feasting and drinking for three days.",
      "context": {
        "previous": "沛中空縣皆之邑西獻。",
        "next": "沛父兄皆頓首曰：「沛幸得復，豐未復，唯陛下哀憐之。」"
      }
    },
    {
      "id": "s0591",
      "type": "paragraph",
      "chinese": "沛父兄皆頓首曰：「沛幸得復，豐未復，唯陛下哀憐之。」",
      "literal": "The fathers and elder brothers of Pei all kowtowed and said: \"Pei has been fortunate to obtain exemption; Feng has not been exempted—we only hope Your Majesty will take pity on it.\"",
      "idiomatic": "Pei's elders all bowed low and said: 'Pei has been lucky to get tax exemption; Feng has not. We beg Your Majesty to show mercy to it.'",
      "context": {
        "previous": "高祖復留止，張飲三日。",
        "next": "高祖曰：「豐吾所生長，極不忘耳，吾特為其以雍齒故反我為魏。」"
      }
    },
    {
      "id": "s0592",
      "type": "paragraph",
      "chinese": "高祖曰：「豐吾所生長，極不忘耳，吾特為其以雍齒故反我為魏。」",
      "literal": "Gao Zu said: \"Feng is where I was born and grew up—I absolutely do not forget it; I particularly hold it against them that because of Yong Chi they rebelled against me for Wei.\"",
      "idiomatic": "Gao Zu replied: 'Feng is my birthplace—I'll never forget that. But I resent them because they sided with Wei and rebelled against me on account of Yong Chi.'",
      "context": {
        "previous": "沛父兄皆頓首曰：「沛幸得復，豐未復，唯陛下哀憐之。」",
        "next": "沛父兄固請，乃并復豐，比沛。"
      }
    },
    {
      "id": "s0593",
      "type": "paragraph",
      "chinese": "沛父兄固請，乃并復豐，比沛。",
      "literal": "The fathers and elder brothers of Pei firmly requested; he then also exempted Feng, equal to Pei.",
      "idiomatic": "Pei's elders kept pleading, so he granted Feng the same tax exemption as Pei.",
      "context": {
        "previous": "高祖曰：「豐吾所生長，極不忘耳，吾特為其以雍齒故反我為魏。」",
        "next": "於是拜沛侯劉濞為吳王。"
      }
    },
    {
      "id": "s0594",
      "type": "paragraph",
      "chinese": "於是拜沛侯劉濞為吳王。",
      "literal": "Thereupon he appointed Marquis Liu Bi of Pei as King of Wu.",
      "idiomatic": "He then appointed Liu Bi, Marquis of Pei, as King of Wu.",
      "context": {
        "previous": "沛父兄固請，乃并復豐，比沛。"
      }
    },
    {
      "id": "s0595",
      "type": "paragraph",
      "chinese": "漢將別擊布軍洮水南北，皆大破之，追得斬布鄱陽。",
      "literal": "Han generals separately struck Bu's army south and north of the Tao River, all greatly breaking them; pursuing they obtained and beheaded Bu at Poyang.",
      "idiomatic": "Han generals launched separate attacks on Bu's army north and south of the Tao River, routing them all. In pursuit they caught and executed Bu at Poyang.",
      "context": {}
    },
    {
      "id": "s0596",
      "type": "paragraph",
      "chinese": "樊噲別將兵定代，斬陳豨當城。",
      "literal": "Fan Kuai separately led troops to settle Dai and beheaded Chen Xi at Dangcheng.",
      "idiomatic": "Fan Kuai led a separate force to pacify Dai and executed Chen Xi at Dangcheng.",
      "context": {}
    },
    {
      "id": "s0597",
      "type": "paragraph",
      "chinese": "十一月，高祖自布軍至長安。",
      "literal": "In the eleventh month, Gao Zu from Bu's army reached Chang'an.",
      "idiomatic": "In the eleventh month, Gao Zu returned from the campaign against Bu and arrived at Chang'an.",
      "context": {
        "next": "十二月，高祖曰：「秦始皇帝、楚隱王陳涉、魏安釐王、齊緡王、趙悼襄王皆絕無後，予守冢各十家，秦皇帝二十家，魏公子無忌五家。」"
      }
    },
    {
      "id": "s0598",
      "type": "paragraph",
      "chinese": "十二月，高祖曰：「秦始皇帝、楚隱王陳涉、魏安釐王、齊緡王、趙悼襄王皆絕無後，予守冢各十家，秦皇帝二十家，魏公子無忌五家。」",
      "literal": "In the twelfth month, Gao Zu said: \"The First Emperor of Qin, King Yin of Chu Chen She, King Anli of Wei, King Min of Qi, and King Daoxiang of Zhao are all extinct without descendants; I bestow ten families each to guard their tombs, twenty families for the Emperor of Qin, and five families for Lord Wuji of Wei.\"",
      "idiomatic": "In the twelfth month, Gao Zu declared: 'The First Emperor of Qin, King Yin of Chu Chen She, King Anli of Wei, King Min of Qi, and King Daoxiang of Zhao all died without heirs. I grant ten families each to tend their tombs, twenty for the Qin Emperor, and five for Lord Wuji of Wei.'",
      "context": {
        "previous": "十一月，高祖自布軍至長安。",
        "next": "赦代地吏民為陳豨、趙利所劫掠者，皆赦之。"
      }
    },
    {
      "id": "s0599",
      "type": "paragraph",
      "chinese": "赦代地吏民為陳豨、趙利所劫掠者，皆赦之。",
      "literal": "He pardoned the officials and people of the land of Dai who had been coerced and plundered by Chen Xi and Zhao Li—all were pardoned.",
      "idiomatic": "He pardoned all the officials and people of Dai who had been forced into service and plundered by Chen Xi and Zhao Li.",
      "context": {
        "previous": "十二月，高祖曰：「秦始皇帝、楚隱王陳涉、魏安釐王、齊緡王、趙悼襄王皆絕無後，予守冢各十家，秦皇帝二十家，魏公子無忌五家。」",
        "next": "陳豨降將言豨反時，燕王盧綰使人之豨所，與陰謀。"
      }
    },
    {
      "id": "s0600",
      "type": "paragraph",
      "chinese": "陳豨降將言豨反時，燕王盧綰使人之豨所，與陰謀。",
      "literal": "Chen Xi's surrendered generals reported that when Xi rebelled, King Lu Wan of Yan sent men to Xi's location and secretly plotted with him.",
      "idiomatic": "Chen Xi's surrendered generals revealed that when Xi rebelled, King Lu Wan of Yan had sent agents to Xi's camp to conspire with him in secret.",
      "context": {
        "previous": "赦代地吏民為陳豨、趙利所劫掠者，皆赦之。",
        "next": "上使辟陽侯迎綰，綰稱病。"
      }
    },
    {
      "id": "s0601",
      "type": "paragraph",
      "chinese": "上使辟陽侯迎綰，綰稱病。",
      "literal": "The superior sent Marquis of Biyang to summon Wan; Wan claimed illness.",
      "idiomatic": "The emperor sent the Marquis of Biyang to summon Wan, but Wan pleaded illness.",
      "context": {
        "previous": "陳豨降將言豨反時，燕王盧綰使人之豨所，與陰謀。",
        "next": "辟陽侯歸，具言綰反有端矣。"
      }
    },
    {
      "id": "s0602",
      "type": "paragraph",
      "chinese": "辟陽侯歸，具言綰反有端矣。",
      "literal": "Marquis of Biyang returned and fully reported that Wan's rebellion had signs.",
      "idiomatic": "The Marquis of Biyang returned and gave a full report that there were clear signs of Wan's rebellion.",
      "context": {
        "previous": "上使辟陽侯迎綰，綰稱病。",
        "next": "二月，使樊噲、周勃將兵擊燕王綰，赦燕吏民與反者。"
      }
    },
    {
      "id": "s0603",
      "type": "paragraph",
      "chinese": "二月，使樊噲、周勃將兵擊燕王綰，赦燕吏民與反者。",
      "literal": "In the second month, they sent Fan Kuai and Zhou Bo to lead troops to strike King Wan of Yan and pardoned the officials and people of Yan who had joined the rebellion.",
      "idiomatic": "In the second month, they dispatched Fan Kuai and Zhou Bo to lead troops against King Wan of Yan, pardoning Yan officials and people who had joined the rebellion.",
      "context": {
        "previous": "辟陽侯歸，具言綰反有端矣。",
        "next": "立皇子建為燕王。"
      }
    },
    {
      "id": "s0604",
      "type": "paragraph",
      "chinese": "立皇子建為燕王。",
      "literal": "They installed the imperial son Jian as King of Yan.",
      "idiomatic": "They installed the emperor's son Jian as King of Yan.",
      "context": {
        "previous": "二月，使樊噲、周勃將兵擊燕王綰，赦燕吏民與反者。"
      }
    },
    {
      "id": "s0605",
      "type": "paragraph",
      "chinese": "高祖擊布時，為流矢所中，行道病。",
      "literal": "When Gao Zu struck Bu, he was hit by a stray arrow; on the road he fell ill.",
      "idiomatic": "While Gao Zu was campaigning against Bu, he was struck by a stray arrow and fell ill on the march.",
      "context": {
        "next": "病甚，呂后迎良醫，醫入見，高祖問醫，醫曰：「病可治。」"
      }
    },
    {
      "id": "s0606",
      "type": "paragraph",
      "chinese": "病甚，呂后迎良醫，醫入見，高祖問醫，醫曰：「病可治。」",
      "literal": "The illness was severe; Empress Lü summoned a good physician; when the physician entered to see him, Gao Zu questioned the physician, who said: \"The illness can be treated.\"",
      "idiomatic": "His illness worsened severely. Empress Lü summoned skilled doctors. When one entered to examine him, Gao Zu asked the physician, who replied: 'Your illness can be cured.'",
      "context": {
        "previous": "高祖擊布時，為流矢所中，行道病。",
        "next": "於是高祖嫚罵之曰：「吾以布衣提三尺劍取天下，此非天命乎？"
      }
    },
    {
      "id": "s0607",
      "type": "paragraph",
      "chinese": "於是高祖嫚罵之曰：「吾以布衣提三尺劍取天下，此非天命乎？",
      "literal": "Thereupon Gao Zu reviled him rudely, saying: \"I with a commoner's cloth raised a three-foot sword and took all under Heaven—is this not the Mandate of Heaven?",
      "idiomatic": "Gao Zu then cursed him angrily: 'I rose from rags, wielding a three-foot sword to conquer the realm. Isn't this Heaven's will?'",
      "context": {
        "previous": "病甚，呂后迎良醫，醫入見，高祖問醫，醫曰：「病可治。」",
        "next": "命乃在天，雖扁鵲何益！」"
      }
    },
    {
      "id": "s0608",
      "type": "paragraph",
      "chinese": "命乃在天，雖扁鵲何益！」",
      "literal": "Fate lies with Heaven—even if it were Bian Que, what benefit would there be!\"",
      "idiomatic": "Destiny is in Heaven's hands. Even the great physician Bian Que couldn't help!'",
      "context": {
        "previous": "於是高祖嫚罵之曰：「吾以布衣提三尺劍取天下，此非天命乎？",
        "next": "遂不使治病，賜金五十斤罷之。"
      }
    },
    {
      "id": "s0609",
      "type": "paragraph",
      "chinese": "遂不使治病，賜金五十斤罷之。",
      "literal": "He then would not allow treatment of the illness, bestowed fifty jin of gold, and dismissed him.",
      "idiomatic": "He refused treatment, gave the doctor fifty jin of gold, and sent him away.",
      "context": {
        "previous": "命乃在天，雖扁鵲何益！」",
        "next": "已而呂后問：「陛下百歲後，蕭相國即死，令誰代之？」"
      }
    },
    {
      "id": "s0610",
      "type": "paragraph",
      "chinese": "已而呂后問：「陛下百歲後，蕭相國即死，令誰代之？」",
      "literal": "Soon after, Empress Lü asked: \"After Your Majesty's hundred years, if Prime Minister Xiao dies, whom should we order to replace him?\"",
      "idiomatic": "Soon after, Empress Lü asked: 'After Your Majesty passes away, if Prime Minister Xiao dies, who should succeed him?'",
      "context": {
        "previous": "遂不使治病，賜金五十斤罷之。",
        "next": "上曰：「曹參可。」"
      }
    },
    {
      "id": "s0611",
      "type": "paragraph",
      "chinese": "上曰：「曹參可。」",
      "literal": "The superior said: \"Cao Can is acceptable.\"",
      "idiomatic": "The emperor replied: 'Cao Can is suitable.'",
      "context": {
        "previous": "已而呂后問：「陛下百歲後，蕭相國即死，令誰代之？」",
        "next": "問其次，上曰：「王陵可。"
      }
    },
    {
      "id": "s0612",
      "type": "paragraph",
      "chinese": "問其次，上曰：「王陵可。",
      "literal": "She asked about the next; the superior said: \"Wang Ling is acceptable.",
      "idiomatic": "She asked about the next in line, and the emperor said: 'Wang Ling is suitable.'",
      "context": {
        "previous": "上曰：「曹參可。」",
        "next": "然陵少憨，陳平可以助之。"
      }
    },
    {
      "id": "s0613",
      "type": "paragraph",
      "chinese": "然陵少憨，陳平可以助之。",
      "literal": "However, Ling is somewhat naive; Chen Ping can assist him.",
      "idiomatic": "But Ling is a bit naive. Chen Ping can help him.'",
      "context": {
        "previous": "問其次，上曰：「王陵可。",
        "next": "陳平智有餘，然難以獨任。"
      }
    },
    {
      "id": "s0614",
      "type": "paragraph",
      "chinese": "陳平智有餘，然難以獨任。",
      "literal": "Chen Ping has intelligence in excess but is difficult to employ alone.",
      "idiomatic": "Chen Ping is very clever but can't be trusted on his own.'",
      "context": {
        "previous": "然陵少憨，陳平可以助之。",
        "next": "周勃重厚少文，然安劉氏者必勃也，可令為太尉。」"
      }
    },
    {
      "id": "s0615",
      "type": "paragraph",
      "chinese": "周勃重厚少文，然安劉氏者必勃也，可令為太尉。」",
      "literal": "Zhou Bo is solid and serious but lacks culture; however, he who will secure the Liu clan will certainly be Bo—you can order him to be Grand Commandant.\"",
      "idiomatic": "Zhou Bo is reliable and steady but unrefined. Yet he is the one who will secure the Liu family. Make him Grand Commandant.''",
      "context": {
        "previous": "陳平智有餘，然難以獨任。",
        "next": "呂后復問其次，上曰：「此後亦非而所知也。」"
      }
    },
    {
      "id": "s0616",
      "type": "paragraph",
      "chinese": "呂后復問其次，上曰：「此後亦非而所知也。」",
      "literal": "Empress Lü again asked about the next; the superior said: \"After this it will also not be what you can know.\"",
      "idiomatic": "Empress Lü pressed for the next name, but the emperor said: 'After these, it's not for you to know.''",
      "context": {
        "previous": "周勃重厚少文，然安劉氏者必勃也，可令為太尉。」"
      }
    },
    {
      "id": "s0618",
      "type": "paragraph",
      "chinese": "盧綰與數千騎居塞下候伺，幸上病愈自入謝。",
      "literal": "Lu Wan with several thousand cavalry remained below the frontier passes waiting and watching, hoping the superior's illness would improve so he could come in himself to apologize.",
      "idiomatic": "Lu Wan waited at the frontier with several thousand cavalry, hoping the emperor would recover so he could come in person to apologize.",
      "context": {}
    },
    {
      "id": "s0619",
      "type": "paragraph",
      "chinese": "四月甲辰，高祖崩長樂宮。",
      "literal": "On the jiachen day of the fourth month, Gao Zu died at Changle Palace.",
      "idiomatic": "On the jiachen day of the fourth month, Emperor Gaozu passed away in Changle Palace.",
      "context": {
        "next": "四日不發喪。"
      }
    },
    {
      "id": "s0620",
      "type": "paragraph",
      "chinese": "四日不發喪。",
      "literal": "For four days they did not announce the death.",
      "idiomatic": "They kept his death secret for four days.",
      "context": {
        "previous": "四月甲辰，高祖崩長樂宮。",
        "next": "呂后與審食其謀曰：「諸將與帝為編戶民，今北面為臣，此常怏怏，今乃事少主，非盡族是，天下不安。」"
      }
    },
    {
      "id": "s0621",
      "type": "paragraph",
      "chinese": "呂后與審食其謀曰：「諸將與帝為編戶民，今北面為臣，此常怏怏，今乃事少主，非盡族是，天下不安。」",
      "literal": "Empress Lü plotted with Shen Yiji, saying: \"The various generals were registered household commoners with the Emperor; now they face north as ministers—they are constantly resentful; now they will serve a young lord—unless we completely exterminate the clans, all under Heaven will not be secure.\"",
      "idiomatic": "Empress Lü conspired with Shen Yiji: 'The generals were once commoners like the emperor. Now they bow to him as subjects and harbor constant resentment. Serving a young ruler will be unbearable. Unless we wipe out their entire clans, the realm will never be safe.'",
      "context": {
        "previous": "四日不發喪。",
        "next": "人或聞之，語酈將軍。"
      }
    },
    {
      "id": "s0622",
      "type": "paragraph",
      "chinese": "人或聞之，語酈將軍。",
      "literal": "Someone heard this and told General Li.",
      "idiomatic": "Someone overheard this and informed General Li.",
      "context": {
        "previous": "呂后與審食其謀曰：「諸將與帝為編戶民，今北面為臣，此常怏怏，今乃事少主，非盡族是，天下不安。」",
        "next": "酈將軍往見審食其，曰：「吾聞帝已崩，四日不發喪，欲誅諸將。"
      }
    },
    {
      "id": "s0623",
      "type": "paragraph",
      "chinese": "酈將軍往見審食其，曰：「吾聞帝已崩，四日不發喪，欲誅諸將。",
      "literal": "General Li went to see Shen Yiji and said: \"I have heard the Emperor has already died; for four days the death has not been announced because you wish to execute the various generals.",
      "idiomatic": "General Li went to see Shen Yiji and said: 'I've heard the emperor has passed away. You've kept it secret for four days because you plan to execute the generals.'",
      "context": {
        "previous": "人或聞之，語酈將軍。",
        "next": "誠如此，天下危矣。"
      }
    },
    {
      "id": "s0624",
      "type": "paragraph",
      "chinese": "誠如此，天下危矣。",
      "literal": "If this is true, all under Heaven is in danger.",
      "idiomatic": "If this is true, the empire is in grave danger.'",
      "context": {
        "previous": "酈將軍往見審食其，曰：「吾聞帝已崩，四日不發喪，欲誅諸將。",
        "next": "陳平、灌嬰將十萬守滎陽，樊噲、周勃將二十萬定燕、代，此聞帝崩，諸將皆誅，必連兵還鄉以攻關中。"
      }
    },
    {
      "id": "s0625",
      "type": "paragraph",
      "chinese": "陳平、灌嬰將十萬守滎陽，樊噲、周勃將二十萬定燕、代，此聞帝崩，諸將皆誅，必連兵還鄉以攻關中。",
      "literal": "Chen Ping and Guan Ying command a hundred thousand defending Yingyang; Fan Kuai and Zhou Bo command two hundred thousand settling Yan and Dai—if they hear the Emperor has died and all generals are to be executed, they will certainly unite their troops and return to their native regions to attack Guanzhong.",
      "idiomatic": "Chen Ping and Guan Ying command 100,000 troops defending Yingyang; Fan Kuai and Zhou Bo lead 200,000 pacifying Yan and Dai. If they hear the emperor is dead and all generals are to be executed, they'll surely join forces and march home to attack Guanzhong.'",
      "context": {
        "previous": "誠如此，天下危矣。",
        "next": "大臣內叛，諸侯外反，亡可翹足而待也。」"
      }
    },
    {
      "id": "s0626",
      "type": "paragraph",
      "chinese": "大臣內叛，諸侯外反，亡可翹足而待也。」",
      "literal": "Great ministers rebel internally, feudal lords rebel externally—destruction can be expected in the time it takes to raise a foot.\"",
      "idiomatic": "The ministers will revolt from within, the lords from without. Disaster will follow in the blink of an eye.''",
      "context": {
        "previous": "陳平、灌嬰將十萬守滎陽，樊噲、周勃將二十萬定燕、代，此聞帝崩，諸將皆誅，必連兵還鄉以攻關中。",
        "next": "審食其入言之，乃以丁未發喪，大赦天下。"
      }
    },
    {
      "id": "s0627",
      "type": "paragraph",
      "chinese": "審食其入言之，乃以丁未發喪，大赦天下。",
      "literal": "Shen Yiji went in and spoke; they then announced the death on the dingwei day and granted a great amnesty to all under Heaven.",
      "idiomatic": "Shen Yiji went in and reported this. On the dingwei day they announced the emperor's death and granted a general amnesty throughout the realm.",
      "context": {
        "previous": "大臣內叛，諸侯外反，亡可翹足而待也。」"
      }
    },
    {
      "id": "s0628",
      "type": "paragraph",
      "chinese": "盧綰聞高祖崩，遂亡入匈奴。",
      "literal": "Lu Wan heard Gao Zu had died and then fled and entered the Xiongnu.",
      "idiomatic": "When Lu Wan heard that Gaozu had died, he fled to the Xiongnu.",
      "context": {}
    },
    {
      "id": "s0629",
      "type": "paragraph",
      "chinese": "丙寅，葬。",
      "literal": "On the bingyin day, they buried him.",
      "idiomatic": "On the bingyin day, he was buried.",
      "context": {
        "next": "己巳，立太子，至太上皇廟。"
      }
    },
    {
      "id": "s0630",
      "type": "paragraph",
      "chinese": "己巳，立太子，至太上皇廟。",
      "literal": "On the jisi day, they installed the Crown Prince at the Grand Supreme Sovereign's temple.",
      "idiomatic": "On the jisi day, the crown prince was installed as emperor at the temple of the Grand Supreme Sovereign.",
      "context": {
        "previous": "丙寅，葬。",
        "next": "群臣皆曰：「高祖起微細，撥亂世反之正，平定天下，為漢太祖，功最高。」"
      }
    },
    {
      "id": "s0631",
      "type": "paragraph",
      "chinese": "群臣皆曰：「高祖起微細，撥亂世反之正，平定天下，為漢太祖，功最高。」",
      "literal": "The assembled ministers all said: \"Gao Zu arose from humble and minor beginnings, overturned the chaotic age and returned it to rightness, pacified all under Heaven—he is the Grand Ancestor of Han with the highest achievements.\"",
      "idiomatic": "All the ministers declared: 'Gaozu rose from obscurity, brought order to a chaotic era, and pacified the realm. He is the Grand Ancestor of Han, whose merits are unmatched.'",
      "context": {
        "previous": "己巳，立太子，至太上皇廟。",
        "next": "上尊號為高皇帝。"
      }
    },
    {
      "id": "s0632",
      "type": "paragraph",
      "chinese": "上尊號為高皇帝。",
      "literal": "They presented the honored title of High Emperor.",
      "idiomatic": "They honored him with the title of High Emperor.",
      "context": {
        "previous": "群臣皆曰：「高祖起微細，撥亂世反之正，平定天下，為漢太祖，功最高。」",
        "next": "太子襲號為皇帝，孝惠帝也。"
      }
    },
    {
      "id": "s0633",
      "type": "paragraph",
      "chinese": "太子襲號為皇帝，孝惠帝也。",
      "literal": "The Crown Prince inherited the title as Emperor—this is Emperor Xiaohui.",
      "idiomatic": "The crown prince succeeded to the imperial throne as Emperor Xiaohui.",
      "context": {
        "previous": "上尊號為高皇帝。",
        "next": "令郡國諸侯各立高祖廟，以歲時祠。"
      }
    },
    {
      "id": "s0634",
      "type": "paragraph",
      "chinese": "令郡國諸侯各立高祖廟，以歲時祠。",
      "literal": "He ordered the commanderies, states, and feudal lords to each establish a temple to Gao Zu to make offerings at the proper seasonal times.",
      "idiomatic": "He commanded all commanderies, states, and lords to establish temples to Gaozu for seasonal sacrifices.",
      "context": {
        "previous": "太子襲號為皇帝，孝惠帝也。"
      }
    },
    {
      "id": "s0635",
      "type": "paragraph",
      "chinese": "及孝惠五年，思高祖之悲樂沛，以沛宮為高祖原廟。",
      "literal": "When in the fifth year of Emperor Xiaohui they recalled Gao Zu's grief and joy at Pei, they made Pei Palace the original temple of Gao Zu.",
      "idiomatic": "In the fifth year of Emperor Xiaohui's reign, they commemorated Gaozu's bittersweet memories of Pei by designating Pei Palace as his ancestral temple.",
      "context": {
        "next": "高祖所教歌兒百二十人，皆令為吹樂，後有缺，輒補之。"
      }
    },
    {
      "id": "s0636",
      "type": "paragraph",
      "chinese": "高祖所教歌兒百二十人，皆令為吹樂，後有缺，輒補之。",
      "literal": "The one hundred twenty boys Gao Zu had taught to sing were all ordered to perform music; when later there were vacancies, they would always fill them.",
      "idiomatic": "The 120 boys Gaozu had taught to sing were all assigned to perform music; whenever openings occurred later, they were immediately filled.",
      "context": {
        "previous": "及孝惠五年，思高祖之悲樂沛，以沛宮為高祖原廟。"
      }
    },
    {
      "id": "s0637",
      "type": "paragraph",
      "chinese": "高帝八男：長庶齊悼惠王肥；",
      "literal": "The High Emperor had eight sons: the eldest, Concubine-born King Dao Hui of Qi, Fei;",
      "idiomatic": "Emperor Gaozu had eight sons: his eldest, born of a concubine, was Fei, King Daohui of Qi;",
      "context": {
        "next": "次孝惠，呂后子；"
      }
    },
    {
      "id": "s0638",
      "type": "paragraph",
      "chinese": "次孝惠，呂后子；",
      "literal": "next Emperor Xiaohui, son of Empress Lü;",
      "idiomatic": "next came Emperor Xiaohui, Empress Lü's son;",
      "context": {
        "previous": "高帝八男：長庶齊悼惠王肥；",
        "next": "次戚夫人子趙隱王如意；"
      }
    },
    {
      "id": "s0639",
      "type": "paragraph",
      "chinese": "次戚夫人子趙隱王如意；",
      "literal": "next Consort Qi's son King Yin of Zhao, Ruyi;",
      "idiomatic": "next was Ruyi, Consort Qi's son and King Yin of Zhao;",
      "context": {
        "previous": "次孝惠，呂后子；",
        "next": "次代王恒，已立為孝文帝，薄太后子；"
      }
    },
    {
      "id": "s0640",
      "type": "paragraph",
      "chinese": "次代王恒，已立為孝文帝，薄太后子；",
      "literal": "next King Heng of Dai, who was installed as Emperor Xiaowen, son of Grand Empress Dowager Bo;",
      "idiomatic": "next was Heng, King of Dai, who later became Emperor Xiaowen—son of Grand Empress Dowager Bo;",
      "context": {
        "previous": "次戚夫人子趙隱王如意；",
        "next": "次梁王恢，呂太后時徙為趙共王；"
      }
    },
    {
      "id": "s0641",
      "type": "paragraph",
      "chinese": "次梁王恢，呂太后時徙為趙共王；",
      "literal": "next King Hui of Liang, who in Empress Lü's time was moved to be King Gong of Zhao;",
      "idiomatic": "next was Hui, King of Liang, who during Empress Lü's reign was transferred to become King Gong of Zhao;",
      "context": {
        "previous": "次代王恒，已立為孝文帝，薄太后子；",
        "next": "次淮陽王友，呂太后時徙為趙幽王；"
      }
    },
    {
      "id": "s0642",
      "type": "paragraph",
      "chinese": "次淮陽王友，呂太后時徙為趙幽王；",
      "literal": "next King You of Huaiyang, who in Empress Lü's time was moved to be King You of Zhao;",
      "idiomatic": "next was You, King of Huaiyang, who during Empress Lü's reign was transferred to become King You of Zhao;",
      "context": {
        "previous": "次梁王恢，呂太后時徙為趙共王；",
        "next": "次淮南厲王長；"
      }
    },
    {
      "id": "s0643",
      "type": "paragraph",
      "chinese": "次淮南厲王長；",
      "literal": "next King Li of Huainan, Chang;",
      "idiomatic": "next was Chang, King Li of Huainan;",
      "context": {
        "previous": "次淮陽王友，呂太后時徙為趙幽王；",
        "next": "次燕王建。"
      }
    },
    {
      "id": "s0644",
      "type": "paragraph",
      "chinese": "次燕王建。",
      "literal": "next King Jian of Yan.",
      "idiomatic": "and finally Jian, King of Yan.",
      "context": {
        "previous": "次淮南厲王長；"
      }
    },
    {
      "id": "s0645",
      "type": "paragraph",
      "chinese": "太史公曰：夏之政忠。",
      "literal": "The Grand Historian says: The governance of Xia was loyal.",
      "idiomatic": "The Grand Historian remarks: The Xia dynasty's governance emphasized loyalty.",
      "context": {
        "next": "忠之敝，小人以野，故殷人承之以敬。"
      }
    },
    {
      "id": "s0646",
      "type": "paragraph",
      "chinese": "忠之敝，小人以野，故殷人承之以敬。",
      "literal": "When loyalty became corrupt, petty men became crude; therefore the Yin people succeeded it with reverence.",
      "idiomatic": "But when loyalty decayed, small-minded people grew boorish; thus the Yin succeeded it with reverence.",
      "context": {
        "previous": "太史公曰：夏之政忠。",
        "next": "敬之敝，小人以鬼，故周人承之以文。"
      }
    },
    {
      "id": "s0647",
      "type": "paragraph",
      "chinese": "敬之敝，小人以鬼，故周人承之以文。",
      "literal": "When reverence became corrupt, petty men became superstitious; therefore the Zhou people succeeded it with culture.",
      "idiomatic": "When reverence decayed, small-minded people became obsessed with spirits; thus the Zhou succeeded it with ritual propriety.",
      "context": {
        "previous": "忠之敝，小人以野，故殷人承之以敬。",
        "next": "文之敝，小人以僿，故救僿莫若以忠。"
      }
    },
    {
      "id": "s0648",
      "type": "paragraph",
      "chinese": "文之敝，小人以僿，故救僿莫若以忠。",
      "literal": "When culture becomes corrupt, petty men become deceitful; therefore to rescue deceit nothing is better than loyalty.",
      "idiomatic": "When ritual propriety decays, small-minded people become deceitful; thus to cure deceit, nothing works better than loyalty.",
      "context": {
        "previous": "敬之敝，小人以鬼，故周人承之以文。",
        "next": "三王之道若循環，終而復始。"
      }
    },
    {
      "id": "s0649",
      "type": "paragraph",
      "chinese": "三王之道若循環，終而復始。",
      "literal": "The Way of the Three Kings is like a cycle, ending and beginning again.",
      "idiomatic": "The Way of the Three Kings moves in cycles, ending only to begin anew.",
      "context": {
        "previous": "文之敝，小人以僿，故救僿莫若以忠。",
        "next": "周秦之閒，可謂文敝矣。"
      }
    },
    {
      "id": "s0650",
      "type": "paragraph",
      "chinese": "周秦之閒，可謂文敝矣。",
      "literal": "Between Zhou and Qin, it can be said culture had become corrupt.",
      "idiomatic": "Between the Zhou and Qin dynasties, ritual had clearly decayed.",
      "context": {
        "previous": "三王之道若循環，終而復始。",
        "next": "秦政不改，反酷刑法，豈不繆乎？"
      }
    },
    {
      "id": "s0651",
      "type": "paragraph",
      "chinese": "秦政不改，反酷刑法，豈不繆乎？",
      "literal": "Qin's governance did not reform but instead made laws and punishments harsh—was this not mistaken?",
      "idiomatic": "Qin's rule refused to change, instead making laws and punishments ever harsher—was this not a grave error?",
      "context": {
        "previous": "周秦之閒，可謂文敝矣。",
        "next": "故漢興，承敝易變，使人不倦，得天統矣。"
      }
    },
    {
      "id": "s0652",
      "type": "paragraph",
      "chinese": "故漢興，承敝易變，使人不倦，得天統矣。",
      "literal": "Therefore when Han arose, inheriting corruption and changing easily, it made people untiring and obtained Heaven's succession.",
      "idiomatic": "Thus when Han rose to power, inheriting the corrupt ways but changing them readily, it energized the people and gained Heaven's mandate.",
      "context": {
        "previous": "秦政不改，反酷刑法，豈不繆乎？",
        "next": "朝以十月。"
      }
    },
    {
      "id": "s0653",
      "type": "paragraph",
      "chinese": "朝以十月。",
      "literal": "Court audiences were held in the tenth month.",
      "idiomatic": "He held court audiences in the tenth month.",
      "context": {
        "previous": "故漢興，承敝易變，使人不倦，得天統矣。",
        "next": "車服黃屋左纛。"
      }
    },
    {
      "id": "s0654",
      "type": "paragraph",
      "chinese": "車服黃屋左纛。",
      "literal": "Chariots and regalia used yellow canopies with left-side banners.",
      "idiomatic": "His chariots and ceremonial robes featured yellow canopies with banners on the left.",
      "context": {
        "previous": "朝以十月。",
        "next": "葬長陵。"
      }
    },
    {
      "id": "s0655",
      "type": "paragraph",
      "chinese": "葬長陵。",
      "literal": "He was buried at Changling.",
      "idiomatic": "He was buried at Changling Mausoleum.",
      "context": {
        "previous": "車服黃屋左纛。"
      }
    }
  ]
}