{
  "s0001": "Tang Shu Yu of Jin was the son of King Wu of Zhou and younger brother of King Cheng.",
  "s0002": "Once, when King Wu's wife was pregnant with Shu Yu, she dreamed that Heaven told King Wu: 'I command you to give birth to a son named Yu, and I grant him Tang.'",
  "s0003": "When the child was born, the character 'Yu' was written on his hand, so they named him Yu as the dream had commanded.",
  "s0004": "When King Wu died and King Cheng ascended the throne, Tang rebelled, so the Duke of Zhou executed and extinguished the Tang state.",
  "s0005": "King Cheng was playing with Shu Yu and cut a paulownia leaf into the shape of a jade tablet, saying: 'With this I enfeoff you.'",
  "s0006": "Shi Yi therefore requested that they choose an auspicious day to establish Shu Yu as ruler.",
  "s0007": "King Cheng said: 'I was only playing with him.'",
  "s0008": "Shi Yi replied: 'The Son of Heaven does not make frivolous statements.",
  "s0009": "Whatever he says gets recorded by the historians, formalized by ritual, and celebrated in music.'",
  "s0010": "Thus Shu Yu was enfeoffed at Tang.",
  "s0011": "Tang was located east of the Yellow River and Fen River, covering a square area of one hundred li, which is why he was called Tang Shu Yu.",
  "s0012": "He belonged to the Ji clan and was styled Zi Yu.",
  "s0013": "Tang Shu's son was Xie, who became the Marquis of Jin.",
  "s0014": "The Marquis of Jin's son was Ning Zu, who became Marquis Wu.",
  "s0015": "Marquis Wu's son was Fu Ren, who became Marquis Cheng.",
  "s0016": "Marquis Cheng's son was Fu, who became Marquis Li.",
  "s0017": "Marquis Li's son was Yi Jiu, who became Marquis Jing.",
  "s0018": "From Marquis Jing onward, the chronology can be reconstructed.",
  "s0019": "From Tang Shu to Marquis Jing was five generations, but no specific years are recorded for them.",
  "s0020": "In the seventeenth year of Marquis Jing's reign, King Li of Zhou was confused and tyrannical, so the people rose up in rebellion, King Li fled to Zhi, and the ministers administered the government, which was called the 'Republican' period.",
  "s0021": "In the eighteenth year, Marquis Jing died, and his son Xi Hou Si Tu ascended the throne.",
  "s0022": "In the fourteenth year of Xi Hou's reign, King Xuan of Zhou ascended the throne.",
  "s0023": "In the eighteenth year, Xi Hou died, and his son Xian Hou Ji ascended the throne.",
  "s0024": "In the eleventh year, Xian Hou died, and his son Mu Hou Fei Wang ascended the throne.",
  "s0025": "In the fourth year of Mu Hou's reign, he took a daughter of the Jiang clan from Qi as his wife.",
  "s0026": "In the seventh year, he attacked the state of Tiao.",
  "s0027": "He fathered the crown prince Qiu.",
  "s0028": "In the tenth year, he attacked Qian Mu and achieved merit.",
  "s0029": "He fathered a younger son named Cheng Shi.",
  "s0030": "The Jin official Shi Fu said: 'How ominous! The lord names his sons this way!",
  "s0031": "The crown prince is named Qiu, which means enemy.",
  "s0032": "The younger son is named Cheng Shi, which means one who completes it - a great title.",
  "s0033": "Names are self-fulfilling prophecies;",
  "s0034": "things determine their own nature.",
  "s0035": "Now the legitimate and illegitimate sons have names that contradict each other - this bodes ill for Jin's future, for there will surely be no peace.'",
  "s0037": "In the twenty-seventh year, Mu Hou died, and his younger brother Shang Shu usurped the throne, while Crown Prince Qiu fled into exile.",
  "s0038": "In the third year of Shang Shu's reign, King Xuan of Zhou died.",
  "s0039": "In the fourth year, Mu Hou's Crown Prince Qiu led his followers, attacked Shang Shu, and ascended the throne as Wen Hou.",
  "s0040": "In the tenth year of Wen Hou's reign, King You of Zhou was without virtue, the Quanrong killed King You, and Zhou moved eastward.",
  "s0041": "Qin Xiang Gong began to be ranked among the feudal lords.",
  "s0042": "In the thirty-fifth year, Wen Hou Qiu died, and his son Zhao Hou Bo ascended the throne.",
  "s0043": "In the first year of Zhao Hou's reign, he enfeoffed Wen Hou's younger brother Cheng Shi at Quwo.",
  "s0044": "The city of Quwo was larger than Yi.",
  "s0045": "Yi was the capital city of the Jin lord.",
  "s0046": "Cheng Shi was enfeoffed at Quwo with the title of Huan Shu.",
  "s0047": "Jing Hou's concubine-born grandson Luan Bin assisted Huan Shu.",
  "s0048": "At this time, Huan Shu was fifty-eight years old, virtuous in nature, and all the people of Jin attached themselves to him.",
  "s0049": "The gentleman said: 'The disorder in Jin will arise from Quwo.",
  "s0050": "When the branch becomes larger than the root and wins the people's hearts, disorder is inevitable.'"
}