{
  "chapter": "012",
  "book": "shiji",
  "extractedAt": "2025-12-28T20:37:37.965Z",
  "translations": [
    {
      "id": "s0001",
      "type": "paragraph",
      "chinese": "孝武皇帝者，孝景中子也。",
      "literal": "Filial Wu emperor, Filial Jing middle son also.",
      "idiomatic": "Emperor Wu was the middle son of Emperor Jing.",
      "context": {
        "next": "母曰王太后。"
      }
    },
    {
      "id": "s0002",
      "type": "paragraph",
      "chinese": "母曰王太后。",
      "literal": "Mother called Wang Empress Dowager.",
      "idiomatic": "His mother was called Empress Wang.",
      "context": {
        "previous": "孝武皇帝者，孝景中子也。",
        "next": "孝景四年，以皇子為膠東王。"
      }
    },
    {
      "id": "s0003",
      "type": "paragraph",
      "chinese": "孝景四年，以皇子為膠東王。",
      "literal": "Filial Jing fourth year, with imperial son as Jiaodong King.",
      "idiomatic": "In the fourth year of Emperor Jing, he was made King of Jiaodong as an imperial son.",
      "context": {
        "previous": "母曰王太后。",
        "next": "孝景七年，栗太子廢為臨江王，以膠東王為太子。"
      }
    },
    {
      "id": "s0004",
      "type": "paragraph",
      "chinese": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
      "literal": "Filial Jing seventh year, Li Crown Prince deposed as Linjiang King, with Jiaodong King as Crown Prince.",
      "idiomatic": "In the seventh year of Emperor Jing, Crown Prince Li was deposed as King of Linjiang, and the King of Jiaodong was made Crown Prince.",
      "context": {
        "previous": "孝景四年，以皇子為膠東王。",
        "next": "孝景十六年崩，太子即位，為孝武皇帝。"
      }
    },
    {
      "id": "s0005",
      "type": "paragraph",
      "chinese": "孝景十六年崩，太子即位，為孝武皇帝。",
      "literal": "Filial Jing sixteenth year collapsed, Crown Prince ascended throne, became Filial Wu emperor.",
      "idiomatic": "In the sixteenth year of Emperor Jing, he collapsed, and the Crown Prince ascended the throne, becoming Emperor Wu.",
      "context": {
        "previous": "孝景七年，栗太子廢為臨江王，以膠東王為太子。",
        "next": "孝武皇帝初即位，尤敬鬼神之祀。"
      }
    },
    {
      "id": "s0006",
      "type": "paragraph",
      "chinese": "孝武皇帝初即位，尤敬鬼神之祀。",
      "literal": "Filial Wu emperor initial ascension, especially respected ghosts spirits sacrifices.",
      "idiomatic": "When Emperor Wu first ascended the throne, he especially respected the sacrifices to ghosts and spirits.",
      "context": {
        "previous": "孝景十六年崩，太子即位，為孝武皇帝。"
      }
    },
    {
      "id": "s0007",
      "type": "paragraph",
      "chinese": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
      "literal": "First year, Han rising already sixty remaining years, realm pacified peaceful, scholar official kind all hoped Son of Heaven fengshan correct calendar measures.",
      "idiomatic": "In the first year, the Han dynasty had already risen for over sixty years, the realm was pacified and peaceful, and all the scholar-officials hoped the Son of Heaven would perform the fengshan ceremony and correct the calendar and measures.",
      "context": {
        "next": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。"
      }
    },
    {
      "id": "s0008",
      "type": "paragraph",
      "chinese": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
      "literal": "And emperor favored Confucian arts, recruited worthy good, Zhao Wan, Wang Zang etc. with literature as ministers, wished discuss ancient establish Bright Hall south of city, to receive feudal lords.",
      "idiomatic": "Yet the emperor favored Confucian learning, recruited worthy and good men, made Zhao Wan, Wang Zang, and others ministers based on their literary accomplishments, and wished to discuss the ancient practice of establishing a Bright Hall south of the capital to receive the feudal lords.",
      "context": {
        "previous": "元年，漢興已六十餘歲矣，天下乂安，薦紳之屬皆望天子封禪改正度也。",
        "next": "草巡狩封禪改歷服色事未就。"
      }
    },
    {
      "id": "s0009",
      "type": "paragraph",
      "chinese": "草巡狩封禪改歷服色事未就。",
      "literal": "Draft imperial tours fengshan change calendar clothing colors matters not completed.",
      "idiomatic": "In the first year, Han had already risen for over sixty years, the realm was peaceful and secure, and the gentlemen and officials all hoped the Son of Heaven would perform the Feng and Shan sacrifices and reform the calendar and ritual colors.",
      "context": {
        "previous": "而上鄉儒術，招賢良，趙綰、王臧等以文學為公卿，欲議古立明堂城南，以朝諸侯。",
        "next": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。"
      }
    },
    {
      "id": "s0010",
      "type": "paragraph",
      "chinese": "會竇太后治黃老言，不好儒術，使人微得趙綰等姦利事，召案綰、臧，綰、臧自殺，諸所興為者皆廢。",
      "literal": "Met Empress Dowager Dou governed Huang Lao teachings, not liked Confucian arts, made person secretly obtained Zhao Wan etc. illicit profit matters, summoned investigated Wan, Zang, Wan, Zang committed suicide, all things they promoted all abolished.",
      "idiomatic": "Yet encountering the Empress Dowager Dou practicing the teachings of Huangdi and Laozi, disliking Confucian learning, she sent people to secretly obtain evidence of crimes by Zhao Wan and others, and summoned and interrogated Zhao Wan and Wang Zang, who then committed suicide. All the institutions they had established were abolished.",
      "context": {
        "previous": "草巡狩封禪改歷服色事未就。"
      }
    },
    {
      "id": "s0011",
      "type": "paragraph",
      "chinese": "後六年，竇太后崩。",
      "literal": "After six years, Dou Empress Dowager collapsed.",
      "idiomatic": "After six years, Empress Dowager Dou passed away.",
      "context": {
        "next": "其明年，上徵文學之士公孫弘等。"
      }
    },
    {
      "id": "s0012",
      "type": "paragraph",
      "chinese": "其明年，上徵文學之士公孫弘等。",
      "literal": "Next year, emperor summoned literature scholars Gongsun Hong etc.",
      "idiomatic": "In the following year, the emperor raised up scholars of literature such as Gongsun Hong.",
      "context": {
        "previous": "後六年，竇太后崩。"
      }
    },
    {
      "id": "s0013",
      "type": "paragraph",
      "chinese": "明年，上初至雍，郊見五畤。",
      "literal": "Next year, emperor first arrived Yong, suburban audience five altars.",
      "idiomatic": "For over ten years the emperor did not speak of performing the Feng and Shan sacrifices.",
      "context": {
        "next": "後常三歲一郊。"
      }
    },
    {
      "id": "s0014",
      "type": "paragraph",
      "chinese": "後常三歲一郊。",
      "literal": "Afterwards regularly three years one suburban sacrifice.",
      "idiomatic": "Afterwards there was regular performance of sacrifices every three years.",
      "context": {
        "previous": "明年，上初至雍，郊見五畤。",
        "next": "是時上求神君，捨之上林中蹄氏觀。"
      }
    },
    {
      "id": "s0015",
      "type": "paragraph",
      "chinese": "是時上求神君，捨之上林中蹄氏觀。",
      "literal": "This time emperor sought divine lord, lodged in Shanglin middle Ti clan observation.",
      "idiomatic": "The Spirit Lord said: \"You do not need to worry about your illness.",
      "context": {
        "previous": "後常三歲一郊。",
        "next": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。"
      }
    },
    {
      "id": "s0016",
      "type": "paragraph",
      "chinese": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
      "literal": "Divine lord, Changling woman, because son died sorrowful sorrow, therefore saw spirit at husband Wan Ruo.",
      "idiomatic": "The Spirit Lord was from Pingyang, a woman whose child had died and who grieved bitterly, thus seeing a spirit in the form of her late husband in Pingyang's Wansui district.",
      "context": {
        "previous": "是時上求神君，捨之上林中蹄氏觀。",
        "next": "宛若祠之其室，民多往祠。"
      }
    },
    {
      "id": "s0017",
      "type": "paragraph",
      "chinese": "宛若祠之其室，民多往祠。",
      "literal": "Wan Ruo sacrificed to her room, people many went sacrificed.",
      "idiomatic": "The people worshiped her at her house, and many came to worship.",
      "context": {
        "previous": "神君者，長陵女子，以子死悲哀，故見神於先後宛若。",
        "next": "平原君往祠，其後子孫以尊顯。"
      }
    },
    {
      "id": "s0018",
      "type": "paragraph",
      "chinese": "平原君往祠，其後子孫以尊顯。",
      "literal": "Pingyuan Jun went sacrificed, his later descendants with honor illustrious.",
      "idiomatic": "The Pingyuan Lord went to worship, and his descendants became honored and eminent.",
      "context": {
        "previous": "宛若祠之其室，民多往祠。",
        "next": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。"
      }
    },
    {
      "id": "s0019",
      "type": "paragraph",
      "chinese": "及武帝即位，則厚禮置祠之內中，聞其言，不見其人云。",
      "literal": "When Wudi ascended throne, then thick ritual placed sacrifice in inner palace, heard her words, not saw her person say.",
      "idiomatic": "When Emperor Wu ascended the throne, he honored her greatly and set up shrines for her within the palace, hearing her words but not seeing her person.",
      "context": {
        "previous": "平原君往祠，其後子孫以尊顯。"
      }
    },
    {
      "id": "s0020",
      "type": "paragraph",
      "chinese": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
      "literal": "This time Li Shaogun also with sacrificed stove, grain way, dispel old methods saw emperor, emperor honored him.",
      "idiomatic": "At this time, Li Shaojun also served the emperor by conducting sacrifices to the stove, grain spirits, and methods of reversing age, and the emperor honored him.",
      "context": {
        "next": "少君者，故深澤侯入以主方。"
      }
    },
    {
      "id": "s0021",
      "type": "paragraph",
      "chinese": "少君者，故深澤侯入以主方。",
      "literal": "Shaogun, former Shenze Hou person with main methods.",
      "idiomatic": "The emperor was pleased and ordered the Grand Master of Ceremonies to conduct sacrifices to the Supreme One in the southeast suburbs, using great sacrificial victims, for seven days.",
      "context": {
        "previous": "是時而李少君亦以祠灶、穀道、卻老方見上，上尊之。",
        "next": "匿其年及所生長，常自謂七十，能使物，卻老。"
      }
    },
    {
      "id": "s0022",
      "type": "paragraph",
      "chinese": "匿其年及所生長，常自謂七十，能使物，卻老。",
      "literal": "Concealed his age and place grown up, often self called seventy, able make things, dispel old.",
      "idiomatic": "Li Shaojun concealed his age and origins, always claiming to be seventy, able to make things appear and reverse age.",
      "context": {
        "previous": "少君者，故深澤侯入以主方。",
        "next": "其游以方遍諸侯。"
      }
    },
    {
      "id": "s0023",
      "type": "paragraph",
      "chinese": "其游以方遍諸侯。",
      "literal": "His travels with methods everywhere feudal lords.",
      "idiomatic": "Everyone regarded him as wealthy despite not managing property, and even more believed him, contending to serve him.",
      "context": {
        "previous": "匿其年及所生長，常自謂七十，能使物，卻老。",
        "next": "無妻子。"
      }
    },
    {
      "id": "s0024",
      "type": "paragraph",
      "chinese": "無妻子。",
      "literal": "No wife children.",
      "idiomatic": "He had no wife or children.",
      "context": {
        "previous": "其游以方遍諸侯。",
        "next": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。"
      }
    },
    {
      "id": "s0025",
      "type": "paragraph",
      "chinese": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
      "literal": "People heard his ability make things and immortality, moreover fed sent him, often surplus gold money silks clothing food.",
      "idiomatic": "Li Shaojun went to see the emperor, and the emperor had an ancient bronze vessel which he showed to Li Shaojun.",
      "context": {
        "previous": "無妻子。",
        "next": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。"
      }
    },
    {
      "id": "s0026",
      "type": "paragraph",
      "chinese": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
      "literal": "People all considered not managed estates yet abundant supply, moreover not knew his what came from, even more believed, contended served him.",
      "idiomatic": "Li Shaojun spoke to the emperor saying: \"Sacrificing to the stove will cause things to appear, causing them to appear will make cinnabar transform into gold, gold made into drinking vessels will prolong life, prolonging life and the Penglai immortals in the sea can be seen, seeing them allows Feng and Shan sacrifices, the Yellow Emperor is such a case.\"",
      "context": {
        "previous": "人聞其能使物及不死，更饋遺之，常餘金錢帛衣食。",
        "next": "少君資好方，善為巧發奇中。"
      }
    },
    {
      "id": "s0027",
      "type": "paragraph",
      "chinese": "少君資好方，善為巧發奇中。",
      "literal": "Shaogun natural good methods, skilled at clever revelation marvelous hits.",
      "idiomatic": "Thereupon the emperor began to personally sacrifice to the stove and sent fangshi to enter the sea seeking Penglai and Anqi Sheng and their like, and thus affairs began of refining cinnabar and other substances into gold.",
      "context": {
        "previous": "人皆以為不治產業而饒給，又不知其何所人，愈信，爭事之。",
        "next": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。"
      }
    },
    {
      "id": "s0028",
      "type": "paragraph",
      "chinese": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
      "literal": "Once followed Wuan Hou drank, seated had ninety remaining years old man, Shaogun then spoke with his grandfather toured shot places, old man as child time followed his grandfather went, recognized those places, one gathering all astonished.",
      "idiomatic": "After a long time, Li Shaojun fell ill and died.",
      "context": {
        "previous": "少君資好方，善為巧發奇中。",
        "next": "少君見上，上有故銅器，問少君。"
      }
    },
    {
      "id": "s0029",
      "type": "paragraph",
      "chinese": "少君見上，上有故銅器，問少君。",
      "literal": "Shaogun saw emperor, emperor had old bronze vessel, asked Shaogun.",
      "idiomatic": "Li Shaojun said to the emperor: \"Sacrifice to the stove and things will appear, things appearing will make cinnabar transform into gold, gold made into drinking vessels will prolong life, prolonging life and the Penglai immortals in the sea can be seen, seeing them allows Feng and Shan sacrifices, the Yellow Emperor is such a case.\"",
      "context": {
        "previous": "嘗從武安侯飲，坐中有年九十餘老人，少君乃言與其大父游射處，老人為兒時從其大父行，識其處，一坐盡驚。",
        "next": "少君曰：「此器齊桓公十年陳於柏寢。」"
      }
    },
    {
      "id": "s0030",
      "type": "paragraph",
      "chinese": "少君曰：「此器齊桓公十年陳於柏寢。」",
      "literal": "Shaogun said: 'This vessel Qi Huan Gong tenth year displayed at Bo resting place.'",
      "idiomatic": "Thereupon he killed and examined Wencheng, obtaining a book, the book saying his strangeness, the Son of Heaven suspected it.",
      "context": {
        "previous": "少君見上，上有故銅器，問少君。",
        "next": "已而案其刻，果齊桓公器。"
      }
    },
    {
      "id": "s0031",
      "type": "paragraph",
      "chinese": "已而案其刻，果齊桓公器。",
      "literal": "Then examined its inscriptions, indeed Qi Huan Gong vessel.",
      "idiomatic": "Then he examined its inscription, which was indeed the vessel of Duke Huan of Qi.",
      "context": {
        "previous": "少君曰：「此器齊桓公十年陳於柏寢。」",
        "next": "一宮盡駭，以少君為神，數百歲人也。"
      }
    },
    {
      "id": "s0032",
      "type": "paragraph",
      "chinese": "一宮盡駭，以少君為神，數百歲人也。",
      "literal": "One palace all startled, took Shaojun as spirit, several hundred years person also.",
      "idiomatic": "Li Shaojun spoke to the emperor saying: \"Sacrificing to the stove will cause things to appear, causing them to appear will make cinnabar transform into gold, gold made into drinking vessels will prolong life, prolonging life and the Penglai immortals in the sea can be seen, seeing them allows Feng and Shan sacrifices, the Yellow Emperor is such a case.\"",
      "context": {
        "previous": "已而案其刻，果齊桓公器。"
      }
    },
    {
      "id": "s0033",
      "type": "paragraph",
      "chinese": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
      "literal": "Shaojun spoke to emperor said: 'Sacrifice stove then bring things, bring things and cinnabar sand can transform into yellow gold, yellow gold completed as food drink vessels then increase longevity, increase longevity and sea middle Penglai immortals can be seen, seen with feng shan then not die, Yellow Emperor is this.'",
      "idiomatic": "An Qisheng was an immortal who communicated with Penglai in the midst, those who met him saw him, those who did not missed him.",
      "context": {
        "next": "臣嘗游海上，見安期生，食臣棗，大如瓜。"
      }
    },
    {
      "id": "s0034",
      "type": "paragraph",
      "chinese": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
      "literal": "Minister once toured sea above, saw An Qisheng, fed minister dates, big as melon.",
      "idiomatic": "Thereupon the Son of Heaven began to personally sacrifice to the stove, and sent fangshi to enter the sea seeking Penglai Anqi Sheng and their like, and thus affairs began of refining cinnabar and other substances into gold.",
      "context": {
        "previous": "少君言於上曰：「祠灶則致物，致物而丹沙可化為黃金，黃金成以為飲食器則益壽，益壽而海中蓬萊僊者可見，見之以封禪則不死，黃帝是也。",
        "next": "安期生僊者，通蓬萊中，合則見人，不合則隱。」"
      }
    },
    {
      "id": "s0035",
      "type": "paragraph",
      "chinese": "安期生僊者，通蓬萊中，合則見人，不合則隱。」",
      "literal": "An Qisheng immortal person, connects Penglai middle, harmonious then sees people, not harmonious then hides.'",
      "idiomatic": "After a long time, Li Shaojun fell ill and died.",
      "context": {
        "previous": "臣嘗游海上，見安期生，食臣棗，大如瓜。",
        "next": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。"
      }
    },
    {
      "id": "s0036",
      "type": "paragraph",
      "chinese": "於是天子始親祠灶，而遣方士入海求蓬萊安期生之屬，而事化丹沙諸藥齊為黃金矣。",
      "literal": "Thereupon Son of Heaven began personally sacrifice stove, yet sent fangshi entered sea sought Penglai An Qisheng kind, yet undertook transforming cinnabar sand various medicines together into yellow gold.",
      "idiomatic": "Thereupon the Son of Heaven began to personally sacrifice to the stove, and sent fangshi to enter the sea seeking Penglai Anqi Sheng and their like, and thus affairs began of refining cinnabar and other substances into gold.",
      "context": {
        "previous": "安期生僊者，通蓬萊中，合則見人，不合則隱。」"
      }
    },
    {
      "id": "s0037",
      "type": "paragraph",
      "chinese": "居久之，李少君病死。",
      "literal": "Stayed long time, Li Shaojun illness died.",
      "idiomatic": "After a long time, Kuaiji fell ill and died.",
      "context": {
        "next": "天子以為化去不死也，而使黃錘史寬舒受其方。"
      }
    },
    {
      "id": "s0038",
      "type": "paragraph",
      "chinese": "天子以為化去不死也，而使黃錘史寬舒受其方。",
      "literal": "Son of Heaven considered transformed departed immortal also, yet made Huangchui Scribe Kuanshu receive his methods.",
      "idiomatic": "The search for Penglai Anqi Sheng could not be obtained, but many perverse and strange fangshi along the Yan and Qi coasts more emulated this, speaking of spirit affairs.",
      "context": {
        "previous": "居久之，李少君病死。",
        "next": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。"
      }
    },
    {
      "id": "s0039",
      "type": "paragraph",
      "chinese": "求蓬萊安期生莫能得，而海上燕齊怪迂之方士多相效，更言神事矣。",
      "literal": "Sought Penglai An Qisheng none able get, yet coastal Yan Qi strange far-fetched method masters many mutually imitated, moreover spoke divine matters.",
      "idiomatic": "The Son of Heaven heard of it, formulated an edict to the Censor: \"Truly receiving the mandate and becoming king, each has their origin in rising, different paths but same return, called making according to the people, pursuing customs to establish regulations.\"",
      "context": {
        "previous": "天子以為化去不死也，而使黃錘史寬舒受其方。"
      }
    },
    {
      "id": "s0040",
      "type": "paragraph",
      "chinese": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
      "literal": "Bo person Bo Youji memorialized sacrificed Taiyi method, said: 'Heaven spirits noble Taiyi, Taiyi assistants called Five Emperors.",
      "idiomatic": "The discussers all praised the ancient times, what hope do the common people have?",
      "context": {
        "next": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」"
      }
    },
    {
      "id": "s0041",
      "type": "paragraph",
      "chinese": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
      "literal": "Ancient Son of Heaven with spring autumn sacrificed Taiyi southeast suburban, used great sacrificial animals complete, seven days, made altar opened eight directions ghost paths.'",
      "idiomatic": "\"Culture and transformation are broad, governance is narrow, can we not strive for this!\"",
      "context": {
        "previous": "亳人薄誘忌奏祠泰一方，曰：「天神貴者泰一，泰一佐曰五帝。",
        "next": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。"
      }
    },
    {
      "id": "s0042",
      "type": "paragraph",
      "chinese": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
      "literal": "Thereupon Son of Heaven commanded Grand Invocator establish his sacrifice Chang'an southeast suburban, constantly conducted sacrifice like Youji method.",
      "idiomatic": "Rites arise from people.",
      "context": {
        "previous": "古者天子以春秋祭泰一東南郊，用太牢具，七日，為壇開八通之鬼道。」",
        "next": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。"
      }
    },
    {
      "id": "s0043",
      "type": "paragraph",
      "chinese": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
      "literal": "His later people had memorialized book, spoke 'Ancient Son of Heaven three years one used great sacrificial animals complete sacrificed spirits three one: heaven one, earth one, Taiyi one'.",
      "idiomatic": "The Former Kings detested chaos, thus established rites and righteousness to nourish people's desires, supply people's needs, make desires not exhaust things, things not bend to desires, the two support each other and grow long—this is the origin of rites.",
      "context": {
        "previous": "於是天子令太祝立其祠長安東南郊，常奉祠如忌方。",
        "next": "天子許之，令太祝領祠之忌泰一壇上，如其方。"
      }
    },
    {
      "id": "s0044",
      "type": "paragraph",
      "chinese": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
      "literal": "Son of Heaven permitted it, commanded Grand Invocator led sacrificed at Youji Taiyi altar above, like his method.",
      "idiomatic": "Thus rites are nourishment.",
      "context": {
        "previous": "其後人有上書，言「古者天子三年一用太牢具祠神三一：天一，地一，泰一」。",
        "next": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；"
      }
    },
    {
      "id": "s0045",
      "type": "paragraph",
      "chinese": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
      "literal": "Later people again had submit memorial, spoke 'Ancient ones Son of Heaven often with spring autumn solved sacrifices, sacrificed Yellow Emperor used one xiao broken mirror;",
      "idiomatic": "Rice and millet, the five flavors—these nourish the mouth;",
      "context": {
        "previous": "天子許之，令太祝領祠之忌泰一壇上，如其方。",
        "next": "冥羊用羊；"
      }
    },
    {
      "id": "s0046",
      "type": "paragraph",
      "chinese": "冥羊用羊；",
      "literal": "Mingyang used sheep;",
      "idiomatic": "Bells and drums, pipes and strings—these nourish the ears;",
      "context": {
        "previous": "後人復有上書，言「古者天子常以春秋解祠，祠黃帝用一梟破鏡；",
        "next": "祠馬行用一青牡馬；"
      }
    },
    {
      "id": "s0047",
      "type": "paragraph",
      "chinese": "祠馬行用一青牡馬；",
      "literal": "Sacrificed Maxing used one blue stallion;",
      "idiomatic": "Carved patterns and embroidery—these nourish the eyes;",
      "context": {
        "previous": "冥羊用羊；",
        "next": "泰一、皋山山君、地長用牛；"
      }
    },
    {
      "id": "s0048",
      "type": "paragraph",
      "chinese": "泰一、皋山山君、地長用牛；",
      "literal": "Taiyi, Gaoshan mountain lord, earth long used cattle;",
      "idiomatic": "Fragrant orchids in the carriage—these nourish the nose;",
      "context": {
        "previous": "祠馬行用一青牡馬；",
        "next": "武夷君用乾魚；"
      }
    },
    {
      "id": "s0049",
      "type": "paragraph",
      "chinese": "武夷君用乾魚；",
      "literal": "Wuyi Jun used dried fish;",
      "idiomatic": "The sounds of harmonious bells, stepping in martial patterns, galloping in Shao and Hua—these nourish the ears;",
      "context": {
        "previous": "泰一、皋山山君、地長用牛；",
        "next": "陰陽使者以一牛」。"
      }
    },
    {
      "id": "s0050",
      "type": "paragraph",
      "chinese": "陰陽使者以一牛」。",
      "literal": "Yin yang envoys with one ox.'",
      "idiomatic": "Sleeping on rhinoceros hides, grasping tigers—these nourish courage.",
      "context": {
        "previous": "武夷君用乾魚；",
        "next": "令祠官領之如其方，而祠於忌泰一壇旁。"
      }
    },
    {
      "id": "s0051",
      "type": "paragraph",
      "chinese": "令祠官領之如其方，而祠於忌泰一壇旁。",
      "literal": "Commanded sacrifice officials led it like his method, yet sacrificed at Youji Taiyi altar side.",
      "idiomatic": "Sleeping on rhinoceros hides, grasping tigers—these nourish courage.",
      "context": {
        "previous": "陰陽使者以一牛」。"
      }
    },
    {
      "id": "s0052",
      "type": "paragraph",
      "chinese": "其後，天子苑有白鹿，以其皮為幣，以發瑞應，造白金焉。",
      "literal": "His later, Son of Heaven park had white deer, with its hide made currency, to issue auspicious response, made white gold there.",
      "idiomatic": "Thus the great chariot's horses must be trustworthy, thoroughly trained and obedient, and only then are they ridden—this is how to nourish security.",
      "context": {}
    },
    {
      "id": "s0053",
      "type": "paragraph",
      "chinese": "其明年，郊雍，獲一角獸，若麃然。",
      "literal": "Next year, suburban Yong, obtained one horn beast, like mi deer.",
      "idiomatic": "Who understands that scholars risking death to maintain integrity is the way to nourish life?",
      "context": {
        "next": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」"
      }
    },
    {
      "id": "s0054",
      "type": "paragraph",
      "chinese": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」",
      "literal": "Officials said: 'Your Majesty solemn respectful suburban sacrifice, Supreme Deity responded enjoyed, bestowed one horn beast, probably qilin say.'",
      "idiomatic": "Who understands that frugal expenditure is the way to nourish wealth? Who understands that respectful yielding is the way to nourish security? Who understands that rites, righteousness, patterns, and principles are the way to nourish the emotions?",
      "context": {
        "previous": "其明年，郊雍，獲一角獸，若麃然。",
        "next": "於是以薦五畤，畤加一牛以燎。"
      }
    },
    {
      "id": "s0055",
      "type": "paragraph",
      "chinese": "於是以薦五畤，畤加一牛以燎。",
      "literal": "Thereupon with it offered five altars, altars added one ox to burn.",
      "idiomatic": "If people regard mere survival as wisdom, they will certainly die;",
      "context": {
        "previous": "有司曰：「陛下肅祗郊祀，上帝報享，錫一角獸，蓋麟云。」",
        "next": "賜諸侯白金，以風符應合于天地。"
      }
    },
    {
      "id": "s0056",
      "type": "paragraph",
      "chinese": "賜諸侯白金，以風符應合于天地。",
      "literal": "Granted feudal lords white gold, to wind talismans respond united with heaven earth.",
      "idiomatic": "If they regard profit as wisdom, they will certainly suffer harm;",
      "context": {
        "previous": "於是以薦五畤，畤加一牛以燎。"
      }
    },
    {
      "id": "s0057",
      "type": "paragraph",
      "chinese": "於是濟北王以為天子且封禪，乃上書獻泰山及其旁邑。",
      "literal": "Thereupon Jibei King considered Son of Heaven about fengshan, then memorialized offered Taishan and its side cities.",
      "idiomatic": "If they regard laziness as security, they will certainly face danger;",
      "context": {
        "next": "天子受之，更以他縣償之。"
      }
    },
    {
      "id": "s0058",
      "type": "paragraph",
      "chinese": "天子受之，更以他縣償之。",
      "literal": "Son of Heaven accepted it, moreover with other counties compensated him.",
      "idiomatic": "If they regard emotional indulgence as security, they will certainly perish.",
      "context": {
        "previous": "於是濟北王以為天子且封禪，乃上書獻泰山及其旁邑。",
        "next": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。"
      }
    },
    {
      "id": "s0059",
      "type": "paragraph",
      "chinese": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。",
      "literal": "Changshan King had crime, banished, Son of Heaven enfeoffed his younger brother at Zhending, to continue previous king sacrifices, yet with Changshan as commandery.",
      "idiomatic": "Thus those who govern the state suffer from not knowing rites and righteousness;",
      "context": {
        "previous": "天子受之，更以他縣償之。",
        "next": "然後五嶽皆在天子之郡。"
      }
    },
    {
      "id": "s0060",
      "type": "paragraph",
      "chinese": "然後五嶽皆在天子之郡。",
      "literal": "Then five peaks all in Son of Heaven commanderies.",
      "idiomatic": "Those who cultivate themselves suffer from not knowing their emotions and nature;",
      "context": {
        "previous": "常山王有罪，遷，天子封其弟於真定，以續先王祀，而以常山為郡。"
      }
    },
    {
      "id": "s0061",
      "type": "paragraph",
      "chinese": "其明年，齊人少翁以鬼神方見上。",
      "literal": "Next year, Qi person Shao Weng with ghost spirit methods saw emperor.",
      "idiomatic": "Those who govern their families suffer from not knowing ritual propriety;",
      "context": {
        "next": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。"
      }
    },
    {
      "id": "s0062",
      "type": "paragraph",
      "chinese": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。",
      "literal": "Emperor had favored Wang Lady, lady died, Shao Weng with method arts overnight brought Wang Lady and stove ghost appearance say, Son of Heaven from curtain middle gazed saw them.",
      "idiomatic": "As for rites, they are the source from which prohibitions against chaos arise,",
      "context": {
        "previous": "其明年，齊人少翁以鬼神方見上。",
        "next": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。"
      }
    },
    {
      "id": "s0063",
      "type": "paragraph",
      "chinese": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。",
      "literal": "Thereupon then appointed Shao Weng as Wencheng general, rewards very many, with guest ritual treated him.",
      "idiomatic": "Emotions and nature are what determine movement and stillness;",
      "context": {
        "previous": "上有所幸王夫人，夫人卒，少翁以方術蓋夜致王夫人及灶鬼之貌云，天子自帷中望見焉。",
        "next": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」"
      }
    },
    {
      "id": "s0064",
      "type": "paragraph",
      "chinese": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」",
      "literal": "Wencheng spoke said: 'Emperor immediately wants with spirits connect, palaces clothing not resemble spirits, spirit things not arrive.'",
      "idiomatic": "Understanding rites is what guides emotions and nature;",
      "context": {
        "previous": "於是乃拜少翁為文成將軍，賞賜甚多，以客禮禮之。",
        "next": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。"
      }
    },
    {
      "id": "s0065",
      "type": "paragraph",
      "chinese": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。",
      "literal": "Then made painted cloud qi carriage, and each with victory day drove carriage warded off evil ghosts.",
      "idiomatic": "Rites and righteousness are what regulate emotions and nature;",
      "context": {
        "previous": "文成言曰：「上即欲與神通，宮室被服不象神，神物不至。」",
        "next": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。"
      }
    },
    {
      "id": "s0066",
      "type": "paragraph",
      "chinese": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。",
      "literal": "Again made Ganquan palace, middle made platform rooms, painted heaven, earth, Taiyi various spirits, yet placed sacrifice implements to bring heaven spirits.",
      "idiomatic": "Those who are regulated by rites are those who follow their true emotions;",
      "context": {
        "previous": "乃作畫雲氣車，及各以勝日駕車辟惡鬼。",
        "next": "居歲餘，其方益衰，神不至。"
      }
    },
    {
      "id": "s0067",
      "type": "paragraph",
      "chinese": "居歲餘，其方益衰，神不至。",
      "literal": "Stayed year more, their methods increasingly declined, spirits not arrived.",
      "idiomatic": "Those who are not regulated by rites are those who pursue their emotions.",
      "context": {
        "previous": "又作甘泉宮，中為臺室，畫天、地、泰一諸神，而置祭具以致天神。",
        "next": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。"
      }
    },
    {
      "id": "s0068",
      "type": "paragraph",
      "chinese": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。",
      "literal": "Then made silk book with fed ox, pretended not know also, spoke this ox belly had marvel.",
      "idiomatic": "Thus rites are the appearance of emotions, pattern is the root of emotions;",
      "context": {
        "previous": "居歲餘，其方益衰，神不至。",
        "next": "殺而視之，得書，書言其怪，天子疑之。"
      }
    },
    {
      "id": "s0069",
      "type": "paragraph",
      "chinese": "殺而視之，得書，書言其怪，天子疑之。",
      "literal": "Killed and inspected it, obtained book, book spoke its marvel, Son of Heaven doubted it.",
      "idiomatic": "As for the remaining patterns, righteousness, emotions, and appearances, there must be something that can be discussed about them.",
      "context": {
        "previous": "乃為帛書以飯牛，詳弗知也，言此牛腹中有奇。",
        "next": "有識其手書，問之人，果（為）［偽］書。"
      }
    },
    {
      "id": "s0070",
      "type": "paragraph",
      "chinese": "有識其手書，問之人，果（為）［偽］書。",
      "literal": "Had recognized his handwriting, asked people, indeed false book.",
      "idiomatic": "Rites are what the ruler establishes;",
      "context": {
        "previous": "殺而視之，得書，書言其怪，天子疑之。",
        "next": "於是誅文成將軍而隱之。"
      }
    },
    {
      "id": "s0071",
      "type": "paragraph",
      "chinese": "於是誅文成將軍而隱之。",
      "literal": "Thereupon executed Wencheng General yet concealed it.",
      "idiomatic": "Those who are rulers grasp the root and control the branches;",
      "context": {
        "previous": "有識其手書，問之人，果（為）［偽］書。"
      }
    },
    {
      "id": "s0072",
      "type": "paragraph",
      "chinese": "其後則又作柏梁、銅柱、承露僊人掌之屬矣。",
      "literal": "His later then moreover made Cypress Beam, Copper Pillar, Dew Receiving Immortal Person palm etc. kinds.",
      "idiomatic": "Those who are ministers grasp the branches and serve the root.",
      "context": {}
    },
    {
      "id": "s0073",
      "type": "paragraph",
      "chinese": "文成死明年，天子病鼎湖甚，巫醫無所不致，（至）不愈。",
      "literal": "Wencheng died next year, Son of Heaven ill Dinghu very, witch doctors nothing not brought, not healed.",
      "idiomatic": "This is why rites flourish.",
      "context": {
        "next": "游水發根乃言曰：「上郡有巫，病而鬼下之。」"
      }
    },
    {
      "id": "s0074",
      "type": "paragraph",
      "chinese": "游水發根乃言曰：「上郡有巫，病而鬼下之。」",
      "literal": "You Shui Fagen then spoke said: 'Shang commandery has witch, ill yet spirit descended him.'",
      "idiomatic": "Thus rites are the root;",
      "context": {
        "previous": "文成死明年，天子病鼎湖甚，巫醫無所不致，（至）不愈。",
        "next": "上召置祠之甘泉。"
      }
    },
    {
      "id": "s0075",
      "type": "paragraph",
      "chinese": "上召置祠之甘泉。",
      "literal": "Emperor summoned placed sacrifice at Ganquan.",
      "idiomatic": "Rulers serve the root;",
      "context": {
        "previous": "游水發根乃言曰：「上郡有巫，病而鬼下之。」",
        "next": "及病，使人問神君。"
      }
    },
    {
      "id": "s0076",
      "type": "paragraph",
      "chinese": "及病，使人問神君。",
      "literal": "And illness, sent people asked spirit lord.",
      "idiomatic": "Ministers guard the branches;",
      "context": {
        "previous": "上召置祠之甘泉。",
        "next": "神君言曰：「天子毋憂病。"
      }
    },
    {
      "id": "s0077",
      "type": "paragraph",
      "chinese": "神君言曰：「天子毋憂病。",
      "literal": "Spirit lord spoke said: 'Son of Heaven not worry illness.",
      "idiomatic": "Loyalty and trustworthiness are the root of rites;",
      "context": {
        "previous": "及病，使人問神君。",
        "next": "病少愈，彊與我會甘泉。」"
      }
    },
    {
      "id": "s0078",
      "type": "paragraph",
      "chinese": "病少愈，彊與我會甘泉。」",
      "literal": "Illness slightly better, strong meet me Ganquan.'",
      "idiomatic": "Honor and humility are the order of rites;",
      "context": {
        "previous": "神君言曰：「天子毋憂病。",
        "next": "於是病愈，遂幸甘泉，病良已。"
      }
    },
    {
      "id": "s0079",
      "type": "paragraph",
      "chinese": "於是病愈，遂幸甘泉，病良已。",
      "literal": "Thereupon illness healed, then favored Ganquan, illness truly gone.",
      "idiomatic": "This is why rites are practiced.",
      "context": {
        "previous": "病少愈，彊與我會甘泉。」",
        "next": "大赦天下，置壽宮神君。"
      }
    },
    {
      "id": "s0080",
      "type": "paragraph",
      "chinese": "大赦天下，置壽宮神君。",
      "literal": "Great amnesty realm, established Shou Palace divine lord.",
      "idiomatic": "Thus honor and humility are what correct rites;",
      "context": {
        "previous": "於是病愈，遂幸甘泉，病良已。",
        "next": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。"
      }
    },
    {
      "id": "s0081",
      "type": "paragraph",
      "chinese": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。",
      "literal": "Divine lord most noble Taiyi, his assistants called Great Prohibition, Controller of Fate etc. kinds, all followed him.",
      "idiomatic": "Root and branches are what strengthen rites.",
      "context": {
        "previous": "大赦天下，置壽宮神君。",
        "next": "非可得見，聞其音，與人言等。"
      }
    },
    {
      "id": "s0082",
      "type": "paragraph",
      "chinese": "非可得見，聞其音，與人言等。",
      "literal": "Not able obtained seen, heard his sound, with person speech equal.",
      "idiomatic": "The next day, on the Xinmao day, he sacrificed to the sun at the Eastern Taiyi altar, with Gaozu as partner.",
      "context": {
        "previous": "神君最貴者（大夫）［太一］，其佐曰大禁、司命之屬，皆從之。",
        "next": "時去時來，來則風肅然也。"
      }
    },
    {
      "id": "s0083",
      "type": "paragraph",
      "chinese": "時去時來，來則風肅然也。",
      "literal": "Sometimes departed sometimes came, came then wind solemn calm also.",
      "idiomatic": "又明日，壬辰日，祠皇地祇於北壇，以高后配。",
      "context": {
        "previous": "非可得見，聞其音，與人言等。",
        "next": "居室帷中。"
      }
    },
    {
      "id": "s0084",
      "type": "paragraph",
      "chinese": "居室帷中。",
      "literal": "Resided room curtain middle.",
      "idiomatic": "The next day, on the Renchen day, he sacrificed to the Royal Earth Spirit at the northern altar, with the Empress Gao as partner.",
      "context": {
        "previous": "時去時來，來則風肅然也。",
        "next": "時晝言，然常以夜。"
      }
    },
    {
      "id": "s0085",
      "type": "paragraph",
      "chinese": "時晝言，然常以夜。",
      "literal": "Sometimes daytime spoke, however usually with night.",
      "idiomatic": "又明日，癸巳日，祀泰一於南壇，以景帝配。",
      "context": {
        "previous": "居室帷中。",
        "next": "天子祓，然後入。"
      }
    },
    {
      "id": "s0086",
      "type": "paragraph",
      "chinese": "天子祓，然後入。",
      "literal": "Son of Heaven purification, then entered.",
      "idiomatic": "The next day, on the Guisi day, he sacrificed to Taiyi at the southern altar, with Emperor Jing as partner.",
      "context": {
        "previous": "時晝言，然常以夜。",
        "next": "因巫為主人，關飲食。"
      }
    },
    {
      "id": "s0087",
      "type": "paragraph",
      "chinese": "因巫為主人，關飲食。",
      "literal": "By means of witch as host, concerned with food drink.",
      "idiomatic": "又明日，甲午日，若祠上帝於雲陽。",
      "context": {
        "previous": "天子祓，然後入。",
        "next": "所欲者言行下。"
      }
    },
    {
      "id": "s0088",
      "type": "paragraph",
      "chinese": "所欲者言行下。",
      "literal": "What desired spoke then descended.",
      "idiomatic": "The next day, on the Jiawu day, it was as if sacrificing to the Supreme Deity at Yunyang.",
      "context": {
        "previous": "因巫為主人，關飲食。",
        "next": "又置壽宮、北宮，張羽旗，設供具，以禮神君。"
      }
    },
    {
      "id": "s0089",
      "type": "paragraph",
      "chinese": "又置壽宮、北宮，張羽旗，設供具，以禮神君。",
      "literal": "Moreover established Shou Palace, North Palace, spread feather flags, set up offerings utensils, to ritual divine lord.",
      "idiomatic": "又明日，乙未日，禪泰山。",
      "context": {
        "previous": "所欲者言行下。",
        "next": "神君所言，上使人受書其言，命之曰「畫法」。"
      }
    },
    {
      "id": "s0090",
      "type": "paragraph",
      "chinese": "神君所言，上使人受書其言，命之曰「畫法」。",
      "literal": "Divine lord what spoke, emperor made person received wrote his words, named it 'painting method'.",
      "idiomatic": "The next day, on the Yiwei day, he performed the shan ceremony at Mount Tai.",
      "context": {
        "previous": "又置壽宮、北宮，張羽旗，設供具，以禮神君。",
        "next": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。"
      }
    },
    {
      "id": "s0091",
      "type": "paragraph",
      "chinese": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。",
      "literal": "His what spoke, world customs what knew also, no extremely exceptional, yet Son of Heaven alone happy.",
      "idiomatic": "其禮頗采儒術，廣濟於天下矣。",
      "context": {
        "previous": "神君所言，上使人受書其言，命之曰「畫法」。",
        "next": "其事祕，世莫知也。"
      }
    },
    {
      "id": "s0092",
      "type": "paragraph",
      "chinese": "其事祕，世莫知也。",
      "literal": "His matters secret, world none knew also.",
      "idiomatic": "His rituals rather adopted Confucian methods, extensively benefiting the world.",
      "context": {
        "previous": "其所語，世俗之所知也，毋絕殊者，而天子獨喜。"
      }
    },
    {
      "id": "s0093",
      "type": "paragraph",
      "chinese": "其後三年，有司言元宜以天瑞命，不宜以一二數。",
      "literal": "His later three years, officials spoke yuan should with heaven auspicious named, not suitable with one two numbers.",
      "idiomatic": "而文成遂以誅。",
      "context": {
        "next": "一元曰建元，二元以長星曰元光，三元以郊得一角獸曰元狩云。"
      }
    },
    {
      "id": "s0094",
      "type": "paragraph",
      "chinese": "一元曰建元，二元以長星曰元光，三元以郊得一角獸曰元狩云。",
      "literal": "One yuan called Jian Yuan, two yuan with long star called Yuan Guang, three yuan with suburban obtained one horn beast called Yuan Shou say.",
      "idiomatic": "And Wencheng was ultimately executed.",
      "context": {
        "previous": "其後三年，有司言元宜以天瑞命，不宜以一二數。"
      }
    },
    {
      "id": "s0095",
      "type": "paragraph",
      "chinese": "其明年冬，天子郊雍，議曰：「今上帝朕親郊，而後土毋祀，則禮不答也。」",
      "literal": "Next year winter, Son of Heaven suburban Yong, discussed said: 'Now Supreme Deity I personally suburban sacrificed, yet Houtu no sacrifice, then ritual not reciprocal also.'",
      "idiomatic": "文成死明年，天子病鼎湖甚，巫醫無所不致，不愈。",
      "context": {
        "next": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。"
      }
    },
    {
      "id": "s0096",
      "type": "paragraph",
      "chinese": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。",
      "literal": "Officials with Grand Historian, sacrifice official Kuanshu etc. discussed: 'Heaven earth sacrificial animals horns cocoon chestnuts.",
      "idiomatic": "The year after Wencheng died, the Son of Heaven was gravely ill at Dinghu, and shamans and doctors tried everything, but he did not recover.",
      "context": {
        "previous": "其明年冬，天子郊雍，議曰：「今上帝朕親郊，而後土毋祀，則禮不答也。」",
        "next": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」"
      }
    },
    {
      "id": "s0097",
      "type": "paragraph",
      "chinese": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」",
      "literal": "Now Your Majesty personally sacrifices Houtu, Houtu suitable in marsh middle round mound make five altars, altar one yellow calf great sacrificial animals complete, already sacrificed all buried, yet following sacrifice clothing upper yellow.'",
      "idiomatic": "游水發根言上郡有巫，病而鬼神下之。",
      "context": {
        "previous": "有司與太史公、祠官寬舒等議：「天地牲角繭栗。",
        "next": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。"
      }
    },
    {
      "id": "s0098",
      "type": "paragraph",
      "chinese": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。",
      "literal": "Thereupon Son of Heaven then east, began establish Houtu sacrifice Fenyin wei above, like Kuanshu etc discussed.",
      "idiomatic": "You Shui Fa Gen said that Shangjun had a shaman who, when ill, had ghosts and spirits descend upon her.",
      "context": {
        "previous": "今陛下親祀后土，后土宜於澤中圜丘為五壇，壇一黃犢太牢具，已祠盡瘞，而從祠衣上黃。」",
        "next": "上親望拜，如上帝禮。"
      }
    },
    {
      "id": "s0099",
      "type": "paragraph",
      "chinese": "上親望拜，如上帝禮。",
      "literal": "Emperor personally gazed bowed, like Supreme Deity ritual.",
      "idiomatic": "上召置祠之甘泉，及病，使人問神君。",
      "context": {
        "previous": "於是天子遂東，始立后土祠汾陰脽上，如寬舒等議。",
        "next": "禮畢，天子遂至滎陽而還。"
      }
    },
    {
      "id": "s0100",
      "type": "paragraph",
      "chinese": "禮畢，天子遂至滎陽而還。",
      "literal": "Ritual completed, Son of Heaven then arrived Xingyang and returned.",
      "idiomatic": "The emperor summoned her and placed her in the shrine at Ganquan, and when he was ill, he sent people to ask the spirit lord.",
      "context": {
        "previous": "上親望拜，如上帝禮。",
        "next": "過雒陽，下詔曰：「三代邈絕，遠矣難存。"
      }
    },
    {
      "id": "s0101",
      "type": "paragraph",
      "chinese": "過雒陽，下詔曰：「三代邈絕，遠矣難存。",
      "literal": "Passed Luoyang, issued edict said: 'Three dynasties distant broken, far, difficult preserve.",
      "idiomatic": "Passed Luoyang, issued edict said: 'Three dynasties distant broken, far, difficult preserve. (translated).",
      "context": {
        "previous": "禮畢，天子遂至滎陽而還。",
        "next": "其以三十里地封周後為周子南君，以奉先王祀焉。」"
      }
    },
    {
      "id": "s0102",
      "type": "paragraph",
      "chinese": "其以三十里地封周後為周子南君，以奉先王祀焉。」",
      "literal": "Their with thirty li land enfeoffed Zhou descendants as Zhou Zi Nan Jun, to conduct previous kings sacrifices there.'",
      "idiomatic": "Their with thirty li land enfeoffed Zhou descendants as Zhou Zi Nan Jun, to conduct previous kings sacrifices there.' (translated).",
      "context": {
        "previous": "過雒陽，下詔曰：「三代邈絕，遠矣難存。",
        "next": "是歲，天子始巡郡縣，侵尋於泰山矣。"
      }
    },
    {
      "id": "s0103",
      "type": "paragraph",
      "chinese": "是歲，天子始巡郡縣，侵尋於泰山矣。",
      "literal": "This year, Son of Heaven began toured commanderies counties, gradually approached Taishan.",
      "idiomatic": "This year, Son of Heaven began toured commanderies counties, gradually approached Taishan. (translated).",
      "context": {
        "previous": "其以三十里地封周後為周子南君，以奉先王祀焉。」"
      }
    },
    {
      "id": "s0104",
      "type": "paragraph",
      "chinese": "其春，樂成侯上書言欒大。",
      "literal": "Next spring, Lecheng Hou memorialized book spoke Luan Da.",
      "idiomatic": "Next spring, Lecheng Hou memorialized book spoke Luan Da. (translated).",
      "context": {
        "next": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。"
      }
    },
    {
      "id": "s0105",
      "type": "paragraph",
      "chinese": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。",
      "literal": "Luan Da, Jiaodong palace person, formerly once with Wencheng General same master, already then became Jiaodong King favored artisan.",
      "idiomatic": "Luan Da, Jiaodong palace person, formerly once with Wencheng General same master, already then became Jiaodong King favored artisan. (translated).",
      "context": {
        "previous": "其春，樂成侯上書言欒大。",
        "next": "而樂成侯姊為康王后，毋子。"
      }
    },
    {
      "id": "s0106",
      "type": "paragraph",
      "chinese": "而樂成侯姊為康王后，毋子。",
      "literal": "Yet Lecheng Hou elder sister became Kang King empress, no sons.",
      "idiomatic": "Yet Lecheng Hou elder sister became Kang King empress, no sons. (translated).",
      "context": {
        "previous": "欒大，膠東宮人，故嘗與文成將軍同師，已而為膠東王尚方。",
        "next": "康王死，他姬子立為王。"
      }
    },
    {
      "id": "s0107",
      "type": "paragraph",
      "chinese": "康王死，他姬子立為王。",
      "literal": "Kang King died, other consort son established as king.",
      "idiomatic": "Kang King died, other consort son established as king. (translated).",
      "context": {
        "previous": "而樂成侯姊為康王后，毋子。",
        "next": "而康后有淫行，與王不相中（得），相危以法。"
      }
    },
    {
      "id": "s0108",
      "type": "paragraph",
      "chinese": "而康后有淫行，與王不相中（得），相危以法。",
      "literal": "Yet Kang Empress had lewd conduct, with king not mutually middle (obtained), mutually endangered with law.",
      "idiomatic": "Yet Kang Empress had lewd conduct, with king not mutually middle (obtained), mutually endangered with law. (translated).",
      "context": {
        "previous": "康王死，他姬子立為王。",
        "next": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。"
      }
    },
    {
      "id": "s0109",
      "type": "paragraph",
      "chinese": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。",
      "literal": "Kang Empress heard Wencheng already died, yet wished self flatter emperor, then sent Luan Da by means of Lecheng Hou sought audience spoke methods.",
      "idiomatic": "Kang Empress heard Wencheng already died, yet wished self flatter emperor, then sent Luan Da by means of Lecheng Hou sought audience spoke methods. (translated).",
      "context": {
        "previous": "而康后有淫行，與王不相中（得），相危以法。",
        "next": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。"
      }
    },
    {
      "id": "s0110",
      "type": "paragraph",
      "chinese": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。",
      "literal": "Son of Heaven already executed Wencheng, afterwards regretted resented his early death, cherished his methods not complete, when saw Luan Da, greatly pleased.",
      "idiomatic": "Son of Heaven already executed Wencheng, afterwards regretted resented his early death, cherished his methods not complete, when saw Luan Da, greatly pleased. (translated).",
      "context": {
        "previous": "康后聞文成已死，而欲自媚於上，乃遣欒大因樂成侯求見言方。",
        "next": "大為人長美，言多方略，而敢為大言，處之不疑。"
      }
    },
    {
      "id": "s0111",
      "type": "paragraph",
      "chinese": "大為人長美，言多方略，而敢為大言，處之不疑。",
      "literal": "Da as person tall beautiful, spoke many methods strategies, yet dared make big words, treated it without doubt.",
      "idiomatic": "Da as person tall beautiful, spoke many methods strategies, yet dared make big words, treated it without doubt. (translated).",
      "context": {
        "previous": "天子既誅文成，後悔恨其早死，惜其方不盡，及見欒大，大悅。",
        "next": "大言曰：「臣嘗往來海中，見安期、羨門之屬。"
      }
    },
    {
      "id": "s0112",
      "type": "paragraph",
      "chinese": "大言曰：「臣嘗往來海中，見安期、羨門之屬。",
      "literal": "Da spoke said: 'Minister once came went sea middle, saw An Qi, Xian Men etc. kinds.",
      "idiomatic": "Da spoke said: 'Minister once came went sea middle, saw An Qi, Xian Men etc. kinds. (translated).",
      "context": {
        "previous": "大為人長美，言多方略，而敢為大言，處之不疑。",
        "next": "顧以為臣賤，不信臣。"
      }
    },
    {
      "id": "s0113",
      "type": "paragraph",
      "chinese": "顧以為臣賤，不信臣。",
      "literal": "However considered minister lowly, not trusted minister.",
      "idiomatic": "However considered minister lowly, not trusted minister. (translated).",
      "context": {
        "previous": "大言曰：「臣嘗往來海中，見安期、羨門之屬。",
        "next": "又以為康王諸侯耳，不足予方。"
      }
    },
    {
      "id": "s0114",
      "type": "paragraph",
      "chinese": "又以為康王諸侯耳，不足予方。",
      "literal": "Moreover considered Kang King feudal lord only, not worth gave methods.",
      "idiomatic": "Moreover considered Kang King feudal lord only, not worth gave methods. (translated).",
      "context": {
        "previous": "顧以為臣賤，不信臣。",
        "next": "臣數言康王，康王又不用臣。"
      }
    },
    {
      "id": "s0115",
      "type": "paragraph",
      "chinese": "臣數言康王，康王又不用臣。",
      "literal": "Minister frequently spoke Kang King, Kang King moreover not used minister.",
      "idiomatic": "Minister frequently spoke Kang King, Kang King moreover not used minister. (translated).",
      "context": {
        "previous": "又以為康王諸侯耳，不足予方。",
        "next": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』"
      }
    },
    {
      "id": "s0116",
      "type": "paragraph",
      "chinese": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』",
      "literal": "Minister what teacher said: 'Yellow gold can be completed, yet river breach can be blocked, not die medicine can be obtained, immortals can be brought also.'",
      "idiomatic": "Minister what teacher said: 'Yellow gold can be completed, yet river breach can be blocked, not die medicine can be obtained, immortals can be brought also.' (translated).",
      "context": {
        "previous": "臣數言康王，康王又不用臣。",
        "next": "臣恐效文成，則方士皆掩口，惡敢言方哉！」"
      }
    },
    {
      "id": "s0117",
      "type": "paragraph",
      "chinese": "臣恐效文成，則方士皆掩口，惡敢言方哉！」",
      "literal": "Minister fears imitate Wencheng, then fangshi all cover mouth, how dare speak methods!'",
      "idiomatic": "Minister fears imitate Wencheng, then fangshi all cover mouth, how dare speak methods!' (translated).",
      "context": {
        "previous": "臣之師曰：『黃金可成，而河決可塞，不死之藥可得，僊人可致也。』",
        "next": "上曰：「文成食馬肝死耳。"
      }
    },
    {
      "id": "s0118",
      "type": "paragraph",
      "chinese": "上曰：「文成食馬肝死耳。",
      "literal": "Emperor said: 'Wencheng ate horse liver died only.",
      "idiomatic": "Emperor said: 'Wencheng ate horse liver died only. (translated).",
      "context": {
        "previous": "臣恐效文成，則方士皆掩口，惡敢言方哉！」",
        "next": "子誠能修其方，我何愛乎！」"
      }
    },
    {
      "id": "s0119",
      "type": "paragraph",
      "chinese": "子誠能修其方，我何愛乎！」",
      "literal": "You truly can repair their methods, I what begrudge!'",
      "idiomatic": "You truly can repair their methods, I what begrudge!' (translated).",
      "context": {
        "previous": "上曰：「文成食馬肝死耳。",
        "next": "大曰：「臣師非有求人，人者求之。"
      }
    },
    {
      "id": "s0120",
      "type": "paragraph",
      "chinese": "大曰：「臣師非有求人，人者求之。",
      "literal": "Da said: 'Minister teacher not has seek people, people what seek him.",
      "idiomatic": "Da said: 'Minister teacher not has seek people, people what seek him. (translated).",
      "context": {
        "previous": "子誠能修其方，我何愛乎！」",
        "next": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。"
      }
    },
    {
      "id": "s0121",
      "type": "paragraph",
      "chinese": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。",
      "literal": "Your Majesty must want bring them, then honor their envoys, command have relatives, with guest ritual treat them, not lowly, make each wear their faith seal, then can make communicate words to spirit people.",
      "idiomatic": "Your Majesty must want bring them, then honor their envoys, command have relatives, with guest ritual treat them, not lowly, make each wear their faith seal, then can make communicate words to spirit people. (translated).",
      "context": {
        "previous": "大曰：「臣師非有求人，人者求之。",
        "next": "神人尚肯邪不邪。"
      }
    },
    {
      "id": "s0122",
      "type": "paragraph",
      "chinese": "神人尚肯邪不邪。",
      "literal": "Spirit people still willing yes no yes.",
      "idiomatic": "Spirit people still willing yes no yes. (translated).",
      "context": {
        "previous": "陛下必欲致之，則貴其使者，令有親屬，以客禮待之，勿卑，使各佩其信印，乃可使通言於神人。",
        "next": "致尊其使，然後可致也。」"
      }
    },
    {
      "id": "s0123",
      "type": "paragraph",
      "chinese": "致尊其使，然後可致也。」",
      "literal": "Bring honor their envoy, then can bring them.'",
      "idiomatic": "Bring honor their envoy, then can bring them.' (translated).",
      "context": {
        "previous": "神人尚肯邪不邪。",
        "next": "於是上使先驗小方，鬬旗，旗自相觸擊。"
      }
    },
    {
      "id": "s0124",
      "type": "paragraph",
      "chinese": "於是上使先驗小方，鬬旗，旗自相觸擊。",
      "literal": "Thereupon emperor made first test small methods, battle flags, flags themselves mutually touched attacked.",
      "idiomatic": "Thereupon emperor made first test small methods, battle flags, flags themselves mutually touched attacked. (translated).",
      "context": {
        "previous": "致尊其使，然後可致也。」"
      }
    },
    {
      "id": "s0125",
      "type": "paragraph",
      "chinese": "是時上方憂河決，而黃金不就，乃拜大為五利將軍。",
      "literal": "This time emperor just worried Yellow River breach, yet yellow gold not completed, then appointed Da as Five Profits General.",
      "idiomatic": "This time emperor just worried Yellow River breach, yet yellow gold not completed, then appointed Da as Five Profits General. (translated).",
      "context": {
        "next": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。"
      }
    },
    {
      "id": "s0126",
      "type": "paragraph",
      "chinese": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。",
      "literal": "Resided month remaining, obtained four gold seals, wore Heaven Knight General, Earth Soil General, Great Passage General, Heaven Way General seals.",
      "idiomatic": "Resided month remaining, obtained four gold seals, wore Heaven Knight General, Earth Soil General, Great Passage General, Heaven Way General seals. (translated).",
      "context": {
        "previous": "是時上方憂河決，而黃金不就，乃拜大為五利將軍。",
        "next": "制詔御史：「昔禹疏九江，決四瀆。"
      }
    },
    {
      "id": "s0127",
      "type": "paragraph",
      "chinese": "制詔御史：「昔禹疏九江，決四瀆。",
      "literal": "Imperial edict Imperial Secretary: 'Formerly Yu dredged nine rivers, breached four channels.",
      "idiomatic": "Imperial edict Imperial Secretary: 'Formerly Yu dredged nine rivers, breached four channels. (translated).",
      "context": {
        "previous": "居月餘，得四金印，佩天士將軍、地土將軍、大通將軍、天道將軍印。",
        "next": "閒者河溢皋陸，隄繇不息。"
      }
    },
    {
      "id": "s0128",
      "type": "paragraph",
      "chinese": "閒者河溢皋陸，隄繇不息。",
      "literal": "Recently Yellow River overflowed Gao Lu, dike corvee not ceased.",
      "idiomatic": "Recently Yellow River overflowed Gao Lu, dike corvee not ceased. (translated).",
      "context": {
        "previous": "制詔御史：「昔禹疏九江，決四瀆。",
        "next": "朕臨天下二十有八年，天若遺朕士而大通焉。"
      }
    },
    {
      "id": "s0129",
      "type": "paragraph",
      "chinese": "朕臨天下二十有八年，天若遺朕士而大通焉。",
      "literal": "I faced realm twenty eight years, heaven if bestowed I knight yet great passage there.",
      "idiomatic": "I faced realm twenty eight years, heaven if bestowed I knight yet great passage there. (translated).",
      "context": {
        "previous": "閒者河溢皋陸，隄繇不息。",
        "next": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。"
      }
    },
    {
      "id": "s0130",
      "type": "paragraph",
      "chinese": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。",
      "literal": "Qian called 'flying dragon', 'great goose gradually at plate', intention almost with there.",
      "idiomatic": "Qian called 'flying dragon', 'great goose gradually at plate', intention almost with there. (translated).",
      "context": {
        "previous": "朕臨天下二十有八年，天若遺朕士而大通焉。",
        "next": "其以二千戶封地士將軍大為樂通侯。」"
      }
    },
    {
      "id": "s0131",
      "type": "paragraph",
      "chinese": "其以二千戶封地士將軍大為樂通侯。」",
      "literal": "Their with two thousand households enfeoffed Earth Knight General Da as Le Tong Hou.'",
      "idiomatic": "Their with two thousand households enfeoffed Earth Knight General Da as Le Tong Hou.' (translated).",
      "context": {
        "previous": "乾稱『蜚龍』，『鴻漸于般』，意庶幾與焉。",
        "next": "賜列侯甲第，僮千人。"
      }
    },
    {
      "id": "s0132",
      "type": "paragraph",
      "chinese": "賜列侯甲第，僮千人。",
      "literal": "Granted marquises first rank mansions, youths thousand people.",
      "idiomatic": "Granted marquises first rank mansions, youths thousand people. (translated).",
      "context": {
        "previous": "其以二千戶封地士將軍大為樂通侯。」",
        "next": "乘輿斥車馬帷帳器物以充其家。"
      }
    },
    {
      "id": "s0133",
      "type": "paragraph",
      "chinese": "乘輿斥車馬帷帳器物以充其家。",
      "literal": "Imperial carriage discarded chariots horses curtains tents utensils to fill his home.",
      "idiomatic": "Imperial carriage discarded chariots horses curtains tents utensils to fill his home. (translated).",
      "context": {
        "previous": "賜列侯甲第，僮千人。",
        "next": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。"
      }
    },
    {
      "id": "s0134",
      "type": "paragraph",
      "chinese": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。",
      "literal": "Moreover with Wei eldest princess married him, carried gold ten thousand jin, changed name his city called Dangli princess.",
      "idiomatic": "Moreover with Wei eldest princess married him, carried gold ten thousand jin, changed name his city called Dangli princess. (translated).",
      "context": {
        "previous": "乘輿斥車馬帷帳器物以充其家。",
        "next": "天子親如五利之第。"
      }
    },
    {
      "id": "s0135",
      "type": "paragraph",
      "chinese": "天子親如五利之第。",
      "literal": "Son of Heaven personally went like Five Profits residence.",
      "idiomatic": "Son of Heaven personally went like Five Profits residence. (translated).",
      "context": {
        "previous": "又以衛長公主妻之，齎金萬斤，更名其邑曰當利公主。",
        "next": "使者存問所給，連屬於道。"
      }
    },
    {
      "id": "s0136",
      "type": "paragraph",
      "chinese": "使者存問所給，連屬於道。",
      "literal": "Envoys visited inquired what supplied, connected attached on road.",
      "idiomatic": "Envoys visited inquired what supplied, connected attached on road. (translated).",
      "context": {
        "previous": "天子親如五利之第。",
        "next": "自大主將相以下，皆置酒其家，獻遺之。"
      }
    },
    {
      "id": "s0137",
      "type": "paragraph",
      "chinese": "自大主將相以下，皆置酒其家，獻遺之。",
      "literal": "From great princess generals chancellors below, all set up wine his home, offered sent him.",
      "idiomatic": "From great princess generals chancellors below, all set up wine his home, offered sent him. (translated).",
      "context": {
        "previous": "使者存問所給，連屬於道。",
        "next": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。"
      }
    },
    {
      "id": "s0138",
      "type": "paragraph",
      "chinese": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。",
      "literal": "Thereupon Son of Heaven moreover carved jade seal called 'Heaven Way General', made envoy wore feather clothes, night stood white cogongrass above, Five Profits General also wore feather clothes, stood white cogongrass above received seal, to show not minister also.",
      "idiomatic": "Thereupon Son of Heaven moreover carved jade seal called 'Heaven Way General', made envoy wore feather clothes, night stood white cogongrass above, Five Profits General also wore feather clothes, stood white cogongrass above received seal, to show not minister also. (translated).",
      "context": {
        "previous": "自大主將相以下，皆置酒其家，獻遺之。",
        "next": "而佩「天道」者，且為天子道天神也。"
      }
    },
    {
      "id": "s0139",
      "type": "paragraph",
      "chinese": "而佩「天道」者，且為天子道天神也。",
      "literal": "Yet wearing 'Heaven Way' one, moreover for Son of Heaven guided heaven spirits also.",
      "idiomatic": "Yet wearing 'Heaven Way' one, moreover for Son of Heaven guided heaven spirits also. (translated).",
      "context": {
        "previous": "於是天子又刻玉印曰「天道將軍」，使使衣羽衣，夜立白茅上，五利將軍亦衣羽衣，立白茅上受印，以示弗臣也。",
        "next": "於是五利常夜祠其家，欲以下神。"
      }
    },
    {
      "id": "s0140",
      "type": "paragraph",
      "chinese": "於是五利常夜祠其家，欲以下神。",
      "literal": "Thereupon Five Profits often night sacrificed his home, wished to descend spirits.",
      "idiomatic": "Thereupon Five Profits often night sacrificed his home, wished to descend spirits. (translated).",
      "context": {
        "previous": "而佩「天道」者，且為天子道天神也。",
        "next": "神未至而百鬼集矣，然頗能使之。"
      }
    },
    {
      "id": "s0141",
      "type": "paragraph",
      "chinese": "神未至而百鬼集矣，然頗能使之。",
      "literal": "Spirit not arrived yet hundred ghosts gathered already, however rather able make them.",
      "idiomatic": "Spirit not arrived yet hundred ghosts gathered already, however rather able make them. (translated).",
      "context": {
        "previous": "於是五利常夜祠其家，欲以下神。",
        "next": "其後治裝行，東入海，求其師云。"
      }
    },
    {
      "id": "s0142",
      "type": "paragraph",
      "chinese": "其後治裝行，東入海，求其師云。",
      "literal": "His later prepared equipment went, east entered sea, sought his master say.",
      "idiomatic": "His later prepared equipment went, east entered sea, sought his master say. (translated).",
      "context": {
        "previous": "神未至而百鬼集矣，然頗能使之。",
        "next": "大見數月，佩六印，貴振天下，而海上燕齊之閒，莫不搤捥而自言有禁方，能神僊矣。"
      }
    },
    {
      "id": "s0143",
      "type": "paragraph",
      "chinese": "大見數月，佩六印，貴振天下，而海上燕齊之閒，莫不搤捥而自言有禁方，能神僊矣。",
      "literal": "Da appeared several months, wore six seals, noble shook realm, yet coastal Yan Qi between, none not grasped writhed yet self claimed had forbidden methods, able divine immortals.",
      "idiomatic": "Da appeared several months, wore six seals, noble shook realm, yet coastal Yan Qi between, none not grasped writhed yet self claimed had forbidden methods, able divine immortals. (translated).",
      "context": {
        "previous": "其後治裝行，東入海，求其師云。"
      }
    },
    {
      "id": "s0144",
      "type": "paragraph",
      "chinese": "其夏六月中，汾陰巫錦為民祠魏脽后土營旁，見地如鉤狀，掊視得鼎。",
      "literal": "That summer sixth month middle, Fenyin witch Jin for people sacrificed Wei Chong Houtu camp side, saw ground like hook shape, threw down inspected obtained tripod.",
      "idiomatic": "That summer sixth month middle, Fenyin witch Jin for people sacrificed Wei Chong Houtu camp side, saw ground like hook shape, threw down inspected obtained tripod. (translated).",
      "context": {
        "next": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。"
      }
    },
    {
      "id": "s0145",
      "type": "paragraph",
      "chinese": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。",
      "literal": "Tripod greatly different from crowd tripods, patterns carved no inscriptions, marveled it, told officials.",
      "idiomatic": "Tripod greatly different from crowd tripods, patterns carved no inscriptions, marveled it, told officials. (translated).",
      "context": {
        "previous": "其夏六月中，汾陰巫錦為民祠魏脽后土營旁，見地如鉤狀，掊視得鼎。",
        "next": "吏告河東太守勝，勝以聞。"
      }
    },
    {
      "id": "s0146",
      "type": "paragraph",
      "chinese": "吏告河東太守勝，勝以聞。",
      "literal": "Officials told Hedong grand administrator Sheng, Sheng with heard.",
      "idiomatic": "Officials told Hedong grand administrator Sheng, Sheng with heard. (translated).",
      "context": {
        "previous": "鼎大異於眾鼎，文鏤毋款識，怪之，言吏。",
        "next": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。"
      }
    },
    {
      "id": "s0147",
      "type": "paragraph",
      "chinese": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。",
      "literal": "Son of Heaven made envoy verified questioned witch Jin obtained tripod no illicit deceit, then with ritual sacrificed, welcomed tripod to Ganquan, followed journey, emperor offered it.",
      "idiomatic": "Son of Heaven made envoy verified questioned witch Jin obtained tripod no illicit deceit, then with ritual sacrificed, welcomed tripod to Ganquan, followed journey, emperor offered it. (translated).",
      "context": {
        "previous": "吏告河東太守勝，勝以聞。",
        "next": "至中山，晏溫，有黃雲蓋焉。"
      }
    },
    {
      "id": "s0148",
      "type": "paragraph",
      "chinese": "至中山，晏溫，有黃雲蓋焉。",
      "literal": "Arrived Zhongshan, peaceful warm, had yellow cloud covered there.",
      "idiomatic": "Arrived Zhongshan, peaceful warm, had yellow cloud covered there. (translated).",
      "context": {
        "previous": "天子使使驗問巫錦得鼎無姦詐，乃以禮祠，迎鼎至甘泉，從行，上薦之。",
        "next": "有麃過，上自射之，因以祭雲。"
      }
    },
    {
      "id": "s0149",
      "type": "paragraph",
      "chinese": "有麃過，上自射之，因以祭雲。",
      "literal": "Had mi deer passed, emperor personally shot it, by means sacrificed cloud.",
      "idiomatic": "Had mi deer passed, emperor personally shot it, by means sacrificed cloud. (translated).",
      "context": {
        "previous": "至中山，晏溫，有黃雲蓋焉。",
        "next": "至長安，公卿大夫皆議請尊寶鼎。"
      }
    },
    {
      "id": "s0150",
      "type": "paragraph",
      "chinese": "至長安，公卿大夫皆議請尊寶鼎。",
      "literal": "Arrived Chang'an, ministers marquises grandees all discussed requested honored treasured tripod.",
      "idiomatic": "Arrived Chang'an, ministers marquises grandees all discussed requested honored treasured tripod. (translated).",
      "context": {
        "previous": "有麃過，上自射之，因以祭雲。",
        "next": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。"
      }
    },
    {
      "id": "s0151",
      "type": "paragraph",
      "chinese": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。",
      "literal": "Son of Heaven said: 'Recently Yellow River overflowed, years several not abundant, therefore toured sacrificed Houtu, prayed for commoners grew grain.",
      "idiomatic": "Son of Heaven said: 'Recently Yellow River overflowed, years several not abundant, therefore toured sacrificed Houtu, prayed for commoners grew grain. (translated).",
      "context": {
        "previous": "至長安，公卿大夫皆議請尊寶鼎。",
        "next": "今年豐廡未有報，鼎曷為出哉？」"
      }
    },
    {
      "id": "s0152",
      "type": "paragraph",
      "chinese": "今年豐廡未有報，鼎曷為出哉？」",
      "literal": "This year abundant granaries not had report, tripod why for come out question?'",
      "idiomatic": "This year abundant granaries not had report, tripod why for come out question?' (translated).",
      "context": {
        "previous": "天子曰：「閒者河溢，歲數不登，故巡祭后土，祈為百姓育穀。",
        "next": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。"
      }
    },
    {
      "id": "s0153",
      "type": "paragraph",
      "chinese": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。",
      "literal": "Officials all said: 'Heard formerly Great Emperor raised divine tripod one, one is unified, heaven earth ten thousand things what tied end also.",
      "idiomatic": "Officials all said: 'Heard formerly Great Emperor raised divine tripod one, one is unified, heaven earth ten thousand things what tied end also. (translated).",
      "context": {
        "previous": "今年豐廡未有報，鼎曷為出哉？」",
        "next": "黃帝作寶鼎三，象天地人也。"
      }
    },
    {
      "id": "s0154",
      "type": "paragraph",
      "chinese": "黃帝作寶鼎三，象天地人也。",
      "literal": "Yellow Emperor made treasured tripods three, symbolized heaven earth person.",
      "idiomatic": "Yellow Emperor made treasured tripods three, symbolized heaven earth person. (translated).",
      "context": {
        "previous": "有司皆曰：「聞昔大帝興神鼎一，一者一統，天地萬物所系終也。",
        "next": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。"
      }
    },
    {
      "id": "s0155",
      "type": "paragraph",
      "chinese": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。",
      "literal": "Yu collected nine regions gold, cast nine tripods, all once li cooked Supreme Deity ghosts spirits.",
      "idiomatic": "Yu collected nine regions gold, cast nine tripods, all once li cooked Supreme Deity ghosts spirits. (translated).",
      "context": {
        "previous": "黃帝作寶鼎三，象天地人也。",
        "next": "遭聖則興，遷于夏商。"
      }
    },
    {
      "id": "s0156",
      "type": "paragraph",
      "chinese": "遭聖則興，遷于夏商。",
      "literal": "Encountered sages then arose, moved to Xia Shang.",
      "idiomatic": "Encountered sages then arose, moved to Xia Shang. (translated).",
      "context": {
        "previous": "禹收九牧之金，鑄九鼎，皆嘗鬺烹上帝鬼神。",
        "next": "周德衰，宋之社亡，鼎乃淪伏而不見。"
      }
    },
    {
      "id": "s0157",
      "type": "paragraph",
      "chinese": "周德衰，宋之社亡，鼎乃淪伏而不見。",
      "literal": "Zhou virtue declined, Song altars perished, tripod then sank hid not seen.",
      "idiomatic": "Zhou virtue declined, Song altars perished, tripod then sank hid not seen. (translated).",
      "context": {
        "previous": "遭聖則興，遷于夏商。",
        "next": "頌云『自堂徂基，自羊徂牛；"
      }
    },
    {
      "id": "s0158",
      "type": "paragraph",
      "chinese": "頌云『自堂徂基，自羊徂牛；",
      "literal": "Ode says 'from hall to foundation, from sheep to ox;",
      "idiomatic": "Ode says 'from hall to foundation, from sheep to ox; (translated).",
      "context": {
        "previous": "周德衰，宋之社亡，鼎乃淪伏而不見。",
        "next": "鼐鼎及鼒，不虞不驁，胡考之休』。"
      }
    },
    {
      "id": "s0159",
      "type": "paragraph",
      "chinese": "鼐鼎及鼒，不虞不驁，胡考之休』。",
      "literal": "Nai tripods and gui, not unexpected not startled, how long-lasting happiness.'",
      "idiomatic": "Nai tripods and gui, not unexpected not startled, how long-lasting happiness.' (translated).",
      "context": {
        "previous": "頌云『自堂徂基，自羊徂牛；",
        "next": "今鼎至甘泉，光潤龍變，承休無疆。"
      }
    },
    {
      "id": "s0160",
      "type": "paragraph",
      "chinese": "今鼎至甘泉，光潤龍變，承休無疆。",
      "literal": "Now tripod arrived Ganquan, light moist dragon changed, received blessing boundless.",
      "idiomatic": "Now tripod arrived Ganquan, light moist dragon changed, received blessing boundless. (translated).",
      "context": {
        "previous": "鼐鼎及鼒，不虞不驁，胡考之休』。",
        "next": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。"
      }
    },
    {
      "id": "s0161",
      "type": "paragraph",
      "chinese": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。",
      "literal": "United this Zhongshan, had yellow white clouds descended covered, like beasts made talismans, road bows carriage arrows, gathered obtained altar below, reported sacrifice great feasting.",
      "idiomatic": "United this Zhongshan, had yellow white clouds descended covered, like beasts made talismans, road bows carriage arrows, gathered obtained altar below, reported sacrifice great feasting. (translated).",
      "context": {
        "previous": "今鼎至甘泉，光潤龍變，承休無疆。",
        "next": "惟受命而帝者心知其意而合德焉。"
      }
    },
    {
      "id": "s0162",
      "type": "paragraph",
      "chinese": "惟受命而帝者心知其意而合德焉。",
      "literal": "Only received mandate yet emperor heart knew its intention yet united virtue there.",
      "idiomatic": "Only received mandate yet emperor heart knew its intention yet united virtue there. (translated).",
      "context": {
        "previous": "合茲中山，有黃白雲降蓋，若獸為符，路弓乘矢，集獲壇下，報祠大饗。",
        "next": "鼎宜見於祖禰，藏於帝廷，以合明應。」"
      }
    },
    {
      "id": "s0163",
      "type": "paragraph",
      "chinese": "鼎宜見於祖禰，藏於帝廷，以合明應。」",
      "literal": "Tripod should appear at ancestral temples, stored at imperial court, to unite bright response.'",
      "idiomatic": "Tripod should appear at ancestral temples, stored at imperial court, to unite bright response.' (translated).",
      "context": {
        "previous": "惟受命而帝者心知其意而合德焉。",
        "next": "制曰：「可。」"
      }
    },
    {
      "id": "s0164",
      "type": "paragraph",
      "chinese": "制曰：「可。」",
      "literal": "Imperial edict said: 'Permitted.'",
      "idiomatic": "Imperial edict said: 'Permitted.' (translated).",
      "context": {
        "previous": "鼎宜見於祖禰，藏於帝廷，以合明應。」"
      }
    },
    {
      "id": "s0165",
      "type": "paragraph",
      "chinese": "入海求蓬萊者，言蓬萊不遠，而不能至者，殆不見其氣。",
      "literal": "Entered sea sought Penglai people, spoke Penglai not far, yet cannot arrive people, probably not saw its qi.",
      "idiomatic": "Entered sea sought Penglai people, spoke Penglai not far, yet cannot arrive people, probably not saw its qi. (translated).",
      "context": {
        "next": "上乃遣望氣佐侯其氣雲。"
      }
    },
    {
      "id": "s0166",
      "type": "paragraph",
      "chinese": "上乃遣望氣佐侯其氣雲。",
      "literal": "Emperor then dispatched qi gazer assistant marquis its qi clouds.",
      "idiomatic": "Emperor then dispatched qi gazer assistant marquis its qi clouds. (translated).",
      "context": {
        "previous": "入海求蓬萊者，言蓬萊不遠，而不能至者，殆不見其氣。"
      }
    },
    {
      "id": "s0167",
      "type": "paragraph",
      "chinese": "其秋，上幸雍，且郊。",
      "literal": "That autumn, emperor fortunate Yong, about suburban sacrifice.",
      "idiomatic": "That autumn, emperor fortunate Yong, about suburban sacrifice. (translated).",
      "context": {
        "next": "或曰「五帝，泰一之佐也。"
      }
    },
    {
      "id": "s0168",
      "type": "paragraph",
      "chinese": "或曰「五帝，泰一之佐也。",
      "literal": "Some said 'Five Emperors, Taiyi assistants also.",
      "idiomatic": "Some said 'Five Emperors, Taiyi assistants also. (translated).",
      "context": {
        "previous": "其秋，上幸雍，且郊。",
        "next": "宜立泰一而上親郊之」。"
      }
    },
    {
      "id": "s0169",
      "type": "paragraph",
      "chinese": "宜立泰一而上親郊之」。",
      "literal": "Should establish Taiyi and emperor personally suburban sacrifice it.'",
      "idiomatic": "Should establish Taiyi and emperor personally suburban sacrifice it.' (translated).",
      "context": {
        "previous": "或曰「五帝，泰一之佐也。",
        "next": "上疑未定。"
      }
    },
    {
      "id": "s0170",
      "type": "paragraph",
      "chinese": "上疑未定。",
      "literal": "Emperor doubted not decided.",
      "idiomatic": "Emperor doubted not decided. (translated).",
      "context": {
        "previous": "宜立泰一而上親郊之」。",
        "next": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」"
      }
    },
    {
      "id": "s0171",
      "type": "paragraph",
      "chinese": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」",
      "literal": "Qi person Gongsun Qing said: 'This year obtained treasured tripod, its winter xinsi new moon dawn winter solstice, with Yellow Emperor time equal.'",
      "idiomatic": "Qi person Gongsun Qing said: 'This year obtained treasured tripod, its winter xinsi new moon dawn winter solstice, with Yellow Emperor time equal.' (translated).",
      "context": {
        "previous": "上疑未定。",
        "next": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。"
      }
    },
    {
      "id": "s0172",
      "type": "paragraph",
      "chinese": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。",
      "literal": "Qing had bamboo book said: 'Yellow Emperor obtained treasured tripod Wan Qu, asked Guiyu Qu.",
      "idiomatic": "Qing had bamboo book said: 'Yellow Emperor obtained treasured tripod Wan Qu, asked Guiyu Qu. (translated).",
      "context": {
        "previous": "齊人公孫卿曰：「今年得寶鼎，其冬辛巳朔旦冬至，與黃帝時等。」",
        "next": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』"
      }
    },
    {
      "id": "s0173",
      "type": "paragraph",
      "chinese": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』",
      "literal": "Qu replied said: 'Emperor obtained treasured tripod divine tally, this year jiyou new moon dawn winter solstice, obtained heaven's chronicle, ends yet repeats begins.'",
      "idiomatic": "Qu replied said: 'Emperor obtained treasured tripod divine tally, this year jiyou new moon dawn winter solstice, obtained heaven's chronicle, ends yet repeats begins.' (translated).",
      "context": {
        "previous": "卿有札書曰：「黃帝得寶鼎宛（侯）［朐］，問於鬼臾區。",
        "next": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。"
      }
    },
    {
      "id": "s0174",
      "type": "paragraph",
      "chinese": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。",
      "literal": "Thereupon Yellow Emperor welcomed sun pushed tally, afterward rate twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years.",
      "idiomatic": "Thereupon Yellow Emperor welcomed sun pushed tally, afterward rate twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years. (translated).",
      "context": {
        "previous": "區對曰：『（黃）帝得寶鼎神筴，是歲己酉朔旦冬至，得天之紀，終而復始。』",
        "next": "黃帝僊登于天。」"
      }
    },
    {
      "id": "s0175",
      "type": "paragraph",
      "chinese": "黃帝僊登于天。」",
      "literal": "Yellow Emperor immortal ascended heaven.'",
      "idiomatic": "Yellow Emperor immortal ascended heaven.' (translated).",
      "context": {
        "previous": "於是黃帝迎日推筴，後率二十歲得朔旦冬至，凡二十推，三百八十年。",
        "next": "卿因所忠欲奏之。"
      }
    },
    {
      "id": "s0176",
      "type": "paragraph",
      "chinese": "卿因所忠欲奏之。",
      "literal": "Qing because Suo Zhong wished memorialize it.",
      "idiomatic": "Qing because Suo Zhong wished memorialize it. (translated).",
      "context": {
        "previous": "黃帝僊登于天。」",
        "next": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」"
      }
    },
    {
      "id": "s0177",
      "type": "paragraph",
      "chinese": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」",
      "literal": "Suo Zhong saw his book not orthodox, doubted its false book, declined said: 'Treasured tripod matter already decided, still what to do!'",
      "idiomatic": "Suo Zhong saw his book not orthodox, doubted its false book, declined said: 'Treasured tripod matter already decided, still what to do!' (translated).",
      "context": {
        "previous": "卿因所忠欲奏之。",
        "next": "卿因嬖人奏之。"
      }
    },
    {
      "id": "s0178",
      "type": "paragraph",
      "chinese": "卿因嬖人奏之。",
      "literal": "Qing because favorite person memorialized it.",
      "idiomatic": "Qing because favorite person memorialized it. (translated).",
      "context": {
        "previous": "所忠視其書不經，疑其妄書，謝曰：「寶鼎事已決矣，尚何以為！」",
        "next": "上大說，召問卿。"
      }
    },
    {
      "id": "s0179",
      "type": "paragraph",
      "chinese": "上大說，召問卿。",
      "literal": "Emperor greatly pleased, summoned questioned Qing.",
      "idiomatic": "Emperor greatly pleased, summoned questioned Qing. (translated).",
      "context": {
        "previous": "卿因嬖人奏之。",
        "next": "對曰：「受此書申功，申功已死。」"
      }
    },
    {
      "id": "s0180",
      "type": "paragraph",
      "chinese": "對曰：「受此書申功，申功已死。」",
      "literal": "Replied said: 'Received this book Shen Gong, Shen Gong already dead.'",
      "idiomatic": "Replied said: 'Received this book Shen Gong, Shen Gong already dead.' (translated).",
      "context": {
        "previous": "上大說，召問卿。",
        "next": "上曰：「申功何人也？」"
      }
    },
    {
      "id": "s0181",
      "type": "paragraph",
      "chinese": "上曰：「申功何人也？」",
      "literal": "Emperor said: 'Shen Gong what person also?'",
      "idiomatic": "Emperor said: 'Shen Gong what person also?' (translated).",
      "context": {
        "previous": "對曰：「受此書申功，申功已死。」",
        "next": "卿曰：「申功，齊人也。"
      }
    },
    {
      "id": "s0182",
      "type": "paragraph",
      "chinese": "卿曰：「申功，齊人也。",
      "literal": "Qing said: 'Shen Gong, Qi person also.",
      "idiomatic": "Qing said: 'Shen Gong, Qi person also. (translated).",
      "context": {
        "previous": "上曰：「申功何人也？」",
        "next": "與安期生通，受黃帝言，無書，獨有此鼎書。"
      }
    },
    {
      "id": "s0183",
      "type": "paragraph",
      "chinese": "與安期生通，受黃帝言，無書，獨有此鼎書。",
      "literal": "With An Qisheng communicated, received Yellow Emperor words, no book, alone had this tripod book.",
      "idiomatic": "With An Qisheng communicated, received Yellow Emperor words, no book, alone had this tripod book. (translated).",
      "context": {
        "previous": "卿曰：「申功，齊人也。",
        "next": "曰『漢興復當黃帝之時。"
      }
    },
    {
      "id": "s0184",
      "type": "paragraph",
      "chinese": "曰『漢興復當黃帝之時。",
      "literal": "Said 'Han rise again should Yellow Emperor time.",
      "idiomatic": "Said 'Han rise again should Yellow Emperor time. (translated).",
      "context": {
        "previous": "與安期生通，受黃帝言，無書，獨有此鼎書。",
        "next": "漢之聖者在高祖之孫且曾孫也。"
      }
    },
    {
      "id": "s0185",
      "type": "paragraph",
      "chinese": "漢之聖者在高祖之孫且曾孫也。",
      "literal": "Han sage is Gaozu grandson and great grandson also.",
      "idiomatic": "Han sage is Gaozu grandson and great grandson also. (translated).",
      "context": {
        "previous": "曰『漢興復當黃帝之時。",
        "next": "寶鼎出而與神通，封禪。"
      }
    },
    {
      "id": "s0186",
      "type": "paragraph",
      "chinese": "寶鼎出而與神通，封禪。",
      "literal": "Treasured tripod emerges yet with spirits communicates, fengshan.",
      "idiomatic": "Treasured tripod emerges yet with spirits communicates, fengshan. (translated).",
      "context": {
        "previous": "漢之聖者在高祖之孫且曾孫也。",
        "next": "封禪七十二王，唯黃帝得上泰山封』。"
      }
    },
    {
      "id": "s0187",
      "type": "paragraph",
      "chinese": "封禪七十二王，唯黃帝得上泰山封』。",
      "literal": "Fengshan seventy two kings, only Yellow Emperor able ascend Taishan seal.'",
      "idiomatic": "Fengshan seventy two kings, only Yellow Emperor able ascend Taishan seal.' (translated).",
      "context": {
        "previous": "寶鼎出而與神通，封禪。",
        "next": "申功曰：『漢主亦當上封，上封則能僊登天矣。"
      }
    },
    {
      "id": "s0188",
      "type": "paragraph",
      "chinese": "申功曰：『漢主亦當上封，上封則能僊登天矣。",
      "literal": "Shen Gong said: 'Han lord also should ascend seal, ascend seal then able immortal ascend heaven.'",
      "idiomatic": "Shen Gong said: 'Han lord also should ascend seal, ascend seal then able immortal ascend heaven.' (translated).",
      "context": {
        "previous": "封禪七十二王，唯黃帝得上泰山封』。",
        "next": "黃帝時萬諸侯，而神靈之封居七千。"
      }
    },
    {
      "id": "s0189",
      "type": "paragraph",
      "chinese": "黃帝時萬諸侯，而神靈之封居七千。",
      "literal": "Yellow Emperor time ten thousand feudal lords, yet divine spirits seals resided seven thousand.",
      "idiomatic": "Yellow Emperor time ten thousand feudal lords, yet divine spirits seals resided seven thousand. (translated).",
      "context": {
        "previous": "申功曰：『漢主亦當上封，上封則能僊登天矣。",
        "next": "天下名山八，而三在蠻夷，五在中國。"
      }
    },
    {
      "id": "s0190",
      "type": "paragraph",
      "chinese": "天下名山八，而三在蠻夷，五在中國。",
      "literal": "Realm famous mountains eight, yet three in barbarian yi, five in central states.",
      "idiomatic": "Realm famous mountains eight, yet three in barbarian yi, five in central states. (translated).",
      "context": {
        "previous": "黃帝時萬諸侯，而神靈之封居七千。",
        "next": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。"
      }
    },
    {
      "id": "s0191",
      "type": "paragraph",
      "chinese": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。",
      "literal": "Central states Huashan, Shoushan, Taishi, Taishan, Donglai, these five mountains Yellow Emperor what often toured, with spirits met.",
      "idiomatic": "Central states Huashan, Shoushan, Taishi, Taishan, Donglai, these five mountains Yellow Emperor what often toured, with spirits met. (translated).",
      "context": {
        "previous": "天下名山八，而三在蠻夷，五在中國。",
        "next": "黃帝且戰且學僊。"
      }
    },
    {
      "id": "s0192",
      "type": "paragraph",
      "chinese": "黃帝且戰且學僊。",
      "literal": "Yellow Emperor moreover fought moreover learned immortals.",
      "idiomatic": "Yellow Emperor moreover fought moreover learned immortals. (translated).",
      "context": {
        "previous": "中國華山、首山、太室、泰山、東萊，此五山黃帝之所常遊，與神會。",
        "next": "患百姓非其道，乃斷斬非鬼神者。"
      }
    },
    {
      "id": "s0193",
      "type": "paragraph",
      "chinese": "患百姓非其道，乃斷斬非鬼神者。",
      "literal": "Worried commoners not his way, then judged executed not ghosts spirits ones.",
      "idiomatic": "Worried commoners not his way, then judged executed not ghosts spirits ones. (translated).",
      "context": {
        "previous": "黃帝且戰且學僊。",
        "next": "百餘歲然後得與神通。"
      }
    },
    {
      "id": "s0194",
      "type": "paragraph",
      "chinese": "百餘歲然後得與神通。",
      "literal": "Hundred remaining years then able with spirits communicate.",
      "idiomatic": "Hundred remaining years then able with spirits communicate. (translated).",
      "context": {
        "previous": "患百姓非其道，乃斷斬非鬼神者。",
        "next": "黃帝郊雍上帝，宿三月。"
      }
    },
    {
      "id": "s0195",
      "type": "paragraph",
      "chinese": "黃帝郊雍上帝，宿三月。",
      "literal": "Yellow Emperor suburban Yong Supreme Deity, lodged three months.",
      "idiomatic": "Yellow Emperor suburban Yong Supreme Deity, lodged three months. (translated).",
      "context": {
        "previous": "百餘歲然後得與神通。",
        "next": "鬼臾區號大鴻，死葬雍，故鴻冢是也。"
      }
    },
    {
      "id": "s0196",
      "type": "paragraph",
      "chinese": "鬼臾區號大鴻，死葬雍，故鴻冢是也。",
      "literal": "Guiyu Qu styled Great Hong, died buried Yong, therefore Hong tomb is also.",
      "idiomatic": "Guiyu Qu styled Great Hong, died buried Yong, therefore Hong tomb is also. (translated).",
      "context": {
        "previous": "黃帝郊雍上帝，宿三月。",
        "next": "其後於黃帝接萬靈明廷。"
      }
    },
    {
      "id": "s0197",
      "type": "paragraph",
      "chinese": "其後於黃帝接萬靈明廷。",
      "literal": "Its afterward at Yellow Emperor connected ten thousand spirits bright court.",
      "idiomatic": "Its afterward at Yellow Emperor connected ten thousand spirits bright court. (translated).",
      "context": {
        "previous": "鬼臾區號大鴻，死葬雍，故鴻冢是也。",
        "next": "明廷者，甘泉也。"
      }
    },
    {
      "id": "s0198",
      "type": "paragraph",
      "chinese": "明廷者，甘泉也。",
      "literal": "Bright court is, Ganquan also.",
      "idiomatic": "Bright court is, Ganquan also. (translated).",
      "context": {
        "previous": "其後於黃帝接萬靈明廷。",
        "next": "所謂寒門者，谷口也。"
      }
    },
    {
      "id": "s0199",
      "type": "paragraph",
      "chinese": "所謂寒門者，谷口也。",
      "literal": "So called cold gate is, valley mouth also.",
      "idiomatic": "So called cold gate is, valley mouth also. (translated).",
      "context": {
        "previous": "明廷者，甘泉也。",
        "next": "黃帝采首山銅，鑄鼎荊山下。"
      }
    },
    {
      "id": "s0200",
      "type": "paragraph",
      "chinese": "黃帝采首山銅，鑄鼎荊山下。",
      "literal": "Yellow Emperor collected Shoushan copper, cast tripod Jing mountain below.",
      "idiomatic": "Yellow Emperor collected Shoushan copper, cast tripod Jing mountain below. (translated).",
      "context": {
        "previous": "所謂寒門者，谷口也。",
        "next": "鼎既成，有龍垂胡髯下迎黃帝。"
      }
    },
    {
      "id": "s0201",
      "type": "paragraph",
      "chinese": "鼎既成，有龍垂胡髯下迎黃帝。",
      "literal": "Tripod already completed, had dragon hung beard whiskers below welcomed Yellow Emperor.",
      "idiomatic": "Tripod already completed, had dragon hung beard whiskers below welcomed Yellow Emperor. (translated).",
      "context": {
        "previous": "黃帝采首山銅，鑄鼎荊山下。",
        "next": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。"
      }
    },
    {
      "id": "s0202",
      "type": "paragraph",
      "chinese": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。",
      "literal": "Yellow Emperor mounted rode, ministers harem followed ascended dragon seventy remaining people, then went up.",
      "idiomatic": "Yellow Emperor mounted rode, ministers harem followed ascended dragon seventy remaining people, then went up. (translated).",
      "context": {
        "previous": "鼎既成，有龍垂胡髯下迎黃帝。",
        "next": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。"
      }
    },
    {
      "id": "s0203",
      "type": "paragraph",
      "chinese": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。",
      "literal": "Remaining small ministers not able ascend, then all held dragon whiskers, dragon whiskers pulled, fell Yellow Emperor bow.",
      "idiomatic": "Remaining small ministers not able ascend, then all held dragon whiskers, dragon whiskers pulled, fell Yellow Emperor bow. (translated).",
      "context": {
        "previous": "黃帝上騎，群臣後宮從上龍七十餘人，乃上去。",
        "next": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。"
      }
    },
    {
      "id": "s0204",
      "type": "paragraph",
      "chinese": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。",
      "literal": "Commoners upward gazed Yellow Emperor already ascended heaven, then embraced his bow with dragon beard whiskers wailed.",
      "idiomatic": "Commoners upward gazed Yellow Emperor already ascended heaven, then embraced his bow with dragon beard whiskers wailed. (translated).",
      "context": {
        "previous": "餘小臣不得上，乃悉持龍髯，龍髯拔，墮黃帝之弓。",
        "next": "故後世因名其處曰鼎湖，其弓曰烏號。』」"
      }
    },
    {
      "id": "s0205",
      "type": "paragraph",
      "chinese": "故後世因名其處曰鼎湖，其弓曰烏號。』」",
      "literal": "Therefore later generations because named that place Ding lake, his bow Wu call.''",
      "idiomatic": "Therefore later generations because named that place Ding lake, his bow Wu call.'' (translated).",
      "context": {
        "previous": "百姓仰望黃帝既上天，乃抱其弓與龍胡髯號。",
        "next": "於是天子曰：「嗟乎！"
      }
    },
    {
      "id": "s0206",
      "type": "paragraph",
      "chinese": "於是天子曰：「嗟乎！",
      "literal": "Thereupon Son of Heaven said: 'Alas!",
      "idiomatic": "Thereupon Son of Heaven said: 'Alas! (translated).",
      "context": {
        "previous": "故後世因名其處曰鼎湖，其弓曰烏號。』」",
        "next": "吾誠得如黃帝，吾視去妻子如脫屣耳。」"
      }
    },
    {
      "id": "s0207",
      "type": "paragraph",
      "chinese": "吾誠得如黃帝，吾視去妻子如脫屣耳。」",
      "literal": "I truly able like Yellow Emperor, I regard leaving wife children like removing shoes.'",
      "idiomatic": "I truly able like Yellow Emperor, I regard leaving wife children like removing shoes.' (translated).",
      "context": {
        "previous": "於是天子曰：「嗟乎！",
        "next": "乃拜卿為郎，東使候神於太室。"
      }
    },
    {
      "id": "s0208",
      "type": "paragraph",
      "chinese": "乃拜卿為郎，東使候神於太室。",
      "literal": "Then appointed Qing as lang, east sent await spirits at Taishi.",
      "idiomatic": "Then appointed Qing as lang, east sent await spirits at Taishi. (translated).",
      "context": {
        "previous": "吾誠得如黃帝，吾視去妻子如脫屣耳。」"
      }
    },
    {
      "id": "s0209",
      "type": "paragraph",
      "chinese": "上遂郊雍，至隴西，西登空桐，幸甘泉。",
      "literal": "Emperor then suburban Yong, arrived Longxi, west ascended Kongtong, fortunate Ganquan.",
      "idiomatic": "Emperor then suburban Yong, arrived Longxi, west ascended Kongtong, fortunate Ganquan. (translated).",
      "context": {
        "next": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。"
      }
    },
    {
      "id": "s0210",
      "type": "paragraph",
      "chinese": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。",
      "literal": "Ordered sacrifice officials Kuanshu etc prepare Taiyi sacrifice altar, altar modeled Boji Taiyi altar, altar three layers.",
      "idiomatic": "Ordered sacrifice officials Kuanshu etc prepare Taiyi sacrifice altar, altar modeled Boji Taiyi altar, altar three layers. (translated).",
      "context": {
        "previous": "上遂郊雍，至隴西，西登空桐，幸甘泉。",
        "next": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。"
      }
    },
    {
      "id": "s0211",
      "type": "paragraph",
      "chinese": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。",
      "literal": "Five Emperors altars encircled resided its below, each like their directions, Yellow Emperor southwest, except eight through ghost paths.",
      "idiomatic": "Five Emperors altars encircled resided its below, each like their directions, Yellow Emperor southwest, except eight through ghost paths. (translated).",
      "context": {
        "previous": "令祠官寬舒等具泰一祠壇，壇放薄忌泰一壇，壇三垓。",
        "next": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。"
      }
    },
    {
      "id": "s0212",
      "type": "paragraph",
      "chinese": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。",
      "literal": "Taiyi what used, like Yong one altar things, yet added sweet wine dates dried meat kind, killed one yak ox to make sacrificial vessels ritual implements.",
      "idiomatic": "Taiyi what used, like Yong one altar things, yet added sweet wine dates dried meat kind, killed one yak ox to make sacrificial vessels ritual implements. (translated).",
      "context": {
        "previous": "五帝壇環居其下，各如其方，黃帝西南，除八通鬼道。",
        "next": "而五帝獨有俎豆醴進。"
      }
    },
    {
      "id": "s0213",
      "type": "paragraph",
      "chinese": "而五帝獨有俎豆醴進。",
      "literal": "Yet Five Emperors alone had sacrificial vessels sweet wine advanced.",
      "idiomatic": "Yet Five Emperors alone had sacrificial vessels sweet wine advanced. (translated).",
      "context": {
        "previous": "泰一所用，如雍一畤物，而加醴棗脯之屬，殺一牦牛以為俎豆牢具。",
        "next": "其下四方地，為餟食群神從者及北斗云。"
      }
    },
    {
      "id": "s0214",
      "type": "paragraph",
      "chinese": "其下四方地，為餟食群神從者及北斗云。",
      "literal": "Its below four directions earth, for meal food crowd spirits followers and Northern Dipper clouds.",
      "idiomatic": "Its below four directions earth, for meal food crowd spirits followers and Northern Dipper clouds. (translated).",
      "context": {
        "previous": "而五帝獨有俎豆醴進。",
        "next": "已祠，胙餘皆燎之。"
      }
    },
    {
      "id": "s0215",
      "type": "paragraph",
      "chinese": "已祠，胙餘皆燎之。",
      "literal": "Already sacrificed, sacrificial meat remains all burned them.",
      "idiomatic": "Already sacrificed, sacrificial meat remains all burned them. (translated).",
      "context": {
        "previous": "其下四方地，為餟食群神從者及北斗云。",
        "next": "其牛色白，鹿居其中，彘在鹿中，水而洎之。"
      }
    },
    {
      "id": "s0216",
      "type": "paragraph",
      "chinese": "其牛色白，鹿居其中，彘在鹿中，水而洎之。",
      "literal": "Its ox color white, deer resided its middle, pigs in deer middle, water yet pour it.",
      "idiomatic": "Its ox color white, deer resided its middle, pigs in deer middle, water yet pour it. (translated).",
      "context": {
        "previous": "已祠，胙餘皆燎之。",
        "next": "祭日以牛，祭月以羊彘特。"
      }
    },
    {
      "id": "s0217",
      "type": "paragraph",
      "chinese": "祭日以牛，祭月以羊彘特。",
      "literal": "Sacrifice sun with ox, sacrifice moon with sheep pigs single.",
      "idiomatic": "Sacrifice sun with ox, sacrifice moon with sheep pigs single. (translated).",
      "context": {
        "previous": "其牛色白，鹿居其中，彘在鹿中，水而洎之。",
        "next": "泰一祝宰則衣紫及繡。"
      }
    },
    {
      "id": "s0218",
      "type": "paragraph",
      "chinese": "泰一祝宰則衣紫及繡。",
      "literal": "Taiyi prayer butcher then clothed purple and embroidery.",
      "idiomatic": "Taiyi prayer butcher then clothed purple and embroidery. (translated).",
      "context": {
        "previous": "祭日以牛，祭月以羊彘特。",
        "next": "五帝各如其色，日赤，月白。"
      }
    },
    {
      "id": "s0219",
      "type": "paragraph",
      "chinese": "五帝各如其色，日赤，月白。",
      "literal": "Five Emperors each like their colors, sun red, moon white.",
      "idiomatic": "Five Emperors each like their colors, sun red, moon white. (translated).",
      "context": {
        "previous": "泰一祝宰則衣紫及繡。"
      }
    },
    {
      "id": "s0220",
      "type": "paragraph",
      "chinese": "十一月辛已朔旦冬至，昧爽，天子始郊拜泰一。",
      "literal": "Eleventh month xinsi new moon dawn winter solstice, before dawn bright, Son of Heaven first suburban bowed Taiyi.",
      "idiomatic": "Eleventh month xinsi new moon dawn winter solstice, before dawn bright, Son of Heaven first suburban bowed Taiyi. (translated).",
      "context": {
        "next": "朝朝日，夕夕月，則揖；"
      }
    },
    {
      "id": "s0221",
      "type": "paragraph",
      "chinese": "朝朝日，夕夕月，則揖；",
      "literal": "Morning worship sun, evening worship moon, then bow;",
      "idiomatic": "Morning worship sun, evening worship moon, then bow; (translated).",
      "context": {
        "previous": "十一月辛已朔旦冬至，昧爽，天子始郊拜泰一。",
        "next": "而見泰一如雍禮。"
      }
    },
    {
      "id": "s0222",
      "type": "paragraph",
      "chinese": "而見泰一如雍禮。",
      "literal": "Yet see Taiyi like Yong ritual.",
      "idiomatic": "Yet see Taiyi like Yong ritual. (translated).",
      "context": {
        "previous": "朝朝日，夕夕月，則揖；",
        "next": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」"
      }
    },
    {
      "id": "s0223",
      "type": "paragraph",
      "chinese": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」",
      "literal": "Its assist feast said: 'Heaven first with treasured tripod divine tally bestowed emperor, new moon and again new moon, ends yet repeats begins, emperor respectfully bows sees there.'",
      "idiomatic": "Its assist feast said: 'Heaven first with treasured tripod divine tally bestowed emperor, new moon and again new moon, ends yet repeats begins, emperor respectfully bows sees there.' (translated).",
      "context": {
        "previous": "而見泰一如雍禮。",
        "next": "而衣上黃。"
      }
    },
    {
      "id": "s0224",
      "type": "paragraph",
      "chinese": "而衣上黃。",
      "literal": "Yet clothed above yellow.",
      "idiomatic": "Yet clothed above yellow. (translated).",
      "context": {
        "previous": "其贊饗曰：「天始以寶鼎神筴授皇帝，朔而又朔，終而復始，皇帝敬拜見焉。」",
        "next": "其祠列火滿壇，壇旁烹炊具。"
      }
    },
    {
      "id": "s0225",
      "type": "paragraph",
      "chinese": "其祠列火滿壇，壇旁烹炊具。",
      "literal": "Its sacrifice arranged fires filled altar, altar side cooking implements.",
      "idiomatic": "Its sacrifice arranged fires filled altar, altar side cooking implements. (translated).",
      "context": {
        "previous": "而衣上黃。",
        "next": "有司云「祠上有光焉」。"
      }
    },
    {
      "id": "s0226",
      "type": "paragraph",
      "chinese": "有司云「祠上有光焉」。",
      "literal": "Officials said 'sacrifice above has light there.'",
      "idiomatic": "Officials said 'sacrifice above has light there.' (translated).",
      "context": {
        "previous": "其祠列火滿壇，壇旁烹炊具。",
        "next": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。"
      }
    },
    {
      "id": "s0227",
      "type": "paragraph",
      "chinese": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。",
      "literal": "Dukes ministers said 'emperor first suburban saw Taiyi Yunyang, officials presented jade good livestock recommended feast.",
      "idiomatic": "Dukes ministers said 'emperor first suburban saw Taiyi Yunyang, officials presented jade good livestock recommended feast. (translated).",
      "context": {
        "previous": "有司云「祠上有光焉」。",
        "next": "是夜有美光，及晝，黃氣上屬天。」"
      }
    },
    {
      "id": "s0228",
      "type": "paragraph",
      "chinese": "是夜有美光，及晝，黃氣上屬天。」",
      "literal": "That night had beautiful light, and day, yellow qi upward connected heaven.'",
      "idiomatic": "That night had beautiful light, and day, yellow qi upward connected heaven.' (translated).",
      "context": {
        "previous": "公卿言「皇帝始郊見泰一雲陽，有司奉瑄玉嘉牲薦饗。",
        "next": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。"
      }
    },
    {
      "id": "s0229",
      "type": "paragraph",
      "chinese": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。",
      "literal": "Grand historian, sacrifice official Kuanshu etc said: 'Spirits auspiciousness, bless fortune omen good fortune, should because this place light domain establish Tai altar to bright response.",
      "idiomatic": "Grand historian, sacrifice official Kuanshu etc said: 'Spirits auspiciousness, bless fortune omen good fortune, should because this place light domain establish Tai altar to bright response. (translated).",
      "context": {
        "previous": "是夜有美光，及晝，黃氣上屬天。」",
        "next": "令太祝領，（祀）［秋］及臘閒祠。"
      }
    },
    {
      "id": "s0230",
      "type": "paragraph",
      "chinese": "令太祝領，（祀）［秋］及臘閒祠。",
      "literal": "Order grand prayer lead, autumn and lacquer between sacrifice.",
      "idiomatic": "Order grand prayer lead, autumn and lacquer between sacrifice. (translated).",
      "context": {
        "previous": "太史公、祠官寬舒等曰：「神靈之休，祐福兆祥，宜因此地光域立泰畤壇以明應。",
        "next": "三歲天子一郊見。」"
      }
    },
    {
      "id": "s0231",
      "type": "paragraph",
      "chinese": "三歲天子一郊見。」",
      "literal": "Three years Son of Heaven once suburban see.'",
      "idiomatic": "Three years Son of Heaven once suburban see.' (translated).",
      "context": {
        "previous": "令太祝領，（祀）［秋］及臘閒祠。"
      }
    },
    {
      "id": "s0232",
      "type": "paragraph",
      "chinese": "其秋，為伐南越，告禱泰一，以牡荊畫幡日月北斗登龍，以象天一三星，為泰一鋒，名曰「靈旗」。",
      "literal": "That autumn, for attacking Nanyue, informed prayed Taiyi, with male Jing painted banners sun moon Northern Dipper ascending dragon, to resemble Tianyi three stars, made Taiyi spearhead, named 'spirit banner.'",
      "idiomatic": "That autumn, for attacking Nanyue, informed prayed Taiyi, with male Jing painted banners sun moon Northern Dipper ascending dragon, to resemble Tianyi three stars, made Taiyi spearhead, named 'spirit banner.' (translated).",
      "context": {
        "next": "為兵禱，則太史奉以指所伐國。"
      }
    },
    {
      "id": "s0233",
      "type": "paragraph",
      "chinese": "為兵禱，則太史奉以指所伐國。",
      "literal": "For troops prayed, then grand scribe presented with pointed to attacked country.",
      "idiomatic": "For troops prayed, then grand scribe presented with pointed to attacked country. (translated).",
      "context": {
        "previous": "其秋，為伐南越，告禱泰一，以牡荊畫幡日月北斗登龍，以象天一三星，為泰一鋒，名曰「靈旗」。",
        "next": "而五利將軍使不敢入海，之泰山祠。"
      }
    },
    {
      "id": "s0234",
      "type": "paragraph",
      "chinese": "而五利將軍使不敢入海，之泰山祠。",
      "literal": "Yet Wuli general envoy not dare enter sea, went Taishan sacrifice.",
      "idiomatic": "Yet Wuli general envoy not dare enter sea, went Taishan sacrifice. (translated).",
      "context": {
        "previous": "為兵禱，則太史奉以指所伐國。",
        "next": "上使人微隨驗，實無所見。"
      }
    },
    {
      "id": "s0235",
      "type": "paragraph",
      "chinese": "上使人微隨驗，實無所見。",
      "literal": "Emperor made people secretly follow verify, truly nothing seen.",
      "idiomatic": "Emperor made people secretly follow verify, truly nothing seen. (translated).",
      "context": {
        "previous": "而五利將軍使不敢入海，之泰山祠。",
        "next": "五利妄言見其師，其方盡，多不讎。"
      }
    },
    {
      "id": "s0236",
      "type": "paragraph",
      "chinese": "五利妄言見其師，其方盡，多不讎。",
      "literal": "Wuli falsely spoke saw his master, his methods exhausted, many not match.",
      "idiomatic": "Wuli falsely spoke saw his master, his methods exhausted, many not match. (translated).",
      "context": {
        "previous": "上使人微隨驗，實無所見。",
        "next": "上乃誅五利。"
      }
    },
    {
      "id": "s0237",
      "type": "paragraph",
      "chinese": "上乃誅五利。",
      "literal": "Emperor then executed Wuli.",
      "idiomatic": "Emperor then executed Wuli. (translated).",
      "context": {
        "previous": "五利妄言見其師，其方盡，多不讎。"
      }
    },
    {
      "id": "s0238",
      "type": "paragraph",
      "chinese": "其冬，公孫卿候神河南，見僊人跡緱氏城上，有物若雉，往來城上。",
      "literal": "That winter, Gongsun Qing awaited spirits Henan south, saw immortal person traces Gou city above, had thing like pheasant, coming going city above.",
      "idiomatic": "That winter, Gongsun Qing awaited spirits Henan south, saw immortal person traces Gou city above, had thing like pheasant, coming going city above. (translated).",
      "context": {
        "next": "天子親幸緱氏城視跡。"
      }
    },
    {
      "id": "s0239",
      "type": "paragraph",
      "chinese": "天子親幸緱氏城視跡。",
      "literal": "Son of Heaven personally fortunate Gou city viewed traces.",
      "idiomatic": "Son of Heaven personally fortunate Gou city viewed traces. (translated).",
      "context": {
        "previous": "其冬，公孫卿候神河南，見僊人跡緱氏城上，有物若雉，往來城上。",
        "next": "問卿：「得毋效文成、五利乎？」"
      }
    },
    {
      "id": "s0240",
      "type": "paragraph",
      "chinese": "問卿：「得毋效文成、五利乎？」",
      "literal": "Asked Qing: 'Able not imitate Wencheng, Wuli huh?'",
      "idiomatic": "Asked Qing: 'Able not imitate Wencheng, Wuli huh?' (translated).",
      "context": {
        "previous": "天子親幸緱氏城視跡。",
        "next": "卿曰：「僊者非有求人主，人主求之。"
      }
    },
    {
      "id": "s0241",
      "type": "paragraph",
      "chinese": "卿曰：「僊者非有求人主，人主求之。",
      "literal": "Qing said: 'Immortals not have seek ruler, ruler seeks them.",
      "idiomatic": "Qing said: 'Immortals not have seek ruler, ruler seeks them. (translated).",
      "context": {
        "previous": "問卿：「得毋效文成、五利乎？」",
        "next": "其道非少寬假，神不來。"
      }
    },
    {
      "id": "s0242",
      "type": "paragraph",
      "chinese": "其道非少寬假，神不來。",
      "literal": "Their way not little broad lenient, spirits not come.",
      "idiomatic": "Their way not little broad lenient, spirits not come. (translated).",
      "context": {
        "previous": "卿曰：「僊者非有求人主，人主求之。",
        "next": "言神事，事如迂誕，積以歲乃可致。」"
      }
    },
    {
      "id": "s0243",
      "type": "paragraph",
      "chinese": "言神事，事如迂誕，積以歲乃可致。」",
      "literal": "Speak spirit matters, matters like circuitous fantastic, accumulate with years then able attain.'",
      "idiomatic": "Speak spirit matters, matters like circuitous fantastic, accumulate with years then able attain.' (translated).",
      "context": {
        "previous": "其道非少寬假，神不來。",
        "next": "於是郡國各除道，繕治宮觀名山神祠所，以望幸矣。"
      }
    },
    {
      "id": "s0244",
      "type": "paragraph",
      "chinese": "於是郡國各除道，繕治宮觀名山神祠所，以望幸矣。",
      "literal": "Thereupon commanderies kingdoms each cleared roads, repaired palaces temples famous mountains spirit shrines places, to await fortune.",
      "idiomatic": "Thereupon commanderies kingdoms each cleared roads, repaired palaces temples famous mountains spirit shrines places, to await fortune. (translated).",
      "context": {
        "previous": "言神事，事如迂誕，積以歲乃可致。」"
      }
    },
    {
      "id": "s0245",
      "type": "paragraph",
      "chinese": "其年，既滅南越，上有嬖臣李延年以好音見。",
      "literal": "That year, already extinguished Nanyue, emperor had favorite minister Li Yannian with good music seen.",
      "idiomatic": "That year, already extinguished Nanyue, emperor had favorite minister Li Yannian with good music seen. (translated).",
      "context": {
        "next": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」"
      }
    },
    {
      "id": "s0246",
      "type": "paragraph",
      "chinese": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」",
      "literal": "Emperor approved it, sent down dukes ministers discuss, said: 'Commoner between sacrifices still have drum dance music, now suburban sacrifice yet no music, how worthy huh?'",
      "idiomatic": "Emperor approved it, sent down dukes ministers discuss, said: 'Commoner between sacrifices still have drum dance music, now suburban sacrifice yet no music, how worthy huh?' (translated).",
      "context": {
        "previous": "其年，既滅南越，上有嬖臣李延年以好音見。",
        "next": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」"
      }
    },
    {
      "id": "s0247",
      "type": "paragraph",
      "chinese": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」",
      "literal": "Dukes ministers said: 'Ancient ones sacrificed heaven earth all had music, yet spirits can obtain and ritual.'",
      "idiomatic": "Dukes ministers said: 'Ancient ones sacrificed heaven earth all had music, yet spirits can obtain and ritual.' (translated).",
      "context": {
        "previous": "上善之，下公卿議，曰：「民閒祠尚有鼓舞之樂，今郊祠而無樂，豈稱乎？」",
        "next": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」"
      }
    },
    {
      "id": "s0248",
      "type": "paragraph",
      "chinese": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」",
      "literal": "Some said: 'Tai emperor made Su Nu strum fifty string se, sad, emperor forbade not stop, therefore broke his se into twenty five strings.'",
      "idiomatic": "Some said: 'Tai emperor made Su Nu strum fifty string se, sad, emperor forbade not stop, therefore broke his se into twenty five strings.' (translated).",
      "context": {
        "previous": "公卿曰：「古者祀天地皆有樂，而神祇可得而禮。」",
        "next": "於是塞南越，禱祠泰一、后土，始用樂舞，益召歌兒，作二十五弦及箜篌瑟自此起。"
      }
    },
    {
      "id": "s0249",
      "type": "paragraph",
      "chinese": "於是塞南越，禱祠泰一、后土，始用樂舞，益召歌兒，作二十五弦及箜篌瑟自此起。",
      "literal": "Thereupon blocked Nanyue, prayed sacrificed Taiyi, Houtu, first used music dance, increased summoned song children, made twenty five strings and konghou se from this began.",
      "idiomatic": "Thereupon blocked Nanyue, prayed sacrificed Taiyi, Houtu, first used music dance, increased summoned song children, made twenty five strings and konghou se from this began. (translated).",
      "context": {
        "previous": "或曰：「泰帝使素女鼓五十弦瑟，悲，帝禁不止，故破其瑟為二十五弦。」"
      }
    },
    {
      "id": "s0250",
      "type": "paragraph",
      "chinese": "其來年冬，上議曰：「古者先振兵澤旅，然後封禪。」",
      "literal": "Its next year winter, emperor discussed said: 'Ancient ones first shook troops moistened army, then fengshan.'",
      "idiomatic": "Its next year winter, emperor discussed said: 'Ancient ones first shook troops moistened army, then fengshan.' (translated).",
      "context": {
        "next": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。"
      }
    },
    {
      "id": "s0251",
      "type": "paragraph",
      "chinese": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。",
      "literal": "Then then north toured Shuofang, drilled troops ten remaining ten thousand, returned sacrificed Yellow Emperor tomb Qiao mountain, moistened troops Xu Ru.",
      "idiomatic": "Then then north toured Shuofang, drilled troops ten remaining ten thousand, returned sacrificed Yellow Emperor tomb Qiao mountain, moistened troops Xu Ru. (translated).",
      "context": {
        "previous": "其來年冬，上議曰：「古者先振兵澤旅，然後封禪。」",
        "next": "上曰：「吾聞黃帝不死，今有冢，何也？」"
      }
    },
    {
      "id": "s0252",
      "type": "paragraph",
      "chinese": "上曰：「吾聞黃帝不死，今有冢，何也？」",
      "literal": "Emperor said: 'I heard Yellow Emperor not die, now has tomb, what also?'",
      "idiomatic": "Emperor said: 'I heard Yellow Emperor not die, now has tomb, what also?' (translated).",
      "context": {
        "previous": "乃遂北巡朔方，勒兵十餘萬，還祭黃帝冢橋山，澤兵須如。",
        "next": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」"
      }
    },
    {
      "id": "s0253",
      "type": "paragraph",
      "chinese": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」",
      "literal": "Some replied said: 'Yellow Emperor already immortal ascended heaven, ministers buried his clothes hat.'",
      "idiomatic": "Some replied said: 'Yellow Emperor already immortal ascended heaven, ministers buried his clothes hat.' (translated).",
      "context": {
        "previous": "上曰：「吾聞黃帝不死，今有冢，何也？」",
        "next": "即至甘泉，為且用事泰山，先類祠泰一。"
      }
    },
    {
      "id": "s0254",
      "type": "paragraph",
      "chinese": "即至甘泉，為且用事泰山，先類祠泰一。",
      "literal": "Immediately arrived Ganquan, for about use affairs Taishan, first similar sacrifice Taiyi.",
      "idiomatic": "Immediately arrived Ganquan, for about use affairs Taishan, first similar sacrifice Taiyi. (translated).",
      "context": {
        "previous": "或對曰：「黃帝已僊上天，群臣葬其衣冠。」"
      }
    },
    {
      "id": "s0255",
      "type": "paragraph",
      "chinese": "自得寶鼎，上與公卿諸生議封禪。",
      "literal": "Since obtained treasured tripod, emperor with dukes ministers various scholars discussed fengshan.",
      "idiomatic": "Since obtained treasured tripod, emperor with dukes ministers various scholars discussed fengshan. (translated).",
      "context": {
        "next": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。"
      }
    },
    {
      "id": "s0256",
      "type": "paragraph",
      "chinese": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。",
      "literal": "Fengshan used rare vast far, none know its ritual etiquette, yet crowd Confucians gathered fengshan Documents, Zhou officials, king systems hope sacrifice shoot ox matters.",
      "idiomatic": "Fengshan used rare vast far, none know its ritual etiquette, yet crowd Confucians gathered fengshan Documents, Zhou officials, king systems hope sacrifice shoot ox matters. (translated).",
      "context": {
        "previous": "自得寶鼎，上與公卿諸生議封禪。",
        "next": "齊人丁公年九十餘，曰：「封者，合不死之名也。"
      }
    },
    {
      "id": "s0257",
      "type": "paragraph",
      "chinese": "齊人丁公年九十餘，曰：「封者，合不死之名也。",
      "literal": "Qi person Ding Gong age ninety remaining, said: 'Feng is, unite not die name also.",
      "idiomatic": "Qi person Ding Gong age ninety remaining, said: 'Feng is, unite not die name also. (translated).",
      "context": {
        "previous": "封禪用希曠絕，莫知其儀禮，而群儒采封禪尚書、周官、王制之望祀射牛事。",
        "next": "秦皇帝不得上封。"
      }
    },
    {
      "id": "s0258",
      "type": "paragraph",
      "chinese": "秦皇帝不得上封。",
      "literal": "Qin emperor not able ascend feng.",
      "idiomatic": "Qin emperor not able ascend feng. (translated).",
      "context": {
        "previous": "齊人丁公年九十餘，曰：「封者，合不死之名也。",
        "next": "陛下必欲上，稍上即無風雨，遂上封矣。」"
      }
    },
    {
      "id": "s0259",
      "type": "paragraph",
      "chinese": "陛下必欲上，稍上即無風雨，遂上封矣。」",
      "literal": "Your majesty must wish ascend, gradually ascend then no wind rain, then ascend feng.'",
      "idiomatic": "Your majesty must wish ascend, gradually ascend then no wind rain, then ascend feng.' (translated).",
      "context": {
        "previous": "秦皇帝不得上封。",
        "next": "上於是乃令諸儒習射牛，草封禪儀。"
      }
    },
    {
      "id": "s0260",
      "type": "paragraph",
      "chinese": "上於是乃令諸儒習射牛，草封禪儀。",
      "literal": "Emperor thereupon then ordered various Confucians practice shoot ox, draft fengshan ritual.",
      "idiomatic": "Emperor thereupon then ordered various Confucians practice shoot ox, draft fengshan ritual. (translated).",
      "context": {
        "previous": "陛下必欲上，稍上即無風雨，遂上封矣。」",
        "next": "數年，至且行。"
      }
    },
    {
      "id": "s0261",
      "type": "paragraph",
      "chinese": "數年，至且行。",
      "literal": "Several years, arrived about to go.",
      "idiomatic": "Several years, arrived about to go. (translated).",
      "context": {
        "previous": "上於是乃令諸儒習射牛，草封禪儀。",
        "next": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。"
      }
    },
    {
      "id": "s0262",
      "type": "paragraph",
      "chinese": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。",
      "literal": "Son of Heaven already heard Gongsun Qing and fangshi words, Yellow Emperor above fengshan, all brought marvelous things communicated with spirits, wished imitate Yellow Emperor to taste connect divine immortal people Penglai scholars, high world compared virtue to nine sovereigns, yet rather gathered Confucian arts to civilize it.",
      "idiomatic": "Son of Heaven already heard Gongsun Qing and fangshi words, Yellow Emperor above fengshan, all brought marvelous things communicated with spirits, wished imitate Yellow Emperor to taste connect divine immortal people Penglai scholars, high world compared virtue to nine sovereigns, yet rather gathered Confucian arts to civilize it. (translated).",
      "context": {
        "previous": "數年，至且行。",
        "next": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。"
      }
    },
    {
      "id": "s0263",
      "type": "paragraph",
      "chinese": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。",
      "literal": "Crowd Confucians already because could not debate clarify fengshan matters, moreover restrained by poetry books ancient texts not dare gallop.",
      "idiomatic": "Crowd Confucians already because could not debate clarify fengshan matters, moreover restrained by poetry books ancient texts not dare gallop. (translated).",
      "context": {
        "previous": "天子既聞公孫卿及方士之言，黃帝以上封禪，皆致怪物與神通，欲放黃帝以嘗接神僊人蓬萊士，高世比德於九皇，而頗采儒術以文之。",
        "next": "上為封祠器示群儒，群儒或曰「不與古同」，徐偃又曰「太常諸生行禮不如魯善」，周霸屬圖封事，於是上絀偃、霸，盡罷諸儒弗用。"
      }
    },
    {
      "id": "s0264",
      "type": "paragraph",
      "chinese": "上為封祠器示群儒，群儒或曰「不與古同」，徐偃又曰「太常諸生行禮不如魯善」，周霸屬圖封事，於是上絀偃、霸，盡罷諸儒弗用。",
      "literal": "Emperor made feng sacrifice vessels showed crowd Confucians, crowd Confucians some said 'not with ancient same', Xu Yan moreover said 'grand constant various scholars performed ritual not like Lu good', Zhou Ba drew diagrams feng matters, thereupon emperor demoted Yan, Ba, completely dismissed various Confucians not used.",
      "idiomatic": "Emperor made feng sacrifice vessels showed crowd Confucians, crowd Confucians some said 'not with ancient same', Xu Yan moreover said 'grand constant various scholars performed ritual not like Lu good', Zhou Ba drew diagrams feng matters, thereupon emperor demoted Yan, Ba, completely dismissed various Confucians not used. (translated).",
      "context": {
        "previous": "群儒既以不能辯明封禪事，又牽拘於詩書古文而不敢騁。"
      }
    },
    {
      "id": "s0265",
      "type": "paragraph",
      "chinese": "三月，遂東幸緱氏，禮登中嶽太室。",
      "literal": "Third month, then east fortunate Gou Shi, ritual ascended central peak Taishi.",
      "idiomatic": "Third month, then east fortunate Gou Shi, ritual ascended central peak Taishi. (translated).",
      "context": {
        "next": "從官在山下聞若有言「萬歲」云。"
      }
    },
    {
      "id": "s0266",
      "type": "paragraph",
      "chinese": "從官在山下聞若有言「萬歲」云。",
      "literal": "Following officials at mountain below heard as if had words 'ten thousand years' cloud.",
      "idiomatic": "Following officials at mountain below heard as if had words 'ten thousand years' cloud. (translated).",
      "context": {
        "previous": "三月，遂東幸緱氏，禮登中嶽太室。",
        "next": "問上，上不言；"
      }
    },
    {
      "id": "s0267",
      "type": "paragraph",
      "chinese": "問上，上不言；",
      "literal": "Asked upper, upper not speak;",
      "idiomatic": "Asked upper, upper not speak; (translated).",
      "context": {
        "previous": "從官在山下聞若有言「萬歲」云。",
        "next": "問下，下不言。"
      }
    },
    {
      "id": "s0268",
      "type": "paragraph",
      "chinese": "問下，下不言。",
      "literal": "Asked lower, lower not speak.",
      "idiomatic": "Asked lower, lower not speak. (translated).",
      "context": {
        "previous": "問上，上不言；",
        "next": "於是以三百戶封太室奉祠，命曰崇高邑。"
      }
    },
    {
      "id": "s0269",
      "type": "paragraph",
      "chinese": "於是以三百戶封太室奉祠，命曰崇高邑。",
      "literal": "Thereupon with three hundred households sealed Taishi served sacrifice, named Chonggao yi.",
      "idiomatic": "Thereupon with three hundred households sealed Taishi served sacrifice, named Chonggao yi. (translated).",
      "context": {
        "previous": "問下，下不言。",
        "next": "東上泰山，山之草木葉未生，乃令人上石立之泰山顛。"
      }
    },
    {
      "id": "s0270",
      "type": "paragraph",
      "chinese": "東上泰山，山之草木葉未生，乃令人上石立之泰山顛。",
      "literal": "East ascended Taishan, mountain grass trees leaves not yet born, then made people ascend stone stood it Taishan peak.",
      "idiomatic": "East ascended Taishan, mountain grass trees leaves not yet born, then made people ascend stone stood it Taishan peak. (translated).",
      "context": {
        "previous": "於是以三百戶封太室奉祠，命曰崇高邑。"
      }
    },
    {
      "id": "s0271",
      "type": "paragraph",
      "chinese": "上遂東巡海上，行禮祠八神。",
      "literal": "Emperor then east toured sea above, performed ritual sacrificed eight spirits.",
      "idiomatic": "Emperor then east toured sea above, performed ritual sacrificed eight spirits. (translated).",
      "context": {
        "next": "齊人之上疏言神怪奇方者以萬數，然無驗者。"
      }
    },
    {
      "id": "s0272",
      "type": "paragraph",
      "chinese": "齊人之上疏言神怪奇方者以萬數，然無驗者。",
      "literal": "Qi people submitted memorials spoke spirit strange marvelous methods ones by ten thousand count, yet none verified ones.",
      "idiomatic": "Qi people submitted memorials spoke spirit strange marvelous methods ones by ten thousand count, yet none verified ones. (translated).",
      "context": {
        "previous": "上遂東巡海上，行禮祠八神。",
        "next": "乃益發船，令言海中神山者數千人求蓬萊神人。"
      }
    },
    {
      "id": "s0273",
      "type": "paragraph",
      "chinese": "乃益發船，令言海中神山者數千人求蓬萊神人。",
      "literal": "Then increased sent ships, ordered spoke sea middle divine mountains ones several thousand people sought Penglai divine people.",
      "idiomatic": "Then increased sent ships, ordered spoke sea middle divine mountains ones several thousand people sought Penglai divine people. (translated).",
      "context": {
        "previous": "齊人之上疏言神怪奇方者以萬數，然無驗者。",
        "next": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。"
      }
    },
    {
      "id": "s0274",
      "type": "paragraph",
      "chinese": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。",
      "literal": "Gongsun Qing held tally often first went awaited famous mountains, arrived Donglai, said night saw one person, length several zhang, approached it then not seen, saw its traces very large, resembled bird beast cloud.",
      "idiomatic": "Gongsun Qing held tally often first went awaited famous mountains, arrived Donglai, said night saw one person, length several zhang, approached it then not seen, saw its traces very large, resembled bird beast cloud. (translated).",
      "context": {
        "previous": "乃益發船，令言海中神山者數千人求蓬萊神人。",
        "next": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。"
      }
    },
    {
      "id": "s0275",
      "type": "paragraph",
      "chinese": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。",
      "literal": "Crowd ministers had words saw one old father led dog, said 'I wish see great duke', already suddenly not seen.",
      "idiomatic": "Crowd ministers had words saw one old father led dog, said 'I wish see great duke', already suddenly not seen. (translated).",
      "context": {
        "previous": "公孫卿持節常先行候名山，至東萊，言夜見一人，長數丈，就之則不見，見其跡甚大，類禽獸云。",
        "next": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。"
      }
    },
    {
      "id": "s0276",
      "type": "paragraph",
      "chinese": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。",
      "literal": "Emperor already saw big traces, not believed, and crowd ministers had words old father, then greatly took as immortal person.",
      "idiomatic": "Emperor already saw big traces, not believed, and crowd ministers had words old father, then greatly took as immortal person. (translated).",
      "context": {
        "previous": "群臣有言見一老父牽狗，言「吾欲見巨公」，已忽不見。",
        "next": "宿留海上，與方士傳車及閒使求僊人以千數。"
      }
    },
    {
      "id": "s0277",
      "type": "paragraph",
      "chinese": "宿留海上，與方士傳車及閒使求僊人以千數。",
      "literal": "Lodged remained sea above, with fangshi transmitted carriages and idle envoys sought immortals by thousand count.",
      "idiomatic": "Lodged remained sea above, with fangshi transmitted carriages and idle envoys sought immortals by thousand count. (translated).",
      "context": {
        "previous": "上既見大跡，未信，及群臣有言老父，則大以為僊人也。"
      }
    },
    {
      "id": "s0278",
      "type": "paragraph",
      "chinese": "四月，還至奉高。",
      "literal": "Fourth month, returned to Fenggao.",
      "idiomatic": "Fourth month, returned to Fenggao. (translated).",
      "context": {
        "next": "上念諸儒及方士言封禪人人殊，不經，難施行。"
      }
    },
    {
      "id": "s0279",
      "type": "paragraph",
      "chinese": "上念諸儒及方士言封禪人人殊，不經，難施行。",
      "literal": "Emperor pondered various Confucians and fangshi spoke fengshan each person different, not orthodox, difficult to carry out.",
      "idiomatic": "Emperor pondered various Confucians and fangshi spoke fengshan each person different, not orthodox, difficult to carry out. (translated).",
      "context": {
        "previous": "四月，還至奉高。",
        "next": "天子至梁父，禮祠地主。"
      }
    },
    {
      "id": "s0280",
      "type": "paragraph",
      "chinese": "天子至梁父，禮祠地主。",
      "literal": "Son of Heaven arrived Liangfu, ritual sacrificed earth lord.",
      "idiomatic": "Son of Heaven arrived Liangfu, ritual sacrificed earth lord. (translated).",
      "context": {
        "previous": "上念諸儒及方士言封禪人人殊，不經，難施行。",
        "next": "乙卯，令侍中儒者皮弁薦紳，射牛行事。"
      }
    },
    {
      "id": "s0281",
      "type": "paragraph",
      "chinese": "乙卯，令侍中儒者皮弁薦紳，射牛行事。",
      "literal": "Yi mao, ordered attendant middle Confucian leather crown recommended sashes, shoot ox carried out matters.",
      "idiomatic": "Yi mao, ordered attendant middle Confucian leather crown recommended sashes, shoot ox carried out matters. (translated).",
      "context": {
        "previous": "天子至梁父，禮祠地主。",
        "next": "封泰山下東方，如郊祠泰一之禮。"
      }
    },
    {
      "id": "s0282",
      "type": "paragraph",
      "chinese": "封泰山下東方，如郊祠泰一之禮。",
      "literal": "Feng Taishan below eastern, like suburban sacrifice Taiyi ritual.",
      "idiomatic": "Feng Taishan below eastern, like suburban sacrifice Taiyi ritual. (translated).",
      "context": {
        "previous": "乙卯，令侍中儒者皮弁薦紳，射牛行事。",
        "next": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。"
      }
    },
    {
      "id": "s0283",
      "type": "paragraph",
      "chinese": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。",
      "literal": "Feng broad zhang two chi, high nine chi, its below then had jade tablets book, book secret.",
      "idiomatic": "Feng broad zhang two chi, high nine chi, its below then had jade tablets book, book secret. (translated).",
      "context": {
        "previous": "封泰山下東方，如郊祠泰一之禮。",
        "next": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。"
      }
    },
    {
      "id": "s0284",
      "type": "paragraph",
      "chinese": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。",
      "literal": "Ritual finished, Son of Heaven alone with attendant middle carriage presenting marquis ascended Taishan, also had feng.",
      "idiomatic": "Ritual finished, Son of Heaven alone with attendant middle carriage presenting marquis ascended Taishan, also had feng. (translated).",
      "context": {
        "previous": "封廣丈二尺，高九尺，其下則有玉牒書，書祕。",
        "next": "其事皆禁。"
      }
    },
    {
      "id": "s0285",
      "type": "paragraph",
      "chinese": "其事皆禁。",
      "literal": "Its matters all forbidden.",
      "idiomatic": "Its matters all forbidden. (translated).",
      "context": {
        "previous": "禮畢，天子獨與侍中奉車子侯上泰山，亦有封。",
        "next": "明日，下陰道。"
      }
    },
    {
      "id": "s0286",
      "type": "paragraph",
      "chinese": "明日，下陰道。",
      "literal": "Next day, descended yin path.",
      "idiomatic": "Next day, descended yin path. (translated).",
      "context": {
        "previous": "其事皆禁。",
        "next": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。"
      }
    },
    {
      "id": "s0287",
      "type": "paragraph",
      "chinese": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。",
      "literal": "Bingchen, shan Taishan below zhi northeast Suran mountain, like sacrificed Houtu ritual.",
      "idiomatic": "Bingchen, shan Taishan below zhi northeast Suran mountain, like sacrificed Houtu ritual. (translated).",
      "context": {
        "previous": "明日，下陰道。",
        "next": "天子皆親拜見，衣上黃而盡用樂焉。"
      }
    },
    {
      "id": "s0288",
      "type": "paragraph",
      "chinese": "天子皆親拜見，衣上黃而盡用樂焉。",
      "literal": "Son of Heaven all personally bowed saw, clothed above yellow and completely used music there.",
      "idiomatic": "Son of Heaven all personally bowed saw, clothed above yellow and completely used music there. (translated).",
      "context": {
        "previous": "丙辰，禪泰山下阯東北肅然山，如祭后土禮。",
        "next": "江淮閒一茅三脊為神藉。"
      }
    },
    {
      "id": "s0289",
      "type": "paragraph",
      "chinese": "江淮閒一茅三脊為神藉。",
      "literal": "Jiang Huai between one thatch three ridges made spirit mat.",
      "idiomatic": "Jiang Huai between one thatch three ridges made spirit mat. (translated).",
      "context": {
        "previous": "天子皆親拜見，衣上黃而盡用樂焉。",
        "next": "五色土益雜封。"
      }
    },
    {
      "id": "s0290",
      "type": "paragraph",
      "chinese": "五色土益雜封。",
      "literal": "Five colors earth increased mixed feng.",
      "idiomatic": "Five colors earth increased mixed feng. (translated).",
      "context": {
        "previous": "江淮閒一茅三脊為神藉。",
        "next": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。"
      }
    },
    {
      "id": "s0291",
      "type": "paragraph",
      "chinese": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。",
      "literal": "Released distant regions marvelous beasts flying birds and white pheasants various things, rather used to add sacrifice.",
      "idiomatic": "Released distant regions marvelous beasts flying birds and white pheasants various things, rather used to add sacrifice. (translated).",
      "context": {
        "previous": "五色土益雜封。",
        "next": "兕旄牛犀象之屬弗用。"
      }
    },
    {
      "id": "s0292",
      "type": "paragraph",
      "chinese": "兕旄牛犀象之屬弗用。",
      "literal": "Si mao oxen rhinoceros elephants kind not used.",
      "idiomatic": "Si mao oxen rhinoceros elephants kind not used. (translated).",
      "context": {
        "previous": "縱遠方奇獸蜚禽及白雉諸物，頗以加祠。",
        "next": "皆至泰山然後去。"
      }
    },
    {
      "id": "s0293",
      "type": "paragraph",
      "chinese": "皆至泰山然後去。",
      "literal": "All arrived Taishan then left.",
      "idiomatic": "All arrived Taishan then left. (translated).",
      "context": {
        "previous": "兕旄牛犀象之屬弗用。",
        "next": "封禪祠，其夜若有光，晝有白雲起封中。"
      }
    },
    {
      "id": "s0294",
      "type": "paragraph",
      "chinese": "封禪祠，其夜若有光，晝有白雲起封中。",
      "literal": "Fengshan sacrifice, its night as if had light, day had white clouds rise feng middle.",
      "idiomatic": "Fengshan sacrifice, its night as if had light, day had white clouds rise feng middle. (translated).",
      "context": {
        "previous": "皆至泰山然後去。"
      }
    },
    {
      "id": "s0295",
      "type": "paragraph",
      "chinese": "天子從封禪還，坐明堂，群臣更上壽。",
      "literal": "Son of Heaven from fengshan returned, sat bright hall, crowd ministers again presented long life.",
      "idiomatic": "Son of Heaven from fengshan returned, sat bright hall, crowd ministers again presented long life. (translated).",
      "context": {
        "next": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。"
      }
    },
    {
      "id": "s0296",
      "type": "paragraph",
      "chinese": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。",
      "literal": "Thereupon formulated edict imperial secretary: 'I with tiny tiny body bear utmost honored, trembling fear not able to bear.",
      "idiomatic": "Thereupon formulated edict imperial secretary: 'I with tiny tiny body bear utmost honored, trembling fear not able to bear. (translated).",
      "context": {
        "previous": "天子從封禪還，坐明堂，群臣更上壽。",
        "next": "維德菲薄，不明于禮樂。"
      }
    },
    {
      "id": "s0297",
      "type": "paragraph",
      "chinese": "維德菲薄，不明于禮樂。",
      "literal": "Only virtue meager thin, not clear about ritual music.",
      "idiomatic": "Only virtue meager thin, not clear about ritual music. (translated).",
      "context": {
        "previous": "於是制詔御史：「朕以眇眇之身承至尊，兢兢焉懼弗任。",
        "next": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。"
      }
    },
    {
      "id": "s0298",
      "type": "paragraph",
      "chinese": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。",
      "literal": "Repaired sacrificed Taiyi, as if had image scene light, bits like had hope, faintly shaken by marvelous things, wished to stop not dare, then ascended feng Taishan, arrived at Liangfu, and then shan Suran.",
      "idiomatic": "Repaired sacrificed Taiyi, as if had image scene light, bits like had hope, faintly shaken by marvelous things, wished to stop not dare, then ascended feng Taishan, arrived at Liangfu, and then shan Suran. (translated).",
      "context": {
        "previous": "維德菲薄，不明于禮樂。",
        "next": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。"
      }
    },
    {
      "id": "s0299",
      "type": "paragraph",
      "chinese": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。",
      "literal": "Self renew, praise with scholars great men renew beginning, granted people hundred households ox one wine ten stones, add age eighty orphans widows cloth silk two bolts.",
      "idiomatic": "Self renew, praise with scholars great men renew beginning, granted people hundred households ox one wine ten stones, add age eighty orphans widows cloth silk two bolts. (translated).",
      "context": {
        "previous": "修祀泰一，若有象景光，屑如有望，依依震於怪物，欲止不敢，遂登封泰山，至於梁父，而後禪肅然。",
        "next": "復博、奉高、蛇丘、歷城，毋出今年租稅。"
      }
    },
    {
      "id": "s0300",
      "type": "paragraph",
      "chinese": "復博、奉高、蛇丘、歷城，毋出今年租稅。",
      "literal": "Exempt Bo, Fenggao, Sheqiu, Licheng, do not pay this year rents taxes.",
      "idiomatic": "Exempt Bo, Fenggao, Sheqiu, Licheng, do not pay this year rents taxes. (translated).",
      "context": {
        "previous": "自新，嘉與士大夫更始，賜民百戶牛一酒十石，加年八十孤寡布帛二匹。",
        "next": "其赦天下，如乙卯赦令。"
      }
    },
    {
      "id": "s0301",
      "type": "paragraph",
      "chinese": "其赦天下，如乙卯赦令。",
      "literal": "Its amnesty realm, like yi mao amnesty order.",
      "idiomatic": "Its amnesty realm, like yi mao amnesty order. (translated).",
      "context": {
        "previous": "復博、奉高、蛇丘、歷城，毋出今年租稅。",
        "next": "行所過毋有復作。"
      }
    },
    {
      "id": "s0302",
      "type": "paragraph",
      "chinese": "行所過毋有復作。",
      "literal": "Travel what passed do not have repeat work.",
      "idiomatic": "Travel what passed do not have repeat work. (translated).",
      "context": {
        "previous": "其赦天下，如乙卯赦令。",
        "next": "事在二年前，皆勿聽治。」"
      }
    },
    {
      "id": "s0303",
      "type": "paragraph",
      "chinese": "事在二年前，皆勿聽治。」",
      "literal": "Matters in two years before, all do not listen govern.'",
      "idiomatic": "Matters in two years before, all do not listen govern.' (translated).",
      "context": {
        "previous": "行所過毋有復作。",
        "next": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。"
      }
    },
    {
      "id": "s0304",
      "type": "paragraph",
      "chinese": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。",
      "literal": "Moreover issued edict said: 'Ancient ones Son of Heaven five years one inspection tour, used affairs Taishan, feudal lords had court lodging places.",
      "idiomatic": "Moreover issued edict said: 'Ancient ones Son of Heaven five years one inspection tour, used affairs Taishan, feudal lords had court lodging places. (translated).",
      "context": {
        "previous": "事在二年前，皆勿聽治。」",
        "next": "其令諸侯各治邸泰山下。」"
      }
    },
    {
      "id": "s0305",
      "type": "paragraph",
      "chinese": "其令諸侯各治邸泰山下。」",
      "literal": "Let command feudal lords each repair lodgings Taishan below.'",
      "idiomatic": "Let command feudal lords each repair lodgings Taishan below.' (translated).",
      "context": {
        "previous": "又下詔曰：「古者天子五載一巡狩，用事泰山，諸侯有朝宿地。"
      }
    },
    {
      "id": "s0306",
      "type": "paragraph",
      "chinese": "天子既已封禪泰山，無風雨菑，而方士更言蓬萊諸神山若將可得，於是上欣然庶幾遇之，乃復東至海上望，冀遇蓬萊焉。",
      "literal": "Son of Heaven already feng shan Taishan, no wind rain disaster, yet fangshi moreover spoke Penglai various divine mountains as if about obtainable, thereupon emperor joyfully almost encountered it, then again east to sea above gazed, hoped encountered Penglai there.",
      "idiomatic": "Son of Heaven already feng shan Taishan, no wind rain disaster, yet fangshi moreover spoke Penglai various divine mountains as if about obtainable, thereupon emperor joyfully almost encountered it, then again east to sea above gazed, hoped encountered Penglai there. (translated).",
      "context": {
        "next": "奉車子侯暴病，一日死。"
      }
    },
    {
      "id": "s0307",
      "type": "paragraph",
      "chinese": "奉車子侯暴病，一日死。",
      "literal": "Carriage presenting marquis suddenly ill, one day died.",
      "idiomatic": "Carriage presenting marquis suddenly ill, one day died. (translated).",
      "context": {
        "previous": "天子既已封禪泰山，無風雨菑，而方士更言蓬萊諸神山若將可得，於是上欣然庶幾遇之，乃復東至海上望，冀遇蓬萊焉。",
        "next": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。"
      }
    },
    {
      "id": "s0308",
      "type": "paragraph",
      "chinese": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。",
      "literal": "Emperor then then left, along sea above, north to Jieshi, toured from Liaoxi, traversed northern border to Jiuyuan.",
      "idiomatic": "Emperor then then left, along sea above, north to Jieshi, toured from Liaoxi, traversed northern border to Jiuyuan. (translated).",
      "context": {
        "previous": "奉車子侯暴病，一日死。",
        "next": "五月，返至甘泉。"
      }
    },
    {
      "id": "s0309",
      "type": "paragraph",
      "chinese": "五月，返至甘泉。",
      "literal": "Fifth month, returned to Ganquan.",
      "idiomatic": "Fifth month, returned to Ganquan. (translated).",
      "context": {
        "previous": "上乃遂去，并海上，北至碣石，巡自遼西，歷北邊至九原。",
        "next": "有司言寶鼎出為元鼎，以今年為元封元年。"
      }
    },
    {
      "id": "s0310",
      "type": "paragraph",
      "chinese": "有司言寶鼎出為元鼎，以今年為元封元年。",
      "literal": "Officials said treasured tripod emerged made Yuanding, with this year as Yuanfeng first year.",
      "idiomatic": "Officials said treasured tripod emerged made Yuanding, with this year as Yuanfeng first year. (translated).",
      "context": {
        "previous": "五月，返至甘泉。"
      }
    },
    {
      "id": "s0311",
      "type": "paragraph",
      "chinese": "其秋，有星茀于東井。",
      "literal": "That autumn, had star fu at eastern well.",
      "idiomatic": "That autumn, had star fu at eastern well. (translated).",
      "context": {
        "next": "後十餘日，有星茀于三能。"
      }
    },
    {
      "id": "s0312",
      "type": "paragraph",
      "chinese": "後十餘日，有星茀于三能。",
      "literal": "After ten remaining days, had star fu at three neng.",
      "idiomatic": "After ten remaining days, had star fu at three neng. (translated).",
      "context": {
        "previous": "其秋，有星茀于東井。",
        "next": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」"
      }
    },
    {
      "id": "s0313",
      "type": "paragraph",
      "chinese": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」",
      "literal": "Qi gazer Wang Shuo said: 'Waited alone saw its star emerge like gourd, eat period again entered there.'",
      "idiomatic": "Qi gazer Wang Shuo said: 'Waited alone saw its star emerge like gourd, eat period again entered there.' (translated).",
      "context": {
        "previous": "後十餘日，有星茀于三能。",
        "next": "有司言曰：「陛下建漢家封禪，天其報德星雲。」"
      }
    },
    {
      "id": "s0314",
      "type": "paragraph",
      "chinese": "有司言曰：「陛下建漢家封禪，天其報德星雲。」",
      "literal": "Officials said: 'Your majesty established Han house fengshan, heaven will repay virtue star clouds.'",
      "idiomatic": "Officials said: 'Your majesty established Han house fengshan, heaven will repay virtue star clouds.' (translated).",
      "context": {
        "previous": "望氣王朔言：「候獨見其星出如瓠，食頃復入焉。」"
      }
    },
    {
      "id": "s0315",
      "type": "paragraph",
      "chinese": "其來年冬，郊雍五帝，還，拜祝祠泰一。",
      "literal": "Its next year winter, suburban Yong five emperors, returned, bowed blessed sacrificed Taiyi.",
      "idiomatic": "Its next year winter, suburban Yong five emperors, returned, bowed blessed sacrificed Taiyi. (translated).",
      "context": {
        "next": "贊饗曰：「德星昭衍，厥維休祥。"
      }
    },
    {
      "id": "s0316",
      "type": "paragraph",
      "chinese": "贊饗曰：「德星昭衍，厥維休祥。",
      "literal": "Assist feast said: 'Virtue star bright extended, its only auspicious good fortune.",
      "idiomatic": "Assist feast said: 'Virtue star bright extended, its only auspicious good fortune. (translated).",
      "context": {
        "previous": "其來年冬，郊雍五帝，還，拜祝祠泰一。",
        "next": "壽星仍出，淵耀光明。"
      }
    },
    {
      "id": "s0317",
      "type": "paragraph",
      "chinese": "壽星仍出，淵耀光明。",
      "literal": "Longevity star repeatedly emerged, deep shone bright.",
      "idiomatic": "Longevity star repeatedly emerged, deep shone bright. (translated).",
      "context": {
        "previous": "贊饗曰：「德星昭衍，厥維休祥。",
        "next": "信星昭見，皇帝敬拜泰祝之饗。」"
      }
    },
    {
      "id": "s0318",
      "type": "paragraph",
      "chinese": "信星昭見，皇帝敬拜泰祝之饗。」",
      "literal": "Faith star bright seen, emperor respectfully bowed great blessing feast.'",
      "idiomatic": "Faith star bright seen, emperor respectfully bowed great blessing feast.' (translated).",
      "context": {
        "previous": "壽星仍出，淵耀光明。"
      }
    },
    {
      "id": "s0319",
      "type": "paragraph",
      "chinese": "其春，公孫卿言見神人東萊山，若云「見天子」。",
      "literal": "Its spring, Gongsun Qing said saw divine person Donglai mountain, as if said 'saw Son of Heaven.'",
      "idiomatic": "Its spring, Gongsun Qing said saw divine person Donglai mountain, as if said 'saw Son of Heaven.' (translated).",
      "context": {
        "next": "天子於是幸緱氏城，拜卿為中大夫。"
      }
    },
    {
      "id": "s0320",
      "type": "paragraph",
      "chinese": "天子於是幸緱氏城，拜卿為中大夫。",
      "literal": "Son of Heaven thereupon fortunate Gou city, appointed Qing as middle grand master.",
      "idiomatic": "Son of Heaven thereupon fortunate Gou city, appointed Qing as middle grand master. (translated).",
      "context": {
        "previous": "其春，公孫卿言見神人東萊山，若云「見天子」。",
        "next": "遂至東萊，宿留之數日，毋所見，見大人跡。"
      }
    },
    {
      "id": "s0321",
      "type": "paragraph",
      "chinese": "遂至東萊，宿留之數日，毋所見，見大人跡。",
      "literal": "Then arrived Donglai, lodged remained it several days, nothing seen, saw great person traces.",
      "idiomatic": "Then arrived Donglai, lodged remained it several days, nothing seen, saw great person traces. (translated).",
      "context": {
        "previous": "天子於是幸緱氏城，拜卿為中大夫。",
        "next": "復遣方士求神怪采芝藥以千數。"
      }
    },
    {
      "id": "s0322",
      "type": "paragraph",
      "chinese": "復遣方士求神怪采芝藥以千數。",
      "literal": "Again sent fangshi seek divine strange gather ganoderma medicines by thousand count.",
      "idiomatic": "Again sent fangshi seek divine strange gather ganoderma medicines by thousand count. (translated).",
      "context": {
        "previous": "遂至東萊，宿留之數日，毋所見，見大人跡。",
        "next": "是歲旱。"
      }
    },
    {
      "id": "s0323",
      "type": "paragraph",
      "chinese": "是歲旱。",
      "literal": "This year drought.",
      "idiomatic": "This year drought. (translated).",
      "context": {
        "previous": "復遣方士求神怪采芝藥以千數。",
        "next": "於是天子既出毋名，乃禱萬里沙，過祠泰山。"
      }
    },
    {
      "id": "s0324",
      "type": "paragraph",
      "chinese": "於是天子既出毋名，乃禱萬里沙，過祠泰山。",
      "literal": "Thereupon Son of Heaven already went out no fame, then prayed Wanli Sha, passed sacrificed Taishan.",
      "idiomatic": "Thereupon Son of Heaven already went out no fame, then prayed Wanli Sha, passed sacrificed Taishan. (translated).",
      "context": {
        "previous": "是歲旱。",
        "next": "還至瓠子，自臨塞決河，留二日，沈祠而去。"
      }
    },
    {
      "id": "s0325",
      "type": "paragraph",
      "chinese": "還至瓠子，自臨塞決河，留二日，沈祠而去。",
      "literal": "Returned to Huzi, personally oversaw blocked breached river, stayed two days, sank sacrificed and left.",
      "idiomatic": "Returned to Huzi, personally oversaw blocked breached river, stayed two days, sank sacrificed and left. (translated).",
      "context": {
        "previous": "於是天子既出毋名，乃禱萬里沙，過祠泰山。",
        "next": "使二卿將卒塞決河，河徙二渠，復禹之故跡焉。"
      }
    },
    {
      "id": "s0326",
      "type": "paragraph",
      "chinese": "使二卿將卒塞決河，河徙二渠，復禹之故跡焉。",
      "literal": "Made two ministers lead troops block breached river, river moved two channels, restored Yu old traces there.",
      "idiomatic": "Made two ministers lead troops block breached river, river moved two channels, restored Yu old traces there. (translated).",
      "context": {
        "previous": "還至瓠子，自臨塞決河，留二日，沈祠而去。"
      }
    },
    {
      "id": "s0327",
      "type": "paragraph",
      "chinese": "是時既滅南越，越人勇之乃言「越人俗信鬼，而其祠皆見鬼，數有效。",
      "literal": "This time already extinguished Nanyue, Yue person Yongzhi then said 'Yue people custom believe ghosts, yet their sacrifices all see ghosts, often effective.",
      "idiomatic": "This time already extinguished Nanyue, Yue person Yongzhi then said 'Yue people custom believe ghosts, yet their sacrifices all see ghosts, often effective. (translated).",
      "context": {
        "next": "昔東甌王敬鬼，壽至百六十歲。"
      }
    },
    {
      "id": "s0328",
      "type": "paragraph",
      "chinese": "昔東甌王敬鬼，壽至百六十歲。",
      "literal": "Former Dongou king respected ghosts, longevity to one hundred sixty years.",
      "idiomatic": "Former Dongou king respected ghosts, longevity to one hundred sixty years. (translated).",
      "context": {
        "previous": "是時既滅南越，越人勇之乃言「越人俗信鬼，而其祠皆見鬼，數有效。",
        "next": "後世謾怠，故衰秏」。"
      }
    },
    {
      "id": "s0329",
      "type": "paragraph",
      "chinese": "後世謾怠，故衰秏」。",
      "literal": "Later generations negligent lazy, therefore declined depleted.'",
      "idiomatic": "Later generations negligent lazy, therefore declined depleted.' (translated).",
      "context": {
        "previous": "昔東甌王敬鬼，壽至百六十歲。",
        "next": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。"
      }
    },
    {
      "id": "s0330",
      "type": "paragraph",
      "chinese": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。",
      "literal": "Then ordered Yue witches establish Yue blessing sacrifices, settled altar no mound, also sacrificed heaven spirits Supreme Deity hundred ghosts, yet with chicken divination.",
      "idiomatic": "Then ordered Yue witches establish Yue blessing sacrifices, settled altar no mound, also sacrificed heaven spirits Supreme Deity hundred ghosts, yet with chicken divination. (translated).",
      "context": {
        "previous": "後世謾怠，故衰秏」。",
        "next": "上信之，越祠雞卜始用焉。"
      }
    },
    {
      "id": "s0331",
      "type": "paragraph",
      "chinese": "上信之，越祠雞卜始用焉。",
      "literal": "Emperor believed it, Yue sacrifices chicken divination first used there.",
      "idiomatic": "Emperor believed it, Yue sacrifices chicken divination first used there. (translated).",
      "context": {
        "previous": "乃令越巫立越祝祠，安臺無壇，亦祠天神上帝百鬼，而以雞卜。"
      }
    },
    {
      "id": "s0332",
      "type": "paragraph",
      "chinese": "公孫卿曰：「僊人可見，而上往常遽，以故不見。",
      "literal": "Gongsun Qing said: 'Immortals can be seen, yet emperor went often hastily, because of this not seen.",
      "idiomatic": "Gongsun Qing said: 'Immortals can be seen, yet emperor went often hastily, because of this not seen. (translated).",
      "context": {
        "next": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。"
      }
    },
    {
      "id": "s0333",
      "type": "paragraph",
      "chinese": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。",
      "literal": "Now your majesty can make pavilion, like Gou city, place dried meats dates, divine people should can be obtained.",
      "idiomatic": "Now your majesty can make pavilion, like Gou city, place dried meats dates, divine people should can be obtained. (translated).",
      "context": {
        "previous": "公孫卿曰：「僊人可見，而上往常遽，以故不見。",
        "next": "且僊人好樓居。」"
      }
    },
    {
      "id": "s0334",
      "type": "paragraph",
      "chinese": "且僊人好樓居。」",
      "literal": "Moreover immortals like tower residence.'",
      "idiomatic": "Moreover immortals like tower residence.' (translated).",
      "context": {
        "previous": "今陛下可為觀，如緱氏城，置脯棗，神人宜可致。",
        "next": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。"
      }
    },
    {
      "id": "s0335",
      "type": "paragraph",
      "chinese": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。",
      "literal": "Thereupon emperor ordered Chang'an then made Feilian Gui pavilion, Ganquan then made Yi Yanshou pavilion, made Qing hold tally set up implements and await divine people, then made communicate heaven tower, placed sacrifice implements its below, will summon come divine immortal kind.",
      "idiomatic": "Thereupon emperor ordered Chang'an then made Feilian Gui pavilion, Ganquan then made Yi Yanshou pavilion, made Qing hold tally set up implements and await divine people, then made communicate heaven tower, placed sacrifice implements its below, will summon come divine immortal kind. (translated).",
      "context": {
        "previous": "且僊人好樓居。」",
        "next": "於是甘泉更置前殿，始廣諸宮室。"
      }
    },
    {
      "id": "s0336",
      "type": "paragraph",
      "chinese": "於是甘泉更置前殿，始廣諸宮室。",
      "literal": "Thereupon Ganquan changed placed front hall, first broadened various palace chambers.",
      "idiomatic": "Thereupon Ganquan changed placed front hall, first broadened various palace chambers. (translated).",
      "context": {
        "previous": "於是上令長安則作蜚廉桂觀，甘泉則作益延壽觀，使卿持節設具而候神人，乃作通天臺，置祠具其下，將招來神僊之屬。",
        "next": "夏，有芝生殿防內中。"
      }
    },
    {
      "id": "s0337",
      "type": "paragraph",
      "chinese": "夏，有芝生殿防內中。",
      "literal": "Summer, had ganoderma born hall dike inner middle.",
      "idiomatic": "Summer, had ganoderma born hall dike inner middle. (translated).",
      "context": {
        "previous": "於是甘泉更置前殿，始廣諸宮室。",
        "next": "天子為塞河，興通天臺，若有光雲，乃下詔曰：「甘泉防生芝九莖，赦天下，毋有復作。」"
      }
    },
    {
      "id": "s0338",
      "type": "paragraph",
      "chinese": "天子為塞河，興通天臺，若有光雲，乃下詔曰：「甘泉防生芝九莖，赦天下，毋有復作。」",
      "literal": "Son of Heaven for blocked river, raised communicate heaven tower, as if had light clouds, then issued edict said: 'Ganquan dike born ganoderma nine stems, amnesty realm, do not have repeat work.'",
      "idiomatic": "Son of Heaven for blocked river, raised communicate heaven tower, as if had light clouds, then issued edict said: 'Ganquan dike born ganoderma nine stems, amnesty realm, do not have repeat work.' (translated).",
      "context": {
        "previous": "夏，有芝生殿防內中。"
      }
    },
    {
      "id": "s0339",
      "type": "paragraph",
      "chinese": "其明年，伐朝鮮。",
      "literal": "Its next year, attacked Chaoxian.",
      "idiomatic": "Its next year, attacked Chaoxian. (translated).",
      "context": {
        "next": "夏，旱。"
      }
    },
    {
      "id": "s0340",
      "type": "paragraph",
      "chinese": "夏，旱。",
      "literal": "Summer, drought.",
      "idiomatic": "Summer, drought. (translated).",
      "context": {
        "previous": "其明年，伐朝鮮。",
        "next": "公孫卿曰：「黃帝時封則天旱，乾封三年。」"
      }
    },
    {
      "id": "s0341",
      "type": "paragraph",
      "chinese": "公孫卿曰：「黃帝時封則天旱，乾封三年。」",
      "literal": "Gongsun Qing said: 'Yellow Emperor time feng then heaven drought, dry feng three years.'",
      "idiomatic": "Gongsun Qing said: 'Yellow Emperor time feng then heaven drought, dry feng three years.' (translated).",
      "context": {
        "previous": "夏，旱。",
        "next": "上乃下詔曰：「天旱，意乾封乎？"
      }
    },
    {
      "id": "s0342",
      "type": "paragraph",
      "chinese": "上乃下詔曰：「天旱，意乾封乎？",
      "literal": "Emperor then issued edict said: 'Heaven drought, meaning dry feng huh?",
      "idiomatic": "Emperor then issued edict said: 'Heaven drought, meaning dry feng huh? (translated).",
      "context": {
        "previous": "公孫卿曰：「黃帝時封則天旱，乾封三年。」",
        "next": "其令天下尊祠靈星焉。」"
      }
    },
    {
      "id": "s0343",
      "type": "paragraph",
      "chinese": "其令天下尊祠靈星焉。」",
      "literal": "Let command realm honor sacrifice spirit star there.'",
      "idiomatic": "Let command realm honor sacrifice spirit star there.' (translated).",
      "context": {
        "previous": "上乃下詔曰：「天旱，意乾封乎？"
      }
    },
    {
      "id": "s0344",
      "type": "paragraph",
      "chinese": "其明年，上郊雍，通回中道，巡之。",
      "literal": "Its next year, emperor suburban Yong, opened Huizhong path, toured it.",
      "idiomatic": "Its next year, emperor suburban Yong, opened Huizhong path, toured it. (translated).",
      "context": {
        "next": "春，至鳴澤，從西河歸。"
      }
    },
    {
      "id": "s0345",
      "type": "paragraph",
      "chinese": "春，至鳴澤，從西河歸。",
      "literal": "Spring, arrived Mingze, from Xihe returned.",
      "idiomatic": "Spring, arrived Mingze, from Xihe returned. (translated).",
      "context": {
        "previous": "其明年，上郊雍，通回中道，巡之。"
      }
    },
    {
      "id": "s0346",
      "type": "paragraph",
      "chinese": "其明年冬，上巡南郡，至江陵而東。",
      "literal": "Its next year winter, emperor toured Nangun, arrived Jiangling and east.",
      "idiomatic": "Its next year winter, emperor toured Nangun, arrived Jiangling and east. (translated).",
      "context": {
        "next": "登禮潛之天柱山，號曰南嶽。"
      }
    },
    {
      "id": "s0347",
      "type": "paragraph",
      "chinese": "登禮潛之天柱山，號曰南嶽。",
      "literal": "Ascended ritual Qian Tianzhu mountain, named Nanyue.",
      "idiomatic": "Ascended ritual Qian Tianzhu mountain, named Nanyue. (translated).",
      "context": {
        "previous": "其明年冬，上巡南郡，至江陵而東。",
        "next": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。"
      }
    },
    {
      "id": "s0348",
      "type": "paragraph",
      "chinese": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。",
      "literal": "Floated Jiang, from Xunyang exited Congyang, passed Pengli, sacrificed its famous mountains rivers.",
      "idiomatic": "Floated Jiang, from Xunyang exited Congyang, passed Pengli, sacrificed its famous mountains rivers. (translated).",
      "context": {
        "previous": "登禮潛之天柱山，號曰南嶽。",
        "next": "北至瑯邪，并海上。"
      }
    },
    {
      "id": "s0349",
      "type": "paragraph",
      "chinese": "北至瑯邪，并海上。",
      "literal": "North arrived Langye, along sea above.",
      "idiomatic": "North arrived Langye, along sea above. (translated).",
      "context": {
        "previous": "浮江，自尋陽出樅陽，過彭蠡，祀其名山川。",
        "next": "四月中，至奉高修封焉。"
      }
    },
    {
      "id": "s0350",
      "type": "paragraph",
      "chinese": "四月中，至奉高修封焉。",
      "literal": "Fourth month middle, arrived Fenggao repaired feng there.",
      "idiomatic": "Fourth month middle, arrived Fenggao repaired feng there. (translated).",
      "context": {
        "previous": "北至瑯邪，并海上。"
      }
    },
    {
      "id": "s0351",
      "type": "paragraph",
      "chinese": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
      "literal": "Initially, Son of Heaven feng Taishan, Taishan northeast zhi ancient time had bright hall place, place dangerous not spacious.",
      "idiomatic": "Initially, Son of Heaven feng Taishan, Taishan northeast zhi ancient time had bright hall place, place dangerous not spacious. (translated).",
      "context": {
        "next": "上欲治明堂奉高旁，未曉其制度。"
      }
    },
    {
      "id": "s0352",
      "type": "paragraph",
      "chinese": "上欲治明堂奉高旁，未曉其制度。",
      "literal": "Emperor wished repair bright hall Fenggao side, not yet clear its system regulations.",
      "idiomatic": "Emperor wished repair bright hall Fenggao side, not yet clear its system regulations. (translated).",
      "context": {
        "previous": "初，天子封泰山，泰山東北阯古時有明堂處，處險不敞。",
        "next": "濟南人公玊帶上黃帝時明堂圖。"
      }
    },
    {
      "id": "s0353",
      "type": "paragraph",
      "chinese": "濟南人公玊帶上黃帝時明堂圖。",
      "literal": "Jinan person Gong Yu presented Yellow Emperor time bright hall diagram.",
      "idiomatic": "Jinan person Gong Yu presented Yellow Emperor time bright hall diagram. (translated).",
      "context": {
        "previous": "上欲治明堂奉高旁，未曉其制度。",
        "next": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。"
      }
    },
    {
      "id": "s0354",
      "type": "paragraph",
      "chinese": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
      "literal": "Bright hall diagram middle had one hall, four sides no walls, with thatch cover, connected water, round palace walls made double path, above had tower, from southwest entered, named Kunlun, Son of Heaven followed it entered, to bow sacrifice Supreme Deity there.",
      "idiomatic": "Bright hall diagram middle had one hall, four sides no walls, with thatch cover, connected water, round palace walls made double path, above had tower, from southwest entered, named Kunlun, Son of Heaven followed it entered, to bow sacrifice Supreme Deity there. (translated).",
      "context": {
        "previous": "濟南人公玊帶上黃帝時明堂圖。",
        "next": "於是上令奉高作明堂汶上，如帶圖。"
      }
    },
    {
      "id": "s0355",
      "type": "paragraph",
      "chinese": "於是上令奉高作明堂汶上，如帶圖。",
      "literal": "Thereupon emperor ordered Fenggao make bright hall Wenshang, like Dai diagram.",
      "idiomatic": "Thereupon emperor ordered Fenggao make bright hall Wenshang, like Dai diagram. (translated).",
      "context": {
        "previous": "明堂圖中有一殿，四面無壁，以茅蓋，通水，圜宮垣為複道，上有樓，從西南入，命曰昆侖，天子從之入，以拜祠上帝焉。",
        "next": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。"
      }
    },
    {
      "id": "s0356",
      "type": "paragraph",
      "chinese": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。",
      "literal": "And fifth year repaired feng, then sacrificed Taiyi, Five Emperors at bright hall upper seat, made Gao emperor sacrifice seat face it.",
      "idiomatic": "And fifth year repaired feng, then sacrificed Taiyi, Five Emperors at bright hall upper seat, made Gao emperor sacrifice seat face it. (translated).",
      "context": {
        "previous": "於是上令奉高作明堂汶上，如帶圖。",
        "next": "祠后土於下房，以二十太牢。"
      }
    },
    {
      "id": "s0357",
      "type": "paragraph",
      "chinese": "祠后土於下房，以二十太牢。",
      "literal": "Sacrificed Houtu at lower chamber, with twenty great sacrificial animals.",
      "idiomatic": "Sacrificed Houtu at lower chamber, with twenty great sacrificial animals. (translated).",
      "context": {
        "previous": "及五年修封，則祠泰一、五帝於明堂上坐，令高皇帝祠坐對之。",
        "next": "天子從昆侖道入，始拜明堂如郊禮。"
      }
    },
    {
      "id": "s0358",
      "type": "paragraph",
      "chinese": "天子從昆侖道入，始拜明堂如郊禮。",
      "literal": "Son of Heaven followed Kunlun path entered, first bowed bright hall like suburban ritual.",
      "idiomatic": "Son of Heaven followed Kunlun path entered, first bowed bright hall like suburban ritual. (translated).",
      "context": {
        "previous": "祠后土於下房，以二十太牢。",
        "next": "禮畢，燎堂下。"
      }
    },
    {
      "id": "s0359",
      "type": "paragraph",
      "chinese": "禮畢，燎堂下。",
      "literal": "Ritual finished, burned hall below.",
      "idiomatic": "Ritual finished, burned hall below. (translated).",
      "context": {
        "previous": "天子從昆侖道入，始拜明堂如郊禮。",
        "next": "而上又上泰山，有祕祠其顛。"
      }
    },
    {
      "id": "s0360",
      "type": "paragraph",
      "chinese": "而上又上泰山，有祕祠其顛。",
      "literal": "Yet emperor moreover ascended Taishan, had secret sacrifice its peak.",
      "idiomatic": "Yet emperor moreover ascended Taishan, had secret sacrifice its peak. (translated).",
      "context": {
        "previous": "禮畢，燎堂下。",
        "next": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。"
      }
    },
    {
      "id": "s0361",
      "type": "paragraph",
      "chinese": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。",
      "literal": "Yet Taishan below sacrificed Five Emperors, each like their directions, Yellow Emperor together with Red Emperor, yet officials attended sacrifice there.",
      "idiomatic": "Yet Taishan below sacrificed Five Emperors, each like their directions, Yellow Emperor together with Red Emperor, yet officials attended sacrifice there. (translated).",
      "context": {
        "previous": "而上又上泰山，有祕祠其顛。",
        "next": "泰山上舉火，下悉應之。"
      }
    },
    {
      "id": "s0362",
      "type": "paragraph",
      "chinese": "泰山上舉火，下悉應之。",
      "literal": "Taishan above raised fire, below all responded it.",
      "idiomatic": "Taishan above raised fire, below all responded it. (translated).",
      "context": {
        "previous": "而泰山下祠五帝，各如其方，黃帝并赤帝，而有司侍祠焉。"
      }
    },
    {
      "id": "s0363",
      "type": "paragraph",
      "chinese": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
      "literal": "Its after two years, eleventh month jiazi new moon dawn winter solstice, pushed calendar ones with fundamental system.",
      "idiomatic": "Its after two years, eleventh month jiazi new moon dawn winter solstice, pushed calendar ones with fundamental system. (translated).",
      "context": {
        "next": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。"
      }
    },
    {
      "id": "s0364",
      "type": "paragraph",
      "chinese": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。",
      "literal": "Son of Heaven personally arrived Taishan, with eleventh month jiazi new moon dawn winter solstice day sacrificed Supreme Deity bright hall, every repaired feng shan.",
      "idiomatic": "Son of Heaven personally arrived Taishan, with eleventh month jiazi new moon dawn winter solstice day sacrificed Supreme Deity bright hall, every repaired feng shan. (translated).",
      "context": {
        "previous": "其後二歲，十一月甲子朔旦冬至，推歷者以本統。",
        "next": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。"
      }
    },
    {
      "id": "s0365",
      "type": "paragraph",
      "chinese": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。",
      "literal": "Its assist feast said: 'Heaven increased bestowed emperor Taiyuan divine tally, cycled and repeated began.",
      "idiomatic": "Its assist feast said: 'Heaven increased bestowed emperor Taiyuan divine tally, cycled and repeated began. (translated).",
      "context": {
        "previous": "天子親至泰山，以十一月甲子朔旦冬至日祠上帝明堂，每修封禪。",
        "next": "皇帝敬拜泰一。」"
      }
    },
    {
      "id": "s0366",
      "type": "paragraph",
      "chinese": "皇帝敬拜泰一。」",
      "literal": "Emperor respectfully bowed Taiyi.'",
      "idiomatic": "Emperor respectfully bowed Taiyi.' (translated).",
      "context": {
        "previous": "其贊饗曰：「天增授皇帝泰元神筴，周而復始。",
        "next": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。"
      }
    },
    {
      "id": "s0367",
      "type": "paragraph",
      "chinese": "東至海上，考入海及方士求神者，莫驗，然益遣，冀遇之。",
      "literal": "East arrived sea above, examined entered sea and fangshi sought spirits ones, none verified, yet increased sent, hoped encountered it.",
      "idiomatic": "East arrived sea above, examined entered sea and fangshi sought spirits ones, none verified, yet increased sent, hoped encountered it. (translated).",
      "context": {
        "previous": "皇帝敬拜泰一。」"
      }
    },
    {
      "id": "s0368",
      "type": "paragraph",
      "chinese": "十一月乙酉，柏梁災。",
      "literal": "Eleventh month yi you, Boliang disaster.",
      "idiomatic": "Eleventh month yi you, Boliang disaster. (translated).",
      "context": {
        "next": "十二月甲午朔，上親禪高里，祠后土。"
      }
    },
    {
      "id": "s0369",
      "type": "paragraph",
      "chinese": "十二月甲午朔，上親禪高里，祠后土。",
      "literal": "Twelfth month jiawu new moon, emperor personally shan Gaoli, sacrificed Houtu.",
      "idiomatic": "Twelfth month jiawu new moon, emperor personally shan Gaoli, sacrificed Houtu. (translated).",
      "context": {
        "previous": "十一月乙酉，柏梁災。",
        "next": "臨渤海，將以望祠蓬萊之屬，冀至殊庭焉。"
      }
    },
    {
      "id": "s0370",
      "type": "paragraph",
      "chinese": "臨渤海，將以望祠蓬萊之屬，冀至殊庭焉。",
      "literal": "Faced Bohai, about to gaze sacrifice Penglai kind, hoped arrived special court there.",
      "idiomatic": "Faced Bohai, about to gaze sacrifice Penglai kind, hoped arrived special court there. (translated).",
      "context": {
        "previous": "十二月甲午朔，上親禪高里，祠后土。"
      }
    },
    {
      "id": "s0371",
      "type": "paragraph",
      "chinese": "上還，以柏梁災故，朝受計甘泉。",
      "literal": "Emperor returned, because Boliang disaster reason, morning received accounts Ganquan.",
      "idiomatic": "Emperor returned, because Boliang disaster reason, morning received accounts Ganquan. (translated).",
      "context": {
        "next": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。"
      }
    },
    {
      "id": "s0372",
      "type": "paragraph",
      "chinese": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。",
      "literal": "Gongsun Qing said: 'Yellow Emperor approached Qingling Tower, twelve days burned, Yellow Emperor then governed bright court.",
      "idiomatic": "Gongsun Qing said: 'Yellow Emperor approached Qingling Tower, twelve days burned, Yellow Emperor then governed bright court. (translated).",
      "context": {
        "previous": "上還，以柏梁災故，朝受計甘泉。",
        "next": "明庭，甘泉也。」"
      }
    },
    {
      "id": "s0373",
      "type": "paragraph",
      "chinese": "明庭，甘泉也。」",
      "literal": "Bright court, Ganquan also.'",
      "idiomatic": "Bright court, Ganquan also.' (translated).",
      "context": {
        "previous": "公孫卿曰：「黃帝就青靈臺，十二日燒，黃帝乃治明庭。",
        "next": "方士多言古帝王有都甘泉者。"
      }
    },
    {
      "id": "s0374",
      "type": "paragraph",
      "chinese": "方士多言古帝王有都甘泉者。",
      "literal": "Fangshi many said ancient emperor kings had capitals Ganquan ones.",
      "idiomatic": "Fangshi many said ancient emperor kings had capitals Ganquan ones. (translated).",
      "context": {
        "previous": "明庭，甘泉也。」",
        "next": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。"
      }
    },
    {
      "id": "s0375",
      "type": "paragraph",
      "chinese": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
      "literal": "Its after Son of Heaven moreover received feudal lords Ganquan, Ganquan made feudal lords lodgings.",
      "idiomatic": "Its after Son of Heaven moreover received feudal lords Ganquan, Ganquan made feudal lords lodgings. (translated).",
      "context": {
        "previous": "方士多言古帝王有都甘泉者。",
        "next": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」"
      }
    },
    {
      "id": "s0376",
      "type": "paragraph",
      "chinese": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」",
      "literal": "Yongzhi then said: 'Yue custom has fire disaster, rebuild houses must with big, use overcome control it.'",
      "idiomatic": "Yongzhi then said: 'Yue custom has fire disaster, rebuild houses must with big, use overcome control it.' (translated).",
      "context": {
        "previous": "其後天子又朝諸侯甘泉，甘泉作諸侯邸。",
        "next": "於是作建章宮，度為千門萬戶。"
      }
    },
    {
      "id": "s0377",
      "type": "paragraph",
      "chinese": "於是作建章宮，度為千門萬戶。",
      "literal": "Thereupon made Jianzhang Palace, measured as thousand gates ten thousand households.",
      "idiomatic": "Thereupon made Jianzhang Palace, measured as thousand gates ten thousand households. (translated).",
      "context": {
        "previous": "勇之乃曰：「越俗有火災，復起屋必以大，用勝服之。」",
        "next": "前殿度高未央，其東則鳳闕，高二十餘丈。"
      }
    },
    {
      "id": "s0378",
      "type": "paragraph",
      "chinese": "前殿度高未央，其東則鳳闕，高二十餘丈。",
      "literal": "Front hall measured high Weiyang, its east then phoenix gate, high twenty remaining zhang.",
      "idiomatic": "Front hall measured high Weiyang, its east then phoenix gate, high twenty remaining zhang. (translated).",
      "context": {
        "previous": "於是作建章宮，度為千門萬戶。",
        "next": "其西則唐中，數十里虎圈。"
      }
    },
    {
      "id": "s0379",
      "type": "paragraph",
      "chinese": "其西則唐中，數十里虎圈。",
      "literal": "Its west then Tang middle, several ten li tiger enclosure.",
      "idiomatic": "Its west then Tang middle, several ten li tiger enclosure. (translated).",
      "context": {
        "previous": "前殿度高未央，其東則鳳闕，高二十餘丈。",
        "next": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。"
      }
    },
    {
      "id": "s0380",
      "type": "paragraph",
      "chinese": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
      "literal": "Its north governed big pool, Jian Tower high twenty remaining zhang, named Taiye Pool, middle had Penglai, Fangzhang, Yingzhou, Huxiang, resembled sea middle divine mountains turtles fish kind.",
      "idiomatic": "Its north governed big pool, Jian Tower high twenty remaining zhang, named Taiye Pool, middle had Penglai, Fangzhang, Yingzhou, Huxiang, resembled sea middle divine mountains turtles fish kind. (translated).",
      "context": {
        "previous": "其西則唐中，數十里虎圈。",
        "next": "其南有玉堂、璧門、大鳥之屬。"
      }
    },
    {
      "id": "s0381",
      "type": "paragraph",
      "chinese": "其南有玉堂、璧門、大鳥之屬。",
      "literal": "Its south had jade hall, jade gate, big bird kind.",
      "idiomatic": "Its south had jade hall, jade gate, big bird kind. (translated).",
      "context": {
        "previous": "其北治大池，漸臺高二十餘丈，名曰泰液池，中有蓬萊、方丈、瀛洲、壺梁，象海中神山龜魚之屬。",
        "next": "乃立神明臺、井幹樓，度五十餘丈，輦道相屬焉。"
      }
    },
    {
      "id": "s0382",
      "type": "paragraph",
      "chinese": "乃立神明臺、井幹樓，度五十餘丈，輦道相屬焉。",
      "literal": "Then established divine bright tower, well trunk building, measured fifty remaining zhang, carriage paths mutually connected there.",
      "idiomatic": "Then established divine bright tower, well trunk building, measured fifty remaining zhang, carriage paths mutually connected there. (translated).",
      "context": {
        "previous": "其南有玉堂、璧門、大鳥之屬。"
      }
    },
    {
      "id": "s0383",
      "type": "paragraph",
      "chinese": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字。",
      "literal": "Summer, Han changed calendar, with first month as year beginning, yet color above yellow, official names changed seals with five characters.",
      "idiomatic": "Summer, Han changed calendar, with first month as year beginning, yet color above yellow, official names changed seals with five characters. (translated).",
      "context": {
        "next": "因為太初元年。"
      }
    },
    {
      "id": "s0384",
      "type": "paragraph",
      "chinese": "因為太初元年。",
      "literal": "Because of Tai Chu first year.",
      "idiomatic": "Because of Tai Chu first year. (translated).",
      "context": {
        "previous": "夏，漢改歷，以正月為歲首，而色上黃，官名更印章以五字。",
        "next": "是歲，西伐大宛。"
      }
    },
    {
      "id": "s0385",
      "type": "paragraph",
      "chinese": "是歲，西伐大宛。",
      "literal": "This year, west attacked Dayuan.",
      "idiomatic": "This year, west attacked Dayuan. (translated).",
      "context": {
        "previous": "因為太初元年。",
        "next": "蝗大起。"
      }
    },
    {
      "id": "s0386",
      "type": "paragraph",
      "chinese": "蝗大起。",
      "literal": "Locusts greatly arose.",
      "idiomatic": "Locusts greatly arose. (translated).",
      "context": {
        "previous": "是歲，西伐大宛。",
        "next": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。"
      }
    },
    {
      "id": "s0387",
      "type": "paragraph",
      "chinese": "丁夫人、雒陽虞初等以方祠詛匈奴、大宛焉。",
      "literal": "Ding lady, Luoyang Yu Chu etc with methods sacrificed cursed Xiongnu, Dayuan there.",
      "idiomatic": "Ding lady, Luoyang Yu Chu etc with methods sacrificed cursed Xiongnu, Dayuan there. (translated).",
      "context": {
        "previous": "蝗大起。"
      }
    },
    {
      "id": "s0388",
      "type": "paragraph",
      "chinese": "其明年，有司言雍五畤無牢熟具，芬芳不備。",
      "literal": "Its next year, officials said Yong five altars no sacrificial cooked implements, fragrance not complete.",
      "idiomatic": "Its next year, officials said Yong five altars no sacrificial cooked implements, fragrance not complete. (translated).",
      "context": {
        "next": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。"
      }
    },
    {
      "id": "s0389",
      "type": "paragraph",
      "chinese": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。",
      "literal": "Then commanded sacrifice officials advance altar calves sacrificial implements, five colors food what overcomes, yet with wooden yu horses substitute colts there.",
      "idiomatic": "Then commanded sacrifice officials advance altar calves sacrificial implements, five colors food what overcomes, yet with wooden yu horses substitute colts there. (translated).",
      "context": {
        "previous": "其明年，有司言雍五畤無牢熟具，芬芳不備。",
        "next": "獨五帝用駒，行親郊用駒。"
      }
    },
    {
      "id": "s0390",
      "type": "paragraph",
      "chinese": "獨五帝用駒，行親郊用駒。",
      "literal": "Only Five Emperors used colts, performed personal suburban used colts.",
      "idiomatic": "Only Five Emperors used colts, performed personal suburban used colts. (translated).",
      "context": {
        "previous": "乃命祠官進畤犢牢具，五色食所勝，而以木禺馬代駒焉。",
        "next": "及諸名山川用駒者，悉以木禺馬代。"
      }
    },
    {
      "id": "s0391",
      "type": "paragraph",
      "chinese": "及諸名山川用駒者，悉以木禺馬代。",
      "literal": "And various famous mountains rivers used colts ones, all with wooden yu horses substituted.",
      "idiomatic": "And various famous mountains rivers used colts ones, all with wooden yu horses substituted. (translated).",
      "context": {
        "previous": "獨五帝用駒，行親郊用駒。",
        "next": "行過，乃用駒。"
      }
    },
    {
      "id": "s0392",
      "type": "paragraph",
      "chinese": "行過，乃用駒。",
      "literal": "Travel passed, then used colts.",
      "idiomatic": "Travel passed, then used colts. (translated).",
      "context": {
        "previous": "及諸名山川用駒者，悉以木禺馬代。",
        "next": "他禮如故。"
      }
    },
    {
      "id": "s0393",
      "type": "paragraph",
      "chinese": "他禮如故。",
      "literal": "Other rituals like before.",
      "idiomatic": "Other rituals like before. (translated).",
      "context": {
        "previous": "行過，乃用駒。"
      }
    },
    {
      "id": "s0394",
      "type": "paragraph",
      "chinese": "其明年，東巡海上，考神僊之屬，未有驗者。",
      "literal": "Its next year, east toured sea above, examined divine immortals kind, not yet had verified ones.",
      "idiomatic": "Its next year, east toured sea above, examined divine immortals kind, not yet had verified ones. (translated).",
      "context": {
        "next": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。"
      }
    },
    {
      "id": "s0395",
      "type": "paragraph",
      "chinese": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。",
      "literal": "Fangshi had words 'Yellow Emperor time made five cities twelve towers, to await divine people at Zhiji, named Yingnian.'",
      "idiomatic": "Fangshi had words 'Yellow Emperor time made five cities twelve towers, to await divine people at Zhiji, named Yingnian.' (translated).",
      "context": {
        "previous": "其明年，東巡海上，考神僊之屬，未有驗者。",
        "next": "上許作之如方，名曰明年。"
      }
    },
    {
      "id": "s0396",
      "type": "paragraph",
      "chinese": "上許作之如方，名曰明年。",
      "literal": "Emperor permitted made it like method, named Mingnian.",
      "idiomatic": "Emperor permitted made it like method, named Mingnian. (translated).",
      "context": {
        "previous": "方士有言「黃帝時為五城十二樓，以候神人於執期，命曰迎年」。",
        "next": "上親禮祠上帝，衣上黃焉。"
      }
    },
    {
      "id": "s0397",
      "type": "paragraph",
      "chinese": "上親禮祠上帝，衣上黃焉。",
      "literal": "Emperor personally ritual sacrificed Supreme Deity, clothed above yellow there.",
      "idiomatic": "Emperor personally ritual sacrificed Supreme Deity, clothed above yellow there. (translated).",
      "context": {
        "previous": "上許作之如方，名曰明年。"
      }
    },
    {
      "id": "s0398",
      "type": "paragraph",
      "chinese": "公玊帶曰：「黃帝時雖封泰山，然風后、封鉅、岐伯令黃帝封東泰山，禪凡山合符，然後不死焉。」",
      "literal": "Gong Yu Dai said: 'Yellow Emperor time though feng Taishan, yet Feng Hou, Feng Ju, Qi Bo commanded Yellow Emperor feng east Taishan, shan Fan mountain united tally, then not die there.'",
      "idiomatic": "Gong Yu Dai said: 'Yellow Emperor time though feng Taishan, yet Feng Hou, Feng Ju, Qi Bo commanded Yellow Emperor feng east Taishan, shan Fan mountain united tally, then not die there.' (translated).",
      "context": {
        "next": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。"
      }
    },
    {
      "id": "s0399",
      "type": "paragraph",
      "chinese": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
      "literal": "Son of Heaven already commanded set sacrifice implements, arrived east Taishan, east Taishan low small, not worthy its reputation, then commanded sacrifice officials ritual it, yet not feng shan there.",
      "idiomatic": "Son of Heaven already commanded set sacrifice implements, arrived east Taishan, east Taishan low small, not worthy its reputation, then commanded sacrifice officials ritual it, yet not feng shan there. (translated).",
      "context": {
        "previous": "公玊帶曰：「黃帝時雖封泰山，然風后、封鉅、岐伯令黃帝封東泰山，禪凡山合符，然後不死焉。」",
        "next": "其後令帶奉祠候神物。"
      }
    },
    {
      "id": "s0400",
      "type": "paragraph",
      "chinese": "其後令帶奉祠候神物。",
      "literal": "Its after commanded Dai serve sacrifice await divine things.",
      "idiomatic": "Its after commanded Dai serve sacrifice await divine things. (translated).",
      "context": {
        "previous": "天子既令設祠具，至東泰山，東泰山卑小，不稱其聲，乃令祠官禮之，而不封禪焉。",
        "next": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。"
      }
    },
    {
      "id": "s0401",
      "type": "paragraph",
      "chinese": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。",
      "literal": "Summer, then returned Taishan, repaired five years ritual like before, yet added shan sacrifice Shilü.",
      "idiomatic": "Summer, then returned Taishan, repaired five years ritual like before, yet added shan sacrifice Shilü. (translated).",
      "context": {
        "previous": "其後令帶奉祠候神物。",
        "next": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。"
      }
    },
    {
      "id": "s0402",
      "type": "paragraph",
      "chinese": "石閭者，在泰山下阯南方，方士多言此僊人之閭也，故上親禪焉。",
      "literal": "Shilü is, at Taishan below zhi southern, fangshi many said this immortal person gate also, therefore emperor personally shan there.",
      "idiomatic": "Shilü is, at Taishan below zhi southern, fangshi many said this immortal person gate also, therefore emperor personally shan there. (translated).",
      "context": {
        "previous": "夏，遂還泰山，修五年之禮如前，而加禪祠石閭。"
      }
    },
    {
      "id": "s0403",
      "type": "paragraph",
      "chinese": "其後五年，復至泰山修封，還過祭常山。",
      "literal": "Its after five years, again arrived Taishan repaired feng, returned passed sacrificed Changshan.",
      "idiomatic": "Its after five years, again arrived Taishan repaired feng, returned passed sacrificed Changshan. (translated).",
      "context": {}
    },
    {
      "id": "s0404",
      "type": "paragraph",
      "chinese": "今天子所興祠，泰一、后土，三年親郊祠，建漢家封禪，五年一修封。",
      "literal": "Now Son of Heaven what raised sacrifices, Taiyi, Houtu, three years personally suburban sacrificed, established Han house fengshan, five years once repaired feng.",
      "idiomatic": "Now Son of Heaven what raised sacrifices, Taiyi, Houtu, three years personally suburban sacrificed, established Han house fengshan, five years once repaired feng. (translated).",
      "context": {
        "next": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。"
      }
    },
    {
      "id": "s0405",
      "type": "paragraph",
      "chinese": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
      "literal": "Boji Taiyi and San Yi, Ming Yang, Ma Xing, Chixing, five, Kuanshu what sacrifice officials with year seasons presented ritual.",
      "idiomatic": "Boji Taiyi and San Yi, Ming Yang, Ma Xing, Chixing, five, Kuanshu what sacrifice officials with year seasons presented ritual. (translated).",
      "context": {
        "previous": "今天子所興祠，泰一、后土，三年親郊祠，建漢家封禪，五年一修封。",
        "next": "凡六祠，皆太祝領之。"
      }
    },
    {
      "id": "s0406",
      "type": "paragraph",
      "chinese": "凡六祠，皆太祝領之。",
      "literal": "Altogether six sacrifices, all grand prayer led them.",
      "idiomatic": "Altogether six sacrifices, all grand prayer led them. (translated).",
      "context": {
        "previous": "薄忌泰一及三一、冥羊、馬行、赤星，五，寬舒之祠官以歲時致禮。",
        "next": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。"
      }
    },
    {
      "id": "s0407",
      "type": "paragraph",
      "chinese": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。",
      "literal": "As for eight spirits various spirits, Mingnian, Fan mountain other named sacrifices, travel passed then sacrificed, left then stopped.",
      "idiomatic": "As for eight spirits various spirits, Mingnian, Fan mountain other named sacrifices, travel passed then sacrificed, left then stopped. (translated).",
      "context": {
        "previous": "凡六祠，皆太祝領之。",
        "next": "方士所興祠，各自主，其人終則已，祠官弗主。"
      }
    },
    {
      "id": "s0408",
      "type": "paragraph",
      "chinese": "方士所興祠，各自主，其人終則已，祠官弗主。",
      "literal": "Fangshi what raised sacrifices, each self-maintained, their person ended then stopped, sacrifice officials not managed.",
      "idiomatic": "Fangshi what raised sacrifices, each self-maintained, their person ended then stopped, sacrifice officials not managed. (translated).",
      "context": {
        "previous": "至如八神諸神，明年、凡山他名祠，行過則祀，去則已。",
        "next": "他祠皆如其故。"
      }
    },
    {
      "id": "s0409",
      "type": "paragraph",
      "chinese": "他祠皆如其故。",
      "literal": "Other sacrifices all like their former.",
      "idiomatic": "Other sacrifices all like their former. (translated).",
      "context": {
        "previous": "方士所興祠，各自主，其人終則已，祠官弗主。",
        "next": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。"
      }
    },
    {
      "id": "s0410",
      "type": "paragraph",
      "chinese": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
      "literal": "Now emperor feng shan, its after twelve years then returned, covered the five peaks, four rivers.",
      "idiomatic": "Now emperor feng shan, its after twelve years then returned, covered the five peaks, four rivers. (translated).",
      "context": {
        "previous": "他祠皆如其故。",
        "next": "而方士之候祠神人，入海求蓬萊，終無有驗。"
      }
    },
    {
      "id": "s0411",
      "type": "paragraph",
      "chinese": "而方士之候祠神人，入海求蓬萊，終無有驗。",
      "literal": "Yet fangshi what awaited sacrificed divine people, entered sea sought Penglai, in end had no verification.",
      "idiomatic": "Yet fangshi what awaited sacrificed divine people, entered sea sought Penglai, in end had no verification. (translated).",
      "context": {
        "previous": "今上封禪，其後十二歲而還，遍於五岳、四瀆矣。",
        "next": "而公孫卿之候神者，猶以大人跡為解，無其效。"
      }
    },
    {
      "id": "s0412",
      "type": "paragraph",
      "chinese": "而公孫卿之候神者，猶以大人跡為解，無其效。",
      "literal": "Yet Gongsun Qing what awaited spirits ones, still with great person traces made explanation, no its effect.",
      "idiomatic": "Yet Gongsun Qing what awaited spirits ones, still with great person traces made explanation, no its effect. (translated).",
      "context": {
        "previous": "而方士之候祠神人，入海求蓬萊，終無有驗。",
        "next": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。"
      }
    },
    {
      "id": "s0413",
      "type": "paragraph",
      "chinese": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。",
      "literal": "Son of Heaven increasingly weary disgusted fangshi strange circuitous words, yet in end restrained not cut off, hoped encountered its true.",
      "idiomatic": "Son of Heaven increasingly weary disgusted fangshi strange circuitous words, yet in end restrained not cut off, hoped encountered its true. (translated).",
      "context": {
        "previous": "而公孫卿之候神者，猶以大人跡為解，無其效。",
        "next": "自此之後，方士言祠神者彌眾，然其效可睹矣。"
      }
    },
    {
      "id": "s0414",
      "type": "paragraph",
      "chinese": "自此之後，方士言祠神者彌眾，然其效可睹矣。",
      "literal": "From this after, fangshi spoke sacrificed spirits ones increasingly many, yet its effect can be seen.",
      "idiomatic": "From this after, fangshi spoke sacrificed spirits ones increasingly many, yet its effect can be seen. (translated).",
      "context": {
        "previous": "天子益怠厭方士之怪迂語矣，然終羈縻弗絕，冀遇其真。"
      }
    },
    {
      "id": "s0415",
      "type": "paragraph",
      "chinese": "太史公曰：余從巡祭天地諸神名山川而封禪焉。",
      "literal": "Grand historian said: I followed toured sacrificed heaven earth various spirits famous mountains rivers and feng shan there.",
      "idiomatic": "Grand historian said: I followed toured sacrificed heaven earth various spirits famous mountains rivers and feng shan there. (translated).",
      "context": {
        "next": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。"
      }
    },
    {
      "id": "s0416",
      "type": "paragraph",
      "chinese": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。",
      "literal": "Entered Shougong served sacrifice spirits words, thoroughly observed fangshi sacrifice officials words, thereupon retired and discussed arranged from ancient since used affairs with ghosts spirits ones, fully saw their exterior interior.",
      "idiomatic": "Entered Shougong served sacrifice spirits words, thoroughly observed fangshi sacrifice officials words, thereupon retired and discussed arranged from ancient since used affairs with ghosts spirits ones, fully saw their exterior interior. (translated).",
      "context": {
        "previous": "太史公曰：余從巡祭天地諸神名山川而封禪焉。",
        "next": "後有君子，得以覽焉。"
      }
    },
    {
      "id": "s0417",
      "type": "paragraph",
      "chinese": "後有君子，得以覽焉。",
      "literal": "After have gentlemen, able to view there.",
      "idiomatic": "After have gentlemen, able to view there. (translated).",
      "context": {
        "previous": "入壽宮侍祠神語，究觀方士祠官之言，於是退而論次自古以來用事於鬼神者，具見其表裏。",
        "next": "至若俎豆珪幣之詳，獻酬之禮，則有司存焉。"
      }
    },
    {
      "id": "s0418",
      "type": "paragraph",
      "chinese": "至若俎豆珪幣之詳，獻酬之禮，則有司存焉。",
      "literal": "As for sacrificial vessels jade currency details, presenting toasts ritual, then officials preserve there.",
      "idiomatic": "As for sacrificial vessels jade currency details, presenting toasts ritual, then officials preserve there. (translated).",
      "context": {
        "previous": "後有君子，得以覽焉。"
      }
    }
  ]
}