{
  "metadata": {
    "book": "houhanshu",
    "chapter": "008",
    "file": "data/houhanshu/008.json"
  },
  "sentences": [
    {
      "id": "s0361",
      "chinese": "將二千石、令、長不崇寬和。",
      "literal": "Commandery two thousand shi, magistrates, chiefs do not honor broad harmony.",
      "idiomatic": "The two thousand shi officials of the commanderies, magistrates, and chiefs do not honor broad harmony."
    },
    {
      "id": "s0362",
      "chinese": "暴刻之為乎？",
      "literal": "Harsh cruel conduct towards them?",
      "idiomatic": "Is it harsh and cruel conduct towards them?"
    },
    {
      "id": "s0363",
      "chinese": "其令中都官繫囚罪非殊死考未竟者，一切任出，以須立秋。",
      "literal": "Command that capital officials imprisoned prisoners whose crimes are not capital punishment examinations not finished, all release them, to await beginning of autumn.",
      "idiomatic": "It is commanded that capital officials' imprisoned prisoners whose crimes are not capital punishment and whose examinations are not finished should all be released, to await the beginning of autumn."
    },
    {
      "id": "s0364",
      "chinese": "郡國有名山大澤能興雲雨者，二千石長吏各絜齊請禱，謁誠盡禮。",
      "literal": "Commanderies kingdoms famous mountains great marshes able to raise clouds rain ones, two thousand shi chief officials each purify themselves pray beseech, approach with sincerity exhaust ritual.",
      "idiomatic": "For famous mountains and great marshes in the commanderies and kingdoms that are able to raise clouds and rain, the two thousand shi chief officials should each purify themselves to pray and beseech, approaching with sincerity and exhausting the ritual."
    },
    {
      "id": "s0365",
      "chinese": "又兵役連年，死亡流離，或支骸不斂，或停棺莫收，朕甚愍焉。",
      "literal": "Moreover military service successive years, death exile separation, some scattered bones not gathered, some stopped coffins none collected, I greatly pity them.",
      "idiomatic": "Moreover, military service in successive years has caused death and exile; some scattered bones are not gathered, some stopped coffins are not collected; I greatly pity this."
    },
    {
      "id": "s0366",
      "chinese": "昔文王葬枯骨，人賴其德。",
      "literal": "Formerly King Wen buried withered bones, people relied on his virtue.",
      "idiomatic": "Formerly, King Wen buried withered bones, and the people relied on his virtue."
    },
    {
      "id": "s0367",
      "chinese": "今遣使者案行，若無家屬及貧無資者，隨宜賜恤，以慰孤魂。』",
      "literal": "Now dispatch envoys to inspect and implement, if no family relatives and poor without resources ones, according to appropriateness grant condolence, to comfort orphaned souls.\"",
      "idiomatic": "Now dispatch envoys to inspect and implement; if there are those with no family relatives and who are poor and without resources, grant condolence according to appropriateness, to comfort the orphaned souls.\"",
    },
    {
      "id": "s0368",
      "chinese": "是月，下邳人謝安應募擊徐鳳等，斬之。",
      "literal": "This month: Xiapi person Xie An responded to recruitment attacked Xu Feng and others, beheaded them.",
      "idiomatic": "This month, Xie An of Xiapi responded to recruitment, attacked Xu Feng and others, and beheaded them."
    },
    {
      "id": "s0369",
      "chinese": "丙辰，詔曰：『孝殤皇帝雖不永休祚，而即位踰年，君臣禮成。",
      "literal": "Bingchen day: Edict said: \"Filial Shang Emperor although not eternally enjoy mandate, but ascended throne over year, ruler minister ritual complete.",
      "idiomatic": "On the Bingchen day, the edict said: 'Although the Filial Shang Emperor did not eternally enjoy the mandate, he ascended the throne over a year, and the rituals between ruler and ministers were completed."
    },
    {
      "id": "s0370",
      "chinese": "孝安皇帝承襲統業，而前世遂令恭陵在康陵之上，先後相踰，失其次序，非所以奉宗廟之重，垂無窮之制。",
      "literal": "Filial An Emperor inherited unified enterprise, but previous generations then made Gong Mausoleum above Kang Mausoleum, before after mutually exceed, lost its sequence, not that by which to uphold ancestral temple weight, hang endless system.",
      "idiomatic": "The Filial An Emperor inherited the unified enterprise, but previous generations then placed the Gong Mausoleum above the Kang Mausoleum; the precedence exceeds each other and loses its sequence, which is not the way to uphold the weight of the ancestral temple and establish an endless system."
    },
    {
      "id": "s0371",
      "chinese": "昔定公追正順祀，《春秋》善之。",
      "literal": "Formerly Duke Ding corrected proper orderly sacrifices, 'Spring and Autumn' praised it.",
      "idiomatic": "Formerly, Duke Ding corrected the proper and orderly sacrifices; the 'Spring and Autumn' Annals praised it."
    },
    {
      "id": "s0372",
      "chinese": "其令恭陵次康陵，憲陵次恭陵，以序親秩，為萬世法。』",
      "literal": "Command Gong Mausoleum next to Kang Mausoleum, Xian Mausoleum next to Gong Mausoleum, to order kin ranks, be ten thousand generations law.\"",
      "idiomatic": "Command that the Gong Mausoleum be next to the Kang Mausoleum, and the Xian Mausoleum next to the Gong Mausoleum, to order the ranks of kin and be a law for ten thousand generations.\"",
    },
    {
      "id": "s0373",
      "chinese": "六月，鮮卑寇代郡。",
      "literal": "Sixth month: Xianbei invaded Dai commandery.",
      "idiomatic": "In the sixth month, the Xianbei invaded Dai commandery."
    },
    {
      "id": "s0374",
      "chinese": "秋七月庚寅，阜陵王代薨。",
      "literal": "Autumn, seventh month Gengyin day: Fuling King Dai passed away.",
      "idiomatic": "On the Gengyin day of the seventh month of autumn, King Dai of Fuling passed away."
    },
    {
      "id": "s0375",
      "chinese": "廬江盜賊攻尋陽，又攻盱台，滕撫遣司馬王章擊破之。",
      "literal": "Lujiang bandit robbers attacked Xunyiang, moreover attacked Xutai, Teng Fu dispatched Major Wang Zhang attacked and broke them.",
      "idiomatic": "Lujiang bandit robbers attacked Xunyiang, and moreover attacked Xutai; Teng Fu dispatched Major Wang Zhang and attacked and defeated them."
    }
  ]
}