{
  "s0": "BC",
  "s1": "Record year",
  "s2": "Major affairs record.",
  "s3": "Chancellor position.",
  "s4": "General position.",
  "s5": "Imperial censor chief position.",
  "s6": "206",
  "s7": "Gao Emperor first year",
  "s8": "Spring, Pei Gong became Han Wang, went to Nan Zheng. Autumn, returned pacified Yong.",
  "s9": "1. Chancellor Xiao He guarded Han Zhong.",
  "s11": "Imperial censor chief Zhou Ke guarded Xing Yang.",
  "s12": "205",
  "s13": "2",
  "s14": "Spring, pacified Sai, Di, Wei, He Nan, Han, Yin states. Summer, attacked Xiang Ji, reached Peng Cheng. Established crown prince. Returned occupied Xing Yang.",
  "s15": "2. Guarded Guan Zhong.",
  "s16": "1. Grand commander Chang An Hou Lu Wan.",
  "s18": "204",
  "s19": "3",
  "s20": "Wei Bao rebelled. Sent Han Xin separately pacify Wei, attack Zhao. Chu surrounded our Xing Yang.",
  "s21": "3",
  "s22": "2",
  "s24": "203",
  "s25": "4",
  "s26": "Sent Han Xin separately pacify Qi and Yan, Tai Gong from Chu returned, with Chu bordered Hong Qu.",
  "s27": "4",
  "s28": "3. Zhou Ke guarded Xing Yang, died.",
  "s29": "Imperial censor chief Fen Yin Hou Zhou Chang.",
  "s30": "202",
  "s31": "5",
  "s32": "Winter, broke Chu Gai Xia, killed Xiang Ji. Spring, Wang ascended emperor position Ding Tao. Entered capital Guan Zhong.",
  "s33": "5. Abolished grand commander office.",
  "s34": "4. After nine months, Wan became Yan Wang.",
  "s36": "201",
  "s37": "6",
  "s38": "Honored Tai Gong as Supreme Emperor. Liu Zhong as Dai Wang. Established great market. Changed named Xian Yang as Chang An.",
  "s39": "6. Sealed as Tan Hou. Zhang Cang as calculation chancellor.",
  "s42": "200",
  "s43": "7",
  "s44": "Chang Le Palace completed, from Que Yang moved Chang An. Attacked Xiong Nu, Xiong Nu surrounded our Ping Cheng.",
  "s45": "7",
  "s48": "199",
  "s49": "8",
  "s50": "Struck Han Xin rebel captured at Zhao Cheng. Guan Gao made chaos, next year discovered, executed him. Xiong Nu attacked Dai Wang, Dai Wang abandoned state fled, deposed as He Yang Hou.",
  "s51": "8",
  "s54": "198",
  "s55": "9",
  "s56": "Wei Chang Palace completed, set wine front hall, Supreme Emperor carriage upper sat, Emperor offered jade goblet longevity, said: 'Beginning often with minister not as Zhong strength, now minister merit who with Zhong many?' Supreme Emperor laughed, hall upper called ten thousand years. Moved Qi Tian, Chu Zhao, Qu, Jing to Guan Zhong.",
  "s57": "9. Moved to chancellor state.",
  "s59": "Imperial censor chief Chang as Zhao chancellor.",
  "s60": "197"
}