{
  "s0001": "Fan Sui was a Wei native, styled Shu.",
  "s0002": "He wandered persuading various lords, wishing to serve Wei king, but family poor with no means to support himself, so first served Wei central grand master Xu Jia.",
  "s0003": "Xu Jia as Wei Zhao Wang envoy to Qi, Fan Sui followed.",
  "s0004": "Stayed several months, not getting response.",
  "s0005": "Qi Xiang Wang heard Sui eloquent speech, then sent people grant Sui gold ten jin and beef wine, Sui declined thanked dared not accept.",
  "s0006": "Xu Jia knew it, greatly angered, considered Sui held Wei state secret matters told Qi, thus got this gifts, commanded Sui accept their beef wine, return their gold.",
  "s0007": "After returning home, still angry with Sui, reported to Wei chancellor.",
  "s0008": "Wei chancellor, Wei various crown princes, called Wei Qi.",
  "s0009": "Wei Qi greatly angered, made retainers cane beat Sui, broke ribs knocked out teeth.",
  "s0010": "Sui feigned death, then rolled in mat, placed in latrine.",
  "s0011": "Guests drinking got drunk, moreover urinated on Sui, thus humiliated to punish later, make none dare speak rashly.",
  "s0012": "Sui from mat told guard: 'You able release me, I certainly thick thank you.'",
  "s0013": "Guard then requested throw out dead person in mat.",
  "s0014": "Wei Qi drunk, said: 'Can.'",
  "s0015": "Fan Sui got out.",
  "s0016": "Later Wei Qi regretted, again summoned sought him.",
  "s0017": "Wei person Zheng Anping heard it, then led Fan Sui fled, hid, changed name surname called Zhang Lu.",
  "s0018": "At this time, Qin Zhao Wang made ye zhe Wang Ji go to Wei.",
  "s0019": "Zheng Anping falsely as soldier, served Wang Ji.",
  "s0020": "Wang Ji asked: 'Wei has worthy person can with together west wander?'",
  "s0021": "Zheng Anping said: 'Minister village has Zhang Lu master, wishes see lord, speak world affairs.",
  "s0022": "That person has enmity, dares not day see.'",
  "s0023": "Wang Ji said: 'Night with come.'",
  "s0024": "Zheng Anping night with Zhang Lu saw Wang Ji.",
  "s0025": "Conversation not complete, Wang Ji knew Fan Sui worthy, told him: 'Master wait me at three pavilions south.'",
  "s0026": "With private agreement left.",
  "s0027": "Wang Ji bid farewell Wei gone, passing carried Fan Sui enter Qin.",
  "s0028": "Arrived Hu, saw carriages riders from west coming.",
  "s0029": "Fan Sui said: 'Those coming are who?'",
  "s0030": "Wang Ji said: 'Qin chancellor Rang Hou east travel counties cities.'",
  "s0031": "Fan Sui said: 'I heard Rang Hou monopolizes Qin authority, hates receives various lords guests, this fears humiliate me, I rather temporarily hide carriage middle.'",
  "s0032": "After while, Rang Hou indeed arrived, greeted Wang Ji, because standing carriage spoke: 'Guan east has what change?'",
  "s0033": "Said: 'None.'",
  "s0034": "Again told Wang Ji: 'Ye zhe you not with various lords guest sons come together?",
  "s0035": "No benefit, only disrupts people state.'",
  "s0036": "Wang Ji said: 'Dare not.'",
  "s0037": "Then parted went.",
  "s0038": "Fan Sui said: 'I heard Rang Hou wise scholar, his seeing affairs slow, just now suspected carriage middle had person, forgot search it.'",
  "s0039": "Then Fan Sui alighted ran, said: 'This certainly regret it.'",
  "s0040": "Walked ten plus li, indeed made riders return search carriage middle, no guest, then stopped.",
  "s0041": "Wang Ji then with Fan Sui entered Xianyang.",
  "s0042": "Already reported envoy, because spoke: 'Wei has Zhang Lu master, world eloquent scholar.",
  "s0043": "Said Qin king state endangered like piled eggs, get minister then safe.",
  "s0044": "However cannot book transmit.'",
  "s0045": "Minister thus carried come.'",
  "s0046": "Qin king not believed, made lodge eat fodder straw.",
  "s0047": "Waited orders year plus.",
  "s0048": "At this time, Zhao Wang already established thirty six years.",
  "s0049": "South captured Chu Dang Ying, Chu Huai Wang imprisoned died in Qin.",
  "s0050": "Qin east broke Qi."
}