{
  "s1": "Sima Qian read the Spring and Autumn Annals and various historical records. When he reached King Li of Zhou, he could not help but put down his book and sigh.",
  "s2": "He said: \"Alas, Master Ji foresaw this!\"",
  "s3": "When King Zhou used ivory chopsticks, Jizi sighed.",
  "s4": "The Way of Zhou declined, and poets took it as their theme in their songs. Thus the \"Guan Ju\" was composed.",
  "s5": "When benevolence and righteousness declined, the \"Lu Ming\" criticized it.",
  "s6": "When King Li came to the throne, because he hated to hear about his faults, the nobles feared execution and disaster arose. King Li fled to Zhi, and chaos began in the capital, with the Gonghe administration taking power.",
  "s7": "After this, some used force to govern, the strong oppressed the weak, and they raised armies without asking the Son of Heaven.",
  "s8": "However, they wielded the righteousness of the royal house to use conquest as a means to become lords of alliances. Government was by the Five Hegemons, the feudal lords acted wantonly, indulged in extravagance and immorality, and traitorous ministers and usurping sons multiplied.",
  "s9": "Qi, Jin, Qin, and Chu were very weak during the Chengzhou period, their fiefs being only one hundred li or fifty li.",
  "s10": "Jin blocked the three rivers, Qi faced the Eastern Sea, Chu lay between the Jiang and Huai, Qin relied on the defenses of Yong province. The four seas successively rose up, taking turns to become hegemonic lords. The great enfeoffments praised by Wen and Wu were all awe-inspiring and submissive.",
  "s11": "Therefore Confucius clarified the king's way, petitioned more than seventy rulers, but none could employ him. So he looked west to the Zhou court, discussed the old traditions in the historical records, arose in Lu and arranged the Spring and Autumn Annals. Above he records Yin, below he reaches Ai's capture of the unicorn, condensing its wording and style, removing its tedious repetitions, to establish righteous principles. The king's way was complete, human affairs were harmonious.",
  "s12": "The disciples of the seventy followers received the transmissions orally, for there were satirical, critical, praising, euphemistic, and diminishing words that could not be written down.",
  "s13": "The Lu gentleman Zuo Qiuming feared that his disciples would each establish different doctrines, each secure in their own opinions, losing the truth. So he comprehensively discussed Confucius's historical records and compiled the Zuo's Spring and Autumn Annals.",
  "s14": "Duo Jiao wrote a commentary for King Wei of Chu. Since the king could not completely study the Spring and Autumn Annals, he selected successes and failures, finally making forty chapters, becoming the Duo family's minor commentary.",
  "s15": "During King Xiaocheng of Zhao's time, his chancellor Yu Qing collected from the Spring and Autumn Annals above and observed recent trends below, also writing eight chapters, becoming the Yu's Spring and Autumn Annals.",
  "s16": "Lü Buwei was chancellor to King Zhuangxiang of Qin. He also looked up to honor antiquity, collected and selected from the Spring and Autumn Annals, gathered events from the six states, making eight surveys, six discussions, twelve annals, becoming the Lü's Spring and Autumn Annals.",
  "s17": "And like Xun Qing, Mengzi, Gongsun Gu, Han Fei and others, each gathered and selected from the Spring and Autumn Annals' texts to write books, differing greatly.",
  "s18": "BCE",
  "s19": "Year",
  "s20": "Zhou",
  "s21": "Lu",
  "s22": "Qi",
  "s23": "Jin",
  "s24": "Qin",
  "s25": "Chu",
  "s26": "Song",
  "s27": "Wei",
  "s28": "Chen",
  "s29": "Cai",
  "s30": "Cao",
  "s31": "Zheng",
  "s32": "Yan",
  "s33": "Wu",
  "s244": "Fourteenth year: King Xuan ascended the throne, the Gonghe administration ended.",
  "s567": "Fourth year: Took a woman from Qi as consort.",
  "s597": "Lu: Xiaogong declared the first year, Bo Yu was established as ruler, called one of the various princes. Bo Yu was grandson of Wu Gong.",
  "s607": "Zheng: Huan Gong You first enfeoffed. Younger brother of King Xuan of Zhou's mother.",
  "s615": "Seventh year: Used to attack Tiao, gave birth to Crown Prince Qiu.",
  "s663": "Tenth year: Fought at Qianmu. Gave birth to Qiu's younger brother Cheng Shi. The two sons had rebellious names, the noblemen criticized it. Later there was disorder.",
  "s698": "Thirty-first year: Song Hui Gong passed away.",
  "s714": "Song Dai Gong established. First year.",
  "s757": "Eleventh year: King Xuan of Zhou executed Bo Yu, established his younger brother as Xiaogong.",
  "s935": "Twenty-seventh year: Mu Hou passed away, younger brother Shang Shu established himself, Crown Prince Qiu fled.",
  "s999": "Fourth year: Qiu attacked and killed Shang Shu, established himself as Wen Hou.",
  "s1012": "Second year: The three rivers shook.",
  "s1028": "Third year: The king took Bao Si.",
  "s1156": "Eleventh year: King You was killed by the Dog Rong.",
  "s1160": "Seventh year: Began to be ranked as feudal lords.",
  "s1167": "Thirty-sixth year: Because of King You, was killed by the Dog Rong.",
  "s1172": "Ping Wang first year: Moved east to Luo yi.",
  "s1176": "Eighth year: First established the Xi altar, sacrificed to the White Emperor.",
  "s1240": "Twelfth year: Attacked the Rong to Qi and died.",
  "s1327": "Tenth year: Married the daughter of Shen Hou, Wu Jiang.",
  "s1391": "Fourteenth year: Gave birth to Zhuang Gong, extraordinary birth.",
  "s1400": "Tenth year: Made the Fei altar.",
  "s1436": "Chen: Wen Gong Yu first year gave birth to Huan Gong Bao, Li Gong Ta. Ta's mother was a woman from Cai.",
  "s1439": "Seventeenth year: Gave birth to Grand Uncle Duan, mother wanted to establish Duan, the duke did not listen.",
  "s1530": "Eighteenth year: Gave birth to the mother of Lu Huan Gong.",
  "s1544": "Nineteenth year: Made sacrifices to Chen Bao.",
  "s1575": "Jin: Zhao Hou first year enfeoffed uncle Cheng Shi at Quwo. Quwo was larger than the state, noblemen criticized saying: \"The Jin people’s disorder began from Quwo.\"",
  "s1580": "Tenth year: Wen Gong passed away.",
  "s1615": "Zheng: Zhuang Gong extraordinary birth first year, Ji Zhong was chancellor.",
  "s1643": "Seventeenth year: Loved concubine Zi Zhou Xu, Zhou Xu liked military affairs.",
  "s1657": "Wu Wang established.",
  "s1671": "Pan Fu killed Zhao Hou, welcomed Cheng Shi, did not succeed. Zhao Hou's son was established, called Xiao Hou.",
  "s1739": "Twenty-third year: Consort had no son, Huan Gong established.",
  "s1771": "Second year: Younger brother Zhou Xu was arrogant, Huan demoted him, he fled.",
  "s1799": "Ninth year: Quwo Huan Shu Cheng Shi passed away, son succeeded, called Zhuang Bo.",
  "s1830": "Second year: Same mother younger brother Yi Zhong year gave birth to Gongsun Wuzhi.",
  "s1834": "Nineteenth year: The duke passed away, commanded to establish younger brother He, called Mu Gong.",
  "s1911": "Sixteenth year: Quwo Zhuang Bo killed Xiao Hou, Jin people established Xiao Hou's son Que as E Hou.",
  "s1927": "Jin: E Hou Que first year Quwo was stronger than Jin.",
  "s1941": "Lu: Yin Gong Xi Gu first year mother Sheng Zi.",
  "s1951": "Twenty-second year: Duan made rebellion, fled.",
  "s1967": "Twenty-third year: The duke regretted, thought of mother not seeing her, dug a tunnel to meet.",
  "s1973": "Third year: Second month, solar eclipse.",
  "s1978": "Ninth year: The duke entrusted Kong Fu to establish Shang Gong. Feng fled to Zheng.",
  "s1983": "Twenty-fourth year: Invaded Zhou, took the grain.",
  "s1995": "Sixteenth year: Zhou Xu assassinated the duke and established himself.",
  "s1996": "Twenty-sixth year: Wei Shi Que came to announce, therefore captured Zhou Xu.",
  "s2004": "Second year: Sent Guo Gong to attack Jin's Quwo.",
  "s2005": "Fifth year: The duke watched fishing at Tang, noblemen criticized it.",
  "s2007": "Sixth year: E Hou passed away. Quwo Zhuang Bo again attacked Jin. Established E Hou's son Guang as Ai Hou.",
  "s2010": "Second year: Zheng attacked us. We attacked Zheng.",
  "s2011": "Wei: Xuan Gong Jin first year commonly established him. Punished Zhou Xu.",
  "s2021": "Sixth year: Zheng people came to change the peace agreement.",
  "s2031": "Twenty-seventh year: Began to attend court with the king, the king was discourteous.",
  "s2039": "Second year: Zhuang Bo passed away, son Cheng established, called Wu Gong.",
  "s2053": "Eighth year: Exchanged Xu fields, noblemen criticized it.",
  "s2063": "Twenty-ninth year: Met with Lu at Beng, exchanged Xu fields.",
  "s2069": "Ninth year: Third month, great hail and thunder.",
  "s2090": "Seventh year: The feudal lords defeated us. Our army and Wei people attacked Zheng.",
  "s2101": "Eleventh year: Grandee Hui requested to kill Huan Gong, sought to be chancellor, the duke did not listen, then killed the duke.",
  "s2117": "Lu: Huan Gong Yun first year mother was daughter of Song Wu Gong, gave birth to Shou Wen as Lu consort.",
  "s2127": "Thirty-third year: Used jade disc to add to Lu, exchanged Xu fields.",
  "s2133": "Second year: Song bribed with tripod, entered the Grand Temple, noblemen criticized it.",
  "s2138": "Hua Du saw Kong Fu's wife was beautiful, was pleased with her. Hua Du killed Kong Fu, and killed Shang Gong. Song Gong Feng first year Hua Du was chancellor.",
  "s2149": "Third year: Hui welcomed the woman, Qi Hou sent the woman, noblemen criticized it.",
  "s2180": "Thirteenth year: Attacked Zheng.",
  "s2188": "Thirty-eighth year: Younger brother Ta killed Crown Prince Mian. Replaced him, state was in chaos, made two announcements."
}
