{
  "s0101": "Repaired Pangxi city.",
  "s0102": "Fifty-seventh year, twenty-eighth year, fourth year, twentieth year",
  "s0103": "460 Ninth year, seventeenth year, fifty-eighth year, twenty-ninth year, fifth year, twenty-first year",
  "s0104": "459 Tenth year, eighteenth year, fifty-ninth year, thirtieth year, sixth year, twenty-second year",
  "s0105": "458 Eleventh year, nineteenth year, sixtieth year, thirty-first year, seventh year, twenty-third year",
  "s0106": "457 Twelfth year, twentieth year.",
  "s0107": "Duke led army and battled Mian Zhu.",
  "s0108": "Xiang Zi.",
  "s0109": "First year mourning not ended, ascended Xia House, lured Dai King, with gold ladle killed Dai King.",
  "s0110": "Enfeoffed Bo Lu Zi Zhou as Dai Cheng Jun.",
  "s0111": "Thirty-second year.",
  "s0112": "Cai Sheng Hou died.",
  "s0113": "Eighth year, twenty-fourth year",
  "s0114": "456 Thirteenth year, twenty-first year, Jin Ai Gong Ji first year.",
  "s0115": "Second year, thirty-third year.",
  "s0116": "Cai Yuan Hou first year.",
  "s0117": "Ninth year, twenty-fifth year",
  "s0118": "455 Fourteenth year, twenty-second year, Wei Dao Gong Qian first year.",
  "s0119": "Third year, thirty-fourth year, tenth year, Qi Xuan Gong Jiu Jia first year.",
  "s0120": "454 Fifteenth year, twenty-third year, fourth year.",
  "s0121": "Third year, thirty-fifth year, eleventh year, second year.",
  "s0122": "Third year, thirty-sixth year, twelfth year, third year.",
  "s0123": "Fourth year, thirty-seventh year, thirteenth year, fourth year.",
  "s0124": "Fifth year, thirty-eighth year, fourteenth year, fifth year.",
  "s0125": "Sixth year, thirty-ninth year, fifteenth year, sixth year.",
  "s0126": "Seventh year, fortieth year, sixteenth year, seventh year.",
  "s0127": "Eighth year, forty-first year, seventeenth year, eighth year.",
  "s0128": "Ninth year, forty-second year, eighteenth year, ninth year.",
  "s0129": "Tenth year, forty-third year, nineteenth year, tenth year.",
  "s0130": "Eleventh year, forty-fourth year, twentieth year, eleventh year.",
  "s0131": "Twelfth year, forty-fifth year, twenty-first year, twelfth year.",
  "s0132": "Thirteenth year, forty-sixth year, twenty-second year, thirteenth year.",
  "s0133": "Fourteenth year, forty-seventh year, twenty-third year, fourteenth year.",
  "s0134": "Fifteenth year, forty-eighth year, twenty-fourth year, fifteenth year.",
  "s0135": "Sixteenth year, forty-ninth year, twenty-fifth year, sixteenth year.",
  "s0136": "Seventeenth year, fiftieth year, twenty-sixth year, seventeenth year.",
  "s0137": "Eighteenth year, fifty-first year, twenty-seventh year, eighteenth year.",
  "s0138": "Nineteenth year, fifty-second year, twenty-eighth year, nineteenth year.",
  "s0139": "Twentieth year, fifty-third year, twenty-ninth year, twentieth year.",
  "s0140": "Twenty-first year, fifty-fourth year, thirtieth year, twenty-first year.",
  "s0141": "Twenty-second year, fifty-fifth year, thirty-first year, twenty-second year.",
  "s0142": "Twenty-third year, fifty-sixth year, thirty-second year, twenty-third year.",
  "s0143": "Twenty-fourth year, fifty-seventh year, thirty-third year, twenty-fourth year.",
  "s0144": "Twenty-fifth year, fifty-eighth year, thirty-fourth year, twenty-fifth year.",
  "s0145": "Twenty-sixth year, fifty-ninth year, thirty-fifth year, twenty-sixth year.",
  "s0146": "Twenty-seventh year, sixtieth year, thirty-sixth year, twenty-seventh year.",
  "s0147": "Twenty-eighth year, sixty-first year, thirty-seventh year, twenty-eighth year.",
  "s0148": "Twenty-ninth year, sixty-second year, thirty-eighth year, twenty-ninth year.",
  "s0149": "Thirtieth year, sixty-third year, thirty-ninth year, thirtieth year.",
  "s0150": "Thirty-first year, sixty-fourth year, fortieth year, thirty-first year.",
  "s0151": "Thirty-second year, sixty-fifth year, forty-first year, thirty-second year.",
  "s0152": "Thirty-third year, sixty-sixth year, forty-second year, thirty-third year.",
  "s0153": "Thirty-fourth year, sixty-seventh year, forty-third year, thirty-fourth year.",
  "s0154": "Thirty-fifth year, sixty-eighth year, forty-fourth year, thirty-fifth year.",
  "s0155": "Thirty-sixth year, sixty-ninth year, forty-fifth year, thirty-sixth year.",
  "s0156": "Thirty-seventh year, seventieth year, forty-sixth year, thirty-seventh year.",
  "s0157": "Thirty-eighth year, seventy-first year, forty-seventh year, thirty-eighth year.",
  "s0158": "Thirty-ninth year, seventy-second year, forty-eighth year, thirty-ninth year.",
  "s0159": "Fortieth year, seventy-third year, forty-ninth year, fortieth year.",
  "s0160": "Forty-first year, seventy-fourth year, fiftieth year, forty-first year.",
  "s0161": "Forty-second year, seventy-fifth year, fifty-first year, forty-second year.",
  "s0162": "Forty-third year, seventy-sixth year, fifty-second year, forty-third year.",
  "s0163": "Forty-fourth year, seventy-seventh year, fifty-third year, forty-fourth year.",
  "s0164": "Forty-fifth year, seventy-eighth year, fifty-fourth year, forty-fifth year.",
  "s0165": "Forty-sixth year, seventy-ninth year, fifty-fifth year, forty-sixth year.",
  "s0166": "Forty-seventh year, eightieth year, fifty-sixth year, forty-seventh year.",
  "s0167": "Forty-eighth year, eighty-first year, fifty-seventh year, forty-eighth year.",
  "s0168": "Forty-ninth year, eighty-second year, fifty-eighth year, forty-ninth year.",
  "s0169": "Fiftieth year, eighty-third year, fifty-ninth year, fiftieth year.",
  "s0170": "Fifty-first year, eighty-fourth year, sixtieth year, fifty-first year.",
  "s0171": "Fifty-second year, eighty-fifth year, sixty-first year, fifty-second year.",
  "s0172": "Fifty-third year, eighty-sixth year, sixty-second year, fifty-third year.",
  "s0173": "Fifty-fourth year, eighty-seventh year, sixty-third year, fifty-fourth year.",
  "s0174": "Fifty-fifth year, eighty-eighth year, sixty-fourth year, fifty-fifth year.",
  "s0175": "Fifty-sixth year, eighty-ninth year, sixty-fifth year, fifty-sixth year.",
  "s0176": "Fifty-seventh year, ninetieth year, sixty-sixth year, fifty-seventh year.",
  "s0177": "Fifty-eighth year, ninety-first year, sixty-seventh year, fifty-eighth year.",
  "s0178": "Fifty-ninth year, ninety-second year, sixty-eighth year, fifty-ninth year.",
  "s0179": "Sixtieth year, ninety-third year, sixty-ninth year, sixtieth year.",
  "s0180": "Sixty-first year, ninety-fourth year, seventieth year, sixty-first year.",
  "s0181": "Sixty-second year, ninety-fifth year, seventy-first year, sixty-second year.",
  "s0182": "Sixty-third year, ninety-sixth year, seventy-second year, sixty-third year.",
  "s0183": "Sixty-fourth year, ninety-seventh year, seventy-third year, sixty-fourth year.",
  "s0184": "Sixty-fifth year, ninety-eighth year, seventy-fourth year, sixty-fifth year.",
  "s0185": "Sixty-sixth year, ninety-ninth year, seventy-fifth year, sixty-sixth year.",
  "s0186": "Sixty-seventh year, hundredth year, seventy-sixth year, sixty-seventh year.",
  "s0187": "Sixty-eighth year, hundred first year, seventy-seventh year, sixty-eighth year.",
  "s0188": "Sixty-ninth year, hundred second year, seventy-eighth year, sixty-ninth year.",
  "s0189": "Seventieth year, hundred third year, seventy-ninth year, seventieth year.",
  "s0190": "Seventy-first year, hundred fourth year, eightieth year, seventy-first year.",
  "s0191": "Seventy-second year, hundred fifth year, eighty-first year, seventy-second year.",
  "s0192": "Seventy-third year, hundred sixth year, eighty-second year, seventy-third year.",
  "s0193": "Seventy-fourth year, hundred seventh year, eighty-third year, seventy-fourth year.",
  "s0194": "Seventy-fifth year, hundred eighth year, eighty-fourth year, seventy-fifth year.",
  "s0195": "Seventy-sixth year, hundred ninth year, eighty-fifth year, seventy-sixth year.",
  "s0196": "Seventy-seventh year, hundred tenth year, eighty-sixth year, seventy-seventh year.",
  "s0197": "Seventy-eighth year, hundred eleventh year, eighty-seventh year, seventy-eighth year.",
  "s0198": "Seventy-ninth year, hundred twelfth year, eighty-eighth year, seventy-ninth year.",
  "s0199": "Eightieth year, hundred thirteenth year, eighty-ninth year, eightieth year.",
  "s0200": "Eighty-first year, hundred fourteenth year, ninetieth year, eighty-first year."
}
