{
  "s0001": "Ru Zhonglian was a man of Qi.",
  "s0002": "He delighted in strange, extraordinary, and unconventional strategies, but refused to take office or hold position, preferring to maintain lofty principles.",
  "s0003": "He traveled in Zhao.",
  "s0004": "During Zhao King Xiaocheng's time, Qin king sent Bai Qi to break Zhao's Changping army, forty plus ten thousand before and after, Qin troops then east besieged Handan.",
  "s0005": "Zhao king feared, feudal lords' rescue troops none dared attack Qin army.",
  "s0006": "Wei King Anli sent general Xin Bi rescue Zhao, feared Qin, stopped at Dangyin not advancing.",
  "s0007": "Wei king sent guest general Xin Yuanjian enter Handan secretly, through Lord Pingyuan told Zhao king: 'Qin does this urgently besieging Zhao, previously with Qi Min Wang contended for supremacy to become emperor, afterward again returned emperor title;",
  "s0008": "Now Qi Min Wang already increasingly weak, presently only Qin heroic in world, this not necessarily greedy Handan, its intent wishes again seek to become emperor.",
  "s0009": "Zhao truly sends envoy honor Qin Zhao Wang as emperor, Qin must pleased, withdraw troops depart.'",
  "s0010": "Lord Pingyuan hesitated not yet decided.",
  "s0011": "At this time Ru Zhonglian just traveled Zhao, met Qin besieging Zhao, heard Wei will want make Zhao honor Qin as emperor, then saw Lord Pingyuan said: 'Affair will handle how?'",
  "s0012": "Lord Pingyuan said: 'Sheng how dare speak affairs!",
  "s0013": "Before lost forty thousand multitudes outside, now again inner besieging Handan cannot depart.",
  "s0014": "Wei king sent guest general Xin Yuanjian make Zhao emperor Qin, now that person is here.",
  "s0015": "Sheng how dare speak affairs!'",
  "s0016": "Ru Zhonglian said: 'I began considering lord world worthy noble son, now then I know lord not world worthy noble son.",
  "s0017": "Wei guest Xin Yuanjian where?",
  "s0018": "I request for lord blame and return him.'",
  "s0019": "Lord Pingyuan said: 'Sheng request introduce see mister.'",
  "s0020": "Lord Pingyuan then saw Xin Yuanjian said: 'East state has Ru Zhonglian mister, now that person here, Sheng request introduce, make him befriend general.'",
  "s0021": "Xin Yuanjian said: 'I heard Ru Zhonglian mister, Qi state's lofty scholar.",
  "s0022": "Yuanjian subject minister, mission has duty, I not wish see Ru Zhonglian mister.'",
  "s0023": "Lord Pingyuan said: 'Sheng already revealed it.'",
  "s0024": "Xin Yuanjian permitted promised.",
  "s0025": "Ru Zhonglian saw Xin Yuanjian without words.",
  "s0026": "Xin Yuanjian said: 'I see dwell this besieged city middle, all have requests of Lord Pingyuan;",
  "s0027": "Now I observe mister jade appearance, not one with requests of Lord Pingyuan. Why stay long this besieged city middle without depart?'",
  "s0028": "Ru Zhonglian said: 'World considers Bao Jiao no followers eulogy died, all not so.",
  "s0029": "Crowd people not know, then for one body.",
  "s0030": "That Qin, abandons ritual righteousness above merit country, authority makes its scholars, captive makes its people.",
  "s0031": "If immediately arrogantly becomes emperor, passes to govern world, then Zhonglian has step East Sea die, I not bear be its people.",
  "s0032": "What for see general, wishes assist Zhao.'",
  "s0034": "Xin Yuanjian said: 'Mister assist how?'",
  "s0035": "Ru Zhonglian said: 'I will make Wei and Yan assist it, Qi, Chu then certainly assist.'",
  "s0036": "Xin Yuanjian said: 'Yan then I request follow;",
  "s0037": "If Wei, then I am Wei person, mister how can make Wei assist?'",
  "s0038": "Ru Zhonglian said: 'Wei not yet seen Qin called emperor harm therefore.",
  "s0039": "Make Wei see Qin called emperor harm, then must assist Zhao.'",
  "s0041": "Xin Yuanjian said: 'Qin called emperor harm how?'",
  "s0042": "Ru Zhonglian said: 'Formerly Qi Wei Wang once did benevolence righteousness, led world feudal lords court Zhou.",
  "s0043": "Zhou poor and small, feudal lords none court, Qi alone court it.",
  "s0044": "Dwell year plus, Zhou Lie Wang collapsed, Qi later went, Zhou angered, announced Qi: 'Heaven collapse earth split, emperor descends mat.",
  "s0045": "East fief ministers because Qi late arrive, then behead.'",
  "s0046": "Qi Wei Wang suddenly angered said: 'Scold, your mother concubine!'",
  "s0047": "Finally became world laugh.",
  "s0048": "Thus alive then court Zhou, dead then scold it, truly not bear its demands.",
  "s0049": "That emperor certainly so, its nothing strange.'",
  "s0051": "Xin Yuanjian said: 'Mister alone not see those servants?",
  "s0052": "Ten people from one person, rather strength not win intelligence not equal?",
  "s0053": "Fear it.'"
}