{
  "s0183": "Responded: 'Please let me enter and consider the maps.'",
  "s0185": "Dwelt some time, Qin general Fan Yuji offended Qin king, fled to Yan, crown prince received and sheltered him.",
  "s0186": "Ju Wu advised: 'Cannot.",
  "s0187": "With Qin king's violence and accumulated anger at Yan, enough to chill the heart, moreover if hears Fan general's location?",
  "s0188": "This called 'placing meat on hungry tiger path', calamity certainly not recoverable!",
  "s0189": "Though have Guan, Yan, cannot plan for it.",
  "s0190": "Wish crown prince quickly send Fan general to Xiongnu to silence mouth.",
  "s0191": "Please west ally three Jin, south connect Qi, Chu, north bribe Xiongnu chief, afterward then can plot.'",
  "s0192": "Crown prince said: 'Grand Tutor's plan, broad days increasingly long, heart confused, fear cannot wait moment.",
  "s0193": "Moreover not only this, Fan general poor distressed in world, gave body to Dan, Dan end not because pressed by strong Qin abandon pitied friendship, place in Xiongnu, this certainly Dan's doomed time.",
  "s0194": "Wish Grand Tutor reconsider.'",
  "s0195": "Ju Wu said: 'Go danger seek safety, create calamity seek fortune, plan shallow resentment deep, connect one person's later friendship, not consider state's great harm, this called 'provide resentment assist calamity'.",
  "s0196": "With goose feather burn on furnace charcoal above, certainly no affair.",
  "s0197": "Moreover with eagle owl Qin, execute resentful violent anger, how sufficient say!",
  "s0198": "Yan has Tian Guang mister, his person wisdom deep courage profound, can with plan.'",
  "s0199": "Crown prince said: 'Wish through Grand Tutor get befriend Tian mister, can?'",
  "s0200": "Ju Wu said: 'Respectfully yes.'",
  "s0201": "Exit saw Tian mister, said 'Crown prince wishes plot state affairs with mister.'",
  "s0202": "Tian Guang said: 'Respectfully receive teaching.'",
  "s0203": "Thus went to him.",
  "s0204": "Crown prince welcomed, retreated walked guided, knelt spread mat.",
  "s0205": "Tian Guang sat settled, left right no person, crown prince left seat requested: 'Yan Qin not two stand, wish mister attentive.'",
  "s0206": "Tian Guang said: 'Minister heard thoroughbred in vigorous time, one day gallop thousand li;",
  "s0207": "To its old age, nag precede it.",
  "s0208": "Now crown prince hears my vigorous time, not know minister's essence already perished.",
  "s0209": "Although so, Guang not dare with plot state affairs, what good Jing Qing can send.'",
  "s0210": "Crown prince said: 'Wish through mister get befriend Jing Qing, can?'",
  "s0211": "Tian Guang said: 'Respectfully yes.'",
  "s0212": "Immediately rose, hurried out.",
  "s0213": "Crown prince sent to door, warned: 'Dan what report, mister what speak, state's great affair, wish mister not leak!'",
  "s0214": "Tian Guang bent laughed: 'Yes.'",
  "s0215": "Bent walked saw Jing Ke, said: 'Guang with you friendly, Yan state none not know.",
  "s0216": "Now crown prince hears Guang vigorous time, not know my form already not match, fortunately teach said 'Yan Qin not two stand, wish mister attentive'.",
  "s0217": "Guang secretly not self-exclude, spoke you to crown prince, wish you visit crown prince at palace.'",
  "s0218": "Jing Ke said: 'Respectfully receive teaching.'",
  "s0219": "Tian Guang said: 'I heard, elder for conduct, not make people suspect.",
  "s0220": "Now crown prince told Guang: 'What speak state's great affair, wish mister not leak', this crown prince suspects Guang.",
  "s0221": "Do conduct yet make people suspect, not righteous knight.'",
  "s0222": "Wished suicide to spur Jing Ke, said: 'Wish you quickly visit crown prince, speak Guang already dead, clarify not speak.'",
  "s0223": "Thus then self-slit died.",
  "s0224": "Jing Ke thus saw crown prince, spoke Tian Guang already dead, conveyed Guang's words.",
  "s0225": "Crown prince twice bowed knelt, knee walked flowing tears, had moment then spoke: 'Dan so warned Tian mister not speak, wished complete great affair plan.",
  "s0226": "Now Tian mister with death clarify not speak, how Dan's heart!'",
  "s0227": "Jing Ke sat settled, crown prince left seat bowed head: 'Tian mister not know Dan's unworthiness, made reach front, dared have way, this heaven so pity Yan not abandon its orphan.",
  "s0228": "Now Qin has greedy profit heart, yet desire not satisfiable.",
  "s0229": "Not exhaust world land, make sea inner king, his intent not sated.",
  "s0230": "Now Qin already captured Han king, completely took its land.",
  "s0231": "Again raised troops south attacked Chu, north faced Zhao;",
  "s0232": "Wang Jian leads several ten thousand crowd resisted Zhang, Ye, while Li Xin exits Taiyuan, Yunzhong.",
  "s0233": "Zhao cannot support Qin, must enter minister, enter minister then calamity reaches Yan.'"
}

