{
  "s0001": "Meng Chang Jun name Wen, surname Tian.",
  "s0002": "Wen father call Jing Guo Jun Tian Ying.",
  "s0003": "Tian Ying, Qi Wei Wang young son and Qi Xuan Wang concubine brother.",
  "s0004": "Tian Ying from Wei Wang time hold office handle affairs, with Cheng Hou Zou Ji and Tian Ji general save Han attack Wei.",
  "s0005": "Cheng Hou with Tian Ji contend favor, Cheng Hou sell out Tian Ji.",
  "s0006": "Tian Ji fear, attack Qi border city, not win, flee go.",
  "s0007": "Meet Wei Wang die, Xuan Wang stand, know Cheng Hou sell out Tian Ji, then again summon Tian Ji as general.",
  "s0008": "Xuan Wang two years, Tian Ji with Sun Bin, Tian Ying together attack Wei, defeat at Ma Ling, capture Wei crown prince Shen kill Wei general Pang Juan.",
  "s0009": "Xuan Wang seven years, Tian Ying envoy to Han Wei, Han Wei submit to Qi.",
  "s0010": "Ying with Han Zhao Hou, Wei Hui Wang meet Qi Xuan Wang Dong E south, alliance depart.",
  "s0011": "Next year, again with Liang Hui Wang meet Zhen.",
  "s0012": "This year, Liang Hui Wang die.",
  "s0013": "Xuan Wang nine years, Tian Ying chancellor Qi.",
  "s0014": "Qi Xuan Wang with Wei Xiang Wang meet Xu Zhou mutually wang.",
  "s0015": "Chu Wei Wang hear, angry Tian Ying.",
  "s0016": "Next year, Chu attack defeat Qi army at Xu Zhou, make person pursue Tian Ying.",
  "s0017": "Tian Ying make Zhang Chou advise Chu Wei Wang, Wei Wang then stop.",
  "s0018": "Tian Ying chancellor Qi eleven years, Xuan Wang die, Min Wang ascend throne.",
  "s0019": "Ascend throne three years, enfeoff Tian Ying at Xue.",
  "s0020": "Originally, Tian Ying have son forty more people.",
  "s0021": "His lowly concubine have son name Wen, Wen with five month five day born.",
  "s0022": "Ying tell his mother: Do not raise.",
  "s0023": "His mother secretly raise give birth.",
  "s0024": "Reach grow, his mother because brothers see their son Wen to Tian Ying.",
  "s0025": "Tian Ying angry his mother: My command you abandon this child, dare give birth, why?",
  "s0026": "Wen kowtow, because say: Jun so not raise five month child, what reason?",
  "s0027": "Ying say: Five month child, grow with door even, will harm parents.",
  "s0028": "Wen say: Person life receive mandate from heaven?",
  "s0029": "Will receive mandate from door?",
  "s0030": "Ying silent.",
  "s0031": "Wen say: Must receive mandate from heaven, jun what worry.",
  "s0032": "Must receive mandate from door, then can high its door, who can reach!",
  "s0033": "Ying say: Son rest.",
  "s0035": "Long time, Wen take opportunity ask his father Ying: Son son what?",
  "s0036": "Say: For grandson.",
  "s0037": "Grandson grandson what?",
  "s0038": "Say: For great grandson.",
  "s0039": "Great grandson grandson what?",
  "s0040": "Say: Cannot know.",
  "s0041": "Wen say: Jun handle affairs chancellor Qi, to now three kings, Qi not add broad yet jun private family rich accumulate ten thousand gold, gate below not see one worthy.",
  "s0042": "Wen hear will gate must have general, chancellor gate must have chancellor.",
  "s0043": "Now jun rear palace step silk satin yet scholar not obtain coarse cloth, servant concubine remain fine grain meat yet scholar not satiated bran chaff.",
  "s0044": "Now jun moreover still thick accumulate surplus store, wish leave to not know what person, forget public family affairs day damage, Wen secretly strange it.",
  "s0045": "Then Ying then courtesy Wen, make manage family receive guests.",
  "s0046": "Guests day advance, name sound heard at feudal lords.",
  "s0047": "Feudal lords all make person request Xue Gong Tian Ying with Wen as crown prince, Ying permit.",
  "s0048": "Ying die, posthumous name Jing Guo Jun.",
  "s0049": "Wen indeed succeed stand at Xue, is Meng Chang Jun.",
  "s0050": "Meng Chang Jun at Xue, recruit attract feudal lords guests and flee have crime people, all belong Meng Chang Jun.",
  "s0051": "Meng Chang Jun house industry thick treat them, with reason incline world scholars.",
  "s0052": "Eat guests several thousand people, no noble lowly one with Wen equal.",
  "s0053": "Meng Chang Jun receive guests sit speak, screen behind often have serve historian, main record jun with guest speak, ask relatives dwell place.",
  "s0054": "Guest go, Meng Chang Jun already make messenger visit ask, offer send their relatives.",
  "s0055": "Meng Chang Jun once receive guest night eat, have one person block fire light.",
  "s0056": "Guest angry, with rice not equal, stop eat leave go.",
  "s0057": "Meng Chang Jun rise, self hold his rice compare.",
  "s0058": "Guest ashamed, self stab.",
  "s0059": "Scholars with this many belong Meng Chang Jun.",
  "s0060": "Meng Chang Jun guest no choose, all good treat them.",
  "s0061": "People people self consider Meng Chang Jun close self.",
  "s0062": "Qin Zhao Wang hear his worthy, then first make Jing Yang Jun as hostage at Qi, to seek see Meng Chang Jun.",
  "s0063": "Meng Chang Jun will enter Qin, guests not wish his go, advise, not listen.",
  "s0064": "Su Dai say: Now morning Dai from outside come, see wood puppet person with earth puppet person mutually speak.",
  "s0065": "Wood puppet person say: Heaven rain, you will ruin.",
  "s0066": "Earth puppet person say: I born from earth, ruin then return earth.",
  "s0067": "Now heaven rain, flow you go, unknown where stop rest.",
  "s0068": "Now Qin, tiger wolf country, jun wish go, if have not obtain return, jun obtain no for earth puppet person laughed?",
  "s0069": "Meng Chang Jun then stop.",
  "s0070": "Qi Min Wang twenty five years, again finally make Meng Chang Jun enter Qin, Zhao Wang then with Meng Chang Jun as Qin chancellor.",
  "s0071": "Person or advise Qin Zhao Wang: Meng Chang Jun worthy, moreover Qi clan, now chancellor Qin, certainly first Qi after Qin, Qin its danger.",
  "s0072": "Then Qin Zhao Wang then stop.",
  "s0073": "Imprison Meng Chang Jun, plan wish kill him.",
  "s0074": "Meng Chang Jun make person bribe Zhao Wang favored concubine seek release.",
  "s0075": "Favored concubine say: Concubine wish obtain jun fox white fur coat.",
  "s0076": "This time Meng Chang Jun have one fox white fur coat, worth thousand gold, world no double, enter Qin offer Zhao Wang, more no other fur coat.",
  "s0077": "Meng Chang Jun troubled, extensively ask guests, none can answer.",
  "s0078": "Most low sit have can be dog thief, say: Minister can obtain fox white fur coat.",
  "s0079": "Then night be dog, enter Qin palace storehouse, take offered fox white fur coat come, offer Qin Wang favored concubine.",
  "s0080": "Favored concubine for speak Zhao Wang, Zhao Wang release Meng Chang Jun.",
  "s0081": "Meng Chang Jun obtain emerge, then gallop go, change seal pass, change name surname emerge pass.",
  "s0082": "Night half arrive Han Gu Pass.",
  "s0083": "Qin Zhao Wang after regret release Meng Chang Jun, seek already go, then make person gallop pass pursue.",
  "s0084": "Meng Chang Jun arrive pass, pass law chicken crow emerge guest, Meng Chang Jun fear pursue arrive, guest dwell low sit have can be chicken crow, chicken together crow, then issue pass emerge.",
  "s0085": "Emerge like eat time, Qin pursue indeed arrive pass, already after Meng Chang Jun emerge, then return.",
  "s0086": "Begin Meng Chang Jun list this two people at guests, guests all ashamed, reach Meng Chang Jun have Qin difficulty, finally this two people pull him.",
  "s0087": "From this after, guests all submit.",
  "s0088": "Meng Chang Jun pass Zhao, Zhao Ping Yuan Jun guest him.",
  "s0089": "Zhao people hear Meng Chang Jun worthy, emerge view him, all laugh: Begin with Xue Gong as outstanding, now see him, is small short man.",
  "s0090": "Meng Chang Jun hear, angry.",
  "s0091": "Guests with together below, chop attack kill several hundred people, then extinguish one county go.",
  "s0092": "Qi Min Wang not self obtain, with his send Meng Chang Jun.",
  "s0093": "Meng Chang Jun arrive, then with as Qi chancellor, hold government.",
  "s0094": "Meng Chang Jun resent Qin, will with Qi for Han Wei attack Chu, because with Han Wei attack Qin, borrow troops food at west Zhou.",
  "s0095": "Su Dai for west Zhou advise: Jun with Qi for Han Wei attack Chu nine years, take Wan Ye north strengthen Han Wei, now again attack Qin increase them.",
  "s0096": "Han Wei south no Chu worry, west no Qin suffer, then Qi danger.",
  "s0097": "Han Wei certainly light Qi fear Qin, minister for jun danger it.",
  "s0098": "Jun not as make poor city deep unite Qin, jun no attack, moreover no borrow troops food.",
  "s0099": "Jun face Han Gu no attack, make poor city with jun emotion tell Qin Zhao Wang say Xue Gong certainly not break Qin strengthen Han Wei.",
  "s0100": "His attack Qin, wish wang make Chu Wang divide east country give Qi, Qin emerge Chu Huai Wang for peace.",
  "s0101": "Jun make poor city with this favor Qin, Qin obtain no break give east country self avoid, Qin certainly wish.",
  "s0102": "Chu Wang obtain emerge, certainly virtue Qi.",
  "s0103": "Qi obtain east country more strong, Xue generation generation no worry.",
  "s0104": "Qin not great weak, dwell three Jin west, three Jin certainly heavy Qi.",
  "s0105": "Xue Gong say: Good.",
  "s0106": "Because make Han Wei congratulate Qin, make three countries no attack, not borrow troops food at west Zhou.",
  "s0107": "This time, Chu Huai Wang enter Qin, Qin detain him, therefore wish certainly emerge him.",
  "s0108": "Qin not indeed emerge Chu Huai Wang.",
  "s0109": "Meng Chang Jun chancellor Qi, his house person Wei Zi for Meng Chang Jun collect city income, three return not bring one income.",
  "s0110": "Meng Chang Jun ask him, answer: Have worthy person, secretly lend with him, with reason not bring income.",
  "s0111": "Meng Chang Jun angry retire Wei Zi.",
  "s0112": "Dwell several years, person or slander Meng Chang Jun at Qi Min Wang: Meng Chang Jun will chaos.",
  "s0113": "Reach Tian Jia kidnap Min Wang, Min Wang intention suspect Meng Chang Jun, Meng Chang Jun then flee.",
  "s0114": "Wei Zi given grain worthy person hear, then present book speak Meng Chang Jun not make chaos, please with body as pledge, then self stab palace gate to bright Meng Chang Jun.",
  "s0115": "Min Wang then shocked, track verify ask, Meng Chang Jun indeed no rebel plan, then again summon Meng Chang Jun.",
  "s0116": "Meng Chang Jun because thank illness, return old at Xue.",
  "s0117": "Min Wang permit.",
  "s0118": "After, Qin perished general Lu Li chancellor Qi, wish distress Su Dai.",
  "s0119": "Dai then tell Meng Chang Jun: Zhou most at Qi, to thick, yet Qi Wang pursue him, listen close Fu not chancellor Lu Li, wish take Qin.",
  "s0120": "Qi Qin unite, then close Fu with Lu Li heavy.",
  "s0121": "Have use, Qi Qin certainly light jun.",
  "s0122": "Jun not as urgent north troops, hasten Zhao peace Qin Wei, collect Zhou most thick conduct, moreover return Qi Wang trust, again prohibit world change.",
  "s0123": "Qi no Qin, then world gather Qi, close Fu certainly flee, then Qi Wang who with make his country!",
  "s0124": "Then Meng Chang Jun from his plan, Lu Li envy harm Meng Chang Jun.",
  "s0125": "Meng Chang Jun fear, then send Qin chancellor Rang Hou Wei Ran book: I hear Qin wish with Lu Li collect Qi, Qi world strong country, you certainly light.",
  "s0126": "Qi Qin mutually take face three Jin, Lu Li certainly together chancellor, is you through Qi heavy Lu Li.",
  "s0127": "If Qi avoid world troops, its enemy you certainly deep.",
  "s0128": "You not as advise Qin Wang attack Qi.",
  "s0129": "Qi break, I please with obtained enfeoff you.",
  "s0130": "Qi break, Qin fear Jin strong, Qin certainly heavy you take Jin.",
  "s0131": "Jin country tired at Qi fear Qin, Jin certainly heavy you take Qin.",
  "s0132": "Is you break Qi make merit, hold Jin make heavy;",
  "s0133": "Is you break Qi fix enfeoff, Qin Jin mutually heavy you.",
  "s0134": "If Qi not break, Lu Li again use, you certainly great poor.",
  "s0135": "Then Rang Hou speak Qin Zhao Wang attack Qi, Lu Li perish.",
  "s0136": "After Qi Min Wang extinguish Song, more arrogant, wish depart Meng Chang Jun.",
  "s0137": "Meng Chang Jun fear, then go Wei.",
  "s0138": "Wei Zhao Wang with as chancellor, west unite Qin Zhao, with Yan together attack break Qi.",
  "s0139": "Qi Min Wang perish at Ju, then die.",
  "s0140": "Qi Xiang Wang stand, Meng Chang Jun middle stand at feudal lords, no belong.",
  "s0141": "Qi Xiang Wang new stand, fear Meng Chang Jun, with connect peace, again close Xue Gong.",
  "s0142": "Wen die, posthumous name Meng Chang Jun.",
  "s0143": "Various sons contend stand, Qi Wei together extinguish Xue.",
  "s0144": "Meng Chang cut posterity no after.",
  "s0145": "Originally, Feng Huan hear Meng Chang Jun good guest, step shoe see him.",
  "s0146": "Meng Chang Jun say;",
  "s0147": "Mister far disgrace, what teach Wen?",
  "s0148": "Feng Huan say: Hear jun good scholar, with poor body belong jun.",
  "s0149": "Meng Chang Jun place guest house ten days, Meng Chang Jun ask guest house long: Guest what do?",
  "s0150": "Answer: Feng mister very poor, still have one sword, moreover sing song.",
  "s0151": "Strum his sword sing: Long sword return, eat no fish.",
  "s0152": "Meng Chang Jun move to favored house, eat have fish.",
  "s0153": "Five days, again ask guest house long.",
  "s0154": "Answer: Guest again strum sword sing: Long sword return, emerge no carriage.",
  "s0155": "Meng Chang Jun move to upper house, enter emerge ride carriage.",
  "s0156": "Five days, Meng Chang Jun again ask guest house long.",
  "s0157": "House long answer: Mister again once strum sword sing: Long sword return, no make family.",
  "s0158": "Meng Chang Jun not pleased.",
  "s0159": "Dwell season year, Feng Huan no speak.",
  "s0160": "Meng Chang Jun then chancellor Qi, enfeoff ten thousand households at Xue.",
  "s0161": "His eat guests three thousand people.",
  "s0162": "City income not sufficient serve guests, make person lend money at Xue.",
  "s0163": "Year more not income, lend money people many cannot give their interest, guest serve will not give.",
  "s0164": "Meng Chang Jun worry, ask left right: What person can make collect debt at Xue?",
  "s0165": "Guest house long say: Upper house guest Feng Gong appearance manner very argue, elder, no other skill ability, suitable can make collect debt.",
  "s0166": "Meng Chang Jun then advance Feng Huan request him: Guests not know Wen not worthy, fortunate arrive Wen three thousand more people, city income not sufficient serve guests, therefore lend interest money at Xue.",
  "s0167": "Xue year not income, people rather not give their interest.",
  "s0168": "Now guest eat fear not give, wish mister collect it.",
  "s0169": "Feng Huan say;",
  "s0170": "Yes.",
  "s0171": "Leave go, arrive Xue, summon take Meng Chang Jun money all meet, obtain interest money ten thousand.",
  "s0172": "Then much brew wine, buy fat cow, summon various take money, can give interest all come, cannot give interest also come, all hold take money contract book verify.",
  "s0173": "Together make meeting, day kill cow set wine.",
  "s0174": "Wine intense, then hold contract as before verify, can give interest, give period;",
  "s0175": "Poor cannot give interest, take their contract burn.",
  "s0176": "Say: Meng Chang Jun so lend money, for people none make base industry;",
  "s0177": "So seek interest, for no serve guests.",
  "s0178": "Now rich sufficient give period, poor burn contract book donate.",
  "s0179": "Various jun strong eat drink.",
  "s0180": "Have jun like this, how can negative!",
  "s0181": "Sit all rise, twice bow.",
  "s0182": "Meng Chang Jun hear Feng Huan burn contract book, angry make messenger summon Huan.",
  "s0183": "Huan arrive, Meng Chang Jun say: Wen eat guests three thousand people, therefore lend money at Xue.",
  "s0184": "Wen serve city few, people still many not with time give their interest, guest eat fear not sufficient, therefore please mister collect demand.",
  "s0185": "Hear mister obtain money, then with many prepare cow wine burn contract book, why?",
  "s0186": "Feng Huan say: Correct.",
  "s0187": "Not many prepare cow wine then cannot finish meeting, no know their have remain not sufficient.",
  "s0188": "Have remain, for set period.",
  "s0189": "Not sufficient, though guard demand ten year, interest more, urgent then escape perish self donate.",
  "s0190": "If urgent, finally no repay, up then jun good profit not love scholar people, down then have leave up resist negative name, not so encourage scholar people bright jun sound.",
  "s0191": "Burn no use empty debt contract, donate cannot obtain empty plan, make Xue people close jun bright jun good sound, jun have what doubt!",
  "s0192": "Meng Chang Jun then clap hand thank him.",
  "s0193": "Qi Wang confused at Qin Chu slander, consider Meng Chang Jun name high his lord monopolize Qi country power, then waste Meng Chang Jun.",
  "s0194": "Various guests see Meng Chang Jun waste, all go.",
  "s0195": "Feng Huan say: Borrow minister carriage one ride, can enter Qin, certainly make jun heavy at country serve city more broad, can?",
  "s0196": "Meng Chang Jun then bind carriage currency send him.",
  "s0197": "Feng Huan then west advise Qin Wang: World travel scholars Feng Ju tie rein west enter Qin, no not wish strong Qin weak Qi;",
  "s0198": "Feng Ju tie rein east enter Qi, no not wish strong Qi weak Qin.",
  "s0199": "This male female country, power not two stand male, male obtain world.",
  "s0200": "Qin Wang kneel ask: What make Qin no be female can?",
  "s0201": "Feng Huan say: Wang also know Qi waste Meng Chang Jun?",
  "s0202": "Qin Wang say: Hear.",
  "s0203": "Feng Huan say: Make Qi heavy at world, Meng Chang Jun.",
  "s0204": "Now Qi Wang with slander waste him, his heart resent, certainly back Qi;",
  "s0205": "Back Qi enter Qin, then Qi country emotion, person affairs sincere, all entrust Qin, Qi land can obtain, how only be male!",
  "s0206": "Jun urgent make messenger load currency secret welcome Meng Chang Jun, not can lose time.",
  "s0207": "If have Qi wake, again use Meng Chang Jun, then male female where not can know.",
  "s0208": "Qin Wang great pleased, then send carriage ten ride gold hundred yi welcome Meng Chang Jun.",
  "s0209": "Feng Huan leave with first go, arrive Qi, advise Qi Wang: World travel scholars Feng Ju tie rein east enter Qi, no not wish strong Qi weak Qin;",
  "s0210": "Feng Ju tie rein west enter Qin, no not wish strong Qin weak Qi.",
  "s0211": "Qin Qi male female country, Qin strong then Qi weak, this power not two male.",
  "s0212": "Now minister secretly hear Qin send messenger carriage ten ride load gold hundred yi welcome Meng Chang Jun.",
  "s0213": "Meng Chang Jun not west then already, west enter chancellor Qin then world belong him, Qin be male Qi be female, female then Lin Zi Ji Mo danger.",
  "s0214": "Wang what not before Qin messenger not arrive, restore Meng Chang Jun, moreover give him city thank?",
  "s0215": "Meng Chang Jun certainly happy accept.",
  "s0216": "Qin though strong country, how can with please person chancellor welcome him!",
  "s0217": "Break Qin plan, cut its hegemon strong strategy.",
  "s0218": "Qi Wang say: Good.",
  "s0219": "Then make person to border wait Qin messenger.",
  "s0220": "Qin messenger carriage just enter Qi border, make return gallop tell, wang summon Meng Chang Jun restore his chancellor position, give his former city land, moreover add thousand households.",
  "s0221": "Qin messenger hear Meng Chang Jun restore chancellor Qi, return carriage go.",
  "s0222": "From Qi Wang slander waste Meng Chang Jun, various guests all go.",
  "s0223": "After summon restore, Feng Huan welcome him.",
  "s0224": "Not arrive, Meng Chang Jun sigh: Wen often good guest, meet guest no dare lose, eat guests three thousand more people, mister know.",
  "s0225": "Guests see Wen one day waste, all back Wen go, no regard Wen.",
  "s0226": "Now rely mister obtain restore position, guests also have what face again see Wen?",
  "s0227": "If again see Wen, certainly spit their face big disgrace.",
  "s0228": "Feng Huan tie rein descend bow.",
  "s0229": "Meng Chang Jun descend carriage meet him, say: Mister for guests thank?",
  "s0230": "Feng Huan say: Not for guests thank, for jun words lose.",
  "s0231": "Things have must arrive, affairs have certainly so, jun know?",
  "s0232": "Meng Chang Jun say: Foolish not know so called.",
  "s0233": "Say: Live must have die, things must arrive;",
  "s0234": "Rich noble many scholars, poor lowly few friends, affairs certainly so.",
  "s0235": "Jun alone not see rush market morning?",
  "s0236": "Bright morning, side shoulder contend door enter;",
  "s0237": "Day evening after, pass market morning drop arm not regard.",
  "s0238": "Not good morning bad evening, expect things forget among.",
  "s0239": "Now jun lose position, guests all go, not sufficient resent scholars cut guests road.",
  "s0240": "Wish jun meet guests as before.",
  "s0241": "Meng Chang Jun twice bow: Respect from command.",
  "s0242": "Hear mister words, dare not serve teach.",
  "s0244": "Grand Historian say: I once pass Xue, its custom alley rate many fierce strong son younger brother, with Zou Lu different.",
  "s0245": "Ask its reason, say: Meng Chang Jun recruit attract world bear knight, evil person enter Xue among cover six thousand more families.",
  "s0246": "World transmit Meng Chang Jun good guest self happy, name not empty."
}