{
  "s0001": "Li Si was a person from Shangcai in Chu.",
  "s0002": "Young time, was county petty official, saw official residence toilet rat eat unclean things, near people dogs, repeatedly frightened by them.",
  "s0003": "Si entered granary, observed granary rats, eat stored grain, dwell great house below, not see people dogs worry.",
  "s0004": "Thus Li Si then sighed: 'Person's worthy unworthy like rats, in where self-place!'",
  "s0006": "Thus followed Xun Qing study emperor king methods.",
  "s0007": "Study already complete, measured Chu king not sufficient serve, six states all weak, no can establish merit, wished west enter Qin.",
  "s0008": "Took leave Xun Qing: 'Si heard get time no lazy, now ten thousand chariot contending time, travelers master affairs.",
  "s0009": "Now Qin king wishes swallow world, call emperor govern, this common clothes gallop time wandering persuaders autumn.",
  "s0010": "Dwell low base position plan not do, this bird deer see meat, person face can leisurely walk.",
  "s0011": "Thus curse none greater low base, sorrow none more poor distress.",
  "s0012": "Long dwell low base position, poor distress place, not world evil profit, self-entrust no action, this not scholar sentiment.",
  "s0013": "Thus Si will west persuade Qin king.'",
  "s0015": "Reached Qin, met Zhuangxiang Wang died, Li Si then sought be Qin chancellor Wenxin Hou Lü Buwei retainer;",
  "s0016": "Buwei considered worthy, employed as lang.",
  "s0017": "Li Si thus got persuade, persuaded Qin king: 'Wait person, remove their sprouts.",
  "s0018": "Complete great merit, in take advantage flaws continue bear.",
  "s0019": "Former Qin Mu Gong hegemony, end not east unite six states, why?",
  "s0020": "Feudal lords still many, Zhou virtue not decline, thus five hegemons alternated rise, more honored Zhou room.",
  "s0021": "Self Qin Xiao Gong since, Zhou room low small, feudal lords mutually annexed, pass east six states, Qin take victory serve feudal lords, cover six generations.",
  "s0022": "Now feudal lords submit Qin, like prefecture county.",
  "s0023": "With Qin strong, great king worthy, by stove sweep away, sufficient extinguish feudal lords, complete emperor enterprise, make world unite, this ten thousand generations one time.",
  "s0024": "Now lazy not urgently pursue, feudal lords again strong, mutually gather alliance, though have Yellow Emperor worthiness, cannot unite.'",
  "s0025": "Qin king then appointed Si long shi, listened his plan, secretly sent strategists carry hold gold jade wandering persuade feudal lords.",
  "s0026": "Feudal lords famous scholars can lower with wealth, thick gifts bind them;",
  "s0027": "Not willing, sharp sword stab them.",
  "s0028": "Separate their lord minister plans, Qin king then made his good generals follow after.",
  "s0029": "Qin king appointed Si guest minister.",
  "s0030": "Met Han person Zheng Guo come spy Qin, to make irrigation canal, afterward aware.",
  "s0031": "Qin clan chamber ministers all spoke Qin king: 'Feudal lords people come serve Qin, generally for their lord wandering spy Qin, please all expel guests.'",
  "s0032": "Li Si discussion also in expel among.",
  "s0033": "Si then submitted letter:",
  "s0034": "Minister heard officials discuss expel guests, secretly considered wrong.",
  "s0035": "Former Mu Gong sought scholars, west took You Yu from Rong, east got Baili Xi from Wan, welcomed Jian Shu from Song, came Pi Bao, Gongsun Zhi from Jin.",
  "s0036": "These five persons, not born in Qin, yet Mu Gong used them, united twenty states, thus hegemoned west Rong.",
  "s0037": "Xiao Gong used Shang Yang methods, moved customs changed habits, people with flourishing prosperous, state with rich strong, hundred surnames happy use, feudal lords intimate submit, obtained Chu, Wei armies, took land thousand li, to now govern strong.",
  "s0038": "Hui Wang used Zhang Yi plan, pulled three streams land, west united Ba, Shu, north took Shang commandery, south took Han middle, included nine Yi, controlled Yan, Ying, east occupied Cheng Gao dangers, cut fertile rich soil, thus scattered six states alliance, made them west face serve Qin, merit extended to now.",
  "s0039": "Zhao Wang got Fan Sui, abolished Rang Hou, expelled Hua Yang, strengthened public chamber, blocked private gates, nibbled feudal lords, made Qin complete emperor enterprise.",
  "s0040": "These four lords, all with guests merit.",
  "s0041": "From this see, guests what owe Qin!",
  "s0042": "If made four lords reject guests not admit, distant scholars not use, this made state no rich profit substance yet Qin no strong great name.",
  "s0043": "Now Your Majesty brings Kun mountain jade, has Sui, He treasures, hangs bright moon pearls, wears Tai E sword, rides slender li horses, establishes kingfisher phoenix flags, sets spirit crocodile drums.",
  "s0044": "These several treasures, Qin not produce one, yet Your Majesty delights them, why?",
  "s0045": "Must Qin state produced then can, then night light jade not adorn court, rhinoceros elephant vessels not for playthings, Zheng, Wei girls not fill rear palace, swift good dun horses not fill outer stables, Jiangnan gold tin not for use, west Shu cinnabar blue not for gather.",
  "s0046": "What adorn rear palace fill lower ranks please heart intent delight ears eyes, must from Qin then can, then Wan pearl hairpins, Fu jewel earrings, A plain clothes, brocade embroidery ornaments not advance front, follow customs refined transformation fine beautiful secluded lovely Zhao girls not stand side.",
  "s0047": "Beat jars strike pots pluck zheng slap thighs, sing call wu wu please ears eyes, true Qin sounds;",
  "s0048": "Zheng, Wei, Sang Jian, Zhao, Yu, Wu, Xiang, different states music.",
  "s0049": "Now abandon beat jars strike pots approach Zheng Wei, retreat pluck zheng take Zhao Yu, like this why?",
  "s0050": "Pleasure before, suitable view already.",
  "s0051": "Now take people then not so.",
  "s0052": "Not ask can cannot, not discuss curved straight, not Qin leave, guest expel."
}