{
  "s0001": "Jin Tang Shu Yu was Zhou King Wu's son and King Cheng's younger brother.",
  "s0002": "Initially, King Wu and Shu Yu's mother met, dreamed that heaven told King Wu: 'I command this woman to give birth to a son, name Yu, I grant him Tang.'",
  "s0003": "When the son was born, characters on his hand said 'Yu', therefore accordingly named him Yu.",
  "s0004": "King Wu passed away, King Cheng ascended, Tang had rebellion, Duke of Zhou executed and extinguished Tang.",
  "s0005": "King Cheng played with Shu Yu, cut paulownia leaf as jade tablet to give Shu Yu, said: 'With this I enfeoff you.'",
  "s0006": "Shi Yi therefore requested to choose day to establish Shu Yu.",
  "s0007": "King Cheng said: 'I was just playing with him.'",
  "s0008": "Shi Yi said: 'Son of Heaven has no joking words.",
  "s0009": "Words then historians record them, rites complete them, music sings them.'",
  "s0010": "Thereupon enfeoffed Shu Yu at Tang.",
  "s0011": "Tang was east of Yellow River and Fen, one hundred li square, therefore called Tang Shu Yu.",
  "s0012": "Surname Ji, courtesy name Zi Yu.",
  "s0013": "Tang Shu's son Xie, this was Jin Hou.",
  "s0014": "Jin Hou's son Ning Zu, this was Wu Hou.",
  "s0015": "Wu Hou's son Fu Ren, this was Cheng Hou.",
  "s0016": "Cheng Hou's son Fu, this was Li Hou.",
  "s0017": "Li Hou's son Yi Jiu, this was Jing Hou.",
  "s0018": "From Jing Hou onward, years can be traced.",
  "s0019": "From Tang Shu to Jing Hou five generations, no year numbers.",
  "s0020": "Jing Hou seventeenth year, Zhou Li Wang confused and tyrannical, people rebelled, Li Wang fled to Zhi, ministers administered government, therefore called 'Republican'.",
  "s0021": "Eighteenth year, Jing Hou died, son Xi Hou Si Tu ascended.",
  "s0022": "Xi Hou fourteenth year, Zhou Xuan Wang first ascended.",
  "s0023": "Eighteenth year, Xi Hou died, son Xian Hou Ji ascended.",
  "s0024": "Xian Hou eleventh year died, son Mu Hou Fei Wang ascended.",
  "s0025": "Mu Hou fourth year, took Qi woman Jiang clan as wife.",
  "s0026": "Seventh year, attacked Tiao.",
  "s0027": "Gave birth to crown prince Qiu.",
  "s0028": "Tenth year, attacked Qian Mu, had merit.",
  "s0029": "Gave birth to younger son, named Cheng Shi.",
  "s0030": "Jin person Shi Fu said: 'Strange indeed, lord's naming sons!",
  "s0031": "Crown prince called Qiu, qiu means enemy.",
  "s0032": "Younger son called Cheng Shi, Cheng Shi great name, one who completes it.",
  "s0033": "Names self-designate;",
  "s0034": "Things self-determine.",
  "s0035": "Now legitimate and concubine names reverse, after this Jin how can it not be chaotic?'",
  "s0037": "Twenty-seventh year, Mu Hou died, younger brother Shang Shu self-established, crown prince Qiu fled.",
  "s0038": "Shang Shu third year, Zhou Xuan Wang passed away.",
  "s0039": "Fourth year, Mu Hou crown prince Qiu led his followers attacked Shang Shu and established, this was Wen Hou.",
  "s0040": "Wen Hou tenth year, Zhou You Wang without way, Quanrong killed You Wang, Zhou moved east.",
  "s0041": "And Qin Xiang Gong first ranked as feudal lord.",
  "s0042": "Thirty-fifth year, Wen Hou Qiu died, son Zhao Hou Bo ascended.",
  "s0043": "Zhao Hou first year, enfeoffed Wen Hou younger brother Cheng Shi at Quwo.",
  "s0044": "Quwo city greater than Yi.",
  "s0045": "Yi, Jin ruler's capital city.",
  "s0046": "Cheng Shi enfeoffed at Quwo, titled Huan Shu.",
  "s0047": "Jing Hou concubine grandson Luan Bin assisted Huan Shu.",
  "s0048": "Huan Shu at this time was fifty-eight years old, fond of virtue, Jin state's multitudes all attached to him.",
  "s0049": "Gentleman said: 'Jin chaos will be at Quwo.",
  "s0050": "Branch greater than root and gets people's hearts, not chaotic what wait!'",
  "s0052": "Seventh year, Jin minister Pan Fu assassinated his ruler Zhao Hou and welcomed Quwo Huan Shu.",
  "s0053": "Huan Shu wished to enter Jin, Jin people sent troops to attack Huan Shu.",
  "s0054": "Huan Shu defeated, returned to Quwo.",
  "s0055": "Jin people together established Zhao Hou son Ping as ruler, this was Xiao Hou.",
  "s0056": "Executed Pan Fu.",
  "s0057": "Xiao Hou eighth year, Quwo Huan Shu died, son Jia Huan Shu, this was Quwo Zhuang Bo.",
  "s0058": "Xiao Hou fifteenth year, Quwo Zhuang Bo assassinated his ruler Jin Xiao Hou at Yi.",
  "s0059": "Jin people attacked Quwo Zhuang Bo, Zhuang Bo again entered Quwo.",
  "s0060": "Jin people again established Xiao Hou son Xi as ruler, this was E Hou.",
  "s0061": "E Hou sixth year died.",
  "s0062": "Quwo Zhuang Bo heard Jin E Hou died, then raised troops to attack Jin.",
  "s0063": "Zhou Ping Wang sent Guo Gong to lead troops attack Quwo Zhuang Bo, Zhuang Bo fled to defend Quwo.",
  "s0064": "Jin people together established E Hou son Guang, this was Ai Hou.",
  "s0065": "Ai Hou second year Quwo Zhuang Bo died, son Cheng replaced Zhuang Bo, this was Quwo Wu Gong.",
  "s0066": "Ai Hou sixth year, Lu assassinated its ruler Yin Gong.",
  "s0067": "Ai Hou eighth year, Jin invaded Xing Ting.",
  "s0068": "Xing Ting with Quwo Wu Gong plotted, ninth year, attacked Jin at Fen side, captured Ai Hou.",
  "s0069": "Jin people then established Ai Hou son Xiao Zi as ruler, this was Xiao Zi Hou.",
  "s0070": "Xiao Zi first year, Quwo Wu Gong had Han Wan kill the captured Jin Ai Hou.",
  "s0071": "Quwo increasingly strong, Jin had no way with it.",
  "s0072": "Jin Xiao Zi fourth year, Quwo Wu Gong lured and summoned Jin Xiao Zi killed him.",
  "s0073": "Zhou Huan Wang sent Guo Zhong attack Quwo Wu Gong, Wu Gong entered Quwo, then established Jin Ai Hou younger brother Min as Jin Hou.",
  "s0074": "Jin Hou Min fourth year, Song seized Zheng Ji Zhong and established Tu as Zheng ruler.",
  "s0075": "Jin Hou nineteenth year, Qi person Guan Zhi Fu assassinated his ruler Xiang Gong.",
  "s0076": "Jin Hou twenty-eighth year, Qi Huan Gong began hegemony.",
  "s0077": "Quwo Wu Gong attacked Jin Hou Min, extinguished him, completely used his precious vessels as bribes offered to Zhou Xi Wang.",
  "s0078": "Xi Wang commanded Quwo Wu Gong as Jin ruler, ranked as feudal lord, thereupon completely annexed Jin territory and possessed it.",
  "s0079": "Quwo Wu Gong already ascended thirty-seven years, changed title to Jin Wu Gong.",
  "s0080": "Jin Wu Gong began capital at Jin state, previously ascended at Quwo, total years thirty-eight.",
  "s0081": "Wu Gong surnamed Cheng, was formerly Jin Mu Hou great-grandson, Quwo Huan Shu grandson.",
  "s0082": "Huan Shu was first enfeoffed at Quwo.",
  "s0083": "Wu Gong was Zhuang Bo son.",
  "s0084": "From Huan Shu first enfeoffed Quwo until Wu Gong extinguished Jin, altogether sixty-seven years, and finally replaced Jin as feudal lord.",
  "s0085": "Wu Gong replaced Jin two years, died.",
  "s0086": "With Quwo total years, ascended altogether thirty-nine years died.",
  "s0087": "Son Xian Gong Gui Zhu ascended.",
  "s0088": "Xian Gong first year, Zhou Hui Wang younger brother Hui attacked Hui Wang, Hui Wang fled, resided at Zheng Li Yi.",
  "s0089": "Fifth year, attacked Li Rong, obtained Li Ji, Li Ji younger brother, both loved and favored them.",
  "s0090": "Eighth year, Shi Wei advised duke saying: \"Former Jin various dukes many, not executed, chaos will arise.\"",
  "s0091": "Then had all dukes executed, and walled gathered capital it, named Jiang, began capital at Jiang.",
  "s0092": "Ninth year, Jin various dukes already fled to Guo, Guo because of this twice attacked Jin, not conquered.",
  "s0093": "Tenth year, Jin wished to attack Guo, Shi Wei said: \"Wait for their chaos.\"",
  "s0095": "Twelfth year, Li Ji gave birth to Xi Qi.",
  "s0096": "Xian Gong had intention to depose crown prince, then said: \"Quwo is my ancestors ancestral temples location, and Pu borders Qin, Qu borders Di, not make various sons reside there, I fear.\"",
  "s0097": "Thereupon made crown prince Shen Sheng reside at Quwo, duke Chong Er reside at Pu, duke Yi Wu reside at Qu.",
  "s0098": "Xian Gong with Li Ji son Xi Qi resided at Jiang.",
  "s0099": "Jin state because of this knew crown prince would not be established.",
  "s0100": "Crown prince Shen Sheng, his mother Qi Huan Gong woman, called Qi Jiang, died early.",
  "s0101": "Shen Sheng same mother younger sister was Qin Mu Gong wife.",
  "s0102": "Chong Er mother was Di Fox clan woman.",
  "s0103": "Yi Wu mother was Chong Er mother younger sister.",
  "s0104": "Xian Gong sons eight people, and crown prince Shen Sheng, Chong Er, Yi Wu all had worthy conduct.",
  "s0105": "When obtained Li Ji, then distanced these three sons.",
  "s0106": "Sixteenth year, Jin Xian Gong made two armies.",
  "s0107": "Duke led upper army, crown prince Shen Sheng led lower army, Zhao Shu drove chariot, Bi Wan was right, attacked extinguished Huo, extinguished Wei, extinguished Geng.",
  "s0108": "Returned, for crown prince walled Quwo, granted Zhao Shu Geng, granted Bi Wan Wei, made them dukes.",
  "s0109": "Shi Wei said: \"Crown prince cannot be established.",
  "s0110": "Divide capital cities for him, and position with dukes, first make extreme for him, moreover how can establish!",
  "s0111": "Better escape, not make crime reach.",
  "s0112": "Be like Wu Taibo, not also acceptable, still have good name.\"",
  "s0113": "Crown prince not follow.",
  "s0114": "Bu Yan said: \"Bi Wan descendants must be great.",
  "s0115": "Wan is full number;",
  "s0116": "Wei is great name.",
  "s0117": "With this begin reward, heaven opens it.",
  "s0118": "Son of Heaven called myriad people, feudal lords called ten thousand people, now command it great, to follow full number, must have multitudes.\"",
  "s0119": "Initially, Bi Wan divined service at Jin state, encountered Tun with Bi.",
  "s0120": "Xin Liao occupied it said: \"Auspicious.",
  "s0121": "Tun solid Bi enter, auspicious who greater.",
  "s0122": "Afterward must multiply flourish.\"",
  "s0124": "Seventeenth year, Jin Hou made crown prince Shen Sheng attack Dong Shan.",
  "s0125": "Li Ke admonished Xian Gong said: \"Crown prince upholds ancestral sacrifices society millet offerings, to morning evening inspect lord meals, therefore called eldest son.",
  "s0126": "Lord travels then guards, has guard then follows, follows called soothes army, guards called oversees state, ancient system.",
  "s0127": "Leading troops is specialized action planning;",
  "s0128": "Oathing troops is lord and state affairs planning: not crown prince matters.",
  "s0129": "Troops in commanding orders only, receiving orders then not awe-inspiring, specialized orders then not filial, therefore lord heir cannot lead troops.",
  "s0130": "Lord loses his office, leading troops not awe-inspiring, will what use?\"",
  "s0131": "Duke said: \"I have sons, not know crown prince who establish.\"",
  "s0132": "Li Ke not answer withdrew, saw crown prince.",
  "s0133": "Crown prince said: \"I will be deposed?\"",
  "s0134": "Li Ke said: \"Crown prince strive!",
  "s0135": "Teach with military, not share this fear, why depose?",
  "s0136": "Moreover you fear not filial, not fear not establish.",
  "s0137": "Cultivate self not blame others, then avoid difficulty.\"",
  "s0138": "Crown prince led troops, duke clothed him one-sided robe, belted him gold jade.",
  "s0139": "Li Ke declined illness, not follow crown prince.",
  "s0140": "Crown prince then attacked Dong Shan.",
  "s0141": "Nineteenth year, Xian Gong said: \"Initially my former lords Zhuang Bo, Wu Gong executed Jin chaos, and Guo often assisted Jin attack me, also hid Jin fled dukes, indeed made chaos.",
  "s0142": "Not execute, afterward leave descendants worry.\"",
  "s0143": "Then made Xun Xi with Qu produce chariot borrow road at Yu.",
  "s0144": "Yu borrowed road, then attacked Guo, took its Xia Yang to return.",
  "s0145": "Xian Gong privately told Li Ji: \"I wish to depose crown prince, use Xi Qi replace him.\"",
  "s0146": "Li Ji wept said: \"Crown prince establishment, feudal lords all already know, and repeatedly leads troops, hundred surnames attach to him, how with lowly concubine sake depose legitimate establish concubine?",
  "s0147": "Lord must do it, concubine will suicide.\"",
  "s0148": "Li Ji outwardly praised crown prince, but secretly had people slander evil crown prince, wished to establish her son.",
  "s0149": "Twenty-first year, Li Ji told crown prince: \"Lord dreamed saw Qi Jiang, crown prince quickly sacrifice at Quwo, return blessing to lord.\"",
  "s0150": "Crown prince then sacrificed his mother Qi Jiang at Quwo, offered his roasted meat to Xian Gong.",
  "s0151": "Xian Gong at this time went hunting, placed roasted meat in palace.",
  "s0152": "Li Ji had people place poison in roasted meat.",
  "s0153": "After two days, Xian Gong from hunting came back, butcher presented roasted meat to Xian Gong, Xian Gong wished to eat it.",
  "s0154": "Li Ji from side stopped him, said: \"Roasted meat from far, should test it.\"",
  "s0155": "Sacrificed to earth, earth swelled;",
  "s0156": "Gave to dog, dog died;",
  "s0157": "Gave to small minister, small minister died.",
  "s0158": "Li Ji wept said: \"Crown prince how cruel!",
  "s0159": "His father yet wishes to assassinate replace him, moreover others?",
  "s0160": "Moreover lord old, morning evening person, yet cannot wait wishes to assassinate him!\"",
  "s0161": "Told Xian Gong: \"Crown prince does this, only because concubine and Xi Qi sake.",
  "s0162": "Concubine wishes mother and son avoid to other state, if early suicide, not make mother and son become crown prince fish meat.",
  "s0163": "Initially lord wished to depose him, concubine still resented it;",
  "s0164": "Until now, concubine especially loses herself in this.\"",
  "s0165": "Crown prince heard it, fled to Xin Cheng.",
  "s0166": "Xian Gong angered, then executed his tutor Du Yuan Kui.",
  "s0167": "Someone told crown prince: \"Made this poison was Li Ji, crown prince why not personally explain clarify it?\"",
  "s0168": "Crown prince said: \"My lord old, without Li Ji, sleeps not peaceful, eats not sweet.",
  "s0169": "If explain it, lord moreover will anger her.",
  "s0170": "Cannot.\"",
  "s0171": "Someone told crown prince: \"Can flee to other state.\"",
  "s0172": "Crown prince said: \"Bear this evil name to leave, who will accept me?",
  "s0173": "I will suicide.\"",
  "s0174": "Twelfth month wu shen, Shen Sheng suicided at Xin Cheng.",
  "s0175": "At this time Chong Er, Yi Wu came to court.",
  "s0176": "Person or told Li Ji: \"Two dukes resent Li Ji slandered killed crown prince.\"",
  "s0177": "Li Ji feared, because slandered two dukes: \"Shen Sheng poison roasted meat, two dukes knew it.\"",
  "s0178": "Two sons heard it, feared, Chong Er fled Pu, Yi Wu fled Qu, defended their cities, self-prepared guard.",
  "s0179": "Initially, Xian Gong made Shi Wei for two dukes build Pu, Qu cities, not completed.",
  "s0180": "Yi Wu with this told duke, duke angered Shi Wei.",
  "s0181": "Shi Wei apologized said: \"Border cities few bandits, what use?\"",
  "s0182": "Retired and sang: \"Fox fur thick, one state three dukes, I who follow!\"",
  "s0183": "Finally completed cities.",
  "s0184": "When Shen Sheng died, two sons also returned defended their cities.",
  "s0185": "Twenty-second year, Xian Gong angered two sons not explain left, indeed had plotting, then sent troops attacked Pu.",
  "s0186": "Pu person eunuch Bo Di commanded Chong Er hurry suicide.",
  "s0187": "Chong Er climbed wall, eunuch pursued cut his robe sleeve.",
  "s0188": "Chong Er then fled to Di.",
  "s0189": "Sent people attack Qu, Qu city defended, could not take.",
  "s0190": "This year, Jin again borrowed road at Yu to attack Guo.",
  "s0191": "Yu duke Gong Zhi Qi admonished Yu lord: \"Jin cannot borrow road, this will extinguish Yu.\"",
  "s0192": "Yu lord said: \"Jin is my same surname, should not attack me.\"",
  "s0193": "Gong Zhi Qi said: \"Tai Bo, Yu Zhong, Tai Wang sons, Tai Bo fled, therefore not succeed.",
  "s0194": "Guo Zhong, Guo Shu, Wang Ji sons, were Wen Wang ministers, their merit record in royal chamber, stored in alliance repository.",
  "s0195": "Will extinguish Guo, what love for Yu?",
  "s0196": "Moreover Yu relation can closer than Huan, Zhuang clan?",
  "s0197": "Huan, Zhuang clan what crime, completely extinguished them.",
  "s0198": "Yu and Guo are lips and teeth, lips gone then teeth cold.\"",
  "s0199": "Yu Gong not listen, then permitted Jin.",
  "s0200": "Gong Zhi Qi with his clan left Yu."
}