{
  "s0051": "The king admitted his crimes and committed suicide.",
  "s0052": "The kingdom was abolished and its territory incorporated into Han as Guangling Commandery.",
  "s0053": "King Yu of Jiaoxi, Duan, was made King of Jiaoxi as imperial son in Emperor Xiaojing's third year before his reign, after the Wu and Chu Seven Kingdoms rebellion was crushed.",
  "s0054": "Duan was cruel and tyrannical by nature, and moreover suffered from impotence. Whenever he approached a woman, he would fall ill for several months.",
  "s0055": "He had a beloved young man who served as a gentleman-in-attendance.",
  "s0056": "This attendant soon committed adultery with the women of the rear palace. Duan captured and executed him, along with his mother and children.",
  "s0057": "He repeatedly violated the laws of the court. Han's nobles and ministers repeatedly requested his execution, but the emperor spared him for the sake of brotherhood. Yet Duan's offenses grew worse.",
  "s0058": "The officials twice requested that his kingdom be reduced, removing more than half.",
  "s0059": "Duan was resentful and became extremely frugal.",
  "s0060": "His storehouses and treasuries all rotted and leaked, with spoiled goods worth millions. In the end he could not collect or move them.",
  "s0061": "He ordered his officials not to collect rents and taxes.",
  "s0062": "Duan dismissed all his guards and sealed his palace gates, going out to travel through only one gate.",
  "s0063": "He frequently changed his name and surname, dressed as a commoner, and traveled to other commanderies and kingdoms.",
  "s0064": "When prime ministers and officials of two thousand shi came to serve, they followed Han law to govern. Duan would seek out their crimes and report them. If they were innocent, he would poison them to death.",
  "s0065": "He was skilled at deception and investigation, strong enough to resist remonstrance, and clever enough to disguise his faults.",
  "s0066": "If prime ministers and officials of two thousand shi followed the king's governance, Han would bind them with law.",
  "s0067": "Therefore Jiaoxi was a small kingdom, yet those killed and injured among the two thousand shi officials were very numerous.",
  "s0068": "He reigned for forty-seven years and died. In the end he had no male heir to succeed him. The kingdom was abolished and its territory incorporated into Han as Jiaoxi Commandery.",
  "s0069": "These three kingdoms were originally ruled by sons of Consort Cheng.",
  "s0070": "King Pengzu of Zhao was made King of Guangchuan as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0071": "After King Sui of Zhao's rebellion was crushed, Pengzu became King of Guangchuan.",
  "s0072": "After four years, he was moved to become King of Zhao.",
  "s0073": "After fifteen years, Emperor Xiaojing passed away.",
  "s0074": "Pengzu was crafty and flattering by nature, outwardly respectful but inwardly deeply treacherous.",
  "s0075": "He loved legal affairs and used clever arguments to trap people.",
  "s0076": "Pengzu had many favored consorts in his palace and many children and grandchildren.",
  "s0077": "If prime ministers and officials of two thousand shi wished to follow Han law to govern, it would harm the king's family.",
  "s0078": "Therefore whenever prime ministers and officials of two thousand shi arrived, Pengzu would wear mourning clothes and personally go to welcome them. He would clear out the officials' residences and set up many suspicious matters to provoke them. If he caught them making slips of the tongue or taboo violations, he would record them.",
  "s0079": "When officials of two thousand shi wished to govern, he would use this to coerce and threaten them.",
  "s0080": "If they did not listen, he would submit memorials accusing them and slander them with charges of corruption and personal gain.",
  "s0081": "Pengzu reigned for more than fifty years. No prime minister or official of two thousand shi could complete two years in office before being dismissed for crimes—major ones died, minor ones were punished. Therefore no officials of two thousand shi dared to govern.",
  "s0082": "The King of Zhao monopolized power, sending envoys to counties to act as merchants and collect monopolies, bringing in more than the kingdom's regular taxes.",
  "s0083": "Because of this the Zhao royal family had abundant gold and money, though what he bestowed on his consorts and sons also exhausted it all.",
  "s0084": "Pengzu took the favored consort of King Yi of Jiangdu that King Jian had stolen and committed adultery with—Nao Ji—as his own consort, and loved her deeply.",
  "s0085": "Pengzu did not like constructing palaces and seeking auspicious omens; he liked handling official matters.",
  "s0086": "He submitted a memorial volunteering to supervise thieves and bandits throughout the kingdom.",
  "s0087": "He often went out at night with foot soldiers patrolling Handan.",
  "s0088": "All envoys and travelers passing through considered Pengzu dangerous and treacherous, and none dared stay in Handan.",
  "s0089": "His crown prince Dan committed incest with his own daughter and full sister, and had enmity with his guest Jiang Chong.",
  "s0090": "Chong reported Dan, who was therefore deposed.",
  "s0091": "Zhao established a new crown prince.",
  "s0092": "King Jing of Zhongshan, Sheng, was made King of Zhongshan as imperial son in Emperor Xiaojing's third year before his reign.",
  "s0093": "After fourteen years, Emperor Xiaojing passed away.",
  "s0094": "Sheng loved wine and women by nature, with over one hundred twenty children and descendants.",
  "s0095": "He often quarreled with his brother the King of Zhao, saying: 'My brother is king and monopolizes the governance of officials.",
  "s0096": "As king, one should daily listen to music and enjoy beauty.'",
  "s0097": "The King of Zhao also quarreled with him, saying: 'The King of Zhongshan merely indulges in debauchery daily, does not assist the Son of Heaven in comforting and guiding the people. How can he be called a vassal minister!'",
  "s0099": "He reigned for forty-two years and died. His son, King Ai Chang, succeeded him.",
  "s0100": "He died after one year. His son Kun Chi succeeded as King of Zhongshan.",
  "s0101": "These two kingdoms were originally ruled by sons of Lady Jia."
}

