{
  "s0053": "Huan Shu wished enter Jin, Jin people sent troops attacked Huan Shu.",
  "s0054": "Huan Shu defeated, returned to Qu Wo.",
  "s0055": "Jin people together established Zhao Hou son Ping as lord, this was Xiao Hou.",
  "s0056": "Executed Pan Fu.",
  "s0057": "Xiao Hou eight years, Qu Wo Huan Shu died, son Jia Huan Shu, this was Qu Wo Zhuang Bo.",
  "s0058": "Xiao Hou fifteen years, Qu Wo Zhuang Bo assassinated his lord Jin Xiao Hou at Yi.",
  "s0059": "Jin people attacked Qu Wo Zhuang Bo, Zhuang Bo again entered Qu Wo.",
  "s0060": "Jin people again established Xiao Hou son Xi as lord, this was E Hou.",
  "s0061": "E Hou six years died.",
  "s0062": "Qu Wo Zhuang Bo heard Jin E Hou died, then raised troops attacked Jin.",
  "s0063": "Zhou Ping Wang made Guo Gong lead troops attacked Qu Wo Zhuang Bo, Zhuang Bo fled defended Qu Wo.",
  "s0064": "Jin people together established E Hou son Guang, this was Ai Hou.",
  "s0065": "Ai Hou two years Qu Wo Zhuang Bo died, son Cheng replaced Zhuang Bo established, this was Qu Wo Wu Gong.",
  "s0066": "Ai Hou six years, Lu assassinated their lord Yin Gong.",
  "s0067": "Ai Hou eight years, Jin invaded Xing Ting.",
  "s0068": "Xing Ting with Qu Wo Wu Gong plotted, nine years, attacked Jin at Fen beside, captured Ai Hou.",
  "s0069": "Jin people then established Ai Hou son Xiao Zi as lord, this was Xiao Zi Hou.",
  "s0070": "Xiao Zi first year, Qu Wo Wu Gong made Han Wan kill captured Jin Ai Hou.",
  "s0071": "Qu Wo increasingly strong, Jin without what to do.",
  "s0072": "Jin Xiao Zi four years, Qu Wo Wu Gong lured summoned Jin Xiao Zi killed him.",
  "s0073": "Zhou Huan Wang made Guo Zhong attacked Qu Wo Wu Gong, Wu Gong entered Qu Wo, then established Jin Ai Hou younger brother Min as Jin Hou.",
  "s0074": "Jin Hou Min four years, Song seized Zheng Ji Zhong established Tu as Zheng lord.",
  "s0075": "Jin Hou nineteen years, Qi person Guan Zhi Fu assassinated their lord Xiang Gong.",
  "s0076": "Jin Hou twenty eight years, Qi Huan Gong began hegemon.",
  "s0077": "Qu Wo Wu Gong attacked Jin Hou Min, extinguished him, all with his precious vessels bribed offered Zhou Xi Wang.",
  "s0078": "Xi Wang commanded Qu Wo Wu Gong as Jin lord, ranked as feudal lords, then completely annexed Jin land had it.",
  "s0079": "Qu Wo Wu Gong already established thirty seven years, changed title Jin Wu Gong.",
  "s0080": "Jin Wu Gong began capital Jin state, previous established Qu Wo, through years thirty eight.",
  "s0081": "Wu Gong surnamed, first Jin Mu Hou great grandson, Qu Wo Huan Shu grandson.",
  "s0082": "Huan Shu, began sealed Qu Wo.",
  "s0083": "Wu Gong, Zhuang Bo son.",
  "s0084": "From Huan Shu initial sealed Qu Wo until Wu Gong extinguished Jin, altogether sixty seven years, yet finally replaced Jin as feudal lord.",
  "s0085": "Wu Gong replaced Jin two years, died.",
  "s0086": "With Qu Wo through years, established altogether thirty nine years died.",
  "s0087": "Son Xian Gong Gui Zhu established.",
  "s0088": "Xian Gong first year, Zhou Hui Wang younger brother Sui attacked Hui Wang, Hui Wang fled, dwelt Zheng Li Yi.",
  "s0089": "Five years, attacked Li Rong, obtained Li Ji, Li Ji younger brother, both loved favored.",
  "s0090": "Eight years, Shi Wei advised Gong: 'Formerly Jin various crown princes many, not executed, chaos about rise.'",
  "s0091": "Then made all kill various crown princes, yet walled gathered capital it, named Jiang, began capital Jiang.",
  "s0092": "Nine years, Jin various crown princes already fled escaped Guo, Guo because this twice attacked Jin, not conquered.",
  "s0093": "Ten years, Jin wished attack Guo, Shi Wei said: 'Moreover wait their chaos.'",
  "s0095": "Twelve years, Li Ji gave birth Xi Qi.",
  "s0096": "Xian Gong had intention abolish crown prince, then said: 'Qu Wo my previous ancestor ancestral temple location, Pu borders Qin, Qu borders Di, not make various sons dwell it, I fear.'",
  "s0097": "Then made crown prince Shen Sheng dwell Qu Wo, crown prince Chong Er dwell Pu, crown prince Yi Wu dwell Qu.",
  "s0098": "Xian Gong with Li Ji son Xi Qi dwelt Jiang.",
  "s0099": "Jin state because this knew crown prince not established.",
  "s0100": "Crown prince Shen Sheng, his mother Qi Huan Gong woman, called Qi Jiang, early died.",
  "s0101": "Shen Sheng same mother younger sister for Qin Mu Gong wife.",
  "s0102": "Chong Er mother, Di fox clan woman.",
  "s0103": "Yi Wu mother, Chong Er mother younger sister."
}