{
  "s0001": "Zhang Yi was a Wei man.",
  "s0002": "Initially studied together with Su Qin under Master Guigu, learned arts, Su Qin considered himself inferior to Zhang Yi.",
  "s0003": "Zhang Yi having studied, traveled persuading feudal lords.",
  "s0004": "Once drank with Chu chancellor, afterward Chu chancellor lost jade, attendants suspected Zhang Yi, said: \"Yi poor without conduct, certainly this stole chancellor lord jade.\"",
  "s0005": "Together seized Zhang Yi, whipped several hundred, not confess, released him.",
  "s0006": "His wife said: \"Alas!",
  "s0007": "You not study books travel persuade, how obtain this humiliation!\"",
  "s0008": "Zhang Yi told his wife: \"Look my tongue still there?\"",
  "s0009": "His wife laughed: \"Tongue there.\"",
  "s0010": "Yi said: \"Sufficient.\"",
  "s0012": "Su Qin having persuaded Zhao wang obtained chancellor alliance form close alliance, yet feared Qin attack feudal lords, defeat pact afterward renege, thought none could use in Qin, then made person secretly tempt Zhang Yi: \"You initially friendly with Su Qin, now Qin already controls road, you why not go travel, seek fulfill your wishes?\"",
  "s0013": "Zhang Yi then went Zhao, ascended court sought see Su Qin.",
  "s0014": "Su Qin then ordered gate people not announce, moreover made cannot leave several days.",
  "s0015": "Afterward saw him, seated hall below, granted servant concubine food.",
  "s0016": "Then repeatedly rebuked: \"With your talent ability, yet self make impoverished humiliated to this.",
  "s0017": "I rather cannot speak rich noble you, you insufficient collect.\"",
  "s0018": "Apologized departed.",
  "s0019": "Zhang Yi come, self considered old friend, sought benefit, instead saw insult, angry, thought feudal lords none serve, only Qin could harm Zhao, then entered Qin.",
  "s0020": "Su Qin afterward told his retainer: \"Zhang Yi, world worthy man, I perhaps not equal.",
  "s0021": "Now I fortunately first used, yet can use Qin authority, only Zhang Yi can.",
  "s0022": "Yet poor, no means advance.",
  "s0023": "I fear he delight small profit not accomplish, therefore summoned insulted him, to stir his intention.",
  "s0024": "You for me secretly support him.\"",
  "s0025": "Then spoke Zhao wang, issued gold currency chariots horses, made person secretly follow Zhang Yi, with same lodge, gradually approach him, provide chariots horses gold money, desired use, provided, not tell.",
  "s0026": "Zhang Yi then obtained see Qin Hui Wang.",
  "s0027": "Hui Wang made guest qing, with plan attack feudal lords.",
  "s0028": "Su Qin retainer then took leave departed.",
  "s0029": "Zhang Yi said: \"Relied you obtain fame, just about repay virtue, why depart?\"",
  "s0030": "Retainer said: \"Subject not know jun, know jun then Su jun.",
  "s0031": "Su jun worried Qin attack Zhao defeat alliance pact, considered not jun could obtain Qin authority, therefore angered jun, made subject secretly support provide jun resources, exhaust Su jun plans.",
  "s0032": "Now jun already used, please return report.\"",
  "s0033": "Zhang Yi said: \"Alas, this in my arts not realize, I not reach Su jun clear!",
  "s0034": "I moreover new used, how can plan Zhao?",
  "s0035": "For me apologize Su jun, Su jun time, Yi how dare speak.",
  "s0036": "Moreover Su jun in, Yi rather who can!\"",
  "s0037": "Zhang Yi having chancellor Qin, made written dispatch tell Chu chancellor: \"Initially I drank with you, I not steal your jade, you whipped me.",
  "s0038": "You good guard your state, I moreover will steal your city!\"",
  "s0040": "Zhu Shu mutually attacked, each came urgently report Qin.",
  "s0041": "Qin Hui Wang wished send troops attack Shu, considered road dangerous narrow difficult reach, Han moreover came invade Qin, Qin Hui Wang wished first attack Han, after attack Shu, feared disadvantage, wished first attack Shu, feared Han attack Qin exhaustion.",
  "s0042": "Hesitated not decided.",
  "s0043": "Sima Cuo with Zhang Yi debated before Hui Wang, Sima Cuo wished attack Shu, Zhang Yi said: \"Not as attack Han.\"",
  "s0044": "Wang said: \"Please hear its reasoning.\"",
  "s0046": "Yi said: \"Befriend Wei good Chu, send troops San Chuan, block Shi Gu mouth, face Tun Liu road, Wei cut Nan Yang, Chu approach Nan Zheng, Qin attack Xin Cheng, Yi Yang, to face two Zhou suburbs, punish Zhou wang crime, invade Chu Wei land.",
  "s0047": "Zhou self know cannot save, nine tripods treasure vessels certainly come out.",
  "s0048": "Occupy nine tripods, hold maps registers, grasp Son of Heaven command world, world none dare not listen, this wang enterprise.",
  "s0049": "Now Shu, west remote state Rong Di equal, exhaust troops labor people insufficient become name, obtain its land insufficient benefit.",
  "s0050": "Subject heard contend name at court, contend profit at market.\"",
  "s0051": "Now San Chuan, Zhou house, world court market, yet wang not contend, instead contend with Rong Di, far from wang enterprise.\"",
  "s0053": "Sima Cuo said: \"Not so.",
  "s0054": "Subject heard, desire enrich state strive broaden its land, desire strengthen troops strive enrich its people, desire king strive broaden its virtue, three resources prepared then king follows.",
  "s0055": "Now wang land small people poor, therefore subject wish first undertake easy.",
  "s0056": "Shu, west remote state Rong Di chief, has Jie Zhou disorder.",
  "s0057": "With Qin attack it, like make wolf chase flock sheep.",
  "s0058": "Obtain its land sufficient broaden state, take its wealth sufficient enrich people repair troops, not injure multitude yet they already submit.",
  "s0059": "Pull one state yet world not consider violent, benefit exhaust west sea yet world not consider greedy, this our one action name reality attach, moreover have prohibit violent stop disorder name.",
  "s0060": "Now attack Han, coerce Son of Heaven, evil name, yet not necessarily profit, moreover have unrighteous name, attack what world not desire, dangerous.",
  "s0061": "Subject please state its reason: Zhou, world ancestral house;",
  "s0062": "Qi, Han allied state.",
  "s0063": "Zhou self know lose nine tripods, Han self know lose San Chuan, will two states combine force conspire, rely Qi Zhao seek dissolve Chu Wei, give tripods to Chu, give land to Wei, wang cannot stop.",
  "s0064": "This subject called dangerous.",
  "s0065": "Not as attack Shu complete.\"",
  "s0067": "Hui Wang said: \"Good, I please listen you.\"",
  "s0068": "Finally raised troops attacked Shu, ten months, took it, then pacified Shu, demoted Shu wang changed title to hou, made Chen Zhuang chancellor Shu.",
  "s0069": "Shu having belonged Qin, Qin thereby stronger, richer, belittled feudal lords.",
  "s0070": "Qin Hui Wang ten years, made Gong Zi Hua with Zhang Yi surround Pu Yang, took surrender.",
  "s0071": "Yi thereby spoke Qin again ally Wei, made Gong Zi You hostage Wei.",
  "s0072": "Yi thereby persuaded Wei Wang: \"Qin wang treat Wei very thick, Wei cannot without ritual.\"",
  "s0073": "Wei thereby entered Shang Jun, Shao Liang, thanked Qin Hui Wang.",
  "s0074": "Hui Wang then made Zhang Yi chancellor, changed Shao Liang name Xia Yang.",
  "s0075": "Yi chancellor Qin four years, established Hui Wang as wang.",
  "s0076": "After one year, as Qin general, took Xia.",
  "s0077": "Built Shang Jun barrier.",
  "s0078": "After two years, made with Qi Chu chancellors meet Ya Sang.",
  "s0079": "East returned relieved chancellor, chancellor Wei for Qin, wished make Wei first serve Qin then feudal lords follow.",
  "s0080": "Wei Wang not willing listen Yi.",
  "s0081": "Qin Wang angry, attacked took Wei Qu Wo, Ping Zhou, again secretly thick Zhang Yi even more.",
  "s0082": "Zhang Yi ashamed, nothing return report.",
  "s0083": "Remained Wei four years then Wei Xiang Wang died, Ai Wang established.",
  "s0084": "Zhang Yi again persuaded Ai Wang, Ai Wang not listen.",
  "s0085": "Then Zhang Yi secretly ordered Qin attack Wei.",
  "s0086": "Wei with Qin battled, defeated.",
  "s0087": "Next year, Qi again came defeated Wei at Guan Jin.",
  "s0088": "Qin again wished attack Wei, first defeated Han Shen Cha army, beheaded eighty thousand, feudal lords shocked fearful.",
  "s0089": "Zhang Yi again persuaded Wei Wang: \"Wei territory not reach thousand li, troops not exceed thirty thousand.",
  "s0090": "Land four flat, feudal lords four pass hub converge, no famous mountains great rivers limit.",
  "s0091": "From Zheng to Liang two hundred li, chariots gallop people run, not wait strength arrive.",
  "s0092": "Liang south with Chu border, west with Han border, north with Zhao border, east with Qi border, troops garrison four directions, guard towers barriers not below ten thousand.",
  "s0093": "Liang land position, certainly battlefield.",
  "s0094": "Liang south with Chu not with Qi, then Qi attack its east;",
  "s0095": "East with Qi not with Zhao, then Zhao attack its north;",
  "s0096": "Not unite with Han, then Han attack its west;",
  "s0097": "Not befriend Chu, then Chu attack its south: this called four divide five split way.",
  "s0098": "\"Moreover feudal lords do alliance, will secure altars honor lord strengthen troops manifest name.",
  "s0099": "Now alliance one world, pact as brothers, cut white horse covenant Huan Water above, mutually strengthen.",
  "s0100": "Yet close brothers same parents, still have contend money wealth, wish rely deceit false reversals Su Qin remaining plans, its impossible complete also clear.\"",
  "s0101": "\"Great wang not serve Qin, Qin send troops attack beyond Yellow River, occupy Juan, Yan, Suan Zao, coerce Wei take Yang Jin, then Zhao not south, Zhao not south then Liang not north, Liang not north then alliance road cut, alliance road cut then great wang state wish not dangerous impossible.",
  "s0102": "Qin break Han attack Liang, Han fear Qin, Qin Han become one, Liang perish can stand await.",
  "s0103": "This minister worry for great wang.",
  "s0104": "\"For great wang planning, none better than serve Qin.",
  "s0105": "Serve Qin then Chu Han certainly dare not move;",
  "s0106": "No Chu Han calamity, then great wang high pillow lie, state certainly no worry.",
  "s0107": "\"Moreover Qin desire weaken none like Chu, yet can weaken Chu none like Liang.",
  "s0108": "Chu though have rich great name yet substance empty void;",
  "s0109": "Its troops though many, yet lightly flee easy north, cannot firm battle.",
  "s0110": "All Liang troops south face attack Chu, victorious certain.",
  "s0111": "Divide Chu increase Liang, harm Chu benefit Qin, marry calamity secure state, this good affair.",
  "s0112": "Great wang not listen minister, Qin send armored troops east attack, though desire serve Qin, impossible obtain.",
  "s0113": "\"Moreover alliance people many excite words few trustworthy, persuade one feudal lord become enfeoff marquise, therefore world wandering talkers none not day night clench wrists glare eyes grind teeth speak alliance convenient, persuade people lords.",
  "s0114": "People lords worthy their eloquence pulled their words, how obtain not dazzled.",
  "s0115": "\"Subject heard, accumulate feathers sink boat, group light break axle, crowd mouths melt gold, accumulate slander melt bone, therefore wish great wang carefully decide plan, moreover grant remains retire Wei.\"",
  "s0117": "Ai Wang then doubled alliance pact because Yi requested peace Qin.",
  "s0118": "Zhang Yi returned, again chancellor Qin.",
  "s0119": "Three years then Wei again betrayed Qin for alliance.",
  "s0120": "Qin attacked Wei, took Qu Wo.",
  "s0121": "Next year, Wei again served Qin.",
  "s0122": "Qin wished attack Qi, Qi Chu form close alliance, then Zhang Yi went chancellor Chu.",
  "s0123": "Chu Huai Wang heard Zhang Yi come, emptied upper lodge personally lodged him.",
  "s0124": "Said: \"This remote rustic state, sir what teach it?\"",
  "s0125": "Yi persuaded Chu Wang: \"Great wang truly can listen minister, close passes break pact Qi, minister please offer Shang Yu land six hundred li, make Qin women become great wang broom concubine, Qin Chu take women give women, long become brothers states.",
  "s0126": "This north weaken Qi west benefit Qin, plan no convenient this.\"",
  "s0127": "Chu Wang greatly pleased agreed.",
  "s0128": "Ministers all congratulated, Chen Zhen alone condoled.",
  "s0129": "Chu Wang angry: \"I not raise troops send troops obtain six hundred li land, ministers all congratulate, you alone condole, why?\"",
  "s0130": "Chen Zhen replied: \"Not so, with subject observe, Shang Yu land cannot obtain yet Qi Qin unite, Qi Qin unite then calamity certainly arrive.\"",
  "s0131": "Chu Wang said: \"Have explanation?\"",
  "s0132": "Chen Zhen replied: \"Qin reason value Chu, because have Qi.",
  "s0133": "Now close passes break pact Qi, then Chu isolated.",
  "s0134": "Qin why greedy isolated state, give Shang Yu land six hundred li?",
  "s0135": "Zhang Yi to Qin, certainly renege wang, this north break Qi alliance, west give calamity Qin, two states troops certainly both arrive.",
  "s0136": "Good for wang plan, not as secretly unite secretly break Qi, make person follow Zhang Yi.",
  "s0137": "If give our land, break Qi not late;",
  "s0138": "Not give our land, secretly unite conspire.\"",
  "s0139": "Chu Wang said: \"Wish Chen Zi close mouth no more speak, await I obtain land.\"",
  "s0140": "Then gave chancellor seal Zhang Yi, thick bribed him.",
  "s0141": "Then closed passes broke pact Qi, made one general follow Zhang Yi.",
  "s0142": "Zhang Yi to Qin, feigned lost reins fell from chariot, not court three months.",
  "s0143": "Chu Wang heard, said: \"Yi because I break Qi not yet?\"",
  "s0144": "Then made brave men to Song, borrowed Song tally, north cursed Qi wang.",
  "s0145": "Qi Wang greatly angry, bent principles descended Qin.",
  "s0146": "Qin Qi alliance united, Zhang Yi then courted, told Chu envoy: \"Subject have fief city six li, wish offer great wang left right.\"",
  "s0147": "Chu envoy said: \"Subject received command wang, Shang Yu land six hundred li, not heard six li.\"",
  "s0148": "Returned reported Chu Wang, Chu Wang greatly angry, sent troops attacked Qin.",
  "s0149": "Chen Zhen said: \"Zhen can open mouth speak?",
  "s0150": "Attack not as divide land return bribe Qin, with unite troops attack Qi, this we send land to Qin, take recompense from Qi, wang state still can preserve.\"",
  "s0151": "Chu Wang not listen, finally sent troops made general Qu Gai attack Qin.",
  "s0152": "Qin Qi together attacked Chu, beheaded eighty thousand, killed Qu Gai, then took Dan Yang, Han Zhong land.",
  "s0153": "Chu moreover again increased sent troops attacked Qin, to Lan Tian, great battle, Chu greatly defeated, then Chu divided two cities with Qin make peace.",
  "s0154": "Qin coerced Chu wished obtain Qian Zhong land, wished with Wu Pass outside exchange.",
  "s0155": "Chu Wang said: \"Not wish exchange land, wish obtain Zhang Yi offer Qian Zhong land.\"",
  "s0156": "Qin Wang wished send him, mouth not endure speak.",
  "s0157": "Zhang Yi then requested go.",
  "s0158": "Hui Wang said: \"That Chu Wang angry you renege Shang Yu land, this moreover will satisfy heart on you.\"",
  "s0159": "Zhang Yi said: \"Qin strong Chu weak, subject good Jin Shang, Shang can serve Chu consort Zheng Xiu, Xiu what speak all follow.",
  "s0160": "Moreover subject carry wang tally make Chu, Chu how dare add kill.",
  "s0161": "Suppose kill subject become Qin obtain Qian Zhong land, subject upper wish.\"",
  "s0162": "Then made Chu.",
  "s0163": "Chu Huai Wang arrived then imprisoned Zhang Yi, will kill him.",
  "s0164": "Jin Shang told Zheng Xiu: \"You also know you base wang?\"",
  "s0165": "Zheng Xiu said: \"Why?\"",
  "s0166": "Jin Shang said: \"Qin Wang very love Zhang Yi not wish send him, now will with Shang Yong land six counties bribe Chu, beautiful woman betroth Chu, with palace good song sing as accompany.",
  "s0167": "Chu Wang heavy land honor Qin, Qin woman certainly noble consort expelled.",
  "s0168": "Not as speak release him.\"",
  "s0169": "Then Zheng Xiu day night spoke Huai Wang: \"Minister each for their lord use.",
  "s0170": "Now land not enter Qin, Qin make Zhang Yi come, to heavy wang.",
  "s0171": "Wang have no ritual kill Zhang Yi, Qin certainly greatly angry attack Chu.",
  "s0172": "Concubine request son mother together move Jiangnan, not become Qin fish meat.\"",
  "s0173": "Huai Wang regretted, pardoned Zhang Yi, thick ritual him as before.",
  "s0174": "Zhang Yi having left, not gone, heard Su Qin die, then advised Chu Wang: \"Qin land half world, troops enemy four states, backed mountain fronting Wei, four barriers as solid.",
  "s0175": "Tiger brave soldiers hundred thousand, chariots thousand, cavalry ten thousand horses, store grain like hill mountains.",
  "s0176": "Law orders already clear, soldiers at peace difficulty joyful die, lord clear strict, generals wise martial, though no emerge armor, mat roll Chang Mountain danger, must break world spine, world have after submit first perish.",
  "s0177": "Moreover alliance, no different drive flock sheep attack fierce tiger, tiger sheep not resist clear.",
  "s0178": "Now wang not with fierce tiger with flock sheep, subject secretly think wang plan wrong.",
  "s0179": "\"All world strong states, not Qin then Chu, not Chu then Qin, two states dispute, their power not coexist.",
  "s0180": "Great wang not ally Qin, Qin send troops occupy Yi Yang, Han upper land not pass.",
  "s0181": "Descend He Dong, take Cheng Gao, Han must enter minister, Liang then from wind move.",
  "s0182": "Qin attack Chu west, Han Liang attack its north, state altars how not danger?",
  "s0183": "\"Moreover alliance gather weak attack strong, not measure enemy lightly battle, state poor frequent raise troops, danger perish way.",
  "s0184": "Subject heard, troops not equal not with challenge, grain not equal not with last long.",
  "s0185": "Alliance people decorate eloquence empty words, raise lord festival, speak its profit not speak its harm, finally have Qin calamity, no time already.",
  "s0186": "Therefore wish great wang carefully calculate.",
  "s0187": "\"Qin west has Ba Shu, great boats store grain, rise Wen Mountain, float Jiang down, to Chu three thousand li.",
  "s0188": "Boat ships carry troops, one ship carry fifty people three months food, down water float, one day travel three hundred li, li number though many, yet not use cow horse strength, not reach ten days arrive Chu Pass.",
  "s0189": "Chu Pass alarmed, then from border east all cities defend, Qian Zhong, Wu commandery not wang have.",
  "s0190": "Qin raise armor emerge Wu Pass, south face attack, then north land cut.",
  "s0191": "Qin troops attack Chu, danger difficulty in three months within, Chu wait feudal lords save, in half year outside, this their power not match.",
  "s0192": "Rely weak states save, forget strong Qin calamity, this subject reason worry for great wang.",
  "s0193": "\"Great wang once with Wu people battle, five battles three wins, array troops exhausted;",
  "s0194": "Partial defend Xin Cheng, remaining people bitter.",
  "s0195": "Subject heard merit great easy danger, people depleted resent superiors.",
  "s0196": "Guard easy danger merit oppose strong Qin heart, subject secretly danger for great wang.",
  "s0197": "\"Moreover Qin reason not emerge troops Hangu fifteen years attack Qi Zhao, dark plot have unite world heart.",
  "s0198": "Chu once with Qin dispute difficulty, battle Han Zhong, Chu people not win, lie hou grasp gui die seventy people, then lost Han Zhong.",
  "s0199": "Chu Wang greatly angry, raise troops attack Qin, battle Lan Tian.",
  "s0200": "This called two tigers mutually fight.",
  "s0201": "Qin Chu mutually deplete Han Wei with full control their rear, plan no danger this.",
  "s0202": "Wish great wang carefully calculate.",
  "s0203": "\"Qin send troops attack Wei Yang Jin, must greatly close world throat.",
  "s0204": "Great wang all raise troops attack Song, not reach several months Song can raise, raise Song east point, then Si Shang twelve feudal lords all wang have.",
  "s0205": "\"All world with faithful pact alliance close mutually strengthen Su Qin, enfeoff Wu An Jun, chancellor Yan, then dark with Yan Wang plan attack break Qi divide its land;",
  "s0206": "Then feign have crime flee enter Qi, Qi Wang because accept chancellor him;",
  "s0207": "Dwell two years then aware, Qi Wang greatly angry, cart tear Su Qin at market.",
  "s0208": "Using one deceit false Su Qin, wish operate world, mix one feudal lords, its impossible complete also clear.",
  "s0209": "\"Now Qin with Chu connect border territory, certainly form close country.",
  "s0210": "Great wang truly can listen minister, minister please make Qin crown prince enter hostage Chu, Chu crown prince enter hostage Qin, please with Qin woman become great wang broom concubine, effect ten thousand rooms city become hot water city, long become brothers states, lifetime no mutually attack invade.",
  "s0211": "Minister think plan no convenient this.\"",
  "s0213": "Then Chu Wang already obtain Zhang Yi heavy send Qian Zhong land to Qin, wished permit him.",
  "s0214": "Qu Yuan said: \"Former great wang see cheat Zhang Yi, Zhang Yi arrive, subject think great wang boil him;",
  "s0215": "Now release not endure kill him, moreover listen his crooked words, unacceptable.\"",
  "s0216": "Huai Wang said: \"Permit Yi obtain Qian Zhong, beautiful profit.",
  "s0217": "After double it, unacceptable.\"",
  "s0218": "Therefore finally permitted Zhang Yi, with Qin close.",
  "s0219": "Zhang Yi leave Chu, because go Han, advised Han Wang: \"Han land dangerous bad mountain dwell, five grains born, not beans wheat, people food mostly beans bean soup.",
  "s0220": "One year not harvest, people not full chaff bran.",
  "s0221": "Land not exceed nine hundred li, no two years food.",
  "s0222": "Estimate great wang troops, all not exceed thirty thousand, yet servants burden support in midst.",
  "s0223": "Except guard border towers barriers, see troops not exceed twenty thousand only.",
  "s0224": "Qin armored hundred thousand, chariots thousand, cavalry ten thousand horses, tiger brave soldiers bend kneel bare head pierce chin wave halberd, to cannot count.",
  "s0225": "Qin horses excellent, Rong troops multitude, probe front kick rear hoof between three zhang leap, cannot count.",
  "s0226": "Shandong scholars don armor cover helmets meet battle, Qin people cast armor bare advance enemy, left grasp people heads, right hold living captives.",
  "s0227": "Qin troops with Shandong troops, like Meng Ben with coward;",
  "s0228": "With heavy strength press, like Wu Huo with infant.",
  "s0229": "Battle Meng Ben Wu Huo soldiers attack not submit weak states, no different hang thousand jun weight on bird egg above, certainly no lucky.",
  "s0230": "\"Ministers feudal lords not measure land few, listen alliance people sweet words good speech, compare close mutually decorate, all excited say listen my plan can strong hegemon world.",
  "s0231": "Not consider state altars long profit listen moment speech, deceive mislead people lords, no exceed this.",
  "s0232": "\"Great wang not serve Qin, Qin send troops occupy Yi Yang, cut Han upper land, east take Cheng Gao Xing Yang, then Hong Tai palace, Sang Lin park not wang have.",
  "s0233": "Block Cheng Gao, cut upper land, then wang state divide.",
  "s0234": "First serve Qin then secure, not serve Qin then danger.",
  "s0235": "Create calamity seek its fortune report, plan shallow resent deep, oppose Qin follow Chu, though wish not perish, impossible obtain.",
  "s0236": "\"Therefore for great wang planning, none better serve Qin.",
  "s0237": "Qin desire weaken none like Chu, yet can weaken Chu like Han.",
  "s0238": "Not because Han can strong Chu, its land position so.",
  "s0239": "Now wang west face serve Qin attack Chu, Qin Wang certainly happy.",
  "s0240": "Attack Chu profit its land, turn calamity please Qin, plan no convenient this.\"",
  "s0242": "Han Wang listen Yi plan.",
  "s0243": "Zhang Yi return report, Qin Hui Wang enfeoff Yi five cities, number Wu Xin Jun.",
  "s0244": "Make Zhang Yi east advise Qi Min Wang: \"World strong states none exceed Qi, ministers fathers elder brothers numerous rich joyful.",
  "s0245": "Yet for great wang planning, all momentary speech, not consider hundred generations profit.",
  "s0246": "Alliance people speak great wang, certainly say Qi west strong Zhao, south Han Liang.",
  "s0247": "Qi, negative sea state, land broad people many, troops strong scholars brave, though have hundred Qin, will no what Qi.",
  "s0248": "Great wang worthy their speech not calculate its substance.",
  "s0249": "Alliance people faction close, none not consider alliance acceptable.",
  "s0250": "Subject heard, Qi with Lu three battles Lu three wins, state with danger perish follow after, though have battle victory name, have perish state substance.",
  "s0251": "Why?",
  "s0252": "Qi big Lu small.",
  "s0253": "Now Qin with Qi, like Qi with Lu.",
  "s0254": "Qin Zhao battle Yellow River Zhang above, two battles Zhao two wins;",
  "s0255": "Battle Fan Wu below, two battles again win Qin.",
  "s0256": "Four battles after, Zhao perish troops several tens thousand, Handan barely exist, though have battle victory name state already broken.",
  "s0257": "Why?",
  "s0258": "Qin strong Zhao weak.",
  "s0259": "\"Now Qin Chu give women take women, become brothers states.",
  "s0260": "Han offer Yi Yang;",
  "s0261": "Liang cede beyond Yellow River;",
  "s0262": "Zhao enter court Mian Pool, divide Yellow River interval serve Qin.",
  "s0263": "Great wang not serve Qin, Qin drive Han Liang attack Qi south land, all Zhao troops ford Qing River point Bo Pass, Linzi, Ji Mo not wang have.",
  "s0264": "State one day see attack, though desire serve Qin, impossible obtain.",
  "s0265": "Therefore wish great wang carefully calculate.\"",
  "s0267": "Qi Wang said: \"Qi remote rustic, hidden dwell east sea above, never obtained state altars long profit.\"",
  "s0268": "Then permitted Zhang Yi.",
  "s0269": "Zhang Yi departed, west advised Zhao Wang: \"Humble city Qin Wang make make subject present foolish plan great wang.",
  "s0270": "Great wang gather lead world guest Qin, Qin troops dare not emerge Hangu Pass fifteen years.",
  "s0271": "Great wang awe travel Shandong, humble city fear tremble submit, repair armor temper troops, adorn chariots cavalry, practice gallop shooting, strength farm store grain, guard four borders within, worried dwell tremble place, dare not move shake, only great wang have intention supervise pass.",
  "s0272": "\"Now with great wang strength, raise Ba Shu, annex Han Zhong, surround two Zhou, move nine tripods, guard Bai Ma ford.",
  "s0273": "Qin though remote, yet heart angry contain anger days long.",
  "s0274": "Now Qin have depleted armor worn troops, army Mian Pool, wish ford Yellow River surpass Zhang, occupy Fan Wu, meet Handan below, wish with jia zi combine battle, correct Yin Zhou affairs, respectfully make make subject first hear left right.",
  "s0275": "\"All great wang trust do alliance rely Su Qin.",
  "s0276": "Su Qin dazzle feudal lords, with is for not, with not for is, wish reverse Qi state, self make cart tear at market.",
  "s0277": "World impossible one also clear.",
  "s0278": "Now Chu with Qin become brothers states, Han Liang call eastern fief ministers, Qi offer fish salt lands, this cut Zhao right arm.",
  "s0279": "Cut right arm with people fight, lose its party isolated dwell, seek wish not danger, how obtain?",
  "s0280": "\"Now Qin send three generals: one army block Wu road, tell Qi make raise troops ford Qing River, army Handan east;",
  "s0281": "One army army Cheng Gao, drive Han Liang army beyond Yellow River;",
  "s0282": "One army army Mian Pool.",
  "s0283": "Pact four states become one attack Zhao, Zhao break, certainly four divide its land.",
  "s0284": "Therefore dare not hide intention conceal feelings, first with hear left right.",
  "s0285": "Subject secretly for great wang planning, none better with Qin Wang meet Mian Pool, face see mouth bind, please hold troops no attack.",
  "s0286": "Wish great wang decide plan.\"",
  "s0288": "Zhao Wang said: \"Former wang time, Feng Yang Jun monopolize power dominate power, blind deceive former wang, alone control affairs, subject dwell belong teachers, not with state plan.",
  "s0289": "Former wang abandon ministers, subject year young, offer sacrifices day new, heart certainly secretly doubt, think one alliance not serve Qin, not state long profit.",
  "s0290": "Then moreover wish change heart easy thoughts, divide land apologize previous error serve Qin.",
  "s0291": "Just about pact chariots hasten go, suitable hear envoy clear command.\"",
  "s0292": "Zhao Wang permitted Zhang Yi, Zhang Yi then departed.",
  "s0293": "North Yan, advised Yan Zhao Wang: \"Great wang close none like Zhao.",
  "s0294": "Former Zhao Xiang Zi once with his sister become Dai Wang wife, wish annex Dai, pact with Dai Wang meet Ju Zhu pass.",
  "s0295": "Then make craftsmen make gold ladle, lengthen its tail, make can strike people.",
  "s0296": "With Dai Wang drink, dark tell cook: When wine drunk joyful, advance hot soup, return ladle strike him.",
  "s0297": "Then wine drunk joyful, advance hot soup, cook advance pour, because return ladle strike Dai Wang, kill him, wang brain smear ground.",
  "s0298": "His sister hear, then grind hairpin self stab, therefore until now have Mo Ji mountain.",
  "s0299": "Dai Wang perish, world none not hear.",
  "s0300": "\"Zhao Wang fierce unfilial no close, great wang bright see, moreover with Zhao Wang can close?",
  "s0301": "Zhao raise troops attack Yan, twice surround Yan capital coerce great wang, great wang divide ten cities apologize.",
  "s0302": "Now Zhao Wang already enter court Mian Pool, cede Yellow River interval serve Qin.",
  "s0303": "Now great wang not serve Qin, Qin send troops Yun Zhong, Jiu Yuan, drive Zhao attack Yan, then Yi Water, Great Wall not great wang have.",
  "s0304": "\"Moreover now Zhao to Qin like commandery county, dare not rash raise troops attack invade.",
  "s0305": "Now wang serve Qin, Qin Wang certainly happy, Zhao dare not rash move, this west have strong Qin aid, south no Qi Zhao calamity, therefore wish great wang carefully calculate.\"",
  "s0307": "Yan Wang said: \"Subject barbarian yi remote place, though great man cut like infant, speech insufficient sample correct plan.",
  "s0308": "Now honored guest fortunate teach, please west face serve Qin, offer Heng Mountain tail five cities.\"",
  "s0309": "Yan Wang listen Yi.",
  "s0310": "Yi return report, not arrive Xian Yang Qin Hui Wang die, Wu Wang establish.",
  "s0311": "Wu Wang self crown prince time not approve Zhang Yi, to establish, ministers many slander Zhang Yi: \"No faith, left right sell state take favor.",
  "s0312": "Qin certainly again use him, fear become world laugh.\"",
  "s0313": "Feudal lords hear Zhang Yi have repel Wu Wang, all rebel balance, again unite alliance.",
  "s0314": "Qin Wu Wang first year, ministers day night bad Zhang Yi not stop, Qi reproach moreover arrive.",
  "s0315": "Zhang Yi fear execute, then because tell Qin Wu Wang: \"Yi have foolish plan, wish present.\"",
  "s0316": "Wang said: \"What?\"",
  "s0317": "Reply: \"For Qin state altars planning, east have great change, then wang can much divide obtain land.",
  "s0318": "Now hear Qi Wang very hate Yi, Yi where, certainly raise troops attack him.",
  "s0319": "Therefore Yi wish beg his unworthy body Liang, Qi certainly raise troops attack Liang.",
  "s0320": "Liang Qi troops connect city below cannot separate, wang with its interval attack Han, enter San Chuan, emerge troops Hangu not attack, face Zhou, sacrificial vessels certainly come out.",
  "s0321": "Grasp Son of Heaven, hold maps registers, this wang enterprise.\"",
  "s0322": "Qin Wang consider correct, then prepare leather chariots thirty, enter Yi Liang.",
  "s0323": "Qi indeed raise troops attack him.",
  "s0324": "Liang Ai Wang fear.",
  "s0325": "Zhang Yi said: \"Wang not worry, please make stop Qi troops.\"",
  "s0326": "Then make his retainer Feng Xi Chu, borrow make Qi, tell Qi Wang: \"Wang very hate Zhang Yi;",
  "s0327": "Although, also thick wang trust Yi Qin.\"",
  "s0328": "Qi Wang said: \"Subject hate Yi, Yi where, certainly raise troops attack him, how trust Yi?\"",
  "s0329": "Reply: \"This wang trust Yi.",
  "s0330": "Yi go out, certainly with Qin Wang pact: For wang planning, east have great change, then wang can much divide obtain land.",
  "s0331": "Now Qi Wang very hate Yi, Yi where, certainly raise troops attack him.",
  "s0332": "Therefore Yi wish beg his unworthy body Liang, Qi certainly raise troops attack Liang.",
  "s0333": "Qi Liang troops connect city below cannot separate, wang with its interval attack Han, enter San Chuan, emerge troops Hangu not attack, face Zhou, sacrificial vessels certainly come out.",
  "s0334": "Grasp Son of Heaven, hold maps registers, this wang enterprise.",
  "s0335": "Qin Wang consider correct, therefore prepare leather chariots thirty enter Liang.",
  "s0336": "Now Yi enter Liang, wang indeed attack him, this wang inner exhaust state outer attack ally state, broaden neighbor enemy internal face, yet trust Yi Qin Wang.",
  "s0337": "This subject called trust Yi.\"",
  "s0338": "Qi Wang said: \"Good.\"",
  "s0339": "Then make release troops.",
  "s0340": "Zhang Yi chancellor Wei one year, died Wei.",
  "s0341": "Chen Zhen, travel persuade scholar.",
  "s0342": "With Zhang Yi together serve Qin Hui Wang, all noble heavy, contend favor.",
  "s0343": "Zhang Yi bad Chen Zhen Qin Wang: \"Zhen heavy currency light make Qin Chu interval, will be state ally.",
  "s0344": "Now Chu not increase good Qin yet good Zhen, Zhen self thick for wang thin.",
  "s0345": "Moreover Zhen wish leave Qin go Chu, wang why not listen?\"",
  "s0346": "Wang tell Chen Zhen: \"I hear you wish leave Qin Chu, have?\"",
  "s0347": "Zhen said: \"Correct.\"",
  "s0348": "Wang said: \"Yi words indeed true.\"",
  "s0349": "Zhen said: \"Not only Yi know, travel road scholars all know.",
  "s0350": "Former Wu Zi loyal his jun world strive become minister, Zeng Shen filial his parents world wish become son.",
  "s0351": "Therefore sell male female servants not emerge alley market yet sell, good male female servants;",
  "s0352": "Go out women marry countryside, good women.",
  "s0353": "Now Zhen not loyal his jun, Chu also what make Zhen loyal?",
  "s0354": "Loyal moreover see abandon, Zhen not Chu where go?\"",
  "s0355": "Wang with his words consider correct, then good treat him.",
  "s0356": "Dwell Qin one year, Qin Hui Wang finally chancellor Zhang Yi, Chen Zhen flee Chu.",
  "s0357": "Chu not heavy him, make Chen Zhen envoy Qin.",
  "s0358": "Pass Liang, wish see Xi Shou.",
  "s0359": "Xi Shou decline not see.",
  "s0360": "Zhen said: \"I for affairs come, jun not see Zhen, Zhen will go, cannot wait different day.\"",
  "s0361": "Xi Shou see him.",
  "s0362": "Chen Zhen said: \"Jun what good drink?\"",
  "s0363": "Xi Shou said: \"No affairs.\"",
  "s0364": "Said: \"I please make jun satiate affairs acceptable?\"",
  "s0365": "Said: \"What?\"",
  "s0366": "Said: \"Tian Xu pact feudal lords alliance, Chu Wang doubt it, not trust.",
  "s0367": "Jun tell wang: Subject with Yan Zhao wang have old, several make people come, say no affairs why not see, wish report travel wang.",
  "s0368": "Wang though permit jun, jun please not many chariots, with chariots thirty, can display court, bright tell Yan Zhao.\"",
  "s0369": "Yan Zhao guests hear, gallop chariots tell their wang, make people welcome Xi Shou.",
  "s0370": "Chu Wang hear greatly angry: \"Tian Xu with I pact, Xi Shou Yan Zhao, this cheat me.\"",
  "s0371": "Angry not listen his affairs.",
  "s0372": "Qi hear Xi Shou north, make person with affairs entrust him.",
  "s0373": "Xi Shou then go, three states affairs all break Xi Shou.",
  "s0374": "Zhen then arrive Qin.",
  "s0375": "Han Wei mutually attack, one year not resolve.",
  "s0376": "Qin Hui Wang wish save them, ask left right.",
  "s0377": "Left right some say save convenient, some say not save convenient, Hui Wang not able decide.",
  "s0378": "Chen Zhen suitable arrive Qin, Hui Wang said: \"You leave my Chu, also think me not?\"",
  "s0379": "Chen Zhen reply: \"Wang hear Yue person Zhuang Xi?\"",
  "s0380": "Wang said: \"Not hear.\"",
  "s0381": "Said: \"Yue person Zhuang Xi serve Chu hold gui, some time ill.",
  "s0382": "Chu Wang said: Xi former Yue rustic person, now serve Chu hold gui, noble rich, also think Yue not?",
  "s0383": "Servant boy reply: All people think old, in their ill.",
  "s0384": "They think Yue then Yue sound, not think Yue then Chu sound.",
  "s0385": "Make people go listen, still Yue sound.",
  "s0386": "Now subject though cast away flee Chu, how can no Qin sound!\"",
  "s0387": "Hui Wang said: \"Good.",
  "s0388": "Now Han Wei mutually attack, one year not resolve, some say I save convenient, some say not save convenient, I cannot decide, wish you for you lord plan remainder, for me plan.\"",
  "s0389": "Chen Zhen reply: \"Also once have with Bian Zhuang Zi stab tiger hear wang?",
  "s0390": "Zhuang Zi wish stab tiger, inn boy stop him, said: Two tigers just eat cow, eat sweet certainly contend, contend certainly fight, fight certainly big injure small die, from injure stab him, one raise certainly have double tiger name.",
  "s0391": "Bian Zhuang Zi consider correct, stand await.",
  "s0392": "Some time, two tigers indeed fight, big injure small die.",
  "s0393": "Zhuang Zi from injure stab him, one raise indeed have double tiger merit.",
  "s0394": "Now Han Wei mutually attack, one year not resolve, certainly big state injure small state perish, from injure attack them, one raise certainly have two merit.",
  "s0395": "This still Zhuang Zi stab tiger class.",
  "s0396": "Subject jun with wang what different.\"",
  "s0397": "Hui Wang said: \"Good.\"",
  "s0398": "Finally not save.",
  "s0399": "Big state indeed injure, small state perish, Qin raise troops attack, great conquer them.",
  "s0400": "This Chen Zhen plan.",
  "s0401": "Xi Shou, Wei Yin Jin man, name Yan, surname Gong Sun.",
  "s0402": "With Zhang Yi not good.",
  "s0403": "Zhang Yi chancellor Qin Wei, Wei Wang chancellor Zhang Yi.",
  "s0404": "Xi Shou not profit, therefore make person tell Han Gong Shu: \"Zhang Yi already unite Qin Wei, his words: Wei attack Nan Yang, Qin attack San Chuan.",
  "s0405": "Wei Wang reason noble Zhang Zi, wish obtain Han land.",
  "s0406": "Moreover Han Nan Yang already raise, you why not little cede with become Yan merit, then Qin Wei alliance can wrong.",
  "s0407": "Then Wei certainly plot Qin abandon Yi, collect Han chancellor Yan.\"",
  "s0408": "Gong Shu consider convenient, because cede Xi Shou become merit.",
  "s0409": "Indeed chancellor Wei.",
  "s0410": "Zhang Yi go.",
  "s0411": "Yi Qu Jun court Wei.",
  "s0412": "Xi Shou hear Zhang Yi again chancellor Qin, harm him.",
  "s0413": "Xi Shou then tell Yi Qu Jun: \"Road far cannot again pass, please report matters.\"",
  "s0414": "Said: \"China no affairs, Qin obtain burn pick burn fen jun state;",
  "s0415": "Have affairs, Qin will light make heavy currency serve jun state.\"",
  "s0416": "After five states attack Qin.",
  "s0417": "Meet Chen Zhen tell Qin Wang: \"Yi Qu Jun, barbarian yi worthy jun, not as bribe with pacify his will.\"",
  "s0418": "Qin Wang said: \"Good.\"",
  "s0419": "Then with patterned silk thousand bolts, women hundred send Yi Qu Jun.",
  "s0420": "Yi Qu Jun call ministers plan: \"This Gong Sun Yan called?\"",
  "s0421": "Then raise troops attack Qin, greatly defeat Qin people Li Bo below.",
  "s0422": "Zhang Yi already die after, Xi Shou enter chancellor Qin.",
  "s0423": "Once wear five states chancellor seal, become pact chief.",
  "s0424": "Grand Historian said: Three Jin many power change scholars, speak alliance balance strengthen Qin generally all three Jin people.",
  "s0425": "Zhang Yi conduct affairs surpass Su Qin, yet world bad Su Qin, because he first die, Yi expose violent his short support his words, complete his balance way.",
  "s0426": "Summarize, these two people true incline danger scholars!"
}