{
  "s0001": "Grand Historian said: I read Mengzi book, to Liang Hui Wang ask 'what to benefit my state', never not put down book sigh.",
  "s0002": "Said: Alas, profit truly chaos beginning!",
  "s0003": "Master rarely speak profit, constantly guard its source.",
  "s0004": "Therefore said 'put at profit practice, many resent'.",
  "s0005": "From Son of Heaven to common people, good profit calamity how different!",
  "s0006": "Meng Ke, Zou man.",
  "s0007": "Received teaching Zi Si disciple.",
  "s0008": "Way already pass, travel serve Qi Xuan Wang, Xuan Wang not able use.",
  "s0009": "Go Liang, Liang Hui Wang not adopt his words, then see as circuitous far overlook affairs.",
  "s0010": "When this time, Qin use Shang Jun, enrich state strengthen troops;",
  "s0011": "Chu Wei use Wu Qi, battle win weaken enemy;",
  "s0012": "Qi Wei Wang Xuan Wang use Sun Zi Tian Ji kind, feudal lords east face court Qi.",
  "s0013": "World just strive unite vertical connect horizontal, consider attack invade worthy, Meng Ke then state Tang Yu three dynasties virtue, therefore where go not match.",
  "s0014": "Retire with Wan Zhang kind sequence Shi Shu, state Zhong Ni intention, make Meng Zi seven scrolls.",
  "s0015": "After have Zou Zi kind.",
  "s0016": "Qi have three Zou Zi.",
  "s0017": "Its former Zou Ji, with drum qin seek Wei Wang, because reach state affairs, seal Cheng Hou receive chancellor seal, before Meng Zi.",
  "s0018": "Its next Zou Yan, after Meng Zi.",
  "s0019": "Zou Yan observe have state increase licentious extravagant, cannot esteem virtue, if Da Ya rectify at body, apply reach black common people.",
  "s0020": "Then deep observe yin yang message make strange circuitous change, end beginning great sage scrolls ten more thousand words.",
  "s0021": "His speech vast not conventional, must first test small things, push big to boundless.",
  "s0022": "First sequence now above to Huang Di, scholars common art, greatly parallel world rise decline, because load its good fortune regulation system, push far to heaven earth not born, profound dark not examinable origin.",
  "s0023": "First list China famous mountains great rivers, pass valleys birds beasts, water soil produce, things precious, because push, reach overseas people cannot see.",
  "s0024": "Cite lead heaven earth split since, five virtues transfer, govern each suitable, symbol respond like this.",
  "s0025": "Consider Confucian called China, at world then eighty one parts occupy its one part ear.",
  "s0026": "China name Chi County Shen Zhou.",
  "s0027": "Chi County Shen Zhou inner self have nine zhou, Yu sequence nine zhou is, not can be zhou number.",
  "s0028": "China outer like Chi County Shen Zhou nine, then called nine zhou.",
  "s0029": "Then have Pi Hai surround, people birds beasts cannot intercommunicate, like one area middle, then one zhou.",
  "s0030": "Like this nine, then have great Ying Hai surround its outer, heaven earth boundary.",
  "s0031": "His art all this class.",
  "s0032": "Yet summarize its return, must stop benevolence righteousness frugality, jun chen up down six relatives application, begin also diffuse ear.",
  "s0033": "Wang gong adults first see his art, fearful look change, after cannot practice.",
  "s0034": "Therefore Zou Zi heavy at Qi.",
  "s0035": "Go Liang, Hui Wang suburban welcome, hold guest host ritual.",
  "s0036": "Go Zhao, Ping Yuan Jun side walk spread mat.",
  "s0037": "Go Yan, Zhao Wang embrace broom first drive, request arrange disciple seat receive teaching, build Jie Shi palace, body personally go teacher.",
  "s0038": "Make Zhu Yun.",
  "s0039": "His travel feudal lords see honored ritual like this, how with Zhong Ni vegetable color Chen Cai, Meng Ke distressed Qi Liang same!",
  "s0040": "Former Wu Wang with benevolence righteousness attack Zhou wang, Bo Yi starve not eat Zhou millet;",
  "s0041": "Wei Ling Gong ask array, Confucius not answer;",
  "s0042": "Liang Hui Wang plan wish attack Zhao, Meng Ke call great wang go Bin.",
  "s0043": "This how have intention flatter world casual match only!",
  "s0044": "Hold square tenon wish enter round hole, can enter?",
  "s0045": "Some say, Yi Yin carry tripod urge Tang wang, Bai Li Xi feed cow cart under Mu Gong use hegemon, make first match, then lead great way.",
  "s0046": "Zou Yan his words though not track, perhaps also have cow tripod intention?",
  "s0047": "From Zou Yan with Qi Ji Xia mister, like Chun Yu Kun, Shen Dao, Huan Yuan, Jie Zi, Tian Pian, Zou Shi kind, each write book speak govern chaos affairs, seek world lord, how can win say!",
  "s0048": "Chun Yu Kun, Qi man.",
  "s0049": "Broad hear strong memory, study no master.",
  "s0050": "His advise speak, admire Yan Ying conduct, yet accept intention observe color as duty.",
  "s0051": "Guest have see Kun at Liang Hui Wang, Hui Wang screen left right, alone sit twice see him, finally no words.",
  "s0052": "Hui Wang strange, with rebuke guest: You praise Chun Yu mister, Guan Yan not reach, reach see my person, my person not have obtain.",
  "s0053": "How my person not sufficient speak?",
  "s0054": "Why?",
  "s0055": "Guest with tell Kun.",
  "s0056": "Kun said: Indeed.",
  "s0057": "I before see wang, wang ambition in hunt;",
  "s0058": "After again see wang, wang ambition in sound voice: I therefore silent.",
  "s0059": "Guest all with report wang, wang greatly shocked: Alas, Chun Yu mister truly sage!",
  "s0060": "Before Chun Yu mister come, person have offer good horse, my person not reach see, meet mister arrive.",
  "s0061": "After mister come, person have offer singer, not reach test, also meet mister come.",
  "s0062": "My person though screen people, yet private heart at that, have.",
  "s0063": "After Chun Yu Kun see, one speech connect three days three nights no tired.",
  "s0064": "Hui Wang wish with qing chancellor position treat him, Kun because thank depart.",
  "s0065": "Then send with peace cart four horses, bundle silk add jade, gold hundred yi.",
  "s0066": "Lifetime not serve.",
  "s0067": "Shen Dao, Zhao man.",
  "s0068": "Tian Pian, Jie Zi, Qi man.",
  "s0069": "Huan Yuan, Chu man.",
  "s0070": "All study Huang Lao Dao De art, because develop explain sequence its finger intention.",
  "s0071": "Therefore Shen Dao write twelve arguments, Huan Yuan write up down scrolls, Tian Pian Jie Zi all have arguments.",
  "s0072": "Zou Shi, Qi various Zou Zi, also much collect Zou Yan art record literature.",
  "s0073": "Then Qi Wang praise it, from like Chun Yu Kun below, all name lie da fu, for open residence broad smooth road, high gate big house, honor favor.",
  "s0074": "View world feudal lords guests, speak Qi can attract world worthy scholars.",
  "s0075": "Xun Qing, Zhao man.",
  "s0076": "Year fifty start come travel study Qi.",
  "s0077": "Zou Yan art circuitous big vast debate;",
  "s0078": "Shi also literature complete difficult apply;",
  "s0079": "Chun Yu Kun long with dwell, time have obtain good words.",
  "s0080": "Therefore Qi people praise: Talk heaven Yan, carve dragon Shi, roast hub pass Kun.",
  "s0081": "Tian Pian kind all already die Qi Xiang Wang time, Xun Qing most old teacher.",
  "s0082": "Qi still repair lie da fu vacancy, Xun Qing three be Ji Jiu.",
  "s0083": "Qi people or slander Xun Qing, Xun Qing then go Chu, Chun Shen Jun make Lan Ling ling.",
  "s0084": "Chun Shen Jun die Xun Qing waste, because home Lan Ling.",
  "s0085": "Li Si once be disciple, after chancellor Qin.",
  "s0086": "Xun Qing hate muddy age govern, perish state chaos jun connect, not follow great way camp witch blessing, trust good fortune, despise Confucian small bind, like Zhuang Zhou equal moreover slippery examine chaos custom, then push Confucian Mo Dao De conduct affairs rise decline, sequence write several thousand words die.",
  "s0087": "Because bury Lan Ling.",
  "s0088": "Zhao also have Gong Sun Long make firm white same different debate, Ju Zi words;",
  "s0089": "Wei have Li Kui, exhaust land force teach;",
  "s0090": "Chu have Shi Zi, Chang Lu;",
  "s0091": "A Zhe Xu Zi.",
  "s0092": "From like Meng Zi to Xu Zi, world many have their books, therefore not discuss their biographies.",
  "s0093": "Cover Mo Di, Song da fu, good defend guard, for frugality use.",
  "s0094": "Some say together Confucius time, some say in his after."
}