{
  "s0151": "Bai Li Xi flee Qin walk Wan, Chu border person seize it.",
  "s0152": "Miao Gong hear Bai Li Xi worthy, desire heavy redeem it, fear Chu not give, then make person tell Chu said: 'My attendant minister Bai Li Xi at there, please with five Gu sheep skin redeem it.'",
  "s0153": ".",
  "s0154": "Chu person then allow with it.",
  "s0155": "When is time, Bai Li Xi year already seventy remain.",
  "s0156": "Miao Gong release its prisoner, with speak state affairs.",
  "s0157": "Thank said: 'Minister flee state minister, what sufficient ask!'",
  "s0158": "Miao Gong said: 'Yu jun not use son, therefore perish, not son crime.'",
  "s0159": "Solid ask, speak three days, Miao Gong big pleased, give it state politics, number said five Gu da fu.",
  "s0160": "Bai Li Xi yield said: 'Minister not reach minister friend Jian Shu, Jian Shu worthy yet world not know.",
  "s0161": "Minister often travel distress at Qi yet beg food at Zhi person, Jian Shu receive minister.",
  "s0162": "Minister because desire serve Qi jun Wu Zhi, Jian Shu stop minister, minister get escape Qi difficulty, then Zhou.",
  "s0163": "Zhou wang zi Dai good cow, minister with nourish cow petition it.",
  "s0164": "Reach Dai desire use minister, Jian Shu stop minister, minister go, get not punish.",
  "s0165": "Serve Yu jun, Jian Shu stop minister.",
  "s0166": "Minister know Yu jun not use minister, minister sincerely private profit salary rank, and stay.",
  "s0167": "Again use its speech, get escape, one not use, reach Yu jun difficulty: therefore know its worthy.'",
  "s0168": "Then Miao Gong make person thick currency welcome Jian Shu, become upper da fu.",
  "s0169": "Autumn, Miao Gong self will attack Jin, battle at He Qu.",
  "s0170": "Jin Li Ji make chaos, crown prince Shen Sheng die new city, Chong Er, Yi Wu exit flee.",
  "s0171": "Nine years, Qi Huan Gong meet feudal lords at Kui Qiu.",
  "s0172": "Jin Xian Gong die.",
  "s0173": "Establish Li Ji son Xi Qi, its minister Li Ke kill Xi Qi.",
  "s0174": "Xun Xi establish Zhuo Zi, Ke again kill Zhuo Zi and Xun Xi.",
  "s0175": "Yi Wu make person request Qin, seek enter Jin.",
  "s0176": "Then Miao Gong allow it, make Bai Li Xi will troops send Yi Wu.",
  "s0177": "Yi Wu tell said: 'Sincerely get establish, please cut Jin He west eight city with Qin.'",
  "s0178": "Reach arrive, already establish, yet make Pi Zheng thank Qin, back treaty not with He west city, yet kill Li Ke.",
  "s0179": "Pi Zheng hear, fear, because with Miao Gong plot said: 'Jin people not desire Yi Wu, solid desire Chong Er.",
  "s0180": "Now back Qin treaty yet kill Li Ke, all Lu Sheng, Xi Rui plan.",
  "s0181": "Wish jun with profit urgent summon Lu, Xi, Lu, Xi arrive, then change enter Chong Er convenient.'",
  "s0182": "Miao Gong allow it, make person with Pi Zheng return, summon Lu, Xi.",
  "s0183": "Lu, Xi etc doubt Pi Zheng have interval, then speak Yi Wu kill Pi Zheng.",
  "s0184": "Pi Zheng son Pi Bao flee Qin, tell Miao Gong said: 'Jin jun without way, hundred surnames not close, able attack.'",
  "s0185": "Miao Gong said: 'Hundred surnames if not convenient, why able punish its ministers?",
  "s0186": "Able punish its ministers, this its harmony.'",
  "s0187": "Not listen, yet yin use Bao.",
  "s0188": "Twelve years, Qi Guan Zhong, Xi Peng die.",
  "s0189": "Jin drought, come request grain.",
  "s0190": "Pi Bao tell Miao Gong not with, because its hunger attack it.",
  "s0191": "Miao Gong ask Gong Sun Zhi, Zhi said: 'Hunger good change affairs, not able not with.'",
  "s0192": "Ask Bai Li Xi, Xi said: 'Yi Wu get crime at jun, its hundred surnames what crime?'",
  "s0193": "Then use Bai Li Xi, Gong Sun Zhi speech, finally with it grain.",
  "s0194": "With boat cao chariot turn, self Yong relative hope reach Jiang.",
  "s0195": "Fourteen years, Qin hunger, request grain at Jin.",
  "s0196": "Jin jun plot it group ministers.",
  "s0197": "Guo She said: 'Because its hunger attack it, able have big merit.'",
  "s0198": "Jin jun follow it.",
  "s0199": "Fifteen years, raise troops will attack Qin.",
  "s0200": "Miao Gong send troops, make Pi Bao will, self go strike it."
}

