{
  "s0201": "Fan Sui already chancellor Qin, Qin called Zhang Lu, yet Wei not know, considered Fan Sui already died long.",
  "s0202": "Wei heard Qin moreover east attack Han, Wei, Wei made Xu Jia to Qin.",
  "s0203": "Fan Sui heard, as secret travel, worn clothes leisurely walked hostel, saw Xu Jia.",
  "s0204": "Xu Jia saw startled said: 'Fan Shu indeed no illness!'",
  "s0205": "Fan Sui said: 'Yes.'",
  "s0206": "Xu Jia laughed: 'Fan Shu have persuasion at Qin?'",
  "s0207": "Said: 'Not.",
  "s0208": "Sui previous got offense at Wei chancellor, thus fled escaped arrive here, dare persuade?'",
  "s0209": "Xu Jia said: 'Now uncle what matter?'",
  "s0210": "Fan Sui 'Minister for person hired labor.'",
  "s0211": "Xu Jia pitied, left with sit eat drink, said: 'Fan Shu one cold like this!'",
  "s0212": "Then took one silk robe grant him.",
  "s0213": "Xu Jia because asked: 'Qin chancellor Zhang jun, public know him?",
  "s0214": "I heard favored by king, world matters all decided by chancellor jun.",
  "s0215": "Now my matter go stay at Zhang jun.",
  "s0216": "Young child how have guest familiar with chancellor jun?'",
  "s0217": "Fan Sui said: 'Host master familiar know him.",
  "s0218": "Only Sui also get audience, Sui please for see jun at Zhang jun.'",
  "s0219": "Xu Jia said: 'My horse ill, carriage axle broke, not great carriage four horses, I certainly not out.'",
  "s0220": "Fan Sui said: 'Wish for jun borrow great carriage four horses at host master.'",
  "s0222": "Fan Sui returned took great carriage four horses, for Xu Jia drove, entered Qin chancellor residence.",
  "s0223": "Residence middle gazed, had recognize all avoided hid.",
  "s0223": "Xu Jia strange it.",
  "s0224": "Arrived chancellor dwelling gate, told Xu Jia: 'Wait me, I for jun first enter communicate at chancellor jun.'",
  "s0225": "Xu Jia waited gate under, held carriage good long, asked gate under: 'Fan Shu not out, why?'",
  "s0226": "Gate under said: 'No Fan Shu.'",
  "s0227": "Xu Jia said: 'Just now with me loaded entered.'",
  "s0228": "Gate under said: 'Then our chancellor Zhang jun.'",
  "s0229": "Xu Jia greatly startled, self knew seen sold, then bare flesh knee walk, because gate under people apologize crime.",
  "s0230": "Then Fan Sui abundant curtains tents, attendants very many, saw him.",
  "s0231": "Xu Jia knocked head spoke death crime, said: 'Jia not expect jun able self achieve azure clouds above, Jia dare not again read world books, dare not again with world matters.",
  "s0232": "Jia have boiling cauldron crime, please self screen at Hu Mo land, only jun life death!'",
  "s0233": "Fan Sui said: 'You crime have several?'",
  "s0234": "Said: 'Pluck Jia hair continue Jia crime, not yet sufficient.'",
  "s0235": "Fan Sui said: 'You crime have three only.",
  "s0236": "Formerly Chu Zhao Wang time Shen Bao Xu for Chu repelled Wu army, Chu king sealed with Jing five thousand households, Bao Xu declined not accept, for mound tomb entrust at Jing.",
  "s0237": "Now Sui ancestors mound tomb also at Wei, you before considered Sui have outer heart to Qi detested Sui at Wei Qi, you crime one.",
  "s0238": "When Wei Qi humiliated me at latrine middle, you not stop, crime two.",
  "s0239": "Moreover drunk urinated me, you how bear?",
  "s0240": "Crime three.",
  "s0241": "However you what get no die, with silk robe lingering, have old friend intent, thus released you.'",
  "s0242": "Then apologized dismissed.",
  "s0243": "Entered spoke Zhao Wang, dismissed returned Xu Jia.",
  "s0244": "Xu Jia bid farewell Fan Sui, Fan Sui great prepared utensils, all invited various lords envoys, with sat hall above, food drink very arranged.",
  "s0245": "Yet sat Xu Jia at hall below, placed bean stalks before, commanded two tattooed convicts flank horse feed him.",
  "s0246": "Scolded said: 'For me tell Wei king, urgent hold Wei Qi head come!",
  "s0247": "Not then, I moreover butcher Daliang.'",
  "s0248": "Xu Jia returned, with told Wei Qi.",
  "s0249": "Wei Qi feared, fled ran Zhao.",
  "s0250": "Hid Ping Yuan Jun place."
}