{
  "s0001": "Emperor Wu was the middle son of Emperor Jing.",
  "s0002": "His mother was Empress Wang.",
  "s0003": "Emperor Jing ascended the throne in the fourth year, established him as King of Jiaodong.",
  "s0004": "Emperor Jing ascended the throne in the seventh year, deposed Crown Prince Li as Linjiang King, established Jiaodong King as crown prince.",
  "s0005": "Emperor Jing died in the sixteenth year, the crown prince ascended the throne as Emperor Wu.",
  "s0006": "Emperor Wu initially ascended the throne, especially respected the sacrifices to ghosts and spirits.",
  "s0007": "In the first year, the Han had already risen over sixty years, the world was peaceful and secure, the scholars and nobles all hoped the emperor would perform the Feng and Shan sacrifices and change the calendar and degrees.",
  "s0008": "And the emperor tended toward Confucian learning, recruited worthy and upright, Zhao Wan, Wang Zang and others became nobles through literature, wished to discuss ancient matters to establish the Mingtang south of the city, to receive feudal lords there.",
  "s0009": "Drafting the matters of patrolling and hunting, Feng and Shan sacrifices, changing the calendar, clothes, colors had not yet been completed.",
  "s0010": "It happened that Empress Dowager Dou practiced the teachings of Huang-Lao, disliked Confucian learning, had people secretly obtain Zhao Wan and others' cases of taking bribes and favoritism, summoned and investigated Wan and Zang, Wan and Zang committed suicide, all the things they had started were abolished.",
  "s0011": "After six years, Empress Dowager Dou died.",
  "s0012": "In the next year, the emperor summoned literary scholars Gongsun Hong and others.",
  "s0013": "In the next year, the emperor first went to Yong, offered sacrifices seeing the five altars.",
  "s0014": "Afterwards, regularly once every three years offered sacrifices.",
  "s0015": "At this time the emperor sought the divine lord, placed him in the Houshi Pavilion of Shanglin Gardens.",
  "s0016": "The divine lord was a woman from Changling, who died grieving for her child, thus saw spirits in the former residences of her husband.",
  "s0017": "The residences of her husband sacrificed to her, the people greatly went to sacrifice.",
  "s0018": "The Pingyuan Lord went to sacrifice, his descendants afterwards became eminent through honor.",
  "s0019": "And when Emperor Wu ascended the throne, he richly honored and placed sacrifices in the inner court, heard his words, but did not see his person.",
  "s0020": "At this time Li Shaojun also appeared before the emperor through sacrificing to the stove, grain way, and avoiding old age methods, the emperor honored him.",
  "s0021": "Shaojun was a former descendant of the Marquis of Shenze, who served as an official.",
  "s0022": "He concealed his age and birthplace, always claimed to be seventy, could make things, avoid old age.",
  "s0023": "He traveled with his methods among the feudal lords.",
  "s0024": "Had no wife or children.",
  "s0025": "People heard he could make things and not die, moreover gave him money and goods, constantly more than enough gold and silk clothes food.",
  "s0026": "People all considered him not managing property yet wealthy, moreover did not know what he lived on, became even more convinced, contended to serve him.",
  "s0027": "Shaojun was good at methods, skillful at making extraordinary things strike the mark.",
  "s0028": "Once drank with the Marquis of Wuan, among the guests was a ninety-year-old man, Shaojun said he had shot with his grandfather's place, the old man as a child had followed his grandfather and knew the place, one table all astonished.",
  "s0029": "Shaojun saw the emperor, the emperor had an ancient bronze vessel, asked Shaojun.",
  "s0030": "Shaojun said: 'This vessel was offered in the tenth year of Duke Huan of Qi.'",
  "s0031": "Afterwards, checked its engraving, indeed Duke Huan of Qi's vessel.",
  "s0032": "One palace all terrified, considered Shaojun a divine being, several hundred years old person.",
  "s0033": "Shaojun spoke to the emperor saying: 'Sacrificing to the stove brings things, bringing things and cinnabar can be transformed into gold, gold made into drinking vessels then increases longevity, increasing longevity and the Penglai immortals in the sea can be seen, seeing them to perform Feng and Shan then does not die, the Yellow Emperor is like this.'",
  "s0034": "He said: 'I once traveled on the sea, saw Anqi Sheng, ate dates from him, large as melons.'",
  "s0035": "Anqi Sheng was an immortal, communicated with Penglai, when united then seen by people, when not united then hidden.",
  "s0036": "Thereupon the emperor began to personally sacrifice to the stove, and sent fangshi into the sea to seek Penglai Anqi Sheng and the like, and matters transformed cinnabar and such into gold began.",
  "s0037": "After a long time, Li Shaojun fell ill and died.",
  "s0038": "The emperor considered him to have transformed and gone, not dead, and had Huang Hammer official Kuan Shu receive his methods.",
  "s0039": "Seeking Penglai Anqi Sheng could not be obtained, and the fangshi of Yan and Qi between the seas more imitated each other, again spoke of divine matters.",
  "s0040": "The man from Bo, Bo Jiyi, memorialized sacrificing to Taiyi by one method, saying: 'Heavenly gods honor Taiyi, Taiyi's assistant is called the five emperors.'",
  "s0041": "Ancient kings with spring and autumn sacrificed to Taiyi in the southeast suburb, used great livestock tools, seven days, made altar opened eight paths for ghosts.",
  "s0042": "Thereupon the emperor ordered the Supreme Scribe establish his sacrifice in the southeast suburb of Chang'an, constantly honored sacrifice as Jiyi's method.",
  "s0043": "Afterwards people submitted memorials saying 'Ancient kings three years used great livestock tools sacrificed to gods three: heaven one, earth one, Taiyi one'.",
  "s0044": "The emperor approved, ordered the Supreme Scribe lead sacrifice to Jiyi's Taiyi altar above, as his method.",
  "s0045": "Afterwards people again submitted memorials saying 'Ancient kings constantly with spring and autumn redeemed sacrifices, sacrificed to the Yellow Emperor used one owl broken mirror; sacrificed to the underworld sheep used sheep; sacrificed to horse travel used one azure stallion; sacrificed to Taiyi, Gaoshan mountain lord, earth long used cattle; sacrificed to Wuyi lord used dried fish; sacrificed to yin yang messengers used one cattle'.",
  "s0046": "Ordered sacrifice officials lead as their method, and sacrificed at Jiyi's Taiyi altar side.",
  "s0047": "Afterwards the emperor's gardens had a white deer, used its skin as currency, to respond to auspicious omens, made white gold.",
  "s0048": "In the next year, sacrificed at Yong, obtained a one-horned beast, like a deer.",
  "s0049": "The officials said: 'Your Majesty solemnly performed suburban sacrifices, heaven bestowed reward, gave one-horned beast, probably a unicorn.'",
  "s0050": "Thereupon added one cattle to burn at the five altars.",
  "s0051": "Granted white gold to the feudal lords, to respond to symbols fitting heaven and earth.",
  "s0052": "Then Jibei King considered the emperor about to perform Feng and Shan, submitted a memorial offering Mount Tai and its surrounding counties.",
  "s0053": "The emperor received it, compensated with other counties.",
  "s0054": "Changshan King had crimes, moved, the emperor enfeoffed his younger brother at Zhending, to continue the former king's sacrifices, and made Changshan a commandery.",
  "s0055": "Then the five peaks all were in the emperor's commanderies.",
  "s0056": "In the next year, the man from Qi Shao Weng appeared before the emperor with ghost and spirit methods.",
  "s0057": "The emperor had a favored Lady Wang, the lady died, Shao Weng with his methods at night caused Lady Wang and the stove ghost to appear, the emperor from within the curtains saw them.",
  "s0058": "Thereupon then appointed Shao Weng as Literary General, rewards very many, treated him with guest rites.",
  "s0059": "Literary General said: 'The emperor wishes to communicate with spirits, the palace chambers and clothes do not resemble spirits, spirit objects will not arrive.'",
  "s0060": "Then made cloud air carriage, and each chose auspicious days drove carriages to avoid evil ghosts.",
  "s0061": "Also made Ganquan Palace, in the middle made terrace rooms, painted heaven, earth, Taiyi various gods, and placed sacrificial tools to bring heavenly gods.",
  "s0062": "After more than a year, his methods increasingly declined, spirits did not arrive.",
  "s0063": "Then made a cloth book fed to cattle, pretended not to know, said this cattle's belly had a strange thing.",
  "s0064": "Killed and examined it, obtained the book, the book spoke of his strange matters, the emperor suspected it.",
  "s0065": "Had someone recognize his handwriting, asked the person, indeed was forged book.",
  "s0066": "Thereupon executed Literary General while concealing it.",
  "s0067": "Afterwards then again made Bai Liang, copper pillars, immortal person palm them and such.",
  "s0068": "Literary General died the next year, the emperor fell ill at Ding Lake severely, witch doctors all were sent, could not be healed.",
  "s0069": "You Shui Gen said: 'In Shangjun there is a witch, fell ill and ghosts descended.'",
  "s0070": "The emperor summoned and placed sacrifices at Ganquan.",
  "s0071": "And when ill, had people ask the divine lord.",
  "s0072": "The divine lord said: 'The emperor has no worry about illness.'",
  "s0073": "The illness will slightly recover, strongly with me meet at Ganquan.'",
  "s0074": "Thereupon the illness recovered, then visited Ganquan, the illness completely well.",
  "s0075": "Great pardon the world, established Shou Palace divine lord.",
  "s0076": "The divine lord most noble was Taiyi, his assistants were called Da Jin, Si Ming and the like, all followed him.",
  "s0077": "Could not be seen, heard his sound, equal to speaking with people.",
  "s0078": "Sometimes went, sometimes came, when came the wind whirled.",
  "s0079": "Lived in chambers and curtains.",
  "s0080": "Sometimes spoke by day, but often by night.",
  "s0081": "The emperor purified, then entered.",
  "s0082": "Because the witch acted as host, controlled diet.",
  "s0083": "What he desired spoke and went down.",
  "s0084": "Also established Shou Palace, Beigong, spread feather flags, set sacrificial tools, to honor the divine lord with rites.",
  "s0085": "The divine lord's words, the emperor had people receive and record his words, named it 'painting method'.",
  "s0086": "His words were common knowledge among the world, had no extraordinary strangeness, yet the emperor alone delighted.",
  "s0087": "His matters were secret, the world did not know.",
  "s0088": "After three years, the officials said Yuan should be named with heavenly omens, not with one two numbers.",
  "s0089": "One yuan said 'Build Yuan', two yuan with long star said 'Yuan Guang', three yuan with suburban one-horned beast said 'Yuan Shou' and so on.",
  "s0090": "In the next year winter, the emperor offered sacrifices at Yong, discussed saying: 'Now I personally offer sacrifices to heaven, but after earth there is no sacrifice, the rites are not answered.'",
  "s0091": "The officials and Taishi Gong, sacrifice official Kuan Shu and others discussed: 'Heaven and earth sacrificial victims are curled horns, now your majesty personally sacrifices to Houtu, Houtu should be at a round altar of five in the marshes for five altars, altar one yellow calf great livestock tools, after sacrifice all buried, and from sacrifice clothes wore yellow.'",
  "s0092": "Thereupon the emperor went east, first established Houtu sacrifice at the Fen River bend above, as Kuan Shu and others discussed.",
  "s0093": "The emperor personally looked and bowed like heaven's rites.",
  "s0094": "Rites finished, the emperor went to Chengyang and returned.",
  "s0095": "Passed Luoyang, issued edict saying: 'Three dynasties are distant, far away hard to preserve.'",
  "s0096": "With thirty li land enfeoff Zhou descendants as Zhou Zi Nan Jun, to honor former king's sacrifices.",
  "s0097": "This year, the emperor first patrolled the commanderies and counties, approached Mount Tai.",
  "s0098": "In spring, Yuecheng Marquis submitted memorial about Luan Da.",
  "s0099": "Luan Da, Jiaodong palace person, formerly together with Literary General studied, then became Jiaodong King servant of rare things.",
  "s0100": "And Yuecheng Marquis' sister was Kang Wang's queen, had no son.",
  "s0101": "Kang Wang died, other consort's son established as king.",
  "s0102": "And Kang Queen had lewd conduct, with the king did not get along, endangered each other with law.",
  "s0103": "Kang Queen heard Literary General already died, wished to flatter the emperor herself, sent Luan Da through Yuecheng Marquis to seek to see and speak of methods.",
  "s0104": "The emperor had executed Literary General, afterwards regretted his early death, missed his methods not complete, and saw Luan Da, greatly delighted.",
  "s0105": "Da was a person long and beautiful, spoke many strategies, dared to speak greatly, treated not doubtfully.",
  "s0106": "Da said: 'I often come and go on the sea, saw Anqi, Menmen and the like.'",
  "s0107": "Feared I was lowly, did not believe me.'",
  "s0108": "Also said 'Kang Wang was a feudal lord, not worth giving methods.'",
  "s0109": "I often spoke to Kang Wang, Kang Wang also did not use me.",
  "s0110": "My teacher said: \"Gold can be made, and the Yellow River can be blocked, immortal medicine can be obtained, immortals can be brought.\"",
  "s0111": "I feared imitating Literary General, then fangshi all covered their mouths, dared not speak of methods!'",
  "s0112": "The emperor said: 'Literary General ate horse liver and died.'",
  "s0113": "You truly can cultivate his methods, I have no love for it!'",
  "s0114": "Da said: 'My teacher was not seeking people, people sought him.'",
  "s0115": "The emperor must desire to bring him, then honor his envoys, let have relatives, treat with guest rites, do not belittle, make each wear his trusted seal, then can make communicate with divine people.",
  "s0116": "Divine people still willing or unwilling.'",
  "s0117": "Will honor his envoys, then can bring.'",
  "s0118": "Thereupon the emperor made first verify small methods, fighting flags, flags touched each other.",
  "s0119": "At this time the emperor worried about Yellow River flooding, and gold not made, appointed Da as Five Profits General.",
  "s0120": "After more than a month, obtained four gold seals, wore Heaven's Earth General, Big General, Great General, Heaven's Way General seals.",
  "s0121": "Edict Imperial Secretary: 'Formerly Yu dredged nine rivers, cut four seas.'",
  "s0122": "Recently Yellow River overflowed Gaolu, dikes not ceased.'",
  "s0123": "I govern the world twenty-eight years, heaven if bestowed I earth then great pass.'",
  "s0124": "Gan says 'flying dragon', 'gradually to Ban', hoped somewhat with it.'",
  "s0125": "With two thousand households enfeoff earth general Da as Yue Tong Marquis.'",
  "s0126": "Granted noble's house, concubines one thousand.",
  "s0127": "Imperial carriage gave away chariots carriages curtains accounts utensils to fill his house.",
  "s0128": "Also married Changchang Princess to him, gave gold ten thousand jin, changed his county name to Dangli Princess.",
  "s0129": "The emperor personally went to Five Profits' house.",
  "s0130": "Envoys visited what given, connected on the roads.",
  "s0131": "From Da's main subordinates and generals below, all set wine in his house, offered gifts.",
  "s0132": "Then the emperor again engraved jade seal saying 'Heaven's Way General', sent envoys wore feather clothes, night stood on white reed above, Five Profits General also wore feather clothes, stood on white reed above received seal, to show not subject.",
  "s0133": "And wearing 'Heaven's Way', moreover for emperor paved way to heavenly gods.",
  "s0134": "Then Five Profits often night sacrificed in his house, wished to bring down spirits.",
  "s0135": "Spirits did not arrive and hundred ghosts gathered, yet could somewhat make them.",
  "s0136": "Afterwards prepared travel, east entered sea, sought his teacher.",
  "s0137": "Da saw several months, wore six seals, noble shook the world, and Yan Qi between the seas none not grasped and claimed had forbidden methods, could divine immortals.",
  "s0138": "In summer sixth month, Fenyin witch Jin for common people sacrificed Wei bend Houtu beside camp, saw earth like hook shape, dug examined obtained tripod.",
  "s0139": "Tripod greatly different from common tripods, pattern engraved without inscription, strange it, reported to officials.",
  "s0140": "Officials reported Hedong governor Sheng, Sheng reported to emperor.",
  "s0141": "The emperor sent envoys verified Jin obtained tripod without fraud, then with rites offered sacrifice, welcomed tripod to Ganquan, followed travel, above offered it.",
  "s0142": "To Zhongshan, warmed food, had yellow cloud cover above.",
  "s0143": "Had deer pass, emperor personally shot it, because sacrificed to cloud.",
  "s0144": "To Chang'an, dukes and ministers all discussed requesting honor precious tripod.",
  "s0145": "The emperor said: 'Recently Yellow River overflowed, years several not harvested, thus patrolled sacrificed Houtu, prayed for people to grow grain.'",
  "s0146": "This year plentiful not yet had report, tripod for what came?'",
  "s0147": "The officials all said: 'Heard formerly great emperor rose divine tripod one, one was one unification, heaven and earth myriad things' final end.'",
  "s0148": "Yellow Emperor made precious tripod three, resembled heaven man earth.'",
  "s0149": "Yu received nine shepherds' metal, cast nine tripods, all once cooked for emperor ghosts gods.'",
  "s0150": "Met sage then rose, moved to Xia Shang.'",
  "s0151": "Zhou virtue declined, Song's society lost, tripods then sank and not seen.'",
  "s0152": "Ode says 'from hall to base, from sheep to cattle; tripod cauldron and ding, not worry not fear, whose good fortune'.'",
  "s0153": "Now tripod came to Ganquan, luster dragon changed, sustained good fortune without end.'",
  "s0154": "Joined this Zhongshan, had yellow white clouds descend cover, if beasts as symbol, bow arrow multiplied shot, gathered altar below, reported sacrifice great feast.'",
  "s0155": "Received then emperor's heart knew its intention and fitted virtue.'",
  "s0156": "Tripod should be seen at ancestral temple, stored in imperial court, to fit bright response.'",
  "s0157": "Edict said: 'Approved.'",
  "s0158": "Those entering sea seeking Penglai spoke Penglai not far, yet could not reach, probably did not see its vapors.",
  "s0159": "The emperor then sent hope vapors assistant Hou observed its vapors clouds.",
  "s0160": "This autumn, emperor visited Yong, and offered sacrifices.",
  "s0161": "Or said 'Five Emperors, Taiyi's assistants.'",
  "s0162": "Should establish Taiyi and emperor personally offer sacrifices to him.",
  "s0163": "The emperor doubted undecided.",
  "s0164": "The man from Qi Gongsun Qing said: 'This year obtained precious tripod, its winter Xinsi new moon dawn winter solstice, equal to Yellow Emperor time.'",
  "s0165": "Qing had bamboo book saying: 'Yellow Emperor obtained precious tripod Wan Hou, asked Guiyu Qu.'",
  "s0166": "Qu replied: 'Emperor obtained divine omen, this year Ji Chou new moon dawn winter solstice, obtained heaven's order, ended and began again.'",
  "s0167": "Then Yellow Emperor welcomed day pushed omen, after led twenty years obtained new moon dawn winter solstice, altogether twenty pushes, three hundred eighty years.'",
  "s0168": "Yellow Emperor ascended to heaven.'",
  "s0169": "Qing wished to present it accordingly.",
  "s0170": "What was loyal examined his book not orthodox, suspected his wild book, apologized saying: 'Precious tripod matter already decided, moreover what to do!'",
  "s0171": "Qing through favored person presented it.",
  "s0172": "The emperor greatly delighted, summoned asked Qing.",
  "s0173": "Replied saying: 'Received this book Shen Gong, Shen Gong already died.'",
  "s0174": "The emperor said: 'Shen Gong what person?'",
  "s0175": "Qing said: 'Shen Gong, Qi person.'",
  "s0176": "With Anqi Sheng communicated, received Yellow Emperor words, no book, only this tripod book.'",
  "s0177": "Said 'Han rose again when Yellow Emperor time.'",
  "s0178": "Han holy in high emperor's grandson and great-grandson.'",
  "s0179": "Precious tripod came out and communicated with spirits, performed Feng Shan.'",
  "s0180": "Feng Shan seven twelve kings, only Yellow Emperor ascended Mount Tai Feng.'",
  "s0181": "Shen Gong said: 'Han lord also should ascend Feng, ascend Feng then can ascend heaven immortally.'",
  "s0182": "Yellow Emperor time ten thousand feudal lords, yet divine spirits Feng place seven thousand.'",
  "s0183": "World famous mountains eight, and three in Man Yi, five in central states.'",
  "s0184": "Central states Hua Shan, Shou Shan, Tai Shi, Mount Tai, Donglai, this five mountains Yellow Emperor often toured, with spirits met.'",
  "s0185": "Yellow Emperor and fought and learned immortals.'",
  "s0186": "Suffered people not his way, then beheaded cut non ghosts spirits.'",
  "s0187": "One hundred more years then obtained communicate with spirits.'",
  "s0188": "Yellow Emperor offered sacrifices at Yong to heaven emperor, stayed three months.'",
  "s0189": "Guiyu Qu numbered great swan, died buried Yong, hence swan tomb is.'",
  "s0190": "His later at Yellow Emperor connected ten thousand spirits bright court.'",
  "s0191": "Bright court was Ganquan.'",
  "s0192": "So-called cold gate was valley mouth.'",
  "s0193": "Yellow Emperor gathered Shou Shan copper, cast tripod Jing Shan below.'",
  "s0194": "Tripod finished, had dragon hung beard lowered welcomed Yellow Emperor.'",
  "s0195": "Yellow Emperor rode on, group ministers back palace from rode dragon seventy more people, went up.'",
  "s0196": "Remaining small ministers could not go up, all held dragon beard, dragon beard pulled, fell Yellow Emperor's bow.'",
  "s0197": "People gazed Yellow Emperor already gone up heaven, embraced his bow and dragon beard wailed.'",
  "s0198": "Hence later generations because named its place Ding Lake, his bow called Wu Hao.'",
  "s0199": "Thereupon the emperor said: 'Alas!'",
  "s0200": "My truly obtain like Yellow Emperor, I regard abandoning wife children as removing shoes.'",
  "s0201": "Appointed Qing as lang, east sent to await spirits at Tai Shi.",
  "s0202": "The emperor went to Yong, to Longxi, west ascended Kongtong, visited Ganquan.",
  "s0203": "Ordered sacrifice officials Kuan Shu and others prepared Taiyi sacrifice altar, altar imitated Bo Ji Taiyi altar, altar three levels.",
  "s0204": "Five Emperors altars surrounded lived below, Yellow Emperor southwest, except eight paths ghost way.",
  "s0205": "Taiyi used as Yong one altar objects, and added sweet dates dried meat and such, killed one black cattle as sacrificial stand livestock tools.",
  "s0206": "And Five Emperors alone had sacrificial stand sweet wine advanced.",
  "s0207": "Its below four directions earth for satiation food group gods from and Big Dipper.",
  "s0208": "After sacrificed, remaining all burned.",
  "s0209": "Its cattle color white, deer in middle, pig in deer, water and soaked it.",
  "s0210": "Sacrificed sun with cattle, sacrificed moon with sheep pig special.",
  "s0211": "Taiyi sacrificer priest then wore purple and embroidered.",
  "s0212": "Five Emperors each as their color, sun red, moon white.",
  "s0213": "Eleventh month Xinsi new moon dawn winter solstice, emperor began offered sacrifices bowed to Taiyi.",
  "s0214": "Dawn bowed sun, dusk bowed moon, then saluted; saw Taiyi like Yong rites.",
  "s0215": "His feast sacrifice said: 'Heaven again bestowed emperor Taiyuan divine omen, new moon and new moon, ended and began again, emperor respectfully bowed saw.'",
  "s0216": "And wore yellow above.",
  "s0217": "His sacrifice listed fire full altar, altar side cooked boiled had utensils.",
  "s0218": "Officials said 'sacrifice had light above'.",
  "s0219": "Dukes and ministers said 'emperor began offered sacrifices saw Taiyi Yunyang, officials presented jade good livestock offered sacrifice.'",
  "s0220": "This night had beautiful light, and day, yellow air went up connected heaven.'",
  "s0221": "Taishi Gong, sacrifice official Kuan Shu and others said: 'Divine spirits good fortune blessing prosperity auspicious omens, should because this land light domain established Tai altar to manifest response.'",
  "s0222": "Made Supreme Scribe lead, autumn and winter between sacrificed.'",
  "s0223": "Three years emperor one offered sacrifices saw.'",
  "s0224": "This autumn, for attacking Nanyue, announced prayed Taiyi, with mule painted banner day moon Big Dipper ascended dragon, to resemble heaven one three stars, named 'spirit banner'.",
  "s0225": "For troops prayed, then Taishi held to point attacked country.",
  "s0226": "And Five Profits General dared not enter sea, went to Mount Tai sacrificed.",
  "s0227": "Emperor sent people secretly followed verified, solid no seen.",
  "s0228": "Five Profits falsely said saw his teacher, his methods all not corresponded.",
  "s0229": "Emperor then executed Five Profits.",
  "s0230": "This winter, Gongsun Qing awaited spirits Henan, saw immortal traces Gou Shi city on, had thing like pheasant, came and went city on.",
  "s0231": "Emperor personally visited Gou Shi city viewed traces.",
  "s0232": "Asked Qing: 'Did not imitate Wen Cheng, Five Profits?'",
  "s0233": "Qing said: 'Immortals not seek ruler, ruler seeks them.'",
  "s0234": "Their way not slightly wide false, spirits not come.'",
  "s0235": "Said divine matters, matters like absurd far, accumulated years then can obtain.'",
  "s0236": "Thereupon commanderies states each except roads, repaired palaces observatories famous mountains spirits sacrifices hoped lucky.",
  "s0237": "This year, already extinguished Nanyue, emperor had favored minister Li Yanyan with good sound saw.",
  "s0238": "Emperor good him, below dukes and ministers discussed, said: 'People sacrifices still have drum dance music, now suburban sacrifices and no music, how fitting?'",
  "s0239": "Dukes and ministers said: 'Ancient sacrificed heaven earth all had music, while divine spirits could be honored with rites.'",
  "s0240": "Or said: 'Tai Emperor made Su Nu drum fifty stringed lute, grieved, emperor forbade not stop, hence broke his lute as twenty five strings.'",
  "s0241": "Thereupon extinguished Nanyue, prayed sacrificed Taiyi, Houtu, began used music dance, moreover summoned song children, made twenty five strings and konghou lute from this began.",
  "s0242": "His next year winter, emperor discussed saying: 'Ancient first shook arms marshes traveled, then performed Feng Shan.'",
  "s0243": "Then went north patrolled Shuofang, restrained soldiers over ten thousand, returned sacrificed Yellow Emperor tomb Qiaoshan, exercised soldiers Xu Ru.",
  "s0244": "Emperor said: 'I heard Yellow Emperor not die, now has tomb, what is?'",
  "s0245": "Or replied: 'Yellow Emperor already ascended heaven, group ministers buried his clothes hat.'",
  "s0246": "Then to Ganquan, wished use matter Mount Tai first similar sacrificed Taiyi.",
  "s0247": "From obtained precious tripod, emperor with dukes and ministers scholars discussed Feng Shan.",
  "s0248": "Feng Shan used rare far apart, not know its rites ceremony, while group scholars gathered Feng Shan Shangshu, Zhou Guan, Wang Zhi hope sacrifice shooting cow matters.",
  "s0249": "Qi man Ding Gong ninety more years, said: 'Feng is unite not die name.'",
  "s0250": "Emperor must desire ascend, gradually ascend then no wind rain, ascended Feng.'",
  "s0251": "Emperor upon ordered group scholars studied shooting cow, drafted Feng Shan rites.",
  "s0252": "Several years, to about go.",
  "s0253": "Emperor already heard Gongsun Qing and fangshi words, Yellow Emperor above performed Feng Shan, all brought strange things communicated with spirits, wished imitated Yellow Emperor tried connected immortal people Penglai earth high world compared virtue to nine kings, while much gathered Confucian learning to civilize it.",
  "s0254": "Group scholars already could not clearly explain Feng Shan matters, moreover constrained by poetry books ancient literature dared not gallop.",
  "s0255": "Emperor made Feng sacrifice utensils showed group scholars, group scholars or said 'not same as ancient', Xu Qian again said 'Grand Scribe various scholars performed rites not good as Lu', Zhou Ba belonged to picture Feng matters, then emperor demoted Qian, Ba, altogether dismissed group scholars not used.",
  "s0256": "Third month, went east to Gou Shi, rites ascended central peak Tai Shi.",
  "s0257": "From officials in mountain below heard if spoke 'ten thousand years'.",
  "s0258": "Asked emperor, emperor not speak; asked below, below not speak.",
  "s0259": "Then with three hundred households enfeoffed Tai Shi honored sacrifice, named Chonggao county.",
  "s0260": "East ascended Mount Tai, mountain grass trees leaves not born, made people ascended stone stood Mount Tai peak.",
  "s0261": "Emperor went east patrolled sea, rites sacrificed eight gods.",
  "s0262": "Qi people ascended book spoke divine strange extraordinary methods with ten thousand numbers, yet none verified.",
  "s0263": "Moreover sent ships, ordered spoke sea divine mountains many thousand people sought Penglai divine people.",
  "s0264": "Gongsun Qing held tally constantly first awaited famous mountains, to Donglai, said night saw person, long several zhang, approached then not seen, saw his traces very large, resembled bird beast.",
  "s0265": "Group ministers had said saw old father led dog, said 'I want see great duke', suddenly not seen.",
  "s0266": "Emperor saw great traces, not believed, and group ministers had said old father, then greatly considered immortal person.",
  "s0267": "Lodged stayed sea, with fangshi carriage and between sent sought immortal people thousand numbers.",
  "s0268": "Fourth month, returned to Fenggao.",
  "s0269": "Emperor thought group scholars and fangshi spoke Feng Shan each different, not orthodox, hard implement.",
  "s0270": "Emperor to Liangfu, rites sacrificed earth lord.",
  "s0271": "On Yimao day, ordered attendants Confucianists skin hat ribbon, shot cow performed matters.",
  "s0272": "Feng Mount Tai below east side, like suburban sacrificed Taiyi rites.",
  "s0273": "Feng wide two zhang, high nine chi, its below then had jade book, book secret.",
  "s0274": "Rites finished, emperor alone with attendants carriage Hou ascended Mount Tai, also had Feng.",
  "s0275": "Its matters all forbidden.",
  "s0276": "Next day, descended Yin path.",
  "s0277": "On Bingyin day, Shan Mount Tai below northwest Xu Ran mountain, like sacrificed Houtu rites.",
  "s0278": "Emperor all personally bowed saw, wore yellow above all used music.",
  "s0279": "Yangtze Huai between one thatch three backs for divine mat.",
  "s0280": "Five colors earth added mixed Feng.",
  "s0281": "Far sent foreign strange beasts flying birds and white pheasants various things, somewhat added sacrificed.",
  "s0282": "Zhi旄 cattle rhinoceros elephant the like not used.",
  "s0283": "All to Mount Tai then went.",
  "s0284": "Feng Shan sacrificed, its night if had light, day had white cloud rose Feng in.",
  "s0285": "Emperor from Feng Shan returned, sat bright hall, group ministers again ascended long life.",
  "s0286": "Then edict Imperial Secretary: 'I with minute body undertake supreme, tremble feared not bear.'",
  "s0287": "Virtue thin unclear rites music.'",
  "s0288": "Sacrificed Taiyi, if had image light, minced like had hoped, depended on strange things, wished stop dared not, ascended Feng Mount Tai, to Liangfu, after Shan Xu Ran.'",
  "s0289": "Renewed, good with officials people began anew, granted people hundred households cattle one wine ten stone, added year eighty widowed orphaned cloth twenty feet.'",
  "s0290": "Re Bo, Fenggao, Snake Hill, Lucheng, without paid this year rent.'",
  "s0291": "Its pardon world, as Yimao pardon order.'",
  "s0292": "Travel passed without had re construction.'",
  "s0293": "Matters in two years before, all not listen govern.'",
  "s0294": "Also issued edict said: 'Ancient emperor five years one patrolled, used matter Mount Tai, feudal lords had court stay ground.'",
  "s0295": "Its ordered feudal lords each repaired Mount Tai below.'",
  "s0296": "Emperor already performed Feng Shan Mount Tai, no wind rain disaster, and fangshi again said Penglai various divine mountains if could obtain, then emperor delighted hoped meet it, went east to sea hoped meet Penglai.",
  "s0297": "Feng carriage Hou sudden illness, one day died.",
  "s0298": "Emperor went to go, and sea, north to Zhishi, patrolled from Liaoxi, traversed north border to Jiuyuan.",
  "s0299": "Fifth month, returned to Ganquan.",
  "s0300": "Officials said precious tripod came as Yuan Ding, with this year as Yuan Feng first year.",
  "s0301": "Its autumn, had star brushed east well.",
  "s0302": "After ten more days, had star brushed three able.",
  "s0303": "Hope vapors Wang Shuo said: 'Waited alone saw its star came out like gourd, ate moment again entered.'",
  "s0304": "Officials said: 'Emperor established Han Feng Shan, heaven its repaid virtue star cloud.'",
  "s0305": "Its next year winter, suburban Yong five emperors, returned bowed sacrificed Taiyi.",
  "s0306": "Feasted said: 'Virtue star shone extended, its dimension good fortune auspicious.'",
  "s0307": "Longevity star again came out, deep shone bright.'",
  "s0308": "Faith star shone appeared, emperor respectfully bowed Tai prayed feast.'",
  "s0309": "And wore yellow above.",
  "s0310": "Its spring, Gongsun Qing said saw divine person Donglai mountain, if 'saw emperor'.",
  "s0311": "Emperor to Gou Shi city, bowed Qing as Zhongda Fu.",
  "s0312": "Went to Donglai, lodged stayed several days, no seen, saw great person traces.",
  "s0313": "Again sent fangshi sought divine strange gathered fungus medicine thousand numbers.",
  "s0314": "This year drought.",
  "s0315": "Then emperor already came out no name, prayed ten thousand li sand, passed sacrificed Mount Tai.",
  "s0316": "Returned to Hulu, personally supervised blocked Yellow River, stayed two days, sank sacrificed went.",
  "s0317": "Sent two envoys led soldiers blocked Yellow River, Yellow River moved two canals, recovered Yu's old traces.",
  "s0318": "At this time already extinguished Nanyue, Yue people Yong admonished said 'Yue customs believe ghosts, and their sacrifices all see ghosts, several effective.'",
  "s0319": "Formerly Dong'ou king honored ghosts, longevity to one hundred sixty years.'",
  "s0320": "Later generations lax, hence declined weakened.'",
  "s0321": "Ordered Yue witches established Yue prayers, calmed platform no altar, also sacrificed heaven god hundred ghosts, and used chicken divination.",
  "s0322": "Emperor believed it, Yue prayers chicken divination from this began used.",
  "s0323": "Gongsun Qing said: 'Immortals can be seen, and emperor came often hasty, hence not seen.'",
  "s0324": "Now emperor can make pavilion like Gou Shi city, placed dried meat dates, divine people should be able brought.'",
  "s0325": "And immortals good tower residence.'",
  "s0326": "Then emperor ordered Chang'an then made flying eaves Gui pavilion, Ganquan then made Yi Shou pavilion, made Qing held tally set tools awaited divine people, made Tongtian stage, placed sacrifice tools its below, wished attract divine immortal kind.",
  "s0327": "Then Ganquan changed front hall, began broadened various palace chambers.",
  "s0328": "Summer, had fungus born hall defense inner.",
  "s0329": "Emperor for blocked Yellow River, rose Tongtian stage, if had light clouds, issued edict said: 'Ganquan defense born fungus nine stems, pardon world, no had re construction.'",
  "s0330": "Its next year, attacked Goguryeo.",
  "s0331": "Summer, drought.",
  "s0332": "Gongsun Qing said: 'Yellow Emperor time performed Feng then heaven drought, dry Feng three years.'",
  "s0333": "Emperor issued edict said: 'Heaven drought, intention dry Feng?'",
  "s0334": "Its ordered world honored sacrificed spirit star.'",
  "s0335": "Its next year, emperor suburban Yong, through Hui back road, patrolled it.",
  "s0336": "Spring, to Mingze, from west river returned.",
  "s0337": "Its next year winter, emperor patrolled south commandery, to Jiangling east.",
  "s0338": "Ascended rites submerged heaven pillar mountain, honored said Nanyue.",
  "s0339": "Floated Yangtze, from Xunyang came out Congyang, passed Pengli, sacrificed its name mountains rivers.",
  "s0340": "North to Langye, and sea.",
  "s0341": "Fourth month, to Fenggao repaired Feng.",
  "s0342": "Early, emperor Feng Mount Tai, Mount Tai east north foot ancient had bright hall place, place dangerous not flat.",
  "s0343": "Emperor wished treated bright hall Fenggao side, not clear its structure.",
  "s0344": "Jinan man Gong Tu belt submitted Yellow Emperor time bright hall picture.",
  "s0345": "Bright hall picture middle had one hall, four sides no walls, with thatch covered, through water, round palace wall as compound way, upper had tower, from southwest entered, named Kunlun, emperor from it entered, bowed sacrificed heaven emperor.",
  "s0346": "Then emperor ordered Fenggao made bright hall Wen above, like belt picture.",
  "s0347": "And five years repaired Feng, sacrificed Taiyi, five emperors at bright hall upper seat, ordered high emperor sacrificed seat opposite it.",
  "s0348": "Sacrificed Houtu at lower house, with twenty great livestock.",
  "s0349": "Emperor from Kunlun way entered, began bowed bright hall like suburban rites.",
  "s0350": "Rites finished, burned hall below.",
  "s0351": "And emperor again ascended Mount Tai, had secret sacrifice its peak.",
  "s0352": "And Mount Tai below sacrificed five emperors, each as their direction, Yellow Emperor and Red Emperor, and officials attended sacrificed.",
  "s0353": "Mount Tai upper raised fire, below all responded it.",
  "s0354": "Its later two years, eleventh month Jiazi new moon dawn winter solstice, pushed calendar with this system.",
  "s0355": "Emperor personally to Mount Tai, with eleventh month Jiazi new moon dawn winter solstice day sacrificed heaven emperor bright hall, each repaired Feng Shan.",
  "s0356": "Its feasted said: 'Heaven increased bestowed emperor Taiyuan divine omen, week and repeated, ended and began again.'",
  "s0357": "Emperor respectfully bowed Taiyi.'",
  "s0358": "East to sea, examined entered sea and fangshi sought divine verified none, yet increased sent, hoped encounter it.",
  "s0359": "Eleventh month Yiyou, Bailiang disaster.",
  "s0360": "Twelfth month Jiawu new moon, emperor personally Shan Gaoli, sacrificed Houtu.",
  "s0361": "Viewed Bohai, wished sacrifice Penglai kind, hoped to special court.",
  "s0362": "Emperor returned, with Bailiang disaster reason, court received account Ganquan.",
  "s0363": "Gongsun Qing said: 'Yellow Emperor approached green spirit platform, twelve days burned, Yellow Emperor made bright court.'",
  "s0364": "Bright court, Ganquan.'",
  "s0365": "Fangshi many said ancient emperor king had capital Ganquan.",
  "s0366": "Its later emperor again court feudal lords Ganquan, Ganquan made feudal lords lodges.",
  "s0367": "Yong admonished said: 'Yue customs have fire disaster, repeat rise house must with big, used overcome it.'",
  "s0368": "Then made Jianzhang palace, measured as thousand gates ten thousand households.",
  "s0369": "Front hall measured high not Weiyang, its east Fengque, high over twenty zhang.",
  "s0370": "Its west Tangzhong, several ten li tiger circle.",
  "s0371": "Its north treated big pool, gradual platform high over twenty zhang, named Taiye pool, middle had Penglai, Fangzhang, Yingzhou, Hulu, resembled sea divine mountain turtle fish kind.",
  "s0372": "Its south had Yutang, Bi men, big bird kind.",
  "s0373": "Established divine bright tower, Jinggan building, measured fifty over zhang, carriage way mutually connected.",
  "s0374": "Summer, Han changed calendar, with first month as year head, while color upper yellow, official name changed seals with five characters.",
  "s0375": "Because too first year.",
  "s0376": "This year, west attacked Dayuan.",
  "s0377": "Locusts great arose.",
  "s0378": "Ding wife, Luoyang Yu Chu and others with methods sacrificed cursed Xiongnu, Dayuan.",
  "s0379": "Its next year, officials said Yong five altars no livestock mature fragrance not prepared.",
  "s0380": "Ordered sacrifice officials advanced altar calves livestock tools, five colors food what overcome, and with wood horse replaced foal.",
  "s0381": "Only five emperors used foal, walked close suburban used foal.",
  "s0382": "And various famous mountains rivers used foal places, all with wood horse replaced.",
  "s0383": "Walked over, then used foal.",
  "s0384": "Other rites as old.",
  "s0385": "Its next year, east patrolled sea, examined divine immortal kind, not had verification.",
  "s0386": "Fangshi said 'Yellow Emperor time made five cities twelve towers, to await divine people at Zhi period, named welcome year'.",
  "s0387": "Emperor approved made as method, named Ming Nian.",
  "s0388": "Emperor personally rites sacrificed heaven emperor, wore yellow above.",
  "s0389": "Gong Tu said: 'Yellow Emperor time though Feng Mount Tai, yet after travel, Feng Ju ordered Yellow Emperor Feng east Mount Tai, Shan Fan Shan united symbols, then not died.'",
  "s0390": "Emperor already ordered set sacrifice tools, to east Mount Tai, east Mount Tai low small, not match its voice, ordered sacrifice officials rites honored it, not Feng Shan.",
  "s0391": "Its later ordered belt honored sacrifice awaited divine matters.",
  "s0392": "Summer, went Mount Tai, repaired five years rites as before, added Shan sacrifice Shique.",
  "s0393": "Shique, Mount Tai below foot south side, fangshi many said this immortal gate, hence emperor personally Shan.",
  "s0394": "Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
  "s0395": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng.",
  "s0396": "Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites.",
  "s0397": "Altogether six sacrifices, all Supreme Scribe led.",
  "s0398": "To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended.",
  "s0399": "Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led.",
  "s0400": "Other sacrifices all as its old.",
  "s0401": "Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas.",
  "s0402": "And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification.",
  "s0403": "And Gongsun Qing awaited divine, still with great person traces solved, no its effect.",
  "s0404": "Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true.",
  "s0405": "From this after, fangshi spoke sacrifice divine many, yet its effect could see.",
  "s0406": "Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan.",
  "s0407": "Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside.",
  "s0408": "After have gentleman, can view it.",
  "s0409": "To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved.",
  "s0410": "Its later five years, again to Mount Tai repaired Feng, returned passed sacrificed Changshan.",
  "s0411": "Now emperor raised sacrifices, Taiyi, Houtu, three years close suburban sacrifice, established Han Feng Shan, five years one repaired Feng.",
  "s0412": "Thin Ji Taiyi and three one, underworld sheep, horse travel, red star, five, Kuan Shu sacrifice officials with year times brought rites.",
  "s0413": "Altogether six sacrifices, all Supreme Scribe led.",
  "s0414": "To like eight gods various gods, Ming Nian, Fan Shan other name sacrifices, walked over sacrificed, went then ended.",
  "s0415": "Fangshi raised sacrifices, each self led, its person end then ended, sacrifice officials not led.",
  "s0416": "Other sacrifices all as its old.",
  "s0417": "Now emperor Feng Shan, its later twelve years returned, passed five peaks, four seas.",
  "s0418": "And fangshi awaited sacrifice divine people, entered sea sought Penglai, finally none verification.",
  "s0419": "And Gongsun Qing awaited divine, still with great person traces solved, no its effect.",
  "s0420": "Emperor increasingly tired despised fangshi strange absurd words, yet finally fettered not cut, hoped encounter its true.",
  "s0421": "From this after, fangshi spoke sacrifice divine many, yet its effect could see.",
  "s0422": "Taishi Gong said: I followed patrolled sacrificed heaven earth various gods name mountains rivers while Feng Shan.",
  "s0423": "Entered Shou palace attended sacrifice divine words, investigated observed fangshi sacrifice officials words, then retreated discussed arranged from ancient since used matter ghost spirits, completely saw its surface inside.",
  "s0424": "After have gentleman, can view it.",
  "s0425": "To if sacrificial stand jade currency detailed, presented repaid rites, then officials preserved."
}
