{
  "s0201": "Said: 'This world center, four directions enter tribute road distance equal.'",
  "s0202": "Make Zhao Gao, Luo Gao.",
  "s0203": "Cheng Wang already move Yin remain people, Zhou Gong with wang command inform, make Duo Shi, Wu Yi.",
  "s0204": "Zhao Gong as protect, Zhou Gong as teacher, east attack Huai Yi, destroy Yan, move its lord Bo Zhuang.",
  "s0205": "Cheng Wang self Yan return, at Zong Zhou, make Duo Fang.",
  "s0206": "Already dismiss Yin mandate, inherit Huai Yi, return at Feng, make Zhou Guan.",
  "s0207": "Rise correct ritual music, measure system then change, yet people harmonious, song voice rise.",
  "s0208": "Cheng Wang already attack east Yi, Xi Xun come congratulate, wang grant Rong Bo make Bribe Xi Xun command.",
  "s0209": "Cheng Wang will die, fear crown prince Zhao not able, then command Zhao Gong, Bi Gong lead feudal lords to assist crown prince establish it.",
  "s0210": "Cheng Wang already die, two Gong lead feudal lords, with crown prince Zhao see at previous wang temple, declare inform with Wen Wang, Wu Wang so become wang work not easy, work at frugal, no many desire, with sincere trust face it, make Gu Ming.",
  "s0211": "Crown prince Zhao then establish, this was Kang Wang.",
  "s0212": "Kang Wang establish, extensively inform feudal lords, declare with Wen Wu work to extend it, make Kang Gao.",
  "s0213": "Therefore Cheng Kang between, world peaceful, punishment not use forty remain years.",
  "s0214": "Kang Wang command make Ce Bi Gong divide dwell Li, Cheng Zhou suburb, make Bi Ming.",
  "s0215": "Kang Wang die, son Zhao Wang Xia establish.",
  "s0216": "Zhao Wang time, wang way slight lack.",
  "s0217": "Zhao Wang south tour hunt not return, die at Jiang upper.",
  "s0218": "Its die not announce report, hide it.",
  "s0219": "Establish Zhao Wang son Man, this was Mu Wang.",
  "s0220": "Mu Wang establish, spring autumn already fifty.",
  "s0221": "Wang way decline weak, Mu Wang pity Wen Wu way lack, then command Bo Jian declare warn Tai Pu state politics, make Jian Ming.",
  "s0222": "Again peaceful.",
  "s0223": "Mu Wang will attack Quan Rong, Ji Gong Mou Fu remonstrate said: 'Cannot.",
  "s0224": "Previous wang shine virtue not observe troops.",
  "s0225": "Man troops store yet time move, move then awe, observe then play, play then no shock.",
  "s0226": "Therefore Zhou Wen Gong song said: 'Load store dry spear, load sheath bow arrow, I seek excellent virtue, display at time Xia, allow wang protect it.'",
  "s0227": "Previous wang at people, flourish correct its virtue yet thick its nature, rich its wealth seek yet benefit its tool use, bright profit harm direction, with culture repair it, make it work benefit yet avoid harm, cherish virtue yet fear awe, therefore able protect world to increase great.",
  "s0228": "Previously our previous wang generation Hou Ji to serve Yu, Xia.",
  "s0229": "Reach Xia decline, abandon Ji not work, our previous wang Bu Nong use lose its official, yet self flee at Rong Di between.",
  "s0230": "Not dare neglect work, time order its virtue, follow repair its continue, repair its teach classic, morning evening respectful diligent, guard with sincere thick, serve with loyal trust.",
  "s0231": "Generations carry virtue, not shame previous people.",
  "s0232": "Reach Wen Wang, Wu Wang, bright previous light yet add with pity harmony, serve spirit protect people, no not happy joy.",
  "s0233": "Shang wang Di Xin great evil at people, common people not endure, shout carry Wu Wang, to bring soldiers at Shang Mu.",
  "s0234": "Therefore previous wang not work military, encourage relieve people hidden yet remove its harm.",
  "s0235": "Man previous wang system, state inner Dian serve, state outer Hou serve, Hou Wei Bin serve, Yi Man Yao serve, Rong Di Huang serve.",
  "s0236": "Dian serve sacrifice, Hou serve sacrifice, Bin serve enjoy, Yao serve tribute, Huang serve wang.",
  "s0237": "Day sacrifice, month sacrifice, season enjoy, year tribute, end wang.",
  "s0238": "Previous wang follow sacrifice, have not sacrifice then repair intention, have not sacrifice then repair speech, have not enjoy then repair culture, have not tribute then repair name, have not wang then repair virtue, order complete yet have not reach then repair punishment.",
  "s0239": "Then have punishment not sacrifice, attack not sacrifice, campaign not enjoy, yield not tribute, inform not wang.",
  "s0240": "Then have punishment punishment separate, have attack soldiers, have campaign prepare, have awe yield command, have culture inform speech.",
  "s0241": "Spread command display speech yet have not reach, then increase repair at virtue, no labor people at far.",
  "s0242": "Therefore near no not listen, far no not serve.",
  "s0243": "Now from Da Bi, Bo Shi end, Quan Rong with its duty come wang, heavenly son said 'I must with not enjoy campaign it, and observe its troops', no perhaps waste previous wang teach, yet wang nearly overturn?",
  "s0244": "I hear Quan Rong plant honest, follow old virtue yet guard end pure solid, its have to resist me.'",
  "s0245": "Wang then campaign it, get four white wolf four white deer return.",
  "s0246": "Self this Huang serve not reach.",
  "s0247": "Feudal lords have not harmonious, Fu Hou speak at wang, make Xiu Xing Bi.",
  "s0248": "Wang said: 'Xu, come!",
  "s0249": "Have state have earth, inform you auspicious punishment.",
  "s0250": "At now you peaceful hundred surnames, what choose not its person, what respect not its punishment, what dwell not its suitable with?"
}

