{
  "s0102": "Literary quality sparse inner, crowd unknown my different colors;",
  "s0103": "Talents unhewn accumulated, none know my possessions.",
  "s0104": "Repeated benevolence repeated righteousness, careful substantial as abundance;",
  "s0105": "Repeated Hua cannot oppose, who knows my ease!",
  "s0106": "Banished firmly not together, how know its reason?",
  "s0107": "Tang Yu long distant, far cannot admire.",
  "s0108": "Punished violation changed anger, suppressed heart self-strengthened;",
  "s0109": "Departed sorrow not moved, wished ambition have model.",
  "s0110": "Advanced road north lodged, day dim dim will evening;",
  "s0111": "Contained worry feared sorrow, limited by great cause.",
  "s0112": "Chaos says: Vast Yuan Xiang, divided flow Mi.",
  "s0113": "Long road secluded brushed, way far sudden.",
  "s0114": "Layer sighed constant sorrow, eternal sighed grieved.",
  "s0115": "Age already none know me, human heart cannot speak.",
  "s0116": "Embrace feelings hold quality, alone without match.",
  "s0117": "Bo Le already dead, steed where appraise?",
  "s0118": "Human life receives fate, each has placement.",
  "s0119": "Fixed heart broad ambition, I what fear?",
  "s0120": "Layer injured loved sorrow, eternal sighed grieved.",
  "s0121": "Age muddy not know me, heart cannot speak.",
  "s0122": "Know death cannot yield, wish not cherish.",
  "s0123": "Clearly tell gentleman, I will take as example.",
  "s0124": "Thus embracing stone self-drowned Mi Luo to die.",
  "s0125": "Qu Yuan having died after, Chu had Song Yu, Tang Le, Jing Chai and others, all good at rhetoric and famous for rhapsodies;",
  "s0126": "Yet all followed Qu Yuan's ease and rhetoric, ultimately dared not directly remonstrate.",
  "s0127": "Afterward Chu daily diminished, several decades ultimately destroyed by Qin.",
  "s0128": "From Qu Yuan drowning Mi Luo after hundred plus years, Han had Jia Sheng, as Changsha King tutor, passed Xiang water, cast letter to mourn Qu Yuan.",
  "s0129": "Jia Sheng named Yi, Luoyang person.",
  "s0130": "Age eighteen, with ability to recite poetry and books famous in commandery.",
  "s0131": "Wu Court Scribe as Henan governor, heard his outstanding talent, summoned to place under gate, greatly favored loved.",
  "s0132": "Filial Wen emperor initially ascended, heard Henan governor Wu Gong governed peacefully as world first, thus with Li Si same district and often studied affairs from him, thus summoned as Court Scribe.",
  "s0133": "Court Scribe then spoke Jia Sheng young, quite versed in hundred schools books.",
  "s0134": "Wen emperor summoned as erudite.",
  "s0135": "At this time Jia Sheng age twenty plus, was youngest.",
  "s0136": "Every time edicts and commands issued for discussion, various old masters could not speak, Jia Sheng completely responded to them, each person as their intent desired.",
  "s0137": "Various scholars then considered him able, could not match.",
  "s0138": "Filial Wen emperor pleased, promoted extraordinarily, one year to Grand Palace Grandee.",
  "s0139": "Jia Sheng considered Han rise to Filial Wen twenty plus years, world peaceful harmonious, yet should correct calendar, change clothing colors, establish laws systems, determine official names, promote rites music. Thus completely drafted all affair ceremonies laws, color honored yellow, number used five, for official names, completely changed Qin's laws.",
  "s0140": "Filial Wen emperor initially ascended, modest yielding not yet had time.",
  "s0141": "Various statutes commands newly determined, and marquises all went to fiefs, these theories all originated from Jia Sheng.",
  "s0142": "Thus Son of Heaven discussed appointing Jia Sheng to duke minister position.",
  "s0143": "Jiang, Guan, Dongyang Marquis, Feng Jing and others all harmed him, thus slandered Jia Sheng saying: 'Luoyang person, young beginner scholar, specially wishes to monopolize power, disorder various affairs.'",
  "s0144": "Thus Son of Heaven afterward also distanced him, did not use his proposals, appointed Jia Sheng as Changsha King tutor.",
  "s0145": "Jia Sheng having declined went traveling, heard Changsha low wet, self-considered lifespan could not be long, moreover departing capital, intent not self-satisfied.",
  "s0146": "When crossing Xiang water, composed rhapsody to mourn Qu Yuan.",
  "s0147": "Its words say:",
  "s0148": "Together receive fine favor, await guilt Changsha.",
  "s0149": "Side heard Qu Yuan, self-drowned Mi Luo.",
  "s0150": "Made entrusted Xiang current, respectfully mourn master.",
  "s0151": "Encountered age without extreme, thus fell his person."
}
