{
  "s0151": "Qi attach yet Han, Wei because can capture.'",
  "s0152": "Zhao Wang said: 'I wish personally Wei long, yet Wei changeable state, Guaren cannot personally.",
  "s0153": "Please ask personally Wei how?'",
  "s0154": "Replied: 'King humble words heavy gifts serve it;",
  "s0155": "Not possible, then divide land bribe it;",
  "s0156": "Not possible, because raise troops attack it.'",
  "s0157": "King said: 'Guaren respectfully heard command.'",
  "s0158": "Then appointed Fan Sui as guest minister, plan military matters.",
  "s0159": "Finally listened Fan Sui plan, made five grand master Wan attack Wei, captured Huai.",
  "s0160": "Later two years, captured Xing Qiu.",
  "s0161": "Guest minister Fan Sui again persuaded Zhao Wang: 'Qin Han land forms, mutually interlock like embroidery.",
  "s0162": "Qin having Han, like wood having borer, person having heart abdomen illness.",
  "s0163": "World no change then stop, world has change, its for Qin patient who greater than Han?",
  "s0164": "King not equal take Han.'",
  "s0165": "Zhao Wang said: 'I indeed wish take Han, Han not listen, for it how?'",
  "s0166": "Replied: 'Han how not listen?",
  "s0167": "King send troops attack Xing Yang, then Gong, Cheng Gao way not through;",
  "s0168": "North break Taihang way, then Shangdang troops not down.",
  "s0169": "King one raise troops attack Xing Yang, then its state cut as three.",
  "s0170": "Han see certainly perish, how not listen?",
  "s0171": "If Han listen, hegemon matters then can consider.'",
  "s0172": "King said: 'Good.'",
  "s0173": "Moreover wished send envoy to Han.",
  "s0174": "Fan Sui increasingly close, again persuaded used several years, because requested leisure spoke: 'Minister dwell Shandong time, heard Qi have Tian Wen, not heard have king;",
  "s0175": "Heard Qin have Taihou, Rang Hou, Hua Yang, Gao Ling, Jing Yang, not heard have king.",
  "s0176": "Monopolize state called king, able benefit harm called king, control kill live might called king.",
  "s0177": "Now Taihou monopolize action not regard, Rang Hou out envoy not report, Hua Yang, Jing Yang etc. attack cut no taboo, Gao Ling advance retreat not request.",
  "s0178": "Four nobles complete yet state not danger, none have it.",
  "s0179": "Do this four nobles under, then called no king.",
  "s0180": "Then authority how not incline, commands how get from king out?",
  "s0181": "Minister heard good govern state, inner solidify might outer heavy authority.",
  "s0182": "Rang Hou envoys grasp king weight, decide at feudal lords, divide tallies world, politics suitable attack states, none dare not listen.",
  "s0183": "Battle victory attack take then profit return Tao, state exhausted defend feudal lords;",
  "s0184": "Battle defeat then tie resentment hundred surnames, calamity return ancestral temple.",
  "s0185": "Shi said 'wood fruit dense peel branches, peel branches injure heart;",
  "s0186": "Great cities danger state, honor ministers humble lord'.",
  "s0187": "Cui Zhu, Nao Chi manage Qi, shoot king thigh, pluck king sinew, hang at temple beam, overnight died.",
  "s0188": "Li Kui manage Zhao, imprisoned lord father Sha Qiu, hundred days starved died.",
  "s0189": "Now minister heard Qin Taihou, Rang Hou employ affairs, Gao Ling, Hua Yang, Jing Yang assist, finally no Qin king, this also Nao Chi, Li Kui class.",
  "s0190": "Moreover three dynasties what perished states, lord specialize grant politics, indulge wine race hunting, not listen politics.",
  "s0191": "Its granted, jealous worthy hate able, control under screen above, complete private, not for lord plan, lord not awaken, thus lose state.",
  "s0192": "Now from have rank above to various grand officials, down to king left right, none not chancellor people.",
  "s0193": "See king alone stand court, minister secretly for king fear, ten thousand generations after, have Qin none king sons grandsons.'",
  "s0194": "Zhao Wang heard greatly fear, said: 'Good.'",
  "s0195": "Then abolished Taihou, drove Rang Hou, Gao Ling, Hua Yang, Jing Yang jun outside pass.",
  "s0196": "Qin king then appointed Fan Sui chancellor.",
  "s0197": "Took Rang Hou seal, made return Tao, because made county officials give chariots oxen transport, thousand chariots surplus.",
  "s0198": "Arrived pass, pass inspected treasures, treasures precious strange many over royal house.",
  "s0199": "Qin sealed Fan Sui with Ying, number Ying Hou.",
  "s0200": "At this time, Qin Zhao Wang forty one year."
}