{
  "s0061": "Son replace, year remain sit law die.",
  "s0062": "After year remain, Shuo grandson Zeng appoint become Long Shou hou, continue Shuo after.",
  "s0063": "Lu Wan, Feng person, with Gao Zu same li.",
  "s0064": "Lu Wan close with Gao Zu tai shang huang each love, reach give birth male, Gao Zu, Lu Wan same day give birth, li middle hold sheep wine congratulate two home.",
  "s0065": "Reach Gao Zu, Lu Wan strong, both study book, again each love.",
  "s0066": "Li middle praise two home close each love, give birth son same day, strong again each love, again congratulate two home sheep wine.",
  "s0067": "Gao Zu become bu yi time, have li affairs bi ni, Lu Wan constant follow go out enter up down.",
  "s0068": "Reach Gao Zu begin rise Pei, Lu Wan with guest follow, enter Han Zhong become jiang jun, constant serve middle.",
  "s0069": "Follow east strike Xiang Ji, with tai wei constant follow, go out enter sleep inner, clothes cover eat drink reward grant, group minister not dare hope, though Xiao Cao wait, special with affairs see li, reach his close fortunate, not reach Lu Wan.",
  "s0070": "Wan seal become Chang An hou.",
  "s0071": "Chang An, old Xian Yang.",
  "s0072": "Han five years winter, with break Xiang Ji, then make Lu Wan separate lead, with Liu Jia strike Lin Jiang wang Gong Wei, break it.",
  "s0073": "Seven month return, follow strike Yan wang Zang Tu, Zang Tu descend.",
  "s0074": "Gao Zu already settle tian xia, various hou not Liu shi yet wang seven people.",
  "s0075": "Desire wang Lu Wan, become group minister ju wang.",
  "s0076": "Reach capture Zang Tu, then descend zhao various jiang xiang lie hou, select group minister have merit become Yan wang.",
  "s0077": "Group minister know shang desire wang Lu Wan, all speak said: 'Tai wei Chang An hou Lu Wan constant follow settle tian xia, merit most many, able wang Yan.'",
  "s0078": "Zhao allow it.",
  "s0079": "Han five years eight month, then establish Lu Wan become Yan wang.",
  "s0080": "Various hou wang obtain fortunate not like Yan wang."
}

