{
  "s0001": "Chu ancestors originated from Emperor Zhuan Xu Gao Yang.",
  "s0002": "Gao Yang was Yellow Emperor grandson, Chang Yi son.",
  "s0003": "Gao Yang gave birth Chen, Chen gave birth Juan Zhang, Juan Zhang gave birth Chong Li.",
  "s0004": "Chong Li for Emperor Ku Gao Xin administered fire official, very meritorious, able illuminate harmonize world, Emperor Ku named Zhu Rong.",
  "s0005": "Gong Gong clan made chaos, Emperor Ku made Chong Li execute not completely.",
  "s0006": "Emperor then with Geng Yin day executed Chong Li, yet with his younger brother Wu Hui as Chong Li successor, again administered fire official, as Zhu Rong.",
  "s0007": "Wu Hui gave birth Lu Zhong.",
  "s0008": "Lu Zhong gave birth six sons, split open gave birth them.",
  "s0009": "His eldest one called Kun Wu;",
  "s0010": "Two called Can Hu;",
  "s0011": "Three called Peng Zu;",
  "s0012": "Four called Hui Ren;",
  "s0013": "Five called Cao surname;",
  "s0014": "Six called Ji Lian, Mi surname, Chu their descendants.",
  "s0015": "Kun Wu clan, Xia time once as hou bo, Jie time Tang extinguished it.",
  "s0016": "Peng Zu clan, Yin time once as hou bo, Yin late generations extinguished Peng Zu clan.",
  "s0017": "Ji Lian gave birth Fu Ju, Fu Ju gave birth Xue Xiong.",
  "s0018": "Their descendants middle declined, or in central states, or in barbarian Yi, cannot record their generations.",
  "s0019": "Zhou Wen Wang time, Ji Lian descendants called Yu Xiong.",
  "s0020": "Yu Xiong son served Wen Wang, early died.",
  "s0021": "His son called Xiong Li.",
  "s0022": "Xiong Li gave birth Xiong Kuang, Xiong Kuang gave birth Xiong Yi.",
  "s0023": "Xiong Yi when Zhou Cheng Wang time, raised Wen, Wu diligent labor descendants, sealed Xiong Yi at Chu barbarian, sealed with zi nan rank land, surname Mi clan, dwelt Dan Yang.",
  "s0024": "Chu zi Xiong Yi with Lu gong Bo Qin, Wei Kang Shu zi Mou, Jin hou Xie, Qi Tai gong zi Lu Ji all served Cheng Wang.",
  "s0025": "Xiong Yi gave birth Xiong Ai, Xiong Ai gave birth Xiong Dan, Xiong Dan gave birth Xiong Sheng.",
  "s0026": "Xiong Sheng with younger brother Xiong Yang as successor.",
  "s0027": "Xiong Yang gave birth Xiong Qu.",
  "s0028": "Xiong Qu gave birth three sons when young.",
  "s0029": "When Zhou Yi Wang time, royal house declined, feudal lords some not court, mutually attacked.",
  "s0030": "Xiong Qu very gained Jiang Han between people harmony, then raised troops attacked Yong, Yang Lao, reached E.",
  "s0031": "Xiong Qu said: 'I barbarian also, not with central states titles posthumous.'",
  "s0032": "Then established his eldest son Kang as Gou Dan wang, middle son Hong as E wang, youngest son Zhi Ci as Yue Zhang wang, all at Jiang upper Chu barbarian land.",
  "s0033": "When Zhou Li Wang time, violent tyrannical, Xiong Qu feared his attack Chu, also removed their wang.",
  "s0034": "Later as Xiong Wu Kang, Wu Kang early died.",
  "s0035": "Xiong Qu died, son Xiong Zhi Hong established.",
  "s0036": "Zhi Hong died, his younger brother assassinated replaced established, called Xiong Yan.",
  "s0037": "Xiong Yan gave birth Xiong Yong.",
  "s0038": "Xiong Yong six years, Zhou people made chaos, attacked Li Wang, Li Wang fled Zhi.",
  "s0039": "Xiong Yong ten years, died, younger brother Xiong Yan as successor.",
  "s0040": "Xiong Yan ten years, died.",
  "s0041": "Had four sons, eldest Bo Shuang, middle Zhong Xue, next Shu Kan, youngest Ji Xun.",
  "s0042": "Xiong Yan died, eldest Bo Shuang replaced established, this was Xiong Shuang.",
  "s0043": "Xiong Shuang first year, Zhou Xuan Wang initial established.",
  "s0044": "Xiong Shuang six years, died, three younger brothers contended established.",
  "s0045": "Zhong Xue died;",
  "s0046": "Shu Kan fled, avoided difficulty at Pu;",
  "s0047": "Youngest Ji Xun established, this was Xiong Xun.",
  "s0048": "Xiong Xun sixteen years, Zheng Huan Gong initial sealed at Zheng.",
  "s0049": "Twenty two years, Xiong Xun died, son Xiong E established.",
  "s0050": "Xiong E nine years, died, son Xiong Yi established, this was Ruo Ao."
}
