{
  "s0201": "Nine month Ren Xu, with Jin Hui Gong Yi Wu combine battle at Han earth.",
  "s0202": "Jin jun abandon its army, with Qin contend profit, return yet horse stumble.",
  "s0203": "Miao Gong with banner below gallop pursue it, not able get Jin jun, return become Jin army surround.",
  "s0204": "Jin strike Miao Gong, Miao Gong injure.",
  "s0205": "Then Qi below eat good horse three hundred people gallop brave Jin army, Jin army solve surround, then escape Miao Gong yet return live get Jin jun.",
  "s0206": "Initial, Miao Gong lose good horse, Qi below wild people together get yet eat it three hundred remain people, li pursue get, desire law it.",
  "s0207": "Miao Gong said: 'Jun zi not with raise produce harm people.",
  "s0208": "I hear eat good horse meat not drink wine, injure people.'",
  "s0209": "Then all grant wine yet pardon it.",
  "s0210": "Three hundred people hear Qin strike Jin, all seek follow, follow yet see Miao Gong distress, also all push spear contend die, to report eat horse virtue.",
  "s0211": "Then Miao Gong capture Jin jun return, command at country, Qi host, I will with Jin jun sacrifice Shang Di.",
  "s0212": "Zhou heavenly son hear, said 'Jin I same surname', for request Jin jun.",
  "s0213": "Yi Wu sister also become Miao Gong wife, wife hear, then decline silk barefoot, said: 'Concubine brothers not able mutual save, to disgrace jun command.'",
  "s0214": "Miao Gong said: 'I get Jin jun become merit, now heavenly son for request, wife is worry.'",
  "s0215": "Then with Jin jun ally, allow return it, change lodge upper lodge, yet feed it seven pen.",
  "s0216": "Eleven month, return Jin jun Yi Wu, Yi Wu offer its He west earth, make crown prince Yu become pledge at Qin.",
  "s0217": "Qin wife Yu with clan woman.",
  "s0218": "Is time Qin earth east reach He.",
  "s0219": "Eighteen years, Qi Huan Gong die.",
  "s0220": "Twenty years, Qin extinguish Liang, Rui.",
  "s0221": "Twenty two years, Jin Gong Zi Yu hear Jin jun ill, said: 'Liang, I mother home, yet Qin extinguish it.",
  "s0222": "I brothers many, then jun hundred years after, Qin must stay me, yet Jin light, also change establish other son.'",
  "s0223": "Zi Yu then flee return Jin.",
  "s0224": "Twenty three years, Jin Hui Gong die, Zi Yu establish become jun.",
  "s0225": "Qin resent Yu flee go, then welcome Jin Gong Zi Chong Er at Chu, yet wife with old Zi Yu wife.",
  "s0226": "Chong Er initial thank, after then accept.",
  "s0227": "Miao Gong more ritual thick meet it.",
  "s0228": "Twenty four years spring, Qin make person inform Jin ministers, desire enter Chong Er.",
  "s0229": "Jin allow it, then make person send Chong Er.",
  "s0230": "Two month, Chong Er establish become Jin jun, is Wen Gong.",
  "s0231": "Wen Gong make person kill Zi Yu.",
  "s0232": "Zi Yu is Hui Gong.",
  "s0233": "Its autumn, Zhou Xiang Wang younger brother Dai with Di attack wang, wang exit dwell Zheng.",
  "s0234": "Twenty five years, Zhou wang make person inform difficulty at Jin, Qin.",
  "s0235": "Qin Miao Gong will troops help Jin Wen Gong enter Xiang Wang, kill wang younger brother Dai.",
  "s0236": "Twenty eight years, Jin Wen Gong defeat Chu at Cheng Pu.",
  "s0237": "Thirty years, Miao Gong help Jin Wen Gong surround Zheng.",
  "s0238": "Zheng make person speak Miao Gong said: 'Perish Zheng thick Jin, at Jin yet get, yet Qin not have profit.",
  "s0239": "Jin strong, Qin worry.'",
  "s0240": "Miao Gong then stop troops return.",
  "s0241": "Jin also stop.",
  "s0242": "Thirty two years winter, Jin Wen Gong die.",
  "s0243": "Zheng person have sell Zheng at Qin said: 'I master its city gate, Zheng able raid.'",
  "s0244": "Miao Gong ask Jian Shu, Bai Li Xi, answer said: 'Through several state thousand li yet raid people, rare have get profit.",
  "s0245": "And person sell Zheng, how know our country person not have with my situation inform Zheng?",
  "s0246": "Not able.'",
  "s0247": "Miao Gong said: 'Son not know, I already decide.'",
  "s0248": "Then send troops, make Bai Li Xi son Meng Ming view, Jian Shu son Xi Qi Shu and Bai Yi Bing will troops.",
  "s0249": "Walk day, Bai Li Xi, Jian Shu two people cry it.",
  "s0250": "Miao Gong hear, angry said: 'Gu send troops yet son hinder cry my army, why?'"
}
