{
  "s0202": "Han third year, Han Xin already settled Wei land, sent Zhang Er with Han Xin attacked broke Zhao Jingxing, beheaded Chen Yu Wei water above, pursued killed Zhao king Xie Xiangguo.",
  "s0203": "Han established Zhang Er as Zhao king.",
  "s0204": "Han fifth year, Zhang Er died, posthumous title Jing Wang.",
  "s0205": "Son Ao succeeded established as Zhao king.",
  "s0206": "Gao Zu eldest daughter Lu Yuan princess for Zhao king Ao empress.",
  "s0207": "Han seventh year, Gao Zu from Pingcheng passed Zhao, Zhao king morning evening bare back mat covered, self served food, ritual very humble, had son-in-law ritual.",
  "s0208": "Gao Zu sat cross-legged cursed, very slighted him.",
  "s0209": "Zhao chancellor Guan Gao, Zhao Wu etc. year sixty plus, originally Zhang Er guests.",
  "s0210": "Lifetime for spirit, then angered: 'My king weak king!'",
  "s0211": "Persuaded king: 'World heroes together rise, able ones first establish.",
  "s0212": "Now king serves Gao Zu very respectful, yet Gao Zu no ritual, please for king kill him!'",
  "s0213": "Zhang Ao bit his finger blood came out: 'Lord what speak mistake!",
  "s0214": "Moreover ancestors perished country, relied Gao Zu got restore country, virtue flowed descendants, autumn hair all Gao Zu strength.",
  "s0215": "Wish lord no again speak out.'",
  "s0216": "Guan Gao, Zhao Wu etc. ten plus persons all mutually said: 'Then we etc. wrong.",
  "s0217": "My king elder, not double virtue.",
  "s0218": "Moreover we etc. righteousness not humiliated, now resent Gao Zu humiliate my king, thus wish kill him, why then dirty king?",
  "s0219": "Make matter succeed return king, matter fail alone body sit.'",
  "s0221": "Han eighth year, emperor from Dongyuan returned, passed Zhao, Guan Gao etc. then walled people Bo Ren, intercepted him placed latrine.",
  "s0222": "Emperor passed wished lodge, heart moved, asked: 'County name what?'",
  "s0222": "Said: 'Bo Ren.'",
  "s0223": "'Bo Ren, pressed by person!'",
  "s0224": "Not lodged went.",
  "s0225": "Han ninth year, Guan Gao resent family knew his plot, then presented change reported it.",
  "s0226": "Then emperor all together arrested Zhao king, Guan Gao etc.",
  "s0227": "Ten plus persons all contended self cut throat, Guan Gao alone angered cursed: 'Who make you do it?",
  "s0228": "Now king really no plot, yet together arrest king;",
  "s0229": "You etc. all die, who clear king not rebel!'",
  "s0230": "Then iron cart glue sent, with king to Chang'an.",
  "s0231": "Treated Zhang Ao crime.",
  "s0232": "Emperor then decreed Zhao ministers guests have dare follow king all clan.",
  "s0233": "Guan Gao with guest Meng Shu etc. ten plus persons, all self shaved iron collar, as king family slave, followed come.",
  "s0234": "Guan Gao arrived, faced prison: 'Only my group did it, king really not know.'",
  "s0235": "Officials treated whipped several thousand, stabbed cut, body no could hit place, finally not again speak.",
  "s0236": "Lu Hou several times spoke Zhang Wang because Lu Yuan princess, not suitable have this.",
  "s0237": "Emperor angered: 'Make Zhang Ao occupy world, how lack your daughter!'",
  "s0238": "Not listened.",
  "s0239": "Court judge with Guan Gao matter words heard, emperor said: 'Strong man!",
  "s0240": "Who know, with private ask.'",
  "s0241": "Middle grand master Xie Gong said: 'Minister town child, originally know him.",
  "s0242": "This indeed Zhao country establish name righteousness not encroach as promise yes.'",
  "s0243": "Emperor made Xie Gong hold tally asked curtain carriage before.",
  "s0244": "Looked up said: 'Xie Gong?'",
  "s0245": "Xie Gong labored bitter like lifetime happy, with spoke, asked Zhang Wang indeed have plan plot not.",
  "s0246": "Gao said: 'Person feeling rather not each love his parents wife children?",
  "s0247": "Now my three clans all with adjudged die, how with king exchange my kin?",
  "s0248": "Look for king really not rebel, only my etc. did it.'",
  "s0249": "Detailed told original intention what for king not know condition.",
  "s0250": "Then Xie Gong entered, detailed with reported, emperor then pardoned Zhao king.",
  "s0251": "Emperor worthy Guan Gao person able establish promise yes, made Xie Gong detailed told him, said: 'Zhang Wang already out.'",
  "s0252": "Because pardoned Guan Gao.",
  "s0253": "Guan Gao happy: 'My king indeed out?'",
  "s0254": "Xie Gong said: 'Yes.'",
  "s0255": "Xie Gong said: 'Emperor many your excellency, thus pardon your excellency.'",
  "s0256": "Guan Gao said: 'What not die one body no remain, clear Zhang Wang not rebel.",
  "s0257": "Now king already out, my duty already full, die not regret.",
  "s0258": "Moreover person minister have usurp kill name, what face again serve above?",
  "s0259": "Even above not kill me, I not ashamed heart?'",
  "s0260": "Then looked up cut throat, thus died.",
  "s0261": "When this time, name heard world.",
  "s0262": "Zhang Ao already out, because still Lu Yuan princess, sealed as Xuanping hou.",
  "s0263": "Then emperor worthy Zhang Wang various guests, with iron collar slave followed Zhang Wang entered pass, none not as various lords chancellor, commandery guard.",
  "s0264": "When filial Hui, Gao Hou, Wen Di, Xiao Jing time, Zhang Wang guests sons grandsons all got as two thousand shi.",
  "s0265": "Zhang Ao, Gao Hou sixth year died.",
  "s0266": "Son Yan for Lu Yuan Wang.",
  "s0267": "Because mother Lu Hou daughter, Lu Hou sealed as Lu Yuan Wang.",
  "s0268": "Yuan Wang weak, brothers few, then sealed Zhang Ao other consort sons two persons: Shou for Lechang hou, Chi for Xindu hou.",
  "s0269": "Gao Hou collapsed, various Lu no way, ministers executed them, yet abolished Lu Yuan Wang and Lechang hou, Xin hou.",
  "s0270": "Filial Wen Di established, again sealed former Lu Yuan Wang Yan as Nan Gong hou, continued Zhang clan.",
  "s0271": "Grand Historian said: Zhang Er, Chen Yu, world tradition what called worthy;",
  "s0272": "Their guests servants, none not world outstanding heroes, what dwelt country none not took minister chancellor.",
  "s0273": "However Zhang Er, Chen Yu beginning dwelt straitened, mutually yes trusted with death, how considered ask?",
  "s0274": "When occupied country contended power, finally mutually extinguished perished, what former mutually admired used sincerity, after mutually betrayed violent!",
  "s0275": "How not with power profit intercourse?",
  "s0276": "Name reputation though high, guests though flourishing, what by nearly with Tai Bo, Yanling Ji Zi different."
}
