{
  "s0136": "Now see allied states not close, cross other state attack, possible?",
  "s0137": "Plan flawed.",
  "s0140": "Soldiers humiliated troops weary, all blamed king: 'Who made this plan?'",
  "s0145": "King not equal far ally near attack, get inch then king inch, get foot also king foot.",
  "s0146": "Now abandon this far attack, not also absurd?",
  "s0224": "Xu Jia strange it.",
  "s0226": "Xu Jia waited gate under, held carriage long time, asked gate under: 'Fan Shu not out, why?'",
  "s0233": "Jia have boiling cauldron crime, please self screen at Hu Mo land, only jun life death!'",
  "s0236": "Fan Sui said: 'You crime have three only.",
  "s0241": "Crime three.",
  "s0242": "However you what get no die, with silk robe lingering, have old friend intent, thus released you.'",
  "s0244": "Entered spoke Zhao Wang, dismissed returned Xu Jia.",
  "s0368": "Their lords, not.",
  "s0369": "Thus world praise three persons achieve merit not see virtue, how admire not meet world die?",
  "s0371": "Wait die then can establish loyal complete name, is Wei Zi insufficient benevolent, Confucius insufficient sage, Guan Zhong insufficient great.",
  "s0376": "Then Ying Hou praised good.",
  "s0380": "Ying Hou said: 'Unknown what like.'",
  "s0381": "Cai Ze said: 'Now jun personally loyal ministers, not over Qin Xiao Gong, Chu Dao Wang, Yue Wang, jun establish wisdom, able for jun secure danger repair politics, govern chaos strong troops, ward off calamity break difficulty, broaden land plant grain, enrich state sufficient family, strong jun, honor altars soil, illustrious ancestral temple, world none dare deceive offend jun, jun might cover shake within seas, merit spread ten thousand li outside, sound name glory transmit thousand generations, jun who with Shang Jun, Wu Qi, Da Fu Zhong?'",
  "s0382": "Ying Hou said: 'Not equal.'",
  "s0383": "Cai Ze said: 'Now jun personally loyal ministers not forget old acquaintance not equal Xiao Gong, Dao Wang, Gou Jian, yet jun merit achievements love trust personal favor again not equal Shang Jun, Wu Qi, Da Fu Zhong, however jun salary position noble flourishing, private family rich over three persons, body not retreat, fear calamity over three persons, secretly for jun dangerous.",
  "s0384": "Saying 'sun middle then shift, moon full then wane'.",
  "s0399": "Merit already complete, yet finally with cart torn apart.",
  "s0400": "Chu place several thousand li, hold halberds hundred thousand, Bai Qi led several ten thousand troops with Chu battle, one battle raised Yan Ying burn Yi Ling, two battle south combine Shu Han.",
  "s0405": "Merit already complete, yet finally branch torn apart.",
  "s0406": "Da Fu Zhong for Yue Wang deep plan far strategy, avoid Kuaiji danger, with perish as preserve, because humiliation as honor, clear grass enter city, open land plant grain, lead four directions scholars, monopolize up down strength, assist Gou Jian worthy, report Fu Cha enmity, finally capture strong Wu.",
  "s0407": "Make Yue complete hegemon.",
  "s0408": "Merit already illustrious faith, Gou Jian finally betray kill him.",
  "s0412": "Fan Li knew, transcend leave world, long as Tao Zhu Gong.",
  "s0415": "Now jun chancellor Qin, plan not descend mat, strategy not out hall temple, sit control feudal lords, benefit extend three rivers, to fill Yi Yang, decide Yang Chang danger, block Taihang way, again cut Fan, Zhong Xing road, six states not able unite vertical, stack path thousand li, through Shu Han, make world all fear Qin, Qin desire got, jun merit extreme, this also Qin divide merit time.",
  "s0417": "I heard, 'mirror water see face appearance, mirror person know auspicious misfortune'.",
  "s0419": "Four persons calamity, jun what dwell?",
  "s0421": "Generations praise orphan, have Xu You, Yanling Ji Zi yield, Qiao Song longevity, who with calamity end?",
  "s0424": "Yi said 'high dragon have regret', this speak ascend cannot descend, believe cannot yield, go cannot self return.",
  "s0430": "Then prolonged invited enter sit, as upper guest.",
  "s0431": "Later several days, entered court, spoke Qin Zhao Wang: 'Guest newly have from Shandong come called Cai Ze, that person eloquent scholar, enlightened three kings matters, five hegemons enterprise, world custom change, sufficient entrust Qin state politics.",
  "s0432": "Minister see person very many, none equal, minister not equal."
}

