{
  "s0001": "Chen Wan, Chen Li Gong Ta son.",
  "s0002": "Wan born, Zhou Grand Historian passed Chen, Chen Li Gong made divine Wan, hexagram got Guan zhi Pi: 'This is observe state light, beneficial guest at wang.",
  "s0003": "This his replace Chen have state?",
  "s0004": "Not at this but at different state?",
  "s0005": "Not this his person, at his descendants.",
  "s0006": "If at different state, must Jiang surname.",
  "s0007": "Jiang surname, four Yue after.",
  "s0008": "Things cannot two great, Chen decline, this its prosper?",
  "s0009": "Li Gong, Chen Wen Gong young son, his mother Cai woman.",
  "s0010": "Wen Gong died, Li Gong brother Bao established, this was Huan Gong.",
  "s0011": "Huan Gong with Ta different mother.",
  "s0012": "When Huan Gong ill, Cai people for Ta kill Huan Gong Bao and crown prince Mian yet established Ta, for Li Gong.",
  "s0013": "Li Gong already established, married Cai woman.",
  "s0014": "Cai woman licentious with Cai person, many return, Li Gong also many go Cai.",
  "s0015": "Huan Gong young son Lin resented Li Gong kill his father and brother, then made Cai people lure Li Gong and kill him.",
  "s0016": "Lin self established, this was Zhuang Gong.",
  "s0017": "Thus Chen Wan could not establish, for Chen grand master.",
  "s0018": "Li Gong kill, because licentious leave state, thus Spring Autumn said 'Cai people kill Chen Ta', blame him.",
  "s0019": "Zhuang Gong died, established younger brother Chu Jiu, this was Xuan Gong.",
  "s0020": "Xuan Gong twenty one years, killed his crown prince Yu Kou.",
  "s0021": "Yu Kou with Wan mutually loved, feared disaster reach self, Wan thus fled Qi.",
  "s0022": "Qi Huan Gong wished make him minister, declined said: 'Sojourning minister fortunate get avoid burden eave, lord favor, not dare receive high position.'",
  "s0023": "Huan Gong made him work overseer.",
  "s0024": "Qi Yi Zhong wished marry Wan, divined it, omen said: 'This called phoenix fly, harmonious cry clang clang.",
  "s0025": "Have Gui after, will nurture at Jiang.",
  "s0026": "Five generations its prosper, equal to proper ministers.",
  "s0027": "Eight generations after, none rival capital.'",
  "s0028": "Finally married Wan.",
  "s0029": "Wan fled Qi, Qi Huan Gong established fourteen years.",
  "s0030": "Wan died, posthumous name Jing Zhong.",
  "s0031": "Zhong gave birth Zhi Meng Yi.",
  "s0032": "Jing Zhong enter Qi, with Chen character became Tian clan.",
  "s0033": "Tian Zhi Meng Yi gave birth Min Meng Zhuang, Tian Min Meng Zhuang gave birth Wen Zi Xu Wu.",
  "s0034": "Tian Wen Zi served Qi Zhuang Gong.",
  "s0035": "Jin grand master Luan Ying made chaos at Jin, came fled Qi, Qi Zhuang Gong thick guest him.",
  "s0036": "Yan Ying with Tian Wen Zi advised, Zhuang Gong not listened.",
  "s0037": "Wen Zi died, gave birth Huan Zi Wu Yu.",
  "s0038": "Tian Huan Zi Wu Yu had strength, served Qi Zhuang Gong, very favored.",
  "s0039": "Wu Yu died, gave birth Wu Zi Kai with Xi Zi Qi.",
  "s0040": "Tian Xi Zi Qi served Qi Jing Gong as grand master, his collected taxes from people with small dou received, his granted people with big dou, practiced hidden virtue on people, yet Jing Gong not forbade.",
  "s0041": "From this Tian clan got Qi crowds heart, clan increasingly strong, people thought Tian clan.",
  "s0042": "Yan Zi many advised Jing Gong, Jing Gong not listened.",
  "s0043": "Already then sent to Jin, with Shu Xiang private spoke said: 'Qi state politics finally return to Tian clan.'",
  "s0044": "Yan Ying died after, Fan, Zhong Xing clan rebelled Jin.",
  "s0045": "Jin attacked urgently, Fan, Zhong Xing requested grain at Qi.",
  "s0046": "Tian Qi wished make chaos, establish party at feudal lords, then persuaded Jing Gong said: 'Fan, Zhong Xing many had virtue to Qi, Qi cannot not save.'",
  "s0047": "Qi made Tian Qi save them and transported grain.",
  "s0048": "Jing Gong crown prince died, after had favored concubine called Rui Zi, gave birth son Tu.",
  "s0049": "Jing Gong ill, commanded his chancellor Hui Zi and Gao Zhao Zi with Tu as crown prince.",
  "s0050": "Jing Gong died, two chancellors Gao, Guo established Tu, this was Yan Ru Zi."
}
