{
  "s0051": "Therefore Han and Wei not being destroyed is Qin's state concern. Now Your Majesty aids them in attacking Chu—is this not a mistake?",
  "s0052": "Moreover, when Your Majesty attacks Chu, where will the troops emerge?",
  "s0053": "Will Your Majesty borrow the road through enemy Han and Wei?",
  "s0054": "On the day the troops emerge Your Majesty will worry they do not return—this is Your Majesty providing troops to enemy Han and Wei.",
  "s0055": "If Your Majesty does not borrow the road through enemy Han and Wei, you must attack along the right bank of the Sui River.",
  "s0056": "The right bank of the Sui River—all broad rivers and great waters, mountain forests and valleys, land where crops cannot be grown. Even if Your Majesty takes it, it is not gaining territory.",
  "s0057": "This gives Your Majesty the name of destroying Chu but no reality of gaining land.",
  "s0058": "Moreover, on the day Your Majesty attacks Chu, the four states will certainly all raise troops to respond to Your Majesty.",
  "s0059": "Qin and Chu troops will be locked in combat without separating. Wei will emerge to attack Liu, Fangyu, Zhi, Huling, Dang, Xiao, Xiang—thus exhausting the old territory of Song.",
  "s0060": "Qi will face south to attack Chu, and the area above the Si River will certainly be taken.",
  "s0061": "These are all broad plains with four-way access, fertile lands, yet left for Qin to attack alone.",
  "s0062": "Your Majesty destroys Chu to fatten Han and Wei in the central states and strengthen Qi.",
  "s0063": "When Han and Wei are strong, they will be able to contend with Qin.",
  "s0064": "Qi to the south has the Si River as border, east faces the sea, north relies on the Yellow River, without worries from behind. No state in the world is stronger than Qi and Wei. If Qi and Wei gain land and preserve advantages while carefully serving as subordinate officials, within a year, even if they cannot become emperor themselves, they will have more than enough to prevent Your Majesty from becoming emperor.",
  "s0065": "With Your Majesty's vast territory, numerous people, strong weapons and armor, in one campaign creating resentment with Chu, delaying until Han and Wei return the imperial title to Qi—this is Your Majesty losing the plan.",
  "s0066": "I advise Your Majesty, nothing is better than befriending Chu.",
  "s0067": "If Qin and Chu unite as one to face Han, Han will certainly fold its hands.",
  "s0068": "Your Majesty can deploy the danger of Dongshan, gird with the advantage of the Qu River—Han will certainly become an inner pass marquis.",
  "s0069": "In this way Your Majesty stations 100,000 troops in Zheng, the Liang clan will lose heart. Xu and Yanling will be besieged, and Shangcai and Shaoling will have no commerce. In this way Wei also becomes an inner pass marquis.",
  "s0070": "Your Majesty befriends Chu, and the two marquisates of ten thousand chariots within the pass will pour their land toward Qi. Qin's right flank can be taken with folded hands.",
  "s0071": "Your Majesty's territory will span the two seas, commanding the world's strategic points—this makes Yan and Zhao unable to oppose Qi and Chu, Qi and Chu unable to oppose Yan and Zhao.",
  "s0072": "Then threatening Yan and Zhao, directly shaking Qi and Chu—these four states will submit without being wounded.",
  "s0073": "King Zhao said: 'Excellent.'",
  "s0074": "Thus he stopped Bai Qi and apologized to Han and Wei.",
  "s0075": "He sent envoys to bribe Chu, making a treaty as allied states.",
  "s0076": "Huang Xie accepted the treaty and returned to Chu. Chu sent Xie with Crown Prince Wan as hostages in Qin. Qin detained them for several years.",
  "s0077": "King Qingxiang of Chu fell ill, the crown prince could not return.",
  "s0078": "The Chu crown prince was on good terms with Qin's prime minister Lord Ying. Thus Huang Xie advised Lord Ying: 'Prime Minister, do you truly befriend the Chu crown prince?'",
  "s0079": "Lord Ying said: 'Yes.'",
  "s0080": "Xie said: 'Now the King of Chu fears he will not recover from illness. Qin should return the crown prince.",
  "s0081": "If the crown prince ascends the throne, he will certainly value Qin greatly and show infinite gratitude to the prime minister. This is gaining an ally and securing ten thousand chariots.",
  "s0082": "If not returned, he will be just a commoner in Xianyang.",
  "s0083": "Chu will establish another crown prince who will certainly not serve Qin.",
  "s0084": "Losing an allied state and breaking harmony with ten thousand chariots is not wise.",
  "s0085": "I hope the prime minister will consider this carefully.'",
  "s0086": "Lord Ying reported this to the King of Qin.",
  "s0087": "The King of Qin said: 'Have the Chu crown prince's tutor first go ask about the King of Chu's illness, then we can plan afterward.'",
  "s0088": "Huang Xie planned for the Chu crown prince: 'Qin's detention of the crown prince is to seek advantage.",
  "s0089": "Now the crown prince has no strength to benefit Qin. I worry about this greatly.",
  "s0090": "Yang Wenjun and Zi Chun are in the court. If the king meets his great fate and the crown prince is not present, Yang Wenjun and Zi Chun will certainly be established as heirs. The crown prince will not be able to serve the ancestral temples.",
  "s0091": "It would be better to flee Qin, going out with the envoys.",
  "s0092": "I will stay behind and face death for it.'",
  "s0093": "The Chu crown prince changed clothes to resemble a Chu envoy's driver and escaped through the pass. Huang Xie guarded the residence, constantly feigning illness.",
  "s0094": "When he calculated the crown prince was far away and Qin could not pursue, Xie then spoke to King Zhao of Qin: 'The Chu crown prince has returned, he is far away now.",
  "s0095": "I deserve death. I beg to be granted death.'",
  "s0096": "King Zhao was greatly angered and wished to allow him to commit suicide.",
  "s0097": "Lord Ying said: 'Xie acts as a minister, risking his life to follow his lord. If the crown prince ascends, he will certainly employ Xie. It would be better to release him without guilt to befriend Chu.'",
  "s0098": "Qin thus sent Huang Xie away.",
  "s0099": "Xie reached Chu after three months. King Qingxiang of Chu died, Crown Prince Wan ascended, becoming King Kaolie.",
  "s0100": "In the first year of King Kaolie, he appointed Huang Xie as prime minister, enfeoffed him as Lord Chunshen, granting him twelve counties in the northern Huai region."
}
