{
  "s0001": "Min Yue wang Wu Zhu and Yue Dong Hai wang Yao, their first all Yue wang Gou Jian after, surname Zou shi.",
  "s0002": "Qin already bing tian xia, all free become jun zhang, with their land become Min Zhong jun.",
  "s0003": "Reach various hou pan Qin, Wu Zhu, Yao lead Yue return Po Yang ling Wu Rui, place call Po Jun, follow various hou extinguish Qin.",
  "s0004": "When this time, Xiang Ji zhu ming, not wang, with reason not attach Chu.",
  "s0005": "Han strike Xiang Ji, Wu Zhu, Yao lead Yue person zu Han.",
  "s0006": "Han five years, again establish Wu Zhu become Min Yue wang, wang Min Zhong old land, capital Dong Ye.",
  "s0007": "Xiao Hui three years, raise Gao Di time Yue merit, said Min Jun Yao merit many, their people convenient attach, then establish Yao become Dong Hai wang, capital Dong Ou, world custom number become Dong Ou wang.",
  "s0008": "After number world, reach Xiao Jing three years, Wu wang Bi rebel, desire follow Min Yue, Min Yue not willing go, alone Dong Ou follow Wu.",
  "s0009": "Reach Wu break, Dong Ou receive Han gou, kill Wu wang Dan Tu, with reason all obtain not zhu, return country.",
  "s0010": "Wu wang zi Zi Ju perish walk Min Yue, resent Dong Ou kill its father, constant advise Min Yue strike Dong Ou.",
  "s0011": "Reach Jian Yuan three years, Min Yue send troops surround Dong Ou.",
  "s0012": "Dong Ou food exhaust, kun, and descend, then make person tell urgent tian zi.",
  "s0013": "Tian zi ask tai wei Tian Fen, Fen answer said: 'Yue person each attack strike, certainly their constant, again number fan fu, not sufficient fan Zhong Guo go save.'",
  "s0014": "Self Qin time abandon not belong.'",
  "s0015": "Then zhong da fu Zhuang Zhu jie Fen said: 'Special huan strength not able save, virtue not able cover;",
  "s0016": "Cheng able, what reason abandon it?",
  "s0017": "And Qin raise Xian Yang yet abandon it, what then Yue!",
  "s0018": "Now small country with poor kun come tell urgent tian zi, tian zi not zhen, bi dang settle place tell su?",
  "s0019": "Again what with govern wan country?'",
  "s0020": "Shang said: 'Tai wei not sufficient with plan."
}
