{
  "s0051": "Entered Wu Pass, Qin ambushed troops cut off his rear, thus detained King Huai to demand territory cession.",
  "s0052": "King Huai angered, would not listen.",
  "s0053": "Fled to Zhao, Zhao would not admit him.",
  "s0054": "Returned to Qin, ultimately died in Qin and was returned for burial.",
  "s0055": "Eldest son King Qingxiang ascended, made his younger brother Zi Lan prime minister.",
  "s0056": "Chu people already blamed Zi Lan for urging King Huai to enter Qin without return.",
  "s0057": "Qu Ping having envied this, though banished, gazed back at Chu state, heart attached to King Huai, not forgetting desire to return, hoping the lord would one day awaken, customs would one day change.",
  "s0058": "His preserving the lord and reviving the state while wishing to overturn them - in one poem three times expressing this ambition.",
  "s0059": "Yet ultimately nothing could be done, thus could not return, finally showed King Huai's final lack of awakening.",
  "s0060": "Rulers, whether foolish or wise, worthy or unworthy, all wish to seek loyalty for themselves, promote worthies to assist themselves. Yet ruined states and broken families follow one after another, while sage lords govern states for generations without being seen. What they call loyal is not loyal, what they call worthy is not worthy.",
  "s0061": "King Huai because he did not know the distinction of loyal ministers, thus internally deluded by Zheng Xiu, externally deceived by Zhang Yi, distanced Qu Ping while trusting Grand Chamberlain and Prime Minister Zi Lan.",
  "s0062": "Troops defeated territory reduced, lost six commanderies, person died as guest in Qin, became world's laughter.",
  "s0063": "This is the calamity of not knowing people.",
  "s0064": "'Yi' says: 'Well leaks not drunk, makes my heart sorrowful, can draw water.",
  "s0065": "King enlightened, all receive its blessing.'",
  "s0066": "The king's lack of enlightenment, how can it bring blessing!",
  "s0067": "Prime Minister Zi Lan heard of it greatly angered, ultimately had Grand Chamberlain slander Qu Yuan to King Qingxiang. King Qingxiang angered and banished him.",
  "s0068": "Qu Yuan reached the Jiang River shore, disheveled wandering reciting by the marsh.",
  "s0069": "Complexion haggard, form withered.",
  "s0070": "Fisherman saw and asked him: 'Are you not the San Lu official?",
  "s0071": "Why have you come to this?'",
  "s0072": "Qu Yuan said: 'The whole world is muddy yet I alone am clear, everyone is drunk yet I alone am sober, thus I am banished.'",
  "s0073": "Fisherman said: 'Sages do not congeal in things and can shift with the age.",
  "s0074": "Whole world muddy, why not follow the current and raise its waves?",
  "s0075": "Everyone drunk, why not drink the dregs and sip the thin wine?",
  "s0076": "Why embrace jade and hold pearl yet make yourself banished?'",
  "s0077": "Qu Yuan said: 'I have heard, newly washed must dust the cap, newly bathed must shake the clothes. Moreover who can with body's purity receive things' defilement?",
  "s0078": "Rather enter the constant current and be buried in the Jiang fish belly, how can I with gleaming white submit to the world's dust and filth!'",
  "s0080": "Thus composed 'Huai Sha' rhapsody.",
  "s0081": "Its words say:",
  "s0082": "Bright fifth month, plants and trees dense.",
  "s0083": "Wounded heart eternal sorrow, hastening to southern lands.",
  "s0084": "Gazing deep dark, extremely quiet secluded dark.",
  "s0085": "Grievance knotted twisting pained, sorrow's long suffering;",
  "s0086": "Caressing feelings examining ambition, bending to restrain oneself.",
  "s0087": "Rounding square to make round, constant measure unchanged;",
  "s0088": "Changing beginning following precedent, gentleman despises.",
  "s0089": "Pattern drawing using ink, previous measure unchanged;",
  "s0090": "Inner straight substantial heavy, great man values.",
  "s0091": "Skilled artisan not hews, who examines its standard correctness?",
  "s0092": "Dark patterns hidden place, blind calls it not bright;",
  "s0093": "Li Lou subtle gaze, blind considers it no sight.",
  "s0094": "Changing white to black, inverting top to bottom.",
  "s0095": "Phoenix in cage, chickens fly dance.",
  "s0096": "Mixing jade stone together, same yet compared.",
  "s0097": "Faction men's base jealousy, utterly unknown my treasure.",
  "s0098": "Bearing heavy carrying full, sinking stuck not crossing;",
  "s0099": "Embracing jade holding pearl, destitute cannot show to others.",
  "s0100": "City dogs pack barking, barking what they consider strange;",
  "s0101": "Slandering steeds doubting Jie, originally common attitude."
}