{
  "s0307": "Second Emperor angered said: 'I often many leisure days, chancellor not come.",
  "s0308": "I just feast private, chancellor immediately come request affairs.",
  "s0309": "Chancellor how little me?",
  "s0310": "Moreover firmly mock me?'",
  "s0311": "Zhao Gao thus said: 'Like this dangerous!",
  "s0312": "That Shaqiu plot, chancellor with participate.",
  "s0313": "Now Your Majesty already established as emperor, yet chancellor noble not increase, this his intent also hope split land become king.",
  "s0314": "Moreover Your Majesty not ask minister, minister dare not speak.",
  "s0315": "Chancellor eldest son Li You as three rivers guard, Chu bandits Chen Sheng etc. all chancellor side county sons, thus Chu bandits public act, pass three rivers, city guard not willing attack.",
  "s0316": "Gao heard their letters mutually go come, not obtain its truth, thus not dare with hear.",
  "s0317": "Moreover chancellor dwell outside, power heavy over Your Majesty.'",
  "s0318": "Second Emperor considered correct.",
  "s0319": "Wished investigate chancellor, feared not careful, then made person investigate verify three rivers guard with bandits communicate situation.",
  "s0320": "Li Si heard.",
  "s0321": "At time Second Emperor at Gan Quan, just make hub di excellent pai of view.",
  "s0322": "Li Si could not see, thus submitted letter speak Zhao Gao short: 'Minister heard, minister doubt his lord, none not danger state;",
  "s0323": "Concubine doubt her husband, none not danger family.",
  "s0324": "Now have great minister at Your Majesty monopolize benefit monopolize harm, with Your Majesty no different, this very inconvenient.",
  "s0325": "Former Si Cheng Zi Han as Song chancellor, body execute punishment, with might execute, one year then kidnap his lord.",
  "s0326": "Tian Chang as Jian Gong minister, rank column without enemy in state, private family rich with public family equal, spread favor apply virtue, below get hundred surnames, above get ministers, secretly take Qi state, kill Zai Yu at court, then assassinated Jian Gong at court, thus had Qi state.",
  "s0327": "This world all clearly know.",
  "s0328": "Now Gao have evil licentious will, danger rebel conduct, like Zi Han as Song chancellor;",
  "s0329": "Private family rich, like Tian clan at Qi.",
  "s0330": "Combined execute Tian Chang, Zi Han reverse way kidnap Your Majesty might trust, his will like Han Wei as Han An chancellor.",
  "s0331": "Your Majesty not plan, minister fear his become change.'",
  "s0332": "Second Emperor said: 'What?",
  "s0333": "Gao, former eunuch person, yet not for safe unrestrained intent, not with danger change heart, pure conduct cultivate good, self make to this, with loyal get advance, with trust guard position, I truly consider worthy, yet lord doubt, why?",
  "s0334": "Moreover I young lose previous person, no know identify, not practice govern people, yet lord again old, fear with world cut.",
  "s0335": "I not entrust Zhao Jun, should who employ?",
  "s0336": "Moreover Zhao Jun as person refined clean strong force, below know people feeling, above can suit me, lord not doubt.'",
  "s0337": "Li Si said: 'Not so.",
  "s0338": "Gao, former base person, no know reason, greedy desire no sate, seek profit not stop, arrange power next lord, seek desire no end, minister thus said dangerous.'",
  "s0339": "Second Emperor already front trust Zhao Gao, fear Li Si kill him, thus secretly told Zhao Gao.",
  "s0340": "Gao said: 'Chancellor what fear only Gao, Gao already dead, chancellor then wish do Tian Chang what.'",
  "s0341": "Thus Second Emperor said: 'Then with Li Si entrust langzhong commander!'",
  "s0343": "Zhao Gao investigate treat Li Si.",
  "s0344": "Li Si constrained grasped bound, dwell prison middle, face heaven sigh: 'Alas, sorrow!",
  "s0345": "Not way lord, how can plan!",
  "s0346": "Former Jie kill Guan Long Feng, Zhou kill Wang Zi Bi Gan, Wu Wang Fu Cha kill Wu Zi Xu.",
  "s0347": "These three ministers, how not loyal, yet not avoid die, body die yet what loyal not correct.",
  "s0348": "Now my wisdom not reach three sons, yet Second Emperor no way over Jie, Zhou, Fu Cha, I with loyal die, suitable.",
  "s0349": "Moreover Second Emperor govern how not chaos!",
  "s0350": "Previously exterminate his brothers self establish, kill loyal ministers honor base people, make Epang palace, tax levy world.",
  "s0351": "I not not admonish, yet not listen me.",
  "s0352": "All ancient sage kings, eat drink have limit, chariot vessels have number, palace rooms have degree, issue order make affairs, add expense without benefit people profit prohibit, thus can long lasting peaceful govern.",
  "s0353": "Now act reverse to brothers, not consider guilt;",
  "s0354": "Invade kill loyal ministers, not think calamity;",
  "s0355": "Great make palace rooms, thick tax world, not love expense: three already execute, world not listen.",
  "s0356": "Now oppose already have world half, yet heart not yet awaken, yet with Zhao Gao as assistant, I must see bandit reach Xianyang, deer roam court.'",
  "s0358": "Thus Second Emperor made Gao investigate chancellor prison, treat crime, blame Si with son You plot rebel situation, all seize capture clan guests.",
  "s0359": "Zhao Gao treat Si, beat lash thousand plus, not endure pain, self falsely confess.",
  "s0360": "Si what not die, self bear his eloquence, have merit, truly no rebel heart, fortunate get submit letter self state, fortunate Second Emperor awaken pardon.",
  "s0361": "Li Si then from prison middle submit letter: 'Minister as chancellor govern people, thirty plus years.",
  "s0362": "Reach Qin land narrow narrow.",
  "s0363": "Previous king time Qin land not over thousand li, troops several ten thousand.",
  "s0364": "Minister exhaust thin talent, respectfully follow law orders, secretly execute plot ministers, provide gold jade, make wander persuade feudal lords, secretly cultivate armor troops, adorn government teaching, manage fight scholars, honor merit ministers, flourish their rank salary, thus finally with threaten Han weaken Wei, break Yan, Zhao, level Qi, Chu, finally unite six states, capture their kings, establish Qin as emperor.",
  "s0365": "Crime one.",
  "s0366": "Land not not broad, again north pursue Hu, Mo, south decide hundred Yue, to see Qin strong.",
  "s0367": "Crime two.",
  "s0368": "Honor ministers, flourish their rank position, to solidify close.",
  "s0369": "Crime three.",
  "s0370": "Establish state altars, cultivate ancestral temples, to clarify lord worthy.",
  "s0371": "Crime four.",
  "s0372": "Change carve draw, level dou hu measure amount writings, spread world, to establish Qin name.",
  "s0373": "Crime five.",
  "s0374": "Treat gallop roads, raise tour views, to see lord get intent.",
  "s0375": "Crime six.",
  "s0376": "Relax punishment, thin tax levy, to follow lord get crowd heart, myriad people wear lord, die not forget.",
  "s0377": "Crime seven.",
  "s0378": "Like Si as minister, crime sufficient die certainly long.",
  "s0379": "Above fortunate exhaust ability, then get to now, wish Your Majesty examine!'",
  "s0380": "Letter submitted, Zhao Gao made officials discard not present, said: 'Prisoner how can submit letter!'",
  "s0382": "Zhao Gao made his guests ten plus falsely as imperial secretaries, ye zhe, serving middle, again go repeat question Si.",
  "s0383": "Si again with truth reply, immediately made person again beat.",
  "s0384": "After Second Emperor made person verify Si, Si considered like front, end dare not again speak, words confess.",
  "s0385": "Present when upper, Second Emperor pleased said: 'Without Zhao Jun, almost sold by chancellor.'",
  "s0386": "When Second Emperor made investigate three rivers guard arrive, then Xiang Liang already attacked kill him.",
  "s0387": "Envoy come, meet chancellor send officials, Zhao Gao all falsely made rebel words.",
  "s0388": "Second Emperor second year seventh month, prepare Si five punishments, judge waist behead Xianyang market.",
  "s0389": "Si exit prison, with middle son both grasped, look back told middle son: 'I wish with you again lead yellow dog together exit Shangcai east gate chase cunning rabbit, how can obtain!'",
  "s0390": "Thus father son mutually cry, exterminate three clans.",
  "s0391": "Li Si already dead, Second Emperor appoint Zhao Gao as middle chancellor, affairs no small big immediately decided by Gao.",
  "s0392": "Gao self know power heavy, then offered deer, called horse.",
  "s0393": "Second Emperor asked left right: 'This deer?'",
  "s0394": "Left right all said 'horse'.",
  "s0395": "Second Emperor startled, self considered confused, then summoned grand diviner, commanded divine, grand diviner said: 'Your Majesty spring autumn suburban sacrifice, serve ancestral temples ghosts gods, fast not clear, thus to this.",
  "s0396": "Can rely flourishing virtue clear fast.'",
  "s0397": "Thus then enter Shanglin fast.",
  "s0398": "Day tour shoot hunt, had traveler enter Shanglin middle, Second Emperor self shoot kill him.",
  "s0399": "Zhao Gao taught his son-in-law Xianyang commander Yan Le impeach not know what person thief kill person shift Shanglin.",
  "s0400": "Gao then admonished Second Emperor: 'Emperor without reason thief kill innocent person, this heaven forbid, ghosts gods not enjoy, heaven will descend calamity, should far avoid palace to avoid.'",
  "s0401": "Second Emperor then exit dwell Wang Yi palace.",
  "s0402": "Stay three days, Zhao Gao falsely decree guards, commanded scholars all plain clothes hold weapons inner face, enter tell Second Emperor: 'East mountains crowd bandits troops big arrive!'",
  "s0403": "Second Emperor ascend observe see, fear frightened, Gao already because kidnap commanded suicide.",
  "s0404": "Pull seal hang, left right hundred officials none follow;",
  "s0405": "Ascend hall, hall wish collapse three.",
  "s0406": "Gao self know heaven not give, ministers not permit, then summoned Shi Huang younger brother, gave seal.",
  "s0407": "Zi Ying already position, worried, then called illness not listen affairs, with eunuch Han Tan and son plan kill Gao.",
  "s0408": "Gao ascend audience, request illness, because summoned enter, commanded Han Tan stab kill, exterminate three clans.",
  "s0409": "Zi Ying establish three months, Pei Gong troops from Wu Guan enter, reach Xianyang, ministers hundred officials all rebel, not proper.",
  "s0410": "Zi Ying with wife children self tie neck with cord, surrender Zhi Dao side.",
  "s0411": "Pei Gong because give to officials.",
  "s0412": "Xiang Wang arrive then behead.",
  "s0413": "Thus with lose world.",
  "s0414": "Grand Historian said: Li Si with alley door through feudal lords, enter serve Qin, take advantage flaws, assist Shi Huang, finally complete emperor enterprise, Si as three dukes, can call honored used.",
  "s0415": "Si know six arts return, not manage clear government supplement lord above deficiency, hold rank salary heavy, flatter follow casual match, strict might cruel punishment, listen Gao evil speech, abolish proper establish concubine.",
  "s0416": "Feudal lords already rebel, Si then wish admonish contend, not also late!",
  "s0417": "People all consider Si extreme loyal yet suffer five punishments die, examine its root, then with vulgar discuss different.",
  "s0418": "Not so, Si merit moreover with Zhou, Zhao listed."
}

