{
  "s0320": "I lack wisdom, cannot identify.",
  "s0321": "These are all that ancient times did not reach, yet Emperor Wen personally practiced them.",
  "s0322": "Virtue thick matches heaven and earth, benefit and favor extends to the four seas, nothing does not obtain fortune.",
  "s0323": "Illuminates like sun and moon, while temple music does not match.",
  "s0324": "I greatly fear this.",
  "s0325": "Let Emperor Wen's temple have the Zhaode dance, to manifest beautiful virtue.",
  "s0326": "Then ancestors' merit and virtue will be recorded in bamboo and silk, applied to ten thousand worlds, forever without end, I greatly rejoice in this.",
  "s0327": "Let it be with the chancellor, marquises, officials of two thousand shi, and rites officials to fully compose the rites and submit.'",
  "s0328": "Chancellor minister Jia and others said: 'Your Majesty forever thinks of filial piety, establishes the Zhaode dance to manifest Emperor Wen's abundant virtue.",
  "s0329": "All minister Jia and others' foolishness does not reach this.",
  "s0330": "We respectfully discuss: World merit is not greater than Gao Emperor, virtue is not more abundant than Emperor Wen, Gao Emperor's temple should be the emperor's Taizu temple, Emperor Wen's temple should be the emperor's Taizong temple.",
  "s0331": "The Son of Heaven should generation after generation offer to ancestors' temples.",
  "s0332": "Commandery and state feudal lords should each establish a Taizong temple for Emperor Wen.",
  "s0333": "Feudal kings and marquises' envoys attend and sacrifice to the emperor, yearly offer to ancestors' temples.",
  "s0334": "We request to record it in bamboo and silk, announce to the world.'",
  "s0335": "The edict said: 'Approved.'",
  "s0337": "The Grand Historian says: Confucius said 'Must be successive generations then benevolent.",
  "s0338": "Good people's governance of country for a hundred years, moreover can overcome cruelty and go killing'.",
  "s0339": "Indeed this saying!",
  "s0340": "Han rose, to Emperor Wen forty more years, virtue reached abundance.",
  "s0341": "Nearly approached correcting calendar, clothes, Feng and Shan sacrifices, but modesty and yielding not completed to now.",
  "s0342": "Alas, how not benevolent!"
}
