{
  "s0202": "Moreover heaven earth as furnace, creation as artisan;",
  "s0203": "Yin yang as charcoal, myriad things as copper.",
  "s0204": "Combine disperse wax wane, how have constant rule;",
  "s0205": "Thousand changes ten thousand transformations, not begun have extreme.",
  "s0206": "Suddenly become human, what sufficient control grasp;",
  "s0207": "Transform become different thing, again what sufficient worry!",
  "s0208": "Small knowledge self-private, belittle others value self;",
  "s0209": "Greatly connected great view, things nothing cannot.",
  "s0210": "Greedy man risk wealth, fierce scholars risk name;",
  "s0211": "Boasters die for power, common people rely on life.",
  "s0212": "Urged pressed followers, or hurry west east;",
  "s0213": "Great man not bent, hundred million changes same together.",
  "s0214": "Constrained scholar tied customs, entangled like prisoner restrained;",
  "s0215": "Perfect man abandons things, alone with way together.",
  "s0216": "Crowd confused confused, good evil accumulate intention;",
  "s0217": "True person indifferent indifferent, alone with way rest.",
  "s0218": "Release knowledge abandon form, transcend self-forget;",
  "s0219": "Vast empty sudden wild, with way soar fly.",
  "s0220": "Ride current then go, obtain shore then stop;",
  "s0221": "Release body entrust fate, not private with self.",
  "s0222": "His life like float, his death like rest;",
  "s0223": "Indifferent like deep abyss quiet, broad like untied boat.",
  "s0224": "Not because life self-treasure, nourish emptiness float;",
  "s0225": "Virtue man no burden, know fate not worry.",
  "s0226": "Small matters far distant, what sufficient doubt!",
  "s0227": "Later year plus, Jia Sheng summoned seen.",
  "s0228": "Filial Wen emperor just received li, sat Xuanshi.",
  "s0229": "Above thus sensed ghosts spirits affairs, asked ghosts spirits foundation.",
  "s0230": "Jia Sheng thus completely spoke its so condition.",
  "s0231": "To midnight, Wen emperor advanced mat.",
  "s0232": "Having finished, said: 'I long not see Jia Sheng, self-considered surpassed him, now cannot match.'",
  "s0233": "Dwelt moment, appointed Jia Sheng as Liang Huai King tutor.",
  "s0234": "Liang Huai King, Wen emperor young son, loved, and liked books, thus commanded Jia Sheng tutor him.",
  "s0235": "Wen emperor again enfeoffed Huainan Li Wang sons four people all as marquises.",
  "s0236": "Jia Sheng advised, considered calamity rise from this.",
  "s0237": "Jia Sheng several times submitted memorials, spoke various marquises connected several commanderies, not ancient system, can gradually reduce them.",
  "s0238": "Wen emperor not listened.",
  "s0239": "Dwelt several years, Huai Wang rode, fell horse died, no posterity.",
  "s0240": "Jia Sheng self-injured as tutor without achievement, wept year plus, also died.",
  "s0241": "Jia Sheng death time age thirty-three.",
  "s0242": "When Filial Wen collapsed, Filial Wu emperor ascended, promoted Jia Sheng grandsons two to commandery governors, Jia Jia most liked learning, inherited family, with me exchanged letters.",
  "s0243": "To Filial Zhao time, listed as nine ministers.",
  "s0244": "Grand Historian says: I read 'Li Sao', 'Tian Wen', 'Zhao Hun', 'Ai Ying', sorrowful his ambition.",
  "s0245": "Passed Changsha, viewed Qu Yuan self-drowned abyss, never not shed tears, imagined saw his person.",
  "s0246": "When saw Jia Sheng mourn him, again strange Qu Yuan with his talent, traveled feudal lords, what state not contain, yet self made like this.",
  "s0247": "Read 'Fu Niao' rhapsody, same death life, light depart stay, again clearly self-lost."
}

