{
  "s0452": "Twenty two years, Wei Yang strike Wei, capture Wei Gong Zi Ang.",
  "s0453": "Seal Yang become Lie Hou, number Shang Jun.",
  "s0454": "Twenty four years, with Jin battle Yan Men, capture its general Wei Cuo.",
  "s0455": "Xiao Gong die, son Hui Wen Jun establish.",
  "s0456": "Is year, punish Wei Yang.",
  "s0457": "Yang initial for Qin apply method, method not walk, crown prince violate forbid.",
  "s0458": "Yang said: 'Method not walk, self noble relative.",
  "s0459": "Jun must desire walk method, first crown prince.",
  "s0460": "Crown prince not able tattoo, tattoo its fu shi.'",
  "s0461": "Then method big use, Qin people govern.",
  "s0462": "Reach Xiao Gong die, crown prince establish, Zong Shi many resent Yang, Yang flee, because with become rebel, yet finally cart split to parade Qin state.",
  "s0463": "Hui Wen Jun first year, Chu, Han, Zhao, Shu people come court.",
  "s0464": "Two years, heavenly son congratulate.",
  "s0465": "Three years, wang crown.",
  "s0466": "Four years, heavenly son present Wen Wu blessing.",
  "s0467": "Qi, Wei become wang.",
  "s0468": "Five years, Yin Jin person Xi Shou become big good make.",
  "s0469": "Six years, Wei enter Yin Jin, Yin Jin change name Ning Qin.",
  "s0470": "Seven years, Gong Zi Ang with Wei battle, capture its general Long Jia, cut head eighty thousand.",
  "s0471": "Eight years, Wei enter He west earth.",
  "s0472": "Nine years, cross He, take Fen Yin, Pi Shi.",
  "s0473": "With Wei wang meet Ying.",
  "s0474": "Surround Jiao, descend it.",
  "s0475": "Ten years, Zhang Yi prime Qin.",
  "s0476": "Wei enter Shang Jun fifteen county.",
  "s0477": "Eleven years, county Yi Qu.",
  "s0478": "Return Wei Jiao, Qu Wo.",
  "s0479": "Yi Qu jun become minister.",
  "s0480": "Change name Shao Liang said Xia Yang.",
  "s0481": "Twelve years, initial La.",
  "s0482": "Thirteen years four month Wu Wu, Wei jun become wang, Han also become wang.",
  "s0483": "Make Zhang Yi attack take Xia, exit its people with Wei.",
  "s0484": "Fourteen years, change become first year.",
  "s0485": "Two years, Zhang Yi with Qi, Chu ministers meet Nie Sang.",
  "s0486": "Three years, Han, Wei crown prince come court.",
  "s0487": "Zhang Yi prime Wei.",
  "s0488": "Five years, wang tour reach north He.",
  "s0489": "Seven years, Le Chi prime Qin.",
  "s0490": "Han, Zhao, Wei, Yan, Qi lead Xiong Nu together attack Qin.",
  "s0491": "Qin make common long Ji with battle Xiu Yu, capture its general Shen Chai, defeat Zhao Gong Zi Ke, Han crown prince Huan, cut head eighty two thousand.",
  "s0492": "Eight years, Zhang Yi again prime Qin.",
  "s0493": "Nine years, Si Ma Cuo attack Shu, extinguish it.",
  "s0494": "Attack take Zhao Zhong Du, Xi Yang ten years, Han crown prince Cang come pledge.",
  "s0495": "Attack take Han Shi Zhang.",
  "s0496": "Attack defeat Zhao general Ni.",
  "s0497": "Attack take Yi Qu twenty five city.",
  "s0498": "Eleven years, Qiang Li Ji attack Wei Jiao, descend it.",
  "s0499": "Defeat Han An Men, cut head ten thousand, its general Xi Shou flee.",
  "s0500": "Gong Zi Tong seal at Shu.",
  "s0501": "Yan jun yield its minister Zi Zhi."
}

