{
  "s0352": "Thirty nine years, Chu Ling Wang strong, meet feudal lords at Shen, become meng main, kill Qi Qing Feng.",
  "s0353": "Jing Gong establish forty years die, son Ai Gong establish.",
  "s0354": "Hou Zi again come return Qin.",
  "s0355": "Ai Gong eight years, Chu Gong Zi Qi Ji kill Ling Wang yet self establish, is Ping Wang.",
  "s0356": "Eleven years, Chu Ping Wang come seek Qin woman become crown prince Jian wife.",
  "s0357": "Reach state, woman good yet self take it.",
  "s0358": "Fifteen years, Chu Ping Wang desire punish Jian, Jian flee;",
  "s0359": "Wu Zi Xu flee Wu.",
  "s0360": "Jin Gong chamber low yet six Qing strong, desire inner mutual attack, therefore long Qin Jin not mutual attack.",
  "s0361": "Thirty one years, Wu wang He Lu with Wu Zi Xu attack Chu, Chu wang flee run Sui, Wu then enter Ying.",
  "s0362": "Chu da fu Shen Bao Xu come inform urgent, seven days not eat, day night cry weep.",
  "s0363": "Then Qin then send five hundred ascend save Chu, defeat Wu troops.",
  "s0364": "Wu troops return, Chu Zhao Wang then able again enter Ying.",
  "s0365": "Ai Gong establish thirty six years die.",
  "s0366": "Crown prince Yi Gong, Yi Gong early die, not able establish, establish Yi Gong son, is Hui Gong.",
  "s0367": "Hui Gong first year, Kong Qiu walk Lu prime affairs.",
  "s0368": "Five years, Jin Qing Zhong Xing, Fan clan rebel Jin, Jin make Zhi clan, Zhao Jian Zi attack it, Fan, Zhong Xing clan flee run Qi.",
  "s0369": "Hui Gong establish ten years die, son Dao Gong establish.",
  "s0370": "Dao Gong two years, Qi minister Tian Qi kill its jun Ru Zi, establish its brother Yang Sheng, is Dao Gong.",
  "s0371": "Six years, Wu defeat Qi troops.",
  "s0372": "Qi people kill Dao Gong, establish its son Jian Gong.",
  "s0373": "Nine years, Jin Ding Gong with Wu wang Fu Chai ally, contend long at Huang Chi, finally first Wu.",
  "s0374": "Wu strong, oppress China.",
  "s0375": "Twelve years, Qi Tian Chang kill Jian Gong, establish its younger brother Ping Gong, Chang prime it.",
  "s0376": "Thirteen years, Chu extinguish Chen.",
  "s0377": "Qin Dao Gong establish fourteen years die, son Li Gong Gong establish.",
  "s0378": "Kong Qiu with Dao Gong twelve years die.",
  "s0379": "Li Gong Gong two years, Shu people come bribe.",
  "s0380": "Sixteen years, trench He side.",
  "s0381": "With troops twenty thousand attack Da Li, take its wang city.",
  "s0382": "Twenty one years, initial county Pin Yang.",
  "s0383": "Jin take Wu Cheng.",
  "s0384": "Twenty four years, Jin chaos, kill Zhi Bo, divide its state with Zhao, Han, Wei.",
  "s0385": "Twenty five years, Zhi Kai with yi people come flee.",
  "s0386": "Thirty three years, attack Yi Qu, capture its wang.",
  "s0387": "Thirty four years, day eat.",
  "s0388": "Li Gong Gong die, son Zao Gong establish.",
  "s0389": "Zao Gong two years, Nan Zheng rebel.",
  "s0390": "Thirteen years, Yi Qu come attack, reach Wei Nan.",
  "s0391": "Fourteen years, Zao Gong die, establish its younger brother Huai Gong.",
  "s0392": "Huai Gong four years, common long Chao with ministers surround Huai Gong, Huai Gong self kill.",
  "s0393": "Huai Gong crown prince said Zhao Zi, early die, ministers then establish crown prince Zhao Zi son, is Ling Gong.",
  "s0394": "Ling Gong, Huai Gong grandson.",
  "s0395": "Ling Gong six years, Jin wall Shao Liang, Qin strike it.",
  "s0396": "Thirteen years, wall Ji Gu.",
  "s0397": "Ling Gong die, son Xian Gong not able establish, establish Ling Gong season father Dao Zi, is Jian Gong.",
  "s0398": "Jian Gong, Zhao Zi younger brother yet Huai Gong son.",
  "s0399": "Jian Gong six years, command li initial wear sword.",
  "s0400": "Trench Luo.",
  "s0401": "Wall Chong Quan."
}

