{
  "s0001": "Lu Zhonglian was a man of Qi.",
  "s0002": "He delighted in extraordinary and unconventional strategies, yet refused to take office or hold position, preferring to maintain high principles.",
  "s0003": "He traveled in Zhao.",
  "s0004": "During Zhao King Xiaocheng's time, Qin king sent Bai Qi to break Zhao's Changping army, killing over 400,000 before and after. Qin troops then advanced east to besiege Handan.",
  "s0005": "Zhao king feared, the feudal lords' rescue troops none dared attack Qin army.",
  "s0006": "Wei King Anli sent general Jin Bi to rescue Zhao, but fearing Qin, stopped at Dangyin without advancing.",
  "s0007": "Wei king sent guest general Xin Yuan Der secretly enter Handan, through Lord Pingyuan tell Zhao king: 'What Qin urgently besieges Zhao for is previously contending with Qi King Min for strength to become emperor, then again abandoning it.",
  "s0008": "Now Qi King Min already much weakened. Currently only Qin is strongest in world. This is not necessarily greedy for Handan, their intent wishes again to seek becoming emperor.'",
  "s0009": "If Zhao truly sends envoys to honor Qin King Zhao as emperor, Qin will certainly be pleased, withdraw troops depart.'",
  "s0010": "Lord Pingyuan hesitated, not yet decided.",
  "s0011": "At this time Lu Zhonglian happened to travel in Zhao, meeting Qin besiege Zhao. Heard Wei would have Zhao honor Qin as emperor, thus saw Lord Pingyuan saying: 'The matter will be handled how?'",
  "s0012": "Lord Pingyuan said: 'How dare Sheng speak of matters!",
  "s0013": "Previously lost 400,000 troops outside, now again internally besieged in Handan cannot leave.",
  "s0014": "Wei king sent guest general Xin Yuan Der to have Zhao make Qin emperor, now that person is here.",
  "s0015": "How dare Sheng speak of matters!'",
  "s0016": "Lu Zhonglian said: 'I initially considered you the world's worthy lord. Only now do I know you are not the world's worthy lord.",
  "s0017": "Where is Wei guest Xin Yuan Der?",
  "s0018": "I request for you to reproach and send him back.'",
  "s0019": "Lord Pingyuan said: 'Sheng requests to introduce and present him to master.'",
  "s0020": "Lord Pingyuan thus saw Xin Yuan Der saying: 'Eastern regions have Master Lu Zhonglian, now that person is here. Sheng requests to introduce, have him meet the general.'",
  "s0021": "Xin Yuan Der said: 'I have heard of Master Lu Zhonglian, Qi's high scholar.",
  "s0022": "Der is subject's minister, missions have duties. I do not wish to see Master Lu Zhonglian.'",
  "s0023": "Lord Pingyuan said: 'Sheng has already revealed it.'",
  "s0024": "Xin Yuan Der agreed.",
  "s0025": "Lu Zhonglian saw Xin Yuan Der but said nothing.",
  "s0026": "Xin Yuan Der said: 'I see those dwelling in this besieged city all have requests of Lord Pingyuan.",
  "s0027": "Now I observe master's jade appearance, not one with requests of Lord Pingyuan. Why stay long in this besieged city without leaving?'",
  "s0028": "Lu Zhonglian said: 'The world considers Bao Jiao one who died without followers and eulogies, all are wrong.",
  "s0029": "If the multitude does not understand, then for one's self.",
  "s0030": "That Qin is a state that abandons ritual and righteousness to prize first merit. Weighs its scholars, enslaves its people.",
  "s0031": "If they recklessly become emperor, exceeding to govern the world, then Zhonglian has only to tread East Sea and die. I cannot bear to be their people.",
  "s0032": "The reason for seeing the general is to aid Zhao.'",
  "s0033": "Xin Yuan Der said: 'How will master aid it?'",
  "s0034": "Lu Zhonglian said: 'I will make Wei and Yan aid it, Qi and Chu already aid it.'",
  "s0035": "Xin Yuan Der said: 'Yan then I request to follow.",
  "s0036": "As for Wei, I am Wei man. How can master make Wei aid it?'",
  "s0037": "Lu Zhonglian said: 'Wei has not seen the harm of Qin claiming emperor.'",
  "s0038": "If Wei sees the harm of Qin claiming emperor, will certainly aid Zhao.'",
  "s0039": "Xin Yuan Der said: 'What is the harm of Qin claiming emperor?'",
  "s0040": "Lu Zhonglian said: 'In former times Qi King Wei once practiced benevolence and righteousness, led world feudal lords to attend court at Zhou.",
  "s0041": "Zhou poor and small, feudal lords none attended court, only Qi alone attended.",
  "s0042": "After over a year, Zhou King Lie died. Qi arrived later. Zhou angered, announced to Qi: \"Heaven collapses earth splits, Son of Heaven descends from mat.",
  "s0043": "Eastern vassal minister because Qi arrived late, then decapitated.\"",
  "s0044": "Qi King Wei angrily said: 'Scold! You are mother's slave!'",
  "s0045": "Ultimately became world's laughter.",
  "s0046": "Therefore alive attend court at Zhou, dead scold it. Truly cannot bear their demands.",
  "s0047": "That Son of Heaven is like this, nothing to wonder at.'",
  "s0048": "Xin Yuan Der said: 'Does master not see the lackey?",
  "s0049": "Ten people following one person, is it strength not equal and wisdom not matching?",
  "s0050": "They fear him.'"
}
