{
  "s0001": "Han Wang Xin, former Han Xiang Wang bastard grandson, long eight chi five cun.",
  "s0002": "Reach Xiang Liang establish Chu after Huai Wang, Yan, Qi, Zhao, Wei all already before wang, only Han no have after, therefore establish Han various gong zi Heng Yang Jun Cheng become Han Wang, desire with pacify settle Han old land.",
  "s0003": "Xiang Liang defeat die Ding Tao, Cheng flee Huai Wang.",
  "s0004": "Pei Gong lead troops strike Yang Cheng, make Zhang Liang with Han si tu descend Han old land, obtain Xin, become Han jiang, lead his troops follow Pei Gong enter Wu Guan.",
  "s0005": "Pei Gong establish become Han Wang, Han Xin follow enter Han Zhong, then say Han Wang said: 'Xiang Wang wang various jiang near land, yet wang alone far dwell this, this left move.'",
  "s0006": "Shi zu all Shan Dong person, qi yet hope return, reach its front east xiang, able contend tian xia.'",
  "s0007": "Han Wang return settle three Qin, then allow Xin become Han Wang, first appoint Xin become Han tai wei, lead troops sweep Han land.",
  "s0008": "Xiang Ji seal various wang all go country, Han Wang Cheng with not follow no merit, not send go country, change become lie hou.",
  "s0009": "Reach hear Han send Han Xin sweep Han land, then make former Xiang Ji you Wu time Wu ling Zheng Chang become Han Wang with resist Han.",
  "s0010": "Han two years, Han Xin sweep settle Han ten remain city.",
  "s0011": "Han Wang reach He Nan, Han Xin urgent strike Han Wang Chang Yang Cheng.",
  "s0012": "Chang descend, Han Wang then establish Han Xin become Han Wang, constant lead Han troops follow.",
  "s0013": "Three years, Han Wang out Xing Yang, Han Wang Xin, Zhou Ke wait guard Xing Yang.",
  "s0014": "Reach Chu defeat Xing Yang, Xin descend Chu, already yet obtain flee, again return Han, Han again establish become Han Wang, finally follow strike break Xiang Ji, tian xia settle.",
  "s0015": "Five years spring, then with carve fu become Han Wang, wang Ying Chuan.",
  "s0016": "Next year spring, shang with Han Xin cai wu, place wang north near Gong, Luo, south press Wan, Ye, east have Huai Yang, all tian xia strong troops place, then zhao move Han Wang Xin wang Tai Yuan with north, prepare yu Hu, capital Jin Yang.",
  "s0017": "Xin shang book said: 'Country border edge, Xiong Nu number enter, Jin Yang go sai far, please govern Ma Yi.'",
  "s0018": "Shang allow it, Xin then move govern Ma Yi.",
  "s0019": "Autumn, Xiong Nu Mao Dun big surround Xin, Xin number make shi Hu seek peace dissolve.",
  "s0020": "Han send troops save it, suspect Xin number space shi, have two heart, make person blame let Xin."
}

