{
  "s0104": "Letter and seal all in Zhao Gao place, only son Hu Hai, chancellor Li Si, Zhao Gao and favored eunuchs five six persons knew Shi Huang collapsed, other ministers all not know.",
  "s0105": "Li Si considered above outside collapsed, no true crown prince, thus secret it.",
  "s0106": "Placed Shi Huang in feather canopy carriage middle, hundred officials presented affairs offered food as before, eunuchs from feather canopy carriage middle approved various presented affairs.",
  "s0107": "Zhao Gao thus detained granted Fu Su seal letter, told crown prince Hu Hai: 'Above collapsed, no decree seal kings various sons yet alone grant eldest son letter.",
  "s0108": "Eldest son arrive, then establish as emperor, you no chi soil land, do what?'",
  "s0109": "Hu Hai said: 'Certainly.",
  "s0110": "I heard, enlightened lord knows ministers, enlightened father knows sons.",
  "s0111": "Father abandons life, not enfeoff various sons, what speak!'",
  "s0112": "Zhao Gao said: 'Not so.",
  "s0113": "Now world power, exist perish in you and Gao and chancellor, wish you plan.",
  "s0114": "Moreover minister person with see minister by person, control person with see controlled by person, how same day speak!'",
  "s0115": "Hu Hai said: 'Abolish elder brother establish younger brother, not righteous;",
  "s0116": "Not follow father decree fear death, not filial;",
  "s0117": "Ability thin materials shallow, strong take others merit, not able: three reverse virtue, world not submit, body danger incline peril, state altars not blood food.'",
  "s0118": "Gao said: 'I heard Tang, Wu killed their lords, world called righteous, not not loyal.",
  "s0119": "Wei lord killed his father, Wei state carried his virtue, Confucius wrote it, not not filial.",
  "s0120": "Great conduct not small careful, flourishing virtue not decline yield, village quarter each has suitable hundred officials different merit.",
  "s0121": "Thus look small forget great, after must harm;",
  "s0122": "Fox doubt hesitate, after must regret.",
  "s0123": "Decide dare act, ghosts gods avoid it, after have success.",
  "s0124": "Wish you follow it!'",
  "s0125": "Hu Hai sighed deeply: 'Now great conduct not issued, mourning ritual not end, how suitable with this affair bother chancellor!'",
  "s0126": "Zhao Gao said: 'Time time, interval not reach plan!",
  "s0127": "Winnow grain leap horse, only fear after time!'",
  "s0129": "Hu Hai already like Gao words, Gao said: 'Not with chancellor plan, fear affair cannot complete, minister request for you with chancellor plan.'",
  "s0130": "Gao then told chancellor Si: 'Above collapsed, granted eldest son letter, with funeral meet Xianyang establish as heir.",
  "s0131": "Letter not issued, now above collapsed, none have know.",
  "s0132": "What granted eldest son letter and tally seal all in Hu Hai place, decide crown prince in lord marquis and Gao mouth.",
  "s0133": "Affair will how?'",
  "s0134": "Si said: 'How get perished state words!",
  "s0135": "This not person minister should discuss!'",
  "s0136": "Gao said: 'Lord marquis self-measure can compare Meng Tian?",
  "s0137": "Merit high compare Meng Tian?",
  "s0138": "Plan far not lose compare Meng Tian?",
  "s0139": "No resentment in world compare Meng Tian?",
  "s0140": "Eldest son old faithful compare Meng Tian?'",
  "s0141": "Si said: 'These five all not reach Meng Tian, lord blame why deep?'",
  "s0142": "Gao said: 'Gao certainly inner official menial, fortunately with knife pen writing enter Qin palace, manage affairs twenty plus years, not tasted see Qin dismiss chancellor merit ministers have seal to second generation, finally all with execution perished.",
  "s0143": "Emperor twenty plus sons, all lord know.",
  "s0144": "Eldest son firm resolute martial brave, trust people encourage scholars, ascend position must use Meng Tian as chancellor, lord marquis end not carry marquis seal return home village, clear.",
  "s0145": "Gao received decree teach practice Hu Hai, made study laws affairs several years, not tasted see fault.",
  "s0146": "Benevolent kind sincere thick, light wealth heavy scholars, sharp at heart yield at mouth, exhaust ritual respect scholars, Qin various sons none reach this, can be heir.",
  "s0147": "Lord plan decide it.'",
  "s0148": "Si said: 'You return position!",
  "s0149": "Si follow lord decree, listen heaven fate, what plan can decide?'",
  "s0150": "Gao said: 'Safe can danger, danger can safe.",
  "s0151": "Safe danger not decided, how value sage?'",
  "s0152": "Si said: 'Si, Shangcai alley common clothes, above fortunately promoted chancellor, enfeoffed marquis, sons grandsons all noble position heavy salary, thus will with exist perish safe danger entrust minister.",
  "s0153": "How can betray!",
  "s0154": "Loyal minister not avoid death hope nearly, filial son not toil see danger, person ministers each guard their duty already.'"
}

