{
  "s0251": "Two sides prepare complete, master listen five words.",
  "s0252": "Five words simple trust, correct at five punishments.",
  "s0253": "Five punishments not simple, correct at five penalties.",
  "s0254": "Five penalties not serve, correct at five faults.",
  "s0255": "Five faults blemish, official prison inner prison, examine real its crime, only balance its fault.",
  "s0256": "Five punishments doubt have pardon, five penalties doubt have pardon, its examine overcome it.",
  "s0257": "Simple trust have crowd, only question have check.",
  "s0258": "No simple not doubt, together strict heaven awe.",
  "s0259": "Qing separate doubt pardon, its penalty hundred rate, examine real its crime.",
  "s0260": "Yi separate doubt pardon, its penalty double pour, examine real its crime.",
  "s0261": "Bin separate doubt pardon, its penalty double differ, examine real its crime.",
  "s0262": "Gong separate doubt pardon, its penalty five hundred rate, examine real its crime.",
  "s0263": "Da separate doubt pardon, its penalty thousand rate, examine real its crime.",
  "s0264": "Mo penalty belong thousand, Yi penalty belong thousand, Bin penalty belong five hundred, Gong penalty belong three hundred, Da separate penalty its belong two hundred: five punishments belong three thousand.'",
  "s0265": "Command said Fu Xing.",
  "s0266": "Mu Wang establish fifty five years, die, son Gong Wang Yi Hu establish.",
  "s0267": "Gong Wang tour at Jing upper, Mi Kang Gong follow, have three women flee it.",
  "s0268": "Its mother said: 'Must bring to wang.",
  "s0269": "Man beast three become group, person three become crowd, woman three become resplendent.",
  "s0270": "Wang hunt not take group, Gong walk not down crowd, wang receive not join one clan.",
  "s0271": "Man resplendent, beautiful thing.",
  "s0272": "Crowd with beautiful thing return woman, yet what virtue to bear it?",
  "s0273": "Wang still not bear, moreover you small ugly?",
  "s0274": "Small ugly prepare thing, end must perish.'",
  "s0275": "Kang Gong not offer, one year, Gong Wang extinguish Mi.",
  "s0276": "Gong Wang die, son Yi Wang Jian establish.",
  "s0277": "Yi Wang time, wang chamber then decline, poets make satire.",
  "s0278": "Yi Wang die, Gong Wang younger brother Pi Fang establish, this was Xiao Wang.",
  "s0279": "Xiao Wang die, feudal lords again establish Yi Wang crown prince Xie, this was Yi Wang.",
  "s0280": "Yi Wang die, son Li Wang Hu establish.",
  "s0281": "Li Wang establish thirty years, good profit, near Rong Yi Gong.",
  "s0282": "Grand master Rui Liang Fu remonstrate Li Wang said: 'Wang chamber its will low?",
  "s0283": "Man Rong Gong good monopolize profit yet not know big difficulty.",
  "s0284": "Man profit, hundred things birth, heaven earth load, yet have monopolize it, its harm many.",
  "s0285": "Heaven earth hundred things all will take, what able monopolize?",
  "s0286": "Angry very many, not prepare big difficulty.",
  "s0287": "With this teach wang, wang its able long?",
  "s0288": "Man wang people, will guide profit yet spread it up down.",
  "s0289": "Make spirit person hundred things no not get extreme, still day fear fear dread resentment come.",
  "s0290": "Therefore Song said 'think culture Hou Ji, able match that heaven, establish I steam people, no not you extreme'.",
  "s0291": "Da Ya said 'display tin load Zhou'.",
  "s0292": "Is not spread profit yet fear difficulty, therefore able load Zhou to reach now.",
  "s0293": "Now wang learn monopolize profit, its able?",
  "s0294": "Common man monopolize profit, still call thief, wang yet do it, its return few.",
  "s0295": "Rong Gong if use, Zhou must defeat.'",
  "s0296": "Li Wang not listen, finally with Rong Gong as Qing Shi, use affairs.",
  "s0297": "Wang walk violent tyrannical extravagant arrogant, state people slander wang.",
  "s0298": "Zhao Gong remonstrate said: 'People not bear mandate.'",
  "s0299": "Wang angry, get Wei witch, make monitor slander, report then kill it.",
  "s0300": "Its slander few, feudal lords not court."
}

