{
  "s0001": "The Grand Historian says: The records of the Five Emperors and Three Ages are already ancient.",
  "s0002": "From Yin and before, the feudal lords cannot be charted, from Zhou and later they can somewhat be recorded.",
  "s0003": "Confucius followed the historical documents to arrange the Spring and Autumn Annals, recording the first year, correcting the times days and months, how detailed it is.",
  "s0004": "As for arranging the Book of Documents, it is brief, without years and months;",
  "s0005": "Somewhat there are some, yet many are missing, cannot be recorded.",
  "s0006": "Therefore when in doubt then transmit the doubt, how cautious he was.",
  "s0007": "I read the secret records, from the Yellow Emperor all have year counts.",
  "s0008": "Examining their calendars and genealogical records, the transmission of the Five Virtues from beginning to end, ancient texts all differ, contradictory.",
  "s0009": "The Master's not arranging their years and months, how could it be empty!",
  "s0010": "Therefore I used the Five Emperors genealogical records, the Book of Documents collected chronology from the Yellow Emperor until the Gonghe as the world table.",
  "s0011": "Cheng Wang recited, Lu Zhou Gong Dan, Wu Wang's younger brother.",
  "s0012": "First enfeoffment.",
  "s0013": "Qi Tai Gong Shang, Wen Wang, Wu Wang's teacher.",
  "s0014": "First enfeoffment.",
  "s0015": "Jin Tang Shu Yu, Wu Wang's son.",
  "s0016": "First enfeoffment.",
  "s0017": "Qin E Lai, assisted Zhou.",
  "s0018": "Father Fei Lian, had strength.",
  "s0019": "Chu Xiong Yi.",
  "s0020": "Yi's father Yu Xiong, served Wen Wang.",
  "s0021": "First enfeoffment.",
  "s0022": "Song Wei Zi Qi, Zhou's concubine brother.",
  "s0023": "First enfeoffment.",
  "s0024": "Wei Kang Shu, Wu Wang's younger brother.",
  "s0025": "First enfeoffment.",
  "s0026": "Chen Hu Gong Man, Shun's descendant.",
  "s0027": "First enfeoffment.",
  "s0028": "Cai Shu Du, Wu Wang's younger brother.",
  "s0029": "First enfeoffment.",
  "s0030": "Cao Shu Zhen Duo, Wu Wang's younger brother.",
  "s0031": "First enfeoffment.",
  "s0032": "Yan Zhao Gong Shi, Zhou same surname.",
  "s0033": "First enfeoffment.",
  "s0034": "Kang Wang Zhao punished lightly over forty years.",
  "s0035": "Lu Gong Bo Qin, Ding Gong Lu Ji, Jin Hou Xie, Nu Fang, Xiong Yi, Wei Zhong, Qi's younger brother.",
  "s0036": "Kang Bo, Shen Gong, Cai Zhong, nine generations to Hui Hou.",
  "s0037": "Zhao Wang Xia southern tour did not return.",
  "s0038": "Did not attend, tabooed it.",
  "s0039": "Kao Gong, Yi Gong, Wu Hou, Pang Gao, Xiong Meng, Song Gong, Xiao Bo, Xiang Gong, Cai Bo, Tai Bo",
  "s0040": "Mu Wang Man.",
  "s0041": "Made the Fu punishment.",
  "s0042": "Wild regions did not come.",
  "s0043": "Yang Gong, Kao Gong's younger brother.",
  "s0044": "Gui Gong, Cheng Hou, Da Ji, Xiong Sheng, Ding Gong, Si Bo, Xiao Gong, Gong Hou, Zhong Jun",
  "s0045": "Gong Wang Yi Hu, You Gong, Ai Gong, Li Hou, Da Luo, Xiong Yang, Min Gong, Ding Gong's younger brother.",
  "s0046": "Zhe Bo, Shen Gong, Li Hou, Gong Bo",
  "s0047": "Yi Wang Jian.",
  "s0048": "Zhou way declined, poets made satire.",
  "s0049": "Wei Gong, Hu Gong, Jing Hou, Fei Zi, Xiong Qu, Yang Gong, Min Gong's younger brother.",
  "s0050": "Jing Bo, You Gong, Wu Hou, Xiao Bo",
  "s0051": "Xiao Wang Fang, Yi Wang's younger brother.",
  "s0052": "Li Gong, Xian Gong assassinated Hu Gong.",
  "s0053": "Qin Hou, Xiong Wu Kang, Li Gong, Zhen Bo, Xi Gong, Yi Bo",
  "s0054": "Yi Wang Xie, Yi Wang's son.",
  "s0055": "Xian Gong, Li Gong's younger brother.",
  "s0056": "Wu Gong, Gong Bo, Xiong Zhi Hong, Xi Gong, Qing Hou",
  "s0057": "Li Wang Hu.",
  "s0058": "Because of hating to hear criticism and chaos, fled, then died at Zhi.",
  "s0059": "Zhen Gong, Qin Zhong, Xiong Yan, Hong's younger brother.",
  "s0060": "Xi Hou",
  "s0061": "Gonghe, two marquises administered government.",
  "s0062": "Wu Gong, Zhen Gong's younger brother.",
  "s0063": "Xiong Yong",
  "s0064": "Zhang Fuzi asked Master Chu saying: 'The Poetry says Jie and Hou Ji were both born without fathers.",
  "s0065": "Now examining the various transmissions and records all say they had fathers, fathers all Yellow Emperor's sons, could it not contradict the Poetry?'",
  "s0067": "Master Chu said: 'Not so.",
  "s0068": "The Poetry speaking of Jie born from an egg, Hou Ji human footprints, wished to show they had heavenly mandate and sincere intent.",
  "s0069": "Ghosts and spirits cannot complete themselves, must rely on people to be born, how could they be born without fathers!",
  "s0070": "One saying has father, one saying no father, believe with transmit believe, doubt with transmit doubt, therefore speak of both.",
  "s0071": "Yao knew Jie, Ji were all worthy people, heaven's born, therefore enfeoffed Jie seventy li, after ten more generations to Tang, ruled the world.",
  "s0072": "Yao knew Hou Ji's descendants would later rule, therefore increased enfeoffment to one hundred li, his descendants moreover thousand years, to Wen Wang then had the world.",
  "s0073": "Poetry transmission says: 'Tang's ancestor was Jie, born without father.",
  "s0074": "Jie's mother with sisters bathing at Xuan Qiu water, there was a swallow holding an egg fell it, Jie's mother got it, therefore held it, mistakenly swallowed it, then gave birth to Jie.",
  "s0075": "Jie born and worthy, Yao established as Minister of Instruction, surnamed Zi clan.",
  "s0076": "Zi means increase;",
  "s0077": "increase, benefit great.",
  "s0078": "Poets praised and sang of it saying 'Yin altar vast vast, heavenly mandate dark bird, descended and gave birth to Shang'.",
  "s0079": "Shang means solid, Yin is the title.",
  "s0080": "Wen Wang's ancestor was Hou Ji, Hou Ji also born without father.",
  "s0081": "Hou Ji's mother Jiang Yuan, went out saw giant footprint and stepped on it, knew in body, then gave birth to Hou Ji.",
  "s0082": "Jiang Yuan considered no father, lowly and abandoned in road middle, oxen sheep avoided not stepped on.",
  "s0083": "Embraced in mountain, mountain nourished it.",
  "s0084": "Again abandoned in great marsh, birds covered sheltered fed it.",
  "s0085": "Jiang Yuan wondered at it, then knew it was Son of Heaven, then took and raised it.",
  "s0086": "Yao knew his worthy talent, established as Grand Farmer, surnamed Ji clan.",
  "s0087": "Ji means root.",
  "s0088": "Poets praised and sang of it saying 'its beginning gave birth to people', deep cultivation increased success, and explained Hou Ji's beginning.'",
  "s0089": "Confucius said: 'Formerly Yao commanded Jie as Zi clan, because there would be Tang.",
  "s0090": "Commanded Hou Ji as Ji clan, because there would be Wen Wang.",
  "s0091": "Great Wang commanded Ji Li, to illuminate heavenly auspicious signs.",
  "s0092": "Tai Bo's Wu, then gave birth to the source.'",
  "s0093": "Heavenly mandate hard to speak of, not sages cannot see.",
  "s0094": "Shun, Yu, Jie, Hou Ji all Yellow Emperor's descendants.",
  "s0095": "Yellow Emperor received heavenly mandate and governed the world, virtue favor deep in later generations, therefore his descendants all again established as Sons of Heaven, this is heaven's repayment for having virtue.",
  "s0096": "People do not know, consider it rising from common cloth common man.",
  "s0097": "How can common cloth common man without cause rise to rule the world?",
  "s0098": "It is having heavenly mandate thus.'",
  "s0100": "'Yellow Emperor's descendants why ruled the world so long?'",
  "s0102": "Said: 'Transmission says the world's rulers who for the ten thousand people redeem the people's fate are called emperors, have blessing ten thousand generations.",
  "s0103": "Yellow Emperor is such.",
  "s0104": "Five policies clear then cultivate rites righteousness, follow heavenly timing raise troops attack and benefit are called kings, have blessing thousand generations.",
  "s0105": "Shu Wang, Yellow Emperor's later generation, to now in Han southwest five thousand li, often come pay respects submit, transport tribute to Han, not because his ancestors had virtue, favor flowed to later generations?",
  "s0106": "Practicing morality how can be neglected!",
  "s0107": "Ruler kings raise and observe it.",
  "s0108": "Han Great General Huo Zi Meng named Guang, also Yellow Emperor's later generation.",
  "s0109": "This can be spoken to broad knowledge far sight people, certainly hard to explain to shallow knowledge people.",
  "s0110": "Why speak thus?",
  "s0111": "Ancient feudal lords used states as surnames.",
  "s0112": "Huo is state name.",
  "s0113": "Wu Wang enfeoffed younger brother Shu Chu at Huo, later generation Jin Xian Gong extinguished Huo Gong, later generation became common people, came and went dwelt Pingyang.",
  "s0114": "Pingyang in Hedong, Hedong Jin land, divided into Wei state.",
  "s0115": "With Poetry speaking, also can be Zhou generation.",
  "s0116": "Zhou arose from Hou Ji, Hou Ji born without father.",
  "s0117": "With Three Ages world transmission speaking, Hou Ji had father named Gao Xin;",
  "s0118": "Gao Xin, Yellow Emperor's great-grandson.",
  "s0119": "Yellow Emperor complete beginning transmission says: 'Han rise hundred more years, there is person not short not long, came from Bai Yan district, held the world's governance, time had infant ruler, wished to drive carriage.'",
  "s0120": "Huo General originally dwelt Pingyang Bai Yan.",
  "s0121": "Minister as lang time, with fangshi examined merit met at banner pavilion below, spoke to minister.",
  "s0122": "How not magnificent!'"
}
