{
  "s0103": "Emperor Jing summoned Consort Cheng. Consort Cheng made some excuse and did not wish to come forward. Instead she dressed up her attendant Tang Er and sent her in at night.",
  "s0104": "The emperor was drunk and did not realize, thinking it was Consort Cheng and favored her, so she became pregnant.",
  "s0105": "Only then did he realize it was not Consort Cheng.",
  "s0106": "When she gave birth to a son, he named him Fa.",
  "s0107": "In Emperor Xiaojing's second year before his reign, Fa was made King of Changsha as imperial son.",
  "s0108": "Because his mother was of lowly status and had no favor, he was made king of a poor and damp kingdom.",
  "s0109": "He reigned for twenty-seven years and died. His son, King Kang Yong, succeeded him.",
  "s0110": "He died after twenty-eight years. His son Fu You succeeded as King of Changsha.",
  "s0111": "This one kingdom was originally ruled by a son of Consort Tang.",
  "s0112": "King Hui of Guangchuan, Yue, was made King of Guangchuan as imperial son in Emperor Xiaojing's middle second year.",
  "s0113": "He died after twelve years. His son Qi succeeded as king.",
  "s0114": "Qi had a favored minister named Sang Ju.",
  "s0115": "Later Sang Ju committed a crime. Qi wished to execute him, but Ju fled. The king then captured Ju's clan.",
  "s0116": "Ju resented the king and submitted a memorial accusing King Qi of committing incest with his full sister.",
  "s0117": "From then on, King Qi repeatedly submitted memorials accusing Han's nobles and ministers as well as favored officials like Zhong and others.",
  "s0118": "King Kang of Jiaodong, Ji, was made King of Jiaodong as imperial son in Emperor Xiaojing's middle second year.",
  "s0119": "He died after twenty-eight years.",
  "s0120": "During the Huainan king's rebellion, Ji had heard rumors of the matter. He privately built tower chariots, arrowheads, and defensive preparations, waiting for Huainan's uprising.",
  "s0121": "When officials investigated the Huainan affair, the evidence implicated him.",
  "s0122": "Ji was most beloved by the emperor, who was grieved by this. Ji fell ill and died, not daring to appoint an heir. Thus the emperor heard of it.",
  "s0123": "Ji had an eldest son named Xian whose mother had no favor.",
  "s0124": "His younger son was named Qing, whose mother was beloved. Ji had always wished to establish Qing, but since it was not in proper order, he remained silent despite having grounds.",
  "s0125": "The emperor pitied him and made Xian King of Jiaodong to continue King Kang's line, while enfeoffing Qing in the former Hengshan territory as King of Liu'an.",
  "s0126": "King Xian of Jiaodong reigned for fourteen years and died. His posthumous title was King Ai.",
  "s0127": "His son Qing became king.",
  "s0128": "King Qing of Liu'an was made King of Liu'an as son of King Kang of Jiaodong in the second year of Yuanshou.",
  "s0129": "King Ai of Qinghe, Cheng, was made King of Qinghe as imperial son in Emperor Xiaojing's middle third year.",
  "s0130": "He died after twelve years with no heirs. The kingdom was abolished and its territory incorporated into Han as Qinghe Commandery.",
  "s0131": "King Xian of Changshan, Shun, was made King of Changshan as imperial son in Emperor Xiaojing's middle fifth year.",
  "s0132": "Shun was most beloved. As Emperor Jing's youngest son, he was arrogant and indolent, frequently committing excesses. The emperor often pardoned him leniently.",
  "s0133": "He reigned for thirty-two years and died. Crown Prince Bo succeeded as king.",
  "s0134": "At first, King Xian Shun had an unfavored consort who bore his eldest son Tiao.",
  "s0135": "Because his mother had no favor, Tiao also did not receive favor from the king.",
  "s0136": "Later the queen bore Crown Prince Bo.",
  "s0137": "The king had many consorts. His favored consorts bore sons Ping and Shang. The queen rarely received favor.",
  "s0138": "When King Xian fell gravely ill, his favored consorts constantly attended to his illness. The queen, out of jealousy, did not constantly attend but would return to her chambers.",
  "s0139": "When the physician administered medicine, Crown Prince Bo did not personally taste the medicine, nor did he stay overnight attending to the illness.",
  "s0140": "Only when the king passed away did the queen and crown prince arrive.",
  "s0141": "King Xian had never considered his eldest son Tiao as part of the family. When he died, he did not divide any property with him.",
  "s0142": "Some gentlemen advised the crown prince and queen to have the various sons share property with the eldest son Tiao. The crown prince and queen did not listen.",
  "s0143": "After the crown prince succeeded to the throne, he still did not take care of Tiao.",
  "s0144": "Tiao resented the queen and crown prince.",
  "s0145": "Han envoys inspecting King Xian's funeral, Tiao personally stated that during King Xian's illness, the queen and crown prince did not attend. When he died, they left the residence after six days. Crown Prince Bo privately committed adultery, drank wine, gambled, played zither, raced chariots with women, circled the city through the markets, and entered prisons to inspect prisoners.",
  "s0146": "The Son of Heaven sent Grand Herald Qian to investigate the queen and interrogate King Bo, requesting to arrest Bo's accomplices in adultery and witnesses. The king hid them.",
  "s0147": "Officials urgently sought to capture Bo, sending men to beat and torture him, arbitrarily releasing prisoners suspected by Han.",
  "s0148": "The officials requested execution of King Xian's queen Xiu and King Bo.",
  "s0149": "The emperor, considering that Xiu had always been immoral, allowing Tiao to frame her with crimes, and Bo had no good teachers, could not bear to execute them.",
  "s0150": "The officials requested deposing Queen Xiu and exiling King Bo with his family to Fangling. The emperor approved.",
  "s0151": "Bo had been king for several months when he was moved to Fangling. The kingdom was extinguished.",
  "s0152": "More than a month later, considering that he was most beloved, the emperor instructed the officials: 'King Xian of Changshan died young. His queen and consorts were not harmonious. Legitimate and illegitimate sons slandered and contended, falling into unrighteousness and extinguishing the kingdom. I greatly pity this.'"
}
