{
  "s0602": "Twenty eight years, big good make Bai Qi attack Chu, take Yan, Deng, pardon crime people move it.",
  "s0603": "Twenty nine years, big good make Bai Qi attack Chu, take Ying become Nan jun, Chu wang flee.",
  "s0604": "Zhou jun come.",
  "s0605": "Wang with Chu wang meet Xiang Ling.",
  "s0606": "Bai Qi become Wu An jun.",
  "s0607": "Thirty years, Shu guard Ruo attack Chu, take Wu jun, reach Jiang Nan become Qian Zhong jun.",
  "s0608": "Thirty one years, Bai Qi attack Wei, take two city.",
  "s0609": "Chu people rebel our Jiang Nan.",
  "s0610": "Thirty two years, prime Rang hou attack Wei, reach Da Liang, break Bao Yuan, cut head four thousand, Yuan flee, Wei enter three county request and.",
  "s0611": "Thirty three years, guest Qing Hu (Shang) [Yang] attack Wei Juan, Cai Yang, Chang She, take it.",
  "s0612": "Strike Mang Hao Hua Yang, break it, cut head fifteen thousand.",
  "s0613": "Wei enter Nan Yang to and.",
  "s0614": "Thirty four years, Qin with Wei, Han Shang Yong earth become one jun, Nan Yang free minister move dwell it.",
  "s0615": "Thirty five years, help Han, Wei, Chu attack Yan.",
  "s0616": "Initial set Nan Yang jun.",
  "s0617": "Thirty six years, guest Qing Zao attack Qi, take Gang, Shou, grant Rang hou.",
  "s0618": "Thirty eight years, middle change Hu (Shang) [Yang] attack Zhao Yan Yu, not able take.",
  "s0619": "Forty years, Dao crown prince die Wei, return bury Zhi Yang.",
  "s0620": "Forty one years summer, attack Wei, take Xing Qiu, Huai.",
  "s0621": "Forty two years, An state jun become crown prince.",
  "s0622": "Ten month, Xuan tai hou die, bury Zhi Yang Li mountain.",
  "s0623": "Nine month, Rang hou exit at Tao.",
  "s0624": "Forty three years, Wu An jun Bai Qi attack Han, pull nine city, cut head five thousand.",
  "s0625": "Forty four years, attack Han Nan (jun) [Yang], take it.",
  "s0626": "Forty five years, five da fu Ben attack Han, take ten city.",
  "s0627": "Ye Yang jun Kui exit country, not reach yet die.",
  "s0628": "Forty seven years, Qin attack Han Shang Dang, Shang Dang descend Zhao, Qin because attack Zhao, Zhao send troops strike Qin, mutual distant.",
  "s0629": "Qin make Wu An jun Bai Qi strike, big break Zhao at Chang Ping, forty remain thousand all kill it.",
  "s0630": "Forty eight years ten month, Han offer Yuan Yong.",
  "s0631": "Qin army divide become three army.",
  "s0632": "Wu An jun return.",
  "s0633": "Wang Hou will attack Zhao (Wu An) Pi Lao, pull it.",
  "s0634": "Si Ma Geng north pacify Tai Yuan, complete have Han Shang Dang.",
  "s0635": "Positive month, troops stop, again guard Shang Dang.",
  "s0636": "Its ten month, five da fu Ling attack Zhao Han Dan.",
  "s0637": "Forty nine years positive month, increase send troops help Ling.",
  "s0638": "Ling battle not good, free, Wang Hou replace will.",
  "s0639": "Its ten month, general Zhang Tang attack Wei, become Cai Wei Juan not guard, return cut it.",
  "s0640": "Fifty years ten month, Wu An jun Bai Qi have crime, become shi wu, move Yin Mi.",
  "s0641": "Zhang Tang attack Zheng, pull it.",
  "s0642": "Twelve month, increase send troops army Fen Cheng side.",
  "s0643": "Wu An jun Bai Qi have crime, die.",
  "s0644": "Hou attack Han Dan, not pull, go, return flee Fen army.",
  "s0645": "Two month remain attack Jin army, cut head six thousand, Jin Chu flow die He two thousand person.",
  "s0646": "Attack Fen Cheng, then from Tang pull Ning Xin Zhong, Ning Xin Zhong change name An Yang.",
  "s0647": "Initial make He bridge.",
  "s0648": "Fifty one years, general Liu attack Han, take Yang Cheng, Fu Shu, cut head four thousand.",
  "s0649": "Attack Zhao, take twenty remain county, head capture nine thousand.",
  "s0650": "West Zhou jun back Qin, with feudal lords treaty follow, will world sharp troops exit Yi Guan attack Qin, make Qin not able pass Yang Cheng.",
  "s0651": "Then Qin make general Liu attack west Zhou.",
  "s0652": "West Zhou jun flee come self return, knock head receive crime, complete offer its yi thirty six, mouth three thousand.",
  "s0653": "Qin wang receive offer, return its jun at Zhou.",
  "s0654": "Fifty two years, Zhou people east flee, its vessel nine ding enter Qin.",
  "s0655": "Zhou initial perish.",
  "s0656": "Fifty three years, world come guest.",
  "s0657": "Wei after, Qin make Liu attack Wei, take Wu Cheng.",
  "s0658": "Han wang enter court, Wei entrust state listen command.",
  "s0659": "Fifty four years, wang suburb see Shang Di at Yong.",
  "s0660": "Fifty six years autumn, Zhao Xiang wang die, son Xiao Wen wang establish.",
  "s0661": "Honor Tang eight son become Tang tai hou, yet combine its bury at previous wang.",
  "s0662": "Han wang decline silk enter mourn sacrifice, feudal lords all make its will prime come mourn sacrifice, view death affairs.",
  "s0663": "Xiao Wen wang first year, pardon crime people, repair previous wang merit ministers, praise thick close relative, release garden park.",
  "s0664": "Xiao Wen wang except death, ten month Ji Hai establish, three days Xin Chou die, son Zhuang Xiang wang establish.",
  "s0665": "Zhuang Xiang wang first year, big pardon crime people, repair previous wang merit ministers, apply virtue thick bone meat yet spread favor at people.",
  "s0666": "East Zhou jun with feudal lords plot Qin, Qin make prime state Lu Bu Wei punish it, complete enter its state.",
  "s0667": "Qin not cut its sacrifice, with Yang person earth grant Zhou jun, serve its sacrifice.",
  "s0668": "Make Meng Ao attack Han, Han offer Cheng Gao, Gong.",
  "s0669": "Qin border reach Da Liang, initial set three Chuan jun.",
  "s0670": "Two years, make Meng Ao attack Zhao, pacify Tai Yuan.",
  "s0671": "Three years, Meng Ao attack Wei Gao Du, Ji, pull it.",
  "s0672": "Attack Zhao Yu Ci, Xin Cheng, Lang Meng, take thirty seven city.",
  "s0673": "Four month day eat.",
  "s0674": "(Four years) Wang Hou attack Shang Dang.",
  "s0675": "Initial set Tai Yuan jun.",
  "s0676": "Wei will Wu Ji lead five state troops strike Qin, Qin retreat at He outer.",
  "s0677": "Meng Ao defeat, solve yet go.",
  "s0678": "Five month Bing Wu, Zhuang Xiang wang die, son Zheng establish, is Qin Shi Huang Di.",
  "s0679": "Qin wang Zheng establish twenty six years, initial combine world become thirty six jun, number become Shi Huang Di.",
  "s0680": "Shi Huang Di fifty one year yet collapse, son Hu Hai establish, is Er Shi Huang Di.",
  "s0681": "Three years, feudal lords together rise rebel Qin, Zhao Gao kill Er Shi, establish Zi Ying.",
  "s0682": "Zi Ying establish month remain, feudal lords punish it, then extinguish Qin.",
  "s0683": "Its speech at Shi Huang ben ji middle.",
  "s0684": "Tai shi gong said: Qin previous become Ying surname.",
  "s0685": "Its after divide seal, with state become surname, have Xu clan, Tan clan, Ju clan, Zhong Li clan, Yun Yan clan, Tu Qiu clan, Jiang Liang clan, Huang clan, Jiang clan, Xiu Yu clan, Bai Ming clan, Fei Lian clan, Qin clan.",
  "s0686": "Yet Qin with its previous Zhao Fu seal Zhao Cheng, become Zhao clan."
}

