{
  "s0285": "Jia for first spoke Qin king: 'Yan king truly shaken terrified great king's might, not dare raise troops to oppose army officials, wish whole state become inner minister, compare feudal lords ranks, give tribute duty like commandery county, able maintain guard former king ancestral temple.",
  "s0286": "Fear not dare self-state, respectfully behead Fan Yuji head, and offer Yan Du Kang land map, box sealed, Yan king bowed sent at court, made envoy to hear great king, only great king command.'",
  "s0287": "Qin king heard, greatly pleased, court robes, set nine guests, saw Yan envoy Xianyang palace.",
  "s0288": "Jing Ke presented Fan Yuji head box, Qin Wuyang presented land map case, by order advanced.",
  "s0289": "Reached stairs, Qin Wuyang color changed trembled feared, ministers strange it.",
  "s0290": "Jing Ke looked back laughed Wuyang, front apologized: 'North barbarian uncivilized rustic person, not tasted see emperor, thus tremble frightened.",
  "s0291": "Wish great king little lenient, make him complete mission at front.'",
  "s0292": "Qin king told Ke: 'Take Wuyang held land map.'",
  "s0293": "Ke having taken map presented, Qin king unrolled map, map exhausted dagger appeared.",
  "s0294": "Thus left hand grasped Qin king sleeve, right hand held dagger stabbed him.",
  "s0295": "Not reached body, Qin king startled, self pulled rose, sleeve broke.",
  "s0296": "Drew sword, sword long, gripped its scabbard.",
  "s0297": "Time panicked urgent, sword firm, thus not could immediately draw.",
  "s0298": "Jing Ke pursued Qin king, Qin king circled pillar walked.",
  "s0299": "Ministers all astonished, suddenly rose unexpected, all lost their measure.",
  "s0300": "Qin law, ministers served hall above not permitted hold inch weapons;",
  "s0301": "Various langzhong held weapons all arrayed hall below, not have decree summon not could ascend.",
  "s0302": "When urgent time, not reached summon below troops, thus Jing Ke pursued Qin king.",
  "s0303": "Yet finally panicked urgent, no with strike Ke, with hands together fought him.",
  "s0304": "At time attending physician Xia Wuqian with his carried medicine bag struck Jing Ke.",
  "s0305": "Qin king just circled pillar walked, finally panicked urgent, not knew what do, left right then said: 'King carry sword!'",
  "s0306": "Carry sword, then drew to strike Jing Ke, severed his left thigh.",
  "s0307": "Jing Ke crippled, then drew his dagger to throw Qin king, not hit, hit paulownia pillar.",
  "s0308": "Qin king again struck Ke, Ke suffered eight wounds.",
  "s0309": "Ke self knew affair not succeed, leaned pillar laughed, sat cross-legged cursed: 'Affair so not complete, because wished alive kidnap him, must get treaty to repay crown prince.'",
  "s0310": "Thus left right having front killed Ke, Qin king not pleased long time.",
  "s0311": "Already then discussed merit, rewarded ministers and should sit each different, granted Xia Wuqian yellow gold two hundred yi, said: 'Wuqian loved me, thus with medicine bag struck Jing Ke.'",
  "s0313": "Thus Qin king greatly angered, increased sent troops to Zhao, commanded Wang Jian army to attack Yan.",
  "s0314": "Tenth month then captured Ji city.",
  "s0315": "Yan king Xi, crown prince Dan etc. completely led their elite troops east defended at Liaodong.",
  "s0316": "Qin general Li Xin pursued Yan king urgent, Dai king Jia then sent Yan king Xi letter: 'Qin so especially pursued Yan urgent, because crown prince Dan.",
  "s0317": "Now king truly kill Dan offer Qin king, Qin king must relieve, state altars fortunately get blood food.'",
  "s0318": "Afterward Li Xin pursued Dan, Dan hid Yan water, Yan king then made envoy behead crown prince Dan, wished offer Qin.",
  "s0319": "Qin again advanced troops attacked.",
  "s0320": "After five years, Qin finally extinguished Yan, captured Yan king Xi.",
  "s0321": "Its next year, Qin united world, established title emperor.",
  "s0322": "Thus Qin pursued crown prince Dan, Jing Ke guests, all fled.",
  "s0323": "Gao Jianli changed name surname became person menial servant, hid worked at Song Zi.",
  "s0324": "Long time, work bitter, heard his family hall guest beat zhu, eavesdropped could not leave.",
  "s0325": "Every exit spoke: 'That has good has not good.'",
  "s0326": "Followers told his master, said: 'That menial actually knows sound, secretly speaks right wrong.'",
  "s0327": "Family elder summoned made front beat zhu, one seat praised good, granted wine.",
  "s0328": "Gao Jianli thought long hidden feared restraint no end time, then retreated, exited his outfit box zhu with his good clothes, changed appearance front.",
  "s0329": "Whole seat guests all startled, descended with equal ritual, considered upper guest.",
  "s0330": "Made beat zhu sang, guests none not flowing tears departed.",
  "s0331": "Song Zi transmitted guests, heard by Qin Shi Huang.",
  "s0332": "Qin Shi Huang summoned saw, person had recognized, then said: 'Gao Jianli.'",
  "s0333": "Qin emperor cherished his good beat zhu, heavy pardoned him, then blinded his eyes.",
  "s0334": "Made beat zhu, not tasted not praised good.",
  "s0335": "Gradually increased close him, Gao Jianli then with lead placed zhu middle, again advanced got close, raised zhu struck Qin emperor, not hit.",
  "s0336": "Thus then executed Gao Jianli, lifetime not again approached feudal lord persons.",
  "s0337": "Lu Goujian already heard Jing Ke stabbed Qin king, privately said: 'Alas, pity his not practiced sword stabbing technique!",
  "s0338": "Extreme my not know person!",
  "s0339": "Previously I scolded him, he then considered me not person!'",
  "s0341": "Grand Historian said: World speaks Jing Ke, its praises crown prince Dan fate, 'heaven rained grain, horse grew horns', too excessive.",
  "s0342": "Again speaks Jing Ke injured Qin king, all not so.",
  "s0343": "Beginning Gong Sun Ji Gong, Dong Sheng with Xia Wuqian traveled, fully knew affairs, for me told as this.",
  "s0344": "From Cao Mo to Jing Ke five persons, this their righteousness or completed or not completed, yet their established intent clearly bright, not deceived their will, name hung later generations, how false!"
}
