{
  "s0051": "The Grand Historian says: Warfare unites with orthodox, conquers with unorthodox.",
  "s0052": "Those skilled at it, unorthodox emerges without limit.",
  "s0053": "Unorthodox and orthodox cycle producing each other, like a ring without end.",
  "s0054": "At first like virgin, enemy opens door;",
  "s0055": "Later like escaped rabbit, enemy cannot catch: this describes Tian Dan!",
  "s0056": "Initially, when Zhao Chi killed King Min, Ju people sought King Min's son Fa Zhang, found him at Grand Historian Xi's home, working as gardener.",
  "s0057": "Xi's daughter pitied and treated him well.",
  "s0058": "Later Fa Zhang privately told his feelings to the girl, she then consorted with him.",
  "s0059": "When Ju people together established Fa Zhang as Qi king, to defend Ju against Yan, Grand Historian Xi's daughter became queen, called 'Queen of the King.'",
  "s0060": "When Yan first entered Qi, heard Hua county man Wang Xu worthy, ordered army: 'Circle Hua county thirty li no entry,' because of Wang Xu.",
  "s0061": "Then sent people to tell Xu: 'Qi people much praise your righteousness, I appoint you general, enfeoff you ten thousand households.'",
  "s0062": "Xu firmly declined.",
  "s0063": "Yan people said: 'If you do not listen, I lead three armies to butcher Hua county.'",
  "s0064": "Wang Xu said: 'Loyal minister does not serve two lords, chaste woman does not take two husbands.'",
  "s0065": "Qi king did not listen to my advice, thus retired to farm in wilds.'",
  "s0066": "State already broken perished, I could not preserve it;",
  "s0067": "Now again coerce with arms to be lord's general, this assists tyrant in violence.'",
  "s0068": "Better than living without righteousness, certainly rather boiled!'",
  "s0069": "Thus hanged his neck on tree branch, struggled and broke neck died.",
  "s0070": "Qi perished ministers heard of this, said: 'Wang Xu, commoner also, righteousness does not face north to Yan, how much more those in office eating salary!'",
  "s0071": "Thus gathered at Ju, sought the princes, established as King Xiang."
}
