{
  "s0368": "Their ministers were right;",
  "s0369": "Their lords were wrong.",
  "s0380": "Cai Ze said: 'Then jun lord kind benevolent employ loyal, sincere thick old acquaintance, worthy wise with have way scholars as glue lacquer, righteousness not double merit ministers, who with Qin Xiao Gong, Chu Dao Wang, Yue Wang?'",
  "s0381": "Ying Hou said: 'Unknown what like.'",
  "s0382": "Cai Ze said: 'Now jun personally loyal ministers, not over Qin Xiao Gong, Chu Dao Wang, Yue Wang, jun establish wisdom, able for jun secure danger repair politics, govern chaos strong troops, ward off calamity break difficulty, broaden land plant grain, enrich state sufficient family, strong jun, honor altars soil, illustrious ancestral temple, world none dare deceive offend jun, jun might cover shake within seas, merit spread ten thousand li outside, sound name glory transmit thousand generations, jun who with Shang Jun, Wu Qi, Da Fu Zhong?'",
  "s0383": "Ying Hou said: 'Not equal.'",
  "s0384": "Cai Ze said: 'Now jun personally loyal ministers not forget old acquaintance not equal Xiao Gong, Dao Wang, Gou Jian, yet jun merit achievements love trust personal favor again not equal Shang Jun, Wu Qi, Da Fu Zhong, however jun salary position noble flourishing, private family rich over three persons, body not retreat, fear calamity over three persons, secretly for jun dangerous.'",
  "s0399": "Shang Jun for Qin Xiao Gong clarified law commands, prohibited adultery root, honored rank certainly rewarded, have crime certainly punished, leveled balances, corrected measures, adjusted light heavy, broke open paths, to quiet give birth people enterprise unify custom, encouraged people plow farm profit soil, one room no two matters, exerted field stored grain, practiced battle array matters, thus troops move land broad, troops rest state rich, thus Qin no enemy world, established might feudal lords, completed Qin state enterprise.",
  "s0400": "Merit already complete, yet finally cart torn apart.",
  "s0405": "Wu Qi for Chu Dao Wang established law, humbled reduced ministers authority heavy, dismissed no ability, abolished no use, reduced not urgent officials, blocked private gate requests, unified Chu state custom, prohibited traveler people, refined plow battle scholars, south collected Yang Yue, north combined Chen, Cai, broke horizontal scattered vertical, made gallop persuade scholars none open mouth, prohibited cliques encourage hundred surnames, settled Chu state politics, troops shook world, might subdued feudal lords.",
  "s0406": "Merit already complete, yet finally branch torn apart.",
  "s0407": "Da Fu Zhong for Yue Wang deep plan far strategy, avoided Kuaiji danger, with perish as preserve, because humiliation as honor, cleared grass entered city, opened land planted grain, led four directions scholars, monopolized up down strength, assisted Gou Jian worthy, reported Fu Cha enmity, finally captured strong Wu.",
  "s0408": "Made Yue complete hegemon."
}
