{
  "s0105": "Moreover Chu attacks Qi's Nanyang, Wei attacks Pinglu, yet Qi no south face heart, considers lose Nanyang harm small, not equal get Jibei profit great, thus decided plan carefully placed.",
  "s0106": "Now Qin people send troops, Wei not dare east face;",
  "s0107": "Balance Qin situation formed, Chu state shape dangerous;",
  "s0108": "Qi abandon Nanyang, cut right territory, decide Jibei, plan still can do it.",
  "s0109": "Moreover Qi's must decide at Liaocheng, duke not again plan.",
  "s0110": "Now Chu Wei together retreat from Qi, Yan rescue not arrive.",
  "s0111": "With complete Qi troops, no world plan, with Liaocheng together endure year weariness, then minister see duke cannot obtain.",
  "s0112": "Moreover Yan state great chaos, ruler ministers lose plan, above below confused, Li Fu with ten thousand multitude five defeats outside, with ten thousand chariot country surrounded by Zhao, territory reduced lord distressed, become world ridiculed.",
  "s0113": "State worn calamity many, people no place heart belongs.",
  "s0114": "Now duke again with worn Liaocheng people resist complete Qi troops, this Mo Di's defense.",
  "s0115": "Eat people cook bones, scholars no return outside heart, this Sun Bin's troops.",
  "s0116": "Can appear in world.",
  "s0117": "Although so, for duke plan, not equal complete chariots armor return to Yan.",
  "s0118": "Chariots armor complete return Yan, Yan king must pleased;",
  "s0119": "Body complete return to state, scholars people like see parents, friends raise arms discuss in world, merit can clear.",
  "s0120": "Above assist orphan lord control ministers, below nourish hundred surnames provide persuaders, correct state change customs, merit name can establish.",
  "s0121": "Lost intention also abandon Yan abandon world, east travel to Qi?",
  "s0122": "Split land decide fief, rich compare Tao, Wei, generations called duke, with Qi long exist, again one plan.",
  "s0123": "These two plans, manifest name thick substance, wish duke detailed plan carefully choose one.",
  "s0124": "Moreover I heard, plan small shame cannot become glorious name, hate small disgrace cannot establish great merit.",
  "s0125": "Formerly Guan Yiwu shot Huan Gong hit his hook, usurped;",
  "s0126": "Abandoned Gongzi Jiu cannot die, cowardly;",
  "s0127": "Bound fettered, disgraced.",
  "s0128": "Like these three conducts, world lords not minister hometown not pass.",
  "s0129": "If made Guan Zi dark imprisoned not out, body die not return Qi, then also name not avoid for humiliated person base conduct.",
  "s0130": "Servants concubines moreover ashamed with same name, moreover worldly people!",
  "s0131": "Guan Zi not ashamed body in fetters middle yet ashamed world not governed, not ashamed not die Gongzi Jiu yet ashamed might not trusted by feudal lords, thus combined three conducts excess became five hegemon first, name high world light illuminate neighbor states.",
  "s0132": "Cao Zi as Lu general, three battles three retreat, lost land five hundred li.",
  "s0133": "If made Cao Zi plan not turn back, discussion not turn heel, cut throat die, then also name not avoid for defeated army captured general.",
  "s0134": "Cao Zi abandoned three retreat shame, retreated with Lu lord planned.",
  "s0135": "Huan Gong court world, met feudal lords, Cao Zi with one sword duty, stabbed Huan Gong heart at altar, complexion not changed, words not disordered, three battles lost one morning recovered, world shocked, feudal lords astonished, might added Wu, Yue.",
  "s0136": "Like these two scholars, not cannot complete small integrity do small shame, considered kill body lose life, cut world extinguish descendants, merit name not establish, not wise.",
  "s0137": "Thus leave moved resent, establish lifetime name;",
  "s0138": "Abandon resentful uprightness, decide generations merit.",
  "s0139": "Thus achievement with three kings contend flow, name with heaven earth compare lasting.",
  "s0140": "Wish duke choose one execute.",
  "s0141": "Yan general saw Ru Zhonglian letter, wept three days, hesitated cannot self-decide.",
  "s0142": "Wished return Yan, already had gap, feared execution;",
  "s0143": "Wished surrender Qi, those killed captured by Qi very many, feared already surrender then after seen humiliated.",
  "s0144": "Sighed deeply said: 'With others blade me, rather self-blade.'",
  "s0145": "Thus self-killed.",
  "s0146": "Liaocheng chaos, Tian Dan then slaughtered Liaocheng.",
  "s0147": "Returned spoke Ru Zhonglian, wished enfeoff him.",
  "s0148": "Ru Zhonglian fled hid at sea, said: 'I with rich noble yet bent to others, rather poor base lightly world unrestrained intent.'",
  "s0150": "Zou Yang was Qi person.",
  "s0151": "Traveled Wei, with former Wu person Zhuang Ji Fuzi, Huaiyin Mei Sheng followers befriended.",
  "s0152": "Submitted writing introduced between Yang Sheng, Gongsun Gui.",
  "s0153": "Sheng etc. jealous Zou Yang, hated to Wei Xiao Wang.",
  "s0154": "Xiao Wang angered, sent to officials, wished kill him.",
  "s0155": "Zou Yang traveled as guest, by slander captured, feared die bear burden, then from prison submitted letter said:",
  "s0156": "Minister heard loyal no not repaid, trust not seen doubted, minister often considered correct, merely empty words.",
  "s0157": "Formerly Jing Ke admired Yan Dan righteousness, white rainbow penetrated sun, crown prince feared;",
  "s0158": "Wei mister for Qin planned Changping affairs, Venus eclipsed Mao, Zhao Wang doubted.",
  "s0159": "Essence changes heaven earth yet trust not understood two lords, how not sorrow!",
  "s0160": "Now minister exhaust loyal exhaust sincerity, complete plans wish know, left right not clear, finally from officials questioned, become world doubted, this makes Jing Ke, Wei mister again rise, Yan, Qin not awaken.",
  "s0161": "Wish great king carefully examine.",
  "s0162": "Formerly Bian He offered treasure, Chu king cut feet;",
  "s0163": "Li Si exhausted loyal, Hu Hai extreme punishment.",
  "s0164": "Thus Ji Zi feigned mad, Jie Yu avoided world, feared encounter this calamity.",
  "s0165": "Wish great king carefully examine Bian He, Li Si intention, then Chu king, Hu Hai listen, not make minister become Ji Zi, Jie Yu laughed.",
  "s0166": "Minister heard Bi Gan split heart, Zi Xu owl bag, minister began not believe, now know it.",
  "s0167": "Wish great king carefully examine, little add pity.",
  "s0168": "Proverb says: 'Have white head like new, tilt canopy like old.'",
  "s0169": "Why?",
  "s0170": "Know and not know.",
  "s0171": "Thus formerly Fan Yuji fled Qin to Yan, borrowed Jing Ke head to serve Dan affairs;",
  "s0172": "Wang She left Qi to Wei, faced city self-slit to repel Qi preserve Wei.",
  "s0173": "Wang She, Fan Yuji not new to Qi, Qin yet old to Yan, Wei, reason left two states died two lords, conduct matched will admired righteousness endless.",
  "s0174": "Thus Su Qin not trusted by world, became Yan tail life;",
  "s0175": "Bai Gui battled lost six cities, for Wei took Zhongshan.",
  "s0176": "Why?",
  "s0177": "Truly had mutually know.",
  "s0178": "Su Qin as Yan chancellor, Yan people hated to king, king pressed sword angered, fed with piebald horse;",
  "s0179": "Bai Gui prominent at Zhongshan, Zhongshan people hated to Wei Wen Hou, Wen Hou threw with night light jade.",
  "s0180": "Why?",
  "s0181": "Two lords two ministers, split heart break liver trust, how shift by floating words!",
  "s0182": "Thus women no beautiful ugly, enter palace see jealousy;",
  "s0183": "Scholars no worthy unworthy, enter court see envy.",
  "s0184": "Formerly Sima Xi kneeled at Song, finally chancellor Zhongshan;",
  "s0185": "Fan Sui folded ribs broken teeth at Wei, finally became Ying Hou.",
  "s0186": "These two persons, all believed inevitable plan, abandoned faction private, held isolated position, thus could not self-avoid from jealous persons.",
  "s0187": "Thus Shen Tu Di self-drowned river, Xu Yan carried stone entered sea.",
  "s0188": "Not tolerated by world, righteousness not casually take, clique at court, to shift lord heart.",
  "s0189": "Thus Baili Xi begged food on road, Mu Gong entrusted with government;",
  "s0190": "Ning Qi fed oxen under cart, Huan Gong entrusted with state.",
  "s0191": "These two persons, how borrowed office at court, faked praise from left right, then two lords used them?",
  "s0192": "Moved at heart, matched in conduct, close as glue lacquer, brothers cannot separate, how confused by crowd mouths!",
  "s0193": "Thus biased listen gives evil, sole entrust forms chaos.",
  "s0194": "Formerly Lu listened Ji Sun speech expelled Confucius, Song believed Zi Han plan imprisoned Mo Di.",
  "s0195": "With Kong, Mo eloquence, could not self-avoid slander flatterers, two states endangered.",
  "s0196": "Why?",
  "s0197": "Crowd mouths melt gold, accumulated slander destroys bone.",
  "s0198": "Thus Qin used Rong person You Yu became hegemon China, Qi used Yue person Meng became strong Wei, Xuan.",
  "s0199": "These two states, how constrained by custom, pulled by world, tied flattering partial words?",
  "s0200": "Public listen together observe, hang name current world.",
  "s0201": "Thus intent match then Hu Yue become brothers, You Yu, Yue person Meng is;",
  "s0202": "Not match, then bone flesh expel not recover, Zhu, Xiang, Guan, Cai is.",
  "s0203": "Now person lord truly can use Qi, Qin righteousness, avoid Song, Lu listen, then five hegemons not sufficient praise, three kings easy become.",
  "s0204": "Thus sage kings awakened, abandoned child heart, yet could not delighted at Tian Chang worthiness;",
  "s0205": "Enfeoffed Bi Gan descendants, repaired pregnant woman tomb, thus merit achievement again completed in world.",
  "s0206": "Why?",
  "s0207": "Desire good no sated.",
  "s0208": "Jin Wen Gong personally his enemy, strong hegemon feudal lords;",
  "s0209": "Qi Huan Gong used his foe, united world.",
  "s0210": "Why? Benevolent kind diligent, sincerity added to heart, cannot empty words borrow.",
  "s0211": "To Shang Yang method used by Qin, east weakened Han, Wei, troops strong world, yet finally cart tore him;",
  "s0212": "Yue used Dafu Zhong plan, captured strong Wu, hegemon China, yet finally executed his body.",
  "s0213": "Thus Sun Shu Ao three resigned chancellor not regret, Yu Ling Zi Zhong declined three dukes became person irrigated garden.",
  "s0214": "Now person lord truly can leave arrogant heart, cherish repayable intention, bare heart abdomen, see true feelings, drop liver gall, apply favor thick, end with them poor reach, no stingy to scholars, then Jie dog can make bark Yao, Zhi guest can make stab You;",
  "s0215": "Moreover take ten thousand chariot power, borrow sage king resources?",
  "s0216": "Then Jing Ke drowned seven clans, Yao Li burned wife children, how sufficient speak!",
  "s0217": "Minister heard bright moon pearl, night light jade, with dark throw to person on road, person none not press sword glare.",
  "s0218": "Why?",
  "s0219": "No reason arrive front.",
  "s0220": "Coiled wood root base, bent strange, become ten thousand chariot vessel.",
  "s0221": "Why?",
  "s0222": "With left right first make appearance.",
  "s0223": "Thus no reason arrive front, though produce Sui Hou pearl, night light jade, still tie resentment not see virtue.",
  "s0224": "Thus have person first speak, then with withered wood rotten stump establish merit not forget.",
  "s0225": "Now world common clothes poor dwell scholars, body in poverty baseness, though possess Yao, Shun methods, embrace Yi, Guan eloquence, cherish Long Feng, Bi Gan intention, wish exhaust loyal serve current world lord, yet usually no root base appearance, though exhaust essence thought, wish open loyal trust, assist person lord govern, then person lord must have press sword glare traces, this makes common clothes cannot become withered wood rotten stump resource.",
  "s0226": "Thus sage kings established world controlled customs, alone changed on pottery wheel above, not pulled by base chaos words, not seized by many mouths.",
  "s0227": "Thus Qin emperor used central minister Zi Meng Jia words, trusted Jing Ke speech, dagger secretly issued;",
  "s0228": "Zhou Wen Wang hunted Jing, Wei, loaded Lü Shang returned, became king world.",
  "s0229": "Thus Qin trusted left right killed, Zhou used crow gather became king.",
  "s0230": "Why?",
  "s0231": "With their could surpass entangled constrained words, gallop domain outside discussions, alone observed bright clear way.",
  "s0232": "Now person lord sunk in flatter slander words, pulled by curtain tent system, make unfettered scholars with oxen horses same manger, this Bao Jiao so angered world not stay rich noble pleasure.",
  "s0233": "Minister heard flourishing adorn enter court not with profit defile righteousness, polish sharpen name not with desire harm conduct, thus county named Sheng Mu yet Zeng Zi not enter, city named Chao Ge yet Mo Zi turned cart.",
  "s0234": "Now wish make world vast scholars, controlled by mighty power, lord at position status nobility, thus turn face defile conduct serve flatter slander persons seek close to left right, then scholars hide death dig holes rocks middle, how willing have exhaust loyal trust hurry palace gate!",
  "s0235": "Letter submitted Wei Xiao Wang, Xiao Wang made person release him, finally became upper guest.",
  "s0236": "Grand Historian said: Ru Zhonglian his point intention though not match great righteousness, yet I much his in common clothes position, unrestrained unrestrained intent, not bent to feudal lords, spoke persuaded at current world, broke minister chancellor power.",
  "s0237": "Zou Yang words though not humble, yet his compare things connect categories, has sufficient sorrowful, also can call upright not bent, I thus attached to liezhuan."
}