{
  "s0001": "Zhang Er, his person Daliang person.",
  "s0002": "His youth time, with Wei crown prince Wu Ji as guest.",
  "s0003": "Zhang Er once fled life wandered Waihuang.",
  "s0004": "Waihuang rich person daughter very beautiful, married common slave, fled her husband, went returned father guest.",
  "s0005": "Father guest originally knew Zhang Er, then told daughter: 'Certainly wish seek worthy husband, follow Zhang Er.'",
  "s0006": "Daughter listened, then finally for him plead decision, married Zhang Er.",
  "s0007": "Zhang Er at time escaped body wandered, daughter family thick provided gave Zhang Er, Zhang Er because this attracted thousand li guests.",
  "s0008": "Then served Wei as Waihuang magistrate.",
  "s0009": "Name by this increasingly worthy.",
  "s0010": "Chen Yu, also Daliang person, loved Confucian arts, several times wandered Zhao Ku Xing.",
  "s0011": "Rich person Gongcheng clan with his daughter wife him, also knew Chen Yu not common person.",
  "s0012": "Yu young, father treated Zhang Er, two persons mutually became neck-cutting friendship.",
  "s0013": "Qin extinguished Daliang, Zhang Er family Waihuang.",
  "s0014": "Gao Zu as commoner time, once several times followed Zhang Er wandered, guest several months.",
  "s0015": "Qin extinguished Wei several years, already heard these two persons Wei name scholars, purchased sought got Zhang Er thousand gold, Chen Yu five hundred gold.",
  "s0016": "Zhang Er, Chen Yu then changed name surname, together went Chen, became village gatekeeper to self support.",
  "s0017": "Two persons faced each other.",
  "s0018": "Village official once had error flogged Chen Yu, Chen Yu wished rise, Zhang Er stepped on him, made receive flog.",
  "s0019": "Official gone, Zhang Er then led Chen Yu to mulberry below counted him: 'Beginning I with you speak what like?",
  "s0020": "Now see small humiliation wish die one official?'",
  "s0021": "Chen Yu yes that.",
  "s0022": "Qin decree book purchased sought two persons, two persons also instead used gatekeeper to command village middle.",
  "s0023": "Chen She rose Qi, arrived entered Chen, troops several ten thousand.",
  "s0024": "Zhang Er, Chen Yu up met Chen She.",
  "s0025": "She involved left right lifetime several heard Zhang Er, Chen Yu worthy, not tasted see, see then greatly happy.",
  "s0026": "Chen middle heroes elders then persuaded Chen She: 'General body wore armor grasped sharp weapons, led soldiers to execute violent Qin, restored established Chu altars of soil, preserved perished continued severed, merit virtue should become king.",
  "s0027": "Moreover monitor oversee world various generals, not become king cannot, wish general establish as Chu king.'",
  "s0028": "Chen She asked these two persons, two persons replied: 'Chu for no way, broke person states, extinguished person altars of soil, severed person posterity, exhausted hundred surnames strength, used up hundred surnames wealth.",
  "s0029": "General glared eyes stretched courage, out ten thousand deaths not regard one life plan, for world remove cruelty.",
  "s0030": "Now beginning arrived Chen then king it, show world private.",
  "s0031": "Wish general no king, urgent led troops west, sent people establish six states posterity, self for tree party, for Qin increase enemy.",
  "s0032": "Enemy many then strength divide, with masses then troops strong.",
  "s0033": "Like this wilderness no intersect battle, county no guard city, execute violent Qin, occupy Xianyang to command feudal lords.",
  "s0034": "Feudal lords perished then got establish, with virtue subdue them, like this then imperial enterprise complete.",
  "s0035": "Now alone king Chen, fear world dissolve.'",
  "s0036": "Chen She not listened, then established as king.",
  "s0037": "Chen Yu then again persuaded Chen king: 'Great king raised Liang, Chu west, focused in enter pass, not reached collect Hebei.",
  "s0038": "Minister once wandered Zhao, knew its heroes terrain, wish ask odd troops north attack Zhao land.'",
  "s0039": "Then Chen king with formerly good Chen person Wu Chen as general, Shao Sao as protect army, with Zhang Er, Chen Yu as left right colonel, gave troops three thousand, north attack Zhao land.",
  "s0040": "Wu Chen etc. from Baima crossed river, to various counties, persuaded their heroes: 'Qin for chaotic government cruel punishments to harm world, several ten years.",
  "s0041": "North has long wall labor, south has five ridges garrison, outside inside disturbed, hundred surnames exhausted worn, head meeting basket collection, to supply army expenses, wealth depleted strength exhausted, people not live.",
  "s0042": "Heavy with harsh laws severe punishments, made world fathers sons not peaceful.",
  "s0043": "Chen king waved arm for world pioneer, occupied Chu land, square two thousand li, none not respond, family self anger, person self fight, each report their resentment attack their enemies, county kill their magistrate assistant, commandery kill their guard captain.",
  "s0044": "Now already spread great Chu, king Chen, made Wu Guang, Zhou Wen lead troops hundred thousand west attack Qin.",
  "s0045": "At this time not become seal marquis achievers, not person hero.",
  "s0046": "Various lords try mutually plan it!",
  "s0047": "World same heart suffered Qin long.",
  "s0048": "Because world strength attack no way lord, report fathers brothers resentment become divide land have soil enterprise, this scholar one time.'",
  "s0049": "Heroes all yes their words.",
  "s0050": "Then went collect troops, got several ten thousand persons, titled Wu Chen as Wu Xin Jun."
}
