{
  "s0051": "Shuo married Jin Cheng Gong sister as wife.",
  "s0052": "Jin Jing Gong third year, grand master Tu An Jia wished executed Zhao clan.",
  "s0053": "Initially, Zhao Dun at time, dreamed Shu Dai held belt cried, very sad;",
  "s0054": "Already laughed, clapped hands moreover sang.",
  "s0055": "Dun divined it, omen broke then good.",
  "s0056": "Zhao historian Yuan interpreted it, said: 'This dream very bad, not lord body, then lord son, however also lord blame.",
  "s0057": "To grandson, Zhao will generations increasingly decline.'",
  "s0058": "Tu An Jia, began favored by Ling Gong, when reached Jing Gong Jia as Sikou, about made difficulty, then treated Ling Gong traitor to involve Zhao Dun, widely told various generals: 'Dun though not knew, still traitor head.",
  "s0059": "With minister assassinated lord, sons grandsons in court, with what punish crime?",
  "s0060": "Please executed them.'",
  "s0061": "Han Jue said: 'Ling Gong encountered traitor, Zhao Dun outside, my previous lord considered no crime, thus not executed.",
  "s0062": "Now various lords will executed his descendants, this not previous lord intent now arbitrarily executed.",
  "s0063": "Arbitrarily executed called chaos.",
  "s0064": "Minister has great matter lord not heard, this no lord.'",
  "s0065": "Tu An Jia not listened.",
  "s0066": "Han Jue told Zhao Shuo hasten fled.",
  "s0067": "Shuo not willing, said: 'You certainly not cut Zhao sacrifices, Shuo die not regret.'",
  "s0068": "Han Jue promised, claimed illness not out.",
  "s0069": "Jia not requested yet arbitrarily with various generals attacked Zhao clan at lower palace, killed Zhao Shuo, Zhao Tong, Zhao Kuo, Zhao Ying Qi, all extinguished their clans.",
  "s0070": "Zhao Shuo wife Cheng Gong sister, had pregnant belly, fled palace hid.",
  "s0071": "Zhao Shuo guest called Gong Sun Chu Jiu, Chu Jiu told Shuo friend Cheng Ying: 'Why not die?'",
  "s0072": "Cheng Ying said: 'Shuo wife has pregnant belly, if fortunately male, I serve him;",
  "s0073": "If female, I slowly die.'",
  "s0074": "Dwelt no long, Shuo wife gave birth, bore male.",
  "s0075": "Tu An Jia heard, searched palace middle.",
  "s0076": "Lady placed child chided crevice blessed: 'Zhao clan extinguish? If cry;",
  "s0077": "Not extinguish, if no sound.'",
  "s0078": "When searched, child finally no sound.",
  "s0079": "Already escaped, Cheng Ying told Gong Sun Chu Jiu: 'Now one search not got, after certainly moreover search, how?'",
  "s0080": "Gong Sun Chu Jiu said: 'Establish orphan with die which difficult?'",
  "s0081": "Cheng Ying said: 'Die easy, establish orphan difficult.'",
  "s0082": "Gong Sun Chu Jiu said: 'Zhao clan previous lord treated you thick, you strong for their difficult, I for their easy, please first die.'",
  "s0083": "Then two persons plotted took other person infant carried it, clothed with embroidered blanket, hid mountain middle.",
  "s0084": "Cheng Ying out, falsely told various generals: 'Ying not worthy, cannot establish Zhao orphan.",
  "s0085": "Who able with me thousand gold, I tell Zhao clan orphan place.'",
  "s0086": "Various generals all happy, promised him, sent troops followed Cheng Ying attacked Gong Sun Chu Jiu.",
  "s0087": "Chu Jiu falsely said: 'Small man Cheng Ying!",
  "s0088": "Former lower palace difficulty could not die, with me plotted hid Zhao clan orphan child, now again sold me.",
  "s0089": "Even cannot establish, yet bear sold him?'",
  "s0090": "Embraced child called: 'Heaven heaven!",
  "s0091": "Zhao clan orphan child what crime?",
  "s0092": "Please live him, alone kill Chu Jiu can.'",
  "s0093": "Various generals not allowed, then killed Chu Jiu with orphan child.",
  "s0094": "Various generals considered Zhao clan orphan child indeed died, all happy.",
  "s0095": "However Zhao clan true orphan then instead at, Cheng Ying finally with together hid mountain middle.",
  "s0096": "Dwelt fifteen years, Jin Jing Gong ill, divined it, great enterprise after not succeeded as calamity.",
  "s0097": "Jing Gong asked Han Jue, Jue knew Zhao orphan at, then said: 'Great enterprise after in Jin cut sacrifices, perhaps Zhao clan?",
  "s0098": "Self Zhong Yan all Ying surname.",
  "s0099": "Zhong Yan person face bird beak, descended assisted Yin emperor Da Wu, and Zhou heavenly son, all had bright virtue.",
  "s0100": "Down to You Li without way, Shu Dai left Zhou went Jin, served previous lord Wen Hou, to Cheng Gong, generations had established merit, not tasted cut sacrifices."
}

