{
  "s0503": "Not if request Zhou jun which desire establish, with slight inform Jian, Jian request make Chu (He) [help] with earth.'",
  "s0504": "Indeed establish Gong Zi Jiu as crown prince.",
  "s0505": "Eight years, Qin attack Yi Yang, Chu save it.",
  "s0506": "Yet Chu with Zhou as Qin cause, will attack it.",
  "s0507": "Su Dai for Zhou tell Chu Wang said: 'Why with Zhou as Qin calamity?",
  "s0508": "Speak Zhou become Qin severe at Chu, desire make Zhou enter Qin, therefore call 'Zhou Qin'.",
  "s0509": "Zhou know its not able solve, must enter at Qin, this for Qin take Zhou essence.",
  "s0510": "For wang plan, Zhou at Qin because good it, not at Qin also speak good it, to sparse it at Qin.",
  "s0511": "Zhou cut at Qin, must enter at Ying.'",
  "s0513": "Qin borrow road two Zhou between, will to attack Han, Zhou fear borrow fear at Han, not borrow fear at Qin.",
  "s0514": "Shi Yan tell Zhou jun said: 'Why not make person tell Han Gong Shu said 'Qin dare cut Zhou yet attack Han, trust east Zhou.'",
  "s0515": "Gong why not with Zhou earth, send pledge make at Chu'?",
  "s0516": "Qin must doubt Chu not trust Zhou, is Han not attack.",
  "s0517": "Again tell Qin said 'Han strong with Zhou earth, will to doubt Zhou at Qin, Zhou not dare not receive'.",
  "s0518": "Qin must no word yet make Zhou not receive, is receive earth at Han yet listen at Qin.'",
  "s0520": "Qin summon west Zhou jun, west Zhou jun evil go, therefore make person tell Han wang said: 'Qin summon west Zhou jun, will to make attack wang south Yang, wang why not exit troops at south Yang?",
  "s0521": "Zhou jun will to become speech at Qin.",
  "s0522": "Zhou jun not enter Qin, Qin must not dare cross river yet attack south Yang.'",
  "s0524": "East Zhou with west Zhou battle, Han save west Zhou.",
  "s0525": "Or for east Zhou tell Han wang said: 'West Zhou former heavenly son state, many name vessels heavy treasures.",
  "s0526": "Wang press troops not exit, able virtue east Zhou, yet west Zhou treasures must able exhaust.'",
  "s0528": "Wang Nan tell Cheng jun.",
  "s0529": "Chu surround Yong Shi, Han request armor with grain at east Zhou, east Zhou jun fear, summon Su Dai yet inform it.",
  "s0530": "Dai said: 'Jun why suffer at this.",
  "s0531": "Minister able make Han not request armor with grain at Zhou, again able for jun get Gao Du.'",
  "s0532": "Zhou jun said: 'Son if able, request with state listen son.'",
  "s0533": "Dai see Han prime minister said: 'Chu surround Yong Shi, period three months, now five months not able pull, is Chu ill.",
  "s0534": "Now prime minister then request armor with grain at Zhou, is inform Chu ill.'",
  "s0535": "Han prime minister said: 'Good.",
  "s0536": "Messenger already walk.'",
  "s0537": "Dai said: 'Why not with Zhou Gao Du?'",
  "s0538": "Han prime minister big angry: 'I not request armor with grain at Zhou already many, why with Zhou Gao Du?'",
  "s0539": "Dai said: 'With Zhou Gao Du, is Zhou break yet enter at Han, Qin hear must big angry resent Zhou, then not pass Zhou messenger, is with obstruct Gao Du get complete Zhou.",
  "s0540": "Why not with?'",
  "s0541": "Prime minister said: 'Good.'",
  "s0542": "Indeed with Zhou Gao Du.",
  "s0543": "Thirty four years, Su Li tell Zhou jun said: 'Qin break Han, Wei, attack Shi Wu, north take Zhao Lin, Li Shi, all Bai Qi.",
  "s0544": "Is good use troops, again have heaven mandate.",
  "s0545": "Now again will troops exit pass attack Liang, Liang break then Zhou danger.",
  "s0546": "Jun why not make person tell Bai Qi?",
  "s0547": "Said 'Chu have Yang You Ji, good shoot.",
  "s0548": "Leave Liu leaf hundred step yet shoot it, hundred send yet hundred middle it.",
  "s0549": "Left right observe number thousand person, all said good shoot.",
  "s0550": "Have one husband stand its side, said 'good, able teach shoot'.",
  "s0551": "Yang You Ji angry, release bow grasp sword, said 'guest how able teach I shoot'?",
  "s0552": "Guest said 'not I able teach son branch left bend right.",
  "s0553": "Man leave Liu leaf hundred step yet shoot it, hundred send yet hundred middle it, not with good rest, little then qi decline force tired, bow pull arrow hook, one send not middle, hundred send all rest'.",
  "s0554": "Now break Han, Wei, attack Shi Wu, north take Zhao Lin, Li Shi, Gong merit many.",
  "s0555": "Now again will troops exit pass, over two Zhou, double Han, attack Liang, one raise not get, previous merit all abandon.",
  "s0556": "Gong not if call ill yet not exit.''",
  "s0558": "Forty two years, Qin break Hua Yang treaty.",
  "s0559": "Ma Fan tell Zhou jun said: 'Request make Liang wall Zhou.'",
  "s0560": "Then tell Liang wang said: 'Zhou wang ill if die, then Fan must die.",
  "s0561": "Fan request with nine tripods self enter at wang, wang receive nine tripods yet plan Fan.'",
  "s0562": "Liang wang said: 'Good.'",
  "s0563": "Then with it troops, speak defend Zhou.",
  "s0564": "Because tell Qin wang said: 'Liang not defend Zhou, will attack Zhou.",
  "s0565": "Wang try exit troops border to view it.'",
  "s0566": "Qin indeed exit troops.",
  "s0567": "Again tell Liang wang said: 'Zhou wang ill severe, Fan request after able yet recover it.",
  "s0568": "Now wang make troops at Zhou, feudal lords all born heart, after raise affairs and not trust.",
  "s0569": "Not if make troops for Zhou wall, to hide affairs end.'",
  "s0570": "Liang wang said: 'Good.'",
  "s0571": "Then make wall Zhou.",
  "s0572": "Forty five years, Zhou jun at Qin guest tell Zhou (Zui) [Ju] said: 'Gong not if praise Qin wang filial, because with Ying as queen mother nourish earth, Qin wang must happy, is Gong have Qin relation.",
  "s0573": "Relation good, Zhou jun must with as Gong merit.",
  "s0574": "Relation bad, advise Zhou jun enter Qin must have crime.'",
  "s0575": "Qin attack Zhou, yet Zhou Ju tell Qin wang said: 'For wang plan not attack Zhou.",
  "s0576": "Attack Zhou, actual not sufficient profit, sound fear world.",
  "s0577": "World with sound fear Qin, must east combine at Qi.",
  "s0578": "Troops tired at Zhou.",
  "s0579": "Combine world at Qi, then Qin not wang.",
  "s0580": "World desire tired Qin, advise wang attack Zhou.",
  "s0581": "Qin with world tired, then command not walk.'",
  "s0583": "Fifty eight years, three Jin resist Qin.",
  "s0584": "Zhou command its prime minister at Qin, with Qin light, return its walk.",
  "s0585": "Guest tell prime minister said: 'Qin light heavy not able know.",
  "s0586": "Qin desire know three state feeling.",
  "s0587": "Gong not if urgent see Qin wang said 'request for wang listen east change', Qin wang must heavy Gong.",
  "s0588": "Heavy Gong, is Qin heavy Zhou, Zhou with take Qin;",
  "s0589": "Qi heavy, then solid have Zhou Ju to receive Qi: is Zhou often not lose heavy state relation.'",
  "s0590": "Qin trust Zhou, send troops attack three Jin.",
  "s0591": "Fifty nine years, Qin take Han Yang Cheng Fu Shu, west Zhou fear, betray Qin, with feudal lords treaty follow, will world sharp troops exit Yi Guan attack Qin, make Qin not able pass Yang Cheng.",
  "s0592": "Qin Zhao Wang angry, make general Liu attack west Zhou.",
  "s0593": "West Zhou jun flee Qin, knock head receive crime, complete offer its Yi thirty six, mouth three thousand.",
  "s0594": "Qin receive its offer, return its jun at Zhou.",
  "s0595": "Zhou jun, wang Nan die, Zhou people then east flee.",
  "s0596": "Qin take nine tripods treasure vessels, yet move west Zhou Gong at Dan Hu.",
  "s0597": "After seven years, Qin Zhuang Xiang Wang extinguish east (west) Zhou.",
  "s0598": "East west Zhou all enter at Qin, Zhou then not sacrifice.",
  "s0599": "Grand historian said: Scholars all call Zhou attack Zhou, dwell Luo Yi, total its actual not so.",
  "s0600": "Wu Wang camp it, Cheng Wang make Zhao Gong divine dwell, dwell nine tripods there, yet Zhou again capital Feng, Hao.",
  "s0601": "Reach Quan Rong defeat You Wang, Zhou then east move at Luo Yi.",
  "s0602": "Called 'Zhou Gong bury (I) [at] Bi', Bi at Hao southeast Du middle.",
  "s0603": "Qin extinguish Zhou.",
  "s0604": "Han rise ninety have remain year, heavenly son will seal Tai mountain, east tour hunt reach He Nan, seek Zhou Miao Yi, seal its after Jia thirty Li earth, number said Zhou Zi Nan Jun, compare lie hou, to serve its previous sacrifice."
}

