{
  "s0051": "Qin Ying give birth Qin Hou.",
  "s0052": "Qin Hou establish ten years, die.",
  "s0053": "Give birth Gong Bo.",
  "s0054": "Gong Bo establish three years, die.",
  "s0055": "Give birth Qin Zhong.",
  "s0056": "Qin Zhong establish three years, Zhou Li Wang without way, feudal lords or rebel him.",
  "s0057": "West Rong rebel wang chamber, extinguish Quan Qiu Da Luo clan.",
  "s0058": "Zhou Xuan Wang establish, then with Qin Zhong as da fu, punish west Rong.",
  "s0059": "West Rong kill Qin Zhong.",
  "s0060": "Qin Zhong establish twenty three years, die at Rong.",
  "s0061": "Have son five people, its long said Zhuang Gong.",
  "s0062": "Zhou Xuan Wang then summon Zhuang Gong brothers five people, with troops seven thousand, make attack west Rong, break it.",
  "s0063": "Then again grant Qin Zhong after, reach its previous Da Luo earth Quan Qiu and have it, become west pendant da fu.",
  "s0064": "Zhuang Gong dwell its old west Quan Qiu, give birth son three people, its long male Shi Fu.",
  "s0065": "Shi Fu said: 'Rong kill my grandfather Zhong, I not kill Rong wang then not dare enter yi.'",
  "s0066": "Then will strike Rong, yield its younger brother Xiang Gong.",
  "s0067": "Xiang Gong become crown prince.",
  "s0068": "Zhuang Gong establish forty four years, die, crown prince Xiang Gong replace establish.",
  "s0069": "Xiang Gong first year, with woman younger sister Miao Ying as Feng wang wife.",
  "s0070": "Xiang Gong two years, Rong surround Quan Qiu, (Shi Fu) Shi Fu strike it, become Rong people capture.",
  "s0071": "Year remain, again return Shi Fu.",
  "s0072": "Seven years spring, Zhou You Wang use Bao Si abolish crown prince, establish Bao Si son as di, number cheat feudal lords, feudal lords rebel him.",
  "s0073": "West Rong Quan Rong with Shen Hou attack Zhou, kill You Wang Li mountain below.",
  "s0074": "Yet Qin Xiang Gong will troops save Zhou, battle very force, have merit.",
  "s0075": "Zhou avoid Quan Rong difficulty, east move Luo Yi, Xiang Gong with troops send Zhou Ping Wang.",
  "s0076": "Ping Wang seal Xiang Gong as feudal lord, grant it Qi west earth.",
  "s0077": "Said: 'Rong without way, invade seize my Qi, Feng earth, Qin able attack drive Rong, then have its earth.'",
  "s0078": "With oath, seal rank it.",
  "s0079": "Xiang Gong then begin state, with feudal lords pass make bet enjoy ritual, then use Liu Ju, yellow cow, Di sheep each three, sacrifice Shang Di west altar.",
  "s0080": "Twelve years, attack Rong yet reach Qi, die.",
  "s0081": "Give birth Wen Gong.",
  "s0082": "Wen Gong first year, dwell west pendant palace.",
  "s0083": "Three years, Wen Gong with troops seven hundred east hunt.",
  "s0084": "Four years, reach Qian Wei meeting.",
  "s0085": "Said: 'Previously Zhou yi my previous Qin Ying at this, after finally obtain become feudal lord.'",
  "s0086": "Then divine dwell it, occupy said auspicious, then camp yi it.",
  "s0087": "Ten years, initial make Fu altar, use three牢.",
  "s0088": "Thirteen years, initial have shi to record affairs, people many change.",
  "s0089": "Sixteen years, Wen Gong with troops attack Rong, Rong defeat flee.",
  "s0090": "Then Wen Gong then collect Zhou remain people have it, earth reach Qi, Qi east offer Zhou.",
  "s0091": "Nineteen years, get Chen treasure.",
  "s0092": "Twenty years, law initial have three clan crime.",
  "s0093": "Twenty seven years, attack south mountain big Ci, Feng big Te.",
  "s0094": "Forty eight years, Wen Gong crown prince die, grant posthumous Ruo Gong.",
  "s0095": "Ruo Gong long son become crown prince, is Wen Gong grandson.",
  "s0096": "Fifty years, Wen Gong die, bury west mountain.",
  "s0097": "Ruo Gong son establish, is Ning Gong.",
  "s0098": "Ning Gong two years, Gong move dwell Ping Yang.",
  "s0099": "Send troops attack Tang She.",
  "s0100": "Three years, with Bo battle, Bo wang flee Rong, then extinguish Tang She."
}