{
  "s0051": "Xiangru arrived, told the Qin king: 'Since Qin Duke Mu, over twenty rulers, never had firm binding agreements.'",
  "s0052": "I truly feared being deceived by Your Majesty and wronging Zhao, thus had someone carry the jade disk back, secretly it has reached Zhao.'",
  "s0053": "Moreover Qin is strong and Zhao weak. If Your Majesty sends a single envoy to Zhao, Zhao will immediately carry the jade disk to come.'",
  "s0054": "Now with Qin's strength to first cede fifteen commanderies to Zhao, how would Zhao dare keep the jade disk and offend Your Majesty?'",
  "s0055": "I know deceiving Your Majesty's crime deserves execution. I beg to enter the boiling cauldron. May Your Majesty and the ministers carefully consider it.'",
  "s0056": "The Qin king and ministers looked at each other and laughed.",
  "s0057": "The attendants wished to drag Xiangru away. The Qin king thus said: 'Now killing Xiangru, ultimately cannot obtain the jade disk, and severs Qin-Zhao harmony. Better to treat him generously and let him return to Zhao. Would the Zhao king for one jade disk's sake deceive Qin?'",
  "s0058": "Ultimately he received Xiangru in court, completed the rites and returned him.",
  "s0059": "Xiangru having returned, the Zhao king considered him a worthy minister who did not bring shame to the feudal lords, appointed Xiangru as upper minister.",
  "s0060": "Qin also did not give cities to Zhao, Zhao also ultimately did not give the jade disk to Qin.",
  "s0061": "Afterward Qin attacked Zhao, capturing Shicheng.",
  "s0062": "The next year, again attacked Zhao, killing twenty thousand.",
  "s0063": "The Qin king sent envoys to tell the Zhao king, wishing to hold a friendly meeting with the king outside Xhe at Mianchi.",
  "s0064": "The Zhao king feared Qin, wished not to go.",
  "s0065": "Lian Po and Lin Xiangru planned: 'If Your Majesty does not go, it shows Zhao weak and cowardly.'",
  "s0066": "The Zhao king thus went, Xiangru following.",
  "s0067": "Lian Po escorted to the border, took leave of the king saying: 'Your Majesty goes, measuring the road distance, the meeting etiquette finished, return, no more than thirty days.'",
  "s0068": "If thirty days not returned, then please establish the crown prince as king.",
  "s0069": "To cut off Qin's hopes.'",
  "s0070": "The king agreed, thus met the Qin king at Mianchi.",
  "s0071": "The Qin king drank wine freely, said: 'I privately heard the Zhao king likes music, please play the zither.'",
  "s0072": "The Zhao king played the zither.",
  "s0073": "The Qin scribe stepped forward writing: 'Such year month day, Qin king and Zhao king met drinking, ordered Zhao king to play zither.'",
  "s0074": "Lin Xiangru stepped forward saying: 'The Zhao king privately heard the Qin king is skilled at Qin music, please play the basin for the Qin king, to entertain each other.'",
  "s0075": "The Qin king angered, did not agree.",
  "s0076": "Thus Xiangru stepped forward with the basin, knelt requesting the Qin king.",
  "s0077": "The Qin king refused to strike the basin.",
  "s0078": "Xiangru said: 'Within five paces, Xiangru begs to splash Your Majesty with my neck blood!'",
  "s0079": "The attendants wished to attack Xiangru, Xiangru glared and berated them, the attendants all retreated.",
  "s0080": "Thus the Qin king displeased, struck the basin once.",
  "s0081": "Xiangru turned and summoned the Zhao scribe to write: 'Such year month day, Qin king struck basin for Zhao king.'",
  "s0082": "Qin's ministers said: 'Please offer Zhao's fifteen cities as toast to the Qin king.'",
  "s0083": "Lin Xiangru also said: 'Please offer Qin's Xianyang as toast to the Zhao king.'",
  "s0084": "The Qin king finished drinking, ultimately could not gain advantage over Zhao.",
  "s0085": "Zhao also massed troops ready for Qin, Qin dared not move.",
  "s0086": "Having ended and returned home, because Xiangru's merit great, appointed upper minister, position above Lian Po.",
  "s0087": "Lian Po said: 'I serve as Zhao general, have great merit of attacking cities and field battles, yet Lin Xiangru only labors with words, yet position above me. Moreover Xiangru originally base person, I ashamed, cannot bear being below him.'",
  "s0088": "He declared: 'If I see Xiangru, I will humiliate him.'",
  "s0089": "Xiangru heard, refused to meet him.",
  "s0090": "Xiangru at court always claimed illness, did not wish to contend with Lian Po for position.",
  "s0091": "Afterward Xiangru went out, saw Lian Po from afar, Xiangru turned his chariot to hide.",
  "s0092": "Thus his retainers together admonished: 'We left families and relatives to serve Your Lordship, only admiring Your Lordship's noble righteousness.'",
  "s0093": "Now Your Lordship and Lian Po same rank, Lian openly speaks ill and Your Lordship fears and hides, fear extremely great. Even common people still ashamed of this, how much more ministers and generals!",
  "s0094": "We unworthy, beg to resign.'",
  "s0095": "Lin Xiangru firmly stopped them, saying: 'You consider Lian general compared to Qin king, who stronger?'",
  "s0096": "They said: 'Not as good.'",
  "s0097": "Xiangru said: 'With the Qin king's prestige, yet Xiangru berated him in court, humiliated his ministers. Though Xiangru cowardly, how fear Lian general alone?'",
  "s0098": "I consider it: Strong Qin dares not use troops against Zhao, only because we two are there.'",
  "s0099": "Now two tigers fight together, their situation cannot both survive.'",
  "s0100": "I do this to put the state's urgency first and private enmity second.'"
}

