{
  "s0001": "Emperor Jing was the middle son of Emperor Wen.",
  "s0002": "His mother was Empress Dou.",
  "s0003": "When Emperor Wen was in Dai, the empress previously had three sons, and after Empress Dou was favored, the previous empress died, and the three sons also died, therefore Emperor Jing was able to be established.",
  "s0004": "In the first year, fourth month, on the day Bingmao, pardon the world.",
  "s0005": "On the day Bisi, grant the people nobility one level.",
  "s0006": "Fifth month, abolish half the land rent, establish the Taizong Temple for Emperor Wen.",
  "s0007": "Order the assembled ministers not to offer court congratulations.",
  "s0008": "The Xiongnu entered Dai, made peace treaty with them.",
  "s0009": "Second year spring, enfeoff former Chancellor Xiao He's grandson Xi as Marquis of Wuling.",
  "s0010": "Men at twenty receive registration.",
  "s0011": "Fourth month on the day Renwu, Empress Wen died.",
  "s0012": "Guangchuan and Changsha kings all went to their fiefs.",
  "s0013": "Chancellor Shen Tu Jia died.",
  "s0014": "Eighth month, appointed Imperial Secretary Kaifeng Tao Qing as chancellor.",
  "s0015": "Comet appeared in the northeast.",
  "s0016": "Autumn, in Hengshan hail fell, large ones five inches, deep ones two feet.",
  "s0017": "Mars moved retrograde, guarded Beichen.",
  "s0018": "Moon appeared between Beichen.",
  "s0019": "Jupiter moved retrograde in the Heavenly Court.",
  "s0020": "Established Nanling and within the Interior commandery, Sheyu as counties.",
  "s0021": "Third year first month on the day Bingji, pardon the world.",
  "s0022": "Long star appeared in the west.",
  "s0023": "Heavenly fire burned Luoyang's eastern palace great hall and city rooms.",
  "s0024": "Wu King Bi, Chu King Wu, Zhao King Sui, Jiaoxi King Ang, Jinan King Pi Guang, Zichuan King Xian, Jiaodong King Xiong Qu rebelled, raised troops heading west.",
  "s0025": "The emperor executed Chao Cuo, sent Yuan Ang to explain and warn, they did not stop, then surrounded Liang in the west.",
  "s0026": "The emperor then sent Grand General Dou Ying, Grand Commandant Zhou Yaofu to lead troops to execute them.",
  "s0027": "Sixth month on the day Binghai.",
  "s0028": "Pardoned the fleeing army and Chu Yuan King's son Yi and others who conspired in rebellion.",
  "s0029": "Enfeoff Grand General Dou Ying as Marquis of Weiqi.",
  "s0030": "Established Chu Yuan King's son Pinglu Marquis Li as Chu King.",
  "s0031": "Established imperial son Duan as Jiaoxi King, son Sheng as Zhongshan King.",
  "s0032": "Moved Jibei King Zhi to be Zichuan King, Huaiyang King Yu to be Lu King, Runan King Fei to be Jiangdu King.",
  "s0033": "Qi King Jiang Lu, Yan King Jia both died.",
  "s0034": "Fourth year summer, established the crown prince.",
  "s0035": "Established imperial son Che as Jiaodong King.",
  "s0036": "Sixth month on the day Jiaxu, pardon the world.",
  "s0037": "After nine months, changed Yiyang to Yangling.",
  "s0038": "Again established ferry passes, use passes to enter and exit.",
  "s0039": "Winter, made Zhao kingdom into Handan commandery.",
  "s0040": "Fifth year third month, built Yangling and Wei Bridge.",
  "s0041": "Fifth month, recruited migrants to Yangling, gave money twenty thousand.",
  "s0042": "Jiangdu great storm wind came from the west, destroyed city walls twelve zhang.",
  "s0043": "On the day Dingmao, enfeoff eldest princess's son Dang as Marquis of Longlu.",
  "s0044": "Moved Guangchuan King to be Zhao King.",
  "s0045": "Sixth year spring, enfeoff Central Commandant Zhao Wan as Marquis of Jianling, Jiangdu Chancellor Jia as Marquis of Jianping, Longxi Governor Hun Ye as Marquis of Pingqu, Zhao Chancellor Jia as Marquis of Jiangling, former General Bu as Marquis of Ju.",
  "s0046": "Liang and Chu two kings both died.",
  "s0047": "After nine months, cut down the galloping road trees, planted the orchid pond.",
  "s0048": "Seventh year winter, deposed Crown Prince Li as Linjiang King.",
  "s0049": "Eleventh month last day, eclipse of the sun.",
  "s0050": "Spring, released those serving as convicts working at Yangling.",
  "s0051": "Chancellor Qing resigned.",
  "s0052": "Second month on the day Biji, appointed Grand Commandant Marquis Tiao Zhou Yaofu as chancellor.",
  "s0053": "Fourth month on the day Biji, established Jiaodong King's mother as empress.",
  "s0054": "On the day Dingsi, established Jiaodong King as crown prince.",
  "s0055": "Named Che.",
  "s0056": "Middle first year, enfeoff former Imperial Secretary Zhou Ke's grandson Ping as Marquis of Sheng, former Imperial Secretary Zhou Chang's grandson Zuo Che as Marquis of Anyang, fourth month on the day Biji, pardon the world, grant nobility one level.",
  "s0057": "Abolished prohibitions and restrictions.",
  "s0058": "Earthquake.",
  "s0059": "Hengshan, Yuandu hail fell, large ones one chi eight inches.",
  "s0060": "Middle second year second month, Xiongnu entered Yan, then did not make peace treaty.",
  "s0061": "Third month, summoned Linjiang King to come.",
  "s0062": "He died in the Central Commandant's office.",
  "s0063": "Summer, established imperial son Yue as Guangchuan King, son Ji as Jiaodong King.",
  "s0064": "Enfeoffed four marquises.",
  "s0065": "Ninth month on the day Jiaxu, eclipse of the sun.",
  "s0066": "Middle third year winter, abolished the feudal lords' imperial secretaries.",
  "s0067": "Spring, two Xiongnu kings led their followers to surrender, all enfeoffed as marquises.",
  "s0068": "Middle fourth year third month, established Deyang Palace.",
  "s0069": "Great locusts.",
  "s0070": "Autumn, pardoned convicts working at Yangling.",
  "s0071": "Middle fifth year summer, established imperial son Shun as Changshan King.",
  "s0072": "Enfeoffed ten marquises.",
  "s0073": "Sixth month on the day Dingji, pardon the world, grant nobility one level.",
  "s0074": "World great floods.",
  "s0075": "Changed the name of feudal lords' chancellors to 'chancellor'.",
  "s0076": "Autumn, earthquake.",
  "s0077": "Middle sixth year second month on the day Jimao, traveled to Yong, offered sacrifices seeing the five emperors.",
  "s0078": "Third month, hail fell.",
  "s0079": "Fourth month, Liang Xiaowang, Chengyang Gongwang, Runan Wang all died.",
  "s0080": "Established Liang Xiaowang's son Ming as Jichuan King, son Peng Li as Jidong King, son Ding as Shanyang King, son Bu Shi as Ji Yin King.",
  "s0081": "Liang divided into five.",
  "s0082": "Enfeoffed four marquises.",
  "s0083": "Changed name of Court Judge to Grand Judge, Construction Foreman to Construction Grand Artisan, Chief of Nobility Commandant to Chief Commandant, Longxin Supervisor of Household to Longxin Junior Steward, Director of the Imperial Household to Grand Chamberlain of the Imperial Household, Grand Usher to Usher, Reverent Constant to Grand Constant, Protocol Secretary to Grand Protocol, Grain Intendant to Grand Farmer.",
  "s0084": "Made the Grand Interior two thousand shi, established left and right interior officials, belonging to the Grand Interior.",
  "s0085": "Seventh month on the day Xinhai, eclipse of the sun.",
  "s0086": "Eighth month, Xiongnu entered Shangjun.",
  "s0087": "Later first year winter, changed name of central palace guard commander to Guard Commander.",
  "s0088": "Third month on the day Dingyou, pardon the world, grant nobility one level, central two thousand shi, feudal lords' chancellors nobility right grandee.",
  "s0089": "Fourth month, great feast.",
  "s0090": "Fifth month on the day Bingxu, earthquake, at the time of early meal again shook.",
  "s0091": "Shangyong earthquake twenty-two days, destroyed city walls.",
  "s0092": "Seventh month on the day Yiji, eclipse of the sun.",
  "s0093": "Chancellor Liu She resigned.",
  "s0094": "Eighth month on the day Renchen, appointed Imperial Secretary Wan as chancellor, enfeoffed as Marquis of Jianling.",
  "s0095": "Later second year first month, earth shook three times in one day.",
  "s0096": "General Zhi attacked the Xiongnu.",
  "s0097": "Feast five days.",
  "s0098": "Ordered interior commanderies not to feed horses grain, confiscate to county officials.",
  "s0099": "Ordered convicts to wear seven-span cloth.",
  "s0100": "Stopped horse pounding.",
  "s0101": "Because the year harvest was poor, prohibited the world from eating unfashionable food.",
  "s0102": "Reduced the marquises sent to their fiefs.",
  "s0103": "Third month, Xiongnu entered Yanmen.",
  "s0104": "Tenth month, rented Changling fields.",
  "s0105": "Great drought.",
  "s0106": "Hengshan kingdom, Hedong, Yunzhong commandery people epidemic.",
  "s0107": "Later third year tenth month, sun and moon both appeared red five days.",
  "s0108": "Twelfth month last day, thunder.",
  "s0109": "Sun appeared purple.",
  "s0110": "Five stars moved retrograde guarding Taiwei.",
  "s0111": "Moon passed through the heavenly court center.",
  "s0112": "First month on the day Jiazi, crown prince capped.",
  "s0113": "On the day Jiazi, Emperor Jing died.",
  "s0114": "Testament granted feudal lords and kings below to people who become heirs nobility one level, world households one hundred cash.",
  "s0115": "Sent out palace people to return to their homes, pardoned without giving anything.",
  "s0116": "Crown prince ascended the throne, this was Emperor Wu.",
  "s0117": "Third month, enfeoffed Empress Dowager's younger brother Fen as Marquis of Wuan, younger brother Sheng as Marquis of Zhouyang.",
  "s0118": "Established Yangling.",
  "s0119": "The Grand Historian says: Han arose, Emperor Wen applied great virtue, the world felt peaceful, to Emperor Jing, no longer worried about different surnames, yet Chao Cuo cut and reduced the feudal lords, thus caused seven kingdoms to rise together, allied and headed west, because the feudal lords were too powerful, and Cuo did it not gradually.",
  "s0120": "When Zhu Fu Yan spoke of it, the feudal lords weakened, finally became peaceful.",
  "s0121": "The mechanism of safety and danger, how can it not be due to planning?"
}
