{
  "s0021": "Right Channel defended the city, saw that the tower ship army was small, immediately came out of the city to attack the tower ships, the tower ship army was defeated and scattered in flight.",
  "s0022": "General Yang Pu lost his troops, fled into the mountains for over ten days, gradually gathered the scattered soldiers, and reformed them.",
  "s0023": "The Left General attacked the Joseon army west of the Hun River, could not break through from the front.",
  "s0024": "The Son of Heaven, because neither general had achieved victory, sent Wei Shan to use the army's might to persuade Right Channel.",
  "s0025": "Right Channel saw the envoy and bowed his head in apology: 'I wish to surrender, but fear the two generals will deceitfully kill me;",
  "s0026": "Now seeing the trustworthy tally, I request to submit and surrender.'",
  "s0027": "He sent his crown prince to apologize, offering five thousand horses, and supplying army provisions.",
  "s0028": "With a crowd of over ten thousand people bearing arms, when they were about to cross the Hun River, the envoy and Left General suspected they would rebel, told the crown prince that since he had already submitted, the people should not bear arms.",
  "s0029": "The crown prince also suspected the envoy and Left General would deceitfully kill him, so did not cross the Hun River, and led them back again.",
  "s0030": "Shan returned and reported to the Son of Heaven, who executed Shan.",
  "s0031": "The Left General broke the army above the Hun River, then advanced to the city walls, surrounding the northwest.",
  "s0032": "The tower ships also went to join, stationed south of the city.",
  "s0033": "Right Channel thus firmly defended the city, after several months could not be taken.",
  "s0034": "The Left General had formerly been a palace attendant, was favored, commanded Yan and Dai troops, who were fierce, rode on victory, the army was mostly arrogant.",
  "s0035": "The tower ship general commanded Qi troops who entered by sea, had already suffered many defeats and losses;",
  "s0036": "Previously when they fought Right Channel, they suffered and lost troops, the troops were all fearful, the general's heart was ashamed, when surrounding Right Channel, they often held peace tallies.",
  "s0037": "The Left General urgently attacked, the Joseon ministers secretly sent people to privately agree to surrender to the tower ships, coming and going with messages, but not yet willing to decide.",
  "s0038": "The Left General repeatedly made battle appointments with the tower ships, the tower ships wished to quickly fulfill their agreement, did not meet;",
  "s0039": "The Left General also sent people to seek to secretly persuade Joseon to surrender, Joseon refused, their hearts attached to the tower ships: therefore the two generals could not cooperate.",
  "s0040": "The Left General suspected the tower ships previously had the crime of losing troops, now secretly befriended Joseon and still would not surrender, suspected they had rebellious plans, did not dare to act.",
  "s0041": "The Son of Heaven said the generals could not advance, previously sent Wei Shan to persuade Right Channel to surrender, Right Channel sent his crown prince, Shan could not decisively handle it, clashed with the Left General's plans, ultimately ruined the agreement.",
  "s0042": "Now the two generals surround the city, but are at odds, therefore long undecided.",
  "s0043": "Sent the Jinan governor Gongsun Sui to correct it, with discretion to handle affairs.",
  "s0044": "Sui arrived, the Left General said: 'Joseon should have surrendered long ago, not surrendering has a reason.'",
  "s0045": "He told Sui about the tower ships repeatedly not meeting appointments, fully informed him of his longstanding suspicions, saying: 'Now like this not taking it, I fear it will become a great harm, not only the tower ships, but also together with Joseon will destroy our army.'",
  "s0046": "Sui also thought it so, and used the tally to summon the tower ship general into the Left General's camp to discuss matters, immediately ordered the Left General's subordinates to arrest the tower ship general and his army, reporting to the Son of Heaven.",
  "s0047": "The Son of Heaven executed Sui.",
  "s0048": "The Left General already combined the two armies, immediately urgently attacked Joseon.",
  "s0049": "The Joseon chancellor Luo Ren, chancellor Han Yin, Ni Xi chancellor Shen, general Wang Xi together plotted: 'Initially wished to surrender to the tower ships, the tower ships now arrested, only the Left General commands alone, battle increasingly urgent, fear cannot resist, the king also refuses to surrender.'",
  "s0050": "Yin, Xi, Luo Ren all fled and surrendered to Han.",
  "s0051": "Luo Ren died en route.",
  "s0052": "In the third year of Yuanshou, summer, Ni Xi chancellor Shen sent people to kill Joseon king Right Channel and come surrender.",
  "s0053": "Wanggeom Fortress was not yet taken, therefore Right Channel's minister Cheng Ji again rebelled, attacked the officials again.",
  "s0054": "The Left General made Right Channel's son Chang surrender, and Luo Ren's son Zui announce and persuade their people, executed Cheng Ji, therefore finally pacified Joseon, making it four commanderies.",
  "s0055": "Enfeoffed Shen as Marquis of Luqing, Yin as Marquis of Dichu, Xi as Marquis of Pingzhou, Chang as Marquis of Ji.",
  "s0056": "Zui, because his father died and had considerable merit, became Marquis of Wenyang.",
  "s0057": "The Left General was summoned, sat for disputing merit and being jealous, conflicting plans, and was executed in the marketplace.",
  "s0058": "The tower ship general also sat for troops reaching the mouth of the Lie, should wait for the Left General, but presumptuously charged first, lost many, should be executed, redeemed as a commoner.",
  "s0059": "The Grand Historian said: Right Channel relied on fortifications, the state ended sacrifices.",
  "s0060": "She He fabricated merit, became the first to send troops.",
  "s0061": "The tower ship general was narrow-minded, met difficulty and shared blame.",
  "s0062": "Regretted losing Panyu, then returned and was suspected.",
  "s0063": "Xun Zhi disputed merit, with Sui were both executed.",
  "s0064": "Both armies were humiliated, the generals were not enfeoffed."
}
