{
  "s0101": "Lü Hou woman person, specialize desire with affairs kill different surname wang and big merit minister.'",
  "s0102": "Then then claim illness not go.",
  "s0103": "Its left right all perish hide.",
  "s0104": "Speak somewhat leak, Pi Yang hou hear it, return all report shang, shang benefit anger.",
  "s0105": "Again obtain Xiong Nu descend, descend speak Zhang Sheng perish at Xiong Nu, become Yan shi.",
  "s0106": "Then shang said: 'Lu Wan fruit rebel!'",
  "s0107": "Make Fan Kuai strike Yan.",
  "s0108": "Yan wang Wan all lead his palace person home belong ride several thousand dwell long city down, hou si, fortunate shang illness better, self enter thank.",
  "s0109": "Four month, Gao Zu collapse, Lu Wan then lead his crowd perish enter Xiong Nu, Xiong Nu with become Dong Hu Lu wang.",
  "s0110": "Wan become Man Yi place invade rob, constant think again return.",
  "s0111": "Dwell year remain, die Hu middle.",
  "s0112": "Gao Hou time, Lu Wan wife son perish descend Han, meet Gao Hou illness, cannot see, shed Yan di, become desire place wine see it.",
  "s0113": "Gao Zu finally collapse, not obtain see.",
  "s0114": "Lu Wan wife also illness die.",
  "s0115": "Xiao Jing middle six years, Lu Wan grandson Ta Zhi, with Dong Hu wang descend, seal become Ya Gu hou.",
  "s0116": "Chen Xi, Wan Qu person, not know start so obtain follow.",
  "s0117": "Reach Gao Zu seven years winter, Han wang Xin rebel, enter Xiong Nu, shang reach Ping Cheng return, then seal Xi become lie hou, with Zhao xiang guo lead supervise Zhao, Dai border troops, border troops all belong it.",
  "s0118": "Xi constant tell return pass Zhao, Zhao xiang Zhou Chang see Xi bin guest follow it several thousand ride, Han Dan official shed all full.",
  "s0119": "Xi so wait bin guest bu yi jiao, all out guest down.",
  "s0120": "Xi return Dai, Zhou Chang then seek enter see.",
  "s0121": "See shang, all speak Xi bin guest abundant very,擅 troops at outer several years, fear have change.",
  "s0122": "Shang then make person cover examine Xi guest dwell Dai wealth thing various not law affairs, many connect lead Xi.",
  "s0123": "Xi fear, yin make guest pass shi Wang Huang, Man Qiu Chen place.",
  "s0124": "Reach Gao Zu ten years seven month, tai shang huang collapse, make person summon Xi, Xi claim illness very.",
  "s0125": "Nine month, then with Wang Huang wait rebel, self establish become Dai wang, rob sweep Zhao, Dai.",
  "s0126": "Shang hear, then pardon Zhao, Dai li person become Xi place cheat mistake rob sweep, all pardon it.",
  "s0127": "Shang self go, reach Han Dan, happy said: 'Xi not south according Zhang Shui, north guard Han Dan, know its no able become.'",
  "s0128": "Zhao xiang memorial cut Chang Shan guard, wei, said: 'Chang Shan twenty five city, Xi rebel, perish its twenty city.'",
  "s0129": "Shang ask said: 'Guard, wei rebel?'",
  "s0130": "Answer said: 'Not rebel.'",
  "s0131": "Shang said: 'This strength not enough.'",
  "s0132": "Pardon it, again become Chang Shan guard, wei.",
  "s0133": "Shang ask Zhou Chang said: 'Zhao also have strong shi able make lead?'",
  "s0134": "Answer said: 'Have four people.'",
  "s0135": "Four people ye, shang man scold said: 'Shu zi able become jiang?'",
  "s0136": "Four people shame prostrate.",
  "s0137": "Shang seal it each thousand hu, become jiang.",
  "s0138": "Left right advise said: 'Follow enter Shu, Han, attack Chu, merit not all line, now this what merit yet seal?'",
  "s0139": "Shang said: 'Not if place know!",
  "s0140": "Chen Xi rebel, Han Dan with north all Xi have, I with yu xi raise tian xia troops, not have reach, now only alone Han Dan middle troops ear.",
  "s0141": "I Hu love four thousand hu seal four people, not with comfort Zhao zi brother!'",
  "s0142": "All said: 'Good.'",
  "s0143": "Then shang said: 'Chen Xi lead who?'",
  "s0144": "Said: 'Wang Huang, Man Qiu Chen, all old Jia person.'",
  "s0145": "Shang said: 'I know it.'",
  "s0146": "Then each with thousand jin purchase Huang, Chen wait.",
  "s0147": "Eleven years winter, Han troops strike cut Chen Xi jiang Hou Chang, Wang Huang at Qu Ni down, break Xi jiang Zhang Chun at Liao Cheng, cut head ten thousand remain.",
  "s0148": "Tai wei Bo enter settle Tai Yuan, Dai land.",
  "s0149": "Twelve month, shang self strike Dong Yuan, Dong Yuan not descend, zu scold shang;",
  "s0150": "Dong Yuan descend, zu scold cut it, not scold qing it.",
  "s0151": "Change life Dong Yuan become Zhen Ding.",
  "s0152": "Wang Huang, Man Qiu Chen its wei down receive purchase reward, all live obtain, with reason Chen Xi army then defeat.",
  "s0153": "Shang return reach Luo Yang.",
  "s0154": "Shang said: 'Dai dwell Chang Shan north, Zhao then from mountain south have it, far.'",
  "s0155": "Then establish son Heng become Dai wang, capital Zhong Du, Dai, Yan Men all belong Dai.",
  "s0156": "Gao Zu twelve years winter, Fan Kuai army zu pursue cut Xi at Ling Qiu.",
  "s0157": "Tai shi gong said: Han Xin, Lu Wan not su accumulate virtue accumulate good world, jiao one time power change, with zha li success, encounter Han begin settle, therefore obtain arrange land, south face call gu.",
  "s0158": "Inner see suspect qiang big, outer rely Man Mo become aid, therefore day su self danger, affairs poor wisdom kun, finally go Xiong Nu, qi not sorrow!",
  "s0159": "Chen Xi, Liang person, its young time number call admire Wei gong zi;",
  "s0160": "Reach jiang jun guard border, recruit reach bin guest yet down shi, name sound over real.",
  "s0161": "Zhou Chang suspect it, ci xia somewhat rise, fear calamity reach body, evil person advance say, then trap no way.",
  "s0162": "Yu xi sorrow!",
  "s0163": "Fu plan become shu success fail at person deep!"
}

