{
  "s0051": "Ruo Ao twenty years, Zhou You Wang by Quan Rong assassinated, Zhou east moved, Qin Xiang Gong began ranked as feudal lords.",
  "s0052": "Twenty seven years, Ruo Ao died, son Xiong Kan established, this was Xiao Ao.",
  "s0053": "Xiao Ao six years, died, son Xiong Shun established, this was Fen Mao.",
  "s0054": "Fen Mao thirteen years, Jin began chaos, because Qu Wo reason.",
  "s0055": "Fen Mao seventeen years, died.",
  "s0056": "Fen Mao younger brother Xiong Tong assassinated Fen Mao son replaced established, this was Chu Wu Wang.",
  "s0057": "Wu Wang seventeen years, Jin Qu Wo Zhuang Bo assassinated main state Jin Xiao Hou.",
  "s0058": "Nineteen years, Zheng Bo younger brother Duan made chaos.",
  "s0059": "Twenty one years, Zheng invaded heavenly son land.",
  "s0060": "Twenty three years, Wei assassinated their lord Huan Gong.",
  "s0061": "Twenty nine years, Lu assassinated their lord Yin Gong.",
  "s0062": "Thirty one years, Song Tai Zai Hua Du assassinated their lord Shang Gong.",
  "s0063": "Thirty five years, Chu attacked Sui.",
  "s0064": "Sui said: 'I no crime.'",
  "s0065": "Chu said: 'I barbarian also.",
  "s0066": "Now feudal lords all for rebel mutually invade, or mutually kill.",
  "s0067": "I have worn armor, wish observe central states governance, please royal house honor my title.'",
  "s0068": "Sui people for them Zhou, requested honor Chu, royal house not listened, returned reported Chu.",
  "s0069": "Thirty seven years, Chu Xiong Tong angered said: 'My ancestor Yu Xiong, Wen Wang teacher, early ended.",
  "s0070": "Cheng Wang raised my previous duke, then with zi nan land made dwell Chu, barbarian all submitted obeyed, yet wang not added position, I self honor.'",
  "s0071": "Then self established as Wu Wang, with Sui people allied left.",
  "s0072": "Then began opened Pu land had it.",
  "s0073": "Fifty one years, Zhou summoned Sui Hou, rebuked with established Chu as wang.",
  "s0074": "Chu angered, because Sui betrayed self, attacked Sui.",
  "s0075": "Wu Wang died army middle troops stopped.",
  "s0076": "Son Wen Wang Xiong Zi established, began capital Ying.",
  "s0077": "Wen Wang two years, attacked Shen passed Deng, Deng people said 'Chu wang easy take', Deng Hou not allowed.",
  "s0078": "Six years, attacked Cai, captured Cai Ai Hou returned, already released him.",
  "s0079": "Chu strong, overawed Jiang Han between small states, small states all feared it.",
  "s0080": "Eleven years, Qi Huan Gong began hegemon, Chu also began great.",
  "s0081": "Twelve years, attacked Deng, extinguished it.",
  "s0082": "Thirteen years, died, son Xiong Jian established, this was Zhuang Ao.",
  "s0083": "Zhuang Ao five years, wished kill his younger brother Xiong Yun, Yun fled Sui, with Sui attacked assassinated Zhuang Ao replaced established, this was Cheng Wang.",
  "s0084": "Cheng Wang Yun first year, initial established, spread virtue granted favor, joined old good with feudal lords.",
  "s0085": "Made people offered heavenly son, heavenly son granted zhu, said: 'Secure your southern Yi Yue chaos, no invade central states.'",
  "s0086": "Then Chu land thousand li.",
  "s0087": "Sixteen years, Qi Huan Gong with troops invaded Chu, reached Xing mountain.",
  "s0088": "Chu Cheng Wang made general Qu Wan with troops defended it, allied with Huan Gong.",
  "s0089": "Huan Gong rebuked with Zhou tribute not entered royal house, Chu promised it, then left.",
  "s0090": "Eighteen years, Cheng Wang with troops north attacked Xu, Xu jun bare flesh apologized, then released him.",
  "s0091": "Twenty two years, attacked Huang.",
  "s0092": "Twenty six years, extinguished Ying.",
  "s0093": "Thirty three years, Song Xiang Gong wished make alliance meeting, summoned Chu.",
  "s0094": "Chu wang angered said: 'Summon me, I will good go attack humiliate him.'",
  "s0095": "Then went, reached Meng, then seized humiliated Song Gong, already returned him.",
  "s0096": "Thirty four years, Zheng Wen Gong south court Chu.",
  "s0097": "Chu Cheng Wang north attacked Song, defeated at Hong, shot wounded Song Xiang Gong, Xiang Gong then ill wound died.",
  "s0098": "Thirty five years, Jin crown prince Chong Er passed Chu, Cheng Wang with feudal lords guest ritual feasted, thick sent to Qin.",
  "s0099": "Thirty nine years, Lu Xi Gong came requested troops to attack Qi, Chu made Shen Hou lead troops attacked Qi, took Gu, placed Qi Huan Gong son Yong there.",
  "s0100": "Qi Huan Gong seven sons all fled Chu, Chu all made upper grand masters."
}

