{
  "s0001": "Cao Mo was a man of Lu, served Lu Zhuang Gong with bravery and strength.",
  "s0002": "Zhuang Gong delighted in strength.",
  "s0003": "Cao Mo as Lu general, battled Qi, three times defeated retreated.",
  "s0004": "Lu Zhuang Gong feared, thus offered Sui yi land to make peace.",
  "s0005": "Still again made him general.",
  "s0006": "Qi Huan Gong permitted meet with Lu at Ke to ally.",
  "s0007": "Huan Gong with Zhuang Gong having allied on altar, Cao Mo grasped dagger hostage Qi Huan Gong. Huan Gong attendants none dared move, asked: 'You will what desire?'",
  "s0008": "Cao Mo said: 'Qi strong Lu weak, great state invade Lu also extreme.",
  "s0009": "Now Lu city broken then presses Qi border, lord consider it.'",
  "s0010": "Huan Gong thus permitted completely return Lu invaded land.",
  "s0011": "Already spoken, Cao Mo threw his dagger, descended altar, north faced took ministers' position, complexion unchanged, words as before.",
  "s0012": "Huan Gong angered, wished break agreement.",
  "s0013": "Guan Zhong said: 'Cannot.",
  "s0014": "Greed small benefit self-pleasure, abandon trust among feudal lords, lose world support, better give him.'",
  "s0015": "Thus Huan Gong then cut Qi invaded land, Cao Mo three battles lost land completely restored to Lu.",
  "s0016": "After hundred sixty seven years then Wu had Zhuan Zhu affair.",
  "s0017": "Zhuan Zhu was Wu Tang yi person.",
  "s0018": "Wu Zixu fled Chu went to Wu, knew Zhuan Zhu ability.",
  "s0019": "Wu Zixu having seen Wu King Liao, persuaded attacking Chu benefit.",
  "s0020": "Wu prince Guang said: 'That Wu Yuan father brothers all died in Chu yet Yuan speaks attack Chu, wishes self avenge private enmity, not can for Wu.'",
  "s0021": "Wu king thus stopped.",
  "s0022": "Wu Zixu knew Prince Guang desired kill Wu King Liao, thus said: 'That Guang will have inner ambition, cannot persuade with outer affairs.'",
  "s0023": "Thus advanced Zhuan Zhu to Prince Guang.",
  "s0024": "Guang father called Wu King Zhu Fan.",
  "s0025": "Zhu Fan younger brothers three: next called Yu Ji, next called Yi Mei, next called Ji Zi Zha.",
  "s0026": "Zhu Fan knew Ji Zi Zha worthy not established crown prince, by order passed three younger brothers, wished finally give state to Ji Zi Zha.",
  "s0027": "Zhu Fan having died, passed Yu Ji.",
  "s0028": "Yu Ji died, passed Yi Mei.",
  "s0029": "Yi Mei died, should pass Ji Zi Zha;",
  "s0030": "Ji Zi Zha fled would not establish, Wu people thus established Yi Mei son Liao as king.",
  "s0031": "Prince Guang said: 'If by brothers order, Ji Zi should establish;",
  "s0032": "Must by son, then Guang true proper heir, should establish.'",
  "s0033": "Thus often secretly nurtured plot ministers to seek establishment.",
  "s0034": "Guang having obtained Zhuan Zhu, well treated as guest.",
  "s0035": "Nine years then Chu Ping Wang died.",
  "s0036": "Spring, Wu King Liao wished take Chu mourning, made his two younger brothers Prince Gai Yu, Zhu Yong lead troops surround Chu Qian;",
  "s0037": "Sent Yanling Ji Zi to Jin, to observe feudal lords changes.",
  "s0038": "Chu sent troops cut Wu generals Gai Yu, Zhu Yong road, Wu troops could not return.",
  "s0039": "Thus Prince Guang told Zhuan Zhu: 'This time cannot lose, not seek what obtain!",
  "s0040": "Moreover Guang true king heir, should establish, Ji Zi though come, not abolish me.'",
  "s0041": "Zhuan Zhu said: 'King Liao can kill.",
  "s0042": "Mother old son weak, two younger brothers lead troops attack Chu, Chu cut their rear.",
  "s0043": "Now Wu externally distressed by Chu, internally empty without backbone ministers, is cannot do anything to me.'",
  "s0044": "Prince Guang bowed head: 'Guang body, your body.'",
  "s0046": "Fourth month bing zi, Guang hid armored soldiers in cave chamber, prepared wine invited King Liao.",
  "s0047": "King Liao made troops array from palace to Guang home, doorways stairs left right, all King Liao relatives.",
  "s0048": "Flanking standing attendants, all held long spears.",
  "s0049": "Wine already flowing, Prince Guang feigned foot illness, entered cave chamber, made Zhuan Zhu place dagger in fish roast belly advanced it.",
  "s0050": "Having reached king before, Zhuan Zhu split fish, thus with dagger stabbed King Liao, King Liao immediately died.",
  "s0051": "Attendants also killed Zhuan Zhu, king people chaotic."
}