{
  "s4070": "Tenth year: Jin Xi Ke defeated the duke at An, captured Peng Chou Fu.",
  "s4071": "Eleventh year: with Lu and Cao defeated Qi.",
  "s4073": "Second year, autumn: Shen Gong Wu Chen stole Zheng Shu's mother and fled to Jin, made him minister of Xing. Winter: attacked Wei and Lu, rescued Qi.",
  "s4075": "Eleventh year: Mu Gong passed away. With the feudal lords defeated Qi, returned and invaded their territory. Chu attacked us.",
  "s4085": "Third year: assembled Jin, Song, Wei, Cao to attack Zheng.",
  "s4086": "Eleventh year: Qing Gong went to Jin, wished to enfeoff Jin as king, Jin did not dare accept.",
  "s4087": "Twelfth year: began establishing the six ministers. Led the feudal lords to attack Zheng.",
  "s4094": "Seventh year: attacked Zheng.",
  "s4095": "Seventeenth year: Jin led the feudal lords to attack us.",
  "s4101": "Fourth year: the duke went to Jin, Jin was disrespectful, the duke wished to violate Jin and ally with Chu.",
  "s4103": "Thirteenth year: the Lu duke came, was disrespectful.",
  "s4105": "Fourth year: Zi Fan rescued Zheng.",
  "s4111": "Eighteenth year: Jin Luan Shu took our Fan. Xiang Gong passed away.",
  "s4116": "Twenty-first year: Ding Wang passed away.",
  "s4119": "Fourteenth year: Liang Shan collapsed. Bo Zong concealed the person but used his words.",
  "s4121": "Fifth year: attacked Zheng because they violated our alliance. Zheng Dao Gong came to accuse.",
  "s4127": "Zheng Dao Gong Fei first year: the duke went to Chu to accuse.",
  "s4135": "Fifteenth year: sent Luan Shu to rescue Zheng, then invaded Cai.",
  "s4141": "Seventh year: Jin invaded us.",
  "s4143": "Second year: Dao Gong passed away. Chu attacked us, Jin sent Luan Shu to rescue.",
  "s4151": "Sixteenth year: with Wu Chen began communicating with Wu and plotted against Chu.",
  "s4153": "Seventh year: attacked Zheng.",
  "s4159": "Zheng Cheng Gong Si first year: younger brother of Dao Gong. Chu attacked us.",
  "s4161": "Second year: minister Wu came, plotted to attack Chu.",
  "s4167": "Seventeenth year: restored Zhao Wu's fields. Invaded Cai.",
  "s4173": "Ninth year: Jin attacked us.",
  "s4182": "Seventeenth year: Qing Gong passed away.",
  "s4183": "Eighteenth year: seized Zheng Cheng Gong, attacked Zheng. Qin attacked us.",
  "s4184": "Twenty-second year: attacked Jin.",
  "s4185": "Ninth year: rescued Zheng. Winter: made peace with Jin.",
  "s4191": "Third year: allied with Chu. The duke went to Jin, seized the duke and attacked us.",
  "s4197": "Tenth year: the duke went to Jin for burial rites, hid it.",
  "s4207": "Fourth year: Jin led the feudal lords to attack us.",
  "s4216": "Twenty-fourth year: allied with the Jin duke across the river, returned and violated the alliance.",
  "s4245": "Thirteenth year: assembled Jin to attack Qin.",
  "s4246": "Fourth year: attacked Qin.",
  "s4247": "Third year: attacked Qin to Jing, defeated them, captured their general Cheng Chai.",
  "s4248": "Twenty-sixth year: Jin led the feudal lords to attack us.",
  "s4250": "Eleventh year: Jin led us to attack Qin.",
  "s4254": "Seventeenth year: Jin led us to attack Qin.",
  "s4255": "Seventh year: Jin led us to attack Qin.",
  "s4267": "Twelfth year: Ding Gong passed away.",
  "s4277": "Fifteenth year: began communicating with Wu, assembled at Zhong Li.",
  "s4279": "Fifth year: the three Xi slandered Bo Zong, killed him; Bo Zong was fond of upright remonstrance.",
  "s4281": "Fifteenth year: Xu feared Zheng, requested to move to Ye.",
  "s4282": "Thirteenth year: Hua Yuan fled to Jin, returned again.",
  "s4286": "Second year: Jin seized our duke and returned.",
  "s4289": "Tenth year: assembled with Lu at Zhong Li.",
  "s4293": "Sixteenth year: Xuan Bo informed Jin, wished to kill Ji Wen Zi, Wen Zi escaped through righteousness.",
  "s4297": "Twentieth year: Xiang Gong passed away.",
  "s4301": "Twenty-fourth year: Zhuang Gong passed away.",
  "s4305": "Second year: attacked Qin.",
  "s4309": "Sixth year: attacked Qin.",
  "s4313": "Tenth year: attacked Qin.",
  "s4317": "Fourteenth year: attacked Qin.",
  "s4321": "Eighteenth year: attacked Qin.",
  "s4325": "Twenty-second year: attacked Qin.",
  "s4329": "Twenty-sixth year: attacked Qin.",
  "s4333": "Thirtieth year: attacked Qin.",
  "s4337": "Thirty-fourth year: attacked Qin.",
  "s4341": "Thirty-eighth year: attacked Qin.",
  "s4345": "Forty-second year: attacked Qin.",
  "s4349": "Second year: attacked Qin.",
  "s4353": "Sixth year: attacked Qin.",
  "s4357": "Tenth year: attacked Qin.",
  "s4361": "Fourteenth year: attacked Qin.",
  "s4365": "Eighteenth year: attacked Qin.",
  "s4369": "Twenty-second year: attacked Qin.",
  "s4373": "Twenty-sixth year: attacked Qin.",
  "s4377": "Thirtieth year: attacked Qin.",
  "s4381": "Thirty-fourth year: attacked Qin.",
  "s4385": "Sixteenth year: Chu attacked us.",
  "s4389": "Forty-second year: attacked Qin.",
  "s4393": "Second year: attacked Qin.",
  "s4397": "Sixth year: attacked Qin.",
  "s4401": "Tenth year: attacked Qin.",
  "s4405": "Fourteenth year: attacked Qin.",
  "s4409": "Eighteenth year: attacked Qin.",
  "s4413": "Twenty-second year: attacked Qin.",
  "s4417": "Twenty-sixth year: attacked Qin.",
  "s4421": "Thirtieth year: attacked Qin.",
  "s4425": "Thirty-fourth year: attacked Qin.",
  "s4429": "Thirty-eighth year: attacked Qin.",
  "s4433": "Forty-second year: attacked Qin.",
  "s4437": "Second year: attacked Qin.",
  "s4441": "Sixth year: attacked Qin."
}
