{
  "s0001": "Jin Tang Shu Yu, Zhou Wu Wang son yet Cheng Wang younger brother.",
  "s0002": "Initially, Wu Wang with Shu Yu mother meet time, dreamed heaven told Wu Wang: 'I command woman give birth son, name Yu, I give him Tang.'",
  "s0003": "When gave birth son, writing on palm 'Yu', thus then because named Yu.",
  "s0004": "Wu Wang collapsed, Cheng Wang established, Tang had chaos, Zhou Gong executed extinguished Tang.",
  "s0005": "Cheng Wang with Shu Yu played, cut tong leaf as gui gave Shu Yu, said: 'With this seal you.'",
  "s0006": "Shi Yi because requested choose day establish Shu Yu.",
  "s0007": "Cheng Wang said: 'I with him played only.'",
  "s0008": "Shi Yi said: 'Heavenly son no playful words.",
  "s0009": "Words then historian writes it, ritual completes it, music sings it.'",
  "s0010": "Then established Shu Yu at Tang.",
  "s0011": "Tang at He, Fen east, square hundred li, thus called Tang Shu Yu.",
  "s0012": "Surname Ji clan, styled Zi Yu.",
  "s0013": "Tang Shu son Xie, this was Jin Hou.",
  "s0014": "Jin Hou son Ning Zu, this was Wu Hou.",
  "s0015": "Wu Hou son Fu Ren, this was Cheng Hou.",
  "s0016": "Cheng Hou son Fu, this was Li Hou.",
  "s0017": "Li Hou son Yi Jiu, this was Jing Hou.",
  "s0018": "Jing Hou already come, years can calculate.",
  "s0019": "From Tang Shu to Jing Hou five generations, no their year numbers.",
  "s0020": "Jing Hou seventeen years, Zhou Li Wang confused violent tyrannical, state people made chaos, Li Wang fled to Zhi, ministers administered politics, thus called 'Republican'.",
  "s0021": "Eighteen years, Jing Hou died, son Xi Hou Si Tu established.",
  "s0022": "Xi Hou fourteen years, Zhou Xuan Wang initial established.",
  "s0023": "Eighteen years, Xi Hou died, son Xian Hou Ji established.",
  "s0024": "Xian Hou eleven years died, son Mu Hou Fei Wang established.",
  "s0025": "Mu Hou four years, took Qi woman Jiang clan as wife.",
  "s0026": "Seven years, attacked Tiao.",
  "s0027": "Gave birth crown prince Qiu.",
  "s0028": "Ten years, attacked Qian Mu, had merit.",
  "s0029": "Gave birth young son, named Cheng Shi.",
  "s0030": "Jin person Shi Fu said: 'Strange, lord what name sons!",
  "s0031": "Crown prince called Qiu, Qiu enemy.",
  "s0032": "Young son called Cheng Shi, Cheng Shi great name, accomplish it.",
  "s0033": "Name self predicts;",
  "s0034": "Things self determine.",
  "s0035": "Now proper concubine names reverse, this later Jin able no chaos?'",
  "s0037": "Twenty seven years, Mu Hou died, younger brother Shang Shu self established, crown prince Qiu fled.",
  "s0038": "Shang Shu three years, Zhou Xuan Wang collapsed.",
  "s0039": "Four years, Mu Hou crown prince Qiu led his followers attacked Shang Shu established, this was Wen Hou.",
  "s0040": "Wen Hou ten years, Zhou You Wang without way, Quan Rong killed You Wang, Zhou east moved.",
  "s0041": "Yet Qin Xiang Gong began ranked as feudal lords.",
  "s0042": "Thirty five years, Wen Hou Qiu died, son Zhao Hou Bo established.",
  "s0043": "Zhao Hou first year, sealed Wen Hou younger brother Cheng Shi at Qu Wo.",
  "s0044": "Qu Wo city greater than Yi.",
  "s0045": "Yi, Jin jun capital city.",
  "s0046": "Cheng Shi sealed Qu Wo, titled Huan Shu.",
  "s0047": "Jing Hou concubine grandson Luan Bin assisted Huan Shu.",
  "s0048": "Huan Shu at time year fifty eight, loved virtue, Jin state crowds all attached.",
  "s0049": "Gentleman said: 'Jin chaos perhaps at Qu Wo.",
  "s0050": "Branch greater than root yet get people heart, not chaos what wait!'",
  "s0052": "Seven years, Jin ministers Pan Fu assassinated their lord Zhao Hou welcomed Qu Wo Huan Shu."
}
