{
  "s0101": "Four years, Lu Gong Zi Hui kill its lord Yin Gong.",
  "s0102": "Twelve years, attack Tang clan, take it.",
  "s0103": "Ning Gong give birth ten years establish, establish twelve years die, bury west mountain.",
  "s0104": "Give birth son three people, long male Wu Gong become crown prince.",
  "s0105": "Wu Gong younger brother De Gong, same mother Lu Ji son.",
  "s0106": "Give birth Chu Zi.",
  "s0107": "Ning Gong die, big common long Fu Ji, Wei Lei, San Fu abolish crown prince yet establish Chu Zi as jun.",
  "s0108": "Chu Zi six years, San Fu etc again together make person assassin kill Chu Zi.",
  "s0109": "Chu Zi give birth five years establish, establish six years die.",
  "s0110": "San Fu etc then again establish old crown prince Wu Gong.",
  "s0111": "Wu Gong first year, attack Peng Xi clan, reach Hua mountain below, dwell Ping Yang Feng palace.",
  "s0112": "Three years, punish San Fu etc yet exterminate three clan, with its kill Chu Zi.",
  "s0113": "Zheng Gao Qu Mi kill its lord Zhao Gong.",
  "s0114": "Ten years, attack Gui, Ji Rong, initial county it.",
  "s0115": "Eleven years, initial county Du, Zheng.",
  "s0116": "Extinguish small Guo.",
  "s0117": "Thirteen years, Qi person Guan Zhi Fu, Lian Cheng etc kill its lord Xiang Gong yet establish Gong Sun Wu Zhi.",
  "s0118": "Jin extinguish Huo, Wei, Geng.",
  "s0119": "Qi Yong Lin kill Wu Zhi, Guan Zhi Fu etc yet establish Qi Huan Gong.",
  "s0120": "Qi, Jin become strong state.",
  "s0121": "Nineteen years, Jin Qu Wo begin become Jin hou.",
  "s0122": "Qi Huan Gong ba at Juan.",
  "s0123": "Twenty years, Wu Gong die, bury Yong Ping Yang.",
  "s0124": "Initial with person follow die, follow die sixty six people.",
  "s0125": "Have son one person, name said Bai, Bai not establish, seal Ping Yang.",
  "s0126": "Establish its younger brother De Gong.",
  "s0127": "De Gong first year, initial dwell Yong city big Zheng palace.",
  "s0128": "With sacrifice three hundred pen sacrifice Fu altar.",
  "s0129": "Divine dwell Yong.",
  "s0130": "After son grandson drink horse at He.",
  "s0131": "Liang Bo, Rui Bo come court.",
  "s0132": "Two years, initial Fu, with dog resist Gu.",
  "s0133": "De Gong give birth thirty three years yet establish, establish two years die.",
  "s0134": "Give birth son three people: long son Xuan Gong, middle son Cheng Gong, young son Mu Gong.",
  "s0135": "Long son Xuan Gong establish.",
  "s0136": "Xuan Gong first year, Wei, Yan attack Zhou, exit Hui Wang, establish Wang Zi Dai.",
  "s0137": "Three years, Zheng Bo, Guo Shu kill Zi Dai yet enter Hui Wang.",
  "s0138": "Four years, make Mi altar.",
  "s0139": "With Jin battle He Yang, win it.",
  "s0140": "Twelve years, Xuan Gong die.",
  "s0141": "Give birth son nine people, not establish, establish its younger brother Cheng Gong.",
  "s0142": "Cheng Gong first year, Liang Bo, Rui Bo come court.",
  "s0143": "Qi Huan Gong attack Shan Rong, stop at Gu Zhu.",
  "s0144": "Cheng Gong establish four years die.",
  "s0145": "Son seven people, not establish, establish its younger brother Miao Gong.",
  "s0146": "Miao Gong Ren Hao first year, self will attack Mao Jin, win it.",
  "s0147": "Four years, welcome woman at Jin, Jin crown prince Shen Sheng sister.",
  "s0148": "Its year, Qi Huan Gong attack Chu, reach Shao Ling.",
  "s0149": "Five years, Jin Xian Gong extinguish Yu, Guo, capture Yu jun with its da fu Bai Li Xi, with Bi Ma bribe at Yu reason.",
  "s0150": "Already capture Bai Li Xi, become Qin Miao Gong wife attendant at Qin."
}

