{
  "s0102": "Yan general saw him, asked Yan general: 'Know minister what desire?'",
  "s0103": "Yan general said: 'If desire get Zhao king only.'",
  "s0104": "Said: 'Lord know Zhang Er, Chen Yu what like people?'",
  "s0105": "Yan general said: 'Worthy people.'",
  "s0106": "Said: 'Know their will what desire?'",
  "s0107": "Said: 'Desire get their king only.'",
  "s0108": "Zhao servant soldier then laughed: 'Lord unknown this two people what desire.",
  "s0109": "Wu Chen, Zhang Er, Chen Yu leaned horse stick down Zhao several ten cities, this also each desire south face king, how desire for minister chancellor end self?",
  "s0110": "Minister and lord how comparable same day speak, look their situation initial settled, not dare divide three king, moreover with young old first establish Wu Chen as king, to hold Zhao heart.",
  "s0111": "Now Zhao land already submit, this two people also desire divide Zhao king, time not possible only.",
  "s0112": "Now lord then imprisoned Zhao king.",
  "s0113": "This two people name seek Zhao king, real desire Yan kill him, this two people divide Zhao self establish.",
  "s0114": "With one Zhao still easy Yan, moreover with two worthy kings left hold right lead, yet blame kill king crime, extinguish Yan easy.'",
  "s0115": "Yan general considered yes, then returned Zhao king, servant soldier as charioteer returned.",
  "s0116": "Li Liang already settled Changshan, returned reported, Zhao king again made Liang attack Taiyuan.",
  "s0117": "Arrived Shiyi, Qin troops blocked Jingxing, not able advance.",
  "s0118": "Qin general falsely claimed Second Emperor sent people gave Li Liang letter, not sealed, said: 'Liang once served me got eminent favored.",
  "s0119": "Liang truly able rebel Zhao for Qin, pardon Liang crime, noble Liang.'",
  "s0120": "Liang got letter, doubted not believed.",
  "s0121": "Then returned Handan, increased requested troops.",
  "s0122": "Not arrived, road met Zhao king sister out drink, from hundred plus riders.",
  "s0123": "Li Liang gazed saw, considered king, prostrated met road side.",
  "s0124": "King sister drunk, not knew his general, made rider thank Li Liang.",
  "s0125": "Li Liang originally noble, rose, ashamed his following officials.",
  "s0126": "Following officials had one person said: 'World rebelled Qin, able ones first establish.",
  "s0127": "Moreover Zhao king originally out general under, now woman then not for general alight carriage, please pursue kill her.'",
  "s0128": "Li Liang already got Qin letter, firmly wished rebel Zhao, not decided, because this angered, sent people pursue kill king sister road middle, then thus led his troops attack Handan.",
  "s0129": "Handan not knew, unexpectedly killed Wu Chen, Shao Sao.",
  "s0130": "Zhao people many for Zhang Er, Chen Yu eyes ears, because got escape out.",
  "s0131": "Collected their troops, got several ten thousand persons.",
  "s0132": "Guest had persuaded Zhang Er: 'Two lords wandering, wish attach Zhao, difficult;",
  "s0133": "Alone establish Zhao posterity, support with righteousness, can achieve merit.'",
  "s0134": "Then sought got Zhao Xie, established as Zhao king, dwelt Xindu.",
  "s0135": "Li Liang advanced troops attacked Chen Yu, Chen Yu defeated Li Liang, Li Liang fled returned Zhang Han.",
  "s0136": "Zhang Han led troops arrived Handan, all moved its people Henan, razed its city walls.",
  "s0137": "Zhang Er with Zhao king Xie fled entered Julu city, Wang Li surrounded it.",
  "s0138": "Chen Yu north collected Changshan troops, got several ten thousand persons, army Julu north.",
  "s0139": "Zhang Han army Julu south Jiyuan, built passageway connected river, supplied Wang Li.",
  "s0140": "Wang Li troops provisions many, urgent attacked Julu.",
  "s0141": "Julu city middle provisions exhausted troops few, Zhang Er several times sent people summoned former Chen Yu, Chen Yu self measured troops few, not enemy Qin, dared not advance.",
  "s0142": "Several months, Zhang Er greatly angered, resented Chen Yu, made Zhang Yi, Chen Ze went reproached Chen Yu: 'Beginning I with you became neck-cutting friendship, now king with Er morning evening then die, yet you possess troops several ten thousand, not willing mutually save, where its mutually die!",
  "s0143": "If certainly trust, why not go Qin army together die?",
  "s0144": "Moreover have one ten two mutually whole.'",
  "s0145": "Chen Yu said: 'I measure advance finally cannot save Zhao,徒 exhaust perish army.",
  "s0146": "Moreover Yu what not together die, wish for Zhao king, Zhang jun report Qin.",
  "s0147": "Now certainly together die, like with meat give hungry tiger, what benefit?'",
  "s0148": "Zhang Yi, Chen Ze said: 'Matter already urgent, important with together die establish trust, how know later consideration!'",
  "s0149": "Chen Yu said: 'I die consider as no benefit.",
  "s0150": "Certainly like you say.'",
  "s0151": "Then made five thousand commanded Zhang Yi, Chen Ze first test Qin army, arrived all perished."
}
