{
  "s0051": "On the way he passed the eastern gate and saw Hou Sheng. He fully explained his plan to die charging the Qin army.",
  "s0052": "After bidding farewell, he set out. Hou Sheng said: 'My prince, do your best. This old minister cannot follow you.'",
  "s0053": "The prince had traveled several li when his heart was uneasy. He said: 'I have treated Hou Sheng with complete courtesy. The world all knows it. Now I am about to die, yet Hou Sheng has not even given me a single word or half a phrase to send me off. Have I perhaps offended him?'",
  "s0054": "He turned his chariot back and asked Hou Sheng.",
  "s0055": "Hou Sheng smiled and said: 'I knew the prince would return.'",
  "s0056": "'The prince loves scholars. His reputation is known throughout the world.",
  "s0057": "Now there is difficulty, yet without any other plan you wish to charge the Qin army—like throwing meat to a hungry tiger, what merit could there be?",
  "s0058": "Why still bother with retainers?",
  "s0059": "However, the prince has treated me generously. If the prince went and I did not send you off, I knew the prince would resent it and return.'",
  "s0060": "The prince bowed twice and asked for advice.",
  "s0061": "Hou Sheng then dismissed others and spoke privately: 'Ying has heard that Jin Bi's military tally is always kept in the king's sleeping quarters. Lady Ruji is most favored and enters and leaves the king's sleeping quarters—she has the strength to steal it.",
  "s0062": "Ying has heard that Lady Ruji's father was killed by someone. Lady Ruji has been seeking revenge for three years. From the king downward, all wished to avenge her father's death, but none could achieve it.",
  "s0063": "Lady Ruji wept to the prince, and the prince sent retainers to behead her enemy and respectfully present it to Lady Ruji.",
  "s0064": "Lady Ruji wishes to die for the prince without hesitation, but simply lacks the opportunity.",
  "s0065": "If the prince truly opens his mouth and asks Lady Ruji, she will certainly agree, then obtain the tiger tally and seize Jin Bi's army, rescue Zhao to the north and repel Qin to the west—this would be the campaign of the Five Hegemons.'",
  "s0066": "The prince followed his plan and asked Lady Ruji.",
  "s0067": "Lady Ruji indeed stole Jin Bi's military tally and gave it to the prince.",
  "s0068": "As the prince set out, Hou Sheng said: 'A general in the field does not necessarily obey the ruler's commands, for the benefit of the state.",
  "s0069": "If the prince matches the tally but Jin Bi does not hand over the army to the prince and instead asks the king, the matter will certainly be dangerous.",
  "s0070": "My retainer the butcher Zhu Hai can go with you. This man is a strong warrior.",
  "s0071": "If Jin Bi listens, it will be very good.",
  "s0072": "If he does not listen, Zhu Hai can strike him down.'",
  "s0073": "The prince wept at this.",
  "s0074": "Hou Sheng said: 'Does my prince fear death?",
  "s0075": "Why do you weep?'",
  "s0076": "The prince said: 'Jin Bi is a fierce and seasoned general. If I go, he may not listen and I must certainly kill him. That is why I weep. How could I fear death?'",
  "s0077": "The prince then invited Zhu Hai.",
  "s0078": "Zhu Hai smiled and said: 'I am just a market butcher wielding my knife, yet the prince has personally visited me several times. The reason I did not respond with thanks was that I considered small courtesies unnecessary.",
  "s0079": "Now the prince has urgent need—this is the time for me to give my life.'",
  "s0080": "He went with the prince.",
  "s0081": "The prince passed by to take leave of Hou Sheng.",
  "s0082": "Hou Sheng said: 'I should follow you, but I am old and cannot.",
  "s0083": "Please count the prince's travel days. On the day you reach Jin Bi's army, I will face north and cut my own throat to send off the prince.'",
  "s0084": "The prince set out.",
  "s0085": "He reached Ye and forged the King's order to replace Jin Bi.",
  "s0086": "Jin Bi matched the tally but doubted it. He raised his hand and looked at the prince: 'Now I command a force of 100,000 encamped at the border—a heavy responsibility for the state. Yet you come alone in a chariot to replace me. What should I make of this?'",
  "s0087": "He wished not to obey.",
  "s0088": "Zhu Hai hid a forty-jin iron hammer in his sleeve and hammered Jin Bi to death. The prince then commanded Jin Bi's army.",
  "s0089": "He rallied the troops and gave orders in the army: 'If father and son are both in the army, the father returns home.",
  "s0090": "If brothers are both in the army, the elder brother returns home.",
  "s0091": "If there are only sons with no brothers, they return home to care for parents.'",
  "s0092": "He obtained 80,000 selected troops and advanced to attack the Qin army.",
  "s0093": "The Qin army withdrew, and Handan was rescued, preserving Zhao.",
  "s0094": "The King of Zhao and Lord Pingyuan personally welcomed the prince at the border. Lord Pingyuan carried a crossbow and arrows, leading the way for the prince.",
  "s0095": "The King of Zhao bowed twice and said: 'Since ancient times, no worthy man has matched the prince.'",
  "s0096": "At this time, Lord Pingyuan did not dare compare himself to others.",
  "s0097": "The prince took leave of Hou Sheng. When he reached the army, Hou Sheng indeed faced north and cut his own throat.",
  "s0098": "The King of Wei was angry that the prince had stolen his military tally and forged the killing of Jin Bi. The prince also knew this himself.",
  "s0099": "After repelling Qin and preserving Zhao, he had his generals lead the army back to Wei, while the prince alone stayed with his retainers in Zhao.",
  "s0100": "King Xiaocheng of Zhao appreciated the prince's forging and seizing of Jin Bi's army to preserve Zhao. He consulted with Lord Pingyuan and enfeoffed the prince with five cities."
}
