{
  "s0301": "Qin law, entrust person yet entrusted not good, each with crime punish him.",
  "s0302": "Then Ying Hou crime should confiscate three clans.",
  "s0303": "Qin Zhao Wang feared injure Ying Hou intent, then issued order state middle: 'Have dare speak Zheng Anping matter, with crime punish him.'",
  "s0304": "Yet increased grant chancellor Ying Hou food daily thick, to comply adapt intent.",
  "s0305": "Later two years, Wang Ji as Hedong guard, with various lords communicate, sat law executed.",
  "s0306": "Yet Ying Hou increasingly not pleased.",
  "s0307": "Zhao Wang faced court sighed, Ying Hou advanced said: 'Minister heard 'lord worry minister shame, lord shame minister die'.",
  "s0308": "Now great king middle court worry, minister dare request crime.'",
  "s0309": "Zhao Wang said: 'I heard Chu iron sword sharp yet actors clumsy.",
  "s0310": "Iron sword sharp then scholars brave, actors clumsy then thoughts far.",
  "s0311": "With far thoughts govern brave scholars, I fear Chu plan Qin.",
  "s0312": "Things not prepared, not can respond suddenly, now Wu An Jun already died, Zheng Anping etc rebelled, inner no good general outer many enemy states, I thus worry.'",
  "s0313": "Wished stimulate encourage Ying Hou.",
  "s0314": "Ying Hou feared, not knew what out.",
  "s0315": "Cai Ze heard, went entered Qin.",
  "s0316": "Cai Ze, Yan person.",
  "s0317": "Wandered studied petitioned various lords small great very many, not met.",
  "s0318": "Followed Tang Ju chancellor, said: 'I heard master divined Li Kui, said 'hundred days within hold state authority', have it?'",
  "s0319": "Said: 'Have.'",
  "s0320": "Said: 'Like minister what?'",
  "s0321": "Tang Ju carefully observed laughed: 'Master what nose, great shoulders, snub face, wrinkled teeth, bent knees.",
  "s0322": "I heard holy not divine physiognomy, nearly master?'",
  "s0323": "Cai Ze knew Tang Ju played him, then said: 'Rich noble I self have, I not know longevity, wish hear it.'",
  "s0324": "Tang Ju said: 'Master longevity, from now future forty three years.'",
  "s0325": "Cai Ze laughed thanked left, told charioteer: 'I hold liang skewer teeth fat, leap horse swift drive, embrace yellow gold seal, tie purple ribbon waist, bow yield person lord before, eat meat rich noble, forty three years sufficient.'",
  "s0326": "Left Zhao, saw drove.",
  "s0327": "Went Han, Wei, met robbed pot tripod on road.",
  "s0328": "Heard Ying Hou entrusted Zheng Anping, Wang Ji all bore heavy crime at Qin, Ying Hou inner ashamed, Cai Ze then west entered Qin.",
  "s0329": "Will see Zhao Wang, made people declare to sense anger Ying Hou: 'Yan guest Cai Ze, world heroic outstanding great eloquent wise scholar.",
  "s0330": "He one see Qin king, Qin king certainly distress jun seize jun position.'",
  "s0331": "Ying Hou heard, said: 'Five emperors three dynasties matters, hundred schools sayings, I already know, crowds mouths debate, I all crushed, how able distress me seize position?'",
  "s0332": "Made people summoned Cai Ze.",
  "s0333": "Cai Ze entered, bowed Ying.",
  "s0334": "Ying Hou originally not fast, when saw him, again arrogant, Ying Hou because reproached: 'You once declared wished replace me chancellor Qin, rather have it?'",
  "s0335": "Replied: 'Yes.'",
  "s0336": "Ying Hou said: 'Please hear saying.'",
  "s0337": "Cai Ze said: 'Alas, jun what see late!",
  "s0338": "Four seasons sequence, successful leave.",
  "s0339": "Person life hundred body firm strong, hands feet convenient, ears eyes intelligent heart sage wise, how not scholar wish with?",
  "s0340": "Ying Hou said: 'Yes.'",
  "s0341": "Cai Ze said: 'Substantial benevolence grasp righteousness, walk way apply virtue, get will at world, world cherish happy revere love honor admire, all wish as lord king, how not eloquent wise period with?",
  "s0342": "Ying Hou said: 'Yes.'",
  "s0343": "Cai Ze again said: 'Rich noble illustrious honored, complete principle ten thousand things, make each get place;",
  "s0344": "Life longevity long, end heaven years not premature injure;",
  "s0345": "World continue unify, guard enterprise, transmit no end;",
  "s0346": "Name reality pure, favor flow thousand li, generations praise none cease, with heaven earth end beginning: how morality tally holy called auspicious good matters with?",
  "s0347": "Ying Hou said: 'Yes.'",
  "s0349": "Cai Ze said: 'If Qin Shang Jun, Chu Wu Qi, Yue Da Fu Zhong, their end also can wish with?",
  "s0350": "Ying Hou knew Cai Ze wished distress self with persuasion, again wrongly said: 'What not possible?",
  "s0350": "Gongsun Yang matters Xiao Gong, extreme body no two thoughts, exhaust public not regard private,"
}