{
  "s0121": "Not good establish name claim, call become long person.",
  "s0122": "Bu Yi die, son Xiang Ru replace.",
  "s0123": "Grandson Wang, sit brew gold lose hou.",
  "s0124": "Lang zhong ling Zhou Wen, name Ren, his first former Ren Cheng person.",
  "s0125": "With medicine see.",
  "s0126": "Jing Di become crown prince time, appoint become she ren, accumulate merit gradually move, Xiao Wen Di time reach tai zhong da fu.",
  "s0127": "Jing Di begin establish, appoint Ren become lang zhong ling.",
  "s0128": "Ren become person yin heavy not leak, constant wear old patch clothes urine pants, period become not jie clear, with this obtain fortunate.",
  "s0129": "Jing Di enter sleep inner, at back palace secret play, Ren constant at side.",
  "s0130": "Reach Jing Di collapse, Ren still become lang zhong ling, end no place speak.",
  "s0131": "Shang time ask person, Ren said: 'Shang self examine it.'",
  "s0132": "Yet also no place destroy.",
  "s0133": "With this Jing Di again self fortunate his home.",
  "s0134": "Home move Yang Ling.",
  "s0135": "Shang place grant very many, yet constant yield, not dare receive.",
  "s0136": "Various hou group minister lu yi, end no place receive.",
  "s0137": "Wu Di establish, with become former di minister, heavy him.",
  "s0138": "Ren then illness free, with two thousand dan lu return old, sons grandson all reach big official.",
  "s0139": "Yu shi da fu Zhang Shu, name Ou, An Qiu hou Shuo common son.",
  "s0140": "Xiao Wen time with govern punishment name speak affairs crown prince.",
  "s0141": "Yet Ou though govern punishment name home, his person long person.",
  "s0142": "Jing Di time respect heavy, constant become nine qing.",
  "s0143": "Reach Wu Di Yuan Shuo four years, Han An Guo free, zhao appoint Ou become yu shi da fu.",
  "s0144": "Self Ou become li, not once speak case person, specialize with sincere long person place official.",
  "s0145": "Official belong with him long person, also not dare big cheat.",
  "s0146": "Shang prepare prison affairs, have able reject, reject it;",
  "s0147": "Not able, not get already, become cry weep face face yet seal it.",
  "s0148": "His love person like this.",
  "s0149": "Old illness pi, please free.",
  "s0150": "Then tian zi also strategy stop, with shang da fu lu return old at home.",
  "s0151": "Home at Yang Ling.",
  "s0152": "Sons grandson all reach big official.",
  "s0153": "Tai shi gong said: Zhong Ni have speak said 'jun zi desire ne at speak yet min at conduct', its Wan Shi, Jian Ling, Zhang Shu wait call?",
  "s0154": "Therefore their teach not su yet become, not strict yet govern.",
  "s0155": "Sai hou wei qiao, yet Zhou Wen place chan jun zi ji him, become his near at ning.",
  "s0156": "Yet si able call du conduct jun zi!"
}

