{
  "s0001": "The ancestors of Qin were descendants of Emperor Zhuanxu, and a descendant named Nüxiu.",
  "s0002": "While Nüxiu was weaving, a dark bird dropped an egg, which Nüxiu swallowed and gave birth to a son named Daye.",
  "s0003": "Daye married a daughter of Shaodian, named Nühua.",
  "s0004": "Nühua gave birth to Dafei, who helped Yu control the floods.",
  "s0005": "When the work was complete, the Emperor bestowed a dark jade tablet.",
  "s0006": "Yu received it and said: 'It was not I alone who accomplished this; Dafei assisted me.'",
  "s0007": "Emperor Shun said: 'Ah, you Fei, you assisted Yu's work, and I bestow upon you a black pennant.",
  "s0008": "Your descendants shall greatly flourish.'",
  "s0009": "He then gave him a beautiful woman of the Yao surname as wife.",
  "s0010": "Dafei bowed and accepted, and assisted Shun in taming birds and beasts. Many birds and beasts became tame, and he was called Boyi.",
  "s0011": "Shun bestowed upon him the surname Ying.",
  "s0012": "Dafei had two sons: the first was Dalian, who founded the Niaoshu clan;",
  "s0013": "the second was Ruomu, who founded the Fei clan.",
  "s0014": "His great-great-grandson was Feichang, whose descendants lived either in the Central States or among the barbarians.",
  "s0015": "Feichang, during the reign of Jie of Xia, left Xia and joined Shang, becoming Tang's charioteer and defeating Jie at Mingtiao.",
  "s0016": "Dalian's great-great-grandson was named Mengxi and Zhongyan, who had bird-like bodies but spoke like humans.",
  "s0017": "Emperor Taiwu heard of this and divined whether to employ him as a charioteer. The divination was auspicious, so he made him a charioteer and gave him a wife.",
  "s0018": "From Taiwu onward, the descendants of Zhongyan continued to achieve merit, assisting the Yin state, so the Ying surname became prominent and they became feudal lords.",
  "s0019": "His great-great-grandson was Zhongjue, who lived among the Western Rong and protected the western frontier.",
  "s0020": "He fathered Feilian.",
  "s0021": "Feilian fathered Elai.",
  "s0022": "Elai was strong, and Feilian was a swift runner; father and son both served Yin Zhou with their abilities.",
  "s0023": "When King Wu of Zhou attacked Zhou, he also killed Elai.",
  "s0024": "At that time, Feilian was seeking stone for Zhou in the north. When he returned, having nowhere to report, he built an altar at Mount Huotai to make his report, and found a stone coffin with an inscription reading: 'The Emperor commands Chufu not to participate in Yin's chaos, and bestows upon you this stone coffin to honor the Hua clan.'",
  "s0025": "When he died, he was buried at Mount Huotai.",
  "s0026": "Feilian had another son named Jisheng.",
  "s0027": "Jisheng fathered Mengzeng.",
  "s0028": "Mengzeng was favored by King Cheng of Zhou, and was called 'Dwelling at Gaolang.'",
  "s0029": "Gaolang fathered Hengfu, and Hengfu fathered Zaofu.",
  "s0030": "Zaofu was favored by King Mu of Zhou for his excellent charioteering, and obtained the four horses Ji, Wenli, Hualiu, and Lu'er. They went on a western inspection tour, enjoying themselves so much they forgot to return.",
  "s0031": "When Xu Yanwang rebelled, Zaofu served as King Mu's charioteer, driving swiftly back to Zhou, covering a thousand li in one day to suppress the rebellion.",
  "s0032": "King Mu enfeoffed Zaofu with the city of Zhao, and Zaofu's clan thereafter took the surname Zhao.",
  "s0033": "From Feilian's son Jisheng down five generations to Zaofu, they separately resided in Zhao.",
  "s0034": "Zhao Cui was his descendant.",
  "s0035": "Elai Ge, son of Feilian, died young.",
  "s0036": "He had a son named Nüfang.",
  "s0037": "Nüfang fathered Panggao, Panggao fathered Taiji, Taiji fathered Daluo, and Daluo fathered Feizi.",
  "s0038": "Because of Zaofu's favor, they all received the city of Zhao and took the surname Zhao.",
  "s0039": "Feizi lived at Quanqiu, where he loved horses and livestock and was skilled at raising them.",
  "s0040": "The people of Quanqiu reported this to King Xiao of Zhou, who summoned him to manage horses between the Qian and Wei rivers, and the horses multiplied greatly.",
  "s0041": "King Xiao wished to make him the legitimate heir of Daluo.",
  "s0042": "The daughter of the Marquis of Shen was Daluo's wife, and she bore a son Cheng as the legitimate heir.",
  "s0043": "The Marquis of Shen then said to King Xiao: 'Formerly, my ancestress, a woman of Mount Li, was wife to Rong Xuxuan and bore Zhongjue. Because of this kinship, they returned to Zhou and protected the western frontier, and the western frontier was peaceful because of this.",
  "s0044": "Now I have again given a wife to Daluo, who bore the legitimate son Cheng.",
  "s0045": "With the intermarriage of Shen and Luo, all the Western Rong submit; this is why you are king.",
  "s0046": "Your Majesty should consider this.'",
  "s0047": "King Xiao then said: 'Formerly, Boyi was Shun's master of livestock, and the livestock multiplied greatly, so he received land and was granted the surname Ying.",
  "s0048": "Now his descendants also raise horses for me, so I shall grant them territory as a dependent state.'",
  "s0049": "He established them at Qin, allowing them to continue the sacrifices of the Ying clan, and called them Qin Ying.",
  "s0050": "He also did not abolish the son of the Marquis of Shen's daughter as Luo's legitimate heir, in order to maintain peace with the Western Rong.",
  "s0051": "Qin Ying fathered Duke of Qin.",
  "s0052": "The Duke of Qin reigned for ten years and died.",
  "s0053": "He fathered Gongbo.",
  "s0054": "Gongbo reigned for three years and died.",
  "s0055": "He fathered Qin Zhong.",
  "s0056": "In the third year of Qin Zhong's reign, King Li of Zhou was tyrannical, and some feudal lords rebelled against him.",
  "s0057": "The Western Rong rebelled against the royal house and exterminated the Daluo clan at Quanqiu.",
  "s0058": "When King Xuan of Zhou ascended the throne, he made Qin Zhong a grand master and ordered him to punish the Western Rong.",
  "s0059": "The Western Rong killed Qin Zhong.",
  "s0060": "Qin Zhong had reigned for twenty-three years when he died at the hands of the Rong.",
  "s0061": "He had five sons, the eldest of whom was Duke Zhuang.",
  "s0062": "King Xuan of Zhou summoned Duke Zhuang and his four brothers, gave them seven thousand soldiers, and ordered them to attack the Western Rong. They defeated them.",
  "s0063": "Thereupon, he restored to Qin Zhong's descendants the lands of their ancestor Daluo at Quanqiu, and made them Grand Masters of the Western Frontier.",
  "s0064": "Duke Zhuang resided at the former Western Quanqiu and had three sons, the eldest being Shifu.",
  "s0065": "Shifu said: 'The Rong killed my grandfather Zhong. Unless I kill the Rong king, I will not dare enter the town.'",
  "s0066": "He then went to attack the Rong, yielding the succession to his younger brother Duke Xiang.",
  "s0067": "Duke Xiang became heir apparent.",
  "s0068": "Duke Zhuang reigned for forty-four years and died. His heir, Duke Xiang, succeeded him.",
  "s0069": "In the first year of Duke Xiang's reign, he gave his younger sister Mu Ying in marriage to the king of Feng.",
  "s0070": "In the second year of Duke Xiang's reign, the Rong besieged Quanqiu. Shifu attacked them but was captured by the Rong.",
  "s0071": "After more than a year, Shifu was returned.",
  "s0072": "In the seventh year, in spring, King You of Zhou used Baosi to depose the heir apparent and made Baosi's son the legitimate heir. He repeatedly deceived the feudal lords, and the feudal lords rebelled against him.",
  "s0073": "The Western Rong and the Quanrong, together with the Marquis of Shen, attacked Zhou and killed King You below Mount Li.",
  "s0074": "Duke Xiang of Qin led troops to rescue Zhou, fought valiantly, and achieved merit.",
  "s0075": "Zhou fled from the Quanrong threat and moved east to Luoyi. Duke Xiang escorted King Ping of Zhou with his troops.",
  "s0076": "King Ping enfeoffed Duke Xiang as a feudal lord and granted him the lands west of Qi.",
  "s0077": "He said: 'The Rong are lawless and have invaded and seized our lands of Qi and Feng. If Qin can attack and drive out the Rong, the land shall be yours.'",
  "s0078": "He made a covenant with him and enfeoffed him with noble rank.",
  "s0079": "Thus Duke Xiang first established a state. He exchanged diplomatic courtesies with the other feudal lords, and offered sacrifices to the Supreme Deity at the Western Altar using three each of bay colts, yellow oxen, and rams.",
  "s0080": "In the twelfth year, he attacked the Rong and reached Qi, where he died.",
  "s0081": "He fathered Duke Wen.",
  "s0082": "In the first year of Duke Wen's reign, he resided at the Western Frontier Palace.",
  "s0083": "In the third year, Duke Wen led seven hundred soldiers on an eastern hunting expedition.",
  "s0084": "In the fourth year, he reached the confluence of the Qian and Wei rivers.",
  "s0085": "He said: 'Formerly, Zhou established our ancestor Qin Ying here, and eventually he became a feudal lord.'",
  "s0086": "He then divined about settling there, and the omen was auspicious, so he built a town there.",
  "s0087": "In the tenth year, he first established the Fu Altar and offered three sets of sacrificial animals.",
  "s0088": "In the thirteenth year, scribes were first employed to record events, and many people became civilized.",
  "s0089": "In the sixteenth year, Duke Wen led troops to attack the Rong, and the Rong were defeated and fled.",
  "s0090": "Duke Wen then gathered the remaining people of Zhou and possessed them, extending his territory to Qi. The lands east of Qi he offered to Zhou.",
  "s0091": "In the nineteenth year, he obtained the Chen Treasure.",
  "s0092": "In the twentieth year, laws first included punishment extending to three generations of kin.",
  "s0093": "In the twenty-seventh year, he cut down the great catalpa on the Southern Mountain, and encountered a great bull.",
  "s0094": "In the forty-eighth year, Duke Wen's heir apparent died and was posthumously titled Duke Jing.",
  "s0095": "Duke Jing's eldest son became heir apparent; he was Duke Wen's grandson.",
  "s0096": "In the fiftieth year, Duke Wen died and was buried at the Western Mountain.",
  "s0097": "Duke Jing's son ascended the throne; this was Duke Ning.",
  "s0098": "In the second year of Duke Ning's reign, the duke moved his residence to Pingyang.",
  "s0099": "He sent troops to attack Dangshe.",
  "s0100": "In the third year, he fought with Bo. The king of Bo fled to the Rong, and Dangshe was subsequently destroyed.",
  "s0101": "In the fourth year, the Lu prince Hui assassinated his ruler Duke Yin.",
  "s0102": "In the twelfth year, he attacked the Dang clan and captured them.",
  "s0103": "Duke Ning was ten years old when he ascended the throne, and reigned for twelve years before dying. He was buried at the Western Mountain.",
  "s0104": "He had three sons; the eldest, Duke Wu, was heir apparent.",
  "s0105": "Duke Wu's younger brother was Duke De, born of the same mother, the daughter of Lu Ji.",
  "s0106": "She gave birth to Chuzi.",
  "s0107": "When Duke Ning died, the Grand Secretary Fuji, Weilei, and Sanfu deposed the heir apparent and established Chuzi as ruler.",
  "s0108": "In the sixth year of Chuzi's reign, Sanfu and the others again conspired to have someone assassinate Chuzi.",
  "s0109": "Chuzi was five years old when he was established, and ruled for six years before dying.",
  "s0110": "Sanfu and the others then reinstated the former heir apparent, Duke Wu.",
  "s0111": "In the first year of Duke Wu's reign, he attacked the Pengxi clan, reaching the foot of Mount Hua, and resided at the Feng Palace in Pingyang.",
  "s0112": "In the third year, he executed Sanfu and the others and exterminated their three clans, because they had killed Chuzi.",
  "s0113": "Gao Qumi of Zheng killed his ruler Duke Zhao.",
  "s0114": "In the tenth year, he attacked the Gui and Ji Rong, and first established them as counties.",
  "s0115": "In the eleventh year, he first established Du and Zheng as counties.",
  "s0116": "He destroyed Little Guo.",
  "s0117": "In the thirteenth year, Guan Zhifu and Lian Cheng of Qi killed their ruler Duke Xiang and established Gongsun Wuzhi.",
  "s0118": "Jin destroyed Huo, Wei, and Geng.",
  "s0119": "Yong Lin of Qi killed Wuzhi and Guan Zhifu and others, and established Duke Huan of Qi.",
  "s0120": "Qi and Jin became powerful states.",
  "s0121": "In the nineteenth year, Quwo of Jin first became the Marquis of Jin.",
  "s0122": "Duke Huan of Qi became hegemon at Juan.",
  "s0123": "In the twentieth year, Duke Wu died and was buried at Yong Pingyang.",
  "s0124": "For the first time, human sacrifices accompanied the burial; sixty-six people were sacrificed.",
  "s0125": "He had one son named Bai. Bai was not established as ruler, but was enfeoffed at Pingyang.",
  "s0126": "His younger brother Duke De was established.",
  "s0127": "In the first year of Duke De's reign, he first resided at the Dazheng Palace in the city of Yong.",
  "s0128": "He offered three hundred sets of sacrificial animals at the Fu Altar.",
  "s0129": "He divined about residing at Yong.",
  "s0130": "His descendants would water their horses at the Yellow River.",
  "s0131": "The Earl of Liang and the Earl of Rui came to pay court.",
  "s0132": "In the second year, the first Dog Days sacrifice was instituted, using dogs to ward off pestilence.",
  "s0133": "Duke De was thirty-three years old when he ascended the throne, and reigned for two years before dying.",
  "s0134": "He had three sons: the eldest was Duke Xuan, the second was Duke Cheng, and the youngest was Duke Mu.",
  "s0135": "The eldest son Duke Xuan was established.",
  "s0136": "In the first year of Duke Xuan's reign, Wei and Yan attacked Zhou, expelled King Hui, and established Prince Tui.",
  "s0137": "In the third year, the Earl of Zheng and Uncle of Guo killed Prince Tui and restored King Hui.",
  "s0138": "In the fourth year, he established the Mi Altar.",
  "s0139": "He fought with Jin at Heyang and defeated them.",
  "s0140": "In the twelfth year, Duke Xuan died.",
  "s0141": "He had nine sons, but none was established; his younger brother Duke Cheng was established.",
  "s0142": "In the first year of Duke Cheng's reign, the Earl of Liang and the Earl of Rui came to pay court.",
  "s0143": "Duke Huan of Qi attacked the Shanrong and encamped at Guzhu.",
  "s0144": "Duke Cheng reigned for four years and died.",
  "s0145": "He had seven sons, but none was established; his younger brother Duke Mu was established.",
  "s0146": "In the first year of Duke Mu Renhao's reign, he personally led an attack on Maojin and defeated it.",
  "s0147": "In the fourth year, he received a bride from Jin, who was the elder sister of Jin's heir apparent Shensheng.",
  "s0148": "That year, Duke Huan of Qi attacked Chu and reached Shaoling.",
  "s0149": "In the fifth year, Duke Xian of Jin destroyed Yu and Guo, and captured the ruler of Yu along with his minister Baili Xi, because they had bribed Yu with jade and horses.",
  "s0150": "After capturing Baili Xi, he was sent to Qin as an attendant for Duke Mu's wife.",
  "s0151": "Baili Xi fled from Qin to Wan, where he was seized by a man from the Chu border region.",
  "s0152": "Duke Mu heard that Baili Xi was worthy and wanted to ransom him at a high price, but feared Chu would not release him. So he sent someone to say to Chu: 'My attendant Baili Xi is there; please let me ransom him for five ram skins.'",
  "s0153": "",
  "s0154": "The people of Chu agreed to give him up.",
  "s0155": "At that time, Baili Xi was already over seventy years old.",
  "s0156": "Duke Mu released him from captivity and discussed state affairs with him.",
  "s0157": "Baili Xi declined, saying: 'I am a minister of a fallen state; what is there to ask me?'",
  "s0158": "Duke Mu said: 'The ruler of Yu did not employ you, and so perished. It was not your fault.'",
  "s0159": "He persisted in questioning him, and they talked for three days. Duke Mu was greatly pleased, entrusted him with the administration of the state, and called him 'Grand Master of the Five Ram Skins.'",
  "s0160": "Baili Xi declined, saying: 'I am not as good as my friend Jian Shu. Jian Shu is worthy, but the world does not know him.",
  "s0161": "I once wandered in poverty in Qi and begged for food in Zhi. Jian Shu took me in.",
  "s0162": "Because of this, I wanted to serve the ruler of Qi, Wuzhi, but Jian Shu stopped me, and I escaped the troubles in Qi and went to Zhou.",
  "s0163": "The Zhou prince Tui loved cattle, and I approached him through raising cattle.",
  "s0164": "When Tui was about to employ me, Jian Shu stopped me; I left and avoided being executed.",
  "s0165": "When I served the ruler of Yu, Jian Shu stopped me.",
  "s0166": "I knew the ruler of Yu would not employ me, but I was truly covetous of the salary and rank, so I stayed.",
  "s0167": "Twice I followed his advice and escaped; once I did not follow it, and I was caught up in Yu's troubles. This is how I know he is worthy.'",
  "s0168": "Duke Mu then sent someone with generous gifts to invite Jian Shu, and made him a Senior Grand Master.",
  "s0169": "In the autumn, Duke Mu personally led an attack on Jin and fought at Hequ.",
  "s0170": "Li Ji of Jin caused turmoil. The heir apparent Shensheng died at Xincheng, and Chong'er and Yiwu fled.",
  "s0171": "In the ninth year, Duke Huan of Qi held a meeting of the feudal lords at Kuiqiu.",
  "s0172": "Duke Xian of Jin died.",
  "s0173": "Li Ji's son Xiqi was established, but the minister Li Ke killed Xiqi.",
  "s0174": "Xun Xi established Zhuozi, but Li Ke again killed Zhuozi and Xun Xi.",
  "s0175": "Yiwu sent someone to request Qin's help to enter Jin.",
  "s0176": "Duke Mu agreed and sent Baili Xi to lead troops escorting Yiwu.",
  "s0177": "Yiwu said: 'If I am truly established, I will cede eight cities west of the Jin river to Qin.'",
  "s0178": "When he arrived and was established, he sent Pi Zheng to apologize to Qin, reneged on the agreement and did not give the cities west of the river, and killed Li Ke.",
  "s0179": "When Pi Zheng heard this, he was afraid, and so conspired with Duke Mu, saying: 'The people of Jin do not want Yiwu; they really want Chong'er.",
  "s0180": "Now that he has broken the agreement with Qin and killed Li Ke, this is all the plan of Lü Sheng and Xi Rui.",
  "s0181": "I hope you will urgently summon Lü and Xi with promises of gain; when they come, it will be convenient to install Chong'er instead.'",
  "s0182": "Duke Mu agreed, and sent someone with Pi Zheng to return and summon Lü and Xi.",
  "s0183": "Lü, Xi, and the others suspected that Pi Zheng was plotting against them, so they told Yiwu to kill Pi Zheng.",
  "s0184": "Pi Zheng's son Pi Bao fled to Qin and persuaded Duke Mu, saying: 'The ruler of Jin is unprincipled and the people are not attached to him; he can be attacked.'",
  "s0185": "Duke Mu said: 'If the people are truly dissatisfied, how was he able to execute his minister?",
  "s0186": "That he could execute his minister shows he has control.'",
  "s0187": "He did not listen, but secretly employed Pi Bao.",
  "s0188": "In the twelfth year, Guan Zhong and Xi Peng of Qi died.",
  "s0189": "Jin had a drought and came to request grain.",
  "s0190": "Pi Bao urged Duke Mu not to give it, but to attack them while they were starving.",
  "s0191": "Duke Mu asked Gongsun Zhi, who said: 'Famine and plenty alternate; we cannot refuse.'",
  "s0192": "He asked Baili Xi, who said: 'Yiwu offended you, but what crime did his people commit?'",
  "s0193": "So following the advice of Baili Xi and Gongsun Zhi, he gave them grain.",
  "s0194": "By boat and cart transport, an unbroken line stretched from Yong to Jiang.",
  "s0195": "In the fourteenth year, Qin had a famine and requested grain from Jin.",
  "s0196": "The ruler of Jin consulted his ministers.",
  "s0197": "Guo She said: 'Attack them while they are starving, and you can achieve great merit.'",
  "s0198": "The ruler of Jin followed this advice.",
  "s0199": "In the fifteenth year, he raised troops to attack Qin.",
  "s0200": "Duke Mu mobilized his forces, sent Pi Bao as general, and went himself to attack them.",
  "s0201": "On the renxu day of the ninth month, he joined battle with Duke Hui of Jin, Yiwu, at Han.",
  "s0202": "The ruler of Jin abandoned his army and competed with Qin for advantage; as he turned back, his horse stumbled.",
  "s0203": "Duke Mu and his bodyguards rode in pursuit, but could not catch the ruler of Jin, and were instead surrounded by the Jin army.",
  "s0204": "Jin attacked Duke Mu, and Duke Mu was wounded.",
  "s0205": "At that moment, three hundred men from below Mount Qi who had eaten his good horses charged through the Jin army. The Jin army broke their encirclement, and they rescued Duke Mu and in turn captured the ruler of Jin alive.",
  "s0206": "Earlier, Duke Mu had lost some fine horses, and more than three hundred commoners below Mount Qi had caught and eaten them together. Officials tracked them down and wanted to punish them according to law.",
  "s0207": "Duke Mu said: 'A gentleman does not harm people for the sake of livestock.",
  "s0208": "I have heard that eating good horse meat without drinking wine harms a person.'",
  "s0209": "So he gave them all wine and pardoned them.",
  "s0210": "When the three hundred men heard that Qin was attacking Jin, they all sought to join the campaign. When they saw Duke Mu in distress, they all charged forward and vied to die for him, to repay his kindness in the matter of the horses.",
  "s0211": "Duke Mu then brought the captured ruler of Jin home and issued an order throughout the state that they should purify themselves, for he would sacrifice the ruler of Jin to the Supreme Deity.",
  "s0212": "When the Zhou Son of Heaven heard this, he said, 'Jin is of the same surname as us,' and requested the release of the ruler of Jin.",
  "s0213": "Yiwu's elder sister was also Duke Mu's wife. When she heard this, she put on mourning clothes, went barefoot, and said: 'My brother and I cannot save each other, and thus we have disgraced your command.'",
  "s0214": "Duke Mu said: 'I captured the ruler of Jin as an achievement, but now the Son of Heaven requests his release, and my wife is distressed.'",
  "s0215": "So he made a covenant with the ruler of Jin, agreed to return him, moved him to better quarters, and presented him with seven sets of sacrificial animals.",
  "s0216": "In the eleventh month, he returned the ruler of Jin, Yiwu. Yiwu ceded his lands west of the river and sent his heir apparent Yu as a hostage to Qin.",
  "s0217": "Qin gave a woman of the royal clan in marriage to Yu.",
  "s0218": "At this time, Qin's territory extended east to the Yellow River.",
  "s0219": "In the eighteenth year, Duke Huan of Qi died.",
  "s0220": "In the twentieth year, Qin destroyed Liang and Rui.",
  "s0221": "In the twenty-second year, Prince Yu of Jin heard that the ruler of Jin was ill, and said: 'Liang is my mother's home, and Qin has destroyed it.",
  "s0222": "I have many brothers. When the ruler passes, Qin will certainly detain me, and Jin will regard me lightly and establish another son.'",
  "s0223": "So Yu fled and returned to Jin.",
  "s0224": "In the twenty-third year, Duke Hui of Jin died, and Yu was established as ruler.",
  "s0225": "Qin resented Yu for fleeing, so they welcomed Prince Chong'er of Jin from Chu and gave him Yu's former wife in marriage.",
  "s0226": "Chong'er at first declined, but later accepted.",
  "s0227": "Duke Mu treated him with ever greater courtesy and generosity.",
  "s0228": "In the spring of the twenty-fourth year, Qin sent someone to tell the ministers of Jin that they wished to install Chong'er.",
  "s0229": "Jin agreed, and so they sent someone to escort Chong'er.",
  "s0230": "In the second month, Chong'er was established as ruler of Jin; this was Duke Wen.",
  "s0231": "Duke Wen had someone kill Yu.",
  "s0232": "Yu was known as Duke Huai.",
  "s0233": "That autumn, King Xiang of Zhou's younger brother Dai attacked the king with the Di, and the king went to live in Zheng.",
  "s0234": "In the twenty-fifth year, the Zhou king sent someone to report the troubles to Jin and Qin.",
  "s0235": "Duke Mu of Qin led troops to help Duke Wen of Jin restore King Xiang and killed the king's brother Dai.",
  "s0236": "In the twenty-eighth year, Duke Wen of Jin defeated Chu at Chengpu.",
  "s0237": "In the thirtieth year, Duke Mu assisted Duke Wen of Jin in besieging Zheng.",
  "s0238": "Zheng sent someone to say to Duke Mu: 'Destroying Zheng will benefit Jin; Jin will gain from it, but Qin will have no benefit.",
  "s0239": "Jin's strength is Qin's worry.'",
  "s0240": "Duke Mu then withdrew his troops and returned.",
  "s0241": "Jin also withdrew.",
  "s0242": "In the winter of the thirty-second year, Duke Wen of Jin died.",
  "s0243": "A man from Zheng came to sell out Zheng to Qin, saying: 'I am in charge of the city gates; Zheng can be taken by surprise.'",
  "s0244": "Duke Mu asked Jian Shu and Baili Xi, who replied: 'To travel a thousand li through several states to attack someone by surprise rarely succeeds.",
  "s0245": "Moreover, if someone is selling out Zheng, how do we know that someone from our own state will not inform Zheng of our plans?",
  "s0246": "This cannot be done.'",
  "s0247": "Duke Mu said: 'You do not understand; I have already decided.'",
  "s0248": "So he dispatched troops, sending Baili Xi's son Mengming Shi, Jian Shu's son Xi Qishu, and Bai Yibing to lead the army.",
  "s0249": "On the day they departed, Baili Xi and Jian Shu wept for them.",
  "s0250": "Duke Mu heard of this and angrily said: 'I dispatch troops and you weep to demoralize my army; why?'",
  "s0251": "The two elders said: 'We would not dare to demoralize your army.",
  "s0252": "The army marches, and our sons go with it;",
  "s0253": "we are old, and fear we will not live to see their return, so we weep.'",
  "s0254": "The two elders withdrew and said to their sons: 'When your army is defeated, it will certainly be at the Xiao Pass.'",
  "s0255": "In the spring of the thirty-third year, the Qin army marched east, crossed Jin territory, and passed by the north gate of Zhou.",
  "s0256": "Prince Man of Zhou said: 'The Qin army is disrespectful; what else can they expect but defeat!'",
  "s0257": "When the army reached Hua, a Zheng merchant named Xian Gao, who was taking twelve oxen to sell in Zhou, saw the Qin army. Fearing he would be killed or captured, he presented his oxen, saying: 'I have heard that a great power is coming to punish Zheng. The ruler of Zheng is carefully preparing his defenses, and has sent me with twelve oxen to reward the soldiers.'",
  "s0258": "The three Qin generals said to each other: 'We were going to surprise Zheng, but now Zheng is aware of it; there is no point in going.'",
  "s0259": "They destroyed Hua.",
  "s0260": "Hua was a border town of Jin.",
  "s0261": "At that time, Duke Wen of Jin's coffin had not yet been buried.",
  "s0262": "The heir apparent Duke Xiang angrily said: 'Qin has insulted me as an orphan, taking advantage of the mourning period to destroy our Hua.'",
  "s0263": "So he dyed his mourning clothes black, dispatched troops to intercept the Qin army at Xiao, and attacked them, completely destroying the Qin army. Not one man escaped.",
  "s0264": "He captured the three Qin generals and brought them back.",
  "s0265": "Duke Wen's wife was a Qin woman. On behalf of the three imprisoned Qin generals, she requested: 'Duke Mu's hatred of these three men has entered his very bones and marrow. I beg you to let these three men return, so that my lord may have the pleasure of boiling them himself.'",
  "s0266": "The ruler of Jin agreed and returned the three Qin generals.",
  "s0267": "When the three generals arrived, Duke Mu put on plain clothes, went out to the suburbs to meet them, and wept to the three men, saying: 'Because I did not follow the advice of Baili Xi and Jian Shu, I brought disgrace upon you three. What was your crime?",
  "s0268": "You must devote yourselves wholeheartedly to washing away this shame; do not be negligent.'",
  "s0269": "He then restored the three men to their former ranks and offices, and treated them even more generously.",
  "s0270": "In the thirty-fourth year, Prince Shangchen of Chu assassinated his father King Cheng and took his place.",
  "s0271": "Duke Mu then again sent Mengming Shi and the others to lead troops against Jin, and they fought at Pengya.",
  "s0272": "Qin did not prevail and withdrew its troops.",
  "s0273": "The king of the Rong sent You Yu to Qin.",
  "s0274": "You Yu's ancestors were people of Jin who had fled to the Rong, and he could speak the Jin language.",
  "s0275": "Hearing that Duke Mu was worthy, he sent You Yu to observe Qin.",
  "s0276": "Duke Mu of Qin showed him the palaces and storehouses.",
  "s0277": "You Yu said: 'If spirits made these, then the spirits have been wearied.",
  "s0278": "If men made these, then the people have been oppressed.'",
  "s0279": "Duke Mu was surprised and asked: 'The Central States use the Odes, Documents, rites, music, and laws to govern, yet they still have disorder from time to time. Now the Rong and Yi have none of these; how do they govern? Is it not difficult?'",
  "s0280": "You Yu laughed and said: 'This is precisely why the Central States are in disorder.",
  "s0281": "From the time when the sage Huangdi created rites, music, and laws, and practiced them himself, there was barely minor order.",
  "s0282": "By subsequent generations, they became daily more arrogant and dissolute.",
  "s0283": "They relied on the authority of laws to demand service from their subordinates. When the subordinates were exhausted, they resented the superiors on grounds of humanity and righteousness. Superiors and subordinates fought and resented each other, leading to usurpation and regicide until whole clans were exterminated. All such cases belong to this pattern.",
  "s0284": "The Rong and Yi are not like this.",
  "s0285": "Superiors embrace simple virtue in treating their subordinates; subordinates cherish loyalty and trust in serving their superiors. The government of the whole state is like the governance of one body. They do not know by what means they govern; this is truly the government of sages.'",
  "s0286": "Duke Mu withdrew and asked the Palace Scribe Liao: 'I have heard that when a neighboring state has a sage, it is a worry for rival states.",
  "s0287": "Now You Yu is worthy; he is a threat to me. What shall I do about it?'",
  "s0288": "Palace Scribe Liao said: 'The Rong king dwells in a remote place and has not heard the sounds of the Central States.",
  "s0289": "Try sending him female musicians to beguile his mind;",
  "s0290": "request You Yu for him, to create a rift between them;",
  "s0291": "detain him and do not send him back, so that he misses his deadline.",
  "s0292": "The Rong king will find this strange and will certainly suspect You Yu.",
  "s0293": "When there is a rift between ruler and minister, he can be captured.",
  "s0294": "Moreover, if the Rong king loves music, he will certainly neglect government.'",
  "s0295": "Duke Mu said: 'Good.'",
  "s0296": "He then sat with You Yu on adjacent mats, shared dishes with him, and inquired thoroughly about the terrain and military situation. Afterward, he had Palace Scribe Liao send sixteen female musicians to the Rong king.",
  "s0297": "The Rong king accepted them and was delighted; he did not return for a whole year.",
  "s0298": "Qin then sent You Yu back.",
  "s0299": "You Yu remonstrated several times but was not heeded. Duke Mu also sent people several times to secretly invite You Yu, and You Yu eventually defected to Qin.",
  "s0300": "Duke Mu treated him with the courtesy due a guest and asked him about the situation for attacking the Rong.",
  "s0301": "In the thirty-sixth year, Duke Mu again treated Mengming and the others even more generously, and sent them to lead troops against Jin. They crossed the river, burned their boats, and utterly defeated the Jin forces, capturing Wangguan and Hao to avenge the battle of Xiao.",
  "s0302": "The Jin people all defended their cities and dared not come out.",
  "s0303": "Duke Mu then crossed the river himself at Maojin, collected the corpses at Xiao, held funeral rites for them, and mourned for three days.",
  "s0304": "He then made an oath to the army, saying: 'Alas, soldiers!",
  "s0305": "Listen without clamor; I make this sworn declaration to you.",
  "s0306": "The ancients sought counsel from the experienced and white-haired, and thus made no mistakes.'",
  "s0307": "He made this oath because he reflected with remorse on not having followed the counsel of Jian Shu and Baili Xi, so that later generations might remember his error.",
  "s0308": "When gentlemen heard of this, they all shed tears and said: 'Alas!",
  "s0309": "Duke Mu of Qin was so thorough in his treatment of others that he finally obtained the good fortune of Mengming.'",
  "s0310": "",
  "s0311": "In the thirty-seventh year, following You Yu's strategy, Qin attacked the Rong king, annexed twelve states, expanded its territory by a thousand li, and thus became hegemon over the Western Rong.",
  "s0312": "The Son of Heaven sent Duke Zhao to congratulate Duke Mu with bronze drums.",
  "s0313": "In the thirty-ninth year, Duke Mu died and was buried at Yong.",
  "s0314": "One hundred and seventy-seven people were sacrificed to accompany him in death, including three of Qin's finest ministers from the Ziyu clan, named Yanxi, Zhonghang, and Zhenhu, who were among those sacrificed.",
  "s0315": "The people of Qin mourned them and composed the poem 'Yellow Bird.'",
  "s0316": "The gentleman said: 'Duke Mu of Qin expanded his territory and enlarged his state, subjugating mighty Jin in the east and becoming hegemon over the Rong and Yi in the west. Yet he did not become leader of the feudal lords' covenants, and rightly so.",
  "s0317": "When he died, he abandoned his people and had his finest ministers sacrificed to accompany him.",
  "s0318": "When former kings died, they still left behind virtue and handed down laws. How much worse is it to take away the good men and loyal ministers whom the people mourned?",
  "s0319": "From this one can tell that Qin would not be able to campaign eastward again.'",
  "s0320": "Duke Mu had forty sons; his heir apparent Yong succeeded him. This was Duke Kang.",
  "s0321": "In the first year of Duke Kang.",
  "s0322": "In the previous year when Duke Mu died, Duke Xiang of Jin also died;",
  "s0323": "Duke Xiang's younger brother, named Yong, was born of a Qin mother and was in Qin.",
  "s0324": "Zhao Dun of Jin wanted to establish him as ruler and sent Sui Hui to welcome Yong. Qin escorted him with troops to Linghu.",
  "s0325": "Jin established Duke Xiang's son instead and attacked the Qin army. The Qin army was defeated, and Sui Hui came to Qin.",
  "s0326": "In the second year, Qin attacked Jin and captured Wucheng, in retaliation for the Linghu affair.",
  "s0327": "In the fourth year, Jin attacked Qin and captured Shaoliang.",
  "s0328": "In the sixth year, Qin attacked Jin and captured Jima.",
  "s0329": "They fought at Hequ and utterly defeated the Jin army.",
  "s0330": "The Jin people were troubled that Sui Hui was in Qin causing disorder, so they sent Wei Chouyou to feign defection and conspire with Sui Hui. By deception they secured Sui Hui, who then returned to Jin.",
  "s0331": "Duke Kang reigned for twelve years and died; his son Duke Gong succeeded him.",
  "s0332": "In the second year of Duke Gong, Zhao Chuan of Jin assassinated his ruler Duke Ling.",
  "s0333": "In the third year, King Zhuang of Chu was powerful; his northern army reached Luo and inquired about the Zhou tripods.",
  "s0334": "Duke Gong reigned for five years and died; his son Duke Huan succeeded him.",
  "s0335": "In the third year of Duke Huan, Jin defeated one of our generals.",
  "s0336": "In the tenth year, King Zhuang of Chu subdued Zheng and defeated the Jin army north of the river.",
  "s0337": "At this time, Chu was hegemon and convened meetings and covenants with the feudal lords.",
  "s0338": "In the twenty-fourth year, when Duke Li of Jin first ascended the throne, he and Duke Huan of Qin made a covenant with the Yellow River between them.",
  "s0339": "Upon returning, Qin broke the covenant and conspired with the Di to attack Jin.",
  "s0340": "In the twenty-sixth year, Jin led the feudal lords in attacking Qin. The Qin army was defeated and fled; the pursuers reached the Jing River and then returned.",
  "s0341": "Duke Huan reigned for twenty-seven years and died; his son Duke Jing succeeded him.",
  "s0342": "In the fourth year of Duke Jing, Luan Shu of Jin assassinated his ruler Duke Li.",
  "s0343": "In the fifteenth year, he rescued Zheng and defeated the Jin army at Li.",
  "s0344": "At this time Duke Dao of Jin was covenant leader.",
  "s0345": "In the eighteenth year, Duke Dao of Jin was powerful and frequently convened meetings of the feudal lords, leading them to attack Qin and defeating the Qin army.",
  "s0346": "The Qin army fled and the Jin army pursued, crossing the Jing River and reaching Yulin before returning.",
  "s0347": "In the twenty-seventh year, Duke Jing went to Jin and made a covenant with Duke Ping, but then broke it.",
  "s0348": "In the thirty-sixth year, Prince Wei of Chu assassinated his ruler and made himself king; this was King Ling.",
  "s0349": "Duke Jing's maternal younger brother Houzi Zhen was favored. Duke Jing's maternal younger brother was wealthy. Someone slandered him, and fearing execution, he fled to Jin with a thousand chariots of baggage.",
  "s0350": "Duke Ping of Jin said: 'Houzi is so wealthy; why did he flee?'",
  "s0351": "He replied: 'The Duke of Qin is unprincipled. Fearing execution, I wish to wait for a later generation before returning.'",
  "s0352": "In the thirty-ninth year, King Ling of Chu was powerful. He convened the feudal lords at Shen, became covenant leader, and executed Qing Feng of Qi.",
  "s0353": "Duke Jing reigned for forty years and died; his son Duke Ai succeeded him.",
  "s0354": "Houzi returned to Qin.",
  "s0355": "In the eighth year of Duke Ai, Prince Qiji of Chu assassinated King Ling and made himself king; this was King Ping.",
  "s0356": "In the eleventh year, King Ping of Chu came to request a Qin woman as a wife for his heir apparent Jian.",
  "s0357": "When she arrived in the state, she was beautiful, so he took her for himself.",
  "s0358": "In the fifteenth year, King Ping of Chu wanted to execute Jian, but Jian fled;",
  "s0359": "Wu Zixu fled to Wu.",
  "s0360": "The Jin ducal house was weak while the Six Ministers were powerful; they wanted to fight among themselves internally. This is why Qin and Jin did not attack each other for a long time.",
  "s0361": "In the thirty-first year, King Helü of Wu and Wu Zixu attacked Chu. The king of Chu fled to Sui, and Wu then entered Ying.",
  "s0362": "The Chu minister Shen Baoxu came to report the emergency. For seven days he did not eat, weeping day and night.",
  "s0363": "Qin then dispatched five hundred chariots to rescue Chu and defeated the Wu army.",
  "s0364": "The Wu army withdrew, and King Zhao of Chu was then able to return to Ying.",
  "s0365": "Duke Ai reigned for thirty-six years and died.",
  "s0366": "His heir apparent was Yi Gong. Yi Gong died young and could not succeed; Yi Gong's son was established. This was Duke Hui.",
  "s0367": "In the first year of Duke Hui, Confucius acted as prime minister of Lu.",
  "s0368": "In the fifth year, the Jin ministers Zhonghang and Fan rebelled against Jin. Jin sent the Zhi clan and Zhao Jianzi to attack them. The Fan and Zhonghang clans were defeated and fled to Qi.",
  "s0369": "Duke Hui reigned for ten years and died; his son Duke Dao succeeded him.",
  "s0370": "In the second year of Duke Dao, the Qi minister Tian Qi assassinated his ruler Ruzi and established his elder brother Yangsheng; this was Duke Dao.",
  "s0371": "In the sixth year, Wu defeated the Qi army.",
  "s0372": "The Qi people assassinated Duke Dao and established his son Duke Jian.",
  "s0373": "In the ninth year, Duke Ding of Jin and King Fuchai of Wu made a covenant, competing for precedence at Huangchi. Jin ultimately took precedence over Wu.",
  "s0374": "Wu was powerful and dominated the Central States.",
  "s0375": "In the twelfth year, Tian Chang of Qi assassinated Duke Jian and established his younger brother Duke Ping, with Tian Chang as prime minister.",
  "s0376": "In the thirteenth year, Chu destroyed Chen.",
  "s0377": "Duke Dao of Qin reigned for fourteen years and died; his son Duke Li Gong succeeded him.",
  "s0378": "Confucius died in the twelfth year of Duke Dao.",
  "s0379": "In the second year of Duke Li Gong, people from Shu came bearing gifts.",
  "s0380": "In the sixteenth year, he dug a moat along the river.",
  "s0381": "With twenty thousand troops, he attacked Dali and captured their royal city.",
  "s0382": "In the twenty-first year, Pinyang was first made a county.",
  "s0383": "Jin captured Wucheng.",
  "s0384": "In the twenty-fourth year, Jin was in turmoil. They killed Zhi Bo and divided his state among Zhao, Han, and Wei.",
  "s0385": "In the twenty-fifth year, Zhi Kai and the people of his town came to defect.",
  "s0386": "In the thirty-third year, he attacked Yiqu and captured their king.",
  "s0387": "In the thirty-fourth year, there was a solar eclipse.",
  "s0388": "Duke Li Gong died; his son Duke Zao succeeded him.",
  "s0389": "In the second year of Duke Zao, Nanzheng rebelled.",
  "s0390": "In the thirteenth year, Yiqu came to attack, reaching as far as south of the Wei River.",
  "s0391": "In the fourteenth year, Duke Zao died; his younger brother Duke Huai was established.",
  "s0392": "In the fourth year of Duke Huai, the Senior Minister Shuchang Chao and other ministers surrounded Duke Huai, and Duke Huai killed himself.",
  "s0393": "Duke Huai's heir apparent was Zhaozi, who died young. The ministers then established Zhaozi's son; this was Duke Ling.",
  "s0394": "Duke Ling was Duke Huai's grandson.",
  "s0395": "In the sixth year of Duke Ling, Jin fortified Shaoliang, and Qin attacked it.",
  "s0396": "In the thirteenth year, he fortified Jigu.",
  "s0397": "Duke Ling died. His son Duke Xian could not succeed; Duke Ling's youngest uncle Daozi was established. This was Duke Jian.",
  "s0398": "Duke Jian was Zhaozi's younger brother and Duke Huai's son.",
  "s0399": "In the sixth year of Duke Jian, officials were first ordered to wear swords.",
  "s0400": "He dug a moat along the Luo River.",
  "s0401": "He fortified Chongquan.",
  "s0402": "In the sixteenth year he died; his son Duke Hui succeeded him.",
  "s0403": "In the twelfth year of Duke Hui, his son Chuzi was born.",
  "s0404": "In the thirteenth year, he attacked Shu and captured Nanzheng.",
  "s0405": "Duke Hui died; Chuzi succeeded him.",
  "s0406": "In the second year of Chuzi's reign, the Senior Minister Shuchang Gai welcomed Duke Ling's son Duke Xian from west of the river and established him.",
  "s0407": "They killed Chuzi and his mother and threw them into the abyss.",
  "s0408": "Because Qin had frequently changed rulers in the past and relations between ruler and ministers were chaotic, Jin again grew strong and seized Qin's lands west of the river.",
  "s0409": "In the first year of Duke Xian, he stopped the practice of sacrificing retainers at funerals.",
  "s0410": "In the second year, he fortified Liyang.",
  "s0411": "In the fourth year, on the gengyin day of the first month, Duke Xiao was born.",
  "s0412": "In the eleventh year, the Grand Scribe Dan of Zhou had an audience with Duke Xian and said: 'Zhou was originally united with Qin and then separated; five hundred years after separation they will reunite, and seventeen years after reuniting a hegemon king will emerge.'",
  "s0413": "In the sixteenth year, peach trees blossomed in winter.",
  "s0414": "In the eighteenth year, it rained gold at Liyang.",
  "s0415": "In the twenty-first year, he fought with Jin at Shimen, beheading sixty thousand. The Son of Heaven congratulated him with ceremonial robes.",
  "s0416": "In the twenty-third year, he fought with Wei and Jin at Shaoliang and captured their general Gongsun Cuo.",
  "s0417": "In the twenty-fourth year, Duke Xian died; his son Duke Xiao succeeded him, already twenty-one years old.",
  "s0418": "In the first year of Duke Xiao, there were six powerful states east of the mountains and rivers: Duke Wei of Qi, King Xuan of Chu, King Hui of Wei, Duke Dao of Yan, Marquis Ai of Han, and Marquis Cheng of Zhao were contemporaries.",
  "s0419": "There were more than ten small states between the Huai and Si rivers.",
  "s0420": "Chu and Wei shared borders with Qin.",
  "s0421": "Wei built a long wall, from Zheng along the Luo River northward, possessing Shangjun.",
  "s0422": "Chu extended from Hanzhong, with Ba and Qianzhong in the south.",
  "s0423": "The Zhou royal house was weak, and the feudal lords governed by force, competing to annex each other.",
  "s0424": "Qin was remote in Yongzhou, excluded from the meetings and covenants of the Central States' feudal lords, and treated like the Yi and Di barbarians.",
  "s0425": "Duke Xiao therefore spread benevolence, supported orphans and widows, recruited warriors, and made clear the rewards for merit.",
  "s0426": "He issued an order throughout the state: 'Formerly, our Duke Mu, between Qi and Yong, cultivated virtue and practiced warfare, pacified Jin's troubles in the east using the river as boundary, became hegemon over the Rong and Di in the west, expanded territory by a thousand li, was honored by the Son of Heaven as hegemon, was congratulated by all the feudal lords, and opened a glorious and beautiful enterprise for later generations.",
  "s0427": "It happened that in the past, under Duke Li, Duke Zao, Duke Jian, and Chuzi, there was no peace. The state had internal troubles and had no leisure for external affairs. The Three Jin attacked and seized our former rulers' lands west of the river. The feudal lords despise Qin; no humiliation is greater than this.",
  "s0428": "When Duke Xian ascended the throne, he pacified the borders, moved the capital to Liyang, and intended to campaign eastward to recover Duke Mu's former territories and restore Duke Mu's government.",
  "s0429": "I, the lonely one, thinking of our former rulers' intentions, am constantly pained in my heart.",
  "s0430": "If any guest or minister can devise an extraordinary plan to strengthen Qin, I will give him high office and share my territory with him.'",
  "s0431": "Thereupon he sent troops east to besiege Shan city and west to behead the Huan king of the Rong.",
  "s0432": "Wei Yang heard this decree had been issued and entered Qin from the west, seeking an audience with Duke Xiao through Jing Jian.",
  "s0433": "In the second year, the Son of Heaven sent sacrificial meat.",
  "s0434": "In the third year, Wei Yang persuaded Duke Xiao to reform the laws and punishments, promote agriculture internally, and encourage rewards and punishments for death in battle externally. Duke Xiao approved.",
  "s0435": "Gan Long, Du Zhi, and others disapproved and disputed with him.",
  "s0436": "In the end Wei Yang's laws were implemented; the people found them burdensome.",
  "s0437": "After three years, the people found them convenient.",
  "s0438": "Wei Yang was then appointed Left Senior Minister.",
  "s0439": "These matters are found in the account of Lord Shang.",
  "s0440": "In the seventh year, he met with King Hui of Wei at Duping.",
  "s0441": "In the eighth year, he fought with Wei at Yuanli and achieved merit.",
  "s0442": "In the tenth year, Wei Yang became Grand Chief Constructor, led troops to besiege Wei's Anyi, and it surrendered.",
  "s0443": "In the twelfth year, he built Xianyang, constructed watchtowers, and Qin moved its capital there.",
  "s0444": "He merged the various small villages and hamlets into large counties, one magistrate per county, forty-one counties in all.",
  "s0445": "He opened up the fields by abolishing the paths between them.",
  "s0446": "The eastern territory extended across the Luo River.",
  "s0447": "In the fourteenth year, taxation was first instituted.",
  "s0448": "In the nineteenth year, the Son of Heaven honored him as hegemon.",
  "s0449": "In the twentieth year, all the feudal lords came to congratulate.",
  "s0450": "Qin sent Prince Shaoguan to lead an army to meet with the feudal lords at Fengze and to have audience with the Son of Heaven.",
  "s0451": "In the twenty-first year, Qi defeated Wei at Maling.",
  "s0452": "In the twenty-second year, Wei Yang attacked Wei and captured the Wei prince Ang.",
  "s0453": "Wei Yang was enfeoffed as a ranked marquis and given the title Lord Shang.",
  "s0454": "In the twenty-fourth year, he fought with Jin at Yanmen and captured their general Wei Cuo.",
  "s0455": "Duke Xiao died; his son King Huiwen succeeded him.",
  "s0456": "That year, Wei Yang was executed.",
  "s0457": "When Wei Yang first implemented the laws in Qin, the laws were not being followed because the heir apparent had violated the prohibitions.",
  "s0458": "Wei Yang said: 'The reason the laws are not being followed is that transgressions begin with the nobility.",
  "s0459": "If your lordship truly wishes to implement the laws, begin with the heir apparent.",
  "s0460": "The heir apparent cannot be branded, so brand his tutors.'",
  "s0461": "From then on the laws were greatly enforced, and the people of Qin were well governed.",
  "s0462": "When Duke Xiao died and the heir apparent succeeded, many of the royal clan resented Wei Yang. Wei Yang fled, and they used this as evidence of rebellion. He was ultimately torn apart by chariots and displayed throughout Qin.",
  "s0463": "In the first year of King Huiwen, people from Chu, Han, Zhao, and Shu came to pay court.",
  "s0464": "In the second year, the Son of Heaven sent congratulations.",
  "s0465": "In the third year, the king was capped.",
  "s0466": "In the fourth year, the Son of Heaven sent sacrificial meat of Kings Wen and Wu.",
  "s0467": "Qi and Wei became kings.",
  "s0468": "In the fifth year, Xishou of Yinjin became Grand Chief Constructor.",
  "s0469": "In the sixth year, Wei ceded Yinjin; Yinjin was renamed Ningqin.",
  "s0470": "In the seventh year, Prince Ang fought with Wei, captured their general Long Jia, and beheaded eighty thousand.",
  "s0471": "In the eighth year, Wei ceded the lands west of the river.",
  "s0472": "In the ninth year, he crossed the river and captured Fenyin and Pishi.",
  "s0473": "He met with the king of Wei at Ying.",
  "s0474": "He besieged Jiao, which surrendered.",
  "s0475": "In the tenth year, Zhang Yi became prime minister of Qin.",
  "s0476": "Wei ceded fifteen counties of Shangjun.",
  "s0477": "In the eleventh year, Yiqu was made a county.",
  "s0478": "Jiao and Quwo were returned to Wei.",
  "s0479": "The ruler of Yiqu became a subject.",
  "s0480": "Shaoliang was renamed Xiayang.",
  "s0481": "In the twelfth year, the La sacrifice was first instituted.",
  "s0482": "On the wuwu day of the fourth month of the thirteenth year, the ruler of Wei became king; Han also became a kingdom.",
  "s0483": "He sent Zhang Yi to attack and capture Shan, and expelled its people to Wei.",
  "s0484": "In the fourteenth year, a new era was begun.",
  "s0485": "In the second year, Zhang Yi met with senior ministers of Qi and Chu at Niesang.",
  "s0486": "In the third year, the heirs apparent of Han and Wei came to pay court.",
  "s0487": "Zhang Yi became prime minister of Wei.",
  "s0488": "In the fifth year, the king traveled to the Northern River.",
  "s0489": "In the seventh year, Yue Chi became prime minister of Qin.",
  "s0490": "Han, Zhao, Wei, Yan, and Qi led the Xiongnu in a joint attack on Qin.",
  "s0491": "Qin sent the Senior Minister Shuchang Ji to fight them at Xiuyu. He captured their general Shen Chai, defeated Prince Ke of Zhao and the heir apparent Huan of Han, and beheaded eighty-two thousand.",
  "s0492": "In the eighth year, Zhang Yi again became prime minister of Qin.",
  "s0493": "In the ninth year, Sima Cuo attacked Shu and destroyed it.",
  "s0494": "He attacked and captured Zhongdu and Xiyang of Zhao. In the tenth year, the heir apparent Cang of Han came as hostage.",
  "s0495": "He attacked and captured Shizhang of Han.",
  "s0496": "He attacked and defeated the Zhao general Ni.",
  "s0497": "He attacked and captured twenty-five cities from Yiqu.",
  "s0498": "In the eleventh year, Hui Li Ji attacked Wei's Jiao, which surrendered.",
  "s0499": "He defeated Han at Anmen, beheading ten thousand; their general Xishou fled.",
  "s0500": "Prince Tong was enfeoffed in Shu.",
  "s0501": "The ruler of Yan yielded to his minister Zizhi.",
  "s0502": "In the twelfth year, the king met with the king of Liang at Linjin.",
  "s0503": "The Senior Minister Shuchang Ji attacked Zhao and captured the Zhao general Zhuang.",
  "s0504": "Zhang Yi became prime minister of Chu.",
  "s0505": "In the thirteenth year, the Senior Minister Shuchang Zhang attacked Chu at Danyang, captured their general Qu Gai, and beheaded eighty thousand;",
  "s0506": "he also attacked Chu's Hanzhong, seized six hundred li of territory, and established the Hanzhong commandery.",
  "s0507": "Chu besieged Yongshi. Qin sent the Senior Minister Shuchang Ji to aid Han and attack Qi eastward, and sent Dao Man to aid Wei in attacking Yan.",
  "s0508": "In the fourteenth year, he attacked Chu and captured Zhaoling.",
  "s0509": "Dan and Li submitted. The Shu minister Zhuang killed the Marquis of Shu and came to surrender.",
  "s0510": "King Hui died; his son King Wu succeeded him.",
  "s0511": "Han, Wei, Qi, Chu, and Yue all came as subjects.",
  "s0512": "In the first year of King Wu, he met with King Hui of Wei at Linjin.",
  "s0513": "He executed the Shu minister Zhuang.",
  "s0514": "Zhang Yi and Wei Zhang both went east to Wei.",
  "s0515": "He attacked Yiqu, Dan, and Li.",
  "s0516": "In the second year, the office of Chancellor was first established; Hui Li Ji and Gan Mao became Left and Right Chancellors.",
  "s0517": "Zhang Yi died in Wei.",
  "s0518": "In the third year, he met with King Xiang of Han outside Linjin.",
  "s0519": "Nan Gongjie died; Hui Li Ji became prime minister of Han.",
  "s0520": "King Wu said to Gan Mao: 'I wish to open a road for chariots through Sanchuan, to look upon the Zhou royal house; then I could die without regret.'",
  "s0521": "That autumn, he sent Gan Mao and the Senior Minister Shuchang Feng to attack Yiyang.",
  "s0522": "In the fourth year, he captured Yiyang, beheading sixty thousand.",
  "s0523": "He crossed the river and fortified Wusui.",
  "s0524": "The heir apparent of Wei came to pay court.",
  "s0525": "King Wu was strong and loved sport. The strongmen Ren Bi, Wu Huo, and Meng Shuo all rose to high office.",
  "s0526": "The king competed with Meng Shuo in lifting a tripod and broke his kneecap.",
  "s0527": "In the eighth month, King Wu died.",
  "s0528": "Meng Shuo's entire clan was executed.",
  "s0529": "King Wu had married a woman from Wei as queen, but had no sons.",
  "s0530": "His half-brother of a different mother was established; this was King Zhaoxiang.",
  "s0531": "King Zhaoxiang's mother was a Chu woman, surnamed Mi, known as Queen Dowager Xuan.",
  "s0532": "When King Wu died, King Zhaoxiang was a hostage in Yan. The Yan people escorted him back, and he was established.",
  "s0533": "In the first year of King Zhaoxiang, Lord Yan Ji became prime minister.",
  "s0534": "Gan Mao left for Wei.",
  "s0535": "In the second year, a comet appeared.",
  "s0536": "The Senior Minister Shuchang Zhuang, along with senior ministers, feudal lords, and princes, rebelled. All were executed, and Queen Huiwen also did not die a natural death.",
  "s0537": "King Wu's widow was sent back to Wei.",
  "s0538": "In the third year, the king was capped.",
  "s0539": "He met with the king of Chu at Huangji and gave Chu Shangyong.",
  "s0540": "In the fourth year, he captured Puban.",
  "s0541": "A comet appeared.",
  "s0542": "In the fifth year, the king of Wei came to pay court at Yingting, and Puban was returned to Wei.",
  "s0543": "In the sixth year, the Marquis of Shu, Hui, rebelled; Sima Cuo pacified Shu.",
  "s0544": "The Senior Minister Shuchang Huan attacked Chu, beheading twenty thousand.",
  "s0545": "Lord Jingyang was sent as hostage to Qi.",
  "s0546": "There was a solar eclipse and daytime darkness.",
  "s0547": "In the seventh year, he captured Xincheng.",
  "s0548": "Hui Li Zi died.",
  "s0549": "In the eighth year, he sent General Mi Rong to attack Chu and capture Xinshi.",
  "s0550": "Qi sent Zhang Zi, Wei sent Gongsun Xi, and Han sent Bao Yuan to jointly attack Chu's Fangcheng and capture Tangmei.",
  "s0551": "Zhao destroyed Zhongshan; its ruler fled and eventually died in Qi.",
  "s0552": "Prince Jin of Wei and Prince Zhang of Han became feudal lords.",
  "s0553": "In the ninth year, Mengchang Jun Xue Wen came to be prime minister of Qin.",
  "s0554": "Huan attacked Chu, captured eight cities, and killed their general Jing Kuai.",
  "s0555": "In the tenth year, King Huai of Chu came to Qin for an audience; Qin detained him.",
  "s0556": "Xue Wen was dismissed because he accepted gold.",
  "s0557": "Lou Huan became Chancellor.",
  "s0558": "In the eleventh year, Qi, Han, Wei, Zhao, Song, and Zhongshan—five states—jointly attacked Qin, reaching Yanshi before returning.",
  "s0559": "Qin gave Han and Wei territory north of the river and Fengling to make peace.",
  "s0560": "A comet appeared.",
  "s0561": "King Huai of Chu fled to Zhao; Zhao refused to receive him and he was returned to Qin, where he died. His body was sent back for burial.",
  "s0562": "In the twelfth year, Lou Huan was dismissed; Marquis Rang Wei Ran became prime minister.",
  "s0563": "Fifty thousand shi of grain was given to Chu.",
  "s0564": "In the thirteenth year, Xiang Shou attacked Han and captured Wushi.",
  "s0565": "Left Senior Bai Qi attacked Xincheng.",
  "s0566": "The Fifth-Rank Minister Li fled to Wei.",
  "s0567": "Ren Bi became governor of Hanzhong.",
  "s0568": "In the fourteenth year, Left Senior Bai Qi attacked Han and Wei at Yique, beheading two hundred forty thousand, capturing Gongsun Xi, and taking five cities.",
  "s0569": "In the fifteenth year, Grand Chief Constructor Bai Qi attacked Wei, captured Yuan, then returned it.",
  "s0570": "He attacked Chu and captured Wan.",
  "s0571": "In the sixteenth year, Left Senior Cuo captured Zhi and Deng.",
  "s0572": "Wei Ran was dismissed. Prince Shi was enfeoffed at Wan, Prince Hui at Deng, and Wei Ran at Tao, as feudal lords.",
  "s0573": "In the seventeenth year, the Lord of Chengyang came to pay court, as did the Lord of Eastern Zhou.",
  "s0574": "Qin exchanged Yuan for Puban and Pishi.",
  "s0575": "The king went to Yiyang.",
  "s0576": "In the eighteenth year, Cuo attacked Yuan, Heyong, and took them by breaking the bridge.",
  "s0577": "In the nineteenth year, the king became Western Emperor and Qi became Eastern Emperor; both later renounced the titles.",
  "s0578": "Lü Li came to submit himself.",
  "s0579": "Qi destroyed Song; the king of Song was in Wei and died at Wen.",
  "s0580": "Ren Bi died.",
  "s0581": "In the twentieth year, the king went to Hanzhong, then to Shangjun and the Northern River.",
  "s0582": "In the twenty-first year, Cuo attacked Wei's Henei.",
  "s0583": "Wei ceded Anyi. Qin expelled its people, recruited settlers to move to Hedong and granted them ranks, and pardoned criminals who were relocated there.",
  "s0584": "Lord Jingyang was enfeoffed at Wan.",
  "s0585": "In the twenty-second year, Meng Wu attacked Qi.",
  "s0586": "Hedong was divided into nine counties.",
  "s0587": "He met with the king of Chu at Wan.",
  "s0588": "He met with the king of Zhao at Zhongyang.",
  "s0589": "In the twenty-third year, Commander Wei Sili, along with the Three Jin and Yan, attacked Qi and defeated them west of the Ji River.",
  "s0590": "The king met with the king of Wei at Yiyang, and with the king of Han at Xincheng.",
  "s0591": "In the twenty-fourth year, he met with the king of Chu at Yan, and again at Rang.",
  "s0592": "Qin captured Ancheng from Wei and reached Daliang. Yan and Zhao came to the rescue, and the Qin army withdrew.",
  "s0593": "Wei Ran was dismissed as prime minister.",
  "s0594": "In the twenty-fifth year, he captured two cities from Zhao.",
  "s0595": "He met with the king of Han at Xincheng, and with the king of Wei at Xinmingyi.",
  "s0596": "In the twenty-sixth year, pardoned criminals were relocated to Rang.",
  "s0597": "Marquis Wei Ran was again made prime minister.",
  "s0598": "In the twenty-seventh year, Cuo attacked Chu.",
  "s0599": "Pardoned criminals were relocated to Nanyang.",
  "s0600": "Bai Qi attacked Zhao and captured the city of Dai Guanglang.",
  "s0601": "He also sent Sima Cuo to set out from Longxi and, using Shu as a base, to attack Chu's Qianzhong, which he captured.",
  "s0602": "In the twenty-eighth year, Grand Chief Constructor Bai Qi attacked Chu and captured Yan and Deng; pardoned criminals were relocated there.",
  "s0603": "In the twenty-ninth year, Grand Chief Constructor Bai Qi attacked Chu and captured Ying, making it the Nan Commandery. The king of Chu fled.",
  "s0604": "The Lord of Zhou came.",
  "s0605": "The king met with the king of Chu at Xiangling.",
  "s0606": "Bai Qi was made Lord of Wu'an.",
  "s0607": "In the thirtieth year, the Shu governor Ruo attacked Chu, captured the Wu Commandery, and made the area south of the river the Qianzhong Commandery.",
  "s0608": "In the thirty-first year, Bai Qi attacked Wei and captured two cities.",
  "s0609": "The Chu people took back our territory south of the river.",
  "s0610": "In the thirty-second year, Prime Minister Marquis Rang attacked Wei, reaching Daliang, defeated Bao Yuan, beheaded forty thousand, and Bao Yuan fled. Wei ceded three counties to sue for peace.",
  "s0611": "In the thirty-third year, the guest minister Hu Yang attacked Wei's Juan, Caiyang, and Changshe, and captured them.",
  "s0612": "He struck Mang Mao at Huayang and defeated him, beheading one hundred fifty thousand.",
  "s0613": "Wei ceded Nanyang to make peace.",
  "s0614": "In the thirty-fourth year, Qin, Wei, and Han combined the Shangyong territory into one commandery, and freed servants from Nanyang were relocated there.",
  "s0615": "In the thirty-fifth year, he assisted Han, Wei, and Chu in attacking Yan.",
  "s0616": "The Nanyang Commandery was first established.",
  "s0617": "In the thirty-sixth year, the guest minister Zao attacked Qi and captured Gang and Shou, which were given to Marquis Rang.",
  "s0618": "In the thirty-eighth year, Middle Senior Hu Yang attacked Zhao's Eyu but could not capture it.",
  "s0619": "In the fortieth year, the Mourning Heir Apparent died in Wei; his body was returned and buried at Zhiyang.",
  "s0620": "In the summer of the forty-first year, he attacked Wei and captured Xingqiu and Huai.",
  "s0621": "In the forty-second year, Lord Anguo was made heir apparent.",
  "s0622": "In the tenth month, Queen Dowager Xuan died and was buried at Zhiyang on Mount Li.",
  "s0623": "In the ninth month, Marquis Rang departed for Tao.",
  "s0624": "In the forty-third year, Lord of Wu'an Bai Qi attacked Han, captured nine cities, and beheaded fifty thousand.",
  "s0625": "In the forty-fourth year, he attacked Han's Nanyang and captured it.",
  "s0626": "In the forty-fifth year, the Fifth-Rank Minister Ben attacked Han and captured ten cities.",
  "s0627": "Lord Yeyang Hui departed for his state but died before arriving.",
  "s0628": "In the forty-seventh year, Qin attacked Han's Shangdang. Shangdang surrendered to Zhao, so Qin then attacked Zhao. Zhao dispatched troops to strike Qin, and they faced off against each other.",
  "s0629": "Qin sent Lord of Wu'an Bai Qi to attack, and he utterly defeated Zhao at Changping, killing all of more than four hundred thousand.",
  "s0630": "In the tenth month of the forty-eighth year, Han offered Yuanyong.",
  "s0631": "The Qin army was divided into three forces.",
  "s0632": "Lord of Wu'an returned.",
  "s0633": "Wang He led an attack on Zhao's Pilao and captured it.",
  "s0634": "Sima Geng pacified Taiyuan in the north, and all of Han's Shangdang was annexed.",
  "s0635": "In the first month, the troops were dismissed and returned to defend Shangdang.",
  "s0636": "In the tenth month, Fifth-Rank Minister Ling attacked Zhao's Handan.",
  "s0637": "In the first month of the forty-ninth year, more troops were dispatched to assist Ling.",
  "s0638": "Ling fought poorly and was dismissed; Wang He took command.",
  "s0639": "In the tenth month, General Zhang Tang attacked Wei. Commander Cai Wei Juanfu did not defend, and upon returning, he was executed.",
  "s0640": "In the tenth month of the fiftieth year, Lord of Wu'an Bai Qi was found guilty, demoted to the rank of common soldier, and exiled to Yinmi.",
  "s0641": "Zhang Tang attacked Zheng and captured it.",
  "s0642": "In the twelfth month, more troops were dispatched to the army near Fencheng.",
  "s0643": "Lord of Wu'an Bai Qi was found guilty and executed.",
  "s0644": "Wang He attacked Handan but could not capture it; he withdrew and fled to join the army at Fen.",
  "s0645": "After two months of attacking the Jin army, he beheaded six thousand, and twenty thousand Jin and Chu soldiers drowned in the river.",
  "s0646": "He attacked Fencheng, then followed Tang to capture Ningxinzhong; Ningxinzhong was renamed Anyang.",
  "s0647": "The first river bridge was built.",
  "s0648": "In the fifty-first year, General Jiu attacked Han and captured Yangcheng and Fushu, beheading forty thousand.",
  "s0649": "He attacked Zhao and captured more than twenty counties, with ninety thousand killed or captured.",
  "s0650": "The Lord of Western Zhou turned against Qin and made an alliance with the feudal lords, intending to bring the best troops of all under heaven out of Yique to attack Qin, ordering that Qin should not be allowed to reach Yangcheng.",
  "s0651": "Thereupon Qin sent General Jiu to attack Western Zhou.",
  "s0652": "The Lord of Western Zhou came running to surrender, prostrating himself and confessing his crimes, offering all his thirty-six towns with thirty thousand inhabitants.",
  "s0653": "The King of Qin accepted the surrender and returned the lord to Zhou.",
  "s0654": "In the fifty-second year, the people of Zhou fled eastward, and the Nine Tripods entered Qin.",
  "s0655": "Zhou was first destroyed.",
  "s0656": "In the fifty-third year, all under heaven came to submit.",
  "s0657": "Wei was last; Qin sent Jiu to attack Wei and capture Wucheng.",
  "s0658": "The king of Han came to pay court; Wei entrusted its state and obeyed orders.",
  "s0659": "In the fifty-fourth year, the king made a suburban sacrifice to the Supreme Deity at Yong.",
  "s0660": "In the autumn of the fifty-sixth year, King Zhaoxiang died; his son King Xiaowen succeeded him.",
  "s0661": "He honored the Consort Tang Bazi as Queen Dowager Tang, and had her buried together with the former king.",
  "s0662": "The king of Han came in mourning clothes to offer condolences and sacrifices; all the feudal lords sent their generals and ministers to offer condolences and attend to the funeral.",
  "s0663": "In the first year of King Xiaowen, criminals were pardoned, the meritorious ministers of former kings were honored, relatives were treated generously, and the hunting parks were opened.",
  "s0664": "King Xiaowen ended his mourning period, was enthroned on the yihai day of the tenth month, and died three days later on the xinzhou day. His son King Zhuangxiang succeeded him.",
  "s0665": "In the first year of King Zhuangxiang, there was a great amnesty for criminals, meritorious ministers of former kings were honored, kindness was extended to relatives, and benevolence was spread to the people.",
  "s0666": "The Lord of Eastern Zhou conspired with the feudal lords against Qin. Qin sent Prime Minister Lü Buwei to execute him and annexed his entire state.",
  "s0667": "Qin did not end his sacrifices, but granted the Lord of Zhou the territory of Yangren to maintain his ancestral worship.",
  "s0668": "Meng Ao was sent to attack Han; Han ceded Chenggao and Gong.",
  "s0669": "Qin's border reached Daliang; the Sanchuan Commandery was first established.",
  "s0670": "In the second year, Meng Ao was sent to attack Zhao and pacified Taiyuan.",
  "s0671": "In the third year, Meng Ao attacked Wei's Gaodu and Ji and captured them.",
  "s0672": "He attacked Zhao's Yuci, Xincheng, and Langmeng, taking thirty-seven cities.",
  "s0673": "In the fourth month, there was a solar eclipse.",
  "s0674": "Wang He attacked Shangdang.",
  "s0675": "The Taiyuan Commandery was first established.",
  "s0676": "Wuji, general of Wei, led the troops of five states to attack Qin; Qin retreated beyond the river.",
  "s0677": "Meng Ao was defeated and withdrew.",
  "s0678": "On the bingwu day of the fifth month, King Zhuangxiang died; his son Zheng succeeded him. This was the First Emperor of Qin.",
  "s0679": "King Zheng of Qin ruled for twenty-six years, first unified all under heaven into thirty-six commanderies, and took the title First Emperor.",
  "s0680": "The First Emperor ruled for fifty-one years and died; his son Huhai succeeded him. This was the Second Emperor.",
  "s0681": "In the third year, the feudal lords all rose up in rebellion against Qin. Zhao Gao killed the Second Emperor and established Ziying.",
  "s0682": "Ziying had been established for just over a month when the feudal lords executed him, and Qin was thereupon destroyed.",
  "s0683": "This account is found in the Basic Annals of the First Emperor.",
  "s0684": "The Grand Historian says: The ancestors of Qin bore the surname Ying.",
  "s0685": "Their descendants were later enfeoffed and took their states as surnames, including the Xu clan, the Tan clan, the Ju clan, the Zhongli clan, the Yunyan clan, the Tuqiu clan, the Jiangliang clan, the Huang clan, the Jiang clan, the Xiuyu clan, the Baiming clan, the Feilian clan, and the Qin clan.",
  "s0686": "However, Qin took the surname Zhao because their ancestor Zaofu was enfeoffed with the city of Zhao."
}
