{
  "s0100": "Next year, attack Yong.",
  "s0101": "Next year, attack Chong Hou Hu.",
  "s0102": "Yet make Feng Yi, from Qi below yet move capital Feng.",
  "s0103": "Next year, Xi Bo die, crown prince Fa establish, this was Wu Wang.",
  "s0104": "Xi Bo cover establish fifty years.",
  "s0105": "His imprisoned You Li, cover increase easy eight trigrams to sixty four trigrams.",
  "s0106": "Poets speak Xi Bo, cover receive mandate year called wang yet decide Yu Rui dispute.",
  "s0107": "After ten years die, posthumous Wen Wang.",
  "s0108": "Change law measures, establish correct first month.",
  "s0109": "Pursue honor Gu Gong as Tai Wang, Gong Ji as Wang Ji: cover wang auspicious from Tai Wang rise.",
  "s0110": "Wu Wang establish, Tai Gong Wang as teacher, Zhou Gong Dan as assistant, Zhao Gong, Bi Gong followers left right wang, teachers repair Wen Wang continue work.",
  "s0111": "Nine years, Wu Wang upper sacrifice at Bi.",
  "s0112": "East observe troops, reach Meng Jin.",
  "s0114": "For Wen Wang wooden tablet, load with chariot, middle army.",
  "s0115": "Wu Wang self call crown prince Fa, speak follow Wen Wang to attack, not dare self exclusive.",
  "s0116": "Then inform Si Ma, Si Tu, Si Kong, various directors: 'Qi Li, believe!",
  "s0117": "I no knowledge, with previous ancestor have virtue minister, small son receive previous merit, complete establish reward punish, to fix merit.'",
  "s0118": "Then raise troops.",
  "s0119": "Teacher Shang Fu call: 'Total your many commoners, with your boat oars, after arrive chop.'",
  "s0120": "Wu Wang cross river, middle stream, white fish leap enter wang boat, Wu Wang bow take sacrifice.",
  "s0121": "Already cross, have fire from upper repeat at lower, reach Wang Wu, flow become crow, its color red, its sound crackle cloud.",
  "s0122": "Is time, feudal lords not period yet meet ally Meng Jin eight hundred feudal lords.",
  "s0123": "Feudal lords all said: 'Zhou can attack.'",
  "s0124": "Wu Wang said: 'You not know heaven mandate, not yet can.'",
  "s0125": "Then return troops return.",
  "s0126": "Dwell two years, hear Zhou muddle chaos violent tyrannical increasingly severe, kill Wang Zi Bi Gan, imprison Ji Zi.",
  "s0127": "Tai Shi Ci, Shao Shi Qiang embrace their music instruments flee Zhou.",
  "s0128": "Then Wu Wang extensively inform feudal lords: 'Yin have heavy crime, cannot not complete attack.'",
  "s0129": "Then follow Wen Wang, then lead war chariots three hundred ascend, tiger brave three thousand, armor soldiers forty five thousand, to east attack Zhou.",
  "s0130": "Eleven years twelve month Wu Wu, troops complete cross Meng Jin, feudal lords all meet.",
  "s0131": "Said: 'Ze Ze no neglect!'",
  "s0132": "Wu Wang then make Tai Shi, inform commoners: 'Now Yin wang Zhou use his woman speech, self cut from heaven, destroy bad his three correct, separate distant his wang parents younger brother, then cut abandon his previous ancestor music, then make licentious sound, use change disorder correct sound, pleasant delight women.",
  "s0133": "Therefore now I Fa only together execute heaven punishment.",
  "s0134": "Encourage! Not again, not three!'",
  "s0135": "Two month Jia Zi dim dawn, Wu Wang morning reach Shang suburbs Mu Ye, then oath.",
  "s0136": "Wu Wang left staff yellow battle-axe, right grasp white banner, with wave.",
  "s0137": "Said: 'Distant! West earth people!'",
  "s0138": "Wu Wang said: 'Jie!",
  "s0139": "I have state grave lord, Si Tu, Si Ma, Si Kong, Ya Lu, Shi Shi, thousand husband long, hundred husband long, and Yong, Shu, Qiang, Mao, Wei, Lu, Peng, Pu people, raise your spear, compare your shield, stand your spear, I will oath.'",
  "s0140": "Wang said: 'Ancient people have speech 'female chicken no dawn.",
  "s0141": "Female chicken dawn, only home desolate'.",
  "s0142": "Now Yin wang Zhou only women speech is use, self abandon his previous ancestor unrestrained sacrifice not reply, muddle abandon his family state, leave his wang parents younger brother not use, then only four directions many crime fugitive is honor is long, is trust is make, cause violent tyrannical at hundred surnames, with crooked track at Shang state.",
  "s0143": "Now I Fa only together execute heaven punishment.",
  "s0144": "Today matter, not over six step seven step, then stop Qi, master encourage!",
  "s0145": "Not over four strike five strike six strike seven strike, then stop Qi, encourage master!",
  "s0146": "Still strong strong, like tiger like Xiong, like wolf like Li, at Shang suburbs, not resist conquer flee, to serve west earth, encourage master!",
  "s0147": "You not encourage, its at your body have execution.'",
  "s0148": "Oath already, feudal lords troops meet chariots four thousand ascend, arrange troops Mu Ye.",
  "s0149": "Emperor Zhou hear Wu Wang come, also send troops seventy thousand resist Wu Wang.",
  "s0150": "Wu Wang make Shi Shang Fu with hundred husband lead troops, with big soldiers charge emperor Zhou troops."
}
