{
  "s0151": "Traveled in Liang, befriended former Wu man Zhuang Ji Fuzi, Huaiyin Mei Sheng and others.",
  "s0152": "Submitted writing was introduced between Yang Sheng, Gongsun Gui.",
  "s0153": "Sheng and others envied Zou Yang, slandered to Liang King Xiao.",
  "s0154": "King Xiao angered, sent to officials, wished to kill him.",
  "s0155": "Zou Yang guest traveled, because slander captured, feared death implicate, thus from prison submitted writing:",
  "s0156": "I have heard loyalty not unrewarded, trustworthiness not doubted. I constantly considered it true, merely empty words.",
  "s0157": "In former times Jing Ke admired Yan Dan's righteousness, white rainbow pierced sun, crown prince feared it.",
  "s0158": "Wei master for Qin planned Changping affair, Venus ate Pleiades, yet King Zhao doubted it.",
  "s0159": "Essence changes heaven earth yet trustworthiness not understood by two lords, how not sorrowful!",
  "s0160": "Now I exhaust loyalty exhaust sincerity, complete plans wish knowledge, attendants not clear, ultimately from official interrogation, doubted by world. This makes Jing Ke, Wei master rise again, yet Yan, Qin not awaken.",
  "s0161": "Wish Your Majesty carefully examine it.",
  "s0162": "In former times Bian He presented treasure, Chu king cut his feet.",
  "s0163": "Li Si exhausted loyalty, Hu Hai extreme punishment.",
  "s0164": "Therefore Ji Zi feigned madness, Jie Yu avoided world, fearing encounter this calamity.",
  "s0165": "Wish Your Majesty carefully examine Bian He, Li Si's intentions, then heed not Chu king, Hu Hai, not make me Ji Zi, Jie Yu's laughter.",
  "s0166": "I have heard Bi Gan split heart, Zi Xu owl stomach, I began not believe, now know it.",
  "s0167": "Wish Your Majesty carefully examine, slightly add pity.",
  "s0168": "Proverb says: 'Have white hair like new, meeting canopy like old.'",
  "s0169": "Why?",
  "s0170": "Know and not know.",
  "s0171": "Therefore in former times Fan Yuji escaped Qin to Yan, borrowed Jing Ke head to serve Dan's affair.",
  "s0172": "Wang She left Qi for Wei, faced city self-cut to repel Qi preserve Wei.",
  "s0173": "Wang She, Fan Yuji not new to Qi, Qin yet old to Yan, Wei. So left two states died two lords, conduct matched ambition admired righteousness without limit.",
  "s0174": "Therefore Su Qin not trusted by world, became Yan's tail life.",
  "s0175": "Bai Gui battled lost six cities, for Wei took Zhongshan.",
  "s0176": "Why?",
  "s0177": "Truly had mutual understanding.",
  "s0178": "Su Qin as Yan minister, Yan people slandered to king, king pressed sword angered, fed with dun horse.",
  "s0179": "Bai Gui eminent in Zhongshan, Zhongshan people slandered to Wei Marquis Wen, Marquis Wen threw night bright jade to him.",
  "s0180": "Why?",
  "s0181": "Two lords two ministers, split heart crack liver believe, how move by floating words!",
  "s0182": "Therefore woman no beauty ugliness, enter palace see jealousy.",
  "s0183": "Scholar no worthy unworthy, enter court see envy.",
  "s0184": "In former times Sima Xi crippled foot in Song, ultimately minister of Zhongshan.",
  "s0185": "Fan Sui broken ribs crooked teeth in Wei, ultimately became Lord Ying.",
  "s0186": "These two men, all believed inevitable strategy, abandoned faction private, held isolated position, thus could not avoid from envied persons.",
  "s0187": "Therefore Shen Tu Di self-drowned in river, Xu Yan carried stone entered sea.",
  "s0188": "Not tolerated by world, righteousness not casually take, clique in court, to move lord's heart.",
  "s0189": "Therefore Baili Xi begged food on road, Duke Mu entrusted with governance.",
  "s0190": "Ning Qi fed oxen under cart, Duke Huan entrusted with state.",
  "s0191": "These two men, how borrowed official in court, borrowed reputation from attendants, then two lords used them?",
  "s0192": "Moved in heart, matched in conduct, close as glue lacquer, brothers cannot separate, how confused by masses' mouths?",
  "s0193": "Therefore biased listening produces evil, sole reliance creates chaos.",
  "s0194": "In former times Lu listened to Ji Sun's words drove Confucius, Song believed Zi Han's plan imprisoned Mo Di.",
  "s0195": "With Kong, Mo's eloquence, could not avoid slanders, two states endangered.",
  "s0196": "Why?",
  "s0197": "Crowd mouths melt gold, accumulated slander destroys bone.",
  "s0198": "Therefore Qin used Rong man You Yu became hegemon China, Qi used Yue man Wu became strong Wei, Xuan.",
  "s0199": "These two states, how constrained by custom, dragged by age, tied to partial biased words?",
  "s0200": "Public hearing parallel observation, bequeath name current age.",
  "s0201": "Therefore intention matches then Hu Yue become brothers, You Yu, Yue Wu are this.",
  "s0202": "Not match, then flesh blood driven out not recovered, Zhu, Xiang, Guan, Cai are this.",
  "s0203": "Now ruler truly can use Qi, Qin righteousness, avoid Song, Lu listening, then five hegemons insufficient praise, three kings easy accomplish.",
  "s0204": "Therefore sage king awakens, abandons child love heart, can not pleased by Tian Chang worthiness.",
  "s0205": "Enfeoff Bi Gan descendants, repair pregnant woman tomb, therefore merit enterprise again established in world.",
  "s0206": "Why?",
  "s0207": "Desire goodness not sated.",
  "s0208": "Duke Wen of Jin personally his enemy, strongly hegemonized feudal lords.",
  "s0209": "Duke Huan of Qi used his enemy, unified world.",
  "s0210": "Why? Kind benevolence earnest, sincerity added to heart, cannot borrow empty words.",
  "s0211": "To Shang Yang's law used by Qin, east weakened Han, Wei, troops strong world, yet ultimately chariot tore him.",
  "s0212": "Yue used Grand Master Fan Li plan, captured strong Wu, hegemon China, yet ultimately executed his person.",
  "s0213": "Therefore Sun Shuo Ao three times left minister not regret, Yu Ling Zi Zhong declined three dukes to irrigate garden.",
  "s0214": "Now ruler truly can abandon arrogant heart, cherish repayable intention, bare heart bowels, show sincere feelings, drop liver gall, apply thick virtue, end with them in poverty wealth, no stingy with scholars, then Jie dog can make bark Yao, Zhi guest can make stab You.",
  "s0215": "How much more rely ten thousand chariot authority, borrow sage king resources?",
  "s0216": "Then Jing Ke's drown seven clans, Yao Li's burn wife children, how sufficient speak!",
  "s0217": "I have heard bright moon pearl, night light jade, with darkness throw to people on road, none not press sword glare.",
  "s0218": "Why?",
  "s0219": "No cause arrive front.",
  "s0220": "Coiled wood root base, twisted strange, become ten thousand chariot vessel.",
  "s0221": "Why?",
  "s0222": "With attendants first make appearance.",
  "s0223": "Therefore no cause arrive front, though produce Sui Hou pearl, night light jade, still tie resentment not see virtue.",
  "s0224": "Therefore someone first talks, then with withered wood rotten stump establish merit not forget.",
  "s0225": "Now world commoner poor dwelling scholar, body in poverty low, though possess Yao, Shun technique, grip Yi, Guan eloquence, cherish Long Feng, Bi Gan intention, wish exhaust loyalty serve current age lord, yet originally no root base appearance, though exhaust essence thought, wish open loyalty trustworthiness, assist person lord governance, then person lord must have press sword glare trace, this makes commoner cannot become withered wood rotten stump resource.",
  "s0226": "Therefore sage king establishes age controls custom, alone transforms on potter's wheel above, not dragged by lowly chaotic words, not seized by crowd many mouths.",
  "s0227": "Therefore Qin emperor employed central attendant Zi Meng Jia words, believed Jing Ke speech, dagger secretly sent.",
  "s0228": "Zhou Wen Wang hunted Jing, Wei, carried Lü Shang return, ruled world.",
  "s0229": "Therefore Qin believed attendants killed, Zhou used crow gather ruled.",
  "s0230": "Why?",
  "s0231": "With his ability surpass fettered words, gallop domain outside discussion, alone observe bright vast way.",
  "s0232": "Now person lord sinks in flatter slander words, dragged by curtain sash system, make unfettered scholars with ox steed same manger, this Bao Jiao so angered world not stay wealth nobility joy.",
  "s0233": "I have heard splendid attire enter court not with profit defile righteousness, sharpen name title not with desire harm conduct, therefore county named Sheng Mu yet Zeng Zi not enter, town named Chao Ge yet Mo Zi turned cart.",
  "s0234": "Now wish make world vast scholars, restrained by weighty authority power, mastered by position status nobility, therefore turn face defile conduct to serve flatter slander persons seek close to attendants, then scholars hide die in holes rocks marshes, how willing have exhaust loyalty trustworthiness hurry palace gate!",
  "s0235": "Writing submitted Liang King Xiao, King Xiao sent people release him, ultimately became upper guest.",
  "s0236": "The Grand Historian says: Lu Zhonglian his aim intention though not match great righteousness, yet I praise his commoner position, freely unrestrained ambition, not bent to feudal lords, spoke discussed current age, broke minister prime minister authority.",
  "s0237": "Zou Yang words though not modest, yet his compared things connected categories, have sufficient sorrowful, also can call upright unyielding. I therefore attach to liezhuan."
}

