{
  "s0001": "Emperor Xiaowu was the middle son of Emperor Jing.",
  "s0002": "His mother was Empress Wang.",
  "s0003": "In the fourth year of Emperor Jing's reign, as an imperial son he was enfeoffed as King of Jiaodong.",
  "s0004": "In the seventh year of Emperor Jing's reign, the crown prince Li was deposed and became King of Linjiang, and the King of Jiaodong was established as crown prince.",
  "s0005": "In the sixteenth year of Emperor Jing's reign he passed away, and the crown prince ascended the throne as Emperor Xiaowu.",
  "s0006": "When Emperor Xiaowu first ascended the throne, he was especially reverent toward sacrifices to ghosts and spirits.",
  "s0007": "In the first year, the Han dynasty had already been established for over sixty years, and all under heaven was peaceful and secure. The scholars and officials all hoped the Son of Heaven would perform the feng and shan sacrifices and reform the calendar and regulations.",
  "s0008": "The emperor favored Confucian learning and summoned worthy scholars. Zhao Wan, Wang Zang and others became high ministers through their literary learning, wishing to discuss the ancient ways and establish a Mingtang south of the capital to receive the feudal lords.",
  "s0009": "The plans for imperial tours, feng and shan sacrifices, calendar reform, and color regulations were not yet completed.",
  "s0010": "At this time Empress Dowager Dou practiced Huang-Lao teachings and disliked Confucian learning. She sent people to secretly discover Zhao Wan and others' illicit dealings, summoned and interrogated Wan and Zang. Wan and Zang committed suicide, and all the institutions they had established were abolished.",
  "s0011": "Six years later, Empress Dowager Dou passed away.",
  "s0012": "The next year, the emperor summoned literary scholars such as Gongsun Hong.",
  "s0013": "The next year, the emperor first went to Yong and performed suburban sacrifices to the five altars.",
  "s0014": "Afterward he regularly performed suburban sacrifices every three years.",
  "s0015": "At this time the emperor sought divine spirits and housed them in the Ti Shi pavilion in Shanglin Park.",
  "s0016": "The divine spirits were a woman from Changling who, grieving over her child's death, appeared as a spirit to her mother-in-law Wanruo.",
  "s0017": "Wanruo sacrificed to her in her chamber, and many people went to sacrifice there.",
  "s0018": "Lord Pingyuan went to sacrifice there, and afterward his descendants became honored and eminent.",
  "s0019": "When Emperor Wu ascended the throne, he treated her with great courtesy and housed her shrine within the palace. People heard her words but did not see her person.",
  "s0020": "At this time Li Shaojun also appeared before the emperor with methods of sacrificing to the stove god, grain immortals, and anti-aging techniques, and the emperor honored him.",
  "s0021": "Shaojun was originally the son of a former Marquis of Shenze who served as master of techniques.",
  "s0022": "He concealed his age and place of birth, always claiming to be seventy, able to summon spirits and prevent aging.",
  "s0023": "He traveled among the feudal lords with his techniques.",
  "s0024": "He had no wife or children.",
  "s0025": "People heard he could summon spirits and achieve immortality, so they sent him gifts, always leaving abundant gold, money, silk, clothes, and food.",
  "s0026": "Everyone thought he did not manage property yet was wealthy, and not knowing where he came from, they trusted him even more and competed to serve him.",
  "s0027": "Shaojun was skilled in techniques and good at making clever predictions that hit the mark.",
  "s0028": "Once he drank with the Marquis of Wu'an, and seated there was an old man over ninety. Shaojun spoke of places where he had hunted with the old man's grandfather. The old man had followed his grandfather as a child and recognized the places. Everyone seated was astonished.",
  "s0029": "Shaojun saw the emperor, who had an ancient bronze vessel, and the emperor asked Shaojun about it.",
  "s0030": "Shaojun said: 'This vessel Duke Huan of Qi placed in the Bo chamber in his tenth year.'",
  "s0031": "Then they checked the inscriptions, and indeed it was Duke Huan of Qi's vessel.",
  "s0032": "The entire palace was astonished, considering Shaojun a divine being, a man of several hundred years.",
  "s0033": "Shaojun said to the emperor: 'Sacrificing to the stove god summons spirits. Summoning spirits allows cinnabar and vermilion to be transformed into gold. Gold can be made into eating vessels which prolong life. Prolonging life allows the Penglai immortals in the sea to be seen. Seeing them and performing feng and shan sacrifices leads to immortality—the Yellow Emperor was like this.",
  "s0034": "I once traveled on the sea and saw An Qisheng, who fed me dates as large as melons.",
  "s0035": "An Qisheng is an immortal who communicates with Penglai. When harmonious he appears to people, when not harmonious he hides.'",
  "s0036": "Thereupon the emperor began personally sacrificing to the stove god, and sent fangshi to sea to seek An Qisheng and others from Penglai, and began the work of transforming cinnabar and various drugs into gold.",
  "s0037": "After some time, Li Shaojun fell ill and died.",
  "s0038": "The emperor thought he had transformed and become immortal, and had Huang Hammer Official Kuan Shu receive his methods.",
  "s0039": "Seeking Penglai and An Qisheng brought no results, but the fangshi of Yan and Qi along the sea who made strange and circuitous claims imitated each other, speaking even more of divine matters.",
  "s0040": "A man from Bo, Bo Youji, presented a memorial on sacrificing to Taiyi, saying: 'The most honored heavenly spirit is Taiyi, and Taiyi's assistants are the Five Emperors.",
  "s0041": "In ancient times the Son of Heaven sacrificed to Taiyi in the southeastern suburbs in spring and autumn, using the full sacrificial animals, for seven days, making an altar with eight pathways for the ghosts.'",
  "s0042": "Thereupon the emperor ordered the Grand Invocator to establish the shrine in the southeastern suburbs of Chang'an, and regularly perform sacrifices according to Youji's methods.",
  "s0043": "Afterward someone presented a memorial saying: 'In ancient times the Son of Heaven used full sacrificial animals every three years to sacrifice to the Three Ones: Heaven One, Earth One, Taiyi.'",
  "s0044": "The emperor approved it and ordered the Grand Invocator to lead the sacrifices at Youji's Taiyi altar according to the methods.",
  "s0045": "Later someone else presented a memorial saying: 'In ancient times the Son of Heaven regularly performed jie sacrifices in spring and autumn, sacrificing to the Yellow Emperor using one screech owl and a broken mirror;",
  "s0046": "Ming Yang used sheep;",
  "s0047": "Si Ma used one blue stallion;",
  "s0048": "Taiyi, Gao Mountain Mountain Lord, Earth Elder used oxen;",
  "s0049": "Wuyi Jun used dried fish;",
  "s0050": "Yin Yang messengers used one ox.'",
  "s0051": "Ordered sacrifice officials to lead according to the methods, sacrificing at Youji's Taiyi altar side.",
  "s0052": "The next year, the emperor's gardens had a white deer, used its skin as currency to respond to auspicious omens, made white gold.",
  "s0053": "The next year, performing suburban sacrifices at Yong, obtained a one-horned beast, like a muntjac.",
  "s0054": "The officials said: 'Your Majesty has solemnly performed suburban sacrifices, and the August Emperor has bestowed reward, giving a one-horned beast, probably a unicorn.'",
  "s0055": "Thereupon offered it to the five altars, each altar adding one ox for burnt offering.",
  "s0056": "Granted the feudal lords white gold, to make the talismans harmonize with heaven and earth.",
  "s0057": "Then the King of Jibei thought the emperor was about to perform feng and shan, so he presented a memorial offering Mount Tai and its neighboring towns.",
  "s0058": "The emperor accepted it, and compensated with other counties.",
  "s0059": "The King of Changshan committed a crime and was demoted. The emperor enfeoffed his younger brother in Zhending to continue the ancestral sacrifices, and made Changshan a commandery.",
  "s0060": "Then all five sacred mountains were within the emperor's commandery.",
  "s0061": "The next year, the Qi man Shao Weng appeared before the emperor with ghost and spirit techniques.",
  "s0062": "The emperor had favored Lady Wang, who passed away. Shao Weng used techniques to make Lady Wang and the stove god appear at night, and the emperor saw them from behind the curtains.",
  "s0063": "Thereupon he appointed Shao Weng as Literary General, with many rewards, treating him with guest rites.",
  "s0064": "The Literary General said: 'If Your Majesty wishes to communicate with the spirits, the palace chambers and clothing should resemble the spirits, then spirit objects will arrive.'",
  "s0065": "Then made cloud chariots and feathered carriages, and each chose auspicious days to drive carriages to avoid evil ghosts.",
  "s0066": "Also built Ganquan Palace, making it a platform chamber in the center, painting the heavens, earth, and Taiyi and various spirits, placing sacrificial utensils to summon heavenly spirits.",
  "s0067": "After more than a year, his techniques increasingly declined, spirits did not arrive.",
  "s0068": "Then wrote on silk and fed it to an ox, pretending not to know, saying this ox's belly contained something strange.",
  "s0069": "Killed and examined it, obtained the writing, which spoke of marvels. The emperor was suspicious.",
  "s0070": "Someone recognized the handwriting, questioned the person, and indeed it was forged writing.",
  "s0071": "Thereupon executed the Literary General while concealing it.",
  "s0072": "Afterward then built the Cypress Beam Hall, copper pillars, dew-catching immortals and such.",
  "s0073": "The year after the Literary General died, the emperor fell gravely ill at Dinghu, and no witch doctors were not summoned, but he did not recover.",
  "s0074": "You Shui Fa Gen said: 'In Shang Commandery there is a witch who, when ill, ghosts descend to her.'",
  "s0075": "The emperor summoned and housed her shrine in Ganquan.",
  "s0076": "When he fell ill, sent people to ask the divine spirits.",
  "s0077": "The divine spirits said: 'The emperor should not worry about illness.",
  "s0078": "When the illness improves slightly, force yourself to meet me in Ganquan.'",
  "s0079": "Thereupon the illness improved, and he went to Ganquan, and the illness was completely cured.",
  "s0080": "Granted great amnesty to all under heaven, established the Longevity Palace for the divine spirits.",
  "s0081": "The most honored divine spirit was Taiyi, its assistants called Great Prohibition, Siming and such, all following it.",
  "s0082": "Could not be seen, but heard its voice, speaking like a person.",
  "s0083": "Sometimes left, sometimes came; when coming, the wind was solemn.",
  "s0084": "Resided in chambers and tents.",
  "s0085": "Sometimes spoke in daytime, but usually at night.",
  "s0086": "The emperor performed purification, then entered.",
  "s0087": "The witch acted as host, managing food and drink.",
  "s0088": "What was desired was spoken and carried out.",
  "s0089": "Also established the Longevity Palace and North Palace, set up feathered banners, arranged sacrificial utensils, to honor the divine spirits.",
  "s0090": "What the divine spirits said, the emperor had people receive and record their words, calling them 'painting methods'.",
  "s0091": "What they spoke of was what the common world knew, nothing extraordinarily different, but the emperor alone was pleased.",
  "s0092": "The matters were secret, the world did not know them.",
  "s0093": "Three years later, the officials said the yuan should be named according to heavenly auspicious signs, not by one-two numbering.",
  "s0094": "One yuan called 'Establishing Yuan', second yuan with long star called 'Yuan Guang', third yuan with suburban one-horned beast called 'Yuan Shou'.",
  "s0095": "The next year in winter, the emperor performed suburban sacrifices at Yong, and discussed: 'Now I personally perform suburban sacrifices to the August Emperor, but Houtu has no sacrifices, then the rites are not reciprocal.'",
  "s0096": "The officials and Grand Historian, sacrifice official Kuan Shu and others discussed: 'Heaven and earth use coiled-horned livestock.",
  "s0097": "Now Your Majesty personally sacrifices to Houtu, Houtu should have round altars in marshes, five altars, each altar with yellow calf and full sacrificial animals. After sacrificing, bury everything, and the sacrificial clothing above is yellow.'",
  "s0098": "Thereupon the emperor went east, first establishing the Houtu shrine on the mound at Fenyin, according to Kuan Shu and others' discussion.",
  "s0099": "The emperor personally looked and bowed, like the August Emperor rites.",
  "s0100": "After the rites finished, the emperor went to Xingyang and returned.",
  "s0101": "Passing through Luoyang, he issued an edict saying: \"The Three Dynasties are distant, far off and hard to preserve.",
  "s0102": "Enfeoff the Zhou descendants with thirty li of land as Zhou Zi Nan Jun, to maintain the ancestral sacrifices.\"",
  "s0103": "This year, the emperor first toured the commanderies and counties, approaching Mount Tai.",
  "s0104": "That spring, Marquis Yuecheng presented a memorial introducing Luan Da.",
  "s0105": "Luan Da was a palace attendant from Jiaodong, who had once studied under the Literary General, and afterward served as Jiaodong King Liu Pi's master of techniques.",
  "s0106": "Marquis Yuecheng's elder sister was Queen to King Kang, but had no sons.",
  "s0107": "King Kang died, and another consort's son ascended as king.",
  "s0108": "Queen Kang had licentious behavior and did not get along with the king, they harmed each other according to law.",
  "s0109": "Queen Kang heard the Literary General had died, and wished to curry favor with the emperor, so she sent Luan Da through Marquis Yuecheng to seek an audience and speak of techniques.",
  "s0110": "The emperor had already executed the Literary General, but afterward regretted his early death, lamented that his techniques were not exhausted. When he saw Luan Da, he was greatly pleased.",
  "s0111": "Luan Da was tall and handsome, spoke of many strategies, and dared make grand claims, carrying them out without doubt.",
  "s0112": "Luan Da said: \"I have often traveled in the sea, seen An Qi, Xianmen and such.",
  "s0113": "They considered me lowly, did not trust me.",
  "s0114": "Also thought King Kang was just a feudal lord, not worth giving techniques.",
  "s0115": "I spoke many times to King Kang, but King Kang did not employ me.",
  "s0116": "My teacher said: 'Gold can be made, Yellow River breaches can be stopped, immortal medicine can be obtained, immortals can be summoned.'",
  "s0117": "I fear following the Literary General's example, then all fangshi will cover their mouths, who would dare speak of techniques!\"",
  "s0118": "The emperor said: \"The Literary General only died from eating horse liver.",
  "s0119": "If you can truly perfect his techniques, what would I begrudge!\"",
  "s0120": "Luan Da said: \"My teacher does not seek people, people seek him.",
  "s0121": "If Your Majesty must summon him, then honor his messengers, give them relatives, treat them with guest rites, do not demean them, make each wear their trust seal, then they can communicate with divine immortals.",
  "s0122": "Whether divine immortals are willing or not.",
  "s0123": "Honor their messengers, then they can be summoned.\"",
  "s0124": "Thereupon the emperor had him first test small techniques—fighting banners, the banners struck each other by themselves.",
  "s0125": "At this time the emperor was worried about Yellow River breaches, and gold was not yet made, so he appointed Luan Da as Five Profits General.",
  "s0126": "After more than a month, he obtained four gold seals: Heaven Knight General, Earth Warrior General, Great Passage General, Heaven Dao General seals.",
  "s0127": "Imperial edict to the Imperial Secretary: \"Formerly Yu dredged the nine rivers, opened the four waterways.",
  "s0128": "Recently the Yellow River overflowed the lands, dike work never ceased.",
  "s0129": "I have ruled the world for twenty-eight years, heaven seems to grant me a knight and great passage.",
  "s0130": "Qian says 'flying dragon,' 'great goose on the shore,' perhaps almost there.",
  "s0131": "Enfeoff the Earth Warrior General Luan Da with two thousand households as Marquis of Le Tong.\"",
  "s0132": "Granted him a marquis' mansion, a thousand servants.",
  "s0133": "Imperial carriages, horses, tents, curtains, utensils filled his house.",
  "s0134": "Also married him to Princess Wei Chang, gave ten thousand jin of gold, renamed her fief Dang Li Princess.",
  "s0135": "The emperor personally visited the Five Profits General's mansion.",
  "s0136": "Messengers inquired and supplied what was needed, connected along the road.",
  "s0137": "From the chief ministers down, all held banquets in his home, presented gifts.",
  "s0138": "Thereupon the emperor also carved a jade seal saying \"Heaven Dao General,\" had messengers wear feathered robes, stand on white thatch at night, the Five Profits General also wore feathered robes, stood on white thatch to receive the seal, to show he was not a subject.",
  "s0139": "Those wearing \"Heaven Dao\" would guide heavenly spirits for the emperor.",
  "s0140": "Thereupon the Five Profits General often sacrificed at night in his home, wishing to summon spirits.",
  "s0141": "Spirits had not come but hundreds of ghosts gathered, yet he could somewhat command them.",
  "s0142": "Afterward he prepared equipment and went east to sea, seeking his teacher.",
  "s0143": "Luan Da was seen for several months, wearing six seals, honored and shook the world, and in the Yan and Qi regions along the sea, all choked their breath and claimed they had secret techniques, could divine immortals.",
  "s0144": "That summer in the sixth month, Fenyin witch Jin was sacrificing for the people beside the Weizhi Houtu camp, saw earth like a hook shape, dug and examined, obtained a ding.",
  "s0145": "The ding was greatly different from common ding, with engraved patterns but no inscriptions, considered strange, reported to officials.",
  "s0146": "Officials told Hedong Governor Sheng, Sheng reported it.",
  "s0147": "The emperor sent messengers to verify that witch Jin obtained the ding without fraud, then sacrificed to it with rites, welcomed the ding to Ganquan, accompanied the procession, the emperor offered it.",
  "s0148": "Arriving at Zhongshan, dusk warmth, yellow clouds covered it.",
  "s0149": "A muntjac passed, the emperor personally shot it, used it to sacrifice to the clouds.",
  "s0150": "Arriving at Chang'an, the dukes and ministers all discussed requesting to honor the precious ding.",
  "s0151": "The emperor said: \"Recently the Yellow River overflowed, years have not been bountiful, therefore I toured and sacrificed to Houtu, prayed for the people to grow grain.",
  "s0152": "This year's harvest has not yet been reported, why has the ding appeared?\"",
  "s0153": "The officials all said: \"Heard that formerly the Great Emperor raised a divine ding, one means unification, the end to which heaven, earth, and the ten thousand things are bound.",
  "s0154": "The Yellow Emperor made three treasure ding, representing heaven, earth, and man.",
  "s0155": "Yu collected the metals of the nine provinces, cast nine ding, all used to cook and offer to the August Emperor and ghosts and spirits.",
  "s0156": "When sages appeared they rose, moved to Xia and Shang.",
  "s0157": "When Zhou virtue declined, the Song she altar perished, the ding sank and hid unseen.",
  "s0158": "The ode says 'from hall to base, from sheep to ox;",
  "s0159": "Cauldrons and tripods, not expected not feared, what good fortune of the aged.'",
  "s0160": "Now the ding arrives at Ganquan, luminous and moist, dragon-like transformations, receiving blessing without limit.",
  "s0161": "Meeting at Zhongshan, yellow white clouds descend covering, like beasts as talismans, road bows and riding arrows, gathered and obtained below the altar, responding to sacrifice and great feast.",
  "s0162": "Only those who receive the mandate and become emperor know its meaning and harmonize with virtue.",
  "s0163": "The ding should appear at the ancestral temples, be stored in the imperial court, to harmonize with bright responses.\"",
  "s0164": "Imperial edict said: \"Acceptable.\"",
  "s0165": "Those who entered the sea seeking Penglai said Penglai was not far, but those who could not reach it probably did not see its vapors.",
  "s0166": "The emperor then sent vapor observers to await its vapor clouds.",
  "s0167": "That autumn, the emperor went to Yong, about to perform suburban sacrifices.",
  "s0168": "Some said \"The Five Emperors are Taiyi's assistants.",
  "s0169": "Should establish Taiyi and the emperor personally perform suburban sacrifices to him.\"",
  "s0170": "The emperor was doubtful and undecided.",
  "s0171": "The Qi man Gongsun Qing said: \"This year obtained the treasure ding, and this winter on xin si first day winter solstice, equals the Yellow Emperor's time.\"",
  "s0172": "Qing had bamboo slips saying: \"The Yellow Emperor obtained the treasure ding at Wan Hou, consulted Guiyu Qu.",
  "s0173": "Qu replied: 'The emperor obtained the treasure ding divine planchette, this year ji you first day winter solstice, obtained heaven's cycle, end and begin again.'",
  "s0174": "Thereupon the Yellow Emperor welcomed the sun and pushed the planchette, after twenty years obtained first day winter solstice, altogether twenty pushes, three hundred eighty years.",
  "s0175": "The Yellow Emperor became immortal and ascended to heaven.\"",
  "s0176": "Qing wanted to present it through Shou Zhong.",
  "s0177": "Shou Zhong saw the book was not orthodox, suspected it was false writing, declined saying: \"The treasure ding matter is already decided, what more is there to do!\"",
  "s0178": "Qing then presented it through a favored person.",
  "s0179": "The emperor was greatly pleased, summoned and questioned Qing.",
  "s0180": "He replied: \"I received this book from Shen Gong, Shen Gong has died.\"",
  "s0181": "The emperor said: \"Who is Shen Gong?\"",
  "s0182": "Qing said: \"Shen Gong is a Qi man.",
  "s0183": "Communicated with An Qisheng, received the Yellow Emperor's words, had no book, only this ding book.",
  "s0184": "Said 'When Han rises again it will be like the Yellow Emperor's time.",
  "s0185": "The Han sage will be among the great-grandsons of Gaozu.",
  "s0186": "The treasure ding appears and communicates with spirits, performs feng and shan.",
  "s0187": "Feng and shan seventy-two kings, only the Yellow Emperor could ascend Mount Tai for feng.'",
  "s0188": "Shen Gong said: 'The Han ruler should also ascend for feng, ascending feng then can become immortal and ascend to heaven.",
  "s0189": "In the Yellow Emperor's time ten thousand feudal lords, and divine spirits' feng were seven thousand.",
  "s0190": "World famous mountains eight, three in barbarian Yi, five in China.",
  "s0191": "China's Huashan, Shoushan, Taishi, Taishan, Donglai, these five mountains the Yellow Emperor often toured, met with spirits.",
  "s0192": "The Yellow Emperor fought while learning immortality.",
  "s0193": "Worried the people did not follow his way, so he executed those who were not ghosts and spirits.",
  "s0194": "After more than one hundred years then could communicate with spirits.",
  "s0195": "The Yellow Emperor performed suburban sacrifices at Yong to the August Emperor, stayed three months.",
  "s0196": "Guiyu Qu was called Great Hong, died and was buried at Yong, hence Hong Tomb.",
  "s0197": "Afterward the Yellow Emperor received ten thousand spirits at Ming Court.",
  "s0198": "Ming Court is Ganquan.",
  "s0199": "The so-called Cold Gate is Gu Kou.",
  "s0200": "The Yellow Emperor mined Shoushan copper, cast ding below Jing Mountain.",
  "s0201": "When the ding was completed, a dragon hung its whiskers down to welcome the Yellow Emperor.",
  "s0202": "The Yellow Emperor mounted it, group of ministers and rear palace followed on the dragon, seventy plus people, then ascended.",
  "s0203": "The remaining small ministers could not ascend, all held the dragon whiskers, the dragon whiskers pulled out, dropped the Yellow Emperor's bow.",
  "s0204": "The people looked up and saw the Yellow Emperor had ascended to heaven, embraced his bow and dragon whiskers wailing.",
  "s0205": "Therefore later generations named the place Ding Lake, his bow Wu Hao.'\"",
  "s0206": "Thereupon the emperor said: \"Alas!",
  "s0207": "If I could truly be like the Yellow Emperor, I would view leaving wife and children like removing shoes.\"",
  "s0208": "Then he appointed Qing as gentleman, sent east to await spirits at Taishi.",
  "s0209": "The emperor then performed suburban sacrifices at Yong, went to Longxi, west ascended Kongtong, went to Ganquan.",
  "s0210": "Ordered sacrifice official Kuan Shu and others to prepare the Taiyi sacrifice altar, the altar modeled on Bo Ji's Taiyi altar, altar with three terraces.",
  "s0211": "Five Emperors altars ringed below it, each in their direction, Yellow Emperor southwest, removed eight pathways for ghosts.",
  "s0212": "Taiyi's uses were like Yong's one altar objects, but added sweet wine, dates, dried meat and such, killed one yak for the stands, dishes, sacrificial animals.",
  "s0213": "The Five Emperors alone had stands, dishes, sweet wine presented.",
  "s0214": "Below to the four directions ground, for feeding the following multitude of spirits and Beidou.",
  "s0215": "After sacrificing, all remaining sacrificial meat was burned.",
  "s0216": "Its ox color white, deer in its midst, pig in the deer midst, water and cook it.",
  "s0217": "Sacrifice to sun with ox, sacrifice to moon with sheep pig specially.",
  "s0218": "Taiyi's invocator and butcher then wore purple and embroidery.",
  "s0219": "Five Emperors each like their color, sun red, moon white.",
  "s0220": "Eleventh month xin si first day winter solstice, dawn, the emperor began suburban worship of Taiyi.",
  "s0221": "Morning worshiped the sun, evening worshiped the moon, then saluted;",
  "s0222": "Seeing Taiyi like Yong rites.",
  "s0223": "Their assisting feast said: \"Heaven begins granting the treasure ding divine planchette to the emperor, new moon after new moon, end and begin again, the emperor respectfully worships and sees it.\"",
  "s0224": "And wore yellow above.",
  "s0225": "Their sacrifice had fires filling the altar, cooking utensils beside the altar.",
  "s0226": "The officials said \"There is light above the sacrifice.\"",
  "s0227": "The dukes and ministers said \"The emperor begins suburban seeing Taiyi at Yunyang, officials present xuanyu jade fine livestock recommend feast.",
  "s0228": "That night there was beautiful light, and by day, yellow qi ascended connecting to heaven.\"",
  "s0229": "The Grand Historian, sacrifice official Kuan Shu and others said: \"Divine spirits' blessing, protecting fortune auspicious omens, should therefore establish Tai altars in this bright domain to clarify responses.",
  "s0230": "Order the Grand Invocator to lead, sacrifice in autumn and la interval.",
  "s0231": "Every three years the emperor suburban sees once.\"",
  "s0232": "That autumn, for attacking Nanyue, informed and prayed to Taiyi, used male nanmu painted banners sun moon Beidou ascending dragon, to represent Tianyi three stars, for Taiyi spearhead, named \"Spirit Banner.\"",
  "s0233": "For praying over troops, then the Grand Historian held it pointing at the country to attack.",
  "s0234": "The Five Profits General did not dare enter sea, went to Taishan to sacrifice.",
  "s0235": "The emperor sent people to secretly follow and verify, truly saw nothing.",
  "s0236": "The Five Profits falsely claimed to see his teacher, his techniques exhausted, many did not verify.",
  "s0237": "The emperor then executed the Five Profits.",
  "s0238": "That winter, Gongsun Qing awaited spirits south of the Yellow River, saw immortal tracks on Gou Shi city walls, something like a pheasant, coming and going on the city walls.",
  "s0239": "The emperor personally went to Gou Shi city to view the tracks.",
  "s0240": "Asked Qing: \"Not imitating the Literary General and Five Profits?\"",
  "s0241": "Qing said: \"Immortals do not seek rulers, rulers seek them.",
  "s0242": "Their way is not slightly lenient and false, spirits do not come.",
  "s0243": "Speaking of spirit matters, matters seem circuitous and far-fetched, accumulate over years then can achieve.\"",
  "s0244": "Thereupon commanderies and kingdoms all cleared roads, repaired and maintained palace observatories famous mountains spirit shrines places, to await the fortunate visit.",
  "s0245": "That year, having already extinguished Nanyue, the emperor had favored minister Li Yannian appear through good music.",
  "s0246": "The emperor favored him, consulted the dukes and ministers, said: \"Among the people sacrifices still have drum dance music, now suburban sacrifices have no music, is that appropriate?\"",
  "s0247": "The dukes and ministers said: \"Anciently sacrificing to heaven and earth all had music, and ghosts and spirits could be obtained and honored.\"",
  "s0248": "Some said: \"The Tai Emperor had Su Nu beat the fifty string zither, sad, the emperor forbade but could not stop, therefore broke her zither into twenty-five strings.\"",
  "s0249": "Thereupon extinguished Nanyue, prayed and sacrificed to Taiyi, Houtu, began using music and dance, increased summoning song children, made twenty-five string and konghou zither from this arose.",
  "s0250": "The next year winter, the emperor discussed: \"Anciently first mobilized troops and encouraged the masses, then performed feng and shan.\"",
  "s0251": "Thereupon went north touring Shuofang, mustered over ten thousand troops, returned and sacrificed at the Yellow Emperor's tomb at Qiao Mountain, encouraged the troops at Xu.",
  "s0252": "The emperor said: \"I heard the Yellow Emperor did not die, now there is a tomb, why?\"",
  "s0253": "Some replied: \"The Yellow Emperor became immortal and ascended to heaven, the ministers buried his clothes and hat.\"",
  "s0254": "Then arrived at Ganquan, about to perform the Taishan affairs, first preparatory sacrifice to Taiyi.",
  "s0255": "Since obtaining the treasure ding, the emperor discussed feng and shan with the dukes, ministers, and scholars.",
  "s0256": "Feng and shan used rare and distant things, no one knew the ceremonies, and the Confucian scholars collected from feng shan Shangshu, Zhou officials, Wang system's wang sacrifices shooting ox affairs.",
  "s0257": "The Qi man Ding Gong over ninety said: \"Feng means uniting the name of immortality.",
  "s0258": "The Qin emperor could not ascend feng.",
  "s0259": "If Your Majesty must ascend, gradually ascend and if there is no wind rain, then ascend feng.\"",
  "s0260": "The emperor thereupon ordered the Confucian scholars to practice shooting oxen, drafted feng shan ceremonies.",
  "s0261": "Several years, until about to go.",
  "s0262": "The emperor having heard Gongsun Qing and the fangshi's words, that the Yellow Emperor and above performed feng shan, all brought forth monsters and communicated with spirits, wished to imitate the Yellow Emperor to receive immortal Penglai scholars, high world compare virtue to nine emperors, and rather collected Confucian learning to embellish it.",
  "s0263": "The Confucian scholars having been unable to clearly explain feng shan matters, moreover were constrained by poetry books ancient texts and dared not gallop freely.",
  "s0264": "The emperor made feng sacrifice utensils to show the Confucian scholars, the Confucian scholars some said \"not the same as ancient\", Xu Yan moreover said \"the Grand Herald's scholars perform rites not as good as Lu\", Zhou Ba attributed the feng map, thereupon the emperor demoted Yan, Ba, completely dismissed the Confucian scholars not using them.",
  "s0265": "Third month, then east went to Gou Shi, rites ascended Zhongyue Taishi.",
  "s0266": "Following officials on the mountain below heard as if someone saying \"ten thousand years\".",
  "s0267": "Asked the emperor, the emperor did not speak;",
  "s0268": "Asked below, below did not speak.",
  "s0269": "Thereupon enfeoffed with three hundred households to serve Taishi sacrifices, named Chonggao town.",
  "s0270": "East ascended Taishan, the mountain's grass trees leaves not yet born, then had people ascend rocks and stand them on Taishan peak.",
  "s0271": "The emperor then east toured the seacoast, performed rites sacrificing to eight spirits.",
  "s0272": "Qi people presenting memorials speaking of divine monsters wondrous techniques numbered in the tens of thousands, but none verified.",
  "s0273": "Then increased sending ships, ordered those speaking of sea divine mountains several thousand people seek Penglai divine immortals.",
  "s0274": "Gongsun Qing holding tally constantly went first awaiting famous mountains, arrived at Donglai, said at night saw one person, height several zhang, approached then not seen, saw his tracks very large, like bird beast.",
  "s0275": "Ministers had those who said saw one old father leading dog, saying \"I wish to see the great duke\", suddenly not seen.",
  "s0276": "The emperor having seen large tracks, did not believe, when ministers spoke of old father, then greatly considered him immortal.",
  "s0277": "Lodged on the seacoast, with fangshi transmitted carriages and idle envoys seeking immortals numbering in thousands.",
  "s0278": "Fourth month, returned to Fenggao.",
  "s0279": "The emperor pondered the Confucian scholars and fangshi spoke of feng shan each person different, not orthodox, difficult to carry out.",
  "s0280": "The emperor arrived at Liangfu, rites sacrificed to earth lord.",
  "s0281": "Yi mao day, ordered attending Confucian scholars in black caps with belts, shooting ox performed affairs.",
  "s0282": "Feng on Taishan below east, like suburban sacrificing Taiyi rites.",
  "s0283": "Feng broad one zhang two chi, high nine chi, below then had jade tablets book, book secret.",
  "s0284": "Rites completed, the emperor alone with attending carriage Zi Hou ascended Taishan, also had feng.",
  "s0285": "Its matters all forbidden.",
  "s0286": "Next day, descended yin path.",
  "s0287": "Bing chen, shan on Taishan below northeast Suran Mountain, like sacrificing Houtu rites.",
  "s0288": "The emperor all personally bowed and saw, wore yellow above and completely used music.",
  "s0289": "Jiang Huai interval one mao three ridges for divine mat.",
  "s0290": "Five color earth additionally mixed feng.",
  "s0291": "Released distant strange beasts flying birds and white pheasants various things, considerably added to sacrifices.",
  "s0292": "Rhinoceros yak oxen elephants and such not used.",
  "s0293": "All went to Taishan then departed.",
  "s0294": "Feng shan sacrifices, that night as if had light, day had white clouds rise from feng midst.",
  "s0295": "The emperor from feng shan returned, sat in Bright Hall, ministers successively offered long life.",
  "s0296": "Thereupon imperial edict to Imperial Secretary: \"I with tiny body receive utmost honor, fearfully fear not equal to it.",
  "s0297": "Virtue meager thin, not clear on rites music.",
  "s0298": "Performed sacrifices to Taiyi, as if had image light, bits like had hope, faintly shaken by monsters, wanted to stop dared not, thereupon ascended feng Taishan, arrived at Liangfu, then shan Suran.",
  "s0299": "Self-renew, joyfully with officials new beginning, grant people hundred households one ox ten shi wine, add age eighty orphans widows two pi cloth silk.",
  "s0300": "Remit Bo, Fenggao, Sheqiu, Licheng, no exit this year taxes.",
  "s0301": "Its amnesty to all under heaven, like the yi mao amnesty edict.",
  "s0302": "Places passed through no repeat labor.",
  "s0303": "Matters from two years ago, all do not listen to or govern.\"",
  "s0304": "Again issued edict: \"Anciently the Son of Heaven five years one imperial tour, performed affairs on Taishan, feudal lords had court residence places.",
  "s0305": "Order the feudal lords each to manage lodgings below Taishan.\"",
  "s0306": "The emperor having already performed feng shan on Taishan, no wind rain disaster, and fangshi moreover said Penglai various divine mountains as if could be obtained, thereupon the emperor joyfully almost encountered them, then again east to seacoast looking, hoped to encounter Penglai.",
  "s0307": "Attending carriage Zi Hou suddenly fell ill, died in one day.",
  "s0308": "The emperor then departed, along the seacoast, north to Jieshi, toured from Liaoxi, passed the northern border to Jiuyuan.",
  "s0309": "Fifth month, returned to Ganquan.",
  "s0310": "The officials said the treasure ding appeared as Yuan Ding, made this year Yuanfeng first year.",
  "s0311": "That autumn, there was a star brushing Eastern Well.",
  "s0312": "After more than ten days, there was a star brushing Three Excellences.",
  "s0313": "Vapor observer Wang Shuo said: \"I alone saw its star emerge like a gourd, after about eating time again entered.\"",
  "s0314": "The officials said: \"Your Majesty established Han feng shan, heaven responds with virtuous stars.\"",
  "s0315": "The next year winter, suburban sacrificed to five emperors at Yong, returned, worshiped and sacrificed to Taiyi.",
  "s0316": "Assisted feast said: \"Virtuous star bright extended, that is auspicious omens.",
  "s0317": "Longevity star repeatedly emerges, deep radiance bright.",
  "s0318": "Faith star bright appears, emperor respectfully bows Tai blessing feast.\"",
  "s0319": "That spring, Gongsun Qing said saw divine immortals on Donglai mountain, as if saying \"see the Son of Heaven\".",
  "s0320": "The emperor thereupon went to Gou Shi city, appointed Qing as court gentleman.",
  "s0321": "Then went to Donglai, lodged several days, saw nothing, saw giant tracks.",
  "s0322": "Again sent fangshi seek divine monsters gather mushroom medicines numbering in thousands.",
  "s0323": "This year drought.",
  "s0324": "Thereupon the emperor having gone without harvest, prayed to Wanli Sha, passed sacrificing to Taishan.",
  "s0325": "Returned to Hulu Zi, personally oversaw blocking Yellow River breach, stayed two days, sank offerings and departed.",
  "s0326": "Sent two ministers lead troops block Yellow River breach, Yellow River shifted two channels, restored Yu's former traces.",
  "s0327": "At this time having already extinguished Nanyue, Yue people brave then said \"Yue people custom believe in ghosts, and their sacrifices all see ghosts, frequently effective.",
  "s0328": "Formerly Dong'ou King revered ghosts, lived to one hundred sixty years.",
  "s0329": "Later generations frivolous indolent, therefore declined wasted.\"",
  "s0330": "Then ordered Yue witches establish Yue invocators shrines, established platform no altar, also sacrificed to heavenly spirits August Emperor hundred ghosts, and divined with chickens.",
  "s0331": "The emperor believed it, Yue sacrifices chicken divination began used.",
  "s0332": "Gongsun Qing said: \"Immortals can be seen, but the emperor goes always hastily, therefore not seen.",
  "s0333": "Now Your Majesty can make a tower, like Gou Shi city, place dried meat dates, divine immortals should be attainable.",
  "s0334": "Moreover immortals like tower residence.\"",
  "s0335": "Thereupon the emperor ordered Chang'an then build Flying Curtain Gui tower, Ganquan then build Benefit Prolong Life tower, had Qing hold tally set up utensils and await divine immortals, then made Tongtian Terrace, placed sacrificial utensils below it, to summon divine immortal kinds.",
  "s0336": "Thereupon Ganquan again established front hall, began broadening various palace chambers.",
  "s0337": "Summer, there was mushroom born in the hall moat inner midst.",
  "s0338": "The emperor for blocking Yellow River, building Tongtian Terrace, as if had light clouds, then issued edict: \"Gan Quan moat born mushroom nine stems, amnesty all under heaven, no repeat labor.\"",
  "s0339": "The next year, attacked Chaoxian.",
  "s0340": "Summer, drought.",
  "s0341": "Gongsun Qing said: \"Yellow Emperor time feng then heaven drought, dry feng three years.\"",
  "s0342": "The emperor then issued edict: \"Heaven drought, intend dry feng?",
  "s0343": "Order all under heaven honor sacrifice spirit star.\"",
  "s0344": "The next year, suburban sacrificed at Yong, opened Huizhong path, toured it.",
  "s0345": "Spring, arrived at Mingze, from Xhe returned.",
  "s0346": "The next year winter, toured southern commandery, arrived at Jiangling then east.",
  "s0347": "Ascended rites Qian's Tianzhu Mountain, named it Southern Yue.",
  "s0348": "Floated Yangtze, from Xunyang exited Congyang, passed Pengli, sacrificed to famous mountains rivers.",
  "s0349": "North to Langye, along the seacoast.",
  "s0350": "Fourth month, arrived at Fenggao repaired feng.",
  "s0351": "Initially, the emperor feng Taishan, Taishan northeast foot anciently had Mingtang place, place dangerous not spacious.",
  "s0352": "The emperor wished to build Mingtang beside Fenggao, not clear on its system.",
  "s0353": "Jinan man Gong Yu Dai presented Yellow Emperor time Mingtang diagram.",
  "s0354": "Mingtang diagram midst has one hall, four faces no walls, covered with thatch, water flows through, round palace wall for covered walkway, above has tower, enters from southwest, named Kunlun, the emperor follows entering, to bow sacrifice August Emperor.",
  "s0355": "Thereupon ordered Fenggao build Mingtang on Wen, like Dai diagram.",
  "s0356": "And five years repaired feng, then sacrificed Taiyi, five emperors at Mingtang upper seat, commanded Gao Emperor sacrifice seat face it.",
  "s0357": "Sacrificed Houtu at lower chamber, with twenty great sacrificial animals.",
  "s0358": "The emperor enters from Kunlun path, begins bowing Mingtang like suburban rites.",
  "s0359": "Rites completed, burned below hall.",
  "s0360": "And the emperor again ascended Taishan, had secret sacrifice at its peak.",
  "s0361": "And Taishan below sacrificed five emperors, each like their direction, Yellow Emperor together with Red Emperor, and officials attend sacrifice.",
  "s0362": "Taishan above raised fire, below all responded.",
  "s0363": "After two years, eleventh month jia zi first day winter solstice, calendar pushers with original system.",
  "s0364": "The emperor personally arrived Taishan, with eleventh month jia zi first day winter solstice day sacrificed August Emperor Mingtang, every time repaired feng shan.",
  "s0365": "Its assisted feast said: \"Heaven increases grants emperor Taiyuan divine planchette, cycles and begins again.",
  "s0366": "Emperor respectfully bows Taiyi.\"",
  "s0367": "East to seacoast, examined entering sea and fangshi seeking spirits, none verified, yet increased sending, hoped to encounter them.",
  "s0368": "Eleventh month yi you, Cypress Beam disaster.",
  "s0369": "Twelfth month jia wu first day, the emperor personally shan Gaoli, sacrificed Houtu.",
  "s0370": "Faced Bohai, about to gaze sacrifice Penglai kinds, hoped to arrive exceptional court.",
  "s0371": "The emperor returned, because Cypress Beam disaster, court received accounts at Ganquan.",
  "s0372": "Gongsun Qing said: \"Yellow Emperor went to Qingling Terrace, twelve days burned, Yellow Emperor then governed Ming Court.",
  "s0373": "Ming Court is Ganquan.\"",
  "s0374": "Fangshi many said ancient emperors had capitals at Ganquan.",
  "s0375": "Afterward the emperor again received feudal lords at Ganquan, Ganquan made feudal lords lodgings.",
  "s0376": "Yongzhi then said: \"Yue custom has fire disaster, rebuild houses must use large, to overcome and subdue it.\"",
  "s0377": "Thereupon built Jianzhang Palace, measured as thousand gates ten thousand households.",
  "s0378": "Front hall measured higher than Weiyang, its east then Feng Que, high twenty plus zhang.",
  "s0379": "Its west then Tangzhong, several ten li tiger enclosure.",
  "s0380": "Its north managed great pond, Jian Terrace high twenty plus zhang, named Taiye Pond, midst has Penglai, Fangzhang, Yingzhou, Huliang, representing sea divine mountains turtle fish kinds.",
  "s0381": "Its south has Jade Hall, Jade Gate, Great Bird kinds.",
  "s0382": "Then established Divine Bright Terrace, Well Shaft Tower, measured fifty plus zhang, carriage paths connected.",
  "s0383": "Summer, Han reformed calendar, made first month year beginning, and color upper yellow, official names changed seal characters to five words.",
  "s0384": "Therefore named Tai Chu first year.",
  "s0385": "This year, west attacked Dayuan.",
  "s0386": "Locusts greatly arose.",
  "s0387": "Ding Lady, Luoyang Yu Chu and others with techniques sacrificed and cursed Xiongnu, Dayuan.",
  "s0388": "The next year, officials said Yong five altars no cooked sacrificial animals, fragrances not complete.",
  "s0389": "Then ordered sacrifice officials advance altar calf sacrificial animals, five color foods what overcomes, and with wooden horse replaced colts.",
  "s0390": "Only five emperors used colts, personal suburban used colts.",
  "s0391": "And various famous mountains rivers using colts, all with wooden horses replaced.",
  "s0392": "Travel passed, then used colts.",
  "s0393": "Other rites as before.",
  "s0394": "The next year, east toured seacoast, examined divine immortals kinds, none verified.",
  "s0395": "Fangshi had saying \"Yellow Emperor time made five cities twelve towers, to await divine immortals at Zhiji, named Ying Nian\".",
  "s0396": "The emperor approved making like the method, named Ming Nian.",
  "s0397": "The emperor personally rites sacrificed August Emperor, wore yellow above.",
  "s0398": "Gong Yu Dai said: \"Yellow Emperor time although feng Taishan, yet Feng Hou, Feng Ju, Qi Bo commanded Yellow Emperor feng east Taishan, shan Fan Mountain united talisman, then not die.\"",
  "s0399": "The emperor having commanded set sacrificial utensils, arrived east Taishan, east Taishan low small, not match its reputation, then ordered sacrifice officials rites it, but did not feng shan.",
  "s0400": "Afterward commanded Dai serve sacrifice await divine things.",
  "s0401": "Summer, then returned Taishan, repaired five years rites like before, and added shan sacrifice Stone Que.",
  "s0402": "Stone Que is at Taishan below foot southern side, fangshi many said this immortal's que, therefore the emperor personally shan.",
  "s0403": "After five years, again arrived Taishan repaired feng, return passed sacrificed Changshan.",
  "s0404": "Now the emperor established sacrifices, Taiyi, Houtu, three years personally suburban sacrificed, established Han feng shan, five years once repaired feng.",
  "s0405": "Bo Ji Taiyi and three ones, Ming Yang, horse travel, red star, five, Kuan Shu sacrifice officials with seasons performed rites.",
  "s0406": "Altogether six sacrifices, all Grand Invocator led.",
  "s0407": "As for eight spirits various spirits, Ming Nian, Fan Mountain other named sacrifices, travel passed then sacrificed, departed then stopped.",
  "s0408": "Fangshi established sacrifices, each master their own, their person died then stopped, sacrifice officials not master.",
  "s0409": "Other sacrifices all as their former.",
  "s0410": "Now the emperor feng shan, after twelve years returned, toured five Yue, four waterways.",
  "s0411": "And fangshi awaiting sacrificing divine immortals, entering sea seeking Penglai, ultimately none verified.",
  "s0412": "And Gongsun Qing awaiting spirits, still used giant tracks as explanation, no effect.",
  "s0413": "The emperor increasingly wearied of fangshi strange circuitous words, yet finally detained not broke off, hoped to encounter true.",
  "s0414": "From this after, fangshi speaking sacrifice spirits increasingly many, yet their effects observable.",
  "s0415": "The Grand Historian says: I followed toured sacrificed heaven earth various spirits famous mountains rivers and feng shan.",
  "s0416": "Entered Longevity Palace served sacrifice divine words, thoroughly observed fangshi sacrifice officials words, thereupon retired and arranged sequence since ancient used affairs with ghosts spirits, fully saw their exterior interior.",
  "s0417": "Later have gentlemen, can peruse.",
  "s0418": "As for stands dishes jade tallies detailed, offering toasting rites, then officials preserve."
}