{
  "s0256": "Thus people dare not offend.",
  "s0257": "Thus Han Zi said 'silk cloth eight chi, common person not release, melt gold hundred yi, Dao Zhi not grab' , not common person heart heavy, eight chi profit deep, Dao Zhi desire shallow;",
  "s0258": "Again not consider Dao Zhi conduct as light hundred jin heavy.",
  "s0259": "Grab must follow hand punish, then Dao Zhi not grab hundred jin;",
  "s0260": "Punish not must execute, then common person not release eight chi.",
  "s0261": "Thus city high five zhang, Lou Ji not lightly offend;",
  "s0262": "Tai mountain high hundred ren, lame sheep herd above.",
  "s0263": "Lou Ji moreover difficult five zhang limit, how lame sheep easy hundred ren high?",
  "s0264": "Steep moat situation different.",
  "s0265": "Enlightened lord sage king what can long dwell honored position, long hold heavy power, alone monopolize world profit, not have different way, can alone decide examine supervise responsibility, must deep punish, thus world dare not offend.",
  "s0266": "Now not manage so not offend, yet do benevolent mother what defeat son, then also not examine sage person discussion.",
  "s0267": "Cannot execute sage person method, then abandon be world servitude what affair!",
  "s0268": "Can not sorrow!",
  "s0269": "Moreover frugal moderate benevolent righteous person stand in court, then wild unrestrained pleasure stop;",
  "s0270": "Admonish speak discuss principle ministers at side, then unrestrained will yield;",
  "s0271": "Fierce scholars die integrity conduct appear in world, then licentious peaceful worry abandon.",
  "s0272": "Thus enlightened lord can exclude these three, alone grasp lord method to control listen follow ministers, cultivate clear law, thus body honored power heavy.",
  "s0273": "All worthy lord, must will can brush world polish customs, abandon what hate, establish what desire, thus alive have respected power, dead have worthy enlightened posthumous title.",
  "s0274": "Thus enlightened ruler alone decide, thus power not in ministers.",
  "s0275": "Then can extinguish benevolent righteous path, block gallop speak mouth, distress fierce scholars conduct, block hearing cover clear, inner alone see hear, thus outside cannot incline with benevolent righteous fierce scholars conduct, inner cannot seize with admonish speak resent contend eloquence.",
  "s0276": "Thus can brightly alone act indulge wantonly heart not dare oppose.",
  "s0277": "Like this then can call able clear Shen, Han method, cultivate Shang Jun law.",
  "s0278": "Law cultivate method clear yet world chaos, not heard.",
  "s0279": "Thus said 'king way concise easy grasp'.",
  "s0280": "Only enlightened lord can execute.",
  "s0281": "Like this then call supervise responsibility sincerity, then ministers no evil, ministers no evil then world peaceful, world peaceful then lord strict honored, lord strict honored then supervise responsibility certain, supervise responsibility certain then what seek obtain, what seek obtain then state rich, state rich then lord happy abundant.",
  "s0282": "Thus supervise responsibility method established, then what desire none not obtain.",
  "s0283": "Ministers hundred surnames save excess not sufficient, what change dare plot?",
  "s0284": "Like this then emperor way complete, can call able clear ruler minister method.",
  "s0285": "Though Shen, Han revive, cannot add.",
  "s0286": "Letter submitted, Second Emperor pleased.",
  "s0287": "Thus execute supervise responsibility increasingly strict, tax people deep called clear official.",
  "s0288": "Second Emperor said: 'Like this then can call able supervise responsibility.'",
  "s0289": "Punished mutually half on road, dead people daily piled in market.",
  "s0290": "Kill people many called loyal minister.",
  "s0291": "Second Emperor said: 'Like this then can call able supervise responsibility.'",
  "s0293": "Initially, Zhao Gao as langzhong commander, what killed and repaid private enmity many, feared ministers enter court memorial affairs slander hate him, then persuaded Second Emperor said: 'Emperor what noble, only with hear sound, ministers none get see face, thus number 'Zhen'.",
  "s0294": "Moreover Your Majesty rich in youth, not must all understand various affairs, now sit court, dispatch raise have improper, then seen short by ministers, not what show divine clear to world.",
  "s0295": "Moreover Your Majesty deep bow forbidden middle, with minister and serving middle practice law wait affairs, affairs come have to measure.",
  "s0296": "Like this then ministers dare not memorial doubtful affairs, world praise sage lord.'",
  "s0297": "Second Emperor used his plan, then not sit court see ministers, dwell forbidden middle.",
  "s0298": "Zhao Gao constantly serve middle manage affairs, affairs all decided by Zhao Gao.",
  "s0299": "Gao heard Li Si with speak, then saw chancellor said: 'Pass east crowd bandits many, now above urgent increase send corvee treat Epang palace, gather dogs horses useless things.",
  "s0300": "Minister wish admonish, position base.",
  "s0301": "This true lord marquis affair, lord why not admonish?'",
  "s0302": "Li Si said: 'Certainly, I wish speak long.",
  "s0303": "Now time above not sit court, above dwell deep palace, I have speak, cannot transmit, wish see no interval.'",
  "s0304": "Zhao Gao told: 'Lord truly can admonish, please for lord wait above leisure speak lord.'",
  "s0305": "Thus Zhao Gao waited Second Emperor just feast pleasure, women dwell front, made person tell chancellor: 'Above just leisure, can memorial affairs.'",
  "s0306": "Chancellor to palace gate above audience, like this three times."
}

