{
  "s0001": "Chen Wan was Chen Li Gong's other son.",
  "s0002": "Wan was born, Zhou Grand Historian passed through Chen, Chen Li Gong made divine Wan, hexagram obtained Guan of Pi: 'This is viewing state's light, beneficial guest at wang.",
  "s0003": "This his replace Chen have state?",
  "s0004": "Not at this but at different state?",
  "s0005": "Not this his person, in his descendants.",
  "s0006": "If at different state, must Jiang surname.",
  "s0007": "Jiang surname, four mountains after.",
  "s0008": "Things none can two great, Chen decline, this its flourish?'",
  "s0009": "Li Gong was Chen Wen Gong young son, his mother Cai woman.",
  "s0010": "Wen Gong died, Li Gong elder brother Bao established, this was Huan Gong.",
  "s0011": "Huan Gong with him different mother.",
  "s0012": "When Huan Gong ill, Cai people for him killed Huan Gong Bao and crown prince Mian and established him, became Li Gong.",
  "s0013": "Li Gong already established, married Cai woman.",
  "s0014": "Cai woman licentious with Cai person, several return, Li Gong also several go to Cai.",
  "s0015": "Huan Gong young son Lin resented Li Gong kill his father and elder brother, then ordered Cai people entice Li Gong and kill him.",
  "s0016": "Lin self-established, this was Zhuang Gong.",
  "s0017": "Therefore Chen Wan could not establish, became Chen grand master.",
  "s0018": "Li Gong's killing, because licentious leave state, therefore Spring and Autumn said 'Cai people killed Chen Ta', blaming it.",
  "s0019": "Zhuang Gong died, established younger brother Chu Jiu, this was Xuan Gong.",
  "s0020": "Xuan Gong eleven years, killed his crown prince Yu Kou.",
  "s0021": "Yu Kou with Wan mutually loved, feared calamity reach self, Wan therefore fled Qi.",
  "s0022": "Qi Huan Gong wished make him minister, declined said: 'Sojourning minister fortunate obtain avoid shoulder burden, jun's favor, dare not receive high position.'",
  "s0023": "Huan Gong made him work director.",
  "s0024": "Qi Yi Zhong wished marry Wan, divined it, omen said: 'This called phoenix fly, harmonious call clang clang.",
  "s0025": "Have Gui after, will nourish at Jiang.",
  "s0026": "Five generations its flourish, equal to proper ministers.",
  "s0027": "Eight generations after, none with contend.'",
  "s0028": "Finally married Wan.",
  "s0029": "Wan's flee to Qi, Qi Huan Gong established fourteen years.",
  "s0030": "Wan died, posthumous Jing Zhong.",
  "s0031": "Zhong gave birth to Zhi Meng Yi.",
  "s0032": "Jing Zhong's enter Qi, with Chen character became Tian clan.",
  "s0033": "Tian Zhi Meng Yi gave birth to Min Meng Zhuang, Tian Min Meng Zhuang gave birth to Wen Zi Xu Wu.",
  "s0034": "Tian Wen Zi served Qi Zhuang Gong.",
  "s0035": "Jin grand master Luan Ying made chaos in Jin, came flee Qi, Qi Zhuang Gong thickly guest him.",
  "s0036": "Yan Ying with Tian Wen Zi remonstrated, Zhuang Gong not listened.",
  "s0037": "Wen Zi died, gave birth to Huan Zi Wu Yu.",
  "s0038": "Tian Huan Zi Wu Yu had strength, served Qi Zhuang Gong, very had favor.",
  "s0039": "Wu Yu died, gave birth to Wu Zi Kai with Xi Zi Qi.",
  "s0040": "Tian Xi Zi Qi served Qi Jing Gong as grand master, his collected taxes from people with small dou received, his millet gave people with big dou, practiced concealed virtue on people, Jing Gong not prohibited.",
  "s0041": "From this Tian clan obtained Qi multitudes heart, clan increasingly strong, people thought Tian clan.",
  "s0042": "Yan Zi several remonstrated Jing Gong, Jing Gong not listened.",
  "s0043": "Already then envoy to Jin, with Shu Xiang private spoke said: 'Qi state's governance finally return to Tian clan.'",
  "s0044": "Yan Ying died after, Fan, Zhong Xing clan rebelled Jin.",
  "s0045": "Jin attacked them urgent, Fan, Zhong Xing requested grain from Qi.",
  "s0046": "Tian Qi wished make chaos, planted faction at feudal lords, then persuaded Jing Gong said: 'Fan, Zhong Xing several had virtue to Qi, Qi cannot not save.'",
  "s0047": "Qi made Tian Qi save them and transported grain to them.",
  "s0048": "Jing Gong crown prince died, afterward had favored concubine called Rui Zi, gave birth to son Tu.",
  "s0049": "Jing Gong ill, commanded his chancellor Hui Zi and Gao Zhao Zi with son Tu as crown prince.",
  "s0050": "Jing Gong died, two chancellors Gao, Guo established Tu, this was Yan Ru Zi.",
  "s0051": "And Tian Qi not pleased, wished establish Jing Gong other son Yang Sheng.",
  "s0052": "Yang Sheng originally with Qi happy.",
  "s0053": "Yan Ru Zi established, Yang Sheng fled Lu.",
  "s0054": "Tian Qi falsely served Gao Zhao Zi, Guo Hui Zi, every morning substituted chariot rider, spoke said: \"Initially various grand masters not wished establish ru zi.",
  "s0055": "Ru zi already established, jun chancellor it, grand masters all self-dangerous, planned make chaos.\"",
  "s0056": "Again deceived grand masters said: \"Gao Zhao Zi fearful, when not send first him.\"",
  "s0057": "Various grand masters followed it.",
  "s0058": "Tian Qi, Bao Mu with grand masters with troops entered palace, attacked Gao Zhao Zi.",
  "s0059": "Zhao Zi heard it, with Guo Hui Zi saved gong.",
  "s0060": "Gong troops defeated.",
  "s0061": "Tian Qi multitudes pursued Guo Hui Zi, Hui Zi fled Ju, then returned killed Gao Zhao Zi.",
  "s0062": "Yan Yu fled Lu.",
  "s0063": "Tian Qi made person to Lu, welcomed Yang Sheng.",
  "s0064": "Yang Sheng arrived Qi, hid Tian Qi home.",
  "s0065": "Requested various grand masters said: \"Chang mother has fish bean sacrifice, fortunate come assemble drink.\"",
  "s0066": "Assembled drank Tian clan.",
  "s0067": "Tian Qi stored Yang Sheng bag midst, placed seat central.",
  "s0068": "Opened bag, left Yang Sheng, said: \"This is Qi jun.\"",
  "s0069": "Grand masters all prostrated saluted.",
  "s0070": "Would ally establish him, Tian Qi falsely said: \"I with Bao Mu planned together establish Yang Sheng.\"",
  "s0071": "Bao Mu angered said: \"Grand masters forget Jing Gong command?\"",
  "s0072": "Various grand masters wished regret, Yang Sheng then knocked head said: \"Can then establish him, cannot then stop.\"",
  "s0073": "Bao Mu feared calamity reach self, then again said: \"All Jing Gong son, why cannot!\"",
  "s0074": "Then established Yang Sheng at Tian Qi home, this was Dao Gong.",
  "s0075": "Then made person moved Yan Ru Zi to Tai, and killed ru zi Tu.",
  "s0076": "Dao Gong already established, Tian Qi became chancellor, specialized Qi governance.",
  "s0077": "Fourth year, Tian Qi died, son Chang substituted established, this was Tian Cheng Zi.",
  "s0078": "Bao Mu with Qi Dao Gong had grudge, assassinated Dao Gong.",
  "s0079": "Qi people together established his son Ren, this was Jian Gong.",
  "s0080": "Tian Chang Cheng Zi with Jian Zhi together became left right chancellors, chancellor Jian Gong.",
  "s0081": "Tian Chang heart harmed Jian Zhi, Jian Zhi fortunate at Jian Gong, authority could not remove.",
  "s0082": "Thereupon Tian Chang again repaired Xi Zi governance, with big dou went out loaned, with small dou received.",
  "s0083": "Qi people sang it said: \"Old woman pick aster, return to Tian Cheng Zi!\"",
  "s0084": "Qi grand masters court, Yu Yang remonstrated Jian Gong said: \"Tian, Jian cannot together, jun select it.\"",
  "s0085": "Jun not listened.",
  "s0086": "Zi Wo was Jian Zhi clan person, often with Tian clan had grudge.",
  "s0087": "Tian clan distant relative Tian Bao served Zi Wo had favor.",
  "s0088": "Zi Wo said: \"I wish completely extinguish Tian clan proper, with Bao substitute Tian clan ancestor.\"",
  "s0089": "Bao said: \"Subject at Tian clan distant.\"",
  "s0090": "Not listened.",
  "s0091": "Already then Bao told Tian clan said: \"Zi Wo will execute Tian clan, Tian clan not first, calamity reached.\"",
  "s0092": "Zi Wo resided gong palace, Tian Chang brothers four people rode entered gong palace, wished kill Zi Wo.",
  "s0093": "Zi Wo closed gate.",
  "s0094": "Jian Gong with woman drank Tan Tai, would wished attack Tian Chang.",
  "s0095": "Grand Historian Zi Yu said: \"Tian Chang not dare make chaos, will remove harm.\"",
  "s0096": "Jian Gong then stopped.",
  "s0097": "Tian Chang left, heard Jian Gong anger, feared executed, would leave flee.",
  "s0098": "Tian Zi Xing said: \"Need, affair thief.\"",
  "s0099": "Tian Chang then attacked Zi Wo.",
  "s0100": "Zi Wo led his followers attacked Tian clan, not victorious, left fled.",
  "s0101": "Tian clan followers pursued killed Zi Wo and Jian Zhi.",
  "s0102": "Jian Gong left fled, Tian clan followers pursued captured Jian Gong at Xu Zhou.",
  "s0103": "Jian Gong said: \"Early follow Yu Yang words, not reach this difficulty.\"",
  "s0104": "Tian clan followers feared Jian Gong again established and executed self, then killed Jian Gong.",
  "s0105": "Jian Gong established four years then killed.",
  "s0106": "Thereupon Tian Chang established Jian Gong younger brother Ao, this was Ping Gong.",
  "s0107": "Ping Gong assumed position, Tian Chang became chancellor.",
  "s0108": "Tian Chang already killed Jian Gong, feared feudal lords together executed self, then completely returned Lu, Wei invaded lands, west allied Jin, Han, Wei, Zhao clan, south connected Wu, Yue envoys, repaired merit bestowed reward, close to hundred surnames, with this Qi again settled.",
  "s0109": "Tian Chang spoke to Qi Ping Gong said: \"Virtue bestow what people desire, jun execute it;",
  "s0110": "Punishment what people hate, subject please execute it.\"",
  "s0111": "Executed five years, Qi state governance all returned Tian Chang.",
  "s0112": "Tian Chang then completely executed Bao, Yan, Jian Zhi and gong clan strong ones, and divided Qi self An Ping east to Lang Ya, self made sealed yi.",
  "s0113": "Sealed yi greater than Ping Gong what ate.",
  "s0114": "Tian Chang then selected Qi state midst women tall seven chi above became rear palace, rear palace by hundred count, and made guests retainers entered rear palace not prohibited.",
  "s0115": "When Tian Chang died, had seventy plus males.",
  "s0116": "Tian Chang died, son Xiang Zi Pan substituted established, chancellor Qi.",
  "s0117": "Chang posthumous Cheng Zi.",
  "s0118": "Tian Xiang Zi already chancellor Qi Xuan Gong, three Jin killed Zhi Bo, divided his land.",
  "s0119": "Xiang Zi made his brothers clan people completely became Qi capitals yi grand masters, with three Jin connected envoys, moreover with had Qi state.",
  "s0120": "Xiang Zi died, son Zhuang Zi Bai established.",
  "s0121": "Tian Zhuang Zi chancellor Qi Xuan Gong.",
  "s0122": "Xuan Gong forty-third year, attacked Jin, destroyed Huang city, surrounded Yang Hu.",
  "s0123": "Next year, attacked Lu, Ge and An Ling.",
  "s0124": "Next year, took Lu one city.",
  "s0125": "Zhuang Zi died, son Tai Gong He established.",
  "s0126": "Tian Tai Gong chancellor Qi Xuan Gong.",
  "s0127": "Xuan Gong forty-eighth year, took Lu city.",
  "s0128": "Next year, Xuan Gong with Zheng people assembled Xi Cheng.",
  "s0129": "Attacked Wei, took Wu Qiu.",
  "s0130": "Xuan Gong fifty-first year died, Tian Hui self Lin Qiu returned.",
  "s0131": "Xuan Gong died, son Kang Gong Dai established.",
  "s0132": "Dai established fourteen years, licentious in wine women, not listened governance.",
  "s0133": "Tai Gong then moved Kang Gong to sea, ate one city, to serve his first sacrifices.",
  "s0134": "Next year, Lu defeated Qi Ping Lu.",
  "s0135": "Qi Hou Tai Gong He established two years, He died, son Huan Gong Wu established.",
  "s0136": "Huan Gong Wu fifth year, Qin, Wei attacked Han, Han sought aid from Qi.",
  "s0137": "Qi Huan Gong summoned ministers planned said: \"Early save it which compared late save it?\"",
  "s0138": "Zou Ji said: \"Not if not save.\"",
  "s0139": "Duan Gan Peng said: \"Not save, then Han will break and enter Wei, not if save it.\"",
  "s0140": "Tian Chen Si said: \"Wrong jun plan!",
  "s0141": "Qin, Wei attack Han, Chu, Zhao must save it, is Heaven with Yan grant Qi.\"",
  "s0142": "Huan Gong said: \"Good\".",
  "s0143": "Then secretly told Han envoy and sent him.",
  "s0144": "Han self considered obtained Qi save, because with Qin, Wei battled.",
  "s0145": "Chu, Zhao heard it, indeed raised troops saved them.",
  "s0146": "Qi because raised troops attacked Yan state, took Sang Qiu.",
  "s0147": "Sixth year, saved Wei.",
  "s0148": "Huan Gong died, son Wei Wang Yin Qi established.",
  "s0149": "This year, former Qi Kang Gong died, cut no descendants, offering yi all entered Tian clan.",
  "s0150": "Zou Ji son with drum qin saw Wei Wang, Wei Wang pleased and placed him right chamber.",
  "s0151": "Moment, wang drum qin, Zou Ji son pushed door entered said: 'Good drum qin!'",
  "s0152": "Wang suddenly not pleased, left qin pressed sword said: 'Sir saw appearance not examined, how know its good?'",
  "s0153": "Zou Ji son said: 'Big strings muddy with spring warm, jun;",
  "s0154": "Small strings frugal break with clear, chancellor;",
  "s0155": "Pluck deep, release pleasant, governance commands;",
  "s0156": "Harmonize with sound, big small mutually benefit, circuit evil not mutually harm, four seasons: I therefore know its good.'",
  "s0157": "Wang said: 'Good speak sound.'",
  "s0158": "Zou Ji son said: 'How alone speak sound, govern state pacify people all in midst.'",
  "s0159": "Wang again suddenly not pleased said: 'If speak five sounds record, truly not have like sir.",
  "s0160": "If govern state pacify people, moreover what for silk tong interval?'",
  "s0161": "Zou Ji son said: 'Big strings muddy with spring warm, jun;",
  "s0162": "Small strings frugal break with clear, chancellor;",
  "s0163": "Pluck deep release pleasant, governance commands;",
  "s0164": "Harmonize with sound, big small mutually benefit, circuit evil not mutually harm, four seasons.",
  "s0165": "Repeated not chaotic, what govern flourish;",
  "s0166": "Connected direct, what preserve perish: therefore said qin sound tuned then world governed.",
  "s0167": "Govern state pacify people, none like five sounds.'",
  "s0168": "Wang said: 'Good.'",
  "s0169": "Zou Ji son saw three months received chancellor seal.",
  "s0170": "Chun Yu Kun saw it said: 'Good persuade!",
  "s0171": "Kun have foolish will, wish present before.'",
  "s0172": "Zou Ji son said: 'Respectfully receive teaching.'",
  "s0173": "Chun Yu Kun said: 'Obtain complete complete flourish, lose complete complete perish.'",
  "s0174": "Zou Ji son said: 'Respectfully receive command, please respectfully not leave before.'",
  "s0175": "Chun Yu Kun said: 'Pig fat thorn axle, what make smooth, however cannot transport square bore.'",
  "s0176": "Zou Ji son said: 'Respectfully receive command, please respectfully serve left right.'",
  "s0177": "Chun Yu Kun said: 'Bow glue Xi Gan, what make join, however cannot attach join sparse cracks.'",
  "s0178": "Zou Ji son said: 'Respectfully receive command, please respectfully self attach to ten thousand people.'",
  "s0179": "Chun Yu Kun said: 'Fox fur though worn, cannot mend with yellow dog skin.'",
  "s0180": "Zou Ji son said: 'Respectfully receive command, please respectfully select gentleman, not mix small people its interval.'",
  "s0181": "Chun Yu Kun said: 'Big cart not check, cannot load its constant duty;",
  "s0182": "Qin se not check, cannot complete its five sounds.'",
  "s0183": "Zou Ji son said: 'Respectfully receive command, please respectfully repair laws supervise evil officials.'",
  "s0184": "Chun Yu Kun persuaded finished, hurried left, arrived gate, and faced his servant said: 'This person, I spoke subtle words five, his respond me like echo respond sound, this person must enfeoff soon.'",
  "s0185": "Resided period, enfeoffed Xia Pi below, number called Cheng Hou.",
  "s0186": "Wei Wang twenty-third year, with Zhao wang assembled Ping Lu.",
  "s0187": "Twenty-fourth year, with Wei wang assembled field at Jiao.",
  "s0188": "Wei wang asked said: 'Wang also have treasure?'",
  "s0189": "Wei Wang said: 'None have.'",
  "s0190": "Liang wang said: 'If my state small, still have diameter cun pearl illuminate cart front back each twelve multiply ten pieces, how with ten thousand multiply state while none treasure?'",
  "s0191": "Wei Wang said: 'My what called treasure with wang different.",
  "s0192": "My minister have Tan Zi, make guard south city, then Chu people dare not become bandit east take, Si Shang twelve feudal lords all come court.",
  "s0193": "My minister have Zi, make guard Gao Tang, then Zhao people dare not east fish at river.",
  "s0194": "My officials have Qian Fu, make guard Xu Zhou, then Yan people sacrifice north gate, Zhao people sacrifice west gate, moved followed several seven thousand plus households.",
  "s0195": "My minister have Zhong Shou, make prepare bandit thieves, then road not pick remain.",
  "s0196": "Will illuminate thousand li, how only twelve multiply!'",
  "s0197": "Liang Hui Wang ashamed, not pleased departed.",
  "s0198": "Twenty-sixth year, Wei Hui Wang surrounded Han Dan, Zhao sought aid from Qi.",
  "s0199": "Qi Wei Wang summoned ministers planned said: 'Save Zhao which compared not save?'",
  "s0200": "Zou Ji son said: 'Not if not save.'",
  "s0330": "To protect Ju city and cloth announce Qi state midst: 'Wang already established in Ju.'",
  "s0331": "Xiang Wang already established, established Grand Historian clan woman as wang empress, this was Jun Wang Empress, gave birth to son Jian.",
  "s0332": "Grand Historian Jiao said: 'Woman not take matchmaker because self marry, not my seed, defile my generation.'",
  "s0333": "Lifetime not saw Jun Wang Empress.",
  "s0334": "Jun Wang Empress worthy, not with not saw reason lose person child ritual.",
  "s0335": "Xiang Wang in Ju five years, Tian Dan with Ji Mo attacked broke Yan army, welcomed Xiang Wang at Ju, entered Lin Zi.",
  "s0336": "Qi former lands completely again belonged Qi.",
  "s0337": "Qi enfeoffed Tian Dan as An Ping Jun.",
  "s0338": "Fourteenth year, Qin attacked our Gang Shou.",
  "s0339": "Nineteenth year, Xiang Wang died, son Jian established.",
  "s0340": "Wang Jian established six years, Qin attacked Zhao, Qi Chu saved them.",
  "s0341": "Qin planned said: 'Qi Chu save Zhao, close then retreat troops, not close then attack them.'",
  "s0342": "Zhao without food, requested grain from Qi, Qi not listened.",
  "s0343": "Zhou Zi said: 'Not if listen to retreat Qin troops, not listen then Qin troops not retreat, is Qin plan midst and Qi Chu plan wrong.",
  "s0344": "Moreover Zhao at Qi Chu, defense screen, like teeth have lips, lips perish then teeth cold.",
  "s0345": "Today perish Zhao, tomorrow calamity reach Qi Chu.",
  "s0346": "Moreover save Zhao duty, suitable like offer leaky urn pour scorched cauldron.",
  "s0347": "Save Zhao, high righteousness;",
  "s0348": "Retreat Qin troops, manifest name.",
  "s0349": "Righteous save perished state, awe retreat strong Qin troops, not strive for this and strive love grain, for state plan wrong.'",
  "s0350": "Qi wang not listened.",
  "s0351": "Qin broke Zhao at Chang Ping forty plus ten thousand, then surrounded Han Dan.",
  "s0352": "Sixteenth year, Qin extinguished Zhou.",
  "s0353": "Jun Wang Empress died.",
  "s0354": "Twenty-third year, Qin established Dong Jun.",
  "s0355": "Twenty-eighth year, wang entered court Qin, Qin wang Zheng set wine Xian Yang.",
  "s0356": "Thirty-fifth year, Qin extinguished Han.",
  "s0357": "Thirty-seventh year, Qin extinguished Zhao.",
  "s0358": "Thirty-eighth year, Yan made Jing Ke stab Qin wang, Qin wang aware, killed Ke.",
  "s0359": "Next year, Qin broke Yan, Yan wang fled departed Liao Dong.",
  "s0360": "Next year, Qin extinguished Wei, Qin troops arrived Li Xia.",
  "s0361": "Forty-second year, Qin extinguished Chu.",
  "s0362": "Next year, captured Dai Wang Jia, extinguished Yan Wang Xi.",
  "s0363": "Forty-fourth year, Qin troops attacked Qi.",
  "s0364": "Qi wang listened chancellor Hou Sheng plan, not battled, with troops surrendered Qin.",
  "s0365": "Qin captured wang Jian, moved to Gong.",
  "s0366": "Then extinguished Qi made jun county.",
  "s0367": "World one united at Qin, Qin wang Zheng established title as emperor.",
  "s0368": "Initially, Jun Wang Empress worthy, served Qin careful, with feudal lords faithful, Qi also east edge sea, Qin day night attacked three Jin, Yan, Chu, five states each self saved at Qin, with reason wang Jian established forty plus years not received troops.",
  "s0369": "Jun Wang Empress died, Hou Sheng chancellor Qi, much received Qin interval gold, much made guests entered Qin, Qin moreover much gave gold, guests all became reverse interval, advised wang depart alliance court Qin, not repaired attack battle prepare, not aided five states attack Qin, Qin with reason obtained extinguished five states.",
  "s0370": "Five states already perished, Qin troops finally entered Lin Zi, people none dared resist.",
  "s0371": "Wang Jian then surrendered, moved to Gong.",
  "s0372": "Therefore Qi people resented wang Jian not early with feudal lords united alliance attacked Qin, listened evil minister guests to perish his state, sang it said: 'Pine or cypress?",
  "s0373": "Reside Jian Gong guests?'",
  "s0374": "Hated Jian used guests not auspicious.",
  "s0375": "Grand Historian said: Probably Confucius late happy Yi.",
  "s0376": "Yi what technique, dark bright far, not through person reach talent who able note!",
  "s0377": "Former Zhou Grand Historian divined Tian Jing Zhong Wan, occupied to ten generations after;",
  "s0378": "And Wan fled Qi, Yi Zhong divined also said.",
  "s0379": "Tian Qi and Chang so compared offend two jun, specialized Qi state governance, not necessarily affair momentum gradually so, probably followed fulfilled signs omens."
}