{
  "s0001": "The Grand Historian says: The records of the Five Emperors and Three Dynasties are already ancient.",
  "s0002": "Before the Yin dynasty, the feudal lords cannot be properly arranged in genealogical tables; since the Zhou, they can be quite well recorded.",
  "s0003": "Confucius followed the historical texts to arrange the Spring and Autumn Annals, recording the first year, correcting the days and months—how detailed it is!",
  "s0004": "As for arranging the Documents, it is brief, without years and months;",
  "s0005": "some have them to some extent, but many are missing and cannot be recorded.",
  "s0006": "Therefore, where there is doubt, transmit the doubt—this is his carefulness.",
  "s0007": "I have read the secret records; since the Yellow Emperor, all have year numbers.",
  "s0008": "Examining their calendar genealogies and secret records, the transmission of the beginning and end of the Five Virtues—all the ancient texts differ and are contradictory.",
  "s0009": "That the Master did not discuss and arrange their years and months—was this in vain?",
  "s0010": "Therefore, using the Five Emperors genealogical records and Documents collected generations, I made genealogical tables from the Yellow Emperor down to the Gonghe period.",
  "s0014": "King Zhao of Zhou, name Xia, went on a southern tour and did not return.",
  "s0015": "They did not announce it, and avoided mentioning it.",
  "s0016": "Duke Kao, Duke Yi, Marquis Wu, Pang Gao, Xiong Yuan, Duke Song, Xiao Bo, Xiang Gong, Cai Bo, Tai Bo",
  "s0017": "King Mu of Zhou, name Man.",
  "s0018": "He made the Punitive Code.",
  "s0019": "The remote regions did not come.",
  "s0020": "Duke Yang, younger brother of Duke Kao.",
  "s0021": "Duke Gui, Marquis Cheng, Da Ji, Xiong Sheng, Duke Ding, Si Bo, Duke Xiao, Gong Hou, Zhong Jun",
  "s0022": "King Gong of Zhou, name Yi Hu; Duke You, Duke Ai, Marquis Li, Da Luo, Xiong Yang, Duke Min (younger brother of Duke Ding),",
  "s0023": "Zheng Bo, Duke Shen, Marquis Li, Gong Bo",
  "s0024": "King Yi of Zhou, name Jian.",
  "s0025": "The Zhou way declined, and the poets made satires.",
  "s0026": "Wei Gong, Hu Gong, Marquis Jing, Fei Zi, Xiong Qu, Duke Yang (younger brother of Duke Min),",
  "s0027": "Jing Bo, Duke You, Marquis Wu, Xiao Bo",
  "s0028": "King Yi of Zhou, name Xie, son of King Yi.",
  "s0029": "Duke Xian, younger brother of Duke Li.",
  "s0030": "Duke Wu, Gong Bo, Xiong Chi Hong, Duke Xi, Marquis Qing",
  "s0031": "King Li of Zhou, name Hu.",
  "s0032": "Because he hated hearing criticism and was disorderly, he fled and died in Zhi.",
  "s0033": "Duke Zhen, Qin Zhong, Xiong Yan (younger brother of Hong),",
  "s0034": "Marquis Xi",
  "s0035": "The Gonghe period—two nobles administered government.",
  "s0036": "Duke Wu, younger brother of Duke Zhen.",
  "s0037": "Xiong Yong",
  "s0038": "Zhang Fuzi asked Master Chu: 'The Poetry says that Xie and Hou Ji were both born without fathers.",
  "s0039": "Now examining the various transmitted records, all say they had fathers, and their fathers were all sons of the Yellow Emperor—could this not contradict the Poetry?'",
  "s0040": "Master Chu said: 'Not so.",
  "s0041": "The Poetry speaks of Xie being born from an egg, Hou Ji from a footprint, wishing to show that they had the intention of heavenly mandate and sincerity.",
  "s0042": "Spirits and gods cannot complete themselves; they must be born through humans—how could they be born without fathers?",
  "s0043": "One account says they had fathers, another says no fathers; transmit what is trustworthy as trustworthy, transmit doubt as doubt—therefore both accounts are given.",
  "s0044": "Yao knew that Xie and Ji were both worthy men, born of Heaven, so he enfeoffed Xie with seventy li, and after more than ten generations reached Tang, who ruled All Under Heaven.",
  "s0045": "Yao knew that Hou Ji's descendants would later rule, so he additionally enfeoffed him with a hundred li; his descendants lasted a thousand years, until King Wen possessed All Under Heaven.",
  "s0046": "The Poetry transmission says: 'Tang's ancestor was Xie, born without a father.",
  "s0047": "Xie's mother and her sisters were bathing in the Xuanhill waters when a swallow carried an egg and dropped it; Xie's mother got it, so she cherished it, mistakenly swallowed it, and thus gave birth to Xie.",
  "s0048": "Xie was born and was worthy; Yao established him as Minister of Education, and gave him the surname Zi.",
  "s0049": "Zi means 'this';",
  "s0050": "'this' means increasingly great.",
  "s0051": "The poets praised and eulogized him, saying 'The Yin fields are vast, heavenly mandate dark bird, descended and gave birth to Shang'.",
  "s0052": "Shang means solid, Yin is the title.",
  "s0053": "King Wen's ancestor was Hou Ji; Hou Ji was also born without a father.",
  "s0054": "Hou Ji's mother was Jiang Yuan; she went out and saw giant footprints, stepped in them, became pregnant in her body, and gave birth to Hou Ji.",
  "s0055": "Jiang Yuan considered him fatherless, lowly, and abandoned him on the road; oxen and sheep avoided and did not trample him.",
  "s0056": "She carried him to the mountains; the mountains nourished him.",
  "s0057": "Again she abandoned him in a great marsh; birds covered him with wings and fed him.",
  "s0058": "Jiang Yuan was astonished, so knew he was a Son of Heaven, and took and raised him.",
  "s0059": "Yao knew of his worthy talents, established him as Grand Minister of Agriculture, and gave him the surname Ji.",
  "s0060": "Ji means root.",
  "s0061": "The poets praised and eulogized him, saying 'At first he gave birth to the people', deeply cultivating and completing, and thus the beginning of Hou Ji's way.'",
  "s0062": "Confucius said: 'In former times Yao commanded Xie to be of the Zi surname, because there would be Tang.",
  "s0063": "He commanded Hou Ji to be of the Ji surname, because there would be King Wen.",
  "s0064": "King Tai commanded Ji Li to receive the bright auspicious signs.",
  "s0065": "Tai Bo went to Wu, thus establishing the source.'",
  "s0066": "Heaven's mandate is difficult to speak of; only sages can perceive it.",
  "s0067": "Shun, Yu, Xie, and Hou Ji were all Yellow Emperor descendants.",
  "s0068": "The Yellow Emperor received Heaven's mandate and governed All Under Heaven; his virtue and favor deeply benefited later generations, therefore his descendants all again became established as Sons of Heaven—this is Heaven's reward for virtue.",
  "s0069": "People do not know this, thinking it was from humble origins as commoners suddenly rising.",
  "s0070": "How could commoners without cause suddenly rise and rule All Under Heaven?",
  "s0071": "It was because of Heaven's mandate.'",
  "s0072": "'Why did the Yellow Emperor's descendants rule All Under Heaven for such a long time?'",
  "s0073": "He said: 'The tradition says that rulers of All Under Heaven who for ten thousand people redeem the people's fate are emperors, and have blessing for ten thousand generations.",
  "s0074": "The Yellow Emperor was such.",
  "s0075": "When the five government affairs are clear, then cultivate ritual and righteousness, follow Heaven's seasons to raise troops and campaign successfully—that is ruling, with blessing for a thousand generations.",
  "s0076": "The King of Shu was Yellow Emperor descendants; to this day in the southwest five thousand li from Han, they constantly come to court and pay tribute to Han—not because their ancestors had virtue that flowed to later generations?",
  "s0077": "How can practicing morality be neglected?",
  "s0078": "Ruling lords should raise this up and observe it.",
  "s0079": "The Han General Huo Qubing, named Guang, was also Yellow Emperor descendants.",
  "s0080": "This can be told to those of broad learning and far sight; it is difficult to explain to those of shallow knowledge.",
  "s0081": "Why speak thus?",
  "s0082": "Ancient feudal lords took countries as surnames.",
  "s0083": "Huo was a country name.",
  "s0084": "King Wu enfeoffed his younger brother Shu at Huo; later generations Duke Xian of Jin extinguished Duke Huo, later generations became commoners, coming and going dwelling at Pingyang.",
  "s0085": "Pingyang is in Hedong, Hedong is Jin territory, divided into Wei country.",
  "s0086": "Speaking with the Poetry, it can also be considered Zhou generations.",
  "s0087": "Zhou arose from Hou Ji; Hou Ji was born without a father.",
  "s0088": "Speaking with the Three Dynasties genealogical transmissions, Hou Ji had a father named Gao Xin;",
  "s0089": "Gao Xin was Yellow Emperor's great-grandson.",
  "s0090": "The Yellow Emperor beginning and end transmission says: 'When Han rose, more than a century, there will be a person not short not tall, coming from Yan's white region, holding All Under Heaven's government; at that time there will be an infant ruler, desiring to proceed by cart.'",
  "s0091": "General Huo originally dwelt at Pingyang in Yan.",
  "s0092": "When I was a gentleman attendant, with the fangshi I examined merit at the banner pavilion below, and he told me.",
  "s0093": "Is this not magnificent!'"
}
