{
  "s0051": "Min Wang once claimed emperor title, later abandoned it.",
  "s0052": "Several times trapped three Jin.",
  "s0053": "Disliked world eloquent scholars, none trusted.",
  "s0054": "Rang Hou, Hua Yang Jun, Zhao Wang mother Xuan Taihou younger brother;",
  "s0055": "Jing Yang Jun, Gao Ling Jun all Zhao Wang same mother younger brothers.",
  "s0056": "Rang Hou chancellor, three persons alternated generals, had fief cities, because Taihou reason, private families rich heavy over royal house.",
  "s0057": "When Rang Hou as Qin general, moreover wished cross Han, Wei attack Qi Gang Shou, wished broaden his Tao fief.",
  "s0058": "Fan Sui then submitted letter:",
  "s0059": "Minister heard enlightened lord establishes governance, have merit not dare not reward, have ability not dare not appoint, labor great their salary thick, merit many their rank noble, able govern masses their office great.",
  "s0060": "Thus no ability dare not undertake position, have ability also not get concealed hidden.",
  "s0061": "Make with minister words as acceptable, wish implement increase benefit its way;",
  "s0062": "With minister words as unacceptable, long detain minister no use.",
  "s0063": "Saying: 'Common lord rewards loved punishes hated;",
  "s0064": "Enlightened lord then not so, reward certainly add to have merit, punishment certainly break at have crime.'",
  "s0065": "Now minister breast not sufficient match executioner's block, waist not sufficient await axe, how dare with doubtful matter test on king!",
  "s0066": "Though consider minister base person lightly humiliate, alone not heavy entrust minister without reciprocation to king?",
  "s0067": "Moreover minister heard Zhou has whetstone, Song has knot jade, Liang has hanging smartweed, Chu has harmony catalpa, these four treasures, soil birth, skilled artisan loss, yet become world famous vessels.",
  "s0068": "Then holy king abandoned, alone insufficient thicken state?",
  "s0069": "Minister heard good thicken family take from state, good thicken state take from feudal lords.",
  "s0070": "World has enlightened lord then feudal lords not dare monopolize thick, why?",
  "s0071": "For their divide glory.",
  "s0072": "Good physician knows sick person life death, holy lord enlightened at success failure matters, benefit then implement, harm then abandon, doubt then little test, though Shun Yu rebirth, not able change already.",
  "s0073": "Words to extreme, minister dare not load on book, its shallow again insufficient listen.",
  "s0074": "Intent minister foolish not match king heart?",
  "s0075": "No its speak minister base cannot use?",
  "s0076": "Self not so, minister wish get little grant wander view leisure, gaze see complexion.",
  "s0077": "One word no effect, please prostrate axe block.",
  "s0078": "Then Qin Zhao Wang greatly delighted, then apologized Wang Ji, made with relay carriage summon Fan Sui.",
  "s0079": "Then Fan Sui got see at detached palace, feigned as not know everlasting lane entered among.",
  "s0080": "King came yet eunuch angered, drove him, said: 'King arrives!'",
  "s0081": "Fan Sui deliberately said: 'Qin how get king?",
  "s0082": "Qin alone has Taihou, Rang Hou.'",
  "s0083": "Wished sense anger Zhao Wang.",
  "s0084": "Zhao Wang arrived, heard his with eunuch dispute words, then prolonged welcomed, apologized: 'Guaren suitable with body receive command long, meet Yiqu matter urgent, Guaren morning evening self beg Taihou;",
  "s0085": "Now Yiqu matter already, Guaren then got receive command.",
  "s0086": "Secretly piteous not sensitive, respectfully hold host guest ritual.'",
  "s0087": "Fan Sui declined yielded.",
  "s0088": "This day observed Fan Sui seeing, ministers none not splashed changed color changed countenance.",
  "s0089": "Qin king screened left right, palace empty none person.",
  "s0090": "Qin king knelt begged: 'Master what fortunate teach Guaren?'",
  "s0091": "Fan Sui said: 'Only only.'",
  "s0092": "Had interval, Qin king again knelt begged: 'Master what fortunate teach Guaren?'",
  "s0093": "Fan Sui said: 'Only only.'",
  "s0094": "Like this three times.",
  "s0095": "Qin king knelt said: 'Master finally not fortunate teach Guaren?'",
  "s0096": "Fan Sui said: 'Not dare so.",
  "s0097": "Minister heard formerly Lu Shang encounter Wen Wang, body as fisherman fished Weishui bank.",
  "s0098": "Like this, relation distant.",
  "s0099": "Already persuaded established as grand master, loaded with together returned, his words deep.",
  "s0100": "Thus Wen Wang then received merit from Lu Shang finally king world."
}