{
  "s0001": "The First Emperor of Qin was the son of King Zhuangxiang of Qin.",
  "s0002": "King Zhuangxiang had been a hostage of Qin in Zhao, where he saw Lü Buwei's concubine, was pleased with her, took her as his own, and she gave birth to the First Emperor.",
  "s0003": "He was born in the first month of the forty-eighth year of King Zhao of Qin at Handan.",
  "s0004": "When he was born, he was named Zheng and given the surname Zhao.",
  "s0005": "At the age of thirteen, King Zhuangxiang died, and Zheng succeeded him as King of Qin.",
  "s0006": "At that time, Qin's territory had already annexed Ba, Shu, and Hanzhong, passed beyond Wan to possess Ying, and established Nan Commandery;",
  "s0007": "to the north it had gathered Shangjun and eastward, possessing Hedong, Taiyuan, and Shangdang commanderies;",
  "s0008": "to the east it reached Xingyang, destroyed the Two Zhous, and established Sanchuan Commandery.",
  "s0009": "Lü Buwei served as prime minister, was enfeoffed with one hundred thousand households, and titled Marquis Wenxin.",
  "s0010": "He attracted guests and traveling scholars, intending to unify all under Heaven.",
  "s0011": "Li Si served as a retainer.",
  "s0012": "Meng Ao, Wang He, and Biao Gong served as generals.",
  "s0013": "The king was young and had just ascended the throne, so he entrusted state affairs to the great ministers.",
  "s0014": "Jinyang rebelled; in the first year, General Meng Ao attacked and pacified it.",
  "s0015": "In the second year, Biao Gong led troops to attack Juan, beheading thirty thousand.",
  "s0016": "In the third year, Meng Ao attacked Han and took thirteen cities.",
  "s0017": "Wang He died.",
  "s0018": "In the tenth month, General Meng Ao attacked Chang and Yougui of Wei.",
  "s0019": "There was a great famine that year.",
  "s0020": "In the fourth year, they captured Chang and Yougui.",
  "s0021": "In the third month, the army disbanded.",
  "s0022": "The Qin hostage returned from Zhao, and the Zhao crown prince went out and returned to his state.",
  "s0023": "On the gengyin day of the tenth month, locusts came from the east and covered the sky.",
  "s0024": "There was plague throughout the land.",
  "s0025": "Commoners who contributed a thousand shi of grain were granted one rank of nobility.",
  "s0026": "In the fifth year, General Ao attacked Wei, pacified Suanzao, Yan, Xu, Changping, Yongqiu, and Shanyang, captured them all, and took twenty cities.",
  "s0027": "Dongjun Commandery was first established.",
  "s0028": "There was thunder in winter.",
  "s0029": "In the sixth year, Han, Wei, Zhao, Wei, and Chu jointly attacked Qin and took Shouling.",
  "s0030": "Qin deployed troops, and the five states' armies disbanded.",
  "s0031": "They captured Wei, pressed upon Dongjun; its lord Jiao led his kinsmen to relocate to Yewang, blocked off the mountains to protect Wei's Henei.",
  "s0032": "In the seventh year, a comet first appeared in the east, was seen in the north, and in the fifth month was seen in the west.",
  "s0033": "General Ao died.",
  "s0034": "Troops attacked Long, Gu, and Qingdu, then returned to attack Ji.",
  "s0035": "The comet appeared again in the west for sixteen days.",
  "s0036": "The Queen Dowager Xia died.",
  "s0037": "In the eighth year, the king's younger brother, Lord Chang'an Chengjiao, as general attacked Zhao, rebelled, and died at Tunliu; all military officers were beheaded and executed, and their people were relocated to Lintao.",
  "s0038": "General Bi died; the troops of Tunliu and Puhe rebelled; his corpse was mutilated.",
  "s0039": "River fish swarmed upstream; light chariots and heavy horses went east to find food.",
  "s0040": "Lao Ai was enfeoffed as Marquis Changxin.",
  "s0041": "He was given the lands of Shanyang, and Ai resided there.",
  "s0042": "Palaces, chariots, horses, clothing, parks, and hunting were all at Ai's disposal.",
  "s0043": "Matters great and small were all decided by Ai.",
  "s0044": "Moreover, Hexi and Taiyuan commanderies were made into the State of Ai.",
  "s0045": "In the ninth year, a comet appeared, some say across the entire sky.",
  "s0046": "They attacked Wei's Yuan and Puyang.",
  "s0047": "In the fourth month, the king stayed at Yong.",
  "s0048": "On the jiyou day, the king was capped and wore his sword.",
  "s0049": "Marquis Changxin Ai created disorder and was discovered; he forged the king's seal and the Queen Mother's seal to mobilize county troops, palace guards, official cavalry, Rong and Di nobles, and retainers, intending to attack Qinian Palace and create chaos.",
  "s0050": "The king learned of this and ordered Prime Minister Lord Changping and Lord Changwen to mobilize troops to attack Ai.",
  "s0051": "They fought at Xianyang, beheaded several hundred; all were granted ranks of nobility, and eunuchs who participated in the battle were also granted one rank of nobility.",
  "s0052": "Ai and his followers were defeated and fled.",
  "s0053": "An immediate decree was issued throughout the state: whoever captures Ai alive will receive a million cash;",
  "s0054": "whoever kills him, five hundred thousand.",
  "s0055": "They captured all of Ai's followers.",
  "s0056": "Guard Commander Jie, Palace Attendant Si, Assistant Yijie, Palace Gentleman Commander Qi, and twenty others all had their heads displayed.",
  "s0057": "They were torn apart by chariots as a warning, and their clans were exterminated.",
  "s0058": "As for his retainers, the lesser offenders were made to gather firewood for sacrifices.",
  "s0059": "More than four thousand families who were stripped of rank and relocated to Shu were settled at Fangling.",
  "s0060": "In that month there was severe cold and freezing; some died.",
  "s0061": "Yang Duanhe attacked Yanshi.",
  "s0062": "A comet appeared in the west and again in the north, extending south from the Dipper constellation for eighty days.",
  "s0063": "In the tenth year, Prime Minister Lü Buwei was dismissed for his connection with Lao Ai.",
  "s0064": "Huan He became general.",
  "s0065": "Qi and Zhao came to hold banquets.",
  "s0066": "Mao Jiao of Qi persuaded the King of Qin, saying: \"Qin is now concerned with all under Heaven, yet Your Majesty has the reputation of exiling his mother the Queen Mother; I fear the feudal lords will hear of this and thereby turn against Qin.\"",
  "s0067": "The King of Qin then welcomed the Queen Mother from Yong and brought her into Xianyang, and she again resided at Ganquan Palace.",
  "s0068": "There was a great search and expulsion of foreign guests; Li Si submitted a memorial in persuasion, and the expulsion order was then halted.",
  "s0069": "Li Si then persuaded the King of Qin to first take Han to intimidate the other states, so he sent Si to subdue Han.",
  "s0070": "The King of Han was troubled by this.",
  "s0071": "He plotted with Han Fei to weaken Qin.",
  "s0072": "Wei Liao from Daliang came and persuaded the King of Qin, saying: \"With Qin's strength, the feudal lords are like commandery and county lords; I only fear the feudal lords will form a vertical alliance and suddenly act unexpectedly; this is how Zhi Bo, Fuchai, and King Min came to perish.",
  "s0073": "I hope Your Majesty will not begrudge wealth and treasures; bribe their powerful ministers to disrupt their plans; spending no more than three hundred thousand gold, all the feudal lords can be eliminated.\"",
  "s0074": "The King of Qin followed his plan, treated Wei Liao with the highest courtesy, and shared clothing, food, and drink with Liao.",
  "s0075": "Liao said: \"The King of Qin is a person with a wasp-like nose, elongated eyes, a bird of prey's chest, a jackal's voice, little kindness and a tiger-wolf heart; when in difficulty he easily humbles himself before others, but when successful he easily devours people.",
  "s0076": "I am a commoner, yet when he sees me he personally humbles himself before me.",
  "s0077": "If truly the King of Qin achieves his ambitions over all under Heaven, all under Heaven will become slaves.",
  "s0078": "One cannot associate with him for long.\"",
  "s0079": "He then fled.",
  "s0080": "The King of Qin realized this, firmly detained him, made him National Commander of Qin, and in the end used his strategies.",
  "s0081": "And Li Si handled affairs.",
  "s0082": "In the eleventh year, Wang Jian, Huan He, and Yang Duanhe attacked Ye and took nine cities.",
  "s0083": "Wang Jian attacked Eyu and Laoyang, all combining into one army.",
  "s0084": "Jian commanded for eighteen days; the army returned; from dou-rank officials downward, two out of ten followed the army to take Ye and Anyang; Huan He commanded.",
  "s0085": "In the twelfth year, Marquis Wenxin Buwei died and was buried secretly.",
  "s0086": "Among his retainers, those who attended the funeral and were from Jin were expelled;",
  "s0087": "Qin people of six hundred shi rank and above were stripped of rank and exiled;",
  "s0088": "those of five hundred shi and below who did not attend the funeral were exiled but not stripped of rank.",
  "s0089": "From now on, those who handle state affairs improperly like Lao Ai and Buwei will have their households registered; observe this.",
  "s0090": "In autumn, the retainers of Lao Ai who had been exiled to Shu were pardoned.",
  "s0091": "At that time, there was a great drought throughout the land; from the sixth to the eighth month it finally rained.",
  "s0092": "In the thirteenth year, Huan He attacked Pingyang of Zhao, killed Zhao general Hu Zhe, and beheaded one hundred thousand.",
  "s0093": "The king went to Henan.",
  "s0094": "In the first month, a comet appeared in the east.",
  "s0095": "In the tenth month, Huan He attacked Zhao.",
  "s0096": "In the fourteenth year, they attacked Zhao's army at Pingyang, took Yi'an, defeated it, and killed its general.",
  "s0097": "Huan He pacified Pingyang and Wucheng.",
  "s0098": "Han Fei came as envoy to Qin; Qin used Li Si's plot, detained Fei, and Fei died at Yunyang.",
  "s0099": "The King of Han requested to become a vassal.",
  "s0100": "In the fifteenth year, they greatly mobilized troops: one army reached Ye, one army reached Taiyuan, and took Langmeng.",
  "s0101": "There was an earthquake.",
  "s0102": "In the sixteenth year, ninth month, they dispatched troops to receive the lands of Han's Nanyang under Acting Governor Teng.",
  "s0103": "For the first time, males were ordered to register their age.",
  "s0104": "Wei offered territory to Qin.",
  "s0105": "Qin established Liyi.",
  "s0106": "In the seventeenth year, Palace Attendant Teng attacked Han, captured King An of Han, completely absorbed his territory, made it a commandery, and named it Yingchuan.",
  "s0107": "There was an earthquake.",
  "s0108": "Queen Dowager Huayang died.",
  "s0109": "The people suffered great famine.",
  "s0110": "In the eighteenth year, they greatly mobilized troops to attack Zhao: Wang Jian commanded the Upper Lands and descended through Jingxing; Duanhe commanded Henei; Qiang Hui attacked Zhao; Duanhe besieged the city of Handan.",
  "s0111": "In the nineteenth year, Wang Jian and Qiang Hui completely pacified and took Zhao's territory of Dongyang and captured the King of Zhao.",
  "s0112": "They led troops intending to attack Yan and garrisoned at Zhongshan.",
  "s0113": "When the King of Qin went to Handan, all those who had feuds or grievances with the king's maternal family from when he was born in Zhao were buried alive.",
  "s0114": "The King of Qin returned, passing through Taiyuan and Shangjun.",
  "s0115": "The First Emperor's mother, the Queen Mother, died.",
  "s0116": "Prince Jia of Zhao led several hundred of his clansmen to Dai, proclaimed himself King of Dai, joined forces with Yan to the east, and stationed his army at Shanggu.",
  "s0117": "There was great famine.",
  "s0118": "In the twentieth year, Crown Prince Dan of Yan was troubled that Qin troops were coming to his state; afraid, he sent Jing Ke to assassinate the King of Qin.",
  "s0119": "The King of Qin discovered this, had Ke dismembered as a warning, and sent Wang Jian and Xin Sheng to attack Yan.",
  "s0120": "Yan and Dai mobilized troops to strike the Qin army; the Qin army defeated Yan west of the Yi River.",
  "s0121": "In the twenty-first year, Wang Ben attacked Jing.",
  "s0122": "They further dispatched troops to Wang Jian's army, then defeated the Yan crown prince's army, took the Yan capital Ji, and obtained Crown Prince Dan's head.",
  "s0123": "The King of Yan went east to gather Liaodong and ruled it.",
  "s0124": "Wang Jian pleaded illness and old age and returned home.",
  "s0125": "Xinzheng rebelled.",
  "s0126": "Lord Changping was exiled to Ying.",
  "s0127": "There was heavy snow, two and a half feet deep.",
  "s0128": "In the twenty-second year, Wang Ben attacked Wei, diverted river channels to flood Daliang; the city of Daliang collapsed, its king requested surrender, and all its territory was taken.",
  "s0129": "In the twenty-third year, the King of Qin again summoned Wang Jian, forcibly roused him, and sent him to command the attack on Jing.",
  "s0130": "He took territory from Chen south to Pingyu and captured the King of Jing.",
  "s0131": "The King of Qin traveled to Ying and Chen.",
  "s0132": "General Xiang Yan of Jing installed Lord Changping as King of Jing and rebelled against Qin in Huainan.",
  "s0133": "In the twenty-fourth year, Wang Jian and Meng Wu attacked Jing, defeated Jing's army; Lord Changping died, and Xiang Yan then committed suicide.",
  "s0134": "In the twenty-fifth year, they greatly mobilized troops and sent Wang Ben to command the attack on Yan's Liaodong, capturing King Xi of Yan.",
  "s0135": "Returning, they attacked Dai and captured King Jia of Dai.",
  "s0136": "Wang Jian then pacified the lands south of the Yangtze in Jing;",
  "s0137": "he accepted the surrender of the lord of Yue and established Kuaiji Commandery.",
  "s0138": "In the fifth month, there was a great celebration throughout the land.",
  "s0139": "In the twenty-sixth year, King Jian of Qi with his prime minister Hou Sheng mobilized troops to defend the western border and cut off communication with Qin.",
  "s0140": "Qin sent General Wang Ben to attack Qi from south of Yan and captured King Jian of Qi.",
  "s0141": "When the King of Qin first unified all under Heaven, he ordered the prime minister and Imperial Secretary: \"In the past, the King of Han surrendered territory and presented his seals, requesting to be a vassal state, but then broke the agreement and joined with Zhao and Wei in a vertical alliance to rebel against Qin; therefore we raised troops to punish him and captured their king.",
  "s0142": "I considered this good, hoping to end military campaigns.",
  "s0143": "The King of Zhao sent his prime minister Li Mu to make a treaty, so we returned their hostage.",
  "s0144": "But then they broke the treaty and took back our Taiyuan; therefore we raised troops to punish them and captured their king.",
  "s0145": "Prince Jia of Zhao then proclaimed himself King of Dai, so we raised troops to attack and destroy him.",
  "s0146": "The King of Wei first agreed to submit and enter Qin, but then plotted with Han and Zhao to attack Qin; our officers and troops punished them and defeated them.",
  "s0147": "The King of Jing offered territory west of Qingyang, but then broke the agreement and attacked our Nan Commandery; therefore we mobilized troops to punish him, captured their king, and pacified their lands of Jing.",
  "s0148": "The King of Yan was confused and chaotic; his crown prince Dan then secretly ordered Jing Ke to commit treachery; our officers and troops punished them and destroyed their state.",
  "s0149": "The King of Qi used Hou Sheng's plan, cut off Qin envoys, and intended to create disorder; our officers and troops punished them, captured their king, and pacified Qi's territory.",
  "s0150": "I, with my humble person, raised troops to punish violent chaos, and relying on the spirits of the ancestral temples, the six kings all received their due punishment, and all under Heaven is greatly pacified.",
  "s0151": "Now if the title and name are not changed, there will be no way to proclaim the accomplishment and transmit it to later generations.",
  "s0152": "Discuss the imperial title.\"",
  "s0153": "Prime Minister Wan, Grand Censor Jie, Commandant of Justice Si and others all said: \"In ancient times the Five Emperors' territory was a thousand li square; beyond it were the hou and yi service zones where feudal lords sometimes came to court and sometimes did not, and the Son of Heaven could not control them.",
  "s0154": "Now Your Majesty has raised righteous troops, punished cruel rebels, pacified all under Heaven; all within the seas has become commanderies and counties, laws and decrees are unified under one authority; from high antiquity this has never occurred, beyond what the Five Emperors achieved.",
  "s0155": "We your ministers carefully deliberated with the scholars and said: 'In ancient times there was the Tianhuang, the Dihuang, and the Taihuang; the Taihuang was most noble.'",
  "s0156": "We your ministers at risk of death present the honored title: that the king be called 'Taihuang.'",
  "s0157": "Commands shall be called 'zhi,' decrees shall be called 'zhao,' and the Son of Heaven shall refer to himself as 'zhen.'\"",
  "s0158": "The king said: \"Remove 'Tai,' retain 'Huang,' and adopt the ancient title 'Di,' to be called 'Huangdi' (Emperor).",
  "s0159": "For other matters, proceed as discussed.\"",
  "s0160": "The decree said: \"Approved.\"",
  "s0161": "He posthumously honored King Zhuangxiang as the Grand Supreme Sovereign.",
  "s0162": "The decree said: \"I have heard that in high antiquity there were titles but no posthumous names; in middle antiquity there were titles, and upon death posthumous names were given based on their conduct.",
  "s0163": "If this is so, then sons judge fathers and ministers judge lords, which is utterly meaningless; I will not adopt this.",
  "s0164": "From now on, abolish the system of posthumous names.",
  "s0165": "I am the First Emperor.",
  "s0166": "Later generations shall be counted numerically: Second Generation, Third Generation, up to ten thousand generations, transmitted without end.\"",
  "s0167": "",
  "s0168": "The First Emperor, reasoning through the transmission of the Five Virtues from beginning to end, considered that Zhou possessed the virtue of Fire, and since Qin replaced Zhou's virtue, it followed what it did not conquer.",
  "s0169": "Now at the beginning of the Water virtue, the year's beginning was changed; court audiences and congratulations all began from the first day of the tenth month.",
  "s0170": "Clothing, banners, tallies, and flags were all black.",
  "s0171": "Numbers used six as the base: tallies and official caps were all six inches, carriages were six feet, six feet made one pace, and they rode six horses.",
  "s0172": "The Yellow River was renamed De River, marking the beginning of the Water virtue.",
  "s0173": "Firm, resolute, stern, and profound, all matters were decided by law, severe and without benevolence, kindness, harmony, or righteousness, only then matching the number of the Five Virtues.",
  "s0174": "Thereupon laws became harsh, and those imprisoned long were not pardoned.",
  "s0175": "Prime Minister Wan and others said: \"The feudal lords have just been defeated; Yan, Qi, and Jing are distant; if we do not establish kings, there will be no one to pacify them.",
  "s0176": "We request to install princes; may Your Majesty graciously approve.\"",
  "s0177": "The First Emperor submitted this proposal to the assembled ministers; all the ministers considered it expedient.",
  "s0178": "Commandant of Justice Li Si argued: \"The sons, younger brothers, and clansmen enfeoffed by Kings Wen and Wu of Zhou were very numerous, but later when relations became distant, they attacked each other like enemies; feudal lords mutually attacked and killed each other, and the Son of Heaven of Zhou could not prohibit or stop it.",
  "s0179": "Now all within the seas, relying on Your Majesty's divine power, is unified as commanderies and counties; princes and meritorious officials are abundantly rewarded with tax revenues; this is very easy to control.",
  "s0180": "When all under Heaven has no divergent intentions, this is the technique of peace and tranquility.",
  "s0181": "Establishing feudal lords is not expedient.\"",
  "s0182": "The First Emperor said: \"All under Heaven suffered bitterly from incessant warfare because of the existence of lords and kings.",
  "s0183": "Relying on the ancestral temples, all under Heaven has just been pacified; if we again establish states, this is planting the seeds of war; to seek peace and tranquility would be truly difficult!",
  "s0184": "The Commandant of Justice's argument is correct.\"",
  "s0185": "",
  "s0186": "He divided all under Heaven into thirty-six commanderies; each commandery had a governor, military commander, and supervisor.",
  "s0187": "The people were renamed 'Qianshou' (Black-headed ones).",
  "s0188": "There was a great celebration.",
  "s0189": "He collected all weapons from throughout the land, gathered them at Xianyang, melted them to make bells, bell stands, and twelve metal statues, each weighing a thousand shi, and placed them in the palace courtyard.",
  "s0190": "He unified laws, regulations, weights, and measures.",
  "s0191": "Chariots had uniform axle widths.",
  "s0192": "Writing used uniform characters.",
  "s0193": "Territory extended east to the sea and Chaoxian, west to Lintao and the Qiang region, south to Beixianghu, north occupying the Yellow River as a barrier, and along the Yin Mountains to Liaodong.",
  "s0194": "He relocated the wealthy and powerful families from throughout the land to Xianyang—one hundred twenty thousand households.",
  "s0195": "All the ancestral temples, Zhangtai, and Shanglinyuan were south of the Wei River.",
  "s0196": "Every time Qin defeated a feudal state, it replicated their palaces and built them on the northern slopes above Xianyang, south facing the Wei River, from Yongmen eastward to the Jing and Wei rivers; palace buildings with elevated passages and encircling galleries were all connected.",
  "s0197": "Beautiful women, bells, and drums obtained from the feudal lords were all brought in to fill them.",
  "s0198": "In the twenty-seventh year, the First Emperor toured Longxi and Beidi, went out through Jitou Mountain, and passed through Huizhong.",
  "s0199": "There he built Xin Palace south of the Wei River, then renamed Xin Palace as Ji Temple, symbolizing the celestial pole.",
  "s0200": "From Ji Temple a road led directly to Lishan, and he built the front hall of Ganquan.",
  "s0201": "He built a walled roadway connecting it from Xianyang.",
  "s0202": "That year, one rank of nobility was granted.",
  "s0203": "Imperial highways were constructed.",
  "s0204": "In the twenty-eighth year, the First Emperor traveled east through the commanderies and counties and ascended Mount Zouyi.",
  "s0205": "He erected a stone monument and, debating with Confucian scholars from Lu, had inscriptions carved on stone praising Qin's virtue, discussing the feng and shan sacrifices and the worship of mountains and rivers.",
  "s0206": "He then ascended Mount Tai, erected a stone monument, performed the feng sacrifice, and made offerings.",
  "s0207": "On the descent, wind and rain suddenly arrived; he took shelter under a tree, and thereupon enfeoffed that tree as one of the Five Great Officials.",
  "s0208": "He performed the shan sacrifice at Liangfu.",
  "s0209": "On the erected stone monument, the inscription read:",
  "s0210": "The Emperor ascended the throne, created systems and clarified laws; his ministers were cultivated and orderly.",
  "s0211": "In the twenty-sixth year, he first unified all under Heaven, and none were not submissive.",
  "s0212": "He personally toured the distant regions and the common people, ascended this Mount Tai, and surveyed the eastern extremity.",
  "s0213": "His attending ministers reflected on the traces, traced the origins of his achievements, and respectfully recited his merits and virtue.",
  "s0214": "Governance functioned smoothly, all products were properly suited, all had regulations.",
  "s0215": "Great righteousness shone brightly, passed down to later generations; they should obediently follow and not change it.",
  "s0216": "The Emperor personally is sage; having pacified all under Heaven, he does not slacken in governance.",
  "s0217": "Rising early and sleeping late, he establishes lasting benefits and exclusively promotes education.",
  "s0218": "Teachings and classics are proclaimed and disseminated; far and near all are well governed, all upholding the sage's will.",
  "s0219": "Noble and base are clearly distinguished, male and female follow propriety; they carefully follow their duties.",
  "s0220": "Inside and outside are clearly separated, none are not pure and clean; this is applied to later descendants.",
  "s0221": "Transformation extends endlessly; they obey and follow the last instructions, forever upholding the weighty admonitions.",
  "s0222": "Then he annexed the area east of the Bohai Sea, passed through Huang and Zhi, reached the end of Mount Cheng, ascended Mount Zhifu, erected stone monuments praising Qin's virtue, and departed.",
  "s0223": "He ascended Langye to the south and greatly enjoyed it, staying for three months.",
  "s0224": "He then relocated thirty thousand households of commoners to below Langye Terrace, exempting them from taxes for twelve years.",
  "s0225": "He built Langye Terrace, erected stone inscriptions praising Qin's virtue and making his intentions clear.",
  "s0226": "It said:",
  "s0227": "In the twenty-eighth year, the Emperor commenced.",
  "s0228": "He rectified laws and regulations, the framework of all things.",
  "s0229": "To clarify human affairs and harmonize fathers and sons.",
  "s0230": "Sagely wisdom, benevolence, and righteousness clearly manifested the principles.",
  "s0231": "He pacified the eastern lands to inspect officers and troops.",
  "s0232": "Affairs having been greatly completed, he came to the sea.",
  "s0233": "The Emperor's achievement: encouraging and laboring at fundamental affairs.",
  "s0234": "Promoting agriculture and eliminating secondary occupations, enriching the black-headed people.",
  "s0235": "Throughout all under Heaven, hearts united and wills aligned.",
  "s0236": "Implements and measures were unified, writing and characters the same.",
  "s0237": "Wherever sun and moon shine, wherever boats and carriages reach.",
  "s0238": "All complete their lives, none fail to achieve satisfaction.",
  "s0239": "Acting in accordance with the times, this is the Emperor.",
  "s0240": "Correcting and regulating different customs, traversing waters and surveying lands.",
  "s0241": "Caring for the black-headed people, morning and evening without slackening.",
  "s0242": "Eliminating doubt and establishing laws, all know what to avoid.",
  "s0243": "Regional lords divide duties, all governance easy and orderly.",
  "s0244": "All actions necessarily appropriate, none not as planned.",
  "s0245": "The Emperor's brilliance surveys and observes the four directions.",
  "s0246": "Noble and base, honored and lowly, do not exceed their proper order.",
  "s0247": "None in Langye are negligent; all are devoted to integrity and goodness.",
  "s0248": "Small and great all exert themselves, none dare be idle or negligent.",
  "s0249": "Far and near, retired and hidden, all are exclusively devoted to solemnity and dignity.",
  "s0250": "Upright, direct, sincere, and loyal; affairs have constancy.",
  "s0251": "The Emperor's virtue stabilizes the four poles.",
  "s0252": "Punishing disorder and eliminating harm, promoting benefit and bringing fortune.",
  "s0253": "Managing affairs according to the seasons, all products multiply.",
  "s0254": "The black-headed people are peaceful and tranquil, not using weapons of war.",
  "s0255": "The six relations mutually protect each other; in the end there are no bandits or thieves.",
  "s0256": "Joyfully accepting teachings, thoroughly knowing laws and regulations.",
  "s0257": "Within the six directions is the Emperor's territory.",
  "s0258": "West crossing the flowing sands, south reaching Beixianghu.",
  "s0259": "East possessing the Eastern Sea, north passing the Great Xia.",
  "s0260": "Wherever human traces reach, none are not subjects.",
  "s0261": "His achievements surpass the Five Emperors, his beneficence extends even to oxen and horses.",
  "s0262": "None do not receive his virtue; each is secure in their dwelling.",
  "s0263": "When the King of Qin unified all under Heaven, he established the title of Emperor, then pacified the eastern lands, reaching Langye.",
  "s0264": "Ranked marquis Lord Wucheng Wang Li, ranked marquis Lord Tongwu Wang Ben, marquis Lord Jiancheng Zhao Hai, marquis Lord Changwu Cheng, marquis Lord Wuxin Feng Wuze, Prime Minister Wei Lin, Prime Minister Wang Wan, Minister Li Si, Minister Wang Wu, Grand Master Zhao Ying, Grand Master Yang Jiu accompanied him and deliberated at the sea.",
  "s0265": "They said: \"Ancient emperors had territories no more than a thousand li; feudal lords each guarded their territories, sometimes coming to court and sometimes not, mutually invading and creating violent disorder, attacking and killing without end, yet still carved in metal and stone to make their own records.",
  "s0266": "The ancient Five Emperors and Three Kings had different teachings, laws and regulations were unclear, falsely invoking the authority of ghosts and spirits to deceive distant regions; reality did not match reputation, so they did not last long.",
  "s0267": "Before their deaths, feudal lords already turned and rebelled, and laws and decrees did not function.",
  "s0268": "Now the Emperor has unified all within the seas as commanderies and counties; all under Heaven is harmonious and peaceful.",
  "s0269": "Brightly illuminating the ancestral temples, embodying the Way and practicing virtue, his honored title is greatly perfected.",
  "s0270": "The assembled ministers together recite the Emperor's achievements and virtue, carve them in metal and stone, to serve as a lasting standard.\"",
  "s0271": "\"",
  "s0272": "Having finished, Xu Shi of Qi and others submitted a memorial saying that in the sea there were three divine mountains named Penglai, Fangzhang, and Yingzhou, where immortals dwelt.",
  "s0273": "They requested to fast and purify themselves and take boys and girls to seek them.",
  "s0274": "Thereupon he sent Xu Shi with several thousand boys and girls to enter the sea to seek the immortals.",
  "s0275": "The First Emperor returned, passed through Pengcheng, fasted and purified himself, prayed and made offerings, wishing to bring forth the Zhou tripod from the Si River.",
  "s0276": "He sent a thousand people to dive underwater seeking it, but they did not find it.",
  "s0277": "He then crossed the Huai River to the southwest, going to Mount Heng and Nan Commandery.",
  "s0278": "Floating on the Yangtze, he reached the Xiang Mountain shrine.",
  "s0279": "He encountered a great wind and nearly could not cross.",
  "s0280": "The emperor asked the scholars: \"Is the Spirit of the Xiang River divine?\"",
  "s0281": "The scholars replied: \"We have heard she was Yao's daughter, Shun's wife, and was buried here.\"",
  "s0282": "Thereupon the First Emperor became greatly angered, sent three thousand convicts to cut down all the trees on Mount Xiang, making the mountain bare and red.",
  "s0283": "The emperor returned from Nan Commandery through Wuguan.",
  "s0284": "In the twenty-ninth year, the First Emperor traveled east.",
  "s0285": "At Yangwu in the Bolang sands, he was startled by bandits.",
  "s0286": "They searched but did not find them, so he ordered a great manhunt throughout the land for ten days.",
  "s0287": "He ascended Mount Zhifu and had inscriptions carved on stone.",
  "s0288": "The inscription read:",
  "s0289": "In the twenty-ninth year, in mid-spring, when yang harmony was arising.",
  "s0290": "The Emperor traveled east, toured and ascended Mount Zhifu, gazed upon the sea.",
  "s0291": "His attending ministers admiringly observed, reflected on his splendid achievements, and recited his original beginnings.",
  "s0292": "The Great Sage created governance, established fixed laws and regulations, and clearly displayed the fundamental principles.",
  "s0293": "Externally he taught the feudal lords, widely spreading civil beneficence, making clear righteousness and principles.",
  "s0294": "The six states were devious and evil, greedy and cruel without limit, killing violently without end.",
  "s0295": "The Emperor pitied the masses, thereupon mobilized punitive armies, raising martial virtue.",
  "s0296": "Righteous punishment was trustworthy in execution, his awesome power reached all around, none were not submissive.",
  "s0297": "He boiled and destroyed the strong and violent, rescued and saved the black-headed people, and settled the four extremities.",
  "s0298": "He universally applied clear laws, organized all under Heaven, forever to serve as a model.",
  "s0299": "How great it is!",
  "s0300": "Within the domains and counties, all obey the sage's will.",
  "s0301": "The assembled ministers recite his achievements and request to carve them on stone, to display them as a permanent standard.",
  "s0302": "The eastern inscription said: In the twenty-ninth year, the Emperor made a spring tour, surveying and inspecting distant regions.",
  "s0303": "Reaching the sea's edge, he then ascended Mount Zhifu, brightly facing the morning sun.",
  "s0304": "Observing the vast magnificence, all attending ministers reflected, wishing that the Way would become most brilliant.",
  "s0305": "The sage laws were first established, purifying and governing within the borders, externally punishing the violent and strong.",
  "s0306": "Martial might spread all around, shook the four extremities, and captured and destroyed the six kings.",
  "s0307": "He unified all under Heaven; disasters and harm were completely ended, forever putting down weapons of war.",
  "s0308": "The Emperor's brilliant virtue governs and orders all within the universe; his seeing and hearing do not slacken.",
  "s0309": "He created and established great righteousness, clearly set up complete implements, all have banners and standards.",
  "s0310": "Official ministers follow their divisions, each knowing what to do; affairs have no suspicion or doubt.",
  "s0311": "The black-headed people have been transformed; far and near share the same standards, approaching antiquity without parallel.",
  "s0312": "Regular duties already established, later generations follow the enterprise, long upholding sage governance.",
  "s0313": "The assembled ministers praise his virtue, respectfully recite his sage achievements, and request to carve them at Zhifu.",
  "s0314": "Returning, he then went to Langye, entering by way of Shangdang.",
  "s0315": "In the thirtieth year, there were no events.",
  "s0316": "In the thirty-first year, twelfth month, the winter sacrifice was renamed 'Jiaping.'",
  "s0317": "He bestowed upon the black-headed people six shi of rice and two sheep per village.",
  "s0318": "The First Emperor traveled incognito through Xianyang with four warriors; going out at night they encountered bandits at Lanchi and were in danger; the warriors struck and killed the bandits; a great manhunt was conducted in the Guanzhong region for twenty days.",
  "s0319": "Rice cost sixteen hundred per shi.",
  "s0320": "In the thirty-second year, the First Emperor went to Jieshi and sent the Yan man Lu Sheng to seek Xianmen and Gao Shi.",
  "s0321": "He had inscriptions carved on Jieshi Gate.",
  "s0322": "He demolished city walls and opened dikes and dams.",
  "s0323": "The inscription read:",
  "s0324": "Thereupon he raised armies and executed the lawless; rebellions were extinguished.",
  "s0325": "Militarily he annihilated violent rebels; civilly he restored the innocent; the hearts of the masses all submitted.",
  "s0326": "He benevolently evaluated achievements and service; rewards extended even to oxen and horses; his kindness enriched the land.",
  "s0327": "The Emperor exerted his might, unified the feudal lords' virtue, and first achieved great peace.",
  "s0328": "He demolished city walls, opened river dams, and leveled dangerous obstacles.",
  "s0329": "The geographic situation having been established, the black-headed people had no corvée labor; all under Heaven was pacified.",
  "s0330": "Men delighted in their fields, women cultivated their work; affairs each had their order.",
  "s0331": "Beneficence spread to all products; long united they came to till fields; none were not secure in their places.",
  "s0332": "The assembled ministers recite his achievements and request to carve this stone, to display the model and standard.",
  "s0333": "He then sent Han Zhong, Hou Gong, and Shi Sheng to seek immortals and the medicine of immortality.",
  "s0334": "The First Emperor toured the northern border and entered from Shangjun.",
  "s0335": "Lu Sheng of Yan, sent to enter the sea, returned with matters concerning ghosts and spirits; he then presented a book of charts saying 'Qin will be destroyed by Hu.'",
  "s0336": "The First Emperor thereupon sent General Meng Tian to mobilize three hundred thousand troops northward to attack the Hu, seizing the lands south of the Yellow River.",
  "s0337": "In the thirty-third year, he mobilized fugitives, superfluous sons-in-law, and merchants to seize the lands of Luliang, establishing Guilin, Xiang, and Nanhai commanderies, and sent convicts to garrison them.",
  "s0338": "To the northwest he drove out the Xiongnu.",
  "s0339": "From Yuzhong along the Yellow River eastward, he connected it to the Yin Mountains, establishing thirty-four counties and building fortifications along the river as barriers.",
  "s0340": "He also sent Meng Tian to cross the Yellow River to take Banque, Yang Mountain, and Beijia, constructing watchtowers and barriers to drive out the Rong people.",
  "s0341": "He exiled convicts to populate the new counties.",
  "s0342": "Sacrifices were prohibited.",
  "s0343": "A bright star appeared in the west.",
  "s0344": "In the thirty-fourth year, he sent judicial officials who were not upright to build the Great Wall and in the lands of Southern Yue.",
  "s0345": "The First Emperor held a banquet at Xianyang Palace; seventy scholars came forward to offer congratulations.",
  "s0346": "Chief Clerk Zhou Qingchen came forward with a eulogy saying: \"In former times Qin's territory was no more than a thousand li; relying on Your Majesty's divine spiritual brilliance and sagacity, you pacified all within the seas, expelled barbarians; wherever sun and moon shine, none are not submissive.",
  "s0347": "Making the feudal states into commanderies and counties, people all feel secure and happy, without the troubles of warfare, to be transmitted for ten thousand generations.",
  "s0348": "From high antiquity none match Your Majesty's awesome virtue.\"",
  "s0349": "The First Emperor was pleased.",
  "s0350": "Scholar Chunyu Yue of Qi came forward and said: \"I have heard that the kings of Yin and Zhou reigned for over a thousand years, enfeoffing sons, younger brothers, and meritorious officials to serve as their branches and supports.",
  "s0351": "Now Your Majesty possesses all within the seas, yet your sons and younger brothers are commoners; if suddenly there arise ministers like Tian Chang or the Six Ministers, without support and assistance, how will they rescue each other?",
  "s0352": "That affairs not modeled on antiquity can last long is not what I have heard.",
  "s0353": "Now Qingchen also flatters you to your face to compound Your Majesty's errors; he is not a loyal minister.\"",
  "s0354": "The First Emperor submitted this proposal for discussion.",
  "s0355": "Prime Minister Li Si said: \"The Five Emperors did not repeat each other, the Three Dynasties did not follow each other's practices; each governed, not that they contradicted each other, but that times changed and differed.",
  "s0356": "Now Your Majesty has created a great enterprise, established achievements for ten thousand generations; this is certainly not what foolish Confucians can understand.",
  "s0357": "Moreover, Yue speaks only of the affairs of the Three Dynasties; what is worth modeling?",
  "s0358": "In former times when feudal lords competed, they generously recruited traveling scholars.",
  "s0359": "Now all under Heaven is already settled, laws and decrees issue from one source; commoners at home should devote themselves to agriculture and industry, scholars should study laws, decrees, prohibitions, and taboos.",
  "s0360": "Now various scholars do not study the present but study the past, using it to criticize the current age and confuse the black-headed people.",
  "s0361": "Prime Minister and your servant Si at risk of death says: In ancient times all under Heaven was scattered and chaotic, none could unify it; therefore feudal lords all acted, their discourse all spoke of antiquity to harm the present, adorned empty words to confuse reality; people praised their own private learning to criticize what the superior had established.",
  "s0362": "Now the Emperor possesses all under Heaven, distinguishes black from white, and establishes one supreme authority.",
  "s0363": "Those who privately study and together criticize the laws and teachings—when people hear decrees issued, each discusses them according to their own learning; entering they mentally oppose it, going out they discuss it in the alleys, boasting before their lord to make a name, taking different positions to seem superior, leading the masses to create slander.",
  "s0364": "If this is not prohibited, then the lord's power declines above and factions form below.",
  "s0365": "Prohibiting it is expedient.",
  "s0366": "Your servant requests that all historical records not of Qin be burned.",
  "s0367": "Except for what the scholars' office is responsible for, if anyone throughout the land dares to possess the Odes, the Documents, or the writings of the hundred schools, they should all be brought to the governor and commandant to be burned together.",
  "s0368": "Those who dare to discuss the Odes or Documents together will be executed in the marketplace.",
  "s0369": "Those who use antiquity to criticize the present will have their entire clans exterminated.",
  "s0370": "Officials who see and know but do not report will be punished with the same crime.",
  "s0371": "If the decree is issued and after thirty days they have not burned them, they will be tattooed and made to serve as watchmen.",
  "s0372": "What will not be eliminated are books on medicine, divination, and agriculture.",
  "s0373": "If anyone wishes to study laws and decrees, they should take officials as their teachers.\"",
  "s0374": "The decree said: \"Approved.\"",
  "s0375": "\"",
  "s0376": "In the thirty-fifth year, roads were cleared; the road from Jiuyuan to Yunyang, cutting through mountains and filling valleys, went straight through.",
  "s0377": "Thereupon the First Emperor considered that Xianyang had too many people and that the former kings' palaces were too small; he had heard that King Wen of Zhou had his capital at Feng and King Wu at Hao; between Feng and Hao was the imperial capital.",
  "s0378": "He then planned to build a palace court south of the Wei River in Shanglinyuan.",
  "s0379": "First he built the front hall of Epang: five hundred bu from east to west, fifty zhang from south to north; above it could seat ten thousand people, below it could erect fifty-zhang flags.",
  "s0380": "Elevated gallery roads circled around; from the hall they went straight down to South Mountain.",
  "s0381": "The peak of South Mountain was marked as the gate tower.",
  "s0382": "An elevated roadway was built from Epang Palace crossing the Wei River, connecting it to Xianyang, symbolizing how the celestial pole's elevated road crosses the Milky Way to reach the Hall of Encampment.",
  "s0383": "Epang Palace was not completed;",
  "s0384": "when completed, they wanted to select an auspicious name to name it.",
  "s0385": "Because the palace was built at Epang, all under Heaven called it Epang Palace.",
  "s0386": "Over seven hundred thousand palace workers and convicts were divided to work on Epang Palace or on Lishan.",
  "s0387": "Stone coffins were quarried from North Mountain, and timber from Shu and Jing was all transported there.",
  "s0388": "Within the passes there were three hundred palaces, outside the passes over four hundred.",
  "s0389": "Thereupon a stone monument was erected at the eastern sea in Qu border territory, marking it as Qin's Eastern Gate.",
  "s0390": "He then relocated thirty thousand households to Liyi and fifty thousand households to Yunyang, all exempted from corvée for ten years.",
  "s0391": "Lu Sheng persuaded the First Emperor, saying: \"We your servants and others seeking magic mushrooms, rare medicines, and immortals have constantly not encountered them; it seems there are things that harm this.",
  "s0392": "According to the methods, the lord of men should sometimes travel incognito to avoid evil spirits; when evil spirits are avoided, the true person will come.",
  "s0393": "If the lord of men resides somewhere and his ministers know of it, this harms the spirits.",
  "s0394": "A true person enters water without getting wet, enters fire without burning, rides cloud qi, and lives as long as Heaven and Earth.",
  "s0395": "Now the superior governs all under Heaven but has not yet achieved tranquility.",
  "s0396": "I hope the superior's residences are not made known to people; only then can the medicine of immortality probably be obtained.\"",
  "s0397": "Thereupon the First Emperor said: \"I admire the true person; I shall call myself 'true person,' not 'zhen.'\"",
  "s0398": "He then ordered that within two hundred li around Xianyang, two hundred seventy palaces and observation towers be connected by elevated roadways and walled passages; curtains, bells, drums, and beautiful women filled them, each assigned by register and not moved.",
  "s0399": "Wherever he traveled and stayed, anyone who spoke of his location was punished by death.",
  "s0400": "The First Emperor visited Liangshan Palace; from the mountain he saw the prime minister's chariots and cavalry entourage and was displeased.",
  "s0401": "Someone among the palace attendants informed the prime minister, and the prime minister later reduced his chariots and cavalry.",
  "s0402": "The First Emperor was angry and said: \"Someone among the palace attendants leaked my words.\"",
  "s0403": "He investigated and questioned them, but none confessed.",
  "s0404": "At that time, he decreed the arrest of all those who were nearby at the time, and they were all killed.",
  "s0405": "From then on, no one knew where he traveled.",
  "s0406": "When he attended to affairs, the assembled ministers received decisions on matters all at Xianyang Palace.",
  "s0407": "Hou Sheng and Lu Sheng plotted together, saying: \"The First Emperor is by nature rigid, cruel, and self-willed; rising from among the feudal lords and unifying all under Heaven, his will satisfied and desires fulfilled, he considers that from ancient times none equal him.",
  "s0408": "He exclusively employs judicial officials, and judicial officials obtain favor and privilege.",
  "s0409": "Although there are seventy scholars, they merely fill positions and are not employed.",
  "s0410": "The prime minister and all great ministers merely receive accomplished tasks and depend on decisions from above.",
  "s0411": "The superior delights in using punishment and execution as authority; all under Heaven fear punishment and cling to their salaries; none dare exhaust their loyalty.",
  "s0412": "The superior does not hear of faults and daily becomes more arrogant; below they cower in submission and deceive to gain favor.",
  "s0413": "By Qin law, if one practices multiple methods that are not verified, one is immediately executed.",
  "s0414": "Yet those who observe stars and qi number up to three hundred, all excellent men; fearing taboos they flatter, not daring to directly speak of his faults.",
  "s0415": "All affairs of the land, great and small, are all decided by the superior; the superior even weighs documents by the shi; day and night there are quotas; if the quota is not met he cannot rest.",
  "s0416": "His greed for power and authority is like this; he cannot be approached to seek the medicine of immortality.\"",
  "s0417": "Thereupon they fled.",
  "s0418": "When the First Emperor heard of their flight, he became greatly angry and said: \"I previously collected books from all under Heaven that were useless and eliminated them all.",
  "s0419": "I summoned literary scholars and practitioners of methods in great numbers, wishing to promote great peace; the practitioners of methods wished to refine themselves to seek rare medicines.",
  "s0420": "Now I hear that Han Zhong has left without reporting; Xu Shi and others have spent enormous amounts, yet have never obtained the medicine; they only practice deception for profit, reporting to each other daily.",
  "s0421": "I honored and bestowed upon Lu Sheng and others very generously, yet now they slander me, compounding my lack of virtue.",
  "s0422": "As for the scholars in Xianyang, I sent people to investigate; some spread false words to confuse the black-headed people.\"",
  "s0423": "Thereupon he sent the censors to thoroughly investigate all the scholars; the scholars implicated each other; he then personally eliminated over four hundred sixty who violated prohibitions, buried them all alive at Xianyang, and made all under Heaven know of it, to warn those after.",
  "s0424": "He increased the dispatch of exiled convicts to the borders.",
  "s0425": "The First Emperor's eldest son Fusu remonstrated, saying: \"All under Heaven has just been pacified; the black-headed people in distant regions have not yet been unified; all the scholars recite the methods of Confucius; now if the superior uses heavy punishments to bind them all, I fear all under Heaven will not be peaceful.",
  "s0426": "I hope the superior will examine this.\"",
  "s0427": "The First Emperor was angry and sent Fusu north to oversee Meng Tian at Shangjun.",
  "s0428": "In the thirty-sixth year, Mars remained in the Heart constellation.",
  "s0429": "A meteorite fell in Dongjun; when it reached the ground and became stone, some among the black-headed people carved on the stone: 'The First Emperor will die and the land will be divided.'",
  "s0430": "When the First Emperor heard of this, he sent censors to pursue and question them; none confessed, so he seized all the residents near the stone and executed them, then burned and melted the stone.",
  "s0431": "The First Emperor was displeased; he had scholars compose poems about immortals and true persons, and as he traveled throughout the land, had musicians sing and play them.",
  "s0432": "In autumn, an envoy from east of the passes at night passed through Huayin on the Pingshu road; someone holding a jade disk blocked the envoy and said: \"Give this to the Lord of Haochi for me.\"",
  "s0433": "He then said: \"This year the ancestral dragon will die.\"",
  "s0434": "The envoy asked why, but the person suddenly disappeared, leaving the jade disk.",
  "s0435": "The envoy presented the jade disk and reported everything he had heard.",
  "s0436": "The First Emperor was silent for a long while, then said: \"Mountain spirits can only know one year's events.\"",
  "s0437": "Withdrawing he said: \"The ancestral dragon refers to the ancestor of men.\"",
  "s0438": "He had the imperial treasury examine the jade disk; it was the disk that had been cast into the river when crossing the Yangtze in the twenty-eighth year.",
  "s0439": "Thereupon the First Emperor divined; the divination yielded that traveling and relocating were auspicious.",
  "s0440": "He relocated thirty thousand households north of the Yellow River to Yuzhong.",
  "s0441": "He granted one rank of nobility.",
  "s0442": "On the guichou day of the tenth month of the thirty-seventh year, the First Emperor set out on a tour.",
  "s0443": "Left Prime Minister Si accompanied him; Right Prime Minister Quji remained to guard.",
  "s0444": "His youngest son Huhai, longing to go, requested to accompany him, and the emperor permitted it.",
  "s0445": "In the eleventh month, they traveled to Yunmeng and made distant offerings to Yu Shun at Jiuyi Mountain.",
  "s0446": "Floating down the Yangtze, he observed Jike and crossed sea islets.",
  "s0447": "He passed Danyang and reached Qiantang.",
  "s0448": "Approaching the Zhe River, the water's waves were treacherous, so he went west one hundred twenty li and crossed through a narrow passage.",
  "s0449": "He ascended Kuaiji, made sacrifices to the Great Yu, gazed upon the Southern Sea, and erected stone inscriptions praising Qin's virtue.",
  "s0450": "The text said:",
  "s0451": "The Emperor's splendid achievements unified all within the universe; his virtue and beneficence are cultivated and enduring.",
  "s0452": "In the thirty-seventh year, he personally toured all under Heaven, comprehensively surveying distant regions.",
  "s0453": "He then ascended Kuaiji, proclaimed and inspected customs; the black-headed people were reverent and solemn.",
  "s0454": "The assembled ministers recited his achievements, traced the origins of events, and pursued his lofty brilliance.",
  "s0455": "The Qin sage governed the state, first established criminal names, and clearly displayed ancient regulations.",
  "s0456": "Initially he leveled laws and regulations, carefully distinguished official duties, to establish permanent standards.",
  "s0457": "The six kings were monopolistic and treacherous, greedy, cruel, arrogant, and fierce, leading masses to strengthen themselves.",
  "s0458": "Violent and tyrannical, they acted with abandon, relying on force they were arrogant, frequently mobilizing troops.",
  "s0459": "Secretly they sent covert envoys, using affairs to form vertical alliances, acting in devious ways.",
  "s0460": "Internally they adorned themselves with deceitful plots, externally they came to invade borders, thereby bringing about disaster.",
  "s0461": "With righteous authority he executed them, completely extinguished violent rebels; chaotic traitors were destroyed.",
  "s0462": "His sage virtue was broadly profound; within the six directions, his beneficence spread without limit.",
  "s0463": "The Emperor unified the universe, comprehensively attended to all affairs; far and near all were thoroughly purified.",
  "s0464": "Managing and governing the multitude of things, examining and verifying actual affairs, each bearing its name.",
  "s0465": "Noble and base both communicated, good and bad were displayed before him; there was nothing hidden.",
  "s0466": "He adorned, examined, and proclaimed righteousness: having a son yet marrying another, betraying the deceased, being unchaste.",
  "s0467": "Separating inside and outside, prohibiting and stopping licentiousness; men and women were pure and sincere.",
  "s0468": "If a husband was a stud boar, killing him incurred no punishment; males held to the righteous standard.",
  "s0469": "If a wife eloped, the son could not obtain his mother; all were transformed to be honest and pure.",
  "s0470": "Greatly governing and purifying customs, all under Heaven received the wind of transformation, bathed in his splendid teachings.",
  "s0471": "All followed the standards and regulations, harmonious, peaceful, sincere, and diligent; none did not obey commands.",
  "s0472": "The black-headed people cultivated purity; people delighted in common standards, joyfully preserving great peace.",
  "s0473": "Later generations respectfully uphold the laws, constantly governing without end; boats and chariots do not overturn.",
  "s0474": "The attending ministers recite his achievements and request to carve this stone, gloriously displaying the splendid inscription.",
  "s0475": "Returning, he passed through Wu and crossed from Jiangcheng.",
  "s0476": "He went up along the sea and north to Langye.",
  "s0477": "The practitioner Xu Shi and others entered the sea seeking divine medicine; after several years without obtaining it and having spent much, fearing punishment, they fabricated a story: \"The Penglai medicine can be obtained, but we are constantly troubled by large sharks, so we cannot reach it; we request good archers to accompany us; when we see them we will shoot them with multiple crossbows.\"",
  "s0478": "The First Emperor dreamed of battling a sea god in human form.",
  "s0479": "He inquired about dream interpretation; the scholars said: \"Water gods cannot be seen; they use large fish and flood dragons as their manifestations.",
  "s0480": "Now the superior's prayers and offerings are thorough and respectful, yet there is this evil god; it should be removed, and good gods can be attracted.\"",
  "s0481": "He then ordered those entering the sea to carry equipment for catching giant fish, and he himself waited with multiple crossbows for large fish to appear and shot them.",
  "s0482": "From Langye north to Rongcheng Mountain, he saw none.",
  "s0483": "At Zhifu, he saw a giant fish and shot and killed one fish.",
  "s0484": "He then went west along the sea.",
  "s0485": "At Pingyuan ford he fell ill.",
  "s0486": "The First Emperor hated speaking of death, and none of the assembled ministers dared speak of death matters.",
  "s0487": "The emperor's illness grew worse, so he composed a sealed edict to Prince Fusu saying: \"Attend the funeral at Xianyang and perform the burial.\"",
  "s0488": "The document was already sealed and was with Director of the Imperial Carriage Zhao Gao who handled seal matters, but had not yet been given to the envoy.",
  "s0489": "On the bingyin day of the seventh month, the First Emperor died at the Pingtai of Shaqiu.",
  "s0490": "Prime Minister Si, because the emperor died away from the capital, feared that the princes and all under Heaven would revolt, so he kept it secret and did not announce the death.",
  "s0491": "The coffin was placed in a warm-cool carriage; his formerly favored eunuchs attended; wherever they arrived food was presented to the emperor.",
  "s0492": "The hundred officials submitted memorials as usual, and eunuchs from within the warm-cool carriage would approve the submitted memorials.",
  "s0493": "Only Prince Huhai, Zhao Gao, and five or six favored eunuchs knew the emperor had died.",
  "s0494": "Zhao Gao had formerly taught Huhai writing and prison law matters, and Huhai privately favored him.",
  "s0495": "Gao then secretly plotted with Prince Huhai and Prime Minister Si to destroy the sealed document the First Emperor had given to Prince Fusu, and instead forged a decree saying Prime Minister Si had received the First Emperor's last testament at Shaqiu to install Prince Huhai as crown prince.",
  "s0496": "They forged another document to be given to Prince Fusu and Meng Tian, listing their crimes and bestowing death upon them.",
  "s0497": "The full account is in the biography of Li Si.",
  "s0498": "They traveled on, passing through Jingxing to reach Jiuyuan.",
  "s0499": "With the heat of summer, the warm carriage with the corpse stank, so they decreed that attending officials should have each carriage carry one shi of salted fish to mask the smell.",
  "s0500": "They traveled via the straight road to Xianyang and announced the death.",
  "s0501": "Crown Prince Huhai succeeded to the throne as the Second Generation Emperor.",
  "s0502": "In the ninth month, the First Emperor was buried at Lishan.",
  "s0503": "When the First Emperor first ascended the throne, he began excavating and constructing at Lishan; when he unified all under Heaven, convicts sent from throughout the land numbered over seven hundred thousand; they dug through three underground springs, poured copper and placed the coffin chamber, and filled it with palaces, officials, rare implements, and precious curiosities relocated there.",
  "s0504": "He ordered craftsmen to make mechanical crossbows and arrows; if anyone came near to penetrate, they would immediately shoot them.",
  "s0505": "With mercury they made the hundred rivers, the Yangtze and Yellow rivers, and the great sea, with mechanisms that made them flow into each other; above they depicted the heavenly bodies, below they depicted the geography.",
  "s0506": "Using mermaid oil as candles, they calculated they would not be extinguished for a long time.",
  "s0507": "The Second Emperor said: \"The former emperor's rear palace—those who had no sons should not go out; this would not be proper.\"",
  "s0508": "He ordered them all to follow him in death; those who died were very numerous.",
  "s0509": "After the burial had been completed, someone said that the craftsmen who made the mechanisms all knew what was stored, and if what was stored became known it would be revealed.",
  "s0510": "When the great affair was completed and storage finished, they closed the middle passage door and lowered the outer passage door, completely sealing in all the craftsmen and those who stored treasures; none ever came out again.",
  "s0511": "Trees and grass were planted to simulate mountains.",
  "s0512": "In the first year of the Second Generation Emperor, he was twenty-one years old.",
  "s0513": "Zhao Gao served as Palace Attendant Commander and handled affairs.",
  "s0514": "The Second Emperor issued a decree increasing sacrificial animals for the First Emperor's mortuary temple and the rituals for mountains, rivers, and the hundred spirits.",
  "s0515": "He ordered the assembled ministers to discuss honoring the First Emperor's temple.",
  "s0516": "All the assembled ministers bowed their heads and said: \"In ancient times the Son of Heaven had seven temples, feudal lords five, great officials three; even for ten thousand generations they would never be removed or destroyed.",
  "s0517": "Now the First Emperor is the supreme temple; all within the four seas present tribute and duties, increase sacrificial animals, rituals are all complete; nothing can be added.",
  "s0518": "The former kings' temples are either at Western Yong or at Xianyang.",
  "s0519": "According to the Son of Heaven's ritual protocol, he should uniquely offer libations and make offerings at the First Emperor's temple.",
  "s0520": "From Xianggong downward they may be removed and destroyed.",
  "s0521": "In total seven temples were established.",
  "s0522": "The assembled ministers according to ritual advance to make offerings, honoring the First Emperor's temple as the ancestral temple of the emperor.",
  "s0523": "The emperor again refers to himself as 'zhen.'\"",
  "s0524": "\"",
  "s0525": "The Second Emperor plotted with Zhao Gao, saying: \"I am young and have just ascended the throne; the black-headed people have not yet gathered and submitted.",
  "s0526": "The former emperor toured the commanderies and counties to show strength and awe all within the seas.",
  "s0527": "Now if I peacefully do not make tours, I will appear weak and will not be able to rule all under Heaven as a minister.\"",
  "s0528": "In spring, the Second Emperor traveled east through the commanderies and counties; Li Si accompanied him.",
  "s0529": "Reaching Jieshi and going along the sea, south to Kuaiji, he had inscriptions carved on all the stone monuments the First Emperor had erected; beside the stones he added the names of the great ministers who accompanied him, to proclaim the former emperor's accomplished achievements and splendid virtue:",
  "s0530": "The Emperor said: \"The inscriptions on metal and stone were all done by the First Emperor.",
  "s0531": "Now I have inherited the title, but if the inscriptions on metal and stone do not mention the First Emperor, in the distant future it will seem as if later successors did them, not proclaiming his accomplished achievements and splendid virtue.\"",
  "s0532": "Prime Minister and your servant Si, Minister Quji, Grand Censor and your servant De at risk of death say: \"We your servants request to completely carve the decree document on the stone inscriptions, thereby making it clear.",
  "s0533": "We your servants at risk of death request this.\"",
  "s0534": "The decree said: \"Approved.\"",
  "s0535": "\"",
  "s0536": "He then went to Liaodong and returned.",
  "s0537": "Thereupon the Second Emperor followed and employed Zhao Gao, tightening laws and decrees.",
  "s0538": "He then secretly plotted with Zhao Gao, saying: \"The great ministers do not submit, officials are still strong, and the various princes will surely contend with me; what should I do about this?\"",
  "s0539": "Gao said: \"I have long wished to speak but have not dared.",
    "s0540": "The former emperor's great ministers are all people from families renowned and noble for generations throughout the land, with accumulated achievements and service transmitted from generation to generation for a long time.",
  "s0541": "Now I, Gao, am of lowly origin; Your Majesty graciously promoted me, placing me in a high position, managing internal affairs.",
  "s0542": "The great ministers are resentful and discontent, only outwardly following me as minister; in their hearts they truly do not submit.",
    "s0543": "Now that the superior has gone out, if you do not use this time to investigate commandery and county governors and commandants with crimes and execute them, above you can demonstrate your awesome power to all under Heaven, below you can eliminate those from the superior's life whom you cannot tolerate.",
  "s0544": "Now is not the time to model on civil culture but to decide by martial force; I hope Your Majesty will follow the times without hesitation, and the assembled ministers will not have time to plot.",
  "s0545": "If a brilliant lord gathers and elevates the remaining people, ennobles the base, enriches the poor, draws near the distant, then above and below will unite and the state will be secure.\"",
  "s0546": "The Second Emperor said: \"Good.\"",
    "s0547": "He then executed great ministers and various princes; due to collective punishment for crimes, arrests reached junior palace officials of the three ranks of attendants, none could be installed, and six princes were executed at Du.",
  "s0548": "Prince Jianglü and his two brothers were imprisoned in the inner palace and their crimes were to be deliberated later.",
  "s0549": "The Second Emperor sent an envoy to order Jianglü: \"Prince, you have been disloyal; your crime merits death; officials will apply the law.\"",
  "s0550": "Jianglü said: \"In court rituals, I have never dared not follow protocol as a guest;",
  "s0551": "in halls and temples, I have never dared lose propriety;",
    "s0552": "in receiving commands and responding to them, I have never dared speak improperly.",
  "s0553": "How am I disloyal?",
  "s0554": "I wish to hear my crime before dying.\"",
  "s0555": "The envoy said: \"I cannot discuss the plot; I am only carrying out the document.\"",
  "s0556": "Jianglü then looked up to Heaven and cried out three times, saying: \"Heaven!",
  "s0557": "I am innocent!\"",
  "s0558": "The three brothers all shed tears, drew their swords, and committed suicide.",
    "s0559": "The royal clan was alarmed and fearful.",
    "s0560": "Ministers who remonstrated were considered slanderous; great officials clung to salaries and sought favor; the black-headed people were alarmed and fearful.",
  "s0561": "In the fourth month, the Second Emperor returned to Xianyang and said: \"The former emperor considered the Xianyang court too small, so he built Epang Palace as halls.",
  "s0562": "It was not yet completed when the emperor died; the workers were dismissed and returned to bury at Lishan.",
  "s0563": "The Lishan project is now greatly completed; if we now abandon Epang Palace and do not complete it, this would proclaim that the former emperor's undertaking was an error.\"",
  "s0564": "He resumed work on Epang Palace.",
  "s0565": "Externally he pacified the four barbarians, following the First Emperor's plans.",
  "s0566": "He mobilized all their skilled warriors, fifty thousand men, to serve as garrison guards at Xianyang, ordering them to practice shooting at dogs, horses, and wild beasts.",
  "s0567": "Those who needed to be fed were many; calculating it was insufficient, he ordered commanderies and counties to transport beans, grain, fodder, and hay, all requiring them to bring their own provisions; within three hundred li of Xianyang they could not eat their own grain.",
  "s0568": "The application of law became increasingly severe and harsh.",
  "s0569": "In the seventh month, garrison soldiers Chen Sheng and others rebelled in the former Jing territory, calling themselves 'Zhang Chu.'",
  "s0570": "Sheng proclaimed himself King of Chu, resided at Chen, and sent various generals to seize territory.",
  "s0571": "Young men in Shandong commanderies and counties, suffering under Qin officials, all killed their governors, commandants, magistrates, and assistants and rebelled to respond to Chen She; they mutually proclaimed themselves lords and kings, formed vertical alliances facing west, claiming to attack Qin; their numbers were countless.",
  "s0572": "An emissary sent to the east returned and reported the rebels to the Second Emperor.",
  "s0573": "The Second Emperor was angry and imprisoned the official.",
  "s0574": "When later envoys arrived, the emperor asked and they replied: \"They are bandits; the commandery governors and commandants are pursuing and capturing them; now all have been caught; this is not worth worrying about.\"",
  "s0575": "The emperor was pleased.",
  "s0576": "Wu Chen proclaimed himself King of Zhao, Wei Jiu as King of Wei, Tian Dan as King of Qi.",
  "s0577": "The Duke of Pei rose at Pei.",
  "s0578": "Xiang Liang raised troops in Kuaiji Commandery.",
  "s0579": "In the winter of the second year, Zhou Zhang and others sent by Chen She led their forces west to Xi; their troops numbered in the hundreds of thousands.",
  "s0580": "The Second Emperor was greatly alarmed and plotted with the assembled ministers, saying: \"What should be done?\"",
  "s0581": "Junior Commandant Zhang Han said: \"The bandits have already arrived in great strength; mobilizing nearby counties will not be in time.",
  "s0582": "The Lishan convicts are numerous; I request to pardon them, give them weapons, and use them to attack.\"",
  "s0583": "The Second Emperor then granted a great amnesty throughout the land and sent Zhang Han to command; he defeated Zhou Zhang's army which fled, then killed Zhang at Caoyang.",
  "s0584": "The Second Emperor further sent Chief Clerk Sima Xin and Dong Yi to assist Zhang Han in attacking the bandits; they killed Chen Sheng at Chengfu, defeated Xiang Liang at Dingtao, and destroyed Wei Jiu at Linji.",
  "s0585": "The bandit leaders of the Chu territory having all died, Zhang Han then crossed the Yellow River northward and attacked King Xie of Zhao and others at Julu.",
  "s0586": "Zhao Gao persuaded the Second Emperor, saying: \"The former emperor controlled all under Heaven for a long time, so the assembled ministers dared not act improperly or advance evil proposals.",
  "s0587": "Now Your Majesty is in the prime of youth and has just ascended the throne; how can you decide matters together with dukes and ministers at court?",
  "s0588": "If affairs have errors, this shows the assembled ministers your shortcomings.",
  "s0589": "The Son of Heaven is called 'zhen'; naturally his voice is not heard.\"",
    "s0590": "Thereupon the Second Emperor constantly remained within the forbidden palace, deciding all affairs with Gao.",
  "s0591": "Thereafter dukes and ministers rarely obtained audience; bandits and thieves increased further, while troops from Guanzhong mobilized eastward to attack bandits without end.",
  "s0592": "Right Prime Minister Quji, Left Prime Minister Si, and General Feng Jie came forward to remonstrate, saying: \"Bandits east of the passes have risen together; Qin mobilizes troops to execute and attack them; those killed and lost are very numerous, yet still they do not stop.",
  "s0593": "Bandits are numerous all because garrison service, grain transport, and construction work are bitter, and taxes are heavy.",
    "s0594": "We request temporarily halting work on Epang Palace and reducing border garrison transport to the four frontiers.",
    "s0595": "\" The Second Emperor said: \"I have heard from Hanzi who said: 'Yao and Shun's rafters were not scraped, thatched roofs not trimmed, they ate from earthen bowls and drank from earthen vessels; even the sustenance of a gate guard was no worse than this.",
  "s0596": "Yu dug through Dragon Gate, opened the Great Xia, broke through river pavilions and waters, releasing them to the sea, personally holding the rammer and spade, his shins without hair; the labor of slaves and servants was not more severe than this.'",
  "s0597": "The reason it is noble to possess all under Heaven is to be able to indulge one's will to the utmost; the lord emphasizes and clarifies laws, so those below dare not act improperly, thereby controlling all within the seas.",
    "s0598": "The lords of Yu and Xia, though noble as Sons of Heaven, personally dwelt in actual poverty and hardship to serve the hundred clans; what need did they have for laws and standards?",
  "s0599": "I am honored with ten thousand chariots without their reality; I want to create the carriages of a thousand chariots and the attributes of ten thousand chariots to fulfill my title and name.",
  "s0600": "Moreover, the former emperor rose from among the feudal lords and unified all under Heaven; all under Heaven having been settled, externally he drove out the four barbarians to secure the borders, built palaces to proclaim his satisfaction, and you observe the former emperor's achievements and enterprises having order.",
  "s0601": "Now in the two years since I ascended the throne, bandits have risen together; you cannot prohibit them, and moreover you want to stop what the former emperor was doing; above this does not repay the former emperor, below you do not exhaust loyal effort for me; why do you hold positions?\"",
  "s0602": "He handed Quji, Si, and Jie over to officials, who investigated and charged them with other crimes.",
  "s0603": "Quji and Jie said: \"Generals and prime ministers should not be humiliated.\"",
  "s0604": "They committed suicide.",
  "s0605": "Si was finally imprisoned and subjected to the five punishments.",
  "s0606": "In the third year, Zhang Han and others led their troops to besiege Julu; the Chu supreme general Xiang Yu led Chu troops to rescue Julu.",
  "s0607": "In winter, Zhao Gao became prime minister and finally investigated Li Si and killed him.",
  "s0608": "In summer, Zhang Han and others fought several defeats; the Second Emperor sent someone to reproach Han; Han was afraid and sent Chief Clerk Xin to request instructions.",
  "s0609": "Zhao Gao refused to see him and moreover did not trust him.",
  "s0610": "Xin was afraid and fled; Gao sent people to pursue and arrest him but did not catch him.",
  "s0611": "Xin met with Han and said: \"Zhao Gao handles affairs internally; whether you, general, have achievements or not, you will be executed.\"",
  "s0612": "Xiang Yu urgently attacked the Qin army, captured Wang Li; Han and others then surrendered with their troops to the feudal lords.",
  "s0613": "On the jihai day of the eighth month, Zhao Gao wanted to create disorder but feared the assembled ministers would not obey, so he first set up a test: he presented a deer to the Second Emperor and said: \"It is a horse.\"",
  "s0614": "The Second Emperor laughed and said: \"Is the prime minister mistaken?",
  "s0615": "Calling a deer a horse.\"",
  "s0616": "He asked those around him; some remained silent, some said horse to flatter and follow Zhao Gao.",
  "s0617": "Those who said deer, Gao then secretly used the law against all who said deer.",
  "s0618": "Thereafter all the assembled ministers feared Gao.",
  "s0619": "Gao had previously repeatedly said 'bandits east of the passes cannot accomplish anything,' but when Xiang Yu captured Qin general Wang Li and others below Julu and advanced, Zhang Han and others' armies suffered repeated defeats; they sent memorials requesting reinforcements; Yan, Zhao, Qi, Chu, Han, and Wei all installed themselves as kings; from the passes eastward, most had rebelled against Qin officials and responded to the feudal lords; all the feudal lords led their masses westward.",
  "s0620": "The Duke of Pei, leading several tens of thousands, had already captured Wuguan and sent people privately to Gao; Gao feared the Second Emperor would be angry and punishment would reach him personally, so he feigned illness and did not come to court.",
  "s0621": "The Second Emperor dreamed that a white tiger bit off his left trace horse and killed it; his heart was uneasy, and he strangely inquired about dream interpretation.",
  "s0622": "The divination said: \"The Jing River is causing calamity.\"",
  "s0623": "The Second Emperor then fasted at Wangyi Palace, wishing to sacrifice to the Jing River, and sank four white horses.",
  "s0624": "He sent an envoy to reproach Gao about bandit matters.",
  "s0625": "Gao was afraid, so he secretly plotted with his son-in-law Yan Le, the Xianyang magistrate, and his younger brother Zhao Cheng, saying: \"The emperor does not listen to remonstrances; now affairs are urgent and he wants to direct blame to my clan.",
  "s0626": "I want to replace the emperor and install Prince Ying.",
  "s0627": "Prince Ying is benevolent and frugal; the hundred clans all support his words.\"",
  "s0628": "He had the Palace Attendant Commander serve as internal support, falsely claiming there were major bandits, had Le summon officials and mobilize troops, forcibly kidnapped Le's mother and placed her at Gao's residence.",
  "s0629": "He sent Le to lead officials and troops, over a thousand men, to the Wangyi Palace gate, bound the Guard Commander and Chief Clerk, and said: \"Bandits have entered here; why did you not stop them?\"",
  "s0630": "The Guard Commander said: \"The surrounding guardhouses and deployed troops are very vigilant; how could bandits dare enter the palace?\"",
  "s0631": "Le then beheaded the Guard Commander, directly led officials in, and shot as they went; palace attendants and eunuchs were greatly frightened, some fled, some resisted; those who resisted were immediately killed; dozens died.",
  "s0632": "The Palace Attendant Commander and Le entered together and shot at the emperor's curtained seat.",
  "s0633": "The Second Emperor was angry and summoned those around him, but all were panicked and confused and did not fight.",
  "s0634": "Nearby was one eunuch who attended and did not dare leave.",
    "s0635": "The Second Emperor entered the inner chambers and said to him: \"Why did you not warn me earlier?",
  "s0636": "Now it has come to this!\"",
  "s0637": "The eunuch said: \"I did not dare speak, therefore I survived.",
  "s0638": "Had I spoken early, I would already have been executed; how would I have reached today?\"",
    "s0639": "Yan Le came forward to the Second Emperor and enumerated his crimes: \"You have been arrogant and willful, executing and killing without proper cause; all under Heaven has rebelled against you together; you should make your own decision.\"",
  "s0640": "The Second Emperor said: \"Can I see the prime minister?\"",
  "s0641": "Le said: \"No.\"",
  "s0642": "The Second Emperor said: \"I wish to obtain one commandery to be king.\"",
  "s0643": "He did not permit it.",
  "s0644": "He said again: \"I wish to be a marquis of ten thousand households.\"",
  "s0645": "He did not permit it.",
  "s0646": "He said: \"I wish to be a commoner with my wife and children, like the other princes.\"",
    "s0647": "Yan Le said: \"I received orders from the prime minister to execute you on behalf of all under Heaven; though you speak much, I dare not relay it.\"",
  "s0648": "He signaled his troops to advance.",
  "s0649": "The Second Emperor committed suicide.",
  "s0650": "Yan Le returned and reported to Zhao Gao; Zhao Gao then summoned all the great ministers and princes and informed them of the circumstances of executing the Second Emperor.",
  "s0651": "He said: \"Qin was formerly a royal state; when the First Emperor ruled all under Heaven, he was therefore called Emperor.",
  "s0652": "Now the six states have again independently established themselves; Qin's territory has become smaller; to use the empty title of Emperor is not acceptable.",
  "s0653": "It would be appropriate to be king as before; this is expedient.\"",
  "s0654": "He installed the Second Emperor's elder brother's son, Prince Ying, as King of Qin.",
  "s0655": "He had the black-headed people bury the Second Emperor in Yichun Garden south of Du.",
  "s0656": "He ordered Prince Ying to fast, when he should appear at the temple to receive the king's seal.",
  "s0657": "After fasting for five days, Prince Ying plotted with his two sons, saying: \"Prime Minister Gao killed the Second Emperor at Wangyi Palace; fearing the assembled ministers would execute him, he pretended righteously to install me.",
  "s0658": "I have heard that Zhao Gao made an agreement with Chu to destroy the Qin royal clan and rule Guanzhong.",
  "s0659": "Now he has me fast and appear at the temple; this is wanting to kill me in the temple.",
  "s0660": "I will feign illness and not go; the prime minister will surely come himself; when he comes I will kill him.\"",
    "s0661": "Gao sent people to request Prince Ying several times; Prince Ying did not go; Gao indeed came himself and said: \"Ancestral temple affairs are of great importance; why does the king not go?\"",
  "s0662": "Prince Ying then stabbed and killed Gao at the fasting palace and exterminated Gao's three clans, displaying them as a warning throughout Xianyang.",
  "s0663": "Prince Ying served as King of Qin for forty-six days; the Chu general Duke of Pei defeated the Qin army, entered Wuguan, and reached Beshang, sending someone to arrange Prince Ying's surrender.",
    "s0664": "Prince Ying then tied a cord around his neck, rode in a plain white chariot drawn by white horses, presented the Son of Heaven's seal and tallies, and surrendered by the side of Zhidao.",
  "s0665": "The Duke of Pei then entered Xianyang, sealed the palaces and treasury, and returned the army to Bashang.",
  "s0666": "After dwelling for over a month, the feudal lords' armies arrived; Xiang Ji was the chief of the alliance and killed Prince Ying and all the Qin princes and royal clan.",
  "s0667": "He then massacred Xianyang, burned its palaces, captured its sons and daughters, and collected its precious treasures and wealth; the feudal lords divided them among themselves.",
  "s0668": "After destroying Qin, they each divided its territory into three, naming them King of Yong, King of Sai, and King of Di, collectively called the Three Qin.",
  "s0669": "Xiang Yu became Hegemon-King of Western Chu, commanded and divided all under Heaven among the feudal lords as kings; Qin was finally destroyed.",
  "s0670": "Five years later, all under Heaven was settled under Han.",
  "s0671": "The Grand Historian says: Qin's ancestor Boyi once had meritorious service during the time of Tang and Yu, received land and was granted a surname.",
  "s0672": "Between Yin and Xia he became obscure and scattered.",
  "s0673": "When Zhou declined, Qin arose, establishing a town at Western Chui.",
  "s0674": "From Duke Mu onward, they gradually devoured the feudal lords bit by bit, finally producing the First Emperor.",
  "s0675": "The First Emperor considered himself to have achievements surpassing the Five Emperors and territory broader than the Three Kings, and was ashamed to be equaled with them.",
    "s0676": "How excellent was Master Jia's extended reasoning!",
  "s0677": "He said:",
    "s0678": "Qin annexed the feudal lords of Shandong into over thirty commanderies, repaired ferry crossings and passes, occupied strategic passes and fortifications, and maintained armor and weapons to guard them.",
  "s0679": "Yet Chen She with a scattered and chaotic crowd of garrison soldiers numbering in the hundreds, raising his arm and shouting loudly, without using the weapons of bows and halberds, with only hoes, rakes, and white clubs, taking food wherever they saw houses, rampaged throughout the land.",
    "s0680": "The Qin people blocked strategic passes but did not guard them; passes and bridges were not closed, long halberds did not stab, and strong crossbows did not shoot.",
  "s0681": "The Chu army deeply penetrated and fought at Hongmen, without encountering even the difficulty of hedges and fences.",
  "s0682": "Thereupon Shandong was greatly disturbed, feudal lords rose together, and heroes mutually established themselves.",
  "s0683": "Qin sent Zhang Han to command and march east; Zhang Han then used his three armies to bargain from outside to plot against his superior.",
  "s0684": "That the assembled ministers were not trusted can be seen from this.",
  "s0685": "When Prince Ying was installed, he still did not awaken.",
  "s0686": "If Prince Ying had had the abilities of an ordinary lord and merely obtained moderate assistance, though Shandong was in chaos, Qin's territory could have been preserved intact, and the ancestral temple sacrifices need not have been cut off.",
  "s0687": "Qin's territory was backed by mountains and bordered by rivers as natural defenses; it was a state protected by four barriers.",
  "s0688": "From Duke Mu onward to the King of Qin, over twenty lords constantly were the most powerful among feudal lords.",
  "s0689": "Was every generation sage?",
  "s0690": "No, the strategic position was naturally thus.",
    "s0691": "Moreover, all under Heaven once united their hearts and combined their forces to attack Qin.",
    "s0692": "At that time, the wise and intelligent were arrayed together, excellent generals led their armies, worthy prime ministers implemented their strategies, yet they were obstructed by dangerous terrain and could not advance; Qin then drew them into battle and opened the passes for them; millions of their troops fled northward and were thus defeated.",
  "s0693": "Was it that courage, strength, and wisdom were insufficient?",
  "s0694": "No, the terrain was not favorable and the strategic position not advantageous.",
    "s0695": "If Qin had defended small towns and garrisoned large cities, guarded strategic passes and stationed troops, raised high ramparts without engaging in battle, closed passes and occupied chokepoints, shouldering halberds to guard them—",
    "s0696": "The feudal lords arose from among commoners, united by profit, without the conduct of legitimate kingship.",
    "s0697": "Their alliances were not yet close, their subordinates not yet attached; in name they sought to destroy Qin, but in reality each sought their own profit.",
  "s0698": "When they saw how difficult Qin's barriers were to attack, they would surely retreat.",
  "s0699": "Settling the land and resting the people, waiting for their exhaustion, gathering the weak and supporting the weary, to order the lords of great states—they would not worry about not achieving their will within the seas.",
    "s0700": "Noble as Son of Heaven, wealthy possessing all under Heaven, yet his body became a captive—this was because his method for averting defeat was wrong.",
  "s0701": "The Qin king was self-satisfied and did not inquire, thereby making errors and not changing.",
    "s0702": "The Second Emperor inherited this and consequently did not reform; violent and tyrannical, he compounded the disaster.",
    "s0703": "Prince Ying stood isolated without relatives, endangered and weak without support.",
  "s0704": "The three lords were confused and never awakened their entire lives; that they perished, was this not appropriate?",
  "s0705": "At this time, the age was not without deeply thoughtful scholars who understood transformation, but the reason they dared not exhaust loyalty and brush aside faults was that Qin customs had many taboos and prohibitions; loyal words not yet finished from the mouth and the body was already executed and destroyed.",
    "s0706": "Therefore all the scholars throughout the land inclined their ears to listen, stood hesitantly with feet together, and clamped their mouths shut without speaking.",
  "s0707": "Therefore the three lords lost the Way, loyal ministers dared not remonstrate, wise scholars dared not plan; all under Heaven was already in chaos, yet treachery was not reported above; is this not sorrowful!",
  "s0708": "The former kings knew that obstruction and concealment harmed the state, so they established dukes, ministers, great officials, and lesser officials to adorn laws and establish punishments, and all under Heaven was governed.",
  "s0709": "When strong, they prohibited violence and punished chaos, and all under Heaven submitted.",
    "s0710": "When it was weak, the Five Hegemons led campaigns and the feudal lords followed.",
    "s0711": "When it was reduced in power, internally it guarded itself, externally others remained attached, and the altars of soil and grain were preserved.",
    "s0712": "Thus when Qin was at its peak with numerous laws and severe punishments, all under Heaven trembled;",
    "s0713": "when it declined, the hundred clans were resentful and discontented, and all within the seas rebelled.",
    "s0714": "Thus Zhou with its five ranks of nobility obtained the Way and lasted over a thousand years without being cut off.",
    "s0715": "Qin failed in both beginning and end, and therefore did not last long.",
    "s0716": "Viewing it from this perspective, the patterns of safety and danger are vastly different.",
  "s0717": "A rustic proverb says: 'Not forgetting past affairs, they are the teacher of future affairs.'",
  "s0718": "Therefore when the superior person governs a state, he observes high antiquity, verifies in the present age, considers human affairs, examines the principles of prosperity and decline, carefully considers the propriety of authority and power; going and staying have order, transformation and change have proper times; thus over long durations the altars of soil and grain are secure.",
    "s0719": "Duke Xiao of Qin occupied the stronghold of Xiao and Han and controlled the lands of Yongzhou; lord and ministers firmly defended their position while looking covetously upon the Zhou royal house, harboring the intention to roll up all under Heaven, embrace the universe, encompass the four seas, and the ambition to swallow the eight wastes.",
    "s0720": "At that time, Shang Yang assisted him: internally establishing laws and regulations, promoting agriculture and weaving, maintaining defensive and offensive preparations; externally using horizontal alliances to make the feudal lords fight each other; thereupon the Qin people effortlessly took the territory west of the Yellow River.",
    "s0721": "After Duke Xiao died, Kings Hui and Wu inherited the old enterprise and followed his established policies, annexing Hanzhong to the south, taking Ba and Shu to the west, cutting off fertile lands to the east, and gathering strategic commanderies.",
    "s0722": "The feudal lords were afraid and fearful; they held meetings and formed alliances to plot the weakening of Qin, not begrudging precious vessels, valuable treasures, or fertile rich lands to attract scholars from throughout the land, forming vertical alliances and bonds, mutually uniting as one.",
  "s0723": "At that time, Qi had Mengchang, Zhao had Pingyuan, Chu had Chunshen, Wei had Xinling.",
    "s0724": "These four lords were all intelligent and trustworthy, generous and magnanimous, loved their people, respected the worthy, and esteemed men of ability; they formed vertical alliances while disrupting horizontal ones, uniting the masses of Han, Wei, Yan, Chu, Qi, Zhao, Song, Wei, and Zhongshan.",
    "s0725": "Thereupon among the scholars of the Six States were Ning Yue, Xu Shang, Su Qin, Du He and their associates who planned for them; Qi Ming, Zhou Zui, Chen Zhen, Zhao Hua, Lou Huan, Zhai Jing, Su Li, Yue Yi and their fellows who implemented their intentions; Wu Qi, Sun Bin, Dai Tuo, Ni Liang, Wang Liao, Tian Ji, Lian Po, Zhao She and their comrades who commanded their troops.",
  "s0726": "Constantly with ten times the territory and millions of masses, they knocked on the passes and attacked Qin.",
    "s0727": "The Qin people opened their passes and drew in the enemy; the armies of the Nine States hesitated, retreated, and fled without daring to advance.",
    "s0728": "Qin, without the expense of a lost arrow or arrowhead, had already exhausted all the feudal lords under Heaven.",
    "s0729": "Thereupon the vertical alliance scattered and the agreements dissolved; they competed with each other to cede territory and pay tribute to Qin.",
    "s0730": "Qin had surplus strength and exploited their exhaustion, pursuing the fleeing and chasing the retreating; corpses lay by the million and flowing blood floated shields.",
  "s0731": "Taking advantage and seizing the opportunity, they carved up all under Heaven and divided its mountains and rivers; strong states requested to submit, weak states came to pay court.",
    "s0732": "Extending to King Xiaowen and King Zhuangxiang, they ruled only briefly and the state had no major affairs.",
    "s0733": "When it came to the King of Qin, he continued the remaining achievements of six generations, wielding long-term strategies to control the realm; he swallowed the Two Zhous and destroyed the feudal lords, trod upon the supreme position and mastered the six directions, grasped the whip to flog all under Heaven, and his awesome power shook the four seas.",
  "s0734": "He took south the lands ofhundred Yue, making them Guilin and Xiang commanderies; the lords ofhundred Yuebowed their heads and bound their necks,entrusted their livesto subordinate officials.",
    "s0735": "He then sent Meng Tian north to build the Great Wall and guard the frontier defenses, driving back the Xiongnu over seven hundred li; the Hu people dared not venture south to pasture their horses, and their warriors dared not draw their bows to avenge their grievances.",
  "s0736": "Thereupon he abolished the former kings' Way and burned the words of the hundred schools to make the black-headed people foolish.",
  "s0737": "He razed famous cities, killed heroes and worthy men, collected all under Heaven's weapons and gathered them at Xianyang, melted down sharp blades and cast bells, to make twelve metal men and weaken the black-headed people.",
  "s0738": "Then he cut through Mount Hua as walls, relied on the river as a ford, occupied billion-zhang high walls, and overlooked unfathomable valleys to create a defense.",
  "s0739": "Excellent generals and powerful crossbows guarded strategic points; trusted officials and elite troops arrayed sharp weapons and challenged whoever came; all under Heaven was settled.",
  "s0740": "In the Qin king's mind, he considered that Guanzhong's defenses, its golden walls of a thousand li, were a ten-thousand-generation enterprise for his descendants to rule as emperors.",
  "s0741": "After the Qin king died, his remaining awesome power still shook foreign lands.",
  "s0742": "Chen She was the son of a broken jar for a window and rope for a hinge, a person of lowly farming stock, and a vagrant; his talents did not reach those of an average person, he did not have the worthiness of Zhongni or Mo Di, nor the wealth of Tao Zhu or Yi Dun; stepping among the ranks, yet suddenly rising among squad and platoon leaders, he led weary and scattered soldiers, commanded several hundred men, and turned to attack Qin.",
  "s0743": "Cutting wood as weapons, raising poles as flags, all under Heaven gathered like clouds and responded, winning provisions and following like shadows; Shandong heroes and worthy men thereupon rose together and destroyed the Qin clan.",
  "s0744": "Moreover, all under Heaven was not small or weak; Yongzhou's territory and Xiao and Han's defenses remained as before.",
  "s0745": "Chen She's position was not more honored than the lords of Qi, Chu, Yan, Zhao, Han, Wei, Song, Wei, and Zhongshan;",
  "s0746": "Hoes, rakes, and thorny clubs were not sharper than hooked halberds and long dagger-axes;",
  "s0747": "The garrison conscripts could not match the armies of the Nine States;",
  "s0748": "Deep far-reaching plans and the way of military campaigns did not equal those of the men of former times.",
  "s0749": "Yet success and failure differed, and achievements and enterprises were contrary.",
  "s0750": "If you try to have the Shandong states and Chen She measure length and compare size, compare and weigh power, then they cannot be spoken of in the same terms.",
  "s0751": "Yet Qin with its small territory, a thousand chariots' authority, attracted the eight provinces and held court with peers for over a hundred years.",
  "s0752": "Then to make the six directions as home, Xiao and Han as palace; one man caused trouble and the seven temples collapsed, his body died at men's hands, becoming the laughingstock of all under Heaven—why?",
  "s0753": "Because benevolence and righteousness were not implemented and the strategic situations of attacking and defending differ.",
  "s0754": "When Qin unified all within the seas, annexed the feudal lords, faced south and called himself emperor to rule the four seas, all under Heaven's scholars in admiration turned toward him—why was this so?",
  "s0755": "It is said: In recent antiquity there had been no king for a long time.",
  "s0756": "The Zhou royal house was lowly, the Five Hegemons had already died, and commands were not implemented throughout the land; therefore feudal lords ruled by force, the strong invaded the weak, the many oppressed the few, weapons and war did not cease, and warriors and people were exhausted.",
  "s0757": "Now Qin faced south and ruled all under Heaven; above there was a Son of Heaven.",
  "s0758": "The common people hoped to secure their lives; none did not with empty hearts look up to their superior; at this time, guarding awesome power and establishing achievements, the root of safety and danger was here.",
  "s0759": "The Qin king harbored greedy and base intentions, practiced self-reliant cleverness, did not trust meritorious officials, was not close to officials and people, abolished the kingly way, established personal authority, prohibited writings and imposed harsh punishments and laws, prioritized deception and force while placing last benevolence and righteousness, using cruel tyranny as the foundation for all under Heaven.",
  "s0760": "Those who unify and annex honor deception and force; those who stabilize and tranquilize value following proper authority; this means that taking and holding require different techniques.",
  "s0761": "Qin emerged from the Warring States and ruled all under Heaven; its way did not change, its government did not reform; thus the means by which it took and held were not different.",
  "s0762": "Alone possessing it, therefore its destruction could be immediate.",
  "s0763": "If the Qin king had considered the affairs of earlier generations, combined the precedents of Yin and Zhou to regulate its government, later even if there were a licentious and arrogant ruler, there would not have been the danger of collapse.",
  "s0764": "Therefore the Three Kings in establishing all under Heaven had illustrious titles and names, and long-lasting achievements and enterprises.",
  "s0765": "When the Qin Second Emperor was established, all under Heaven without exception craned their necks to observe his government.",
  "s0766": "Those who are cold find short coarse robes beneficial, while those who are hungry find husks and dregs sweet; all under Heaven's clamoring was the new lord's resource.",
  "s0767": "This means that with laboring people it is easy to practice benevolence.",
  "s0768": "If the Second Emperor had had the conduct of a mediocre ruler and employed loyal and worthy men, if lord and ministers had been united in purpose while worrying about troubles within the seas, worn white mourning garments to rectify the First Emperor's errors, divided territory and people to enfeoff descendants of meritorious officials, established states and installed lords to show respect to all under Heaven, emptied prisons and pardoned those sentenced to punishments, removed and canceled charges for confiscated property and corruption, made each return to their villages, opened granaries, distributed wealth to relieve the lonely, poor, and distressed, lightened taxes and reduced corvée to aid the people's urgent needs, simplified laws and reduced punishments to maintain the future, enabled all under Heaven's people to obtain self-renewal, again moderate their conduct, each be careful with themselves, fulfill the people's hopes, and with awesome virtue shared all under Heaven, all under Heaven would have gathered.",
  "s0769": "If all within the four seas would rejoice, each content in their positions, only fearing change, even if there were cunning people without hearts departing from their superior, then treacherous ministers would have no way to display their cleverness, and violent rebellious treachery would cease.",
  "s0770": "The Second Emperor did not follow this technique, but compounded it with lacking the Way, destroyed ancestral temples and the people, again began building Epang Palace, multiplied punishments and harsh executions, officials' administration was harsh and severe, rewards and punishments were inappropriate, taxation was without limit, all under Heaven was in much turmoil, officials could not record it all, the hundred clans were impoverished and distressed while the lord did not care for them.",
  "s0771": "Then treachery and fraud arose together, and superiors and inferiors mutually evaded responsibility; those who suffered punishment were numerous, executions and punishments lined the roads, and all under Heaven suffered from it.",
  "s0772": "From lord and duke downward to the common masses, people harbored fears for their own safety, personally dwelt in actual poverty and suffering, all insecure in their positions, and therefore easily moved to rebellion.",
  "s0773": "Therefore Chen She did not possess the worthiness of Tang and Wu, did not rely on the honor of dukes and marquises, raised his arm at Daze and all under Heaven responded, because the people were in danger.",
  "s0774": "Therefore the former kings saw the changes of beginning and end and understood the key to survival and destruction; therefore the way of shepherding the people is that the priority is simply in making them secure.",
  "s0775": "Though all under Heaven has rebellious ministers, there will surely be no responsive assistance.",
  "s0776": "Therefore it is said 'with secure people one can practice righteousness, while with endangered people it is easy to do wrong'—this is what it means.",
  "s0777": "Noble as Son of Heaven, wealthy possessing all under Heaven, yet the body did not avoid execution—because the government was warped and wrong.",
  "s0778": "This was the Second Emperor's fault.",
  "s0779": "Xianggongwas established, ruled for twelve years.",
  "s0780": "He first built the Western Altar.",
  "s0781": "He was buried at Western Chui.",
  "s0782": "He fathered Wengong.",
  "s0783": "Wengong was established and resided at Western Chui Palace.",
  "s0784": "After fifty years he died and was buried at Western Chui.",
  "s0785": "He fathered Jinggong.",
  "s0786": "Jinggong did not rule and died.",
  "s0787": "He fathered Xiangong.",
  "s0788": "Xiangong ruled for twelve years and resided at Western Xin settlement.",
  "s0789": "He died and was buried at Ya.",
  "s0790": "He fathered Wugong, Degong, and Chuzi.",
  "s0791": "Chuzi ruled for six years and resided at Western Mound.",
  "s0792": "Three Chief Ministers—Fuji, Weilei, and Canfu—led rebels who killed Chuzi at Biyan and buried him at Ya.",
  "s0793": "Wugong was established.",
  "s0794": "Wugong ruled for twenty years.",
  "s0795": "He resided at Pingyang Feng Palace.",
  "s0796": "He was buried at the southeast of Xuanyang settlement.",
  "s0797": "The three Chief Ministers were punished for their crimes.",
  "s0798": "Degong was established.",
  "s0799": "Degong ruled for two years.",
  "s0800": "He resided at Yong Dazheng Palace.",
  "s0801": "He fathered Xuangong, Chenggong, and Mugong.",
  "s0802": "He was buried at Yang.",
  "s0803": "He first instituted the fu sacrifice to ward off pestilence.",
  "s0804": "Xuangong reigned for twelve years.",
  "s0805": "He resided at Yang Palace.",
  "s0806": "He was buried at Yang.",
  "s0807": "He first recorded intercalary months.",
  "s0808": "Chenggong reigned for four years and resided at the palace of Yong.",
  "s0809": "He was buried at Yang.",
  "s0810": "Qi attacked the Mountain Rong and Guzhu.",
  "s0811": "Mugong reigned for thirty-nine years.",
  "s0812": "The Son of Heaven bestowed the hegemon title.",
  "s0813": "He was buried at Yong.",
  "s0814": "Mugong studied with the Philosopher.",
  "s0815": "He fathered Kanggong.",
  "s0816": "Kanggong reigned for twelve years.",
  "s0817": "He resided at Yong Gaoqin.",
  "s0818": "He was buried at Qushe.",
  "s0819": "He fathered Gonggong.",
  "s0820": "Gonggong reigned for five years and resided at Yong Gaoqin.",
  "s0821": "He was buried south of Kanggong.",
  "s0822": "He fathered Huangong.",
  "s0823": "Huangong reigned for twenty-seven years.",
  "s0824": "He resided at Yong Taiqin.",
  "s0825": "He was buried north of Yiliқiu.",
  "s0826": "He fathered Jinggong.",
  "s0827": "Jinggong reigned for forty years.",
  "s0828": "He resided at Yong Gaoqin and was buried south of Qiuli.",
  "s0829": "He fathered Bigong.",
  "s0830": "Bigong reigned for thirty-six years.",
  "s0831": "He was buried north of Cheli.",
  "s0832": "He fathered Yigong.",
  "s0833": "Yigong did not reign.",
  "s0834": "He died and was buried at Zuo Palace.",
  "s0835": "He fathered Huigong.",
  "s0836": "Huigong reigned for ten years.",
  "s0837": "He was buried at Cheli.",
  "s0838": "He fathered Daogong.",
  "s0839": "Daogong reigned for fifteen years.",
  "s0840": "He was buried west of Xigong.",
  "s0841": "He fortified Yong.",
  "s0842": "He fathered Ligong and Gongong.",
  "s0843": "Ligong reigned for thirty-four years.",
  "s0844": "He was buried at Ruli.",
  "s0845": "He fathered Zaogong and Huaigong.",
  "s0846": "In his tenth year, a comet appeared.",
  "s0847": "Zaogong reigned for fourteen years.",
  "s0848": "He resided at Shouqin.",
  "s0849": "He was buried south of Daogong.",
  "s0850": "In his first year, a comet appeared.",
  "s0851": "Huaigong came from Jin.",
  "s0852": "He reigned for four years.",
  "s0853": "He was buried at Li Yuishi.",
  "s0854": "He fathered Linggong.",
  "s0855": "The ministers surrounded Huaigong, and Huaigong committed suicide.",
  "s0856": "Linggong was Su, the son of Zhaozi.",
  "s0857": "He resided at Jingyang.",
  "s0858": "He reigned for ten years.",
  "s0859": "He was buried west of Daogong.",
  "s0860": "He fathered Jiangong.",
  "s0861": "Jiangong came from Jin.",
  "s0862": "He reigned for fifteen years.",
  "s0863": "He was buried west of Xigong.",
  "s0864": "He fathered Huigong.",
  "s0865": "In his seventh year:",
  "s0866": "The common people first wore swords.",
  "s0867": "Huigong reigned for thirteen years.",
  "s0868": "He was buried at Lingyu.",
  "s0869": "He fathered Chugong.",
  "s0870": "Chugong reigned for two years.",
  "s0871": "Chugong committed suicide and was buried at Yong.",
  "s0872": "Xiangong reigned for twenty-three years.",
  "s0873": "He was buried at Xiaoyu.",
  "s0874": "He fathered Xiaogong.",
  "s0875": "Xiaogong reigned for twenty-four years.",
  "s0876": "He was buried at Diyu.",
  "s0877": "He fathered King Huiwen.",
  "s0878": "In his thirteenth year, the capital was first moved to Xianyang.",
  "s0879": "King Huiwen reigned for twenty-seven years.",
  "s0880": "He was buried at Gongling.",
  "s0881": "He fathered King Daowu.",
  "s0882": "King Daowu reigned for four years and was buried at Yongling.",
  "s0883": "King Zhaoxiang reigned for fifty-six years.",
  "s0884": "He was buried at Zhiyang.",
  "s0885": "He fathered King Xiaowen.",
  "s0886": "King Xiaowen reigned for one year.",
  "s0887": "He was buried at Shouling.",
  "s0888": "He fathered King Zhuangxiang.",
  "s0889": "King Zhuangxiang reigned for three years.",
  "s0890": "He was buried at Zhiyang.",
  "s0891": "He fathered the First Emperor.",
  "s0892": "Lü Buwei was prime minister.",
  "s0893": "In the seventh year of Xiangong's reign, markets were first operated.",
  "s0894": "In the tenth year, household registers with mutual responsibility groups of five were established.",
  "s0895": "Xiaogong was installed in the sixteenth year.",
  "s0896": "At that time, peach and plum trees blossomed in winter.",
  "s0897": "King Huiwen was born in the nineteenth year and was installed.",
  "s0898": "In the second year of his reign, currency was first circulated.",
  "s0899": "There was a newborn infant who said 'Qin will soon be king.'",
  "s0900": "King Daowu was born in the nineteenth year and was installed.",
  "s0901": "In the third year of his reign, the Wei River ran red for three days.",
  "s0902": "King Zhaoxiang was born in the nineteenth year and was installed.",
  "s0903": "In the fourth year of his reign, field boundaries were first opened, eliminating the qianmo system.",
  "s0904": "King Xiaowen was born in the fifty-third year and was installed.",
  "s0905": "King Zhuangxiang was born in the thirty-second year and was installed.",
  "s0906": "In the second year of his reign, he took the territory of Taiyuan.",
  "s0907": "In the first year of King Zhuangxiang's reign, he granted a great amnesty, honored the former kings' meritorious ministers, extended virtue to enrich kinsmen, and spread beneficence to the people.",
  "s0908": "Eastern Zhou plotted with the feudal lords against Qin; Qin sent Prime Minister Buwei to execute them and completely absorbed their state.",
  "s0909": "Qin did not cut off their sacrifices, giving Zhou's lord the land of Yangren to continue their sacrifices.",
  "s0910": "The First Emperor reigned for thirty-seven years.",
  "s0911": "He was buried at Liyi.",
  "s0912": "He fathered the Second Generation Emperor.",
  "s0913": "The First Emperor was born in the thirteenth year and was installed.",
  "s0914": "The Second Generation Emperor reigned for three years.",
  "s0915": "He was buried at Yichun.",
  "s0916": "Zhao Gao was prime minister and Marquis Anwu.",
  "s0917": "The Second Emperor was born in the twelfth year and was installed.",
  "s0918": "From Qin's Xianggong to the Second Emperor was six hundred ten years.",
  "s0919": "On the yichou day, the fifteenth day of the tenth month of the seventeenth year of the Xiaoming Emperor, it was said:",
  "s0920": "Zhou's calendar had already shifted; the benevolent do not replace their mother.",
  "s0921": "Qin took its position; Lü Zheng was cruel and brutal.",
  "s0922": "Yet from the age of thirteen, he annexed all under Heaven, indulged his emotions and desires, and nurtured his imperial relatives.",
  "s0923": "For thirty-seven years, his troops went everywhere without exception; his regulations of government orders were applied for later kings.",
  "s0924": "He obtained the sage's awesome power; the Yellow River god bestowed the diagram; he occupied the Wolf and Fox stars, trod upon the Shen and Fa stars; assisted the government to drive out enemies; therefore he called himself First Emperor.",
  "s0925": "After the First Emperor died, Huhai was extremely foolish; Lishan was not yet finished, yet he resumed building Epang Palace to continue the former policy.",
  "s0926": "He said 'the reason it is valuable to have all under Heaven is to indulge his will and desires to the utmost; great ministers even wanted to cease what the former lord was doing.'",
  "s0927": "He executed Si and Quji and employed Zhao Gao.",
  "s0928": "How painful indeed were his words!",
  "s0929": "A human head with animal cries.",
  "s0930": "Without awesome power he did not attack evil; without firmness he did not be emptily destroyed; distancing him he could not stay; cruel and brutal to hasten the time; though occupying a naturally advantageous state, still he could not survive.",
  "s0931": "Prince Ying in proper order obtained succession, wore a jade cap, wore ornate ribbons, rode a yellow-roofed carriage, attended by the hundred officials, and paid respects at the seven temples.",
  "s0932": "Petty men occupying improper positions, none did not in a daze lose their positions and seek ease day by day; only he could think long and worry carefully; father and son made plans, took action nearby between door and window, finally executed the treacherous minister, and for his lord punished the traitor.",
  "s0933": "After Gao died, guests and relatives had not yet finished consoling each other, the meal had not yet been swallowed, wine had not yet moistened his lips; Chu troops had already slaughtered through Guanzhong; the true person hovered over Bashang; in a plain carriage with white cords, he presented the seals and tallies to the one who would be emperor.",
  "s0934": "Zheng Bo with straw banner and decorative knife; the solemn king withdrew his camp.",
  "s0935": "When the Yellow River breaks through it cannot be dammed up again; when fish rots it cannot be made whole again.",
  "s0936": "Jia Yi and Sima Qian said: \"If Ying had had the talent of a mediocre ruler, merely obtaining moderate assistance, though Shandong was in chaos, Qin's territory could have been kept intact, and the ancestral temple sacrifices should not have been cut off.\"",
  "s0937": "Qin's accumulated decline left all under Heaven crumbled like earth and shattered like tiles; even with the talent of the Duke of Zhou, there was nowhere to deploy his skills again, yet to blame this day's orphan—mistaken indeed!",
  "s0938": "Popular tradition says the Qin First Emperor initiated evil crimes and Huhai took it to the extreme; this is reasonable.",
  "s0939": "To again blame the youth, saying Qin's territory could be preserved intact—this is what is meant by not understanding changing times.",
  "s0940": "Ji Ji with Xi, the Spring and Autumn does not name them.",
  "s0941": "When I read the Qin Annals, reaching where Prince Ying tore apart Zhao Gao by chariots, I cannot help but admire his decisiveness and pity his intention.",
  "s0942": "Ying's righteousness in death and life was complete."
}