{
  "s0001": "Lord Xinling of Wei, Wuji, was a younger son of King Zhao of Wei and a half-brother of King Anli of Wei.",
  "s0002": "When King Zhao passed away, King Anli ascended the throne and enfeoffed the prince as Lord Xinling.",
  "s0003": "At this time, Fan Sui had fled from Wei to become prime minister of Qin, and because of his resentment toward Wei Qi, Qin troops besieged Daliang, defeating Wei's army below Huayang and routing Mang Mao.",
  "s0004": "The King of Wei and the prince were troubled by this.",
  "s0005": "The prince was benevolent by nature and humble toward scholars. Whether worthy or unworthy, he treated all scholars with modesty and courtesy, never allowing his wealth and nobility to make him arrogant toward them.",
  "s0006": "Because of this, scholars from territories several thousand li around competed to come and attach themselves to him, bringing his retainers to three thousand men.",
  "s0007": "At this time, the feudal lords considered the prince worthy and having many retainers, so they did not dare invade or plot against Wei for over ten years.",
  "s0008": "The prince was playing a board game with the King of Wei when the northern border beacon was lit, reporting 'Zhao invaders approaching, about to enter our territory.'",
  "s0009": "The King of Wei put down his game pieces and wished to summon his ministers to discuss it.",
  "s0010": "The prince stopped the king, saying: 'The King of Zhao is out hunting, not invading.'",
  "s0011": "They resumed their game as before.",
  "s0012": "The king was anxious, his heart not on the game.",
  "s0013": "After a while, another messenger came from the north saying: 'The King of Zhao is hunting, not invading.'",
  "s0014": "The King of Wei was greatly astonished and asked: 'How did you know this?'",
  "s0015": "The prince replied: 'I have retainers who can thoroughly penetrate the King of Zhao's secret affairs. Whatever the King of Zhao does, my retainers immediately report it to me. That's how I know.'",
  "s0016": "After this, the King of Wei feared the prince's wisdom and abilities, and did not dare entrust him with state affairs.",
  "s0017": "Wei had a reclusive scholar named Hou Ying, aged seventy, who was poor and served as the gatekeeper of Daliang's eastern gate.",
  "s0018": "The prince heard of him and went to invite him, wishing to give him generous gifts.",
  "s0019": "Hou Ying refused to accept, saying: 'I have cultivated myself and purified my conduct for decades. I will never accept the prince's wealth just because I am impoverished as a gatekeeper.'",
  "s0020": "The prince then prepared wine and held a great banquet for his guests.",
  "s0021": "When all were seated, the prince took his chariot and retinue, leaving the left seat empty, and personally went to welcome Hou Sheng of the eastern gate.",
  "s0022": "Hou Sheng adjusted his worn clothes and hat, went straight up and sat in the prince's upper seat without yielding, wishing to observe the prince.",
  "s0023": "The prince held the reins with even greater respect.",
  "s0024": "Hou Sheng then said to the prince: 'I have a friend in the market butcher shop. I wish to trouble your chariot and retinue to pass by there.'",
  "s0025": "The prince drove his chariot into the market. Hou Sheng got down to see his friend Zhu Hai, deliberately standing for a long time, talking with his friend while carefully observing the prince.",
  "s0026": "The prince's expression grew even more gentle.",
  "s0027": "At this time, Wei's generals, ministers, royal clan, and guests filled the hall, waiting for the prince to raise his wine cup.",
  "s0028": "The market people all watched the prince holding the reins.",
  "s0029": "His retinue all secretly cursed Hou Sheng.",
  "s0030": "Hou Sheng saw that the prince's expression never changed, so he took leave of his friend and got into the chariot.",
  "s0031": "When they arrived home, the prince led Hou Sheng to the upper seat and introduced him to all the guests. The guests were all astonished.",
  "s0032": "When the wine flowed freely, the prince rose and toasted Hou Sheng in front.",
  "s0033": "Hou Sheng then said to the prince: 'Today Ying has done enough for the prince.",
  "s0034": "Ying is just a gatekeeper of the eastern gate, yet the prince personally bent his chariot and retinue to welcome Ying from among the crowd in the great hall. There should be no excess, yet today the prince deliberately went to excess.",
  "s0035": "However, Ying wished to fulfill the prince's reputation, so I deliberately made the prince's chariot and retinue stand long in the market, passing by travelers to observe the prince. The prince grew even more respectful.",
  "s0036": "The market people all considered Ying a petty man, but considered the prince a nobleman able to humble himself before scholars.'",
  "s0037": "The banquet then ended, and Hou Sheng became a chief retainer.",
  "s0038": "Hou Sheng told the prince: 'The butcher I passed by, Zhu Hai—this man is worthy. The world does not know him, so he hides among the butchers.'",
  "s0039": "The prince went several times to invite him. Zhu Hai deliberately did not respond with thanks. The prince was puzzled by this.",
  "s0040": "In the twentieth year of King Anli of Wei, King Zhao of Qin had already broken Zhao's Changping army and advanced to besiege Handan.",
  "s0041": "The prince's sister was married to Lord Pingyuan, younger brother of King Huiwen of Zhao. She repeatedly sent letters to the King of Wei and the prince, pleading for rescue from Wei.",
  "s0042": "The King of Wei sent General Jin Bi with a force of 100,000 to rescue Zhao.",
  "s0043": "The King of Qin sent an envoy to tell the King of Wei: 'I attack Zhao and will take it in a matter of days. Any feudal lord who dares rescue them—I will first destroy Zhao, then shift my troops to attack them.'",
  "s0044": "The King of Wei was afraid and sent someone to stop Jin Bi, keeping the army encamped at Ye, nominally rescuing Zhao but actually sitting on the fence to wait and see.",
  "s0045": "Lord Pingyuan's envoys came to Wei one after another with coronets and canopies, rebuking Lord Xinling of Wei: 'The reason Sheng attached herself as your relative was because of your noble righteousness, your ability to urgently aid those in distress.",
  "s0046": "Now Handan will fall to Qin any day, yet Wei's rescue does not arrive. Where is your ability to urgently aid those in distress?",
  "s0047": "Even if you disregard Sheng and abandon her to surrender to Qin, do you not pity your own sister?'",
  "s0048": "The prince was troubled by this and repeatedly petitioned the King of Wei, and his retainers and debaters persuaded the king in countless ways.",
  "s0049": "The King of Wei feared Qin and ultimately would not listen to the prince.",
  "s0050": "The prince considered that he could never obtain permission from the king. He decided not to survive alone while letting Zhao perish. So he gathered his retainers and prepared over a hundred chariots and cavalry, intending to lead his retainers to charge the Qin army and die together with Zhao."
}
