{
  "s0452": "Twenty one years, Ding Wang die, son Jian Wang Yi establish.",
  "s0453": "Jian Wang thirteen years, Jin kill its lord Li Gong, welcome Zi Zhou at Zhou, establish as Dao Gong.",
  "s0454": "Fourteen years, Jian Wang die, son Ling Wang Xie Xin establish.",
  "s0455": "Ling Wang twenty four years, Qi Cui Zhu kill its lord Zhuang Gong.",
  "s0456": "Twenty seven years, Ling Wang die, son Jing Wang Gui establish.",
  "s0457": "Jing Wang eighteen years, queen crown prince Sheng yet early die.",
  "s0458": "Twenty years, Jing Wang love son Chao, desire establish it, meet die, Zi Gai party with contend establish, state people establish long son Meng as wang, Zi Chao attack kill Meng.",
  "s0459": "Meng for Dao Wang.",
  "s0460": "Jin people attack Zi Chao yet establish Gai, is Jing Wang.",
  "s0461": "Jing Wang one year, Jin people enter Jing Wang, Zi Chao self establish, Jing Wang not able enter, dwell Ze.",
  "s0462": "Four years, Jin lead feudal lords enter Jing Wang at Zhou, Zi Chao as minister, feudal lords wall Zhou.",
  "s0463": "Sixteen years, Zi Chao followers again make chaos, Jing Wang flee at Jin.",
  "s0464": "Seventeen years, Jin Ding Gong then enter Jing Wang at Zhou.",
  "s0465": "Thirty nine years, Qi Tian Chang kill its lord Jian Gong.",
  "s0466": "Forty one years, Chu extinguish Chen.",
  "s0467": "Kong Qiu die.",
  "s0468": "Forty two years, Jing Wang die, son Yuan Wang Ren establish.",
  "s0469": "Yuan Wang eight years, die, son Ding Wang Jie establish.",
  "s0470": "Ding Wang sixteen years, three Jin extinguish Zhi Bo, divide have its earth.",
  "s0471": "Twenty eight years, Ding Wang die, long son Qu Ji establish, is Ai Wang.",
  "s0472": "Ai Wang establish three months, younger brother Shu Xi kill Ai Wang yet self establish, is Si Wang.",
  "s0473": "Si Wang establish five months, young younger brother Wei attack kill Si Wang yet self establish, is Kao Wang.",
  "s0474": "This three wang all Ding Wang son.",
  "s0475": "Kao Wang fifteen years, die, son Wei Lie Wang Wu establish.",
  "s0476": "Kao Wang seal its younger brother at He Nan, is Huan Gong, to continue Zhou Gong official duty.",
  "s0477": "Huan Gong die, son Wei Gong replace establish.",
  "s0478": "Wei Gong die, son Hui Gong replace establish, then seal its young son at Gong to serve wang, number east Zhou Hui Gong.",
  "s0479": "Wei Lie Wang twenty three years, nine tripods quake.",
  "s0480": "Command Han, Wei, Zhao as feudal lords.",
  "s0481": "Twenty four years, die, son An Wang Jiao establish.",
  "s0482": "Is year thief kill Chu Sheng Wang.",
  "s0483": "An Wang establish twenty six years, die, son Lie Wang Xi establish.",
  "s0484": "Lie Wang two years, Zhou grand historian Dan see Qin Xian Gong said: 'Begin Zhou with Qin state combine yet separate, separate five hundred years again combine, combine seventeen years yet hegemon wang come out.'",
  "s0486": "Ten years, Lie Wang die, younger brother Bian establish, is Xian Wang.",
  "s0487": "Xian Wang five years, congratulate Qin Xian Gong, Xian Gong call bo.",
  "s0488": "Nine years, present Wen Wu blessing at Qin Xiao Gong.",
  "s0489": "Twenty five years, Qin meet feudal lords at Zhou.",
  "s0490": "Twenty six years, Zhou present bo at Qin Xiao Gong.",
  "s0491": "Thirty three years, congratulate Qin Hui Wang.",
  "s0492": "Thirty five years, present Wen Wu blessing at Qin Hui Wang.",
  "s0493": "Forty four years, Qin Hui Wang call wang.",
  "s0494": "Its after feudal lords all become wang.",
  "s0495": "Forty eight years, Xian Wang die, son Shen Jing Wang Ding establish.",
  "s0496": "Shen Jing Wang establish six years, die, son Nan Wang Yan establish.",
  "s0497": "Wang Nan time east west Zhou divide govern.",
  "s0498": "Wang Nan move capital west Zhou.",
  "s0499": "West Zhou Wu Gong common crown prince die, have five concubine son, no proper establish.",
  "s0500": "Si Ma Jian tell Chu Wang said: 'Not if with earth help Gong Zi Jiu, for request crown prince.'",
  "s0501": "Zuo Cheng said: 'Not able.",
  "s0502": "Zhou not listen, is Gong know difficult yet relation sparse at Zhou.'"
}

