{
  "s0001": "Wu Zixu was a Chu man, named Yuan.",
  "s0002": "Yuan's father was named Wu She.",
  "s0003": "Yuan's elder brother was named Wu Shang.",
  "s0004": "His ancestor was named Wu Ju, who served King Zhuang of Chu with upright remonstration, gained prominence, therefore his descendants were famous in Chu.",
  "s0005": "King Ping of Chu had a crown prince named Jian, made Wu She grand tutor, Fei Wuji junior tutor.",
  "s0006": "Wuji was not loyal to Crown Prince Jian.",
  "s0007": "King Ping sent Wuji to take a wife for the crown prince from Qin, the Qin woman was beautiful, Wuji galloped back to report to King Ping saying: 'The Qin woman is exceptionally beautiful, the king can take her himself, and get another wife for the crown prince.'",
  "s0008": "King Ping then took the Qin woman himself and doted on her exclusively, gave birth to son Zhen.",
  "s0009": "Got another wife for the crown prince.",
  "s0010": "Wuji having used the Qin woman to curry favor with King Ping, then left the crown prince and served King Ping.",
  "s0011": "Feared that once King Ping died and the crown prince ascended, he would kill him, so slandered Crown Prince Jian.",
  "s0012": "Jian's mother was a Cai woman, had no favor with King Ping.",
  "s0013": "King Ping gradually grew more distant from Jian, made Jian guard Chengfu, prepare border troops.",
  "s0014": "After a while, Wuji again day and night spoke of the crown prince's faults to the king saying: 'Because of the Qin woman's matter, the crown prince cannot but harbor resentment, I wish the king would slightly prepare himself.",
  "s0015": "Since the crown prince dwells in Chengfu, commands troops, externally associates with feudal lords, and moreover wishes to enter and make chaos.'",
  "s0016": "King Ping then summoned his grand tutor Wu She to interrogate him.",
  "s0017": "Wu She knew Wuji was slandering the crown prince to King Ping, so said: 'Why does the king alone use slanderous traitorous petty officials to estrange flesh and blood kin?'",
  "s0018": "Wuji said: 'If the king does not control this now, the matter will succeed.",
  "s0019": "The king will soon be captured.'",
  "s0020": "Then King Ping was angry, imprisoned Wu She, and sent Chengfu commander Fu Yang to go kill the crown prince.",
  "s0021": "Before arriving, Fu Yang sent someone to first warn the crown prince: 'Crown prince flee quickly, otherwise will be executed.'",
  "s0022": "Crown Prince Jian fled to Song.",
  "s0023": "Wuji spoke to King Ping saying: 'Wu She has two sons, both worthy, if not executed will be a worry for Chu.",
  "s0024": "Can use their father as hostage and summon them, otherwise will become a calamity for Chu.'",
  "s0025": "The king sent an envoy to tell Wu She: 'If you can bring your two sons then live, if cannot then die.'",
  "s0026": "Wu She said: 'Shang is humane in character, if called will certainly come.",
  "s0027": "Yuan is fierce and harsh in character, can endure humiliation, can accomplish great matters, he seeing that coming means both captured, the situation certainly will not come.'",
  "s0028": "The king did not listen, sent someone to summon the two sons saying: 'Come, I will let your father live;",
  "s0029": "If not come, now kill She.'",
  "s0030": "Wu Shang wished to go, Yuan said: 'Chu's summoning of us brothers is not to let our father live, fears there are escapees who will later cause trouble, therefore uses father as hostage, deceives and summons the two sons.",
  "s0031": "Two sons arrive, then father and sons all die.",
  "s0032": "What benefit father's death?",
  "s0033": "Going just lets the enemy not be avenged.",
  "s0034": "Better to flee to another state, borrow strength to avenge father's humiliation, together extinguished, no benefit.'",
  "s0035": "Wu Shang said: 'I know going ultimately cannot save father's life.",
  "s0036": "But hate that father summoned me seeking life and not go, later cannot avenge humiliation, ultimately become world's laughingstock.'",
  "s0037": "Told Yuan: 'You can go!",
  "s0038": "If you can avenge killing father's enemy, I will return and die.'",
  "s0039": "Shang having been captured, the envoy captured Wu Xi.",
  "s0040": "Wu Xi strung his bow and held arrows pointing at the envoy, the envoy dared not advance, Wu Xi then fled.",
  "s0041": "Heard Crown Prince Jian was in Song, went to follow him.",
  "s0042": "She heard of Wu Xi's flight, said: 'Chu's ruler and ministers will suffer from warfare.'",
  "s0043": "Wu Shang arrived in Chu, Chu executed both She and Shang.",
  "s0044": "Wu Xi having arrived in Song, Song had the Hua clan rebellion, so together with Crown Prince Jian fled to Zheng.",
  "s0045": "The Zheng people treated them very well.",
  "s0046": "Crown Prince Jian again went to Jin, Duke Qing of Jin said: 'The crown prince is on good terms with Zheng, Zheng trusts the crown prince.",
  "s0047": "If the crown prince can be my internal supporter, and I attack from outside, extinguishing Zheng is certain.",
  "s0048": "Extinguish Zheng and enfeoff the crown prince.'",
  "s0049": "The crown prince then returned to Zheng.",
  "s0050": "The matter had not come to pass, but Hui privately desired to kill his followers, the followers knew his plot, so reported it to Zheng.",
  "s0051": "Duke Ding of Zheng and Zi Chan executed Crown Prince Jian.",
  "s0052": "Jian had a son named Sheng.",
  "s0053": "Wu Xi feared, so together with Sheng fled to Wu.",
  "s0054": "Arrived at Zhao Pass, Zhao Pass wished to capture them.",
  "s0055": "Wu Xi then with Sheng alone on foot fled, almost could not escape.",
  "s0056": "Pursuers behind.",
  "s0057": "Arrived at the Jiang, on the Jiang there was a fisherman in a boat, knew Wu Xi urgency, so ferried Wu Xi.",
  "s0058": "Wu Xi having crossed, untied his sword saying: \"This sword worth one hundred jin, give to father.\"",
  "s0059": "Father said: \"Chu law, one who gets Wu Xi granted five myriads shi grain, rank holding jade gui, how just one hundred jin sword!\"",
  "s0060": "Did not accept.",
  "s0061": "Wu Xi not yet arrived Wu fell ill, stopped midway, begged food.",
  "s0062": "Arrived Wu, King Liao of Wu in power, Prince Guang general.",
  "s0063": "Wu Xi then through Prince Guang sought audience King Wu.",
  "s0064": "After long time, King Ping Chu with his border town Zhongli and Wu border town Bei Liang clan both sericulture, two women quarreled mulberry attacked each other, greatly angered, extent both states raised troops invade each other.",
  "s0065": "Wu sent Prince Guang attack Chu, captured their Zhongli, Ju Chao returned.",
  "s0066": "Wu Zixu advised King Liao Wu saying: \"Chu can broken.",
  "s0067": "Wish again send Prince Guang.\"",
  "s0068": "Prince Guang told King Wu: \"That Wu Xi father elder brother slaughtered by Chu, advises king attack Chu, desires personally avenge his enmity.",
  "s0069": "Attack Chu not yet can break.\"",
  "s0070": "Wu Xi knew Prince Guang had inner ambitions, wished kill king establish himself, could not advise external matters, introduced Zhuan Zhu to Prince Guang, withdrew with Crown Prince Jian son Sheng farmed fields.",
  "s0071": "Five years King Ping Chu died.",
  "s0072": "Initially, King Ping seized Crown Prince Jian Qin woman gave birth son Zhen, King Ping died, Zhen finally established heir, this King Zhao.",
  "s0073": "King Liao Wu took advantage Chu mourning, sent two princes lead troops invade Chu.",
  "s0074": "Chu sent troops cut Wu troops rear, could not return.",
  "s0075": "Wu state interior empty, Prince Guang ordered Zhuan Zhu assassinate King Liao Wu established himself, this King Helü Wu.",
  "s0076": "Helü established, achieved ambitions, summoned Wu Yuan envoy, with him planned state affairs.",
  "s0077": "Chu executed its ministers Xi Wan, Bo Zhou Li, Bo Zhou Li grandson Bo Pi fled Wu, Wu also made Pi grand master.",
  "s0078": "Former King Liao sent two princes lead troops attack Chu, way cut could not return.",
  "s0079": "Later heard Helü assassinated King Liao self-established, then their troops surrendered Chu, Chu enfeoffed them Shu.",
  "s0080": "Helü established three years, raised troops with Wu Xi, Bo Pi attacked Chu, captured Shu, captured former Wu rebel two generals.",
  "s0081": "Wished go Ying, General Sun Wu said: \"People weary, not yet can, moreover wait.\"",
  "s0082": "Then returned.",
  "s0083": "Fourth year, Wu attacked Chu, took Liu and Qian.",
  "s0084": "Fifth year, attacked Yue, defeated them.",
  "s0085": "Sixth year, King Zhao Chu sent Prince Nang Wa lead troops attack Wu.",
  "s0086": "Wu sent Wu Xi meet attack, greatly defeated Chu army Yu Zhang, took Chu Ju Chao.",
  "s0087": "Ninth year, King Helü Wu told Wu Xi, Sun Wu: \"Initially you said Ying not enter, now indeed how?\"",
  "s0088": "Two replied: \"Chu general Nang Wa greedy, Tang, Cai all resent him.",
  "s0089": "King must greatly attack, must first get Tang, Cai then can.\"",
  "s0090": "Helü listened, completely raised troops with Tang, Cai attacked Chu, with Chu lined across Han water.",
  "s0091": "Wu king younger brother Fu Gai led troops requested follow, king not listened, then his followers five thousand attacked Chu general Zi Chang.",
  "s0092": "Ji Mao, King Zhao Chu fled.",
  "s0093": "Geng Chen, King Wu entered Ying.",
  "s0094": "Zi Chang defeated fled, went Zheng.",
  "s0095": "Then Wu took advantage victory advanced, five battles, arrived Ying.",
  "s0096": "King Zhao fled, entered Yun Meng;",
  "s0097": "Bandits attacked king, king fled Yun.",
  "s0098": "Yun duke younger brother Huai said: \"King Ping killed my father, I kill his son, not also can!\"",
  "s0099": "Yun duke feared his younger brother kill king, with king fled Sui.",
  "s0100": "Wu troops surrounded Sui, told Sui people: \"Zhou descendants in Han region, Chu completely extinguished them.\"",
  "s0101": "Sui people wished to kill king, Prince Qi hid king, himself became king to block it.",
  "s0102": "Sui people divined give king to Wu, not auspicious, then declined Wu not give king.",
  "s0103": "Initially Wu Xi with Shen Bao Xu were friends, Xi fled, told Bao Xu: \"I must overturn Chu.\"",
  "s0104": "Bao Xu said: \"I must preserve it.\"",
  "s0105": "When Wu troops entered Ying, Wu Zixu sought King Zhao.",
  "s0106": "Having not obtained, then dug King Ping of Chu tomb, removed his corpse, whipped it three hundred times, then stopped.",
  "s0107": "Shen Bao Xu fled mountain midst, sent person tell Wu Xi: \"Your avenging enmity, is it excessive!",
  "s0108": "I heard, many people win heaven, heaven determined also can break people.",
  "s0109": "Now you formerly King Ping minister, personally north faced served him, now to mutilating dead person, this how no heaven way extreme!\"",
  "s0110": "Wu Xi said: \"For me thank Shen Bao Xu, my day evening path far, I therefore inverted walk reverse apply it.\"",
  "s0111": "Then Shen Bao Xu went Qin report urgent, sought aid from Qin.",
  "s0112": "Qin not permitted.",
  "s0113": "Bao Xu stood Qin court, day night cried, seven days seven nights not ceased sound.",
  "s0114": "Qin Ai Gong pitied him, said: \"Chu though no way, has minister like this, can no preserve?\"",
  "s0115": "Then sent five hundred chariots save Chu attack Wu.",
  "s0116": "Sixth month, defeated Wu troops at Ji.",
  "s0117": "Met Wu king long stayed Chu sought King Zhao, Helü younger brother Fu Gai fled returned, self-established as king.",
  "s0118": "Helü heard it, then released Chu returned, attacked his younger brother Fu Gai.",
  "s0119": "Fu Gai defeated fled, then went Chu.",
  "s0120": "King Zhao of Chu saw Wu had internal chaos, then again entered Ying.",
  "s0121": "Enfeoffed Fu Gai at Tang Xi, became Tang Xi clan.",
  "s0122": "Chu again battled Wu, defeated Wu, Wu king then returned.",
  "s0123": "After two years, Helü made crown prince Fu Chai lead troops attack Chu, took Fan.",
  "s0124": "Chu feared Wu again greatly come, then left Ying, moved to Jiao.",
  "s0125": "At this time, Wu with Wu Xi, Sun Wu strategy, west broke strong Chu, north awed Qi Jin, south subjugated Yue people.",
  "s0126": "Its after four years, Confucius chancellor Lu.",
  "s0127": "After five years, attacked Yue.",
  "s0128": "King Gou Jian of Yue welcomed attacked, defeated Wu at Gu Su, wounded Helü finger, army retreated.",
  "s0129": "Helü ill from wound about to die, told crown prince Fu Chai: \"You forget Gou Jian killed your father?\"",
  "s0130": "Fu Chai replied: \"Dare not forget.\"",
  "s0131": "This night, Helü died.",
  "s0132": "Fu Chai established as king, made Bo Pi grand steward, practiced battle archery.",
  "s0133": "After two years attacked Yue, defeated Yue at Fu Qiu.",
  "s0134": "King Gou Jian of Yue then with remaining troops five thousand dwelt atop Kui Ji, made grand master Zhong thick bribes send Wu grand steward Pi to request peace, sought to entrust state as minister concubine.",
  "s0135": "Wu king about to permit it.",
  "s0136": "Wu Xi remonstrated: \"King Gou Jian character able hardship.",
  "s0137": "Now king not extinguish, later must regret.\"",
  "s0138": "Wu king not listened, used grand steward Pi plan, made peace with Yue.",
  "s0139": "Its after five years, Wu king heard Qi Jing Gong died ministers contended favor, new jun weak, raised troops north attacked Qi.",
  "s0140": "Wu Xi remonstrated: \"Gou Jian eats not double flavors, mourns dead asks ill, moreover wishes use them.",
  "s0141": "This person not die, must become Wu calamity.",
  "s0142": "Now Wu having Yue, like person having abdominal heart disease.",
  "s0143": "King not first Yue but strives Qi, not also mistaken?\"",
  "s0144": "Wu king not listened, attacked Qi, greatly defeated Qi troops at Ai Ling, then awed Zou Lu jun returned.",
  "s0145": "Increasingly estranged Wu Xi strategy.",
  "s0146": "Its after four years, Wu king will north attack Qi, King Gou Jian of Yue used Zi Gong strategy, led his multitudes help Wu, heavy treasures offered grand steward Pi.",
  "s0147": "Grand steward Pi already several received Yue bribes, loved trusted Yue extremely, day night spoke at Wu king.",
  "s0148": "Wu king trusted used Pi plan.",
  "s0149": "Wu Xi remonstrated: \"Yue, abdominal heart disease, now believe their empty words deception greedy Qi.",
  "s0150": "Break Qi, like stone field, nothing use.\"",
  "s0151": "Moreover Pan Geng admonition said: \"Have overturning not respectful, cut off extinguish them, make no remaining descendants, no make change seed at this yi.\"",
  "s0152": "This Shang so rose.",
  "s0153": "Wish king release Qi first Yue;",
  "s0154": "If not so, later will regret without reach.\"",
  "s0155": "Wu king not listened, sent Wu Xi to Qi.",
  "s0156": "Wu Xi about to depart, told his son: \"I several remonstrated king, king not used, I now see Wu perish.",
  "s0157": "You with Wu together perish, no benefit.\"",
  "s0158": "Then entrusted his son to Qi Bao Mu, returned reported Wu.",
  "s0159": "Wu grand steward Pi already with Wu Xi had enmity, because slandered: \"Wu Xi character firm violent, little kindness, suspicious treacherous, his resentment fear become deep calamity.",
  "s0160": "Former day king wished attack Qi, Wu Xi considered not can, king finally attacked had great merit.",
  "s0161": "Wu Xi ashamed his plan strategy not used, then reversed resented.",
  "s0162": "Now king again attack Qi, Wu Xi obstinate strong remonstrated, obstructed destroyed affairs, vainly hoped Wu defeat to self win his plan.",
  "s0163": "Now king personally go, all state midst martial strength attack Qi, Wu Xi remonstrated not used, because stopped declined, pretended ill not go.",
  "s0164": "King cannot not prepare, this raise calamity not difficult.",
  "s0165": "Moreover Pi made person secretly spy him, his envoy to Qi, entrusted his son to Qi Bao clan.",
  "s0166": "Being person minister, inner not content, outer relied feudal lords, self considered former king strategist, now not seen used, often vexed resented.",
  "s0167": "Wish king early plan it.\"",
  "s0168": "Wu king said: \"Without your words, I also doubted it.\"",
  "s0169": "Then sent envoy grant Wu Xi linked sword, said: \"You with this die.\"",
  "s0170": "Wu Xi gazed heaven sighed: \"Alas!",
  "s0171": "Slander minister Pi made chaos, king instead executed me.",
  "s0172": "I made your father hegemon.",
  "s0173": "From you not yet established, various princes contended establish, I with death contended for former king, almost not established.",
  "s0174": "You having obtained establish, wished divide Wu state give me, I still dared not hope.",
  "s0175": "However now you listen flatter minister words to kill elder.\"",
  "s0176": "Then told his attendant: \"Certainly plant my grave above with catalpa, make can become vessel;",
  "s0177": "Dig out my eyes hang Wu east gate above, to observe Yue bandits enter extinguish Wu.\"",
  "s0178": "Then self slit throat died.",
  "s0179": "Wu king heard greatly angered, took Wu Xi corpse contained with Chi Yi skin, floated on Jiang midst.",
  "s0180": "Wu people pitied him, established shrine on Jiang above, because named Xu Shan.",
  "s0181": "Wu king having executed Wu Xi, then attacked Qi.",
  "s0182": "Qi Bao clan killed their jun Dao Gong established Yang Sheng.",
  "s0183": "Wu king wished punish their traitor, not victorious departed.",
  "s0184": "Its after two years, Wu king summoned Lu Wei jun assembled at Tuo Gao.",
  "s0185": "Its next year, because north great assembled feudal lords at Huang Chi, to command Zhou house.",
  "s0186": "King Gou Jian of Yue suddenly killed Wu crown prince, broke Wu troops.",
  "s0187": "Wu king heard it, then returned, sent envoy thick gifts made peace with Yue.",
  "s0188": "After nine years, King Gou Jian of Yue then extinguished Wu, killed king Fu Chai;",
  "s0189": "Executed grand steward Pi, because not loyal to their jun, outer received heavy bribes, with self formed clique.",
  "s0190": "Wu Xi initially with together fled former Chu crown prince Jian son Sheng, at Wu.",
  "s0191": "Wu king Fu Chai time, Chu Hui Wang wished summon Sheng return Chu.",
  "s0192": "Ye Gong remonstrated: \"Sheng good brave secretly seek suicide troops, probably have private?\"",
  "s0193": "Hui Wang not listened.",
  "s0194": "Then summoned Sheng, made dwell Chu border yi Yan, number called Bai Gong.",
  "s0195": "Bai Gong returned Chu three years Wu executed Xi.",
  "s0196": "Bai Gong Sheng having returned Chu, resented Zheng killed his father, secretly nurtured suicide troops sought avenge Zheng.",
  "s0197": "Returned Chu five years, requested attack Zheng, Chu prime minister Zi Xi permitted.",
  "s0198": "Troops not issued Jin attacked Zheng, Zheng requested aid from Chu.",
  "s0199": "Chu sent Zi Xi go save, allied returned.",
  "s0200": "Bai Gong Sheng angered: \"Not Zheng enmity, Zi Xi.\"",
  "s0201": "Sheng self sharpened sword, people asked: \"What for?\"",
  "s0202": "Sheng said: \"Wish kill Zi Xi.\"",
  "s0203": "Zi Xi heard, laughed: \"Sheng like egg, what able do.\"",
  "s0205": "Its after four years, Bai Gong Sheng with Shi Qi suddenly killed Chu prime minister Zi Xi, commander Zi Qi at court.",
  "s0206": "Shi Qi said: \"Not kill king, cannot.\"",
  "s0207": "Then coerced king like Gao Fu.",
  "s0208": "Shi Qi follower Qu Gu carried Chu Hui Wang fled went Zhao Fu Ren palace.",
  "s0209": "Ye Gong heard Bai Gong made chaos, led his state people attacked Bai Gong.",
  "s0210": "Bai Gong followers defeated, fled mountain midst, committed suicide.",
  "s0211": "Captured Shi Qi, questioned Bai Gong corpse place, not speak would boil.",
  "s0212": "Shi Qi said: \"Affair become qing, not become boil, certainly its duty.\"",
  "s0213": "Finally not consented tell his corpse place.",
  "s0214": "Then boiled Shi Qi, sought Hui Wang again established him.",
  "s0215": "Grand Historian said: Resentment poison at people extreme!",
  "s0216": "Wang still cannot practice at ministers subordinates, moreover same rank!",
  "s0217": "Towards made Wu Xi follow She together die, what different ant.",
  "s0218": "Abandon small righteousness, avenge great humiliation, name hang at later generations, sad!",
  "s0219": "When Wu Xi distressed on Jiang above, path begged food, ambition how once moment forgot Ying?",
  "s0220": "Therefore concealed endured achieved merit name, not fierce husband who able reach this?",
  "s0221": "Bai Gong if not self established as jun, his merit plans also cannot all say!"
}