{
  "s0001": "Ping Yuan Jun Zhao Sheng, Zhao various duke son.",
  "s0002": "Various son middle Sheng most worthy, happy guests, guests cover arrive several thousand people.",
  "s0003": "Ping Yuan Jun chancellor Zhao Hui Wen Wang and Xiao Cheng Wang, three leave chancellor, three restore position, enfeoff at east Wu city.",
  "s0004": "Ping Yuan Jun house building face common people house.",
  "s0005": "Common people house have cripple, plate spread walk draw water.",
  "s0006": "Ping Yuan Jun beauty dwell building up, face see, greatly laugh him.",
  "s0007": "Tomorrow, cripple arrive Ping Yuan Jun gate, request: Minister hear jun happy scholar, scholar not far thousand li arrive, with jun can noble scholar cheap concubine.",
  "s0008": "Minister unfortunate have tired lame illness, jun rear palace face laugh minister, minister wish obtain laugh minister head.",
  "s0009": "Ping Yuan Jun laugh respond: Yes.",
  "s0010": "Cripple go, Ping Yuan Jun laugh: View this young child, then wish with one laugh reason kill my beauty, not also extreme!",
  "s0011": "Finally not kill.",
  "s0012": "Dwell year more, guests gate below house person gradually leave over half.",
  "s0013": "Ping Yuan Jun strange, say: Sheng so wait various jun not dare lose ritual, leave why many?",
  "s0014": "Gate below one person before answer: With jun not kill laugh cripple, with jun love color cheap scholar, scholar then leave.",
  "s0015": "Then Ping Yuan Jun then behead laugh cripple beauty head, self make gate advance cripple, because apologize.",
  "s0016": "After gate below then again gradually come.",
  "s0017": "This time Qi have Meng Chang, Wei have Xin Ling, Chu have Chun Shen, therefore strive mutually incline treat scholar.",
  "s0018": "Qin surround Han Dan, Zhao make Ping Yuan Jun seek save, unite vertical at Chu, about with eat guests gate below have brave force literary martial complete twenty people together.",
  "s0019": "Ping Yuan Jun say: Make literary can take win, then good.",
  "s0020": "Literary cannot take win, then shed blood at Hua Wu below, must obtain fix vertical return.",
  "s0021": "Scholar not outer seek, take at eat guests gate below sufficient.",
  "s0022": "Obtain nineteen people, remain none can take, no fill twenty people.",
  "s0023": "Gate below have Mao Sui, before, self praise at Ping Yuan Jun: Sui hear jun will unite vertical at Chu, about with eat guests gate below twenty people together, not outer seek.",
  "s0024": "Now few one person, wish jun then with Sui complete member go.",
  "s0025": "Ping Yuan Jun say: Mister dwell Sheng gate below several year here?",
  "s0026": "Mao Sui say: Three year here.",
  "s0027": "Ping Yuan Jun say: Worthy scholar dwell world, like awl dwell bag middle, its point immediately see.",
  "s0028": "Now mister dwell Sheng gate below three year here, left right not have praise recite, Sheng not have hear, is mister no all.",
  "s0029": "Mister cannot, mister stay.",
  "s0030": "Mao Sui say: Minister then today request dwell bag middle.",
  "s0031": "Make Sui early obtain dwell bag middle, then tip emerge out, not only its point see only.",
  "s0032": "Ping Yuan Jun finally with Mao Sui together.",
  "s0033": "Nineteen people mutually eye laugh yet not abandon.",
  "s0034": "Mao Sui wait arrive Chu, with nineteen people discuss argue, nineteen people all submit.",
  "s0035": "Ping Yuan Jun with Chu unite vertical, speak its profit harm, day out speak, day middle not decide.",
  "s0036": "Nineteen people tell Mao Sui: Mister ascend.",
  "s0037": "Mao Sui press sword climb steps ascend, tell Ping Yuan Jun: Vertical profit harm, two words decide.",
  "s0038": "Today out speak vertical, day middle not decide, why?",
  "s0039": "Chu Wang tell Ping Yuan Jun: Guest what do?",
  "s0040": "Ping Yuan Jun say: Is Sheng house person.",
  "s0041": "Chu Wang scold: Why not descend!",
  "s0042": "I with your jun speak, you what do!",
  "s0043": "Mao Sui press sword before: Wang so scold Sui, with Chu country crowd.",
  "s0044": "Now ten step inside, wang not can rely Chu country crowd, wang life hang at Sui hand.",
  "s0045": "My jun in front, scold what?",
  "s0046": "Moreover Sui hear Tang with seventy li land wang world, Wen Wang with hundred li soil minister feudal lords, how their soldiers many, truly can occupy their power rouse their might.",
  "s0047": "Now Chu place five thousand li, hold halberd hundred thousand, this hegemon wang capital.",
  "s0048": "With Chu strong, world not can match.",
  "s0049": "Bai Qi, small young child, lead several thousand crowd, raise troops with Chu battle, one battle take Yan Ying, two battle burn Yi Ling, three battle insult wang ancestor.",
  "s0050": "This hundred generation grudge Zhao shame, wang not know hate.",
  "s0051": "Unite vertical for Chu, not for Zhao.",
  "s0052": "My jun in front, scold what?",
  "s0053": "Chu Wang say: Yes yes, truly if mister words, respectfully offer state altars for vertical.",
  "s0054": "Mao Sui say: Vertical fix?",
  "s0055": "Chu Wang say: Fix.",
  "s0056": "Mao Sui tell Chu Wang left right: Take chicken dog horse blood come.",
  "s0057": "Mao Sui hold copper plate kneel advance Chu Wang: Wang when shed blood fix vertical, next my jun, next Sui.",
  "s0058": "Sui fix vertical at hall up.",
  "s0059": "Mao Sui left hand hold plate blood right hand call nineteen people: Gong mutually shed this blood at hall below.",
  "s0060": "Gong equal equal, so called follow person complete affairs.",
  "s0062": "Ping Yuan Jun already fix vertical return, return arrive Zhao, say: Sheng not dare again match scholar.",
  "s0063": "Sheng match scholar many thousand people, few hundred number, self consider not lose world scholar, now then at Mao mister lose.",
  "s0064": "Mao mister one arrive Chu, make Zhao heavy nine tripods big bell.",
  "s0065": "Mao mister with three cun tongue, strong hundred thousand army.",
  "s0066": "Sheng not dare again match scholar.",
  "s0067": "Then with as upper guest.",
  "s0068": "Ping Yuan Jun already return Zhao, Chu make Chun Shen Jun lead troops hasten save Zhao, Wei Xin Ling Jun also false steal Jin Bi army go save Zhao, all not arrive.",
  "s0069": "Qin urgent surround Han Dan, Han Dan urgent, and surrender, Ping Yuan Jun very worried.",
  "s0070": "Han Dan guest house officer son Li Tong advise Ping Yuan Jun: Jun not worry Zhao perish?",
  "s0071": "Ping Yuan Jun say: Zhao perish then Sheng be captive, what not worry?",
  "s0072": "Li Tong say: Han Dan people, cook bone exchange child eat, can call urgent, yet jun rear palace with hundred number, maid concubine wear silk satin, remain fine grain meat, yet people coarse cloth not complete, bran chaff not satiated.",
  "s0073": "People tired troops exhaust, or sharpen wood make spear arrow, yet jun vessels bells chimes self as before.",
  "s0074": "Make Qin break Zhao, jun how obtain this?",
  "s0075": "Make Zhao obtain complete, jun what worry no have?",
  "s0076": "Now jun truly can make wife below weave at soldiers interval, divide labor work, family all scatter feast scholar, scholar when their danger bitter time, easy virtue.",
  "s0077": "Then Ping Yuan Jun from it, obtain dare die scholar three thousand people.",
  "s0078": "Li Tong then with three thousand people hasten Qin army, Qin army for retreat thirty li.",
  "s0079": "Also meet Chu Wei save arrive, Qin troops then stop, Han Dan again exist.",
  "s0080": "Li Tong battle die, enfeoff his father as Li Hou.",
  "s0081": "Yu Qing wish with Xin Ling Jun save Han Dan for Ping Yuan Jun request enfeoff.",
  "s0082": "Gong Sun Long hear, night drive see Ping Yuan Jun: Long hear Yu Qing wish with Xin Ling Jun save Han Dan for jun request enfeoff, have?",
  "s0083": "Ping Yuan Jun say: Correct.",
  "s0084": "Long say: This very not can.",
  "s0085": "Moreover wang raise jun chancellor Zhao, not with jun intelligence ability for Zhao country none.",
  "s0086": "Divide east Wu city enfeoff jun, not with jun have merit, with country people no achievement, then with jun close relative reason.",
  "s0087": "Jun receive chancellor seal not decline no ability, divide land not speak no merit, also self with close relative reason.",
  "s0088": "Now Xin Ling Jun save Han Dan request enfeoff, is close relative receive city country people count merit.",
  "s0089": "This very not can.",
  "s0090": "Moreover Yu Qing grasp its two power, affair complete, grasp right contract demand;",
  "s0091": "affair not complete, with empty name virtue jun.",
  "s0092": "Jun certainly not listen.",
  "s0093": "Ping Yuan Jun then not listen Yu Qing.",
  "s0094": "Ping Yuan Jun with Zhao Xiao Cheng Wang fifteen year die.",
  "s0095": "Son grandson succeed, after finally with Zhao together perish.",
  "s0096": "Ping Yuan Jun thick treat Gong Sun Long.",
  "s0097": "Gong Sun Long good make firm white same different debate, reach Zou Yan pass Zhao speak arrive way, then demote Gong Sun Long.",
  "s0098": "Yu Qing, travel speak scholar.",
  "s0099": "Step shoe hat advise Zhao Xiao Cheng Wang.",
  "s0100": "One see, grant gold hundred yi, white jade one pair;",
  "s0101": "Again see, for Zhao upper qing, therefore number as Yu Qing.",
  "s0102": "Qin Zhao battle at Chang Ping, Zhao not win, perish one du wei.",
  "s0103": "Zhao Wang summon Lou Chang with Yu Qing: Army battle not win, wei again die, my person make bind armor hasten it, how?",
  "s0104": "Lou Chang say: No benefit, not as send heavy envoy peace.",
  "s0105": "Yu Qing say: Chang speak peace, consider not peace army certainly break.",
  "s0106": "Yet control peace at Qin.",
  "s0107": "Moreover wang discuss Qin, wish break Zhao army, not?",
  "s0108": "Wang say: Qin not spare remain strength, certainly wish break Zhao army.",
  "s0109": "Yu Qing say: Wang listen minister, send envoy emerge heavy treasure attach Chu Wei, Chu Wei wish obtain wang heavy treasure, certainly inner our envoy.",
  "s0110": "Zhao envoy enter Chu Wei, Qin certainly suspect world unite vertical, moreover certainly fear.",
  "s0111": "Like this, then peace then can make.",
  "s0112": "Zhao Wang not listen, with Ping Yang Jun peace, send Zheng Zhu enter Qin.",
  "s0113": "Qin inner him.",
  "s0114": "Zhao Wang summon Yu Qing: My person make Ping Yang Jun peace at Qin, Qin already inner Zheng Zhu, qing for what like?",
  "s0115": "Yu Qing answer: Wang not obtain peace, army certainly break.",
  "s0116": "World celebrate battle all at Qin.",
  "s0117": "Zheng Zhu, noble person, enter Qin, Qin Wang with Ying Hou certainly bright heavy show world.",
  "s0118": "Chu Wei with Zhao peace, certainly not save wang.",
  "s0119": "Qin know world not save wang, then peace not can complete.",
  "s0120": "Ying Hou indeed bright Zheng Zhu show world celebrate battle win, finally not willing peace.",
  "s0121": "Chang Ping great defeat, then surround Han Dan, for world laugh.",
  "s0122": "Qin already relieve Han Dan surround, Zhao Wang enter court, make Zhao Hao bind affairs at Qin, divide six counties peace.",
  "s0123": "Yu Qing tell Zhao Wang: Qin attack wang, tired return?",
  "s0124": "Wang with its strength still can advance, love wang not attack?",
  "s0125": "Wang say: Qin attack I, not spare remain strength, certainly with tired return.",
  "s0126": "Yu Qing say: Qin with its strength attack its not can take, tired return, wang again with its strength not can take send it, is help Qin self attack.",
  "s0127": "Next year Qin again attack wang, wang no save.",
  "s0128": "Wang with Yu Qing words tell Zhao Hao.",
  "s0129": "Zhao Hao say: Yu Qing truly can exhaust Qin strength arrive place?",
  "s0130": "Truly know Qin strength not can advance, this pellet ball land not give, make Qin next year again attack wang, wang obtain not divide its inner peace?",
  "s0131": "Wang say: Please listen son divide, son can certainly make next year Qin not again attack I?",
  "s0132": "Zhao Hao answer: This not minister dare take responsibility.",
  "s0133": "Other day three Jin friendship at Qin, mutually good.",
  "s0134": "Now Qin good Han Wei attack wang, wang so serve Qin certainly not like Han Wei.",
  "s0135": "Now minister for foot below relieve negative close attack, open pass through currency, Qi connect Han Wei, to next year wang alone take satiated at Qin, this wang so serve Qin certainly after Han Wei.",
  "s0136": "This not minister dare take responsibility.",
  "s0138": "Wang with tell Yu Qing.",
  "s0139": "Yu Qing answer: Hao speak not peace, next year Qin again attack wang, wang obtain not divide its inner peace.",
  "s0140": "Now peace, Hao again with cannot certainly Qin not again attack.",
  "s0141": "Now though divide six cities, what benefit!",
  "s0142": "Next year again attack, again divide its strength not can take peace, this self exhaust art, not as no peace.",
  "s0143": "Qin though good attack, cannot take six counties;",
  "s0144": "Zhao though cannot guard, finally not lose six cities.",
  "s0145": "Qin tired return, troops certainly stop.",
  "s0146": "I with six cities collect world attack stop Qin, is I lose at world take repay at Qin.",
  "s0147": "My country still profit, who with sit divide land, self weak strong Qin!",
  "s0148": "Now Hao say Qin good Han Wei attack Zhao, certainly consider Han Wei not save Zhao wang army certainly alone have with wang serve Qin not like Han Wei, is make wang year with six cities serve Qin, then sit city exhaust.",
  "s0149": "Next year Qin again seek divide land, wang will give?",
  "s0150": "Not give, is abandon before merit provoke Qin calamity;",
  "s0151": "Give it, then no land give it.",
  "s0152": "Say strong good attack, weak not can guard.",
  "s0153": "Now sit listen Qin, Qin troops not tired many obtain land, is strong Qin weak Zhao.",
  "s0154": "With increase strong Qin divide more weak Zhao, its plan certainly not stop.",
  "s0155": "Moreover wang land have exhaust yet Qin seek no stop, with have exhaust land give no stop seek, its power certainly no Zhao.",
  "s0157": "Zhao Wang plan not fix, Lou Huan from Qin come, Zhao Wang with Lou Huan plan, say: Give Qin land how like not give, who auspicious?",
  "s0158": "Huan decline yield: This not minister can know.",
  "s0159": "Wang say: Although, try speak jun private.",
  "s0160": "Lou Huan answer: Wang also hear Gong Fu Wen Bo mother?",
  "s0161": "Gong Fu Wen Bo serve at Lu, illness die, woman for self kill at room middle two people.",
  "s0162": "His mother hear, not cry.",
  "s0163": "His assistant room say: How have son die not cry?",
  "s0164": "His mother say: Confucius, worthy person, pursue at Lu, yet this person not follow.",
  "s0165": "Now die yet woman for self kill two people, like this certainly its at elder thin at woman thick.",
  "s0166": "Therefore from mother speak, is worthy mother;",
  "s0167": "From wife speak, certainly not avoid be jealous wife.",
  "s0168": "Therefore its words one, speaker different then person heart change.",
  "s0169": "Now minister new from Qin come speak not give, then not plan;",
  "s0170": "Speak give, fear wang with minister for Qin: Therefore not dare answer.",
  "s0171": "Make minister obtain for great wang plan, not as give.",
  "s0172": "Wang say: Yes.",
  "s0174": "Yu Qing hear, enter see wang: This decorate speak, wang careful not give!",
  "s0175": "Lou Huan hear, go see wang.",
  "s0176": "Wang again with Yu Qing words tell Lou Huan.",
  "s0177": "Lou Huan answer: Not so.",
  "s0178": "Yu Qing obtain its one, not obtain its two.",
  "s0179": "Qin Zhao construct difficulty yet world all pleased, why?",
  "s0180": "Say I and because strong ride weak.",
  "s0181": "Now Zhao troops tired at Qin, world celebrate battle win then certainly all at Qin.",
  "s0182": "Therefore not as urgent divide land peace, to doubt world comfort Qin heart.",
  "s0183": "Not so, world will because Qin strong anger, ride Zhao tired, melon divide it.",
  "s0184": "Zhao and perish, what Qin scheme!",
  "s0185": "Therefore say Yu Qing obtain its one, not obtain its two.",
  "s0186": "Wish wang with this decide, not again plan.",
  "s0188": "Yu Qing hear, go see wang: Danger Lou Zi so for Qin, is more doubt world, yet what comfort Qin heart!",
  "s0189": "Alone not speak its show world weak?",
  "s0190": "Moreover minister speak not give, not solid not give only.",
  "s0191": "Qin seek six cities at wang, wang with six cities bribe Qi.",
  "s0192": "Qi, Qin deep enemy, obtain wang six cities, together strength west attack Qin, Qi listen wang, not wait words finish.",
  "s0193": "Then wang lose at Qi take repay at Qin, Qi Zhao deep enemy can report, show world have can do.",
  "s0194": "Wang with this issue sound, troops not spy at border, minister see Qin heavy bribe arrive Zhao return peace at wang.",
  "s0195": "From Qin peace, Han Wei hear, certainly all heavy wang;",
  "s0196": "Heavy wang, certainly emerge heavy treasure first wang.",
  "s0197": "Then wang one raise tie three countries close, with Qin easy way.",
  "s0198": "Then wang one raise tie three countries close, with Qin easy way.",
  "s0199": "Then make Yu Qing east see Qi Wang, with plan Qin.",
  "s0200": "Yu Qing not return, Qin messenger already at Zhao.",
  "s0201": "Lou Huan hear, flee go.",
  "s0202": "Zhao then enfeoff Yu Qing with one city.",
  "s0203": "Dwell moment, Wei request for vertical.",
  "s0204": "Zhao Xiao Cheng Wang summon Yu Qing plan.",
  "s0205": "Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical.",
  "s0206": "Pass Ping Yuan Jun, Ping Yuan Jun say: Wish qing discuss vertical.",
  "s0207": "Wang say: Wei request for vertical.",
  "s0208": "Answer: Wei wrong.",
  "s0209": "Wang say: My person solid not permit.",
  "s0210": "Answer: Wang wrong.",
  "s0211": "Answer: Wang wrong.",
  "s0212": "Answer: Minister hear small country with big country do affairs, have profit then big country accept its blessing, have defeat then small country accept its calamity.",
  "s0213": "Now Wei with small country request its calamity, wang with big country decline its blessing, minister therefore say wang wrong, Wei also wrong.",
  "s0214": "Now Wei with small country request its calamity, wang with big country decline its blessing, minister therefore say wang wrong, Wei also wrong.",
  "s0215": "Wang say: Good.",
  "s0216": "Then unite Wei for vertical.",
  "s0217": "Then unite Wei for vertical.",
  "s0218": "Wei Qi already die, not obtain intention, then write book, up collect Chun Qiu, down observe near world, say section righteousness, name number, measure probe, govern strategy, altogether eight scrolls.",
  "s0219": "Wei Qi already die, not obtain intention, then write book, up collect Chun Qiu, down observe near world, say section righteousness, name number, measure probe, govern strategy, altogether eight scrolls.",
  "s0220": "Grand Historian say: Ping Yuan Jun, light light muddy age good duke son, yet not see big body.",
  "s0221": "Low speak: Profit make intelligence dim, Ping Yuan Jun greedy Feng Ting evil speak, make Zhao trap Chang Ping troops forty more ten thousand crowd, Han Dan almost perish.",
  "s0222": "Yu Qing measure affairs probe emotion, for Zhao draw strategy, what its skillful!",
  "s0223": "Reach not endure Wei Qi, finally distressed at big Liang, common man and know its not can, more worthy person?",
  "s0224": "Yet Yu Qing not poor sorrow, also not can write book self see at later world.",
  "s0225": "Yet Yu Qing not poor sorrow, also not can write book self see at later world cloud."
}