{
  "s0081": "Han eleven years autumn, Chen Xi rebel Dai land, Gao Zu like Han Dan strike Xi troops, Yan wang Wan also strike its north east.",
  "s0082": "When this time, Chen Xi make Wang Huang seek save Xiong Nu.",
  "s0083": "Yan wang Wan also make his minister Zhang Sheng at Xiong Nu, speak Xi wait army break.",
  "s0084": "Zhang Sheng reach Hu, old Yan wang Zang Cha son Yan out perish at Hu, see Zhang Sheng said: 'Gong so heavy at Yan, with practice Hu affairs.'",
  "s0085": "Yan so long exist, with various hou number rebel, troops connect not decide.",
  "s0086": "Now gong become Yan desire urgent extinguish Xi wait, Xi wait already exhaust, next also reach Yan, gong wait also and become captive.",
  "s0087": "Gong what not make Yan and slow Chen Xi yet with Hu and?",
  "s0088": "Affairs wide, obtain long wang Yan;",
  "s0089": "That have Han urgent, able settle country.'",
  "s0090": "Zhang Sheng with think so, Xi private make Xiong Nu help Xi wait strike Yan.",
  "s0091": "Yan wang Wan suspect Zhang Sheng with Hu rebel, shang book please clan Zhang Sheng.",
  "s0092": "Sheng return, all way so become.",
  "s0093": "Yan wang Wu, then cheat judge other person, take off Sheng home belong, make obtain become Xiong Nu jian, yet yin make Fan Qi reach Chen Xi place, desire make long perish, connect troops not decide.",
  "s0094": "Han twelve years, east strike Qing Bu, Xi constant lead troops dwell Dai, Han make Fan Kuai strike cut Xi.",
  "s0095": "Its pi jiang descend, speak Yan wang Wan make Fan Qi pass plan plot at Xi place.",
  "s0096": "Gao Zu make shi summon Lu Wan, Wan claim illness.",
  "s0097": "Shang again make Pi Yang hou Shen Shi Qi, yu shi da fu Zhao Yao go welcome Yan wang, because examine ask left right.",
  "s0098": "Wan more fear, close hide, speak his fortunate minister said: 'Not Liu shi yet wang, alone I and Chang Sha ear.",
  "s0099": "Go year spring, Han clan Huai Yin, summer, kill Peng Yue, all Lü Hou plan.",
  "s0100": "Now shang illness, belong duty Lü Hou."
}
