{
  "s1": "The Grand Historian read the Spring and Autumn Annals, calendar records, and secret reports, and when he reached King Li of Zhou, he never failed to put down his book and sigh.",
  "s2": "He said: 'Alas, Shi Zhi foresaw it!'",
  "s3": "Zhou made ivory chopsticks and Ji Zi sighed.",
  "s4": "The Zhou way declined, the poets based it on the bed curtains, Guan Ju was made.",
  "s5": "Benevolence and righteousness deteriorated, Lu Ming satirized it.",
  "s6": "When it came to King Li, because he hated hearing his faults, the dukes and ministers feared execution and disaster arose, King Li then fled to Zhi, chaos began from the capital, and the Gong He administered government.",
  "s7": "After this, some used force to govern, the strong oppressed the weak, raised troops without asking the Son of Heaven.",
  "s8": "However, upholding the righteousness of the royal house, to use punitive expeditions as alliance leaders, governance by the five hegemons, feudal lords acted wantonly, licentious and extravagant without standards, traitorous ministers and usurping sons arose increasingly.",
  "s9": "Qi, Jin, Qin, Chu were very small in the time of established Zhou, their fiefs were either one hundred li or fifty li.",
  "s10": "Jin blocked the three rivers, Qi backed the eastern sea, Chu bordered the Jiang and Huai, Qin relied on Yong province's defenses, the four seas rose in succession, became hegemonic lords alternately, the great enfeoffments praised by Wen and Wu, all awed and submitted to them.",
  "s11": "Therefore Confucius clarified the kingly way, sought audience with over seventy lords, none could employ him, therefore west observed the Zhou house, discussed historical records and old traditions, rose from Lu and arranged the Spring and Autumn, above recorded Yin, below to Ai's obtaining the unicorn, condensed its wording and style, removed its complications, to establish righteous principles, the kingly way complete, human affairs harmonious.",
  "s12": "The seventy disciples' followers orally received its transmitted meaning, for there were satirical, critical, praising, tabooed, and diminishing words that could not be seen in writing.",
  "s13": "The Lu gentleman Zuo Qiu Ming feared his disciples each had different theories, each satisfied their own intentions, lost the truth, therefore based on Confucius's historical records fully explained its words, completed the Zuo Family Spring and Autumn.",
  "s14": "Duo Jiao made transmissions for Chu Wei Wang, for the wang could not fully observe the Spring and Autumn, selected successes and failures, finally forty chapters, became the Duo Family subtle meanings.",
  "s15": "In Zhao Xiao Cheng Wang's time, his chancellor Yu Qing presented selections from the Spring and Autumn above, observed recent trends below, also wrote eight scrolls, became the Yu Family Spring and Autumn.",
  "s16": "Lu Buwei was Qin Zhuang Xiang Wang's chancellor, also observed honoring the ancient above, selected and gathered from the Spring and Autumn, collected the six states' events, made eight surveys, six discussions, twelve records, became the Lu Family Spring and Autumn.",
  "s17": "And like Xun Qing, Meng Zi, Gong Sun Gu, Han Fei and others, each often gathered Spring and Autumn writings to write books, not the same as recorded accounts.",
  "s18": "Han chancellor Zhang Cang calculated the five virtues sequence, upper grand master Dong Zhong Shu pushed Spring and Autumn meanings, considerably wrote texts.",
  "s5876": "The Grand Historian says: Confucian scholars break its meanings, galloping persuaders display their rhetoric, not managing to synthesize its beginnings and ends;",
  "s5877": "Calendar people take its years and months, several schools honored divine movements, secret reports only record generation posthumous titles, their words brief, desiring to view the essentials is difficult.",
  "s5878": "Therefore tabulated the twelve feudal lords, from Gong He to Confucius, the table shows the Spring and Autumn, National Language scholars' critical views of flourishing and decline main points recorded in the scroll, for completing studies and governing ancient texts it is the essential summary."
}
