{
  "s0001": "The Grand Historian says: The Yin before is far back.",
  "s0002": "Zhou enfeoffed five ranks: duke, marquis, earl, viscount, baron.",
  "s0003": "However, enfeoffing Bo Qin, Kang Shu at Lu, Wei, lands each four hundred li, close kin righteousness, praised those with virtue;",
  "s0004": "Tai Gong at Qi, united five marquis lands, honored toil merit.",
  "s0005": "Wu Wang, Cheng, Kang enfeoffed several hundred, same surname fifty-five, above not over one hundred li, below thirty li, to assist protect royal house.",
  "s0006": "Guan, Cai, Kang Shu, Cao, Zheng, some exceeded some diminished.",
  "s0007": "Li, You after, royal house deficient, hou bo strong states rose, Son of Heaven weak, could not correct.",
  "s0008": "Not virtue not pure, form situation weak also.",
  "s0009": "Han rose, ordered two ranks.",
  "s0010": "Gaozu late years, not Liu clan wang, if no merit shang not established hou, world together executed them.",
  "s0011": "Gaozu sons younger brothers same surname wang nine states, though only Changsha different surname, merit minister hou hundred plus people.",
  "s0012": "From Yan Men, Tai Yuan east to Liao Yang, for Yan Dai states;",
  "s0013": "Chang Shan south, Tai Xing left turn, cross river, Ji, E, Zhen east thin sea, for Qi, Zhao states;",
  "s0014": "From Chen west, south to Jiu Yi, east belt Jiang, Huai, Gu, Si, thin Kui Ji, for Liang, Chu, Huai Nan, Changsha states: all outer connect Hu, Yue.",
  "s0015": "And inner lands north face mountains east exhaust feudal lords lands, great ones or five six jun, connected cities several ten, established hundred officials palaces observatories, usurped Son of Heaven.",
  "s0016": "Han alone had San He, Dong Jun, Ying Chuan, Nan Yang, from Jiang Ling west to Shu, north from Yun Zhong to Long Xi, with Nei Shi altogether fifteen jun, and princesses lie hou much eat yi among them.",
  "s0017": "Why?",
  "s0018": "World initially settled, bone flesh same surname few, therefore broad strong collateral descendants, to pacify four seas, use support protect Son of Heaven also.",
  "s0019": "Han settled hundred years interval, close relatives increasingly distant, feudal lords or arrogant extravagant, listened evil ministers planned made licentious chaos, great rebelled inverse, small not followed law, to endanger their lives, perished body lost state.",
  "s0020": "Son of Heaven observed upper ancient, then added favor, made feudal lords obtain push kindness divide sons younger brothers state yi, therefore Qi divided seven, Zhao divided six, Liang divided five, Huai Nan divided three, and Son of Heaven branch descendants sons as wang, wang sons branch descendants as hou, hundred plus.",
  "s0021": "Wu Chu time, before after feudal lords or because proper diminished lands, therefore Yan, Dai no north border jun, Wu, Huai Nan, Changsha no south border jun, Qi, Zhao, Liang, Chu branch jun famous mountains marshes seas all entered Han.",
  "s0022": "Feudal lords slightly diminished, great states not over ten plus cities, small hou not over several ten li, above sufficient serve tribute duty, below sufficient supply nourish sacrifices, to multiply assist capital.",
  "s0023": "And Han jun eighty ninety, form interlocked feudal lords interval, dog teeth mutually adjacent, grasped their narrow closed land profit, strong root trunk, weak branch leaf situation, honored lowly clear and ten thousand affairs each obtained their place.",
  "s0024": "Subject Qian respectfully recorded Gaozu since to Tai Chu feudal lords, tabulated their below increase diminish time, make time world obtain view.",
  "s0025": "Form situation though strong, essential with benevolence righteousness as foundation."
}
