{
  "s0053": "Then this what valued in color music pearl jade, what light in people.",
  "s0054": "This not what stride within control feudal lords method.",
  "s0055": "Minister heard land broad grain many, state great person many, troops strong then scholars brave.",
  "s0056": "Thus Tai mountain not reject soil, thus can complete its great;",
  "s0057": "River sea not choose fine streams, thus can reach its deep;",
  "s0058": "Kings not reject masses, thus can clarify their virtue.",
  "s0059": "Thus land no four directions, people no different states, four seasons full beautiful, ghosts gods descend fortune, this five emperors, three kings why no enemy.",
  "s0060": "Now abandon black heads to aid enemy states, reject guests to enrich feudal lords, make world scholars retreat not dare west face, wrap feet not enter Qin, this called 'borrow bandit troops give robber grain'.",
  "s0061": "Things not produce in Qin, can treasure many;",
  "s0062": "Scholars not produce in Qin, wish loyal many.",
  "s0063": "Now expel guests to aid enemy states, harm people to benefit enemies, inner self empty outer plant resentment in feudal lords, seek state no danger, cannot obtain.",
  "s0064": "Qin king then abolished expel guests order, restored Li Si office, finally used his plans.",
  "s0065": "Office to court wei.",
  "s0066": "Twenty plus years, finally united world, honored lord as emperor, with Si as chancellor.",
  "s0067": "Leveled commandery county cities, melted their weapons, showed not use again.",
  "s0068": "Made Qin no chi soil fiefs, not establish sons brothers as kings, merit ministers as feudal lords, made later no war attack worries.",
  "s0069": "Shi Huang thirty-fourth year, set wine Xianyang palace, erudite chief Zhou Qingchen etc. praised Shi Huang might virtue.",
  "s0070": "Qi person Chun Yu Yue advanced admonish: 'Minister heard, Yin Zhou kings thousand plus years, enfeoffed sons brothers merit ministers self as branch support.",
  "s0071": "Now Your Majesty has within seas, yet sons brothers as common men, suddenly have Tian Chang, six ministers worry, minister no assist correct, how rescue!",
  "s0072": "Affairs not model ancient can long lasting, not heard.",
  "s0073": "Now Qingchen etc. again face flatter to heavy Your Majesty error, not loyal ministers.'",
  "s0074": "Shi Huang sent his discussion to chancellor.",
  "s0075": "Chancellor considered wrong his words, demoted his speech, then submitted letter: 'Ancient world scattered chaotic, none could unite, thus feudal lords parallel rise, words all spoke ancient to harm now, adorned empty words to confuse real, people praised their private learning, to oppose above established.",
  "s0076": "Now Your Majesty united has world, distinguished black white determined one honor;",
  "s0077": "Yet private learning then mutually oppose not teach regulations, hear order down, then each with their private learning discuss, enter then heart oppose, exit then alley discuss, oppose lord make name, different paths make high, lead group below to make slander.",
  "s0078": "Like this not prohibit, then lord power descend above, factions form below.",
  "s0079": "Prohibit convenient.",
  "s0080": "Minister request all have literature poetry books hundred schools speech, eliminate remove them.",
  "s0081": "Order arrive full thirty days not go, tattoo city labor.",
  "s0082": "What not go, medicine divination planting trees books.",
  "s0083": "If have wish study, with officials as teachers.'",
  "s0084": "Shi Huang approved his discussion, collected removed poetry books hundred schools speech to make foolish hundred surnames, made world no with ancient oppose now.",
  "s0085": "Clarified law degrees, determined statutes orders, all with Shi Huang begin.",
  "s0086": "Unified writing.",
  "s0087": "Managed separate palaces guest halls, encircled world.",
  "s0088": "Next year, again toured inspect, outer repelled four Yi, Si all had strength.",
  "s0089": "Si eldest son You as three streams guard, various sons all married Qin princesses, girls all married Qin various princes.",
  "s0090": "Three streams guard Li You reported return Xianyang, Li Si set wine at home, hundred officials elders all front toast longevity, gate court chariots horses thousand number.",
  "s0091": "Li Si sighed deeply: 'Alas!",
  "s0092": "I heard Xun Qing say 'things prohibit great flourishing'.",
  "s0093": "That Si was Shangcai common clothes, alley black heads, above not know his inferior below, thus promoted to this.",
  "s0094": "Current person minister position none dwell minister above, can call rich noble extreme.",
  "s0095": "Things extreme then decline, I not know where stop.'",
  "s0097": "Shi Huang thirty-seventh year tenth month, traveled out tour Kuaiji, along sea, north reached Langye.",
  "s0098": "Chancellor Si, middle chariot bureau commander Zhao Gao concurrently administered tally seal affairs, all followed.",
  "s0099": "Shi Huang had twenty plus sons, eldest son Fu Su because repeatedly straightforward admonished above, above made supervise troops Shang commandery, Meng Tian as general.",
  "s0100": "Youngest son Hu Hai loved, requested follow, above permitted.",
  "s0101": "Other sons none followed.",
  "s0102": "That year seventh month, Shi Huang reached Shaqiu, illness grave, commanded Zhao Gao write grant crown prince Fu Su: 'Give troops to Meng Tian, with funeral meet Xianyang bury.'",
  "s0103": "Letter already sealed, not given envoy, Shi Huang collapsed."
}

