{
  "s2191": "Thirty-seventh year: attacked Zhou, wounding the king.",
  "s2198": "Twenty-fifth year: the Shan Rong attacked us.",
  "s2199": "Quwo Wu Gong killed Xiao Zi. Zhou attacked Quwo, establishing Jin Ai Hou's younger brother Min as Jin Hou. (Jin Hou Min's first year.)",
  "s2201": "Thirty-fifth year: invaded Sui; Sui implemented good government and they stopped.",
  "s2207": "Thirty-eighth year: Crown Prince Hu rescued Qi; Qi intended to marry him to their princess.",
  "s2220": "Second year: gave birth to Jing Zhong Wan. The Zhou scribe divined that Wan's descendants would become kings of Qi.",
  "s2233": "Thirty-seventh year: attacked Sui but did not capture it; made an alliance and withdrew troops.",
  "s2282": "Tenth year: arrested Ji Zhong.",
  "s2283": "Eighteenth year: Crown Prince Ji and his younger brother Shou contended and both died.",
  "s2300": "Seventh year: the duke committed adultery with a woman from Cai; Cai killed the duke.",
  "s2310": "Thirty-second year: Xi Gong commanded Wu Zhi to arrange official positions equivalent to the crown prince's.",
  "s2316": "Chen: Zhuang Gong Lin's first year (son of Huan Gong).",
  "s2328": "Sixth year: San Fu killed Chu Zi and established his elder brother as Wu Gong.",
  "s2335": "Third year: the feudal lords attacked us to avenge Song.",
  "s2341": "Fifteenth year: the Heavenly King requested chariots in an improper manner.",
  "s2342": "Qi: Xiang Gong Zhu Er's first year - demoted Wu Zhi's official position; Wu Zhi resented it.",
  "s2344": "Qin: Wu Gong's first year - attacked Peng, reaching Hua Mountain.",
  "s2347": "Third year: Shuo fled to Qi; they established Qian Mu.",
  "s2351": "Fourth year: Ji Zhong established Hu; the duke went to live in Li.",
  "s2356": "Zhuang Wang's first year: gave birth to son Kui.",
  "s2357": "Sixteenth year: the duke met with Cao, planning to attack Zheng.",
  "s2367": "Zheng: Zhao Gong Hu's first year. (Hu's mother was a woman from Deng; Ji Zhong married her.)",
  "s2372": "Second year: had a younger brother named Ke.",
  "s2373": "Seventeenth year: solar eclipse; the day was not recorded as the officials lost track of it.",
  "s2383": "Second year: Qu Mi killed Zhao Gong.",
  "s2389": "Eighteenth year: the duke and his consort went to Qi; Qi Hou committed adultery with her and sent Peng Sheng to kill the duke in his chariot.",
  "s2390": "Fourth year: killed Lu Huan Gong and executed Peng Sheng.",
  "s2404": "Fourth year: Zhou Gong wanted to kill the king and establish Zi Ke; the king executed Zhou Gong; Ke fled to Yan.",
  "s2415": "Zheng: Zi Ying's first year (younger brother of Zi Wei).",
  "s2428": "Chen: Xuan Gong Chu Jiu's first year (Chu Jiu, younger brother of Zhuang Gong).",
  "s2454": "Eighth year: attacked Ji, abandoning their capital city.",
  "s2457": "Fifty-first year: the king attacked; Sui reported that the consort's heart was disturbed; the king died in the army camp.",
  "s2469": "Fifth year: with Qi attacked Wei, welcoming Hui Gong (to the throne).",
  "s2473": "Chu: Wen Wang Zi's first year - first established the capital at Ying.",
  "s2489": "Second year: attacked Shen, passing through Deng; Deng's nephew said Chu could be conquered; Deng Hou refused.",
  "s2501": "Seventh year: stars fell like rain, accompanied by rain.",
  "s2507": "Tenth year: Qi established Hui Gong; Qian Mu fled to Zhou.",
  "s2517": "Eighth year: Zi Jiu came fleeing; together with Guan Zhong avoided Wu Zhi's rebellion.",
  "s2518": "Twelfth year: Wu Zhi killed the ruler and established himself.",
  "s2523": "Wei: Hui Gong Shuo returned (to the throne). (Fourteenth year of his reign.)",
  "s2533": "Ninth year: Lu wanted to enter (Qi) with Jiu but arrived later than Xiao Bai; Qi blocked Lu and had Sheng deliver Guan Zhong alive.",
  "s2534": "Qi: Huan Gong Xiao Bai's first year, spring - Qi killed Wu Zhi.",
  "s2549": "Tenth year: Qi attacked us because of Jiu.",
  "s2553": "Sixth year: Xi consort (a woman from Chen) passed through Cai; Cai treated her discourteously so she hated them. Chu attacked Cai, captured Ai Hou, and returned.",
  "s2557": "Eleventh year: Chu captured our ruler.",
  "s2565": "Eleventh year: Zang Wen Zhong expressed condolences for Song's flooding.",
  "s2570": "Ninth year: Song suffered a great flood; the duke blamed himself. Lu sent Zang Wen Zhong to express condolences.",
  "s2586": "Tenth year: Wan killed the ruler; Qiu Mu acted righteously.",
  "s2597": "Thirteenth year: Cao Mo kidnapped Huan Gong and returned the lost territories.",
  "s2598": "Fifth year: met with people from Lu at Ke.",
  "s2602": "Song: Huan Gong Yu Shuo's first year (son of Zhuang Gong).",
  "s2630": "Seventh year: first became hegemon, assembling the feudal lords at Juan.",
  "s2631": "Twenty-eighth year: Quwo Wu Gong extinguished Jin Hou Min, presented treasures to Zhou; Zhou commanded Wu Gong to be ruler of Jin and annexed his territory.",
  "s2639": "Zheng: Li Gong's first year - Li Gong had fled and returned after seventeen years.",
  "s2647": "Jin: Wu Gong declared the annexation of Jin; already established thirty-eight years, did not change the reign title, continuing his first year.",
  "s2648": "Twentieth year: buried at Yong; first used humans to accompany in death.",
  "s2649": "Twelfth year: attacked Deng and extinguished it.",
  "s2655": "Second year: the feudal lords attacked us.",
  "s2663": "Thirty-ninth year: Wu Gong died; son Gui Zhu established as Xian Gong.",
  "s2664": "Qin: De Gong's first year (younger brother of Wu Gong).",
  "s2676": "Hui Wang's first year: took a consort from Chen.",
  "s2680": "Second year: first performed the Fu sacrifice, sacrificing to She; tore dogs at the four city gates.",
  "s2692": "Second year: Yan and Wei attacked the king; the king fled to Wen; Zi Kui was established.",
  "s2698": "Seventh year: took a woman from Wei. (Younger brother of Wen Gong.)",
  "s2704": "Sixteenth year: attacked the king; the king fled to Wen; Zi Kui was established.",
  "s2720": "Seventeenth year: Zheng captured our Zhong Fu.",
  "s2724": "Fourth year: executed Kui and restored Hui Wang.",
  "s2735": "Seventh year: rescued Zhou from disorder and restored the king.",
  "s2740": "Fifth year: the crown prince's mother died early. Hui consort gave birth to Shu Dai.",
  "s2742": "Fourteenth year: Chen Wan fled from Chen; the Tian clan began from this.",
  "s2743": "Fifth year: attacked Li Rong and obtained Ji.",
  "s2744": "Fourth year: established the Mi altar.",
  "s2745": "Fifth year: younger brother Yun killed Du Ao and established himself.",
  "s2748": "Twenty-first year: Li Gong's son Wan fled to Qi.",
  "s2757": "Twenty-third year: the duke went to Qi to observe the She sacrifice.",
  "s2791": "Eighth year: completely killed all the former Jin Hou's sons.",
  "s2807": "Ninth year: first built walls around Jiang as the capital.",
  "s2820": "Tenth year: granted Qi Hou the ducal command.",
  "s2855": "Twelfth year: Crown Prince Shen Sheng lived in Quwo, Chong Er in Pu city, Yi Wu in Qu. (Because of Li Ji.)",
  "s2886": "Twenty-third year: attacked Shan Rong for Yan's sake.",
  "s2901": "Thirty-second year: Zhuang Gong's younger brother Shu Ya died from poison. Qing Fu assassinated Zi Ban. Ji You fled to Chen and established Min Gong.",
  "s2919": "Sixteenth year: extinguished Wei, Geng, Huo. First enfeoffed Zhao Shu at Geng, Bi Wan at Wei - this began here.",
  "s2933": "Second year: Qing Fu killed Min Gong. Ji You from Chen established Shen as Xi Gong. Killed Qing Fu.",
  "s2935": "Seventeenth year: Shen Sheng served as general; the noblemen knew he would be discarded.",
  "s2939": "The Di attacked us. The duke favored cranes; the soldiers did not fight and our state was extinguished. The state resented it; Hui Gong caused disorder and extinguished his descendants. They again established Qian Mu's younger brother. (Wei: Dai Gong's first year.)",
  "s2949": "Lu: Xi Gong Shen's first year - Ai Jiang's funeral arrived from Qi.",
  "s2950": "Twenty-seventh year: killed younger sister (consort of Lu Zhuang Gong) because of debauchery.",
  "s2955": "Wei: Wen Gong Hui's first year (younger brother of Dai Gong).",
  "s2966": "Twenty-eighth year: built Chu Qiu for Wei; rescued from Rong Di attack.",
  "s2967": "Nineteenth year: Xun Xi used treasures to borrow passage from Yu to attack Guo, extinguishing Xia Yang.",
  "s2971": "Second year: Qi Huan Gong led the feudal lords to build Chu Qiu for us.",
  "s2982": "Twenty-ninth year: shared a boat with Cai Ji; it capsized the duke; the duke was angry and returned Cai Ji.",
  "s2989": "Eighteenth year: because of the woman, Qi attacked us.",
  "s2998": "Thirtieth year: led the feudal lords to attack Cai; Cai collapsed; then attacked Chu, demanding the tribute of wrapped mugwort.",
  "s2999": "Twenty-first year: Shen Sheng committed suicide due to Li Ji's slander. Chong Er fled to Pu; Yi Wu to Qu.",
  "s3000": "Fourth year: welcomed a consort from Jin.",
  "s3001": "Sixteenth year: Qi attacked us, reaching Xing; had Qu Wan conclude an alliance.",
  "s3015": "Twenty-second year: extinguished Yu and Guo. Chong Er fled to the Di.",
  "s3030": "Thirty-second year: led the feudal lords to attack Zheng.",
  "s3031": "Twenty-third year: Yi Wu fled to Liang."
}
