{
  "s0001": "Lord Shang was a bastard son of a branch of the Wei nobility, named Yang, surnamed Gongsun, his ancestry originally of the Ji surname.",
  "s0002": "Yang in youth delighted in the study of law and names, served as junior aide to Wei chancellor Gongshu Zuo.",
  "s0003": "Gongshu Zuo knew his worth, but had not yet advanced him.",
  "s0004": "Just then Zuo fell ill, King Hui of Wei personally went to inquire after his illness, said: 'If chancellor should die, what shall we do for the state?'",
  "s0005": "Gongshu said: 'My junior aide Gongsun Yang, though young, has extraordinary talent, I wish Your Majesty would entrust the entire state to him.'",
  "s0006": "The king was silent.",
  "s0007": "The king was about to leave when Zuo dismissed his attendants and said: 'If Your Majesty does not employ Yang, you must kill him, do not let him leave the borders.'",
  "s0008": "The king agreed and departed.",
  "s0009": "Gongshu Zuo summoned Yang and apologized: 'Just now when the king asked who could be chancellor, I recommended you, but the king's expression did not approve.",
  "s0010": "I am putting the ruler first and ministers second, so I told the king that if he does not employ Yang, he should kill him.",
  "s0011": "The king agreed to me.",
  "s0012": "You should leave quickly, you will soon be captured.'",
  "s0013": "Yang said: 'If he cannot employ you by following your recommendation to use me, how can he employ you by following your recommendation to kill me?'",
  "s0014": "He finally did not leave.",
  "s0015": "King Hui having departed, he told his attendants: 'Gongshu is gravely ill, how lamentable, he wants me to entrust the state to Gongsun Yang, is this not absurd!'",
  "s0017": "Gongshu having died, Gongsun Yang heard that Duke Xiao of Qin had issued an edict throughout the state seeking worthy men, intending to revive Duke Mu's achievements and eastward recover lost territories, so he went west to Qin, through Duke Xiao's favored minister Jing Jian to seek audience with Duke Xiao.",
  "s0018": "Duke Xiao having seen Wei Yang, spoke of affairs for a long time, Duke Xiao frequently dozed off, did not listen.",
  "s0019": "Retiring, Duke Xiao angrily rebuked Jing Jian: 'Your guest is a charlatan, how can he be employed!'",
  "s0020": "Jing Jian relayed this to Wei Yang.",
  "s0021": "Wei Yang said: 'I advised him with the way of the emperor, his will is not enlightened.'",
  "s0022": "After five days, he again sought to see Yang.",
  "s0023": "Yang again saw Duke Xiao, spoke even better, but still not to his liking.",
  "s0024": "Retiring, Duke Xiao again rebuked Jing Jian, Jing Jian also rebuked Yang.",
  "s0025": "Yang said: 'I advised him with the way of the king but it did not enter.",
  "s0026": "Please let me see him again.'",
  "s0027": "Yang again saw Duke Xiao, Duke Xiao approved but did not yet employ him.",
  "s0028": "Retiring and leaving.",
  "s0029": "Duke Xiao told Jing Jian: 'Your guest is good, one can converse with him.'",
  "s0030": "Yang said: 'I advised him with the way of hegemony, his intention desires to employ it.",
  "s0031": "If he truly sees me again, I will know it.'",
  "s0032": "Wei Yang again saw Duke Xiao.",
  "s0033": "The duke conversed with him, unconsciously slid forward on the mat.",
  "s0034": "Spoke for several days without tiring.",
  "s0035": "Jing Jian said: 'How did you hit upon our lord's pleasure?",
  "s0036": "Our lord's delight is extreme.'",
  "s0037": "Yang said: 'I advised the lord with the ways of emperors and kings compared to the Three Dynasties, but the lord said: \"Too distant, I cannot wait.",
  "s0038": "Moreover worthy rulers each in their own time make their name illustrious throughout the world, how can they gloomily wait decades or centuries to become emperors and kings?\"'",
  "s0039": "Therefore I advised him with methods to strengthen the state, the lord greatly delighted in them.",
  "s0040": "However it is also difficult to compare in virtue to Yin and Zhou.'",
  "s0042": "Duke Xiao having employed Wei Yang, Yang wished to change the laws, feared the world would criticize him.",
  "s0043": "Wei Yang said: 'Doubtful actions have no reputation, doubtful affairs have no merit.",
  "s0044": "Moreover those who practice superior conduct are surely criticized by the age;",
  "s0045": "Those with unique wisdom are surely scorned by the people.",
  "s0046": "Fools are dark about completed affairs, wise men see things at their inception.",
  "s0047": "The people cannot be consulted about beginnings but can enjoy successes.",
  "s0048": "Those who discuss supreme virtue do not harmonize with custom, those who accomplish great merit do not consult the multitude.",
  "s0049": "Therefore sages if they can strengthen the state, do not follow old laws;",
  "s0050": "If they can benefit the people, do not follow old rituals.'",
  "s0051": "Duke Xiao said: \"Good.\"",
  "s0052": "Gan Long said: \"Not so.",
  "s0053": "Sages do not change the people and teach, wise men do not alter laws and govern.",
  "s0054": "Following the people and teaching, without labor succeeds;",
  "s0055": "Following laws and governing, officials are familiar and people at peace with them.\"",
  "s0056": "Wei Yang said: \"What Long says is the talk of common customs.",
  "s0057": "Ordinary people are at peace with old customs, scholars drown in what they have heard.",
  "s0058": "With these two occupying office and keeping laws is acceptable, but not for discussing beyond the laws.",
  "s0059": "The Three Dynasties differed in ritual yet became kings, the Five Hegemons differed in law yet became hegemons.",
  "s0060": "Wise men create laws, fools are restricted by them;",
  "s0061": "Worthy men change rituals, worthless men are bound by them.\"",
  "s0062": "Du Zhi said: \"Benefit not a hundredfold, do not change law;",
  "s0063": "Merit not tenfold, do not change implements.",
  "s0064": "Following antiquity has no fault, following ritual has no error.\"",
  "s0065": "Wei Yang said: \"Governing the age is not one way, benefiting the state does not follow antiquity.",
  "s0066": "Therefore Tang and Wu did not follow antiquity and became kings, Xia and Yin did not change ritual and perished.",
  "s0067": "Those who oppose antiquity cannot be criticized, those who follow ritual are not worth praising.\"",
  "s0068": "Duke Xiao said: \"Good.\"",
  "s0069": "Employed Wei Yang as Left Senior Chamberlain, finally established the change law edict.",
  "s0070": "Ordered the people to form groups of ten and five, mutually supervise and connect in joint responsibility.",
  "s0071": "Those who do not report crimes are cut in half at the waist, those who report crimes receive same reward as beheading enemies, those who conceal crimes receive same punishment as surrendering to enemies.",
  "s0072": "Families with two or more sons not dividing households double their taxes.",
  "s0073": "Those with military merit each according to rate receive higher ranks;",
  "s0074": "Those who fight privately each according to severity receive punishments great and small.",
  "s0075": "Those who exert strength in fundamental occupations, farming and weaving produce much grain and silk are exempted from labor service.",
  "s0076": "Those who engage in secondary pursuits and indolent poor people are enslaved.",
  "s0077": "Royal clan without military merit discussion cannot be on the registers.",
  "s0078": "Clearly establish noble and base ranks and grades, each according to status names fields and houses, ministers and concubines clothing according to family rank.",
  "s0079": "Those with merit are illustrious and honored, those without merit though rich have no splendor.",
  "s0080": "The edict having been prepared but not yet promulgated, fearing the people would not believe, then erected a three zhang wooden pole in the southern gate of the capital market, recruited people who could move it to the northern gate rewarded ten jin.",
  "s0081": "The people thought it strange, none dared move it.",
  "s0082": "Again said \"Those who can move it receive fifty jin\".",
  "s0083": "One person moved it, immediately gave fifty jin, to show not deceiving.",
  "s0084": "Finally promulgated the edict.",
  "s0085": "The edict having circulated among the people for a year, Qin people in the capital who spoke of the initial edict being inconvenient numbered in the thousands.",
  "s0086": "Then the crown prince violated the law.",
  "s0087": "Wei Yang said: \"The law not being implemented starts from above violating it.\"",
  "s0088": "Would apply the law to the crown prince.",
  "s0089": "The crown prince is the ruler heir, cannot apply punishment, punished his tutor Gongzi Qian by tattoo, branded his teacher Gongsun Jia.",
  "s0090": "The next day, Qin people all rushed to obey the law.",
  "s0091": "Implemented for ten years, Qin people greatly delighted, roads had no lost items, mountains had no bandits, households sufficient people full.",
  "s0092": "People brave in public battles, cowardly in private fights, villages and towns greatly governed.",
  "s0093": "Qin people who initially said the edict was inconvenient came saying it was convenient, Wei Yang said \"These are all people who disrupt reform\", all relocated them to border cities.",
  "s0094": "Afterward the people dared not criticize the edict.",
  "s0095": "Then made Yang Grand Commandant.",
  "s0096": "Led troops besieged Wei Anyi, took it in surrender.",
  "s0097": "After three years, built and constructed the Ji Que palace courtyard in Xianyang, Qin moved the capital from Yong to it.",
  "s0098": "And ordered that people father and sons brothers sleeping in same room be forbidden.",
  "s0099": "And gathered small towns and villages into counties, established magistrates and assistants, altogether thirty-one counties.",
  "s0100": "Opened fields with paths and borders, and taxes made even.",
  "s0101": "Made bushels, pecks, balances, weights, rods, and feet uniform.",
  "s0102": "Implemented for four years, Gongzi Qian again violated the agreement, cut off his nose.",
  "s0103": "After five years, Qin people rich and strong, the Son of Heaven sent sacrificial meat to Duke Xiao, all feudal lords congratulated.",
  "s0104": "The next year, Qi defeated Wei troops at Ma Ling, captured their crown prince Shen, killed general Pang Juan.",
  "s0105": "The next year, Wei Yang advised Duke Xiao: \"Qin and Wei are like a person with abdominal heart disease, if Wei does not annex Qin, Qin will annex Wei.",
  "s0106": "Why?",
  "s0107": "Wei occupies the strategic pass west, capital at Anyi, borders Qin at the Yellow River and monopolizes the advantages east of the mountains.",
  "s0108": "When advantageous then invades west into Qin, when troubled then withdraws east to collect territory.",
  "s0109": "Now with Your Lordship wise and sage, the state relies on flourishing.",
  "s0110": "Wei in recent years greatly defeated by Qi, feudal lords rebel against it, can take advantage of this time to attack Wei.",
  "s0111": "Wei cannot withstand Qin, must move east.",
  "s0112": "Moving east, Qin occupies the Yellow River mountain stronghold, facing east to control the feudal lords, this is the enterprise of emperors and kings.\"",
  "s0113": "Duke Xiao considered it correct, sent Wei Yang to lead and attack Wei.",
  "s0114": "Wei sent Gongzi Ang to lead and attack him.",
  "s0115": "Armies having confronted, Wei Yang sent letter to Wei general Gongzi Ang: \"I initially was friendly with Gongzi, now both serve as generals of two states, cannot bear to attack each other, can meet Gongzi face to face, form alliance, joyfully drink and cease hostilities, to pacify Qin and Wei.\"",
  "s0116": "Wei Gongzi Ang considered it correct.",
  "s0117": "Alliance meeting completed, drinking, Wei Yang ambushed armored soldiers and attacked captured Wei Gongzi Ang, then attacked his army, completely defeated it and returned to Qin.",
  "s0118": "Wei Hui Wang troops repeatedly defeated by Qi and Qin, state internally empty, daily diminishing, fearful, then sent envoy to cede west of Yellow River territory to Qin to make peace.",
  "s0119": "Wei then left Anyi, moved capital to Da Liang.",
  "s0120": "Liang Hui Wang said: \"I regret not using Gongshu Zuo words.\"",
  "s0121": "Wei Yang having defeated Wei returned, Qin enfeoffed him with Shang fifteen cities, titled Lord Shang.",
  "s0122": "Lord Shang served as Qin chancellor ten years, royal clan nobles many resentful.",
  "s0123": "Zhao Liang saw Lord Shang.",
  "s0124": "Lord Shang said: \"Yang obtained audience through Meng Lan Gao, now Yang wishes to form friendship with you, acceptable?\"",
  "s0125": "Zhao Liang said: \"Servant does not dare desire it.",
  "s0126": "Kong Qiu has words: Advance worthy and place them above, gather unworthy and kings retreat.",
  "s0127": "Servant unworthy, therefore dare not accept command.",
  "s0128": "Servant heard: Not in position yet occupy it called greedy for position, not have name yet possess it called greedy for name.",
  "s0129": "Servant hears Your Lordship righteousness, then fears servant greedy for position greedy for name.",
  "s0130": "Therefore dare not hear command.\"",
  "s0131": "Lord Shang said: \"You not pleased with my governing Qin?\"",
  "s0132": "Zhao Liang said: \"Listen to opposition called intelligent, examine internally called clear, conquer self called strong.",
  "s0133": "Yu Shun has words: From humility still excellent.",
  "s0134": "Your Lordship not as good as follow Yu Shun way, no need ask servant.\"",
  "s0135": "Lord Shang said: \"Initially Qin Rong Di teachings, fathers and sons no distinction, same room dwelling.",
  "s0136": "Now I change their teachings, establish distinction between males and females, greatly build Ji Que, flourish like Lu and Wei.",
  "s0137": "You observe my governing Qin, who compares to Five Ram Skin Grand Master?\"",
  "s0138": "Zhao Liang said: \"Thousand sheep skins, not as one fox collar;",
  "s0139": "Thousand people yes-yes, not as one scholar frank-frank.",
  "s0140": "Wu Wang frank-frank to prosper, Yin Zhou flattering to perish.",
  "s0141": "Your Lordship if not criticize Wu Wang, then servant please all day correct words without punishment, acceptable?\"",
  "s0142": "Lord Shang said: \"Words have it, appearance words flowery, core words substantial, bitter words medicine, sweet words sickness.",
  "s0143": "Sir indeed willing all day correct words, Yang medicine.",
  "s0144": "Yang will serve Sir, Sir why decline!\"",
  "s0145": "Zhao Liang said: \"Five Ram Skin Grand Master, Jing barbarian.",
  "s0146": "Heard Qin Mu Gong worthy wished see, traveled without resources, sold self to Qin guest, wore coarse ate cattle.",
  "s0147": "One year, Mu Gong knew him, raised from cattle mouth below, placed above hundred families, Qin state none dared rival.",
  "s0148": "Served as Qin chancellor six seven years, east attacked Zheng, three times established Jin state rulers, once saved Jing state calamity.",
  "s0149": "Issued teachings within borders, Ba people sent tribute;",
  "s0150": "Extended virtue to feudal lords, eight Rong came submit.",
  "s0151": "You Yu heard of it, knocked border requested see.",
  "s0152": "Five Ram Skin Grand Master chancellor Qin, toil not ride carriage, heat not spread canopy, walked in state, not follow carriages, not grasp spear halberd, merit name stored in treasuries, virtue conduct applied to later generations.",
  "s0153": "Five Ram Skin Grand Master died, Qin state males females flowed tears, children not sing songs, pestle not pound.",
  "s0154": "This Five Ram Skin Grand Master virtue.",
  "s0155": "Now Your Lordship see Qin king, through favored person Jing Jian as master, not way to make name.",
  "s0156": "Chancellor Qin not take hundred families as affairs, greatly build Ji Que, not way to make merit.",
  "s0157": "Punish tattoo crown prince tutors, injure people with harsh punishments, this accumulate resentment store calamity.",
  "s0158": "Teach transform people deeper than commands, people serve superiors swifter than orders.",
  "s0159": "Now Your Lordship again left establish external change, not way to teach.",
  "s0160": "Your Lordship again face south call solitary person, daily restrain Qin noble sons.",
  "s0161": "Poetry says: Rat has body, person without ritual, person without ritual, why not quickly die.",
  "s0162": "Observe with poetry, not way for longevity.",
  "s0163": "Gongzi Qian closed door not go out already eight years, Your Lordship again kill Zhu Huan tattoo Gongsun Jia.",
  "s0164": "Poetry says: Obtain people prosper, lose people collapse.",
  "s0165": "These several matters, not ways to obtain people.",
  "s0166": "Your Lordship go out, following carriages ten several, retinue carriages carry armor, strong muscular paired ribs as chariot drivers, hold spears grasp halberds beside carriages hasten.",
  "s0167": "This one thing not prepared, Your Lordship certainly not go out.",
  "s0168": "Documents say: Rely on virtue prosper, rely on force perish.",
  "s0169": "Your Lordship danger like morning dew, still wish prolong years increase life?",
  "s0170": "Then why not return fifteen cities, irrigate gardens in outskirts, urge Qin king promote cave dwelling scholars, care for elderly preserve orphans, respect fathers elder brothers, order meritorious, honor virtuous, can slightly secure.",
  "s0171": "Your Lordship still greedy Shang richness, favor Qin state teachings, accumulate hundred families resentment, Qin king one day cast aside guests not establish court, Qin state means to collect Your Lordship, how slight!",
  "s0172": "Perish can lift foot await.\"",
  "s0173": "Lord Shang not follow.",
  "s0174": "After five months Qin Duke Xiao died, crown prince established.",
  "s0175": "Gongzi Qian followers informed Lord Shang wished rebel, sent officials capture Lord Shang.",
  "s0176": "Lord Shang fled to border pass, wished lodge in inn.",
  "s0177": "Innkeeper not know he was Lord Shang, said: \"Lord Shang law, lodge people without verification punish them.\"",
  "s0178": "Lord Shang sighed: \"Alas, law defects to this extent!\"",
  "s0179": "Departed to Wei.",
  "s0180": "Wei people resented his deceiving Gongzi Ang breaking Wei army, not accept.",
  "s0181": "Lord Shang wished go other states.",
  "s0182": "Wei people said: \"Lord Shang, Qin traitor.",
  "s0183": "Qin strong traitor enter Wei, not return, unacceptable.\"",
  "s0184": "Then sent back to Qin.",
  "s0185": "Lord Shang having returned to Qin, fled Shang city, with his followers raised city troops north out attacked Zheng.",
  "s0186": "Qin sent troops attacked Lord Shang, killed him at Zheng Meng Pool.",
  "s0187": "Qin Hui Wang ripped apart Lord Shang body to warn, said: \"None like Lord Shang rebel!\"",
  "s0188": "Then extinguished Lord Shang family.",
  "s0189": "Grand Historian said: Lord Shang, his natural endowment harsh thin person.",
  "s0190": "Trace his desire approach Duke Xiao with emperor king arts, grasped floating arguments, not his substance.",
  "s0191": "Moreover what relied on favored minister, obtained use, punished Gongzi Qian, deceived Wei general Ang, not follow Zhao Liang words, also sufficient to reveal Lord Shang little kindness.",
  "s0192": "I once read Lord Shang opening closing farming war book, with his person conduct similar.",
  "s0193": "Finally received evil name in Qin, reason!"
}