{
  "s0152": "Alas sorrowful, encountered age inauspicious!",
  "s0153": "Luan phoenix crouch hide, owl kite soar fly: despicable honored eminent, slanders obtain ambition;",
  "s0154": "Worthy sages dragged backward, upright overturned planted.",
  "s0155": "Age calls Bo Yi greedy, calls Dao Zhi honest;",
  "s0156": "Mo Ye made blunt, lead knife made sharp.",
  "s0157": "Alas dark dark, life without reason!",
  "s0158": "Turned abandoned Zhou tripod treasured marrow gourd, galloped drove exhausted ox hitched lame donkey, steed drooped two ears harnessed salt cart.",
  "s0159": "Ceremonial cap recommended shoes, gradually cannot last;",
  "s0160": "Alas bitter master, alone separate this blame!",
  "s0161": "Message says: Finished, state none know me, alone stifled depressed who speak?",
  "s0162": "Phoenix drifting high far, indeed self-shrink far go.",
  "s0163": "Follow nine abysses divine dragon, deep submerged self-treasure.",
  "s0164": "Profoundly hidden concealed place, how follow ants leeches?",
  "s0165": "Valued sages divine virtue, far muddy age self-hide.",
  "s0166": "Make qi ji can obtain tied restrained, how different from dogs sheep!",
  "s0167": "Various confused depart this fault, also master's guilt!",
  "s0168": "Look nine provinces mutually lord, why must cherish this capital?",
  "s0169": "Phoenix soars thousand ren above, views virtue solid descend;",
  "s0170": "Sees petty virtue dangerous signs, shakes increased feathers departed gone.",
  "s0171": "That common filth ditch, how can contain swallow boat fish!",
  "s0172": "Horizontal rivers lakes giant fish, indeed will controlled by ants mole crickets.",
  "s0173": "Jia Sheng as Changsha King tutor three years, owl flew into Jia Sheng residence, stopped at seat corner.",
  "s0174": "Chu people name owl 'fu'.",
  "s0175": "Jia Sheng since banished dwell Changsha, Changsha low wet, self-considered lifespan could not be long, injured mourned it, thus composed rhapsody self-consolation.",
  "s0176": "Its words say:",
  "s0177": "Single gate year, fourth month first summer, geng zi day si, fu gathered my residence, stopped at seat corner, appearance very leisurely.",
  "s0178": "Strange thing come gathered, privately strange its reason, opened book divined it, tally spoke its measure.",
  "s0179": "Said 'wild bird enter dwelling, master will depart'.",
  "s0180": "Request ask fu: 'I depart where go?",
  "s0181": "Auspicious tell me, inauspicious speak its calamity.",
  "s0182": "Dwell number measure, tell me its time.'",
  "s0183": "Fu then sighed, raised head shook wings, mouth cannot speak, requested respond with intention.",
  "s0184": "Myriad things change, indeed no rest.",
  "s0185": "Turn flow migrate, or push return.",
  "s0186": "Form qi transfer continue, change transform.",
  "s0187": "Profound silent no limit, how can exhaust speak!",
  "s0188": "Calamity fortune relies on, fortune calamity hides;",
  "s0189": "Worry joy gather gate, auspicious inauspicious same domain.",
  "s0190": "That Wu strong great, Fu Cha with defeat;",
  "s0191": "Yue dwelt Kui Ji, Gou Jian hegemon world.",
  "s0192": "Si You succeeded, finally suffered five punishments;",
  "s0193": "Fu Yue slave labor, then ministered Wu Ding.",
  "s0194": "Calamity and fortune, what different rope tangle.",
  "s0195": "Fate cannot explain, who knows its extreme?",
  "s0196": "Water shoots then dry, arrow shoots then far.",
  "s0197": "Myriad things turn press, shake move mutually transfer.",
  "s0198": "Cloud steams rain descends, wrong error mutually confused.",
  "s0199": "Great specialized turns things, vast presses no border.",
  "s0200": "Heaven cannot with deliberate, way cannot with plan.",
  "s0201": "Slow number has fate, evil know its time?"
}
