{
  "s0001": "Bai Qi, Mei man.",
  "s0002": "Skilled use troops, served Qin Zhao Wang.",
  "s0003": "Zhao Wang thirteen years, Bai Qi as left chancellor, general attack Han Xin Cheng.",
  "s0004": "This year, Marquis of Rang chancellor Qin, recommended Ren Bi as Han Zhong guard.",
  "s0005": "Next year, Bai Qi as left more, attacked Han Wei at Yi Guan, beheaded twenty four thousand, moreover captured their general Gong Sun Xi, took five cities.",
  "s0006": "Qi promoted to state wei.",
  "s0007": "Crossed Yellow River took Han An Yi east, to Qian River.",
  "s0008": "Next year, Bai Qi as da liang zao.",
  "s0009": "Attacked Wei, took it, took cities big small sixty one.",
  "s0010": "Next year, Qi with guest qing Cuo attacked Yuan Cheng, took it.",
  "s0011": "After five years, Bai Qi attacked Zhao, took Guang Lang city.",
  "s0012": "After seven years, Bai Qi attacked Chu, took Yan Deng five cities.",
  "s0013": "Next year, attacked Chu, took Ying, burned Yi Ling, then east to Jing Ling.",
  "s0014": "Chu Wang fled from Ying, east fled moved Chen.",
  "s0015": "Qin made Ying as Nan Jun.",
  "s0016": "Bai Qi promoted to Wu An Jun.",
  "s0017": "Wu An Jun because took Chu, pacified Wu Qian Zhong jun.",
  "s0018": "Zhao Wang thirty four years, Bai Qi attacked Wei, took Hua Yang, routed Mang Mao, captured three Jin generals, beheaded thirteen thousand.",
  "s0019": "With Zhao general Jia Yan battle, drowned their troops twenty thousand in river.",
  "s0020": "Zhao Wang forty three years, Bai Qi attacked Han Xing Cheng, took five cities, beheaded five thousand.",
  "s0021": "Forty four years, Bai Qi attacked Nan Yang Tai Xing road, cut it.",
  "s0022": "Forty five years, attacked Han Ye Wang.",
  "s0023": "Ye Wang surrendered Qin, Shang Dang road cut.",
  "s0024": "Its guard Feng Ting with people planned: Zheng road already cut, Han certainly cannot become people.",
  "s0025": "Qin troops day advance, Han cannot respond, not as with Shang Dang belong Zhao.",
  "s0026": "Zhao if accept us, Qin angry, certainly attack Zhao.",
  "s0027": "Zhao suffer troops, certainly close Han.",
  "s0028": "Han Zhao become one, then can match Qin.",
  "s0029": "Because made person report Zhao.",
  "s0030": "Zhao Xiao Cheng Wang with Ping Yang Jun, Ping Yuan Jun planned it.",
  "s0031": "Ping Yang Jun said: Not as not accept.",
  "s0032": "Accept it, calamity greater than obtained.",
  "s0033": "Ping Yuan Jun said: Without reason obtain one jun, accept convenient.",
  "s0034": "Zhao accepted it, because enfeoffed Feng Ting as Hua Yang Jun.",
  "s0035": "Forty six years, Qin attacked Han Gou Shi, Lin, took them.",
  "s0036": "Forty seven years, Qin made left chancellor Wang He attack Han, took Shang Dang.",
  "s0037": "Shang Dang people fled Zhao.",
  "s0038": "Zhao army Chang Ping, to press control Shang Dang people.",
  "s0039": "Four months, He because attacked Zhao.",
  "s0040": "Zhao made Lian Po general.",
  "s0041": "Zhao army soldiers violated Qin outpost troops, Qin outpost troops beheaded Zhao deputy general Jie.",
  "s0042": "Six months, trapped Zhao army, took two barriers four wei.",
  "s0043": "Seven months, Zhao army built ramparts walls guarded it.",
  "s0044": "Qin again attacked their ramparts, took two wei, defeated their battle formation, seized west ramparts walls.",
  "s0045": "Lian Po firm walls to await Qin, Qin several challenged, Zhao troops not emerge.",
  "s0046": "Zhao Wang several because this rebuked.",
  "s0047": "Qin chancellor Ying Hou moreover made person spend thousand gold at Zhao as reverse agent, said: Qin feared, only fear Ma Fu Zi Zhao Kuo general ear, Lian Po easy with, moreover surrender already.",
  "s0048": "Zhao Wang already angry Lian Po army many lost perished, army several defeated, moreover reverse firm walls not dare battle, moreover heard Qin reverse agent words, because made Zhao Kuo replace Lian Po general to attack Qin.",
  "s0049": "Qin heard Ma Fu Zi general, then secretly made Wu An Jun Bai Qi as supreme general.",
  "s0050": "Wang He as wei deputy general, ordered army have dare leak Wu An Jun general behead.",
  "s0051": "Zhao Kuo arrived, then sent troops attack Qin army.",
  "s0052": "Qin army feigned defeat fled, spread two surprise troops to ambush them.",
  "s0053": "Zhao army pursued victory, chased reached Qin walls.",
  "s0054": "Walls firm resisted could not enter, Qin surprise troops twenty five thousand cut Zhao army rear, moreover one army five thousand cavalry cut Zhao walls between, Zhao army divided into two, grain road cut.",
  "s0055": "Qin sent light troops attack them.",
  "s0056": "Zhao battle disadvantage, because built walls firm guarded, await rescue arrive.",
  "s0057": "Qin Wang heard Zhao food road cut, wang personally to He Nei, granted people rank each one level, mobilized age fifteen above all go Chang Ping, blocked Zhao rescue and grain.",
  "s0058": "To nine months, Zhao troops not obtain food forty six days, all internal secretly mutually killed ate.",
  "s0059": "Came attack Qin ramparts, wished emerge.",
  "s0060": "Made four teams, four five repeated, could not emerge.",
  "s0061": "Their general Zhao Kuo emerged elite troops personally fought, Qin army shot killed Zhao Kuo.",
  "s0062": "Kuo army defeated, troops forty thousand people surrendered Wu An Jun.",
  "s0063": "Wu An Jun planned: Before Qin already took Shang Dang, Shang Dang people not happy be Qin return Zhao.",
  "s0064": "Zhao troops changeable.",
  "s0065": "Not all kill them, fear become chaos.",
  "s0066": "Then deceived all pit killed them, sent their young two hundred forty return Zhao.",
  "s0067": "Before after beheaded captured forty five thousand people.",
  "s0068": "Zhao greatly shocked.",
  "s0069": "Forty eight years ten months, Qin again pacified Shang Dang jun.",
  "s0070": "Qin divided army two: Wang He attacked Pi Lao, took it;",
  "s0071": "Si Ma Geng pacified Tai Yuan.",
  "s0072": "Han Zhao feared, made Su Dai thick gifts advised Qin chancellor Ying Hou: Wu An Jun captured Ma Fu Zi?",
  "s0073": "Said: Correct.",
  "s0074": "Moreover said: Then surround Han Dan?",
  "s0075": "Said: Correct.",
  "s0076": "Zhao perish then Qin Wang wang, Wu An Jun become three gong.",
  "s0077": "Wu An Jun for Qin battle victory attack take seventy more cities, south pacified Yan Ying Han Zhong, north captured Zhao Kuo army, though Zhou Zhao Lu Wang merit not surpass this.",
  "s0078": "Now Zhao perish, Qin Wang wang, then Wu An Jun certainly become three gong, jun can be below him?",
  "s0079": "Though no desire be below, certainly cannot already.",
  "s0080": "Qin once attacked Han, surrounded Xing Qiu, trapped Shang Dang, Shang Dang people all rebelled for Zhao, world not happy be Qin people days long.",
  "s0081": "Now perish Zhao, north land enter Yan, east land enter Qi, south land enter Han Wei, then jun obtained people perish how many people.",
  "s0082": "Therefore not as because divide them, no make Wu An Jun merit.",
  "s0083": "Then Ying Hou spoke Qin Wang: Qin troops tired, please permit Han Zhao divide land peace, moreover rest soldiers.",
  "s0084": "Wang listened, divided Han Yuan Yong, Zhao six cities peace.",
  "s0085": "First month, all stopped troops.",
  "s0086": "Wu An Jun heard, from this with Ying Hou had gap.",
  "s0087": "Its nine months, Qin again sent troops, made wu da fu Wang Ling attack Zhao Han Dan.",
  "s0088": "This time Wu An Jun ill, not able go.",
  "s0089": "Forty nine years first month, Ling attacked Han Dan, little profit, Qin moreover sent troops assist Ling.",
  "s0090": "Ling troops perished five xiao.",
  "s0091": "Wu An Jun illness cured, Qin Wang wished make Wu An Jun replace Ling general.",
  "s0092": "Wu An Jun said: Han Dan indeed not easy attack.",
  "s0093": "Moreover feudal lords rescue day arrive, those feudal lords resent Qin days long.",
  "s0094": "Now Qin though broke Chang Ping army, Qin troops dead over half, domestic empty.",
  "s0095": "Far cut river mountain contend other state capital, Zhao respond internal, feudal lords attack external, break Qin army certain.",
  "s0096": "Not acceptable.",
  "s0097": "Qin Wang self commanded, not go;",
  "s0098": "Made Ying Hou request him, Wu An Jun finally declined not willing go, then claimed illness.",
  "s0099": "Qin Wang made Wang He replace Ling general, eight nine months surrounded Han Dan, could not take.",
  "s0100": "Chu made Chun Shen Jun and Wei Gong Zi led troops several tens thousand attacked Qin army, Qin army many lost perished.",
  "s0101": "Wu An Jun said: Qin not listen minister plan, now how!",
  "s0102": "Qin Wang heard, angry, strong raised Wu An Jun, Wu An Jun then claimed illness du.",
  "s0103": "Ying Hou requested him, not rise.",
  "s0104": "Then dismissed Wu An Jun as common soldier, moved to Yin Mi.",
  "s0105": "Wu An Jun ill, could not go.",
  "s0106": "Dwell three months, feudal lords attacked Qin army urgent, Qin army several retreated, messengers day arrived.",
  "s0107": "Qin Wang then made person sent Bai Qi, not allow stay Xian Yang.",
  "s0108": "Wu An Jun already went, emerged Xian Yang west gate ten li, arrived Du You.",
  "s0109": "Qin Zhao Wang with Ying Hou ministers discussed: Bai Qi migrate, his intention still discontent not submit, have surplus words.",
  "s0110": "Qin Wang then made messenger grant sword, self execute.",
  "s0111": "Wu An Jun drew sword about self stab, said: I what crime heaven arrive this!",
  "s0112": "Long time, said: I certainly should die.",
  "s0113": "Chang Ping battle, Zhao troops surrender several tens thousand people, I deceived all pit killed them, this sufficient die.",
  "s0114": "Then self killed.",
  "s0115": "Wu An Jun death, with Qin Zhao Wang fifty years eleven month.",
  "s0116": "Died not his crime, Qin people pitied him, villages all sacrificed.",
  "s0117": "Wang Jian, Bin Yang east village man.",
  "s0118": "Young liked troops, served Qin Shi Huang.",
  "s0119": "Shi Huang eleven years, Jian general attacked Zhao Yan Yu, broke it, took nine cities, eighteen years, Jian general attacked Zhao.",
  "s0120": "Year more, then took Zhao, Zhao Wang surrendered, all pacified Zhao land as jun.",
  "s0121": "Next year, Yan made Jing Ke assassin Qin, Qin Wang made Wang Jian attack Yan.",
  "s0122": "Yan Wang Xi fled Liao Dong, Jian then pacified Yan Ji returned.",
  "s0123": "Qin made Jian son Wang Ben attack Jing, Jing troops defeated.",
  "s0124": "Returned attacked Wei, Wei Wang surrendered, then pacified Wei land.",
  "s0125": "Qin Shi Huang already extinguished three Jin, routed Yan Wang, several broke Jing troops.",
  "s0126": "Qin general Li Xin, year young strong brave, once with troops several thousand pursued Yan crown prince Dan to Yan Shui, finally broke obtained Dan, Shi Huang considered worthy brave.",
  "s0127": "Then Shi Huang asked Li Xin: I wish attack take Jing, to general estimate use how many people sufficient?",
  "s0128": "Li Xin said: Not exceed use twenty thousand people.",
  "s0129": "Shi Huang asked Wang Jian, Wang Jian said: Not sixty thousand people not acceptable.",
  "s0130": "Shi Huang said: Wang general old, why timid!",
  "s0131": "Li general indeed powerful brave, his words correct.",
  "s0132": "Then made Li Xin and Meng Tian general twenty thousand south attack Jing.",
  "s0133": "Wang Jian words not used, because claimed illness, returned old Bin Yang.",
  "s0134": "Li Xin attacked Ping Yu, Meng Tian attacked Qin, greatly broke Jing army.",
  "s0135": "Xin moreover attacked Yan Ying, broke it, then led troops west, with Meng Tian met Cheng Fu.",
  "s0136": "Jing people because followed them, three days three nights not rested camped, greatly broke Li Xin army, entered two walls, killed seven du wei, Qin army fled.",
  "s0137": "Shi Huang heard, greatly angry, personally galloped like Bin Yang, saw apologized Wang Jian: I with not use general plan, Li Xin indeed humiliated Qin army.",
  "s0138": "Now heard Jing troops day advance west, general though ill, alone endure abandon I?",
  "s0139": "Wang Jian apologized: Old minister tired ill confused, wish great wang moreover choose worthy general.",
  "s0140": "Shi Huang apologized: Already, general not again speak!",
  "s0141": "Wang Jian said: Great wang certainly cannot already use minister, not sixty thousand people not acceptable.",
  "s0142": "Shi Huang said: For listen general plan.",
  "s0143": "Then Wang Jian led troops sixty thousand people, Shi Huang personally sent to Ba Shang.",
  "s0144": "Wang Jian went, requested beautiful fields houses gardens pools very many.",
  "s0145": "Shi Huang said: General go, why worry poor?",
  "s0146": "Wang Jian said: For great wang general, have merit finally not obtain enfeoff hou, therefore take great wang favor minister, minister also timely request gardens pools for sons grandsons industry.",
  "s0147": "Shi Huang greatly laughed.",
  "s0148": "Wang Jian already to pass, made messenger return requested good fields five times.",
  "s0149": "Some said: General beg borrow, also extreme.",
  "s0150": "Wang Jian said: Not so.",
  "s0151": "Qin Wang suspicious not trust people.",
  "s0152": "Now empty Qin state armored soldiers all entrust me, I not much request fields houses for sons grandsons industry self strengthen, instead make Qin Wang sit doubt me?",
  "s0154": "Wang Jian indeed replaced Li Xin attacked Jing.",
  "s0155": "Jing heard Wang Jian increased troops come, then all state troops resisted Qin.",
  "s0156": "Wang Jian arrived, firm walls guarded, not willing battle.",
  "s0157": "Jing troops several emerged challenged, finally not emerge.",
  "s0158": "Wang Jian day rested soldiers washed bathed, good ate drank stroked followed them, personally with soldiers ate together.",
  "s0159": "Long time, Wang Jian made person asked army play?",
  "s0160": "Replied: Just throwing stones jumping distances.",
  "s0161": "Then Wang Jian said: Soldiers usable.",
  "s0162": "Jing several challenged Qin not emerge, then led east.",
  "s0163": "Jian because raised troops pursued them, ordered strong men attacked, greatly broke Jing army.",
  "s0164": "To Qi south, killed their general Xiang Yan, Jing troops then defeated fled.",
  "s0165": "Qin because multiplied victory roughly pacified Jing land cities.",
  "s0166": "Year more, captured Jing Wang Fu Chou, finally pacified Jing land as jun county.",
  "s0167": "Because south attacked Bai Yue lords.",
  "s0168": "Wang Jian son Wang Ben, with Li Xin broke pacified Yan Qi land.",
  "s0169": "Qin Shi Huang twenty six years, all merged world, Wang clan, Meng clan merit most, name applied later generations.",
  "s0170": "Qin Er Shi time, Wang Jian and his son Ben all already died, moreover extinguished Meng clan.",
  "s0171": "Chen Sheng rebel Qin, Qin made Wang Jian grandson Wang Li attacked Zhao, surrounded Zhao Wang and Zhang Er Ju Lu city.",
  "s0172": "Some said: Wang Li, Qin famous general.",
  "s0173": "Now will strong Qin troops, attack new made Zhao, raise certainly.",
  "s0174": "Guest said: Not so.",
  "s0175": "Be general three generations certainly defeat.",
  "s0176": "Certainly defeat why?",
  "s0177": "Certainly their killed attacked many, after receive not auspicious.",
  "s0178": "Now Wang Li already three generations general.",
  "s0179": "Dwell no what, Xiang Yu saved Zhao, attacked Qin army, indeed captured Wang Li, Wang Li army then surrendered feudal lords.",
  "s0180": "Grand Historian said: Low saying: Chi have short, cun have long.",
  "s0181": "Bai Qi calculated enemy changed, emerged strange without limit, sound shook world, yet could not save calamity Ying Hou.",
  "s0182": "Wang Jian for Qin general, pacified six states, when that time, Jian as veteran general, Shi Huang respected him, yet could not assist Qin establish virtue, solidify root, stolen united took favor, to buried body.",
  "s0183": "To grandson Wang Li for Xiang Yu captured, not also suitable!",
  "s0184": "They each have their shortcomings."
}