{
  "s0001": "Lord Chunshen was a man of Chu, named Xie, surname Huang.",
  "s0002": "He traveled to study widely and gained broad knowledge, serving King Qingxiang of Chu.",
  "s0003": "King Qingxiang employed Xie for his eloquence and sent him as envoy to Qin.",
  "s0004": "King Zhao of Qin sent Bai Qi to attack Han and Wei, defeating them at Huayang, capturing Wei's general Mang Mao. Han and Wei submitted and served Qin.",
  "s0005": "King Zhao of Qin was about to order Bai Qi to join with Han and Wei to attack Chu, but the plan had not yet been carried out when Chu's envoy Huang Xie arrived in Qin and learned of Qin's plans.",
  "s0006": "At this time, Qin had previously sent Bai Qi to attack Chu, taking the commanderies of Wu and Qianzhong, capturing Ying and Yiling, advancing east to Jingling. King Qingxiang of Chu moved his capital east to Chen county.",
  "s0007": "Huang Xie saw that King Huai of Chu had been lured by Qin into attending court, then deceived and detained until death in Qin.",
  "s0008": "King Qingxiang was his son. Qin regarded him lightly and feared that in one campaign they could extinguish Chu.",
  "s0009": "Xie then presented a memorial advising King Zhao of Qin:",
  "s0010": "In all the world, none are stronger than Qin and Chu.",
  "s0011": "Now I hear Your Majesty wishes to attack Chu—this is like two tigers fighting each other.",
  "s0012": "When two tigers fight each other, the lame dog benefits from their exhaustion. It would be better to befriend Chu.",
  "s0013": "Allow me to explain my reasoning: I have heard that things reach an extreme and then reverse, like winter and summer.",
  "s0014": "When power reaches its peak it becomes dangerous, like piling up chess pieces.",
  "s0015": "Now Your Majesty's territory covers two-thirds of the world—this has not happened since the beginning of civilization, no kingdom of ten thousand chariots has ever achieved it.",
  "s0016": "The Former Kings Wen and Zhuang in three generations never rashly engaged in battle with Qi, to avoid cutting off the strategy of alliance through marriage.",
  "s0017": "Now Your Majesty has Sheng Qiao guarding affairs in Han, and Sheng Qiao has brought his territory into Qin. This is Your Majesty gaining a hundred li of land without using armor or showing force.",
  "s0018": "Your Majesty can truly be called capable.",
  "s0019": "Your Majesty again raised troops and attacked Wei, blocked the gates of Daliang, took Henei, captured Yan, Suantao, Xu, Tao, entered Xing. Wei's troops flew like clouds but dared not rescue.",
  "s0020": "Your Majesty's achievements are also numerous.",
  "s0021": "Your Majesty rested the troops for two years, then resumed campaigning.",
  "s0022": "Again annexing Pu, Yan, Shou, Yuan, threatening Ren and Pingqiu. Huang and Jiyang were besieged and the House of Wei submitted.",
  "s0023": "Your Majesty again cut off the north of Puyang, blocked Qin's vital routes to Qi, severed the spine connecting Chu and Zhao. The world united five times and gathered six times but dared not rescue.",
  "s0024": "Your Majesty's prestige is also unmatched.",
  "s0025": "If Your Majesty can maintain these achievements and prestige, set aside thoughts of conquest and expand the territory of benevolence and righteousness, avoiding future disasters, then the Three Kings would not be worth four, the Five Hegemons would not be worth six.",
  "s0026": "If Your Majesty relies on a multitude of common people and the strength of weapons and armor, taking advantage of having broken Wei's power, desiring to force the lords of the world to submit, I fear there will be future disasters.",
  "s0027": "The Book of Songs says: 'Nothing lacks a beginning, few achieve the end.'",
  "s0028": "The Book of Changes says: 'The fox fords the water, wets its tail.'",
  "s0029": "This speaks of how beginnings are easy but endings are difficult.",
  "s0030": "How do I know this is so?",
  "s0031": "In former times, the Zhi clan saw the advantage of attacking Zhao but did not foresee the disaster at Yuxi. Wu saw the convenience of attacking Qi but did not foresee the defeat at Gantui.",
  "s0032": "These two states were not without great achievements, but they were blinded by advantages in front and easily suffered disasters afterward.",
  "s0033": "Wu trusted Yue and followed them to attack Qi. Having defeated Qi at Ailing, on their return Yue's King Goujian captured them at the ford of Sanchu.",
  "s0034": "The Zhi clan trusted Han and Wei and followed them to attack Zhao, besieging Jinyang city. Victory was near, but Han and Wei rebelled against them, killing Zhi Boyao beneath the Zao Terrace.",
  "s0035": "Now Your Majesty envies that Chu has not been destroyed, but forgets that destroying Chu strengthened Han and Wei. I advise Your Majesty to consider this and not proceed.",
  "s0036": "The Book of Songs says: 'Great martial virtue dwells afar and does not cross.'",
  "s0037": "From this we can see that Chu is an ally.",
  "s0038": "Neighboring states are enemies.",
  "s0039": "The Book of Songs says: 'The rabbits leap about, and the hound catches them.",
  "s0040": "Others have their schemes, I fathom them.'",
  "s0041": "Now Your Majesty halfway believes in Han and Wei's loyalty to Your Majesty—this is exactly like Wu trusting Yue.",
  "s0042": "I have heard that enemies should not be lent aid, opportunities should not be lost.",
  "s0043": "I fear Han and Wei use humble words to remove their troubles but actually wish to deceive the great kingdom.",
  "s0044": "Why is this?",
  "s0045": "Your Majesty has no deep favors toward Han and Wei for generations, but has accumulated resentments for generations.",
  "s0046": "Fathers and sons, brothers of Han and Wei who have died at Qin's hands now reach ten generations.",
  "s0047": "Their home states are ruined, their altars of soil and grain destroyed, ancestral temples demolished.",
  "s0048": "Bellies ripped open, intestines severed, necks broken, jaws crushed, heads separated from bodies, corpses exposed in the wilds, skulls stiff and fallen, visible across the borders. Fathers and sons, old and young bound at the neck with hands tied, becoming groups of captives meeting on the roads.",
  "s0049": "Ghosts and spirits grieve in isolation, with no blood sacrifices.",
  "s0050": "The people cannot live, clans are scattered, those who have fled and become servants and concubines fill the seas within the four directions."
}

