{
  "s0101": "Lian Po heard of this, exposed his flesh and carried thorns on his back, came through the retainers to Lin Xiangru's gate to apologize.",
  "s0102": "Saying: 'This base person did not know the general's magnanimity reached this extent.'",
  "s0103": "Ultimately they became harmonious, forming the friendship of cutting necks.",
  "s0104": "This year, Lian Po attacked Qi east, breaking one of their armies.",
  "s0105": "Two years later, Lian Po again attacked Qi's Ji, capturing it.",
  "s0106": "Three years later, Lian Po attacked Wei's Fangling and Anyang, capturing them.",
  "s0107": "Four years later, Lin Xiangru led and attacked Qi, reaching Pingyi then stopped.",
  "s0108": "The next year, Zhao She broke the Qin army below Yan.",
  "s0109": "Zhao She was a tax collector of Zhao.",
  "s0110": "Collecting rents and taxes, the Lord Pingyuan household refused to pay. She enforced the law against them, killing nine of Lord Pingyuan's influential retainers.",
  "s0111": "Lord Pingyuan angered, wished to kill She.",
  "s0112": "She thus advised: 'You in Zhao are a noble lord. Now if your household violates and does not serve the public, then law diminished. Law diminished then state weak. State weak then feudal lords attack. Feudal lords attack means no Zhao. How can you have this wealth?",
  "s0113": "With your nobility, serving the public according to law then superiors and inferiors equal. Superiors and inferiors equal then state strong. State strong then Zhao secure, and you noble relative—how slight compared to the world?'",
  "s0114": "Lord Pingyuan considered him worthy, spoke of him to the king.",
  "s0115": "The king used him to manage state revenues. State revenues greatly balanced, people rich and treasuries full.",
  "s0116": "Qin attacked Han, encamped at Yan.",
  "s0117": "The king summoned Lian Po and asked: 'Can we rescue?'",
  "s0118": "He replied: 'The road distant and narrow, difficult to rescue.'",
  "s0119": "Again summoned Le Cheng and asked, Le Cheng replied like Lian Po.",
  "s0120": "Again summoned and asked Zhao She. She replied: 'The road distant and narrow, like two rats fighting in a hole—the braver will win.'",
  "s0121": "The king thus ordered Zhao She to lead, rescue them.",
  "s0122": "Troops departed Handan thirty li, then ordered in the army: 'Anyone who advises on military matters dies.'",
  "s0123": "Qin army encamped west of Wuan. Qin army beat drums and shouted, mobilizing troops. Wuan's roof tiles all shook.",
  "s0124": "Among the army a scout reported urgent rescue of Wuan. Zhao She immediately executed him.",
  "s0125": "Held firm the walls, stayed twenty-eight days without advancing, moreover increased the fortifications.",
  "s0126": "Qin spies came in, Zhao She fed them well and sent them away.",
  "s0127": "The spies reported to Qin general, Qin general greatly pleased: 'Departed the state thirty li yet army does not advance, moreover increases fortifications. Yan is not Zhao territory.'",
  "s0128": "Zhao She having sent away Qin spies, rolled up armor and rushed forward. In two days one night arrived, ordered good archers to encamp fifty li from Yan.",
  "s0129": "Army fortifications completed. Qin heard of this, all armored and came.",
  "s0130": "Soldier Xu Li requested to advise on military matters. Zhao She said: 'Enter.'",
  "s0131": "Xu Li said: 'Qin does not expect Zhao troops to come here. They come with strong spirit. General must densely gather the array to wait for them.",
  "s0132": "Otherwise, certainly defeated.'",
  "s0133": "Zhao She said: 'Receive the command.'",
  "s0134": "Xu Li said: 'Beg to submit to axe and awl punishment.'",
  "s0135": "Zhao She said: 'Afterward command Handan.'",
  "s0136": "Xu Li again requested to advise: 'First occupy the north mountain—the one above wins, later arrives defeated.'",
  "s0137": "Zhao She agreed, immediately sent ten thousand to rush it.",
  "s0138": "Qin troops arrived later, contended for the mountain could not ascend. Zhao She unleashed troops to attack them, greatly breaking Qin army.",
  "s0139": "Qin army retreated and fled, thus lifted the Yan siege and returned.",
  "s0140": "Zhao King Huiwen granted She the title Lord Ma Fu, appointed Xu Li as national defender.",
  "s0141": "Zhao She thus with Lian Po and Lin Xiangru same position.",
  "s0142": "Four years later, Zhao King Huiwen died, son King Xiaocheng ascended.",
  "s0143": "Seventh year, Qin and Zhao troops confronted at Changping. At this time Zhao She already dead, Lin Xiangru ill in bed. Zhao sent Lian Po to lead against Qin. Qin repeatedly defeated Zhao army. Zhao army held walls not fighting.",
  "s0144": "Qin repeatedly challenged, Lian Po refused.",
  "s0145": "The Zhao king believed Qin's rumors.",
  "s0146": "Qin's rumors said: 'What Qin fears, only dreads Lord Ma Fu Zhao She's son Zhao Kuo as general.'",
  "s0147": "The Zhao king thus appointed Kuo as general, replacing Lian Po.",
  "s0148": "Lin Xiangru said: 'Your Majesty appoints Kuo by name, like gluing the tuning pegs and playing the zither.",
  "s0149": "Kuo only can read his father's books and transmissions, does not know adapting to changes.'",
  "s0150": "The Zhao king did not listen, thus sent him."
}
