{
  "s0054": "Ru Zhonglian said: 'Alas!",
  "s0055": "Wei compared to Qin like servant?'",
  "s0056": "Xin Yuanjian said: 'Yes.'",
  "s0057": "Ru Zhonglian said: 'I will make Qin king boil pickle Wei king.'",
  "s0058": "Xin Yuanjian discontented said: 'Hey, too excessive mister's words!",
  "s0059": "Mister again how can make Qin king boil pickle Wei king?'",
  "s0060": "Ru Zhonglian said: 'Certainly, I will speak it.",
  "s0061": "Formerly Jiu Hou, E Hou, Wen Wang, Zhou's three dukes.",
  "s0062": "Jiu Hou had daughter beautiful, offered to Zhou, Zhou considered ugly, pickled Jiu Hou.",
  "s0063": "E Hou disputed strong, argued quick, thus dried E Hou.",
  "s0064": "Wen Wang heard, sighed deeply, thus imprisoned in Youli library hundred days, wished make him die.",
  "s0065": "Why with people together called king, finally go to pickle dry place?'",
  "s0066": "Qi Min Wang to Lu, Yi Wei Zi as held whip followed, told Lu people: 'You will what treat my lord?'",
  "s0067": "Lu people said: 'We will with ten great feasts treat your lord.'",
  "s0068": "Yi Wei Zi said: 'You where get ritual come treat my lord?",
  "s0069": "That my lord, emperor.",
  "s0070": "Emperor tours inspect, feudal lords avoid shed, hand over key flute, gather robe embrace knee, view meals at hall below, emperor already eaten, then retreat listen court.'",
  "s0071": "Lu people threw their flute, not actually hand over.",
  "s0072": "Could not enter Lu, will go Xue, borrow road Zou.",
  "s0073": "At this time, Zou lord died, Min Wang wished enter mourn, Yi Wei Zi told Zou's orphan: 'Emperor mourns, host must double funeral coffin, set north face at south, then emperor south face mourns.'",
  "s0074": "Zou's ministers said: 'Must like this, we will fall sword die.'",
  "s0075": "Firmly not dare enter Zou.",
  "s0076": "Zou, Lu ministers, alive then not able serve nourish, dead then not able send funeral gifts, yet wish execute emperor ritual at Zou, Lu, Zou, Lu ministers not actually accept.",
  "s0077": "Now Qin ten thousand chariot country, Wei also ten thousand chariot country.",
  "s0078": "Both occupy ten thousand chariot countries, each have called king name, see its one battle win, wish follow emperor it, this makes three Jin ministers not equal Zou, Lu servants concubines.",
  "s0079": "Moreover Qin not stop emperor, then will change feudal lords ministers.",
  "s0080": "They will seize their unworthy give their worthy, seize their hated give their loved.",
  "s0081": "They again will make their children slanderous concubines become feudal lords consorts.",
  "s0082": "Dwell Wei palace.",
  "s0083": "Wei king how get peaceful already?",
  "s0084": "General again how get former favor?'",
  "s0086": "Thus Xin Yuanjian rose, twice bowed thanked: 'Began considering mister common person, now then today know mister world scholar.",
  "s0087": "I request leave, not dare again speak emperor Qin.'",
  "s0088": "Qin generals heard, retreated army fifty li.",
  "s0089": "Just met Wei prince Wuqi seize Xin Bi army to rescue Zhao, attacked Qin army, Qin army then withdrew departed.",
  "s0090": "Thus Lord Pingyuan wished enfeoff Ru Zhonglian, Ru Zhonglian declined messengers three times, finally not willing accept.",
  "s0091": "Lord Pingyuan then set wine, wine flowing rose front, with thousand jin for Ru Zhonglian longevity.",
  "s0092": "Ru Zhonglian laughed: 'What valued in world scholars, for people dispel calamity release difficulties resolve disputes without take.",
  "s0093": "If have take, is merchant affairs, Zhonglian not bear do.'",
  "s0094": "Thus declined Lord Pingyuan departed, lifetime not again see.",
  "s0095": "After twenty plus years, Yan general attacked took Liaocheng, Liaocheng people some slandered to Yan, Yan general feared execution, thus guarded Liaocheng, not dare return.",
  "s0096": "Qi Tian Dan attacked Liaocheng year plus, soldiers many died yet Liaocheng not fall.",
  "s0097": "Ru Zhonglian then wrote letter, tied to arrow shot city middle, sent Yan general.",
  "s0098": "Letter said:",
  "s0099": "I heard, wise not betray time abandon profit, brave warriors not die extinguish name, loyal ministers not before self after lord.",
  "s0100": "Now duke execute one morning anger, not consider Yan king's without ministers, not loyal;",
  "s0101": "Kill body lose Liaocheng, might not trusted by Qi, not brave;",
  "s0102": "Merit defeated name extinguished, later generations no praise, not wise.",
  "s0103": "Three these world lords not minister, persuaders not record, thus wise not again plan, brave warriors not fear death.",
  "s0104": "Now life death glory shame, noble base honored humble, this time not again arrive, wish duke detailed plan not with vulgar same."
}

