{
  "s0151": "Zhao Kuo from youth studied military strategy, spoke of military affairs considering no one in the world could match him.",
  "s0152": "Once discussed military affairs with his father She, She could not refute him, yet did not consider it good.",
  "s0153": "Kuo's mother asked She the reason. She said: 'War is the place of death, yet Kuo speaks of it easily.",
  "s0154": "If Zhao does not appoint Kuo then fine, if must appoint him, the one who breaks Zhao army must be Kuo.'",
  "s0155": "When Kuo was about to go, his mother presented a letter to the king saying: 'Kuo cannot be made general.'",
  "s0156": "The king said: 'Why?'",
  "s0157": "She replied: 'At first I served his father. When he was general, those who presented food and drink to him numbered dozens, those he befriended numbered hundreds. What the great king and royal clan granted as rewards he all gave to army officers and scholars. On the day he received command, did not ask family matters.",
  "s0158": "Now Kuo once becomes general, faces east for court audience. Army officers dare not look up at him. What the king grants gold and silk, he takes home and stores, daily looks at profitable fields and houses to buy.'",
  "s0159": "The king considers how compared to his father?",
  "s0160": "Father and son different hearts. I hope Your Majesty does not send him.'",
  "s0161": "The king said: 'Mother set it aside, I have already decided.'",
  "s0162": "Kuo's mother thus said: 'Your Majesty ultimately sends him, if he does not match expectations, may I not be implicated?'",
  "s0163": "The king agreed.",
  "s0164": "Zhao Kuo having replaced Lian Po, completely changed the regulations, replaced army officers.",
  "s0165": "Qin general Bai Qi heard of this, sent surprise troops, pretended defeat and retreat, cut their grain routes, divided their army into two, soldiers' hearts separated.",
  "s0166": "Over forty days, army hungry. Zhao Kuo sent sharp troops to fight singly. Qin army shot and killed Zhao Kuo.",
  "s0167": "Kuo's army defeated, several hundred thousand troops surrendered to Qin. Qin buried them all alive.",
  "s0168": "Zhao previously and afterward lost altogether 450,000.",
  "s0169": "The next year, Qin troops besieged Handan. Over a year, nearly could not escape.",
  "s0170": "Relying on Chu and Wei feudal lords coming to rescue, then lifted Handan's siege.",
  "s0171": "The Zhao king also because Kuo's mother previously spoke, ultimately did not execute her.",
  "s0172": "From Handan's siege lifted five years, Yan used Li Fu's plan, saying 'Zhao's strong men exhausted at Changping, their orphans not yet grown', raised troops to attack Zhao.",
  "s0173": "Zhao sent Lian Po to lead, attacked, greatly broke Yan army at Gao, killed Li Fu, then besieged Yan.",
  "s0174": "Yan ceded five cities to request peace, then heeded it.",
  "s0175": "Zhao with Wei Wen enfeoffed Lian Po as Lord Xinping, as deputy prime minister.",
  "s0176": "When Lian Po was dismissed from Changping and returned, in the time of lost power, retainers all left.",
  "s0177": "When again used as general, retainers again came.",
  "s0178": "Lian Po said: 'Retainers gone!'",
  "s0179": "Retainers said: 'Ah!",
  "s0180": "Why does my lord see this so late?",
  "s0181": "The world befriends by marketplace principles. You have power, I follow you. You have no power then leave. This is certainly the principle. What resentment?'",
  "s0182": "Six years later, Zhao sent Lian Po to attack Wei's Fanyang, capturing it.",
  "s0183": "Zhao King Xiaocheng died, son King Dao Xiang ascended, sent Yue Cheng to replace Lian Po.",
  "s0184": "Lian Po angered, attacked Yue Cheng. Yue Cheng fled.",
  "s0185": "Lian Po thus fled to Wei's Daliang.",
  "s0186": "The next year, Zhao appointed Li Mu as general to attack Yan, capturing Wushui and Fangcheng.",
  "s0187": "Lian Po resided in Wei for long, Wei could not employ him.",
  "s0188": "Zhao repeatedly troubled by Qin troops, the Zhao king thought of again obtaining Lian Po. Lian Po also thought of again being used in Zhao.",
  "s0189": "The Zhao king sent envoys to see if Lian Po still usable.",
  "s0190": "Lian Po's enemy Guo Kai gave much gold to the envoys, ordered them to slander him.",
  "s0191": "Zhao envoys having seen Lian Po, Lian Po for them ate one dou of rice, ten jin of meat, donned armor and mounted horse, to show still usable.",
  "s0192": "Zhao envoys returned reported to king: 'Lian general though old, still eats well, but sitting with me, in a moment relieved himself three times.'",
  "s0193": "The Zhao king considered him old, thus did not summon.",
  "s0194": "Chu heard Lian Po in Wei, secretly sent people to welcome him.",
  "s0195": "Lian Po once became Chu general, no merit, said: 'I think of using Zhao people.'",
  "s0196": "Lian Po ultimately died in Shouchun.",
  "s0197": "Li Mu was Zhao's fine northern border general.",
  "s0198": "Often resided in Dai and Yanmen, defending against Xiongnu.",
  "s0199": "With discretion appointed officials, market rents all entered the headquarters, for soldiers' expenses.",
  "s0200": "Daily slaughtered several oxen to feast soldiers, practiced archery and riding, careful with beacon fires, many spies, generously treated warriors.",
  "s0201": "Made agreement: 'If Xiongnu enter to plunder, urgently enter and defend. Anyone who dares capture captives executed.'",
  "s0202": "Xiongnu whenever entered, beacon fires careful, then entered and defended, dared not fight.",
  "s0203": "Like this several years, also no losses.",
  "s0204": "Yet Xiongnu considered Li Mu cowardly. Even Zhao border soldiers considered our general cowardly.",
  "s0205": "Zhao king rebuked Li Mu. Li Mu as before.",
  "s0206": "Zhao king angered, summoned him, made others replace as general.",
  "s0207": "Over a year, Xiongnu whenever came, went out to fight.",
  "s0208": "Went out to fight, repeatedly unfavorable, losses many, border could not farm or herd.",
  "s0209": "Again requested Li Mu.",
  "s0210": "Mu shut doors not going out, firmly claimed illness.",
  "s0211": "Zhao king then strongly raised him to lead troops.",
  "s0212": "Mu said: 'Your Majesty must use me, I as before, then dare accept command.'",
  "s0213": "King agreed.",
  "s0214": "Li Mu arrived, as former agreement.",
  "s0215": "Xiongnu several years without gains.",
  "s0216": "Ultimately considered him cowardly.",
  "s0217": "Border soldiers daily received rewards without use, all wished one battle.",
  "s0218": "Thus selected chariots getting 1,300, selected cavalry getting 13,000 horses, soldiers of hundred jin 50,000 men, archers 100,000 men, all harnessed and practiced battle.",
  "s0219": "Greatly released livestock grazing, people filled the wilds.",
  "s0220": "Xiongnu small entry, pretended north not winning, abandoning several thousand to them.",
  "s0221": "Chanyu heard of this, greatly led masses to enter.",
  "s0222": "Li Mu made many surprise formations, stretched left and right wings to attack them, greatly broke and killed Xiongnu over 100,000 cavalry.",
  "s0223": "Destroyed Chanlan, broke Donghu, surrendered Linhu. Chanyu fled.",
  "s0224": "Afterward over ten years, Xiongnu dared not approach Zhao border cities.",
  "s0225": "Zhao King Dao Xiang first year, Lian Po having fled to Wei, Zhao sent Li Mu to attack Yan, capturing Wushui and Fangcheng.",
  "s0226": "Two years later, Pang Juan broke Yan army, killed Ju Xin.",
  "s0227": "Seven years later, Qin broke and killed Zhao general Hu Che at Wushui, beheaded 100,000.",
  "s0228": "Zhao appointed Li Mu as grand general, attacked Qin army at Yian, greatly broke Qin army, routed Qin general Huan Yan.",
  "s0229": "Enfeoffed Li Mu as Lord Wuan.",
  "s0230": "Three years later, Qin attacked Fanwu. Li Mu attacked and broke Qin army, southward opposed Han and Wei.",
  "s0231": "Zhao King Qian seventh year, Qin sent Wang Jian to attack Zhao. Zhao sent Li Mu and Sima Shang to resist them.",
  "s0232": "Qin gave much gold to Zhao king's favorite minister Guo Kai, for sowing discord, saying Li Mu and Sima Shang wished to rebel.",
  "s0233": "Zhao king sent Zhao Cong and Qi general Yan Ju to replace Li Mu.",
  "s0234": "Li Mu did not accept command. Zhao sent people secretly captured Li Mu, executed him.",
  "s0235": "Dismissed Sima Shang.",
  "s0236": "Three months later, Wang Jian urgently attacked Zhao, greatly broke and killed Zhao Cong, captured Zhao King Qian and his general Yan Ju, thus extinguished Zhao.",
  "s0237": "The Grand Historian says: Knowing death must be brave—not dying is difficult, facing death is difficult.",
  "s0238": "When Lin Xiangru held the jade disk glaring at the pillar, and berated the Qin king's attendants, the situation no more than execution. Yet scholars or cowardly and dare not act.",
  "s0239": "Xiangru once aroused his spirit, awed and trusted the enemy state. Retired and yielded to Lian Po, name heavy as Mount Tai. His wisdom and courage can be called combined!"
}

