{
  "s0402": "Hui Wang two years.",
  "s0403": "Initial, Zhuang Wang favorite concubine Yao, give birth son Dai, Dai have favor.",
  "s0404": "Reach Hui Wang establish, seize its ministers to make park, therefore grand master Bian Bo etc five people make chaos, plot summon Yan, Wei troops, attack Hui Wang.",
  "s0405": "Hui Wang flee Wen, already dwell Zheng Li.",
  "s0406": "Establish Xi Wang younger brother Dai as wang.",
  "s0407": "Music reach universal dance, Zheng, Guo lords angry.",
  "s0408": "Four years, Zheng with Guo lords attack kill wang Dai, again enter Hui Wang.",
  "s0409": "Hui Wang ten years, grant Qi Huan Gong as bo.",
  "s0410": "Twenty five years, Hui Wang die, son Xiang Wang Zheng establish.",
  "s0411": "Xiang Wang mother early die, step mother said Hui queen.",
  "s0412": "Hui queen give birth Shu Dai, have favor at Hui Wang, Xiang Wang fear it.",
  "s0413": "Three years, Shu Dai with Rong, Di plot attack Xiang Wang, Xiang Wang desire execute Shu Dai, Shu Dai flee Qi.",
  "s0414": "Qi Huan Gong make Guan Zhong pacify Rong at Zhou, make Xi Peng pacify Rong at Jin.",
  "s0415": "Wang with upper Qing ritual Guan Zhong.",
  "s0416": "Guan Zhong decline said: 'Minister cheap have director, have heavenly son two guard state, Gao in.",
  "s0417": "If festival spring autumn come receive wang command, what with ritual.",
  "s0418": "Accompany minister dare decline.'",
  "s0419": "Wang said: 'Uncle clan, I praise your merit, not oppose my command.'",
  "s0420": "Guan Zhong finally receive lower Qing ritual yet return.",
  "s0421": "Nine years, Qi Huan Gong die.",
  "s0422": "Twelve years, Shu Dai again return at Zhou.",
  "s0423": "Thirteen years, Zheng attack Hua, wang make You Sun, Bo Fu request Hua, Zheng people imprison it.",
  "s0424": "Zheng Wen Gong resent Hui Wang enter not give Li Gong rank, again resent Xiang Wang give Wei Hua, therefore imprison Bo Fu.",
  "s0425": "Wang angry, will with Di attack Zheng.",
  "s0426": "Fu Chen remonstrate said: 'All our Zhou east move, Jin, Zheng there rely.",
  "s0427": "Zi Dai chaos, again Zheng by fix, now with small resent abandon it!'",
  "s0428": "Wang not listen.",
  "s0429": "Fifteen years, wang lower Di troops to attack Zheng.",
  "s0430": "Wang virtue Di people, will with its woman as queen.",
  "s0431": "Fu Chen remonstrate said: 'Ping, Huan, Zhuang, Hui all receive Zheng labor, wang abandon close close Di, not able follow.'",
  "s0432": "Wang not listen.",
  "s0433": "Sixteen years, wang dismiss Di queen, Di people come punish, kill Tan Bo.",
  "s0434": "Fu Chen said: 'I number remonstrate not follow.",
  "s0435": "Like not exit, wang with me as resent?'",
  "s0436": "Then with its belong die it.",
  "s0437": "Initial, Hui queen desire establish wang zi Dai, therefore with party open Di people, Di people then enter Zhou.",
  "s0438": "Xiang Wang exit flee Zheng, Zheng dwell wang at Si.",
  "s0439": "Zi Dai establish as wang, take Xiang Wang dismiss Di queen with dwell Wen.",
  "s0440": "Seventeen years, Xiang Wang inform urgent at Jin, Jin Wen Gong enter wang yet execute Shu Dai.",
  "s0441": "Xiang Wang then grant Jin Wen Gong Gui Chang bow arrow, as bo, with He inner earth with Jin.",
  "s0442": "Twenty years, Jin Wen Gong summon Xiang Wang, Xiang Wang meet it He Yang, Jian Tu, feudal lords complete court, book avoid said 'heavenly wang hunt at He Yang'.",
  "s0443": "Twenty four years, Jin Wen Gong die.",
  "s0444": "Thirty one years, Qin Mu Gong die.",
  "s0445": "Thirty two years, Xiang Wang die, son Qing Wang Ren Chen establish.",
  "s0446": "Qing Wang six years, die, son Kuang Wang Ban establish.",
  "s0447": "Kuang Wang six years, die, younger brother Yu establish, is Ding Wang.",
  "s0448": "Ding Wang one year, Chu Zhuang Wang attack Lu Hun Di, stop Luo, make person ask nine tripods.",
  "s0449": "Wang make Wang Sun Man respond prepare with speech, Chu troops then leave.",
  "s0450": "Ten years, Chu Zhuang Wang surround Zheng, Zheng bo surrender, already yet recover it.",
  "s0451": "Sixteen years, Chu Zhuang Wang die."
}

