{
  "s0001": "Emperor Wen was the middle son of Gaozu.",
  "s0002": "In the eleventh year of Gaozu, after he had already defeated the army of Chen Xi and pacified the land of Dai, he established him as King of Dai, with his capital at Zhongdu.",
  "s0003": "He was the son of Empress Bo.",
  "s0004": "He ascended the throne in the seventeenth year of Gaozu, the eighth year of Empress Lu.",
  "s0005": "In the seventh month, Empress Lu died, and the Lü clan, Lü Chan and others, intended to rebel to endanger the Liu clan, so the ministers all plotted to kill them, and planned to summon and establish the King of Dai, the matters are recorded in the account of Empress Lu.",
  "s0006": "Chancellor Chen Ping, Grand Commandant Zhou Bo and others sent people to welcome the King of Dai.",
  "s0007": "The King of Dai consulted with his attendants, the Zhongwei Zhang Wu and others.",
  "s0008": "Zhang Wu and others advised: 'All the Han ministers are old generals of Gaozu's time, skilled in military affairs and full of cunning stratagems, this is not just their intention to do this, they merely fear the authority of Gaozu and Empress Lu.",
  "s0009": "Now that they have already killed the Lü clan and shed fresh blood in the capital, this welcoming Your Majesty is just a pretext, in reality it cannot be trusted.'",
  "s0010": "'We urge Your Majesty to feign illness and not go, to observe how events develop.'",
  "s0011": "Zhongwei Hong Chang advanced and said: 'The ministers' discussions are all wrong.",
  "s0012": "When Qin lost its governance, the various feudal lords and powerful families rose up one by one, each considering himself to have the Mandate of Heaven, the number who considered themselves worthy reached tens of thousands, yet in the end, the one who ascended the imperial throne was Liu Bang, the world despaired, this is the first reason.",
  "s0013": "Gaozu enfeoffed his sons and younger brothers with lands in a chessboard pattern to check each other, this is called the rock-solid foundation, the world respects its strength, this is the second reason.",
  "s0014": "The Han rose and abolished Qin's harsh laws, simplified the statutes, bestowed kindness and favor, everyone felt at ease, difficult to shake, this is the third reason.",
  "s0015": "Although Empress Lu was strict and established three Lü as kings, monopolizing power and controlling everything, yet Grand Commandant Zhou Bo entered the Northern Army with a single tally, one shout and the soldiers all bared their left arms, supporting the Liu clan and rebelling against the Lü, in the end exterminating them.",
  "s0016": "This was bestowed by Heaven, not by human effort.",
  "s0017": "Now if the ministers truly intend to rebel, the people will not support them, how can their party become unified?'",
  "s0018": "At present, internally we have the relatives Zhu Hui and Dong Mu, externally we fear the strength of Wu, Chu, Huainan, Langye, Qi, and Dai.'",
  "s0019": "'At present, among Gaozu's sons, only the Kings of Huainan and Dai remain, moreover Your Majesty is the elder, sage, benevolent, and filial, renowned throughout the world, therefore the ministers, following the will of the world, wish to welcome and establish Your Majesty, Your Majesty should have no doubts.'",
  "s0020": "The King of Dai reported this to the Empress Dowager, but still hesitated and could not decide.",
  "s0021": "He divined with tortoise shell, the omen showed 'Great Horizontal'.",
  "s0022": "The interpretation said: 'Great Horizontal Geng Geng, I am the Heavenly King, Xia Yu illuminated it.'",
  "s0023": "The King of Dai said: 'I am already a king, why speak of being king again?'",
  "s0024": "The diviner said: 'What is called Heavenly King is the Son of Heaven.'",
  "s0025": "Thereupon the King of Dai sent his mother's younger brother Bo Zhao to see Marquis Jiang, Jiang Hou and others fully explained to Zhao the intention of welcoming and establishing the king.",
  "s0026": "Bo Zhao returned and reported: 'It is true, there is no need to doubt.'",
  "s0027": "The King of Dai then laughed and said to Hong Chang: 'Indeed as you said.'",
  "s0028": "He ordered Hong Chang to ride in the same carriage, Zhang Wu and five others to ride in the post carriage, and set out for Chang'an.",
  "s0029": "They halted at Gaoling, and sent Hong Chang to first go to Chang'an to observe the situation.",
  "s0030": "Hong Chang reached Weiqiao, the chancellor and below all came to welcome him.",
  "s0031": "Hong Chang returned and reported.",
  "s0032": "The King of Dai sped to Weiqiao, the assembled ministers bowed and addressed him as subject.",
  "s0033": "The King of Dai alighted from his carriage and bowed.",
  "s0034": "Grand Commandant Bo advanced and said: 'Please permit private conversation.'",
  "s0035": "Hong Chang said: 'What you say is public, say it publicly; what you say is private, the king does not receive private matters.'",
  "s0036": "The Grand Commandant then knelt and presented the imperial seal and tallies.",
  "s0037": "The King of Dai declined and said: 'Let us discuss it in the Dai residence.'",
  "s0038": "He sped into the Dai residence.",
  "s0039": "The ministers followed him in.",
  "s0040": "Chancellor Chen Ping, Grand Commandant Zhou Bo, Grand General Chen Wu, Imperial Secretary Zhang Cang, Royal Secretary Liu Ying, Zhu Xu Marquis Liu Zhang, Dong Mu Marquis Liu Xingju, Jianke Liu Jie all bowed twice and said: 'Those called Hong and others are not the sons of Emperor Hui, they are not worthy to sacrifice at the ancestral temple.",
  "s0041": "We respectfully request to consult with the Yin'an Marquis, the marquis, the King of Langye, the imperial relatives, the great ministers, the marquises, the officials of two thousand shi, and say: \"Your Majesty is Gaozu's eldest son, you should succeed Gaozu.\"",
  "s0042": "We urge Your Majesty to ascend the imperial throne.'",
  "s0043": "The King of Dai said: 'Serving Gaozu's ancestral temple is a heavy matter.",
  "s0044": "I am incompetent, insufficient to bear the ancestral temple.",
  "s0045": "I request to consult with the King of Chu on what is appropriate, I dare not comply.'",
  "s0046": "The ministers all prostrated themselves and firmly requested.",
  "s0047": "The King of Dai faced west and declined three times, faced south and declined twice.",
  "s0048": "Chancellor Chen Ping and others all said: 'We firmly believe that Your Majesty serving Gaozu's ancestral temple is most fitting, even if the world, all the feudal lords and people consider it fitting.",
  "s0049": "We, for the sake of the ancestral temple and the altars of soil and grain, dare not be negligent.",
  "s0050": "We urge Your Majesty to graciously heed us.",
  "s0051": "We respectfully present the imperial seal and tallies again bowing twice.'",
  "s0052": "The King of Dai said: 'The imperial relatives, generals, kings, marquises consider none more fitting than me, I dare not decline.'",
  "s0053": "He then ascended the imperial throne.",
  "s0054": "The ministers observed the rites and served in order.",
  "s0055": "He sent Taipu Ying and Dong Mu Marquis Xingju to clear the palace and receive the imperial carriage from the Dai residence.",
  "s0056": "The emperor entered the Weiyang Palace that very night.",
  "s0057": "That night he appointed Hong Chang as Wei General, guarding the northern and southern armies.",
  "s0058": "He appointed Zhang Wu as Zhongwei Ling, patrolling within the palace.",
  "s0059": "He sat in the front hall.",
  "s0060": "That night he issued an edict: 'Recently the Lü clan used their position to monopolize power and plotted great rebellion, intending to endanger the Liu clan's ancestral temple, relying on the marquises and ministers who killed them, all received their punishments.",
  "s0061": "I have just ascended the throne, I pardon the world, grant the people one degree of nobility, one hundred households of cattle and wine per woman, feast for five days.'",
  "s0062": "On Xinyou day, the emperor ascended the throne, visited the Gao Temple.",
  "s0063": "Left Chancellor Ping was moved to Right Chancellor, Grand Commandant Bo to Left Chancellor, Grand General Ying to Grand Commandant.",
  "s0064": "All the lands of Qi and Chu that the Lü clan had taken were returned to them.",
  "s0065": "On Renzi day, he sent Cheqi General Bo Zhao to welcome the Empress Dowager from Dai.",
  "s0066": "The emperor said: 'Lü Chan set himself up as prime minister, Lü Lu as supreme general, falsely commanding Ying the General to lead troops to attack Qi, Ying halted at Chengyang and did not attack, cooperating with the feudal lords to plot against the Lü clan.",
  "s0067": "Lü Chan intended to do evil, Chancellor Chen Ping and Grand Commandant Zhou Bo plotted to seize Lü Chan and others' armies.",
  "s0068": "Zhu Xu Marquis Liu Zhang first captured Lü Chan and others.",
  "s0069": "Grand Commandant Bo personally led Pinghou Tong to hold the tally and enter the Northern Army according to the edict.",
  "s0070": "Jianke Liu Jie personally seized Lü Lu's seal.",
  "s0071": "Increase Grand Commandant Bo's fief by one thousand households, grant gold five thousand jin.",
  "s0072": "Chancellor Chen Ping, General Ying's fiefs each three thousand households, gold two thousand jin.",
  "s0073": "Zhu Xu Marquis Liu Zhang, Pinghou Tong, Dong Mu Marquis Liu Xingju's fiefs each two thousand households, gold one thousand jin.",
  "s0074": "Enfeoff Jianke Jie as Yangxin Marquis, grant gold one thousand jin.'",
  "s0075": "In the twelfth month, the emperor said: 'Law is the correct governance, it is used to prohibit violence and guide goodness.",
  "s0076": "Now those who violate the law have already been punished, but to make innocent parents and wives of the same clan as well as their concubines share in the punishment, and to confiscate property, I greatly disapprove.",
  "s0077": "Let us discuss it.'",
  "s0078": "The officials all said: 'The people cannot govern themselves, therefore laws are established to prohibit them.",
  "s0079": "Joint punishment and confiscation of property serve to accumulate fear in their hearts, making them revere violating the law, this has come from afar.'",
  "s0080": "The emperor said: 'I have heard that when the law is correct, the people obey; when punishment fits the crime, the people follow.",
  "s0081": "Moreover, those who shepherd and guide the people toward goodness are the officials.",
  "s0082": "If they cannot guide them, yet use incorrect laws to punish them, this is to harm the people as violence.",
  "s0083": "How can one prohibit it?",
  "s0084": "I have not seen its benefit, whose opinion is this?'",
  "s0085": "The officials all said: 'Your Majesty adds great kindness, virtue is most abundant, not what we officials can reach.",
  "s0086": "We request to follow the edict, abolish the confiscation of property and joint punishment statutes.'",
  "s0087": "In the first month, the officials said: 'Early establishment of the crown prince honors the ancestral temple.",
  "s0088": "We request to establish the crown prince.'",
  "s0089": "The emperor said: 'I am without virtue, the divine spirits of the Supreme Deity have not enjoyed my offerings, the people of the world have no sense of satisfaction.",
  "s0090": "Now if I cannot extensively seek the world's sage saints of virtue and yield the world to them, yet say to establish the crown prince early, this increases my lack of virtue.",
  "s0091": "What would I say to the world?",
  "s0092": "Let it rest.'",
  "s0093": "The officials said: 'Establishing the crown prince early honors the ancestral temple and state, does not forget the world.'",
  "s0094": "The emperor said: 'The King of Chu is my uncle, advanced in age, well-versed in the world's rites and principles.",
  "s0095": "The King of Wu, to me, is my elder brother, benevolent and fond of virtue.",
  "s0096": "The King of Huainan is my younger brother, embodies virtue and accompanies me.",
  "s0097": "Would they not be suitable?",
  "s0098": "Among the imperial relatives, royal family, ministers who have merit, and those with virtue and righteousness, if we select one with virtue to accompany my insufficiency, this is the spirit of the ancestral temple, the blessing of the world.",
  "s0099": "Now we do not select, yet say it must be my son, the people will consider me to forget those with virtue and righteousness and be partial to my son, this is not how to care for the world.",
  "s0100": "I greatly disapprove.'",
  "s0101": "The officials all firmly requested saying: 'Ancient times when establishing a country, security lasted over a thousand years, using this way.",
  "s0102": "Establishing the heir must be the son, this has come from afar.",
  "s0103": "Gaozu personally led the officials and people, began to pacify the world, established the feudal lords, for the ancestors of emperors.",
  "s0104": "The feudal kings and marquises who first received their lands also became ancestors of their countries.",
  "s0105": "Sons and grandsons succeeding one another, never ending for generations, this is the great righteousness of the world, Gaozu set it up to pacify the seas.",
  "s0106": "Now to abandon what is fitting and select again from the feudal lords and imperial family, is not Gaozu's intention.",
  "s0107": "To change and discuss not fitting.",
  "s0108": "Your son is the eldest, pure and thick, benevolent and filial, we request to establish him as crown prince.'",
  "s0109": "The emperor then agreed.",
  "s0110": "He also granted the people who should succeed their fathers nobility each one degree, enfeoff General Bo Zhao as Marquis of Zhi.",
  "s0111": "In the third month, the officials requested to establish the empress.",
  "s0112": "The Empress Dowager Bo said: 'All the feudal lords are of the same clan, establish the crown prince's mother as empress.'",
  "s0113": "The empress was surnamed Dou.",
  "s0114": "The emperor, for the sake of establishing the empress, granted the widowers, widows, orphans, and the destitute and impoverished, and those eighty years old and above orphans nine years old and below, cloth and rice and meat each according to number.",
  "s0115": "The emperor came from Dai, upon ascending the throne, bestowed kindness and favor on the world, comforted and pacified the feudal lords and four barbarian tribes, all were harmonious and happy, then followed the meritorious officials from Dai.",
  "s0116": "The emperor said: 'When the ministers were plotting to kill the Lü and welcome me, I was suspicious, all stopped me, only Zhongwei Hong Chang advised me, I thus was able to preserve the ancestral temple.",
  "s0117": "I have already honored Chang as Wei General, I will enfeoff Chang as Zhuangwu Marquis.",
  "s0118": "The six people who followed me, their offices all reached nine ministers.'",
  "s0119": "The emperor said: 'The marquises who followed Gaozu into Shu and Hanzhong, sixty-eight people, each increase their fiefs by three hundred households, old officials of two thousand shi and above who followed Gaozu, Guardian of Yingchuan Shun Tu Jia and ten others, food estate six hundred households, Guardian of Huaiyang Chen Tu Sheng and ten others five hundred households, Wei Wei Ding and ten others four hundred households.",
  "s0120": "Enfeoff the King of Huainan's maternal uncle Zhao Jian as Zhouyang Marquis, King of Qi's maternal uncle Si Jun as Qingge Marquis.'",
  "s0121": "In autumn, he enfeoffed the former Prime Minister of Changshan Cai Jian as Fan Marquis.",
  "s0122": "Someone advised the Right Chancellor saying: 'You originally plotted against the Lü clan, welcomed the King of Dai, now you again boast of your merit, receive the emperor's great reward, occupy honored position, calamity will surely reach your person.'",
  "s0123": "Right Chancellor Bo then apologized and resigned due to illness, Left Chancellor Ping alone became chancellor.",
  "s0124": "In the tenth month of the second year, Chancellor Ping died, he again appointed Jiang Hou Bo as chancellor.",
  "s0125": "The emperor said: 'I have heard that in ancient times the feudal lords established their countries for over a thousand years, each guarded their lands, timely paid tribute, the people were not toiled nor troubled, superiors and inferiors happy and pleased, without any remaining virtue.",
  "s0126": "Now the marquises mostly dwell in Chang'an, their fiefs are distant, the officials and soldiers give and transport costs are hard, moreover the marquises have no way to teach and tame their people.'",
  "s0127": "He ordered the marquises to go to their fiefs, those retained by officials and edicts, send their heirs.'",
  "s0128": "On the last day of the eleventh month, there was an eclipse of the sun.",
  "s0129": "On the fifteenth of the twelfth month, there was another eclipse of the sun.",
  "s0130": "The emperor said: 'I have heard that Heaven gives birth to the common people, establishes rulers to nurture and govern them.",
  "s0131": "If the ruler lacks virtue, policy is not even, then Heaven shows calamity to admonish the ungoverned.",
  "s0132": "In the last day of the eleventh month there was an eclipse of the sun, it appeared in Heaven, calamity could be no greater!",
  "s0133": "I have preserved the ancestral temple with my slight body entrusted above the lords and kings of the world, governing the world for one person, only the two or three who assist me are like my arms and legs.",
  "s0134": "I am insufficient below to regulate and nurture the masses, above to accumulate the brightness of the three luminaries, my lack of virtue is great indeed.",
  "s0135": "Let the officials all deeply consider my errors, and know of my thoughts and considerations that I have not reached, beg to tell me.",
  "s0136": "Also select worthy, upright, capable of speaking directly and remonstrating to the utmost, to correct my shortcomings.",
  "s0137": "Accordingly each rectify their duties, vigorously reduce labor and taxation to benefit the people.",
  "s0138": "I, since I cannot spread virtue afar, then anxiously consider outsiders who have faults, therefore the defenses have not ceased.",
  "s0139": "Now although I cannot abolish the border garrisons and conscription, yet I order the soldiers to be thickened and the guards strong, I will abolish the Wei General's army.",
  "s0140": "Taipu has horses remaining and wealth sufficient, the rest all to supplement the post stations.'",
  "s0141": "In the first month, the emperor said: 'Agriculture is the foundation of the world, its importance is nothing greater.",
  "s0142": "Now to personally work and yet have land taxes and levies, this is to make root and branch have no distinction, the way to encourage agriculture is not yet complete.",
  "s0143": "Abolish the taxes on fields.'",
  "s0144": "In the third month, the officials requested to establish the imperial sons as feudal kings.",
  "s0145": "The emperor said: 'King You of Zhao died unjustly, I greatly pity him, I have already established his eldest son Sui as King of Zhao.",
  "s0146": "Sui's younger brother Pi Qiang and King Hui's son Zhu Xu Marquis Zhang, Dong Mu Marquis Xingju have merit, they may be kings.'",
  "s0147": "He established King You of Zhao's youngest son Pi Qiang as King of Hejian, using the large commanderies of Qi to establish Zhu Xu Marquis as King of Chengyang, established Dong Mu Marquis as King of Jibei, imperial son Wu as King of Dai, son Can as King of Taiyuan, son Yi as King of Liang.",
  "s0148": "The emperor said: 'In ancient times, the court had the banner of promoting goodness, the wooden drum of slander, so as to communicate governance and come to remonstration.",
  "s0149": "Now the law has the crime of slander and witchcraft, this makes the assembled ministers dare not express their true feelings completely, and above there is no way to hear of errors.'",
  "s0150": "He abolished it.",
  "s0151": "Also, the common people who curse the emperor to bind together and then mock each other, the officials consider it great rebellion, those who have other words, the officials also consider slander.",
  "s0152": "This ignorant foolishness of the common people that leads to death, I greatly disapprove.",
  "s0153": "From now on, those who commit this shall not be listened to nor punished.'",
  "s0154": "In the ninth month, he first gave copper tiger tallies and bamboo messenger tallies to the prefectures and commanderies.",
  "s0155": "In the tenth month of the third year, on Dingchou the last day, there was an eclipse of the sun.",
  "s0156": "In the eleventh month, the emperor said: 'Previously I sent the marquises to their countries, some declined and did not go.",
  "s0157": "The chancellor is what I value most, for my sake lead the marquises to their countries.'",
  "s0158": "Jiang Hou Bo resigned as chancellor and went to his country, appointed Yingyin Marquis Ying as chancellor.",
  "s0159": "Abolished the office of grand commandant, attached it to the chancellor.",
  "s0160": "In the fourth month, King Zhang of Chengyang died.",
  "s0161": "King Chang of Huainan and his followers Wei Jing killed the Marquis of Piyang Shen Yiji.",
  "s0162": "In the fifth month, the Xiongnu entered Beidi, dwelling in Henan as bandits.",
  "s0163": "The emperor first visited Ganquan.",
  "s0164": "In the sixth month, the emperor said: 'Han and the Xiongnu are bound as brothers, no harming the border regions, therefore tribute to the Xiongnu is very generous.",
  "s0165": "Now the Right Wise King has left his land, leading his crowds to dwell in the surrendered territory of Henan, not according to the old agreement, coming and going near the border, capturing and killing officials and soldiers, driving away and guarding the border barbarians, not allowing them to dwell in their old places, trampling on border officials, raiding, extremely arrogant and without propriety, not according to the treaty.",
  "s0166": "Send border officials and cavalry eighty-five thousand to Gaonu, dispatch Chancellor Yingyin Marquis Guan Ying to attack the Xiongnu.'",
  "s0167": "The Xiongnu departed, dispatched the Zhongwei troops from Chang'an to belong to the Wei General's army.",
  "s0168": "On Xinsi day, the emperor went from Ganquan to Gaonu, incidentally visited Taiyuan, saw the old assembled ministers, all granted them.",
  "s0169": "Examined merit and rewarded, granted the common people of the villages cattle and wine.",
  "s0170": "Exempted the people of Jinyang and Zhongdu for three years.",
  "s0171": "Remained touring Taiyuan over ten days.",
  "s0172": "King Xingju of Jibei heard the emperor was in Dai, wished to go attack Hu, then rebelled, raised troops wishing to attack Chengyang.",
  "s0173": "Thereupon he ordered to stop the chancellor's troops, dispatched Ji Pu Marquis Chen Wu as grand general, leading one hundred thousand to attack him.",
  "s0174": "He Hou He as general, army at Chengyang.",
  "s0175": "In the seventh month Xinhai, the emperor went from Taiyuan to Chang'an.",
  "s0176": "He then ordered the officials to say: 'King Xingju of Jibei has turned against virtue and rebelled against the emperor, deceived and confused the officials and people, for great rebellion.",
  "s0177": "The officials and people of Jibei who did not arrive before the troops had already pacified themselves, as well as those who surrendered with troops and land, all pardon them, restore offices and nobility.",
  "s0178": "Those who come and go with King Xingju, also pardon them.'",
  "s0179": "In the eighth month, he broke the army of Jibei, captured its king.",
  "s0180": "Pardoned the officials and people of Jibei who rebelled with the king.",
  "s0181": "In the sixth year, the officials said King Chang of Huainan abandoned the former emperor's laws, did not listen to the emperor's edicts, in dwelling no limits, going out imitating the emperor, arbitrarily making laws and decrees, conspired with Ji Pu Marquis Wu's heir Qi to rebel, sent people to make contact with the people of Minyue and Xiongnu, raised their troops, wished to endanger the ancestral temple and altars of soil and grain.",
  "s0182": "The ministers discussed, all said 'Chang should be executed in the marketplace', the emperor could not bear to apply the law to the king, pardoned his crime, abolished without making king.",
  "s0183": "The ministers requested to place the king in Shu's Yandao, Qiongdu, the emperor permitted it.",
  "s0184": "Chang had not yet reached the place, on the way fell ill and died, the emperor pitied him.",
  "s0185": "After sixteen years, he honored King Chang of Huainan posthumously as King Li, established his three sons as Kings of Huainan, Hengshan, and Lujiang.",
  "s0186": "In the thirteenth year summer, the emperor said: 'I have heard that disaster arises from resentment and blessing comes from virtue.",
  "s0187": "The faults of the hundred officials should come from my person.",
  "s0188": "Now the secret prayers shift the fault onto the subjects, to show my lack of virtue, I greatly disapprove.",
  "s0189": "Abolish it.'",
  "s0190": "In the fifth month, the Tai Cang governor Chunyu Gong had committed a crime deserving punishment, the imperial prison arrested and transported him to Chang'an.",
  "s0191": "Tai Cang Gong had no sons, had five daughters.",
  "s0192": "Tai Cang Gong was about to leave, cursed his daughters saying: 'Giving birth to daughters not sons, in times of emergency they are of no benefit!'",
  "s0193": "His youngest daughter Tiying injured herself weeping, then followed her father to Chang'an, submitted a letter saying: 'My father serves as an official, all of Qi praise his integrity and fairness, now sentenced to punishment according to law.",
  "s0194": "I pity those who die cannot be revived, punishment cannot be restored, although afterward they wish to change and reform themselves, there is no way.",
  "s0195": "I wish to enter as a court maid to redeem my father's punishment, to allow him to reform himself.'",
  "s0196": "The letter reached the emperor, the emperor was moved with pity, then issued an edict saying: 'I have heard that in the time of Yu Shun, they painted clothes with different patterns as punishment, and the people did not commit crimes.",
  "s0197": "Why was this?",
  "s0198": "Because governance was perfect.",
  "s0199": "Now the law has three mutilating punishments, yet crime does not cease, whose fault is this?",
  "s0200": "Is it not that my virtue is thin and teaching unclear?",
  "s0201": "I am greatly ashamed.",
  "s0202": "Moreover, the path of taming is not pure and ignorant people fall into it.",
  "s0203": "The Book of Songs says \"The kindly gentleman, father and mother of the people\".",
  "s0204": "Now when people have faults, teaching is not applied and punishment is added, or they wish to change behavior for goodness yet there is no way.",
  "s0205": "I greatly pity this.",
  "s0206": "Punishment to the point of severing limbs, carving flesh, lifelong without rest, how painful and without virtue it is, how does it befit being father and mother of the people!",
  "s0207": "Abolish the mutilating punishments.'",
  "s0208": "The emperor said: 'Agriculture is the foundation of the world, matters nothing greater.",
  "s0209": "Now diligently working from personal labor yet having the tax and levy of rent, this is to make root and branch have no distinction, the way to encourage agriculture has not yet been perfected.",
  "s0210": "Abolish the field rent tax.'",
  "s0211": "In the fourteenth year winter, the Xiongnu plotted to enter the border as bandits, attacked the Chaona pass, killed Beidi's governor Ang.",
  "s0212": "The emperor then dispatched three generals' armies to Longxi, Beidi, Shangjun, Zhongwei Zhou Sha as Wei General, Zhongwei Ling Zhang Wu as Cheqi General, army at Wei Bei, carriages one thousand, cavalry thirty thousand.",
  "s0213": "The emperor personally labored the army, straightened the soldiers and explained the teachings, granted the army officials and soldiers.",
  "s0214": "The emperor wished to personally lead to attack the Xiongnu, the ministers remonstrated, all did not listen.",
  "s0215": "The Empress Dowager firmly detained the emperor, the emperor then stopped.",
  "s0216": "Thereupon he appointed Dongyang Marquis Zhang Xiangru as grand general, Cheng Hou Chi as Neishi, Luan Bu as general, attacked the Xiongnu.",
  "s0217": "The Xiongnu fled away.",
  "s0218": "In spring, the emperor said: 'I hold the sacrificial victims, jade and silk to serve the Supreme Deity and ancestral temple, fourteen years now, the days have long continued, with my lack of clarity and unenlightenment I have long governed the world, I am greatly ashamed.",
  "s0219": "Broadly increase the sacrifices and altars, jade and silk.",
  "s0220": "In ancient times the former kings widely bestowed without seeking repayment, prayed to sacrifices not beseeching fortune, valued the worthy and belittled relatives, placed the common people before oneself, to the utmost of enlightenment.",
  "s0221": "Now I have heard the prayer officials' blessings and prayers all return fortune to my person, not to the people, I am greatly ashamed.",
  "s0222": "With my lack of virtue, personally enjoying the unique beauty of fortune, the people not sharing it, this increases my lack of virtue.",
  "s0223": "Order the prayer officials to present respect, have no prayers.'",
  "s0224": "At this time Beiping Marquis Zhang Cang was chancellor, originally excelled at the calendar.",
  "s0225": "The Lu man Gongsun Chen submitted a letter discussing the sequence of the five virtues, saying the present time is earth virtue, earth virtue should have yellow dragon appear, should change the calendar, clothes, colors, system.",
  "s0226": "The emperor issued it to the chancellor to discuss.",
  "s0227": "The chancellor calculated it as water virtue at present, beginning to make the tenth month black matters, considered his words not correct, requested to dismiss him.",
  "s0228": "In the fifteenth year, yellow dragon appeared in Chengji, the emperor then again summoned Lu Gongsun Chen, made him a scholar, clarified the earth virtue matters.",
  "s0229": "Thereupon the emperor issued an edict saying: 'A divine thing appeared in Chengji, no harm to the people, the year has abundance.",
  "s0230": "I personally offer sacrifices to the Supreme Deity and gods.",
  "s0231": "The rites officials discuss, do not avoid to toil me.'",
  "s0232": "The officials and rites officials all said: 'In ancient times the emperor personally performed the rites to serve the Supreme Deity at the suburbs, therefore called suburbs.'",
  "s0233": "Thereupon the emperor first visited Yong, offered sacrifices to the five emperors at the suburbs, with the fourth month of early summer replying with rites, also honored red.",
  "s0234": "The Zhao man New垣 Ping saw the vapors, then said to establish the five temples of Weiyang.",
  "s0235": "Wished to bring out the Zhou tripod, should have jade essence appear.",
  "s0236": "In the sixteenth year, the emperor personally offered sacrifices at the five temples of Weiyang, also with early summer replying with rites and honored red.",
  "s0237": "In the seventeenth year, obtained a jade cup, engraved saying 'The lord prolongs life'.",
  "s0238": "Thereupon the emperor began to change to the first year, ordered the world to hold great feasts.",
  "s0239": "That year, New垣 Ping's matters were exposed, executed the three clans.",
  "s0240": "After two years, the emperor said: 'I am not clear, cannot spread virtue afar, therefore the countries beyond the four directions sometimes are not peaceful.",
  "s0241": "The four wastes beyond are not at peace in their lives, the capital region toils without rest, the fault of these two lies in my thin virtue and inability to reach afar.",
  "s0242": "In recent years accumulated, the Xiongnu frequently violate the borders, many kill officials and people, the border ministers and soldiers moreover cannot explain my inner thoughts, to increase my lack of virtue.",
  "s0243": "For long binding difficult allied troops, the inner and outer countries how will they be at peace?",
  "s0244": "Now I rise early and sleep late, diligently governing the world, sorrowful and worried for the myriad people, not one day forget in my heart, therefore send envoys with crowns and canopies one after another on the roads, to explain my intentions to the Chanyu.",
  "s0245": "Now the Chanyu returns to ancient ways, considers the peace of the state, benefits the myriad people, personally abandons small grudges with me, joins the great way, binds brotherly relations, to preserve the myriad people of the whole world.",
  "s0246": "Peaceful relations have been decided, beginning this year.'",
  "s0247": "After six years winter, the Xiongnu three thousand entered Shangjun, three thousand entered Yunzhong.",
  "s0248": "Appointed Zhongdafu Ling Mian as Cheqi General, army at Feihu; former Chu chancellor Su Yi as general, army at Qu Zhu; general Zhang Wu garrisoned Beidi; Henei governor Zhou Ya as general, resided at Xiaye; Zongzheng Liu Li as general, resided at Bashang; Zhuo Hou Jun army at Jimen: to prepare for the Hu.",
  "s0249": "Several months, the Hu people departed, also dismissed.",
  "s0250": "The world had drought, locusts.",
  "s0251": "The emperor added favor: ordered the feudal lords not to enter tribute, opened the mountains and marshes, reduced various robes and horses, reduced the number of attendants and officials, sent out granaries to relieve the poor people, the people could sell nobility.",
  "s0252": "Emperor Wen came from Dai, ascended the throne twenty-three years, the palace chambers and parks, dogs and horses, robes and utensils had no increases, if inconvenient, promptly opened to benefit the people.",
  "s0253": "He often wished to build a dew terrace, summoned the craftsmen to estimate it, cost one hundred gold.",
  "s0254": "The emperor said: 'One hundred gold is the property of ten households of the common people, I serve the former emperor's palace chambers, constantly fear to shame them, why build a terrace!'",
  "s0255": "The emperor often wore plain silk robes, what he favored, Careful Madame, ordered her clothes not to drag the ground, curtains and canopies not to have embroidery, to show frugality, for the world's first.",
  "s0256": "Treated the tomb of Baling all with earthenware, not allowed to use gold, silver, copper, tin for decoration, did not treat the tomb, wished to be economical, not to trouble the people.",
  "s0257": "King Wei Tuo of Nanyue established himself as Martial Emperor, yet the emperor summoned King Wei Tuo's brothers, repaid with virtue, Tuo then removed the imperial title and became a subject.",
  "s0258": "Made peace with the Xiongnu, the Xiongnu violated the treaty and raided, yet ordered border defense and guarding, did not send troops to go deep, disliked troubling and exhausting the people.",
  "s0259": "King Zhao of Wu falsely claimed illness and did not come to court, sent a cane and table.",
  "s0260": "The assembled ministers like Yuan Ang and others spoke remonstration though cutting, often borrowed and used them.",
  "s0261": "The assembled ministers like Zhang Wu and others received bribes and gave gold and money, discovered, the emperor then sent out the imperial treasury gold and money to grant them, to shame their hearts, did not hand over to officials.",
  "s0262": "Specially focused on transforming the people with virtue, therefore the seas were rich within, rose in rites and righteousness.",
  "s0263": "After seven years six months Jiwei day, the emperor died in the Weiyang Palace.",
  "s0264": "The testament said: 'I have heard that covering the myriad things' birth, all have death.",
  "s0265": "Death is heaven and earth's principle, things' nature, how can one greatly grieve.",
  "s0266": "In the present time, the world all admires life and hates death, thick burials break property, heavy mourning harms life, I greatly disapprove.",
  "s0267": "Moreover I lack virtue, no way to assist the people; now I die, moreover make heavy mourning last long, to separate the cold and heat's number, grieve the fathers and sons, harm the long and short's feelings, diminish their food and drink, cut off the ghosts and gods' sacrifices, with heavy my lack of virtue, what to say to the world!",
  "s0268": "I have obtained to preserve the ancestral temple, with minute body entrusted above the world's lord king, over twenty years.",
  "s0269": "Relying on heaven and earth's spirit, altars of soil and grain's blessing, internally peaceful without weapons, nothing remaining virtue.",
  "s0270": "I lack wisdom, constantly feared mistaken conduct, to shame the former emperor's remaining virtue;",
  "s0271": "For the years' length, feared not to finish.",
  "s0272": "Now fortunately with heaven's year, able to again attend to nourish at the Gao Temple.",
  "s0273": "My lack of clarity and admiration of it, what grief and sorrow have I!",
  "s0274": "Order the world's officials and people, the order arrives and all go out to mourn three days, all release mourning.",
  "s0275": "No prohibition taking wives marrying daughters, sacrificing drinking wine eating meat.",
  "s0276": "Those who should give funeral matters clothing mourning, all without stepping on shoes.",
  "s0277": "The mourning bands without exceeding three inches, no cloth carriages nor weapons, no sending out men and women to cry mourn in the palace halls.",
  "s0278": "The palace halls those who should mourn, each morning and evening raise the voice fifteen times, rites finished dismiss.",
  "s0279": "Non morning and evening mourning times, prohibit not to dare cry privately.",
  "s0280": "Below, wear great red fifteen days, small red fourteen days, thin seven days, release mourning.",
  "s0281": "Those not in the order, all according to this order's example carry out.",
  "s0282": "Broadly announce to the world, make clearly know my intention.",
  "s0283": "The Baling mountain and streams follow their old, nothing to change.",
  "s0284": "Return the madam and below to at least make.'",
  "s0285": "Ordered Zhongwei Ya as Cheqi General, subordinate Guoheng as Tunjiang General, attendant Ling Wu as Fushi General, sent near counties' seen soldiers sixteen thousand, sent inner history soldiers fifteen thousand, buried Guo Chong Fushi subordinate the general Wu.",
  "s0286": "On Yisi day, the assembled ministers all knocked heads up honored title said Xiaowen Emperor.",
  "s0287": "The crown prince ascended at the Gao Temple.",
  "s0288": "On Dingmao day, took the honored title said Emperor.",
  "s0289": "Xiaowen Emperor first year tenth month, the edict Imperial Secretary: 'Have heard ancient times ancestors have merit then establish temple, ancestor has virtue then establish music.",
  "s0290": "Have heard singing expresses virtue; dancing manifests merit.",
  "s0291": "Gao Temple autumn sacrifice, performs Wu De, Wen Shi, Wu Xing dances.",
  "s0292": "Xiaohui Temple autumn sacrifice, performs Wen Shi, Wu Xing dances.",
  "s0293": "Xiaowen Emperor governs the world, opens barriers not different far directions.",
  "s0294": "Removes slander, goes mutilating punishment, rewards the elderly, collects orphans, to nurture the masses.",
  "s0295": "Reduces desires, does not receive offerings, does not take private profit.",
  "s0296": "Does not punish innocents without crime.",
  "s0297": "Removes castration punishment, brings out beautiful women, recontinues people's severed generations.",
  "s0298": "My lack of wisdom, cannot identify.",
  "s0299": "These all upper antiquity not reached, Xiaowen Emperor personally does.",
  "s0300": "Virtue matches heaven earth, profit reaches four seas, nothing not obtains fortune.",
  "s0301": "Illuminates like sun moon, while temple music not fitting.",
  "s0302": "I greatly fear.",
  "s0303": "For Xiaowen Emperor establish Zhaode dance, to manifest beautiful virtue.",
  "s0304": "Then ancestor merit virtue writes in bamboo silk, applies to ten thousand worlds, forever without end, I greatly rejoice.",
  "s0305": "With Chancellor, liegemen, Zhong Erqian Shi, rites officials altogether make rites proclaim.'",
  "s0306": "Chancellor minister Jia and others say: 'Your Majesty forever thinks filial piety, establishes Zhaode dance to manifest Xiaowen Emperor's abundant virtue.",
  "s0307": "All minister Jia and others foolish not reached.",
  "s0308": "Minister respectfully discusses: merit not great than Gao Emperor, virtue not abundant than Xiaowen Emperor, Gao Emperor temple fitting emperor Taizu temple, Xiaowen Emperor temple fitting emperor Taizong temple.",
  "s0309": "Emperor fitting world ancestor temple.",
  "s0310": "Prefectures commanderies fitting each establish Xiaowen Emperor Taizong temple.",
  "s0311": "Feudal kings liegemen envoys sacrifice emperor, year present ancestor temple.",
  "s0312": "Request write in bamboo silk, announce world.'",
  "s0313": "Edict says: 'Can.'",
  "s0314": "The Grand Historian says: Confucius says 'Must world then benevolent.",
  "s0315": "Good person's governance country hundred years, moreover can win residual go kill'.",
  "s0316": "Sincerely this saying!",
  "s0317": "Han rise to Xiaowen forty more years, virtue to most.",
  "s0318": "Linqin towards correcting clothes Feng Zen, modest yielding not become to now.",
  "s0319": "Alas, how not benevolent!",
  "s0320": "I lack wisdom, cannot identify.",
  "s0321": "These are all that ancient times did not reach, yet Emperor Wen personally practiced them.",
  "s0322": "Virtue thick matches heaven and earth, benefit and favor extends to the four seas, nothing does not obtain fortune.",
  "s0323": "Illuminates like sun and moon, while temple music does not match.",
  "s0324": "I greatly fear this.",
  "s0325": "Let Emperor Wen's temple have the Zhaode dance, to manifest beautiful virtue.",
  "s0326": "Then ancestors' merit and virtue will be recorded in bamboo and silk, applied to ten thousand worlds, forever without end, I greatly rejoice in this.",
  "s0327": "Let it be with the chancellor, marquises, officials of two thousand shi, and rites officials to fully compose the rites and submit.'",
  "s0328": "Chancellor minister Jia and others said: 'Your Majesty forever thinks of filial piety, establishes the Zhaode dance to manifest Emperor Wen's abundant virtue.",
  "s0329": "All minister Jia and others' foolishness does not reach this.",
  "s0330": "We respectfully discuss: World merit is not greater than Gao Emperor, virtue is not more abundant than Emperor Wen, Gao Emperor's temple should be the emperor's Taizu temple, Emperor Wen's temple should be the emperor's Taizong temple.",
  "s0331": "The Son of Heaven should generation after generation offer to ancestors' temples.",
  "s0332": "Commandery and state feudal lords should each establish a Taizong temple for Emperor Wen.",
  "s0333": "Feudal kings and marquises' envoys attend and sacrifice to the emperor, yearly offer to ancestors' temples.",
  "s0334": "We request to record it in bamboo and silk, announce to the world.'",
  "s0335": "The edict said: 'Approved.'",
  "s0337": "The Grand Historian says: Confucius said 'Must be successive generations then benevolent.",
  "s0338": "Good people's governance of country for a hundred years, moreover can overcome cruelty and go killing'.",
  "s0339": "Indeed this saying!",
  "s0340": "Han rose, to Emperor Wen forty more years, virtue reached abundance.",
  "s0341": "Nearly approached correcting calendar, clothes, Feng and Shan sacrifices, but modesty and yielding not completed to now.",
  "s0342": "Alas, how not benevolent!"
}
