{
  "s0502": "Twelve years, wang with Liang wang meet Lin Jin.",
  "s0503": "Common long Ji attack Zhao, capture Zhao general Zhuang.",
  "s0504": "Zhang Yi prime Chu.",
  "s0505": "Thirteen years, common long Zhang strike Chu at Dan Yang, capture its general Qu Gai, cut head eighty thousand;",
  "s0506": "Again attack Chu Han Zhong, take earth six hundred li, set Han Zhong jun.",
  "s0507": "Chu surround Yong Shi, Qin make common long Ji help Han yet east attack Qi, reach Man help Wei attack Yan.",
  "s0508": "Fourteen years, attack Chu, take Zhao Ling.",
  "s0509": "Dan, Li minister, Shu prime Zhuang kill Shu hou come descend.",
  "s0510": "Hui wang die, son Wu wang establish.",
  "s0511": "Han, Wei, Qi, Chu, Yue all guest follow.",
  "s0512": "Wu wang first year, with Wei Hui wang meet Lin Jin.",
  "s0513": "Punish Shu prime Zhuang.",
  "s0514": "Zhang Yi, Wei Zhang all east exit at Wei.",
  "s0515": "Attack Yi Qu, Dan, Li.",
  "s0516": "Two years, initial set Cheng Xiang, Qiang Li Ji, Gan Mao become left right Cheng Xiang.",
  "s0517": "Zhang Yi die at Wei.",
  "s0518": "Three years, with Han Xiang wang meet Lin Jin outer.",
  "s0519": "Nan Gong Jie die, Qiang Li Ji prime Han.",
  "s0520": "Wu wang tell Gan Mao said: 'Sha ren desire use carriage pass three Chuan, spy Zhou chamber, die not regret.'",
  "s0521": "Its autumn, make Gan Mao, common long Feng attack Yi Yang.",
  "s0522": "Four years, pull Yi Yang, cut head six thousand.",
  "s0523": "Involve He, wall Wu Sui.",
  "s0524": "Wei crown prince come court.",
  "s0525": "Wu wang have force good play, force scholar Ren Bi, Wu Huo, Meng Yue all reach big official.",
  "s0526": "Wang with Meng Yue raise ding, break Bin.",
  "s0527": "Eight month, Wu wang die.",
  "s0528": "Clan Meng Yue.",
  "s0529": "Wu wang take Wei woman become queen, no son.",
  "s0530": "Establish different mother younger brother, is Zhao Xiang wang.",
  "s0531": "Zhao Xiang mother Chu person, surname Mi clan, number Xuan tai hou.",
  "s0532": "Wu wang die time, Zhao Xiang wang become pledge at Yan, Yan person send return, get establish.",
  "s0533": "Zhao Xiang wang first year, Yan jun Ji become prime.",
  "s0534": "Gan Mao exit at Wei.",
  "s0535": "Two years, Hui Xing see.",
  "s0536": "Common long Zhuang with ministers, feudal lords, Gong Zi become reverse, all punish, reach Hui Wen hou all not able good die.",
  "s0537": "Dao Wu wang hou exit return Wei.",
  "s0538": "Three years, wang crown.",
  "s0539": "With Chu wang meet Huang Ji, with Chu Shang Yong.",
  "s0540": "Four years, take Pu Ban.",
  "s0541": "Hui Xing see.",
  "s0542": "Five years, Wei wang come court Ying Ting, again with Wei Pu Ban.",
  "s0543": "Six years, Shu hou Hui reverse, Si Ma Cuo pacify Shu.",
  "s0544": "Common long Huan attack Chu, cut head two thousand.",
  "s0545": "Jing Yang jun pledge at Qi.",
  "s0546": "Day eat, day dark.",
  "s0547": "Seven years, pull Xin Cheng.",
  "s0548": "Qiang Li Zi die.",
  "s0549": "Eight years, make general Mi Rong attack Chu, take Xin Shi.",
  "s0550": "Qi make Zhang Zi, Wei make Gong Sun Xi, Han make Bao Yuan together attack Chu Fang Cheng, take Tang Mian.",
  "s0551": "Zhao break Zhong Shan, its jun flee, finally die Qi."
}

