{
  "s0001": "Shu Lizi, named Ji, was Qin Hui Wang younger brother, different mother.",
  "s0002": "Mother was Han woman.",
  "s0003": "Shu Lizi slick witty multi-intelligent, Qin people called him wisdom bag.",
  "s0004": "Qin Hui Wang eight years, enfeoffed Shu Lizi right more, made general attack Qu Wo, completely expel its people, take its city, land entered Qin.",
  "s0005": "Qin Hui Wang twenty five years, made Shu Lizi general attack Zhao, captured Zhao general Zhuang Bao, took Lin.",
  "s0006": "Next year, assisted Wei Zhang attack Chu, defeated Chu general Qu Gai, took Han Zhong land.",
  "s0007": "Qin enfeoffed Shu Lizi, titled Yan Jun.",
  "s0008": "Qin Hui Wang died, crown prince Wu Wang established, expelled Zhang Yi, Wei Zhang, made Shu Lizi, Gan Mao left right chancellors.",
  "s0009": "Qin made Gan Mao attack Han, took Yi Yang.",
  "s0010": "Made Shu Lizi with hundred chariots enter Zhou.",
  "s0011": "Zhou with troops welcome him, intention very respectful.",
  "s0012": "Chu Wang angry, rebuked Zhou, for its heavy Qin guest.",
  "s0013": "You Teng for Zhou advised Chu Wang: Zhi Bo attack Qiu You, sent him broad chariot, because followed with troops, Qiu You then perished.",
  "s0014": "Why?",
  "s0015": "No preparation therefore.",
  "s0016": "Qi Huan Gong attack Cai, announced punish Chu, actually attack Cai.",
  "s0017": "Now Qin, tiger wolf state, make Shu Lizi with hundred chariots enter Zhou, Zhou with Qiu You, Cai observe it, therefore make long halberds front, strong crossbows rear, named guard Ji, actually imprison him.",
  "s0018": "Moreover Zhou how can not worry its state altars?",
  "s0019": "Fear one day perish state to worry great wang.",
  "s0020": "Chu Wang then pleased.",
  "s0021": "Qin Wu Wang died, Zhao Wang established, Shu Lizi moreover increased honored.",
  "s0022": "Zhao Wang first year, Shu Lizi will attack Pu.",
  "s0023": "Pu guard feared, requested Hu Yan.",
  "s0024": "Hu Yan for Pu told Shu Lizi: Jun attack Pu, for Qin?",
  "s0025": "For Wei?",
  "s0026": "For Wei then good, for Qin then not beneficial.",
  "s0027": "Wei reason become Wei, because Pu.",
  "s0028": "Now attack Pu enter Wei, Wei certainly break follow it.",
  "s0029": "Wei lose Xi He outside without to take, troops weak.",
  "s0030": "Now merge Wei to Wei, Wei certainly strong.",
  "s0031": "Wei strong day, Xi He outside certainly danger.",
  "s0032": "Moreover Qin Wang will observe jun affairs, harm Qin benefit Wei, wang certainly punish jun.",
  "s0033": "Shu Lizi said: What to do?",
  "s0034": "Hu Yan said: Jun release Pu not attack, subject try for jun enter speak, with virtue Wei jun.",
  "s0035": "Shu Lizi said: Good.",
  "s0036": "Hu Yan entered Pu, told its guard: Shu Lizi know Pu difficulty, his words certainly take Pu.",
  "s0037": "Yan can make release Pu not attack.",
  "s0038": "Pu guard feared, because twice bow said: Wish with request.",
  "s0039": "Because presented gold three hundred jin, said: Qin troops if retreat, please certainly speak son to Wei jun, make son south face.",
  "s0040": "Therefore Hu Yan received gold from Pu to self-noble Wei.",
  "s0041": "Then released Pu departed.",
  "s0042": "Returned attacked Pi Shi, Pi Shi not surrender, again departed.",
  "s0043": "Zhao Wang seven years, Shu Lizi died, buried Wei Nan Zhang Tai east.",
  "s0044": "Said: After hundred years, this should have Son of Heaven palace flank my tomb.",
  "s0045": "Shu Lizi disease room at Zhao Wang temple west Wei Nan Yin Xiang Chu Li, therefore custom call Chu Li Zi.",
  "s0046": "To Han rise, Chang Le Palace at its east, Wei Yang Palace at its west, Wu Ku exactly straight its tomb.",
  "s0047": "Qin proverb: Strength then Ren Bi, wisdom then Chu Li.",
  "s0049": "Gan Mao, Xia Cai man.",
  "s0050": "Served Xia Cai Shi Ju mister, studied hundred schools sayings.",
  "s0051": "Because Zhang Yi, Shu Lizi sought see Qin Hui Wang.",
  "s0052": "Wang saw pleased him, made general, assisted Wei Zhang roughly pacified Han Zhong land.",
  "s0053": "Hui Wang died, Wu Wang established.",
  "s0054": "Zhang Yi, Wei Zhang departed, east to Wei.",
  "s0055": "Shu Hou Hui, chancellor Zhuang rebelled, Qin made Gan Mao pacify Shu.",
  "s0056": "Returned, made Gan Mao left chancellor, Shu Lizi right chancellor.",
  "s0057": "Qin Wu Wang three years, told Gan Mao: \"I wish broad chariot pass San Chuan, spy Zhou house, I die not rotten.\"",
  "s0058": "Gan Mao said: \"Request Wei, pact attack Han, make Xiang Shou assist go.\"",
  "s0059": "Gan Mao arrived, told Xiang Shou: \"You return, speak wang: Wei listen minister, yet wish wang not attack.",
  "s0060": "Affairs complete, all as you merit.\"",
  "s0061": "Xiang Shou returned, told wang, wang welcomed Gan Mao at Xi Rang.",
  "s0062": "Gan Mao arrived, wang asked its reason.",
  "s0063": "Replied: \"Yi Yang, big county, Shang Dang, Nan Yang store long.",
  "s0064": "Named county, actually commandery.",
  "s0065": "Now wang double several dangers, travel thousand li attack it, difficult.",
  "s0066": "Former Zeng Shen at Fei, Lu man with Zeng Shen same name kill person, person told his mother: Zeng Shen kill person, his mother weave as before.",
  "s0067": "Shortly, one person again told: Zeng Shen kill person, his mother still weave as before.",
  "s0068": "Shortly again one person told: Zeng Shen kill person, his mother threw shuttle left loom, crossed wall fled.",
  "s0069": "Using Zeng Shen worthy with his mother trust him, three men doubt, his mother feared.",
  "s0070": "Now minister worthy not as Zeng Shen, wang trust minister again not as Zeng Shen mother trust Zeng Shen, doubt minister not only three men, minister fear wang throw shuttle.",
  "s0071": "Initially Zhang Yi west merge Ba Shu land, north open Xi He outside, south take Shang Yong, world not with much Zhang Zi but with worthy former wang.",
  "s0072": "Wei Wen Hou make Yue Yang general attack Zhong Shan, three years take it.",
  "s0073": "Yue Yang returned discuss merit, Wen Hou showed slander book one box.",
  "s0074": "Yue Yang twice bow touched head: This not subject merit, jun effort.",
  "s0075": "Now minister, sojourner minister.",
  "s0076": "Shu Lizi, Gong Sun Yang two men grasp Han discuss it, wang certainly listen, this wang deceive Wei wang subject receive Gong Zhong Chi resentment.",
  "s0077": "Wang said: I not listen, please with you pact.",
  "s0078": "Finally made chancellor Gan Mao lead troops attack Yi Yang.",
  "s0079": "Five months not take, Shu Lizi, Gong Sun Yang indeed contended it.",
  "s0080": "Wu Wang summoned Gan Mao, wished stop troops.",
  "s0081": "Gan Mao said: \"Xi Rang at that.\"",
  "s0082": "Wang said: \"Have.\"",
  "s0083": "Because greatly all raised troops, made Gan Mao strike it.",
  "s0084": "Beheaded six thousand, then took Yi Yang.",
  "s0085": "Han Xiang Wang made Gong Zhong Chi enter thank, with Qin peace.",
  "s0086": "Wu Wang finally to Zhou, died Zhou.",
  "s0087": "His younger brother established, Zhao Wang.",
  "s0088": "Wang mother Xuan Empress Dowager, Chu woman.",
  "s0089": "Chu Huai Wang resented former Qin defeat Chu Dan Yang Han not save, then with troops surround Han Yong Shi.",
  "s0090": "Han made Gong Zhong Chi report urgent Qin.",
  "s0091": "Qin Zhao Wang new established, Empress Dowager Chu person, not willing save.",
  "s0092": "Gong Zhong because Gan Mao, Mao for Han spoke Qin Zhao Wang: \"Gong Zhong just have obtain Qin save, therefore dare resist Chu.",
  "s0093": "Now Yong Shi surround, Qin troops not descend Xiao, Gong Zhong moreover raise head not court, Gong Shu moreover with state south unite Chu.",
  "s0094": "Chu Han become one, Wei clan dare not not listen, then attack Qin form completed.",
  "s0095": "Not know sit await attack compared attack person profit?\"",
  "s0096": "Qin Wang said: \"Good.\"",
  "s0097": "Then sent troops Xiao save Han.",
  "s0098": "Chu troops departed.",
  "s0099": "Qin made Xiang Shou pacify Yi Yang, made Shu Lizi, Gan Mao attack Wei Pi Shi.",
  "s0100": "Xiang Shou, Xuan Empress Dowager outer clan, with Zhao Wang young grow, therefore employed.",
  "s0101": "Xiang Shou like Chu, Chu heard Qin noble Xiang Shou, thick served Xiang Shou.",
  "s0102": "Xiang Shou for Qin guard Yi Yang, will attack Han.",
  "s0103": "Han Gong Zhong made Su Dai tell Xiang Shou: \"Bird trapped overturn cart.",
  "s0104": "Jun break Han, humiliate Gong Zhong, Gong Zhong collect state again serve Qin, self think certainly can enfeoff.",
  "s0105": "Now jun with Chu release Kou Di land, enfeoff small Ling Yin Du Yang.",
  "s0106": "Qin Chu unite, again attack Han, Han certainly perish.",
  "s0107": "Han perish, Gong Zhong moreover personally lead his private followers block Qin.",
  "s0108": "Wish jun carefully consider.\"",
  "s0109": "Xiang Shou said: \"I unite Qin Chu not to oppose Han, you for Shou report Gong Zhong, Qin Han alliance can unite.\"",
  "s0110": "Su Dai replied: \"Wish have report jun.",
  "s0111": "People say noble what noble noble.",
  "s0112": "Wang love practice jun, not as Gong Sun Yang;",
  "s0113": "His intelligence jun, not as Gan Mao.",
  "s0114": "Now two men all not close Qin affairs, jun alone with wang main decide state, why?",
  "s0115": "They have reason lose it.",
  "s0116": "Gong Sun Yang party Han, Gan Mao party Wei, therefore wang not trust.",
  "s0117": "Now Qin Chu contend strong jun party Chu, this with Gong Sun Yang, Gan Mao same way, jun how different?",
  "s0118": "People all say Chu good change, jun certainly perish it, this self make blame.",
  "s0119": "Jun not as with wang plan its change, good Han prepare Chu, like this no calamity.",
  "s0120": "Han clan certainly first with state from Gong Sun Yang then entrust state Gan Mao.",
  "s0121": "Han, jun enemy.",
  "s0122": "Now jun speak good Han prepare Chu, this external raise not biased enemy.\"",
  "s0123": "Xiang Shou said: \"Correct, I very wish Han unite.\"",
  "s0124": "Replied: \"Gan Mao promised Gong Zhong Wu Sui, return Yi Yang people, now jun alone collect it, very difficult.\"",
  "s0125": "Xiang Shou said: \"Then what?",
  "s0126": "Wu Sui finally cannot obtain?\"",
  "s0127": "Replied: \"Jun why not with Qin for Han seek Ying Chuan Chu?",
  "s0128": "This Han trust land.",
  "s0129": "Jun seek obtain it, this make orders walk Chu with its land virtue Han.",
  "s0130": "Jun seek not obtain, this Han Chu resentment not resolve alliance hasten Qin.",
  "s0131": "Qin Chu contend strong, jun slowly pass Chu collect Han, this benefit Qin.\"",
  "s0132": "Xiang Shou said: \"What?\"",
  "s0133": "Replied: \"This good affair.",
  "s0134": "Gan Mao wish with Wei take Qi, Gong Sun Yang wish with Han take Qi.",
  "s0135": "Now jun take Yi Yang as merit, collect Chu Han secure it, punish Qi Wei crime, this make Gong Sun Yang, Gan Mao no affairs.\"",
  "s0137": "Gan Mao finally spoke Qin Zhao Wang, with Wu Sui return Han.",
  "s0138": "Xiang Shou, Gong Sun Yang contended it, not obtain.",
  "s0139": "Xiang Shou, Gong Sun Yang therefore resented, slandered Gan Mao.",
  "s0140": "Mao feared, stopped attack Wei Pu Ban, fled.",
  "s0141": "Shu Lizi with Wei discussed, stopped troops.",
  "s0142": "Gan Mao fled Qin go Qi, met Su Dai.",
  "s0143": "Dai as Qi envoy Qin.",
  "s0144": "Gan Mao said: \"Subject get crime Qin, feared fled escape, no place hide trace.",
  "s0145": "Subject heard poor man daughter with rich man daughter meet spin, poor man daughter said: I no buy candle, your candle light fortunately have surplus, you can divide me surplus light, no harm your brightness obtain one convenience.",
  "s0146": "Now subject distressed jun just envoy Qin control road.",
  "s0147": "Mao wife children there, wish jun with surplus light shake them.\"",
  "s0148": "Su Dai permitted.",
  "s0149": "Then completed envoy Qin.",
  "s0150": "Already, because advised Qin Wang: \"Gan Mao, not common scholar.",
  "s0151": "His dwell Qin, several generations heavy.",
  "s0152": "From Xiao Pass to Gui Gu, its land form danger easy all clearly know.",
  "s0153": "He with Qi pact Han Wei return plot Qin, not Qin profit.\"",
  "s0154": "Qin Wang said: \"Then what?\"",
  "s0155": "Su Dai said: \"Wang not as heavy his gift, thick his salary welcome him, make he come then place Gui Gu, lifetime not out.\"",
  "s0156": "Qin Wang said: \"Good.\"",
  "s0157": "Immediately granted upper qing, with chancellor seal welcome at Qi.",
  "s0158": "Gan Mao not go.",
  "s0159": "Su Dai told Qi Min Wang: \"Gan Mao, worthy man.",
  "s0160": "Now Qin grant upper qing, with chancellor seal welcome him.",
  "s0161": "Gan Mao virtue wang grant, good be wang minister, therefore decline not go.",
  "s0162": "Now wang how ritual him?\"",
  "s0163": "Qi Wang said: \"Good.\"",
  "s0164": "Immediately placed upper qing treat him.",
  "s0165": "Qin because again Gan Mao family to trade Qi.",
  "s0166": "Qi made Gan Mao envoy Chu, Chu Huai Wang new with Qin unite marriage happy.",
  "s0167": "Qin heard Gan Mao Chu, made person tell Chu Wang: \"Wish send Gan Mao Qin.\"",
  "s0168": "Chu Wang asked Fan Quan: \"I wish place chancellor Qin, who suitable?\"",
  "s0169": "Replied: \"Subject not enough know.\"",
  "s0170": "Chu Wang said: \"I wish chancellor Gan Mao, acceptable?\"",
  "s0171": "Replied: \"Not acceptable.",
  "s0172": "Shi Ju, Xia Cai gate guard, greatly not serve jun, small not family room, with cheap not clean known world, Gan Mao serve him comply.",
  "s0173": "Therefore Hui Wang clear, Wu Wang examine, Zhang Yi eloquence, Gan Mao serve them, take ten offices no crime.",
  "s0174": "Mao truly worthy, yet not chancellor Qin.",
  "s0175": "Qin have worthy chancellor, not Chu state profit.",
  "s0176": "Moreover wang before used Zhao Hua Chu, internal do Zhang Yi difficulty, Yue state chaotic, therefore Chu south blocked Li Men commandery Jiang Dong.",
  "s0177": "Calculate wang merit so can like this, Yue state chaotic Chu govern.",
  "s0178": "Now wang know use Yue forget use Qin, subject think wang great error.",
  "s0179": "Then wang if wish place chancellor Qin, then none better Xiang Shou suitable.",
  "s0180": "Xiang Shou to Qin Wang, close, young with same clothes, long with same chariot, listen affairs.",
  "s0181": "Wang certainly chancellor Xiang Shou Qin, then Chu state profit.\"",
  "s0182": "Then made envoy request Qin chancellor Xiang Shou Qin.",
  "s0183": "Qin finally chancellor Xiang Shou.",
  "s0184": "Gan Mao finally not obtain reenter Qin, died Wei.",
  "s0185": "Gan Mao have grandson called Gan Luo.",
  "s0186": "Gan Luo, Gan Mao grandson.",
  "s0187": "Mao died after, Gan Luo year twelve, served Qin chancellor Wen Xin Hou Lu Bu Wei.",
  "s0188": "Qin Shi Huang made Gang Cheng Jun Cai Ze Yan, three years Yan Wang Xi made crown prince Dan hostage Qin.",
  "s0189": "Qin made Zhang Tang go chancellor Yan, wished with Yan together attack Zhao broaden He Jian land.",
  "s0190": "Zhang Tang told Wen Xin Hou: \"Subject once for Qin Zhao Wang attack Zhao, Zhao resent subject, said: Obtain Tang give hundred li land.",
  "s0191": "Now Yan must pass Zhao, subject cannot go.\"",
  "s0192": "Wen Xin Hou not happy, no with force.",
  "s0193": "Gan Luo said: \"Jun Hou why not happy very?\"",
  "s0194": "Wen Xin Hou said: \"I make Gang Cheng Jun Cai Ze serve Yan three years, Yan crown prince Dan already hostage Qin, I self please Zhang Qing chancellor Yan not willing go.\"",
  "s0195": "Gan Luo said: \"Subject please go.\"",
  "s0196": "Wen Xin Hou scolded: \"Go!",
  "s0197": "I body self please not willing, you how can go?\"",
  "s0198": "Gan Luo said: \"Da Xiang Tuo born seven years Confucius teacher.",
  "s0199": "Now subject born twelve years here, jun its try subject, why hurry scold?\"",
  "s0200": "Then Gan Luo saw Zhang Qing: \"Qing merit who with Wu An Jun?\"",
  "s0201": "Qing said: \"Wu An Jun south frustrate strong Chu, north awe Yan Zhao, battle victory attack take, break city fall cities, not know its number, subject merit not as.\"",
  "s0202": "Gan Luo said: \"Ying Hou use Qin, who with Wen Xin Hou monopolize?\"",
  "s0203": "Zhang Qing said: \"Ying Hou not as Wen Xin Hou monopolize.\"",
  "s0204": "Gan Luo said: \"Qing bright know not as Wen Xin Hou monopolize?\"",
  "s0205": "Said: \"Know.\"",
  "s0206": "Gan Luo said: \"Ying Hou wish attack Zhao, Wu An Jun difficult it, leave Xian Yang seven li stand die Du You.",
  "s0207": "Now Wen Xin Hou self please Qing chancellor Yan not willing go, subject not know Qing die place.\"",
  "s0208": "Zhang Tang said: \"Please because child go.\"",
  "s0209": "Ordered prepare manage go.",
  "s0210": "Go have day, Gan Luo told Wen Xin Hou: \"Borrow subject chariot five, please for Zhang Tang first report Zhao.\"",
  "s0211": "Wen Xin Hou then entered spoke Shi Huang: \"Former Gan Mao grandson Gan Luo, year young, yet famous family grandson, feudal lords all hear.",
  "s0212": "Now Zhang Tang wish claim ill not willing go, Gan Luo advise go.",
  "s0213": "Now wish first report Zhao, please permit send.\"",
  "s0214": "Shi Huang summoned see, made Gan Luo Zhao.",
  "s0215": "Zhao Xiang Wang suburb welcomed Gan Luo.",
  "s0216": "Gan Luo advised Zhao Wang: \"Wang hear Yan crown prince Dan hostage Qin?\"",
  "s0217": "Said: \"Hear.\"",
  "s0218": "Said: \"Hear Zhang Tang chancellor Yan?\"",
  "s0219": "Said: \"Hear.\"",
  "s0220": "Yan crown prince Dan hostage Qin, Yan not deceive Qin.",
  "s0221": "Zhang Tang chancellor Yan, Qin not deceive Yan.",
  "s0222": "Yan Qin not deceive, attack Zhao, danger.",
  "s0223": "Yan Qin not deceive no different reason, wish attack Zhao broaden He Jian.",
  "s0224": "Wang not as give subject five cities broaden He Jian, please return Yan crown prince, with strong Zhao attack weak Yan.\"",
  "s0225": "Zhao Wang immediately self divide five cities broaden He Jian.",
  "s0226": "Qin return Yan crown prince.",
  "s0227": "Zhao attack Yan, obtain Shang Gu thirty cities, make Qin have eleven.",
  "s0228": "Gan Luo return report Qin, then enfeoff Gan Luo upper qing, again with Shi Gan Mao field house grant him.",
  "s0229": "Grand Historian said: Shu Lizi with bone flesh heavy, solid its reason, Qin people praise his wisdom, therefore much collect.",
  "s0230": "Gan Mao rise Xia Cai alley door, manifest name feudal lords, heavy strong Qi Chu.",
  "s0231": "Gan Luo year young, yet put out strange plan, sound proclaim later generations.",
  "s0232": "Though not solid conduct gentleman, yet also Warring States strategists.",
  "s0233": "When Qin strong time, world especially incline plot deceit."
}