{
  "s0234": "Yan small weak, repeatedly distressed by troops, now plan whole state not sufficient to resist Qin.",
  "s0235": "Feudal lords submit Qin, none dare vertical alliance.",
  "s0236": "Dan's private plan foolish, considered truly get world's brave warriors send to Qin, spy with heavy profit;",
  "s0237": "Qin king greedy, his situation must get what wish.",
  "s0238": "Truly get kidnap Qin king, make completely return feudal lords invaded land, like Cao Mo with Qi Huan Gong, then very good;",
  "s0239": "If cannot, moreover stab kill him.",
  "s0240": "That Qin great generals monopolize troops outside while inner has chaos, then ruler ministers mutually suspect, with their interval feudal lords get vertical alliance, their break Qin certain.",
  "s0241": "This Dan's upper wish, yet not know entrust life, only Jing Qing attentive.'",
  "s0242": "Long time, Jing Ke said: 'This state's great affair, minister inferior, fear not sufficient undertake mission.'",
  "s0243": "Crown prince front bowed head, firmly requested not decline, then permitted promised.",
  "s0244": "Thus honored Jing Qing as upper minister, lodged upper lodge.",
  "s0245": "Crown prince daily made door, supplied great feast prepared, rare objects frequent presented, chariot horses beauties indulged Jing Ke what desired, to comply suit his intent.",
  "s0246": "Long time, Jing Ke not had go intent.",
  "s0247": "Qin general Wang Jian broke Zhao, captured Zhao king, completely took its land, advanced troops north seized land to Yan south border.",
  "s0248": "Crown prince Dan feared, then requested Jing Ke: 'Qin troops morning evening cross Yi water, then though wish long serve you, how obtainable!'",
  "s0249": "Jing Ke said: 'Without crown prince speak, minister wish see him.",
  "s0250": "Now go yet no trust, then Qin not approachable.",
  "s0251": "That Fan general, Qin king buys his head gold thousand jin, fief ten thousand households.",
  "s0252": "Truly get Fan general head with Yan Du Kang land map, present Qin king, Qin king must pleased see minister, minister then can have to repay.'",
  "s0253": "Crown prince said: 'Fan general poor distressed came submit Dan, Dan not bear with self private injure elder intention, wish you reconsider!'",
  "s0255": "Jing Ke knew crown prince not bear, thus secretly saw Fan Yuji: 'Qin treated general can call deep, parents clan all executed exterminated.",
  "s0256": "Now heard buy general head gold thousand jin, fief ten thousand households, will handle what?'",
  "s0257": "Yuji faced heaven great sighed flowing tears: 'Yuji every think, often pained to bone marrow, but plan not know where out!'",
  "s0258": "Jing Ke said: 'Now have one word can resolve Yan state suffering, repay general enmity, how?'",
  "s0259": "Yuji then front: 'Do how?'",
  "s0260": "Jing Ke said: 'Wish get general head to present Qin king, Qin king must pleased see minister, minister left hand grasp his sleeve, right hand stab his chest, then general enmity repaid Yan seen humiliate shame removed.",
  "s0261": "General how intend?'",
  "s0262": "Fan Yuji exposed shoulder choked cried advanced: 'This minister day night gnash teeth corrode heart, now get hear teaching!'",
  "s0263": "Thus self-slit.",
  "s0264": "Crown prince heard, galloped went, prostrated corpse cried, extreme sorrow.",
  "s0265": "Already could not handle what, then placed Fan Yuji head in box sealed.",
  "s0266": "Thus crown prince beforehand sought world sharp dagger, got Zhao person Xu lady dagger, bought hundred jin gold, made artisan with medicine temper, tested on person, blood wet thread, person none not immediately died.",
  "s0267": "Then prepared send Jing Qing.",
  "s0268": "Yan state had brave warrior Qin Wuyang, age thirteen, killed person, people dared not offend look.",
  "s0269": "Thus commanded Qin Wuyang as deputy.",
  "s0270": "Jing Ke had waited person, wished with go;",
  "s0271": "That person dwelt far not come, yet prepared journey.",
  "s0272": "Moment, not issued, crown prince delayed him, suspected his change regret, then requested: 'Day already exhausted, Jing Qing how intend?",
  "s0273": "Dan please get first send Qin Wuyang.'",
  "s0274": "Jing Ke angered, scolded crown prince: 'What crown prince send?",
  "s0275": "Go not return, boy child!",
  "s0276": "Moreover carry one dagger enter immeasurable strong Qin, servant so stay, wait my guest with go.",
  "s0277": "Now crown prince delays, please leave decided!'",
  "s0278": "Thus issued.",
  "s0279": "Crown prince and guests knew affair, all white clothes hats to send him.",
  "s0280": "Reached Yi water above, already sacrificed, took road, Gao Jianli beat zhu, Jing Ke harmonized sang, made change zhi sound, scholars all hung tears wept.",
  "s0281": "Again front made song: 'Wind soughs Yi water cold, brave man one go not return!'",
  "s0282": "Again made yu sound lofty, scholars all stared eyes, hair all up pointed caps.",
  "s0283": "Thus Jing Ke approached carriage departed, end not look back.",
  "s0284": "Thus reached Qin, held thousand jin gift currency objects, thick presented Qin king favored minister middle minister Zi Meng Jia."
}
