{
  "s0001": "Xiang Ji was a Xiagiang man, courtesy name Yu.",
  "s0002": "When he first rose, aged twenty-four.",
  "s0003": "His uncle Xiang Liang, Liang's father was Chu general Xiang Yan, who was executed by Qin general Wang Jian.",
  "s0004": "Xiang clan generation after generation were Chu generals, enfeoffed at Xiang, therefore surnamed Xiang clan.",
  "s0005": "Xiang Ji in youth, studied writing but did not succeed, left to study sword, again did not succeed.",
  "s0006": "Xiang Liang angered him.",
  "s0007": "Ji said: 'Writing suffices to record names only.",
  "s0008": "Sword one man enemy, not worth learning, learn ten thousand man enemy.'",
  "s0009": "Thereupon Xiang Liang taught Ji military tactics, Ji greatly pleased, roughly knew its meaning, but again unwilling to finish learning.",
  "s0010": "Xiang Liang once had Queyang arrest, then requested Qi prison clerk Cao Jiu write to Queyang prison clerk Sima Xin, to use precedent got released.",
  "s0011": "Xiang Liang killed person, with Ji avoided enmity in Wu Zhong.",
  "s0012": "Wu Zhong worthy scholars all came out under Xiang Liang.",
  "s0013": "Whenever Wu Zhong had great labor service or funerals, Xiang Liang often acted as main manager, secretly used military tactics to organize guests and younger brothers, with this knew his ability.",
  "s0014": "Qin First Emperor toured Kuaiji, crossed Zhejiang, Liang with Ji both watched.",
  "s0015": "Ji said: 'That can be taken and replaced.'",
  "s0016": "Liang covered his mouth, said: 'Do not reckless speak, clan exterminated!'",
  "s0017": "Liang with this considered Ji extraordinary.",
  "s0018": "Ji grew eight chi plus, strength could lift tripod, talent spirit surpassed people, though Wu Zhong younger brothers all already feared Ji.",
  "s0019": "Qin Second Year first year seventh month, Chen She and others rose in Daze.",
  "s0020": "Its ninth month, Kuaiji governor Tong told Liang said: 'Jiangxi all rebel, this also heaven perishing Qin time.",
  "s0021": "I heard first then control people, later then controlled by people.",
  "s0022": "I wish to send troops, make gong and Huan Chu lead.'",
  "s0023": "At time Huan Chu fled in marshes.",
  "s0024": "Liang said: 'Huan Chu fled, people none know his place, only Ji knows.'",
  "s0025": "Liang then left, warned Ji hold sword wait outside.",
  "s0026": "Liang again entered, with governor sat, said: 'Please summon Ji, make receive command summon Huan Chu.'",
  "s0027": "Governor said: 'Yes.'",
  "s0028": "Liang summoned Ji enter.",
  "s0029": "Moment, Liang winked at Ji said: 'Can go!'",
  "s0030": "Thereupon Ji drew sword beheaded governor.",
  "s0031": "Xiang Liang held governor head, wore his seal cords.",
  "s0032": "Gate below greatly shocked, disturbed, Ji attacked killed several tens hundreds people.",
  "s0033": "One prefecture all terrified submitted, none dared rise.",
  "s0034": "Liang then summoned former known powerful officials, explained what did to rise great affair, then raised Wu Zhong troops.",
  "s0035": "Sent people collected lower counties, got elite troops eight thousand.",
  "s0036": "Liang deployed Wu Zhong powerful men as colonel, scout, marshal.",
  "s0037": "Had one person not used, personally spoke to Liang.",
  "s0038": "Liang said: 'Former time certain funeral made gong manage certain affair, could not manage, with this not appoint use gong.'",
  "s0039": "Crowd then all submitted.",
  "s0040": "Thereupon Liang as Kuaiji governor, Ji as deputy general, toured lower counties.",
  "s0041": "Guangling person Zhao Ping then for Chen Wang toured Guangling, could not take.",
  "s0042": "Heard Chen Wang defeated fled, Qin troops moreover coming, then crossed Jiang falsely Chen Wang command, appointed Liang as Chu Wang upper pillar state.",
  "s0043": "Said: 'Jiangdong already settled, urgently lead troops west attack Qin.'",
  "s0044": "Xiang Liang then with eight thousand crossed Jiang west.",
  "s0045": "Heard Chen Ying already took Dongyang, sent messenger wished connect harmonize together west.",
  "s0046": "Chen Ying was former Dongyang county clerk, resided county, always trustworthy careful, called elder.",
  "s0047": "Dongyang youth killed their magistrate, gathered several thousand people, wished establish elder, none suitable, then requested Chen Ying.",
  "s0048": "Ying declined could not, then forced established Ying as elder, county followers got twenty thousand people.",
  "s0049": "Youth wished establish Ying conveniently as wang, different army green head special rise.",
  "s0050": "Chen Ying mother told Ying said: 'From I became your family woman, never heard your ancestors had noble ones.",
  "s0051": "Now violently obtained great name, not auspicious.",
  "s0052": "Better belong to someone, affair succeed still get enfeoff marquis, affair fail easy to flee, not world pointed name.\"",
  "s0053": "Ying then dared not be wang.",
  "s0054": "Told his army officials said: \"Xiang clan generation generation general family, have name in Chu.",
  "s0055": "Now wish raise great affair, general not the person, cannot.",
  "s0056": "I rely famous clan, perish Qin must.\"",
  "s0057": "Thereupon crowd followed his words, with troops belonged Xiang Liang.",
  "s0058": "Xiang Liang crossed Huai, Qing Bu, Pu general also with troops belonged.",
  "s0059": "Altogether sixty seventy thousand people, army Xiapi.",
  "s0060": "At this time, Qin Jia already established Jing Ju as Chu Wang, army Pengcheng east, wished resist Xiang Liang.",
  "s0061": "Xiang Liang told army officials said: \"Chen Wang first began affair, battle unfavorable, not heard location.",
  "s0062": "Now Qin Jia betrayed Chen Wang established Jing Ju, rebellious without way.\"",
  "s0063": "Then advanced troops attacked Qin Jia.",
  "s0064": "Qin Jia army defeated fled, pursued to Hu Ling.",
  "s0065": "Jia returned battle one day, Jia died, army surrendered.",
  "s0066": "Jing Ju fled died Liang land.",
  "s0067": "Xiang Liang already united Qin Jia army, army Hu Ling, would lead army west.",
  "s0068": "Zhang An army arrived Li, Xiang Liang made separate general Zhu Ji Shi, Yu Fan Jun with battle.",
  "s0069": "Yu Fan Jun died.",
  "s0070": "Zhu Ji Shi army defeated, fled Hu Ling.",
  "s0071": "Xiang Liang then led troops entered Xue, executed Ji Shi.",
  "s0072": "Xiang Liang previously made Xiang Yu separate attack Xiangcheng, Xiangcheng firmly defended not fell.",
  "s0073": "Already took, all pitted them.",
  "s0074": "Returned reported Xiang Liang.",
  "s0075": "Xiang Liang heard Chen Wang definitely died, summoned various separate generals assembled Xue planned affairs.",
  "s0076": "At this time Pei Gong also rose Pei, went there.",
  "s0077": "Ju person Fan Zeng, aged seventy, always resided home, fond of wondrous plans, went persuaded Xiang Liang said: \"Chen Sheng failed should.",
  "s0078": "Qin extinguished six states, Chu most without crime.",
  "s0079": "From Huai Wang entered Qin not returned, Chu people pity him until now, therefore Chu south public said 'Chu though three households, perish Qin must Chu'.",
  "s0080": "Now Chen Sheng first began, not establish Chu successor but self-established, his momentum not long.",
  "s0081": "Now jun rise Jiangdong, Chu hornet noon generals all contend attach jun, because jun generation generation Chu general, able to again establish Chu successor.\"",
  "s0082": "Thereupon Xiang Liang approved his words, sought Chu Huai Wang grandson Xin among people, was shepherding sheep, established as Chu Huai Wang, from people desired.",
  "s0083": "Chen Ying as Chu upper pillar state, enfeoffed five counties, with Huai Wang capital Xu Tai.",
  "s0084": "Xiang Liang self-styled as Wu Xin Jun.",
  "s0085": "Resided several months, led troops attacked Kang Fu, with Qi Tian Rong, Si Ma Long Ju army saved Dong E, greatly defeated Qin army at Dong E.",
  "s0086": "Tian Rong then led troops returned, drove his wang Jia.",
  "s0087": "Jia fled Chu.",
  "s0088": "Jia chancellor Tian Jiao fled Zhao.",
  "s0089": "Jiao younger brother Tian Jian former Qi general, resided Zhao dared not return.",
  "s0090": "Tian Rong established Tian Dan son Shi as Qi Wang.",
  "s0091": "Xiang Liang already defeated Dong E lowered army, then pursued Qin army.",
  "s0092": "Several sent messengers urged Qi troops, wished with together west.",
  "s0093": "Tian Rong said: \"Chu kill Tian Jia, Zhao kill Tian Jiao, Tian Jian, then send troops.\"",
  "s0094": "Xiang Liang said: \"Tian Jia was allied state wang, poor came follow me, not bear kill him.\"",
  "s0095": "Zhao also not kill Tian Jiao, Tian Jian to trade with Qi.",
  "s0096": "Qi then unwilling send troops help Chu.",
  "s0097": "Xiang Liang made Pei Gong and Xiang Yu separate attack Chengyang, slaughtered it.",
  "s0098": "West defeated Qin army Puyang east, Qin troops withdrew into Puyang.",
  "s0099": "Pei Gong, Xiang Yu then attacked Dingtao.",
  "s0100": "Dingtao not fallen, departed, west plundered land to Chongqiu, greatly defeated Qin army, beheaded Li You.",
  "s0101": "Returned attacked Waihuang, Waihuang not fallen.",
  "s0102": "Xiang Liang rose Dong E, west, arrived Dingtao, again defeated Qin army, Xiang Yu and others moreover beheaded Li You, increasingly despised Qin, had arrogant appearance.",
  "s0103": "Song Yi then admonished Xiang Liang said: \"Battle victorious and general arrogant troops lazy then defeated.",
  "s0104": "Now troops somewhat lazy, Qin troops daily increasing, subject for jun fear it.\"",
  "s0105": "Xiang Liang not listen.",
  "s0106": "Then made Song Yi envoy to Qi.",
  "s0107": "En route met Qi envoy Gao Ling Jun Xian, said: \"Gong will see Wu Xin Jun?\"",
  "s0108": "Said: \"Yes.\"",
  "s0109": "Said: \"Subject discuss Wu Xin Jun army must defeated.",
  "s0110": "Gong slow go then avoid death, fast go then meet calamity.\"",
  "s0111": "Qin indeed all raised troops increased Zhang An, attacked Chu army, greatly defeated at Dingtao, Xiang Liang died.",
  "s0112": "Pei Gong, Xiang Yu departed Waihuang attacked Chenliu, Chenliu firmly defended could not take.",
  "s0113": "Pei Gong, Xiang Yu mutually planned said: \"Now Xiang Liang army broken, soldiers fearful.\"",
  "s0114": "Then with Lu Chen army together led troops east.",
  "s0115": "Lu Chen army Pengcheng east, Xiang Yu army Pengcheng west, Pei Gong army Dang.",
  "s0116": "Zhang An already broken Xiang Liang army, then considered Chu land troops not worth worry, then crossed river attacked Zhao, greatly defeated it.",
  "s0117": "At this time, Zhao Xie as wang, Chen Yu as general, Zhang Er as chancellor, all fled entered Julu city.",
  "s0118": "Zhang An commanded Wang Li, She Jian surround Julu, Zhang An army its south, built passageway transported grain to them.",
  "s0119": "Chen Yu as general, led troops several ten thousand people army Julu north, this called Hebei army.",
  "s0120": "Chu troops already defeated at Dingtao, Huai Wang fearful, from Xu Tai to Pengcheng, united Xiang Yu, Lu Chen army self-led.",
  "s0121": "Made Lu Chen as Si Tu, his father Lu Qing as Ling Yin.",
  "s0122": "Made Pei Gong as Dang jun chang, enfeoffed as Wu An Hou, led Dang jun troops.",
  "s0123": "Initially, Song Yi encountered Qi envoy Gao Ling Jun Xian in Chu army, saw Chu wang said: \"Song Yi discussed Wu Xin Jun army must defeated, resided several days, army indeed defeated.",
  "s0124": "Troops not battled but first saw defeat signs, this can be called knowing troops.\"",
  "s0125": "Wang summoned Song Yi planned affairs greatly pleased him, because placed as upper general, Xiang Yu as Lu Gong, as secondary general, Fan Zeng as final general, save Zhao.",
  "s0126": "Various separate generals all belonged Song Yi, titled Qing Zi Guan Jun.",
  "s0127": "Marched to Anyang, stayed forty-six days not advanced.",
  "s0128": "Xiang Yu said: \"I heard Qin army surround Zhao wang Julu, quickly lead troops cross river, Chu attack its outside, Zhao respond its inside, break Qin army must.\"",
  "s0129": "Song Yi said: \"Not so.",
  "s0130": "Fight ox horsefly cannot break lice ticks.",
  "s0131": "Now Qin attack Zhao, battle victorious then troops tired, I receive their fatigue;",
  "s0132": "Not victorious, then I lead troops drum march west, must take Qin.",
  "s0133": "Therefore not as first let Qin Zhao fight.",
  "s0134": "Wear armor grasp sharp weapons, righteousness not as gong;",
  "s0135": "Sit plan strategies, gong not as Yi.\"",
  "s0136": "Because issued order army said: \"Fierce as tiger, stubborn as sheep, greedy as wolf, strong not usable, all behead.\"",
  "s0137": "Then sent his son Song Xiang assist Qi, personally sent to Wu Yan, drank wine grand assembly.",
  "s0138": "Weather cold heavy rain, soldiers froze hungry.",
  "s0139": "Xiang Yu said: \"Will united strength attack Qin, long stay not go.",
  "s0140": "Now year famine people poor, soldiers eat taro beans, army no visible grain, moreover drink wine grand assembly, not lead troops cross river rely on Zhao food, with Zhao unite strength attack Qin, moreover say 'receive their fatigue'.",
  "s0141": "With Qin strong, attack newly made Zhao, momentum must take Zhao.",
  "s0142": "Zhao taken and Qin strong, what fatigue receive!",
  "s0143": "Moreover state troops newly broken, wang sits not peaceful seat, sweeps within to specially belong general, state safety danger, in this one action.",
  "s0144": "Now not pity soldiers but follow his private, not she ji minister.\"",
  "s0145": "Xiang Yu morning court upper general Song Yi, in his tent beheaded Song Yi head, issued order army said: \"Song Yi with Qi plotted rebel Chu, Chu wang secretly commanded Yu execute him.\"",
  "s0146": "At this time, various generals all terrified submitted, none dared dispute.",
  "s0147": "All said: \"First established Chu, general family.",
  "s0148": "Now general executed chaos.\"",
  "s0149": "Then mutually together established Yu as false upper general.",
  "s0150": "Made person pursue Song Yi son, reached Qi, killed him.",
  "s0151": "Made Huan Chu report command to Huai Wang.",
  "s0152": "Huai Wang because made Xiang Yu as upper general, Dang Yang Jun, Pu general all belonged Xiang Yu.",
  "s0153": "Xiang Yu already killed Qing Zi Guan Jun, awe shook Chu state, name heard feudal lords.",
  "s0154": "Then sent Dang Yang Jun, Pu general led troops twenty thousand cross river, save Julu.",
  "s0155": "Battle little advantage, Chen Yu again requested troops.",
  "s0156": "Xiang Yu then all led troops cross river, all sank ships, broke cooking pots, burned houses, held three days rations, to show soldiers must die, no one return heart.",
  "s0157": "Thereupon arrived then surrounded Wang Li, with Qin army met, nine battles, cut their passageway, greatly defeated them, killed Su Jiao, captured Wang Li.",
  "s0158": "She Jian not surrender Chu, self-burned killed.",
  "s0159": "At this time, Chu troops crowned feudal lords.",
  "s0160": "Feudal lords armies saving Julu below ten plus walls, none dared release troops.",
  "s0161": "When Chu attacked Qin, various generals all from walls watched.",
  "s0162": "Chu warriors none not one against ten, Chu troops call sound shook heaven, feudal lords armies none not person person fearful.",
  "s0163": "Thereupon already broken Qin army, Xiang Yu summoned saw feudal lords generals, entered camp gate, none not knee-walked forward, none dared look up.",
  "s0164": "Xiang Yu by this began as feudal lords upper general, feudal lords all belonged him.",
  "s0165": "Zhang An army Ji Yuan, Xiang Yu army Zhang south, mutually held not battled.",
  "s0166": "Qin army several retreated, Er Shi made person blame Zhang An.",
  "s0167": "Zhang An feared, made chief clerk Xin request affairs.",
  "s0168": "Arrived Xianyang, stayed Si Ma gate three days, Zhao Gao not saw, had distrust heart.",
  "s0169": "Chief clerk Xin feared, returned fled his army, dared not leave old road, Zhao Gao indeed made person pursue, not reached.",
  "s0170": "Xin arrived army, reported said: \"Zhao Gao uses affairs in center, below none can do.",
  "s0171": "Now battle can victory, Gao must quickly jealous my merit;",
  "s0172": "Battle cannot victory, not avoid death.",
  "s0173": "Wish general deliberate.\"",
  "s0174": "Chen Yu also sent Zhang An letter said: \"Bai Qi as Qin general, south conquered Yan Ying, north pitted Ma Fu, attacked cities seized land, cannot count, but finally granted death.",
  "s0175": "Meng Tian as Qin general, north drove Rong people, opened Yu Zhong land several thousand li, finally beheaded Yang Zhou.",
  "s0176": "Why?",
  "s0177": "Merit many, Qin cannot all enfeoff, because used law executed them.",
  "s0178": "Now general as Qin general three years, what lost lost to ten thousand count, and feudal lords together rose increasingly many.",
  "s0179": "That Zhao Gao always flattered long time, now affairs urgent, also fears Er Shi execute him, therefore wishes use law execute general to block responsibility, make person change general to escape his calamity.",
  "s0180": "General resides outside long, many inner retreats, have merit also executed, no merit also executed.",
  "s0181": "Moreover heaven perishes Qin, no foolish wise all know.",
  "s0182": "Now general inside cannot straight admonish, outside for perished state general, isolated alone wishes often preserve, how not sorrow!",
  "s0183": "General why not return troops with feudal lords as alliance, agree together attack Qin, divide wang its land, south face call solitary;",
  "s0184": "This which with body bend fu axe, wife children become slave?\"",
  "s0185": "Zhang An hesitant, secretly made scout Shi Cheng envoy Xiang Yu, wished agree.",
  "s0186": "Agree not completed, Xiang Yu made Pu general day night led troops cross San Hu, army Zhang south, with Qin battled, again defeated them.",
  "s0187": "Xiang Yu all led troops attacked Qin army Wu Shui above, greatly defeated them.",
  "s0188": "Zhang An made person see Xiang Yu, wished agree.",
  "s0189": "Xiang Yu summoned army officials planned said: \"Grain few, wish listen their agree.\"",
  "s0190": "Army officials all said: \"Good.\"",
  "s0191": "Xiang Yu then with period Hun Shui south Yin Xu above.",
  "s0192": "Already allied, Zhang An saw Xiang Yu flowed tears, for spoke Zhao Gao.",
  "s0193": "Xiang Yu then established Zhang An as Yong Wang, placed Chu army midst.",
  "s0194": "Made chief clerk Xin as upper general, led Qin army as advance.",
  "s0195": "Arrived Xin An.",
  "s0196": "Feudal lords officials soldiers different times former labor sent garrison passed Qin midst, Qin midst officials soldiers met them many no manner, when Qin army surrendered feudal lords, feudal lords officials soldiers riding victory many enslaved used them, lightly broke insulted Qin officials soldiers.",
  "s0197": "Qin officials soldiers many secretly said: \"Zhang general and others deceived our kind surrender feudal lords, now can enter pass break Qin, very good;",
  "s0198": "If cannot, feudal lords capture our kind east, Qin must completely execute our parents wives children.\"",
  "s0199": "Feudal lords slightly heard their plan, with told Xiang Yu.",
  "s0200": "Xiang Yu then summoned Qing Bu, Pu general planned said: \"Qin officials soldiers still many, their hearts not submit, arrive Guan Zhong not listen, affair must danger, not as attack kill them, and alone with Zhang An, chief clerk Xin, colonel Yi enter Qin.\"",
  "s0201": "Thereupon Chu army night attacked pitted Qin troops twenty plus ten thousand people Xin An city south.",
  "s0202": "Marched plundered settled Qin land.",
  "s0203": "Hang Valley Pass had troops guarding pass, could not enter.",
  "s0204": "Again heard Pei Gong already broken Xianyang, Xiang Yu greatly angered, made Dang Yang Jun and others attack pass.",
  "s0205": "Xiang Yu then entered, arrived Xi west.",
  "s0206": "Pei Gong army Ba Shang, not able with Xiang Yu meet.",
  "s0207": "Pei Gong left marshal Cao Wu Shang made person speak to Xiang Yu said: \"Pei Gong wishes wang Guan Zhong, make Zi Ying as chancellor, precious treasures all have them.\"",
  "s0208": "Xiang Yu greatly angered, said: \"Dawn day feast soldiers, for attack break Pei Gong army!\"",
  "s0209": "At this time, Xiang Yu troops forty thousand, at Xin Feng Hong Men, Pei Gong troops ten thousand, at Ba Shang.",
  "s0210": "Fan Zeng persuaded Xiang Yu said: \"Pei Gong resided Shan Dong time, greedy for wealth goods, fond beautiful women.",
  "s0211": "Now entered pass, wealth things nothing took, women nothing favored, this his ambition not in small.",
  "s0212": "I made person observe his qi, all become dragon tiger, complete five colors, this Son of Heaven qi.",
  "s0213": "Urgently attack not lose.\"",
  "s0215": "Chu left Yin Xiang Bo, Xiang Yu younger uncle, always good Liu Hou Zhang Liang.",
  "s0216": "Zhang Liang at this time followed Pei Gong, Xiang Bo then night galloped Pei Gong army, privately saw Zhang Liang, fully told affairs, wished call Zhang Liang with go.",
  "s0217": "Said: \"Not follow together die.\"",
  "s0218": "Zhang Liang said: \"Subject for Han wang sent Pei Gong, Pei Gong now affairs have urgent, flee not righteousness, cannot not tell.\"",
  "s0219": "Liang then entered, fully told Pei Gong.",
  "s0220": "Pei Gong greatly shocked, said: \"Do it what?\"",
  "s0221": "Zhang Liang said: \"Who for da wang made this plan?\"",
  "s0222": "Said: \"Fish eye born persuaded me said 'resist pass, not enter feudal lords, Qin land can all wang'.",
  "s0223": "Therefore listened.\"",
  "s0224": "Liang said: \"Calculate da wang soldiers sufficient match Xiang Wang?\"",
  "s0225": "Pei Gong silent, said: \"Certainly not as, moreover do it what?\"",
  "s0226": "Zhang Liang said: \"Please go tell Xiang Bo, speak Pei Gong dares not betray Xiang Wang.\"",
  "s0227": "Pei Gong said: \"Jun how with Xiang Bo have old?\"",
  "s0228": "Zhang Liang said: \"Qin time with subject toured, Xiang Bo killed person, subject saved him.",
  "s0229": "Now affairs have urgent, therefore luckily came tell Liang.\"",
  "s0230": "Pei Gong said \"Who with jun young old?\"",
  "s0231": "Liang said: \"Old to subject.\"",
  "s0232": "Pei Gong said \"Jun for me call enter, I get brother serve him.\"",
  "s0233": "Zhang Liang left, intercepted Xiang Bo.",
  "s0234": "Xiang Bo then entered saw Pei Gong.",
  "s0235": "Pei Gong offered wine cup for longevity, agreed marriage, said: \"I entered pass, autumn hair not dared near anything, registered officials people, sealed treasuries, awaited general.",
  "s0236": "What sent generals guard pass, prepare other robbers enter exit and not normal.",
  "s0237": "Day night hoped general arrived, how dare rebel!",
  "s0238": "Wish Bo fully speak subject dares not double virtue.\"",
  "s0239": "Xiang Bo permitted.",
  "s0240": "Told Pei Gong said: \"Dawn day cannot not early self come thank Xiang Wang.\"",
  "s0241": "Pei Gong said: \"Yes.\"",
  "s0242": "Thereupon Xiang Bo again night departed, arrived army midst, fully with Pei Gong words reported Xiang Wang.",
  "s0243": "Because said: \"Pei Gong not first break Guan Zhong, gong how dare enter?",
  "s0244": "Now person has great merit and attack him, not righteous, not as because good treat him.\"",
  "s0245": "Xiang Wang permitted.",
  "s0246": "Pei Gong dawn day from hundred plus riders came see Xiang Wang, arrived Hong Men, thanked said: \"Subject with general united strength attacked Qin, general battled Hebei, subject battled Henan, however not self expected could first enter pass break Qin, got again see general here.",
  "s0247": "Now have small person words, made general with subject have gap.\"",
  "s0248": "Xiang Wang said: \"This Pei Gong left marshal Cao Wu Shang spoke;",
  "s0249": "Not so, Yu how to here.\"",
  "s0250": "Xiang Wang that day because detained Pei Gong with drink.",
  "s0251": "Xiang Wang, Xiang Bo east facing sat.",
  "s0252": "Ya Fu south facing sat.",
  "s0253": "Ya Fu was Fan Zeng.",
  "s0254": "Pei Gong north facing sat, Zhang Liang west facing served.",
  "s0255": "Fan Zeng several glared Xiang Wang, raised what wore jade gui to show him three, Xiang Wang silent not respond.",
  "s0256": "Fan Zeng rose, left summoned Xiang Zhuang, told said: \"Jun wang person not cruel, if enter forward for longevity, longevity finished, please with sword dance, because strike Pei Gong at seat, kill him.",
  "s0257": "Not so, if kind all will be captured by him.\"",
  "s0258": "Zhuang then entered for longevity, longevity finished, said: \"Jun wang with Pei Gong drink, army no to make music, please with sword dance.\"",
  "s0259": "Xiang Wang said: \"Yes.\"",
  "s0260": "Xiang Zhuang drew sword rose dance, Xiang Bo also drew sword rose dance, often with body wing shielded Pei Gong, Zhuang could not strike.",
  "s0261": "Thereupon Zhang Liang to army gate, saw Fan Kuai.",
  "s0262": "Fan Kuai said: \"Today affair what like?\"",
  "s0263": "Liang said: \"Very urgent.",
  "s0264": "Now Xiang Zhuang drew sword dance, his intention often at Pei Gong.\"",
  "s0265": "Kuai said: \"This pressed, subject please enter, with him same life.\"",
  "s0266": "Kuai then belted sword embraced shield entered army gate.",
  "s0267": "Crossed halberds guard soldiers wished stop not enter, Fan Kuai slanted his shield to collide, guard soldiers fell ground, Kuai then entered, parted curtain west facing stood, glared eyes viewed Xiang Wang, hair up pointed, eye corners all split.",
  "s0268": "Xiang Wang pressed sword knelt said: \"Guest what do?\"",
  "s0269": "Zhang Liang said: \"Pei Gong chariot rider Fan Kuai.\"",
  "s0270": "Xiang Wang said: \"Strong man, grant him wine cup.\"",
  "s0271": "Then gave one dou wine cup.",
  "s0272": "Kuai bowed thanked, rose, stood drank it.",
  "s0273": "Xiang Wang said: \"Grant him pig shoulder.\"",
  "s0274": "Then gave one pig shoulder.",
  "s0275": "Fan Kuai overturned his shield on ground, added pig shoulder above, drew sword cut ate it.",
  "s0276": "Xiang Wang said: \"Strong man, can again drink?\"",
  "s0277": "Fan Kuai said: \"Subject die moreover not avoid, wine cup how sufficient decline!",
  "s0278": "Qin wang has tiger wolf heart, kill people like cannot lift, punish people like fear not win, world all rebel him.",
  "s0279": "Huai Wang with various generals agreed said 'first break Qin enter Xianyang wang it'.",
  "s0280": "Now Pei Gong first broke Qin entered Xianyang, down to hair not dared near anything, registered officials people, sealed treasuries, returned army Ba Shang, awaited da wang come.",
  "s0281": "What sent generals guard pass, prepared other robbers enter exit and not normal.",
  "s0282": "Labor bitter and merit high like this, not have enfeoff marquis reward, but listen fine talk, wish execute have merit person.",
  "s0283": "This perished Qin continuation, secretly for da wang not take.\"",
  "s0284": "Xiang Wang not had to respond, said: \"Sit.\"",
  "s0285": "Fan Kuai followed Liang sat.",
  "s0286": "Sat moment, Pei Gong rose like toilet, because summoned Fan Kuai out.",
  "s0287": "Pei Gong already left, Xiang Wang made colonel Chen Ping summon Pei Gong.",
  "s0288": "Pei Gong said: \"Now leave, not apologized, do it what?\"",
  "s0289": "Fan Kuai said: \"Great action not care fine careful, great ritual not decline small yield.",
  "s0290": "Like now person just for knife chopping block, I for fish meat, what decline.\"",
  "s0291": "Thereupon departed.",
  "s0292": "Then ordered Zhang Liang stay thank.",
  "s0293": "Liang asked said: \"Da wang come what hold?\"",
  "s0294": "Said: \"I hold white jade one pair, wished offer Xiang Wang, jade dou one pair, wished give Ya Fu, met his anger, dared not offer.",
  "s0295": "Gong for me offer them.\" Zhang Liang said: \"Careful yes.\"",
  "s0296": "At this time, Xiang Wang army at Hong Men below, Pei Gong army at Ba Shang, mutually separated forty li.",
  "s0297": "Pei Gong then abandoned chariots riders, escaped body alone rode, with Fan Kuai, Xia Hou Ying, Jin Qiang, Ji Xin and others four people held swords shields foot walked, from Li Shan below, road Zhi Yang between walked.",
  "s0298": "Pei Gong told Zhang Liang said: \"From this road to my army, not over twenty li.",
  "s0299": "Measure I arrive army midst, gong then enter.\"",
  "s0300": "Pei Gong already departed, between arrived army midst, Zhang Liang entered thanked, said: \"Pei Gong not win cup ladle, cannot apologize.",
  "s0401": "Han Wang en route met obtained Xiao Hui, Lu Yuan, then loaded went.",
  "s0402": "Chu riders pursued Han Wang, Han Wang urgent, pushed fell Xiao Hui, Lu Yuan carriage below, Teng Gong often descended collected loaded them.",
  "s0403": "Like this three.",
  "s0404": "Said: \"Though urgent cannot drive, how abandon them?\"",
  "s0405": "Thereupon then obtained escaped.",
  "s0406": "Sought Tai Gong, Lu Hou not met.",
  "s0407": "Shen Shi Qi followed Tai Gong, Lu Hou between walked, sought Han Wang, instead met Chu army.",
  "s0408": "Chu army then with returned, reported Xiang Wang, Xiang Wang often placed army midst.",
  "s0409": "At this time Lu Hou elder brother Zhou Lu Hou as Han led troops resided Xia Yi, Han Wang between went followed him, gradually collected his soldiers.",
  "s0410": "Arrived Xing Yang, various defeated armies all assembled, Xiao He moreover sent Guan Zhong old weak not conscripted all went Xing Yang, again greatly flourished.",
  "s0411": "Chu rose Peng Cheng, often rode victory pursued north, with Han battled Xing Yang Nanjing, Su between, Han defeated Chu, Chu because this could not pass Xing Yang west.",
  "s0412": "Xiang Wang saved Peng Cheng, pursued Han Wang to Xing Yang, Tian Heng moreover obtained collected Qi, established Tian Rong son Guang as Qi Wang.",
  "s0413": "Han Wang defeated Peng Cheng, feudal lords all again with Chu betrayed Han.",
  "s0414": "Han army Xing Yang, built passageway belonged river, to take Ao Cang grain.",
  "s0415": "Han third year, Xiang Wang several invaded seized Han passageway, Han Wang food lacked, feared, requested peace, divided Xing Yang west as Han.",
  "s0416": "Xiang Wang wished listen it.",
  "s0417": "Li Yang Hou Fan Zeng said: \"Han easy with, now release not take, afterward must regret.\"",
  "s0418": "Xiang Wang then with Fan Zeng urgently surrounded Xing Yang.",
  "s0419": "Han Wang troubled it, then used Chen Ping plan separated Xiang Wang.",
  "s0420": "Xiang Wang envoy came, made great sacrificial animal prepared, wished advanced it.",
  "s0421": "Saw envoy, detailed shocked said: \"I considered Ya Fu envoy, instead Xiang Wang envoy.\"",
  "s0422": "Moreover held departed, with bad food fed Xiang Wang envoy.",
  "s0423": "Envoy returned reported Xiang Wang, Xiang Wang then doubted Fan Zeng with Han had private, gradually seized his authority.",
  "s0424": "Fan Zeng greatly angered, said: \"World affair greatly settled, jun wang self do it.",
  "s0425": "Wish grant remains bones return common soldiers.\"",
  "s0426": "Xiang Wang permitted it.",
  "s0427": "Went not arrived Peng Cheng, ulcer issued back died.",
  "s0428": "Han general Ji Xin persuaded Han Wang said: \"Affair already urgent, please for wang deceive Chu as wang, wang can between leave.\"",
  "s0429": "Thereupon Han Wang night left women Xing Yang east gate wore armor two thousand people, Chu troops four sides attacked them.",
  "s0430": "Ji Xin rode yellow top carriage, attached left banner, said: \"City midst food exhausted, Han Wang surrender.\"",
  "s0431": "Chu troops all called ten thousand years.",
  "s0432": "Han Wang moreover with several ten riders from city west gate left, fled Cheng Gao.",
  "s0433": "Xiang Wang saw Ji Xin, asked: \"Han Wang where?\"",
  "s0434": "Said: \"Han Wang already left.\"",
  "s0435": "Xiang Wang burned killed Ji Xin.",
  "s0436": "Han Wang made Yu Shi Da Fu Zhou Ke, Cong Gong, Wei Bao guarded Xing Yang.",
  "s0437": "Zhou Ke, Cong Gong planned said: \"Rebel state wang, difficult with guard city.\"",
  "s0438": "Then together killed Wei Bao.",
  "s0439": "Chu took Xing Yang city, alive obtained Zhou Ke.",
  "s0440": "Xiang Wang told Zhou Ke said: \"For me general, I with gong as upper general, enfeoff three ten thousand households.\"",
  "s0441": "Zhou Ke cursed said: \"You not quick surrender Han, Han now capture you, you not Han match.\"",
  "s0442": "Xiang Wang angered, boiled Zhou Ke, and killed Cong Gong.",
  "s0443": "Han Wang left Xing Yang, south fled Wan, Ye, obtained Jiu Jiang Wang Bu, marched collected troops, again entered defended Cheng Gao.",
  "s0444": "Han fourth year, Xiang Wang advanced troops surrounded Cheng Gao.",
  "s0445": "Han Wang escaped, alone with Teng Gong left Cheng Gao north gate, crossed river fled Xiu Wu, followed Zhang Er, Han Xin army.",
  "s0446": "Various generals gradually gradually left Cheng Gao, followed Han Wang.",
  "s0447": "Chu then took Cheng Gao, wished west.",
  "s0448": "Han made troops resisted at Gong, made him could not west.",
  "s0449": "At this time, Peng Yue crossed river attacked Chu Dong E, killed Chu general Xue Gong.",
  "s0450": "Xiang Wang then self east attacked Peng Yue.",
  "s0451": "Han Wang obtained Huai Yin Hou troops, wished cross He Nan.",
  "s0452": "Zheng Zhong persuaded Han Wang, then stopped walled He Nei.",
  "s0453": "Made Liu Jia led troops assisted Peng Yue, burned Chu accumulations.",
  "s0454": "Xiang Wang east attacked defeated them, fled Peng Yue.",
  "s0455": "Han Wang then led troops crossed river, again took Cheng Gao, army Guang Wu, relied Ao Cang ate.",
  "s0456": "Xiang Wang already settled Dong Hai came west, with Han together faced Guang Wu army, mutually guarded several months.",
  "s0457": "At this time, Peng Yue several rebelled Liang land, cut Chu grain, Xiang Wang troubled it.",
  "s0458": "Made high table, placed Tai Gong above it, told Han Wang said: \"Now not urgent down, I boil Tai Gong.\"",
  "s0459": "Han Wang said: \"I with Xiang Yu together north faced received command Huai Wang, said 'agreed as brothers', my father then your father, must wish boil your father, then fortunate divide me one cup soup.\"",
  "s0460": "Xiang Wang angered, wished kill him.",
  "s0461": "Xiang Bo said: \"World affair not can know, moreover for world not care family, though kill him no benefit, only increase calamity.\"",
  "s0462": "Xiang Wang followed it.",
  "s0463": "Chu Han long mutually held undecided, strong men bitter military service, old weak tired transported supplied.",
  "s0464": "Xiang Wang told Han Wang said: \"World turbulent several years, only because my two people, wish with Han Wang challenge decide male female, not make bitter world people fathers sons.\"",
  "s0465": "Han Wang smiled declined said: \"I rather fight wisdom, cannot fight force.\"",
  "s0466": "Xiang Wang ordered strong men leave challenge.",
  "s0467": "Han had good riding shooting Lou Fan, Chu challenged three meetings, Lou Fan then shot killed them.",
  "s0468": "Xiang Wang greatly angered, then self wore armor held halberd challenged.",
  "s0469": "Lou Fan wished shoot him, Xiang Wang glared eyes scolded him, Lou Fan eyes dared not view, hand dared not send, then fled returned entered wall, dared not again leave.",
  "s0470": "Han Wang made person between asked it, was Xiang Wang.",
  "s0471": "Han Wang greatly shocked.",
  "s0472": "Thereupon Xiang Wang then with Han Wang together faced Guang Wu between spoke.",
  "s0473": "Han Wang counted him, Xiang Wang angered, wished one battle.",
  "s0474": "Han Wang not listened, Xiang Wang hid crossbow shot hit Han Wang.",
  "s0475": "Han Wang injured, fled entered Cheng Gao.",
  "s0476": "Xiang Wang heard Huai Yin Hou already raised Hebei, broke Qi, Zhao, moreover wished attack Chu, then made Long Ju went attack him.",
  "s0477": "Huai Yin Hou with battled, riding general Guan Ying attacked it, greatly defeated Chu army, killed Long Ju.",
  "s0478": "Han Xin because self-established as Qi Wang.",
  "s0479": "Xiang Wang heard Long Ju army broken, then feared, made Xu Tai person Wu She went persuaded Huai Yin Hou.",
  "s0480": "Huai Yin Hou not listened.",
  "s0481": "At this time, Peng Yue again rebelled, took Liang land, cut Chu grain.",
  "s0482": "Xiang Wang then told Hai Chun Hou da si ma Cao Jiu and others said: \"Carefully guard Cheng Gao, then Han wishes challenge, careful not battle, not make obtain east only.",
  "s0483": "I fifteen days must execute Peng Yue, settle Liang land, again from general.\"",
  "s0484": "Then east, marched attacked Chen Liu, Wai Huang.",
  "s0485": "Wai Huang not fell.",
  "s0486": "Several days, already submitted, Xiang Wang angered, completely ordered men age fifteen already above went city east, wished pit them.",
  "s0487": "Wai Huang ling house child age thirteen, went persuaded Xiang Wang said: \"Peng Yue strong coerced Wai Huang, Wai Huang feared, therefore first submitted, awaited da wang.",
  "s0488": "Da wang arrived, moreover all pit them, hundred surnames how have return heart?",
  "s0489": "From this east, Liang land ten plus cities all feared, none willing submit.\"",
  "s0490": "Xiang Wang approved his words, then pardoned Wai Huang when pit ones.",
  "s0491": "East arrived Sui Yang, heard all contended submitted Xiang Wang.",
  "s0492": "Han indeed several provoked Chu army battle, Chu army not left.",
  "s0493": "Made person insulted them, five six days, da si ma angered, crossed troops Si Shui.",
  "s0494": "Soldiers half crossed, Han attacked them, greatly defeated Chu army, completely obtained Chu state goods bribes.",
  "s0495": "Da si ma Jiu, chief clerk Yi, Sai Wang Xin all self-beheaded Si Shui above.",
  "s0496": "Da si ma Jiu was, former Qi prison clerk, chief clerk Xin also former Que Yang prison official, two people once had virtue to Xiang Liang, therefore Xiang Wang trusted them.",
  "s0497": "At this time, Xiang Wang at Sui Yang, heard Hai Chun Hou army defeated, then led troops returned.",
  "s0498": "Han army just surrounded Zhong Li Mi at Xing Yang east, Xiang Wang arrived, Han army feared Chu, all fled dangerous places.",
  "s0499": "At this time, Han troops prosperous food many, Xiang Wang troops tired food exhausted.",
  "s0500": "Han sent Lu Jia persuaded Xiang Wang, requested Tai Gong, Xiang Wang not listened.",
  "s0501": "Han Wang moreover made Hou Gong went persuaded Xiang Wang, Xiang Wang then with Han agreed, middle divided world, divided Hong Gou west as Han, Hong Gou east as Chu.",
  "s0502": "Xiang Wang permitted it, then returned Han Wang parents wives children.",
  "s0503": "Army all called ten thousand years.",
  "s0504": "Han Wang then enfeoffed Hou Gong as Ping Guo Jun.",
  "s0505": "Hid not willing again saw.",
  "s0506": "Said: \"This world eloquent knight, where resided toppled state, therefore titled Ping Guo Jun.\"",
  "s0507": "Xiang Wang already agreed, then led troops solved west returned.",
  "s0508": "Han wished west return, Zhang Liang, Chen Ping persuaded said: \"Han has world too half, and feudal lords all attached it.",
  "s0509": "Chu troops tired food exhausted, this heaven perished Chu time, not as because its opportunity then took it.",
  "s0510": "Now release not attack, this called 'raise tiger self leave calamity'.\"",
  "s0511": "Han Wang listened it.",
  "s0512": "Han fifth year, Han Wang then pursued Xiang Wang to Yang Xia south, stopped army, with Huai Yin Hou Han Xin, Jian Cheng Hou Peng Yue period assembled attacked Chu army.",
  "s0513": "Arrived Gu Ling, and Xin, Yue troops not assembled.",
  "s0514": "Chu attacked Han army, greatly defeated it.",
  "s0515": "Han Wang again entered wall, deep moat self-guarded.",
  "s0516": "Told Zhang Zi Fang said: \"Feudal lords not follow agreement, do it what?\"",
  "s0517": "Replied said: \"Chu troops will defeated, Xin, Yue not have divide land, their not arrive solid suitable.",
  "s0518": "Jun wang able with divide world, now can immediately obtain.",
  "s0519": "If cannot, affair not can know.",
  "s0520": "Jun wang able self Chen east attached sea, completely with Han Xin;",
  "s0521": "Sui Yang north to Gu Cheng, with Peng Yue: make each self for battle, then Chu easy defeated.\"",
  "s0522": "Han Wang said: \"Good.\"",
  "s0523": "Thereupon then sent envoys told Han Xin, Peng Yue said: \"United strength attack Chu.",
  "s0524": "Chu broken, self Chen east attached sea with Qi Wang, Sui Yang north to Gu Cheng with Peng chancellor.\"",
  "s0525": "Envoys arrived, Han Xin, Peng Yue all reported said: \"Please now advance troops.\"",
  "s0526": "Han Xin then from Qi went, Liu Jia army from Shou Chun together marched, slaughtered Cheng Fu, arrived Gai Xia.",
  "s0527": "Da si ma Zhou Yin rebelled Chu, with Shu slaughtered Liu, raised Jiu Jiang troops, followed Liu Jia, Peng Yue all assembled Gai Xia, went Xiang Wang.",
  "s0528": "Xiang Wang army walled Gai Xia, troops few food exhausted, Han army and feudal lords troops surrounded several layers.",
  "s0529": "Night heard Han army four sides all Chu song, Xiang Wang then greatly shocked said: \"Han all already obtained Chu? Is what Chu people many!\"",
  "s0530": "Xiang Wang then night rose, drank account midst.",
  "s0531": "Had beauty named Yu, often favored followed;",
  "s0532": "fine horse named Zhui, often rode it.",
  "s0533": "Thereupon Xiang Wang then sorrow song sighed, self made poem said: \"Force pull mountain air cover world, time not advantage Zhui not depart.",
  "s0534": "Zhui not depart how, Yu Yu how!\"",
  "s0535": "Song several verses, beauty and it.",
  "s0536": "Xiang Wang wept several rows down, left right all wept, none could look up.",
  "s0537": "Thereupon Xiang Wang then mounted horse rode, commanded below strong men rode followed eight hundred plus people, straight night broke circle south left, galloped departed.",
  "s0538": "Dawn bright, Han army then aware it, ordered riding general Guan Ying with five thousand riders pursued him.",
  "s0539": "Xiang Wang crossed Huai, riders able belonged hundred plus people only.",
  "s0540": "Xiang Wang arrived Yin Ling, lost way, asked one field father, field father deceived said \"left\".",
  "s0541": "Left, then trapped great marsh midst.",
  "s0542": "With reason Han pursued reached him.",
  "s0543": "Xiang Wang then again led troops east, arrived Dong Cheng, then had twenty-eight riders.",
  "s0544": "Han riders pursued several thousand people.",
  "s0545": "Xiang Wang self measured could not escape.",
  "s0546": "Told his riders said: \"I raised troops until now eight years, body seventy plus battles, what met broke, what attacked submitted, never defeated north, then hegemon had world.",
  "s0547": "However now finally trapped here, this heaven perished me, not battle crime.",
  "s0548": "Today solid decide death, wish for various lords quick battle, must three victories, for various lords break circle, behead general, reap banners, make various lords know heaven perished me, not battle crime.\"",
  "s0549": "Then divided his riders as four teams, four directions.",
  "s0550": "Han army surrounded several layers.",
  "s0551": "Xiang Wang told his riders said: \"I for gong take that one general.\"",
  "s0552": "Commanded four sides riders galloped down, period Shan Dong for three places.",
  "s0553": "Thereupon Xiang Wang great called galloped down, Han army all scattered, then beheaded Han one general.",
  "s0554": "At this time, Chi Quan Hou as riding general, pursued Xiang Wang, Xiang Wang glared eyes scolded him, Chi Quan Hou person horse together shocked, avoided several li with his riders assembled for three places.",
  "s0555": "Han army not know Xiang Wang location, then divided army for three, again surrounded them.",
  "s0556": "Xiang Wang then galloped, again beheaded Han one du wei, killed several tens hundreds people, again gathered his riders, lost two riders only.",
  "s0557": "Then told his riders said: \"How?\"",
  "s0558": "Riders all submitted said: \"Like da wang words.\"",
  "s0561": "Thereupon Xiang Wang then wished east cross Wu Jiang.",
  "s0562": "Wu Jiang ting chang moored boat waited, told Xiang Wang said: \"Jiang Dong though small, place thousand li, multitudes several ten thousand people, also sufficient wang.",
  "s0563": "Wish da wang urgent cross.",
  "s0564": "Now only subject has boat, Han army arrived, no to cross.\"",
  "s0565": "Xiang Wang smiled said: \"Heaven perished me, I what cross!",
  "s0566": "Moreover Ji with Jiang Dong younger brothers eight thousand people crossed Jiang west, now no one return, if Jiang Dong fathers elder brothers pity wang me, I what face see them?",
  "s0567": "If they not speak, Ji alone not ashamed heart?\"",
  "s0568": "Then told ting chang said: \"I know gong elder.",
  "s0569": "I rode this horse five years, what met no enemy, once one day walked thousand li, not bear kill it, to grant gong.\"",
  "s0570": "Then ordered riders all descended horses foot walked, held short weapons close battled.",
  "s0571": "Alone Ji killed Han army several hundred people.",
  "s0572": "Xiang Wang body moreover suffered ten plus wounds.",
  "s0573": "Looked back saw Han riding si ma Lu Ma Tong, said: \"If not my old friend?\"",
  "s0574": "Ma Tong faced him, pointed Wang Yi said: \"This Xiang Wang.\"",
  "s0575": "Xiang Wang then said: \"I heard Han bought my head thousand gold, yi ten thousand households, I for you virtue.\"",
  "s0576": "Then self-beheaded died.",
  "s0577": "Wang Yi took his head, remaining riders mutually trampled contended Xiang Wang, mutually killed several ten people.",
  "s0578": "Most after, lang zhong riding Yang Xi, riding si ma Lu Ma Tong, lang zhong Lu Sheng, Yang Wu each obtained one body.",
  "s0579": "Five people together verified his body, all was.",
  "s0580": "Therefore divided his land for five: enfeoffed Lu Ma Tong as Zhong Shui Hou, enfeoffed Wang Yi as Du Yan Hou, enfeoffed Yang Xi as Chi Quan Hou, enfeoffed Yang Wu as Wu Fang Hou, enfeoffed Lu Sheng as Nie Yang Hou.",
  "s0581": "Xiang Wang already died, Chu land all submitted Han, only Lu not fell.",
  "s0582": "Han then led world troops wished slaughter it, for its guarded ritual righteousness, for lord died section, then held Xiang Wang head viewed Lu, Lu fathers elder brothers then submitted.",
  "s0583": "Initially, Chu Huai Wang first enfeoffed Xiang Ji as Lu Gong, when died, Lu last submitted, therefore with Lu Gong ritual buried Xiang Wang Gu Cheng.",
  "s0584": "Han Wang for sent mourning, wept departed.",
  "s0585": "Various Xiang clan branch relatives, Han Wang all not executed.",
  "s0586": "Then enfeoffed Xiang Bo as She Yang Hou.",
  "s0587": "Tao Hou, Ping Gao Hou, Xuan Wu Hou all Xiang clan, granted surname Liu.",
  "s0588": "Grand Historian says: I heard Zhou Sheng said \"Shun eyes covered heavy pupil son\", moreover heard Xiang Yu also heavy pupil son.",
  "s0589": "Yu how his descendants?",
  "s0590": "What rise violent!",
  "s0591": "Qin lost its governance, Chen She first difficult, powerful men hornet rose, together contended, cannot count.",
  "s0592": "However Yu not had inch, rode holding rose Long Yuan midst, three years, then led five feudal lords extinguished Qin, split world, and enfeoffed wang hou, governance by Yu out, titled \"hegemon wang\", position though not ended, near ancient since never had.",
  "s0593": "When Yu betrayed pass thought Chu, banished Yi Di self-established, resented wang hou rebelled self, difficult.",
  "s0594": "Self boasted merit, exerted his private wisdom not followed ancient, called hegemon wang industry, wished with force attack managed world, five years finally perished his state, body died Dong Cheng, still not aware enlightened not self-blamed, erred.",
  "s0595": "Then cited \"heaven perished me, not used troops crime\", how not absurd!"
}