{
  "s0001": "Marquis of Rang Wei Ran was Qin Zhao Wang mother Xuan Empress Dowager younger brother.",
  "s0002": "His ancestors Chu people, surname Mi clan.",
  "s0003": "Qin Wu Wang died, no sons, established his younger brother as Zhao Wang.",
  "s0004": "Zhao Wang mother formerly titled Mi Eight Sons, to Zhao Wang established, Mi Eight Sons titled Xuan Empress Dowager.",
  "s0005": "Xuan Empress Dowager not Wu Wang mother.",
  "s0006": "Wu Wang mother titled Hui Wen Empress, before Wu Wang died.",
  "s0007": "Xuan Empress Dowager two younger brothers: different father elder brother called Marquis of Rang, surname Wei clan, named Ran;",
  "s0008": "same father younger brother called Mi Rong, as Hua Yang Jun.",
  "s0009": "Zhao Wang same mother younger brother called Gao Ling Jun, Jing Yang Jun.",
  "s0010": "Wei Ran most worthy, from Hui Wang, Wu Wang time held office handled affairs.",
  "s0011": "Wu Wang died, various younger brothers contended establish, only Wei Ran exerted strength able establish Zhao Wang.",
  "s0012": "Zhao Wang established, made Ran general, guarded Xian Yang.",
  "s0013": "Executed Ji Jun rebellion, expelled Wu Wang Empress to Wei, Zhao Wang various brothers not good all extinguished, might shook Qin state.",
  "s0014": "Zhao Wang young, Xuan Empress Dowager personally governed, employed Wei Ran conduct politics.",
  "s0015": "Zhao Wang seven years, Shu Lizi died, made Jing Yang Jun hostage Qi.",
  "s0016": "Zhao man Lou Huan came chancellor Qin, Zhao disadvantage, made Qiu Ye Qin, requested make Wei Ran Qin chancellor.",
  "s0017": "Qiu Ye about go, his guest Song Gong told Ye: Qin not listen jun, Lou Huan certainly resent jun.",
  "s0018": "Jun not as tell Lou Huan: please for jun not hurry Qin.",
  "s0019": "Qin Wang see Zhao request chancellor Wei Ran not urgent, moreover not listen jun.",
  "s0020": "Jun speak affairs not complete, with virtue Lou Zi;",
  "s0021": "affairs complete, Wei Ran originally virtue jun.",
  "s0022": "Then Qiu Ye followed it.",
  "s0023": "Qin indeed dismissed Lou Huan Wei Ran chancellor Qin.",
  "s0024": "Wished execute Lu Li, Li fled Qi.",
  "s0025": "Zhao Wang fourteen years, Wei Ran recommended Bai Qi, made replace Xiang Shou general attack Han Wei, defeated Yi Guan, beheaded twenty four thousand, captured Wei general Gong Sun Xi.",
  "s0026": "Next year, again took Chu Wan, Ye.",
  "s0027": "Wei Ran claimed illness dismissed chancellor, made guest qing Shou Zhu chancellor.",
  "s0028": "Its next year, Zhu dismissed, again chancellor Ran, then enfeoffed Wei Ran Rang, moreover increased enfeoff Tao, titled Marquis of Rang.",
  "s0029": "Marquis of Rang enfeoffed four years, as Qin general attacked Wei.",
  "s0030": "Wei offered He Dong four hundred li.",
  "s0031": "Pulled Wei He Nei, took cities big small sixty more.",
  "s0032": "Zhao Wang nineteen years, Qin titled West Emperor, Qi titled East Emperor.",
  "s0033": "Month more, Lu Li came, Qi Qin each again returned Emperor as Wang.",
  "s0034": "Wei Ran again chancellor Qin, six years dismissed.",
  "s0035": "Dismissed two years, again chancellor Qin.",
  "s0036": "Four years, made Bai Qi pull Chu Ying, Qin established Nan Jun.",
  "s0037": "Then enfeoffed Bai Qi as Wu An Jun.",
  "s0038": "Bai Qi, Marquis of Rang recommended employed, mutually friendly.",
  "s0039": "Then Marquis of Rang wealth, wealth exceeded royal house.",
  "s0040": "Zhao Wang thirty two years, Marquis of Rang as chancellor, led troops attacked Wei, routed Mang Mao, entered Bei Zhai, then surrounded Da Liang.",
  "s0041": "Liang grand master Xu Jia advised Marquis of Rang: Subject heard Wei high officials tell Wei Wang: Formerly Liang Hui Wang attacked Zhao, battle won San Liang, pulled Han Dan;",
  "s0042": "Zhao clan not cede, Han Dan again returned.",
  "s0043": "Qi people attacked Wei, pulled Gu Guo, killed Zi Liang;",
  "s0044": "Wei people not cede, Gu Di again returned.",
  "s0045": "Wei Zhao reason state complete troops strong land not annexed feudal lords, because able endure hardship heavy cede land.",
  "s0046": "Song Zhong Shan several attacked cede land, state followed perished.",
  "s0047": "Subject think Wei Zhao can model, Song Zhong Shan can warn.",
  "s0048": "Qin, greedy violent state, without kin.",
  "s0049": "Silk eat Wei clan, moreover exhaust Jin state, battle win exposed sons, cede eight counties, land not finished enter, troops again emerged.",
  "s0050": "Qin what satiation have!",
  "s0051": "Now again routed Mang Mao, entered Bei Zhai, this not dare attack Liang, moreover coerce wang seek much cede land.",
  "s0052": "Wang certainly not listen.",
  "s0053": "Now wang back Chu Zhao discuss Qin, Chu Zhao angry depart wang, with wang contend serve Qin, Qin certainly accept.",
  "s0054": "Qin grasp Chu Zhao troops again attack Liang, then state seek not perish impossible obtain.",
  "s0055": "Wish wang certainly not discuss.",
  "s0056": "Wang if wish discuss, little cede have hostage;",
  "s0057": "not so, certainly see deceived.",
  "s0058": "This subject heard from Wei, wish jun with this consider affairs.",
  "s0059": "Zhou Book says only mandate not at constant, this speak good fortune cannot count.",
  "s0060": "Battle win exposed sons, cede eight counties, this not troops strength refined, moreover not plan skill, heaven good fortune many.",
  "s0061": "Now again routed Mang Mao, entered Bei Zhai, to attack Da Liang, this with heaven good fortune self constant.",
  "s0062": "Wise not so.",
  "s0063": "Subject heard Wei clan all its hundred counties excellent armor above garrison Da Liang, subject think not below thirty thousand.",
  "s0064": "With thirty thousand multitude guard Liang seven ren city, subject think Tang Wu revive, not easy attack.",
  "s0065": "Light back Chu Zhao troops, scale seven ren city, battle thirty thousand multitude, yet ambition certainly raise it, subject think from heaven earth begin divide to now, never had.",
  "s0066": "Attack not pull, Qin troops certainly tired, Tao city certainly perish, then previous merit certainly abandon.",
  "s0067": "Now Wei clan just doubt, can little cede collect.",
  "s0068": "Wish jun before Chu Zhao troops not arrive Liang, hasten with little cede collect Wei.",
  "s0069": "Wei just doubt can with little cede profit, certainly desire, then jun obtain desired.",
  "s0070": "Chu Zhao angry Wei before self, certainly contend serve Qin, from this scatter, jun after choose.",
  "s0071": "Moreover jun obtain land how must with troops!",
  "s0072": "Annex Jin state, Qin troops not attack, Wei certainly cede Jiang An Yi.",
  "s0073": "Again for Tao open two roads, almost exhaust former Song, Wei certainly cede Shan Fu.",
  "s0074": "Qin troops can complete, jun control it, what seek not obtain, what do not complete!",
  "s0075": "Wish jun carefully consider not do danger.",
  "s0076": "Marquis of Rang said: Good.",
  "s0077": "Then stopped Liang siege.",
  "s0078": "Next year, Wei betrayed Qin, with Qi form close alliance.",
  "s0079": "Qin made Marquis of Rang attack Wei, beheaded four thousand, routed Wei general Bao Yuan, obtained Wei three counties.",
  "s0080": "Marquis of Rang moreover increased enfeoff.",
  "s0081": "Next year, Marquis of Rang with Bai Qi guest qing Hu Yang again attacked Zhao Han Wei, broke Mang Mao Hua Yang below, beheaded ten thousand, took Wei Juan, Cai Yang, Chang She, Zhao Guan Jin.",
  "s0082": "Moreover with Zhao Guan Jin, increased Zhao with troops, attacked Qi.",
  "s0083": "Qi Xiang Wang feared, made Su Dai for Qi secretly send Marquis of Rang book: Subject heard come go speak: Qin will increase Zhao armor four thousand attack Qi, subject secretly certain tell my city wang: Qin Wang clear familiar plan, Marquis of Rang intelligent practiced affairs, certainly not increase Zhao armor four thousand attack Qi.",
  "s0084": "Why?",
  "s0085": "San Jin mutually with, Qin deep enmity.",
  "s0086": "Hundred mutually back, hundred mutually deceive, not for not faithful, not for without conduct.",
  "s0087": "Now break Qi fatten Zhao.",
  "s0088": "Zhao, Qin deep enmity, disadvantage Qin.",
  "s0089": "This one.",
  "s0090": "Qin plan, certainly say break Qi exhaust Jin Chu, then control Jin Chu victory.",
  "s0091": "Qi, tired state, with world attack Qi, like thousand jun crossbow decide burst carbuncle, certainly die, how exhaust Jin Chu?",
  "s0092": "This two.",
  "s0093": "Qin little send troops, then Jin Chu not trust;",
  "s0094": "many send troops, then Jin Chu controlled Qin.",
  "s0095": "Qi fear, not go Qin, certainly go Jin Chu.",
  "s0096": "This three.",
  "s0097": "Qin divide Qi feed Jin Chu, Jin Chu press with troops, Qin instead receive enemy.",
  "s0098": "This four.",
  "s0099": "Is Jin Chu with Qin plan Qi, with Qi plan Qin, why Jin Chu intelligent Qin Qi stupid?",
  "s0100": "This five.",
  "s0101": "Therefore obtain An Yi with good serve it, also certainly no calamity.",
  "s0102": "Qin have An Yi, Han clan certainly no Shang Dang.",
  "s0103": "Take world intestines stomach, with send troops fear not return, which profit?",
  "s0104": "Subject therefore say Qin Wang clear familiar plan, Marquis of Rang intelligent practiced affairs, certainly not increase Zhao armor four thousand replace Qi.",
  "s0105": "Then Marquis of Rang not go, led troops returned.",
  "s0106": "Zhao Wang thirty six years, chancellor Marquis of Rang spoke guest qing Zao, wished attack Qi take Gang Shou, broaden his Tao city.",
  "s0107": "Then Wei man Fan Ju self called Zhang Lu mister, mocked Marquis of Rang attack Qi, then cross San Jin attack Qi, with this time craftily advised Qin Zhao Wang.",
  "s0108": "Zhao Wang then used Fan Ju.",
  "s0109": "Fan Ju spoke Xuan Empress Dowager monopolize power, Marquis of Rang monopolize power feudal lords, Jing Yang Jun Gao Ling Jun kind too extravagant, rich exceed wang house.",
  "s0110": "Then Qin Zhao Wang enlightened, dismissed chancellor, ordered Jing Yang kind all exit pass, go enfeoff city.",
  "s0111": "Marquis of Rang exit pass, baggage chariots thousand ride surplus.",
  "s0112": "Marquis of Rang died Tao, because buried there.",
  "s0113": "Qin again collected Tao as commandery.",
  "s0114": "Grand Historian said: Marquis of Rang, Zhao Wang close maternal uncle.",
  "s0115": "Qin so east increase land, weaken feudal lords, once titled emperor world, world all west face bow head, Marquis of Rang merit.",
  "s0116": "To noble extreme rich overflow, one man open speak, body break power seize with worry die, moreover sojourner minister!"
}