{
  "s0101": "Lord Wu'an said: 'Qin did not listen to my plan. Now what can be done!'",
  "s0102": "The King of Qin heard this and grew angry. He forced Lord Wu'an to rise, but Lord Wu'an claimed illness and would not go.",
  "s0103": "Lord Ying requested it, but he would not rise.",
  "s0104": "Thus they demoted Lord Wu'an to common soldier and exiled him to Yinmi.",
  "s0105": "Lord Wu'an was ill and could not travel.",
  "s0106": "After three months, the allied forces attacked Qin army urgently. Qin army retreated many times, with messengers arriving daily.",
  "s0107": "The King of Qin sent men to expel Bai Qi, not allowing him to remain in Xianyang.",
  "s0108": "Lord Wu'an set out, leaving Xianyang's west gate for ten li, reaching Duyou.",
  "s0109": "King Zhao of Qin consulted with Lord Ying and his ministers: 'Bai Qi's exile—his heart is still resentful and unwilling, with many unspoken words.'",
  "s0110": "The king sent an envoy with a sword, commanding him to commit suicide.",
  "s0111": "Lord Wu'an drew his sword to cut his own throat, saying: 'What crime have I committed against Heaven to come to this?'",
  "s0112": "After a long time, he said: 'I certainly deserve to die.",
  "s0113": "At the battle of Changping, the Zhao troops who surrendered numbered several hundred thousand. I deceived them and buried them all alive. That is enough to deserve death.'",
  "s0114": "He then committed suicide.",
  "s0115": "Lord Wu'an died in the eleventh month of the fiftieth year of King Zhao of Qin.",
  "s0116": "He died though innocent of crime. The Qin people pitied him, and villages and townships all sacrificed to him.",
  "s0117": "Wang Jian was a man from the eastern village of Fenyin.",
  "s0118": "As a youth he loved military affairs and served Qin Shihuang.",
  "s0119": "In the eleventh year of Shihuang, Jian commanded the attack on Zhao's Yan Yu and broke it, conquering nine cities. In the eighteenth year, Jian commanded the attack on Zhao.",
  "s0120": "After more than a year, he conquered Zhao. The King of Zhao surrendered. They completely pacified Zhao territory as commanderies.",
  "s0121": "The next year, Yan sent Jing Ke to assassinate Qin. The King of Qin sent Wang Jian to attack Yan.",
  "s0122": "King Xi of Yan fled to Liaodong. Jian then pacified Yan's Ji and returned.",
  "s0123": "Qin sent Jian's son Wang Ben to attack Chu. Chu troops were defeated.",
  "s0124": "They returned to attack Wei. The King of Wei surrendered. They then pacified Wei territory.",
  "s0125": "Qin Shihuang had already extinguished the Three Jin, driven away the King of Yan, and repeatedly broken Chu forces.",
  "s0126": "Among Qin's generals was Li Xin, young and vigorous. He once with several thousand troops pursued Yan's crown prince Dan to the middle of Yan River, finally breaking through and capturing Dan. Shihuang considered him worthy and brave.",
  "s0127": "Shihuang asked Li Xin: 'I wish to attack and conquer Chu. In your estimation, how many men will suffice?'",
  "s0128": "Li Xin said: 'No more than 200,000 men.'",
  "s0129": "Shihuang asked Wang Jian. Wang Jian said: 'Without 600,000 men it cannot be done.'",
  "s0130": "Shihuang said: 'General Wang is old. Why so cowardly?",
  "s0131": "General Li is truly vigorous and brave. His words are correct.'",
  "s0132": "He sent Li Xin and Meng Tian to lead 200,000 men south to attack Chu.",
  "s0133": "Wang Jian's advice was not used, so he claimed illness and returned to retire in Fenyin.",
  "s0134": "Li Xin attacked Ping Yu, Meng Tian attacked Qin. They greatly broke Chu forces.",
  "s0135": "Xin attacked Yan Ying again and broke it. He then led troops west to meet Meng Tian at Chengfu.",
  "s0136": "Chu people followed them, three days and nights without resting or camping, greatly broke Li Xin's army, entered two walls, killed seven commandants, and Qin army fled.",
  "s0137": "Shihuang heard of it and grew greatly angry. He raced personally to Fenyin and apologized to Wang Jian: 'I did not use your plan. Li Xin has indeed disgraced our Qin army.",
  "s0138": "Now I hear Chu troops advance daily westward. Though you are ill, can you bear to abandon me?'",
  "s0139": "Wang Jian apologized: 'Old minister is tired and ill, confused. I ask only that Your Majesty choose another worthy general.'",
  "s0140": "Shihuang apologized: 'Enough. General, speak no more!'",
  "s0141": "Wang Jian said: 'If Your Majesty must use me, 600,000 men are indispensable.'",
  "s0142": "Shihuang said: 'I will follow your plan.'",
  "s0143": "Wang Jian led 600,000 troops. Shihuang personally saw him off to Bashang.",
  "s0144": "As Wang Jian departed, he requested many fine fields, houses, and gardens.",
  "s0145": "Shihuang said: 'General is departing. Why worry about poverty?'",
  "s0146": "Wang Jian said: 'As Your Majesty's general, even with merit I will never be enfeoffed as marquess. So while Your Majesty favors me, I also take this opportunity to request gardens and pools as property for my descendants.'",
  "s0147": "Shihuang laughed heartily.",
  "s0148": "Wang Jian reached the pass and sent messengers back five times requesting good fields.",
  "s0149": "Some said: 'The general's begging is already excessive.'",
  "s0150": "Wang Jian said: 'Not so.",
  "s0151": "The King of Qin is suspicious and distrusts people.",
  "s0152": "Now he empties Qin's armored soldiers and entrusts them all to me. If I don't request many fields and houses as property for my descendants to strengthen myself, won't the King of Qin sit and suspect me?'",
  "s0154": "Wang Jian indeed replaced Li Xin to attack Chu.",
  "s0155": "Chu heard Wang Jian was coming with increased forces and mobilized all their national troops to resist Qin.",
  "s0156": "Wang Jian arrived and built firm fortifications to defend, refusing battle.",
  "s0157": "Chu troops repeatedly came out to challenge, but he would not come out.",
  "s0158": "Wang Jian daily let his soldiers rest and bathe, treating them well with food and care, personally eating the same as the soldiers.",
  "s0159": "After a long time, Wang Jian sent someone to ask if the army was playing.",
  "s0160": "They replied: 'They are throwing stones and jumping.'",
  "s0161": "Wang Jian said: 'The soldiers can be used now.'",
  "s0162": "Chu repeatedly challenged but Qin would not come out. Chu then withdrew eastward.",
  "s0163": "Jian raised his troops to pursue them, commanding brave warriors to strike. He greatly broke Chu army.",
  "s0164": "Reaching south of Qi, he killed their general Xiang Yan. Chu troops fled in defeat.",
  "s0165": "Qin took advantage of victory to sweep and pacify Chu cities and towns.",
  "s0166": "After more than a year, they captured Chu King Fu Chou and finally pacified Chu territory as commanderies and counties.",
  "s0167": "They then campaigned south against the lords of Baiyue.",
  "s0168": "Wang Jian's son Wang Ben, together with Li Xin, conquered and pacified Yan and Qi territories.",
  "s0169": "In the twenty-sixth year of Qin Shihuang, they completely unified the world. The Wang and Meng clans had the greatest merit, their fame extending to later generations.",
  "s0170": "In the time of Qin Ershi, Wang Jian and his son Ben had both already died, and they also extinguished the Meng clan.",
  "s0171": "When Chen Sheng rebelled against Qin, Qin sent Wang Jian's grandson Wang Li to attack Zhao, besieging King Zhao and Zhang Er at Julu City.",
  "s0172": "Some said: 'Wang Li is Qin's famous general.",
  "s0173": "Now commanding strong Qin's troops to attack newly founded Zhao—it will certainly succeed.'",
  "s0174": "A guest said: 'Not so.",
  "s0175": "Generals of the third generation will certainly fail.",
  "s0176": "Why will they certainly fail?",
  "s0177": "They must have killed and conquered much. Afterward they receive their misfortune.",
  "s0178": "Now Wang Li is already a third-generation general.'",
  "s0179": "Before long, Xiang Yu rescued Zhao, attacked Qin army, and indeed captured Wang Li. Wang Li's army surrendered to the feudal lords.",
  "s0180": "The Grand Historian says: The common saying goes 'A foot has its shortcomings, an inch has its strengths.'",
  "s0181": "Bai Qi assessed enemies and adapted to changes, deploying surprises without limit, his fame shook the world, yet he could not save himself from Lord Ying's schemes.",
  "s0182": "Wang Jian as Qin's general extinguished the six states. At that time, Jian was an old general whom Shihuang relied on, yet he could not assist Qin in establishing virtue and strengthening its foundations, but instead curried favor and accommodated himself, leading to his downfall.",
  "s0183": "When his grandson Wang Li was captured by Xiang Yu, was it not fitting?"
}
