{
  "s0101": "Extinguished Kui, Kui not sacrificed Zhu Rong, Yu Xiong reason.",
  "s0102": "Xia, attacked Song, Song reported urgent to Jin, Jin saved Song, Cheng Wang stopped returned.",
  "s0103": "General Zi Yu requested battle, Cheng Wang said: 'Chong Er fled dwelt outside long, finally got return state, heaven opened, cannot oppose.'",
  "s0104": "Zi Yu firmly requested, then gave him few teachers left.",
  "s0105": "Jin indeed defeated Zi Yu at Cheng Pu.",
  "s0106": "Cheng Wang angered, executed Zi Yu.",
  "s0107": "Forty six years, initially, Cheng Wang about with Shang Chen as crown prince, spoke commanded Ling Yin Zi Shang.",
  "s0108": "Zi Shang said: 'Lord teeth not old, yet many inner favorites, expel then chaos.",
  "s0109": "Chu state raising often at young ones.",
  "s0110": "Moreover Shang Chen wasp eyes wolf voice, ruthless person, cannot establish.'",
  "s0111": "Wang not listened, established him.",
  "s0112": "Later again wished establish Zi Zhi expel crown prince Shang Chen.",
  "s0113": "Shang Chen heard yet not confirmed, told his tutor Pan Chong: 'How get real?'",
  "s0114": "Chong said: 'Feast wang favored concubine Jiang Mi yet not respect.'",
  "s0115": "Shang Chen followed it.",
  "s0116": "Jiang Mi angered said: 'Suitable wang wish kill you establish Zhi.'",
  "s0117": "Shang Chen told Pan Chong said: 'Trust.'",
  "s0118": "Chong said: 'Able serve him?'",
  "s0119": "Said: 'Cannot.'",
  "s0120": "'Able flee go?'",
  "s0121": "Said: 'Cannot.'",
  "s0122": "'Able do great matter?'",
  "s0123": "Said: 'Able.'",
  "s0124": "Winter ten month, Shang Chen with palace guard troops surrounded Cheng Wang.",
  "s0125": "Cheng Wang requested eat bear paw die, not listened.",
  "s0126": "Ding Wei, Cheng Wang self strangled killed.",
  "s0127": "Shang Chen replaced established, this was Mu Wang.",
  "s0128": "Mu Wang established, with his crown prince palace gave Pan Chong, made grand master, grasped state matters.",
  "s0129": "Mu Wang three years, extinguished Jiang.",
  "s0130": "Four years, extinguished Liu, Liao.",
  "s0131": "Liu, Liao, Gao Tao descendants.",
  "s0132": "Eight years, attacked Chen.",
  "s0133": "Twelve years, died.",
  "s0134": "Son Zhuang Wang Lv established.",
  "s0135": "Zhuang Wang established three years, not issued commands, day night for music, commanded state middle: 'Have dare admonish die no pardon!'",
  "s0136": "Wu Ju entered admonished.",
  "s0137": "Zhuang Wang left embraced Zheng Ji, right embraced Yue woman, sat bell drum between.",
  "s0138": "Wu Ju said: 'Wish have advance hidden.'",
  "s0139": "Said: 'Have bird at mound, three years not fly not cry, what bird?'",
  "s0140": "Zhuang Wang said: 'Three years not fly, fly will rush heaven;",
  "s0141": "Three years not cry, cry will alarm people.",
  "s0142": "Ju retreated, I know it.'",
  "s0143": "Dwelt several months, dissipated increasingly severe.",
  "s0144": "Grand master Su Cong then entered admonished.",
  "s0145": "Wang said: 'Not heard command?'",
  "s0146": "Replied: 'Kill body clarify lord, minister wish.'",
  "s0147": "Then stopped dissipated music, listened politics, executed hundreds people, promoted hundreds people, employed Wu Ju, Su Cong with politics, state people greatly delighted.",
  "s0148": "This year extinguished Yong.",
  "s0149": "Six years, attacked Song, captured five hundred chariots.",
  "s0150": "Eight years, attacked Lu Hun Rong, then reached Luo, reviewed troops at Zhou suburbs."
}
