{
  "s0001": "Wei's ancestors were Bi Gong Gao's descendants.",
  "s0002": "Bi Gong Gao and Zhou shared the same surname.",
  "s0003": "When King Wu attacked Zhou, Gao was enfeoffed at Bi, thus became Bi surname.",
  "s0004": "Afterward the enfeoffment was cut off, became commoners, some in central states, some among barbarians.",
  "s0005": "Their descendant named Bi Wan, served Jin Xian Gong.",
  "s0006": "Xian Gong's sixteenth year, Zhao Su was charioteer, Bi Wan was right guard, attacked Huo, Geng, Wei, extinguished them.",
  "s0007": "With Geng enfeoffed Zhao Su, with Wei enfeoffed Bi Wan, made him grand master.",
  "s0008": "Bu Yan said: 'Bi Wan's descendants must be great, wan is full number;",
  "s0009": "Wei is great name.",
  "s0010": "With this beginning reward, heaven opened it, Son of Heaven is called myriad people, feudal lords called ten thousand people.",
  "s0011": "Now command it great, following full number, he must have multitudes.'",
  "s0012": "Initially, Bi Wan divined serving Jin, encountered tun compared to bi.",
  "s0013": "Xin Liao divined it, said: 'Auspicious.",
  "s0014": "Tun solid bi enter, auspicious who greater, he must multiply flourish.'",
  "s0016": "Bi Wan enfeoffed eleven years, Jin Xian Gong died, four sons contended alternately established, Jin chaotic.",
  "s0017": "And Bi Wan's generation increasingly great, followed his state name became Wei clan.",
  "s0018": "Gave birth to Wu Zi.",
  "s0019": "Wei Wu Zi with Wei youths served Jin prince Chong Er.",
  "s0020": "Jin Xian Gong's twenty-first year, Wu Zi followed Chong Er fled exile.",
  "s0021": "Nineteen years returned, Chong Er established as Jin Wen Gong, and ordered Wei Wu Zi inherit Wei clan's later enfeoffment, ranked as grand master, governed at Wei.",
  "s0022": "Gave birth to Dao Zi.",
  "s0023": "Wei Dao Zi moved governance to Huo.",
  "s0024": "Gave birth to Wei Jiang.",
  "s0025": "Wei Jiang served Jin Dao Gong.",
  "s0026": "Dao Gong third year, assembled feudal lords.",
  "s0027": "Dao Gong younger brother Yang Gan disrupted conduct, Wei Jiang humiliated Yang Gan.",
  "s0028": "Dao Gong angered said: 'Assemble feudal lords for glory, now humiliate my younger brother!'",
  "s0029": "Would execute Wei Jiang.",
  "s0030": "Someone persuaded Dao Gong, Dao Gong stopped.",
  "s0031": "Finally employed Wei Jiang governance, made peace with Rong, Di, Rong, Di drew close attached.",
  "s0032": "Dao Gong's eleventh year, said: 'Since I used Wei Jiang, eight years midst, nine assembled feudal lords, Rong, Di harmonious, your strength.'",
  "s0033": "Granted him music, three declines, then accepted it.",
  "s0034": "Moved governed An Yi.",
  "s0035": "Wei Jiang died, posthumous title Zhao Zi.",
  "s0036": "Gave birth to Wei Ying.",
  "s0037": "Ying gave birth to Wei Xian Zi.",
  "s0038": "Xian Zi served Jin Zhao Gong.",
  "s0039": "Zhao Gong died and six ministers strong, ducal house lowly.",
  "s0040": "Jin Qing Gong's twelfth year, Han Xuan Zi old, Wei Xian Zi governed state affairs.",
  "s0041": "Jin imperial clan Qi clan, Yang She clan mutually hated, six ministers executed them, completely took their yi made ten counties, six ministers each ordered their son be county magistrate.",
  "s0042": "Xian Zi with Zhao Jian Zi, Zhong Xing Wen Zi, Fan Xian Zi together became Jin ministers.",
  "s0043": "Afterward fourteen years Confucius became Lu chancellor.",
  "s0044": "After four years, Zhao Jian Zi because Jin Yang chaos, and with Han, Wei together attacked Fan, Zhong Xing clan.",
  "s0045": "Wei Xian Zi gave birth to Wei Chi.",
  "s0046": "Wei Chi with Zhao Yang together attacked Fan, Zhong Xing clan.",
  "s0047": "Wei Chi's grandson named Wei Huan Zi, with Han Kang Zi, Zhao Xiang Zi together attacked extinguished Zhi Bo, divided his land.",
  "s0048": "Huan Zi's grandson named Wen Hou Du.",
  "s0049": "Wei Wen Hou first year, Qin Ling Gong's first year.",
  "s0050": "With Han Wu Zi, Zhao Huan Zi, Zhou Wei Wang contemporaneous.",
  "s0051": "Sixth year, walled Shao Liang.",
  "s0052": "Thirteenth year, sent Zi Ji surround Fan, Pang, expel their people.",
  "s0053": "Sixteenth year, attacked Qin, built Lin Jin Yuan Li.",
  "s0054": "Seventeenth year, attacked Zhong Shan, made Zi Ji guard it, Zhao Cang Tang assisted him.",
  "s0055": "Zi Ji met Wen Hou teacher Tian Zi Fang at Zhao Ge, drew carriage aside, descended saluted.",
  "s0056": "Tian Zi Fang did not return courtesy.",
  "s0057": "Zi Ji because asked said: 'Rich noble arrogant people? Moreover poor lowly arrogant people?'",
  "s0058": "",
  "s0059": "Zi Fang said: 'Also poor lowly arrogant people. Feudal lords arrogant people then lose their state, grand masters arrogant people then lose their house. Poor lowly, conduct not accord, words not used, then depart to Chu, Yue, like shed shoes, how compare them!'",
  "s0060": "",
  "s0061": "",
  "s0062": "Zi Ji displeased departed.",
  "s0063": "West attacked Qin, arrived Zheng returned, built Luo Yin, He Yang.",
  "s0064": "Twenty-second year, Wei, Zhao, Han ranked as feudal lords.",
  "s0065": "Twenty-fourth year, Qin attacked us, arrived Yang Hu.",
  "s0066": "Twenty-fifth year, Zi Ji gave birth to Zi Ying.",
  "s0067": "Wen Hou received Zi Xia classics arts, hosted Duan Gan Mu, passed his gate, never not straightened.",
  "s0068": "Qin once wished attack Wei, someone said: 'Wei jun wise person courteous, state people called benevolent, high low harmonious united, not conquerable.'",
  "s0069": "Wen Hou from this obtained reputation among feudal lords.",
  "s0070": "Appointed Xi Men Bao guard Ye, and He Nei called governed.",
  "s0071": "Wei Wen Hou told Li Ke said: 'Sir once taught me said \"family poor then think good wife, state chaotic then think good chancellor\".",
  "s0072": "Now appointed not Cheng then Huang, two sons how?'",
  "s0073": "Li Ke replied said: 'Subject heard, lowly not plan honored, distant not plan close.",
  "s0074": "Subject at palace gate outside, dare not receive command.'",
  "s0075": "Wen Hou said: 'Sir face affair not decline.'",
  "s0076": "Li Ke said: 'Jun not examine old.",
  "s0077": "At residence view what close, rich view what give, successful view what promote, poor view what not do, destitute view what not take, five sufficient determine it, what await Ke!'",
  "s0078": "Wen Hou said: 'Sir go residence, my chancellor determined.'",
  "s0079": "Li Ke hurried out, passed Di Huang home.",
  "s0080": "Di Huang said: 'Now heard jun summoned sir divined chancellor, indeed who for it?'",
  "s0081": "Li Ke said: 'Wei Cheng Zi became chancellor.'",
  "s0082": "Di Huang angered changed color said: 'With ears eyes what saw recorded, subject what owed Wei Cheng Zi?",
  "s0083": "Xi He guard, subject what advanced.",
  "s0084": "Jun inside with Ye worried, subject advanced Xi Men Bao.",
  "s0085": "Jun planned wished attack Zhong Shan, subject advanced Yue Yang.",
  "s0086": "Zhong Shan with taken, no make guard it, subject advanced sir.",
  "s0087": "Jun son no tutor, subject advanced Qu Hou Fu.",
  "s0088": "Subject what owed Wei Cheng Zi!'",
  "s0089": "Li Ke said: 'Moreover your words Ke to your jun, how will clique to seek great office?",
  "s0090": "Jun asked placed chancellor \"not Cheng then Huang, two sons how?\"'",
  "s0091": "Ke replied: \"Jun not examine old.",
  "s0092": "At residence view what close, rich view what give, successful view what promote, poor view what not do, destitute view what not take, five sufficient determine it, what await Ke!\"",
  "s0093": "Therefore know Wei Cheng Zi became chancellor.",
  "s0094": "Moreover you how able with Wei Cheng Zi compare?",
  "s0095": "Wei Cheng Zi with food salary thousand zhong, ten nine outside, ten one inside, therefore east obtained Bu Zi Xia, Tian Zi Fang, Duan Gan Mu.",
  "s0096": "These three, jun all teacher them.",
  "s0097": "You what advanced five people, jun all minister them.",
  "s0098": "You how able with Wei Cheng Zi compare?'",
  "s0099": "Di Huang hesitant twice bowed said: 'Huang, rustic person, lost reply, wish finish be disciple.'",
  "s0101": "Twenty-sixth year, Guo Shan collapsed, blocked river.",
  "s0102": "Thirty-second year, attacked Zheng.",
  "s0103": "Walled Suan Zao.",
  "s0104": "Defeated Qin at Zhu.",
  "s0105": "Thirty-fifth year, Qi attacked took our Xiang Ling.",
  "s0106": "Thirty-sixth year, Qin invaded our Yin Jin.",
  "s0107": "Thirty-eighth year, attacked Qin, defeated us at Wu Xia, obtained their general Shi.",
  "s0108": "This year, Wen Hou died, Zi Ji established, this was Wu Hou.",
  "s0109": "Wei Wu Hou first year, Zhao Jing Hou initially established, Gong Zi Shuo rebelled, not victorious, fled Wei, with Wei attacked Han Dan, Wei defeated departed.",
  "s0110": "Second year, walled An Yi, Wang Yuan.",
  "s0111": "Seventh year, attacked Qi, arrived Sang Qiu.",
  "s0112": "Ninth year, Di defeated us at Kuai.",
  "s0113": "Made Wu Qi attack Qi, arrived Ling Qiu.",
  "s0114": "Qi Wei Wang initially established.",
  "s0115": "Eleventh year, with Han, Zhao divided Jin land, extinguished their descendants.",
  "s0116": "Thirteenth year, Qin Xian Gong county Li Yang.",
  "s0117": "Fifteenth year, defeated Zhao Bei Lin.",
  "s0118": "Sixteenth year, attacked Chu, took Lu Yang.",
  "s0119": "Wu Hou died, Zi Ying established, this was Hui Wang.",
  "s0120": "Hui Wang first year, initially, Wu Hou died, Zi Ying with Gong Zhong Huan contended for crown prince.",
  "s0121": "Gong Sun Yi self Song entered Zhao, self Zhao entered Han, told Han Yi Hou said: \"Wei Ying with Gong Zhong Huan contend for crown prince, jun also heard it?",
  "s0122": "Now Wei Ying obtained Wang Cuo, held Shang Dang, solid half state.",
  "s0123": "Because remove him, break Wei must, cannot lose.\"",
  "s0124": "Yi Hou pleased, then with Zhao Cheng Hou united army combined troops attacked Wei, battled at Zhu Ze, Wei clan greatly defeated, Wei jun surrounded.",
  "s0125": "Zhao told Han said: \"Remove Wei jun, establish Gong Zhong Huan, divide land then retreat, I moreover profit.\"",
  "s0126": "Han said: \"Cannot.",
  "s0127": "Kill Wei jun, people must say violent;",
  "s0128": "Divide land then retreat, people must say greedy.",
  "s0129": "Not as divide into two.",
  "s0130": "Wei divided into two, not stronger than Song, Wei, then I forever without Wei calamity.\"",
  "s0131": "Zhao not listened.",
  "s0132": "Han not pleased, with his few troops night departed.",
  "s0133": "Hui Wang what body not died, state not divided, two houses plans not harmonious.",
  "s0134": "If followed one house plan, then Wei must divided.",
  "s0135": "Therefore said \"jun finally no worthy son, his state can break\".",
  "s0136": "Second year, Wei defeated Han at Ma Ling, defeated Zhao at Huai.",
  "s0137": "Third year, Qi defeated our Guan.",
  "s0138": "Fifth year, with Han assembled at Zhai Yang.",
  "s0139": "Walled Wu Du.",
  "s0140": "For Qin defeated.",
  "s0141": "Sixth year, attacked took Song Yi Tai.",
  "s0142": "Ninth year, attacked defeated Han at Kuai.",
  "s0143": "With Qin battled Shao Liang, captured our general Gong Sun Cuo, took Pang.",
  "s0144": "Qin Xian Gong died, son Xiao Gong established.",
  "s0145": "Tenth year, attacked took Zhao Pi Lao.",
  "s0146": "Comet appeared.",
  "s0147": "Twelfth year, star day fell, had sound.",
  "s0148": "Fourteenth year, with Zhao assembled at Xiang.",
  "s0149": "Fifteenth year, Lu, Wei, Song, Zheng lords came court.",
  "s0150": "Sixteenth year, with Qin Xiao Gong assembled Du Ping.",
  "s0151": "Invaded Song Huang Chi, Song again took it.",
  "s0152": "Seventeenth year, with Qin battled Yuan Li, Qin took our Shao Liang.",
  "s0153": "Surrounded Zhao Han Dan.",
  "s0154": "Eighteenth year, took Han Dan.",
  "s0155": "Zhao requested aid from Qi, Qi made Tian Ji, Sun Bin save Zhao, defeated Wei Gui Ling.",
  "s0156": "Nineteenth year, feudal lords surrounded our Xiang Ling.",
  "s0157": "Built long wall, blocked Gu Yang.",
  "s0158": "Twentieth year, returned Zhao Han Dan, allied at Zhang Shui above.",
  "s0159": "Twenty-first year, with Qin assembled Tong.",
  "s0160": "Zhao Cheng Hou died.",
  "s0161": "Twenty-eighth year, Qi Wei Wang died.",
  "s0162": "Zhong Shan jun became chancellor of Wei.",
  "s0163": "Thirtieth year, Wei attacked Zhao, Zhao urgently told Qi.",
  "s0164": "Qi Xuan Wang used Sun Zi plan, saved Zhao attacked Wei.",
  "s0165": "Wei then greatly raised troops, made Pang Juan general, ordered Tai Zi Shen as upper general.",
  "s0166": "Passed Wai Huang, Wai Huang Xu Zi told Tai Zi said: 'Subject has hundred battle hundred victory technique.'",
  "s0167": "Tai Zi said: 'Can hear it?'",
  "s0168": "Guest said: 'Solid wish offer it.'",
  "s0169": "Said: 'Tai Zi self lead attack Qi, great victory unite Ju, then rich not over have Wei, noble not increase be wang.",
  "s0170": "If battle not victory Qi, then ten thousand generations without Wei.",
  "s0171": "This subject hundred battle hundred victory technique.'",
  "s0172": "Tai Zi said: 'Yes, please must follow gong words then return.'",
  "s0173": "Guest said: 'Tai Zi though wish return, cannot.",
  "s0174": "They urge Tai Zi battle attack, wish drink soup many.",
  "s0175": "Tai Zi though wish return, fear cannot.'",
  "s0176": "Tai Zi because wished return, his charioteer said: 'General leave then return, with north same.'",
  "s0177": "Tai Zi indeed with Qi people battled, defeated at Ma Ling.",
  "s0178": "Qi captured Wei Tai Zi Shen, killed general Juan, army then greatly broken.",
  "s0179": "Thirty-first year, Qin, Zhao, Qi together attacked us, Qin general Shang Jun deceived our general Gong Zi Ang then surprise seized his army, broke it.",
  "s0180": "Qin used Shang Jun, east land to river, and Qi, Zhao several broke us, An Yi near Qin, thereupon moved governed Da Liang.",
  "s0181": "Made Gong Zi He as Tai Zi.",
  "s0182": "Thirty-third year, Qin Xiao Gong died, Shang Jun fled Qin returned Wei, Wei angered, not entered.",
  "s0183": "Thirty-fifth year, with Qi Xuan Wang assembled Ping A south.",
  "s0184": "Hui Wang several defeated in military campaigns, lowly ritual thick gifts to recruit worthy people.",
  "s0185": "Zou Yan, Chun Yu Kun, Meng Ke all arrived Liang.",
  "s0186": "Liang Hui Wang said: 'I not worthy, troops three broken outside, Tai Zi captured, upper general died, state with empty, shame first jun ancestral temple she ji, I very ashamed it, old not far thousand li, disgrace fortunately arrived ruined yi court, will what benefit our state?'",
  "s0187": "Meng Ke said: 'Jun cannot speak profit like this.",
  "s0188": "Jun wish profit then da fu wish profit, da fu wish profit then common people wish profit, high low contend profit, state then dangerous.",
  "s0189": "Be person jun, benevolence righteousness only, what with profit!'",
  "s0191": "Thirty-sixth year, again with Qi wang assembled Zhen.",
  "s0192": "This year, Hui Wang died, son Xiang Wang established.",
  "s0193": "Xiang Wang first year, with feudal lords assembled Xu Zhou, mutually wang.",
  "s0194": "Pursued honored father Hui Wang as wang.",
  "s0195": "Fifth year, Qin defeated our Long Jia army forty-five thousand at Diao Yin, surrounded our Jiao, Qu Wo.",
  "s0196": "Gave Qin He Xi land.",
  "s0197": "Sixth year, with Qin assembled Ying.",
  "s0198": "Qin took our Fen Yin, Pi Shi, Jiao.",
  "s0199": "Wei attacked Chu, defeated them at Xing Shan.",
  "s0200": "Seventh year, Wei completely entered Shang Jun to Qin.",
  "s0201": "Qin surrendered our Pu Yang.",
  "s0202": "Eighth year, Qin returned our Jiao, Qu Wo.",
  "s0203": "Twelfth year, Chu defeated our Xiang Ling.",
  "s0204": "Feudal lords administer affairs with Qin chancellor Zhang Yi assembled Ya Sang.",
  "s0205": "Thirteenth year, Zhang Yi became chancellor of Wei.",
  "s0206": "Wei had woman transformed to man.",
  "s0207": "Qin took our Qu Wo, Ping Zhou.",
  "s0208": "Sixteenth year, Xiang Wang died, son Ai Wang established.",
  "s0209": "Zhang Yi again returned Qin.",
  "s0210": "Ai Wang first year, five states together attacked Qin, not victorious departed.",
  "s0211": "Second year, Qi defeated our Guan Jin.",
  "s0212": "Fifth year, Qin made Chu Li Zi attack took our Qu Wo, fled Xi Shou An Men.",
  "s0213": "Sixth year, Qin came established Gong Zi Zheng as Tai Zi.",
  "s0214": "With Qin assembled Lin Jin.",
  "s0215": "Seventh year, attacked Qi.",
  "s0216": "With Qin attacked Yan.",
  "s0217": "Eighth year, attacked Wei, took lie cities two.",
  "s0218": "Wei jun troubled it.",
  "s0219": "Ru Er planned cut Zhao, Zhao divided become two, what not perished, Wei for alliance lord.",
  "s0220": "Now Wei already pressed perish, will west request serve Qin.",
  "s0221": "With use Qin save Wei, not as use Wei save Wei, saw Wei jun said: 'Please stop Wei troops, exempt Cheng Ling jun can?'",
  "s0222": "Wei jun said: 'Sir indeed able, orphan please generation generation with Wei serve sir.'",
  "s0223": "Ru Er saw Cheng Ling jun said: 'Former Wei attacked Zhao, cut Yang Chang, took Yan Yu, Wei virtue Wei must endless.'",
  "s0224": "Cheng Ling jun said: 'Yes.'",
  "s0225": "Ru Er saw Wei wang said: 'Subject have audience at Wei.",
  "s0226": "Wei formerly Zhou house branch, its call small state, many treasure vessels.",
  "s0227": "Now state pressed by difficulty and treasure vessels not out, its heart consider attack Wei save Wei not with wang as lord, therefore treasure vessels though out must not enter wang.",
  "s0228": "Subject secretly calculate, first speak save Wei must receive Wei.'",
  "s0229": "Ru Er left, Cheng Ling jun entered, with his words saw Wei wang.",
  "s0230": "Wei wang listened his persuasion, stopped his troops, exempted Cheng Ling jun, lifetime not saw.",
  "s0231": "Ninth year, with Qin wang assembled Lin Jin.",
  "s0232": "Zhang Yi, Wei Zhang all returned Wei.",
  "s0233": "Wei chancellor Tian Xu died, Chu harmed Zhang Yi, Xi Shou, Xue Gong.",
  "s0234": "Chu chancellor Zhao Yu told Su Dai said: 'Tian Xu died, I fear Zhang Yi, Xi Shou, Xue Gong have one chancellor Wei.'",
  "s0235": "Dai said: 'Then chancellor wish who and jun convenient it?'",
  "s0236": "Zhao Yu said: 'I wish Tai Zi self chancellor.'",
  "s0237": "Dai said: 'Please for jun north, must chancellor it.'",
  "s0238": "Zhao Yu said: 'How?'",
  "s0239": "Replied said: 'Jun for Liang wang, Dai please persuade jun.'",
  "s0240": "Zhao Yu said: 'How?'",
  "s0241": "Replied said: 'Dai from Chu came, Zhao Yu very worried, said: \"Tian Xu died, I fear Zhang Yi, Xi Shou, Xue Gong have one chancellor Wei.\" Dai said: \"Liang wang, eldest lord, must not chancellor Zhang Yi.",
  "s0242": "Zhang Yi chancellor, must right Qin left Wei.",
  "s0243": "Xi Shou chancellor, must right Han left Wei.",
  "s0244": "Xue Gong chancellor, must right Qi left Wei.",
  "s0245": "Liang wang, eldest lord, must not convenient.\" Wang said: \"Then I who chancellor?\" Dai said: \"Not if Tai Zi self chancellor.",
  "s0246": "Tai Zi self chancellor, is three people all with Tai Zi as not normal chancellor, all will strive with their state serve Wei, wish obtain Chancellor seal.",
  "s0247": "With Wei strong, and three ten thousand chariots state auxiliary it, Wei must peaceful.\"'",
  "s0353": "If road He Nei, double Ye, Chao Ge, cut Zhang Fu water, with Zhao troops decide at Han Dan suburb, is Zhi Bo calamity, Qin moreover not dare.",
  "s0354": "Attack Chu, road She Gu, march three thousand li.",
  "s0355": "And attack Ming E barrier, what march very far, what attack very difficult, Qin moreover not do.",
  "s0356": "If road He Wai, double Da Liang, right Shang Cai, Zhao Ling, with Chu troops decide at Chen suburb, Qin moreover not dare.",
  "s0357": "Therefore said Qin must not attack Chu with Zhao, moreover not attack Wei with Qi.",
  "s0358": "Han perished after, troops leave day, not Wei none attack self.",
  "s0359": "Qin solid have Huai, Mao, Xing Qiu, walled Que Jin to face He Nei, He Nei Gong, Ji must danger;",
  "s0360": "Have Zheng land, obtain Yuan Yong, decide Ying Ze water irrigate Da Liang, Da Liang must perish.",
  "s0361": "Wang envoy leave pass angered An Ling clan at Qin, Qin desire execute long.",
  "s0362": "Qin Ye Yang, Kun Yang with Wu Yang neighbor, listen envoy angered them, follow An Ling clan perish them, surround Wu Yang north, east face Xu, south state must danger, state none harm?",
  "s0363": "Hate Han not love An Ling clan can, not worry Qin not love south state not.",
  "s0364": "Different days, Qin in He Xi Jin, state depart Liang thousand li, have river mountain to block, have Zhou Han to separate.",
  "s0365": "From Lin Xiang army until now, Qin seven attacked Wei, five entered park midst, border cities all taken, Wen Tai fallen, suspended capital burned, forests cut, deer elk exhausted, and state followed surrounded.",
  "s0366": "Moreover long drove Liang north, east to Tao Wei suburb, north to Ping Jian.",
  "s0367": "What perished to Qin, Shan Nan Shan Bei, He Wai He Nei, great counties several ten, famous capitals several hundred.",
  "s0368": "Qin then in He Xi Jin, depart Liang thousand li, calamity like this, moreover compared make Qin without Han, have Zheng land, without river mountain block, without Zhou Han separate, depart Da Liang hundred li, calamity must from this.",
  "s0369": "Different days, follow it not completed, Chu, Wei doubted and Han not obtainable.",
  "s0370": "Now Han received troops three years, Qin forced with discussion, know perish not listen, threw hostage to Zhao, requested for world goose row stop blade, Chu, Zhao must gather troops, all know Qin desire infinite, not completely perish world states and minister within seas, must not stop.",
  "s0371": "Therefore subject wish with follow serve wang, wang quick receive Chu Zhao agreement, hold Han hostage to preserve Han, and seek old land, Han must offer it.",
  "s0372": "This scholars people not labor and old land obtained, its merit many compared with Qin together attack Han, moreover with strong Qin neighbor calamity.",
  "s0373": "Preserve Han secure Wei and benefit world, this also wang heaven time already.",
  "s0374": "Connect Han Shang Dang to Gong, Ning, make road An Cheng, out in assign it, is Wei heavy hostage Han with its Shang Dang.",
  "s0375": "Now have its assign, sufficient rich state.",
  "s0376": "Han must virtue Wei love Wei heavy Wei fear Wei, Han must not dare oppose Wei, is Han then Wei county.",
  "s0377": "Wei obtain Han as county, Wei, Da Liang, He Wai must secure.",
  "s0378": "Now not preserve Han, two Zhou, An Ling must danger, Chu, Zhao great broken, Wei, Qi very fear, world west toward gallop Qin enter court become minister not long.",
  "s0379": "Twentieth year, Qin surrounded Han Dan, Xin Ling jun Wu Ji falsely seized General Jin Bi troops to save Zhao, Zhao obtained complete.",
  "s0380": "Wu Ji because stayed Zhao.",
  "s0381": "Twenty-sixth year, Qin Zhao Wang died.",
  "s0382": "Thirtieth year, Wu Ji returned Wei, led five states troops attacked Qin, defeated them He Wai, fled Meng Meng.",
  "s0383": "Wei Tai Zi Zeng hostage at Qin, Qin angered, wished imprison Wei Tai Zi Zeng.",
  "s0384": "Someone for Zeng told Qin wang said: 'Gong Sun Xi solid told Wei chancellor said \"please with Wei ill attack Qin, Qin wang anger, must imprison Zeng.",
  "s0385": "Wei wang moreover anger, attack Qin, Qin must injured\"",
  "s0386": "Now wang imprison Zeng, is Xi plan midst.",
  "s0387": "Therefore not if noble Zeng and unite Wei, to doubt it at Qi, Han.'",
  "s0388": "Qin then stopped Zeng.",
  "s0389": "Thirty-first year, Qin wang Zheng initially established.",
  "s0390": "Thirty-fourth year, An Li wang died, Tai Zi Zeng established, is Jing Min wang.",
  "s0391": "Xin Ling jun Wu Ji died.",
  "s0392": "Jing Min wang first year, Qin took our twenty cities, made Qin Dong jun.",
  "s0393": "Second year, Qin took our Chao Ge.",
  "s0394": "Wei moved Ye Wang.",
  "s0395": "Third year, Qin took our Ji.",
  "s0396": "Fifth year, Qin took our Yuan, Pu Yang, Yan.",
  "s0397": "Fifteenth year, Jing Min wang died, son Wang Jia established.",
  "s0398": "Wang Jia first year, Yan Tai Zi Dan made Jing Ke stab Qin wang, Qin wang aware it.",
  "s0399": "Third year, Qin irrigated Da Liang, captured Wang Jia, then extinguished Wei made jun county.",
  "s0400": "Grand Historian said: I visited former Da Liang ruins, ruins midst people said: 'Qin broke Liang, led river ditch irrigated Da Liang, three months city broken, wang requested surrender, then extinguished Wei.'",
  "s0401": "Speakers all said Wei because not used Xin Ling jun reason, state cut weakened to perished, I consider not so.",
  "s0402": "Heaven just ordered Qin pacify within seas, its enterprise not completed, Wei though obtained A Heng assistant, how benefit?"
}