{
  "s0301": "Thirty four years, wang more strict, state people not dare speak, road with eyes.",
  "s0302": "Li Wang happy, inform Zhao Gong said: 'I able stop slander, yet not dare speak.'",
  "s0303": "Zhao Gong said: 'Is block it.",
  "s0304": "Block people mouth, severe at block water.",
  "s0305": "Water block burst, injure person must many, people also like it.",
  "s0306": "Therefore for water decide guide, for people declare make speak.",
  "s0307": "Therefore heavenly son listen government, make Gong Qing reach lie Shi offer poem, Gu offer song, Shi offer book, teacher admonish, Shou assign, Meng chant, hundred work remonstrate, common people transmit speech, near minister exhaust advise, relatives repair examine, Gu Shi teach instruct, Qi Ai repair it, then wang weigh consider, therefore affairs walk not contrary.",
  "s0308": "People have mouth, like earth have mountain river, wealth use from here out: like its have source low spread fertile, clothes food from here born.",
  "s0309": "Mouth declare speech, good bad from here rise.",
  "s0310": "Walk good yet prepare bad, therefore produce wealth use clothes food.",
  "s0311": "Man people consider at heart yet declare at mouth, complete yet walk it.",
  "s0312": "If block its mouth, its with able how many?'",
  "s0313": "Wang not listen.",
  "s0314": "Then state not dare exit speech, three years, then mutually rebel, attack Li Wang.",
  "s0315": "Li Wang exit flee at Zhi.",
  "s0316": "Li Wang crown prince Jing hide Zhao Gong home, state people hear, then surround it.",
  "s0317": "Zhao Gong said: 'Previously I frequently remonstrate wang, wang not follow, reach this difficulty.",
  "s0318": "Now kill wang crown prince, wang its with me as enemy yet anger resent?",
  "s0319": "Man serve lord, dangerous not enemy resent, resent not anger, moreover serve wang!'",
  "s0320": "Then with his son replace wang crown prince, crown prince finally get escape.",
  "s0321": "Zhao Gong, Zhou Gong two ministers administer government, number said 'Republican'.",
  "s0322": "Republican fourteen years, Li Wang die at Zhi.",
  "s0323": "Crown prince Jing grow at Zhao Gong home, two ministers then together establish it as wang, this was Xuan Wang.",
  "s0324": "Xuan Wang establish, two ministers assist it, repair government, law Wen, Wu, Cheng, Kang remain wind, feudal lords again ancestral Zhou.",
  "s0325": "Twelve years, Lu Wu Gong come court.",
  "s0326": "Xuan Wang not repair register at Qian Mu, Guo Wen Gong remonstrate said cannot, wang not listen.",
  "s0327": "Thirty nine years, battle at Qian Mu, wang troops defeat at Jiang clan Rong.",
  "s0328": "Xuan Wang already lose south state troops, then count people at Tai Yuan.",
  "s0329": "Zhong Shan Fu remonstrate said: 'People not able count.'",
  "s0330": "Xuan Wang not listen, finally count people.",
  "s0331": "Forty six years, Xuan Wang die, son You Wang Gong Ning establish.",
  "s0332": "You Wang two years, west Zhou three rivers all quake.",
  "s0333": "Bo Yang Fu said: 'Zhou will perish.",
  "s0334": "Man heaven earth qi, not lose its order;",
  "s0335": "If exceed its order, people chaos it.",
  "s0336": "Yang hide yet not able exit, yin press yet not able steam, then have earth quake.",
  "s0337": "Now three rivers actual quake, is yang lose its place yet fill yin.",
  "s0338": "Yang lose yet at yin, source must block;",
  "s0339": "Source block, state must perish.",
  "s0340": "Man water earth spread yet people use it.",
  "s0341": "Earth no place spread, people lack wealth use, not perish what wait!",
  "s0342": "Previously Yi, Luo dry yet Xia perish, He dry yet Shang perish.",
  "s0343": "Now Zhou virtue like two generation end, its river source again block, block must dry.",
  "s0344": "Man state must rely mountain river, mountain collapse river dry, perish state omen.",
  "s0345": "River dry must mountain collapse.",
  "s0346": "If state perish not over ten years, number record it.",
  "s0347": "Heaven abandon, not over its record.'",
  "s0348": "Is year, three rivers dry, Qi mountain collapse.",
  "s0349": "Three years, You Wang favorite love Bao Si.",
  "s0350": "Bao Si give birth son Bo Fu, You Wang desire abolish crown prince."
}
