{
  "s0051": "Lu Zhonglian said: 'Alas!",
  "s0052": "Is Wei's comparison to Qin like the lackey?'",
  "s0053": "Xin Yuan Der said: 'Yes.'",
  "s0054": "Lu Zhonglian said: 'I will make Qin king boil and pickle Wei king.'",
  "s0055": "Xin Yuan Der resentfully displeased, said: 'Ah, too excessive are master's words!",
  "s0056": "How can master make Qin king boil and pickle Wei king?'",
  "s0057": "Lu Zhonglian said: 'Certainly. I will speak of it.",
  "s0058": "In former times Jiu Hou, E Hou, Wen Wang were Zhou's three dukes.",
  "s0059": "Jiu Hou had daughter and loved her, presented to Zhou. Zhou considered her ugly, pickled Jiu Hou.",
  "s0060": "E Hou disputed strongly, argued urgently, thus dried E Hou.",
  "s0061": "Wen Wang heard, sighed deeply, thus imprisoned in Youli treasury hundred days, wished to make him die.",
  "s0062": "Why together call king with others, ultimately go to pickling and drying place?",
  "s0063": "Qi King Min went to Lu, Yi Wei Zi held whip and followed, told Lu people: 'How will you receive our lord?'",
  "s0064": "Lu people said: 'We will receive your lord with ten great sacrificial offerings.'",
  "s0065": "Yi Wei Zi said: 'How do you take ritual to receive our lord?",
  "s0066": "That our lord is Son of Heaven.",
  "s0067": "Son of Heaven inspects, feudal lords clear residence, submit key and flute, gather robes embrace knees, view meals below hall. Son of Heaven finished eating, then retire and listen to court.'",
  "s0068": "Lu people threw their flute, did not accept.",
  "s0069": "Could not enter Lu, going to Xue, borrowed road through Zou.",
  "s0070": "At this time, Zou lord died. King Min wished to enter condolence. Yi Wei Zi told Zou's orphan: 'Son of Heaven condolences, host must double coffin bier, set north face in south, then Son of Heaven faces south to condolence.'",
  "s0071": "Zou's ministers said: 'Must be like this, we will fall on swords and die.'",
  "s0072": "Firmly dared not enter Zou.",
  "s0073": "Zou and Lu's ministers, alive cannot serve and nourish, dead cannot provide funeral clothes. Yet wished to perform Son of Heaven ritual in Zou and Lu. Zou and Lu ministers did not accept.",
  "s0074": "Now Qin is ten thousand chariot state, Wei also ten thousand chariot state.",
  "s0075": "Both occupy ten thousand chariot states, each has called king name. See one battle and win, wish to follow and make emperor. This makes three Jin ministers not equal Zou and Lu lackeys.",
  "s0076": "Moreover if Qin endlessly becomes emperor, will change feudal lords' ministers.",
  "s0077": "They will seize what is unworthy and give to worthy, seize hated and give to loved.",
  "s0078": "They also will make their daughters and slandering concubines feudal lords' consorts and wives.",
  "s0079": "Dwell in Wei's palace.",
  "s0080": "How can Wei king peacefully rest?",
  "s0081": "And how can general obtain former favor?'",
  "s0082": "Thus Xin Yuan Der rose, bowed twice apologizing: 'Initially considered master common person, only today know master is world's scholar.",
  "s0083": "I request to leave, dare not again speak of making Qin emperor.'",
  "s0084": "Qin general heard, withdrew army fifty li.",
  "s0085": "Coincidentally meeting Wei prince Wu Ji seize Jin Bi army to rescue Zhao, attacked Qin army. Qin army thus led away departed.",
  "s0086": "Thus Lord Pingyuan wished to enfeoff Lu Zhonglian. Lu Zhonglian declined messengers three times, ultimately would not accept.",
  "s0087": "Lord Pingyuan then set wine. Wine flowing, rose to present, offered thousand gold as Lu Zhonglian toast.",
  "s0088": "Lu Zhonglian smiled: 'What is valued in world's scholars is for people dispel troubles release difficulties resolve disputes without taking.",
  "s0089": "If there is taking, this is merchant matters, and Zhonglian cannot bear to do.'",
  "s0090": "Thus declined Lord Pingyuan departed, lifetime never saw again.",
  "s0091": "Twenty years later, Yan general attacked took Liaocheng. Liaocheng people some slandered to Yan. Yan general feared execution, thus defended Liaocheng, dared not return.",
  "s0092": "Qi Tian Dan attacked Liaocheng over year, soldiers many died yet Liaocheng not fallen.",
  "s0093": "Lu Zhonglian thus wrote letter, tied to arrow shot into city, sent to Yan general.",
  "s0094": "Letter said:",
  "s0095": "I have heard wise do not oppose time abandon advantage, brave warriors do not die lose fame, loyal ministers do not before self after lord.",
  "s0096": "Now you commit one morning's anger, do not consider Yan king without ministers, not loyal;",
  "s0097": "Kill self lose Liaocheng, yet prestige not believed by Qi, not brave;",
  "s0098": "Merit failed fame extinguished, later generations no praise, not wise.",
  "s0099": "These three world lords not minister to, persuaders not record. Thus wise not recount again, brave warriors not fear death.",
  "s0100": "Now life death glory disgrace, noble base honor humble, this time no again arrive. Wish you carefully plan without following vulgar.'",
  "s0101": "Moreover Chu attacks Qi's Nanyang, Wei attacks Pinglu, yet Qi has no southward intention, considering losing Nanyang harm small, not equal getting Jibei advantage large, thus determined plan carefully placed.",
  "s0102": "Now Qin sends troops down, Wei dares not face east.",
  "s0103": "Qin's power established, Chu's situation endangered.",
  "s0104": "Qi abandons Nanyang, cuts right territory, determines Jibei, plan still would do it."
}
