{
  "s0402": "Sixteen years die, son Hui Gong establish.",
  "s0403": "Hui Gong twelve years, Zi Chu Zi give birth.",
  "s0404": "Thirteen years, attack Shu, take Nan Zheng.",
  "s0405": "Hui Gong die, Chu Zi establish.",
  "s0406": "Chu Zi two years, common long Gai welcome Ling Gong son Xian Gong at He west yet establish it.",
  "s0407": "Kill Chu Zi and its mother, sink at Yuan side.",
  "s0408": "Qin since go number change jun, jun minister separate chaos, therefore Jin again strong, seize Qin He west earth.",
  "s0409": "Xian Gong first year, stop follow die.",
  "s0410": "Two years, wall Yue Yang.",
  "s0411": "Four years positive month Geng Yin, Xiao Gong give birth.",
  "s0412": "Eleven years, Zhou grand historian Dan see Xian Gong said: 'Zhou old with Qin state combine yet separate, separate five hundred years again combine, combine seventeen years yet ba wang come out.'",
  "s0413": "Sixteen years, Tao winter flower.",
  "s0414": "Eighteen years, rain gold Yue Yang.",
  "s0415": "Twenty one years, with Jin battle at Shi Men, cut head sixty thousand, heavenly son congratulate with Fu Fu.",
  "s0416": "Twenty three years, with Wei Jin battle Shao Liang, capture its general Gong Sun Cuo.",
  "s0417": "Twenty four years, Xian Gong die, son Xiao Gong establish, year already twenty one years.",
  "s0418": "Xiao Gong first year, He mountain east strong state six, with Qi Wei, Chu Xuan, Wei Hui, Yan Dao, Han Ai, Zhao Cheng Hou and.",
  "s0419": "Huai Si between small state ten remain.",
  "s0420": "Chu, Wei with Qin connect border.",
  "s0421": "Wei build long wall, self Zheng Bin Luo north, have Shang Jun.",
  "s0422": "Chu self Han Zhong, south have Ba, Qian Zhong.",
  "s0423": "Zhou chamber weak, feudal lords force government, contend mutual annex.",
  "s0424": "Qin secluded at Yong state, not with China feudal lords meeting meng, Yi Di meet it.",
  "s0425": "Xiao Gong then spread favor, shake orphan widow, recruit battle scholar, bright merit reward.",
  "s0426": "Lower command state middle said: 'Previously I Miao Gong self Qi Yong between, repair virtue walk military, east pacify Jin chaos, with He become border, west ba Rong Di, broad earth thousand li, heavenly son present bo, feudal lords complete congratulate, become after world open work, very light beautiful.",
  "s0427": "Meet go Li, Zao, Jian Gong, Chu Zi not peaceful, state inner worry, not leisure outer affairs, three Jin attack seize I previous jun He west earth, feudal lords low Qin, ugly not big.",
  "s0428": "Xian Gong establish, town soothe border territory, move govern Yue Yang, and desire east attack, recover Miao Gong old earth, repair Miao Gong government command.",
  "s0429": "Sha ren think previous jun intention, often pain at heart.",
  "s0430": "Bin guest group ministers have able exit strange plan strong Qin, I and honor official, with it divide earth.'",
  "s0431": "Then exit troops east surround Xia city, west cut Rong Ma wang.",
  "s0432": "Wei Yang hear is command down, west enter Qin, because Jing Jian seek see Xiao Gong.",
  "s0433": "Two years, heavenly son present blessing.",
  "s0434": "Three years, Wei Yang tell Xiao Gong change method repair punishment, inner work plow sow, outer encourage battle die reward punish, Xiao Gong good it.",
  "s0435": "Gan Long, Du Zhi etc not so, mutual with contend it.",
  "s0436": "Finally use Yang method, hundred surnames bitter it;",
  "s0437": "Dwell three years, hundred surnames convenient it.",
  "s0438": "Then appoint Yang become left common long.",
  "s0439": "Its affairs at Shang Jun speak middle.",
  "s0440": "Seven years, with Wei Hui Wang meet Du Ping.",
  "s0441": "Eight years, with Wei battle Yuan Li, have merit.",
  "s0442": "Ten years, Wei Yang become big good make, will troops surround Wei An Yi, descend it.",
  "s0443": "Twelve years, make Xianyang, build Ji Que, Qin move capital it.",
  "s0444": "And various small xiang collect, gather become big county, county one ling, forty one county.",
  "s0445": "For field open Qian Mo.",
  "s0446": "East earth cross Luo.",
  "s0447": "Fourteen years, initial become assignment.",
  "s0448": "Nineteen years, heavenly son present bo.",
  "s0449": "Twenty years, feudal lords complete congratulate.",
  "s0450": "Qin make Gong Zi Shao Guan lead troops meet feudal lords Peng Ze, court heavenly son.",
  "s0451": "Twenty one years, Qi defeat Wei Ma Ling."
}

