{
  "s0351": "Wu Qi's service to King Dao made private interests unable to harm public, slander unable to conceal loyalty, words not accepting casual agreement, conduct not accepting casual accommodation. He did not avoid danger for easy action, practiced righteousness without fleeing difficulty. Thus he became hegemon and strengthened the state, not refusing misfortune.",
  "s0352": "Grand Master Fan Li's service to the King of Yue—the lord though in distress and humiliation, he gave complete loyalty without slackening. The lord though near extinction, he exhausted his abilities without leaving. Success achieved without arrogance, nobility and wealth without pride and laziness.",
  "s0353": "These three men were truly the utmost of righteousness, the model of loyalty.",
  "s0354": "Therefore gentlemen die for righteousness in difficulties, viewing death as returning home.",
  "s0355": "Living in disgrace is not as good as dying in glory.",
  "s0356": "Scholars surely have those who kill themselves to achieve fame. Though righteousness is there, though dying they have no regret.",
  "s0357": "How could it not be wished?'",
  "s0358": "Cai Ze said: 'Sovereign sage and minister worthy—this is the world's supreme blessing.",
  "s0359": "Lord enlightened and minister upright—this is the state's blessing.",
  "s0360": "Father kind and son filial, husband faithful and wife chaste—this is the family's blessing.",
  "s0361": "Therefore Bi Gan loyal yet could not preserve Yin, Wu Zixu wise yet could not complete Wu, Shen Sheng filial yet Jin state was in chaos.",
  "s0362": "These all had loyal ministers and filial sons, yet the state perished in disorder. Why?",
  "s0363": "No enlightened lord or worthy father to heed them. Therefore the world considers their lords and fathers humiliated and pities their ministers and sons.",
  "s0364": "Now Lord Shang, Wu Qi, Grand Master Fan Li as ministers—this was so.",
  "s0365": "Their lords were not.",
  "s0366": "Therefore the world praises the three for achieving merit but not seeing virtue. Would they admire not meeting the age and dying?",
  "s0367": "Waiting for death then able to establish loyalty and achieve fame—this makes Wei Zi insufficient in benevolence, Confucius insufficient in sageliness, Guan Zhong insufficient in greatness.",
  "s0368": "When people establish merit, do they not hope for completeness?",
  "s0369": "Body and name both complete—the highest.",
  "s0370": "Name worthy of emulation but body dies—the next.",
  "s0371": "Name in humiliation but body survives—the lowest.'",
  "s0372": "Thus Lord Ying praised it as good.",
  "s0373": "Cai Ze taking advantage of a brief leisure, said: 'Lord Shang, Wu Qi, Grand Master Fan Li as ministers exhausting loyalty and achieving merit can be wished. Hong Yao serving King Wen, Zhou Gong assisting King Cheng—were they not also loyal and sage?",
  "s0374": "Discussing as lord and minister, Lord Shang, Wu Qi, Grand Master Fan Li compared to Hong Yao and Zhou Gong—who is more desirable?'",
  "s0375": "Lord Ying said: 'Lord Shang, Wu Qi, Grand Master Fan Li are inferior.'",
  "s0376": "Cai Ze said: 'Then your lord's kindness, benevolence, employing loyalty, valuing old associates, his wisdom and worthiness sticking to worthy scholars like glue, righteousness not betraying meritorious ministers—who compares to Qin Duke Xiao, Chu King Dao, Yue King Goujian?'",
  "s0377": "Lord Ying said: 'I do not know how they compare.'",
  "s0378": "Cai Ze said: 'Now your lord's closeness to loyal ministers does not surpass Duke Xiao, King Dao, King Goujian, yet your merit and achievement in securing danger, repairing governance, ordering chaos, strengthening troops, removing troubles, breaking difficulties, expanding territory, increasing grain, enriching the state, filling the treasury, strengthening the lord, honoring the altars of soil and grain, displaying the ancestral temple, making the world dare not offend its lord, the lord's prestige covering and shaking within the seas, merit shining ten thousand li beyond, fame and glory transmitted to a thousand generations—who compares to Lord Shang, Wu Qi, Grand Master Fan Li?'",
  "s0379": "Lord Ying said: 'Inferior.'",
  "s0380": "Cai Ze said: 'Now your lord's closeness to loyal ministers and not forgetting old associates does not surpass Duke Xiao, King Dao, Goujian, yet your merit, achievement, love, trust, closeness, favor surpass Lord Shang, Wu Qi, Grand Master Fan Li. However your stipend and position noble and prosperous, private wealth exceeding the three, yet not retiring— I secretly fear your troubles will exceed the three. I consider this dangerous for you.",
  "s0381": "The saying goes: 'When the sun reaches midday it shifts, when the moon is full it wanes.'",
  "s0382": "Things flourish then decline—this is the constant principle of heaven and earth.",
  "s0383": "Advance and retreat, wax and wane, changing with the times—this is the constant way of sages.",
  "s0384": "Therefore 'When the state has the way then serve, when the state lacks the way then hide.'",
  "s0385": "The sage says: 'Flying dragon in heaven, beneficial to see great men.'",
  "s0386": "'Not righteous yet rich and noble, to me like floating clouds.'",
  "s0387": "Now your resentment has been avenged and virtue repaid, ambition has reached its limit, yet no change of plan—I secretly consider this unwise for you.",
  "s0388": "Moreover, kingfishers, swans, rhinoceros, elephants—their positions are not distant from death, yet why they die is confusion from bait.",
  "s0389": "Su Qin and Zhi Bo's wisdom was not insufficient to avoid disgrace and distance death, yet why they died was confusion from greedy profit without stopping.",
  "s0390": "Therefore sages establish ritual to moderate desires, taking from the people with measure, using them seasonally, employing with limit. Thus will not overflowing, conduct not arrogant, constantly with the way without loss. Therefore the world receives without end.",
  "s0391": "In former times Duke Huan of Qi united the feudal lords nine times, rectified the world, until the Kuiqiu assembly, had arrogant prideful ambitions, nine states rebelled.",
  "s0392": "King Fuchai of Wu had troops unmatched in the world, brave and strong bullying the feudal lords, overawing Qi and Jin, thus ultimately killed and state perished.",
  "s0393": "Xia Yu and Tai Shi Meng shouted to terrify the three armies, yet died at the hands of common men.",
  "s0394": "These all rode to utmost flourishing without returning to reason, not dwelling in humble retreat and frugal caution's peril.",
  "s0395": "Lord Shang for Qin Duke Xiao clarified laws and commands, prohibited evil at the root, honored rank must reward, guilty must punish, equalized balances, corrected measures, adjusted weights, broke up the fields and paths, to calm the people's livelihood and unify customs. Encouraged farming to benefit the soil, one house no two occupations, diligently farmed and stored grain, practiced battle formations. Therefore troops moved and territory expanded, troops rested and state enriched. Thus Qin unmatched in the world, established prestige among feudal lords, completed Qin's enterprise.",
  "s0396": "Merit already complete, yet ultimately torn apart by chariots.",
  "s0397": "Chu territory several thousand li, holding spears a million. Bai Qi led several tens of thousands to fight Chu. One battle took Ying and Yiling, burned and destroyed Jingling. Second battle south annexed Shu and Han.",
  "s0398": "Again crossed Han and Wei to attack strong Zhao, north pitted Ma Fu, slaughtered and butchered over 400,000 troops, exhausted them below Changping. Blood flowed into rivers, boiling sound like thunder. Then entered to besiege Handan, gave Qin imperial enterprise.",
  "s0399": "Chu and Zhao were the world's strong states and Qin's enemy states. From this afterward, Chu and Zhao all feared and submitted, dared not attack Qin—this was Bai Qi's momentum.",
  "s0400": "Cities he conquered over seventy, merit already complete, yet ultimately given sword to die at Du Post.",
  "s0401": "Wu Qi for Chu King Dao established law, lowered and reduced great ministers' authority and weight, dismissed the incompetent, abolished the useless, cut unnecessary officials, blocked private requests. Unified Chu customs, prohibited traveling commoners, refined farming and fighting soldiers. South took Yang Yue, north annexed Chen and Cai, broke horizontal alliances and vertical covenants, made glib persuaders unable to open their mouths. Prohibited factions to encourage the people, settled Chu's governance. Troops shook the world, prestige subdued feudal lords.",
  "s0402": "Merit already complete, yet ultimately dismembered.",
  "s0403": "Grand Master Fan Li for Yue King Goujian made deep plans and far strategies, avoided the danger of Kuaiji, turned extinction into survival, turned humiliation into glory. Cleared fields and entered cities, expanded territory and grew grain. Led scholars from four directions, concentrated upper and lower strength. Assisted Goujian's worthiness, avenged Fuchai's enmity. Ultimately captured strong Wu.",
  "s0404": "Made Yue become hegemon.",
  "s0405": "Merit already manifest and trusted. Goujian ultimately turned against and killed him.",
  "s0406": "These four men, merit complete but not departing, disaster reached this point.",
  "s0407": "This is called believing but unable to bend, going but unable to return.",
  "s0408": "Fan Li knew this, transcended and avoided the world, long became Lord Tao Zhu.",
  "s0409": "Does your lordship alone not observe the gamblers?",
  "s0410": "Some wish big stakes, some wish to divide the winnings—these are all things your lordship clearly knows.",
  "s0411": "Now your lordship is prime minister of Qin. Plans not leaving the mat, strategies not leaving the hall. Seated controlling the feudal lords, benefits extending to Sanchuan, filling Yiyang. Decided Yangchang's danger, blocked Taihang's roads. Again cut off Fan and Zhonghang's routes. Six states unable to form alliances. Thousand li plank roads, connecting Shu and Han. Made the world all fear Qin. Qin's desires obtained. Your lordship's merit extreme. This is also Qin's time to divide the winnings.",
  "s0412": "Like this and not retiring, then you are Lord Shang, Bai Qi, Wu Qi, Grand Master Fan Li.",
  "s0413": "I have heard: 'Those who examine in water see their face's appearance, those who examine in people know good and ill.'",
  "s0414": "The Book says: 'Below success, cannot remain long.'",
  "s0415": "The four men's disasters, where would your lordship be?",
  "s0416": "Why not at this time return the prime minister seal, yield to the worthy and grant it, retire to rocky dwelling and river viewing. Must have Bo Yi's purity, long remain as Lord Ying.",
  "s0417": "Generations called solitary, having Xu You and Yanling Jizi's yielding, Qiao Song's longevity—who compares to ending in disaster?",
  "s0418": "Where would your lordship be?",
  "s0419": "Unable to endure leaving yourself, doubtful unable to decide yourself, must have the four men's disasters.",
  "s0420": "The Book of Changes says: 'Lofty dragon has regret,' this speaks of ascending unable to descend, believing unable to bend, going unable to return.",
  "s0421": "I hope your lordship carefully considers!'",
  "s0422": "Lord Ying said: 'Good.",
  "s0423": "I have heard 'desiring yet not knowing sufficiency, loses what he desired.",
  "s0424": "Having yet not knowing sufficiency, loses what he had.'",
  "s0425": "Master fortunately instructs, Sui respectfully receives the command.'",
  "s0426": "Thus he invited him in to sit, made him upper guest.",
  "s0427": "Several days later, entering court, spoke to Qin King Zhao: 'Recently guests coming from east of the mountains named Cai Ze. This man is an eloquent scholar, clear on the affairs of the Three Kings, the enterprises of the Five Hegemons, the changes of common customs. Sufficient to entrust Qin's governance.",
  "s0428": "I have seen many people, none match. I am inferior.",
  "s0429": "I dare report this.'",
  "s0420": "Qin King Zhao summoned and saw him, spoke with him, greatly pleased, appointed as Guest Minister.",
  "s0431": "Lord Ying thus claimed illness and requested to return the prime minister seal.",
  "s0432": "King Zhao strongly urged Lord Ying to rise, Lord Ying thus feigned illness stubbornly.",
  "s0433": "Fan Sui resigned as prime minister. King Zhao newly pleased with Cai Ze's plans, thus appointed him Qin prime minister, east took Zhou territory.",
  "s0434": "Cai Ze prime minister of Qin several months. People slandered him, fearing execution, thus claimed illness and returned the prime minister seal, titled Lord Gangcheng.",
  "s0435": "Resided in Qin over ten years, served King Zhao, King Xiaowen, King Zhuangxiang.",
  "s0436": "Ultimately served First Emperor, as Qin envoy to Yan, three years and Yan sent Crown Prince Dan as hostage to Qin.",
  "s0437": "The Grand Historian says: Han Zi says 'Long sleeves good for dancing, much money good for trading,' truly this saying!",
  "s0438": "Fan Sui and Cai Ze the world calls all-purpose debaters, yet traveled persuading feudal lords until white-haired without meeting success. Not strategy clumsy, but what they persuaded had little strength.",
  "s0439": "When the two sojourners entered Qin, successively took minister and prime minister positions, hanging merit on the world, certainly the strong and weak situation was different.",
  "s0440": "Yet scholars also have chance meetings. Worthy ones many like these two, not achieving full intent—how can it all be told!",
  "s0441": "Yet these two not in dire straits how could they be spurred?"
}

