{
  "s0001": "The Grand Historian said: Laws and commands guide the people, punishments prohibit wickedness.",
  "s0002": "If culture and martial force are not complete, good people will fear and cultivate themselves, officials have never been disorderly.",
  "s0003": "Devoted to duty and following principle, one can also govern, why must it be severe?",
  "s0004": "Sun Shu Ao was a Chu recluse.",
  "s0005": "Yu Qiu Xiang recommended him to Chu Zhuang Wang to replace himself.",
  "s0006": "Three months as Chu prime minister, he implemented teachings to guide the people, superiors and inferiors harmonized, customs flourished beautifully, government was relaxed yet prohibitions held, officials had no wickedness, thieves did not arise.",
  "s0007": "In autumn and winter he urged people to gather in mountains, in spring and summer by water, each getting what was convenient, people all delighted in their livelihood.",
  "s0008": "Zhuang Wang thought the currency was light, changed small to large, people were inconvenienced, all abandoned their occupations.",
  "s0009": "The market official spoke to the prime minister: 'Market is chaotic, people cannot settle in their places, traders cannot establish their businesses.'",
  "s0010": "Prime minister said: 'How long has this been?'",
  "s0011": "Market official said: 'About three months.'",
  "s0012": "Prime minister said: 'Stop, I will now order it restored.'",
  "s0013": "After five days, at court, prime minister spoke to the king: 'Previously changing currency because it was light.",
  "s0014": "Now market official comes saying 'market chaotic, people cannot settle in places, traders cannot establish businesses'.",
  "s0015": "I request to then order restoration as before.'",
  "s0016": "King allowed it, issued order three days and market restored as before.",
  "s0017": "Chu people custom liked low chariots, king thought low chariots inconvenienced horses, wished to issue order to raise them.",
  "s0018": "Prime minister said: 'Orders issued frequently, people do not know what to follow, cannot.",
  "s0019": "If king must raise chariots, I request to teach neighborhoods to raise their axles.",
  "s0020": "Riders are all gentlemen, gentlemen cannot frequently alight from chariots.'"
}
