{
  "s0001": "Bai Qi was a native of Mei.",
  "s0002": "He was skilled in warfare and served King Zhao of Qin.",
  "s0003": "In the thirteenth year of King Zhao's reign, Bai Qi became left senior minister and led troops to attack Han's Xincheng.",
  "s0004": "That year, the Marquis of Rang served as prime minister of Qin and appointed Ren Bi as governor of Hanzhong.",
  "s0005": "The next year, Bai Qi became left minister of the interior and attacked Han and Wei at Yique. He beheaded 240,000 men, captured their general Gongsun Xi, and took five cities.",
  "s0006": "Qi was promoted to state defender.",
  "s0007": "He crossed the Yellow River and took Han's Anyi and eastward to Ganhe.",
  "s0008": "The next year, Bai Qi became grand master craftsman.",
  "s0009": "He attacked Wei, conquered it, and took sixty-one cities of varying sizes.",
  "s0010": "The next year, Qi and guest minister Cuo attacked Yuan City and conquered it.",
  "s0011": "Five years later, Bai Qi attacked Zhao and conquered Guanglang City.",
  "s0012": "Seven years later, Bai Qi attacked Chu and conquered Yan and Deng—five cities in total.",
  "s0013": "The next year, he attacked Chu again, conquered Ying, burned Yiling, and advanced east to Jingling.",
  "s0014": "The King of Chu fled Ying and moved east to Chen.",
  "s0015": "Qin made Ying into Nanhun Commandery.",
  "s0016": "Bai Qi was promoted to Lord Wu'an.",
  "s0017": "Lord Wu'an then conquered Chu and established the commanderies of Wu and Qianzhong.",
  "s0018": "In the thirty-fourth year of King Zhao, Bai Qi attacked Wei, conquered Huayang, routed Mang Mao, captured three Jin generals, and beheaded 130,000 men.",
  "s0019": "He fought with Zhao general Jia Yan and drowned 20,000 of his troops in the river.",
  "s0020": "In the forty-third year of King Zhao, Bai Qi attacked Han's Xingcheng, conquered five cities, and beheaded 50,000 men.",
  "s0021": "In the forty-fourth year, Bai Qi attacked the Nanyang-Taihang road and cut it off.",
  "s0022": "In the forty-fifth year, he attacked Han's Yewang.",
  "s0023": "Yewang surrendered to Qin, cutting off the Shangdang road.",
  "s0024": "Its defender Feng Ting consulted with the people, saying: 'The Zheng road is already cut. Han can no longer protect us as subjects.",
  "s0025": "Qin troops advance daily. Han cannot respond. Better to give Shangdang to Zhao.",
  "s0026": "If Zhao accepts us, Qin will be angry and must attack Zhao.",
  "s0027": "If Zhao suffers attack, it will certainly draw close to Han.",
  "s0028": "If Han and Zhao unite, they can withstand Qin.'",
  "s0029": "So they sent messengers to report to Zhao.",
  "s0030": "King Xiaocheng of Zhao consulted with Lord Pingyang and Lord Pingyuan.",
  "s0031": "Lord Pingyang said: 'Better not to accept it.",
  "s0032": "Accepting it brings disaster greater than the benefit gained.'",
  "s0033": "Lord Pingyuan said: 'To gain a commandery for no reason—accepting it is advantageous.'",
  "s0034": "Zhao accepted it and enfeoffed Feng Ting as Lord Huayang.",
  "s0035": "In the forty-sixth year, Qin attacked Han's Gouzhi and Lin and conquered them.",
  "s0036": "In the forty-seventh year, Qin sent left senior minister Wang He to attack Han and take Shangdang.",
  "s0037": "The people of Shangdang fled to Zhao.",
  "s0038": "Zhao stationed troops at Changping to control the Shangdang people.",
  "s0039": "In the fourth month, He attacked Zhao.",
  "s0040": "Zhao sent Lian Po to command the army.",
  "s0041": "Zhao troops violated Qin's outposts. Qin outposts beheaded Zhao assistant general Jia.",
  "s0042": "In the sixth month, they trapped Zhao troops and took two fortifications and four commandants.",
  "s0043": "In the seventh month, Zhao troops built ramparts and defended them.",
  "s0044": "Qin attacked their ramparts again, took two commandants, defeated their battle formation, and seized the west ramparts and walls.",
  "s0045": "Lian Po held firm to his defenses awaiting Qin. Qin challenged them many times, but Zhao troops did not come out.",
  "s0046": "The King of Zhao repeatedly rebuked him for it.",
  "s0047": "Meanwhile, Qin's prime minister Lord Ying sent agents with a thousand jin to Zhao to sow dissension, saying: 'What Qin fears most is only that Ma Fuzi Zhao Kuo will command the army. Lian Po is easy to deal with—he will soon surrender.'",
  "s0048": "The King of Zhao was already angry that Lian Po's army had suffered many losses and been defeated several times. Moreover, he heard the rumors of Qin's dissension. So he sent Zhao Kuo to replace Lian Po and attack Qin.",
  "s0049": "When Qin heard that Ma Fuzi was commanding, they secretly sent Lord Wu'an Bai Qi to be supreme general.",
  "s0050": "Wang He became assistant general, and they ordered that anyone in the army who dared leak that Lord Wu'an was commanding would be executed."
}

