{
  "s0001": "Weizi Kai was the eldest son of Emperor Yi of Yin and the half-brother of Emperor Zhou.",
  "s0002": "When Zhou ascended the throne, he was unenlightened and licentious, disrupting governance. Weizi repeatedly remonstrated, but Zhou would not listen.",
  "s0003": "When Zu Yi, seeing that Zhou's Western Earl Chang was cultivating virtue and had destroyed the state of Li, feared disaster was coming, and warned Zhou about it.",
  "s0004": "Zhou said: 'My life—does it not have its destiny in heaven?",
  "s0005": "What can anyone do about it!'",
  "s0006": "Thereupon Weizi realized Zhou could never be remonstrated with. He wanted to die for him, but when he was about to leave, he could not decide, so he asked the Grand Tutor and Junior Tutor: 'Yin has no orderly governance, does not govern the four quarters.",
  "s0007": "My ancestors succeeded in orderly rule above, but Zhou wallows in wine, employs women, disrupting and destroying Tang's virtue below.",
  "s0008": "Yin has become great and small, fond of reckless thievery, villainy, and wickedness. The ministers and officials all violate the standards, all have crimes and guilt, yet there is no restraint. The little people all rise up together, becoming enemies to each other.",
  "s0009": "Now Yin will surely perish!",
  "s0010": "Like crossing water without ford or shore.",
  "s0011": "Yin will perish, extending even to today.'",
  "s0012": "He said: 'Grand Tutor, Junior Tutor, should I go out and leave?",
  "s0013": "Should my family preserve itself in the midst of ruin?",
  "s0014": "Now you without reason tell me these dizzying things—what should I do?'",
  "s0015": "The Grand Tutor then said: 'Prince, heaven heavily sends calamity to destroy the Yin state, yet you do not fear fear, do not employ the elderly worthy.",
  "s0016": "Now the Yin people are vulgar and licentious in their sacrifices to the spirits.",
  "s0017": "If I can truly obtain orderly rule of the state, even if I die the state will be orderly—I would not regret it.",
  "s0018": "For dying, if I ultimately cannot achieve orderly rule, it would be better to leave.'",
  "s0019": "He then left.",
  "s0020": "Jizi was Zhou's relative.",
  "s0021": "When Zhou first made ivory chopsticks, Jizi sighed and said: 'If he makes ivory chopsticks, he will surely make jade cups;",
  "s0022": "for cups, he will surely think of distant precious strange things to use them.",
  "s0023": "The gradual decline of carriages, horses, and palaces begins from this—it cannot be reversed.'",
  "s0024": "Zhou became licentious and dissipated, Jizi remonstrated, but he would not listen.",
  "s0025": "Someone said: 'You can leave now.'",
  "s0026": "Jizi said: 'As a subject, if I remonstrate and it is not heard and I leave, this makes manifest the lord's evil and makes myself pleasing to the people. I cannot bear to do this.'",
  "s0027": "He then disheveled his hair, feigned madness, and became a slave.",
  "s0028": "He hid away and strummed his zither to express his sorrow, therefore it is transmitted as 'Jizi's Melody.'",
  "s0029": "Prince Bigan was also Zhou's relative.",
  "s0030": "Seeing that Jizi remonstrated but was not heard and became a slave, he said: 'If the lord has transgressions and I do not contend with death, then what crime have the hundred surnames committed!'",
  "s0031": "He then spoke directly remonstrating with Zhou.",
  "s0032": "Zhou was angry and said: 'I have heard that the sage's heart has seven apertures—is this true?'",
  "s0033": "He then killed Prince Bigan and cut open his chest to examine his heart.",
  "s0034": "Weizi said: 'Father and son have flesh and blood relations, while lord and subject are connected by righteousness.",
  "s0035": "Therefore if the father has transgressions, the son remonstrates three times and it is not heard, then he follows with wailing;",
  "s0036": "if a subject remonstrates three times and it is not heard, then by righteousness he can leave.'",
  "s0037": "Thereupon the Grand Tutor and Junior Tutor advised Weizi to leave, and he then departed.",
  "s0038": "When King Wu of Zhou attacked Zhou and conquered Yin, Weizi carried his sacrificial vessels and came to the army gate, bared his flesh and bound his face, leading a sheep on the left, grasping thatch on the right, kneeling and advancing to submit.",
  "s0039": "Thereupon King Wu released Weizi and restored his position as before.",
  "s0040": "King Wu enfeoffed Zhou's son Wu Geng Lu Fu to continue the Yin sacrifices, and had Guan Shu and Cai Shu as assistants to oversee him.",
  "s0041": "After King Wu conquered Yin, he consulted Jizi.",
  "s0042": "King Wu said: 'Ah!",
  "s0043": "Heaven secretly determines the people below, harmonizes their dwellings. I do not know the constant order of their sequence.'",
  "s0044": "Jizi replied: 'In former times Gun blocked the great flood, confused and disturbed the five phases. The emperor then was greatly angered, did not follow the great plan nine divisions, the constant order was disordered.",
  "s0045": "Gun was then executed, Yu then succeeded and rose.",
  "s0046": "Heaven then bestowed on Yu the great plan nine divisions, the constant order of sequence.",
  "s0047": "'First, the five phases;",
  "s0048": "second, the five affairs;",
  "s0049": "third, the eight policies;",
  "s0050": "fourth, the five records;'",
  "s0051": "fifth, the Royal Ultimate;",
  "s0052": "sixth, the Three Virtues;",
  "s0053": "seventh, Examining Doubts;",
  "s0054": "eighth, the Various Portents;",
  "s0055": "ninth, applying the five blessings, fearing the six extremes.\"",
  "s0056": "\"The five phases: first, water; second, fire; third, wood; fourth, metal; fifth, earth.",
  "s0057": "Water said moist below, fire said flaming above, wood said curving straight, metal said following change, earth said tilling sowing.",
  "s0058": "Moist below produces salty, flaming above produces bitter, curving straight produces sour, following change produces acrid, tilling sowing produces sweet.",
  "s0059": "\"The five affairs: first, appearance; second, speech; third, seeing; fourth, hearing; fifth, thinking.",
  "s0060": "Appearance said respectful, speech said compliant, seeing said clear, hearing said acute, thinking said profound.",
  "s0061": "Respectful produces solemnity, compliant produces order, clear produces wisdom, acute produces planning, profound produces sageliness.",
  "s0062": "\"The eight policies: first, food; second, goods; third, sacrifices; fourth, Minister of Works; fifth, Minister of the Masses; sixth, Minister of Justice; seventh, guests; eighth, military.",
  "s0063": "\"The five records: first, year; second, month; third, day; fourth, stars and constellations; fifth, calendar numbers.",
  "s0064": "\"The Royal Ultimate: The king establishes that he has the ultimate, gathers the five blessings in season, uses them to bestow on his subjects, only then his subjects toward your ultimate, bestow on you preserving the ultimate.",
  "s0065": "All his subjects, let there be no licentious companions, people let there be no comparing virtue, only the king makes the ultimate.",
  "s0066": "All his subjects have plans, have actions, have constancy—you then think of them.",
  "s0067": "Not harmonious with the ultimate, not departing from blame—the king then accepts it.",
  "s0068": "Peaceful and colored, saying 'I approve of virtue'—you then bestow blessing on them.",
  "s0069": "At that time people then this is the king's ultimate.",
  "s0070": "Do not bully the orphaned and fear the eminent.",
  "s0071": "People who have ability and action, make them display their conduct, and the state will flourish.",
  "s0072": "All correct people, having enriched square grain.",
  "s0073": "You cannot make them have good in your family—at that time people then their crime.",
  "s0074": "At their no good, you though bestow blessing on them, its make for you blame.",
  "s0075": "No partial no prejudiced, follow the king's righteousness.",
  "s0076": "No make favor, follow the king's way.",
  "s0077": "No make evil, follow the king's path.",
  "s0078": "No partial no partisan, king's way broad broad.",
  "s0079": "No partisan no partial, king's way level level.",
  "s0080": "No contrary no slanted, king's way straight.",
  "s0081": "Gather their having ultimate, return their having ultimate.",
  "s0082": "Said king's ultimate transmitted words, is peaceful is instructed, toward emperor its compliant.",
  "s0083": "All his subjects, ultimate's transmitted words, is compliant is acted, to approach the Son of Heaven's light.",
  "s0084": "Said Son of Heaven makes people's parents, to be the world's king.",
  "s0085": "\"The Three Virtues: first, upright; second, overcoming with strength; third, overcoming with gentleness.",
  "s0086": "Peace health upright, strong not befriends overcoming with strength, inner befriends overcoming with gentleness, deep gradual overcoming with strength, high bright overcoming with gentleness.",
  "s0087": "Only the ruler makes blessing, only the ruler makes authority, only the ruler jade food.",
  "s0088": "Subjects have no making blessing making authority jade food.",
  "s0089": "Subjects have making blessing making authority jade food, its harm to your family, ominous to your state, people use slanted prejudiced, subjects use presumptuous perverse.",
  "s0090": "\"Examining Doubts: Choose establish divination and milfoil people.",
  "s0091": "Then command divination and milfoil, said rain, said aid, said tears, said mist, said overcome, said divination, said regret, altogether seven.",
  "s0092": "Divine five, occupy using two, derive calamity.",
  "s0093": "Establish timely people as divination and milfoil, three occupy then follow two people's words.",
  "s0094": "You then have great doubt, consult your heart, consult ministers and knights, consult the common people, consult divination and milfoil.",
  "s0095": "You then follow, turtle follows, milfoil follows, ministers and knights follow, common people follow—this is called great agreement, and person its peaceful strong, and descendants their meet good.",
  "s0096": "You then follow, turtle follows, milfoil follows, ministers and knights contrary, common people contrary, auspicious.",
  "s0097": "Ministers and knights follow, turtle follows, milfoil follows, you then contrary, common people contrary, auspicious.",
  "s0098": "Common people follow, turtle follows, milfoil follows, you then contrary, ministers and knights contrary, auspicious.",
  "s0099": "You then follow, turtle follows, milfoil contrary, ministers and knights contrary, common people contrary, make inner auspicious, make outer ominous.",
  "s0100": "Turtle milfoil together contrary to people, use quiet auspicious, use action ominous.\"",
  "s0101": "\"Various Portents: said rain, said sunshine, said warm, said cold, said wind, said season.",
  "s0102": "Five come prepared, each in their sequence, all grasses lush abundant.",
  "s0103": "One extreme prepared, ominous.",
  "s0104": "One extreme absent, ominous.",
  "s0105": "Said auspicious portents: said solemn, timely rain if; said orderly, timely sunshine if;",
  "s0106": "said wise, timely warm if;",
  "s0107": "said planning, timely cold if;",
  "s0108": "said sagely, timely wind if.",
  "s0109": "Said blame portents: said mad, constant rain if;",
  "s0110": "said presumptuous, constant sunshine if;",
  "s0111": "said lax, constant warm if;",
  "s0112": "said urgent, constant cold if;",
  "s0113": "said foggy, constant wind if.",
  "s0114": "King's errors for year, ministers and knights for month, officers for day.",
  "s0115": "Year month day season no change, hundred grains use completion, governance use bright, strong people use manifest, family use peaceful health.",
  "s0116": "Day month year season already changed, hundred grains use incompletion, governance use dark unclear, strong people use faint, family use unpeaceful.",
  "s0117": "Common people like stars, stars have good wind, stars have good rain.",
  "s0118": "Sun moon's movement, has winter has summer.",
  "s0119": "Moon's following stars, then with wind rain.",
  "s0120": "\"Five blessings: first, longevity; second, wealth; third, health peace; fourth, doing good virtue; fifth, good end of life.",
  "s0121": "Six extremes: first, ominous short breaking; second, illness; third, worry; fourth, poverty; fifth, hate; sixth, weakness.\"",
  "s0122": "Thereupon King Wu enfeoffed Jizi in Chaoxian without making him a subject.",
  "s0123": "Afterward Jizi went to court Zhou, passed the former Yin ruins, was saddened by the palace chambers destroyed, growing wheat and millet. Jizi was pained, wanted to cry but could not, wanted to weep for being near women, so made the Mai Xiu poem to sing it.",
  "s0124": "His poem said: \"Wheat sprouts gradually ah, millet and wheat oily oily.",
  "s0125": "That crafty boy ah, not be good with me ah!\"",
  "s0126": "The so-called crafty boy was Zhou.",
  "s0127": "Yin people hearing it, all shed tears.",
  "s0128": "King Wu passed away, King Cheng was young, Duke of Zhou Dan administered government and managed the state.",
  "s0129": "Guan and Cai doubted it, so with Wu Geng made rebellion, wanted to attack King Cheng and Duke of Zhou.",
  "s0130": "Duke of Zhou having received King Cheng's command to execute Wu Geng, kill Guan Shu, banish Cai Shu, then commanded Weizi Kai to replace Yin's successor, uphold their ancestral sacrifices, made Weizi's command to declare it, established state at Song.",
  "s0131": "Weizi originally was benevolent and worthy, replaced Wu Geng, so Yin's remaining people greatly cherished and loved him.",
  "s0132": "In the seventeenth year of Xi Gong, King Li of Zhou fled to Zhi.",
  "s0133": "Twenty-eighth year, Xi Gong died, son Hui Gong Xun ascended.",
  "s0134": "Fourth year of Hui Gong, King Xuan of Zhou ascended the throne.",
  "s0135": "Thirtieth year, Hui Gong died, son Ai Gong ascended.",
  "s0136": "First year Ai Gong died, son Dai Gong ascended.",
  "s0137": "Twenty-ninth year of Dai Gong, King You of Zhou was killed by the Quanrong, Qin first ranked as feudal lord.",
  "s0138": "Thirty-fourth year, Dai Gong died, son Wu Gong Si Kong ascended.",
  "s0139": "Wu Gong gave birth to daughter who became wife of Duke Hui of Lu, gave birth to Duke Huan of Lu.",
  "s0140": "Eighteenth year, Wu Gong died, son Xuan Gong Li ascended.",
  "s0141": "Xuan Gong had crown prince Yu Yi.",
  "s0142": "Nineteenth year, Xuan Gong was ill, yielded to his younger brother He, saying: \"Father dies son succeeds, elder brother dies younger brother reaches, world's universal righteousness.",
  "s0143": "I will establish He.\"",
  "s0144": "He also three times declined and accepted it.",
  "s0145": "Xuan Gong died, younger brother He ascended, this was Mu Gong.",
  "s0146": "Ninth year of Mu Gong, was ill, summoned Grand Marshal Kong Fu and said: \"Former lord Xuan Gong abandoned crown prince Yu Yi and established me, I dare not forget.",
  "s0147": "When I die, must establish Yu Yi.\"",
  "s0148": "Kong Fu said: \"All ministers all wish to establish Duke Feng.\"",
  "s0149": "Mu Gong said: \"Do not establish Feng, I cannot betray Xuan Gong.\"",
  "s0150": "Thereupon Mu Gong made Feng go out and reside in Zheng.",
  "s0151": "Eighth month geng chen, Mu Gong died, elder brother Xuan Gong's son Yu Yi ascended, this was Shang Gong.",
  "s0152": "The gentleman hearing it said: \"Song Xuan Gong can be called knowing people, established his younger brother to complete righteousness, yet ultimately his son again enjoyed it.",
  "s0153": "First year of Zhuang Gong, Hua Du was chancellor.",
  "s0154": "Ninth year, seized Zheng's Ji Zhong, coerced to establish Tu as Zheng ruler.",
  "s0155": "Ji Zhong agreed, ultimately established Tu.",
  "s0156": "Nineteenth year, Zhuang Gong died, son Min Gong Jie ascended.",
  "s0157": "Tenth year summer, Song attacked Lu, battled at Cheng Qiu, Lu captured alive Song Nan Gong Wan.",
  "s0158": "Song people requested Wan, Wan returned to Song.",
  "s0159": "Eleventh year autumn, Min Gong with Nan Gong Wan hunted, because of board game disputed walking, Min Gong angered, insulted him, said: \"Initially I respected you;",
  "s0160": "now you are Lu's captive.\"",
  "s0161": "Wan was strong, resented these words, thereupon with board killed Min Gong at Meng Ze.",
  "s0162": "Knight Qiu Mu heard it, with troops went to the duke's gate.",
  "s0163": "Wan wrestled Mu, Mu's teeth bit the gate door died.",
  "s0164": "Thereupon killed Grand Steward Hua Du, then established Duke You as ruler.",
  "s0165": "Various dukes fled to Xiao, Duke Yu Yue fled to Bo.",
  "s0166": "Wan's younger brother Nan Gong Niu led troops surrounded Bo.",
  "s0167": "Winter, Xiao and Song's various dukes together attacked and killed Nan Gong Niu, assassinated Song's new ruler You and established Min Gong's younger brother Yu Yue, this was Huan Gong.",
  "s0168": "Song Wan fled to Chen.",
  "s0169": "Song people requested with bribes Chen.",
  "s0170": "Chen people made woman give him strong wine to drink, wrapped in leather, returned to Song.",
  "s0171": "Song people made Wan into paste.",
  "s0172": "Seventh year of Xiang Gong, Song territory shooting star like rain, with rain came down;",
  "s0173": "six pheasants retreated flying, wind fierce.",
  "s0174": "Eighth year, Duke Huan of Qi died, Song wished to hold alliance meeting.",
  "s0175": "Twelfth year spring, Duke Xiang of Song made the Lu Shang alliance, to seek feudal lords from Chu, Chu people agreed.",
  "s0176": "Duke Mu Yi admonished saying: \"Small state contending alliance, disaster.\"",
  "s0177": "Did not listen.",
  "s0178": "Autumn, feudal lords met Duke Xiang alliance at Yu.",
  "s0179": "Mu Yi said: \"Disaster perhaps here?",
  "s0180": "Lord desires too much, how can endure!\"",
  "s0181": "Thereupon Chu seized Duke Xiang of Song to attack Song.",
  "s0182": "Winter, assembled at Bo, to release Duke Xiang.",
  "s0183": "Zi Yu said: \"Disaster still not ended.\"",
  "s0184": "Thirteenth year summer, Song attacked Zheng.",
  "s0185": "Zi Yu said: \"Disaster here.\"",
  "s0186": "Autumn, Chu attacked Song to save Zheng.",
  "s0187": "Duke Xiang would battle, Zi Yu admonished saying: \"Heaven abandoned Shang long ago, cannot.\"",
  "s0188": "Winter, eleventh month, Duke Xiang with King Cheng of Chu battled at Hong.",
  "s0189": "Chu people not yet crossed, Mu Yi said: \"They many we few, when they not yet crossed attack them.\"",
  "s0190": "Duke did not listen.",
  "s0191": "Already crossed not yet arrayed, again said: \"Can attack.\"",
  "s0192": "Duke said: \"Wait until they arrayed.\"",
  "s0193": "Array completed, Song people attacked them.",
  "s0194": "Song army greatly defeated, Duke Xiang wounded thigh.",
  "s0195": "State people all resented duke.",
  "s0196": "Duke said: \"Gentleman does not distress people in straits, does not drum unformed ranks.\"",
  "s0197": "Zi Yu said: \"War with victory as merit, what constant words!",
  "s0198": "Must like duke says, then serve as slave, moreover what battle for?\"",
  "s0199": "King Cheng of Chu already saved Zheng, Zheng feasted him;",
  "s0200": "Departed and took Zheng two ladies to return.",
  "s0201": "Shu Zhan said: \"Cheng Wang without ritual, will he not perish?",
  "s0202": "For ritual ended in no distinction, have means to know he will not succeed hegemony.\"",
  "s0203": "This year, Jin duke Chong'er passed Song, Duke Xiang with injury from Chu, wished to obtain Jin aid, thickly gifted Chong'er with twenty chariot horses.",
  "s0204": "Fourteenth year summer, Duke Xiang injured at Hong and ultimately died, son Cheng Gong Wang Chen ascended.",
  "s0205": "Seventeenth year, Cheng Gong died.",
  "s0206": "Cheng Gong's younger brother Yu killed the crown prince and Grand Marshal Gong Sun Gu and established himself as ruler.",
  "s0207": "Song people together killed ruler Yu and established Cheng Gong's young son Chu Jiu, this was Zhao Gong.",
  "s0208": "Ninth year, Zhao Gong without way, state people not attached.",
  "s0209": "Zhao Gong's younger brother Bao Ge worthy and approached scholars.",
  "s0210": "Previously, Xiang Gong's wife wished to communicate with Duke Bao, could not, then helped him distribute to the state, through knight Hua Yuan as right teacher.",
  "s0211": "Zhao Gong went hunting, wife Wang Ji sent Wei Bo to attack and kill Zhao Gong Chu Jiu.",
  "s0212": "Younger brother Bao Ge ascended, this was Wen Gong.",
  "s0213": "Fourth year spring, Chu commanded Zheng attack Song.",
  "s0214": "Song sent Hua Yuan to lead, Zheng defeated Song, imprisoned Hua Yuan.",
  "s0215": "Hua Yuan's about to battle, killed sheep to feed soldiers, his charioteer missed the sheep soup, therefore resented, galloped into Zheng army, therefore Song army defeated, got imprisoned Hua Yuan.",
  "s0216": "Song with war chariots hundred, fine horses four hundred redeemed Hua Yuan.",
  "s0217": "Not yet completely entered, Hua Yuan escaped returned to Song.",
  "s0218": "Fourteenth year, King Zhuang of Chu surrounded Zheng.",
  "s0219": "Duke of Zheng submitted to Chu, Chu again released him.",
  "s0220": "Sixteenth year, Chu envoy passed Song, Song had previous enmity, seized Chu envoy.",
  "s0221": "Ninth month, King Zhuang of Chu surrounded Song.",
  "s0222": "Seventeenth year, Chu with surrounding Song five months not resolved, Song city urgent, no food, Hua Yuan then at night privately met Chu general Zi Fan.",
  "s0223": "Zi Fan told Zhuang Wang.",
  "s0224": "Wang asked: \"City within what like?\"",
  "s0225": "Said: \"Split bones and cook, exchange children and eat.\"",
  "s0226": "Zhuang Wang said: \"Truly these words!",
  "s0227": "My army also has two days rations.\"",
  "s0228": "Because of sincerity, thereupon withdrew troops departed.",
  "s0229": "Twenty-second year, Wen Gong died, son Gong Gong Xia ascended.",
  "s0230": "Began thick burial.",
  "s0231": "Gentleman criticized Hua Yuan not subject-like.",
  "s0232": "Tenth year of Gong Gong, Hua Yuan befriended Chu general Zi Chong, also befriended Jin general Luan Shu, both allied Jin Chu.",
  "s0233": "Thirteenth year, Gong Gong died.",
  "s0234": "Hua Yuan as right teacher, Yu Shi as left teacher.",
  "s0235": "Marshal Tang Shan attacked killed crown prince Fei, wished to kill Hua Yuan, Hua Yuan fled Jin, Yu Shi stopped him, to river then returned, executed Tang Shan.",
  "s0236": "Then established Gong Gong's young son Cheng, this was Ping Gong.",
  "s0237": "Third year of Ping Gong, King Gong of Chu took Song's Pengcheng, to enfeoff left teacher Yu Shi.",
  "s0238": "Fourth year, feudal lords together executed Yu Shi, returned Pengcheng to Song.",
  "s0239": "Thirty-fifth year, Chu duke Wei assassinated his lord self-established, became Ling Wang.",
  "s0240": "Forty-fourth year, Ping Gong died, son Yuan Gong Zuo ascended.",
  "s0241": "Third year of Yuan Gong, Chu duke Qi Ji assassinated Ling Wang, self-established as Ping Wang.",
  "s0242": "Eighth year, Song fire.",
  "s0243": "Tenth year, Yuan Gong without faith, deceitfully killed various dukes, knight Hua, Xiang clans made rebellion.",
  "s0244": "Chu Ping Wang crown prince Jian came fleeing, saw various Hua clans attacking each other in chaos, Jian departed to Zheng.",
  "s0245": "Fifteenth year, Yuan Gong for Lu Zhao Gong avoided Ji clan resided outside, sought entry to Lu for him, en route died, son Jing Gong Tou Man ascended.",
  "s0246": "Sixteenth year of Jing Gong, Lu Yang Hu came fleeing, afterward again departed.",
  "s0247": "Twenty-fifth year, Confucius passed Song, Song marshal Huan Kui hated him, wished to kill Confucius, Confucius disguised departed.",
  "s0248": "Thirtieth year, Cao betrayed Song, also betrayed Jin, Song attacked Cao, Jin not aided, thereupon extinguished Cao possessed it.",
  "s0249": "Thirty-sixth year, Qi Tian Chang assassinated Jian Gong.",
  "s0250": "Thirty-seventh year, King Hui of Chu extinguished Chen.",
  "s0251": "Mars guarded heart.",
  "s0252": "Heart is Song's constellation field.",
  "s0253": "Jing Gong worried it.",
  "s0254": "Star officer Zi Wei said: \"Can shift to chancellor.\"",
  "s0255": "Jing Gong said: \"Chancellor is my limbs.\"",
  "s0256": "Said: \"Can shift to people.\"",
  "s0257": "Jing Gong said: \"Ruler awaits people.\"",
  "s0258": "Said: \"Can shift to year.\"",
  "s0259": "Jing Gong said: \"Year famine people distressed, I for whom be ruler!\"",
  "s0260": "Zi Wei said: \"Heaven high listens low.",
  "s0261": "Lord has ruler people's words three, Mars should have movement.\"",
  "s0262": "Thereupon observed it, indeed moved three degrees.",
  "s0263": "Sixty-fourth year, Jing Gong died.",
  "s0264": "Song duke Te attacked killed crown prince self-established, this was Zhao Gong.",
  "s0265": "Zhao Gong was Yuan Gong's great concubine grandson.",
  "s0266": "Zhao Gong father Gong Sun Jiu, Jiu father duke Chou Qin, Chou Qin was Yuan Gong young son.",
  "s0267": "Jing Gong killed Zhao Gong father Jiu, therefore Zhao Gong resented killed crown prince self-established.",
  "s0268": "Forty-seventh year Zhao Gong died, son Dao Gong Gou You ascended.",
  "s0269": "Eighth year Dao Gong died, son Xiu Gong Tian ascended.",
  "s0270": "Twenty-third year Xiu Gong Tian died, son Bi Gong Bi Bing ascended.",
  "s0271": "Third year Bi Gong died, son Ti Cheng ascended.",
  "s0272": "Forty-first year Ti Cheng, Ti Cheng younger brother Yan attacked Ti Cheng, Ti Cheng defeated fled Qi, Yan self-established as Song ruler.",
  "s0273": "Ruler Yan eleventh year, self-established as king.",
  "s0274": "East defeated Qi, took five cities;",
  "s0275": "South defeated Chu, took three hundred li land;",
  "s0276": "West defeated Wei army, then with Qi, Wei as enemy states.",
  "s0277": "Filled blood with leather bag, hung and shot it, named \"shoot heaven\".",
  "s0278": "Licentious in wine and women.",
  "s0279": "Ministers admonishing then shot them.",
  "s0280": "Thereupon feudal lords all said \"cruel Song\".",
  "s0281": "\"Song will again do as Zhou did, cannot not execute\".",
  "s0282": "Informed Qi attack Song.",
  "s0283": "Wang Yan established forty-seventh year, Qi Min Wang with Wei, Chu attacked Song, killed Wang Yan, thereupon extinguished Song and divided its land three ways.",
  "s0284": "The Grand Historian says: Confucius said \"Weizi departed, Jizi became slave, Bigan admonished and died, Yin had three benevolent ones\".",
  "s0285": "Spring and Autumn criticizes Song's chaos from Xuan Gong discarding crown prince establishing younger brother, state with unpeaceful ten generations.",
  "s0286": "Xiang Gong's time, practiced benevolence righteousness, wished to be alliance leader.",
  "s0287": "His knight Zheng Kao Fu praised it, therefore traced way of Qi, Tang, Gao Zong, Yin's rise reason, made Shang Song.",
  "s0288": "Xiang Gong already defeated at Hong, and gentleman some considered it excessive, injured China lacking ritual righteousness, praised it, Song Xiang's having ritual yielding."
}