{
  "s0552": "Wei Gong Zi Jing, Han Gong Zi Chang become feudal lords.",
  "s0553": "Nine years, Meng Chang jun Xue Wen come prime Qin.",
  "s0554": "Huan attack Chu, take eight city, kill its general Jing Kuai.",
  "s0555": "Ten years, Chu Huai wang enter court Qin, Qin stay it.",
  "s0556": "Xue Wen with gold receive free.",
  "s0557": "Lou Huan become Cheng Xiang.",
  "s0558": "Eleven years, Qi, Han, Wei, Zhao, Song, Zhong Shan five state together attack Qin, reach Yan Shi yet return.",
  "s0559": "Qin with Han, Wei He Bei and Feng Ling to and.",
  "s0560": "Hui Xing see.",
  "s0561": "Chu Huai wang flee at Zhao, Zhao not receive, return at Qin, then die, return bury.",
  "s0562": "Twelve years, Lou Huan free, Rang hou Wei Ran become prime.",
  "s0563": "Grant Chu grain five ten thousand stone.",
  "s0564": "Thirteen years, Xiang Shou attack Han, take Wu Shi.",
  "s0565": "Left change Bai Qi attack Xin Cheng.",
  "s0566": "Five da fu Li exit flee run Wei.",
  "s0567": "Ren Bi become Han Zhong guard.",
  "s0568": "Fourteen years, left change Bai Qi attack Han, Wei at Yi Guan, cut head twenty four thousand, capture Gong Sun Xi, pull five city.",
  "s0569": "Fifteen years, big good make Bai Qi attack Wei, take Yuan, again grant it.",
  "s0570": "Attack Chu, take Wan.",
  "s0571": "Sixteen years, left change Cuo take Zhi and Deng.",
  "s0572": "Ran free, seal Gong Zi Shi Wan, Gong Zi Kui Deng, Wei Ran Tao, become feudal lords.",
  "s0573": "Seventeen years, Yang jun jun enter court, reach Dong Zhou jun come court.",
  "s0574": "Qin with Yuan become Pu Ban, Pi Shi.",
  "s0575": "Wang at Yi Yang.",
  "s0576": "Eighteen years, Cuo attack Yuan, He Yong, decide bridge take it.",
  "s0577": "Nineteen years, wang become west Di, Qi become east Di, all again leave it.",
  "s0578": "Lu Li come self return.",
  "s0579": "Qi break Song, Song wang at Wei, die Wen.",
  "s0580": "Ren Bi die.",
  "s0581": "Twenty years, wang at Han Zhong, again at Shang Jun, Bei He.",
  "s0582": "Twenty one years, Cuo attack Wei He Nei.",
  "s0583": "Wei offer An Yi, Qin exit its people, recruit move He Dong grant rank, pardon crime people move it.",
  "s0584": "Jing Yang jun seal Wan.",
  "s0585": "Twenty two years, Meng Wu attack Qi.",
  "s0586": "He Dong become nine county.",
  "s0587": "With Chu wang meet Wan.",
  "s0588": "With Zhao wang meet Zhong Yang.",
  "s0589": "Twenty three years, Wei Si Li with three Jin, Yan attack Qi, break it Ji Xi.",
  "s0590": "Wang with Wei wang meet Yi Yang, with Han wang meet Xin Cheng.",
  "s0591": "Twenty four years, with Chu wang meet Yan, again meet Rang.",
  "s0592": "Qin take Wei An Cheng, reach Da Liang, Yan, Zhao save it, Qin army go.",
  "s0593": "Wei Ran free prime.",
  "s0594": "Twenty five years, pull Zhao two city.",
  "s0595": "With Han wang meet Xin Cheng, with Wei wang meet Xin Ming yi.",
  "s0596": "Twenty six years, pardon crime people move Rang.",
  "s0597": "Hou Ran again prime.",
  "s0598": "Twenty seven years, Cuo attack Chu.",
  "s0599": "Pardon crime people move Nan Yang.",
  "s0600": "Bai Qi attack Zhao, take Dai Guang Lang city.",
  "s0601": "Again make Si Ma Cuo send Long Xi, because Shu attack Chu Qian Zhong, pull it."
}
