{
  "s0101": "The prince heard this and his heart became proud, showing a self-satisfied expression of merit.",
  "s0102": "A retainer advised the prince: 'There are things that cannot be forgotten, and things that must be forgotten.",
  "s0103": "If someone has shown virtue to the prince, the prince cannot forget it.",
  "s0104": "If the prince has shown virtue to others, I hope the prince will forget it.",
  "s0105": "Moreover, forging the King's command and seizing Jin Bi's army to rescue Zhao—toward Zhao this has merit, but toward Wei it is not the conduct of a loyal minister.'",
  "s0106": "The prince then stood and reproached himself, appearing as if he had no place to hide.",
  "s0107": "The King of Zhao swept and cleaned to welcome him personally, performing the rites of a host, leading the prince to the west stairs.",
  "s0108": "The prince walked sideways in refusal, ascending from the east stairs.",
  "s0109": "He spoke of his own crimes, saying he had wronged Wei and had no merit toward Zhao.",
  "s0110": "The King of Zhao served wine until evening, his mouth unable to offer the five cities because the prince was so modest.",
  "s0111": "The prince ultimately stayed in Zhao.",
  "s0112": "The King of Zhao gave Xiang as the prince's bathing city. Wei also restored Xinling to support the prince.",
  "s0113": "The prince stayed in Zhao.",
  "s0114": "The prince heard that Zhao had a worthy man Mao Gong hiding among gamblers, and Xue Gong hiding among ale sellers. The prince wished to see these two men, but both hid themselves and refused to see the prince.",
  "s0115": "When the prince learned their whereabouts, he strolled leisurely to visit and travel with these two men. They were very happy together.",
  "s0116": "Lord Pingyuan heard of this and told his wife: 'At first I heard that your younger brother the prince was unmatched in the world. Now I hear that he casually travels with gamblers and ale sellers. The prince is indeed a frivolous man.'",
  "s0117": "The wife told this to the prince.",
  "s0118": "The prince then took leave of the wife and departed, saying: 'At first I heard Lord Pingyuan was worthy, so I betrayed the King of Wei to rescue Zhao in order to match Lord Pingyuan.",
  "s0119": "Lord Pingyuan's travels are merely grand gestures, not seeking true scholars.",
  "s0120": "Wuji, when I was in Daliang, often heard these two men were worthy. When I came to Zhao, I feared I would not meet them.",
  "s0121": "That Wuji travels with them still fears they may not want me. Now Lord Pingyuan considers it shameful—it shows he is not worth traveling with.'",
  "s0122": "He prepared to leave.",
  "s0123": "The wife fully explained this to Lord Pingyuan.",
  "s0124": "Lord Pingyuan removed his hat and apologized, firmly urging the prince to stay.",
  "s0125": "Lord Pingyuan's retainers heard of this. Half left Lord Pingyuan and went to the prince. Scholars of the world again came to attach themselves to the prince. The prince surpassed Lord Pingyuan in retainers.",
  "s0126": "The prince stayed in Zhao for ten years without returning.",
  "s0127": "Qin heard the prince was in Zhao and daily sent troops east to attack Wei.",
  "s0128": "The King of Wei was troubled and sent envoys to invite the prince.",
  "s0129": "The prince feared the king's anger, so he instructed his retainers: 'Anyone who dares to act as the King of Wei's envoy will die.'",
  "s0130": "His retainers all turned their backs on Wei toward Zhao, none dared urge the prince to return.",
  "s0131": "Mao Gong and Xue Gong went to see the prince: 'The reason the prince is valued in Zhao and his name is known among the feudal lords is only because he has Wei.",
  "s0132": "Now Qin attacks Wei. Wei is in dire straits yet the prince does not care. If Qin breaks Daliang and destroys the ancestral temples of former kings, with what face will the prince stand in the world?'",
  "s0133": "Before their words were finished, the prince's expression changed immediately. He ordered his chariot prepared and hurried back to rescue Wei.",
  "s0134": "The King of Wei saw the prince and they wept together, granting him the supreme general's seal. The prince then commanded the army.",
  "s0135": "In the thirtieth year of King Anli of Wei, the prince sent envoys to announce throughout the feudal lords.",
  "s0136": "The feudal lords heard the prince was commanding and each sent generals with troops to rescue Wei.",
  "s0137": "The prince led the five states' armies and broke the Qin army beyond the Yellow River, routing Meng Ao.",
  "s0138": "He then took advantage of victory to pursue the Qin army to Hangu Pass, suppressing Qin troops. Qin troops dared not come out.",
  "s0139": "At this time, the prince's prestige shook the world. The feudal lords' retainers presented military strategies to the prince, and the prince gave them all names. Therefore the common people call it the 'Lord Xinling's Military Strategies.'",
  "s0140": "The King of Qin was troubled by this and sent 10,000 jin of gold to Wei, seeking Jin Bi's retainers to slander the prince to the King of Wei: 'The prince has been fleeing abroad for ten years. Now he is Wei's general, and the feudal lords' generals all belong to him. The feudal lords only hear of the Lord Xinling, not the King of Wei.",
  "s0141": "The prince also wishes to take this opportunity to establish himself facing south as king. The feudal lords fear the prince's prestige and are about to jointly establish him.'",
  "s0142": "Qin repeatedly sent agents to sow dissension, falsely congratulating the prince on becoming established as King of Wei.",
  "s0143": "The King of Wei daily heard the slander and could not help but believe it. Later he indeed sent someone to replace the prince as commander.",
  "s0144": "The prince knew he had been slandered and dismissed again. He claimed illness and did not attend court, drinking long nights with retainers, drinking strong wine, and approaching many women.",
  "s0145": "He made merry drinking day and night for four years, ultimately dying of alcohol-related illness.",
  "s0146": "That year, King Anli of Wei also passed away.",
  "s0147": "Qin heard the prince was dead and sent Meng Ao to attack Wei, conquering twenty cities and initially establishing Dongjun.",
  "s0148": "Afterward Qin gradually nibbled away at Wei, and after eighteen years captured the King of Wei and slaughtered Daliang.",
  "s0149": "When Gaozu was still humble and young, he often heard the prince was worthy.",
  "s0150": "When he ascended the imperial throne, whenever he passed Daliang, he always sacrificed to the prince.",
  "s0151": "In Gaozu's twelfth year, after following to attack Qing Bu and returning, he established five families to guard the prince's tomb, generation after generation offering sacrifices to the prince in the four seasons.",
  "s0152": "The Grand Historian says: I passed through Daliang's ruins and sought to ask about what is called the eastern gate.",
  "s0153": "The eastern gate is the city's east gate.",
  "s0154": "The world's various princes also have those who love scholars, yet Lord Xinling's reception of hermits from rocky caves, not ashamed to associate with inferiors, has reason.",
  "s0155": "His name crowns the feudal lords, not in vain.",
  "s0156": "That Gaozu whenever passing by ordered the people to maintain sacrifices without cease."
}

