{
  "s0001": "Tian Dan was a distant relative of the Tian clan of Qi.",
  "s0002": "During King Min's time, Dan served as market supervisor in Linzi, unrecognized.",
  "s0003": "When Yan sent Yue Yi to attack and break Qi, Qi King Min fled, then defended Ju city.",
  "s0004": "Yan troops drove straight to pacify Qi, while Tian Dan fled to Anping, ordered his clansmen to all cut their chariot axle ends and fit iron casings.",
  "s0005": "Soon Yan army attacked Anping. City broken, Qi people fled, contended on roads, axes broke chariots, captured by Yan. Only Tian Dan's clansmen with iron casings escaped, east to defend Jimu.",
  "s0006": "Yan having completely subdued Qi cities, only Ju and Jimu not fallen.",
  "s0007": "Yan army heard Qi king in Ju, combined forces attacked it.",
  "s0008": "Zhao Chi having killed King Min in Ju, thus firmly defended, resisted Yan army, several years not fallen.",
  "s0009": "Yan led troops east to besiege Jimu. Jimu officials went out to battle, defeated and died.",
  "s0010": "City people together promoted Tian Dan, saying: 'In Anping battle, Tian Dan's clansmen with iron casings survived, practiced in arms.'",
  "s0011": "Established him as general, to defend Jimu against Yan.",
  "s0012": "Soon, Yan King Zhao died, King Hui ascended, had rift with Yue Yi.",
  "s0013": "Tian Dan heard of this, spread false rumors in Yan, declaring: 'Qi king already dead, cities not fallen are two only.'",
  "s0014": "Yue Yi fears execution dares not return, using attacking Qi as name, actually wishes to join forces facing south to become king of Qi.'",
  "s0015": "Qi people not attached, thus slowly attacks Jimu awaiting the matter.'",
  "s0016": "What Qi fears is only other generals coming, then Jimu finished.'",
  "s0017": "Yan king considered it true, sent Ji Jie to replace Yue Yi.",
  "s0018": "Yue Yi thus went to Zhao, Yan officers and soldiers resentful.",
  "s0019": "Tian Dan then ordered city people when eating must sacrifice to ancestors in courtyards, flying birds all soared and danced eating in city.",
  "s0020": "Yan people considered it strange.",
  "s0021": "Tian Dan thus declared: 'Spirit comes down to teach me.'",
  "s0022": "Then ordered city people: 'There should be a spirit person to be my teacher.'",
  "s0023": "One soldier said: 'Can I be the teacher?'",
  "s0024": "Thus ran backward.",
  "s0025": "Tian Dan rose, led him back, faced east sat, treated him as teacher.",
  "s0026": "Soldier said: 'I deceived you, truly incapable.'",
  "s0027": "Tian Dan said: 'Do not speak!'",
  "s0028": "Thus treated him as teacher.",
  "s0029": "Whenever going out to give orders, must call divine teacher.",
  "s0030": "Then declared: 'I only fear Yan army will cut noses of captured Qi soldiers, place them in front, battle with me, then Jimu defeated.'",
  "s0031": "Yan heard this, did as said.",
  "s0032": "City people saw all surrendered Qi with cut noses, all angered, firmly defended, feared being captured.",
  "s0033": "Dan again spread false rumors: 'I fear Yan people dig my city outer tombs, dishonor ancestors, can chill the heart.'",
  "s0034": "Yan army completely dug up mounds and tombs, burned corpses.",
  "s0035": "Jimu people from city walls saw, all wept, all wished to go out battle, anger increased tenfold.",
  "s0036": "Tian Dan knowing soldiers usable, personally handled board and trowel, shared labor with soldiers, wives and concubines wove among ranks, completely distributed food and drink to feast soldiers.",
  "s0037": "Ordered armored soldiers all hide, made old weak women ascend walls, sent envoys to arrange surrender to Yan. Yan army all called ten thousand years.",
  "s0038": "Tian Dan again collected people's gold, got thousand yi, had Jimu rich merchants send to Yan general: 'Jimu about to surrender, wish not to plunder our clans families wives concubines, let them dwell in peace.'",
  "s0039": "Yan general greatly pleased, agreed.",
  "s0040": "Yan army thus increasingly lax.",
  "s0041": "Tian Dan collected city cattle over thousand, made crimson silk clothing, painted with five-colored dragon patterns, bound weapons on horns, poured oil and bundled reeds on tails, lit the ends.",
  "s0042": "Dug dozens of holes in city, night released cattle, strong warriors five thousand followed behind.",
  "s0043": "Cattle tails hot, angered and charged Yan army. Yan army night greatly alarmed.",
  "s0044": "Cattle tail torches fire bright dazzling, Yan army saw all dragon patterns, touched all died injured.",
  "s0045": "Five thousand thus silent attacked them, city drummed clamor followed, old weak all struck bronze for sound, sound shook heaven earth.",
  "s0046": "Yan army greatly terrified, defeated fled.",
  "s0047": "Qi people thus slaughtered their general Ji Jie.",
  "s0048": "Yan army chaotic fled, Qi people pursued fleeing defeated, passed cities all rebelled Yan returned to Tian Dan, troops daily increased, taking victory, Yan daily defeated perished, finally to Yellow River, Qi seventy-plus cities all recovered for Qi.",
  "s0049": "Thus welcomed King Xiang at Ju, entered Linzi to hear governance.",
  "s0050": "King Xiang enfeoffed Tian Dan, titled Lord Anping."
}

