{
  "s0051": "Now Meng clan, Qin ministers strategists, yet lord wishes once abandon them, minister secretly considers cannot.",
  "s0052": "Minister heard light consideration cannot govern state, sole wisdom cannot preserve lord.",
  "s0053": "Execute kill loyal ministers establish without restraint conduct persons, this inner makes ministers not trust each other outer makes fighting scholars intent separate, minister secretly considers cannot.'",
  "s0055": "Hu Hai not listened.",
  "s0056": "Yet sent imperial secretary Qu Gong by relay to Dai, commanded Meng Yi: 'Previous lord wished establish crown prince yet you opposed.",
  "s0057": "Now chancellor considers you not loyal, crime reaches clan.",
  "s0058": "I not bear, thus grant you die, also very fortunate.",
  "s0059": "You consider it!'",
  "s0060": "Yi replied: 'With minister cannot get previous lord intent, then minister young served, obediently favored to death.",
  "s0061": "Can call knew intent.",
  "s0062": "With minister not know crown prince ability, then crown prince alone followed, toured world, left various crown princes far distant, minister no doubt.",
  "s0063": "Previous lord raised used crown prince, several years accumulation, minister how dared speak admonish, how dared plan consider!",
  "s0064": "Not dared adorn words avoid death, for ashamed burden previous lord name, wish sir consider, make minister get die true feelings.",
  "s0065": "Moreover complete perfect followers, way what valued;",
  "s0066": "Punish kill, way what end.",
  "s0067": "Former Qin Mu Gong killed three worthy died, blamed Baili Xi yet not his crime, thus established title 'Miu'.",
  "s0068": "Zhao Wang killed Wu An Jun Bai Qi.",
  "s0069": "Chu Ping Wang killed Wu She.",
  "s0070": "Wu Wang Fu Cha killed Wu Zi Xu.",
  "s0071": "These four lords, all great loss, world condemned them, considered their lords not enlightened, thus ridiculed among feudal lords.",
  "s0072": "Thus said 'use way govern not kill innocent, punish not add to guiltless'.",
  "s0073": "Only sir attentive!'",
  "s0074": "Envoy knew Hu Hai intent, not listened Meng Yi words, thus killed him.",
  "s0075": "Second Emperor again sent envoy to Yang Zhou, commanded Meng Tian: 'Lord errors many, yet your younger brother Yi has great crime, law reaches inner shi.'",
  "s0076": "Tian said: 'From my ancestors to sons grandsons, accumulated merit trust Qin three generations.",
  "s0077": "Now minister leads troops thirty plus thousand, body though imprisoned bound, situation sufficient rebel, yet self know must die guard righteousness, dare not disgrace ancestors teaching, not forget previous lord.",
  "s0078": "Former Zhou Cheng Wang initial establish, not left swaddling Zhou Gong Dan carried king court, finally settled world.",
  "s0079": "When Cheng Wang had illness very grave, Gong Dan self cut his fingernails sank river, said: 'King not have knowledge, this Dan manages affairs.",
  "s0080": "Have crime calamity, Dan receive not auspicious.'",
  "s0081": "Then wrote stored record bureau, can call trustworthy.",
  "s0082": "When king could govern state, had thief minister spoke: 'Zhou Gong Dan wished chaos long, king if not prepare, must have great affair.'",
  "s0083": "King then greatly angered, Zhou Gong Dan fled ran to Chu.",
  "s0084": "Cheng Wang viewed record bureau, got Zhou Gong Dan sank writing, then flowed tears said: 'Who said Zhou Gong Dan wished chaos!'",
  "s0085": "Killed speaker returned Zhou Gong Dan.",
  "s0086": "Thus Zhou Book said 'must check compare'.",
  "s0087": "Now Tian clan, generations no two hearts, affairs finally like this, certainly evil ministers rebellious chaos, inner usurping way.",
  "s0088": "Cheng Wang lost yet recovered then finally prospered;",
  "s0089": "Jie killed Guan Long Feng, Zhou killed Wang Zi Bi Gan not regretted, body died then state perished.",
  "s0090": "Minister thus said error can recover admonish can awaken.",
  "s0091": "Examine check compare, upper sage method.",
  "s0092": "All minister words, not to seek avoid blame, will admonish die, wish Your Majesty for myriad people consider follow way.'",
  "s0093": "Envoy said: 'Minister received decree execute law on general, dare not with general words hear above.'",
  "s0094": "Meng Tian sighed deeply: 'I what crime heaven, no error die?'",
  "s0095": "Long time, slowly said: 'Tian crime certainly should die.",
  "s0096": "Rose Lintao connected Liaodong, walled trenched ten thousand plus li, this among cannot no cut earth veins?",
  "s0097": "This then Tian crime.'",
  "s0098": "Thus swallowed medicine suicide.",
  "s0099": "Grand Historian said: I went north border, from straight road returned, walked observed Meng Tian what for Qin built long wall beacon barriers, trenched mountains filled valleys, through straight road, indeed exhausted hundred surnames strength.",
  "s0100": "Qin initial extinguished feudal lords, world heart not settled, wounded not healed, yet Tian as famous general, not with this time strong admonish, relieve hundred surnames urgency, nourish old store orphan, manage cultivate masses harmony, yet flattered intent raised merit, this his brothers met execution, not also suitable!",
  "s0101": "Why then blame earth veins!"
}

