{
  "s0001": "Zhao clan ancestors, with Qin share ancestor.",
  "s0002": "To Zhong Yan, became Emperor Da Wu chariot driver.",
  "s0003": "His later generation Fei Lian had two sons, named one son E Lai, served Zhou, killed by Zhou, his descendants became Qin.",
  "s0004": "E Lai younger brother called Ji Sheng, his descendants became Zhao.",
  "s0005": "Ji Sheng gave birth Meng Zeng.",
  "s0006": "Meng Zeng favored by Zhou Cheng Wang, this was Zhu Gao Lang.",
  "s0007": "Gao Lang gave birth Heng Fu, Heng Fu gave birth Zhao Fu.",
  "s0008": "Zhao Fu favored by Zhou Mu Wang.",
  "s0009": "Zhao Fu took fine horses eight, with Tao Lin stole Li, Hua Liu, Lu Er, presented Mu Wang.",
  "s0010": "Mu Wang made Zhao Fu drive chariot, west toured inspected, saw Xi Wang Mu, delighted forgot return.",
  "s0011": "Yet Xu Jian Wang rebelled, Mu Wang daily raced thousand li horses, attacked Xu Jian Wang, greatly broke him.",
  "s0012": "Then granted Zhao Fu Zhao city, from this became Zhao clan.",
  "s0013": "From Zhao Fu below six generations to Yan Fu, called Gong Zhong, Zhou Xuan Wang time attacked Rong, as chariot driver.",
  "s0014": "When Qian Mu battle, Yan Fu saved Xuan Wang.",
  "s0015": "Yan Fu gave birth Shu Dai.",
  "s0016": "Shu Dai time, Zhou You Wang without way, left Zhou went Jin, served Jin Wen Hou, began established Zhao clan in Jin state.",
  "s0017": "From Shu Dai below, Zhao clan increasingly prospered, five generations reached Zhao Shu.",
  "s0018": "Zhao Shu, Jin Xian Gong sixteenth year attacked Huo, Wei, Geng, Zhao Shu as general attacked Huo.",
  "s0019": "Huo Gong sought fled Qi.",
  "s0020": "Jin great drought, divined it, said 'Huo Tai Shan as calamity'.",
  "s0021": "Made Zhao Shu summoned Huo jun from Qi, restored him, to serve Huo Tai Shan sacrifice, Jin again bountiful.",
  "s0022": "Jin Xian Gong granted Zhao Shu Geng.",
  "s0023": "Shu gave birth Gong Meng, when Lu Min Gong first year.",
  "s0024": "Gong Meng gave birth Zhao Shuai, styled Zi Yu.",
  "s0025": "Zhao Shuai divined served Jin Xian Gong and various crown princes, none auspicious;",
  "s0026": "Divined served crown prince Chong Er, auspicious, then served Chong Er.",
  "s0027": "Chong Er because Li Ji chaos fled ran Di, Zhao Shuai followed.",
  "s0028": "Di attacked Xiong Jiu Ru, got two women, Di with his younger daughter wife Chong Er, elder daughter wife Zhao Shuai gave birth Dun.",
  "s0029": "Initially, Chong Er in Jin time, Zhao Shuai wife also gave birth Zhao Tong, Zhao Kuo, Zhao Ying Qi.",
  "s0030": "Zhao Shuai followed Chong Er out exile, altogether nineteen years, got return state.",
  "s0031": "Chong Er became Jin Wen Gong, Zhao Shuai as Yuan da fu, dwelt Yuan, in charge state politics.",
  "s0032": "Wen Gong what return state and hegemon, many Zhao Shuai plans strategy, words in Jin matters.",
  "s0033": "Zhao Shuai already return Jin, Jin wife firmly demanded welcomed Di wife, yet with her son Dun as proper heir, Jin wife three sons all below served him.",
  "s0034": "Jin Xiang Gong sixth year, Zhao Shuai died, posthumous title Cheng Ji.",
  "s0035": "Zhao Dun replaced Cheng Ji in charge state politics two years yet Jin Xiang Gong died, crown prince Yi Gao young.",
  "s0036": "Dun for state many difficulties, wished establish Xiang Gong younger brother Yong.",
  "s0037": "Yong at time in Qin, made envoy welcomed him.",
  "s0038": "Crown prince mother day night wept, knocked head told Zhao Dun: 'Previous lord what crime, abandoned his proper son yet again sought lord?'",
  "s0039": "Zhao Dun worried, feared his clan with grand masters attacked executed him, then established crown prince, this was Ling Gong, sent troops resisted welcomed Xiang Gong younger brother at Qin.",
  "s0040": "Ling Gong already established, Zhao Dun increasingly monopolized state politics.",
  "s0041": "Ling Gong established fourteen years, increasingly arrogant.",
  "s0042": "Zhao Dun repeatedly admonished, Ling Gong not listened.",
  "s0043": "When ate bear paw, stew not cooked, killed cook, held his corpse out, Zhao Dun saw.",
  "s0044": "Ling Gong from this feared, wished kill Dun.",
  "s0045": "Dun originally benevolent loved people, once what ate mulberry below hungry person instead defended saved Dun, Dun because got fled.",
  "s0046": "Not out border, yet Zhao Chuan assassinated Ling Gong established Xiang Gong younger brother Hei Tun, this was Cheng Gong.",
  "s0047": "Zhao Dun again returned, in charge state politics.",
  "s0048": "Gentleman criticized Dun 'as proper minister, fled not out border, returned not punished traitor', thus grand historian wrote 'Zhao Dun assassinated his lord'.",
  "s0049": "Jin Jing Gong time Zhao Dun died, posthumous title Xuan Meng, son Shuo inherited.",
  "s0050": "Zhao Shuo, Jin Jing Gong third year, Shuo as Jin general lower army saved Zheng, with Chu Zhuang Wang battled river above."
}

