{
  "s0052": "Prince Guang brought out his hidden armored troops to attack King Liao's followers, completely exterminated them, thus self-established as king, this was Helü.",
  "s0053": "Helü then enfeoffed Zhuan Zhu's son as upper minister.",
  "s0054": "After seventy plus years then Jin had Yu Rang affair.",
  "s0055": "Yu Rang was Jin person, formerly served Fan clan and Zhonghang clan, without known reputation.",
  "s0056": "Left served Zhi Bo, Zhi Bo much honored favored him.",
  "s0057": "When Zhi Bo attacked Zhao Xiangzi, Zhao Xiangzi with Han, Wei united plotted exterminate Zhi Bo, exterminated Zhi Bo after divided his land three ways.",
  "s0058": "Zhao Xiangzi most resented Zhi Bo, lacquered his head to make drinking vessel.",
  "s0059": "Yu Rang fled hid in mountains, said: 'Alas!",
  "s0060": "Scholar dies for one who knows him, woman adorns for one who pleases her.",
  "s0061": "Now Zhi Bo knows me, I must avenge enmity die, to repay Zhi Bo, then my soul not ashamed.'",
  "s0062": "Thus changed name surname became criminal, entered palace smeared toilets, middle hid dagger, wished stab Xiangzi.",
  "s0063": "Xiangzi went to toilet, heart moved, seized questioned toilet smearing criminal, was Yu Rang, inside held blade weapons, said: 'Wish avenge Zhi Bo!'",
  "s0064": "Attendants wished execute him.",
  "s0065": "Xiangzi said: 'He righteous person, I carefully avoid him.",
  "s0066": "Moreover Zhi Bo died without descendants, his minister wishes avenge enmity, this world's worthy person.'",
  "s0067": "Ultimately released departed him.",
  "s0068": "Dwelt moment, Yu Rang again lacquered body became leper, swallowed charcoal became mute, made appearance unrecognizable, begged in market.",
  "s0069": "His wife not recognized him.",
  "s0070": "Walking saw his friend, friend recognized him, said: 'You not Yu Rang?'",
  "s0071": "Said: 'I am.'",
  "s0072": "Friend wept for him: 'With your talent, submit serve Xiangzi, Xiangzi must approach favor you.",
  "s0073": "Approach favor you, then accomplish what desired, moreover not easy?",
  "s0074": "Why thus harm body bitter form, wish seek avenge Xiangzi, not difficult!'",
  "s0075": "Yu Rang said: 'Already submitted served person, yet seek kill him, is harbor two hearts serve lord.",
  "s0076": "Moreover what I do extremely difficult!",
  "s0077": "Yet reason do this, will shame world later generations ministers harbor two hearts serve lord.'",
  "s0079": "Having left, moment, Xiangzi when exit, Yu Rang hid at bridge he must pass.",
  "s0080": "Xiangzi reached bridge, horse startled, Xiangzi said: 'This must Yu Rang.'"
}