{
  "s0101": "Now my lord alone extinguished Zhao clan, state people pitied them, thus appeared turtle divination.",
  "s0102": "Only lord plan it.'",
  "s0103": "Jing Gong asked: 'Zhao still has descendants?'",
  "s0104": "Han Jue detailed with real told.",
  "s0105": "Then Jing Gong with Han Jue plotted established Zhao orphan, summoned hid palace middle.",
  "s0106": "Various generals entered asked illness, Jing Gong because Han Jue crowd threatened various generals saw Zhao orphan.",
  "s0107": "Zhao orphan named Wu.",
  "s0108": "Various generals had no choice, then said: 'Former lower palace difficulty, Tu An Jia did it, falsely with lord command, together commanded ministers.",
  "s0109": "Not so, who dared make difficulty!",
  "s0110": "Without lord illness, ministers certainly moreover requested establish Zhao posterity.",
  "s0111": "Now lord has command, ministers wish.'",
  "s0112": "Then summoned Zhao Wu, Cheng Ying widely bowed various generals, then returned with Cheng Ying, Zhao Wu attacked Tu An Jia, extinguished his clan.",
  "s0113": "Again with Zhao Wu fields cities like before.",
  "s0114": "When Zhao Wu capped, became adult, Cheng Ying then bid farewell various grand masters, told Zhao Wu: 'Former lower palace difficulty, all could die.",
  "s0115": "I not cannot die, I considered establish Zhao clan posterity.",
  "s0116": "Now Zhao Wu already established, became adult, restored former position, I will below report Zhao Xuan Meng with Gong Sun Chu Jiu.'",
  "s0117": "Zhao Wu wept knocked head firmly requested, said: 'Wu wish toil muscles bones to repay master to death, yet master bear leave me die?'",
  "s0118": "Cheng Ying said: 'Cannot.",
  "s0119": "They because I able complete matter, thus first I die;",
  "s0120": "Now I not report, this with my matter not complete.'",
  "s0121": "Then suicide.",
  "s0122": "Zhao Wu wore mourning three years, for him established sacrifice city, spring autumn sacrificed him, generations not cease.",
  "s0123": "Zhao clan restored position eleven years, Jin Li Gong killed his grand master three Qi.",
  "s0124": "Luan Shu feared reached, then assassinated his lord Li Gong, changed established Xiang Gong great grandson Zhou, this was Dao Gong.",
  "s0125": "Jin from this grand masters gradually strong.",
  "s0126": "Zhao Wu continued Zhao clan twenty seven years, Jin Ping Gong established.",
  "s0127": "Ping Gong twelve year, Zhao Wu as proper minister.",
  "s0128": "Thirteen year, Wu Yanling Ji Zi envoy to Jin, said: 'Jin state politics finally return to Zhao Wu Zi, Han Xuan Zi, Wei Xian Zi descendants.'",
  "s0129": "Zhao Wu died, posthumous title Wen Zi.",
  "s0130": "Wen Zi gave birth Jing Shu.",
  "s0131": "Jing Shu time, Qi Jing Gong made Yan Ying to Jin, Yan Ying with Jin Shu Xiang spoke.",
  "s0132": "Ying said: 'Qi politics later finally return Tian clan.'",
  "s0133": "Shu Xiang also said: 'Jin state politics will return six ministers.",
  "s0134": "Six ministers extravagant, yet my lord cannot care.'",
  "s0136": "Zhao Jing Shu died, gave birth Zhao Yang, this was Jian Zi.",
  "s0136": "Zhao Jian Zi in position, Jin Qing Gong ninth year, Jian Zi about united various lords garrisoned Zhou.",
  "s0137": "Its next year, entered Zhou Jing Wang to Zhou, avoided disciple court reason.",
  "s0138": "Jin Qing Gong twelfth year, six ministers with law executed public clan Qi clan, Yang She clan, divided their cities as ten counties, six ministers each commanded their clans as da fu.",
  "s0139": "Jin public room from this increasingly weak.",
  "s0140": "Later thirteen years, Lu traitor minister Yang Hu came fled, Zhao Jian Zi accepted bribe, thick treated him.",
  "s0141": "Zhao Jian Zi ill, five days not knew person, grand masters all feared.",
  "s0142": "Physician Bian Que examined, out, Dong An Yu asked.",
  "s0143": "Bian Que said: 'Blood vessels orderly, yet what strange!",
  "s0144": "In former Qin Mu Gong tasted like this, seven days awakened.",
  "s0145": "Awakened day, told Gong Sun Zhi with Zi Yu: 'I at emperor place very happy.",
  "s0146": "My what long, suitable had study.",
  "s0147": "Emperor told me: 'Jin state will greatly chaotic, five generations not peaceful;",
  "s0148": "Its after will hegemon, not old die;",
  "s0149": "Hegemon son moreover make his state males females no distinction.'",
  "s0150": "Gong Sun Zhi wrote stored, Qin prophecy from this came out."
}
