{
  "s0001": "Zheng Huan Gong You was Zhou Li Wang's youngest son and Xuan Wang's concubine younger brother.",
  "s0002": "Xuan Wang ascended twenty-two years, You first enfeoffed at Zheng.",
  "s0003": "Enfeoffed thirty-three years, hundred surnames all convenient loved him.",
  "s0004": "You Wang made him Minister of the Masses.",
  "s0005": "Harmonized gathered Zhou people, Zhou people all pleased, between Yellow River Luo, people conveniently thought of him.",
  "s0006": "As Minister of the Masses one year, You Wang because of Bao Hou sake, royal chamber governance many evil, feudal lords or rebelled against him.",
  "s0007": "Thereupon Huan Gong asked Grand Historian Bo: 'Royal chamber many affairs, I where escape death?'",
  "s0008": "Grand Historian Bo replied: 'Only Luo east land, Yellow River Ji south can reside.'",
  "s0009": "Gong said: 'Why?'",
  "s0010": "Replied: 'Land near Guo, Huo, Guo, Huo lords greedy and fond of profit, hundred surnames not attach.",
  "s0011": "Now gong as Minister of the Masses, people all love gong, gong sincerely request reside there, Guo, Huo lords see gong presently in power, lightly divide gong land.",
  "s0012": "Gong sincerely reside there, Guo, Huo people all gong's people.'",
  "s0013": "Gong said: 'I wish south to Jiang Shang, how?'",
  "s0014": "Replied: 'Formerly Zhu Rong was Gao Xin Shi fire minister, his merit great, but toward Zhou not yet risen, Chu is his descendant.",
  "s0015": "Zhou declines, Chu must rise.",
  "s0016": "Rise, not Zheng's benefit.'",
  "s0017": "Gong said: 'I wish reside west, how?'",
  "s0018": "Replied: 'Their people greedy fond of profit, difficult long reside.'",
  "s0019": "Gong said: 'Zhou declines, which state will rise?'",
  "s0020": "Replied: 'Qi, Qin, Jin, Chu huh?",
  "s0021": "Qi is Jiang surname, Bo Yi descendant, Bo Yi assisted Yao managed rites.",
  "s0022": "Qin is Ying surname, Bo Yi descendant, Bo Yi assisted Shun embraced softened hundred things.",
  "s0023": "And Chu ancestors, all once had merit toward world.",
  "s0024": "When Zhou Wu Wang conquered Zhou, Cheng Wang enfeoffed Shu Yu at Tang, its land obstructed dangerous, with this had virtue with Zhou decline together, must rise.'",
  "s0025": "Huan Gong said: 'Good.'",
  "s0026": "Thereupon finally spoke to wang, east migrated his people Luo east, and Guo, Huo indeed offered ten cities, ultimately established state.",
  "s0027": "Two years, Quanrong killed You Wang at Li Shan below, and killed Huan Gong.",
  "s0028": "Zheng people together established his son Jue Tu, this was Wu Gong.",
  "s0029": "Wu Gong tenth year, took Shen Hou woman as wife, called Wu Jiang.",
  "s0030": "Gave birth to crown prince Wu Sheng, born difficult, when born, wife not love him.",
  "s0031": "After gave birth to younger son Shu Duan, Duan born easy, wife loved him.",
  "s0032": "Twenty-seventh year, Wu Gong ill.",
  "s0033": "Wife requested gong, wished establish Duan as crown prince, gong not listen.",
  "s0034": "This year, Wu Gong died, Wu Sheng ascended, this was Zhuang Gong.",
  "s0035": "Zhuang Gong first year, enfeoffed younger brother Duan at Jing, titled Tai Shu.",
  "s0036": "Ji Zhong said: 'Jing greater than state, not for enfeoffing concubine.'",
  "s0037": "Zhuang Gong said: 'Wu Jiang wishes it, I dare not take away.'",
  "s0038": "Duan arrived Jing, repaired armor weapons, with his mother Wu Jiang plotted attack Zheng.",
  "s0039": "Twenty-second year, Duan indeed attacked Zheng, Wu Jiang as inner support.",
  "s0040": "Zhuang Gong sent troops attacked Duan, Duan fled.",
  "s0041": "Attacked Jing, Jing people rebelled Duan, Duan fled Yan.",
  "s0042": "Yan collapsed, Duan fled Gong.",
  "s0043": "Thereupon Zhuang Gong moved his mother Wu Jiang to Cheng Ying, swore saying: 'Not reach yellow springs, no meet each other.'",
  "s0044": "Resided year plus, already regretted thought mother.",
  "s0045": "Ying valley Kao Shu had offering to gong, gong granted food.",
  "s0046": "Kao Shu said: 'Subject has mother, request gong food grant subject mother.'",
  "s0047": "Zhuang Gong said: 'I very think mother, hate betray oath, how?'",
  "s0048": "Kao Shu said: 'Dig earth to yellow springs, then can meet.'",
  "s0049": "Thereupon followed it, saw mother.",
  "s0050": "Twenty-fourth year, Song Mu Gong died, duke Feng fled Zheng.",
  "s0051": "Zheng invaded Zhou land, took grain.",
  "s0052": "Twenty-fifth year, Wei Zhou Xu assassinated his ruler Huan Gong self-established, with Song attacked Zheng, because Feng sake.",
  "s0053": "Twenty-seventh year, began court Zhou Huan Wang.",
  "s0054": "Huan Wang angered their taking grain, not honored them.",
  "s0055": "Twenty-ninth year, Zhuang Gong angered Zhou not honored, with Lu exchanged Beng, Xu fields.",
  "s0056": "Thirty-third year, Song killed Kong Fu.",
  "s0057": "Thirty-seventh year, Zhuang Gong not court Zhou, Zhou Huan Wang led Chen, Cai, Guo, Wei attacked Zheng.",
  "s0058": "Zhuang Gong with Ji Zhong, Gao Qu Mi sent troops self-saved, wang troops greatly defeated.",
  "s0059": "Zhu Kui shot hit wang arm.",
  "s0060": "Zhu Kui requested pursue him, Zheng Bo stopped him, said: \"Offend elder moreover difficult, moreover dare insult Son of Heaven?\"",
  "s0061": "Then stopped.",
  "s0062": "Night ordered Ji Zhong ask wang illness.",
  "s0063": "Thirty-eighth year, north Rong attacked Qi, Qi made seek save, Zheng sent crown prince Hu led troops save Qi.",
  "s0064": "Qi Xi Gong wished marry him, Hu declined said: \"I small state, not Qi match.\"",
  "s0065": "At time Ji Zhong with him, advised make take her, said: \"Lord many inner favorites, crown prince no great support will not establish, three dukes all lord.\"",
  "s0066": "So-called three dukes, crown prince Hu, his younger brother Tu, next younger brother Meng.",
  "s0067": "Forty-third year, Zheng Zhuang Gong died.",
  "s0068": "Initially, Ji Zhong very favored by Zhuang Gong, Zhuang Gong made him duke;",
  "s0069": "Gong made take Deng woman, gave birth crown prince Hu, therefore Ji Zhong established him, this was Zhao Gong.",
  "s0070": "Zhuang Gong moreover took Song Yong clan woman, gave birth Li Gong Tu.",
  "s0071": "Yong clan favored by Song.",
  "s0072": "Song Zhuang Gong heard Ji Zhong established Hu, then made person induce summon Ji Zhong and seize him, said: \"Not establish Tu, will die.\"",
  "s0073": "Also seized Tu to seek bribe.",
  "s0074": "Ji Zhong permitted Song, allied with Song.",
  "s0075": "With Tu returned, established him.",
  "s0076": "Zhao Gong Hu heard Ji Zhong with Song coerced establish his younger brother Tu, ninth month ding hai, Hu fled Wei.",
  "s0077": "Ji hai, Tu arrived Zheng, established, this was Li Gong.",
  "s0078": "Li Gong fourth year, Ji Zhong monopolized state governance.",
  "s0079": "Li Gong troubled it, secretly made his son-in-law Yong Jiu wish kill Ji Zhong.",
  "s0080": "Jiu wife, Ji Zhong daughter, knew it, told her mother said: \"Father and husband who closer?\"",
  "s0081": "Mother said: \"Father one only, people all husband.\"",
  "s0082": "Woman then told Ji Zhong, Ji Zhong instead killed Yong Jiu, executed him in market.",
  "s0083": "Li Gong no could do to Ji Zhong, angered Jiu said: \"Plot reached woman, death indeed fitting!\"",
  "s0084": "Summer, Li Gong left resided border city Li.",
  "s0085": "Ji Zhong welcomed Zhao Gong Hu, sixth month yi hai, again entered Zheng, ascended position.",
  "s0086": "Autumn, Zheng Li Gong Tu because Li people killed his duke Shan Bo, then resided it.",
  "s0087": "Feudal lords heard Li Gong fled, attacked Zheng, not conquered departed.",
  "s0088": "Song rather gave Li Gong troops, self-defended at Li, Zheng because this also not attacked Li.",
  "s0089": "Zhao Gong second year, from Zhao Gong as crown prince time, father Zhuang Gong wished make Gao Qu Mi duke, crown prince Hu hated him, Zhuang Gong not listen, finally used Qu Mi as duke.",
  "s0090": "When Zhao Gong ascended position, feared he kill self, winter tenth month xin mao, Qu Mi with Zhao Gong went hunting, shot killed Zhao Gong in wilds.",
  "s0091": "Ji Zhong with Qu Mi dared not enter Li Gong, then moreover established Zhao Gong younger brother Meng as ruler, this was Zi Meng, no posthumous title.",
  "s0092": "Zi Meng first year seventh month, Qi Xiang Gong assembled feudal lords at Shou Zhi, Zheng Zi Meng went assembled, Gao Qu Mi accompanied, followed, Ji Zhong claimed illness not go.",
  "s0093": "Reason was, Zi Meng from Qi Xiang Gong as duke time, once met Dou, mutually enmity, when assembled feudal lords, Ji Zhong requested Zi Meng not go.",
  "s0094": "Zi Meng said: \"Qi strong, and Li Gong resides Li, if not go, this leads feudal lords attack me, enter Li Gong.",
  "s0095": "I better go, go why hastily must humiliation, moreover how reach this!\"",
  "s0096": "Finally went.",
  "s0097": "Thereupon Ji Zhong feared Qi together kill him, therefore claimed illness.",
  "s0098": "Zi Meng arrived, not apologized to Qi Hou, Qi Hou angered, then hid armor killed Zi Meng.",
  "s0099": "Gao Qu Mi fled returned, returned with Ji Zhong plotted, summoned Zi Meng younger brother duke Ying at Chen and established him, this was Zheng Zi.",
  "s0100": "This year, Qi Xiang Gong made Peng Sheng drunk pull kill Lu Huan Gong.",
  "s0101": "Zheng Zi eighth year, Qi person Guan Zhi Fu and others made rebellion, assassinated their ruler Xiang Gong.",
  "s0102": "Twelfth year, Song person Chang Wan assassinated their ruler Min Gong.",
  "s0103": "Zheng Ji Zhong died.",
  "s0104": "Fourteenth year, former Zheng exiled Li Gong Tu at Li made person induce coerce Zheng duke Fu Jia, coerced to seek entry.",
  "s0105": "Jia said: \"Release me, I for you kill Zheng Zi and enter you.\"",
  "s0106": "Li Gong allied with him, then released him.",
  "s0107": "Sixth month jia zi, Jia killed Zheng Zi and his two sons and welcomed Li Gong Tu, Tu from Li again entered ascended position.",
  "s0108": "Initially, inner snake and outer snake fought at Zheng south gate midst, inner snake died.",
  "s0109": "Resided six years, Li Gong indeed again entered.",
  "s0110": "Entered and yielded to his uncle Yuan said: \"I exiled state outside resided, uncle no intention enter me, also extreme.\"",
  "s0111": "Yuan said: \"Serve lord no two hearts, person subject duty.",
  "s0112": "Yuan know crime.\"",
  "s0113": "Then suicided.",
  "s0114": "Li Gong thereupon called Fu Jia said: \"You serve lord had two hearts.\"",
  "s0115": "Then executed him.",
  "s0116": "Jia said: \"Heavy virtue not repay, truly!\"",
  "s0118": "Li Gong Tu later first year, Qi Huan Gong began hegemony.",
  "s0119": "Fifth year, Yan, Wei with Zhou Hui Wang younger brother Hui attacked wang, wang fled warm, established younger brother Hui as wang.",
  "s0120": "Sixth year, Hui Wang informed urgent Zheng, Li Gong sent troops attacked Zhou son Hui, not victorious, thereupon with Zhou Hui Wang returned, wang resided at Li.",
  "s0121": "Seventh year spring, Zheng Li Gong with Guo Shu attacked killed son Hui and entered Hui Wang at Zhou.",
  "s0122": "Autumn, Li Gong died, son Wen Gong Jue ascended.",
  "s0123": "Li Gong initially established four years, exiled resided Li, resided Li seventeen years, again entered, established seven years, with exile altogether twenty-eight years.",
  "s0124": "Twenty-fourth year, Wen Gong humble concubine called Yan Ji, dreamed heaven gave her orchid, said: \"I am Bo Xiao.",
  "s0125": "I, your ancestor.",
  "s0126": "With this as your son, orchid has state fragrance.\"",
  "s0127": "With dream told Wen Gong, Wen Gong favored her, and gave her grass orchid as token.",
  "s0128": "Thereupon gave birth to son, named Lan.",
  "s0129": "Thirty-sixth year, Jin duke Chong Er passed, Wen Gong not honored him.",
  "s0130": "Wen Gong younger brother Shu Zhan said: \"Chong Er worthy, moreover same surname, poor and passed lord, cannot without honor.\"",
  "s0131": "Wen Gong said: \"Feudal lords exiled dukes passing many, how can all honor them!\"",
  "s0132": "Zhan said: \"Lord like not honor, then kill him;",
  "s0133": "not kill, make return state, for Zheng worry.\"",
  "s0134": "Wen Gong not listen.",
  "s0135": "Thirty-seventh year spring, Jin duke Chong Er returned state, established, this was Wen Gong.",
  "s0136": "Autumn, Zheng entered Hua, Hua obeyed command, afterward again with Wei, thereupon Zheng attacked Hua.",
  "s0137": "Zhou Xiang Wang made Bo Fu request Hua.",
  "s0138": "Zheng Wen Gong resented Hui Wang exile at Li, and Wen Gong father Li Gong entered him, and Hui Wang not granted Li Gong rank emolument, moreover resented Xiang Wang with Wei Hua, therefore not listen Xiang Wang request and imprisoned Bo Fu.",
  "s0139": "Wang angered, with Di people attacked Zheng, not conquered.",
  "s0140": "Winter, Di attacked Xiang Wang, Xiang Wang fled Zheng, Zheng Wen Gong housed wang at Fan.",
  "s0141": "Thirty-eighth year, Jin Wen Gong entered Xiang Wang at Cheng Zhou.",
  "s0142": "Forty-first year, assisted Chu attacked Jin.",
  "s0143": "From Jin Wen Gong passed without honor, therefore betrayed Jin assisted Chu.",
  "s0144": "Forty-third year, Jin Wen Gong with Qin Mu Gong together surrounded Zheng, punished their assisting Chu attack Jin, and Wen Gong passing time without honor.",
  "s0145": "Initially, Zheng Wen Gong had three wives, favored sons five people, all early died by crime.",
  "s0146": "Gong angered, drove away various dukes.",
  "s0147": "Zi Lan fled Jin, followed Jin Wen Gong surrounded Zheng.",
  "s0148": "At time Lan served Jin Wen Gong very carefully, loved favored him, then privately with Jin, to seek enter Zheng as crown prince.",
  "s0149": "Jin thereupon wished obtain Shu Zhan as hostage.",
  "s0150": "Zheng Wen Gong feared, dared not tell Shu Zhan speak.",
  "s0151": "Zhan heard, spoke to Zheng lord said: \"Subject told lord, lord not listen subject, Jin finally become trouble.",
  "s0152": "However Jin so surround Zheng, because Zhan, Zhan die and pardon Zheng state, Zhan wish.\"",
  "s0153": "Then suicided.",
  "s0154": "Zheng people with Zhan corpse gave Jin.",
  "s0155": "Jin Wen Gong said: \"Must want see Zheng lord once, humiliate him and depart.\"",
  "s0156": "Zheng people troubled it, then made person privately with Qin said: \"Break Zheng benefit Jin, not Qin benefit.\"",
  "s0157": "Qin troops stopped.",
  "s0158": "Jin Wen Gong wished enter Lan as crown prince, with this told Zheng.",
  "s0159": "Zheng duke Shi Gui said: \"I heard Ji surname is Hou Ji first wife, her descendants should have riser.",
  "s0160": "Zi Lan mother, her descendant.",
  "s0161": "Moreover wife sons all already died, remaining concubine sons no like Lan worthy.",
  "s0162": "Now surround urgent, Jin with this request, profit who greater!\"",
  "s0163": "Then permitted Jin, allied with them, and finally established Zi Lan as crown prince, Jin troops then stopped departed.",
  "s0164": "Forty-fifth year, Wen Gong died, Zi Lan ascended, this was Mu Gong.",
  "s0165": "Mu Gong first year spring, Qin Mu Gong made three generals lead troops wished attack Zheng, arrived Hua, met Zheng merchant Xian Gao deceived with twelve oxen labor army, therefore Qin troops not arrived returned, Jin defeated them at Xiao.",
  "s0166": "Initially, previous year Zheng Wen Gong died, Zheng Si Cheng Zang He with Zheng situation sold them, Qin troops therefore came.",
  "s0167": "Third year, Zheng sent troops followed Jin attacked Qin, defeated Qin troops at Wang.",
  "s0168": "Previous year Chu crown prince Shang Chen assassinated his father Cheng Wang replaced established.",
  "s0169": "Twenty-first year, with Song Hua Yuan attacked Zheng.",
  "s0170": "Hua Yuan killed sheep fed soldiers, not gave his charioteer Yang Zhen, angered with gallop Zheng, Zheng imprisoned Hua Yuan.",
  "s0171": "Song ransomed Hua Yuan, Yuan also fled departed.",
  "s0172": "Jin made Zhao Chuan with troops attacked Zheng.",
  "s0173": "Ling Gong first year spring, Chu presented turtle to Ling Gong.",
  "s0174": "Zi Jia, Zi Gong would court Ling Gong, Zi Gong eating finger moved, told Zi Jia said: \"Other day finger moved, must eat different thing.\"",
  "s0175": "When entered, saw Ling Gong advanced turtle soup, Zi Gong laughed said: \"Indeed!\"",
  "s0176": "Ling Gong asked his laugh reason, fully told Ling Gong.",
  "s0177": "Ling Gong summoned them, alone not gave soup.",
  "s0178": "Zi Gong angered, dipped his finger, tasted it departed.",
  "s0179": "Gong angered, wished kill Zi Gong.",
  "s0180": "Zi Gong with Zi Jia plotted first.",
  "s0181": "Summer, assassinated Ling Gong.",
  "s0182": "Zheng people wished establish Ling Gong younger brother Qu Ji, Qu Ji declined said: \"Must with worthy, then Qu Ji not worthy;",
  "s0183": "must with compliant, then duke Jian elder.\"",
  "s0184": "Jian was Ling Gong concubine younger brother, Qu Ji elder brother.",
  "s0185": "Thereupon established Zi Jian, this was Xiang Gong.",
  "s0186": "Xiang Gong established, would completely remove Mu clan.",
  "s0187": "Mu clan was kill Ling Gong, Zi Gong clan family.",
  "s0188": "Qu Ji said: \"Must remove Mu clan, I will remove them.\"",
  "s0189": "Then stopped.",
  "s0190": "All made dukes.",
  "s0191": "Xiang Gong first year, Chu angered Zheng received Song bribe released Hua Yuan, attacked Zheng.",
  "s0192": "Zheng betrayed Chu, with Jin close.",
  "s0193": "Fifth year, Chu again attacked Zheng, Jin came saved them.",
  "s0194": "Sixth year, Zi Jia died, state people again drove his clan, because assassinated Ling Gong.",
  "s0195": "Seventh year, Zheng with Jin allied Yan Ling.",
  "s0196": "Eighth year, Chu Zhuang Wang because Zheng with Jin allied, came attacked, surrounded Zheng three months, Zheng with city submitted Chu.",
  "s0197": "Chu wang entered from Huang gate, Zheng Xiang Gong bared flesh led sheep welcomed, said: \"Orphan cannot serve border cities, made wang harbor anger reach ruined city, orphan crime.",
  "s0198": "Dare not only command listen.",
  "s0199": "Wang migrate to Jiangnan, and with grant feudal lords, also only command listen.",
  "s0200": "If wang not forget Li, Xuan wang, Huan, Wu gong, pity not cut their she ji, grant no hair land, make again obtain change serve wang, orphan wish, however not dare hope.\"",
  "s0201": "Dare spread abdomen heart, only command listen.\"",
  "s0202": "Zhuang Wang for retreated thirty li then released.",
  "s0203": "Chu ministers said: \"From Ying to here, scholars knights also long labored.",
  "s0204": "Now obtained state release it, how?\"",
  "s0205": "Zhuang Wang said: \"What for attack, attack not submit.",
  "s0206": "Now already submit, still what seek?\"",
  "s0207": "Finally departed.",
  "s0208": "Jin heard Chu attacked Zheng, sent troops saved Zheng.",
  "s0209": "Their coming held two ends, therefore late, compared arrived river, Chu troops already departed.",
  "s0210": "Jin generals some wished cross, some wished return, finally crossed river.",
  "s0211": "Zhuang Wang heard, returned attacked Jin.",
  "s0212": "Zheng instead assisted Chu, greatly defeated Jin army at river.",
  "s0213": "Tenth year, Jin came attacked Zheng, because betrayed Jin close Chu.",
  "s0214": "Eleventh year, Chu Zhuang Wang attacked Song, Song informed urgent Jin.",
  "s0215": "Jin Jing Gong wished send troops save Song, Bo Zong admonished Jin lord said: \"Heaven just opening Chu, not attack.\"",
  "s0216": "Then sought strong man obtained Huo person Xie Yang, courtesy Zi Hu, deceived Chu, made Song not submit.",
  "s0217": "Passed Zheng, Zheng with Chu close, then seized Xie Yang offered Chu.",
  "s0218": "Chu wang thick granted allied with him, made return his words, made Song hurry submit, three requests then permitted.",
  "s0219": "Thereupon Chu ascended Xie Yang tower chariot, made call Song.",
  "s0220": "Then violated Chu agreement conveyed his Jin lord command said: \"Jin just all state troops save Song, Song though urgent, careful not submit Chu, Jin troops now arrived!\"",
  "s0221": "Chu Zhuang Wang greatly angered, would kill him.",
  "s0222": "Xie Yang said: \"Lord can control command for righteousness, subject can receive command for faith.",
  "s0223": "Received my lord command to leave, have death no disgrace.\"",
  "s0224": "Zhuang Wang said: \"You permitted me, afterward betrayed, his faith where?\"",
  "s0225": "Xie Yang said: \"So permitted wang, wished complete my lord command.\"",
  "s0226": "Will die, looked back told Chu army said: \"Be person subject not forget exhaust loyal get death!\"",
  "s0227": "Chu wang various younger brothers all admonished wang pardon him, thereupon pardoned Xie Yang made return.",
  "s0228": "Jin raised him rank to upper duke.",
  "s0229": "Eighteenth year, Xiang Gong died, son Dao Gong Fei ascended.",
  "s0230": "Dao Gong first year, Ju Gong slandered Zheng at Chu, Dao Gong made younger brother Lai at Chu self-defend.",
  "s0231": "Defend not straight, Chu imprisoned Lai.",
  "s0232": "Thereupon Zheng Dao Gong came with Jin peace, then close.",
  "s0233": "Lai private with Chu Zi Fan, Zi Fan spoke returned Lai to Zheng.",
  "s0234": "Second year, Chu attacked Zheng, Jin troops came save.",
  "s0235": "This year, Dao Gong died, established his younger brother Lai, this was Cheng Gong.",
  "s0236": "Cheng Gong third year, Chu Gong Wang said \"Zheng Cheng Gong orphan has virtue\", made person come allied.",
  "s0237": "Cheng Gong private allied.",
  "s0238": "Autumn, Cheng Gong courted Jin, Jin said \"Zheng private peace with Chu\", seized him.",
  "s0239": "Made Luan Shu attack Zheng.",
  "s0240": "Fourth year spring, Zheng troubled Jin surround, duke Ru then established Cheng Gong concubine elder brother Xu as lord.",
  "s0241": "Its fourth month, Jin heard Zheng established lord, then returned Cheng Gong.",
  "s0242": "Zheng people heard Cheng Gong return, also killed lord Xu, welcomed Cheng Gong.",
  "s0243": "Jin troops departed.",
  "s0244": "Tenth year, betrayed Jin alliance, allied with Chu.",
  "s0245": "Jin Li Gong angered, sent troops attacked Zheng.",
  "s0246": "Chu Gong Wang saved Zheng.",
  "s0247": "Jin Chu battled Yan Ling, Chu troops defeated, Jin shot wounded Chu Gong Wang eye, together stopped departed.",
  "s0248": "Thirteenth year, Jin Dao Gong attacked Zheng, troops at Wei Shang.",
  "s0249": "Zheng city defended, Jin also departed.",
  "s0250": "Fourteenth year, Cheng Gong died, son Min ascended.",
  "s0251": "This was Xi Gong.",
  "s0252": "Xi Gong fifth year, Zheng chancellor Zi Si courted Xi Gong, Xi Gong not honored.",
  "s0253": "Zi Si angered, made cook poison killed Xi Gong, announced to feudal lords \"Xi Gong sudden illness died\".",
  "s0254": "Established Xi Gong son Jia, Jia at time five years old, this was Jian Gong.",
  "s0255": "Jian Gong first year, various dukes plotted wished execute chancellor Zi Si, Zi Si aware, instead completely executed various dukes.",
  "s0256": "Second year, Jin attacked Zheng, Zheng allied, Jin departed.",
  "s0257": "Winter, again allied with Chu.",
  "s0258": "Zi Si feared execution, therefore both close Jin, Chu.",
  "s0259": "Third year, chancellor Zi Si wished self-establish as lord, duke Zi Kong made Wei Zhi kill chancellor Zi Si replace him.",
  "s0260": "Zi Kong moreover wished self-establish.",
  "s0261": "Zi Chan said: \"Zi Si did unacceptable, executed him, now moreover imitate, this chaos no time cease.\"",
  "s0262": "Thereupon Zi Kong followed and chancellored Zheng Jian Gong.",
  "s0263": "Fourth year, Jin angered Zheng allied Chu, attacked Zheng, Zheng allied.",
  "s0264": "Chu Gong Wang saved Zheng, defeated Jin troops.",
  "s0265": "Jian Gong wished peace with Jin, Chu moreover imprisoned Zheng envoy.",
  "s0266": "Twelfth year, Jian Gong angered chancellor Zi Kong monopolized state authority, executed him, made Zi Chan duke.",
  "s0267": "Nineteenth year, Jian Gong went Jin requested Wei lord return, enfeoffed Zi Chan with six cities.",
  "s0268": "Zi Chan declined, received its three cities.",
  "s0269": "Twenty-second year, Wu sent Yan Ling Ji Zi to Zheng, saw Zi Chan like old friend, told Zi Chan said: \"Zheng governors extravagant, difficulty will arrive, governance will reach you.",
  "s0270": "You govern, must with ritual;",
  "s0271": "Not so, Zheng will defeat.\"",
  "s0272": "Zi Chan thick treated Ji Zi.",
  "s0273": "Twenty-third year, various dukes contended favor mutually killed, moreover wished kill Zi Chan.",
  "s0274": "Duke or admonished said: \"Zi Chan benevolent person, Zheng so exist Zi Chan, not kill!\"",
  "s0275": "Then stopped.",
  "s0276": "Twenty-fifth year, Zheng made Zi Chan to Jin, asked Ping Gong illness.",
  "s0277": "Ping Gong said: \"Divined said Shi Shen, Tai Ti for curse, historian not know, dare ask?\"",
  "s0278": "Replied: \"Gao Xin Shi had two sons, elder Yan Bo, younger Shi Shen, resided Kuang Lin, not able, daily grasped weapons mutually attacked.",
  "s0279": "Hou Di not stored, migrated Yan Bo to Shang Qiu, master Chen, Shang people therefore, Chen for Shang star.",
  "s0280": "Migrated Shi Shen to Da Xia, master Shen, Tang people therefore, served Xia, Shang, their later generation Tang Shu Yu.",
  "s0281": "When Wu Wang Yi Jiang just pregnant Da Shu, dreamed emperor told self: 'I command your son called Yu, grant him Tang, belong Shen multiply raise his descendants.'",
  "s0282": "When born had characters on palm said 'Yu', thereupon named him.",
  "s0283": "When Cheng Wang extinguished Tang established Da Shu.",
  "s0284": "Therefore Shen for Jin star.",
  "s0285": "From this see, then Shi Shen, Shen spirit.",
  "s0286": "Former Jin Tian Shi had descendant son Mei, for Xuan Ming teacher, gave birth Yun Ge, Tai Ti.",
  "s0287": "Tai Ti able manage his office, proclaimed Fen, Tao, blocked great marsh, to place Tai Yuan.",
  "s0288": "Emperor used praised him, established at Fen Chuan.",
  "s0289": "Shen, Si, Ru, Huang truly guarded their sacrifices.",
  "s0290": "Now Jin masters Fen Chuan extinguished them.",
  "s0291": "From this see, then Tai Ti, Fen, Tao spirit.",
  "s0292": "However these two not harm lord body.",
  "s0293": "Mountain river spirits, then water drought disaster pray them;",
  "s0294": "Sun moon star spirits, then snow frost wind rain not season pray them;",
  "s0295": "If lord illness, food drink sorrow joy female color born.\"",
  "s0296": "Ping Gong and Shu Xiang said: \"Good, broad knowledge gentleman!\"",
  "s0297": "Thick made ritual for Zi Chan.",
  "s0298": "Twenty-seventh year summer, Zheng Jian Gong courted Jin.",
  "s0299": "Winter, feared Chu Ling Wang strong, moreover courted Chu, Zi Chan followed.",
  "s0300": "Twenty-eighth year, Zheng lord ill, made Zi Chan assemble feudal lords, allied with Chu Ling Wang at Shen, executed Qi Qing Feng.",
  "s0301": "Thirty-sixth year, Jian Gong died, son Ding Gong Ning ascended.",
  "s0302": "Autumn, Ding Gong courted Jin Zhao Gong.",
  "s0303": "Ding Gong first year, Chu duke Qi Ji assassinated his lord Ling Wang self-established, for Ping Wang.",
  "s0304": "Wished practice virtue feudal lords.",
  "s0305": "Returned Ling Wang invaded Zheng land to Zheng.",
  "s0306": "Fourth year, Jin Zhao Gong died, his six dukes strong, gong chamber lowly.",
  "s0307": "Zi Chan told Han Xuan Zi said: \"Govern must with virtue, not forget so established.\"",
  "s0308": "Sixth year, Zheng fire, gong wished pray it.",
  "s0309": "Zi Chan said: \"Not as cultivate virtue.\"",
  "s0311": "Eighth year, Chu crown prince Jian came fled.",
  "s0312": "Tenth year, crown prince Jian with Jin plotted attack Zheng.",
  "s0313": "Zheng killed Jian, Jian son Sheng fled Wu.",
  "s0314": "Eleventh year, Ding Gong went Jin.",
  "s0315": "Jin with Zheng plotted, executed Zhou chaos minister, entered Jing Wang at Zhou.",
  "s0316": "Thirteenth year, Ding Gong died, son Xian Gong Juan ascended.",
  "s0317": "Xian Gong thirteenth year died, son Sheng Gong Sheng ascended.",
  "s0318": "At this time, Jin six dukes strong, invaded seized Zheng, Zheng then weak.",
  "s0319": "Sheng Gong fifth year, Zheng chancellor Zi Chan died, Zheng people all cried wept, grieved like lost relatives.",
  "s0320": "Zi Chan was Zheng Cheng Gong younger son.",
  "s0321": "Person benevolent loved people, served lord loyal thick.",
  "s0322": "Confucius once passed Zheng, with Zi Chan like brothers.",
  "s0323": "When heard Zi Chan died, Confucius wept said: \"Ancient legacy love!\"",
  "s0325": "Eighth year, Jin Fan, Zhong Xing clan rebelled Jin, informed urgent Zheng, Zheng saved them.",
  "s0326": "Jin attacked Zheng, defeated Zheng army at Tie.",
  "s0327": "Fourteenth year, Song Jing Gong extinguished Cao.",
  "s0328": "Twentieth year, Qi Tian Chang assassinated his lord Jian Gong, Chang chancellored Qi.",
  "s0329": "Twenty-second year, Chu Hui Wang extinguished Chen.",
  "s0330": "Confucius died.",
  "s0331": "Thirty-sixth year, Jin Zhi Bo attacked Zheng, took nine cities.",
  "s0332": "Thirty-seventh year, Sheng Gong died, son Ai Gong Yi ascended.",
  "s0333": "Ai Gong eighth year, Zheng people assassinated Ai Gong established Sheng Gong younger brother Chou, this was Gong Gong.",
  "s0334": "Gong Gong third year, three Jin extinguished Zhi Bo.",
  "s0335": "Thirty-first year, Gong Gong died, son You Gong Ji ascended.",
  "s0336": "You Gong first year, Han Wu Zi attacked Zheng, killed You Gong.",
  "s0337": "Zheng people established You Gong younger brother Tai, this was Xu Gong.",
  "s0338": "Xu Gong fifteenth year, Han Jing Hou attacked Zheng, took Yong Qiu.",
  "s0339": "Zheng walled Jing.",
  "s0340": "Sixteenth year, Zheng attacked Han, defeated Han troops at Fu Shu.",
  "s0341": "Twentieth year, Han, Zhao, Wei listed as feudal lords.",
  "s0342": "Twenty-third year, Zheng surrounded Han Yang Di.",
  "s0343": "Twenty-fifth year, Zheng lord killed his chancellor Zi Yang.",
  "s0344": "Twenty-seventh, Zi Yang party together assassinated Xu Gong Tai established You Gong younger brother Yi as lord, this was Zheng Jun.",
  "s0345": "Zheng Jun Yi established second year, Zheng Fu Shu rebelled, again returned Han.",
  "s0346": "Eleventh year, Han attacked Zheng, took Yang Cheng.",
  "s0347": "Twenty-first year, Han Ai Hou extinguished Zheng, annexed its state.",
  "s0348": "Grand Historian says: Speech has \"with authority profit unite, authority profit exhaust then friendship sparse\", Fu Xia is.",
  "s0349": "Fu Xia though with coercion killed Zheng Zi entered Li Gong, Li Gong finally betrayed killed him, this with Jin Li Ke what different?",
  "s0350": "Guarded section like Xun Xi, body died but could not preserve Xi Qi.",
  "s0351": "Change from where come, also many affairs!"
}