{
  "s0155": "You not again speak, will make Si get crime.'",
  "s0156": "Gao said: 'I heard sage people move not constant, follow change from time, see end know beginning, observe finger see return.",
  "s0157": "Things certainly have, how get constant method!",
  "s0158": "Now world power fate hang on Hu Hai, Gao can get will.",
  "s0159": "Moreover from outside control inside called confused, from below control above called thief.",
  "s0160": "Thus autumn frost descend grass flowers fall, water shake move myriad things arise, this inevitable effect.",
  "s0161": "Lord why see late?'",
  "s0162": "Si said: 'I heard Jin change crown prince, three generations not peaceful;",
  "s0163": "Qi Huan brothers contend position, body die executed;",
  "s0164": "Zhou kill relatives, not listen admonishers, state become hill ruins, thus danger state altars: three reverse heaven, ancestral temples not blood food.",
  "s0165": "Si also person, how sufficient plan!'",
  "s0166": "Gao said: 'Above below unite, can long lasting;",
  "s0167": "Inside outside like one, affairs no surface inside.",
  "s0168": "Lord listen minister plan, then long have enfeoff marquis, generations call duke, must have Qiao Song longevity, Kong, Mo wisdom.",
  "s0169": "Now release this not follow, calamity reach sons grandsons, sufficient make cold heart.",
  "s0170": "Good take calamity make fortune, lord where place?'",
  "s0171": "Si then face heaven sigh, hang tears great sigh: 'Alas!",
  "s0172": "Alone encounter chaotic world, already cannot die, where entrust fate!'",
  "s0173": "Thus Si then listened Gao.",
  "s0174": "Gao then reported Hu Hai: 'Minister request follow crown prince bright command report chancellor, chancellor Si dare not follow order!'",
  "s0176": "Thus then mutually planned, falsely as receive Shi Huang decree chancellor, establish son Hu Hai as crown prince.",
  "s0177": "Again made letter grant eldest son Fu Su: 'I tour world, pray sacrifice famous mountains various gods to extend life.",
  "s0178": "Now Fu Su with general Meng Tian lead troops several ten thousand garrison border, ten plus years, cannot advance forward, soldiers much expend, no chi merit, instead repeatedly submit letter straightforward speak slander what I do, with cannot dismiss return be crown prince, day night resentful.",
  "s0179": "Fu Su as person son not filial, grant sword self-suicide!",
  "s0180": "General Tian with Fu Su dwell outside, not correct, should know his plot.",
  "s0181": "As person minister not loyal, grant death, give troops to deputy general Wang Li.'",
  "s0182": "Sealed his letter with emperor seal, sent Hu Hai guest present letter grant Fu Su at Shang commandery.",
  "s0183": "Envoy arrived, opened letter, Fu Su wept, entered inner lodge, wished suicide.",
  "s0184": "Meng Tian stopped Fu Su: 'Your Majesty dwells outside, not established crown prince, made minister lead thirty thousand crowd guard border, crown prince supervise, this world heavy responsibility.",
  "s0185": "Now one envoy come, then suicide, how know not false?",
  "s0186": "Please again request, again request then die, not late.'",
  "s0187": "Envoy repeatedly urged.",
  "s0188": "Fu Su person benevolent, told Meng Tian: 'Father grant son death, still what request!'",
  "s0189": "Then suicide.",
  "s0190": "Meng Tian not willing die, envoy then gave to officials, imprisoned at Yang Zhou.",
  "s0191": "Envoy returned reported, Hu Hai, Si, Gao greatly pleased.",
  "s0192": "Reached Xianyang, issued mourning, crown prince established as Second Emperor.",
  "s0193": "With Zhao Gao as langzhong commander, constantly serve middle manage affairs.",
  "s0194": "Second Emperor secluded feast, then summoned Gao with plan affairs, told: 'Person life dwell world between, like gallop six steeds pass crack.",
  "s0195": "I already oversee world, wish exhaust ears eyes what like, exhaust heart will what happy, to pacify ancestral temples happy myriad surnames, long have world, end my year life, its way can?'",
  "s0196": "Gao said: 'This worthy lord can do, yet confused chaotic lord prohibit.",
  "s0197": "Minister request speak, dare not avoid axe punishment, wish Your Majesty little attentive.",
  "s0198": "That Shaqiu plot, various crown princes and ministers all doubt, various crown princes all emperor brothers, ministers again previous emperor placed.",
  "s0199": "Now Your Majesty initial establish, their intent resentful all not submit, fear become change.",
  "s0200": "Moreover Meng Tian already dead, Meng Yi lead troops dwell outside, minister tremble tremble, only fear not end.",
  "s0201": "Moreover Your Majesty how get do this happy?'",
  "s0202": "Second Emperor said: 'Do what?'",
  "s0203": "Zhao Gao said: 'Strict law harsh punishment, make have crime mutually sit execute, reach confiscate clan, exterminate ministers far relatives;",
  "s0204": "Poor make rich, base make noble.",
  "s0205": "Completely eliminate remove previous emperor old ministers, again place Your Majesty close trusted near them.'"
}
