{
  "s0351": "Crown prince mother Shen Hou woman, yet be queen.",
  "s0352": "After You Wang get Bao Si, love it, desire abolish Shen queen, and remove crown prince Yi Jiu, with Bao Si as queen, Bo Fu as crown prince.",
  "s0353": "Zhou grand historian Bo Yang read history record said: 'Zhou perish.'",
  "s0354": "Previously from Xia Hou clan decline, have two spirit dragons stop at Xia emperor court speak said: 'I, Bao two lords.'",
  "s0355": "Xia emperor divine kill it with leave it with stop it, not auspicious.",
  "s0356": "Divine request its slime yet hide it, then auspicious.",
  "s0357": "Then spread currency yet bamboo inform it, dragon gone yet slime at, box yet leave it.",
  "s0358": "Xia perish, transmit this vessel Yin.",
  "s0359": "Yin perish, again transmit this vessel Zhou.",
  "s0360": "Compare three generation, not dare open it, reach Li Wang end, open yet view it.",
  "s0361": "Slime flow at court, not able remove.",
  "s0362": "Li Wang make women naked yet clamor it.",
  "s0363": "Slime change become black turtle, with enter wang queen palace.",
  "s0364": "Queen palace young maidservant already tooth yet encounter it, already hairpin yet pregnant, no husband yet give birth son, fear yet abandon it.",
  "s0365": "Xuan Wang time young girl song said: 'Bend bow flag serve, actual perish Zhou state.'",
  "s0366": "Then Xuan Wang hear, have couple sell is vessel, Xuan Wang make seize yet execute it.",
  "s0367": "Escape at road, yet see village person queen palace young maidservant abandon demon child exit at road, hear its night cry, pity yet receive it, couple then gone, flee at Bao.",
  "s0368": "Bao person have crime, request enter young maidservant abandon woman at wang to redeem crime.",
  "s0369": "Abandon woman exit at Bao, is Bao Si.",
  "s0370": "When You Wang three years, wang queen palace see yet love it, give birth son Bo Fu, finally abolish Shen queen and crown prince, with Bao Si as queen, Bo Fu as crown prince.",
  "s0371": "Grand historian Bo Yang said: 'Disaster complete, no able what!'",
  "s0373": "Bao Si not good laugh, You Wang desire its laugh ten thousand sides, therefore not laugh.",
  "s0374": "You Wang for beacon fire big drum, have bandit reach then raise beacon fire.",
  "s0375": "Feudal lords all reach, reach yet no bandit, Bao Si then big laugh.",
  "s0376": "You Wang pleased it, for number raise beacon fire.",
  "s0377": "Its after not trust, feudal lords more also not reach.",
  "s0378": "You Wang with Guo Shi Fu as Qing, use affairs, state people all resent.",
  "s0379": "Shi Fu as person flatter crafty good flatter good profit, wang use it.",
  "s0380": "Again abolish Shen queen, remove crown prince.",
  "s0381": "Shen Hou angry, with Zeng, west Yi Quan Rong attack You Wang.",
  "s0382": "You Wang raise beacon fire summon troops, troops not reach.",
  "s0383": "Then kill You Wang Li mountain below, capture Bao Si, complete take Zhou bribe yet leave.",
  "s0384": "Then feudal lords then approach Shen Hou yet together establish former You Wang crown prince Yi Jiu, is Ping Wang, to serve Zhou sacrifice.",
  "s0385": "Ping Wang establish, east move at Luo Yi, avoid Rong bandit.",
  "s0386": "Ping Wang time, Zhou chamber decline weak, feudal lords strong annex weak, Qi, Chu, Qin, Jin begin great, government by square bo.",
  "s0387": "Forty nine years, Lu Yin Gong establish.",
  "s0388": "Fifty one years, Ping Wang die, crown prince Xie Fu early die, establish its son Lin, is Huan Wang.",
  "s0389": "Huan Wang, Ping Wang grandson.",
  "s0390": "Huan Wang three years, Zheng Zhuang Gong court, Huan Wang not ritual.",
  "s0391": "Five years, Zheng resent, with Lu exchange Xu field.",
  "s0392": "Xu field, heavenly son use affairs Tai mountain field.",
  "s0393": "Eight years, Lu kill Yin Gong, establish Huan Gong.",
  "s0394": "Thirteen years, attack Zheng, Zheng shoot injure Huan Wang, Huan Wang go return.",
  "s0395": "Twenty three years, Huan Wang die, son Zhuang Wang Tuo establish.",
  "s0396": "Zhuang Wang four years, Zhou Gong Hei Jian desire kill Zhuang Wang yet establish Wang Zi Ke.",
  "s0397": "Xin Bo inform wang, wang kill Zhou Gong.",
  "s0398": "Wang Zi Ke flee Yan.",
  "s0399": "Fifteen years, Zhuang Wang die, son Xi Wang Hu Qi establish.",
  "s0400": "Xi Wang three years, Qi Huan Gong begin hegemon.",
  "s0401": "Five years, Xi Wang die, son Hui Wang Lang establish."
}
