{
  "s0351": "Gongsun Yang matters Xiao Gong, extreme body no two thoughts, exhaust public not regard private;",
  "s0352": "Set knife saw prohibit adultery evil, believe reward punish to achieve govern;",
  "s0353": "Expose abdomen heart, show true feelings, bear resentment blame, deceive old friends, seize Wei crown prince Ang, secure Qin altars soil, benefit hundred surnames, finally for Qin capture general break enemy, expand land thousand li.",
  "s0354": "Wu Qi matters Dao Wang, make private not harm public, slander not screen loyal, words not take casual agreement, actions not take casual accommodation, not for danger change conduct, act righteousness not avoid difficulty, then became hegemon lord strong state, not decline calamity misfortune.",
  "s0355": "Da Fu Zhong matters Yue Wang, lord though distressed humiliated, all loyal not slack, lord though severed perished, exhaust ability not leave, success not arrogant, noble rich not proud indolent.",
  "s0356": "Like this three persons, certainly righteousness extreme, loyal principle.",
  "s0357": "Thus gentleman with righteousness die difficulty, view death as return;",
  "s0358": "Live humiliated not equal die honored.",
  "s0359": "Scholar certainly have kill body complete name, though righteousness location, though die no regret.",
  "s0360": "What not possible?'",
  "s0362": "Cai Ze said: 'Lord holy minister worthy, world flourishing fortune;",
  "s0362": "Jun enlightened minister straight, state fortune;",
  "s0363": "Father kind son filial, husband trustworthy wife chaste, family fortune.",
  "s0364": "Thus Bi Gan loyal yet cannot preserve Yin, Zi Xu wise yet cannot complete Wu, Shen Sheng filial yet Jin state chaotic.",
  "s0365": "These all have loyal minister filial son, yet state extinguish chaotic, why?",
  "s0366": "No enlightened lord worthy father to listen, thus world with lord father as humiliated pity minister son.",
  "s0367": "Now Shang Jun, Wu Qi, Da Fu Zhong as person minister, is;",
  "s0368": "Lord, not.",
  "s0369": "Thus world praise three persons achieve merit not see virtue, how admire not meet world die?",
  "s0370": "Wait die then can establish loyal complete name, is Wei Zi insufficient benevolent, Confucius insufficient sage, Guan Zhong insufficient great.",
  "s0371": "Person establish merit, how not expect complete whole?",
  "s0372": "Body name together complete, upper.",
  "s0373": "Name can model body die, next.",
  "s0374": "Name in humiliated body complete, lower.'",
  "s0375": "Then Ying Hou praised good.",
  "s0376": "Cai Ze little got leisure, because said: 'Shang Jun, Wu Qi, Da Fu Zhong, as person minister exhaust loyal achieve merit then can wish, Hong Yao serve Wen Wang, Zhou Gong assist Cheng Wang, how not also loyal sage?",
  "s0377": "With jun chen discuss, Shang Jun, Wu Qi, Da Fu Zhong can wish who with Hong Yao, Zhou Gong?'",
  "s0378": "Ying Hou said: 'Shang Jun, Wu Qi, Da Fu Zhong not equal.'",
  "s0379": "Cai Ze said: 'Then jun lord kind benevolent employ loyal, sincere thick old acquaintance, worthy wise with have way scholars as glue lacquer, righteousness not double merit ministers, who with Qin Xiao Gong, Chu Dao Wang, Yue Wang?'",
  "s0380": "Ying Hou said: 'Unknown what like.'",
  "s0381": "Cai Ze said: 'Now jun personally loyal ministers, not over Qin Xiao Gong, Chu Dao Wang, Yue Wang, jun establish wisdom, able for jun secure danger repair politics, govern chaos strong troops, ward off calamity break difficulty, broaden land plant grain, enrich state sufficient family, strong jun, honor altars soil, illustrious ancestral temple, world none dare deceive offend jun, jun might cover shake within seas, merit spread ten thousand li outside, sound name glory transmit thousand generations, jun who with Shang Jun, Wu Qi, Da Fu Zhong?'",
  "s0382": "Ying Hou said: 'Not equal.'",
  "s0383": "Cai Ze said: 'Now jun personally loyal ministers not forget old acquaintance not equal Xiao Gong, Dao Wang, Gou Jian, yet jun merit achievements love trust personal favor again not equal Shang Jun, Wu Qi, Da Fu Zhong, however jun salary position noble flourishing, private family rich over three persons, body not retreat, fear calamity over three persons, secretly for jun dangerous.",
  "s0384": "Saying 'sun middle then shift, moon full then wane'.",
  "s0385": "Things flourishing then decline, heaven earth constant number.",
  "s0386": "Advance retreat full shrink, with time change, sage constant way.",
  "s0387": "Thus 'state have way then serve, state no way then hide'.",
  "s0388": "Sage said 'flying dragon heaven, benefit see adult'.",
  "s0389": "'Not righteous yet rich noble, to me like floating cloud'.",
  "s0390": "Now jun enmity already enemy virtue already repay, intent wish arrive, yet no change plan, secretly for jun not take.",
  "s0391": "Moreover green pheasant, swan, rhino, elephant, place situation not far die, yet what die, confused by bait.",
  "s0392": "Su Qin, Zhi Bo wisdom, not insufficient avoid humiliation far die, yet what die, confused by greedy profit not stop.",
  "s0393": "Thus sage establish ritual section desires, take from people have measure, make with time, use have limit, thus will not overflow, conduct not arrogant, constantly with way together not lose, thus world receive not cease.",
  "s0394": "Formerly Qi Huan Gong nine unite feudal lords, one correct world, to Kui Qiu meeting, had arrogant proud will, rebel nine states.",
  "s0395": "Wu Wang Fu Cha troops no enemy world, brave strong with slight feudal lords, overbear Qi Jin, thus finally with kill body perish state.",
  "s0396": "Xia Yu, Tai Shi Hao shout call fright three armies, however body die at common fellow.",
  "s0397": "These all rode extreme flourishing not return reason, not dwell humble retreat place frugal thrift calamity.",
  "s0398": "Shang Jun for Qin Xiao Gong clarify law commands, prohibit adultery root, honor rank certainly reward, have crime certainly punish, level balances, correct measures, adjust light heavy, break open paths, to quiet give birth people enterprise unify custom, encourage people plow farm profit soil, one room no two matters, exert field store grain, practice battle array matters, thus troops move land broad, troops rest state rich, thus Qin no enemy world, establish might feudal lords, complete Qin state enterprise.",
  "s0399": "Merit already complete, yet finally with cart torn apart.",
  "s0400": "Chu place several thousand li, hold halberds hundred thousand, Bai Qi led several ten thousand troops with Chu battle, one battle raised Yan Ying burn Yi Ling, two battle south combine Shu Han.",
  "s0401": "Again cross Han, Wei attack strong Zhao, north pit Ma Fu, execute slaughter forty plus ten thousand crowd, exhaust at Chang Ping below, flow blood become river, boil sound like thunder, then entered surround Handan, make Qin have imperial enterprise.",
  "s0402": "Chu, Zhao world strong states yet Qin enemy, from this after, Chu, Zhao all awed submit dare not attack Qin, Bai Qi might.",
  "s0403": "Body what subdue seventy plus cities, merit already complete, yet finally grant sword die at Du You.",
  "s0404": "Wu Qi for Chu Dao Wang establish law, humble reduce ministers authority heavy, dismiss no ability, abolish no use, reduce not urgent officials, block private gate requests, unify Chu state custom, prohibit traveler people, refine plow battle scholars, south collect Yang Yue, north combine Chen, Cai, break horizontal scatter vertical, make gallop persuade scholars none open mouth, prohibit cliques encourage hundred surnames, settle Chu state politics, troops shake world, might subdue feudal lords.",
  "s0405": "Merit already complete, yet finally branch torn apart.",
  "s0406": "Da Fu Zhong for Yue Wang deep plan far strategy, avoid Kuaiji danger, with perish as preserve, because humiliation as honor, clear grass enter city, open land plant grain, lead four directions scholars, monopolize up down strength, assist Gou Jian worthy, report Fu Cha enmity, finally capture strong Wu.",
  "s0407": "Make Yue complete hegemon.",
  "s0408": "Merit already illustrious faith, Gou Jian finally betray kill him.",
  "s0409": "These four persons, merit complete not go, calamity arrive this.",
  "s0410": "This called believe yet cannot yield, go yet cannot self return.",
  "s0411": "Fan Li knew, transcend leave world, long as Tao Zhu Gong.",
  "s0412": "Jun alone not observe gamble?",
  "s0413": "Or wish big bet, or wish divide merit, this all jun what enlightened know.",
  "s0414": "Now jun chancellor Qin, plan not descend mat, strategy not out hall temple, sit control feudal lords, benefit extend three rivers, to fill Yi Yang, decide Yang Chang danger, block Taihang way, again cut Fan, Zhong Xing road, six states not able unite vertical, stack path thousand li, through Shu Han, make world all fear Qin, Qin desire got, jun merit extreme, this also Qin divide merit time.",
  "s0415": "Like this not retreat, then Shang Jun, Bai Qi, Wu Qi, Da Fu Zhong is.",
  "s0416": "I heard, 'mirror water see face appearance, mirror person know auspicious misfortune'.",
  "s0417": "Book said 'success below, cannot long place'.",
  "s0418": "Four persons calamity, jun what dwell?",
  "s0419": "Jun what not with this time return chancellor seal, yield worthy give, retreat rock dwell river view, certainly have Bo Yi clean, long as Ying Hou.",
  "s0420": "Generations praise orphan, have Xu You, Yanling Ji Zi yield, Qiao Song longevity, who with calamity end?",
  "s0421": "Then jun what dwell?",
  "s0422": "Bear cannot self separate, doubt cannot self decide, certainly have four persons calamity.'",
  "s0423": "Yi said 'high dragon have regret', this speak ascend cannot descend, believe cannot yield, go cannot self return.'",
  "s0424": "Wish jun carefully plan!'",
  "s0425": "Ying Hou said: 'Good.",
  "s0426": "I heard 'desire yet not know sufficiency, lose what desire;",
  "s0427": "Have yet not know sufficiency, lose what have'.",
  "s0428": "Master fortunate teach, Sui respectfully receive command.'",
  "s0429": "Then prolonged invited enter sit, as upper guest.",
  "s0430": "Later several days, entered court, spoke Qin Zhao Wang: 'Guest newly have from Shandong come called Cai Ze, that person eloquent scholar, enlightened three kings matters, five hegemons enterprise, world custom change, sufficient entrust Qin state politics.",
  "s0431": "Minister see person very many, none equal, minister not equal.",
  "s0432": "Minister dare with hear.'",
  "s0433": "Qin Zhao Wang summoned saw, with spoke, greatly delighted, appointed as guest minister.",
  "s0434": "Ying Hou because thanked illness requested return chancellor seal.",
  "s0435": "Zhao Wang strong raised Ying Hou, Ying Hou then claimed illness lying down.",
  "s0436": "Fan Sui dismissed chancellor, Zhao Wang newly pleased Cai Ze plans, then appointed as Qin chancellor, east took Zhou room.",
  "s0437": "Cai Ze chancellor Qin several months, people or hated him, feared execute, then thanked illness return chancellor seal, number as Gang Cheng Jun.",
  "s0438": "Dwelt Qin ten plus years, served Zhao Wang, Xiao Wen Wang, Zhuang Xiang Wang.",
  "s0439": "Finally served Shi Huang Di, as Qin envoy to Yan, three years Yan made crown prince Dan enter hostage Qin.",
  "s0440": "Grand Historian said: Han Zi praise 'long sleeves good dance, many money good trade', believe this words!",
  "s0441": "Fan Sui, Cai Ze world what called all capable eloquent scholars, however persuade various lords to white head none meet, not strategy clumsy, what do persuade strength little.",
  "s0442": "When two persons fettered traveled entered Qin, successive took minister chancellor, hung merit world, certainly strong weak situation different.",
  "s0443": "However scholar also have coincidental meet, worthy many like these two persons, not get exhaust intent, how can win speak!",
  "s0444": "However two persons not trapped distress how able stimulate?"
}