{
  "s0301": "Thirty six years, Miao Gong again increase thick Meng Ming etc, make will troops attack Jin, cross river burn boat, big defeat Jin people, take Wang Guan and Gao, to report Xiao role.",
  "s0302": "Jin people all wall defend not dare exit.",
  "s0303": "Then Miao Gong then self Mao Jin cross river, seal Xiao middle corpse, become send death, cry it three days.",
  "s0304": "Then oath at army said: 'Jie soldiers!",
  "s0305": "Listen no clamor, I oath inform you.",
  "s0306": "Ancient people plan yellow hair turn turn, then no place pass.'",
  "s0307": "With declare think not use Jian Shu, Bai Li Xi plan, therefore make this oath, make after world with record I pass.",
  "s0308": "Jun zi hear it, all become hang tears, said: 'Jie!",
  "s0309": "Qin Miao Gong with person week, finally get Meng Ming celebration.'",
  "s0311": "Thirty seven years, Qin use You Yu plan attack Rong wang, increase state twelve, open earth thousand li, then ba west Rong.",
  "s0312": "Heavenly son make Zhao Gong pass congratulate Miao Gong with gold drum.",
  "s0313": "Thirty nine years, Miao Gong die, bury Yong.",
  "s0314": "Follow die hundred seventy seven people, Qin good minister Zi Yu clan three people name said Yan Xi, Zhong Xing, Zhen Hu, also at follow die middle.",
  "s0315": "Qin people pity it, for make song yellow bird poem.",
  "s0316": "Jun zi said: 'Qin Miao Gong broad earth increase state, east serve strong Jin, west ba Rong Yi, yet not become feudal lords meng main, also suitable.",
  "s0317": "Die yet abandon people, collect its good minister yet follow die.",
  "s0318": "And previous wang collapse, still leave virtue hang method, moreover seize good person good minister hundred surnames pity?",
  "s0319": "Therefore know Qin not able again east campaign.'",
  "s0320": "Miao Gong son forty people, its crown prince Jiu replace establish, is Kang Gong.",
  "s0321": "Kang Gong first year.",
  "s0322": "Go years Miao Gong die, Jin Xiang Gong also die;",
  "s0323": "Xiang Gong younger brother name Yong, Qin exit, at Qin.",
  "s0324": "Jin Zhao Dun desire establish it, make Sui Hui come welcome Yong, Qin with troops send reach Ling Hu.",
  "s0325": "Jin establish Xiang Gong son yet return strike Qin troops, Qin troops defeat, Sui Hui come flee.",
  "s0326": "Two years, Qin attack Jin, take Wu Cheng, report Ling Hu role.",
  "s0327": "Four years, Jin attack Qin, take Shao Liang.",
  "s0328": "Six years, Qin attack Jin, take Ji Ma.",
  "s0329": "Battle at He Qu, big defeat Jin army.",
  "s0330": "Jin people suffer Sui Hui at Qin become chaos, then make Wei Chou Yu detailed return, combine plot Hui, cheat yet get Hui, Hui then return Jin.",
  "s0331": "Kang Gong establish twelve years die, son Gong Gong establish.",
  "s0332": "Gong Gong two years, Jin Zhao Chuan kill its jun Ling Gong.",
  "s0333": "Three years, Chu Zhuang Wang strong, north troops reach Luo, ask Zhou ding.",
  "s0334": "Gong Gong establish five years die, son Huan Gong establish.",
  "s0335": "Huan Gong three years, Jin defeat I one general.",
  "s0336": "Ten years, Chu Zhuang Wang serve Zheng, north defeat Jin troops at He upper.",
  "s0337": "When is time, Chu ba, become meet meng combine feudal lords.",
  "s0338": "Twenty four years, Jin Li Gong initial establish, with Qin Huan Gong clamp river ally.",
  "s0339": "Return yet Qin double ally, with Di combine plot strike Jin.",
  "s0340": "Twenty six years, Jin lead feudal lords attack Qin, Qin army defeat flee, pursue reach Jing yet return.",
  "s0341": "Huan Gong establish twenty seven years die, son Jing Gong establish.",
  "s0342": "Jing Gong four years, Jin Luan Shu kill its jun Li Gong.",
  "s0343": "Fifteen years, save Zheng, defeat Jin troops at Yue.",
  "s0344": "Is time Jin Dao Gong become meng main.",
  "s0345": "Eighteen years, Jin Dao Gong strong, number meet feudal lords, lead to attack Qin, defeat Qin army.",
  "s0346": "Qin army flee, Jin troops pursue it, then cross Jing, reach Yu Lin yet return.",
  "s0347": "Twenty seven years, Jing Gong like Jin, with Ping Gong ally, already yet back it.",
  "s0348": "Thirty six years, Chu Gong Zi Wei kill its jun yet self establish, is Ling Wang.",
  "s0349": "Jing Gong mother younger brother Hou Zi Zhen have favor, Jing Gong mother younger brother Fu, or slander it, fear punish, then flee Jin, chariot heavy thousand ascend.",
  "s0350": "Jin Ping Gong said: 'Hou Zi Fu like this, why self perish?'",
  "s0351": "Answer said: 'Qin Gong without way, fear punish, desire wait its after world then return.'"
}

