{
  "s0001": "Lian Po was a fine general of Zhao.",
  "s0002": "In the sixteenth year of Zhao King Huiwen, Lian Po served as Zhao general attacking Qi, greatly defeating them, taking Yangjin. He was appointed upper minister, his bravery renowned among the feudal lords.",
  "s0003": "Lin Xiangru was a man of Zhao, serving as retainer to the eunuch director Miao Xian.",
  "s0004": "During Zhao King Huiwen's time, they obtained the jade disk of Chu's He family.",
  "s0005": "Qin King Zhao heard of this and sent someone with a letter to Zhao king, wishing to exchange fifteen cities for the jade disk.",
  "s0006": "The Zhao king consulted with grand general Lian Po and the ministers: wishing to give it to Qin, fearing the cities could not be obtained, only being deceived;",
  "s0007": "Wishing not to give it, then worried about Qin's troops coming.",
  "s0008": "The plan undecided, they sought someone who could be sent to reply to Qin, but none found.",
  "s0009": "Eunuch director Miao Xian said: 'My retainer Lin Xiangru can be sent.'",
  "s0010": "The king asked: 'How do you know this?'",
  "s0011": "He replied: 'I once committed a crime and secretly planned to flee to Yan. My retainer Xiangru stopped me, saying: \"How do you know the Yan king?\"'",
  "s0012": "I told him: \"I once accompanied the great king to meet the Yan king at the border. The Yan king privately grasped my hand, saying 'I wish to befriend you'.\"",
  "s0013": "With this I know him, thus wished to go.'",
  "s0014": "Xiangru told me: 'Zhao is strong and Yan weak, and you are favored by the Zhao king, thus the Yan king wishes to befriend you.",
  "s0015": "Now you flee Zhao for Yan, Yan fears Zhao, the situation certainly dares not keep you, but will bind you and return you to Zhao.'",
  "s0016": "You should rather expose your flesh and submit to the axe to beg forgiveness, then fortunately escape.'",
  "s0017": "I followed his plan, the great king also fortunately pardoned me.",
  "s0018": "I secretly consider him a brave man with wisdom and strategy, suitable to send.'",
  "s0019": "Thus the king summoned and saw Lin Xiangru, asking: 'The Qin king wishes to exchange fifteen cities for my jade disk. Should I give it or not?'",
  "s0020": "Xiangru said: 'Qin is strong and Zhao weak, cannot but agree.'",
  "s0021": "The king said: 'If they take my jade disk but not give me cities, what then?'",
  "s0022": "Xiangru said: 'If Qin seeks the jade disk with cities but Zhao does not agree, the fault lies with Zhao.'",
  "s0023": "If Zhao gives the jade disk but Qin does not give Zhao cities, the fault lies with Qin.'",
  "s0024": "Between these two strategies, better to agree and let Qin bear the fault.'",
  "s0025": "The king said: 'Who can be sent?'",
  "s0026": "Xiangru said: 'If Your Majesty has no one, I wish to carry the jade disk and go as envoy.'",
  "s0027": "If cities enter Zhao, the jade disk stays in Qin;",
  "s0028": "If cities do not enter, I beg to return the intact jade disk to Zhao.'",
  "s0029": "The Zhao king thus sent Xiangru carrying the jade disk west into Qin.",
  "s0030": "The Qin king sat at Zhangtai to receive Xiangru. Xiangru presented the jade disk to the Qin king.",
  "s0031": "The Qin king was greatly pleased, passed it to show the beauties and attendants. The attendants all called ten thousand years.",
  "s0032": "Xiangru saw the Qin king had no intention of paying Zhao cities, thus stepped forward saying: 'The jade disk has a flaw, please let me show Your Majesty.'",
  "s0033": "The king gave the jade disk. Xiangru thus held the jade disk and stepped back, leaning against a pillar, his hair bristling and lifting his hat, telling the Qin king: 'Your Majesty wished to obtain the jade disk, sent people with letters to the Zhao king. The Zhao king summoned all ministers to discuss, all saying \"Qin is greedy, relying on its strength, seeking the jade disk with empty words, fearing the cities cannot be obtained.\"'",
  "s0034": "The discussion did not wish to give Qin the jade disk.",
  "s0035": "I considered that even commoners' friendships do not deceive each other, how much more great states!",
  "s0036": "Moreover, for one jade disk's sake to offend strong Qin's favor is unacceptable.",
  "s0037": "Thus the Zhao king purified himself for five days, sent me carrying the jade disk, bowing to send the letter in the court.",
  "s0038": "Why?",
  "s0039": "To honor the great state's prestige and show respect.",
  "s0040": "Now I arrive, Your Majesty receives me in the side hall, the etiquette very arrogant.",
  "s0041": "Obtaining the jade disk, passing it to beauties to play with and mock me.",
  "s0042": "I see Your Majesty has no intention of paying Zhao king cities, thus I take back the jade disk.",
  "s0043": "If Your Majesty wishes to force me, my head today will shatter with the jade disk against the pillar!'",
  "s0044": "Xiangru held the jade disk glaring at the pillar, wishing to smash it.",
  "s0045": "The Qin king feared he would break the jade disk, thus apologized profusely and earnestly requested, summoned officials to spread maps, pointing out from here onward fifteen commanderies to give Zhao.",
  "s0046": "Xiangru judged the Qin king only used deceitful display to give Zhao cities, truly unobtainable, thus told the Qin king: 'The He family jade disk is a treasure transmitted by the world. The Zhao king feared, dared not not offer it.'",
  "s0047": "When the Zhao king sent the jade disk, he purified himself five days. Now Your Majesty should also purify himself five days, set the nine-rank court in the hall, then I dare present the jade disk.'",
  "s0048": "The Qin king considered it, ultimately could not forcibly seize, thus agreed to purify five days, housed Xiangru in Guangcheng hostel.",
  "s0049": "Xiangru judged though the Qin king purified, he would certainly break the agreement not pay cities, thus had his followers dress in coarse cloth, hide the jade disk in their robes, escape by byways, return the jade disk to Zhao.",
  "s0050": "The Qin king after five days of purification, then set the nine-rank ceremony in the hall, summoned the Zhao envoy Lin Xiangru."
}