{
  "s0051": "When Zhao Kuo arrived, he led troops out to attack the Qin army.",
  "s0052": "The Qin army feigned defeat and retreated, deploying two surprise forces to ambush them.",
  "s0053": "Zhao troops pursued their victory, chasing right up to Qin's walls.",
  "s0054": "The walls held firm and could not be entered. Meanwhile, Qin's 25,000 surprise troops cut off Zhao's rear, and another force of 5,000 cavalry cut across Zhao's walls. Zhao's army was divided in two, and their grain route was cut.",
  "s0055": "Qin then sent light troops to attack them.",
  "s0056": "Zhao fought unsuccessfully and built fortifications to defend firmly, awaiting rescue.",
  "s0057": "When the King of Qin heard that Zhao's food routes were cut, he went personally to Henei, granted each commoner one rank in nobility, and mobilized all men fifteen and older to go to Changping to block Zhao's rescue forces and supplies.",
  "s0058": "By the ninth month, Zhao troops had gone forty-six days without food. They all secretly killed and ate each other.",
  "s0059": "They came to attack Qin's fortifications, wishing to break out.",
  "s0060": "They formed four teams and repeatedly tried four or five times, but could not break out.",
  "s0061": "Their general Zhao Kuo led elite troops out to fight personally. Qin troops shot and killed Zhao Kuo.",
  "s0062": "Kuo's army was defeated. 400,000 troops surrendered to Lord Wu'an.",
  "s0063": "Lord Wu'an calculated: 'Previously Qin had conquered Shangdang, but the Shangdang people were unhappy serving Qin and went to Zhao.",
  "s0064": "Zhao troops are fickle.",
  "s0065": "If we don't kill them all, they may cause rebellion.'",
  "s0066": "So he used deception to bury and kill them all alive, sending only the young ones—240 people—back to Zhao.",
  "s0067": "In total, they beheaded and captured 450,000 men before and after.",
  "s0068": "Zhao was greatly shaken.",
  "s0069": "In the tenth month of the forty-eighth year, Qin reestablished Shangdang Commandery.",
  "s0070": "Qin divided their army into two: Wang He attacked Pi Lao and conquered it;",
  "s0071": "Sima Geng pacified Taiyuan.",
  "s0072": "Han and Zhao were afraid and sent Su Dai with rich bribes to persuade Qin's prime minister Lord Ying, saying: 'Has Lord Wu'an captured Ma Fuzi?'",
  "s0073": "'Yes.'",
  "s0074": "'Will he now besiege Handan?'",
  "s0075": "'Yes.'",
  "s0076": "'If Zhao perishes, the King of Qin will become hegemon. Lord Wu'an will become one of the Three Dukes.",
  "s0077": "Lord Wu'an's victories for Qin—conquering over seventy cities, pacifying Yan and Ying in the south, taking Hanzhong, capturing Zhao Kuo's army in the north—even the achievements of Zhou Gong, Shao Gong, and Lu Wang would not surpass this.",
  "s0078": "Now if Zhao perishes and the King of Qin becomes hegemon, Lord Wu'an will certainly become one of the Three Dukes. Can you serve beneath him?",
  "s0079": "Even if you don't want to serve beneath him, you will have no choice.'",
  "s0080": "Qin once attacked Han, besieged Xingqiu, and trapped Shangdang. The Shangdang people all rebelled and went to Zhao. The world has long been unhappy being Qin's subjects.",
  "s0081": "Now if Zhao perishes, the northern lands will go to Yan, the eastern lands to Qi, the southern lands to Han and Wei—then how many subjects will you gain?",
  "s0082": "Therefore better to take advantage of this and divide territories without letting Lord Wu'an claim the merit.'",
  "s0083": "Lord Ying then spoke to the King of Qin: 'Our troops are weary. Please allow us to accept Han and Zhao's territorial concessions for peace, and let our soldiers rest.'",
  "s0084": "The king listened and accepted Han's Huan Yong and six Zhao cities for peace.",
  "s0085": "In the first month, they all disbanded their armies.",
  "s0086": "Lord Wu'an heard of this and from then on had enmity with Lord Ying.",
  "s0087": "In the ninth month, Qin sent troops again, dispatching grand master Wang Ling to attack Zhao's Handan.",
  "s0088": "At this time Lord Wu'an was ill and could not go.",
  "s0089": "In the first month of the forty-ninth year, Ling attacked Handan with little success. Qin sent more troops to assist Ling.",
  "s0090": "Ling's troops lost five battalions.",
  "s0091": "Lord Wu'an recovered from illness. The King of Qin wished to send Lord Wu'an to replace Ling as commander.",
  "s0092": "Lord Wu'an said: 'Handan is truly not easy to attack.",
  "s0093": "Moreover, allied rescue forces arrive daily. Those allies have long resented Qin.",
  "s0094": "Now although Qin broke the Changping army, over half our troops died, and the homeland is empty.",
  "s0095": "To cross distant rivers and mountains to contest another's capital—Zhao responding from within, allies attacking from without—Qin army will certainly be broken.",
  "s0096": "It cannot be done.'",
  "s0097": "The king personally commanded it, but he did not go.",
  "s0098": "He sent Lord Ying to request it. Lord Wu'an firmly refused and would not go, claiming illness.",
  "s0099": "The king sent Wang He to replace Ling as commander. In the eighth and ninth months they besieged Handan but could not conquer it.",
  "s0100": "Chu sent Lord Chunshen and Wei sent its prince to lead tens of thousands of troops to attack Qin forces. Qin forces suffered many losses."
}

