{
  "s0001": "Meng Tian, his ancestor Qi person.",
  "s0002": "Tian grandfather Meng Ao, from Qi served Qin Zhao Wang, office to upper minister.",
  "s0003": "Qin Zhuangxiang Wang first year, Meng Ao as Qin general, attacked Han, took Chenggao, Xingyang, established three rivers commandery.",
  "s0004": "Second year, Meng Ao attacked Zhao, took thirty seven cities.",
  "s0005": "Shi Huang third year, Meng Ao attacked Han, took thirteen cities.",
  "s0006": "Fifth year, Meng Ao attacked Wei, took twenty cities, established Dong commandery.",
  "s0007": "Shi Huang seventh year, Meng Ao died.",
  "s0008": "Ao son called Wu, Wu son called Tian.",
  "s0009": "Tian once studied prison law literature.",
  "s0010": "Shi Huang twenty-third year, Meng Wu as Qin deputy general, with Wang Jian attacked Chu, greatly broke it, killed Xiang Yan.",
  "s0011": "Twenty-fourth year, Meng Wu attacked Chu, captured Chu king.",
  "s0012": "Meng Tian younger brother Yi.",
  "s0013": "Shi Huang twenty-sixth year, Meng Tian because family background got as Qin general, attacked Qi, greatly broke it, appointed as inner shi.",
  "s0014": "Qin already united world, then made Meng Tian lead thirty thousand crowd north pursue Rong Di, took Henan.",
  "s0015": "Built long wall, according to terrain, used control dangerous passes, rose Lintao, to Liaodong, extended ten thousand plus li.",
  "s0016": "Thus crossed river, occupied Yang mountain, winding snake north.",
  "s0017": "Exposed troops outside ten plus years, dwelt Shang commandery.",
  "s0018": "At time Meng Tian might shook Xiongnu.",
  "s0019": "Shi Huang much honored favored Meng clan, trusted considered worthy them.",
  "s0020": "Yet personally close Meng Yi, position to upper minister, out then accompany chariot, enter then before throne.",
  "s0021": "Tian in charge outer affairs yet Yi constantly as inner plans, named loyal trustworthy, thus though various generals chancellors none dared contend with them.",
  "s0022": "Zhao Gao, various Zhao distant branch.",
  "s0023": "Zhao Gao brothers several persons, all born hidden palace, mother suffered punishment executed, generations low base.",
  "s0024": "Qin king heard Gao strong forceful, versed in prison law, raised as middle chariot bureau commander.",
  "s0025": "Gao already privately served crown prince Hu Hai, taught decide cases.",
  "s0026": "Gao had great crime, Qin king commanded Meng Yi govern treat it.",
  "s0027": "Yi dared not bend law, should Gao crime die, removed his eunuch register.",
  "s0028": "Emperor because Gao devoted to affairs, pardoned him, restored his office rank.",
  "s0029": "Shi Huang wished tour world, road Jiu Yuan, straight reach Gan Quan, then made Meng Tian open road, from Jiu Yuan to Gan Quan, trench mountains fill valleys, thousand eight hundred li.",
  "s0030": "Road not completed.",
  "s0031": "Shi Huang thirty-seventh year winter, traveled out tour Kuaiji, along sea, north went Langye.",
  "s0032": "Road sick, made Meng Yi return pray mountains rivers, not returned.",
  "s0033": "Shi Huang reached Shaqiu collapsed, secret it, ministers none knew.",
  "s0034": "At time chancellor Li Si, crown prince Hu Hai, middle chariot bureau commander Zhao Gao constantly followed.",
  "s0035": "Gao usually got favored by Hu Hai, wished establish him, again resented Meng Yi governed treated him not for self.",
  "s0036": "Because had thief heart, then with chancellor Li Si, crown prince Hu Hai secretly plotted, established Hu Hai as crown prince.",
  "s0037": "Crown prince already established, sent envoy with crime granted crown prince Fu Su, Meng Tian die.",
  "s0038": "Fu Su already died, Meng Tian doubted yet again requested it.",
  "s0039": "Envoy with Meng Tian gave officials, changed placed.",
  "s0040": "Hu Hai with Li Si retainer as protect army.",
  "s0041": "Envoy returned reported, Hu Hai already heard Fu Su died, then wished release Meng Tian.",
  "s0042": "Zhao Gao feared Meng clan again noble employ affairs, resented them.",
  "s0043": "Yi returned arrived, Zhao Gao because for Hu Hai loyal planned, wished extinguish Meng clan, then spoke: 'Minister heard previous emperor wished raise worthy establish crown prince long, yet Yi advised 'cannot'.",
  "s0044": "If knew worthy yet deliberately not establish, then not loyal confused lord.",
  "s0045": "With minister foolish intent, not equal execute him.'",
  "s0046": "Hu Hai listened imprisoned Meng Yi at Dai.",
  "s0047": "Before already imprisoned Meng Tian at Yang Zhou.",
  "s0048": "Funeral reached Xianyang, already buried, crown prince established as Second Emperor, yet Zhao Gao close, day night slander hated Meng clan, sought their crimes faults, raised impeached them.",
  "s0049": "Zi Ying advanced admonished: 'Minister heard former Zhao Wang Qian killed his worthy minister Li Mu yet used Yan Ju, Yan Wang Xi secretly used Jing Ke plan yet broke Qin alliance, Qi Wang Jian killed his former generation loyal minister yet used Hou Sheng discussion.",
  "s0050": "These three lords, all each with change ancient lost their states calamity reached their bodies."
}

