{
  "s0206": "This then hidden virtue returns to Your Majesty, harm removed and treacherous plots blocked, ministers none not covered in favor, receive thick virtue, Your Majesty then high pillow free will indulge pleasure.",
  "s0207": "Plan none better than this.'",
  "s0208": "Second Emperor approved Zhao Gao's words, then changed to make laws.",
  "s0209": "Thus ministers various crown princes have crime, immediately sent to Gao, commanded investigate treat them.",
  "s0210": "Killed ministers Meng Yi etc., crown princes twelve executed die Xianyang market, ten princesses executed die at Du, wealth property entered county official, mutually connected punished cannot count.",
  "s0211": "Crown prince Gao wished flee, feared confiscate clan, then submitted letter said: 'Previous emperor without illness time, minister enter then granted food, exit then ride carriage.",
  "s0212": "Imperial storehouse clothes, minister got granted;",
  "s0213": "Middle stable treasure horses, minister got granted.",
  "s0214": "Minister should follow die yet cannot, as person son not filial, as person minister not loyal.",
  "s0215": "Not loyal no name to stand in world, minister request follow die, wish bury Li mountain foot.",
  "s0216": "Only above fortunately pity it.'",
  "s0217": "Letter submitted, Hu Hai greatly pleased, summoned Zhao Gao showed it, said: 'This can call urgent?'",
  "s0218": "Zhao Gao said: 'Person minister should worry die not leisure, what change get plot!'",
  "s0219": "Hu Hai approved his letter, granted money ten thousand to bury.",
  "s0220": "Laws orders punish execute increasingly harsh deep, ministers people self-dangerous, wished rebel many.",
  "s0221": "Again built Epang palace, managed direct roads, galloping roads, taxes levies increasingly heavy, garrison labor without end.",
  "s0222": "Thus Chu garrison soldiers Chen Sheng, Wu Guang etc. then made chaos, rose from east of mountains, outstanding talented mutually established, self-appointed as marquises kings, rebelled Qin, troops reached Hongmen then retreated.",
  "s0223": "Li Si several times wished request leisure admonish, Second Emperor not permitted.",
  "s0224": "Yet Second Emperor blamed questioned Li Si said: 'I have private discussion and have heard from Han Zi, said 'Yao's having world, hall high three chi, colored rafters not carved, thatched roof not trimmed, though traveler inn stay not more diligent than this.",
  "s0225": "Winter wear deer fur, summer wear hemp clothes, coarse grain food, smartweed mallow soup, eat clay jar, drink clay bowl, though gatekeeper nourishment not poorer than this.",
  "s0226": "Yu dug Longmen, connected Da Xia, dredged nine rivers, curved nine dikes, decided stagnant water led to sea, thigh no flesh, shin no hair, hands feet calloused, face eyes darkened, thus died outside, buried at Kuaiji, minister captive labor not fiercer than this.'",
  "s0227": "Yet then what valued in having world, how wish bitter form labor spirit, body place traveler inn stay, mouth eat gatekeeper nourishment, hand hold minister captive work?",
  "s0228": "This unworthy person what strive, not worthy person what manage.",
  "s0229": "That worthy person having world, monopolize use world suit self already, this what valued in having world.",
  "s0230": "That called worthy person, must can pacify world govern myriad people, now body moreover cannot benefit, will how can govern world!",
  "s0231": "Pen I wish grant will broad desires, long enjoy world without harm, do what?'",
  "s0232": "Li Si son You as three rivers guard, crowd bandits Wu Guang etc. west seize land, passed not could prohibit.",
  "s0233": "Zhang Han with broken pursued Guang etc. troops, envoys repeatedly examined three rivers mutually connected, blamed reproached Si occupy three dukes position, how make bandits like this.",
  "s0234": "Li Si feared frightened, heavy nobility salary, not know where out, then flattered Second Emperor intent, wished seek favor, with letter replied said:",
  "s0235": "Worthy lord, must moreover can complete way execute supervise responsibility method.",
  "s0236": "Supervise responsibility them, then ministers dare not not exhaust ability to follow their lord.",
  "s0237": "This minister lord division decided, above below righteousness clear, then world worthy unworthy none dare not exhaust strength exhaust duty to follow their ruler.",
  "s0238": "Thus lord alone controls world without controlled.",
  "s0239": "Can exhaust pleasure extreme, worthy enlightened lord, can not examine!",
  "s0240": "Thus Shen Zi said 'have world not indulge wantonly, name it make world fetters' , no other, cannot supervise responsibility, yet look with body labor at world people, like Yao, Yu, thus called 'fetters'.",
  "s0241": "Cannot cultivate Shen, Han clear method, execute supervise responsibility way, monopolize make world suit self, yet vainly manage bitter form labor spirit, with body follow hundred surnames, then is black heads servitude, not rear world, what sufficient value!",
  "s0242": "With person follow self, then self noble person base;",
  "s0243": "With self follow person, then self base person noble.",
  "s0244": "Thus follow person base, person what followed noble, self ancient to now, not have not so.",
  "s0245": "All ancient what make honor worthy, for their noble;",
  "s0246": "What make hate unworthy, for their base.",
  "s0247": "Yet Yao, Yu with body follow world, because follow honor them, then also lose what make honor worthy heart, can call great wrong.",
  "s0248": "Call as 'fetters', not also suitable?",
  "s0249": "Cannot supervise responsibility excess.",
  "s0250": "Thus Han Zi said: 'Benevolent mother have defeated son strict family no disobedient servants' , why?",
  "s0251": "Then can punish add must.",
  "s0252": "Thus Shang Jun method, punish abandon ash on road.",
  "s0253": "Abandon ash, thin crime, yet suffer punish, heavy penalty.",
  "s0254": "They only enlightened lord can deep supervise light crime.",
  "s0255": "Crime light moreover supervise deep, moreover have heavy crime?"
}

