{
  "s0051": "I secretly observed the former king's actions, saw his heart surpassed the lords of the age, thus borrowed credentials from Wei to personally be examined in Yan.",
  "s0052": "The former king mistakenly promoted me, placing me among the guests, establishing me above the ministers, not consulting father or brothers, appointing me second minister.",
  "s0053": "I secretly did not understand myself, thinking I followed commands and teachings, could fortunately avoid crime, thus accepted the command without declining.",
  "s0054": "The former king commanded me: 'I have accumulated resentment and deep anger toward Qi, not measuring my weakness, wishing to make Qi my affair.'",
  "s0055": "I said: 'Qi is the remaining enterprise of a hegemon state and the legacy of the most victorious.",
  "s0056": "Skilled in armor and weapons, practiced in battle and attack.",
  "s0057": "If Your Majesty wishes to attack it, must plan with the world.",
  "s0058": "Planning with the world, nothing better than allying with Zhao.",
  "s0059": "Moreover Huai north and Song territory are what Chu and Wei desire. If Zhao agrees and unites the four states to attack, Qi can be greatly broken.'",
  "s0060": "The former king considered it correct, prepared tallies and credentials, sending me south as envoy to Zhao.",
  "s0061": "Returning with the reply, raised troops to attack Qi.",
  "s0062": "By heaven's way and the former king's spirit, the lands north of the Yellow River followed the former king and were raised at Ji.",
  "s0063": "The army at Ji received command to attack Qi, greatly defeating the Qi people.",
  "s0064": "Light troops and sharp soldiers drove straight to the capital.",
  "s0065": "The Qi king fled to Ju, barely escaping with his life.",
  "s0066": "Pearls, jade, treasures, carriages, armor, precious vessels—all entered Yan.",
  "s0067": "Qi vessels displayed at Ning Terrace, great bells arrayed at Yuan Ying, ancient tripods returned to the stone chamber, Jizhou plants planted at Wen bamboo—from the Five Hegemons onward, none achieved merit matching the former king.",
  "s0068": "The former king was satisfied in his ambitions, thus divided land to enfeoff him, allowing him to equal the small state feudal lords.",
  "s0069": "I secretly did not understand myself, thinking I followed commands and teachings, could fortunately avoid crime, thus accepted the command without declining.",
  "s0070": "I have heard that worthy and sage lords establish merit without abandoning it, thus recorded in the Spring and Autumn Annals.",
  "s0071": "Scholars who early understand establish fame without destroying it, thus praised in later generations.",
  "s0072": "Like the former king's revenge and washing away shame, leveling a ten thousand chariot strong state, collecting eight hundred years of accumulations—until the day he abandoned his ministers, his remaining teachings did not decline. The governing ministers who handle affairs refine laws and commands, are cautious with heirs, extend to the lowest servants—all can instruct later generations.",
  "s0073": "I have heard that those skilled at beginning are not necessarily skilled at completing, those good at starting are not necessarily good at ending.",
  "s0074": "In former times Wu Zixu advised Helu and was heeded, Wu king far reached Ying.",
  "s0075": "Fuchai did not follow this, granted him the owl stomach and floated him on the river.",
  "s0076": "Wu king did not realize the earlier advice could establish merit, thus drowned Zixu without regret.",
  "s0077": "Zixu did not early see his lord's different measure, thus reached floating on the river without change.",
  "s0078": "Saving myself and establishing merit to illuminate the former king's traces—this is my highest plan.",
  "s0079": "Avoiding slanders of destruction and disgrace, tarnishing the former king's name—this is my great fear.",
  "s0080": "Facing unpredictable crime to seek personal profit—righteousness does not dare go there.",
  "s0081": "I have heard that ancient gentlemen, when friendship ends, do not speak ill.",
  "s0082": "Loyal ministers leaving their state do not cleanse their names.",
  "s0083": "Though I am unworthy, I have repeatedly received teachings from gentlemen.",
  "s0084": "I fear the attendants favor the close attendants' words, do not examine distant conduct, thus dare to present this letter to inform. May Your Majesty pay attention.",
  "s0085": "Thus Yan king again made Yue Yi's son Yue Xian Lord Changguo.",
  "s0086": "Yue Yi traveled back and forth maintaining relations with Yan. Yan and Zhao employed him as guest minister.",
  "s0087": "Yue Yi died in Zhao.",
  "s0088": "Yue Xian resided in Yan over thirty years. Yan King Hui favored using his prime minister Li Fu's plans, wishing to attack Zhao, and asked Lord Changguo Yue Xian.",
  "s0089": "Yue Xian said: 'Zhao is a nation of four frontiers, its people practiced in warfare. Attacking it is not possible.'",
  "s0090": "Yan king did not listen, thus attacked Zhao.",
  "s0091": "Zhao sent Lian Po to attack them, greatly defeating Li Fu's army at Gao, capturing Li Fu and Yue Cheng.",
  "s0092": "Yue Cheng was Yue Xian's clan member.",
  "s0093": "Thus Yue Xian fled to Zhao. Zhao then besieged Yan.",
  "s0094": "Yan heavily ceded land to make peace with Zhao. Zhao then withdrew.",
  "s0095": "Yan king regretted not using Yue Xian. Yue Xian being in Zhao, sent Yue Xian a letter: 'In Zhou's time, Ji Zi was not used, committed remonstrance without tiring, hoping for his listening.",
  "s0096": "Shang Rong was not accepted, personally endured disgrace, hoping for change.",
  "s0097": "When the people's will did not enter, prisoners released themselves, then the two scholars retired and hid.",
  "s0098": "Thus Zhou bore the burden of Jie-like tyranny, the two scholars did not lose their loyal sage names.",
  "s0099": "Why?",
  "s0100": "Their concern and suffering were complete."
}

