{
  "s0102": "Bi xia though obtain Lian Po, Li Mu, not able use.'",
  "s0103": "Shang anger, rise enter jin zhong.",
  "s0104": "Good long, summon Tang let said: 'Gong what zhong ru I, alone no jian place?'",
  "s0105": "Tang thank said: 'Bi person not know ji hui.'",
  "s0107": "When this time, Xiong Nu new big enter Chao Na, kill Bei Di du wei Ang.",
  "s0108": "Shang with Hu kou become yi, then finally again ask Tang said: 'Gong what with know my cannot use Lian Po, Li Mu?'",
  "s0109": "Tang answer said: 'Chen hear shang gu wang zhe send jiang, gui yet tui gu, said kun with inner, gua ren zhi it;",
  "s0110": "Kun with outer, jiang jun zhi it.",
  "s0111": "Jun merit jue shang all decide at outer, return yet zou it.",
  "s0112": "This not xu speak.'",
  "s0113": "Chen da fu speak, Li Mu become Zhao jiang dwell border, jun shi rent all self use xiang shi, shang ci decide at outer, not follow zhong rao.",
  "s0114": "Wei ren yet ze success gong, therefore Li Mu then obtain jin its zhi neng, send xuan che qian san bai sheng, gou qi wan san qian, bai jin shi shi wan, is with north zhu Chan Yu, break Dong Hu, mie Dan Lin, west yi qiang Qin, south zhi Han, Wei.",
  "s0115": "When this time, Zhao ji ba.",
  "s0116": "Its after meet Zhao wang Qian establish, its mother chang.",
  "s0117": "Wang Qian establish, then use Guo Kai chan, finally kill Li Mu, make Yan Ju replace it.",
  "s0118": "Is with bing break shi north, become Qin place qin mie.",
  "s0119": "Now chen qie hear Wei Shang become Yun Zhong shou, its jun shi rent jin with xiang shi zu, si yang qian, five days one zhui niu, xiang bin ke jun li she ren, is with Xiong Nu far bi, not near Yun Zhong sai.",
  "s0120": "Bu once enter, Shang lead che qi strike it, place kill its zhong.",
  "s0121": "Fu shi zu jin home ren zi, rise field middle follow jun, settle know chi ji wu fu.",
  "s0122": "Zhong day li zhan, cut shou bu lu, shang gong mo fu, one speak not xiang ying, wen li with law sheng it.",
  "s0123": "Its shang not walk yet li feng fa bi yong.",
  "s0124": "Chen yu, with bi xia fa tai ming, shang tai qing, fa tai zhong.",
  "s0125": "And Yun Zhong shou Wei Shang sit shang gong shou lu cha liu ji, bi xia descend li, xue its jue, fa zuo it.",
  "s0126": "By this speak, bi xia though obtain Lian Po, Li Mu, not able use.'",
  "s0127": "Chen cheng yu, chu ji hui, die crime die crime!'",
  "s0128": "Wen Di shuo.",
  "s0129": "Is day make Feng Tang hold jie she Wei Shang, again become Yun Zhong shou, yet appoint Tang become che qi du wei, zhu zhong wei and jun state che shi.",
  "s0130": "Seven years, Jing Di establish, with Tang become Chu xiang, free.",
  "s0131": "Wu Di establish, seek xian liang, raise Feng Tang.",
  "s0132": "Tang time year ninety remain, cannot again become official, then with Tang zi Feng Sui become lang.",
  "s0133": "Sui zi Wang Sun, also qi shi, with yu shan.",
  "s0134": "Tai shi gong said: Zhang Ji zhi speak chang person, shou fa not e yi;",
  "s0135": "Feng Gong zhi lun jiang shuai, have wei!",
  "s0136": "Have wei!",
  "s0137": "Speak said 'not know its person, see its friend'.",
  "s0138": "Two jun place praise song, able zhu lang miao.",
  "s0139": "Book said 'not pian not dang, wang dao dang dang;",
  "s0140": "Not dang not pian, wang dao bian bian'.",
  "s0141": "Zhang Ji, Feng Gong near it."
}