{
  "s0021": "King allowed it.",
  "s0022": "After half a year, people all raised their own chariots.",
  "s0023": "This did not teach yet people followed their transformation, near ones saw and imitated, far ones from four sides gazed and modeled after.",
  "s0024": "Therefore three times obtained prime minister yet not happy, knew his talent self-obtained;",
  "s0025": "Three times left prime minister yet not regretted, knew not his own crime.",
  "s0026": "Zi Chan was Zheng's ranking grand master.",
  "s0027": "During Zheng Zhao Jun's time, because he favored Xu Zhi as prime minister, state was chaotic, superiors and inferiors not close, fathers and sons not harmonious.",
  "s0028": "Da Gong Zi Qi spoke to the jun, made Zi Chan prime minister.",
  "s0029": "As prime minister one year, youths did not play improperly, elderly did not carry burdens, children did not plow boundaries.",
  "s0030": "Two years, market not falsely priced.",
  "s0031": "Three years, gates not closed at night, roads not picked up lost items.",
  "s0032": "Four years, farming tools not returned.",
  "s0033": "Five years, scholars no false records, mourning periods not commanded yet orderly.",
  "s0034": "Governed Zheng twenty six years and died, able-bodied men wailed, elders wept like children, said: 'Zi Chan leaves us to die!",
  "s0035": "People will go where?'",
  "s0037": "Gong Yi Xiu was a Lu doctor.",
  "s0038": "With high merit became Lu prime minister.",
  "s0039": "Devoted to law following principle, no changes, hundred officials self-corrected.",
  "s0040": "Made salary receivers not compete with common people for profit, receiving great not take small.",
  "s0041": "Guest had one who gifted prime minister fish, prime minister not receive.",
  "s0042": "Guest said: 'Heard jun likes fish, gifted jun fish, why not receive?'",
  "s0043": "Prime minister said: 'Because like fish, therefore not receive.",
  "s0044": "Now as prime minister, can self-supply fish;",
  "s0045": "Now receive fish and resign, who again supply me fish?",
  "s0046": "I therefore not receive.'",
  "s0048": "Ate greens yet beautiful, pulled his garden mallows and abandoned them.",
  "s0049": "Saw his family weave cloth well, and angrily expelled his family woman, burned her loom, said 'want to make farmers scholars artisans women where sell their goods?'",
  "s0050": "Shi She was Chu Zhao Wang's prime minister.",
  "s0051": "Firm upright incorruptible, no partiality avoidance.",
  "s0052": "Patrolling commandery, road had murderer, prime minister pursued, was his father.",
  "s0053": "Released his father and returned self-bound.",
  "s0054": "Made person speak to wang: 'Murderer, minister's father.",
  "s0055": "With father establish politics, not filial;",
  "s0056": "Waste law release crime, not loyal;",
  "s0057": "Minister crime deserves death.'",
  "s0058": "Wang said: 'Pursued yet not caught, should not bear crime, son manage affairs.'",
  "s0059": "Shi She said: 'Not favor own father, not filial son;",
  "s0060": "Not follow jun law, not loyal minister.",
  "s0061": "Wang pardon his crime, upper benevolence;",
  "s0062": "Bear execution die, minister duty.'",
  "s0063": "Then not accept order, self-cut throat die.",
  "s0064": "Li Li was Jin Wen Gong's judge.",
  "s0065": "Mistakenly heard killed person, self-bound deserved death.",
  "s0066": "Wen Gong said: 'Official has noble base, punishment has light heavy.",
  "s0067": "Lower official has error, not son's crime.'",
  "s0068": "Li Li said: 'Minister dwell official as chief, not with officials yield position;",
  "s0069": "Receive salary as many, not with below divide profit.",
  "s0070": "Now mistaken heard kill person, shift crime to lower official, not what heard.'",
  "s0071": "Declined not accept order.",
  "s0072": "Wen Gong said: 'Son then self consider have crime, sha ren also have crime?'",
  "s0073": "Li Li said: 'Judge has law, lose punishment then punish, lose death then death.",
  "s0074": "Gong with minister able listen subtle decide doubt, therefore make judge.",
  "s0075": "Now mistaken heard kill person, crime deserves death.'",
  "s0076": "Then not accept order, prostrate sword die.",
  "s0077": "Grand Historian said: Sun Shu Ao exit one word, Ying market restore.",
  "s0078": "Zi Chan sick die, Zheng people wail cry.",
  "s0079": "Gong Yi Zi see good cloth yet family woman expel.",
  "s0080": "Shi She release father yet die, Chu Zhao name establish.",
  "s0081": "Li Li mistaken kill yet prostrate sword, Jin Wen with correct state law."
}

