{
  "s0001": "King Wei Man of Joseon was originally a man of Yan.",
  "s0002": "From the beginning when Yan was intact, they often raided and controlled Zhendan and Joseon, establishing officials and building barrier forts.",
  "s0003": "Qin destroyed Yan, and it became part of the outer defenses of Liaodong.",
  "s0004": "When Han arose, because it was distant and difficult to defend, they repaired the old Liaodong border fortifications, using the Hun River as the boundary, and assigned it to Yan.",
  "s0005": "When Yan king Lu Wan rebelled and fled to the Xiongnu, Wei Man fled, gathered over a thousand followers, braided their hair and wore barbarian clothing, and went east out of the passes, crossed the Hun River, and settled in the old Qin empty lands between the upper and lower barriers, gradually subjugating Zhendan, Joseon barbarians, and former Yan and Qi fugitives, ruling them from Wanggeom Fortress.",
  "s0006": "During the time of Emperor Hui and Empress Gao, when the world was first pacified, the Liaodong governor made an agreement with Wei Man to serve as an outer subject, protecting the barbarians outside the border and preventing them from raiding the frontier;",
  "s0007": "Any barbarian chiefs who wished to enter and see the Son of Heaven should not be prohibited.",
  "s0008": "This was reported to the emperor, who approved it, so Wei Man used military might and wealth to invade and subjugate neighboring small settlements, and Zhendan and Lintun all came to submit and belong to him, covering several thousand square li.",
  "s0009": "He passed it to his son and grandson Right Channel, who lured ever more Han fugitives, and never once entered to pay respects;",
  "s0010": "The neighboring countries like Zhendan wished to submit memorials to see the Son of Heaven, but he blocked and obstructed them from communicating.",
  "s0011": "In the second year of Yuanshou, Han sent She He to reproach Right Channel, but he ultimately refused to obey the imperial edict.",
  "s0012": "He left and reached the border at the Hun River, had his chariot driver stab and kill the Joseon vice-king Chang who was escorting him, then immediately crossed and galloped into the passes, returning to report to the Son of Heaven saying 'killed the Joseon general'.",
  "s0013": "The emperor, for the beauty of his name, did not investigate, and appointed He as the Dongbu prefect of Liaodong.",
  "s0014": "Joseon resented He, sent troops to attack and kill him.",
  "s0015": "The Son of Heaven recruited criminals to attack Joseon.",
  "s0016": "That autumn, he sent the Tower Ship General Yang Pu from Qi by sea across the Bohai;",
  "s0017": "With 50,000 troops, and the Left General Xun Zhi from Liaodong to attack Right Channel.",
  "s0018": "Right Channel sent troops to defend the dangerous passes.",
  "s0019": "The Left General's army officers, led by Du Zheng, first charged with the Liaodong troops, were defeated and scattered, many retreated and fled, so Du Zheng was executed by law.",
  "s0020": "The Tower Ship General led 7,000 Qi troops and arrived first at Wanggeom Fortress."
}

