{
  "s0081": "Made people question, indeed Yu Rang.",
  "s0082": "Thus Xiangzi numbered Yu Rang: 'You not formerly served Fan, Zhonghang clans?",
  "s0083": "Zhi Bo completely exterminated them, yet you not avenge enmity, instead submitted ministered Zhi Bo.",
  "s0084": "Zhi Bo also died, yet you alone why avenge so deep?'",
  "s0085": "Yu Rang said: 'Minister served Fan, Zhonghang clans, Fan, Zhonghang clans all common people treated me, I thus common people repay.",
  "s0086": "As for Zhi Bo, state knight treated me, I thus state knight repay.'",
  "s0087": "Xiangzi sighed deeply wept: 'Alas Yu child!",
  "s0088": "You for Zhi Bo, name already completed, my pardon you also sufficient.",
  "s0089": "You self-plan, I no longer release you!'",
  "s0090": "Made troops surround him.",
  "s0091": "Yu Rang said: 'I heard enlightened lord not conceal others' beauty, loyal minister has die for fame righteousness.",
  "s0092": "Former lord already generously pardoned minister, world none not praise lord's worthiness.",
  "s0093": "Today matter, minister certainly submit to execution, yet wish request lord's robe strike it, thus realize avenge intention, then though die not regret.",
  "s0094": "Not dare hope, dare bare heartfelt!'",
  "s0095": "Thus Xiangzi greatly considered righteous, made envoy hold robe give Yu Rang.",
  "s0096": "Yu Rang drew sword three leaps struck it, said: 'I can below repay Zhi Bo!'",
  "s0097": "Thus fell sword suicide.",
  "s0098": "Died day, Zhao state righteous scholars heard, all wept for him.",
  "s0099": "After forty plus years then Zhi had Nie Zheng affair.",
  "s0100": "Nie Zheng was Zhi Shenjing li person.",
  "s0101": "Killed person avoided enmity, with mother, sister went to Qi, took butchering as occupation.",
  "s0102": "Long time, Puyang Yan Zhongzi served Han Ai Hou, with Han minister Xia Lei had grudge.",
  "s0103": "Yan Zhongzi feared execution, fled departed, traveled sought person can avenge Xia Lei.",
  "s0104": "Reached Qi, Qi people some spoke Nie Zheng brave warrior, avoided enmity hid among butchers.",
  "s0105": "Yan Zhongzi reached door requested, several times returned, then prepared wine self-toasted before Nie Zheng mother.",
  "s0106": "Wine flowing, Yan Zhongzi offered yellow gold hundred yi, presented Nie Zheng mother longevity.",
  "s0107": "Nie Zheng startled strange his thickness, firmly declined Yan Zhongzi.",
  "s0108": "Yan Zhongzi firmly advanced, Nie Zheng declined said: 'Minister fortunately have aged mother, family poor, guest travel as dog butcher, can morning evening obtain sweet broth nourish parents.",
  "s0109": "Parents nourishment complete, dare not accept Zhongzi's gift.'",
  "s0110": "Yan Zhongzi dismissed people, thus spoke Nie Zheng: 'Minister have enmity, traveled feudal lords many;",
  "s0111": "Yet reached Qi, secretly heard your righteousness very high, thus advanced hundred jin gold, will use as adult coarse food expense, able befriend your joy, how dare have request expectation!'",
  "s0112": "Nie Zheng said: 'Minister reason lower ambition humble body dwell market butcher, merely fortunately nourish aged mother;",
  "s0113": "Aged mother in, Zheng body not dare promise others.'",
  "s0114": "Yan Zhongzi firmly urged, Nie Zheng ultimately would not accept.",
  "s0115": "Yet Yan Zhongzi completed host guest ritual departed.",
  "s0116": "Long time, Nie Zheng mother died.",
  "s0117": "Already buried, removed mourning, Nie Zheng said: 'Alas!",
  "s0118": "Zheng is market person, beats knife butchers;",
  "s0119": "Yan Zhongzi is feudal lords' minister, not far thousand li, bent chariot rode befriend minister.",
  "s0120": "Minister treated him, extremely shallow few, not have great merit can match, yet Yan Zhongzi offered hundred jin gold as parents longevity. I though not accept, yet this merely deeply knows Zheng.",
  "s0121": "Worthy person with moved resent glare intention, personally trust poor remote person, yet Zheng alone how can silently already!",
  "s0122": "Moreover previous invited Zheng, Zheng merely because aged mother;",
  "s0123": "Aged mother now heaven years ended, Zheng will for knower use.'",
  "s0124": "Thus west reached Puyang, saw Yan Zhongzi said: 'Previous not permitted Zhongzi, merely because parents in;",
  "s0125": "Now unfortunately mother heaven years ended.",
  "s0126": "Zhongzi desired avenge enmity for who?",
  "s0127": "Please able follow affairs!'",
  "s0128": "Yan Zhongzi completely told: 'Minister's enmity Han minister Xia Lei, Xia Lei again Han lord's younger uncle, clan numerous, dwelling guard weapons very equipped, minister wished make person stab him, finally none could succeed.",
  "s0129": "Now you fortunately not abandon, please increase chariot riders strong warriors can be your assistants.'",
  "s0130": "Nie Zheng said: 'Han and Wei, distance between not very far, now kill person's minister, minister again state lord's relative, this situation cannot many people, many people cannot without alive captured lost, alive captured lost then words leak, words leak is Han whole state with Zhongzi as enmity, how not dangerous!'"
}

