{
  "s0152": "When this time, Yan, Qi, Chu heard Zhao urgent, all came save.",
  "s0153": "Zhang Ao also north collected Dai troops, got ten thousand plus persons, came, all walled Chen Yu side, not dared attack Qin.",
  "s0154": "Xiang Yu troops several times cut Zhang Han passageway, Wang Li army lacked provisions, Xiang Yu all led troops crossed river, then broke Zhang Han.",
  "s0155": "Zhang Han led troops retreated, various lords army then dared attack surrounded Julu Qin army, then captured Wang Li.",
  "s0156": "She Jian suicide.",
  "s0157": "Finally preserved Julu, Chu strength.",
  "s0158": "Then Zhao king Xie, Zhang Er then able exit Julu, thanked various lords.",
  "s0159": "Zhang Er with Chen Yu met, blamed reproached Chen Yu with not willing save Zhao, and asked Zhang Yi, Chen Ze location.",
  "s0160": "Chen Yu angered: 'Zhang Yi, Chen Ze with certain die blamed minister, minister made lead five thousand first test Qin army, all perished not out.'",
  "s0161": "Zhang Er not believed, considered killed them, several times asked Chen Yu.",
  "s0162": "Chen Yu angered: 'Not expected lord hope minister deep!",
  "s0163": "How with minister heavy abandon general?'",
  "s0164": "Then removed untied seal ribbon, pushed gave Zhang Er.",
  "s0165": "Zhang Er also astonished not accepted.",
  "s0166": "Chen Yu rose like latrine.",
  "s0167": "Guest had persuaded Zhang Er: 'Minister heard 'Heaven give not take, instead receive its misfortune'.",
  "s0168": "Now Chen general give lord seal, lord not accept, instead heaven not auspicious.",
  "s0169": "Urgent take it!'",
  "s0170": "Zhang Er then wore his seal, collected his banner under.",
  "s0171": "Yet Chen Yu returned, also hoped Zhang Er not yield, then hurried out.",
  "s0172": "Zhang Er then collected his troops.",
  "s0173": "Chen Yu alone with banner under good several hundred persons river upper marsh middle fished hunted.",
  "s0174": "By this Chen Yu, Zhang Er then had rift.",
  "s0175": "Zhao king Xie again dwelt Xindu.",
  "s0176": "Zhang Er followed Xiang Yu various lords entered pass.",
  "s0177": "Han first year second month, Xiang Yu established various lords kings, Zhang Er elegantly wandered, people many for him spoke, Xiang Yu also originally several times heard Zhang Er worthy, then divided Zhao established Zhang Er as Changshan king, governed Xindu.",
  "s0178": "Xindu changed name Xiangguo.",
  "s0179": "Chen Yu guests many persuaded Xiang Yu: 'Chen Yu, Zhang Er one body have merit to Zhao.'",
  "s0180": "Xiang Yu because Chen Yu not followed entered pass, heard him at Nanpi, then with Nanpi side three counties sealed him, yet moved Zhao king Xie king Dai.",
  "s0181": "Zhang Er to country, Chen Yu increasingly angered, said: 'Zhang Er with Yu merit equal, now Zhang Er king, Yu alone marquis, this Xiang Yu not fair.'",
  "s0182": "When Qi king Tian Rong rebelled Chu, Chen Yu then made Xia Shuo persuade Tian Rong: 'Xiang Yu as world overseer not fair, exhausted king various generals good land, moved former kings king bad land, now Zhao king then dwelt Dai!",
  "s0183": "Wish king lend minister troops, please with Nanpi as defense screen.'",
  "s0184": "Tian Rong wished plant party at Zhao to rebel Chu, then sent troops followed Chen Yu.",
  "s0185": "Chen Yu because all three counties troops attacked Changshan king Zhang Er.",
  "s0186": "Zhang Er defeated fled, thought various lords none could return, said: 'Han king with I have old friendship, yet Xiang Yu again strong, established me, I wish Chu.'",
  "s0187": "Gan Gong said: 'Han king enter pass, five stars gathered Dongjing.",
  "s0188": "Dongjing, Qin portion.",
  "s0189": "First arrive certainly hegemon.",
  "s0190": "Chu though strong, later certainly belong Han.'",
  "s0191": "Thus Er fled Han.",
  "s0192": "Han king also returned settled three Qin, just surrounded Zhang Han Fei Qiu.",
  "s0193": "Zhang Er met Han king, Han king thick treated him.",
  "s0194": "Chen Yu already defeated Zhang Er, all again collected Zhao land, welcomed Zhao king at Dai, again as Zhao king.",
  "s0195": "Zhao king virtue Chen Yu, established him as Dai king.",
  "s0196": "Chen Yu considered Zhao king weak, country initial settled, not went country, stayed assisted Zhao king, yet made Xia Shuo with chancellor guard Dai.",
  "s0197": "Han second year, east attacked Chu, made envoy told Zhao, wished with together.",
  "s0198": "Chen Yu said: 'Han kill Zhang Er then follow.'",
  "s0199": "Then Han king sought similar Zhang Er persons beheaded them, held their heads sent Chen Yu.",
  "s0200": "Chen Yu then sent troops helped Han.",
  "s0201": "Han defeated at Pengcheng west, Chen Yu also again knew Zhang Er not dead, then betrayed Han."
}
