{
  "s0101": "Fifteen years later, Huang Xie spoke to the King of Chu: 'The northern Huai region borders Qi, affairs there are urgent. Please make it a commandery for convenience.'",
  "s0102": "Thus he annexed and offered the twelve counties of northern Huai.",
  "s0103": "He requested enfeoffment in the Jiangdong region.",
  "s0104": "King Kaolie granted it.",
  "s0105": "Lord Chunshen built a city on the old ruins of Wu, making it his own capital city.",
  "s0106": "Lord Chunshen became prime minister of Chu. At this time Qi had Lord Mengchang, Zhao had Lord Pingyuan, Wei had Lord Xinling, all competing to humble themselves before scholars, recruiting retainers to rival and undermine each other, assisting their states and wielding power.",
  "s0107": "Lord Chunshen served as Chu's prime minister for four years when Qin broke Zhao's Changping army of over 400,000.",
  "s0108": "In the fifth year, they besieged Handan.",
  "s0109": "Handan urgently appealed to Chu. Chu sent Lord Chunshen leading troops to rescue them. The Qin troops also withdrew. Lord Chunshen returned.",
  "s0110": "Lord Chunshen served as prime minister for eight years, leading Chu's northern campaign to destroy Lu, appointing Xun Qing as magistrate of Lanling.",
  "s0111": "At this time, Chu grew strong again.",
  "s0112": "Lord Pingyuan of Zhao sent someone to Lord Chunshen. Lord Chunshen housed him in the upper guest quarters.",
  "s0113": "The Zhao envoy wished to impress Chu, making a cap of green jade, decorating sword hilts and scabbards with pearls and jade, requesting to present them to Lord Chunshen's retainers.",
  "s0114": "Lord Chunshen had over three thousand retainers. His upper retainers all wore pearl-embroidered shoes to meet the Zhao envoy. The Zhao envoy was greatly ashamed.",
  "s0115": "Lord Chunshen served as prime minister for fourteen years when Qin established King Zhuangxiang, appointing Lü Buwei as prime minister, enfeoffing him as Lord Wenxin.",
  "s0116": "They took Eastern Zhou.",
  "s0117": "Lord Chunshen served as prime minister for twenty-two years. The feudal lords, troubled by Qin's endless attacks, united in alliance to attack Qin westward. The King of Chu served as alliance leader, with Lord Chunshen managing affairs.",
  "s0118": "They reached Hangu Pass. Qin sent troops to attack. The allied troops all fled in defeat.",
  "s0119": "King Kaolie of Chu blamed Lord Chunshen. Lord Chunshen thus became increasingly distant.",
  "s0110": "A retainer from Guanjin named Zhu Ying told Lord Chunshen: 'People all consider Chu strong and Your Lordship makes it weak, but in Zhu Ying's view it is not so.",
  "s0121": "In the previous king's time, being friendly with Qin for twenty years without attacking Chu—why?",
  "s0122": "Qin crossing the Meng Pass to attack Chu is inconvenient.",
  "s0123": "Borrowing the road through the two Zhous, turning their back on Han and Wei to attack Chu, is impossible.",
  "s0124": "Now it is different. Wei will perish any day, cannot cherish Xu and Yanling. They will allow Wei to cede them to Qin.",
  "s0125": "Qin troops are only 160 li from Chen. What I observe is that Qin and Chu will battle daily.'",
  "s0126": "Chu thus abandoned Chen and moved to Shouchun.",
  "s0127": "Qin moved Wei's capital to Yewang, establishing Dongjun commandery.",
  "s0128": "Lord Chunshen thus went to his enfeoffment in Wu, continuing to manage prime ministerial affairs.",
  "s0129": "King Kaolie of Chu had no sons. Lord Chunshen worried about this and sought women suitable for bearing children to present to him—very many, but ultimately no sons.",
  "s0130": "A man from Zhao named Li Yuan brought his younger sister, wishing to present her to the King of Chu. Hearing she was not suitable for bearing children, he feared she would not gain favor for long.",
  "s0131": "Li Yuan sought service with Lord Chunshen as a retainer. After a while he requested leave to return home, deliberately missing his deadline.",
  "s0132": "When he returned to audience, Lord Chunshen asked about the situation. He replied: 'The King of Qi sent an envoy to seek my younger sister. I drank with the envoy, thus missed the deadline.'",
  "s0133": "Lord Chunshen said: 'Have you betrothed her?'",
  "s0134": "He replied: 'Not yet.'",
  "s0135": "Lord Chunshen said: 'Can I see her?'",
  "s0136": "'Yes.'",
  "s0137": "Thus Li Yuan presented his younger sister, who was favored by Lord Chunshen.",
  "s0138": "Knowing she was pregnant, Li Yuan plotted with his younger sister.",
  "s0139": "Li Yuan's younger sister took advantage of an intimate moment to advise Lord Chunshen: 'The King of Chu values and favors Your Lordship more than brothers.",
  "s0140": "Now Your Lordship has been prime minister of Chu for over twenty years, yet the king has no sons. After a hundred years he will establish brothers, then when Chu establishes new rulers, each will value their old associates. How can Your Lordship remain favored forever?",
  "s0141": "It is not just empty talk. Your Lordship has been noble and in power for long, has offended the king's brothers many times. If brothers truly ascend, disaster will reach Your Lordship. How can you preserve the prime minister's seal and Jiangdong enfeoffment?",
  "s0142": "Now I know I am pregnant, yet no one knows.",
  "s0143": "I have been favored by Your Lordship not long. If you truly use Your Lordship's influence to present me to the King of Chu, the king will certainly favor me.",
  "s0144": "If heaven grants me a son, then Your Lordship's son becomes king. The whole Chu state can be obtained—who compares to facing uncertain crimes?'",
  "s0145": "Lord Chunshen greatly agreed. He sent Li Yuan's younger sister out, carefully housed her and spoke of her to the King of Chu.",
  "s0146": "The King of Chu summoned her and favored her. She bore a son, established as crown prince, making Li Yuan's younger sister queen.",
  "s0147": "The King of Chu valued Li Yuan, who wielded power.",
  "s0148": "Li Yuan having brought his younger sister in, established as queen and her son as crown prince, feared Lord Chunshen would leak the secret and become even more arrogant. He secretly raised assassins, wishing to kill Lord Chunshen to silence him. Many in the state knew of this.",
  "s0149": "Lord Chunshen served as prime minister for twenty-five years. King Kaolie of Chu fell ill.",
  "s0150": "Zhu Ying told Lord Chunshen: 'The world has blessings that come without expectation, and disasters that come without expectation.",
  "s0151": "Now Your Lordship lives in a time without expectations, serving a lord without expectations. How can you lack a person without expectations?'",
  "s0152": "Lord Chunshen said: 'What are blessings without expectation?'",
  "s0153": "'Your Lordship has been prime minister of Chu for over twenty years. Though nominally prime minister, you are truly the king of Chu.",
  "s0154": "Now the King of Chu is ill, will die any day. Your Lordship assists the young ruler and takes over the state, ascending the throne like Yi Yin and the Duke of Zhou. When the king matures you return power. If not, you face south and proclaim yourself ruler, possessing Chu.",
  "s0155": "This is called blessing without expectation.'",
  "s0156": "Lord Chunshen said: 'What is disaster without expectation?'",
  "s0157": "'Li Yuan does not govern the state but is Your Lordship's enemy. Not raising troops but nurturing assassins for a long time. When the King of Chu dies, Li Yuan will certainly enter first, seize power and kill Your Lordship to silence him.",
  "s0158": "This is called disaster without expectation.'",
  "s0159": "Lord Chunshen said: 'What is a person without expectation?'",
  "s0160": "He replied: 'Appoint me as your attendant. When the King of Chu dies, Li Yuan will certainly enter first. I will kill Li Yuan for Your Lordship.",
  "s0161": "This is called a person without expectation.'",
  "s0162": "Lord Chunshen said: 'I will place you there. Li Yuan is a weak man. I also treat him well. How could it come to this!'",
  "s0163": "Zhu Ying knew his words would not be used and feared disaster would reach him, so he fled.",
  "s0164": "Seventeen days later, King Kaolie of Chu died. Li Yuan indeed entered first, hiding assassins within the Thorn Gate.",
  "s0165": "Lord Chunshen entered the Thorn Gate. Li Yuan's assassins attacked from both sides, beheading Lord Chunshen and throwing his head outside the Thorn Gate.",
  "s0166": "Thus they ordered officials to completely exterminate Lord Chunshen's family.",
  "s0167": "Li Yuan's younger sister, who had been pregnant by Lord Chunshen when presented to the king, gave birth to the son who was established, becoming King You of Chu.",
  "s0168": "This year, Qin Shihuang had been established for nine years.",
  "s0169": "Liao Ai also caused disorder in Qin, was discovered, his three clans exterminated, and Lü Buwei dismissed.",
  "s0170": "The Grand Historian says: I traveled to Chu and viewed Lord Chunshen's old city—how magnificent its palaces!",
  "s0171": "At first, Lord Chunshen's persuasion of King Zhao of Qin, and risking his life to send the Chu crown prince home—how clear his wisdom!",
  "s0172": "Later he was manipulated by Li Yuan—how confused!",
  "s0173": "The saying goes: 'When you should cut, don't cut, and you suffer chaos in return.'",
  "s0174": "Does this refer to Lord Chunshen missing Zhu Ying's advice?"
}
