{
  "s0105": "Moreover Qi certainly decides at Liaocheng, you do not recount again.",
  "s0106": "Now Chu Wei jointly retreat from Qi, yet Yan rescue not arrived.",
  "s0107": "With complete Qi troops, no world strategy, together with Liaocheng endure year of exhaustion, then I see you cannot obtain.",
  "s0108": "Moreover Yan state greatly chaotic, ruler ministers lose plan, superiors inferiors confused. Li Fu with 100,000 troops five defeats outside, with ten thousand chariot state besieged by Zhao, territory reduced lord distressed, become world ridicule.",
  "s0109": "State exhausted disasters many, people no heart to return.",
  "s0110": "Now you again with exhausted Liaocheng people resist complete Qi troops, this is Mo Di's defense.",
  "s0111": "Eat people boil bones, soldiers no return outward heart, this is Sun Bin's troops.",
  "s0112": "Can be seen in world.",
  "s0113": "Although, planning for you, better preserve chariots armor to repay Yan.",
  "s0114": "Chariots armor preserved return to Yan, Yan king certainly pleased.",
  "s0115": "Body preserved return to state, officers people like seeing parents, friends wave arms discuss in world, merit can be bright.",
  "s0116": "Above assist orphan lord to control ministers, below nourish people to provide persuaders, correct state change customs, merit name can establish.",
  "s0117": "Or abandon intention donate Yan abandon world, east travel to Qi?",
  "s0118": "Divide land determine fief, rich equal Tao, Wei, generations call solitary, with Qi long exist, another plan.",
  "s0119": "These two plans, manifest name thick substance. Wish you detailed plan carefully choose one.",
  "s0120": "Moreover I heard, those who reject small profits cannot complete honored name, those who hate small shame cannot establish great merit.",
  "s0121": "In former times Guan Yi Wu shot Duke Huan hit hook, usurpation;",
  "s0122": "Abandoned Prince Jiu could not die, cowardice;",
  "s0123": "Bound fettered, disgrace.",
  "s0124": "Like these three conducts, world lords not minister to, villages not connect.",
  "s0125": "If Guan Zi imprisoned not come out, body died not return to Qi, then name also unavoidably become disgraced person base conduct.",
  "s0126": "Even servants ashamed to share name, how much more common people!",
  "s0127": "Yet Guan Zi not ashamed body in fetters but ashamed world not ordered, not ashamed not die Prince Jiu but ashamed prestige not believed by feudal lords, thus combined three conducts' faults became five hegemons first, name high world illuminate neighboring states.",
  "s0128": "Cao Zi as Lu general, three battles three retreats, lost land 500 li.",
  "s0129": "If Cao Zi planned not look back, discussed not turn heel, cut neck die, then name also unavoidably become defeated army captured general.",
  "s0130": "Cao Zi abandoned three retreats' shame, retreated with Lu lord plan.",
  "s0131": "Duke Huan assembled world, met feudal lords. Cao Zi with one sword duty, supported Duke Huan heart on altar above, complexion not change, speech not chaotic. Three battles' lost land one morning recovered, world shook, feudal lords astonished, prestige added Wu, Yue.",
  "s0132": "Like these two scholars, not cannot complete small integrity practice small shame, considering kill body lose form, cut off generation extinguish posterity, merit name not establish, not wise.",
  "s0133": "Thus abandon sensed anger resentment, establish lifetime name.",
  "s0134": "Abandon resentful regret conduct, determine successive generations merit.",
  "s0135": "Therefore enterprise contends with three kings flow, name with heaven earth endures.",
  "s0136": "Wish you choose one carry out.'",
  "s0137": "Yan general saw Lu Zhonglian letter, wept three days, hesitated could not decide himself.",
  "s0138": "Wished return Yan, already had gap, feared execution.",
  "s0139": "Wished surrender Qi, those killed captured by Qi very many, feared after surrender then humiliated.",
  "s0140": "Sighed deeply: 'Let others kill me, rather I kill myself.'",
  "s0141": "Thus committed suicide.",
  "s0142": "Liaocheng chaotic, Tian Dan thus slaughtered Liaocheng.",
  "s0143": "Returned spoke of Lu Zhonglian, wished to ennoble him.",
  "s0144": "Lu Zhonglian fled hid on seacoast, said: 'I with wealth nobility yet yield to others, rather poverty low lighten world unrestrained ambition.'",
  "s0145": "Zou Yang was a man of Qi.",
  "s0146": "Traveled in Liang, befriended former Wu man Zhuang Ji Fuzi, Huaiyin Mei Sheng and others.",
  "s0147": "Submitted writing was introduced between Yang Sheng, Gongsun Gui.",
  "s0148": "Sheng and others envied Zou Yang, slandered to Liang King Xiao.",
  "s0149": "King Xiao angered, sent to officials, wished to kill him.",
  "s0150": "Zou Yang guest traveled, because slander captured, feared death implicate, thus from prison submitted writing:"
}
