{
  "s0001": "Gao Zu was from Zhongyangli in Feng township, Pei, with the surname Liu and given name Ji.",
  "s0002": "His father was called the Grand Duke; his mother was called Dame Liu.",
  "s0003": "Previously his mother Dame Liu was resting by the embankment of a great marsh and dreamed she encountered a spirit.",
  "s0004": "At that time there was thunder and lightning with darkness; the Grand Duke went to look and saw a scaly dragon above her.",
  "s0005": "Soon after she became pregnant and gave birth to Gao Zu.",
  "s0006": "Gao Zu as a person had a high-bridged nose and dragon-like countenance, fine whiskers and beard, and seventy-two black moles on his left thigh.",
  "s0007": "He was benevolent and loved people, delighted in giving, and his spirit was open and expansive.",
  "s0008": "He always had a generous nature and did not attend to his family's productive work.",
  "s0009": "When he grew up, he tested for official service and became Pavilion Head of Sishui; among the clerks of the court there was none he did not treat familiarly or make sport of; he loved wine and women.",
  "s0010": "He often bought wine on credit from Dame Wang and Wu Fu; when drunk and lying down, Wu Fu and Dame Wang saw that above him there was always a dragon—they found this strange.",
  "s0011": "Whenever Gao Zu bought and lingered drinking, the wine debt would be multiplied several times.",
  "s0012": "When they saw these strange signs, at year's end these two households would always tear up the debt markers and forgive the debt.",
  "s0013": "Gao Zu once went on corvée duty to Xianyang and took the opportunity to observe; seeing the Emperor of Qin, he sighed deeply and said: \"Ah, a great man should be like this!\"",
  "s0015": "Lü Gong of Shanfu was on good terms with the Pei magistrate; fleeing from a vendetta he came to lodge with him and consequently made his home in Pei.",
  "s0016": "The heroic gentlemen and officials of Pei heard that the magistrate had an important guest and all went to offer congratulations.",
  "s0017": "Xiao He was the supervising clerk in charge of reception; he issued orders to all the gentlemen saying: \"Those whose gifts are less than a thousand cash shall sit in the lower hall.\"",
  "s0018": "Gao Zu as Pavilion Head had always treated the officials casually, so he falsely wrote on his visiting card 'Gift of ten thousand cash,' though he actually carried not a single coin.",
  "s0019": "When the card was sent in, Lü Gong was greatly surprised, rose, and welcomed him at the gate.",
  "s0020": "Lü Gong liked reading people's physiognomy; seeing Gao Zu's appearance, he consequently held him in high regard, invited him in, and seated him.",
  "s0021": "Xiao He said: \"Liu Ji is always full of grand talk but accomplishes little.\"",
  "s0022": "Gao Zu then treated the guests familiarly and sat in the seat of honor without any humility.",
  "s0023": "When the wine was exhausted, Lü Gong signaled with his eyes to make Gao Zu stay.",
  "s0024": "Gao Zu finished the wine and remained after.",
  "s0025": "Lü Gong said: \"I have long liked reading physiognomy and have read many people, but none compare to Ji's; I hope Ji will take care of himself.",
  "s0026": "I have a daughter and wish her to be Ji's humble wife.\"",
  "s0027": "When the wine ended, Dame Lü was angry at Lü Gong, saying: \"You always wanted to treat this daughter as exceptional and give her to a noble person.",
  "s0028": "The Pei magistrate is on good terms with you and sought her but you did not give her—why do you rashly promise her to Liu Ji?\"",
  "s0029": "Lü Gong said: \"This is not something children and women can understand.\"",
  "s0030": "He finally gave her to Liu Ji.",
  "s0031": "Lü Gong's daughter was Empress Lü; she gave birth to Emperor Xiaohui and Princess Lu Yuan.",
  "s0032": "When Gao Zu was Pavilion Head, he would often request leave to return to his fields.",
  "s0033": "Empress Lü with her two children were in the fields weeding when an old man passed by and requested a drink; Empress Lü consequently fed him.",
  "s0034": "The old man read Empress Lü's physiognomy and said: \"Madam will be the most noble person under Heaven.\"",
  "s0035": "He asked to read the two children's physiognomy; seeing Xiaohui, he said: \"The reason Madam will be noble is because of this boy.\"",
  "s0036": "Reading Lu Yuan's physiognomy, she would also be noble.",
  "s0037": "After the old man left, Gao Zu happened to come from a neighboring house; Empress Lü fully told him that a guest had passed by and read the physiognomy of her and the children, all predicting great nobility.",
  "s0038": "Gao Zu asked where he was; she said: \"Not far.\"",
  "s0039": "He then pursued and caught up with the old man and questioned him.",
  "s0040": "The old man said: \"Earlier your wife and children all resemble you; your physiognomy indicates nobility beyond description.\"",
  "s0041": "Gao Zu then bowed and said: \"If it is truly as you say, I dare not forget this kindness.\"",
  "s0042": "When Gao Zu became noble, they never found where the old man was.",
  "s0043": "When Gao Zu was Pavilion Head, he made a cap of bamboo bark and had the cap-maker of Xue craft it; he wore it from time to time, and when he became noble he always wore it—the so-called 'Liu cap' is this.",
  "s0044": "As Pavilion Head, Gao Zu escorted convicts for the county to Mount Li; many escaped on the road.",
  "s0045": "He estimated that by the time they arrived all would have fled, so reaching the marshes west of Feng, he stopped to drink, and at night released all the convicts he was escorting.",
  "s0046": "He said: \"You may all go; I too will depart from here!\"",
  "s0047": "Among the convicts over ten brave men wished to follow him.",
  "s0048": "Gao Zu, intoxicated, traveled by night through the marshes and ordered one man to go ahead.",
  "s0049": "The man going ahead returned and reported: \"There is a great snake blocking the path ahead; we should turn back.\"",
  "s0050": "Gao Zu, drunk, said: \"A brave man goes forward—what is there to fear!\"",
  "s0051": "He then went forward, drew his sword, and struck and beheaded the snake.",
  "s0052": "The snake was split in two and the path opened.",
  "s0053": "After traveling several li, drunk, he lay down to sleep.",
  "s0054": "People coming after arrived at the snake's location; there was an old woman crying at night.",
  "s0055": "People asked why she cried; the old woman said: \"Someone killed my son, therefore I cry.\"",
  "s0056": "People said: \"Why was your son killed?\"",
  "s0057": "The old woman said: \"My son is the son of the White Emperor; he transformed into a snake and blocked the road; now he was beheaded by the son of the Red Emperor, therefore I cry.\"",
  "s0058": "People thought the old woman was lying and wanted to punish her, but the old woman suddenly disappeared.",
  "s0059": "When the people behind arrived, Gao Zu awoke.",
  "s0060": "The people behind told Gao Zu; Gao Zu was secretly delighted in his heart and felt self-assured.",
  "s0061": "Those who followed him grew daily more in awe of him.",
  "s0062": "The First Emperor of Qin often said \"In the southeast there is the qi of a Son of Heaven,\" and consequently made eastern tours to suppress it.",
  "s0063": "Gao Zu then suspected it was himself, fled and hid, concealing himself among the cliffs and rocks of the marshes and mountains of Mang and Dang.",
  "s0064": "Empress Lü with others sought him and always found him.",
  "s0065": "Gao Zu found this strange and questioned her.",
  "s0066": "Empress Lü said: \"Where Ji resides there is always cloud qi above, so following it I always find Ji.\"",
  "s0067": "Gao Zu was pleased in his heart.",
  "s0068": "Some of the young men of Pei heard of this and many wished to attach themselves to him.",
  "s0069": "In autumn of the first year of the Second Emperor of Qin, Chen Sheng and others arose at Qi, reached Chen and became king, with the title 'Zhang Chu.'",
  "s0070": "The commanderies and counties mostly all killed their magistrates to respond to Chen She.",
  "s0071": "The Pei magistrate was afraid and wished to have Pei respond to She.",
  "s0072": "Assistant clerks and supervising officials Xiao He and Cao Can then said: \"You are a Qin official; now if you wish to betray it and lead the sons and younger brothers of Pei, I fear they will not obey.",
  "s0073": "We hope you will summon those who are fugitives outside—you can obtain several hundred men to coerce the masses, and the masses will not dare disobey.\"",
  "s0074": "He then ordered Fan Kuai to summon Liu Ji.",
  "s0075": "Liu Ji's followers already numbered several tens or hundreds.",
  "s0076": "Thereupon Fan Kuai followed Liu Ji and came.",
  "s0077": "The Pei magistrate later regretted it, fearing there would be trouble, so he closed the city gates to defend the city and wished to execute Xiao and Cao.",
  "s0078": "Xiao and Cao were afraid and climbed over the wall to join Liu Ji.",
  "s0079": "Liu Ji then wrote on silk and shot it over the city wall, saying to the elders of Pei: \"All under Heaven has long suffered under Qin.",
  "s0080": "Now though the elders support the Pei magistrate in defending, the feudal lords are rising together and will now massacre Pei.",
  "s0081": "If Pei now together executes the magistrate and chooses from among the sons and younger brothers one who can be installed and installs him to respond to the feudal lords, then households will be preserved intact.",
  "s0082": "If not, fathers and sons will all be massacred—there is no point.\"",
  "s0083": "The elders then led the sons and younger brothers to together kill the Pei magistrate, opened the city gates, and welcomed Liu Ji, wishing to make him Pei magistrate.",
  "s0084": "Liu Ji said: \"All under Heaven is in chaos; the feudal lords are rising together; now if we install a general who is not good, with one defeat all will be lost.",
  "s0085": "It is not that I dare be selfish, but I fear my abilities are meager and I cannot keep safe the fathers, elder brothers, sons, and younger brothers.",
  "s0086": "This is a great matter; I hope you will again recommend and choose someone suitable.\"",
  "s0087": "Xiao, Cao, and the others were all civil clerks who cherished themselves; fearing that if the affair did not succeed Qin would later exterminate their clans, they all deferred to Liu Ji.",
  "s0088": "All the elders said: \"Throughout life we have heard of the various strange and wondrous signs about Liu Ji; he should be noble; moreover, divining by oracle, none is as auspicious as Liu Ji.\"",
  "s0089": "Thereupon Liu Ji declined several times.",
  "s0090": "Since none of the multitude dared take it, they installed Ji as Duke of Pei.",
  "s0091": "They made offerings to the Yellow Emperor, sacrificed to Chiyou in the courtyard of Pei, and consecrated drums and flags—all banners were red.",
  "s0092": "Because the snake he killed was the son of the White Emperor and the killer was the son of the Red Emperor, therefore they honored red.",
  "s0093": "Thereupon young heroes and officials like Xiao, Cao, and Fan Kuai all gathered two or three thousand sons and younger brothers of Pei, attacked Huling and Fangyu, and returned to defend Feng.",
  "s0094": "In the second year of the Second Emperor of Qin, Chen She's general Zhou Zhang's army went west reaching Xi and returned.",
  "s0095": "Yan, Zhao, Qi, and Wei all made themselves kings.",
  "s0096": "The Xiang clan arose in Wu.",
  "s0097": "The Supervisor of Sichuan, Ping, led troops to surround Feng for two days; they came out to do battle and broke them.",
  "s0098": "He ordered Yong Chi to defend Feng and led his troops to Xue.",
  "s0099": "The Administrator of Sizhou, Zhuang, was defeated at Xue and fled to Qi; the Duke of Pei's Left Major captured Administrator Zhuang of Sichuan and killed him.",
  "s0100": "The Duke of Pei returned his army to Kangfu, reached Fangyu, and had not yet fought.",
  "s0101": "King Chen sent Zhou Shi of Wei to take territory.",
  "s0102": "Zhou Shi sent someone to say to Yong Chi: \"Feng was formerly a Liang relocated town.",
  "s0103": "Now the Wei territory that has been settled numbers several tens of cities.",
  "s0104": "If Chi now surrenders to Wei, Wei will make Chi a marquis defending Feng.",
  "s0105": "If you do not surrender, we will massacre Feng.\"",
  "s0106": "Yong Chi had long been unwilling to be subordinate to the Duke of Pei; when Wei recruited him, he immediately rebelled and defended Feng for Wei.",
  "s0107": "The Duke of Pei led troops to attack Feng but could not take it.",
  "s0108": "The Duke of Pei fell ill and returned to Pei.",
  "s0109": "The Duke of Pei resented that Yong Chi and the sons and younger brothers of Feng had betrayed him; hearing that Lord Ning of Dongyang and Qin Jia had installed Jing Ju as Provisional King at Liu, he went to join them, wishing to request troops to attack Feng.",
  "s0110": "At this time Qin general Zhang Han came from Chen; a separate general, Sima Yi, led troops to pacify Chu territory to the north, massacred Xiang, and reached Dang.",
  "s0111": "Lord Ning of Dongyang and the Duke of Pei led troops west and fought with them west of Xiao; it went unfavorably.",
  "s0112": "They returned to gather troops and assembled at Liu, then led troops to attack Dang, taking it after three days.",
  "s0113": "Consequently gathering Dang's troops, they obtained five or six thousand men.",
  "s0114": "They attacked Xiayi and took it.",
  "s0115": "They returned the army to Feng.",
  "s0116": "Hearing that Xiang Liang was at Xue, he went with over a hundred cavalry to see him.",
  "s0117": "Xiang Liang augmented the Duke of Pei's troops with five thousand men and ten commanders of the fifth rank.",
  "s0118": "The Duke of Pei returned and led troops to attack Feng.",
  "s0119": "Following Xiang Liang for over a month, Xiang Yu had already taken Xiangcheng and returned.",
  "s0120": "Xiang Liang summoned all the separate generals to assemble at Xue.",
  "s0121": "Hearing that King Chen had definitely died, they consequently installed Xin, grandson of the former King Huai of Chu, as King of Chu, governing from Xutai.",
  "s0122": "Xiang Liang took the title Lord of Martial Trust.",
  "s0123": "After several months, they attacked Kangfu to the north, rescued Dong'e, and broke the Qin army.",
  "s0124": "The Qi army returned; only Chu pursued northward, sending the Duke of Pei and Xiang Yu separately to attack Chengyang and massacre it.",
  "s0125": "They encamped east of Puyang and fought with the Qin army, breaking them.",
  "s0126": "The Qin army rallied again, defended Puyang, and surrounded by water.",
  "s0127": "The Chu army departed and attacked Dingtao, but Dingtao did not fall.",
  "s0128": "The Duke of Pei and Xiang Yu went west taking territory to below Yongqiu, fought with the Qin army, greatly broke them, and beheaded Li You.",
  "s0129": "Returning they attacked Waihuang, but Waihuang did not fall.",
  "s0130": "Xiang Liang twice broke the Qin army and showed an arrogant bearing.",
  "s0131": "Song Yi remonstrated, but he did not listen.",
  "s0132": "Qin reinforced Zhang Han's troops; by night with gags in their mouths they struck Xiang Liang, greatly broke him at Dingtao; Xiang Liang died.",
  "s0133": "The Duke of Pei and Xiang Yu were attacking Chenliu when they heard of Xiang Liang's death; they led their troops eastward together with General Lü.",
  "s0134": "Lü Chen's army was east of Pengcheng, Xiang Yu's army west of Pengcheng, and the Duke of Pei's army at Dang.",
  "s0135": "Having broken Xiang Liang's army, Zhang Han considered that Chu territory's troops were not worth worrying about, so he crossed the Yellow River and attacked Zhao to the north, greatly breaking them.",
  "s0136": "At that time, Zhao Xie was king; Qin general Wang Li surrounded him at Julu city—this was called the army north of the Yellow River.",
  "s0137": "In the third year of the Second Emperor of Qin, King Huai of Chu saw that Xiang Liang's army was broken and was afraid; he moved from Xutai and made his capital at Pengcheng, combining Lü Chen's and Xiang Yu's armies to command them himself.",
  "s0138": "He made the Duke of Pei Administrator of Dang Commandery, enfeoffed him as Marquis of Wu'an, and had him command the troops of Dang Commandery.",
  "s0139": "He enfeoffed Xiang Yu as Marquis of Chang'an and gave him the title Duke of Lu.",
  "s0140": "Lü Chen was made Minister of Ceremonies, and his father Lü Qing Grand Councillor.",
  "s0141": "Zhao repeatedly requested rescue; King Huai then made Song Yi Supreme General, Xiang Yu second general, and Fan Zeng final general, to rescue Zhao to the north.",
  "s0142": "He ordered the Duke of Pei to go west taking territory and enter the passes.",
  "s0143": "Making an agreement with all the generals: he who first enters and settles Guanzhong shall be its king.",
  "s0144": "At that time, Qin troops were strong and constantly rode victory pursuing northward; none of the generals found it advantageous to enter the passes first.",
  "s0145": "Only Xiang Yu resented that Qin had broken Xiang Liang's army and was determined, wishing to go west into the passes with the Duke of Pei.",
  "s0146": "King Huai's various old generals all said: \"Xiang Yu as a person is fierce, violent, cunning, and cruel.",
  "s0147": "When Xiang Yu attacked Xiangcheng, none of Xiangcheng's population remained—all were buried alive; wherever he passes he completely destroys everything.",
  "s0148": "Moreover, Chu has repeatedly advanced offensively; previously King Chen and Xiang Liang both were defeated.",
  "s0149": "It would be better to send an elder to uphold righteousness and go west, to inform and instruct the fathers and elder brothers of Qin.",
  "s0150": "The fathers and elder brothers of Qin have long suffered under their lord; now if we truly obtain an elder to go who does not invade or commit violence, they should be amenable to surrender.",
  "s0151": "Now Xiang Yu is fierce and violent; he cannot be sent.",
  "s0152": "Only the Duke of Pei has always been generous and magnanimous, an elder; he can be sent.\"",
  "s0153": "In the end they did not permit Xiang Yu, but sent the Duke of Pei west to take territory and gather the scattered troops of King Chen and Xiang Liang.",
  "s0154": "They then went by way of Dang to Chengyang and with Qin troops at Gangli faced each other across ramparts, breaking the two Qin armies.",
  "s0155": "The Chu army sent out troops to strike Wang Li and greatly broke him.",
  "s0156": "The Duke of Pei led troops west and met Peng Yue at Changyi; consequently they together attacked the Qin army, but the battle went unfavorably.",
  "s0157": "Returning to reach Li, he met Marquis Gangwu, seized his army of over four thousand men, and combined them.",
  "s0158": "Together with Wei generals Huang Xin, Wei Shentu, and the army of Wu Pu, they jointly attacked Changyi, but Changyi did not fall.",
  "s0159": "Going west they passed Gaoyang.",
  "s0160": "Li Yiji was gate guard and said: \"Many generals have passed through here; I observe that the Duke of Pei is a great man and elder.\"",
  "s0161": "He then sought an audience to persuade the Duke of Pei.",
  "s0162": "The Duke of Pei was squatting on the bed having two women wash his feet.",
  "s0163": "Li Sheng did not bow but made a long salute, saying: \"If you wish to execute the lawless Qin, you should not squat to receive an elder.\"",
  "s0164": "Thereupon the Duke of Pei rose, adjusted his clothing, apologized, and invited him to the seat of honor.",
  "s0165": "Li Yiji persuaded the Duke of Pei to attack Chenliu and obtain Qin's accumulated grain.",
  "s0166": "He then made Li Yiji Lord of Guangye and Li Shang a general to command the troops of Chenliu and together attack Kaifeng, but Kaifeng did not fall.",
  "s0167": "Going west they fought with Qin general Yang Xiong at Baima, and again fought east of Quyu, greatly breaking them.",
  "s0168": "Yang Xiong fled to Yingyang; the Second Emperor sent an envoy to behead him as a warning.",
  "s0169": "They attacked Yingyang to the south and massacred it.",
  "s0170": "Through Zhang Liang they then took the territory of Han at Huanyuan.",
  "s0171": "At that time, Zhao's separate general Sima Ang was about to cross the Yellow River to enter the passes; the Duke of Pei then attacked Pingyin to the north, cutting off the river ford.",
  "s0172": "Going south, they fought east of Luoyang; the army went unfavorably, so they returned to Yangcheng, gathered cavalry within the army, and fought with Nanyang Administrator Qi east of Chu, breaking him.",
  "s0173": "They took Nanyang Commandery; Administrator Qi fled and defended and held the city of Wan.",
  "s0174": "The Duke of Pei led his troops to pass by and go west.",
  "s0175": "Zhang Liang remonstrated, saying: \"Though the Duke of Pei wishes to urgently enter the passes, Qin troops are still numerous and hold dangerous positions.",
  "s0176": "Now if we do not take Wan, Wan will strike from behind, while strong Qin is ahead—this is a dangerous path.\"",
  "s0177": "Thereupon the Duke of Pei led his troops by night from another road and returned, changed flags and banners, and at dawn surrounded Wan city three times round.",
  "s0178": "The Administrator of Nanyang wished to slit his own throat.",
  "s0179": "His retainer Chen Hui said: \"It is not too late to die.\"",
  "s0180": "He then climbed over the city wall to see the Duke of Pei and said: \"I have heard of your agreement: he who first enters Xianyang shall be its king.",
  "s0181": "Now you remain besieging Wan.",
  "s0182": "Wan is the capital of a great commandery with dozens of connected cities, numerous people, and abundant stores; the officials and people believe that if they surrender they will certainly die, therefore all firmly defend and man the walls.",
  "s0183": "Now if you spend the whole day attacking, officers and troops who die or are wounded will certainly be many;",
  "s0184": "if you lead troops away from Wan, Wan will certainly follow behind you; ahead you will lose the agreement about Xianyang, and behind you will have the trouble of strong Wan.",
  "s0185": "Planning for you, nothing would be better than to agree to accept surrender, enfeoff their administrator, consequently have him remain defending, and lead his armored troops with you westward.",
  "s0186": "Cities that have not yet surrendered, hearing the news, will compete to open their gates and wait; you will pass through everywhere without obstruction.\"",
  "s0187": "The Duke of Pei said: \"Excellent.\"",
  "s0188": "He then made the Administrator of Wan Marquis of Yin and enfeoffed Chen Hui with a thousand households.",
  "s0189": "Leading troops westward, there were none that did not surrender.",
  "s0190": "Reaching Danshui, Marquis Gaowu Sai and Marquis Xiang Wang Ling surrendered at Xiling.",
  "s0191": "Returning they attacked Huyang, met Lord Fan's separate general Mei Xuan, went together with them, and accepted the surrender of Xi and Li.",
  "s0192": "They dispatched Ning Chang of Wei as envoy to Qin, but the envoy had not yet returned.",
  "s0193": "At this time Zhang Han had already surrendered his army to Xiang Yu at Zhao.",
  "s0194": "Initially, Xiang Yu with Song Yi had gone north to rescue Zhao; when Xiang Yu killed Song Yi and replaced him as Supreme General, all the generals including Qing Bu were subordinated to him; he broke Qin general Wang Li's army, accepted Zhang Han's surrender, and all the feudal lords attached themselves.",
  "s0195": "When Zhao Gao had already killed the Second Emperor, he sent men to come wishing to make an agreement to divide and rule Guanzhong.",
  "s0196": "The Duke of Pei considered this deceitful, so he used Zhang Liang's stratagem, sending Li Sheng and Lu Jia to persuade the Qin generals, enticing them with benefits, and consequently launched a surprise attack on Wuguan, breaking it.",
  "s0197": "They again fought with the Qin army south of Lantian, increased deceptive troop flags and banners; wherever they passed they were not to plunder; the Qin people were pleased, the Qin army relaxed, and they consequently greatly broke them.",
  "s0198": "Again fighting to their north, they greatly broke them.",
  "s0199": "Riding victory, they then broke them completely.",
  "s0200": "In the tenth month of the first year of Han, the Duke of Pei's troops were thus first among the feudal lords to reach Bashang.",
  "s0201": "The King of Qin, Ziying, in a plain chariot drawn by white horses, with a cord tied around his neck, sealed the Emperor's seal, tallies, and tokens, and surrendered by the side of Zhidao.",
  "s0202": "Some generals spoke of executing the King of Qin.",
  "s0203": "The Duke of Pei said: \"At first when King Huai sent me, it was precisely because I am capable of being tolerant and magnanimous;",
  "s0204": "moreover, the man has already submitted in surrender—to kill him again would be inauspicious.\"",
  "s0205": "He then handed the King of Qin over to officials and proceeded west into Xianyang.",
  "s0206": "He wished to stop and rest in the palaces, but Fan Kuai and Zhang Liang remonstrated; he then sealed Qin's precious treasures, wealth, and goods in the treasuries, and returned his army to Bashang.",
  "s0207": "He summoned the elders and heroes of the various counties and said: \"The elders have long suffered under Qin's harsh laws; those who spoke ill had their clans exterminated, those who spoke together in pairs were executed in the marketplace.",
  "s0208": "I made an agreement with the feudal lords: he who first enters the passes shall be its king; I should be king of Guanzhong.",
  "s0209": "I make an agreement with the elders—laws of only three articles: he who kills shall die, he who wounds others or steals shall be punished accordingly.",
  "s0210": "All the rest of Qin's laws are eliminated.",
  "s0211": "All officials and people shall remain peacefully as before.",
  "s0212": "The reason I have come is to eliminate harm for the elders, not to invade or commit violence—have no fear!",
  "s0213": "Moreover, the reason I have returned my army to Bashang is to wait for the feudal lords to arrive and establish agreements.\"",
  "s0214": "He then sent people with Qin officials to go through the counties, districts, and townships to inform and instruct them.",
  "s0215": "The Qin people were greatly pleased and competed to bring oxen, sheep, wine, and food to offer feasts for the soldiers.",
  "s0216": "The Duke of Pei again declined and would not accept, saying: \"The granaries have abundant grain; there is no scarcity—I do not wish to burden the people.\"",
  "s0217": "The people were even more pleased and only feared the Duke of Pei would not become King of Qin.",
  "s0218": "Someone persuaded the Duke of Pei, saying: \"Qin is ten times richer than all under Heaven, and its terrain is strong.",
  "s0219": "Now I hear Zhang Han has surrendered to Xiang Yu, and Xiang Yu has taken the title King of Yong to rule Guanzhong.",
  "s0220": "Now if he comes, the Duke of Pei fears you will not be able to possess this.",
  "s0221": "You should urgently send troops to defend Hangu Pass, not admit the feudal lords' armies, and gradually conscript troops from Guanzhong to strengthen yourself and resist them.\"",
  "s0222": "The Duke of Pei agreed with this plan and followed it.",
  "s0223": "In the eleventh month, Xiang Yu indeed led the feudal lords' troops west wishing to enter the passes, but the pass gates were closed.",
  "s0224": "Hearing that the Duke of Pei had already settled Guanzhong, he was greatly enraged and sent Qing Bu and others to attack and break through Hangu Pass.",
  "s0225": "In the twelfth month, they then reached Xi.",
  "s0226": "The Duke of Pei's Left Major Cao Wushang heard that King Xiang was angry and wished to attack the Duke of Pei, so he sent someone to tell Xiang Yu: \"The Duke of Pei wishes to be king of Guanzhong, make Ziying prime minister, and possess all the precious treasures.\"",
  "s0227": "He wished to seek enfeoffment by this.",
  "s0228": "The Second Father urged Xiang Yu to strike the Duke of Pei.",
  "s0229": "They were feasting the troops and would join battle the next day.",
  "s0230": "At that time Xiang Yu had four hundred thousand troops, claimed to be a million.",
  "s0231": "The Duke of Pei had one hundred thousand troops, claimed to be two hundred thousand; in strength they were no match.",
  "s0232": "It happened that Xiang Bo wished to save Zhang Liang's life; by night he went to see Liang and consequently with elegant words persuaded Xiang Yu, and Xiang Yu then desisted.",
  "s0233": "The Duke of Pei with over a hundred cavalry galloped to Hongmen to see and apologize to Xiang Yu.",
  "s0234": "Xiang Yu said: \"This was told by the Duke of Pei's Left Major Cao Wushang.",
  "s0235": "If not, how would I have come to this suspicion!\"",
  "s0236": "The Duke of Pei through Fan Kuai and Zhang Liang's efforts was able to be released and return.",
  "s0237": "Returning, he immediately executed Cao Wushang.",
  "s0238": "Xiang Yu then went west, massacred and burned Xianyang and the Qin palace chambers; wherever he passed he completely destroyed everything.",
  "s0239": "The Qin people were greatly disappointed but were afraid and dared not disobey.",
  "s0240": "Xiang Yu sent men to report back to King Huai.",
  "s0241": "King Huai said: \"According to the agreement.\"",
  "s0242": "Xiang Yu resented that King Huai would not permit him to go west into the passes together with the Duke of Pei, but instead went north to rescue Zhao, coming after the agreement about all under Heaven.",
  "s0243": "He then said: \"King Huai was merely installed by my kinsman Xiang Liang; he has no achievements or victories—how can he preside over the agreement!",
  "s0244": "Those who originally settled all under Heaven were the various generals and I.\"",
  "s0245": "He then outwardly honored King Huai as the Righteous Emperor but actually did not use his commands.",
  "s0246": "In the first month, Xiang Yu made himself King of Western Chu, ruling nine commanderies of Liang and Chu, with his capital at Pengcheng.",
  "s0247": "Breaking the agreement, he instead installed the Duke of Pei as King of Han, to rule Ba, Shu, and Hanzhong, with his capital at Nanzheng.",
  "s0248": "He divided Guanzhong into three parts and installed the three Qin generals: Zhang Han as King of Yong, with his capital at Feiqiu;",
  "s0249": "Sima Xin as King of Sai, with his capital at Liyang;",
  "s0250": "Dong Yi as King of Di, with his capital at Gaonu.",
  "s0251": "Chu general Shen Yang of Xiaqiu as King of Henan, with his capital at Luoyang.",
  "s0252": "Zhao general Sima Ang as King of Yin, with his capital at Chaoge.",
  "s0253": "King Xie of Zhao was moved to be King of Dai.",
  "s0254": "Zhao's Prime Minister Zhang Er as King of Changshan, with his capital at Xiangguo.",
  "s0255": "Lord Dangyang Qing Bu as King of Jiujiang, with his capital at Liu.",
  "s0256": "King Huai's Supreme Pillar of State Gong Ao as King of Linjiang, with his capital at Jiangling.",
  "s0257": "Lord Fan Wu Rui as King of Hengshan, with his capital at Zhu.",
  "s0258": "Yan general Zang Tu as King of Yan, with his capital at Ji.",
  "s0259": "The former King of Yan Han Guang was moved to be King of Liaodong.",
  "s0260": "Guang would not obey; Zang Tu attacked and killed him at Wuzhong.",
  "s0261": "He enfeoffed Lord Chengan Chen Yu with three counties of Hejian, residing at Nanpi.",
  "s0262": "He enfeoffed Mei Xuan with a hundred thousand households.",
  "s0263": "In the fourth month, the troops were dismissed below Xi; the feudal lords each went to their states.",
  "s0264": "When the King of Han went to his state, King Xiang sent thirty thousand troops to follow; those from Chu and the feudal lords who admired and followed numbered several tens of thousands; they entered Shizh from south of Du.",
  "s0265": "As they departed they immediately burned and severed the plank roads to prepare against the feudal lords' troops raiding them, and also to show Xiang Yu they had no intention of going east.",
  "s0266": "Reaching Nanzheng, many generals and officers and troops escaped on the road and returned; the officers and troops all sang songs longing to return east.",
  "s0267": "Han Xin persuaded the King of Han, saying: \"Xiang Yu made kings of generals who had achievements, while the king alone resides at Nanzheng—this is exile.",
  "s0268": "The military officers and troops are all men from east of the mountains; day and night they stand on tiptoe longing to return—use them while they are at their peak and you can achieve great merit.",
  "s0269": "Once all under Heaven is settled, people will all seek their own comfort and cannot be used again.",
  "s0270": "It would be better to make a decisive plan to face east and contend for authority over all under Heaven.\"",
  "s0272": "Xiang Yu having left the passes sent men to relocate the Righteous Emperor.",
  "s0273": "He said: \"Ancient emperors had territories a thousand li square and must reside at the upper reaches.\"",
  "s0274": "He then sent envoys to relocate the Righteous Emperor to Chen County in Changsha, urged the Righteous Emperor to travel; the assembled ministers gradually betrayed and rebelled against him, and he then secretly ordered the King of Hengshan and King of Linjiang to strike and kill the Righteous Emperor south of the Yangtze.",
  "s0275": "Xiang Yu resented Tian Rong and installed Qi general Tian Du as King of Qi.",
  "s0276": "Tian Rong was angry and consequently made himself King of Qi, killed Tian Du, and rebelled against Chu;",
  "s0277": "gave Peng Yue a general's seal and ordered him to rebel in the land of Liang.",
  "s0278": "Chu ordered Xiao Gongjiao to strike Peng Yue; Peng Yue greatly broke him.",
  "s0279": "Chen Yu resented that Xiang Yu had not made him king; he had Xia Shuo persuade Tian Rong to request troops to strike Zhang Er.",
  "s0280": "Qi gave Chen Yu troops; he struck and broke King Zhang Er of Changshan; Zhang Er fled and submitted to Han.",
  "s0281": "They welcomed King Xie of Zhao from Dai and again installed him as King of Zhao.",
  "s0282": "The King of Zhao consequently installed Chen Yu as King of Dai.",
  "s0283": "Xiang Yu was greatly enraged and attacked Qi to the north.",
  "s0284": "In the eighth month, the King of Han used Han Xin's stratagem, returned from the old road, and launched a surprise attack on King Zhang Han of Yong.",
  "s0285": "Han met and struck Han at Chencang; the Yong troops were defeated and fled back;",
  "s0286": "they made a stand and fought at Haozhi, were again defeated, and fled to Feiqiu.",
  "s0287": "The King of Han then settled the territory of Yong.",
  "s0288": "Going east to Xianyang, he led troops to besiege King of Yong at Feiqiu, and dispatched various generals to take and settle Longxi, Beidi, and Shangjun.",
  "s0289": "He ordered generals Xue Ou and Wang Xi to go out through Wuguan, use Wang Ling's troops at Nanyang, to welcome the Grand Duke and Empress Lü at Pei.",
  "s0290": "Chu heard of this and sent troops to resist them at Yangxia; they could not advance.",
  "s0291": "He ordered the former magistrate of Wu, Zheng Chang, to be King of Han to resist the Han troops.",
  "s0292": "In the second year, the King of Han went east taking territory; King Xin of Sai, King Yi of Di, and King Shen Yang of Henan all surrendered.",
  "s0293": "King Chang of Han would not obey; he sent Han Xin to strike and break him.",
  "s0294": "Thereupon he established Longxi, Beidi, Shangjun, Weinan, Heshang, and Zhongdi commanderies;",
  "s0295": "outside the passes he established Henan Commandery.",
  "s0296": "He reinstalled Han's Grand Commandant Xin as King of Han.",
  "s0297": "Generals who surrendered with ten thousand men or with a commandery were enfeoffed with ten thousand households.",
  "s0298": "They repaired and constructed the fortifications along the Yellow River.",
  "s0299": "All the former Qin parks, gardens, and ponds were permitted for people to farm; in the first month, they captured Chapter Ping, younger brother of the King of Yong.",
  "s0300": "They granted a great amnesty to criminals.",
  "s0301": "When the King of Han left the passes and reached Shan, he consoled the fathers and elders outside the passes, returned, and Zhang Er came to see him; the King of Han treated him generously.",
  "s0302": "In the second month, he ordered the elimination of Qin's altars of soil and grain and the establishment anew of Han's altars of soil and grain.",
  "s0303": "In the third month, the King of Han crossed from Linjin; King Bao of Wei led troops to follow.",
  "s0304": "He took Henei, captured the King of Yin, and established Henei Commandery.",
  "s0305": "He crossed south over Pingyin ford and reached Luoyang.",
  "s0306": "Elder Dong Gong of Xincheng blocked the way and persuaded the King of Han with the story of the Righteous Emperor's death.",
  "s0307": "The King of Han heard this, bared his torso, and wept loudly.",
  "s0308": "He then announced mourning for the Righteous Emperor and mourned for three days.",
  "s0309": "He sent envoys to inform the feudal lords, saying: \"All under Heaven together installed the Righteous Emperor and faced north to serve him.",
  "s0310": "Now Xiang Yu has banished and killed the Righteous Emperor south of the Yangtze—this is great rebellion and lawlessness.",
  "s0311": "I personally have announced mourning; may all the feudal lords wear white mourning garments.",
  "s0312": "Mobilize all troops within the passes, gather the gentlemen of the Three Rivers, float south down the Yangtze and Han rivers; I wish to follow the feudal lord kings to strike those of Chu who killed the Righteous Emperor.\"",
  "s0314": "At this time King Xiang was attacking Qi to the north; Tian Rong fought with him at Chengyang.",
  "s0315": "Tian Rong was defeated and fled to Pingyuan; the people of Pingyuan killed him.",
  "s0316": "All of Qi surrendered to Chu.",
  "s0317": "Chu consequently burned their city walls and took their sons and daughters as captives.",
  "s0318": "The Qi people rebelled against them.",
  "s0319": "Tian Rong's younger brother Heng installed Rong's son Guang as King of Qi; the King of Qi rebelled against Chu at Chengyang.",
  "s0320": "Though Xiang Yu heard Han had gone east, having already engaged Qi's troops, he wished to completely break them before striking Han.",
  "s0321": "The King of Han because of this was able to coerce the troops of five feudal lords and then entered Pengcheng.",
  "s0322": "Xiang Yu heard of this and led his troops away from Qi, came out from Lu through Huling, reached Xiao, and fought a great battle with Han at Pengcheng, east of Lingbi on the Sui River, greatly breaking the Han army, killing many officers and troops—the Sui River stopped flowing because of them.",
  "s0323": "He then took the King of Han's father, mother, wife, and children at Pei and placed them in the army as hostages.",
  "s0324": "At that time, the feudal lords saw Chu was strong and Han defeated; they all turned away from Han and again became Chu.",
  "s0325": "King Xin of Sai fled and entered Chu.",
  "s0326": "Empress Lü's elder brother Lord Zhou Lü commanded Han troops, stationed at Xiayi.",
  "s0327": "The King of Han joined him and gradually gathered officers and troops, encamping at Dang.",
  "s0328": "The King of Han then went west through the land of Liang and reached Yu.",
  "s0329": "He sent the herald Sui He to the King of Jiujiang Bu's location, saying: \"If you can make Bu raise troops and rebel against Chu, Xiang Yu will certainly remain to strike him.",
  "s0330": "If we can keep him there for several months, my taking of all under Heaven is certain.\"",
  "s0331": "Sui He went and persuaded King Bu of Jiujiang; Bu indeed turned his back on Chu.",
  "s0332": "Chu sent Long Ju to strike him.",
  "s0333": "When the King of Han was defeated at Pengcheng and went west, he sent people on the road to seek his family, but his family had also disappeared and they could not find each other.",
  "s0334": "After the defeat he alone found Xiaohui; in the sixth month, he installed him as Crown Prince and granted a great amnesty to criminals.",
  "s0335": "He ordered the Crown Prince to defend Liyang; all sons of feudal lords who were in Guanzhong assembled at Liyang to serve as guards.",
  "s0336": "They diverted water to flood Feiqiu; Feiqiu surrendered and Zhang Han committed suicide.",
  "s0337": "They renamed Feiqiu as Huaili.",
  "s0338": "Thereupon he ordered the sacrificial officials to make offerings to Heaven, Earth, the Four Directions, the Supreme Deity, mountains, and rivers, sacrificing to them at the proper times.",
  "s0339": "He mobilized troops from within the passes to man the fortifications.",
  "s0340": "At this time King Bu of Jiujiang fought with Long Ju, did not win, and traveled secretly with Sui He to return to Han.",
  "s0341": "The King of Han gradually gathered officers and troops; together with the various generals and troops from within the passes they increasingly came out, so that the troops greatly rallied at Yingyang and broke Chu between Jing and Suo.",
  "s0342": "In the third year, King Bao of Wei requested leave to return to visit his ailing relatives; when he arrived he immediately cut off the Yellow River ford and rebelled to become Chu.",
  "s0343": "The King of Han sent Li Sheng to persuade Bao, but Bao would not listen.",
  "s0344": "The King of Han dispatched General Han Xin to strike, greatly broke him, and captured Bao.",
  "s0345": "They then settled the territory of Wei, establishing three commanderies: Hedong, Taiyuan, and Shangdang.",
  "s0346": "The King of Han then ordered Zhang Er and Han Xin to proceed east down Jingxing to strike Zhao, behead Chen Yu and King Xie of Zhao.",
  "s0347": "The next year, he installed Zhang Er as King of Zhao.",
  "s0348": "The King of Han's army was south of Yingyang, constructing a walled supply road connecting it to the river to obtain grain from Ao Granary.",
  "s0349": "They confronted Xiang Yu for over a year.",
  "s0350": "Xiang Yu repeatedly raided and seized Han's supply road; the Han army lacked food and was then besieged by the King of Han.",
  "s0351": "The King of Han requested peace, offering to cede Yingyang and westward as Han.",
  "s0352": "King Xiang would not listen.",
  "s0353": "The King of Han was troubled by this, so he used Chen Ping's stratagem, giving Chen Ping forty thousand jin of gold to sow discord between Chu's lord and ministers.",
  "s0354": "Thereupon Xiang Yu became suspicious of the Second Father.",
  "s0355": "At that time the Second Father urged Xiang Yu to take Yingyang; when he saw himself suspected, he became angry, pleaded old age, requested to be granted his aged bones to return to the ranks; he died before reaching Pengcheng.",
  "s0356": "The Han army was cut off from food, so by night they sent out over two thousand women from the east gate wearing armor; Chu consequently attacked them from four sides.",
  "s0357": "General Ji Xin then rode in the king's chariot, pretended to be the King of Han, and deceived Chu; all the Chu troops shouted 'Long live!' and went to observe east of the city; because of this the King of Han was able to escape out the west gate with several tens of riders.",
  "s0358": "He ordered Imperial Secretary Zhou Ke, Wei Bao, and Duke Cong to defend Yingyang.",
  "s0359": "All generals and troops who could not follow were entirely in the city.",
  "s0360": "Zhou Ke and Duke Cong said to each other: \"A king who has rebelled against his state is difficult to defend a city with.\"",
  "s0361": "They consequently killed Wei Bao.",
  "s0362": "When the King of Han left Yingyang and entered the passes, he gathered troops wishing to go east again.",
  "s0363": "Yuan Sheng persuaded the King of Han, saying: \"Han and Chu have confronted each other at Yingyang for several years; Han has constantly been in difficulty.",
  "s0364": "I hope the king will go out through Wuguan; Xiang Yu will certainly lead troops south in pursuit; the king should entrench deeply, allowing those between Yingyang and Chenggao to obtain some rest.",
  "s0365": "Have Han Xin and others pacify the territory of Zhao north of the Yellow River, connect with Yan and Qi, then the king can return to Yingyang—it will not be too late.",
  "s0366": "If this is done, then what Chu must prepare for will be many places, their strength divided; Han will obtain rest and fight with them again—breaking Chu will be certain.\"",
  "s0367": "The King of Han followed his plan, sent out his army between Wan and Ye, and traveled with Qing Bu gathering troops.",
  "s0368": "Xiang Yu heard the King of Han was at Wan and indeed led troops south.",
  "s0369": "The King of Han entrenched firmly and would not engage in battle.",
  "s0370": "At this time Peng Yue crossed the Sui River and fought with Xiang Sheng and Xue Gong at Xiapei; Peng Yue greatly broke the Chu army.",
  "s0371": "Xiang Yu then led troops east to strike Peng Yue.",
  "s0372": "The King of Han also led troops north to encamp at Chenggao.",
  "s0373": "Having broken and driven off Peng Yue, Xiang Yu heard the King of Han had again encamped at Chenggao, so he again led troops west, took Yingyang, executed Zhou Ke and Duke Cong, captured King Xin of Han as prisoner, and then besieged Chenggao.",
  "s0374": "The King of Han leaped out, alone with Duke Teng sharing a chariot going out Chenggao's Jade Gate, crossed the Yellow River to the north, and galloped to lodge at Xiuwu.",
  "s0375": "Calling himself an envoy, at dawn he galloped into Zhang Er and Han Xin's encampment and seized their army.",
  "s0376": "He then sent Zhang Er north to further gather troops in Zhao territory and sent Han Xin east to strike Qi.",
  "s0377": "The King of Han having obtained Han Xin's army then rallied again.",
  "s0378": "He led troops to the Yellow River, feasted the army to the south at Little Xiuwu to the south, wishing to fight again.",
  "s0379": "Gentleman Zheng Zhong then persuaded and stopped the King of Han, having him build high ramparts and dig deep trenches and not engage in battle.",
  "s0380": "The King of Han listened to his plan and sent Lu Wan and Liu Jia to lead twenty thousand troops and several hundred cavalry, cross Baima ford, enter Chu territory, and together with Peng Yue again strike and break the Chu army west of Yan郭, then again take over ten cities in the land of Liang.",
  "s0381": "The Marquis of Huaiyin had already received orders to go east but had not yet crossed Pingyuan.",
  "s0382": "The King of Han sent Li Sheng to persuade King Tian Guang of Qi; Guang rebelled against Chu and made peace with Han to together strike Xiang Yu.",
  "s0383": "Han Xin used Kuai Tong's stratagem and then launched a surprise attack and broke Qi.",
  "s0384": "The King of Qi boiled Li Sheng alive and fled east to Gaomi.",
  "s0385": "Xiang Yu heard that Han Xin had already raised troops north of the Yellow River and broken Qi and Zhao and was about to strike Chu, so he sent Long Ju and Zhou Lan to strike him.",
  "s0386": "Han Xin engaged in battle; cavalry general Guan Ying struck and greatly broke the Chu army, killing Long Ju.",
  "s0387": "King Guang of Qi fled to Peng Yue.",
  "s0388": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
  "s0389": "In the fourth year, Xiang Yu then said to Marquis of Haichun Grand Marshal Cao Jiu: \"Carefully defend Chenggao.",
  "s0390": "If Han challenges to battle, be cautious not to engage in battle, and do not let them get east—that is all.",
  "s0391": "In fifteen days I will certainly settle the land of Liang and return to join the generals.\"",
  "s0392": "He then marched to strike Chenliu, Waihuang, and Suiyang, taking them.",
  "s0393": "Han indeed repeatedly challenged the Chu army to battle; the Chu army would not come out; they sent men to insult them for five or six days; the Grand Marshal was enraged and crossed his troops over the Fan River.",
  "s0394": "When half the officers and troops had crossed, Han struck them, greatly broke the Chu army, and completely obtained all Chu's gold, jade, wealth, and bribes.",
  "s0395": "Grand Marshal Jiu and Chief Clerk Xin both slit their own throats at the Fan River.",
  "s0396": "Xiang Yu reached Suiyang and heard that Marquis of Haichun was broken, so he led his troops back.",
  "s0397": "The Han army was besieging Zhongli Mo east of Yingyang; when Xiang Yu arrived, they all fled to dangerous terrain.",
  "s0398": "Han Xin having already broken Qi sent someone to say: \"Qi borders Chu; authority is light—if I am not made provisional king, I fear I cannot stabilize Qi.\"",
  "s0399": "The King of Han wished to attack him.",
  "s0400": "The Marquis of Liu said: \"It would be better to consequently install him and have him defend on his own.\"",
  "s0401": "He then dispatched Zhang Liang bearing the seal and ribbons to install Han Xin as King of Qi.",
  "s0402": "Xiang Yu heard that Long Ju's army was broken and was then afraid, sending Wu She of Xutai to persuade Han Xin.",
  "s0403": "Han Xin would not listen.",
  "s0404": "Chu and Han long confronted each other without resolution; the able-bodied suffered from military service, the old and weak were exhausted transporting grain.",
  "s0405": "The King of Han and Xiang Yu faced each other between Guangwu and spoke.",
  "s0406": "Xiang Yu wished to challenge the King of Han to single combat.",
  "s0407": "The King of Han enumerated Xiang Yu's crimes, saying: \"At first Xiang Yu and I both received orders from King Huai saying he who first enters and settles Guanzhong shall be its king; Xiang Yu broke the agreement and made me king in Shu and Han—crime one.",
  "s0408": "Xiang Yu falsely killed Lord Superior to Ministers and exalted himself—crime two.",
  "s0409": "Having already rescued Zhao, Xiang Yu should have returned to report, but instead he seized the feudal lords' troops without authorization and entered the passes—crime three.",
  "s0410": "King Huai's agreement was that in entering Qin there should be no violence or plunder; Xiang Yu burned the Qin palace chambers, dug up the First Emperor's tomb, and privately took its wealth and goods—crime four.",
  "s0411": "He also forcibly killed the surrendered King of Qin, Ziying—crime five.",
  "s0412": "He deceitfully buried alive two hundred thousand Qin sons and younger brothers at Xin'an and made their generals kings—crime six.",
  "s0413": "Xiang Yu made kings of all the generals in good lands while moving and expelling the former lords, causing ministers and subordinates to compete in rebellion and treason—crime seven.",
  "s0414": "Xiang Yu expelled the Righteous Emperor from Pengcheng and made it his own capital, seized the King of Han's territory, and combined to rule Liang and Chu, taking much for himself—crime eight.",
  "s0415": "Xiang Yu sent men to secretly assassinate the Righteous Emperor south of the Yangtze—crime nine.",
  "s0416": "Being a minister who assassinates his lord, kills those who have already surrendered, governs unjustly, does not keep agreements with his lord—these all under Heaven cannot tolerate; this is great rebellion and lawlessness—crime ten.",
  "s0417": "I with righteous troops follow the feudal lords to execute cruel rebels; I will have criminals with sentences of mutilation strike and kill Xiang Yu—why would I suffer to challenge you to combat!\"",
  "s0418": "Xiang Yu was greatly enraged; with a hidden crossbow he shot and hit the King of Han.",
  "s0419": "The King of Han was wounded in the chest but grasped his foot and said: \"The bandit hit my toe!\"",
  "s0420": "The King of Han lay ill from the wound; Zhang Liang strongly requested the King of Han to rise and go comfort the army to reassure the officers and troops and not let Chu take advantage of Han.",
  "s0421": "The King of Han went out to tour the army; his illness was severe, so he galloped into Chenggao.",
  "s0422": "When his illness improved, he went west into the passes, reached Liyang, inquired after the elders, held a banquet, and displayed the former King of Sai Xin's severed head in the Liyang marketplace.",
  "s0423": "He remained four days, then returned to the army and encamped at Guangwu.",
  "s0424": "Troops from within the passes increasingly came out.",
  "s0425": "At this time, Peng Yue led troops stationed in the land of Liang, traveling back and forth tormenting the Chu troops and cutting off their grain supply.",
  "s0426": "Tian Heng went to join him.",
  "s0427": "Xiang Yu repeatedly struck Peng Yue and others; King Xin of Qi also advanced to strike Chu.",
  "s0428": "Xiang Yu was afraid and then made an agreement with the King of Han to divide all under Heaven in the middle: those west of the Hong Canal would be Han, those east of the Hong Canal would be Chu.",
  "s0429": "King Xiang returned the King of Han's father, mother, wife, and children; the army all shouted 'Long live!'; they then returned and parted ways.",
  "s0430": "Xiang Yu was released and returned eastward.",
  "s0431": "The King of Han wished to lead his troops and return westward, but using the plans of the Marquis of Liu and Chen Ping, he then advanced his troops to pursue Xiang Yu, reached south of Yangxia and stopped his army, making an appointment with King Xin of Qi and Marquis of Jiancheng Peng Yue to meet and strike the Chu army.",
  "s0432": "Reaching Guling, they did not meet.",
  "s0433": "Chu struck the Han army and greatly broke them.",
  "s0434": "The King of Han again entered his ramparts, dug deep trenches, and defended.",
  "s0435": "Using Zhang Liang's plan, thereupon Han Xin and Peng Yue both went.",
  "s0436": "When Liu Jia entered Chu territory and besieged Shouchun, the King of Han was defeated at Biling, so he sent envoys to summon Grand Marshal Zhou Yin to raise the troops of Jiujiang and welcome King Wu, marched and massacred Chengfu, following Liu Jia; the feudal lords of Qi and Liang all assembled in great numbers at Gaixia.",
  "s0437": "He installed King Wu Bu as King of Huainan.",
  "s0438": "In the fifth year, Gao Zu together with the feudal lords' troops jointly struck the Chu army and decided victory with Xiang Yu at Gaixia.",
  "s0439": "The Marquis of Huaiyin led three hundred thousand and directly opposed them; General Kong was on the left, General Fei on the right, the Emperor behind, and Marquis of Jiang and General Chai behind the Emperor.",
  "s0440": "Xiang Yu's troops numbered about a hundred thousand.",
  "s0441": "Huaiyin first engaged, went unfavorably, and retreated.",
  "s0442": "General Kong and General Fei were released; the Chu troops went unfavorably, and the Marquis of Huaiyin again rode upon them, greatly defeating them at Gaixia.",
  "s0443": "Xiang Yu's troops heard the Han army's Chu songs and thought Han had completely obtained the lands of Chu; Xiang Yu was then defeated and fled; because of this the troops were greatly defeated.",
  "s0444": "He sent cavalry general Guan Ying to pursue and kill Xiang Yu at Dongcheng, behead eighty thousand, and then take and settle the lands of Chu.",
  "s0445": "Lu firmly defended for Chu and would not surrender.",
  "s0446": "The King of Han led the feudal lords' troops north and showed Xiang Yu's head to the fathers and elders of Lu; Lu then surrendered.",
  "s0447": "They then buried Xiang Yu at Gucheng with the rites of Duke of Lu.",
  "s0448": "Returning to reach Dingtao, he galloped into the King of Qi's encampment and seized his army.",
  "s0449": "In the first month, the feudal lords and generals and ministers together jointly requested to honor the King of Han as Emperor.",
  "s0450": "The King of Han said: \"I have heard that the title of Emperor is something the worthy possess; empty words and vain speech are not what I uphold—I dare not accept the position of Emperor.\"",
  "s0451": "The assembled ministers all said: \"The great king arose from humble and minor beginnings, executed the violent and rebellious, pacified the four seas; those with achievements were immediately given divided territory and enfeoffed as kings and marquises.",
  "s0452": "If the great king does not take the honored title, all will doubt and not believe.",
  "s0453": "We your ministers will defend this to the death.\"",
  "s0454": "The King of Han declined three times; unable to refuse, he said: \"If you lords must consider it convenient and beneficial to the state.\"",
  "s0455": "On the jiawu day, he then assumed the position of Emperor north of the Fan River.",
  "s0456": "The Emperor said the Righteous Emperor had no descendants.",
  "s0457": "King Han Xin of Qi was familiar with Chu customs and was moved to be King of Chu, with his capital at Xiapei.",
  "s0458": "He installed Marquis of Jiancheng Peng Yue as King of Liang, with his capital at Dingtao.",
  "s0459": "The former King Xin of Han remained King of Han, with his capital at Yangzhai.",
  "s0460": "He moved King Wu Rui of Hengshan to be King of Changsha, with his capital at Linxiang.",
  "s0461": "Lord Fan's general Mei Xuan had achievements and followed them entering Wuguan, therefore he favored Lord Fan.",
  "s0462": "King Bu of Huainan, King Zang Tu of Yan, and King Ao of Zhao all remained as before.",
  "s0463": "All under Heaven was greatly settled.",
  "s0464": "Gao Zu made his capital at Luoyang; all the feudal lords became his ministers and subordinates.",
  "s0465": "The former King Huan of Linjiang rebelled against Han for Xiang Yu; he ordered Lu Wan and Liu Jia to besiege him, but he did not surrender.",
  "s0466": "After several months he surrendered and they killed him at Luoyang.",
  "s0467": "In the fifth month, all troops were dismissed to return home.",
  "s0468": "Sons of feudal lords who were in Guanzhong were exempted from taxes for twelve years; those who returned were exempted for six years and provided food for one year.",
  "s0469": "Gao Zu held a banquet at the Southern Palace of Luoyang.",
  "s0470": "Gao Zu said: \"Ranked marquises and various generals, do not hide from me; all speak your true feelings.",
  "s0471": "Why is it that I possess all under Heaven?",
  "s0472": "Why is it that the Xiang clan lost all under Heaven?\"",
  "s0473": "Gao Qi and Wang Ling replied: \"Your Majesty is informal and makes light of people; Xiang Yu was benevolent and loved people.",
  "s0474": "Yet Your Majesty has men attack cities and take territory; those who are subdued and surrender are consequently given it—you share benefits with all under Heaven.",
  "s0475": "Xiang Yu was jealous of the worthy and envious of the able; those with achievements he harmed, the worthy he suspected; when battles were won he would not give others credit, when territory was obtained he would not give others benefits—this is why he lost all under Heaven.\"",
  "s0476": "Gao Zu said: \"You know one aspect but do not know the second.",
  "s0477": "In devising strategies within the command tent and deciding victory a thousand li away, I am not equal to Zifang.",
  "s0478": "In stabilizing the state, comforting the hundred clans, providing provisions and grain, and not severing the supply routes, I am not equal to Xiao He.",
  "s0479": "In commanding armies of a million, certainly winning battles and certainly taking what is attacked, I am not equal to Han Xin.",
  "s0480": "These three are all heroes among men, and I was able to employ them—this is why I took all under Heaven.",
  "s0481": "Xiang Yu had one Fan Zeng but could not employ him—this is why he became my captive.\"",
  "s0483": "Gao Zu wished to make Luoyang his permanent capital; the Qi man Liu Jing persuaded him, and the Marquis of Liu urged the superior to make his capital within the passes; Gao Zu that very day took his carriage and went in to make his capital within the passes.",
  "s0484": "In the sixth month, they granted a great amnesty to all under Heaven.",
  "s0485": "In the tenth month, King Zang Tu of Yan rebelled and attacked and took the land of Dai.",
  "s0486": "Gao Zu personally commanded to strike him and captured King Zang Tu of Yan.",
  "s0487": "He immediately installed Grand Commandant Lu Wan as King of Yan.",
  "s0488": "He sent Prime Minister Kuai to lead troops to attack Dai.",
  "s0489": "That autumn, Li Ji rebelled; Gao Zu personally led troops to strike him; Li Ji fled.",
  "s0490": "Li Ji was a general of the Xiang clan.",
  "s0491": "When the Xiang clan was defeated, Li Ji was Duke of Chen and did not follow Xiang Yu; he fled and surrendered to Gao Zu, and Gao Zu made him a marquis at Yingchuan.",
  "s0492": "When Gao Zu reached Luoyang, he raised the register of ranked marquises and summoned him; Li Ji was afraid and therefore rebelled.",
  "s0493": "In the sixth year, Gao Zu every five days would have an audience with the Grand Duke, following the rites of father and son in an ordinary family.",
  "s0494": "The Grand Duke's steward persuaded the Grand Duke, saying: \"Heaven has no two suns; the land has no two kings.",
  "s0495": "Now though Gao Zu is your son, he is the lord of men;",
  "s0496": "though the Grand Duke is his father, you are a minister of men.",
  "s0497": "How can you have the lord of men bow to a minister of men!",
  "s0498": "If this continues, authority and dignity will not function.\"",
  "s0499": "Later when Gao Zu came to audience, the Grand Duke held a broom, welcomed him at the gate, and walked backward.",
  "s0500": "Gao Zu was greatly shocked and got down to support the Grand Duke.",
  "s0501": "The Grand Duke said: \"The Emperor is the lord of men—how can you use me to disorder the laws of all under Heaven!\"",
  "s0502": "Thereupon Gao Zu then honored the Grand Duke as Grand Supreme Sovereign.",
  "s0503": "In his heart he approved of the steward's words and bestowed five hundred jin of gold.",
  "s0504": "In the twelfth month, someone submitted a report accusing the King of Chu Xin of plotting rebellion; the superior asked those around him, and those around him competed to attack him.",
  "s0505": "Using Chen Ping's plan, he then pretended to make a tour to Yunmeng and assembled the feudal lords at Chen; the King of Chu Xin came to welcome him and was consequently seized.",
  "s0506": "That day, they granted a great amnesty to all under Heaven.",
  "s0507": "Tian Ken congratulated him and consequently persuaded Gao Zu, saying: \"Your Majesty has obtained Han Xin and also governs the Qin heartland.",
  "s0508": "Qin is a state of natural advantage, girded by the dangers of rivers and mountains, separated by a thousand li, wielding a million halberds—Qin obtains a hundred to two advantage.",
  "s0509": "The terrain is convenient and advantageous; using it to send down troops against the feudal lords is like residing atop a tall building pouring water from a roof.\"",
  "s0510": "As for Qi, to the east it has the wealth of Langye and Jimo, to the south the stronghold of Mount Tai, to the west the barrier of the Turbid River, to the north the benefits of the Bohai.",
  "s0511": "Its territory is two thousand li square, wielding a million halberds, separated a thousand li away—Qi obtains a ten to two advantage.",
  "s0512": "Therefore this is the eastern Qin.",
  "s0513": "Unless it is your own sons and younger brothers, none should be sent to be king of Qi.\"",
  "s0514": "Gao Zu said: \"Excellent.\"",
  "s0515": "He bestowed five hundred jin of gold.",
  "s0516": "After over ten days, he enfeoffed Han Xin as Marquis of Huaiyin and divided his territory into two states.",
  "s0517": "Gao Zu said General Liu Jia had repeatedly achieved merit and made him King of Jing, ruling east of the Huai.",
  "s0518": "His younger brother Jiao became King of Chu, ruling west of the Huai.",
  "s0519": "His son Fei became King of Qi, ruling over seventy cities; all people who could speak the Qi language belonged to Qi.",
  "s0520": "He then evaluated merits and with all the ranked marquises divided tallies and carried out enfeoffments.",
  "s0521": "He moved King Xin of Han to Taiyuan.",
  "s0522": "In the seventh year, the Xiongnu attacked King Xin of Han at Mayi; Xin consequently plotted rebellion with them at Taiyuan.",
  "s0523": "Man Qiu Chen of Baitu and Wang Huang installed the former Zhao general Zhao Li as king to rebel; Gao Zu personally went to strike them.",
  "s0524": "Meeting cold weather, two or three out of ten officers and troops lost fingers; they then reached Pingcheng.",
  "s0525": "The Xiongnu surrounded us at Pingcheng for seven days before withdrawing.",
  "s0526": "He ordered Fan Kuai to remain and settle the land of Dai.",
  "s0527": "He installed his elder brother Liu Zhong as King of Dai.",
  "s0528": "In the second month, Gao Zu from Pingcheng passed through Zhao and Luoyang and reached Chang'an.",
  "s0529": "Changle Palace was completed; the prime minister and below moved to govern at Chang'an.",
  "s0530": "In the eighth year, Gao Zu went east to strike the remaining rebel bandits of King Xin of Han at Dongyuan.",
  "s0531": "Prime Minister Xiao constructed Weiyang Palace, establishing the Eastern Tower, Northern Tower, Front Hall, Armory, and Great Granary.",
  "s0532": "When Gao Zu returned and saw the palace towers were exceedingly grand, he was angry and said to Xiao He: \"All under Heaven has suffered bitterly fighting for several years; success or failure cannot yet be known—why do you govern palace chambers to excess?\"",
  "s0533": "Xiao He said: \"Precisely because all under Heaven is not yet settled, we can consequently proceed to complete the palace chambers.",
  "s0534": "Moreover, the Son of Heaven has the four seas as his home; without grandeur and magnificence there is no way to give weight to authority, and moreover we must not allow later generations to have anything to add.\"",
  "s0535": "Gao Zu was then pleased.",
  "s0536": "When Gao Zu went to Dongyuan and passed through Bairen, Zhao Prime Minister Guan Gao and others plotted to assassinate Gao Zu; Gao Zu's heart was stirred and consequently he did not remain.",
  "s0537": "King Liu Zhong of Dai abandoned his state and fled, returning on his own to Luoyang; he was demoted to be Marquis of Heyang.",
  "s0538": "In the ninth year, the affair of Zhao Prime Minister Guan Gao and others was discovered; their three clans were exterminated.",
  "s0539": "They demoted King Ao of Zhao to be Marquis of Xuanping.",
  "s0540": "That year, they relocated noble clans—the Zhao, Qu, Jing, and Huai of Chu, and the Tian clan of Qi—to Guanzhong.",
  "s0541": "Weiyang Palace was completed.",
  "s0542": "Gao Zu held a great court with the feudal lords and assembled ministers and held a banquet in the front hall of Weiyang.",
  "s0543": "Gao Zu presented a jade cup, rose to offer a toast for the Grand Supreme Sovereign, and said: \"At first the great man always considered me worthless, unable to manage productive work, not as capable as Zhong.",
  "s0544": "Now whose achievements are greater, mine or Zhong's?\"",
  "s0545": "All the assembled ministers in the hall shouted 'Long live!' and laughed greatly in merriment.",
  "s0546": "In the tenth month of the tenth year, King Bu of Huainan, King Peng Yue of Liang, King Lu Wan of Yan, King Liu Jia of Jing, King Liu Jiao of Chu, King Liu Fei of Qi, and King Wu Rui of Changsha all came to court at Changle Palace.",
  "s0547": "In spring and summer there were no events.",
  "s0548": "In the seventh month, the Grand Supreme Sovereign died at Liyang Palace.",
  "s0549": "The King of Chu and King of Liang both came to attend the funeral.",
  "s0550": "They pardoned prisoners of Liyang.",
  "s0551": "They renamed Li township as Xinfeng.",
  "s0552": "In the eighth month, Zhao Prime Minister Chen Xi rebelled in the land of Dai.",
  "s0553": "The superior said: \"Xi was once my envoy and was very trustworthy.",
  "s0554": "The land of Dai is what I urgently need; therefore I enfeoffed Xi as a ranked marquis to serve as prime minister defending Dai—now he actually joins with Wang Huang and others to rob and plunder the land of Dai!",
  "s0555": "The officials and people of the land of Dai are not guilty.",
  "s0556": "Pardon the officials and people of Dai.\"",
  "s0557": "In the ninth month, the superior personally went east to strike him.",
  "s0558": "Reaching Handan, the superior was pleased and said: \"Xi did not occupy Handan to the south and block the Zhang River—I know he is incapable.\"",
  "s0559": "Hearing that Xi's generals were all former merchants, the superior said: \"I know how to deal with them.\"",
  "s0560": "He then enticed Xi's generals with much gold; many of Xi's generals surrendered.",
  "s0561": "In the eleventh year, when Gao Zu at Handan had not yet finished executing Xi and others, Xi's general Hou Chang led over ten thousand men traveling and marching; Wang Huang's army was at Quyi; Zhang Chun crossed the Yellow River to strike Liaocheng.",
  "s0562": "Han sent General Guo Meng with Qi generals to strike and greatly break them.",
  "s0563": "Grand Commandant Zhou Bo went by way of Taiyuan and entered to settle the land of Dai.",
  "s0564": "Reaching Mayi, Mayi would not surrender, so he attacked and devastated it.",
  "s0565": "Xi's general Zhao Li defended Dongyuan; Gao Zu attacked it but it did not fall.",
  "s0566": "After over a month, the troops reviled Gao Zu; Gao Zu was angry.",
  "s0567": "When the city surrendered, he ordered those who had reviled to be beheaded; those who had not reviled were pardoned.",
  "s0568": "Thereupon he divided the mountains north of Zhao and installed his son Heng as King of Dai, with his capital at Jinyang.",
  "s0569": "In spring, the Marquis of Huaiyin Han Xin plotted rebellion in Guanzhong; his three clans were exterminated.",
  "s0570": "In summer, King Peng Yue of Liang plotted rebellion and was demoted and exiled to Shu;",
  "s0571": "wishing to rebel again, his three clans were thereupon exterminated.",
  "s0572": "He installed his son Hui as King of Liang and his son You as King of Huaiyang.",
  "s0573": "In the seventh month of autumn, King Bu of Huainan rebelled, absorbed the territory of King Liu Jia of Jing to the east, crossed the Huai to the north; the King of Chu Jiao fled and entered Xue.",
  "s0574": "Gao Zu personally went to strike him.",
  "s0575": "He installed his son Chang as King of Huainan.",
  "s0576": "In the tenth month of the twelfth year, Gao Zu having struck Bu's army met at Kuai; Bu fled and he ordered separate generals to pursue him.",
  "s0577": "Gao Zu returned, passing through Pei, and remained.",
  "s0578": "He held a banquet at Pei Palace, summoned all his old friends, fathers, elders, sons, and younger brothers to drink without restraint, and gathered one hundred twenty boys from Pei and taught them to sing.",
  "s0579": "When the wine was flowing, Gao Zu struck the zhu and composed a song himself, saying: \"The great wind rises and clouds fly; authority extends over the seas and I return to my native place; where can I find brave men to defend the four quarters!\"",
  "s0580": "He had the boys all harmonize and practice it.",
  "s0581": "Gao Zu then rose to dance, impassioned and moved in feeling, weeping tears streaming down.",
  "s0582": "He said to the fathers and elder brothers of Pei: \"A traveler grieves for his native place.",
  "s0583": "Though I have made my capital in Guanzhong, after ten thousand years my spirit and soul will still delight in longing for Pei.",
  "s0584": "Moreover, I from being Duke of Pei executed the violent and rebellious and consequently possessed all under Heaven; let Pei be my bathing estate, exempt its people, generation after generation never having to contribute anything.\"",
  "s0585": "The fathers, elder brothers, mothers, and old friends of Pei daily delighted in drinking to extreme joy, recounting old times for laughter and pleasure.",
  "s0586": "After over ten days, Gao Zu wished to leave; the fathers and elder brothers of Pei firmly requested Gao Zu to remain.",
  "s0587": "Gao Zu said: \"My people are numerous; the fathers and elder brothers cannot provide for them.\"",
  "s0588": "He then departed.",
  "s0589": "The entire county of Pei went to the west of the township to present offerings.",
  "s0590": "Gao Zu again remained and stopped, holding banquets and drinking for three days.",
  "s0591": "The fathers and elder brothers of Pei all kowtowed and said: \"Pei has been fortunate to obtain exemption; Feng has not been exempted—we only hope Your Majesty will take pity on it.\"",
  "s0592": "Gao Zu said: \"Feng is where I was born and grew up—I absolutely do not forget it; I particularly hold it against them that because of Yong Chi they rebelled against me for Wei.\"",
  "s0593": "The fathers and elder brothers of Pei firmly requested; he then also exempted Feng, equal to Pei.",
  "s0594": "Thereupon he appointed Marquis Liu Bi of Pei as King of Wu.",
  "s0595": "Han generals separately struck Bu's army south and north of the Tao River, all greatly breaking them; pursuing they obtained and beheaded Bu at Poyang.",
  "s0596": "Fan Kuai separately led troops to settle Dai and beheaded Chen Xi at Dangcheng.",
  "s0597": "In the eleventh month, Gao Zu from Bu's army reached Chang'an.",
  "s0598": "In the twelfth month, Gao Zu said: \"The First Emperor of Qin, King Yin of Chu Chen She, King Anli of Wei, King Min of Qi, and King Daoxiang of Zhao are all extinct without descendants; I bestow ten families each to guard their tombs, twenty families for the Emperor of Qin, and five families for Lord Wuji of Wei.\"",
  "s0599": "He pardoned the officials and people of the land of Dai who had been coerced and plundered by Chen Xi and Zhao Li—all were pardoned.",
  "s0600": "Chen Xi's surrendered generals reported that when Xi rebelled, King Lu Wan of Yan sent men to Xi's location and secretly plotted with him.",
  "s0601": "The superior sent Marquis of Biyang to summon Wan; Wan claimed illness.",
  "s0602": "Marquis of Biyang returned and fully reported that Wan's rebellion had signs.",
  "s0603": "In the second month, they sent Fan Kuai and Zhou Bo to lead troops to strike King Wan of Yan and pardoned the officials and people of Yan who had joined the rebellion.",
  "s0604": "They installed the imperial son Jian as King of Yan.",
  "s0605": "When Gao Zu struck Bu, he was hit by a stray arrow; on the road he fell ill.",
  "s0606": "The illness was severe; Empress Lü summoned a good physician; when the physician entered to see him, Gao Zu questioned the physician, who said: \"The illness can be treated.\"",
  "s0607": "Thereupon Gao Zu reviled him rudely, saying: \"I with a commoner's cloth raised a three-foot sword and took all under Heaven—is this not the Mandate of Heaven?",
  "s0608": "Fate lies with Heaven—even if it were Bian Que, what benefit would there be!\"",
  "s0609": "He then would not allow treatment of the illness, bestowed fifty jin of gold, and dismissed him.",
  "s0610": "Soon after, Empress Lü asked: \"After Your Majesty's hundred years, if Prime Minister Xiao dies, whom should we order to replace him?\"",
  "s0611": "The superior said: \"Cao Can is acceptable.\"",
  "s0612": "She asked about the next; the superior said: \"Wang Ling is acceptable.",
  "s0613": "However, Ling is somewhat naive; Chen Ping can assist him.",
  "s0614": "Chen Ping has intelligence in excess but is difficult to employ alone.",
  "s0615": "Zhou Bo is solid and serious but lacks culture; however, he who will secure the Liu clan will certainly be Bo—you can order him to be Grand Commandant.\"",
  "s0616": "Empress Lü again asked about the next; the superior said: \"After this it will also not be what you can know.\"",
  "s0618": "Lu Wan with several thousand cavalry remained below the frontier passes waiting and watching, hoping the superior's illness would improve so he could come in himself to apologize.",
  "s0619": "On the jiachen day of the fourth month, Gao Zu died at Changle Palace.",
  "s0620": "For four days they did not announce the death.",
  "s0621": "Empress Lü plotted with Shen Yiji, saying: \"The various generals were registered household commoners with the Emperor; now they face north as ministers—they are constantly resentful; now they will serve a young lord—unless we completely exterminate the clans, all under Heaven will not be secure.\"",
  "s0622": "Someone heard this and told General Li.",
  "s0623": "General Li went to see Shen Yiji and said: \"I have heard the Emperor has already died; for four days the death has not been announced because you wish to execute the various generals.",
  "s0624": "If this is true, all under Heaven is in danger.",
  "s0625": "Chen Ping and Guan Ying command a hundred thousand defending Yingyang; Fan Kuai and Zhou Bo command two hundred thousand settling Yan and Dai—if they hear the Emperor has died and all generals are to be executed, they will certainly unite their troops and return to their native regions to attack Guanzhong.",
  "s0626": "Great ministers rebel internally, feudal lords rebel externally—destruction can be expected in the time it takes to raise a foot.\"",
  "s0627": "Shen Yiji went in and spoke; they then announced the death on the dingwei day and granted a great amnesty to all under Heaven.",
  "s0628": "Lu Wan heard Gao Zu had died and then fled and entered the Xiongnu.",
  "s0629": "On the bingyin day, they buried him.",
  "s0630": "On the jisi day, they installed the Crown Prince at the Grand Supreme Sovereign's temple.",
  "s0631": "The assembled ministers all said: \"Gao Zu arose from humble and minor beginnings, overturned the chaotic age and returned it to rightness, pacified all under Heaven—he is the Grand Ancestor of Han with the highest achievements.\"",
  "s0632": "They presented the honored title of High Emperor.",
  "s0633": "The Crown Prince inherited the title as Emperor—this is Emperor Xiaohui.",
  "s0634": "He ordered the commanderies, states, and feudal lords to each establish a temple to Gao Zu to make offerings at the proper seasonal times.",
  "s0635": "When in the fifth year of Emperor Xiaohui they recalled Gao Zu's grief and joy at Pei, they made Pei Palace the original temple of Gao Zu.",
  "s0636": "The one hundred twenty boys Gao Zu had taught to sing were all ordered to perform music; when later there were vacancies, they would always fill them.",
  "s0637": "The High Emperor had eight sons: the eldest, Concubine-born King Dao Hui of Qi, Fei;",
  "s0638": "next Emperor Xiaohui, son of Empress Lü;",
  "s0639": "next Consort Qi's son King Yin of Zhao, Ruyi;",
  "s0640": "next King Heng of Dai, who was installed as Emperor Xiaowen, son of Grand Empress Dowager Bo;",
  "s0641": "next King Hui of Liang, who in Empress Lü's time was moved to be King Gong of Zhao;",
  "s0642": "next King You of Huaiyang, who in Empress Lü's time was moved to be King You of Zhao;",
  "s0643": "next King Li of Huainan, Chang;",
  "s0644": "next King Jian of Yan.",
  "s0645": "The Grand Historian says: The governance of Xia was loyal.",
  "s0646": "When loyalty became corrupt, petty men became crude; therefore the Yin people succeeded it with reverence.",
  "s0647": "When reverence became corrupt, petty men became superstitious; therefore the Zhou people succeeded it with culture.",
  "s0648": "When culture becomes corrupt, petty men become deceitful; therefore to rescue deceit nothing is better than loyalty.",
  "s0649": "The Way of the Three Kings is like a cycle, ending and beginning again.",
  "s0650": "Between Zhou and Qin, it can be said culture had become corrupt.",
  "s0651": "Qin's governance did not reform but instead made laws and punishments harsh—was this not mistaken?",
  "s0652": "Therefore when Han arose, inheriting corruption and changing easily, it made people untiring and obtained Heaven's succession.",
  "s0653": "Court audiences were held in the tenth month.",
  "s0654": "Chariots and regalia used yellow canopies with left-side banners.",
  "s0655": "He was buried at Changling."
}
