{
  "s0001": "Emperor Xiaojing had thirteen sons who became kings, born to five different mothers. Those from the same mother were considered clan relatives.",
  "s0002": "Consort Li's sons were Rong, De, and A Yu.",
  "s0003": "Consort Cheng's sons were Yu, Fei, and Duan.",
  "s0004": "Lady Jia's sons were Pengzu and Sheng.",
  "s0005": "Consort Tang's son was Fa.",
  "s0006": "Lady Wang and Lady Xu's sons were Yue, Ji, Cheng, and Shun.",
  "s0007": "King Xian of Hejian, De, was made King of Hejian as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0008": "He loved Confucian learning. Even in his clothing and hasty actions, he always followed Confucian scholars.",
  "s0009": "Many Confucian scholars from Shandong traveled to study with him.",
  "s0010": "He died after twenty-six years. His son, King Gong Bu Hai, succeeded him.",
  "s0011": "He died after four years. His son, King Gang Ji, succeeded him.",
  "s0012": "He died after twelve years. His son, King Qing Shou, succeeded him.",
  "s0013": "King Ai of Linjiang, A Yu, was made King of Linjiang as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0014": "He died after three years with no heirs. The kingdom was abolished and became a commandery.",
  "s0015": "King Min of Linjiang, Rong, was made crown prince in Emperor Xiaojing's fourth year before his reign. He was deposed after four years and the former crown prince was made King of Linjiang.",
  "s0016": "In his fourth year, he was convicted of encroaching on the temple grounds to build a palace. The emperor summoned Rong to court.",
  "s0017": "As Rong set out, he performed the ancestral farewell rites at the north gate of Jiangling.",
  "s0018": "He had already boarded his carriage when the axle broke and the carriage was ruined.",
  "s0019": "The elders of Jiangling wept and whispered among themselves: 'Our king will never return!'",
  "s0020": "When Rong arrived, he reported to the Commandant of Justice's office.",
  "s0021": "Commandant Zhi Du interrogated the king, who became terrified and committed suicide.",
  "s0022": "He was buried at Lantian.",
  "s0023": "Tens of thousands of Yan people carried soil in their mouths to build his tomb. The common people pitied him.",
  "s0024": "Rong was the eldest but died without heirs. The kingdom was abolished and its territory incorporated into Han as Nanhun Commandery.",
  "s0025": "These three kingdoms were originally ruled by sons of Consort Li.",
  "s0026": "King Gong of Lu, Yu, was made King of Huaiyang as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0027": "Two years after the Wu and Chu rebellion was crushed, he was moved to become King of Lu in Emperor Xiaojing's third year before his reign.",
  "s0028": "He enjoyed constructing palaces, gardens, and parks, as well as dogs and horses.",
  "s0029": "In his later years he loved music but disliked literary debate.",
  "s0030": "He was a glutton.",
  "s0031": "He died after twenty-six years. His son Guang succeeded to the throne.",
  "s0032": "At first he loved music and chariots.",
  "s0033": "In his later years he became miserly, always fearing he lacked sufficient wealth.",
  "s0034": "King Yi of Jiangdu, Fei, was made King of Runan as imperial son in Emperor Xiaojing's second year before his reign.",
  "s0035": "During the Wu and Chu rebellion, Fei was fifteen and showed great courage. He petitioned to lead troops against Wu.",
  "s0036": "Emperor Jing granted Fei a general's seal and sent him to attack Wu.",
  "s0037": "After Wu was defeated, two years later he was moved to become King of Jiangdu, ruling the former Wu territory. For his military achievements, he was granted the emperor's banners.",
  "s0038": "In the fifth year of Yuanguang, the Xiongnu invaded Han territory on a large scale. Fei petitioned to attack the Xiongnu, but the emperor would not allow it.",
  "s0039": "Fei was fond of physical strength and built palaces and towers. He attracted bold heroes from all directions and lived in great extravagance.",
  "s0040": "He reigned for twenty-six years and died. His son Jian succeeded him.",
  "s0041": "He committed suicide after seven years.",
  "s0042": "During the Huainan and Hengshan rebellion, Jian had heard rumors of their plot.",
  "s0043": "Since his kingdom bordered Huainan, he feared that if rebellion broke out he would be annexed. So he secretly manufactured weapons while always wearing his father's general's seal and going out with the emperor's banners.",
  "s0044": "Before King Yi was even buried, Jian took a fancy to King Yi's favored beauty Nao Ji and sent men at night to bring her to his chambers for illicit relations.",
  "s0045": "When the Huainan affair broke out, the investigation of accomplices implicated both Jian and King Jian of Jiangdu.",
  "s0046": "Jian became frightened and sent men with large amounts of gold and money to bribe officials and suppress the case.",
  "s0047": "He also trusted sorcerers and witches, sending them to pray and make false claims.",
  "s0048": "Jian also committed incest with all his sisters and brothers.",
  "s0049": "When these matters became known, Han's nobles and ministers requested that Jian be arrested and tried.",
  "s0050": "The Son of Heaven could not bear to do it and sent ministers to interrogate the king in person."
}

