{
  "s0051": "Down Zhao ten cities, remainder all walled guarded, none willing down.",
  "s0052": "Then led troops northeast attacked Fanyang.",
  "s0053": "Fanyang person Kuai Tong persuaded Fanyang magistrate: 'Secretly heard lord will die, thus condole.",
  "s0054": "Although so, congratulate lord got Tong live.'",
  "s0055": "Fanyang magistrate said: 'With what condole it?'",
  "s0056": "Replied: 'Qin law heavy, your excellency as Fanyang magistrate ten years, killed person father, orphaned person son, broke person feet, tattooed person head, cannot count.",
  "s0057": "However kind fathers filial sons none dare stab blade lord abdomen middle, feared Qin law only.",
  "s0058": "Now world greatly chaotic, Qin law not applied, then kind fathers filial sons moreover stab blade lord abdomen middle to complete their name, this minister what condole lord.'",
  "s0059": "Now feudal lords rebelled Qin, Wu Xin Jun troops moreover arrived, yet lord firmly guard Fanyang, youths all contend kill lord, down Wu Xin Jun.",
  "s0060": "Lord urgent send minister see Wu Xin Jun, can turn calamity to fortune, at now.'",
  "s0062": "Fanyang magistrate then made Kuai Tong see Wu Xin Jun: 'Your excellency certainly will battle victory then attack land, attack get then down city, minister secretly considers over.",
  "s0063": "Truly listen minister plan, can not attack down city, not battle attack land, transmit notice then thousand li settle, possible?'",
  "s0064": "Wu Xin Jun said: 'What call?'",
  "s0065": "Kuai Tong said: 'Now Fanyang magistrate should arrange his soldiers guard battle, cowardly fear death, greedy heavy rich noble, thus wish first heaven down surrender, fear lord as Qin placed official, execute kill like previous ten cities.",
  "s0066": "However now Fanyang youths also just kill their magistrate, self with city resist lord.",
  "s0067": "Lord why not carry minister marquis seal, appoint Fanyang magistrate, Fanyang magistrate then with city down lord, youths also dare not kill their magistrate.",
  "s0068": "Make Fanyang magistrate ride red wheel splendid carriage, make drive gallop Yan, Zhao suburbs.",
  "s0069": "Yan, Zhao suburbs see it, all say this Fanyang magistrate, first down one, then happy, Yan, Zhao cities can no battle down.'",
  "s0070": "This minister what called transmit notice thousand li settle.'",
  "s0071": "Wu Xin Jun from his plan, because made Kuai Tong grant Fanyang magistrate marquis seal.",
  "s0072": "Zhao land heard it, not battle with city down thirty plus cities.",
  "s0073": "Arrived Handan, Zhang Er, Chen Yu heard Zhou Zhang army enter pass, to Xi retreated;",
  "s0074": "Again heard various generals for Chen king attack land, many with slander destroyed got crime executed, resented Chen king not treat them not as general but as colonel.",
  "s0075": "Then persuaded Wu Chen: 'Chen king rose Qi, arrived Chen king, not necessarily establish six states posterity.",
  "s0076": "General now with three thousand down Zhao several ten cities, alone isolated dwell Hebei, not king no fill it.",
  "s0077": "Moreover Chen king listen slander, returned report, fear not escape calamity.",
  "s0078": "Again not equal establish his brothers;",
  "s0079": "Not, then establish Zhao posterity.",
  "s0080": "General no lose time, time gap not allow rest.'",
  "s0081": "Wu Chen then listened, then established as Zhao king.",
  "s0082": "With Chen Yu as great general, Zhang Er as right chancellor, Shao Sao as left chancellor.",
  "s0083": "Made people report Chen king, Chen king greatly angered, wished exterminate Wu Chen etc. family, yet send troops attack Zhao.",
  "s0084": "Chen king chancellor Guo Jun advised: 'Qin not perished execute Wu Chen etc. family, this again give birth one Qin.",
  "s0085": "Not equal because congratulate them, make urgent led troops west attack Qin.'",
  "s0086": "Chen king yes, from his plan, moved imprisoned Wu Chen etc. family palace middle, sealed Zhang Er son Ao as Chengdu jun.",
  "s0087": "Chen king made envoy congratulate Zhao, commanded hasten send troops west enter pass.",
  "s0088": "Zhang Er, Chen Yu persuaded Wu Chen: 'King king Zhao, not Chu intent, special with plan congratulate king.",
  "s0089": "Chu already extinguished Qin, certainly add troops to Zhao.",
  "s0090": "Wish king no west troops, north attack Yan, Dai, south collect Henan to self broaden.",
  "s0091": "Zhao south occupy great river, north have Yan, Dai, Chu though victory Qin, certainly dare not control Zhao.'",
  "s0092": "Zhao king considered yes, because not west troops, yet made Han Guang attack Yan, Li Liang attack Changshan, Zhang Yi attack Shangdang.",
  "s0093": "Han Guang arrived Yan, Yan people because established Guang as Yan king.",
  "s0094": "Zhao king then with Zhang Er, Chen Yu north attack land Yan border.",
  "s0095": "Zhao king idle out, by Yan army obtained.",
  "s0096": "Yan general imprisoned him, wished with divide Zhao land half, then return king.",
  "s0097": "Envoys went, Yan then killed to seek land.",
  "s0098": "Zhang Er, Chen Yu worried.",
  "s0099": "Had servant raised soldier Xie his quarters middle: 'I for you persuade Yan, with Zhao king carriage return.'",
  "s0100": "Quarters middle all laughed: 'Envoys went ten plus, then died, how able get king?'",
  "s0101": "Then ran Yan wall."
}
