{
  "s1244": "259 Fifty-sixth year, forty-eighth year, eighteenth year, fourteenth year, seventh year, fourth year, thirteenth year, sixth year",
  "s1245": "258 Fifty-seventh year, forty-ninth year, nineteenth year, fifteenth year, eighth year, fifth year, fourteenth year, seventh year",
  "s1246": "257 Fifty-eighth year, fiftieth year.",
  "s1247": "Wang Ji, Zheng An Ping surrounded Han Dan, and Ji returned army, captured Xin Zhong.",
  "s1248": "Twentieth year.",
  "s1249": "Gong Zi Wu Ji rescued Han Dan, Qin troops withdrew.",
  "s1250": "Sixteenth year, ninth year.",
  "s1251": "Qin surrounded our Han Dan, Chu, Wei rescued us.",
  "s1252": "Sixth year.",
  "s1253": "Chun Shen Jun rescued Zhao.",
  "s1254": "Yan Xiao Wang first year, eighth year",
  "s1255": "256 Fifty-ninth year.",
  "s1256": ".",
  "s1257": "Nan Wang died.",
  "s1258": "Fifty-first year, twenty-first year.",
  "s1259": "Han, Wei, Chu rescued Zhao Xin Zhong, Qin troops stopped.",
  "s1260": "Seventeenth year.",
  "s1261": "Qin attacked our Yang Cheng, rescued Zhao Xin Zhong.",
  "s1262": "Tenth year, seventh year.",
  "s1263": "Eighteenth year.",
  "s1264": "Ninth year.",
  "s1265": "Eleventh year, eighth year.",
  "s1266": "Nineteenth year.",
  "s1267": "Tenth year.",
  "s1268": "Twelfth year, ninth year.",
  "s1269": "Twentieth year.",
  "s1270": "Eleventh year.",
  "s1271": "Thirteenth year, tenth year.",
  "s1272": "Twenty-first year.",
  "s1273": "Twelfth year.",
  "s1274": "Fourteenth year, eleventh year.",
  "s1275": "Twenty-second year.",
  "s1276": "Thirteenth year.",
  "s1277": "Fifteenth year, twelfth year.",
  "s1278": "Twenty-third year.",
  "s1279": "Fourteenth year.",
  "s1280": "Sixteenth year, thirteenth year.",
  "s1281": "Twenty-fourth year.",
  "s1282": "Fifteenth year.",
  "s1283": "Seventeenth year, fourteenth year.",
  "s1284": "Twenty-fifth year.",
  "s1285": "Sixteenth year.",
  "s1286": "Eighteenth year, fifteenth year.",
  "s1287": "Twenty-sixth year.",
  "s1288": "Seventeenth year.",
  "s1289": "Nineteenth year, sixteenth year.",
  "s1290": "Twenty-seventh year.",
  "s1291": "Eighteenth year.",
  "s1292": "Twentieth year, seventeenth year.",
  "s1293": "Twenty-eighth year.",
  "s1294": "Nineteenth year.",
  "s1295": "Twenty-first year, eighteenth year.",
  "s1296": "Twenty-ninth year.",
  "s1297": "Twentieth year.",
  "s1298": "Twenty-second year, nineteenth year.",
  "s1299": "Thirtieth year.",
  "s1300": "Twenty-first year.",
  "s1301": "Solar eclipse.",
  "s1302": "Twenty-ninth year, twenty-fifth year, eighteenth year, fifteenth year.",
  "s1303": "Chun Shen Jun moved enfeoffment to Wu.",
  "s1304": "Seventh year, seventeenth year",
  "s1305": "247 Third year.",
  "s1306": "Wang Ji attacked Shang Dang.",
  "s1307": "Initially established Taiyuan commandery.",
  "s1308": "Wei Gong Zi Wu Ji led five states repelled our army south of Yellow River, Meng Ao withdrew, thirtieth year.",
  "s1309": "Wu Ji led five states troops defeated Qin army south of Yellow River.",
  "s1310": "Twenty-sixth year.",
  "s1311": "Qin captured our Shang Dang.",
  "s1312": "Nineteenth year, sixteenth year, eighth year, eighteenth year",
  "s1313": "246 First Emperor first year.",
  "s1314": ".",
  "s1315": "Attacked and took Jin Yang, made Zheng Guo canal.",
  "s1316": "Thirty-first year, twenty-seventh year, twentieth year.",
  "s1317": "Qin captured our Jin Yang.",
  "s1318": "Seventeenth year, ninth year, nineteenth year",
  "s1319": "245 Second year, thirty-second year, twenty-eighth year, twenty-first year, eighteenth year, tenth year, twentieth year",
  "s1320": "244 Third year, thirty-third year, twenty-ninth year, twenty-second year, nineteenth year, eleventh year, twenty-first year",
  "s1321": "243 Fourth year, thirty-fourth year, thirtieth year, twenty-third year, twentieth year, twelfth year, twenty-second year",
  "s1322": "242 Fifth year, thirty-fifth year, thirty-first year, twenty-fourth year, twenty-first year, thirteenth year, twenty-third year",
  "s1323": "241 Sixth year, thirty-sixth year, thirty-second year, twenty-fifth year, twenty-second year, fourteenth year, twenty-fourth year",
  "s1324": "240 Seventh year, thirty-seventh year, thirty-third year, twenty-sixth year, twenty-third year, fifteenth year, twenty-fifth year",
  "s1325": "239 Eighth year, thirty-eighth year, thirty-fourth year, twenty-seventh year, twenty-fourth year, sixteenth year, twenty-sixth year",
  "s1326": "238 Ninth year, thirty-ninth year, thirty-fifth year, twenty-eighth year, twenty-fifth year, seventeenth year, twenty-seventh year",
  "s1327": "237 Tenth year, fortieth year, thirty-sixth year, twenty-ninth year, twenty-sixth year, eighteenth year, twenty-eighth year",
  "s1328": "236 Eleventh year, forty-first year, thirty-seventh year, thirtieth year, twenty-seventh year, nineteenth year, twenty-ninth year",
  "s1329": "235 Twelfth year, forty-second year, thirty-eighth year, thirty-first year, twenty-eighth year, twentieth year, thirtieth year",
  "s1330": "234 Thirteenth year, forty-third year, thirty-ninth year, thirty-second year, twenty-ninth year, twenty-first year, thirty-first year",
  "s1331": "233 Fourteenth year, forty-fourth year, fortieth year, thirty-third year, thirtieth year, twenty-second year, thirty-second year",
  "s1332": "232 Fifteenth year, forty-fifth year, forty-first year, thirty-fourth year, thirty-first year, twenty-third year, thirty-third year",
  "s1333": "231 Sixteenth year, forty-sixth year, forty-second year, thirty-fifth year, thirty-second year, twenty-fourth year, thirty-fourth year",
  "s1334": "230 Seventeenth year, forty-seventh year, forty-third year, thirty-sixth year, thirty-third year, twenty-fifth year, thirty-fifth year",
  "s1335": "229 Eighteenth year, forty-eighth year, forty-fourth year, thirty-seventh year, thirty-fourth year, twenty-sixth year, thirty-sixth year",
  "s1336": "228 Nineteenth year, forty-ninth year, forty-fifth year, thirty-eighth year, thirty-fifth year, twenty-seventh year, thirty-seventh year",
  "s1337": "227 Twentieth year, fiftieth year, forty-sixth year, thirty-ninth year, thirty-sixth year, twenty-eighth year, thirty-eighth year",
  "s1338": "226 Twenty-first year, fifty-first year, forty-seventh year, fortieth year, thirty-seventh year, twenty-ninth year, thirty-ninth year",
  "s1339": "225 Twenty-second year, fifty-second year, forty-eighth year, forty-first year, thirty-eighth year, thirtieth year, fortieth year",
  "s1340": "224 Twenty-third year, fifty-third year, forty-ninth year, forty-second year, thirty-ninth year, thirty-first year, forty-first year",
  "s1341": "223 Twenty-fourth year, fifty-fourth year, fiftieth year, forty-third year, fortieth year, thirty-second year, forty-second year",
  "s1342": "222 Twenty-fifth year, fifty-fifth year, fifty-first year, forty-fourth year, forty-first year, thirty-third year, forty-third year",
  "s1343": "221 Twenty-sixth year, fifty-sixth year, fifty-second year, forty-fifth year, forty-second year, thirty-fourth year, forty-fourth year",
  "s1344": "220 Twenty-seventh year, fifty-seventh year, fifty-third year, forty-sixth year, forty-third year, thirty-fifth year, forty-fifth year",
  "s1345": "219 Twenty-eighth year, fifty-eighth year, fifty-fourth year, forty-seventh year, forty-fourth year, thirty-sixth year, forty-sixth year",
  "s1346": "218 Twenty-ninth year, fifty-ninth year, fifty-fifth year, forty-eighth year, forty-fifth year, thirty-seventh year, forty-seventh year",
  "s1347": "217 Thirtieth year, sixtieth year, fifty-sixth year, forty-ninth year, forty-sixth year, thirty-eighth year, forty-eighth year",
  "s1348": "216 Thirty-first year, sixty-first year, fifty-seventh year, fiftieth year, forty-seventh year, thirty-ninth year, forty-ninth year",
  "s1349": "215 Thirty-second year, sixty-second year, fifty-eighth year, fifty-first year, forty-eighth year, fortieth year, fiftieth year",
  "s1350": "214 Thirty-third year, sixty-third year, fifty-ninth year, fifty-second year, forty-ninth year, forty-first year, fifty-first year",
  "s1351": "213 Thirty-fourth year, sixty-fourth year, sixtieth year, fifty-third year, fiftieth year, forty-second year, fifty-second year",
  "s1352": "212 Thirty-fifth year, sixty-fifth year, sixty-first year, fifty-fourth year, fifty-first year, forty-third year, fifty-third year",
  "s1353": "211 Thirty-sixth year, sixty-sixth year, sixty-second year, fifty-fifth year, fifty-second year, forty-fourth year, fifty-fourth year",
  "s1354": "210 Thirty-seventh year, sixty-seventh year, sixty-third year, fifty-sixth year, fifty-third year, forty-fifth year, fifty-fifth year",
  "s1355": "209 Thirty-eighth year, sixty-eighth year, sixty-fourth year, fifty-seventh year, fifty-fourth year, forty-sixth year, fifty-sixth year",
  "s1356": "208 Thirty-ninth year, sixty-ninth year, sixty-fifth year, fifty-eighth year, fifty-fifth year, forty-seventh year, fifty-seventh year",
  "s1357": "207 Fortieth year, seventieth year, sixty-sixth year, fifty-ninth year, fifty-sixth year, forty-eighth year, fifty-eighth year",
  "s1358": "206 Forty-first year, seventy-first year, sixty-seventh year, sixtieth year, fifty-seventh year, forty-ninth year, fifty-ninth year",
  "s1359": "205 Forty-second year, seventy-second year, sixty-eighth year, sixty-first year, fifty-eighth year, fiftieth year, sixtieth year",
  "s1360": "204 Forty-third year, seventy-third year, sixty-ninth year, sixty-second year, fifty-ninth year, fifty-first year, sixty-first year",
  "s1361": "203 Forty-fourth year, seventy-fourth year, seventieth year, sixty-third year, sixtieth year, fifty-second year, sixty-second year",
  "s1362": "202 Forty-fifth year, seventy-fifth year, seventy-first year, sixty-fourth year, sixty-first year, fifty-third year, sixty-third year",
  "s1363": "201 Forty-sixth year, seventy-sixth year, seventy-second year, sixty-fifth year, sixty-second year, fifty-fourth year, sixty-fourth year",
  "s1364": "200 Forty-seventh year, seventy-seventh year, seventy-third year, sixty-sixth year, sixty-third year, fifty-fifth year, sixty-fifth year",
  "s1365": "199 Forty-eighth year, seventy-eighth year, seventy-fourth year, sixty-seventh year, sixty-fourth year, fifty-sixth year, sixty-sixth year",
  "s1366": "198 Forty-ninth year, seventy-ninth year, seventy-fifth year, sixty-eighth year, sixty-fifth year, fifty-seventh year, sixty-seventh year",
  "s1367": "197 Fiftieth year, eightieth year, seventy-sixth year, sixty-ninth year, sixty-sixth year, fifty-eighth year, sixty-eighth year",
  "s1368": "196 Fifty-first year, eighty-first year, seventy-seventh year, seventieth year, sixty-seventh year, fifty-ninth year, sixty-ninth year",
  "s1369": "195 Fifty-second year, eighty-second year, seventy-eighth year, seventy-first year, sixty-eighth year, sixtieth year, seventieth year",
  "s1370": "194 Fifty-third year, eighty-third year, seventy-ninth year, seventy-second year, sixty-ninth year, sixty-first year, seventy-first year",
  "s1371": "193 Fifty-fourth year, eighty-fourth year, eightieth year, seventy-third year, seventieth year, sixty-second year, seventy-second year",
  "s1372": "192 Fifty-fifth year, eighty-fifth year, eighty-first year, seventy-fourth year, seventy-first year, sixty-third year, seventy-third year",
  "s1373": "191 Fifty-sixth year, eighty-sixth year, eighty-second year, seventy-fifth year, seventy-second year, sixty-fourth year, seventy-fourth year",
  "s1374": "190 Fifty-seventh year, eighty-seventh year, eighty-third year, seventy-sixth year, seventy-third year, sixty-fifth year, seventy-fifth year",
  "s1375": "189 Fifty-eighth year, eighty-eighth year, eighty-fourth year, seventy-seventh year, seventy-fourth year, sixty-sixth year, seventy-sixth year",
  "s1376": "188 Fifty-ninth year, eighty-ninth year, eighty-fifth year, seventy-eighth year, seventy-fifth year, sixty-seventh year, seventy-seventh year",
  "s1377": "187 Sixtieth year, ninetieth year, eighty-sixth year, seventy-ninth year, seventy-sixth year, sixty-eighth year, seventy-eighth year",
  "s1378": "186 Sixty-first year, ninety-first year, eighty-seventh year, eightieth year, seventy-seventh year, sixty-ninth year, seventy-ninth year",
  "s1379": "185 Sixty-second year, ninety-second year, eighty-eighth year, eighty-first year, seventy-eighth year, seventieth year, eightieth year",
  "s1380": "184 Sixty-third year, ninety-third year, eighty-ninth year, eighty-second year, seventy-ninth year, seventy-first year, eighty-first year",
  "s1381": "183 Sixty-fourth year, ninety-fourth year, ninetieth year, eighty-third year, eightieth year, seventy-second year, eighty-second year",
  "s1382": "182 Sixty-fifth year, ninety-fifth year, ninety-first year, eighty-fourth year, eighty-first year, seventy-third year, eighty-third year",
  "s1383": "181 Sixty-sixth year, ninety-sixth year, ninety-second year, eighty-fifth year, eighty-second year, seventy-fourth year, eighty-fourth year",
  "s1384": "180 Sixty-seventh year, ninety-seventh year, ninety-third year, eighty-sixth year, eighty-third year, seventy-fifth year, eighty-fifth year",
  "s1385": "179 Sixty-eighth year, ninety-eighth year, ninety-fourth year, eighty-seventh year, eighty-fourth year, seventy-sixth year, eighty-sixth year",
  "s1386": "178 Sixty-ninth year, ninety-ninth year, ninety-fifth year, eighty-eighth year, eighty-fifth year, seventy-seventh year, eighty-seventh year",
  "s1387": "177 Seventieth year, hundredth year, ninety-sixth year, eighty-ninth year, eighty-sixth year, seventy-eighth year, eighty-eighth year",
  "s1388": "176 Seventy-first year, hundred first year, ninety-seventh year, ninetieth year, eighty-seventh year, seventy-ninth year, eighty-ninth year",
  "s1389": "175 Seventy-second year, hundred second year, ninety-eighth year, ninety-first year, eighty-eighth year, eightieth year, ninetieth year",
  "s1390": "174 Seventy-third year, hundred third year, ninety-ninth year, ninety-second year, eighty-ninth year, eighty-first year, ninety-first year",
  "s1391": "173 Seventy-fourth year, hundred fourth year, hundredth year, ninety-third year, ninetieth year, eighty-second year, ninety-second year",
  "s1392": "172 Seventy-fifth year, hundred fifth year, hundred first year, ninety-fourth year, ninety-first year, eighty-third year, ninety-third year",
  "s1393": "171 Seventy-sixth year, hundred sixth year, hundred second year, ninety-fifth year, ninety-second year, eighty-fourth year, ninety-fourth year",
  "s1394": "170 Seventy-seventh year, hundred seventh year, hundred third year, ninety-sixth year, ninety-third year, eighty-fifth year, ninety-fifth year",
  "s1395": "169 Seventy-eighth year, hundred eighth year, hundred fourth year, ninety-seventh year, ninety-fourth year, eighty-sixth year, ninety-sixth year",
  "s1396": "168 Seventy-ninth year, hundred ninth year, hundred fifth year, ninety-eighth year, ninety-fifth year, eighty-seventh year, ninety-seventh year",
  "s1397": "167 Eightieth year, hundred tenth year, hundred sixth year, ninety-ninth year, ninety-sixth year, eighty-eighth year, ninety-eighth year",
  "s1398": "166 Eighty-first year, hundred eleventh year, hundred seventh year, hundredth year, ninety-seventh year, eighty-ninth year, ninety-ninth year",
  "s1399": "165 Eighty-second year, hundred twelfth year, hundred eighth year, hundred first year, ninety-eighth year, ninetieth year, hundredth year",
  "s1400": "164 Eighty-third year, hundred thirteenth year, hundred ninth year, hundred second year, ninety-ninth year, ninety-first year, hundred first year",
  "s1401": "163 Eighty-fourth year, hundred fourteenth year, hundred tenth year, hundred third year, hundredth year, ninety-second year, hundred second year",
  "s1402": "162 Eighty-fifth year, hundred fifteenth year, hundred eleventh year, hundred fourth year, hundred first year, ninety-third year, hundred third year",
  "s1403": "161 Eighty-sixth year, hundred sixteenth year, hundred twelfth year, hundred fifth year, hundred second year, ninety-fourth year, hundred fourth year",
  "s1404": "160 Eighty-seventh year, hundred seventeenth year, hundred thirteenth year, hundred sixth year, hundred third year, ninety-fifth year, hundred fifth year",
  "s1405": "159 Eighty-eighth year, hundred eighteenth year, hundred fourteenth year, hundred seventh year, hundred fourth year, ninety-sixth year, hundred sixth year",
  "s1406": "158 Eighty-ninth year, hundred nineteenth year, hundred fifteenth year, hundred eighth year, hundred fifth year, ninety-seventh year, hundred seventh year",
  "s1407": "157 Ninetieth year, hundred twentieth year, hundred sixteenth year, hundred ninth year, hundred sixth year, ninety-eighth year, hundred eighth year",
  "s1408": "156 Ninety-first year, hundred twenty-first year, hundred seventeenth year, hundred tenth year, hundred seventh year, ninety-ninth year, hundred ninth year",
  "s1409": "155 Ninety-second year, hundred twenty-second year, hundred eighteenth year, hundred eleventh year, hundred eighth year, hundredth year, hundred tenth year",
  "s1410": "154 Ninety-third year, hundred twenty-third year, hundred nineteenth year, hundred twelfth year, hundred ninth year, hundred first year, hundred eleventh year",
  "s1411": "153 Ninety-fourth year, hundred twenty-fourth year, hundred twentieth year, hundred thirteenth year, hundred tenth year, hundred second year, hundred twelfth year",
  "s1412": "152 Ninety-fifth year, hundred twenty-fifth year, hundred twenty-first year, hundred fourteenth year, hundred eleventh year, hundred third year, hundred thirteenth year",
  "s1413": "151 Ninety-sixth year, hundred twenty-sixth year, hundred twenty-second year, hundred fifteenth year, hundred twelfth year, hundred fourth year, hundred fourteenth year",
  "s1414": "150 Ninety-seventh year, hundred twenty-seventh year, hundred twenty-third year, hundred sixteenth year, hundred thirteenth year, hundred fifth year, hundred fifteenth year",
  "s1415": "149 Ninety-eighth year, hundred twenty-eighth year, hundred twenty-fourth year, hundred seventeenth year, hundred fourteenth year, hundred sixth year, hundred sixteenth year",
  "s1416": "148 Ninety-ninth year, hundred twenty-ninth year, hundred twenty-fifth year, hundred eighteenth year, hundred fifteenth year, hundred seventh year, hundred seventeenth year",
  "s1417": "147 Hundredth year, hundred thirtieth year, hundred twenty-sixth year, hundred nineteenth year, hundred sixteenth year, hundred eighth year, hundred eighteenth year",
  "s1418": "146 Hundred first year, hundred thirty-first year, hundred twenty-seventh year, hundred twentieth year, hundred seventeenth year, hundred ninth year, hundred nineteenth year",
  "s1419": "145 Hundred second year, hundred thirty-second year, hundred twenty-eighth year, hundred twenty-first year, hundred eighteenth year, hundred tenth year, hundred twentieth year",
  "s1420": "144 Hundred third year, hundred thirty-third year, hundred twenty-ninth year, hundred twenty-second year, hundred nineteenth year, hundred eleventh year, hundred twenty-first year",
  "s1421": "143 Hundred fourth year, hundred thirty-fourth year, hundred thirtieth year, hundred twenty-third year, hundred twentieth year, hundred twelfth year, hundred twenty-second year",
  "s1422": "142 Hundred fifth year, hundred thirty-fifth year, hundred thirty-first year, hundred twenty-fourth year, hundred twenty-first year, hundred thirteenth year, hundred twenty-third year",
  "s1423": "141 Hundred sixth year, hundred thirty-sixth year, hundred thirty-second year, hundred twenty-fifth year, hundred twenty-second year, hundred fourteenth year, hundred twenty-fourth year",
  "s1424": "140 Hundred seventh year, hundred thirty-seventh year, hundred thirty-third year, hundred twenty-sixth year, hundred twenty-third year, hundred fifteenth year, hundred twenty-fifth year",
  "s1425": "139 Hundred eighth year, hundred thirty-eighth year, hundred thirty-fourth year, hundred twenty-seventh year, hundred twenty-fourth year, hundred sixteenth year, hundred twenty-sixth year",
  "s1426": "138 Hundred ninth year, hundred thirty-ninth year, hundred thirty-fifth year, hundred twenty-eighth year, hundred twenty-fifth year, hundred seventeenth year, hundred twenty-seventh year",
  "s1427": "137 Hundred tenth year, hundred fortieth year, hundred thirty-sixth year, hundred twenty-ninth year, hundred twenty-sixth year, hundred eighteenth year, hundred twenty-eighth year",
  "s1428": "136 Hundred eleventh year, hundred forty-first year, hundred thirty-seventh year, hundred thirtieth year, hundred twenty-seventh year, hundred nineteenth year, hundred twenty-ninth year",
  "s1429": "135 Hundred twelfth year, hundred forty-second year, hundred thirty-eighth year, hundred thirty-first year, hundred twenty-eighth year, hundred twentieth year, hundred thirtieth year",
  "s1430": "134 Hundred thirteenth year, hundred forty-third year, hundred thirty-ninth year, hundred thirty-second year, hundred twenty-ninth year, hundred twenty-first year, hundred thirty-first year",
  "s1431": "133 Hundred fourteenth year, hundred forty-fourth year, hundred fortieth year, hundred thirty-third year, hundred thirtieth year, hundred twenty-second year, hundred thirty-second year",
  "s1432": "132 Hundred fifteenth year, hundred forty-fifth year, hundred forty-first year, hundred thirty-fourth year, hundred thirty-first year, hundred twenty-third year, hundred thirty-third year",
  "s1433": "131 Hundred sixteenth year, hundred forty-sixth year, hundred forty-second year, hundred thirty-fifth year, hundred thirty-second year, hundred twenty-fourth year, hundred thirty-fourth year",
  "s1434": "130 Hundred seventeenth year, hundred forty-seventh year, hundred forty-third year, hundred thirty-sixth year, hundred thirty-third year, hundred twenty-fifth year, hundred thirty-fifth year",
  "s1435": "129 Hundred eighteenth year, hundred forty-eighth year, hundred forty-fourth year, hundred thirty-seven year, hundred thirty-fourth year, hundred twenty-sixth year, hundred thirty-sixth year",
  "s1436": "128 Hundred nineteenth year, hundred forty-ninth year, hundred forty-fifth year, hundred thirty-eighth year, hundred thirty-fifth year, hundred twenty-seventh year, hundred thirty-seventh year",
  "s1437": "127 Hundred twentieth year, hundred fiftieth year, hundred forty-sixth year, hundred thirty-ninth year, hundred thirty-sixth year, hundred twenty-eighth year, hundred thirty-eighth year",
  "s1438": "126 Hundred twenty-first year, hundred fifty-first year, hundred forty-seventh year, hundred fortieth year, hundred thirty-seventh year, hundred twenty-ninth year, hundred thirty-ninth year",
  "s1439": "125 Hundred twenty-second year, hundred fifty-second year, hundred forty-eighth year, hundred forty-first year, hundred thirty-eighth year, hundred thirtieth year, hundred fortieth year",
  "s1440": "124 Hundred twenty-third year, hundred fifty-third year, hundred forty-ninth year, hundred forty-second year, hundred thirty-ninth year, hundred thirty-first year, hundred forty-first year",
  "s1441": "123 Hundred twenty-fourth year, hundred fifty-fourth year, hundred fiftieth year, hundred forty-third year, hundred fortieth year, hundred thirty-second year, hundred forty-second year",
  "s1442": "122 Hundred twenty-fifth year, nineteenth year.",
  "s1443": "Wang Jian captured Zhao, captured Wang Qian at Han Dan."
}
