{
  "s0021": "Xin fear execute, because with Xiong Nu about together attack Han, rebel, with Ma Yi descend Hu, strike Tai Yuan.",
  "s0022": "Seven years winter, shang self go strike, break Xin army Tong Di, cut his jiang Wang Xi.",
  "s0023": "Xin flee walk Xiong Nu.",
  "s0024": "Its with Bai Tu person Man Qiu Chen, Wang Huang wait establish Zhao Miao yi Zhao Li become wang, again collect Xin defeat scatter troops, yet with Xin and Mao Dun plan attack Han.",
  "s0025": "Xiong Nu depend left right Xian Wang lead ten thousand remain ride with Wang Huang wait garrison Guang Wu with south, reach Jin Yang, with Han troops battle, Han big break it, pursue reach Li Shi, again break it.",
  "s0026": "Xiong Nu again gather troops Lou Fan north west, Han make che ride strike break Xiong Nu.",
  "s0027": "Xiong Nu constant defeat walk, Han ride victory pursue north, hear Mao Dun dwell Dai Gu, Gao Huang Di dwell Jin Yang, make person see Mao Dun, return report said 'able strike'.",
  "s0028": "Shang then reach Ping Cheng.",
  "s0029": "Shang out Bai Deng, Xiong Nu ride surround shang, shang then make person thick yi Yan Zhi.",
  "s0030": "Yan Zhi then say Mao Dun said: 'Now obtain Han land, still not able dwell;",
  "s0031": "And two jun not each gou' dwell seven days, Hu ride gradually lead go.",
  "s0032": "Time heaven big fog, Han make person go come, Hu not aware.",
  "s0033": "Hu jun zhong wei Chen Ping speak shang said: 'Hu wait whole troops, please make strong nu fu two arrow outside toward, slow walk out surround.'",
  "s0034": "Enter Ping Cheng, Han save troops also arrive, Hu ride then dissolve go.",
  "s0035": "Han also stop troops return.",
  "s0036": "Han Xin become Xiong Nu jiang troops go come strike border.",
  "s0037": "Han ten years, Xin make Wang Huang wait say mislead Chen Xi.",
  "s0038": "Eleven years spring, former Han Wang Xin again with Hu ride enter dwell Can He, resist Han.",
  "s0039": "Han make Chai jiang jun strike it, send Xin book said: 'Bi Xia kuan ren, various hou though have pan perish, yet again return, then again old position number, not execute.'",
  "s0040": "Da Wang place know."
}
