{
  "s0052": "Zhuangxiang Wang first year, appointed Lü Buwei as chancellor, enfeoffed as Wenxin Marquis, ate Luoyang ten thousand households.",
  "s0053": "Zhuangxiang Wang ascended third year, died, crown prince Zheng established as king, honored Lü Buwei as prime minister, titled 'Zhong Fu'.",
  "s0054": "Qin king young, Empress Dowager often secretly communicated Lü Buwei.",
  "s0055": "Buwei household retainers ten thousand persons.",
  "s0056": "At this time, Wei had Xinyang Jun, Chu had Chunshen Jun, Zhao had Pingyuan Jun, Qi had Mengchang Jun, all recruited scholars delighted guests to mutually contend.",
  "s0057": "Lü Buwei with Qin's strength, ashamed not equal, also recruited scholars, thick treated them, to guests three thousand persons.",
  "s0058": "At this time feudal lords many debaters, like Xun Qing and others, wrote books spread world.",
  "s0059": "Lü Buwei thus made his guests each write what heard, collected theories as eight views, six discussions, twelve records, twenty plus ten thousand words.",
  "s0060": "Considered complete heaven earth myriad things ancient modern affairs, titled 'Lü Shi Chun Qiu'.",
  "s0061": "Spread Xianyang market gate, hung thousand jin above, invited feudal lords wandering scholars guests able increase decrease one word give thousand jin.",
  "s0062": "First Emperor increasingly mature, Empress Dowager licentious not stop.",
  "s0063": "Lü Buwei feared calamity reach self, thus secretly sought great endowment man Lao Ai as retainer, timely released singers music, made Ai with his endowment pass paulownia wheel to travel, commanded Empress Dowager hear, to tempt Empress Dowager.",
  "s0064": "Empress Dowager heard, truly wished privately obtain him.",
  "s0065": "Lü Buwei thus advanced Lao Ai, falsely had person with rotten crime accuse him.",
  "s0066": "Buwei again secretly told Empress Dowager: 'Can make falsely rotten crime, then obtain serve inner palace.'",
  "s0067": "Empress Dowager thus secretly thick rewarded main rotten officials, falsely judged him, pulled his beard eyebrows as eunuch, thus obtained serve Empress Dowager.",
  "s0068": "Empress Dowager privately communicated, extremely favored him.",
  "s0069": "Had pregnancy, Empress Dowager feared people know, falsely divined should avoid time, moved palace dwell Yong.",
  "s0070": "Lao Ai constantly followed, rewards very thick, affairs all decided by Lao Ai.",
  "s0071": "Lao Ai household retainers several thousand, various guests sought office as Lao Ai retainers thousand plus persons.",
  "s0072": "First Emperor seventh year, Zhuangxiang Wang mother Xia Empress Dowager died.",
  "s0073": "Xiaowen Wang queen called Huayang Empress Dowager, with Xiaowen Wang met buried Shou Mausoleum.",
  "s0074": "Xia Empress Dowager son Zhuangxiang Wang buried Zhi Yang, thus Xia Empress Dowager alone separately buried Du east, said 'East look my son, west look my husband.",
  "s0075": "After hundred years, beside should have ten thousand household city.'",
  "s0076": "First Emperor ninth year, had accusation Lao Ai truly not eunuch, constantly with Empress Dowager privately chaotic, bore sons two persons, all hid them.",
  "s0077": "With Empress Dowager planned said 'King if dies, with son as successor'.",
  "s0078": "Thus Qin king sent officials investigate, fully obtained real situation, affair connected prime minister Lü Buwei.",
  "s0079": "Ninth month, exterminated Lao Ai three clans, killed Empress Dowager born two sons, then moved Empress Dowager to Yong.",
  "s0080": "Various Lao Ai retainers all confiscated households moved to Shu.",
  "s0081": "King wished execute prime minister, for his serve previous king merit great, and guests debaters for wandering persuasion many, king not bear apply law.",
  "s0082": "Qin king tenth year tenth month, dismissed prime minister Lü Buwei.",
  "s0083": "When Qi person Mao Jiao persuaded Qin king, Qin king then welcomed Empress Dowager at Yong, returned restored Xianyang, yet sent Wenxin Marquis go to fief Henan.",
  "s0084": "Year plus, various feudal lord guests envoys mutually looked on road, requested Wenxin Marquis.",
  "s0085": "Qin king feared his change, thus granted Wenxin Marquis letter said: 'Lord what merit to Qin?",
  "s0086": "Qin enfeoffed lord Henan, ate ten thousand households.",
  "s0087": "Lord what close to Qin?",
  "s0088": "Titled Zhong Fu.",
  "s0089": "Him with family move dwell Shu!'",
  "s0090": "Lü Buwei self-measured gradually encroached, feared execution, thus drank poison died.",
  "s0091": "Qin king added anger Lü Buwei, Lao Ai all already dead, thus all restored Lao Ai retainers moved Shu ones.",
  "s0092": "First Emperor nineteenth year, Empress Dowager died, posthumous title Di Empress Dowager, with Zhuangxiang Wang met buried Zhi Yang.",
  "s0093": "Grand Historian says: Buwei and Lao Ai noble, enfeoffed titled Wenxin Marquis.",
  "s0094": "Person accused Lao Ai, Ai heard.",
  "s0095": "Qin king examined attendants, not issued.",
  "s0096": "Went to Yong suburbs, Ai feared calamity rise, thus with party planned, forged Empress Dowager seal sent troops to rebel Qinian Palace.",
  "s0097": "Sent officials attacked Ai, Ai defeated fled, pursued beheaded Haozhi, thus extinguished his clan.",
  "s0098": "Lü Buwei from this demoted.",
  "s0099": "Confucius's so-called 'heard' ones, perhaps Lü Zi?"
}
