{
  "s0151": "Zhou also again bow kowtow, then exit.",
  "s0152": "Seal Shang Zhou son Lu Fu Yin remain people.",
  "s0153": "Wu Wang for Yin initial pacify not gather, then make his younger brother Guan Shu Xian, Cai Shu Du assist Lu Fu govern Yin.",
  "s0154": "Already then command Zhao Gong release Ji Zi prisoner.",
  "s0155": "Command Bi Gong release hundred surnames prisoner, mark Shang Rong lane.",
  "s0156": "Command Nan Gong Kuo scatter Lu Tai wealth, issue Ju Qiao grain, to relieve poor weak sprout servant.",
  "s0157": "Command Nan Gong Kuo, Shi Yi display nine tripods preserve jade.",
  "s0158": "Command Hong Yao seal Bi Gan tomb.",
  "s0159": "Command Zong Zhu enjoy sacrifice at army.",
  "s0160": "Then stop troops west return.",
  "s0161": "Go hunt, record government affairs, make Wu Cheng.",
  "s0162": "Seal feudal lords, distribute grant ancestral vessels, make divide Yin utensils.",
  "s0163": "Wu Wang pursue think previous sage wang, then praise seal Shen Nong after at Jiao, Yellow Emperor after at Zhu, Emperor Yao after at Ji, Emperor Shun after at Chen, Da Yu after at Qi.",
  "s0164": "Then seal merit ministers plot scholars, yet Shi Shang Fu as first seal.",
  "s0165": "Seal Shang Fu at Ying Qiu, said Qi.",
  "s0166": "Seal younger brother Zhou Gong Dan at Qu Fu, said Lu.",
  "s0167": "Seal Zhao Gong Shi at Yan.",
  "s0168": "Seal younger brother Shu Xian at Guan, younger brother Shu Du at Cai.",
  "s0169": "Remain each by order receive seal.",
  "s0170": "Wu Wang summon nine Mu lords, ascend Bin mound, to view Shang Yi.",
  "s0171": "Wu Wang reach Zhou, self night not sleep.",
  "s0172": "Zhou Gong Dan reach wang place, said: 'Why not sleep?'",
  "s0173": "Wang said: 'Tell you: Only heaven not enjoy Yin, from Fa not born to now sixty years, Mi Lu at Mu, Fei Hong full wild.",
  "s0174": "Heaven not enjoy Yin, now have achievement.",
  "s0175": "Only heaven establish Yin, its ascend name people three hundred sixty husband, not bright also not guest extinguish, to now.",
  "s0176": "I not fixed heaven protect, what leisure sleep!'",
  "s0177": "Wang said: 'Fixed heaven protect, rely heaven chamber, all seek husband evil, demote from Yin wang receive.",
  "s0178": "Day night labor come fixed my west earth, I only bright serve, reach virtue square bright.",
  "s0179": "From Luo Rui extend to Yi Rui, dwell easy no solid, its have Xia dwell.",
  "s0180": "I south view three Tu, north view Yue Bi, look back Zhan have He, Yue Zhan Luo, Yi, no far heaven chamber.'",
  "s0181": "Camp Zhou dwell at Luo Yi then leave.",
  "s0182": "Let loose horse at Hua mountain yang, release cow at Tao Lin Xu;",
  "s0183": "Lay down shield spear, shake soldiers release troops: show world not again use.",
  "s0184": "Wu Wang already conquer Yin, after two years, ask Ji Zi Yin so perish.",
  "s0185": "Ji Zi not endure speak Yin evil, with exist perish state suitable inform.",
  "s0186": "Wu Wang also ashamed, thus ask with heaven way.",
  "s0187": "Wu Wang ill.",
  "s0188": "World not gather, group Gong fear, Mu divine, Zhou Gong then Fu Zhai, self as pledge, wish replace Wu Wang, Wu Wang have recover.",
  "s0189": "After die, crown prince Yong replace establish, this was Cheng Wang.",
  "s0190": "Cheng Wang young, Zhou initial pacify world, Zhou Gong fear feudal lords rebel Zhou, Gong then take administer govern country.",
  "s0191": "Guan Shu, Cai Shu group younger brother doubt Zhou Gong, with Wu Geng make chaos, rebel Zhou.",
  "s0192": "Zhou Gong follow Cheng Wang command, attack execute Wu Geng, Guan Shu, banish Cai Shu.",
  "s0193": "With Wei Zi Kai replace Yin after, state at Song.",
  "s0194": "Rather collect Yin remain people, to seal Wu Wang young brother Feng as Wei Kang Shu.",
  "s0195": "Jin Tang Shu get excellent grain, offer Cheng Wang, Cheng Wang to return Zhou Gong at troops place.",
  "s0196": "Zhou Gong receive grain east earth, Lu heavenly son command.",
  "s0197": "Initial, Guan, Cai rebel Zhou, Zhou Gong attack, three years then complete pacify, thus initial make Da Gao, next make Wei Zi command, next return grain, next Jia grain, next Kang Gao, Jiu Gao, Zi Cai, its affairs at Zhou Gong chapter.",
  "s0198": "Zhou Gong administer politics seven years, Cheng Wang grow, Zhou Gong return politics Cheng Wang, north face assume group ministers position.",
  "s0199": "Cheng Wang at Feng, make Zhao Gong again camp Luo Yi, like Wu Wang intention.",
  "s0200": "Zhou Gong again divine Shen view, finally camp build, dwell nine tripods there."
}

