{
  "s0251": "Two old said: 'Minister not dare hinder jun army.",
  "s0252": "Army walk, minister son with go;",
  "s0253": "Minister old, late return fear not mutual see, therefore cry.'",
  "s0254": "Two old retreat, tell its son said: 'You army then defeat, must at Xiao Ai.'",
  "s0255": "Thirty three years spring, Qin troops then east, change Jin earth, pass Zhou north gate.",
  "s0256": "Zhou wang sun Man said: 'Qin troops without ritual, not defeat what wait!'",
  "s0257": "Troops reach Hua, Zheng merchant merchant Xian Gao, hold twelve cow will sell Zhou, see Qin troops, fear die capture, because offer its cow, said: 'Hear big state will punish Zheng, Zheng jun careful repair defend prepare, make minister with cow twelve labor army soldiers.'",
  "s0258": "Qin three generals mutual tell said: 'Will raid Zheng, Zheng now already aware it, go no reach.'",
  "s0259": "Extinguish Hua.",
  "s0260": "Hua, Jin border yi.",
  "s0261": "When is time, Jin Wen Gong death not yet bury.",
  "s0262": "Crown prince Xiang Gong angry said: 'Qin insult I orphan, because death break I Hua.'",
  "s0263": "Then ink decline silk, send troops block Qin troops at Xiao, strike it, big break Qin army, no one able escape.",
  "s0264": "Capture Qin three generals return.",
  "s0265": "Wen Gong wife, Qin woman, for Qin three prisoner generals request said: 'Miao Gong grudge this three people enter bone marrow, wish make this three people return, make my jun get self fast cook it.'",
  "s0266": "Jin jun allow it, return Qin three generals.",
  "s0267": "Three generals arrive, Miao Gong plain clothes suburb welcome, face three people cry said: 'Gu with not use Bai Li Xi, Jian Shu speech to disgrace three sons, three sons what crime?",
  "s0268": "Son its all heart snow shame, not neglect.'",
  "s0269": "Then recover three people official rank like old, more increase thick it.",
  "s0270": "Thirty four years, Chu crown prince Shang Chen kill its father Cheng Wang replace establish.",
  "s0271": "Miao Gong then again make Meng Ming view etc will troops attack Jin, battle at Peng Yu.",
  "s0272": "Qin not profit, lead troops return.",
  "s0273": "Rong wang make You Yu at Qin.",
  "s0274": "You Yu, its previous Jin people, flee enter Rong, able Jin speech.",
  "s0275": "Hear Miao Gong worthy, therefore make You Yu view Qin.",
  "s0276": "Qin Miao Gong show with palace room, accumulate collect.",
  "s0277": "You Yu said: 'Make ghost do it, then labor spirit.",
  "s0278": "Make person do it, also bitter people.'",
  "s0279": "Miao Gong strange it, ask said: 'China with poem book ritual music law measure become government, yet still time chaos, now Rong Yi without this, what with become govern, not also difficult?'",
  "s0280": "You Yu laugh said: 'This then China so chaos.",
  "s0281": "Man from upper saint Yellow Emperor make ritual music law measure, body with first it, only with small govern.",
  "s0282": "Reach its after world, day with arrogant lewd.",
  "s0283": "Block law measure awe, with blame supervise at down, down tired extreme then with benevolence righteousness resent hope at upper, up down mutual contend resent yet mutual usurp kill, reach extinguish clan, all with this class.",
  "s0284": "Man Rong Yi not so.",
  "s0285": "Upper contain pure virtue to meet its down, down cherish loyal trust to serve its upper, one state politics like one body govern, not know so govern, this true saint person govern.'",
  "s0286": "Then Miao Gong retreat ask inner shi Liao said: 'Gu hear neighbor state have saint person, enemy state worry.",
  "s0287": "Now You Yu worthy, sha ren harm, will how?'",
  "s0288": "Inner shi Liao said: 'Rong wang place secluded hide, not hear China sound.",
  "s0289": "Jun try send its woman music, to seize its will;",
  "s0290": "For You Yu request, to sparse its interval;",
  "s0291": "Stay yet not send, to lose its period.",
  "s0292": "Rong wang strange it, must doubt You Yu.",
  "s0293": "Jun minister have interval, then able capture.",
  "s0294": "And Rong wang good music, must neglect at government.'",
  "s0295": "Miao Gong said: 'Good.'",
  "s0296": "Because with You Yu curve mat sit, transmit vessel eat, ask its earth shape with its troops potential complete examine, yet after make inner shi Liao with woman music two eight send Rong wang.",
  "s0297": "Rong wang receive yet pleased it, end year not return.",
  "s0298": "Then Qin then return You Yu.",
  "s0299": "You Yu number remonstrate not listen, Miao Gong again number make person interval want You Yu, You Yu then go descend Qin.",
  "s0300": "Miao Gong with guest ritual ritual it, ask attack Rong shape."
}

