{
  "s0001": "Confucius said: 'Those who received teachings and were personally proficient numbered seventy-seven people,' all men of exceptional abilities.",
  "s0002": "Moral conduct: Yan Yuan, Min Ziqian, Ran Boniu, Zhong Gong.",
  "s0003": "Governance: Ran You, Ji Lu.",
  "s0004": "Eloquence: Zai Wo, Zi Gong.",
  "s0005": "Scholarship: Zi You, Zi Xia.",
  "s0006": "Shi is dissolute, Shen is dull, Chai is foolish, You is crude, Hui is often empty.",
  "s0007": "Ci did not accept office but engaged in commerce, his speculations often hit the mark.",
  "s0008": "Those whom Confucius treated with respect: in Zhou, Lao Zi;",
  "s0009": "in Wei, Qu Bo Yu;",
  "s0010": "in Qi, Yan Ping Zhong;",
  "s0011": "in Chu, Lao Lai Zi;",
  "s0012": "in Zheng, Zi Chan;",
  "s0013": "in Lu, Meng Gong Chuo.",
  "s0014": "He frequently praised Zang Wen Zhong, Liu Xia Hui, Tong Di Bo Hua, Jie Shan Zi Ran, Confucius all came after them, not contemporaries.",
  "s0015": "Yan Hui was a Lu man, styled Zi Yuan.",
  "s0016": "Younger than Confucius by thirty years.",
  "s0017": "Yan Yuan asked about benevolence, Confucius said: 'Conquer self and return to ritual, all under Heaven will return to benevolence.'",
  "s0019": "Confucius said: 'Worthy indeed is Hui!",
  "s0020": "One basket of food, one gourd of drink, in a humble lane, others cannot bear his worries, Hui does not change his joy.'",
  "s0021": "'Hui appears foolish;",
  "s0022": "when he withdraws and examines his private thoughts, it is sufficient to inspire, Hui is not foolish.'",
  "s0023": "'When employed then act, when discarded then hide, only I and you have this!'",
  "s0025": "Hui at age twenty-nine, hair all white, died young.",
  "s0026": "Confucius wept for him in great sorrow, said: 'Since I had Hui, my disciples have become more intimate.'",
  "s0028": "Duke Ai of Lu asked: 'Which disciple is diligent in study?'",
  "s0029": "Confucius replied: 'There is Yan Hui who is diligent in study, does not transfer anger, does not repeat errors.",
  "s0030": "Unfortunately died young, now there is none.'",
  "s0032": "Min Sun styled Zi Qian.",
  "s0033": "Younger than Confucius by fifteen years.",
  "s0034": "Confucius said: 'Filial indeed is Min Zi Qian!",
  "s0035": "People do not find fault in the words of his parents and brothers.'",
  "s0036": "Did not serve grand masters, did not eat the salary of corrupt rulers.",
  "s0037": "'If there are those who call me back, it must be above the Wen.'",
  "s0039": "Ran Geng styled Bo Niu.",
  "s0040": "Confucius considered him to have moral conduct.",
  "s0041": "Bo Niu had a serious illness, Confucius went to visit him, from the window grasped his hand, said: 'Fate it is!",
  "s0042": "This person has this illness, fate it is!'",
  "s0044": "Ran Yong styled Zhong Gong.",
  "s0045": "Zhong Gong asked about governance, Confucius said: 'When going out treat as meeting great guests, when employing people treat as conducting great sacrifice.",
  "s0046": "In the state no resentment, in the home no resentment.'",
  "s0048": "Confucius considered Zhong Gong to have moral conduct, said: 'Yong can be made to face south.'",
  "s0050": "Zhong Gong's father was a commoner.",
  "s0051": "Confucius said: \"The son of a plow ox is reddish and has horns, though one wishes not to use it, will the mountains and rivers abandon it?\"",
  "s0053": "Ran Qiu styled Ziyou, younger than Confucius by twenty-nine years.",
  "s0054": "Served as steward for the Ji clan.",
  "s0055": "Ji Kang Zi asked Confucius: \"Is Ran Qiu benevolent?\"",
  "s0056": "Said: \"For a town of a thousand households, a family with a hundred chariots, Qiu can be made to manage their taxes.",
  "s0057": "As for benevolence, I do not know.\"",
  "s0058": "Asked again: \"Is Zi Lu benevolent?\"",
  "s0059": "Confucius replied: \"Like Qiu.\"",
  "s0061": "Qiu asked: \"Having heard, act on it?\"",
  "s0062": "The Master said: \"Act.\"",
  "s0063": "Zi Lu asked: \"Having heard, act on it?\"",
  "s0064": "The Master said: \"With father and elder brothers present, how can one having heard act on it!\"",
  "s0065": "Zi Hua was puzzled, \"Dare ask why questions same but answers different?\"",
  "s0066": "Confucius said: \"Qiu retreats, therefore advance him.",
  "s0067": "You is overbearing, therefore restrain him.\"",
  "s0069": "Zhong You styled Zi Lu, a Bian man.",
  "s0070": "Younger than Confucius by nine years.",
  "s0071": "Zi Lu nature was coarse, fond of bravery and strength, his will upright and unyielding, wore a cap with fighting cock, carried a piglet sword, bullied Confucius.",
  "s0072": "Confucius established ritual to gradually guide Zi Lu, Zi Lu later wore Confucian robes and presented introductory gifts, became a disciple.",
  "s0073": "Zi Lu asked about governance, Confucius said: \"Lead them, labor them.\"",
  "s0074": "Requested more.",
  "s0075": "Said: \"Do not tire.\"",
  "s0077": "Zi Lu asked: \"Does the gentleman value bravery?\"",
  "s0078": "Confucius said: \"Righteousness is paramount.",
  "s0079": "If a gentleman loves bravery but lacks righteousness then chaos, if a petty man loves bravery but lacks righteousness then theft.\"",
  "s0081": "Zi Lu upon hearing, feared not being able to practice, only feared not hearing.",
  "s0082": "Confucius said: \"One who can judge cases with a single phrase, it is You!\"",
  "s0083": "\"You loves bravery exceeding me, nothing to take as material.\"",
  "s0084": "\"If You, will not obtain proper death.\"",
  "s0085": "\"One who wears ragged silk robe, stands with those wearing fox and badger furs without shame, it is You!\"",
  "s0086": "\"You has ascended the hall, has not yet entered the inner chamber.\"",
  "s0088": "Ji Kang Zi asked: \"Is Zhong You benevolent?\"",
  "s0089": "Confucius said: \"For a state of thousand chariots he can be made to manage taxes, do not know his benevolence.\"",
  "s0091": "Zi Lu delighted in following on excursions, encountered Chang Ju, Jie Ni, He Tao Elder.",
  "s0092": "Zi Lu served as steward for Ji clan, Ji Sun asked: \"Can Zi Lu be called a great minister?\"",
  "s0093": "Confucius said: \"Can be called a complete minister.\"",
  "s0095": "Zi Lu served as magistrate of Pu, took leave from Confucius.",
  "s0096": "Confucius said: \"Pu has many strong men, moreover difficult to govern.",
  "s0097": "However I tell you: With respect and reverence can control bravery;",
  "s0098": "With generosity and uprightness can unite the multitude;",
  "s0099": "With respect and uprightness and calm can serve superiors.\"",
  "s0101": "Initially, Duke Ling of Wei had a favored concubine named Nan Zi.",
  "s0102": "Duke Ling crown prince Kui Tun offended Nan Zi, feared execution fled.",
  "s0103": "When Duke Ling died the consort wished to establish Prince Ying.",
  "s0104": "Ying refused, said: \"The fugitive crown prince son Zhe is here.\"",
  "s0105": "Then Wei established Zhe as ruler, this was Duke Chu.",
  "s0106": "Duke Chu established twelve years, his father Kui Tun dwelt outside, could not enter.",
  "s0107": "Zi Lu served as magistrate of Kong Kui yi for Wei.",
  "s0108": "Kui Tun then with Kong Kui made rebellion, planned to enter Kong Kui home, then with his followers attacked Duke Chu.",
  "s0109": "Duke Chu fled to Lu, Kui Tun entered established, this was Duke Zhuang.",
  "s0110": "When Kong Kui made rebellion, Zi Lu outside, heard it galloped go.",
  "s0111": "Met Zi Gao leaving Wei city gate, told Zi Lu: \"Duke Chu gone, gate already closed, you can return, do not vainly receive calamity.\"",
  "s0112": "Zi Lu said: \"One who eats his food does not avoid his difficulties.\"",
  "s0113": "Zi Gao finally left.",
  "s0114": "Had envoy enter city, city gate opened, Zi Lu followed entered.",
  "s0115": "Approached Kui Tun, Kui Tun with Kong Kui ascended tower.",
  "s0116": "Zi Lu said: \"Ruler why use Kong Kui?",
  "s0117": "Please obtain and kill him.\"",
  "s0118": "Kui Tun not listened.",
  "s0119": "Then Zi Lu wished to burn tower, Kui Tun feared, then sent Shi Qi, Hu Xian attack Zi Lu, struck broke Zi Lu hat string.",
  "s0120": "Zi Lu said: \"Gentleman dies cap not removed.\"",
  "s0121": "Then tied hat string died.",
  "s0122": "Confucius heard Wei chaos, said: \"Alas, You died!\"",
  "s0123": "Afterward indeed died.",
  "s0124": "Therefore Confucius said: \"Since I obtained You, evil words not heard at ears.\"",
  "s0125": "At this time Zi Gong as Lu envoy to Qi.",
  "s0126": "Zai Yu styled Zi Wo.",
  "s0127": "Sharp tongue eloquent speech.",
  "s0128": "Having received teachings, asked: \"Three years mourning not too long?",
  "s0129": "Gentleman three years not practice ritual, ritual must decay;",
  "s0130": "Three years not practice music, music must collapse.",
  "s0131": "Old grain already exhausted, new grain already ascended, flint fire changed, period can stop.\"",
  "s0132": "Master said: \"Are you at peace?\"",
  "s0133": "Said: \"At peace.\"",
  "s0134": "\"You at peace then do it.",
  "s0135": "Gentleman in mourning, delicious food not sweet, hearing music not joyful, therefore not do.\"",
  "s0136": "Zai Wo left, Master said: \"Yu not benevolent!",
  "s0137": "Child born three years then free from parents embrace.",
  "s0138": "Three years mourning, world universal righteousness.\"",
  "s0140": "Zai Wo daytime slept.",
  "s0141": "Master said: \"Rotten wood cannot carve, manure wall cannot plaster.\"",
  "s0143": "Zai Wo asked Five Emperors virtue, Master said: \"I not that person.\"",
  "s0145": "Zai Wo became Lin Zi grand master, with Tian Chang made rebellion, exterminated his clan, Confucius ashamed.",
  "s0146": "Duanmu Ci, Wei man, styled Zi Gong.",
  "s0147": "Younger than Confucius by thirty-one years.",
  "s0148": "Zi Gong sharp tongue clever speech, Confucius often suppressed his eloquence.",
  "s0149": "Asked: \"You and Hui which better?\"",
  "s0150": "Replied: \"Ci how dare hope Hui!",
  "s0151": "Hui hears one knows ten, Ci hears one knows two.\"",
  "s0153": "Zi Gong having received teachings, asked: \"Ci what person?\"",
  "s0154": "Confucius said: \"You vessel.\"",
  "s0155": "Said: \"What vessel?\"",
  "s0156": "Said: \"Hu lian.\"",
  "s0158": "Chen Zi Qin asked Zi Gong: \"Zhong Ni where learn?\"",
  "s0159": "Zi Gong said: \"Wen Wu way not fallen to earth, in people, worthy identify large, unworthy identify small, none not have Wen Wu way.",
  "s0160": "Master where not learn, moreover what constant teacher have!\"",
  "s0161": "Again asked: \"Confucius go this state must hear its governance.",
  "s0162": "Seek it?",
  "s0163": "Or given it?\"",
  "s0164": "Zi Gong said: \"Master warm, good, respectful, frugal, yielding with get it.",
  "s0165": "Master seek it, perhaps different from people seek it.\"",
  "s0167": "Zi Gong asked: \"Rich without arrogance, poor without flattery, how?\"",
  "s0168": "Confucius said: \"Can;",
  "s0169": "Not as poor yet joyful in Way, rich yet fond of ritual.\"",
  "s0171": "Tian Chang wished make rebellion in Qi, feared Gao, Guo, Bao, Yan, therefore moved his troops wished attack Lu.",
  "s0172": "Confucius heard it, told gate disciples: \"Lu, tombs place, parents country, country danger thus, you several why not go out?\"",
  "s0173": "Zi Lu requested go out, Confucius stopped him.",
  "s0174": "Zi Zhang, Zi Shi requested go, Confucius not permitted.",
  "s0175": "Zi Gong requested go, Confucius permitted him.",
  "s0176": "Then went, arrived Qi, advised Tian Chang: \"Jun attack Lu wrong.",
  "s0177": "Lu, difficult attack country, its city thin with low, its land narrow with leaking, its jun foolish not benevolent, ministers false without use, its scholars people moreover hate armor weapons matters, this cannot battle with.",
  "s0178": "Jun better attack Wu.",
  "s0179": "Wu, city high with thick, land broad with deep, armor firm with new, soldiers selected with full, heavy equipment elite troops all in midst, moreover make bright grand master guard it, this easy attack.\"",
  "s0180": "Tian Chang angrily changed color: \"You what difficult, people what easy;",
  "s0181": "You what easy, people what difficult: with teach Chang, why?\"",
  "s0182": "Zi Gong said: \"Subject heard, worry internal attack strong, worry external attack weak.",
  "s0183": "Now jun worry internal.",
  "s0184": "I heard jun three enfeoff three not succeed, ministers have not listen.",
  "s0185": "Now jun break Lu to broaden Qi, battle victory to make jun arrogant, break country to honor ministers, jun merit not share, then relation daily distant from jun.",
  "s0186": "This jun above arrogant jun heart, below indulge ministers, seek accomplish great matters, difficult.",
  "s0187": "Jun arrogant then indulgent, ministers arrogant then contend, this jun above with jun have retreat, below with ministers contend.",
  "s0188": "Thus, jun stand in Qi dangerous.",
  "s0189": "Therefore say better attack Wu.",
  "s0190": "Attack Wu not victorious, people external die, ministers internal empty, this jun above without strong minister enemy, below without people fault, isolated jun control Qi only jun.\"",
  "s0191": "Tian Chang said: \"Good.",
  "s0192": "Although, my troops already added to Lu, depart go Wu, ministers suspect me, what to do?\"",
  "s0193": "Zi Gong said: \"Jun hold troops not attack, subject please go make Wu wang, order him save Lu attack Qi, jun then with troops welcome him.\"",
  "s0194": "Tian Chang permitted, made Zi Gong south see Wu wang.",
  "s0195": "Advised: \"Subject heard, wang not cut off generations, ba no strong enemy, thousand jun weight add zhu liang then move.",
  "s0196": "Now with ten thousand chariots Qi privately thousand chariots Lu, with Wu contend strong, secretly for wang dangerous.",
  "s0197": "Moreover save Lu, manifest name;",
  "s0198": "Attack Qi, great profit.",
  "s0199": "With pacify Si Shang feudal lords, execute violent Qi to submit strong Jin, profit none greater.",
  "s0200": "Name preserve perish Lu, reality exhaust strong Qi.",
  "s0201": "Wise not doubt.\"",
  "s0202": "Wu wang said: \"Good.",
  "s0203": "Although, I once with Yue battle, made them dwell Kui Ji.",
  "s0204": "Yue wang toil body nourish troops, has avenge me heart.",
  "s0205": "You wait me attack Yue then listen you.\"",
  "s0206": "Zi Gong said: \"Yue strength not exceed Lu, Wu strong not exceed Qi, wang place Qi attack Yue, then Qi already pacify Lu.",
  "s0207": "Moreover wang just with preserve perish continue cut off as name, attack small Yue fear strong Qi, not brave.",
  "s0208": "Brave not avoid difficulty, benevolent not poor frugal, wise not lose time, wang not cut off generations, to establish their righteousness.",
  "s0209": "Now preserve Yue show feudal lords benevolence, save Lu attack Qi, awe add Jin state, feudal lords must lead each other court Wu, ba achievement complete.",
  "s0210": "Moreover wang must hate Yue, subject please east see Yue wang, make send troops follow, this truly empty Yue, name follow feudal lords attack.\"",
  "s0211": "Wu wang greatly pleased, made Zi Gong go Yue.",
  "s0212": "Yue wang cleared road suburban welcomed, personally drove to lodge asked: \"This barbarian yi country, grand master why solemnly condescend visit?\"",
  "s0213": "Zi Gong said: \"Now I advised Wu wang save Lu attack Qi, his will desire it but fear Yue, said wait me attack Yue then can.",
  "s0214": "Thus, break Yue certain.",
  "s0215": "Moreover without avenge people will make people suspect it, clumsy;",
  "s0216": "Have avenge people will make people know it, dangerous;",
  "s0217": "Affair not issue first heard, perilous.",
  "s0218": "Three manage affair great calamity.\"",
  "s0219": "Gou Jian knocked head twice bowed: \"Gu once not measure strength, with Wu battle, trapped at Kui Ji, pain entered bone marrow, day night scorched lips dry tongue, only wished with Wu wang connect heels die, gu wish.\"",
  "s0220": "Then asked Zi Gong.",
  "s0221": "Zi Gong said: \"Wu wang fierce violent, ministers cannot bear;",
  "s0222": "State depleted from frequent battles, soldiers cannot endure;",
  "s0223": "People resent superiors, ministers internally change;",
  "s0224": "Zi Xu died remonstrating, Grand Steward Pi governs, follows jun excesses to secure his private interests: this remnant country governance.",
  "s0225": "Now wang sincerely send troops assist him realize his ambitions, heavy treasures to please his heart, humble words to honor his ritual, his attack Qi certain.",
  "s0226": "They battle not victorious, wang blessing.",
  "s0227": "Battle victorious, must with troops approach Jin, subject please north see Jin jun, make jointly attack it, weaken Wu certain.",
  "s0228": "Its sharp troops exhausted at Qi, heavy armor trapped at Jin, wang control their depleted, this extinguish Wu certain.\"",
  "s0229": "Yue wang greatly pleased, promised.",
  "s0230": "Sent Zi Gong gold hundred yi, sword one, good spears two.",
  "s0231": "Zi Gong not accepted, then departed.",
  "s0232": "Reported Wu wang: \"Subject respectfully with great wang words tell Yue wang, Yue wang greatly feared, said: Lonely unfortunate, young lost predecessors, internal not self-measure, offended Wu, army defeated body humiliated, dwelt at Kui Ji, country became empty wilderness, relied great wang grant, obtained maintain sacrificial vessels repair sacrifices, death dare not forget, what plotting dare consider!\"",
  "s0233": "After five days, Yue sent grand master Zhong knocked head spoke to Wu wang: \"East sea servant subject lonely Gou Jian envoy subject Zhong, dare as petty official inquire at your side.",
  "s0234": "Now secretly heard great wang will raise great righteousness, execute strong save weak, exhaust violent Qi pacify Zhou house, please arise all within borders soldiers three thousand, lonely please personally don armor grasp sharp weapons, to first receive arrows stones.",
  "s0235": "Because Yue petty minister Zhong present predecessors hidden treasures, armor twenty suits, Fu Qu Lu axes, Bu Guang swords, to congratulate army officials.\"",
  "s0236": "Wu wang greatly pleased, told Zi Gong: \"Yue wang wishes personally follow me attack Qi, can?\"",
  "s0237": "Zi Gong said: \"Cannot.",
  "s0238": "Empty person country, take all person multitude, moreover follow their jun, not righteous.",
  "s0239": "Jun accept their currency, permit their troops, decline their jun.\"",
  "s0240": "Wu wang agreed, then declined Yue wang.",
  "s0241": "Then Wu wang then mobilized nine commanderies troops attack Qi.",
  "s0242": "Zi Gong because went to Jin, told Jin jun: \"Subject heard, plans not first decided cannot respond to emergencies, troops not first prepared cannot defeat enemy.",
  "s0243": "Now Qi with Wu will battle, they battle not victorious, Yue will chaos them certain;",
  "s0244": "With Qi battle victorious, must with troops approach Jin.\"",
  "s0245": "Jin jun greatly feared: \"Do what?\"",
  "s0246": "Zi Gong said: \"Repair troops rest soldiers await them.\"",
  "s0247": "Jin jun agreed.",
  "s0248": "Zi Gong departed went to Lu.",
  "s0249": "Wu wang indeed with Qi people battled at Ai Ling, greatly defeated Qi troops, obtained seven generals troops not return, indeed with troops approached Jin, with Jin people met at Huang Chi above.",
  "s0250": "Wu Jin contended strong.",
  "s0251": "Jin people attacked them, greatly defeated Wu troops.",
  "s0252": "Yue wang heard it, crossed Jiang attacked Wu, seven li from city camped.",
  "s0253": "Wu wang heard it, left Jin returned, with Yue battled at Five Lakes.",
  "s0254": "Three battles not victorious, city gates not defended, Yue then surrounded wang palace, killed Fu Chai executed his minister.",
  "s0255": "Broke Wu three years, east facing became hegemon.",
  "s0256": "Therefore Zi Gong one departure, preserved Lu, disordered Qi, broke Wu, strengthened Jin hegemonized Yue.",
  "s0257": "Zi Gong one mission, made powers mutually break, ten years midst, five states each had change.",
  "s0258": "Zi Gong liked dismissing raising, with times circulated wealth.",
  "s0259": "Delighted extol people beauty, could not conceal people faults.",
  "s0260": "Often assisted Lu Wei, home accumulated thousand jin, finally ended in Qi.",
  "s0261": "Yan Yan, Wu man, styled Zi You.",
  "s0262": "Younger than Confucius by forty-five years.",
  "s0263": "Zi You having received teachings, became Wu Cheng magistrate.",
  "s0264": "Confucius passed by, heard string song sounds.",
  "s0265": "Confucius smiled: \"Cut chicken why use ox knife?\"",
  "s0266": "Zi You said: \"Formerly Yan heard from Master: Gentleman learns Way then loves people, petty man learns Way then easy employ.\"",
  "s0267": "Confucius said: \"You several, Yan words correct.",
  "s0268": "Previous words joking.\"",
  "s0269": "Confucius considered Zi You practiced in scholarship.",
  "s0270": "Bu Shang styled Zi Xia.",
  "s0271": "Younger than Confucius by forty-four years.",
  "s0272": "Zi Xia asked: \"Graceful smile dimples, beautiful eyes gazing, plain silk as ornament, what means?\"",
  "s0273": "Master said: \"Painting follows plain.\"",
  "s0274": "Said: \"Ritual after?\"",
  "s0275": "Confucius said: \"Shang now can discuss poetry.\"",
  "s0277": "Zi Gong asked: \"Shi and Shang which worthy?\"",
  "s0278": "Master said: \"Shi exceeds, Shang not reaches.\"",
  "s0279": "\"Then Shi better?\"",
  "s0280": "Said: \"Exceed same as not reach.\"",
  "s0282": "Master told Zi Xia: \"You be gentleman ru, not be petty man ru.\"",
  "s0284": "Confucius having passed, Zi Xia dwelt Xi River teaching, became Wei Wen Hou teacher.",
  "s0285": "His son died, cried lost sight.",
  "s0286": "Zhuan Sun Shi, Chen man, styled Zi Zhang.",
  "s0287": "Younger than Confucius by forty-eight years.",
  "s0288": "Zi Zhang asked seek office, Confucius said: \"Much hear leave doubts, careful speak remainder, then few faults;",
  "s0289": "Much see leave peril, careful act remainder, then few regrets.",
  "s0290": "Speak few faults, act few regrets, office in midst.\"",
  "s0292": "Another day followed in Chen Cai midst, distressed, asked conduct.",
  "s0293": "Confucius said: \"Speak loyal faithful, act solid respectful, though barbarian yi countries go;",
  "s0294": "Speak not loyal faithful, act not solid respectful, though state li go?",
  "s0295": "Stand then see it stand before, in carriage then see it lean on yoke, only then go.\"",
  "s0296": "Zi Zhang wrote on sash.",
  "s0297": "Zi Zhang asked: \"Scholar what like can call attained?\"",
  "s0298": "Confucius said: \"What, you called attained?\"",
  "s0299": "Zi Zhang replied: \"In state must famous, in home must famous.\"",
  "s0300": "Confucius said: \"This famous, not attained.",
  "s0301": "Attained, substance straight loves righteousness, examines words observes color, considers yields to people, in state home must attained.",
  "s0302": "Famous, appearance takes benevolence but conduct violates, dwells not doubt, in state home must famous.\"",
  "s0304": "Zeng Shen, Nan Wu Cheng man, styled Zi Yu.",
  "s0305": "Younger than Confucius by forty-six years.",
  "s0306": "Confucius considered able penetrate filial way, therefore taught teachings.",
  "s0307": "Composed Filial Classic.",
  "s0308": "Died in Lu.",
  "s0309": "Dan Tai Mie Ming, Wu Cheng man, styled Zi Yu.",
  "s0310": "Younger than Confucius by thirty-nine years.",
  "s0311": "Appearance very ugly.",
  "s0312": "Wished serve Confucius, Confucius considered talent thin.",
  "s0313": "Having received teachings, withdrew practiced conduct, conduct not by paths, not public affairs not see grand masters.",
  "s0314": "South toured to Jiang, followers three hundred people, established take give depart remain, name extended to feudal lords.",
  "s0315": "Confucius heard, said: \"I with words take people, lost Zai Yu;",
  "s0316": "With appearance take people, lost Zi Yu.\"",
  "s0318": "Mi Bu Qi styled Zi Jian.",
  "s0319": "Younger than Confucius by thirty years.",
  "s0320": "Confucius told Zi Jian, \"Gentleman!",
  "s0321": "Lu no gentleman, where take this?\"",
  "s0323": "Zi Jian became Shan Fu magistrate, reported back to Confucius: \"This state has five people whose talents not equal, teach not equal so govern.\"",
  "s0324": "Confucius said: \"Pity Jian governed small, governed great then almost.\"",
  "s0326": "Yuan Xian styled Zi Si.",
  "s0327": "Zi Si asked shame.",
  "s0328": "Confucius said: \"State has Way, salary.",
  "s0329": "State no Way, salary, shame.\"",
  "s0331": "Zi Si said: \"Conquer, boast, resent, desire not practice, can be benevolence?\"",
  "s0332": "Confucius said: \"Can be difficult, benevolence then I not know.\"",
  "s0334": "Confucius died, Yuan Xian then hid in grass marshes.",
  "s0335": "Zi Gong assisted Wei, connected chariots four horses, pushed thorn gate entered poor lanes, passed thanked Yuan Xian.",
  "s0336": "Xian adjusted ragged clothes cap saw Zi Gong.",
  "s0337": "Zi Gong ashamed, said: \"Master perhaps ill?\"",
  "s0338": "Yuan Xian said: \"I heard, no wealth called poor, learn Way cannot practice called ill.",
  "s0339": "Like Xian, poor, not ill.\"",
  "s0340": "Zi Gong ashamed, displeased departed, lifetime ashamed his words excess.",
  "s0341": "Gong Ye Chang, Qi man, styled Zi Chang.",
  "s0342": "Confucius said: \"Chang can marry, though in fetters, not his crime.\"",
  "s0343": "Gave his daughter married him.",
  "s0344": "Nan Gong Kuo styled Zi Rong.",
  "s0345": "Asked Confucius: \"Yi good shooting, Ao capsized boat, both not obtain proper death;",
  "s0346": "Yu Ji personally farmed obtained world?\"",
  "s0347": "Confucius not answered.",
  "s0348": "Rong left, Confucius said: \"Gentleman such person!",
  "s0349": "Superior virtue such person!\"",
  "s0350": "\"State has Way, not discarded;",
  "s0351": "State no Way, avoid punishment execution.\"",
  "s0352": "Three times repeated \"White jade flaw\", gave his brother son married him.",
  "s0353": "Gong Xi Ai styled Ji Ci.",
  "s0354": "Confucius said: \"World no conduct, many become family ministers, serve in capitals;",
  "s0355": "Only Ji Ci never served.\"",
  "s0357": "Zeng Dian styled Xi.",
  "s0358": "Attended Confucius, Confucius said: \"Speak your ambition.\"",
  "s0359": "Dian said: \"Spring clothes completed, youths five six people, children six seven people, bathe Yi river, dance rain dance, chant return.\"",
  "s0360": "Confucius sighed: \"I with Dian!\"",
  "s0362": "Yan Wu You styled Lu.",
  "s0363": "Lu, Yan Hui father, father son once each different times served Confucius.",
  "s0364": "Yan Hui died, Yan Lu poor, requested Confucius carriage bury.",
  "s0365": "Confucius said: \"Able not able, also each speak their son.",
  "s0366": "Li died, had coffin no outer coffin, I not go on foot make outer coffin, because I follow grand master after, cannot go on foot.\"",
  "s0368": "Shang Qu, Lu man, styled Zi Mu.",
  "s0369": "Younger than Confucius by twenty-nine years.",
  "s0370": "Confucius transmitted Changes to Qu, Qu transmitted Chu man Chan Bi Zi Hong, Hong transmitted Jiang Dong man Jiao Zi Yong Ci, Ci transmitted Yan man Zhou Zi Jia Shu, Shu transmitted Chun Yu man Guang Zi Cheng Yu, Yu transmitted Qi man Tian Zi Zhuang He, He transmitted Dong Wu man Wang Zi Zhong Tong, Tong transmitted Zi Chuan man Yang He.",
  "s0371": "He in Yuan Shuo midst with treating Changes became Han Zhong grand master.",
  "s0372": "Gao Chai styled Zi Gao.",
  "s0373": "Younger than Confucius by thirty years.",
  "s0374": "Zi Gao height not exceed five chi, received teachings Confucius, Confucius considered foolish.",
  "s0375": "Zi Lu made Zi Gao Fei Hou magistrate, Confucius said: \"Will harm such person son!\"",
  "s0376": "Zi Lu said: \"Has people, has altars soil, why must read books then study!\"",
  "s0377": "Confucius said: \"Therefore hate glib speakers.\"",
  "s0379": "Qi Diao Kai styled Zi Kai.",
  "s0380": "Confucius made Kai serve office, replied: \"I this not yet believe.\"",
  "s0381": "Confucius pleased.",
  "s0382": "Gong Bo Liao styled Zi Zhou.",
  "s0383": "Zhou accused Zi Lu to Ji Sun, Zi Fu Jing Bo told Confucius: \"Master indeed has confused will, Liao, my strength still can expose at market court.\"",
  "s0384": "Confucius said: \"Way will advance, fate;",
  "s0385": "Way will decline, fate.",
  "s0386": "Gong Bo Liao how against fate!\"",
  "s0388": "Si Ma Geng styled Zi Niu.",
  "s0389": "Niu much talk hasty.",
  "s0390": "Asked benevolence Confucius, Confucius said: \"Benevolent his words rare.\"",
  "s0391": "Said: \"His words rare, can call benevolence?\"",
  "s0392": "Master said: \"Do difficult, speak obtain not rare!\"",
  "s0394": "Asked gentleman, Master said: \"Gentleman not worry not fear.\"",
  "s0395": "Said: \"Not worry not fear, can call gentleman?\"",
  "s0396": "Master said: \"Internal examine not guilty, what worry what fear!\"",
  "s0398": "Fan Xu styled Zi Chi.",
  "s0399": "Younger than Confucius by thirty-six years.",
  "s0400": "Fan Chi requested learn farming, Confucius said: \"I not as old farmer.\"",
  "s0401": "Requested learn gardening, said: \"I not as old gardener.\"",
  "s0402": "Fan Chi left, Confucius said: \"Petty man Fan Xu!",
  "s0403": "Superior good ritual, people dare not not respect;",
  "s0404": "Superior good righteousness, people dare not not submit;",
  "s0405": "Superior good faithfulness, people dare not not use sincerity.",
  "s0406": "Like this, four directions people carry children come, where use farming!\"",
  "s0408": "Fan Chi asked benevolence, Master said: \"Love people.\"",
  "s0409": "Asked wisdom, said: \"Know people.\"",
  "s0411": "You Ruo younger than Confucius by forty-three years.",
  "s0412": "You Ruo said: \"Ritual use, harmony precious, former kings way this beautiful.",
  "s0413": "Small great follow it, have not practice;",
  "s0414": "Know harmony harmony, not with ritual moderate, also cannot practice.\"",
  "s0415": "\"Faith near righteousness, words can repeat;",
  "s0416": "Respect near ritual, far shame humiliation;",
  "s0417": "Because not lose relatives, also can ancestral.\"",
  "s0419": "Confucius having died, disciples thought longed, You Ruo appearance similar Confucius, disciples together established as teacher, taught like Master time.",
  "s0420": "Another day, disciples advanced asked: \"Former Master when go, made disciples hold rain implements, afterward indeed rained.",
  "s0421": "Disciples asked: \"Master how know?\"",
  "s0422": "Master said: \"Poetry not say?",
  "s0423": "Moon leaves Bi, causes pouring rain.",
  "s0424": "Yesterday evening moon not lodge Bi?\"",
  "s0425": "Another day, moon lodged Bi, finally not rain.",
  "s0426": "Shang Qu year old no son, his mother for take wife.",
  "s0427": "Confucius made go Qi, Qu mother requested.",
  "s0428": "Confucius said: \"No worry, Qu year forty after should have five men sons.\"",
  "s0429": "Already then indeed.",
  "s0430": "Asked Master how know this?\"",
  "s0431": "You Ruo silent no response.",
  "s0432": "Disciples rose said: \"You Ruo avoid it, this not your seat!\"",
  "s0434": "Gong Xi Chi styled Zi Hua.",
  "s0435": "Younger than Confucius by forty-two years.",
  "s0436": "Zi Hua envoy to Qi, Ran You for his mother requested grain.",
  "s0437": "Confucius said: \"Give fu.\"",
  "s0438": "Requested increase, said: \"Give yu.\"",
  "s0439": "Ran Zi gave grain five bing.",
  "s0440": "Confucius said: \"Chi go Qi, ride fat horses, wear light furs.",
  "s0441": "I heard gentlemen help urgent not continue rich.\"",
  "s0443": "Wu Ma Shi styled Zi Qi.",
  "s0444": "Younger than Confucius by thirty years.",
  "s0445": "Chen Si Bai asked Confucius: \"Lu Zhao Gong know ritual?\"",
  "s0446": "Confucius said: \"Know ritual.\"",
  "s0447": "Retreated bowed Wu Ma Qi: \"I heard gentlemen not partisan, gentlemen also partisan?",
  "s0448": "Lu jun take Wu woman as consort, named Meng Zi.",
  "s0449": "Meng Zi surname Ji, taboo same surname, therefore call Meng Zi.",
  "s0450": "Lu jun know ritual, who not know ritual!\"",
  "s0451": "Shi told Confucius, Confucius said: \"Qiu fortunate, if have error, people must know.",
  "s0452": "Minister cannot speak jun relatives evil, for taboo, ritual.\"",
  "s0454": "Liang Lian styled Shu Yu.",
  "s0455": "Younger than Confucius by twenty-nine years.",
  "s0456": "Yan Xing styled Zi Liu.",
  "s0457": "Younger than Confucius by forty-six years.",
  "s0458": "Ran Ru styled Zi Lu, younger than Confucius by fifty years.",
  "s0459": "Cao Xu styled Zi Xun.",
  "s0460": "Younger than Confucius by fifty years.",
  "s0461": "Bo Qian styled Zi Xi, younger than Confucius by fifty years.",
  "s0462": "Gong Sun Long styled Zi Shi.",
  "s0463": "Younger than Confucius by fifty-three years.",
  "s0464": "From Zi Shi already right thirty-five people, manifest have year name and received teachings seen in book transmissions.",
  "s0465": "Forty-two people, no year and not seen book transmissions recorded left:",
  "s0466": "Ran Ji styled Zi Chan.",
  "s0467": "Gong Zu Gou Ci styled Zi Zhi.",
  "s0468": "Qin Zu styled Zi Nan.",
  "s0469": "Qi Diao Duo styled Zi Lian.",
  "s0470": "Yan Gao styled Zi Jiao.",
  "s0471": "Qi Diao Tu Fu.",
  "s0472": "Rang Si Chi styled Zi Tu.",
  "s0473": "Shang Ze.",
  "s0474": "Shi Zuo Shu styled Zi Ming.",
  "s0475": "Ren Bu Qi styled Xuan.",
  "s0476": "Gong Liang Ru styled Zi Zheng.",
  "s0477": "Hou Chu styled Zi Li.",
  "s0478": "Qin Ran styled Kai.",
  "s0479": "Gong Xia Shou styled Cheng.",
  "s0480": "Xi Rong Zhen styled Zi Xi.",
  "s0481": "Gong Jian Ding styled Zi Zhong.",
  "s0482": "Yan Zu styled Xiang.",
  "s0483": "Meng Shan styled Zi Jia.",
  "s0484": "Gou Jing Jiang.",
  "s0485": "Han Fu Hei styled Zi Suo.",
  "s0486": "Qin Shang styled Zi Pi.",
  "s0487": "Shen Dang styled Zhou.",
  "s0488": "Yan Zhi Pu styled Shu.",
  "s0489": "Rong Qi styled Zi Qi.",
  "s0490": "Xuan Cheng styled Zi Qi.",
  "s0491": "Zuo Ren Ying styled Xing.",
  "s0492": "Yan Ji styled Si.",
  "s0493": "Zheng Guo styled Zi Tu.",
  "s0494": "Qin Fei styled Zi Zhi.",
  "s0495": "Shi Zhi Chang styled Zi Heng.",
  "s0496": "Yan Kuai styled Zi Sheng.",
  "s0497": "Bu Shu Cheng styled Zi Che.",
  "s0498": "Yuan Kang Ji.",
  "s0499": "Yue Kai styled Zi Sheng.",
  "s0500": "Lian Jie styled Yong.",
  "s0501": "Shu Zhong Hui styled Zi Qi.",
  "s0502": "Yan He styled Ran.",
  "s0503": "Di Hei styled Xi.",
  "s0504": "Bang Xun styled Zi Lian.",
  "s0505": "Kong Zhong.",
  "s0506": "Gong Xi Yu Ru styled Zi Shang.",
  "s0507": "Gong Xi Xin styled Zi Shang.",
  "s0508": "Grand Historian said: Scholars many praise seventy disciples followers, praisers sometimes exceed reality, detractors sometimes diminish truth, balanced not seen their appearance, then discuss disciples register, from Kong clan ancient texts near correct.",
  "s0509": "I with disciples names surnames characters all take from Analects disciples questions and sequence as chapter, doubtful leave blank."
}