{
  "s0131": "Thus declined chariot riders people followers, Nie Zheng then alone departed.",
  "s0132": "Held sword reached Han, Han minister Xia Lei just sat office above, held weapons halberds while guard attendants very many.",
  "s0133": "Nie Zheng straight entered, ascended stairs stabbed killed Xia Lei, left right greatly chaotic.",
  "s0134": "Nie Zheng greatly called, those he struck killed several ten persons, thus self-flayed face gouged eyes, self-butcher disembowel intestines, thus died.",
  "s0135": "Han took Nie Zheng corpse exposed market, sought questioned none knew whose son.",
  "s0136": "Thus Han offered reward, able speak killed minister Xia Lei give thousand jin gold.",
  "s0137": "Long time none knew.",
  "s0138": "Zheng sister Rong heard had person stabbed killed Han minister, thief not obtained, state not know his name surname, exposed his corpse offered thousand jin gold, thus in sorrow said: 'Perhaps my younger brother?",
  "s0139": "Alas, Yan Zhongzi knows my brother!'",
  "s0140": "Immediately rose, went Han, market, dead person indeed Zheng, prostrated corpse wept extreme sorrow, said: 'This Zhi Shenjing li called Nie Zheng.'",
  "s0141": "Market walkers various people all said: 'This person violently abused our state minister, king offered reward his name surname thousand jin gold, lady not hear?",
  "s0142": "Why dare come identify him?'",
  "s0143": "Rong responded said: 'Heard.",
  "s0144": "Yet Zheng reason bore defilement disgrace self-abandoned in market trading between, for aged mother fortunately without illness, concubine not married.",
  "s0145": "Parents already heaven years descended world, concubine already married husband, Yan Zhongzi then examined promoted my brother poverty defilement middle befriended him, favor thick, how can!",
  "s0146": "Scholar certainly dies for knower, now because concubine still in reason, heavy self-punished to cut followers, concubine how fear death body punishment, finally extinguish worthy brother name!'",
  "s0147": "Greatly startled Han market people.",
  "s0148": "Thus greatly called heaven three times, finally in sorrow sorrow died Zheng side.",
  "s0149": "Jin, Chu, Qi, Wei heard, all said: 'Not only Zheng able, his sister also fierce woman.",
  "s0150": "If made Zheng truly know his sister no soft endure will, not heavy expose corpse difficulty, must cut danger thousand li to establish his name, brother sister both executed Han market, also perhaps not dare with body promise Yan Zhongzi.",
  "s0151": "Yan Zhongzi also can call know person able obtain scholars!'",
  "s0153": "After two hundred twenty plus years Qin had Jing Ke affair.",
  "s0154": "Jing Ke was Wei person.",
  "s0155": "His ancestor was Qi person, moved to Wei, Wei people called him Qing Qing.",
  "s0156": "Went to Yan, Yan people called him Jing Qing.",
  "s0157": "Jing Qing liked read books strike sword, with strategy persuaded Wei Yuan Jun, Wei Yuan Jun not used.",
  "s0158": "Afterward Qin attacked Wei, established Dong commandery, moved Wei Yuan Jun branch relatives to Ye Wang.",
  "s0159": "Jing Ke once traveled passed Yu Ci, with Gai Nie discussed sword, Gai Nie angered glared at him.",
  "s0160": "Jing Ke exited, person some said again summoned Jing Qing.",
  "s0161": "Gai Nie said: 'Previously I with him discussed sword had disagreement, I glared at him;",
  "s0162": "Try go, this suitable leave, not dare stay.'",
  "s0163": "Made envoy go his lodging, Jing Qing then already harnessed departed Yu Ci.",
  "s0164": "Envoy returned reported, Gai Nie said: 'Certainly left, my previously glared frightened him!'",
  "s0166": "Jing Ke traveled Handan, Lu Gou Jian with Jing Ke gambled, contended road, Lu Gou Jian angered scolded him, Jing Ke silent escaped departed, thus not again met.",
  "s0167": "Jing Ke having reached Yan, loved Yan's dog butcher and good beat zhu Gao Jian Li.",
  "s0168": "Jing Ke addicted wine, daily with dog butcher and Gao Jian Li drank Yan market, wine flowing then went, Gao Jian Li beat zhu, Jing Ke harmonized sang in market middle, mutually happy, already then mutually wept, side as no person.",
  "s0169": "Jing Ke though wandered among wine people, yet his person deep沉 good books;",
  "s0170": "His traveled feudal lords, all befriended their worthy heroes elders.",
  "s0171": "His went Yan, Yan's recluse Tian Guang mister also well treated him, knew he not common person.",
  "s0172": "Dwelt moment, met Yan crown prince Dan hostage Qin fled returned Yan.",
  "s0173": "Yan crown prince Dan, formerly often hostage Zhao, Qin king Zheng born in Zhao, his young time with Dan friendly.",
  "s0174": "When Zheng established as Qin king, Dan hostage in Qin.",
  "s0175": "Qin king treated Yan crown prince Dan not good, thus Dan resented fled returned.",
  "s0176": "Returned sought become avenge Qin king, state small, strength could not.",
  "s0177": "Afterward Qin daily sent troops east to attack Qi, Chu, three Jin, gradually nibbled feudal lords, moreover reached Yan, Yan ruler ministers all feared calamity arrived.",
  "s0178": "Crown prince Dan worried, asked his tutor Ju Wu.",
  "s0179": "Wu responded: 'Qin land covers world, threatens Han, Wei, Zhao clans, north has Gan Quan, Gu Kou solid, south has Jing, Wei fertile, monopolizes Ba, Han rich, right Long, Shu mountains, left Guan, Xiao dangers, people many soldiers sharp, weapons armor surplus.",
  "s0180": "Intent has out, then Great Wall south, Yi water north, not yet decided.",
  "s0181": "How with seen humiliate resentment, wish slap his reverse scales!'",
  "s0182": "Dan said: 'Then how?'"
}
