{
  "s0001": "Qu Yuan, named Ping, was of Chu's royal clan.",
  "s0002": "He served as Chu King Huai's left aide.",
  "s0003": "Broad in learning and strong in will, clear on order and chaos, skilled in rhetoric.",
  "s0004": "When in court he consulted with the king on state affairs and issued commands;",
  "s0005": "When abroad he received guests and responded to feudal lords.",
  "s0006": "The king relied on him greatly.",
  "s0007": "The Grand Chamberlain shared his rank, competed for favor and secretly envied his talent.",
  "s0008": "King Huai ordered Qu Yuan to draft the constitution. Qu Ping had just finished the rough draft.",
  "s0009": "The Grand Chamberlain saw it and wanted to steal it. Qu Ping would not give it. Thus he slandered saying: 'The king ordered Qu Ping to draft the constitution. Everyone knows this. Every time a command is issued, Ping claims the credit, saying \"Only I could do this.\"'",
  "s0010": "The king grew angry and distanced Qu Ping.",
  "s0011": "Qu Ping resented that the king listened without wisdom, that slanderers blocked clarity, that crookedness harmed justice, that uprightness was not tolerated. Thus he worried and brooded in sorrow and composed 'Li Sao'.",
  "s0012": "'Li Sao' means departing sorrow.",
  "s0013": "Heaven is the beginning of man;",
  "s0014": "Parents are man's foundation.",
  "s0015": "When man is in distress he returns to fundamentals, thus when exhausted by toil and weariness, one inevitably cries to heaven;",
  "s0016": "When pained by illness and suffering, one inevitably cries to parents.",
  "s0017": "Qu Ping walked the straight path, exhausted loyalty and wisdom serving his lord. Slanderers came between them - he can be called destitute.",
  "s0018": "Trusted yet suspected, loyal yet slandered - how could he not resent?",
  "s0019": "Qu Ping's composition of 'Li Sao' arose from self-pity.",
  "s0020": "'Guo Feng' delights in beauty without licentiousness, 'Xiao Ya' resents and satirizes without disorder.",
  "s0021": "As for 'Li Sao', it can be said to combine both.",
  "s0022": "Above it praises Emperor Ku, below it describes Duke Huan of Qi, in the middle it narrates Tang and Wu, to criticize contemporary affairs.",
  "s0023": "It illuminates the vast sublimity of morality, the systematic principles of order and chaos - nothing is not fully revealed.",
  "s0024": "Its text is concise, its diction subtle, its ambition pure, its conduct honest. Its language is modest but its meaning extremely grand, citing near examples yet revealing far-reaching principles.",
  "s0025": "Its ambition pure, thus it praises fragrant things.",
  "s0026": "Its conduct honest, thus in death it would not let itself be distant.",
  "s0027": "Washing in filthy mud, shedding like a cicada from impurity, to float and roam beyond the dust, not acquiring the world's defilement, pure white mud yet unstained.",
  "s0028": "Extending this ambition, even contending with sun and moon for brilliance is possible.",
  "s0029": "Qu Ping having been demoted, afterward Qin wanted to attack Qi. Qi and Chu had allied closely. Qin King Hui worried, thus ordered Zhang Yi to pretend to leave Qin, offer rich gifts and serve Chu, saying: 'Qin greatly hates Qi. Qi and Chu have allied closely. If Chu can truly break with Qi, Qin wishes to offer the lands of Shang and Yu, six hundred li.'",
  "s0030": "Chu King Huai, greedy, believed Zhang Yi, thus broke with Qi and sent envoys to Qin to receive land.",
  "s0031": "Zhang Yi deceived saying: 'Yi and the king agreed to six li, not six hundred li.'",
  "s0032": "The Chu envoy angrily left, returned and reported to King Huai.",
  "s0033": "King Huai angered, greatly raised troops to attack Qin.",
  "s0034": "Qin sent troops to strike them, greatly defeated Chu army at Dan and Xi, beheaded eighty thousand, captured Chu general Qu Gai, thus took Chu's Han River region.",
  "s0035": "King Huai then mobilized all troops in the state for deep invasion to attack Qin, battled at Lan Tian.",
  "s0036": "Wei heard of it, raided Chu to Deng.",
  "s0037": "Chu troops feared, returned from Qin.",
  "s0038": "Yet Qi ultimately angered and did not rescue Chu, Chu greatly distressed.",
  "s0039": "Next year, Qin ceded Han River region to Chu for peace.",
  "s0040": "Chu king said: 'I do not wish land, I wish Zhang Yi to satisfy my hatred.'",
  "s0041": "Zhang Yi heard, thus said: 'Using one Yi to exchange for Han River region, minister requests to go to Chu.'",
  "s0042": "Went to Chu, again used rich gifts to make the influential minister Jin Shang serve him, and set deceptive arguments through King Huai's favored concubine Zheng Xiu.",
  "s0043": "King Huai ultimately listened to Zheng Xiu, again released Zhang Yi.",
  "s0044": "At this time Qu Ping was already estranged, no longer in position. Sent to Qi, on return advised King Huai: 'Why not kill Zhang Yi?'",
  "s0045": "King Huai regretted, pursued Zhang Yi but could not catch him.",
  "s0046": "Afterward the feudal lords together attacked Chu, greatly defeated them, killed their general Tang Mei.",
  "s0047": "At this time Qin King Zhao married into Chu, wished to meet with King Huai.",
  "s0048": "King Huai wished to go. Qu Ping said: 'Qin is a tiger wolf state, cannot be trusted, better not to go.'",
  "s0049": "King Huai's young son Zi Lan urged the king to go: 'How can we cut off Qin's goodwill!'",
  "s0050": "King Huai ultimately went."
}
