{
  "s0001": "The Filial Wen Emperor was Gaozu's middle son.",
  "s0002": "Gaozu eleventh year spring, having already broken Chen Xi's army, pacified Dai lands, established as Dai Wang, capital Zhongdu.",
  "s0003": "Empress Dowager Bo's son.",
  "s0004": "Enthroned seventeen years, Empress Lü eighth year seventh month, Empress Lü passed.",
  "s0005": "Ninth month, various Lü Lü Chan and others wished to rebel, to endanger Liu clan, ministers together executed them, planned to summon establish Dai Wang, affair in Lü Empress records.",
  "s0006": "Chancellor Chen Ping, Commander-in-Chief Zhou Bo and others sent people to welcome Dai Wang.",
  "s0007": "Dai Wang asked his left and right Chamberlain for Ceremonials Zhang Wu and others.",
  "s0008": "Zhang Wu and others discussed said: 'Han ministers all former Gaozu great generals, practiced in arms, many schemers, their intentions not stop here, only feared Gaozu, Lü Empress awe.",
  "s0009": "Now already executed various Lü, fresh blood in capital, this using welcome da wang as name, really not trustworthy.",
  "s0010": "Wish da wang claim illness not go, to observe their change.'",
  "s0011": "Chamberlain of the Palace Guard Song Chang advanced said: 'Ministers' discussion all wrong.",
  "s0012": "Qin lost its governance, feudal lords powerful men rose together, each self-considered obtained by ten thousand count, yet finally trod Son of Heaven position, Liu clan, world despaired, one.",
  "s0013": "Gaozu enfeoffed sons and younger brothers, lands jagged mutually controlled, this called boulder foundation, world submitted its strength, two.",
  "s0014": "Han rose, abolished Qin harsh policies, simplified laws commands, bestowed kindness benevolence, everyone self-secure, difficult to shake, three.",
  "s0015": "With Lü Empress's strictness, established various Lü as three wang, monopolized authority specialized control, yet Commander-in-Chief with one tally entered northern army, one call soldiers all left bared, for Liu clan, rebelled various Lü, finally extinguished them.",
  "s0016": "This heaven bestowed, not human power.",
  "s0017": "Now ministers though wish change, common people not for them use, their faction how able to concentrate?'",
  "s0018": "Currently inside has Zhu Xu, Dong Mu close kin, outside fears Wu, Chu, Huai Nan, Lang Ye, Qi, Dai strength.",
  "s0019": "Currently Gaozu sons only Huai Nan Wang and da wang, da wang moreover eldest, worthy sage benevolent filial, heard in world, therefore ministers because world heart wish welcome establish da wang, da wang not doubt.'",
  "s0020": "Dai Wang reported Empress Dowager planned it, still undecided.",
  "s0021": "Divined turtle, hexagram signs obtained great horizontal.",
  "s0022": "Divination said: 'Great horizontal geng geng, I for heaven wang, Xia Qi with light.'",
  "s0023": "Dai Wang said: 'I already established as wang, moreover what wang?'",
  "s0024": "Diviner said: 'So-called heaven wang is Son of Heaven.'",
  "s0025": "Thereupon Dai Wang sent Empress Dowager younger brother Bo Zhao to see Jiang Hou, Jiang Hou and others fully explained to Zhao the intention of welcoming establishing wang.",
  "s0026": "Bo Zhao returned reported said: 'Trustworthy, none to doubt.'",
  "s0027": "Dai Wang then smiled told Song Chang said: 'Indeed like gong said.'",
  "s0028": "Then ordered Song Chang chariot rider, Zhang Wu and others six people rode postal to Chang'an.",
  "s0029": "Arrived Gao Ling rested, made Song Chang first gallop to Chang'an observe change.",
  "s0030": "Chang arrived Wei Bridge, Chancellor below all welcomed.",
  "s0031": "Song Chang returned reported.",
  "s0032": "Dai Wang galloped to Wei Bridge, ministers bowed saluted called subject.",
  "s0033": "Dai Wang descended carriage bowed.",
  "s0034": "Commander-in-Chief Bo advanced said: 'Wish request private words.'",
  "s0035": "Song Chang said: 'What said public, gong say it.",
  "s0036": "What said private, wang not receive private.'",
  "s0037": "Commander-in-Chief then knelt presented Son of Heaven seal tallies.",
  "s0038": "Dai Wang declined said: 'Arrive Dai residence then discuss.'",
  "s0039": "Then galloped entered Dai residence.",
  "s0040": "Ministers followed to.",
  "s0041": "Chancellor Chen Ping, Commander-in-Chief Zhou Bo, Grand General Chen Wu, Imperial Secretary Zhang Cang, Imperial Kinsman Liu Ying, Zhu Xu Hou Liu Zhang, Dong Mu Hou Liu Xing Ju, Court Guest Liu Jie all twice bowed said: 'Zi Hong and others all not Xiao Hui Emperor son, not proper serve ancestral temple.",
  "s0042": "Subject respectfully request with Yin An Hou lie hou Qu Wang Empress and Lang Ye Wang, imperial clan, ministers, lie hou, officials two thousand shi discussed said: \"Da wang Gaozu eldest son, suitable be Gaozu successor.\"",
  "s0043": "Wish da wang assume Son of Heaven position.'",
  "s0044": "Dai Wang said: 'Serve Gaozu ancestral temple, heavy affair.",
  "s0045": "I not worthy, not sufficient match ancestral temple.",
  "s0046": "Wish request Chu Wang plan suitable, I dare not accept.'",
  "s0047": "Ministers all prostrated firmly requested.",
  "s0048": "Dai Wang west faced declined three, south faced declined two.",
  "s0049": "Chancellor Ping and others all said: 'Subject prostrate planned, da wang serve Gaozu ancestral temple most suitable honored, though world feudal lords ten thousand people consider suitable.",
  "s0050": "Subject and others for ancestral temple she ji plan, dare not neglect.",
  "s0051": "Wish da wang fortunately listen subject and others.",
  "s0052": "Subject respectfully offer Son of Heaven seal tallies twice bow present.\"",
  "s0053": "Dai Wang said: \"Imperial clan generals chancellors wang lie hou consider none suitable I, I dare not decline.\"",
  "s0054": "Then assumed Son of Heaven position.",
  "s0055": "Ministers with ritual sequence attended.",
  "s0056": "Then made Grand Coachman Ying with Dong Mu Hou Xing Ju clear palace, offer Son of Heaven formal carriage, welcome at Dai residence.",
  "s0057": "Emperor that day evening entered Wei Yang Palace.",
  "s0058": "Then night appointed Song Chang as Guard General, pacify north south armies.",
  "s0059": "Made Zhang Wu as Chamberlain for Ceremonials, patrol palace halls.",
  "s0060": "Returned sat front hall.",
  "s0061": "Then night issued decree said: \"Recently various Lü used affairs monopolized authority, plotted great rebellion, wished endanger Liu clan ancestral temple, relied generals chancellors lie hou imperial clan ministers executed them, all received their guilt.",
  "s0062": "I initially enthroned, pardon world, grant people nobility one level, women hundred households ox wine, assemble five days.\"",
  "s0064": "Xin Hai, Emperor assumed throne, visited Gao temple.",
  "s0065": "Right Chancellor Ping moved to Left Chancellor, Commander-in-Chief Bo as Right Chancellor, Grand General Guan Ying as Commander-in-Chief.",
  "s0066": "Various Lü seized Qi Chu former lands, all restored to them.",
  "s0067": "Ren Zi, sent Chariot Cavalry General Bo Zhao welcome Empress Dowager at Dai.",
  "s0068": "Emperor said: \"Lü Chan self-appointed as Chancellor, Lü Lu as Upper General, falsely ordered Guan General Ying lead troops attack Qi, wished replace Liu clan, Ying stayed Xing Yang not attack, with feudal lords united planned executed Lü clan.",
  "s0069": "Lü Chan wished do evil, Chancellor Chen Ping with Commander-in-Chief Zhou Bo planned seized Lü Chan and others army.",
  "s0070": "Zhu Xu Hou Liu Zhang first captured Lü Chan and others.",
  "s0071": "Commander-in-Chief personally led Xiang Ping Hou Tong held tally received decree entered northern army.",
  "s0072": "Court Guest Liu Jie personally seized Zhao Wang Lü Lu seal.",
  "s0073": "Moreover enfeoffed Commander-in-Chief Bo ten thousand households, granted gold five thousand jin.",
  "s0074": "Chancellor Chen Ping, Guan General Ying fiefs each three thousand households, gold two thousand jin.",
  "s0075": "Zhu Xu Hou Liu Zhang, Xiang Ping Hou Tong, Dong Mu Hou Liu Xing Ju fiefs each two thousand households, gold thousand jin.",
  "s0076": "Enfeoffed Court Guest Jie as Yang Xin Hou, granted gold thousand jin.\"",
  "s0078": "Twelfth month, shang said: \"Law, governance correctness, what prohibit violence guide good people.",
  "s0079": "Now violated law already judged, moreover make innocent parents wives children same birth sit it, and for seize family property, I very not take.",
  "s0080": "Discuss it.\"",
  "s0081": "Officials all said: \"People cannot self-govern, therefore make law prohibit them.",
  "s0082": "Mutual sitting sitting seizure, what restrain their hearts, make heavy violate law, from long ago.",
  "s0083": "Like old convenient.\"",
  "s0084": "Shang said: \"I heard law correct then people respectful, crime proper then people follow.",
  "s0085": "Moreover shepherd people guide good, officials.",
  "s0086": "Already cannot guide, moreover with incorrect law punish them, this instead harm people become violent.",
  "s0087": "How prohibit?",
  "s0088": "I not see convenience, deliberate it.\"",
  "s0089": "Officials all said: \"Your Majesty add great favor, virtue very abundant, not subject and others reach.",
  "s0090": "Please follow decree book, abolish seize family property various mutual sitting law commands.\"",
  "s0092": "First month, officials spoke said: \"Early establish Crown Prince, what honor ancestral temple.",
  "s0093": "Please establish Crown Prince.\"",
  "s0094": "Shang said: \"I already not virtuous, Heaven spirits not enjoy offerings, world people not have satisfied will.",
  "s0095": "Now if cannot broadly seek world worthy sage virtuous people abdicate world to them, moreover say early establish Crown Prince, this repeat my not virtue.",
  "s0096": "Tell world what?",
  "s0097": "Peace it.\"",
  "s0098": "Officials said: \"Early establish Crown Prince, what heavy ancestral temple she ji, not forget world.\"",
  "s0099": "Shang said: \"Chu Wang, younger uncle, age high, seen world righteousness principles many, clear about state great system.",
  "s0100": "Wu Wang to me, elder brother, benevolent kind good virtue.",
  "s0101": "Huai Nan Wang, younger brother, holds virtue accompany me.",
  "s0102": "How for not early!",
  "s0103": "Feudal lords wang imperial clan brothers have merit ministers, many worthy and have virtue righteousness, if recommend have virtue accompany my cannot finish, is she ji spirit, world fortune.",
  "s0104": "Now not select recommend, moreover say must son, people will consider I forget worthy have virtue and specialize son, not what worry world.",
  "s0105": "I very not take.\"",
  "s0106": "Officials all firmly requested said: \"Ancient Yin Zhou had state, peace security all thousand plus years, ancient had world none longer, used this way.",
  "s0107": "Establish successor must son, from long ago.",
  "s0108": "Gaozu personally led scholars officials, began pacify world, established feudal lords, for emperors great ancestor.",
  "s0109": "Feudal lords wang and lie hou began receive state all also for their state ancestor.",
  "s0110": "Sons grandsons continue successor, generation generation not cut, world great righteousness, therefore Gaozu established to pacify within seas.",
  "s0111": "Now release suitable establish moreover select from feudal lords and imperial clan, not Gaozu will.",
  "s0112": "Change discuss not suitable.",
  "s0113": "Son certain eldest, pure thick benevolent kind, please establish as Crown Prince.\"",
  "s0114": "Shang then permitted it.",
  "s0115": "Because granted world people current generation father after nobility each one level enfeoffed General Bo Zhao as Zhi Hou.",
  "s0116": "Third month, officials requested establish Empress.",
  "s0117": "Bo Empress Dowager said: \"Feudal lords all same surname, establish Crown Prince mother as Empress.\"",
  "s0118": "Empress surname Dou.",
  "s0119": "Shang for establish Empress reason, granted world widowers widows orphans alone poor and age eighty above orphans nine below cloth silk rice meat each have number.",
  "s0120": "Shang from Dai came, initially enthroned, bestowed kindness benevolence world, filled pacified feudal lords four barbarians all harmonious happy, then followed from Dai came merit ministers.",
  "s0121": "Shang said: \"When ministers executed various Lü welcomed me, I hesitant doubtful, all stopped me, only Chamberlain of the Palace Guard Song Chang advised me, I because obtained protect serve ancestral temple.",
  "s0122": "Already honored Chang as Guard General, moreover enfeoffed Chang as Zhuang Wu Hou.",
  "s0123": "Various followed me six people, offices all reached nine ministers.\"",
  "s0125": "Shang said: \"Lie hou from Gaozu entered Shu, Han Zhong sixty-eight people all increase enfeoffed each three hundred households, old officials two thousand shi above from Gaozu Ying Chuan guard zun and others ten people food yi six hundred households, Huai Yang guard Shen Tu Jia and others ten people five hundred households, Guard Captain Ding and others ten people four hundred households.",
  "s0126": "Enfeoffed Huai Nan Wang maternal uncle father Zhao Jian as Zhou Yang Hou, Qi Wang maternal uncle father Si Jun as Qing Guo Hou.\"",
  "s0127": "Autumn, enfeoffed former Chang Shan Chancellor Cai Jian as Fan Hou.",
  "s0128": "Person or persuaded Right Chancellor said: \"Jun originally executed various Lü, welcomed Dai Wang, now moreover proud merit, receive shang reward, occupy honored position, calamity will reach body.\"",
  "s0129": "Right Chancellor Bo then declined illness resigned, Left Chancellor Ping specialized as Chancellor.",
  "s0130": "Second year tenth month, Chancellor Ping died, again made Jiang Hou Bo as Chancellor.",
  "s0131": "Shang said: \"I heard ancient feudal lords established state thousand plus years, each guarded their land, with time entered tribute, people not labor bitter, high low happy harmonious, none have remaining virtue.",
  "s0132": "Now lie hou many reside Chang'an, yi far, officials soldiers supply transport fee bitter, and lie hou also none by teach train their people.",
  "s0133": "Order lie hou return state, officials and decree stopped, send heir.\"",
  "s0135": "Eleventh month last day, sun had eclipse.",
  "s0136": "Twelfth month full moon, sun again eclipse.",
  "s0137": "Shang said: \"I heard, Heaven birth steamed people, for them establish lord to nourish govern them.",
  "s0138": "Ruler not virtuous, spread governance not even, then Heaven shows with disaster, to warn not govern.",
  "s0139": "Now eleventh month last day, sun had eclipse, suitable appeared in Heaven, disaster what greater!",
  "s0140": "I obtained protect ancestral temple, with tiny body entrusted on myriad people lord wang above, world govern chaos, in me one person, only two three administer still my limbs.",
  "s0141": "I below cannot reason nourish group living, above with burden three lights brightness, not virtuous great.",
  "s0142": "Command arrive, completely think my faults, and know see think what not reach, beg with tell me.",
  "s0143": "And recommend worthy good upright able straight speak extreme remonstrate, with aid my not reach.",
  "s0144": "Because each straighten their appointed duty, strive reduce labor expense to benefit people.",
  "s0145": "I already cannot far virtue, therefore fear think outer people have wrong, therefore prepare not rest.",
  "s0146": "Now if cannot stop border garrison defend, moreover straighten troops thick guard, then stop Guard General army.",
  "s0147": "Grand Coachman see horses surplus wealth sufficient, remainder all to give relay stations.\"",
  "s0149": "First month, shang said: \"Agriculture, world foundation, open register fields, I personally lead plow, to supply ancestral temple grain offerings.\"",
  "s0151": "Third month, officials requested establish imperial sons as feudal lords wang.",
  "s0152": "Shang said: \"Zhao You Wang died secluded, I very pity him, already established his eldest son Sui as Zhao Wang.",
  "s0153": "Sui younger brother Pi Qiang and Qi Dao Hui Wang son Zhu Xu Hou Zhang, Dong Mu Hou Xing Ju have merit, can wang.\"",
  "s0154": "Then established Zhao You Wang young son Pi Qiang as He Jian Wang, with Qi outstanding jun established Zhu Xu Hou as Cheng Yang Wang, established Dong Mu Hou as Ji Bei Wang, imperial son Wu as Dai Wang, son Can as Tai Yuan Wang, son Yi as Liang Wang.",
  "s0155": "Shang said: \"Ancient governed world, court had advance good banner, criticize wood, what communicate govern way and come remonstrate.",
  "s0156": "Now law has criticize false speak crime, this make many ministers dare not exhaust feelings, and shang none by hear faults.",
  "s0157": "Will what welcome far place worthy good?",
  "s0158": "Abolish it.",
  "s0159": "People or curse shang with mutually agree bind then mutually deceive, officials consider great rebellion, have other words, and officials moreover consider criticize.",
  "s0160": "This small people foolish without know bump death, I very not take.",
  "s0161": "From now come, have violate this not listen treat.\"",
  "s0163": "Ninth month, initially with jun state guard chancellor make copper tiger tally, bamboo envoy tally.",
  "s0164": "Third year tenth month ding you last day, sun had eclipse.",
  "s0165": "Eleventh month, shang said: \"Former day decree sent lie hou return state, or declined not gone.",
  "s0166": "Chancellor I what heavy, for me lead lie hou return state.\"",
  "s0167": "Jiang Hou Bo resigned Chancellor return state, made Commander-in-Chief Ying Yin Hou Ying as Chancellor.",
  "s0168": "Abolished Commander-in-Chief office, belonged Chancellor.",
  "s0169": "Fourth month, Cheng Yang Wang Zhang died.",
  "s0170": "Huai Nan Wang Chang with followers Wei Jing killed Pi Yang Hou Shen Shi Qi.",
  "s0171": "Fifth month, Xiongnu entered Bei Di, resided He Nan became bandits.",
  "s0172": "Emperor initially visited Gan Quan.",
  "s0173": "Sixth month, Emperor said: \"Han with Xiongnu agreed as brothers, not make harm border regions, what transport send Xiongnu very thick.",
  "s0174": "Now Right Xian Wang left his state, led multitudes resided He Nan surrendered land, not normal reason, come go near barrier, capture kill officials soldiers, drove protected barrier barbarian yi, made not able reside their old, trampled border officials, entered steal, very arrogant without way, not agreement.",
  "s0175": "Send border officials cavalry eighty-five thousand to Gao Nu, sent Chancellor Ying Yin Hou Guan Ying attack Xiongnu.\"",
  "s0176": "Xiongnu departed, sent Chamberlain of the Palace Guard timber officials belonged Guard General army Chang'an.",
  "s0177": "Xin Mao, Emperor from Gan Quan to Gao Nu, because visited Tai Yuan, saw former ministers, all granted them.",
  "s0178": "Raised merit bestowed reward, various people li granted ox wine.",
  "s0179": "Restored Jin Yang Zhong Du people three years.",
  "s0180": "Stayed toured Tai Yuan ten plus days.",
  "s0181": "Ji Bei Wang Xing Ju heard Emperor at Dai, wished go attack Hu, then rebelled, sent troops wished raid Xing Yang.",
  "s0182": "Thereupon decreed stop Chancellor troops, sent Ji Pu Hou Chen Wu as Grand General, led ten thousand went attack him.",
  "s0183": "Qi Hou He as general, army Xing Yang.",
  "s0184": "Seventh month xin hai, Emperor from Tai Yuan arrived Chang'an.",
  "s0185": "Then decreed officials said: \"Ji Bei Wang betrayed virtue rebelled shang, deceived confused officials people, for great rebellion.",
  "s0186": "Ji Bei officials people troops not arrived first self settled, and with army land yi surrendered, all pardon, restore offices nobility.",
  "s0187": "With Wang Xing Ju come go, also pardon.\"",
  "s0188": "Eighth month, broke Ji Bei army, captured his wang.",
  "s0189": "Pardoned Ji Bei various officials people with wang rebelled.",
  "s0190": "Sixth year, officials spoke Huai Nan Wang Chang abolished first Emperor law, not listened Son of Heaven decree, resided place without measure, entered exited imitate Son of Heaven, monopolized make law commands, with Ji Pu Hou heir Qi plotted rebellion, sent people envoy Min Yue and Xiongnu, sent their troops, wished endanger ancestral temple she ji.",
  "s0191": "Ministers discussed, all said \"Chang should abandoned market\" Emperor not bear apply law to wang, pardoned his crime, deposed not wang.",
  "s0192": "Ministers requested place wang Shu Yan Dao, Qiong Du, Emperor permitted.",
  "s0193": "Chang not arrived place, marched ill died, shang pitied him.",
  "s0194": "After sixteen years, pursued honored Huai Nan Wang Chang posthumous as Li Wang, established his three sons as Huai Nan Wang, Heng Shan Wang, Lu Jiang Wang.",
  "s0195": "Thirteenth year summer, shang said: \"Heard Heaven way calamity self resentment rise and fortune by virtue flourish.",
  "s0196": "Hundred officials wrong, suitable by me body.",
  "s0197": "Now secret blessing officials move fault to below, to manifest my not virtue, I very not take.",
  "s0198": "Abolish it.\"",
  "s0200": "Fifth month, Qi great granary official Chun Yu Gong had crime should punish, decree prison arrested moved bound Chang'an.",
  "s0201": "Great Granary Gong had no male, had five daughters.",
  "s0202": "Great Granary Gong would go meet arrest, cursed his daughters said: \"Give birth son not give birth male, have urgent not beneficial!\"",
  "s0203": "His youngest daughter Ti Ying self-injured wept, then followed her father to Chang'an, presented letter said: \"Concubine father as official, Qi midst all called his honest even, now sat law should punish.",
  "s0204": "Concubine hurt husband died cannot revive, punished cannot rejoin, though again wish change fault self-new, its way no by.",
  "s0205": "Concubine wish enter become official slave, redeem father punish crime, make obtain self-new.\"",
  "s0206": "Letter presented Son of Heaven, Son of Heaven pitied grieved her intention, then issued decree said: \"Heard You Yu time, painted clothes caps different patterns robes as punishment, and people not violate.",
  "s0207": "Why?",
  "s0208": "Extreme governance.",
  "s0209": "Now law has flesh punish three, and evil not stop, its blame where?",
  "s0210": "Not my virtue thin and teach not clear?",
  "s0211": "I very self-ashamed.",
  "s0212": "Therefore tamed way not pure and foolish people fall.",
  "s0213": "Shi said 'kind gentle gentleman, people parents'.",
  "s0214": "Now person has fault, teach not applied and punish added?",
  "s0215": "Or wish change conduct good and way none by.",
  "s0216": "I very pity them.",
  "s0217": "Punish to cut limbs body, carve skin flesh, lifetime not cease, how painful and not virtuous, how match people parents intention!",
  "s0218": "Abolish flesh punish.\"",
  "s0220": "Shang said: \"Agriculture, world foundation, strive none greater.",
  "s0221": "Now diligent body engage and have rent tax assignment, is for foundation end none distinguish, its to encourage agriculture way not complete.",
  "s0222": "Abolish field rent tax.\"",
  "s0224": "Fourteenth year winter, Xiongnu plotted enter border become bandits, attacked Chao Na barrier, killed Bei Di prefect Wei Ang.",
  "s0225": "Shang then sent three generals army Long Xi, Bei Di, Shang Jun, Chamberlain of the Palace Guard Zhou She as Guard General, Chamberlain for Ceremonials Zhang Wu as Chariot Cavalry General, army Wei north, chariots thousand multiply, cavalry soldiers ten thousand.",
  "s0226": "Emperor personally labored army, restrained troops explained taught commands, granted army officials soldiers.",
  "s0227": "Emperor wished self lead attack Xiongnu, ministers remonstrated, all not listened.",
  "s0228": "Empress Dowager firmly detained Emperor, Emperor then stopped.",
  "s0229": "Thereupon made Dong Yang Hou Zhang Xiang Ru as Grand General, Cheng Hou Chi as Interior Minister, Luan Bu as general, attacked Xiongnu.",
  "s0230": "Xiongnu fled departed.",
  "s0231": "Spring, shang said: \"I obtained hold sacrificial animal jade coins serve Heaven ancestral temple, fourteen years until now, experienced days long continuous, with not sensitive not clear long pacified governed world, I very self-ashamed.",
  "s0232": "Broad increase various sacrifices altars jade coins.",
  "s0233": "Former previous wang far bestowed not sought their repay, hoped sacrifice not prayed their fortune, right worthy left kin, first people after self, extreme bright.",
  "s0234": "Now I heard sacrifice officials blessing, all return fortune my body, not for hundred surnames, I very ashamed.",
  "s0235": "With my not virtue, and body enjoyed alone beautiful their fortune, hundred surnames not with, is heavy my not virtue.",
  "s0236": "Order sacrifice officials present respect, none have pray.\"",
  "s0238": "At time Bei Ping Hou Zhang Cang as Chancellor, just clarifying law calendar.",
  "s0239": "Lu person Gong Sun Chen presented letter explained end beginning transmitted five virtues affair, spoke current earth virtue time, earth virtue should yellow dragon see, should correct beginning month clothes colors system.",
  "s0240": "Son of Heaven lowered his affair with Chancellor discuss.",
  "s0241": "Chancellor pushed considered current water virtue, began bright correct tenth month shang black affairs, considered his words not is, requested stop him.",
  "s0242": "Fifteenth year, yellow dragon seen Cheng Ji, Son of Heaven then again summoned Lu Gong Sun Chen, made him erudite, explain earth virtue affairs.",
  "s0243": "Thereupon shang issued decree said: \"Have strange thing spirit seen at Cheng Ji, no harm people, year with have harvest.",
  "s0244": "I personally suburban sacrifice Heaven various spirits.",
  "s0245": "Ritual officials discuss, none taboo with labor me.\"",
  "s0246": "Officials ritual officials all said: \"Ancient Son of Heaven summer personally ritual sacrifice Heaven at suburban, therefore said suburban.\"",
  "s0247": "Thereupon Son of Heaven began visited Yong, suburban saw five emperors, with first summer fourth month respond ritual.",
  "s0248": "Zhao person Xin Yuan Ping with observe qi seen, because persuaded shang establish Wei Yang five temples.",
  "s0249": "Wished bring out Zhou tripod, should have jade essence see.",
  "s0250": "Sixteenth year, shang personally suburban saw Wei Yang five emperors temples, also with summer respond ritual and honored red.",
  "s0251": "Seventeenth year, obtained jade cup, engraved said \"ruler extend longevity\".",
  "s0252": "Thereupon Son of Heaven began change as first year, ordered world great assembly.",
  "s0253": "That year, Xin Yuan Ping affair aware, exterminated three clans.",
  "s0292": "Consider year long continuous, feared not finish.",
  "s0293": "Now fortunately with Heaven year, obtained again supply at Gao temple.",
  "s0294": "My not clear with good it, what mourn grieve have!",
  "s0295": "Order world officials people, command arrive go mourn three days, all release clothes.",
  "s0296": "Not prohibit take wife marry daughter sacrifice drink wine eat meat.",
  "s0297": "Self should give funeral affairs clothes mourn, all no tread.",
  "s0298": "Sash belt not over three cun, not cloth carriage and weapons, not send people men women cry mourn palace halls.",
  "s0299": "Palace halls midst should mourn, all with morning evening each fifteen raise voice, ritual finished stop.",
  "s0300": "Not morning evening mourn time, prohibit not able privately cry.",
  "s0301": "Already below, wear great red fifteen days, small red fourteen days, fine seven days, release clothes.",
  "s0302": "Other not in command, all with this command ratio carry out.",
  "s0303": "Cloth announce world, make clear know my intention.",
  "s0304": "Ba Ling mountain rivers because their old, none have change.",
  "s0305": "Return lady below to least envoy.\"",
  "s0306": "Ordered Chamberlain of the Palace Guard Ya Fu as Chariot Cavalry General, Shu Guo Han as Garrison General, Chamberlain for Ceremonials Wu as Return Earth General, sent near counties seen troops sixteen thousand people, sent Interior Minister troops fifteen thousand people, hid Guo dug return earth belonged General Wu.",
  "s0307": "Yi Si, ministers all knocked head shang honored title said Filial Wen Emperor.",
  "s0308": "Crown Prince assumed position at Gao temple.",
  "s0309": "Ding Wei, inherited title said Emperor.",
  "s0310": "Filial Jing Emperor first year tenth month, formulated decree Imperial Secretary: \"Heard ancient ancestor have merit and zong have virtue, established ritual music each have origin.",
  "s0311": "Heard sing, what issue virtue;",
  "s0312": "dance, what clear merit.",
  "s0313": "Gao temple wine offering, perform Wu De, Wen Shi, Wu Xing dance.",
  "s0314": "Xiao Hui temple wine offering, perform Wen Shi, Wu Xing dance.",
  "s0315": "Filial Wen Emperor faced world, opened barriers, not different far places.",
  "s0316": "Abolished criticize, removed flesh punish, rewarded elders, collected pitied orphans alone, to nourish group living.",
  "s0317": "Reduced desires, not received offerings, not private their profit.",
  "s0318": "Punished person not seize family, not executed innocent.",
  "s0319": "Abolished palace punish, released beauties, heavy cut person generations.",
  "s0320": "I already not sensitive, cannot recognize.",
  "s0321": "This all upper ancient not reached, and Filial Wen Emperor personally did.",
  "s0322": "Virtue thick equal Heaven earth, benefit moisture bestowed four seas, none not obtained fortune.",
  "s0323": "Bright image like sun moon, and temple music not match.",
  "s0324": "I very fear.",
  "s0325": "Make for Filial Wen Emperor temple make Zhao De dance, to clear flourishing virtue.",
  "s0326": "Then ancestor zong merit virtue recorded on bamboo silk, bestowed ten thousand generations, forever without end, I very good it.",
  "s0327": "With Chancellor, lie hou, middle two thousand shi, ritual officials fully make ritual instruments present.\"",
  "s0328": "Chancellor subject Jia and others said: \"Your Majesty forever think filial way, established Zhao De dance to clear Filial Wen Emperor abundant virtue.",
  "s0329": "All subject Jia and others foolish not reached.",
  "s0330": "Subject respectfully discuss: generation merit none greater Gao Emperor, virtue none abundant Filial Wen Emperor, Gao Huang temple suitable be emperors great ancestor temple, Filial Wen Emperor temple suitable be emperors great zong temple.",
  "s0331": "Son of Heaven suitable generation generation offer ancestor zong temple.",
  "s0332": "Jun state feudal lords suitable each for Filial Wen Emperor establish great zong temple.",
  "s0333": "Feudal lords wang lie hou envoys attend sacrifice Son of Heaven, year offer ancestor zong temple.",
  "s0334": "Please record on bamboo silk, announce world.\"",
  "s0335": "Formulated said: \"Can.\"",
  "s0337": "Grand Historian said: Confucius spoke \"must generation then ren.",
  "s0338": "Good person govern state hundred years, also can overcome remnant remove kill\".",
  "s0339": "Truly this saying!",
  "s0340": "Han rose, to Filial Wen forty plus years, virtue extremely abundant.",
  "s0341": "Abundant toward correct change clothes feng shan, modest yield not completed until now.",
  "s0342": "Wu hu, how not ren!"
}