{
  "s0061": "Tian zi patrol hunt sea within, repair shang ancient god temple, seal zhan, rise li music.",
  "s0062": "Public family use few, Sang Hong Yang wait achieve profit, Wang Wen Shu wait severe law, Er Kuan wait push literature reach nine qing, change advance use affairs, affairs not close decide at cheng xiang, cheng xiang pure cautious only.",
  "s0063": "In position nine years, no able have rectify speak.",
  "s0064": "Once desire please govern shang close minister Su Zhong, nine qing all Xuan crime, cannot serve, instead receive their fault, redeem crime.",
  "s0065": "Yuan Feng four years middle, Guan Dong flow people two hundred wan mouth, no name number forty wan, gong qing discuss desire please move flow people at border with adapt it.",
  "s0066": "Shang with cheng xiang old cautious, cannot with his discuss, then grant cheng xiang tell return, yet examine yu shi da fu below discuss become please.",
  "s0067": "Cheng xiang shame not bear duty, then shang book said: 'Qing fortunate obtain wait crime cheng xiang, dismiss nu no with auxiliary govern, city wall warehouse empty virtual, people many flow perish, crime should prostrate axe block, shang not bear apply law.",
  "s0068": "Wish return cheng xiang hou seal, beg skeleton return, avoid worthy road.'",
  "s0069": "Tian zi said: 'Warehouse granary already empty, people poor flow perish, yet jun desire please move them, shake dang not settle, move danger it, yet resign position, jun desire settle return difficulty?'",
  "s0070": "With book yield Qing, Qing very shame, then again see affairs.",
  "s0071": "Qing culture deep examine cautious, yet no other great strategy, become people speak.",
  "s0072": "After three years remain, Tai Chu two years middle, cheng xiang Qing die, shou become Tian hou.",
  "s0073": "Qing middle son De, Qing love use him, shang with De become continue, replace hou.",
  "s0074": "After become tai chang, sit law should die, redeem free become common person.",
  "s0075": "Qing just become cheng xiang, various sons grandson become li change reach two thousand dan thirteen people.",
  "s0076": "Reach Qing die after, gradually with crime go, filial cautious benefit decline.",
  "s0077": "Jian Ling hou Wei Wan, Dai Da Ling person.",
  "s0078": "Wan with xi che become lang, serve Wen Di, merit next move become zhong lang jiang, pure cautious no other.",
  "s0079": "Xiao Jing become crown prince time, summon shang left right drink, yet Wan claim illness not go.",
  "s0080": "Wen Di near collapse time, belong Xiao Jing said: 'Wan long person, good treat him.'"
}
