{
  "s0101": "If make Wen Wang distant Lu Shang not with deep words, this Zhou no heavenly son virtue, Wen Wu no with complete their king enterprise.",
  "s0102": "Now minister fettered wandering minister, relation distant to king, yet wished state all correct lord matters, place person bone flesh interval, wish effect foolish loyalty yet unknown king heart.",
  "s0103": "This what king three ask yet dare not answer.",
  "s0104": "Minister not have fear dare not speak.",
  "s0105": "Minister know today speak at front tomorrow prostrate execute at rear, however minister dare not avoid.",
  "s0106": "Great king trust implement minister words, death insufficient be minister worry, flight insufficient be minister sorrow, lacquer body be leper hair be mad insufficient be minister shame.",
  "s0107": "Moreover with five emperors holy then die, three kings benevolent then die, five hegemons worthy then die, Wu Huo, Ren Bi strength then die, Cheng Jing, Meng Ben, Wang Qing Ji, Xia Yu bravery then die.",
  "s0108": "Death, person what certainly not avoid.",
  "s0109": "Place inevitable situation, can little have supplement to Qin, this minister great wish, minister again what worry!",
  "s0110": "Wu Zi Xu bag carried out Zhaoguan, night walk day hide, arrived Ling water, no to paste mouth, knee walk crawl prostrate, bow head bare flesh, drum belly blow xiao, beg food at Wu market, finally raised Wu state, He Lu became hegemon.",
  "s0111": "Make minister get exhaust plans like Wu Zi Xu, add with dark imprisonment, lifetime not again see, this minister persuasion implement, minister again what sorrow?",
  "s0112": "Ji Zi, Jie Yu lacquer body be leper, hair be mad, no benefit to lord.",
  "s0113": "Suppose minister get same walk with Ji Zi, can have supplement to what worthy lord, this minister great honor, minister have what shame?",
  "s0114": "Minister what fear, alone fear minister die after, world see minister exhaust loyalty body die, because with this block mouth bind feet, none willing toward Qin.",
  "s0115": "Your excellency above fear Taihou strict, below confused by treacherous ministers appearance, dwell deep palace middle, not leave wet nurses hand, lifetime confused, none with illuminate treachery.",
  "s0116": "Great then ancestral temple extinguish overturn, small then body with isolated danger, this minister what fear.",
  "s0117": "If poor humiliated matters, death life worries, minister dare not fear.",
  "s0118": "Minister die yet Qin orderly, this minister die worthy than live.'",
  "s0119": "Qin king knelt said: 'Master is what words!",
  "s0120": "Qin state distant remote, Guaren foolish unworthy, master then fortunate humiliate arrive this, is heaven with Guaren present master preserve previous kings ancestral temple.",
  "s0121": "Guaren get receive command from master, is heaven what fortunate previous kings, not abandon their orphan.",
  "s0122": "Master how speak like this!",
  "s0123": "Matters no small great, up to Taihou, down to ministers, wish master all teach Guaren, no doubt Guaren.'",
  "s0124": "Fan Sui bowed, Qin king also bowed.",
  "s0125": "Fan Sui said: 'Great king state, four blocked as solid, north has Gan Quan, Gu Kou, south belt Jing, Wei, right Long, Shu, left Guan, Ban, rouse strike million, war chariots thousand, favorable then out attack, unfavorable then enter guard, this king possess land.",
  "s0126": "People cowardly at private fight brave at public war, this king possess people.",
  "s0127": "King combine this two have it.",
  "s0128": "With Qin troops bravery, chariots riders many, to govern feudal lords, like apply Han Lu attack lame rabbit, hegemon king enterprise can achieve, yet ministers none match position.",
  "s0129": "To now close pass fifteen years, dare not spy troops at Shandong, is Rang Hou for Qin plan not loyal, great king plan have loss.'",
  "s0130": "Qin king knelt said: 'Guaren wish hear loss plan.'",
  "s0132": "However left right many secretly listen, Fan Sui feared, not dared speak inner, first spoke outer matters, to observe Qin king bend bow.",
  "s0133": "Because advanced said: 'Rang Hou cross Han, Wei attack Qi Gang Shou, not plan.",
  "s0133": "Few send troops then insufficient harm Qi, many send troops then harm Qin.",
  "s0134": "Minister intend king plan, wish few send troops complete use Han, Wei troops, then not righteous.",
  "s0135": "Now see allied states not close, cross other state attack, possible?",
  "s0136": "This plan flawed.",
  "s0137": "Moreover formerly Qi Min Wang south attacked Chu, broke army killed generals, twice expanded territory thousand li, yet Qi inch land none got, how not desire get land, situation not able have.",
  "s0138": "Feudal lords saw Qi exhausted worn, lord ministers not harmonious, raised troops attacked Qi, greatly broke it.",
  "s0139": "Scholars humiliated troops weary, all blamed king, said: 'Who made this plan?'",
  "s0140": "King said: 'Wen Zi made it.'",
  "s0141": "Ministers made chaos, Wen Zi out fled.",
  "s0142": "Attacked Qi what greatly broke, because attacked Chu fattened Han, Wei.",
  "s0143": "This called borrow thief troops carry robber grain.",
  "s0144": "King not equal far ally near attack, get inch then king inch, get foot also king foot.",
  "s0145": "Now abandon this far attack, not also absurd!",
  "s0146": "Moreover formerly Zhongshan state land place five hundred li, Zhao alone swallowed, achievement complete name establish profit attached, world none able harm.",
  "s0147": "Now Han, Wei, central states place world pivot, king if wish hegemon, must personally central states as world pivot, with awe Chu, Zhao.",
  "s0148": "Chu strong then attach Zhao, Zhao strong then attach Chu, Chu, Zhao all attach, Qi certainly fear.",
  "s0149": "Qi fear, certainly humble words heavy gifts serve Qin.",
  "s0150": "Qi attach yet Han, Wei because can capture.'"
}