{
  "s0001": "Lü Buwei was a great merchant from Yangdi.",
  "s0002": "He traveled trading, buying cheap selling dear, household accumulated thousand jin gold.",
  "s0003": "Qin King Zhao fortieth year, crown prince died.",
  "s0004": "His forty-second year, made his second son Anguo Jun crown prince.",
  "s0005": "Anguo Jun had sons twenty plus persons.",
  "s0006": "Anguo Jun had a much loved concubine, established as proper wife, titled Huayang Madame.",
  "s0007": "Huayang Madame had no sons.",
  "s0008": "Anguo Jun middle son named Zichu, Zichu mother called Xia Ji, not favored.",
  "s0009": "Zichu served as Qin hostage in Zhao.",
  "s0010": "Qin repeatedly attacked Zhao, Zhao not much honored Zichu.",
  "s0011": "Zichu was Qin various concubine descendants, hostage among feudal lords, chariot riding expenses not plentiful, dwelling poor, not pleased.",
  "s0012": "Lü Buwei traded Handan, saw and pitied him, said 'This rare goods can store.'",
  "s0013": "Thus went saw Zichu, persuaded saying: 'I can enlarge your gate.'",
  "s0014": "Zichu laughed saying: 'First enlarge your lord's gate, then enlarge my gate!'",
  "s0015": "Lü Buwei said: 'You do not know. My gate waits for your gate to enlarge.'",
  "s0016": "Zichu heart knew meaning, thus led him sit, deeply spoke.",
  "s0017": "Lü Buwei said: 'Qin king aged, Anguo Jun can become crown prince.",
  "s0018": "I secretly heard Anguo Jun loves favors Huayang Madame, Huayang Madame has no sons, can establish proper heir is only Huayang Madame.",
  "s0019": "Now your brothers twenty plus persons, you again middle position, not much favored, long hostage among lords.",
  "s0020": "If great king dies, Anguo Jun establishes as king, then you few chance to contend with eldest son and various sons day night before as crown prince.'",
  "s0021": "Zichu said: 'Yes.",
  "s0022": "Handle how?'",
  "s0023": "Lü Buwei said: 'You poor, guest here, no means to present to parents and tie guests.",
  "s0024": "Buwei though poor, request with thousand jin gold for you west travel, serve Anguo Jun and Huayang Madame, establish you as proper heir.'",
  "s0025": "Zichu thus bowed head: 'Must like your plan, please divide Qin state share with you.'",
  "s0027": "Lü Buwei thus with five hundred jin gold gave Zichu, for expenses, tie guests;",
  "s0028": "Again with five hundred jin gold bought rare objects curios, personally carried west travel Qin, seek see Huayang Madame sister, all with objects presented Huayang Madame.",
  "s0029": "Thus spoke Zichu worthy wise, ties feudal lord guests fill world, often said 'Zichu takes Madame as heaven, day night weep think crown prince and Madame.'",
  "s0030": "Madame greatly pleased.",
  "s0031": "Buwei thus made her sister persuade Madame saying: 'I heard, serve others with beauty, beauty declines love relaxes.",
  "s0032": "Now Madame serves crown prince, much loved yet no sons, not with this time early self-attach to various sons' worthy filial ones, recommend establish as proper to son him, husband alive then heavy honored, husband hundred years after, sonned becomes king, end not lose power, this called one word ten thousand generations benefit.",
  "s0033": "Not with flourishing time plant roots, then beauty declines love relaxes after, though wish open one word, still obtainable?",
  "s0034": "Now Zichu worthy, self knows middle son, cannot become proper, mother again not favored, self-attaches Madame, Madame truly with this time pull establish as proper, Madame then compete lifetime favored in Qin.'",
  "s0035": "Huayang Madame considered correct, seized crown prince leisure, leisurely spoke Zichu hostage in Zhao extremely worthy, passers all praise him.",
  "s0036": "Thus because wept saying: 'Concubine fortunately fill rear palace, unfortunately no sons, wish Zichu establish as proper heir, to entrust concubine body.'",
  "s0037": "Anguo Jun permitted, thus with Madame engraved jade tally, agreed as proper heir.",
  "s0038": "Anguo Jun and Madame thus thick gifts sent Zichu, requested Lü Buwei tutor him, Zichu with this fame reputation increasingly flourishing among feudal lords.",
  "s0039": "Lü Buwei took Handan various beauties extremely good skilled dance with lived, knew had pregnancy.",
  "s0040": "Zichu from Buwei drank, saw pleased, thus rose toast, requested her.",
  "s0041": "Lü Buwei angered, thought already ruined family for Zichu, wished to fish rare, thus presented his beauty.",
  "s0042": "Beauty self hid pregnancy, to great period time, bore son Zheng.",
  "s0043": "Zichu thus established beauty as Madame.",
  "s0044": "Qin King Zhao fiftieth year, sent Wang Ji besiege Handan, urgent, Zhao wished kill Zichu.",
  "s0045": "Zichu with Lü Buwei planned, gave gold six hundred jin to guard officials, got escape, fled join Qin army, thus able return.",
  "s0046": "Zhao wished kill Zichu wife children, Zichu Madame Zhao powerful family girl, got hide, thus mother child finally survived.",
  "s0047": "Qin King Zhao fifty-sixth year, died, crown prince Anguo Jun established as king, Huayang Madame as queen, Zichu as crown prince.",
  "s0048": "Zhao also sent Zichu Madame and Zi Zheng return Qin.",
  "s0049": "Qin king established one year, died, posthumous title Xiaowen Wang.",
  "s0050": "Crown prince Zichu succeeded, this Zhuangxiang Wang.",
  "s0051": "Zhuangxiang Wang birth mother Huayang Queen as Huayang Empress Dowager, true mother Xia Ji honored as Xia Empress Dowager."
}