{
  "s0001": "Grand Historian read Qin records, to Quan Rong defeated You Wang, Zhou east moved Luo Yi, Qin Xiang Gong began sealed as feudal lords, made west altar served Shang Di, presumptuous signs appeared.",
  "s0002": "Rituals say: 'Heavenly son sacrifices heaven earth, feudal lords sacrifice their domain inner famous mountains great rivers.'",
  "s0003": "Now Qin mixed Rong Di customs, first violent tyrannical, after benevolence righteousness, position in border ministers yet altar at suburbs, gentlemen feared.",
  "s0004": "When Wen Gong crossed Long, drove back Yi Di, honored Chen treasure, camped Qi Yong between, yet Mu Gong repaired politics, east border to river, then with Qi Huan, Jin Wen central states feudal lords equaled.",
  "s0005": "After this attendant ministers grasped politics, grand masters hereditary stipends, six ministers monopolized Jin authority, attacked conquered allied met, might heavier than feudal lords.",
  "s0006": "When Tian Chang killed Jian Gong yet chancellored Qi state, feudal lords peaceful not punished, within seas contended battle merit.",
  "s0007": "Three states ended finally divided Jin, Tian He also extinguished Qi had it, six states flourishing from this began.",
  "s0008": "Devoted strong troops united enemies, schemed deceived used vertical horizontal long short sayings arose.",
  "s0009": "Falsely claimed wasps emerged, sworn allied not trusted, though placed hostages split tallies still could not bind.",
  "s0010": "Qin began small state remote, various Xia treated as guest, compared to Rong Di, to Xian Gong after often male various feudal lords.",
  "s0011": "Discuss Qin virtue righteousness not as Ru Wei violent tyrannical, measure Qin troops not as three Jin strong, yet finally united world, not necessarily dangerous solid convenient terrain profit, probably heaven assisted.",
  "s0012": "Some say 'Eastern things begin born, Western things mature complete.'",
  "s0013": "Make affairs must at southeast, receive merit real often at northwest.",
  "s0014": "Thus Yu rose at Western Qiang, Tang arose at Bo, Zhou king with Feng Hao attacked Yin, Qin emperor used Yong Zhou rose, Han rise from Shu Han.",
  "s0015": "Qin already obtained intention, burned world poems books, feudal lords histories especially severe, because had criticism ridicule.",
  "s0016": "Poems books so again appeared, many hid family homes, yet histories alone hid Zhou chamber, because extinguished.",
  "s0017": "Pity, pity!",
  "s0018": "Alone had Qin records, moreover not recorded day month, its writings brief not complete.",
  "s0019": "Yet Warring States authority changes also have considerable collect, why must ancient past.",
  "s0020": "Qin took world much violent, yet generations different changed, success great.",
  "s0021": "Transmission says 'model later kings', why?",
  "s0022": "Because near self custom changed similar kind, discuss low easy practice.",
  "s0023": "Scholars constrained by heard, see Qin at emperor position days shallow, not examined its beginning end, thus raised laughed, not dared speak, this with ear eat no different.",
  "s0024": "Sad!",
  "s0025": "I then because Qin records, followed Spring Autumn after, rose Zhou Yuan Wang, table six states time affairs, ended Second Generation, altogether two hundred seventy years, recorded all heard rise ruin beginnings.",
  "s0026": "Later have gentlemen, to view observe.",
  "s100": "BC",
  "s1000": "Zhou",
  "s1001": "Qin",
  "s1002": "Wei",
  "s1003": "Han",
  "s1004": "Zhao",
  "s1005": "Chu",
  "s1006": "Yan",
  "s1007": "Qi",
  "s1008": "476",
  "s1009": "Yuan Wang first year.",
  "s101": "Li Gong Gong first year.",
  "s1010": "Xian Zi. Wei Chu Gong Zhe after first year.",
  "s1011": "Xuan Zi",
  "s1012": "Jian Zi. Forty two.",
  "s1013": "Hui Wang Zhang thirteen years. Wu attacked us.",
  "s1014": "Xian Gong seventeen years.",
  "s1015": "Ping Gong Ao five years.",
  "s1016": "475",
  "s1017": "2",
  "s1018": "2. Shu people came bribed.",
  "s1019": "Jin Ding Gong died.",
  "s102": "Forty three",
  "s1020": "14. Yue surrounded Wu, Wu resented."
}