{
  "s0251": "Hid Ping Yuan Jun place.",
  "s0252": "Fan Sui already chancellor, Wang Ji told Fan Sui: 'Matters have cannot know three, have cannot how also three.",
  "s0253": "Palace carriage one day late start, this matter cannot know one.",
  "s0254": "Lord suddenly abandon dwelling, this matter cannot know two.",
  "s0255": "Make minister suddenly fill ditch moat, this matter cannot know three.",
  "s0256": "Palace carriage one day late start, lord though hate minister, no can how.",
  "s0257": "Lord suddenly abandon dwelling, lord though hate minister, also no can how.",
  "s0258": "Make minister suddenly fill ditch moat, lord though hate minister, also no can how.'",
  "s0259": "Fan Sui not pleased, then entered spoke king: 'Not Wang Ji loyalty, none able inner minister at Hangu Pass;",
  "s0260": "Not great king worthy sage, none able noble minister.",
  "s0261": "Now minister office to chancellor, rank in lie hou, Wang Ji office still stop at ye zhe, not his inner minister intent.'",
  "s0262": "Zhao Wang summoned Wang Ji, appointed Hedong guard, three years not submit accounts.",
  "s0263": "Again entrusted Zheng Anping, Zhao Wang considered general.",
  "s0264": "Fan Sui then scattered family wealth goods, all with repay once distressed him.",
  "s0265": "One meal virtue certainly repay, glare enmity certainly report.",
  "s0266": "Fan Sui chancellor Qin two years, Qin Zhao Wang forty two year, east attacked Han Shao Qu, Gao Ping, captured.",
  "s0267": "Qin Zhao Wang heard Wei Qi at Ping Yuan Jun place, wished for Fan Sui certainly avenge enmity, then detailed as good letter sent Ping Yuan Jun said;",
  "s0268": "'Guaren heard jun high righteousness, wish with jun as commoner friend, jun fortunately pass Guaren, Guaren wish with jun ten day drink.'",
  "s0269": "Ping Yuan Jun feared Qin, moreover considered yes, entered Qin saw Zhao Wang.",
  "s0270": "Zhao Wang with Ping Yuan Jun drank several days, Zhao Wang told Ping Yuan Jun: 'Former Zhou Wen Wang got Lu Shang as Tai Gong, Qi Huan Gong got Guan Yi Wu as Zhong Fu, now Fan Jun also Guaren uncle father.",
  "s0271": "Fan Jun enmity at jun house, wish make people return take head come;",
  "s0272": "Not, I not out jun at pass.'",
  "s0273": "Ping Yuan Jun said: 'Noble then become friend, for base;",
  "s0274": "Rich then become friend, for poor.",
  "s0275": "Wei Qi, Sheng friend, at, certainly not out, now again not at minister place.'",
  "s0276": "Zhao Wang then sent Zhao Wang letter: 'King younger brother at Qin, Fan Jun enmity Wei Qi at Ping Yuan Jun house.",
  "s0277": "King make people urgently hold head come;",
  "s0278": "Not, I raise troops attack Zhao, again not out king younger brother at pass.'",
  "s0279": "Zhao Xiao Cheng Wang then sent troops surrounded Ping Yuan Jun house, urgent, Wei Qi night fled out, saw Zhao chancellor Yu Qing.",
  "s0280": "Yu Qing measured Zhao Wang finally not can persuade, then untied chancellor seal, with Wei Qi fled, hidden walk, thought various lords none can urgent reach, then again ran Daliang, wished because Xinling Jun flee Chu.",
  "s0281": "Xinling Jun heard, feared Qin, hesitated not willing see, said: 'Yu Qing what like person?'",
  "s0282": "At time Hou Ying at side, said: 'Person certainly not easy know, know person also not easy.",
  "s0283": "Yu Qing stepped shoes eaves hat, one see Zhao Wang, granted white jade one pair, yellow gold hundred yi;",
  "s0284": "Two see, appointed upper minister;",
  "s0285": "Three see, finally received chancellor seal, sealed ten thousand household hou.",
  "s0286": "At this time, world contended know him.",
  "s0287": "Wei Qi poor distressed passed Yu Qing, Yu Qing dared not heavy rank salary honor, untied chancellor seal, abandoned ten thousand household hou hidden walk.",
  "s0288": "Urgent scholar poor returned crown prince, crown prince said 'what like person'.",
  "s0289": "Person certainly not easy know, know person also not easy!'",
  "s0290": "Xinling Jun greatly ashamed, drove like wild welcomed him.",
  "s0291": "Wei Qi heard Xinling Jun initial difficult see him, angered self cut throat.",
  "s0292": "Zhao Wang heard, finally took head gave Qin.",
  "s0293": "Qin Zhao Wang then out Ping Yuan Jun returned Zhao.",
  "s0294": "Zhao Wang forty three year, Qin attacked Han Fen Xing, captured, because walled river upper Guang Wu.",
  "s0295": "Later five years, Zhao Wang used Ying Hou plan, released rebel spies sold Zhao, Zhao because sent Ma Fu Zi replace Lian Po general.",
  "s0296": "Qin greatly broke Zhao at Chang Ping, then surrounded Handan.",
  "s0297": "Already with Wu An Jun Bai Qi had gap, spoke killed him.",
  "s0298": "Entrusted Zheng Anping, made attack Zhao.",
  "s0299": "Zheng Anping by Zhao surrounded, urgent, with troops twenty thousand surrendered Zhao.",
  "s0300": "Ying Hou straw mat begged crime."
}