{
  "s0001": "Yue Yi's ancestor was named Yue Yang.",
  "s0002": "Yue Yang served as general for Wei Marquis Wen, attacking and taking Zhongshan. Wei Marquis Wen enfeoffed Yue Yang with Lingshou.",
  "s0003": "Yue Yang died and was buried in Lingshou. His descendants settled there.",
  "s0004": "Zhongshan was restored as a state, then during Zhao King Wuling's time Zhongshan was destroyed again. The Yue clan later produced Yue Yi.",
  "s0005": "Yue Yi was worthy and fond of military affairs. Zhao recommended him.",
  "s0006": "When King Wuling had the Shagiu uprising, Yue Yi left Zhao and went to Wei.",
  "s0007": "He heard that Yan King Zhao, because of the defeat at Zishi where Qi greatly defeated Yan, harbored resentment toward Qi and never forgot revenge against Qi for a single day.",
  "s0008": "Yan was small and remote, lacking the strength to contend. Thus the king humbled himself and treated scholars with respect, first honoring Guo Wei to attract the worthy.",
  "s0009": "Yue Yi then served as Wei King Zhao's envoy to Yan. The Yan king treated him with guest courtesy.",
  "s0010": "Yue Yi declined modestly, then pledged loyalty as a minister. Yan King Zhao appointed him second minister. This continued for some time.",
  "s0011": "At this time, Qi King Min was strong. South he defeated Chu prime minister Tang Mai at Chongqiu, west he crushed the three Jin at Guanjin, then allied with the three Jin to attack Qin, helped Zhao destroy Zhongshan, broke Song, expanding territory over a thousand li.",
  "s0012": "He contended with Qin King Zhao to be emperor, but later abandoned it.",
  "s0013": "The feudal lords all wished to turn from Qin and submit to Qi.",
  "s0014": "King Min was arrogant. The people could not bear it.",
  "s0015": "Thus Yan King Zhao inquired about attacking Qi.",
  "s0016": "Yue Yi replied: 'Qi is the remaining enterprise of a hegemon state, with vast territory and large population—not easy to attack alone.",
  "s0017": "If Your Majesty wishes to attack it, nothing better than allying with Zhao and Chu, Wei.'",
  "s0018": "Thus he sent Yue Yi to make treaty with Zhao King Huiwen, separately sent envoys to connect with Chu and Wei, ordering Zhao to persuade Qin of the advantages of attacking Qi.",
  "s0019": "The feudal lords hated Qi King Min's arrogance and tyranny, all competed to form alliance with Yan to attack Qi.",
  "s0020": "Yue Yi returned and reported. Yan King Zhao mobilized all troops, making Yue Yi supreme general. Zhao King Huiwen granted Yue Yi the prime minister seal.",
  "s0021": "Yue Yi thus combined and commanded the troops of Zhao, Chu, Han, Wei, Yan to attack Qi, defeating them west of Ji.",
  "s0022": "The allied troops withdrew and returned, but Yan's army under Yue Yi alone pursued, reaching Linzi.",
  "s0023": "Qi King Min's defeat west of Ji caused him to flee and defend Ju.",
  "s0024": "Yue Yi alone remained to campaign in Qi. Qi all defended their cities.",
  "s0025": "Yue Yi attacked and entered Linzi, taking all Qi's treasures, valuables, and sacrificial vessels, transporting them to Yan.",
  "s0026": "Yan King Zhao was greatly pleased, personally came to Ji to reward the army, distribute rewards and feast the soldiers, enfeoffing Yue Yi at Changguo, titled Lord Changguo.",
  "s0027": "Thus Yan King Zhao took the Qi captives and spoils back, while ordering Yue Yi to again use troops to pacify the Qi cities that had not surrendered.",
  "s0028": "Yue Yi remained campaigning in Qi for five years, taking over seventy Qi cities, all made into commanderies and counties belonging to Yan. Only Ju and Jimu remained unsubdued.",
  "s0029": "Yan King Zhao died, his son ascended as Yan King Hui.",
  "s0030": "King Hui, when he was crown prince, had once been displeased with Yue Yi. Upon ascending, Qi's Tian Dan heard of this and spread false rumors in Yan: 'The Qi cities not fallen are only two.",
  "s0031": "Yet the reason they are not quickly taken is that Yue Yi has a rift with Yan's new king, wishing to join forces and remain in Qi, facing south to become king of Qi.",
  "s0032": "What Qi fears most is another general coming.'",
  "s0033": "Thus Yan King Hui was already suspicious of Yue Yi. Receiving Qi's false rumors, he sent Ji Jie to replace the general and summoned Yue Yi.",
  "s0034": "Yue Yi knew Yan King Hui did not properly replace him, feared execution, thus surrendered west to Zhao.",
  "s0035": "Zhao enfeoffed Yue Yi at Guanjin, titled Lord Wangzhu.",
  "s0036": "Zhao honored and favored Yue Yi to threaten Yan and Qi.",
  "s0037": "Later Qi's Tian Dan battled Ji Jie, indeed used deception to trick the Yan army, defeating Ji Jie below Jimu, then turned and fought, pursuing Yan north to the Yellow River, recovering all Qi cities, welcoming King Xiang at Ju, entering Linzi.",
  "s0038": "Yan King Hui later regretted replacing Yue Yi with Ji Jie, thus causing the army to break, generals lost, Qi lost.",
  "s0039": "He also resented Yue Yi's surrender to Zhao, fearing Zhao would use Yue Yi to take advantage of Yan's weakness to attack Yan.",
  "s0040": "Yan King Hui sent someone to reproach Yue Yi and apologize: 'The former king entrusted the entire state to the general. The general broke Qi for Yan, avenged the former king's grudge. The world all trembled. How dare I forget the general's merit for a single day!",
  "s0041": "The former king abandoned the ministers, I newly ascended. My attendants misled me.",
  "s0042": "My sending Ji Jie to replace the general was because the general had long been exposed abroad, thus summoning the general to rest and discuss plans.",
  "s0043": "The general misheard, thinking I had a rift with you, thus abandoning Yan for Zhao.",
  "s0044": "The general planning for himself is acceptable, but how do you repay the former king's treatment of the general?'",
  "s0045": "Yue Yi sent a letter in reply to Yan King Hui:",
  "s0046": "I am unworthy, could not follow Your Majesty's commands to comply with the attendants' wishes, fearing to harm the former king's wisdom and injure Your Majesty's righteousness, thus fled to Zhao.",
  "s0047": "Now Your Majesty sends people to enumerate my crimes. I fear the attendants do not examine the former king's reasons for raising and favoring me, nor understand my intentions in serving the former king, thus dare to reply in writing.",
  "s0048": "I have heard that worthy and sage lords do not favor relatives with stipends. Those with great merit they reward, those capable they place.",
  "s0049": "Therefore examining ability and granting office is a lord who achieves success.",
  "s0050": "Discussing conduct and forming friendships is a scholar who establishes reputation."
}

