{
  "s0001": "Su Qin was a man from Dong Zhou Luoyang.",
  "s0002": "In the east he served as student in Qi, and studied under Master Guigu.",
  "s0003": "After traveling out for several years, greatly impoverished he returned.",
  "s0004": "His brothers, sisters-in-law, wife and concubines all secretly laughed at him, saying: 'The Zhou people's custom is to manage property, apply effort to crafts and commerce, pursue profit twofold as the task.",
  "s0005": "Now you abandon the root and engage in speech, impoverished, is this not fitting!'",
  "s0006": "Su Qin hearing this felt ashamed, wounded himself, then closed his room and did not go out, brought out his books and comprehensively examined them.",
  "s0007": "Said: 'A scholar who has already bent head to receive books, yet cannot use them to obtain honor and glory, though many what use are they!'",
  "s0008": "Then obtained the Zhou Book Yin Talisman, lay prostrate and read it.",
  "s0009": "One year passed, then emerged to probe and ponder, said: 'This can persuade the rulers of the present age.'",
  "s0010": "Sought to persuade Zhou Xian Wang.",
  "s0011": "Zhou Xian Wang's attendants long familiar with Su Qin, all belittled him.",
  "s0012": "Did not trust him.",
  "s0013": "Then went west to Qin.",
  "s0014": "Qin Xiao Gong died.",
  "s0015": "Persuaded Hui Wang: 'Qin is a country of four natural barriers, backed by mountains fronting the Wei, east has the passes and Yellow River, west has Han Zhong, south has Ba Shu, north has Dai horses, this is a heavenly storehouse.",
  "s0016": "With Qin's multitude of scholars and people, instruction in military methods, can swallow the world, proclaim emperor and govern.'",
  "s0017": "Qin Wang said: 'Feathers and down not yet formed, cannot fly high;",
  "s0018": "Patterns and veins not yet clear, cannot annex others.'",
  "s0019": "Just then executing Shang Yang, hated debaters, did not employ him.",
  "s0020": "Then went east to Zhao.",
  "s0021": "Zhao Su Hou made his younger brother Cheng prime minister, titled Lord Fengyang.",
  "s0022": "Lord Fengyang did not approve of him.",
  "s0023": "Departed to travel Yan, more than a year then obtained audience.",
  "s0024": "Persuaded Yan Wen Hou: 'Yan east has Chaoxian, Liaodong, north has Lin Hu, Lou Fan, west has Yun Zhong, Jiu Yuan, south has Callery Pear, Yi Water, territory two thousand li square, armored troops several tens of thousands, chariots six hundred, cavalry six thousand horses, grain sufficient for several years.",
  "s0025": "South has Jie Shi, Yan Men wealth, north has date chestnut advantages, people though not plow and plant are sufficient with dates and chestnuts.",
  "s0026": "This is called a heavenly storehouse.",
  "s0027": "'Peace and joy without affairs, not seeing overturned armies killed generals, none surpass Yan.",
  "s0028": "Does great king know the reason?",
  "s0029": "The reason Yan does not suffer bandits don armor is because Zhao serves as screen to the south.",
  "s0030": "Qin Zhao five battles, Qin won twice but Zhao won three times.",
  "s0031": "Qin Zhao mutually exhausted, yet king with intact Yan controls their rear, this is why Yan does not suffer bandits.",
  "s0032": "Moreover when Qin attacks Yan, crosses Yun Zhong, Jiu Yuan, passes Dai, Shang Gu, traverses territory several thousand li, though obtains Yan cities, Qin plans certainly cannot hold them.",
  "s0033": "That Qin cannot harm Yan is clear.",
  "s0034": "Now when Zhao attacks Yan, issues command gives order, not reaching ten days several tens of thousands army camps at Dong Yuan.",
  "s0035": "Crosses Zhuodu, fords Yi Water, not reaching four five days reaches the national capital.",
  "s0036": "Therefore said Qin attacks Yan, battles at thousand li outside;",
  "s0037": "Zhao attacks Yan, battles within hundred li.",
  "s0038": "Not worrying about hundred li harm yet valuing thousand li outside, no plan surpasses this.",
  "s0039": "Therefore wish great king with Zhao form close alliance, world becomes one, then Yan state certainly without danger.'",
  "s0041": "Wen Hou said: 'Your words are acceptable, however my state is small, west pressed by strong Zhao, south near Qi, Qi Zhao are strong states.",
  "s0042": "You must wish to combine vertically to secure Yan, I request with state to follow.'",
  "s0044": "Then provided Su Qin chariots horses gold silk to go to Zhao.",
  "s0045": "Lord Fengyang already dead, immediately took advantage to persuade Zhao Su Hou: 'World officials ministers and common scholars, all esteem your lordship's conduct and righteousness, all wish to offer teachings demonstrate loyalty before you for a long time.",
  "s0046": "Although this, Lord Fengyang and your lordship not handle affairs, therefore guest officials wandering scholars none dared exhaust themselves before you.",
  "s0047": "Now Lord Fengyang passed away, your lordship now again draws close to scholars and people, minister therefore dares advance his foolish thoughts.",
  "s0048": "'Secretly for your lordship planning, none better than pacify people without affairs, moreover no need trouble affairs with people.",
  "s0049": "Pacifying people's foundation lies in choosing alliances, choosing alliances correctly then people secure, choosing alliances incorrectly then people lifelong insecure.",
  "s0050": "Permit me to speak of external dangers: Qi and Qin as two enemies people cannot be secure, rely on Qin attack Qi people cannot be secure, rely on Qi attack Qin people cannot be secure.'",
  "s0051": "Therefore plotting against others rulers, attacking others countries, always suffer from issuing words breaking others alliances.",
  "s0052": "Wish your lordship be careful not to let it emerge from mouth.",
  "s0053": "Permit me to distinguish black and white, only yin and yang.",
  "s0054": "Your lordship truly can listen to minister, Yan must send felt fur dog horse lands, Qi must send fish salt seas, Chu must send orange pomelo gardens, Han Wei Zhong Shan all can be made to send hot water offerings, noble relatives fathers elder brothers all can receive enfeoffed marquises.",
  "s0055": "Dividing land wrapping benefits, five hegemons therefore overturned armies captured generals to seek them;",
  "s0056": "Enfeoffing marquises honoring relatives, Tang Wu therefore exiled killed to contend for them.",
  "s0057": "Now your lordship with folded arms has both, this is minister reason for wishing for your lordship.",
  "s0058": "Now great king allies with Qin, then Qin certainly weakens Han Wei;",
  "s0059": "Allies with Qi, then Qi certainly weakens Chu Wei.",
  "s0060": "Wei weakens then cedes beyond Yellow River, Han weakens then surrenders Yi Yang, Yi Yang surrenders then Shang Commandery cut off, beyond Yellow River cedes then roads not pass, Chu weakens then no aid.",
  "s0061": "These three strategies, cannot not carefully calculate.",
  "s0062": "When Qin descends Zhi Road, then Nanyang endangered;",
  "s0063": "Coerces Han surrounds Zhou, then Zhao clan personally handles troops;",
  "s0064": "Occupies Wei takes Juan, then Qi must enter court Qin.",
  "s0065": "Qin desires to obtain Shandong, then must raise troops toward Zhao.",
  "s0066": "Qin armor crosses Yellow River surpasses Zhang, occupies Fan Wu, then troops must battle below Handan.",
  "s0067": "This minister reason for worrying for your lordship.",
  "s0068": "At present time, Shandong established states none stronger than Zhao.",
  "s0069": "Zhao territory two thousand li square, armored troops several tens of thousands, chariots thousand, cavalry ten thousand horses, grain sufficient several years.",
  "s0070": "West has Chang Mountain, south has Yellow River Zhang, east has Qing River, north has Yan state.",
  "s0071": "Yan certainly weak state, not worth fearing.",
  "s0072": "Qin harm to world none like Zhao, yet Qin dares not raise troops attack Zhao, why?",
  "s0073": "Fears Han Wei discussing their rear.",
  "s0074": "Then Han Wei are Zhao southern screen.",
  "s0075": "Qin attacks Han Wei, no famous mountains great rivers limit, gradually nibbling them, approaching national capitals then stops.",
  "s0076": "Han Wei cannot withstand Qin, must enter as ministers to Qin.",
  "s0077": "Qin without Han Wei monitoring, calamity must hit Zhao.",
  "s0078": "This minister reason for worrying for your lordship.",
  "s0079": "Minister heard Yao without three men portion, Shun without foot inch land, to have world;",
  "s0080": "Yu without hundred men gathering, to king feudal lords;",
  "s0081": "Tang Wu soldiers not exceeding three thousand, chariots not exceeding three hundred, troops not exceeding thirty thousand, established as Son of Heaven: truly obtained their way.",
  "s0082": "Therefore enlightened rulers externally measure enemy strength weakness, internally assess their soldiers worthy unworthy, not waiting for two armies to confront the victory defeat survival extinction mechanisms already formed in chest, how can they be obscured by crowd words and decide affairs in darkness!",
  "s0083": "Minister secretly with world land maps examines it, feudal lords land five times Qin, estimate feudal lords troops ten times Qin, six states become one, combine strength west face attack Qin, Qin must break.",
  "s0084": "Now west face serve them, see ministers in Qin.",
  "s0085": "Breaking others versus being broken by others, ministering others versus being ministered by others, how can be discussed same day!",
  "s0086": "Those balancing people, all desire divide feudal lords land to give Qin.",
  "s0087": "Qin succeeds, then high towers terraces, beautiful palaces, listen to reed flute zither sounds, front has tower gates carriages, rear has tall beauties, state suffers Qin calamity without sharing their worry.",
  "s0088": "Therefore balancing people day night strive with Qin authority frighten threaten feudal lords to seek cede land, therefore wish great king carefully calculate it.",
  "s0089": "Minister heard enlightened rulers cut off doubts remove slanderers, block rumors tracks, close faction doors, therefore honorable lord broaden land strengthen troops plans minister can demonstrate loyalty before.",
  "s0090": "Therefore secretly for great king planning, none better than unite Han Wei Qi Chu Yan Zhao to form close alliance, to rebel against Qin.",
  "s0091": "Order world generals ministers meet above Huan Water, exchange hostages, cut white horse make covenant.",
  "s0092": "Pact says: Qin attacks Chu, Qi Wei each send sharp troops to aid it, Han cut its grain roads, Zhao ford Yellow River Zhang, Yan guard Chang Mountain north.",
  "s0093": "Qin attacks Han Wei, then Chu cut its rear, Qi send sharp troops aid it, Zhao ford Yellow River Zhang, Yan guard Yun Zhong.",
  "s0094": "Qin attacks Qi, then Chu cut its rear, Han guard Cheng Gao, Wei block its roads, Zhao ford Yellow River Zhang Bo Pass, Yan send sharp troops aid it.",
  "s0095": "Qin attacks Yan, then Zhao guard Chang Mountain, Chu army Wu Pass, Qi ford Bo Sea, Han Wei all send sharp troops aid it.",
  "s0096": "Qin attacks Zhao, then Han army Yi Yang, Chu army Wu Pass, Wei army beyond Yellow River, Qi ford Qing River, Yan send sharp troops aid it.",
  "s0097": "Feudal lords have not following pact, with five states troops together attack them.",
  "s0098": "Six states form close alliance to oppose Qin, then Qin armor certainly dares not emerge from Hangu to harm Shandong.",
  "s0099": "Like this, then hegemon king enterprise completed.",
  "s0101": "Zhao Wang said: \"I am young, established state not long, never heard state long plans.",
  "s0102": "Now honored guest has intention preserve world, secure feudal lords I respectfully with state follow.\"",
  "s0103": "Then adorned chariots hundred, gold thousand yi, white jade hundred pairs, brocade thousand bolts, to make pact with feudal lords.",
  "s0104": "At this time Zhou Son of Heaven sent Wen Wu sacrificial meat to Qin Hui Wang.",
  "s0105": "Hui Wang made Xi Shou attack Wei, captured general Long Jia, took Wei carving Yin, moreover wished east troops.",
  "s0106": "Su Qin feared Qin troops coming to Zhao, then provoked angered Zhang Yi, entered him into Qin.",
  "s0107": "Then persuaded Han Xuan Wang: \"Han north has Gong, Cheng Gao stronghold, west has Yi Yang, Shang Ban pass, east has Wan, Rang, Wei Water, south has Xiong Mountain, territory nine hundred li square, armored troops several tens of thousands, world strong bows stout crossbows all from Han out.",
  "s0108": "Xi Zi, Shao Fu timely strength, Ju Lai, all shoot six hundred paces outside.",
  "s0109": "Han troops extraordinary feet shoot, hundred shots not pause stop, far ones arrows cover pierce chest, near ones arrowheads hit heart.",
  "s0110": "Han troops swords halberds all from Ming Mountain, Tang Xi, Mo Yang, He Cun, Deng Shi, Wan Ping, Long Yuan, Tai E, all land cut cow horse, water sever swans geese, facing enemy then chop firm armor iron screens, leather pull overturn horses, nothing not completely prepared.",
  "s0111": "With Han troops courage, don firm armor, step stout crossbows, belt sharp swords, one man against hundred, not worth mentioning.",
  "s0112": "Using Han strength with great king wisdom, west face serve Qin, cross arms submit, shame state become world laughingstock, none greater than this.",
  "s0113": "Therefore wish great king carefully calculate it.",
  "s0114": "\"Great king serves Qin, Qin certainly seeks Yi Yang, Cheng Gao.",
  "s0115": "This year cede them, next year again seek divide land.",
  "s0116": "Give then no land to supply, not give then abandon previous merit receive later calamity.",
  "s0117": "Moreover great king land has limit but Qin seeking has no end, with limited land oppose endless seeking, this called buying resentment tying calamity, not battle yet land already reduced.",
  "s0118": "Minister heard proverb: Better chicken mouth than cow rear.",
  "s0119": "Now west face cross arms minister serve Qin, how different from cow rear?",
  "s0120": "Using great king wisdom, grasp strong Han troops, have cow rear name, minister secretly ashamed for great king.\"",
  "s0122": "Then Han Wang suddenly changed color, rolled sleeves glared eyes, pressed sword faced heaven sighed;",
  "s0123": "\"I though unworthy, certainly cannot serve Qin.",
  "s0124": "Now master jun summons with Zhao Wang teaching, respectfully offer state to follow.\"",
  "s0126": "Again persuaded Wei Xiang Wang: \"Great king land, south has Hong Gou, Chen, Ru Nan, Xu, Yan, Kun Yang, Zhao Ling, Wu Yang, Xin Du, Xin Ju, east has Huai, Ying, Zhu Zao, Wu Xu, west has Great Wall bounds, north has beyond Yellow River, Juan, Yan, Suan Zao, territory thousand li.",
  "s0127": "Land name though small, however farm houses cottages number, never lack fodder pasturage.",
  "s0128": "People multitude, chariots horses many, day night travel not stop, rumbling prosperous, as if three armies multitude.",
  "s0129": "Minister secretly measure great king state not below Chu.",
  "s0130": "Yet balancers frighten wang ally strong tiger wolf Qin to invade world, finally have Qin calamity, not consider their disaster.",
  "s0131": "Grasping strong Qin power internally coerce their lord, crime none greater.",
  "s0132": "Wei, world strong state;",
  "s0133": "Wang, world worthy wang.",
  "s0134": "Now have intention west face serve Qin, call eastern fief, build emperor palace, receive hat belt, sacrifice spring autumn, minister secretly ashamed for great king.",
  "s0135": "\"Minister heard Yue Wang Gou Jian battle exhausted troops three thousand, captured Fu Chai at Gan Sui;",
  "s0136": "Wu Wang troops three thousand, leather chariots three hundred, controlled Zhou at Mu Ye: was it their soldiers many? Truly could exert their awe.",
  "s0137": "Now secretly hear great king troops, martial soldiers twenty thousand, blue heads twenty thousand, aroused strike twenty thousand, servants ten thousand, chariots six hundred, cavalry five thousand horses.",
  "s0138": "This surpasses Yue Wang Gou Jian, Wu Wang far, now listen to ministers words desire minister serve Qin.",
  "s0139": "Serve Qin must divide land cede proof, therefore troops not used yet state already deficient.",
  "s0140": "All ministers words serve Qin, all traitors, not loyal ministers.",
  "s0141": "Being minister, divide their lord land seek foreign alliance, steal take momentary merit not consider after, break public family establish private gate, externally grasp strong Qin power internally coerce their lord, seek divide land, wish great king carefully examine.",
  "s0142": "\"Zhou Book says: Continuous not break, creeping what to do?",
  "s0143": "Brambles not cut, will use axe handle.",
  "s0144": "Forward consideration not decided, after have great calamity, what to do?",
  "s0145": "Great king truly can listen minister, six states form close alliance, devoted together unite intention, then certainly no strong Qin calamity.",
  "s0146": "Therefore humble city Zhao Wang makes minister present foolish plan, offer clear pact, at great king command command it.\"",
  "s0148": "Wei Wang said: \"I unworthy, never obtained clear teaching.",
  "s0149": "Now master jun with Zhao Wang command commands it, respectfully with state follow.\"",
  "s0151": "Then east persuaded Qi Xuan Wang: Qi south has Tai Mountain, east has Langya, west has Qing River, north has Bo Sea, called four barrier country.",
  "s0152": "Qi territory two thousand li square, armored troops several tens of thousands, grain like hill mountains.",
  "s0153": "Three armies excellent, five families troops, advance like sharp arrow, battle like thunder, disperse like wind rain.",
  "s0154": "Even have military service, never double Tai Mountain, cross Qing River, ford Bo Sea.",
  "s0155": "Linzi midst seven thousand households, minister secretly estimates, not below three men per household, three seven twenty one thousand, not need mobilize from distant counties, Linzi troops already twenty one thousand.",
  "s0156": "Linzi very rich substantial, its people none not blow reed flute drum se, pluck qin strike zhu, cockfight dog racing, liubo kickball.",
  "s0157": "Linzi roads, chariot hubs strike, people shoulders rub, connected hems form curtain, raise sleeves form tent, wave sweat form rain, families prosperous people full, ambitions high spirits proud.",
  "s0158": "Using great king wisdom with Qi strength, world none can match.",
  "s0159": "Now west face serve Qin, minister secretly ashamed for great king.",
  "s0160": "Moreover Han Wei reason heavily fear Qin, because border Qin territory.",
  "s0161": "Troops emerge confront, not ten days victory defeat survival extinction decided.",
  "s0162": "Han Wei battle win Qin, then troops half destroyed, four borders not defended;",
  "s0163": "Battle not win, then state already dangerous extinction follows.",
  "s0164": "Therefore Han Wei heavily battle Qin, lightly become ministers.",
  "s0165": "Now Qin attack Qi then not so.",
  "s0166": "Doubled Han Wei land, pass Wei Yang Jin road, through Kang Fu danger, chariots cannot parallel tracks, cavalry cannot side by side, hundred men guard danger, thousand dare not pass.",
  "s0167": "Qin though wish deep enter, then wolf look back, fear Han Wei discuss rear.",
  "s0168": "Therefore frightened doubtful empty threat, arrogant not dare advance, then Qin cannot harm Qi also clear.",
  "s0169": "Not deeply calculate Qin what to do Qi, desire west face serve it, this ministers plan wrong.",
  "s0170": "Now no minister serve Qin name have strong state reality, minister therefore wish great king little attention calculate it.",
  "s0172": "Qi Wang said: I not intelligent, remote defend sea, poor road east border country, never obtained remaining teaching.",
  "s0173": "Now your excellency with Zhao Wang command commands it, respectfully with state follow.",
  "s0175": "Then southwest persuaded Chu Wei Wang: Chu, world strong state;",
  "s0176": "Wang, world worthy wang.",
  "s0177": "West has Qian Zhong, Wu commandery, east has Xia Zhou, Hai Yang, south has Dong Ting, Cang Wu, north has Xiong pass, Xun Yang, territory five thousand li square, armored hundred thousand, chariots thousand, cavalry ten thousand horses, grain sufficient ten years.",
  "s0178": "This hegemon wang resources.",
  "s0179": "Using Chu strength with wang wisdom, world none can match.",
  "s0180": "Now desire west face serve Qin, then feudal lords none not west face court at Zhang Tai below.",
  "s0181": "Qin harmed none like Chu, Chu strong then Qin weak, Qin strong then Chu weak, their power not coexist.",
  "s0182": "Therefore for great wang planning, none better than form close alliance isolate Qin.",
  "s0183": "Great wang not form close alliance, Qin certainly raise two armies, one army emerge Wu Pass, one army descend Qian Zhong, then Yan Ying move.",
  "s0184": "Minister heard govern when not yet chaotic, prepare when not yet have.",
  "s0185": "Calamity arrive then worry, then no time.",
  "s0186": "Therefore wish great wang early carefully calculate.",
  "s0187": "Great wang truly can listen minister, minister please make Shandong states offer four seasons tribute, to receive great wang clear command, entrust state altars, maintain ancestral temples, train soldiers temper troops, at great wang use them.",
  "s0188": "Great wang truly can use minister foolish plan, then Han Wei Qi Yan Zhao Wei wonderful music beauties must fill rear palace, Yan Dai camels good horses must fill outer stables.",
  "s0189": "Therefore alliance then Chu wang, balance succeed then Qin emperor.",
  "s0190": "Now abandon hegemon wang enterprise, have serve people name, minister secretly not take for great wang.",
  "s0191": "Qin, tiger wolf state, has swallow world heart.",
  "s0192": "Qin, world enemy.",
  "s0193": "Balancers all desire divide feudal lords land serve Qin, this called nourish enemy serve foe.",
  "s0194": "Being minister, divide their lord land external ally strong tiger wolf Qin, invade world, finally have Qin calamity, not consider disaster.",
  "s0195": "Externally grasp strong Qin awe internally coerce lord, seek divide land, great rebellion not loyal, none greater.",
  "s0196": "Therefore alliance then feudal lords divide land serve Chu, balance unite then Chu divide land serve Qin, these two strategies far apart, two which great wang choose?",
  "s0197": "Therefore humble city Zhao Wang makes minister present foolish plan, offer clear pact, at great wang command.",
  "s0199": "Chu Wang said: My state west borders Qin, Qin has raise Ba Shu annex Han Zhong heart.",
  "s0200": "Qin, tiger wolf state, cannot befriend.",
  "s0201": "Han Wei pressed by Qin calamity, cannot deep plan with, deep plan fear rebel people enter Qin, therefore plan not issue yet state already dangerous.",
  "s0202": "I self calculate with Chu match Qin, not see victory;",
  "s0203": "Internal with ministers plan, not sufficient rely.",
  "s0204": "I lie not peaceful mat, eat not sweet taste, heart shake shake like hanging banner without end settle.",
  "s0205": "Now master jun wish unite world, gather feudal lords, preserve dangerous state, I respectfully offer state to follow.",
  "s0207": "Then six states form alliance unite strength.",
  "s0208": "Su Qin as alliance pact chief, concurrently chancellor six states.",
  "s0209": "North report Zhao wang, then pass Luoyang, chariots cavalry baggage, feudal lords each send envoys send very many, suspect like wang.",
  "s0210": "Zhou Xian Wang heard fear, clear road, send person suburban welcome.",
  "s0211": "Su Qin brothers wife sisters-in-law sidelong eyes dare not look up, bow serve take food.",
  "s0212": "Su Qin laugh tell his sister-in-law: What before arrogant after respectful?",
  "s0213": "Sister-in-law crawl kneel, with face cover ground apologize: See Ji Zi position high gold many.",
  "s0214": "Su Qin sigh: This one person body, rich noble then relatives fear it, poor humble then despise it, moreover crowd!",
  "s0215": "Moreover make I have Luoyang suburb field two qing, I how can wear six states chancellor seal!",
  "s0216": "Then scatter thousand jin reward clan relatives friends.",
  "s0217": "Initially, Su Qin go Yan, borrow person hundred cash as capital, then obtain rich noble, with hundred jin repay.",
  "s0218": "Comprehensively repay all once seen kindness.",
  "s0219": "His followers have one person alone not get repay, then advance self speak.",
  "s0220": "Su Qin said: I not forget you.",
  "s0221": "You with I go Yan, again three wish leave I Yi Water above, just that time, I distressed, therefore hope you deep, is therefore late you.",
  "s0222": "You now also obtain.",
  "s0224": "Su Qin already pact six states form alliance, return Zhao, Zhao Su Hou enfeoff as Wu An Jun, then throw alliance pact book at Qin.",
  "s0225": "Qin troops dare not spy Hangu Pass fifteen years.",
  "s0226": "Afterward Qin make Xi Shou deceive Qi Wei, with together attack Zhao, wish break alliance pact.",
  "s0227": "Qi Wei attack Zhao, Zhao Wang blame Su Qin.",
  "s0228": "Su Qin fear, request envoy Yan, must repay Qi.",
  "s0229": "Su Qin leave Zhao alliance all dissolve.",
  "s0230": "Qin Hui Wang with his daughter as Yan crown prince wife.",
  "s0231": "This year, Wen Hou die, crown prince establish, this Yan Yi Wang.",
  "s0232": "Yi Wang initial establish, Qi Xuan Wang take advantage Yan mourning attack Yan, take ten cities.",
  "s0233": "Yi Wang tell Su Qin: Former day mister to Yan, former wang fund mister see Zhao, then pact six states alliance.",
  "s0234": "Now Qi first attack Zhao, next to Yan, because mister reason become world laugh, mister can for Yan obtain invaded land?",
  "s0235": "Su Qin greatly ashamed, said: Please for wang take it.",
  "s0237": "Su Qin see Qi Wang, twice bow, bend celebrate, raise condole.",
  "s0238": "Qi Wang said: This what celebrate condole follow so quick?",
  "s0239": "Su Qin said: Subject heard hungry person so hungry not eat crow beak, because fill stomach but with starve die same calamity.",
  "s0240": "Now Yan though weak small, is Qin Wang young son-in-law.",
  "s0241": "Great wang profit its ten cities long with strong Qin enemy.",
  "s0242": "Now make weak Yan as goose row strong Qin exhaust its rear, to attract world elite troops, this eat crow beak class.",
  "s0243": "Qi Wang worried change color: Then what to do?",
  "s0244": "Su Qin said: Subject heard ancient good control affairs, turn calamity to fortune, because defeat become merit.",
  "s0245": "Great wang truly can listen minister plan, then return Yan ten cities.",
  "s0246": "Yan without reason obtain ten cities, certainly happy;",
  "s0247": "Qin Wang know with self reason return Yan ten cities, also certainly happy.",
  "s0248": "This called abandon enemy obtain stone friendship.",
  "s0249": "Yan Qin both serve Qi, then great wang command world, none dare not listen.",
  "s0250": "This wang with empty words attach Qin, with ten cities take world.",
  "s0251": "This hegemon wang enterprise.",
  "s0252": "Wang said: Good.",
  "s0253": "Then return Yan ten cities.",
  "s0254": "Person have slander Su Qin: Left right sell country treacherous minister, will make rebellion.",
  "s0255": "Su Qin fear get crime return, Yan Wang not restore office.",
  "s0256": "Su Qin see Yan Wang said: Subject, Dong Zhou lowly person, no inch merit, wang personally bow at temple ritual at court.",
  "s0257": "Now subject for wang repel Qi troops obtain ten cities, should increase close.",
  "s0258": "Now come wang not office subject, person must have use disbelief injure subject to wang.",
  "s0259": "Subject disbelief, wang blessing.",
  "s0260": "Subject heard loyal faithful, so self do;",
  "s0261": "Advance take, so for others.",
  "s0262": "Moreover subject advise Qi Wang, ever not deceive it.",
  "s0263": "Subject abandon old mother Dong Zhou, certainly go self do advance take.",
  "s0264": "Now have filial like Zeng Shen, clean like Bo Yi, faithful like Wei Sheng.",
  "s0265": "Obtain these three to serve great wang, how?",
  "s0266": "Wang said: Sufficient.",
  "s0267": "Su Qin said: Filial like Zeng Shen, righteousness not leave relatives one night outside, wang again how make step walk thousand li serve weak Yan danger wang?",
  "s0268": "Clean like Bo Yi, righteousness not for Gu Zhu jun heir, not willing Wu Wang minister, not accept enfeoff marquise starve die Shou Yang mountain.",
  "s0269": "Have clean thus, wang again how make step walk thousand li advance take Qi?",
  "s0270": "Faithful like Wei Sheng, with woman period at bridge, woman not come, water arrive not go, embrace pillar die.",
  "s0271": "Have faithful thus, wang again how make step walk thousand li repel Qi strong troops?",
  "s0272": "Subject called with loyal faithful get crime from above.",
  "s0273": "Yan Wang said: If not loyal faithful, how have with loyal faithful get crime?",
  "s0274": "Su Qin said: Not so.",
  "s0275": "Subject heard guest far become official his wife private with person, his husband will come, private fear, wife said no worry, I already make poison wine await.",
  "s0276": "After three days, husband indeed come, wife make concubine raise poison wine advance.",
  "s0277": "Concubine wish speak wine have poison, then fear expel main mother, wish not speak, then fear kill main father.",
  "s0278": "Then feign stiff abandon wine.",
  "s0279": "Main father greatly angry, cane fifty.",
  "s0280": "Therefore concubine one stiff abandon wine, above preserve main father, below preserve main mother, yet not avoid cane, where in loyal faithful no crime?",
  "s0281": "Subject error, unfortunate similar this!",
  "s0282": "Yan Wang said: Mister again take old office.",
  "s0283": "Increase thick treat.",
  "s0284": "Yi Wang mother, Wen Hou consort, with Su Qin private connect.",
  "s0285": "Yan Wang know, yet affairs increase thick.",
  "s0286": "Su Qin fear execute, then advise Yan Wang: Subject dwell Yan cannot make Yan heavy, in Qi then Yan certainly heavy.",
  "s0287": "Yan Wang said: Only mister do.",
  "s0288": "Then Su Qin feign get crime Yan flee go Qi, Qi Xuan Wang as guest qing.",
  "s0289": "Qi Xuan Wang die, Min Wang establish, advise Min Wang thick burial show filial, high palaces great parks show get intention, wish break exhaust Qi become Yan.",
  "s0290": "Yan Yi Wang die, Yan Kuai establish wang.",
  "s0291": "Afterward Qi grand masters many with Su Qin contend favor, make person stab Su Qin, not die, wound flee.",
  "s0292": "Qi Wang make person seek assassin, not obtain.",
  "s0293": "Su Qin about die, then tell Qi Wang: Subject die, cart tear subject parade market, say Su Qin for Yan make rebellion Qi, like this subject assassin certainly obtain.",
  "s0294": "Then like his words, kill Su Qin self come out, Qi Wang then execute.",
  "s0295": "Yan heard: Extreme, Qi for Su avenge!",
  "s0297": "Su Qin already die, his affairs greatly leak.",
  "s0298": "Qi afterward hear, then hate angry Yan.",
  "s0299": "Yan very fear.",
  "s0300": "Su Qin brother called Dai, Dai brother Su Li, see brother success, also all study.",
  "s0301": "Su Qin die, Dai then seek see Yan Wang, wish continue old affair.",
  "s0302": "Said: Subject, Dong Zhou lowly person.",
  "s0303": "Secret hear great wang righteousness very high, lowly person not intelligent, abandon hoe sickle dry great wang.",
  "s0304": "To Handan, seen inferior to heard Dong Zhou, subject secretly bear his ambition.",
  "s0305": "To Yan court, observe wang ministers officials, wang, world bright wang.",
  "s0306": "Yan Wang said: You called bright wang what like?",
  "s0307": "Reply: Subject heard bright wang strive hear his error, not wish hear his good, subject please report wang error.",
  "s0308": "Qi Zhao, Yan enemy;",
  "s0309": "Chu Wei, Yan aid state.",
  "s0310": "Now wang serve enemy attack aid state, not so benefit Yan.",
  "s0311": "Wang self consider, this plan error, no to hear, not loyal minister.",
  "s0312": "Wang said: Qi certainly my enemy, desire attack, only suffer state depleted strength insufficient.",
  "s0313": "You can with Yan attack Qi, I whole state entrust you.",
  "s0314": "Reply: All world battle states seven, Yan dwell weak.",
  "s0315": "Alone battle cannot, have attach then none not heavy.",
  "s0316": "South attach Chu, Chu heavy;",
  "s0317": "West attach Qin, Qin heavy;",
  "s0318": "Middle attach Han Wei, Han Wei heavy.",
  "s0319": "Moreover if attach state heavy, this certainly make wang heavy.",
  "s0320": "Now Qi, long jun self use.",
  "s0321": "South attack Chu five years, stores exhaust;",
  "s0322": "West exhaust Qin three years, soldiers tired depleted;",
  "s0323": "North with Yan battle, overturn three armies, obtain two generals.",
  "s0324": "Yet with remaining troops south face raise five thousand chariots great Song, surround twelve feudal lords.",
  "s0325": "This its jun desire obtain, its people strength exhaust, evil sufficient take?",
  "s0326": "Moreover subject heard, frequent battle then people labor, long campaign then troops depleted.",
  "s0327": "Yan Wang said: I heard Qi have Qing Ji, Zhu He can be solid, Great Wall, Ju Fang sufficient be barrier, truly have?",
  "s0328": "Reply: Heaven time not help, though have Qing Ji, Zhu He, evil sufficient be solid!",
  "s0329": "People strength tired depleted, though have Great Wall, Ju Fang, evil sufficient be barrier!",
  "s0330": "Moreover different day Ji West not campaign, so prepare Zhao;",
  "s0331": "Hebei not campaign, so prepare Yan.",
  "s0332": "Now Ji West Hebei all already service, within borders depleted.",
  "s0333": "Arrogant jun certainly good profit, perish state minister certainly greedy wealth.",
  "s0334": "Wang truly can no shame take mother younger brother as hostage, treasure pearl jade silk serve left right, they will have virtue Yan light perish Song, then Qi can perish already.",
  "s0335": "Yan Wang said: I finally with you receive command heaven.",
  "s0336": "Yan then make one son hostage Qi.",
  "s0337": "Su Li because Yan hostage son seek see Qi Wang.",
  "s0338": "Qi Wang resent Su Qin, wish imprison Su Li.",
  "s0339": "Yan hostage son apologize, already then submit hostage become Qi minister.",
  "s0340": "Yan chancellor Zi Zhi with Su Dai marriage, wish obtain Yan power, then make Su Dai attend hostage Qi.",
  "s0341": "Qi make Dai report Yan, Yan Wang Kuai ask: Qi Wang its hegemon?",
  "s0342": "Said: Cannot.",
  "s0343": "Said: Why?",
  "s0344": "Said: Not trust his ministers.",
  "s0345": "Then Yan Wang special employ Zi Zhi, afterward yield position, Yan great chaos.",
  "s0346": "Qi attack Yan, kill Wang Kuai, Zi Zhi.",
  "s0347": "Yan establish Zhao Wang, Su Dai, Su Li then dare not enter Yan, all finally return Qi, Qi good treat.",
  "s0348": "Su Dai pass Wei, Wei for Yan arrest Dai.",
  "s0349": "Qi make person tell Wei Wang: Qi please with Song land enfeoff Jing Yang Jun, Qin certainly not accept.",
  "s0350": "Qin not disadvantage have Qi obtain Song land, not trust Qi Wang with Su Zi.",
  "s0351": "Now Qi Wei not harmonious so extreme, then Qi not deceive Qin.",
  "s0352": "Qin trust Qi, Qi Qin unite, Jing Yang Jun have Song land, not Wei benefit.",
  "s0353": "Therefore wang better east Su Zi, Qin certainly suspect Qi not trust Su Zi.",
  "s0354": "Qi Qin not unite, world no change, attack Qi form completed.",
  "s0355": "Then release Su Dai.",
  "s0356": "Dai to Song, Song good treat.",
  "s0357": "Qi attack Song, Song urgent, Su Dai then send Yan Zhao Wang book:",
  "s0358": "Listed in ten thousand chariots send hostage Qi, name low power light;",
  "s0359": "Support ten thousand chariots aid Qi attack Song, people labor substance cost;",
  "s0360": "Break Song, damage Chu Huai North, fatten great Qi, enemy strong state harm: these three all state great defeat.",
  "s0361": "Yet wang do, will take trust Qi.",
  "s0362": "Qi add not trust wang, jealous Yan more, this wang plan error.",
  "s0363": "Using Song add Huai North, strong ten thousand chariots state, Qi annex, this increase one Qi.",
  "s0364": "North Yi side seven hundred li, add Lu Wei, strong ten thousand chariots state, Qi annex, this increase two Qi.",
  "s0365": "One Qi strength, Yan still wolf look cannot withstand, now with three Qi face Yan, its calamity certainly great.",
  "s0366": "Although, wise raise affairs, because calamity fortune, turn defeat merit.",
  "s0367": "Qi purple, defeat plain, Jia ten times;",
  "s0368": "Yue Wang Gou Jian dwell Kui Ji, again damage strong Wu hegemon world: these all because calamity fortune, turn defeat merit.",
  "s0369": "Now wang if wish because calamity fortune, turn defeat merit, then none better provoke hegemon Qi honor it, make envoy alliance Zhou house, burn Qin tally, say its great upper plan, break Qin;",
  "s0370": "Next, must long guest it.",
  "s0371": "Qin grasp guest await break, Qin Wang certainly worry.",
  "s0372": "Qin five generations attack feudal lords, now for Qi below, Qin Wang ambition if obtain exhaust Qi, not fear with state merit.",
  "s0373": "Yet wang why not make eloquent speak with this words advise Qin Wang: Yan Zhao break Song fatten Qi, honor as below, Yan Zhao not profit.",
  "s0374": "Yan Zhao not profit yet power do, because not trust Qin Wang.",
  "s0375": "Yet wang why not make trustworthy receive Yan Zhao, make Jing Yang Jun, Gao Ling Jun first Yan Zhao?",
  "s0376": "Qin have change, because as hostage, then Yan Zhao trust Qin.",
  "s0377": "Qin emperor west, Yan emperor north, Zhao emperor middle, establish three emperors command world.",
  "s0378": "Han Wei not listen then Qin attack, Qi not listen then Yan Zhao attack, world who dare not listen?",
  "s0379": "World submit listen, because drive Han Wei attack Qi, say must return Song land, return Chu Huai North.",
  "s0380": "Return Song land, return Chu Huai North, Yan Zhao profit;",
  "s0381": "Together establish three emperors, Yan Zhao wish.",
  "s0382": "Reality obtain profit, honor obtain wish, Yan Zhao abandon Qi like cast shoe.",
  "s0383": "Now not collect Yan Zhao, Qi hegemon certainly complete.",
  "s0384": "Feudal lords assist Qi wang not follow, this state attack;",
  "s0385": "Feudal lords assist Qi wang follow, this name low.",
  "s0386": "Now collect Yan Zhao, state secure name honor;",
  "s0387": "Not collect Yan Zhao, state danger name low.",
  "s0388": "Abandon honor secure take danger low, wise not do.",
  "s0389": "Qin Wang hear such words, certainly like stab heart.",
  "s0390": "Then wang why not make eloquent with this such words advise Qin?",
  "s0391": "Qin certainly take, Qi certainly attack.",
  "s0392": "Take Qin, thick friendship;",
  "s0393": "Attack Qi, correct profit.",
  "s0394": "Honor thick friendship, strive correct profit, sage wang affairs.",
  "s0395": "Yan Zhao Wang good his book, said: Ancestor once have virtue Su clan, Zi Zhi chaos Su clan leave Yan.",
  "s0396": "Yan wish repay enmity Qi, not Su clan cannot.",
  "s0397": "Then summon Su Dai, again good treat, with plan attack Qi.",
  "s0398": "Finally break Qi, Min Wang flee.",
  "s0399": "Long time, Qin summon Yan Wang, Yan Wang wish go, Su Dai warn Yan Wang: Chu obtain Zhi state perish, Qi obtain Song state perish, Qi Chu not able with have Zhi Song serve Qin, why?",
  "s0400": "Then have merit, Qin deep enemy.",
  "s0401": "Qin take world, not practice righteousness, violent.",
  "s0402": "Qin practice violent, correct warn world.",
  "s0403": "Warn Chu: Shu land armor, ride boat float Wen, ride summer water down Jiang, five days arrive Ying.",
  "s0404": "Han Zhong armor, ride boat emerge Ba, ride summer water down Han, four days arrive Wu Zhu.",
  "s0405": "I store armor Wan east down Sui, wise not time plan, brave soldiers not time angry, I like shoot falcon.",
  "s0406": "Wang desire await world attack Hangu, not far!",
  "s0407": "Chu Wang for this reason, seventeen years serve Qin.",
  "s0408": "Qin correct warn Han: I rise Shao Qu, one day break Da Xing.",
  "s0409": "I rise Yi Yang touch Ping Yang, two days none not all conscript.",
  "s0410": "I leave two Zhou touch Zheng, five days state raise.",
  "s0411": "Han clan consider correct, serve Qin.",
  "s0412": "Qin correct warn Wei: I raise An Yi, block Nv Ji, Han Tai Yuan Juan.",
  "s0413": "I descend Zhi, road Nan Yang, seal Ji, surround two Zhou.",
  "s0414": "Ride summer water, float light boats, strong crossbows front, strong halberds rear, break Ying mouth, Wei no Da Liang;",
  "s0415": "Break Bai Ma mouth, Wei no Wai Huang, Ji Yang;",
  "s0416": "Break Su Xu mouth, Wei no Xu, Dun Qiu.",
  "s0417": "Land attack then strike He Nei, water attack then extinguish Da Liang.",
  "s0418": "Wei clan consider correct, serve Qin.",
  "s0419": "Qin desire attack An Yi, fear Qi save, then with Song entrust Qi.",
  "s0420": "Said: Song Wang no way, make wood person imitate me, shoot its face.",
  "s0421": "I land cut troops far, cannot attack.",
  "s0422": "Wang if can break Song have it, I like self obtain.",
  "s0423": "Already obtain An Yi, block Nv Ji, because break Song as Qi crime.",
  "s0424": "Qin desire attack Han, fear world save, then with Qi entrust world.",
  "s0425": "Said: Qi Wang four with I pact, four deceive I, must lead world attack I three.",
  "s0426": "Have Qi no Qin, have Qin no Qi, must attack, must perish.",
  "s0427": "Already obtain Yi Yang, Shao Qu, send Lin, Li Shi, because break Qi as world crime.",
  "s0428": "Qin desire attack Wei heavy Chu, then with Nan Yang entrust Chu.",
  "s0429": "Said: I certainly with Han already cut.",
  "s0430": "Damage Jun Ling, block Dong E, if profit Chu, I like self have.",
  "s0431": "Wei abandon ally state unite Qin, because block Dong E as Chu crime.",
  "s0432": "Troops trapped Lin Zhong, heavy Yan Zhao, with Jiao Dong entrust Yan, with Ji Xi entrust Zhao.",
  "s0433": "Already obtain lecture Wei, to Gong Zi Yan, because Xi Shou continue go attack Zhao.",
  "s0434": "Troops injured Qiao Shi, encounter defeat Yang Ma, heavy Wei, then with Ye Cai entrust Wei.",
  "s0435": "Already obtain lecture Zhao, then coerce Wei, Wei not cede.",
  "s0436": "Trapped then make Empress Dowager younger brother Rang Hou make peace, win then together deceive uncle mother.",
  "s0437": "Go Yan say with Jiao Dong, go Zhao say with Ji Xi, go Wei say with Ye Cai, go Chu say with block Dong E, go Qi say with Song, this must make words like cycle, use troops like stab fly, mother cannot control, uncle cannot bind.",
  "s0438": "Long Jia battle, An Men battle, Feng Ling battle, Gao Shang battle, Zhao Zhuang battle, Qin killed San Jin people several hundred thousand, now their living all die Qin orphans.",
  "s0439": "Xi He outside, Shang Luo land, San Chuan Jin state calamity, San Jin half, Qin calamity so great.",
  "s0440": "Yan Zhao Qin, all with strive serve Qin persuade their lord, this subject great worry.",
  "s0442": "Yan Zhao Wang not do.",
  "s0443": "Su Dai again heavy Yan.",
  "s0444": "Yan make pact feudal lords form alliance like Su Qin time, some follow some not, world from this venerate Su clan alliance pact.",
  "s0445": "Dai, Li all with longevity die, name manifest feudal lords.",
  "s0446": "Grand Historian said: Su Qin brothers three, all travel persuade feudal lords manifest name, their arts long power change.",
  "s0447": "Su Qin suffer counter espionage die, world together laugh, avoid study his arts.",
  "s0448": "Yet world speak Su Qin many strange, strange time affairs have similar attach to Su Qin.",
  "s0449": "Su Qin rise humble door, connect six states alliance, this his wisdom surpass people.",
  "s0450": "I therefore list his conduct affairs, sequence his time order, not let alone bear evil reputation."
}