{
  "s0029": "Gong Shu Zu Lei die, son Gu Gong Dan Fu establish.",
  "s0051": "Gong Fei die, son Gao Yu establish.",
  "s0052": "Gao Yu die, son Ya Yu establish.",
  "s0053": "Ya Yu die, son Gong Shu Zu Lei establish.",
  "s0054": "Gong Shu Zu Lei die, son Gu Gong Dan Fu establish.",
  "s0055": "Gu Gong Dan Fu again repair Hou Ji, Gong Liu work, accumulate virtue practice righteousness, state people all support.",
  "s0056": "Xun Yu Rong Di attack, wish get wealth goods, give them.",
  "s0057": "Already again attack, wish get land with people.",
  "s0058": "People all angry, wish fight.",
  "s0059": "Gu Gong said: 'Have people establish lord, will benefit them.",
  "s0060": "Now Rong Di do attack fight, with my land and people.",
  "s0061": "People at me, with at them, what different.",
  "s0062": "People wish for me fight, kill father son yet lord them, I not endure do.'",
  "s0063": "Then with private followers then leave Bin, cross Qi, Ju, pass Liang mountain, stop at Qi below.",
  "s0064": "Bin people whole state support old carry weak, all again return Gu Gong at Qi below.",
  "s0065": "And other side states hear Gu Gong benevolence, also many return him.",
  "s0066": "Then Gu Gong then decline Rong Di customs, yet camp build city wall room houses, yet settle separate dwell.",
  "s0067": "Make five officials have directors.",
  "s0068": "People all sing joy, praise virtue.",
  "s0069": "Gu Gong have eldest son called Tai Bo, next Yu Zhong.",
  "s0070": "Tai Jiang give birth young son Ji Li, Ji Li marry Tai Ren, all wise women, give birth Chang, have holy auspicious.",
  "s0071": "Gu Gong said: 'My generation should have rise, perhaps at Chang?'",
  "s0072": "Eldest son Tai Bo, Yu Zhong know Gu Gong wish establish Ji Li to pass Chang, then two people flee go Jing Man, tattooed body cut hair, to yield Ji Li.",
  "s0073": "Gu Gong die, Ji Li establish, this was Gong Ji.",
  "s0074": "Gong Ji repair Gu Gong remain way, devoted practice righteousness, feudal lords obey him.",
  "s0075": "Gong Ji die, son Chang establish, this was Xi Bo.",
  "s0076": "Xi Bo said Wen Wang, follow Hou Ji, Gong Liu work, then Gu Gong, Gong Ji method, devoted benevolence, respect old, pity young.",
  "s0077": "Ritual humble worthy, midday not leisure eat to wait scholars, scholars because many return him.",
  "s0078": "Bo Yi, Shu Qi at Gu Zhu, hear Xi Bo good nourish old, why not go return him.",
  "s0079": "Tai Dian, Hong Yao, San Yi Sheng, Yu Zi, Xin Jia grand master followers all go return him.",
  "s0080": "Chong Hou Hu slander Xi Bo at Yin Zhou said: 'Xi Bo accumulate good accumulate virtue, feudal lords all face him, will not benefit emperor.'",
  "s0081": "Emperor Zhou then imprison Xi Bo at You Li.",
  "s0082": "Hong Yao followers suffer it.",
  "s0083": "Then seek You Shen clan beautiful woman, Li Rong patterned horse, You Xiong nine teams, other strange things, because Yin favorite minister Fei Zhong offer Zhou.",
  "s0084": "Zhou greatly delighted, said: 'This one thing sufficient release Xi Bo, moreover many?'",
  "s0085": "Then pardon Xi Bo, grant bow arrow axe battle-axe, make Xi Bo get attack punish.",
  "s0086": "Said: 'Slander Xi Bo, Chong Hou Hu.'",
  "s0087": "Xi Bo then offer Luo west land, to request Zhou remove cannon grid punishment.",
  "s0088": "Zhou allow it.",
  "s0089": "Xi Bo secretly practice good, feudal lords all come decide peace.",
  "s0090": "Then Yu, Rui people have litigation cannot decide, then go Zhou.",
  "s0091": "Enter border, plow all yield boundary, people customs all yield elder.",
  "s0092": "Yu, Rui people not see Xi Bo, all ashamed, mutually say: 'Our dispute, Zhou people shame, why go, only take disgrace.'",
  "s0093": "Then return, together yield leave.",
  "s0094": "Feudal lords hear, said 'Xi Bo cover receive mandate lord'.",
  "s0095": "Next year, attack Quan Rong.",
  "s0096": "Next year, attack Mi Xu.",
  "s0097": "Next year, defeat Qi country.",
  "s0098": "Yin ancestor Yi hear, fear, report emperor Zhou.",
  "s0099": "Zhou said: 'Not have heaven mandate? This what able do!'"
}
