{
  "s0211": {
    "chinese": "襄平侯通尚符節。",
    "literal": "Xiangping Hou Tong carried tally credentials.",
    "idiomatic": "The Marquis of Xiangping, Tong, carried the tally and credentials."
  },
  "s0212": {
    "chinese": "乃令持節矯內太尉北軍。",
    "literal": "Then commanded held tally falsified entered Grand Commandant Northern Army.",
    "idiomatic": "He then commanded that holding the tally, they falsified entry into the Grand Commandant's Northern Army."
  },
  "s0213": {
    "chinese": "太尉復令酈寄與典客劉揭先說呂祿曰：「帝使太尉守北軍，欲足下之國，急歸將印辭去，不然，禍且起。」",
    "literal": "Grand Commandant again commanded Li Ji and Chamberlain for Dependencies Liu Jie first persuaded Lü Lu said: 'Emperor made Grand Commandant guard Northern Army, wishes your excellency go to state, urgently return general seal take leave go, otherwise, calamity will arise.'",
    "idiomatic": "The Grand Commandant again commanded Li Ji and the Chamberlain for Dependencies Liu Jie to first persuade Lü Lu saying: 'The emperor made the Grand Commandant guard the Northern Army. He wishes your excellency to go to your state. Urgently return the general seal and take leave to go, otherwise calamity will arise.'"
  },
  "s0214": {
    "chinese": "呂祿以為酈兄不欺己，遂解印屬典客，而以兵授太尉。",
    "literal": "Lü Lu considered Li brother not deceive self, then removed seal belonged Chamberlain for Dependencies, yet with troops gave Grand Commandant.",
    "idiomatic": "Lü Lu considered that his brother Li would not deceive him, so he then removed the seal and gave it to the Chamberlain for Dependencies, and gave the troops to the Grand Commandant."
  },
  "s0236": {
    "chinese": "使人誅燕王呂通，而廢魯王偃。",
    "literal": "Sent person executed Yan King Lü Tong, yet deposed Lu King Yan.",
    "idiomatic": "He sent someone to execute the King of Yan, Lü Tong, and deposed the King of Lu, Yan."
  },
  "s0237": {
    "chinese": "壬戌，以帝太傅食其復為左丞相。",
    "literal": "Renxu day, with emperor Grand Tutor Shi Yi again became Left Chancellor.",
    "idiomatic": "On the renxu day, the emperor's Grand Tutor Shi Yi again became Left Chancellor."
  },
  "s0238": {
    "chinese": "戊辰，徙濟川王王梁，立趙幽王子遂為趙王。",
    "literal": "Wuchen day, moved Jichuan King enfeoffed Liang, established Zhao You King son Sui as Zhao King.",
    "idiomatic": "On the wuchen day, they moved the King of Jichuan to be enfeoffed in Liang, and established King You of Zhao's son Sui as King of Zhao."
  },
  "s0239": {
    "chinese": "遣朱虛侯章以誅諸呂氏事告齊王，令罷兵。",
    "literal": "Dispatched Zhuxu Hou Zhang with executed various Lü clan matters informed Qi King, commanded cease troops.",
    "idiomatic": "He dispatched the Marquis of Zhuxu, Zhang, to inform the King of Qi of the matters of executing the various Lü clan, and commanded to cease troops."
  },
  "s0274": {
    "chinese": "代王立為天子。",
    "literal": "Dai King established as Son of Heaven.",
    "idiomatic": "The King of Dai was established as Son of Heaven."
  }
}