{
  "s0642": {
    "chinese": "十二月，益發卒軍汾城旁。",
    "literal": "Twelfth month, additionally sent troops stationed beside Fen Cheng.",
    "idiomatic": "In the twelfth month, they additionally sent troops to station beside Fencheng."
  },
  "s0643": {
    "chinese": "武安君白起有罪，死。",
    "literal": "Wu An Jun Bai Qi had crime, died.",
    "idiomatic": "Lord Wuan Bai Qi had a crime and died."
  },
  "s0644": {
    "chinese": "龁攻邯鄲，不拔，去，還奔汾軍。",
    "literal": "He attacked Han Dan, not pulled, went, returned rushed to Fen army.",
    "idiomatic": "He attacked Handan but could not pull it. He went and returned to rush to the Fen army."
  },
  "s0645": {
    "chinese": "二月餘攻晉軍，斬首六千，晉楚流死河二萬人。",
    "literal": "More than two months attacked Jin army, beheaded six thousand, Jin Chu drowned died river twenty thousand people.",
    "idiomatic": "For more than two months they attacked the Jin army, beheaded six thousand, and twenty thousand Jin and Chu people drowned and died in the river."
  },
  "s0646": {
    "chinese": "攻汾城，即從唐拔寧新中，寧新中更名安陽。",
    "literal": "Attacked Fen Cheng, then from Tang pulled Ning Xin middle, Ning Xin middle changed name An Yang.",
    "idiomatic": "They attacked Fencheng, then from Tang pulled Ningxinzhong. Ningxinzhong changed its name to Anyang."
  },
  "s0647": {
    "chinese": "初作河橋。",
    "literal": "Initially made river bridge.",
    "idiomatic": "They initially made a river bridge."
  },
  "s0648": {
    "chinese": "五十一年，將軍摎攻韓，取陽城、負黍，斬首四萬。",
    "literal": "Fifty-first year, general Liu attacked Han, took Yang Cheng, Fu Shu, beheaded forty thousand.",
    "idiomatic": "In the fifty-first year, General Liu attacked Han, took Yangcheng and Fushu, and beheaded forty thousand."
  },
  "s0649": {
    "chinese": "攻趙，取二十餘縣，首虜九萬。",
    "literal": "Attacked Zhao, took more than twenty counties, heads captured ninety thousand.",
    "idiomatic": "They attacked Zhao, took more than twenty counties, and captured ninety thousand heads."
  },
  "s0650": {
    "chinese": "西周君背秦，與諸侯約從，將天下銳兵出伊闕攻秦，令秦毋得通陽城。",
    "literal": "West Zhou jun betrayed Qin, with feudal lords allied, led world sharp troops out Yi Que attacked Qin, made Qin not able to connect Yang Cheng.",
    "idiomatic": "The West Zhou jun betrayed Qin and allied with the feudal lords. He led the world's sharp troops out of Yique to attack Qin, making Qin unable to connect to Yangcheng."
  },
  "s0651": {
    "chinese": "於是秦使將軍摎攻西周。",
    "literal": "Thereupon Qin made general Liu attack West Zhou.",
    "idiomatic": "Thereupon Qin had General Liu attack West Zhou."
  },
  "s0652": {
    "chinese": "西周君走來自歸，頓首受罪，盡獻其邑三十六城，口三萬。",
    "literal": "West Zhou jun fled came self surrendered, knocked head received punishment, completely offered his yi thirty-six cities, mouths thirty thousand.",
    "idiomatic": "The West Zhou jun fled and came to surrender himself. He knocked his head and received punishment, completely offering his thirty-six cities and thirty thousand people."
  },
  "s0653": {
    "chinese": "秦王受獻，歸其君於周。",
    "literal": "Qin king accepted offering, returned his jun to Zhou.",
    "idiomatic": "The Qin king accepted the offering and returned his jun to Zhou."
  },
  "s0654": {
    "chinese": "五十二年，周民東亡，其器九鼎入秦。",
    "literal": "Fifty-second year, Zhou people east fled, their vessels nine ding entered Qin.",
    "idiomatic": "In the fifty-second year, the Zhou people fled east. Their vessels, the nine ding, entered Qin."
  },
  "s0655": {
    "chinese": "周初亡。",
    "literal": "Zhou initially perished.",
    "idiomatic": "Zhou initially perished."
  },
  "s0656": {
    "chinese": "五十三年，天下來賓。",
    "literal": "Fifty-third year, world came as guests.",
    "idiomatic": "In the fifty-third year, the world came as guests."
  },
  "s0657": {
    "chinese": "魏後，秦使摎伐魏，取吳城。",
    "literal": "Wei later, Qin made Liu attacked Wei, took Wu Cheng.",
    "idiomatic": "Later, Wei. Qin had Liu attack Wei and take Wucheng."
  },
  "s0658": {
    "chinese": "韓王入朝，魏委國聽令。",
    "literal": "Han king entered court, Wei entrusted state listened to commands.",
    "idiomatic": "The Han king entered to court. Wei entrusted its state and listened to commands."
  },
  "s0659": {
    "chinese": "五十四年，王郊見上帝於雍。",
    "literal": "Fifty-fourth year, king suburb saw Shang Di at Yong.",
    "idiomatic": "In the fifty-fourth year, the king in the suburbs saw Shangdi at Yong."
  },
  "s0660": {
    "chinese": "五十六年秋，昭襄王卒，子孝文王立。",
    "literal": "Fifty-sixth year autumn, Zhao Xiang Wang died, son Xiao Wen Wang established.",
    "idiomatic": "In autumn of the fifty-sixth year, King Zhao Xiang died. His son King Xiao Wen was established."
  },
  "s0661": {
    "chinese": "尊唐八子為唐太后，而合其葬於先王。",
    "literal": "Honored Tang Ba Zi as Tang Tai Hou, and combined her burial with previous kings.",
    "idiomatic": "They honored Tang Ba Zi as Tang Taihou and combined her burial with the previous kings."
  },
  "s0662": {
    "chinese": "韓王衰绖入弔祠，諸侯皆使其將相來弔祠，視喪事。",
    "literal": "Han king mourning clothes entered condolence sacrifice, feudal lords all made their generals chancellors come condolence sacrifice, viewed funeral affairs.",
    "idiomatic": "The Han king in mourning clothes entered to offer condolences and sacrifices. All the feudal lords had their generals and chancellors come to offer condolences and sacrifices and view the funeral affairs."
  },
  "s0663": {
    "chinese": "孝文王元年，赦罪人，修先王功臣，褒厚親戚，弛苑囿。",
    "literal": "Xiao Wen Wang first year, pardoned criminals, repaired previous king merit ministers, praised thickened relatives, relaxed gardens enclosures.",
    "idiomatic": "In King Xiao Wen's first year, they pardoned criminals, repaired the previous king's merit ministers, praised and thickened relatives, and relaxed the gardens and enclosures."
  },
  "s0664": {
    "chinese": "孝文王除喪，十月己亥即位，三日辛醜卒，子莊襄王立。",
    "literal": "Xiao Wen Wang removed mourning, tenth month Ji Hai ascended throne, three days Xin Chou died, son Zhuang Xiang Wang established.",
    "idiomatic": "King Xiao Wen removed mourning. In the tenth month on Jihai day he ascended the throne. Three days later on Xinchou day he died. His son King Zhuang Xiang was established."
  },
  "s0665": {
    "chinese": "莊襄王元年，大赦罪人，修先王功臣，施德厚骨肉而布惠於民。",
    "literal": "Zhuang Xiang Wang first year, great pardon criminals, repaired previous king merit ministers, applied virtue thickened bone flesh and spread favor to people.",
    "idiomatic": "In King Zhuang Xiang's first year, they greatly pardoned criminals, repaired the previous king's merit ministers, applied virtue to thicken bone and flesh, and spread favor to the people."
  },
  "s0666": {
    "chinese": "東周君與諸侯謀秦，秦使相國呂不韋誅之，盡入其國。",
    "literal": "East Zhou jun with feudal lords plotted Qin, Qin made chancellor Lu Bu Wei execute him, completely entered his state.",
    "idiomatic": "The East Zhou jun plotted with the feudal lords against Qin. Qin had Chancellor Lu Buwei execute him and completely entered his state."
  },
  "s0667": {
    "chinese": "秦不絕其祀，以陽人地賜周君，奉其祭祀。",
    "literal": "Qin not cut off its sacrifices, with Yang Ren land granted Zhou jun, carried its sacrificial offerings.",
    "idiomatic": "Qin did not cut off its sacrifices. They granted Yangren land to the Zhou jun to carry out its sacrificial offerings."
  },
  "s0668": {
    "chinese": "使蒙驁伐韓，韓獻成皋、鞏。",
    "literal": "Made Meng Ao attack Han, Han offered Cheng Gao, Gong.",
    "idiomatic": "They had Meng Ao attack Han. Han offered Chenggao and Gong."
  },
  "s0669": {
    "chinese": "秦界至大梁，初置三川郡。",
    "literal": "Qin border reached Da Liang, initially established San Chuan commandery.",
    "idiomatic": "Qin's border reached Daliang. They initially established Sanchuan commandery."
  },
  "s0670": {
    "chinese": "二年，使蒙驁攻趙，定太原。",
    "literal": "Second year, made Meng Ao attack Zhao, pacified Tai Yuan.",
    "idiomatic": "In the second year, they had Meng Ao attack Zhao and pacify Taiyuan."
  },
  "s0671": {
    "chinese": "三年，蒙驁攻魏高都、汲，拔之。",
    "literal": "Third year, Meng Ao attacked Wei Gao Du, Ji, pulled them.",
    "idiomatic": "In the third year, Meng Ao attacked Wei's Gaodu and Ji and pulled them."
  },
  "s0672": {
    "chinese": "攻趙榆次、新城、狼孟，取三十七城。",
    "literal": "Attacked Zhao Yu Ci, Xin Cheng, Lang Meng, took thirty-seven cities.",
    "idiomatic": "They attacked Zhao's Yuci, Xincheng, and Langmeng, and took thirty-seven cities."
  },
  "s0673": {
    "chinese": "四月日食。",
    "literal": "Fourth month solar eclipse.",
    "idiomatic": "In the fourth month there was a solar eclipse."
  },
  "s0674": {
    "chinese": "（四年）王龁攻上黨。",
    "literal": "(Fourth year) Wang He attacked Shang Dang.",
    "idiomatic": "(In the fourth year) Wang He attacked Shangdang."
  },
  "s0675": {
    "chinese": "初置太原郡。",
    "literal": "Initially established Tai Yuan commandery.",
    "idiomatic": "They initially established Taiyuan commandery."
  },
  "s0676": {
    "chinese": "魏將無忌率五國兵擊秦，秦卻於河外。",
    "literal": "Wei general Wu Ji led five states troops struck Qin, Qin retreated at river outside.",
    "idiomatic": "Wei general Wu Ji led five states' troops to strike Qin. Qin retreated outside the river."
  },
  "s0677": {
    "chinese": "蒙驁敗，解而去。",
    "literal": "Meng Ao defeated, disbanded and went.",
    "idiomatic": "Meng Ao was defeated and disbanded and went."
  },
  "s0678": {
    "chinese": "五月丙午，莊襄王卒，子政立，是為秦始皇帝。",
    "literal": "Fifth month Bing Wu, Zhuang Xiang Wang died, son Zheng established, this was Qin Shi Huang Di.",
    "idiomatic": "In the fifth month on Bingwu day, King Zhuang Xiang died. His son Zheng was established. He was Qin Shi Huangdi."
  },
  "s0679": {
    "chinese": "秦王政立二十六年，初并天下為三十六郡，號為始皇帝。",
    "literal": "Qin king Zheng established twenty-six years, initially united world as thirty-six commanderies, titled Shi Huang Di.",
    "idiomatic": "Qin King Zheng was established for twenty-six years. He initially united the world into thirty-six commanderies and was titled Shi Huangdi."
  },
  "s0680": {
    "chinese": "始皇帝五十一年而崩，子胡亥立，是為二世皇帝。",
    "literal": "Shi Huang Di fifty-one years then collapsed, son Hu Hai established, this was Er Shi Huang Di.",
    "idiomatic": "Shi Huangdi collapsed after fifty-one years. His son Hu Hai was established. He was Er Shi Huangdi."
  },
  "s0681": {
    "chinese": "三年，諸侯并起叛秦，趙高殺二世，立子嬰。",
    "literal": "Third year, feudal lords together rose rebelled Qin, Zhao Gao killed Er Shi, established Zi Ying.",
    "idiomatic": "In the third year, the feudal lords together rose and rebelled against Qin. Zhao Gao killed Er Shi and established Zi Ying."
  },
  "s0682": {
    "chinese": "子嬰立月餘，諸侯誅之，遂滅秦。",
    "literal": "Zi Ying established more than month, feudal lords executed him, then extinguished Qin.",
    "idiomatic": "Zi Ying was established for more than a month. The feudal lords executed him and then extinguished Qin."
  },
  "s0683": {
    "chinese": "其語在始皇本紀中。",
    "literal": "Its words are in Shi Huang ben ji middle.",
    "idiomatic": "Its words are in the Shi Huang Annals."
  },
  "s0684": {
    "chinese": "太史公曰：秦之先為嬴姓。",
    "literal": "Tai Shi Gong said: Qin's ancestor was Ying surname.",
    "idiomatic": "The Grand Historian says: 'Qin's ancestor was of the Ying surname.'"
  },
  "s0685": {
    "chinese": "其後分封，以國為姓，有徐氏、郯氏、莒氏、終黎氏、運奄氏、菟裘氏、將梁氏、黃氏、江氏、修魚氏、白冥氏、蜚廉氏、秦氏。",
    "literal": "His descendants enfeoffed, used states as surnames, had Xu clan, Tan clan, Ju clan, Zhong Li clan, Yun Yan clan, Tu Qiu clan, Jiang Liang clan, Huang clan, Jiang clan, Xiu Yu clan, Bai Ming clan, Fei Lian clan, Qin clan.",
    "idiomatic": "His descendants were enfeoffed and took their states as surnames. There were the Xu clan, Tan clan, Ju clan, Zhongli clan, Yunyan clan, Tuqiu clan, Jiangliang clan, Huang clan, Jiang clan, Xiuyu clan, Baiming clan, Feilian clan, and Qin clan."
  },
  "s0686": {
    "chinese": "然秦以其先造父封趙城，為趙氏。",
    "literal": "However Qin with its ancestor Zao Fu enfeoffed Zhao city, was Zhao clan.",
    "idiomatic": "However, Qin took its ancestor Zaofu who was enfeoffed at Zhao city as the Zhao clan."
  }
}