{
  "s0593": {
    "chinese": "西周君犇秦，頓首受罪，盡獻其邑三十六，口三萬。",
    "literal": "West Zhou ruler fled to Qin, kowtowed accepted crime, completely offered his cities thirty-six, population thirty thousand.",
    "idiomatic": "The West Zhou ruler fled to Qin, kowtowed and accepted his crime, completely offering his thirty-six cities and thirty thousand people."
  },
  "s0594": {
    "chinese": "秦受其獻，歸其君於周。",
    "literal": "Qin accepted his offering, returned his ruler to Zhou.",
    "idiomatic": "Qin accepted his offering and returned his ruler to Zhou."
  },
  "s0595": {
    "chinese": "周君、王赧卒，周民遂東亡。",
    "literal": "Zhou ruler, Wang Nan died, Zhou people then east fled.",
    "idiomatic": "The Zhou ruler King Nan died. The Zhou people then fled east."
  },
  "s0596": {
    "chinese": "秦取九鼎寶器，而遷西周公於憚狐。",
    "literal": "Qin took nine tripods precious vessels, and moved West Zhou Gong to Dan Hu.",
    "idiomatic": "Qin took the nine tripods and precious vessels, and moved the West Zhou Gong to Danhu."
  },
  "s0597": {
    "chinese": "後七歲，秦莊襄王滅東（西）周。",
    "literal": "After seven years, Qin Zhuang Xiang Wang extinguished East Zhou.",
    "idiomatic": "After seven years, King Zhuang Xiang of Qin extinguished East Zhou."
  },
  "s0598": {
    "chinese": "東西周皆入于秦，周既不祀。",
    "literal": "East west Zhou all entered Qin, Zhou then not sacrifice.",
    "idiomatic": "Both east and west Zhou entered Qin. Zhou then ceased to sacrifice."
  },
  "s0599": {
    "chinese": "太史公曰：學者皆稱周伐紂，居洛邑，綜其實不然。",
    "literal": "Grand Historian said: scholars all say Zhou attacked Zhou, resided Luo city, comprehensively actually not so.",
    "idiomatic": "The Grand Historian says: Scholars all say Zhou attacked Zhou and resided in Luoyi, but comprehensively this is actually not so."
  },
  "s0600": {
    "chinese": "武王營之，成王使召公卜居，居九鼎焉，而周復都豐、鎬。",
    "literal": "Wu Wang planned it, Cheng Wang made Shao Gong divine residence, resided nine tripods there, but Zhou again capital Feng, Hao.",
    "idiomatic": "King Wu planned it. King Cheng had the Duke of Shao divine the residence and placed the nine tripods there. But Zhou again made its capital Feng and Hao."
  },
  "s0601": {
    "chinese": "至犬戎敗幽王，周乃東徙于洛邑。",
    "literal": "Until Quan Rong defeated You Wang, Zhou then east moved to Luo city.",
    "idiomatic": "Until the Quanrong defeated King You, Zhou then moved east to Luoyi."
  },
  "s0602": {
    "chinese": "所謂「周公葬（我）［於］畢」，畢在鎬東南杜中。",
    "literal": "What called 'Zhou Gong buried at Bi', Bi in Hao southeast Du middle.",
    "idiomatic": "What is called 'the Duke of Zhou was buried at Bi'—Bi is in the middle of Du southeast of Hao."
  },
  "s0603": {
    "chinese": "秦滅周。",
    "literal": "Qin extinguished Zhou.",
    "idiomatic": "Qin extinguished Zhou."
  },
  "s0604": {
    "chinese": "漢興九十有餘載，天子將封泰山，東巡狩至河南，求周苗裔，封其後嘉三十里地，號曰周子南君，比列侯，以奉其先祭祀。",
    "literal": "Han rose ninety remaining years, Son of Heaven would seal Mount Tai, east inspected to Henan, sought Zhou descendants, enfeoffed their descendant Jia thirty li land, titled Zhou Zi Nan Jun, compared marquises, to serve their ancestors sacrifices.",
    "idiomatic": "The Han rose for ninety remaining years. The Son of Heaven would seal Mount Tai, and on his eastern inspection reached Henan. He sought Zhou descendants and enfeoffed their descendant Jia with thirty li of land, titling him Zhou Zi Nan Jun, equal to marquises, to serve their ancestors' sacrifices."
  }
}