{
  "s0916": {
    "chinese": "趙高為丞相安武侯。",
    "literal": "Zhao Gao was chancellor An Wu hou.",
    "idiomatic": "Zhao Gao was Chancellor Marquis An Wu."
  },
  "s0917": {
    "chinese": "二世生十二年而立。",
    "literal": "Second generation born twelve years then established.",
    "idiomatic": "The Second Generation was born twelve years then established."
  },
  "s0918": {
    "chinese": "右秦襄公至二世，六百一十歲。",
    "literal": "Right Qin Xiang gong to second generation, six hundred ten years.",
    "idiomatic": "From Qin Duke Xiang to the Second Generation, six hundred ten years."
  },
  "s0919": {
    "chinese": "孝明皇帝十七年十月十五日乙丑，曰：",
    "literal": "Xiao Ming emperor seventeenth year tenth month fifteenth day Yi Chou, said:",
    "idiomatic": "Emperor Xiao Ming's seventeenth year, tenth month, fifteenth day, Yichou day, said:"
  },
  "s0920": {
    "chinese": "周歷已移，仁不代母。",
    "literal": "Zhou calendar already shifted, benevolence not replace mother.",
    "idiomatic": "The Zhou calendar had already shifted. Benevolence did not replace the mother."
  },
  "s0921": {
    "chinese": "秦直其位，呂政殘虐。",
    "literal": "Qin straight its position, Lu Zheng cruel tyrannical.",
    "idiomatic": "Qin took its position directly. Lu Zheng was cruel and tyrannical."
  },
  "s0922": {
    "chinese": "然以諸侯十三，并兼天下，極情縱欲，養育宗親。",
    "literal": "However with feudal lords thirteen, united annexed world, extreme feelings indulged desires, nourished raised clan relatives.",
    "idiomatic": "However with thirteen feudal lords, united and annexed the world. Extreme feelings indulged desires. Nourished and raised clan relatives."
  },
  "s0923": {
    "chinese": "三十七年，兵無所不加，制作政令，施於後王。",
    "literal": "Thirty-seven years, troops nowhere not added, created made governance commands, applied to later kings.",
    "idiomatic": "Thirty-seven years, troops were added everywhere. Created governance and commands, applied to later kings."
  },
  "s0924": {
    "chinese": "蓋得聖人之威，河神授圖，據狼、狐，蹈參、伐，佐政驅除，距之稱始皇。",
    "literal": "Probably obtained sage might, river god gave diagram, occupied wolf fox, trod Shen Fu, assisted governance drove away, rejected it called beginning emperor.",
    "idiomatic": "Probably obtained sage might. The river god gave the diagram. Occupied wolf and fox. Trode Shen and Fu. Assisted governance and drove away. Rejected it and was called Beginning Emperor."
  },
  "s0925": {
    "chinese": "始皇既歿，胡亥極愚，酈山未畢，復作阿房，以遂前策。",
    "literal": "Beginning emperor already died, Hu Hai extremely foolish, Li mountain not finished, again made Efang, to fulfill former strategy.",
    "idiomatic": "The Beginning Emperor already died. Hu Hai was extremely foolish. Lishan was not finished. He again made Efang to fulfill the former strategy."
  },
  "s0926": {
    "chinese": "云「凡所為貴有天下者，肆意極欲，大臣至欲罷先君所為」。",
    "literal": "Said 'all what done noble having world ones, unrestrained intentions extreme desires, ministers even wished dismiss former lord what did'.",
    "idiomatic": "He said 'all those who are noble in having the world unrestrained intentions extreme desires. Ministers even wished to dismiss what the former lord did.'"
  },
  "s0927": {
    "chinese": "誅斯、去疾，任用趙高。",
    "literal": "Executed Si, Qu Ji, employed used Zhao Gao.",
    "idiomatic": "Executed Si and Qu Ji. Employed and used Zhao Gao."
  },
  "s0928": {
    "chinese": "痛哉言乎！",
    "literal": "Painful indeed words ah!",
    "idiomatic": "Painful indeed are the words!"
  },
  "s0929": {
    "chinese": "人頭畜鳴。",
    "literal": "Human head animal cry.",
    "idiomatic": "Human head animal cry."
  },
  "s0930": {
    "chinese": "不威不伐惡，不篤不虛亡，距之不得留，殘虐以促期，雖居形便之國，猶不得存。",
    "literal": "Not might not attack evil, not sincere not empty perish, rejected it not able stay, cruel tyrannical to hasten period, though dwelt form convenient country, still not able exist.",
    "idiomatic": "Not might, not attack evil. Not sincere, not empty perish. Rejected it, not able to stay. Cruel and tyrannical to hasten the period. Though dwelt in a conveniently formed country, still not able to exist."
  },
  "s0931": {
    "chinese": "子嬰度次得嗣，冠玉冠，佩華紱，車黃屋，從百司，謁七廟。",
    "literal": "Zi Ying measured sequence obtained successor, crowned jade crown, wore splendid sash, chariot yellow canopy, followed hundred officials, visited seven temples.",
    "idiomatic": "Zi Ying measured the sequence and obtained successor. Crowned with jade crown, wore splendid sash. Chariot with yellow canopy, followed by hundred officials. Visited the seven temples."
  },
  "s0932": {
    "chinese": "小人乘非位，莫不怳忽失守，偷安日日，獨能長念卻慮，父子作權，近取於戶牖之閒，竟誅猾臣，為君討賊。",
    "literal": "Small man rode improper position, none not bewildered lost guard, stole peace day day, alone able long thought rejected worries, father son made power, near took from door window interval, finally executed cunning ministers, for lord exterminated bandits.",
    "idiomatic": "A small man rode an improper position. None were not bewildered and lost their guard. Stole peace day by day. Alone able to long think and reject worries. Father and son made power. Near took from the door and window interval. Finally executed cunning ministers. For the lord exterminated bandits."
  },
  "s0933": {
    "chinese": "高死之後，賓婚未得盡相勞，餐未及下咽，酒未及濡脣，楚兵已屠關中，真人翔霸上，素車嬰組，奉其符璽，以歸帝者。",
    "literal": "Gao died after, guests marriages not obtained completely mutually toil, meals not reached down swallow, wine not reached moisten lips, Chu troops already slaughtered Guan Zhong, true person soared Ba Shang, plain chariot infant cord, offered their tallies seals, to return emperor ones.",
    "idiomatic": "After Gao died, guests and marriages did not obtain complete mutual toil. Meals did not reach down the swallow. Wine did not reach moisten the lips. Chu troops already slaughtered Guanzhong. The true person soared at Bashang. Plain chariot infant cord. Offered their tallies and seals to return to the emperor ones."
  },
  "s0934": {
    "chinese": "鄭伯茅旌鸞刀，嚴王退舍。",
    "literal": "Zheng bo thatched banner phoenix knife, strict king retreated lodge.",
    "idiomatic": "Duke Zheng of thatched banner phoenix knife. Strict king retreated lodge."
  },
  "s0935": {
    "chinese": "河決不可復壅，魚爛不可復全。",
    "literal": "River burst not able again dam, fish rotten not able again whole.",
    "idiomatic": "The river burst and cannot be dammed again. The fish are rotten and cannot be whole again."
  },
  "s0936": {
    "chinese": "賈誼、司馬遷曰：「向使嬰有庸主之才，僅得中佐，山東雖亂，秦之地可全而有，宗廟之祀未當絕也。」",
    "literal": "Jia Yi, Sima Qian said: 'Suppose made Ying had ordinary lord talent, merely obtained middle assistants, east mountains though chaotic, Qin land could whole have, clan temple sacrifices not should extinguished also.'",
    "idiomatic": "Jia Yi and Sima Qian said: 'Suppose Ying had ordinary lord talent, merely obtained middle assistants. Though east of mountains was chaotic, Qin's land could be whole and had. The clan temple sacrifices should not have been extinguished.'"
  },
  "s0937": {
    "chinese": "秦之積衰，天下土崩瓦解，雖有周旦之材，無所復陳其巧，而以責一日之孤，誤哉！",
    "literal": "Qin accumulated decline, world earth collapsed tile dissolved, though had Zhou Dan materials, nowhere again displayed his skill, and to blame one day orphan, mistake ah!",
    "idiomatic": "Qin's accumulated decline, the world earth collapsed and tile dissolved. Though had Zhou Dan's materials, nowhere to again display his skill. And to blame a one-day orphan. Mistake!"
  },
  "s0938": {
    "chinese": "俗傳秦始皇起罪惡，胡亥極，得其理矣。",
    "literal": "Common tradition Qin beginning emperor rose evil crimes, Hu Hai extreme, obtained its principle already.",
    "idiomatic": "Common tradition says Qin Beginning Emperor rose from evil crimes, Hu Hai was extreme. Obtained its principle."
  },
  "s0939": {
    "chinese": "復責小子，云秦地可全，所謂不通時變者也。",
    "literal": "Again blamed young boy, said Qin land could whole, so-called not understand time changes ones also.",
    "idiomatic": "Again blamed the young boy, saying Qin land could be whole. So-called ones who do not understand time changes."
  },
  "s0940": {
    "chinese": "紀季以酅，春秋不名。",
    "literal": "Ji Ji with Ju, Spring Autumn not name.",
    "idiomatic": "Duke Ji with Ju. Spring and Autumn does not name."
  },
  "s0941": {
    "chinese": "吾讀秦紀，至於子嬰車裂趙高，未嘗不健其決，憐其志。",
    "literal": "I read Qin records, reached Zi Ying chariot ripped Zhao Gao, never not admired his decision, pitied his ambition.",
    "idiomatic": "I read the Qin records. When it reached Zi Ying chariot-ripping Zhao Gao, I never failed to admire his decision and pity his ambition."
  },
  "s0942": {
    "chinese": "嬰死生之義備矣。",
    "literal": "Ying death life righteousness prepared already.",
    "idiomatic": "Ying's death and life righteousness was prepared."
  }
}