{
  "s0250": {
    "chinese": "十六年，上親郊見渭陽五帝廟，亦以夏答禮而尚赤。",
    "literal": "Sixteenth year, emperor personally suburban appeared Weiyang Five Emperors temples, also with summer responded ceremony yet honored red.",
    "idiomatic": "In the sixteenth year, the emperor personally performed suburban appearances at the Weiyang Five Emperors temples, also responding with summer ceremonies while honoring red."
  },
  "s0251": {
    "chinese": "十七年，得玉杯，刻曰「人主延壽」。",
    "literal": "Seventeenth year, obtained jade cup, engraved said 'Ruler extends longevity'.",
    "idiomatic": "In the seventeenth year, he obtained a jade cup, engraved with 'The ruler extends longevity.'"
  },
  "s0260": {
    "chinese": "和親已定，始于今年。」",
    "literal": "Peaceful kinship already established, begins from this year.'",
    "idiomatic": "Peaceful kinship has already been established, beginning from this year.'"
  },
  "s0269": {
    "chinese": "數月，胡人去，亦罷。",
    "literal": "Several months, Hu people left, also dismissed.",
    "idiomatic": "After several months, the Hu people left, and they were also dismissed."
  },
  "s0277": {
    "chinese": "南越王尉佗自立為武帝，然上召貴尉佗兄弟，以德報之，佗遂去帝稱臣。",
    "literal": "Nanyue King Wei Tuo self established as Martial Emperor, however emperor summoned honored Wei Tuo brothers, with virtue repaid them, Tuo then removed emperor title became minister.",
    "idiomatic": "The King of Nanyue, Wei Tuo, established himself as Martial Emperor. However, the emperor summoned and honored Wei Tuo's brothers, repaying them with virtue. Tuo then removed the emperor title and became a minister."
  },
  "s0278": {
    "chinese": "與匈奴和親，匈奴背約入盜，然令邊備守，不發兵深入，惡煩苦百姓。",
    "literal": "With Xiongnu peaceful kinship, Xiongnu violated agreement entered raided, however commanded border preparations defend, not dispatched troops deeply penetrate, hated troubling bittering hundred surnames.",
    "idiomatic": "He had peaceful kinship with the Xiongnu, but the Xiongnu violated the agreement and entered to raid. However, he commanded border preparations and defense, not dispatching troops to penetrate deeply, hating to trouble and embitter the people."
  },
  "s0279": {
    "chinese": "吳王詐病不朝，就賜几杖。",
    "literal": "Wu King feigned illness not court, then granted table cane.",
    "idiomatic": "The King of Wu feigned illness and did not come to court, so he was granted a table and cane."
  },
  "s0280": {
    "chinese": "群臣如袁盎等稱說雖切，常假借用之。",
    "literal": "Ministers like Yuan Ang etc. admonitions though urgent, constantly borrowed used them.",
    "idiomatic": "Ministers like Yuan Ang and others gave admonitions that were urgent, but he constantly borrowed and used them."
  },
  "s0309": {
    "chinese": "丁未，襲號曰皇帝。",
    "literal": "Dingwei day, inherited title called emperor.",
    "idiomatic": "On the dingwei day, he inherited the title of emperor."
  },
  "s0324": {
    "chinese": "朕甚懼焉。",
    "literal": "I very fear therein.",
    "idiomatic": "I greatly fear this."
  },
  "s0325": {
    "chinese": "其為孝文皇帝廟為昭德之舞，以明休德。",
    "literal": "Let for Filial Wen emperor temple make Bright Virtue dance, to clarify flourishing virtue.",
    "idiomatic": "Let there be made for Emperor Xiaowen's temple the Bright Virtue dance, to clarify flourishing virtue."
  },
  "s0337": {
    "chinese": "太史公曰：孔子言「必世然後仁。",
    "literal": "Grand Historian said: Confucius spoke 'Must generations then benevolent.",
    "idiomatic": "The Grand Historian said: Confucius spoke, 'Only after generations can there be benevolence."
  }
}