{
  "meta": {
    "book": "houhanshu",
    "bookInfo": {
      "name": "Book of Later Han",
      "chinese": "後漢書",
      "pinyin": "Hòu Hànshū",
      "dynasty": "Eastern Han"
    },
    "chapter": "006",
    "url": "https://chinesenotes.com/houhanshu/houhanshu006.html",
    "title": {
      "zh": "卷四 孝和孝殤帝紀",
      "en": "Volume 4: Annals of Emperor Xiaohe; Emperor Xiaoshang",
      "raw": "卷四 孝和孝殤帝紀 Volume 4: Annals of Emperor Xiaohe; Emperor Xiaoshang"
    },
    "sentenceCount": 398,
    "translatedCount": 398,
    "glossarySize": 20119,
    "scrapedAt": "2025-12-30T20:53:51.840Z",
    "translators": [],
    "citation": null
  },
  "content": [
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0001",
          "zh": "孝和皇帝諱肇，肅宗第四子也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Filial and Harmonious Emperor, personal name Zhao, was the fourth son of Emperor Suzong.",
              "idiomatic": "Emperor He of Han, whose personal name was Zhao, was the fourth son of Emperor Zhang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0002",
          "zh": "母梁貴人，為竇皇后所譖，憂卒，竇后養帝以為己子。",
          "translations": [
            {
              "lang": "en",
              "literal": "His mother Consort Liang was slandered by Empress Dou, died of worry, Empress Dou raised the Emperor as her own son.",
              "idiomatic": "His mother, Consort Liang, was slandered by Empress Dou and died of grief; Empress Dou then raised the Emperor as her own son.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0003",
          "zh": "建初七年，立為皇太子。",
          "translations": [
            {
              "lang": "en",
              "literal": "In the seventh year of Jianchu, he was established as Crown Prince.",
              "idiomatic": "In the seventh year of the Jianchu era (82 CE), he was designated as Crown Prince.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0004",
          "zh": "章和二年二月壬辰，即皇帝位，年十歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Zhanghe second year, second month, Renchen day: He ascended the imperial throne at age ten.",
              "idiomatic": "On the Renchen day of the second month in the second year of the Zhanghe era (88 CE), he ascended the throne at age ten.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0005",
          "zh": "尊皇后曰皇太后，太后臨朝。",
          "translations": [
            {
              "lang": "en",
              "literal": "He honored the Empress as Empress Dowager, the Empress Dowager presided over the court.",
              "idiomatic": "He honored his mother as Empress Dowager, and she took charge of court affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0006",
          "zh": "三月丁酉，改淮陽為陳國，楚郡為彭城國，西平幷汝南郡，六安復為廬江郡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Dingyou day: He changed Huaiyang to Chen Kingdom, Chu commandery to Pengcheng Kingdom, merged Xiping into Runan commandery, restored Liu'an to Lujiang commandery.",
              "idiomatic": "On the Dingyou day of the third month, he changed Huaiyang commandery to Chen Kingdom, Chu commandery to Pengcheng Kingdom, merged Xiping into Runan commandery, and restored Liu'an to Lujiang commandery.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0007",
          "zh": "遺詔徙西平王羨為陳王，六安王恭為彭城王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Testamentary edict transferred King Xian of Xiping to King of Chen, King Gong of Liu'an to King of Pengcheng.",
              "idiomatic": "By testamentary decree, King Xian of Xiping was transferred to become King of Chen, and King Gong of Liu'an to become King of Pengcheng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0008",
          "zh": "癸卯，葬孝章皇帝于敬陵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guimao day: He buried Filial Emperor Zhang in the Jing Tomb.",
              "idiomatic": "On the Guimao day, Emperor Zhang was buried in the Jing imperial tomb.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0009",
          "zh": "庚戌，皇太后詔曰：『先帝以明聖，奉承祖宗至德要道，天下清靜，庶事咸寧。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengxu day: Empress Dowager's edict said: 'The late Emperor with enlightened sagacity upheld the ancestors' supreme virtue and essential Way, the world was tranquil, all affairs were at peace.",
              "idiomatic": "On the Gengxu day, the Empress Dowager issued an edict stating: 'The late Emperor, with enlightened wisdom, upheld our ancestors' supreme virtue and essential principles, bringing tranquility to the realm and peace to all matters.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0010",
          "zh": "今皇帝以幼年，煢煢在疚，朕且佐助聽政。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now the Emperor at young age, alone in mourning, I will assist in administering government.",
              "idiomatic": "Now the Emperor is young and alone in his mourning, so I will assist in overseeing the administration of government.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0011",
          "zh": "外有大國賢王並為蕃屏，內有公卿大夫統理本朝，恭己受成，夫何憂哉！",
          "translations": [
            {
              "lang": "en",
              "literal": "Externally there are great kingdoms' worthy kings serving as protective screens, internally there are dukes, ministers, and grandees managing the ancestral court, reverently accepting accomplishments—what worry is there!",
              "idiomatic": "Externally we have the worthy kings of great states serving as protective barriers, internally we have the dukes, ministers, and officials managing the imperial court; by reverently accepting their accomplishments, what cause is there for worry?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0012",
          "zh": "然守文之際，必有內輔以參聽斷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet during a period of maintaining cultural norms, there must be internal assistance to participate in hearing and deciding.",
              "idiomatic": "However, during a time of maintaining established institutions, there must be internal advisors to participate in deliberations and decisions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0013",
          "zh": "侍中憲，朕之元兄，行能兼備，忠孝尤篤，先帝所器，親受遺詔，當以舊典輔斯職焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Attendant-in-Ordinary Xian, my eldest brother, conduct and ability both complete, loyalty and filial piety especially profound, valued by the late Emperor, personally received the testamentary edict, should by old precedents assist in this office.",
              "idiomatic": "Attendant-in-Ordinary Xian, my eldest brother, combines both conduct and ability, with exceptional loyalty and filial piety; he was valued by the late Emperor, personally received the testamentary decree, and should assist in this position according to established precedents.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0014",
          "zh": "憲固執謙讓，節不可奪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xian firmly insisted on declining, his integrity could not be overcome.",
              "idiomatic": "Xian steadfastly declined with humility, and his principled resolve could not be shaken.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0015",
          "zh": "今供養兩宮，宿衛左右，厥事已重，亦不可復勞以政事。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now attending to both palaces, guarding left and right, those duties are already heavy, also cannot again burden with governmental affairs.",
              "idiomatic": "Now he attends to both the imperial palaces, guards the emperor on left and right; those responsibilities are already heavy, and he cannot be further burdened with governmental affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0016",
          "zh": "故太尉鄧彪，元功之族，三讓彌高，海內歸仁，為群賢首，先帝褒表，欲以崇化。",
          "translations": [
            {
              "lang": "en",
              "literal": "Former Grand Marshal Deng Biao, clan of primary merit, three declines made him ever higher, the world turned to benevolence, head of the assembled worthies, praised and honored by the late Emperor, wishing to elevate culture.",
              "idiomatic": "The former Grand Marshal Deng Biao, from a clan of founding merit, grew ever more exalted through three refusals of office; the realm turned to him in admiration, making him the foremost of all worthy men; the late Emperor praised and honored him, desiring to promote virtuous transformation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0017",
          "zh": "今彪聰明康強，可謂老成黃耇矣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now Biao is intelligent and robust in health, can be called mature and venerable elder.",
              "idiomatic": "Now Biao is intelligent and in vigorous health; he can truly be called a mature and venerable elder.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0018",
          "zh": "其以彪為太傅，賜爵關內侯，錄尚書事，百官總己以聽，朕庶幾得專心內位。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let Biao be made Grand Tutor, granted the noble rank of Marquis within the Pass, record the affairs of the Masters of Writing, all officials report to him to listen, I perhaps can concentrate on the inner position.",
              "idiomatic": "Let Biao be appointed Grand Tutor, granted the title of Marquis within the Pass, oversee the affairs of the Imperial Secretariat; all officials shall report to him for decisions, so that I may focus my attention on the inner palace.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0019",
          "zh": "於戲！",
          "translations": [
            {
              "lang": "en",
              "literal": "Alas!",
              "idiomatic": "Alas!",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0020",
          "zh": "群公其勉率百僚，各修厥職，愛養元元，綏以中和，稱朕意焉。』",
          "translations": [
            {
              "lang": "en",
              "literal": "All the lords should earnestly lead the hundred officials, each cultivate their duties, cherish and nurture the common people, pacify with central harmony, fulfill my intentions.''",
              "idiomatic": "All you lords should diligently lead the officials, each attending to their responsibilities, cherishing and nurturing the common people, governing with balanced harmony, and thus fulfill my wishes.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0021",
          "zh": "辛酉，有司上奏：『孝章皇帝崇弘鴻業，德化普洽，垂意黎民，留念稼穡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinyou day: The officials submitted a memorial: 'Filial Emperor Zhang exalted and broadened the great enterprise, moral transformation universally pervasive, extended care to the black-haired people, preserved thought for agriculture.",
              "idiomatic": "On the Xinyou day, the officials submitted a memorial stating: 'The Filial Emperor Zhang exalted and expanded the great imperial enterprise, his moral influence spread universally, he showed concern for the common people, and kept agriculture in mind.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0022",
          "zh": "文加殊俗，武暢方表，界惟人面，無思不服。",
          "translations": [
            {
              "lang": "en",
              "literal": "Culture added to different customs, military extended to distant borders, as far as human faces reached, none who did not submit.",
              "idiomatic": "His civilizing influence reached foreign peoples, his military power extended to distant frontiers; wherever human habitation existed, none failed to submit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0023",
          "zh": "巍巍蕩蕩，莫與比隆。",
          "translations": [
            {
              "lang": "en",
              "literal": "Lofty and vast, none can compare in grandeur.",
              "idiomatic": "Majestic and boundless, incomparable in glory.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0024",
          "zh": "《周頌》曰：「於穆清廟，肅雝顯相。」",
          "translations": [
            {
              "lang": "en",
              "literal": "'Zhou Eulogies' says: 'Ah, solemn pure temple, reverent and harmonious illustrious assistants.''",
              "idiomatic": "The 'Zhou Eulogies' states: 'Ah, solemn is the pure temple, reverent and harmonious are the illustrious assistants.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0025",
          "zh": "請上尊廟曰肅宗，共進《武德》之舞。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Request to honor the temple as Emperor Suzong, together present the 'Martial Virtue' dance.''",
              "idiomatic": "We request to honor his temple as Emperor Suzong and together perform the 'Martial Virtue' dance.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0026",
          "zh": "制曰：『可。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial decree said: 'Approved.''",
              "idiomatic": "An imperial decree stated: 'Approved.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0027",
          "zh": "癸亥，陳王羨、彭城王恭、樂成王黨、下邳王衍、梁王暢始就國。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guihai day: King Xian of Chen, King Gong of Pengcheng, King Dang of Yuecheng, King Yan of Xiapi, King Chang of Liang first proceeded to their kingdoms.",
              "idiomatic": "On the Guihai day, King Xian of Chen, King Gong of Pengcheng, King Dang of Yuecheng, King Yan of Xiapi, and King Chang of Liang first took up residence in their respective kingdoms.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0028",
          "zh": "夏四月丙子，謁高廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Bingzi day: He paid respects at the High Temple.",
              "idiomatic": "On the Bingzi day of the fourth month of summer, he paid respects at the High Temple.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0029",
          "zh": "丁丑，謁世祖廟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingchou day: He paid respects at the Shizu Temple.",
              "idiomatic": "On the Dingchou day, he paid respects at the Temple of Emperor Guangwu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0030",
          "zh": "戊寅，詔曰：『昔孝武皇帝致誅胡、越，故權收鹽鐵之利，以奉師旅之費。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuyin day: Imperial edict said: 'Formerly Filial Emperor Wu executed campaigns against the Hu and Yue, therefore temporarily collected the profits from salt and iron, to supply the expenses of the armies.",
              "idiomatic": "On the Wuyin day, an imperial edict stated: 'In former times, Emperor Wu waged campaigns against the Xiongnu and Yue peoples, and therefore temporarily monopolized the profits from salt and iron to fund military expenditures.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0031",
          "zh": "自中興以來，匈奴未賓，永平末年，復修征伐。",
          "translations": [
            {
              "lang": "en",
              "literal": "Since the Restoration, the Xiongnu have not submitted, at the end of Yongping years, again prepared campaigns.",
              "idiomatic": "Since the dynasty's restoration, the Xiongnu had not submitted; at the end of the Yongping era, campaigns were again undertaken against them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0032",
          "zh": "先帝即位，務休力役，然猶深思遠慮，安不忘危，探觀舊典，復收鹽鐵，欲以防備不虞，寧安邊境。",
          "translations": [
            {
              "lang": "en",
              "literal": "The late Emperor upon ascending the throne, diligently rested the corvee labor, yet still deeply pondered far-reaching concerns, at peace but not forgetting danger, investigated and viewed the old canons, again collected salt and iron, desiring to prepare for the unexpected, pacify and secure the border regions.",
              "idiomatic": "When the late Emperor ascended the throne, he diligently allowed the people to rest from corvee labor, yet he still pondered deeply and planned carefully, remaining at peace but vigilant against danger; he examined the ancient institutions and once again monopolized salt and iron production, desiring to prepare for unforeseen circumstances and secure the frontier regions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0033",
          "zh": "而吏多不良，動失其便，以違上意。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet officials were mostly not good, often lost the advantage, thus contravening the imperial will.",
              "idiomatic": "However, most officials were incompetent and frequently mishandled matters to their detriment, thereby going against the emperor's intentions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0034",
          "zh": "先帝恨之，故遺戒郡國罷鹽鐵之禁，縱民煮鑄，入稅縣官如故事。",
          "translations": [
            {
              "lang": "en",
              "literal": "The late Emperor resented it, therefore left instructions to commanderies and kingdoms to abolish the salt and iron prohibitions, allow the people to boil and cast, pay taxes to the county officials as in former practice.",
              "idiomatic": "The late Emperor was displeased by this and therefore left instructions for the commanderies and kingdoms to abolish the salt and iron monopolies, allowing the people to freely produce salt and iron and pay taxes to the government as had been done previously.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0035",
          "zh": "其申勑刺史、二千石，奉順聖旨，勉弘德化，布告天下，使明知朕意。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Let them earnestly exhort the inspectors and two thousand shi officials, follow and obey the sacred decrees, diligently expand moral transformation, proclaim to the world, cause them to clearly know my intentions.''",
              "idiomatic": "Let them earnestly instruct the inspectors and officials of two thousand shi rank to follow and obey the imperial decrees, diligently promote virtuous transformation, and proclaim this throughout the realm so that my intentions are clearly understood.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0036",
          "zh": "五月，京師旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month: The capital suffered drought.",
              "idiomatic": "In the fifth month, the capital region experienced drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0037",
          "zh": "詔長樂少府桓郁侍講禁中。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict ordered Chamberlain for the Palace Revenues Huan Yu to serve as lecturer in the inner palace.",
              "idiomatic": "By imperial edict, Huan Yu, Chamberlain for the Palace Revenues, was ordered to serve as lecturer in the imperial residence.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0038",
          "zh": "冬十月乙亥，以侍中竇憲為車騎將軍，伐北匈奴。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Yihai day: Appointed Attendant-in-Ordinary Dou Xian as Cavalry General, to campaign against the Northern Xiongnu.",
              "idiomatic": "On the Yihai day of the tenth month of winter, Dou Xian was appointed Cavalry General to lead a campaign against the Northern Xiongnu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0039",
          "zh": "安息國遣使獻師子、扶拔。",
          "translations": [
            {
              "lang": "en",
              "literal": "The kingdom of Anxi dispatched envoys to present lions and elephants.",
              "idiomatic": "The Parthian kingdom sent envoys to present lions and elephants as tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0040",
          "zh": "永元元年春三月甲辰，初令郎官詔除者得占丞、尉，以比秩為真。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yongyuan first year, spring, third month, Jiachen day: For the first time ordered that court gentlemen dismissed by edict may occupy the positions of assistant and captain, treating probationary rank as permanent.",
              "idiomatic": "On the Jiachen day of the third month of spring in the first year of Yongyuan, it was decreed for the first time that court gentlemen dismissed by imperial edict could take up the positions of assistant magistrate and captain, with their probationary ranks becoming permanent.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0041",
          "zh": "夏六月，車騎將軍竇憲出雞鹿塞，度遼將軍鄧鴻出稒陽塞，南單于出滿夷谷，與北匈奴戰於稽落山，大破之，追至私渠比鞮海。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, sixth month: Cavalry General Dou Xian went out through Jilu Pass, General of Liaodong Deng Hong went out through Zuyang Pass, Southern Chanyu went out through Manli Valley, battled the Northern Xiongnu at Jiluo Mountain, greatly defeated them, pursued to Siqiu Bidihai.",
              "idiomatic": "In the sixth month of summer, Cavalry General Dou Xian advanced through the Jilu Pass, General of Liaodong Deng Hong through the Zuyang Pass, and the Southern Chanyu through the Manli Valley; they fought the Northern Xiongnu at Jiluo Mountain, inflicted a major defeat, and pursued them as far as the Siqiu Bidihai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0042",
          "zh": "竇憲遂登燕然山，刻石勒功而還。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dou Xian then ascended Yanran Mountain, carved stone to record the achievements and returned.",
              "idiomatic": "Dou Xian then climbed Mount Yanran, had a stone inscription carved to record the victory, and returned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0043",
          "zh": "北單于遣弟右溫禺鞮王奉奏貢獻。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Northern Chanyu sent his younger brother Right Wen Yurdi Wang to present a memorial and tribute.",
              "idiomatic": "The Northern Chanyu sent his younger brother, the Right Wen Yurdi Wang, to present a memorial and offer tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0044",
          "zh": "秋七月乙未，會稽山崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Yiyou day: Mount Kuaiji collapsed.",
              "idiomatic": "On the Yiyou day of the seventh month of autumn, Mount Kuaiji suffered a landslide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0045",
          "zh": "閏月丙子，詔曰：『匈奴背叛，為害久遠。",
          "translations": [
            {
              "lang": "en",
              "literal": "Intercalary month, Bingzi day: Imperial edict said: 'The Xiongnu have turned their backs and rebelled, causing harm for a long time.",
              "idiomatic": "On the Bingzi day of the intercalary month, an imperial edict stated: 'The Xiongnu have betrayed their allegiance and caused harm for many years.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0046",
          "zh": "賴祖宗之靈，師克有捷，醜虜破碎，遂掃厥庭，役不再籍，萬里清蕩，非朕小子眇身所能克堪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Relying on the spirits of the ancestors, the army achieved victory, the vile captives were smashed, thus sweeping their court, conscription not repeated, ten thousand li cleared and cleansed, not something my young and insignificant person could accomplish.'",
              "idiomatic": "Thanks to the blessings of our ancestors, the army achieved victory, the vile barbarians were utterly defeated, their very hearths swept clean; military conscription need not be repeated, and the realm for ten thousand li is now pacified—this is beyond what my unworthy person could have accomplished.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0047",
          "zh": "有司其案舊典，告類薦功，以章休烈。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials should examine the old canons, announce to the ancestral spirits and recommend merits, to manifest the auspicious achievements.''",
              "idiomatic": "The officials should consult the ancient precedents, make announcements to the ancestral spirits and commend the meritorious, to proclaim these glorious accomplishments.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0048",
          "zh": "九月庚申，以車騎將軍竇憲為大將軍，以中郎將劉尚為車騎將軍。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Gengshen day: Appointed Cavalry General Dou Xian as Grand General, appointed Colonel Liu Shang as Cavalry General.",
              "idiomatic": "On the Gengshen day of the ninth month, Dou Xian was appointed Grand General, and Liu Shang was appointed Cavalry General.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0049",
          "zh": "冬十月，令郡國刑輸作軍營，其徙出塞者，刑雖未竟，皆免歸田里。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month: Ordered commanderies and kingdoms to send convicts to labor in military camps, those exiled beyond the frontier, even if their sentences were not completed, all pardoned and allowed to return to their villages.",
              "idiomatic": "In the tenth month of winter, he ordered the commanderies and kingdoms to send convicts to work in military camps; even those exiled beyond the frontier whose sentences were incomplete were all pardoned and permitted to return to their home villages.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0050",
          "zh": "庚子，阜陵王延薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengzi day: King Yan of Fuling passed away.",
              "idiomatic": "On the Gengzi day, King Yan of Fuling died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0051",
          "zh": "是歲，郡國九大水。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, nine commanderies and kingdoms experienced major flooding.",
              "idiomatic": "This year, nine commanderies and kingdoms suffered severe flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0052",
          "zh": "二年春正月丁丑，大赦天下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second year, spring, first month, Dingchou day: Great amnesty throughout the realm.",
              "idiomatic": "On the Dingchou day of the first month of spring in the second year, a general amnesty was granted throughout the empire.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0053",
          "zh": "二月壬午，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month, Renwu day: There was a solar eclipse.",
              "idiomatic": "On the Renwu day of the second month, there was an eclipse of the sun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0054",
          "zh": "己亥，復置西河、上郡屬國都尉官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jihai day: Again established the offices of Commandant of the Dependent State for Xihe and Shangjun.",
              "idiomatic": "On the Jihai day, the offices of Commandant of the Dependent State were reestablished for Xihe and Shangjun commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0055",
          "zh": "夏五月庚戌，分太山為濟北國，分樂成、涿郡、勃海為河間國。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fifth month, Gengxu day: Divided Taishan to form Jibei Kingdom, divided Yuecheng, Zhuojun, and Bohai to form Hejian Kingdom.",
              "idiomatic": "On the Gengxu day of the fifth month of summer, Taishan commandery was divided to form Jibei Kingdom, and Yuecheng, Zhuojun, and Bohai were divided to form Hejian Kingdom.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0056",
          "zh": "丙辰，封皇弟壽為濟北王，開為河間王，淑為城陽王，紹封故淮陽王昞子側為常山王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingchen day: Enfeoffed imperial younger brother Shou as King of Jibei, Kai as King of Hejian, Shu as King of Chengyang, continued enfeoffment of Ce, son of the former King Biao of Huaiyang, as King of Changshan.",
              "idiomatic": "On the Bingchen day, his younger brothers were enfeoffed: Shou as King of Jibei, Kai as King of Hejian, and Shu as King of Chengyang; and Ce, son of the former King Biao of Huaiyang, was granted continued enfeoffment as King of Changshan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0057",
          "zh": "賜公卿以下至佐史錢、布各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted money and cloth to dukes, ministers, and below down to assistants and scribes, each according to their rank.",
              "idiomatic": "He bestowed money and cloth upon the dukes and ministers and below, down to the assistants and scribes, each according to their position.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0058",
          "zh": "己未，遣副校尉閻磐討北匈奴，取伊吾盧地。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jiwei day: Dispatched Vice Colonel Yan Pan to campaign against the Northern Xiongnu, took the Yiwu fortress territory.",
              "idiomatic": "On the Jiwei day, Vice Colonel Yan Pan was dispatched to campaign against the Northern Xiongnu and captured the fortress territory of Yiwu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0059",
          "zh": "丁卯，紹封故齊王晃子無忌為齊王，北海王睦子威為北海王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingmao day: Continued enfeoffment of Wuji, son of the former King Huang of Qi, as King of Qi, Wei, son of King Mu of Beihai, as King of Beihai.",
              "idiomatic": "On the Dingmao day, Wuji, son of the former King Huang of Qi, was granted continued enfeoffment as King of Qi, and Wei, son of King Mu of Beihai, as King of Beihai.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0060",
          "zh": "車師前後王並遣子入侍。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Cheshi Front and Rear Kings both sent their sons to enter service.",
              "idiomatic": "Both the Front King and Rear King of Cheshi sent their sons to serve at court.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0061",
          "zh": "月氏國遣兵攻西域長史班超，超擊降之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The kingdom of Yuezhi dispatched troops to attack the Western Regions Grand Administrator Ban Chao, Chao attacked and defeated them.",
              "idiomatic": "The Yuezhi kingdom sent troops to attack Grand Administrator Ban Chao of the Western Regions, but Ban Chao attacked and subdued them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0062",
          "zh": "六月辛卯，中山王焉薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Xinmao day: King Yan of Zhongshan passed away.",
              "idiomatic": "On the Xinmao day of the sixth month, King Yan of Zhongshan died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0063",
          "zh": "秋七月乙卯，大將軍竇憲出屯涼州。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Yimao day: Grand General Dou Xian went out to garrison Liangzhou.",
              "idiomatic": "On the Yimao day of the seventh month of autumn, Grand General Dou Xian went out to station troops in Liangzhou.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0064",
          "zh": "九月，北匈奴遣使稱臣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month: The Northern Xiongnu dispatched envoys to profess vassalage.",
              "idiomatic": "In the ninth month, the Northern Xiongnu sent envoys to declare themselves subjects.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0065",
          "zh": "冬十月，遣行中郎將班固報命南單于。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month: Dispatched Acting Colonel Ban Gu to convey the imperial mandate to the Southern Chanyu.",
              "idiomatic": "In the tenth month of winter, Acting Colonel Ban Gu was dispatched to deliver the imperial decree to the Southern Chanyu.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0066",
          "zh": "遣左谷蠡王師子出雞鹿塞，擊北匈奴於河雲北，大破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dispatched Left Guli King Shi Zi to go out through Jilu Pass, attacked the Northern Xiongnu north of Heyun, greatly defeated them.",
              "idiomatic": "The Left Guli King Shi Zi was dispatched through the Jilu Pass to attack the Northern Xiongnu north of Heyun, where he inflicted a major defeat upon them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0067",
          "zh": "三年春正月甲子，皇帝加元服，賜諸侯王、公、將軍、特進、中二千石、列侯、宗室子孫在京師奉朝請者黃金，將、大夫、郎吏、從官帛。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third year, spring, first month, Jiazi day: The Emperor assumed the cap of manhood, granted gold to regional kings, dukes, generals, senior retainers, middle two thousand shi, marquises, and imperial clansmen descendants in the capital who presented at court; granted silk to commanders, grandees, court gentlemen officials, and attendant officials.",
              "idiomatic": "On the Jiazi day of the first month of spring in the third year, the Emperor came of age and assumed the cap of manhood; he granted gold to the regional kings, dukes, generals, senior retainers, officials of middle two thousand shi rank, marquises, and imperial clansmen in the capital who attended court; and silk to commanders, grandees, court gentlemen, and attendant officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0068",
          "zh": "賜民爵及粟帛各有差，大酺五日。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted noble ranks and grain and silk to the people each according to their status, great feast for five days.",
              "idiomatic": "The common people were granted noble ranks and varying amounts of grain and silk according to their status, and a grand festival was held for five days.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0069",
          "zh": "郡國中都官繫囚死罪贖縑，至司寇及亡命，各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Commandery and kingdom central offices' imprisoned convicts with death sentences redeemed with silk, down to prison guards and fugitives, each according to their circumstances.",
              "idiomatic": "Prisoners in commandery and kingdom central offices sentenced to death could redeem their sentences with silk; the same applied to those sentenced to prison guard duty and fugitives, each according to their specific circumstances.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0070",
          "zh": "庚辰，賜京師民酺，布兩戶共一匹。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengchen day: Granted feast to the capital people, cloth shared by two households one bolt.",
              "idiomatic": "On the Gengchen day, the people of the capital were granted a festival, with one bolt of cloth shared between two households.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0071",
          "zh": "二月，大將軍竇憲遣左校尉耿夔出居延塞，圍北單于於金微山，大破之，獲其母閼氏。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month: Grand General Dou Xian dispatched Left Colonel Geng Kui to go out through the Juyan Pass, surrounded the Northern Chanyu at Jinwei Mountain, greatly defeated him, captured his mother the Yanzhi.",
              "idiomatic": "In the second month, Grand General Dou Xian sent Left Colonel Geng Kui through the Juyan Pass to surround the Northern Chanyu at Jinwei Mountain, where he inflicted a major defeat and captured the Chanyu's mother, the Yanzhi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0072",
          "zh": "夏六月辛卯，尊皇太後母比陽公主為長公主。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, sixth month, Xinmao day: Honored the Empress Dowager's mother Princess Biyang as Grand Princess.",
              "idiomatic": "On the Xinmao day of the sixth month of summer, the Empress Dowager's mother, Princess Biyang, was honored as Grand Princess.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0073",
          "zh": "辛丑，阜陵王種薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinchou day: King Zhong of Fuling passed away.",
              "idiomatic": "On the Xinchou day, King Zhong of Fuling died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0074",
          "zh": "冬十月癸未，行幸長安。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Guiwei day: Made a progress to Chang'an.",
              "idiomatic": "On the Guiwei day of the tenth month of winter, he made an imperial journey to Chang'an.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0075",
          "zh": "詔曰：『北狄破滅，名王仍降，西域諸國，納質內附，豈非祖宗迪哲重光之鴻烈歟？",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict said: 'The Northern barbarians have been destroyed, famous kings repeatedly surrender, Western Regions various kingdoms present hostages and submit internally, could this not be the great achievement of our ancestors' enlightened wisdom and renewed brilliance?",
              "idiomatic": "An imperial edict stated: 'The northern barbarians have been utterly destroyed, renowned kings have repeatedly surrendered, the various kingdoms of the Western Regions have submitted hostages and joined us—could this not be the magnificent achievement of our ancestors' enlightened wisdom and restored glory?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0076",
          "zh": "寤寐嘆息，想望舊京。",
          "translations": [
            {
              "lang": "en",
              "literal": "Awake and asleep sighing, longing for the old capital.'",
              "idiomatic": "Constantly sighing whether awake or asleep, longing for the former capital.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0077",
          "zh": "其賜行所過二千石長吏已下及三老、官屬錢帛，各有差；",
          "translations": [
            {
              "lang": "en",
              "literal": "Grant money and silk to the two thousand shi senior officials and below that the procession passes, as well as the Three Elders and officials, each according to their rank;",
              "idiomatic": "Grant money and silk to the senior officials of two thousand shi rank and below along the route of the procession, as well as to the Three Elders and other officials, each according to their position;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0078",
          "zh": "鰥、寡、孤、獨、篤癃、貧不能自存者粟，人三斛。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Widowers, widows, orphans, the solitary, the severely ill, and the poor who cannot support themselves: grain, each three dou.''",
              "idiomatic": "Widowers, widows, orphans, the childless elderly, the gravely ill, and the impoverished who cannot sustain themselves shall each receive three dou of grain.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0079",
          "zh": "十一月癸卯，祠高廟，遂有事十一陵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, Guimao day: Sacrificed at the High Temple, then conducted ceremonies at the eleven imperial tombs.",
              "idiomatic": "On the Guimao day of the eleventh month, he performed sacrifices at the High Temple and then conducted ceremonies at the eleven imperial tombs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0080",
          "zh": "詔曰：『高祖功臣，蕭、曹為首，有傳世不絕之義。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict said: 'Gaozu's meritorious officials, Xiao and Cao were the foremost, there is the principle of inheritance that should not be cut off.",
              "idiomatic": "An imperial edict stated: 'Among Gaozu's meritorious officials, Xiao and Cao were the most prominent, and there is the principle that their lines of inheritance should continue unbroken.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0081",
          "zh": "曹相國後容城侯無嗣。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Marquis of Rongcheng, descendant of Chancellor Cao, has no heir.",
              "idiomatic": "The Marquis of Rongcheng, who is a descendant of Chancellor Cao, has no heir.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0082",
          "zh": "朕望長陵東門，見二臣之壠，循其遠節，每有感焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "I gaze at the east gate of Changling, see the tombs of these two ministers, follow their distant integrity, always moved thereby.",
              "idiomatic": "When I gaze at the east gate of Changling and see the tombs of these two ministers, I am always moved by their exemplary integrity from long ago.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0083",
          "zh": "忠義獲寵，古今所同。",
          "translations": [
            {
              "lang": "en",
              "literal": "Loyalty and righteousness obtaining favor, is the same in ancient and modern times.",
              "idiomatic": "Loyalty and righteousness receiving favor is a principle that has remained the same from ancient times to the present.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0084",
          "zh": "可遣使者以中牢祠，大鴻臚求近親宜為嗣者，須景風紹封，以章厥功。』",
          "translations": [
            {
              "lang": "en",
              "literal": "May dispatch envoys to sacrifice with the middle sacrificial animals, Grand Herald to seek close relatives suitable to be heirs, await the gentle breeze to continue the enfeoffment, to proclaim their achievements.''",
              "idiomatic": "Envoys should be dispatched to perform sacrifices with the middle sacrificial animals, and the Grand Herald should seek suitable close relatives to serve as heirs; when favorable conditions arise, continue the enfeoffment to proclaim their meritorious deeds.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0085",
          "zh": "十二月，復置西域都護、騎都尉、戊己校尉官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month: Again established the offices of Western Regions Protector General, Cavalry Colonel, and Wu-Ji Colonels.",
              "idiomatic": "In the twelfth month, the offices of Protector General of the Western Regions, Cavalry Colonel, and Wu-Ji Colonels were reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0086",
          "zh": "庚辰，至自長安，減刑徒從駕者刑五月。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengchen day: Arrived from Chang'an, reduced the sentences of convicts who accompanied the imperial carriage by five months.",
              "idiomatic": "On the Gengchen day, upon returning from Chang'an, the sentences of convicts who accompanied the imperial procession were reduced by five months.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0087",
          "zh": "四年春正月，北匈奴右谷蠡王於除鞬自立為單于，款塞乞降。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fourth year, spring, first month: The Northern Xiongnu Right Guli King Yu Chujian established himself as Chanyu, knocked on the frontier and begged to surrender.",
              "idiomatic": "In the first month of spring of the fourth year, the Right Guli King Yu Chujian of the Northern Xiongnu proclaimed himself Chanyu and came to the frontier begging to submit.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0088",
          "zh": "遣大將軍左校尉耿夔授璽綬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dispatched Grand General Left Colonel Geng Kui to confer the seal and tassels.",
              "idiomatic": "The Grand General's Left Colonel Geng Kui was dispatched to confer the imperial seal and tassels.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0089",
          "zh": "三月癸丑，司徒袁安薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Guiyou day: Minister of the Masses Yuan An passed away.",
              "idiomatic": "On the Guiyou day of the third month, Minister of the Masses Yuan An died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0090",
          "zh": "閏月丁丑，太常丁鴻為司徒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Intercalary month, Dingchou day: Grand Herald Ding Hong became Minister of the Masses.",
              "idiomatic": "On the Dingchou day of the intercalary month, Ding Hong, the Grand Herald, was appointed Minister of the Masses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0091",
          "zh": "夏四月丙辰，大將軍竇憲還至京師。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Bingchen day: Grand General Dou Xian returned to the capital.",
              "idiomatic": "On the Bingchen day of the fourth month of summer, Grand General Dou Xian returned to the capital.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0092",
          "zh": "六月戊戌朔，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Wuxu day, first day of the month: There was a solar eclipse.",
              "idiomatic": "On the first day of the sixth month, the Wuxu day, there was an eclipse of the sun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0093",
          "zh": "丙辰，郡國十三地震。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingchen day: Thirteen commanderies and kingdoms experienced earthquakes.",
              "idiomatic": "On the Bingchen day, thirteen commanderies and kingdoms suffered earthquakes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0094",
          "zh": "竇憲潛圖弒逆。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dou Xian secretly plotted regicide and rebellion.",
              "idiomatic": "Dou Xian secretly plotted to assassinate the emperor and rebel.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0095",
          "zh": "庚申，幸北宮。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengshen day: Made a progress to the Northern Palace.",
              "idiomatic": "On the Gengshen day, he made a visit to the Northern Palace.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0096",
          "zh": "詔收捕憲黨射聲校尉郭璜，璜子侍中舉，衛尉鄧疊，疊弟步兵校尉磊。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict ordered the arrest of Dou Xian's partisans: Colonel of the Archers Guo Huang, Huang's son Attendant-in-Ordinary Ju, Commander of the Guards Deng Die, Die's younger brother Infantry Colonel Lei.",
              "idiomatic": "By imperial edict, Dou Xian's confederates were ordered arrested: Colonel of the Archers Guo Huang, Huang's son Attendant-in-Ordinary Ju, Commander of the Guards Deng Die, and Die's younger brother Infantry Colonel Lei.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0097",
          "zh": "皆下獄死。",
          "translations": [
            {
              "lang": "en",
              "literal": "All were imprisoned and died.",
              "idiomatic": "All were imprisoned and executed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0098",
          "zh": "使謁者僕射收憲大將軍印綬，遣憲及弟篤、景就國，到皆自殺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ordered the Palace Attendant Commander to seize Dou Xian's Grand General seal and tassels, sent Dou Xian and his younger brothers Du and Jing to their kingdoms, upon arrival all committed suicide.",
              "idiomatic": "The Palace Attendant Commander was ordered to confiscate Dou Xian's Grand General seal and tassels; Dou Xian and his younger brothers Du and Jing were sent to their kingdoms, where they all committed suicide upon arrival.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0099",
          "zh": "是夏、旱、蝗。",
          "translations": [
            {
              "lang": "en",
              "literal": "This summer: drought and locusts.",
              "idiomatic": "This summer brought drought and locust infestations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0100",
          "zh": "秋七月己丑，太尉宋由坐黨憲自殺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Jichou day: Grand Marshal Song You, because of being allied with Dou Xian, committed suicide.",
              "idiomatic": "On the Jichou day of the seventh month of autumn, Grand Marshal Song You committed suicide for his association with Dou Xian.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0101",
          "zh": "八月辛亥，司空任隗薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth month, Xinhai day: Minister of Works Ren Kui passed away.",
              "idiomatic": "On the Xinhai day of the eighth month, Minister of Works Ren Kui died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0102",
          "zh": "癸丑，大司農尹睦為太尉，錄尚書事。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guiyou day: Grand Minister of Agriculture Yin Mu became Grand Marshal, overseeing the affairs of the Masters of Writing.",
              "idiomatic": "On the Guiyou day, Yin Mu, the Grand Minister of Agriculture, was appointed Grand Marshal and put in charge of the Imperial Secretariat.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0103",
          "zh": "丁巳，賜公卿以下至佐史錢、穀各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingsi day: Granted money and grain to the dukes and ministers and below down to the assistants and scribes, each according to their rank.",
              "idiomatic": "On the Dingsi day, money and grain were granted to the dukes and ministers and below, down to the assistants and scribes, each according to their position.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0104",
          "zh": "冬十月己亥，宗正劉方為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Jihai day: Director of the Imperial Clan Liu Fang became Minister of Works.",
              "idiomatic": "On the Jihai day of the tenth month of winter, Liu Fang, the Director of the Imperial Clan, was appointed Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0105",
          "zh": "十二月壬辰，詔：『今年郡國秋稼為旱、蝗所傷，其什四以上勿收田租、芻稾；",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month, Renchen day: Imperial edict: 'This year the autumn harvests of the commanderies and kingdoms have been injured by drought and locusts, those exceeding four-tenths shall not collect land taxes and fodder;",
              "idiomatic": "On the Renchen day of the twelfth month, an imperial edict stated: 'This year the autumn crops of the commanderies and kingdoms have been damaged by drought and locusts; for those areas where the damage exceeds 40%, land taxes and fodder shall not be collected;'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0106",
          "zh": "有不滿者，以實除之。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Those who do not reach the amount, remove them based on actual conditions.''",
              "idiomatic": "For those who do not meet the requirements, remove them according to the actual circumstances.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0107",
          "zh": "武陵零陵澧中蠻叛。",
          "translations": [
            {
              "lang": "en",
              "literal": "The barbarians of Wuling, Lingling, and the Li River region rebelled.",
              "idiomatic": "The barbarians in Wuling commandery, Lingling commandery, and the Li River area rebelled.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0108",
          "zh": "燒當羌寇金城。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Shaodang Qiang raided Jincheng.",
              "idiomatic": "The Shaodang Qiang tribe raided Jincheng commandery.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0109",
          "zh": "五年春正月乙亥，宗祀五帝於明堂，遂登靈臺，望雲物。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth year, spring, first month, Yihai day: Ancestral sacrifices to the Five Emperors in the Bright Hall, then ascended the Spirit Platform to observe the cloud formations.",
              "idiomatic": "On the Yihai day of the first month of spring in the fifth year, ancestral sacrifices were performed to the Five Emperors in the Bright Hall, after which he ascended the Spirit Platform to observe the cloud formations.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0110",
          "zh": "大赦天下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Great amnesty throughout the realm.",
              "idiomatic": "A general amnesty was granted throughout the empire.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0111",
          "zh": "戊子，千乘王伉薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuzi day: King Kang of Qiancheng passed away.",
              "idiomatic": "On the Wuzi day, King Kang of Qiancheng died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0112",
          "zh": "辛卯，封皇帝萬歲為廣宗王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinmao day: Enfeoffed the Emperor's Wan Sui as King of Guangzong.",
              "idiomatic": "On the Xinmao day, the emperor's Wan Sui was enfeoffed as King of Guangzong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0113",
          "zh": "二月戊戌，詔有司省減內外廄及涼州諸苑馬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month, Wuxu day: Imperial edict ordered the officials to reduce the inner and outer stables and the horses in the various parks of Liangzhou.",
              "idiomatic": "On the Wuxu day of the second month, an imperial edict ordered the officials to reduce the numbers of horses in the inner and outer imperial stables and the various parks of Liangzhou.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0114",
          "zh": "自京師離宮果園上林廣成囿悉以假貧民，恣得采捕，不收其稅。",
          "translations": [
            {
              "lang": "en",
              "literal": "The detached palaces, orchards, and Shanglin Guangcheng parks in the capital were all loaned to poor people, they could freely gather and hunt, taxes were not collected from them.",
              "idiomatic": "All the detached palaces, orchards, and the Shanglin and Guangcheng parks in the capital were loaned to the poor, allowing them to freely gather and hunt without collecting taxes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0115",
          "zh": "丁未，詔曰：『去年秋麥入少，恐民食不足。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingwei day: Imperial edict said: 'Last year's autumn wheat harvest was small, fearing that the people's food is insufficient.",
              "idiomatic": "On the Dingwei day, an imperial edict stated: 'Last year's autumn wheat harvest was meager, and I fear the people may not have enough food.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0116",
          "zh": "其上尤貧不能自給者戶口人數。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let them submit the household and population numbers of those who are especially poor and cannot support themselves.",
              "idiomatic": "Let them report the numbers of households and people who are particularly impoverished and cannot support themselves.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0117",
          "zh": "往者郡國上貧民，以衣履釜鬵為貲，而豪右得其饒利。",
          "translations": [
            {
              "lang": "en",
              "literal": "Formerly when commanderies and kingdoms reported poor people, using clothing, shoes, pots, and pans as capital, yet the powerful and wealthy obtained their abundant profits.",
              "idiomatic": "In the past, when commanderies and kingdoms reported on the poor, using clothing, shoes, pots, and pans as the criteria, the powerful and wealthy elites still profited handsomely from the situation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0118",
          "zh": "詔書實覈，欲有以益之，而長吏不能躬親，反更徵召會聚，令失農作，愁擾百姓。",
          "translations": [
            {
              "lang": "en",
              "literal": "The edict wanted genuine investigation to benefit them, yet the senior officials could not personally attend, instead further summoned and assembled them, causing them to lose farm work and distressing and troubling the common people.",
              "idiomatic": "The edict called for genuine investigation to provide benefits, but the senior officials could not personally oversee this; instead, they further summoned and gathered the people, causing them to neglect farming and distressing the common people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0119",
          "zh": "若復有犯者，二千石先坐。』",
          "translations": [
            {
              "lang": "en",
              "literal": "If there are further violations, the two thousand shi officials shall be held responsible first.''",
              "idiomatic": "If there are further violations, the officials of two thousand shi rank shall be held primarily responsible.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0120",
          "zh": "甲寅，太傅鄧彪薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jiazi day: Grand Tutor Deng Biao passed away.",
              "idiomatic": "On the Jiazi day, Grand Tutor Deng Biao died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0121",
          "zh": "戊午，隴西地震。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuwu day: Longxi experienced an earthquake.",
              "idiomatic": "On the Wuwu day, Longxi commandery suffered an earthquake.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0122",
          "zh": "三月戊子，詔曰：『選舉良才，為政之本。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Wuzi day: Imperial edict said: 'Selecting worthy talents is the foundation of governance.",
              "idiomatic": "On the Wuzi day of the third month, an imperial edict stated: 'Selecting worthy talents is the foundation of good governance.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0123",
          "zh": "科別行能，必由鄉曲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Categorizing conduct and ability must come from the villages and hamlets.",
              "idiomatic": "Assessing conduct and ability must begin at the local village level.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0124",
          "zh": "而郡國舉吏，不加簡擇，故先帝明勑在所，令試之以職，乃得充選。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet commanderies and kingdoms recommend officials without careful selection, therefore the late Emperor's clear instructions to the localities ordered them to test with office, only then could they fill the selections.",
              "idiomatic": "However, commanderies and kingdoms recommend officials without proper scrutiny, so the late Emperor's clear instructions to local authorities required them to test candidates in office before they could be selected.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0125",
          "zh": "又德行尤異，不須經職者，別署狀上。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover, those whose virtue and conduct are exceptionally outstanding, who do not need to undergo office testing, separately sign and submit their records.",
              "idiomatic": "Furthermore, those whose moral character and conduct are exceptionally outstanding, who do not need to undergo office testing, should have their records specially signed and submitted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0126",
          "zh": "而宣布以來，出入九年，二千石曾不承奉，恣心從好，司隸、刺史訖無糾察。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet since the edict was announced, nine years have passed, the two thousand shi have never complied, indulging their hearts in favoritism, the Commandant of the Capital Region and inspectors have never investigated or corrected.",
              "idiomatic": "However, since the edict was announced, nine years have passed, and the officials of two thousand shi rank have never complied; they indulge in favoritism, and neither the Commandant of the Capital Region nor the inspectors have ever investigated or corrected this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0127",
          "zh": "今新蒙赦令，且復申勑，後有犯者，顯明其罰。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now newly receiving the amnesty edict, I will again issue clear instructions; those who violate afterward, make their punishments clear.",
              "idiomatic": "Now that we have newly received the amnesty edict, I will again issue clear instructions; for those who violate afterward, their punishments shall be clearly stated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0128",
          "zh": "在位不以選舉為憂，督察不以發覺為負，非獨州郡也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Those in office do not worry about selections, supervisors do not consider detection as their duty, it is not only the provinces and commanderies.",
              "idiomatic": "Those in office do not worry about proper selections, supervisors do not consider detection of misconduct their responsibility—this is not limited to the provinces and commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0129",
          "zh": "是以庶官多非其人。",
          "translations": [
            {
              "lang": "en",
              "literal": "Therefore the various officials are mostly not the right people.",
              "idiomatic": "Therefore most officials are not suitable for their positions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0130",
          "zh": "下民被姦邪之傷，由法不行故也。』",
          "translations": [
            {
              "lang": "en",
              "literal": "The common people suffer injury from wicked evil, because the laws are not implemented.''",
              "idiomatic": "The common people suffer harm from corrupt and evil influences because the laws are not being enforced.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0131",
          "zh": "庚寅，遣使者分行貧民，舉實流冗，開倉賑稟三十餘郡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengyin day: Dispatched envoys to separately inspect the poor people, report actual vagrants and redundant officials, opened granaries to provide relief to more than thirty commanderies.",
              "idiomatic": "On the Gengyin day, envoys were dispatched to separately inspect the poor, report on actual vagrants and redundant officials, and opened granaries to provide relief to more than thirty commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0132",
          "zh": "夏四月壬子，封阜陵王种兄魴為阜陵王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Renzi day: Enfeoffed King Zhong of Fuling's elder brother Fang as King of Fuling.",
              "idiomatic": "On the Renzi day of the fourth month of summer, King Zhong of Fuling's elder brother Fang was enfeoffed as King of Fuling.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0133",
          "zh": "六月丁酉，郡國三雨雹。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Dingyou day: Three commanderies and kingdoms experienced hailstorms.",
              "idiomatic": "On the Dingyou day of the sixth month, three commanderies and kingdoms suffered hailstorms.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0134",
          "zh": "秋九月辛酉，廣宗王萬歲薨，無子，國除。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, ninth month, Xinyou day: King Wansui of Guangzong passed away, had no son, kingdom abolished.",
              "idiomatic": "On the Xinyou day of the ninth month of autumn, King Wansui of Guangzong died without a son, and his kingdom was abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0135",
          "zh": "匈奴單于於除鞬叛，遣中朗將任尚討滅之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Xiongnu Chanyu Yu Chujian rebelled, dispatched Colonel Zhonglang Ren Shang to campaign and destroy him.",
              "idiomatic": "The Xiongnu Chanyu Yu Chujian rebelled, so Colonel Zhonglang Ren Shang was dispatched to campaign against and destroy him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0136",
          "zh": "壬午，令郡縣勸民蓄蔬食以助五谷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Renwu day: Ordered commanderies and counties to encourage the people to store vegetables and grains to supplement the five grains.",
              "idiomatic": "On the Renwu day, commanderies and counties were ordered to encourage people to store vegetables and supplementary grains to aid the five main crops.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0137",
          "zh": "其官有陂池，令得采取，勿收假稅二歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Where officials have ponds and pools, allow them to gather from them, do not collect loaned taxes for two years.",
              "idiomatic": "Where officials have ponds and reservoirs, permit them to harvest from them without collecting the loaned taxes for two years.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0138",
          "zh": "冬十月辛未，太尉尹睦薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Xinwei day: Grand Marshal Yin Mu passed away.",
              "idiomatic": "On the Xinwei day of the tenth month of winter, Grand Marshal Yin Mu died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0139",
          "zh": "十一月乙丑，太僕張酺為太尉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, Yichou day: Grand Coachman Zhang Pu became Grand Marshal.",
              "idiomatic": "On the Yichou day of the eleventh month, Zhang Pu, the Grand Coachman, was appointed Grand Marshal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0140",
          "zh": "是歲，武陵郡兵破叛蠻，降之。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, Wuling commandery troops defeated the rebelling barbarians, subjugated them.",
              "idiomatic": "This year, troops from Wuling commandery defeated the rebelling barbarians and brought them to submission.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0141",
          "zh": "護羌校尉貫友討燒當羌，羌乃遁去。",
          "translations": [
            {
              "lang": "en",
              "literal": "Protector General of the Qiang Guan You campaigned against the Shaodang Qiang, the Qiang then fled.",
              "idiomatic": "Protector General of the Qiang Guan You campaigned against the Shaodang Qiang tribe, causing them to flee.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0142",
          "zh": "南單于安國叛，骨都侯喜斬之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Southern Chanyu An Guo rebelled, Marquis of Gudu Xi executed him.",
              "idiomatic": "The Southern Chanyu An Guo rebelled, and the Marquis of Gudu Xi executed him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0143",
          "zh": "六年春正月，永昌徼外夷遣使譯獻犀牛、大象。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth year, spring, first month: The barbarians beyond the frontiers of Yongchang sent envoys through interpreters to present rhinoceroses and elephants.",
              "idiomatic": "In the first month of spring of the sixth year, barbarians from beyond Yongchang's frontiers sent envoys with interpreters to present rhinoceroses and elephants as tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0144",
          "zh": "己卯，司徒丁鴻薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jimao day: Minister of the Masses Ding Hong passed away.",
              "idiomatic": "On the Jimao day, Minister of the Masses Ding Hong died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0145",
          "zh": "二月乙未，遣謁者分行稟貸三河、兗、冀、青州貧民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month, Yiyou day: Dispatched palace attendants to separately provide grain loans to the poor people of Sanhe, Yan, Ji, and Qing provinces.",
              "idiomatic": "On the Yiyou day of the second month, palace attendants were dispatched to separately provide grain loans to the poor in the Sanhe region, Yan province, Ji province, and Qing province.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0146",
          "zh": "許侯馬光自殺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Marquis of Xu Ma Guang committed suicide.",
              "idiomatic": "Ma Guang, Marquis of Xu, committed suicide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0147",
          "zh": "丁未，司空劉方為司徒，太常張奮為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingwei day: Minister of Works Liu Fang became Minister of the Masses, Grand Herald Zhang Fen became Minister of Works.",
              "idiomatic": "On the Dingwei day, Liu Fang was appointed Minister of the Masses, and Zhang Fen, the Grand Herald, was appointed Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0148",
          "zh": "三月庚寅，詔流民所過郡國皆實稟之，其有販賣者勿出租稅，又欲就賤還歸者，復一歲田租、更賦。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Gengyin day: Imperial edict that all commanderies and kingdoms through which displaced people pass provide them with actual grain, those who engage in trade do not pay land taxes, moreover those who wish to return to cheap lands are exempted from one year's land taxes and poll taxes.",
              "idiomatic": "On the Gengyin day of the third month, an imperial edict ordered that all commanderies and kingdoms through which displaced people travel provide them with actual grain supplies; those who engage in petty trade are exempted from land taxes; and those who wish to return to cheaper lands are exempted from one year's land taxes and poll taxes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0149",
          "zh": "丙寅，詔曰：『朕以眇末，承奉鴻烈。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingyin day: Imperial edict said: 'I with insignificant person, uphold the great achievement.",
              "idiomatic": "On the Bingyin day, an imperial edict stated: 'I, being unworthy and insignificant, uphold our great imperial legacy.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0150",
          "zh": "陰陽不和，水旱違度，濟、河之域，凶饉流亡，而未獲忠言至謀，所以匡救之策。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yin and yang are not harmonious, floods and droughts exceed proper measure, in the region of the Ji and Yellow rivers, famine and displacement, yet I have not obtained loyal words and supreme plans, the strategies for correcting and saving.",
              "idiomatic": "Yin and yang are out of harmony, floods and droughts exceed normal bounds; in the region of the Ji and Yellow Rivers, famine and displacement occur; yet I have not received loyal counsel and supreme strategies for correcting and rescuing the situation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0151",
          "zh": "寤寐永歎，用思孔疚。",
          "translations": [
            {
              "lang": "en",
              "literal": "Awake and asleep eternal sighing, with thought greatly remorseful.",
              "idiomatic": "Constantly sighing whether awake or asleep, filled with deep remorse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0152",
          "zh": "惟官人不得於上，黎民不安于下，有司不念寬和，而競為苛刻，覆案不急，以妨民事，甚非所以上當天心，下濟元元也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Only officials are not pleasing above, the common people are not peaceful below, the officials do not think of leniency and harmony, but compete to be harsh and severe, reviewing cases not urgently, thus hindering people's affairs, very much not the way to accord with Heaven's will above and aid the common people below.",
              "idiomatic": "Officials fail to please those above, while the common people find no peace below; officials think not of leniency and harmony but compete in harshness and severity; they review cases without urgency, thus hindering people's affairs—this is far from what accords with Heaven's will above and aids the common people below.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0153",
          "zh": "思得忠良之士，以輔朕之不逮。",
          "translations": [
            {
              "lang": "en",
              "literal": "I think of obtaining loyal and good men, to assist my deficiencies.",
              "idiomatic": "I seek loyal and worthy men to assist me in my shortcomings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0154",
          "zh": "其令三公、中二千石、二千石、內郡守相舉賢良方正、能直言極諫之士各一人。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the Three Dukes, middle two thousand shi, two thousand shi, and inner commandery governors and chancellors recommend worthy and good, upright and proper men, able to speak directly and remonstrate to the utmost, each one person.",
              "idiomatic": "Let the Three Dukes, officials of middle two thousand shi rank, officials of two thousand shi rank, and the governors and chancellors of the inner commanderies each recommend one worthy and good man who is upright and proper, able to speak directly and remonstrate to the utmost.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0155",
          "zh": "昭巖穴，披幽隱，遣詣公車，朕將悉聽焉。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Make clear rocky caves, uncover hidden recluses, send them to the public carriage, I will completely listen to them.''",
              "idiomatic": "Seek out those in rocky caves and hidden retreats, send them to the imperial audience hall, for I shall listen to them completely.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0156",
          "zh": "帝乃親臨策問，選補郎吏。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Emperor then personally attended the policy questions, selected and filled court gentleman officials.",
              "idiomatic": "The Emperor then personally attended the examinations, selecting and appointing court officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0157",
          "zh": "夏四月，蜀郡徼外羌率種人遣使內附。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month: The Qiang beyond the frontiers of Shu commandery led their tribesmen and sent envoys to submit internally.",
              "idiomatic": "In the fourth month of summer, the Qiang tribes beyond Shu commandery's frontiers, led by their chiefs, sent envoys to submit and join us.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0158",
          "zh": "五月，城陽王淑薨，無子，國除。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month: King Shu of Chengyang passed away, had no son, kingdom abolished.",
              "idiomatic": "In the fifth month, King Shu of Chengyang died without a son, and his kingdom was abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0159",
          "zh": "六月己酉，初令伏閉盡日。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Jiyou day: For the first time ordered the closing of the imperial tombs for the entire day.",
              "idiomatic": "On the Jiyou day of the sixth month, it was first ordered that the imperial tombs remain closed for the entire day.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0160",
          "zh": "秋七月，京師旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month: The capital suffered drought.",
              "idiomatic": "In the seventh month of autumn, the capital experienced drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0161",
          "zh": "詔中都官徒各除半刑，讁其未竟，五月已下皆免遣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict that central office convicts each have half their sentence removed, pity those whose sentences are not yet complete, five months and below are all pardoned and sent away.",
              "idiomatic": "By imperial edict, convicts in the central offices each had half their sentences reduced; those whose sentences were not yet complete were shown mercy; those with sentences of five months or less were all pardoned and released.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0162",
          "zh": "丁巳，幸洛陽寺，錄囚徒，舉冤獄。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingsi day: Made a progress to Luoyang Temple, reviewed prisoners, raised up unjust cases.",
              "idiomatic": "On the Dingsi day, he visited the Luoyang Temple, reviewed the prisoners, and brought attention to unjust cases.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0163",
          "zh": "收洛陽令下獄抵罪，司隸校尉、河南尹皆左降。",
          "translations": [
            {
              "lang": "en",
              "literal": "Arrested the Luoyang magistrate, imprisoned him to pay for his crime, the Commandant of the Capital Region and Henan prefect were both demoted.",
              "idiomatic": "The Luoyang magistrate was arrested and imprisoned to atone for his crimes; the Commandant of the Capital Region and the Henan prefect were both demoted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0164",
          "zh": "未及還宮而澍雨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Before returning to the palace, timely rain fell.",
              "idiomatic": "Before he could return to the palace, beneficial rain began to fall.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0165",
          "zh": "西域都護班超大破焉耆、尉犁，斬其王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Western Regions Protector General Ban Chao greatly defeated Yanqi and Weili, executed their kings.",
              "idiomatic": "Protector General Ban Chao of the Western Regions inflicted major defeats on Yanqi and Weili, executing their kings.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0166",
          "zh": "自是西域降服，納質者五十餘國。",
          "translations": [
            {
              "lang": "en",
              "literal": "From this the Western Regions submitted and yielded, those presenting hostages more than fifty kingdoms.",
              "idiomatic": "From this point, the Western Regions submitted and yielded, with more than fifty kingdoms presenting hostages.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0167",
          "zh": "南單于安國從弟子逢侯率叛胡亡出塞。",
          "translations": [
            {
              "lang": "en",
              "literal": "Southern Chanyu An Guo's younger brother's son Feng Hou led the rebelling Xiongnu and fled out beyond the frontier.",
              "idiomatic": "Feng Hou, the nephew of Southern Chanyu An Guo, led the rebelling Xiongnu and fled beyond the frontier.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0168",
          "zh": "九月癸丑，以光祿勳鄧鴻行車騎將軍事，與越騎校尉馮柱、行度遼將軍朱徽、使匈奴中郎將杜崇討之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Guiyou day: Appointed Guanglu Xun Deng Hong to act as Cavalry General, together with Cavalry Colonel Feng Zhu, Acting General of Diao Liao Zhu Hui, and Colonel Envoy to the Xiongnu Du Chong to campaign against them.",
              "idiomatic": "On the Guiyou day of the ninth month, Guanglu Xun Deng Hong was appointed to act as Cavalry General, together with Cavalry Colonel Feng Zhu, Acting General of Diao Liao Zhu Hui, and Colonel Envoy to the Xiongnu Du Chong to campaign against the rebels.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0169",
          "zh": "冬十一月，護烏桓校尉任尚率烏桓、鮮卑，大破逢侯，馮柱遣兵追擊，復破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, eleventh month: Protector General of the Wuhuan Ren Shang led the Wuhuan and Xianbei, greatly defeated Feng Hou, Feng Zhu dispatched troops to pursue and attack, again defeated them.",
              "idiomatic": "In the eleventh month of winter, Protector General of the Wuhuan Ren Shang led the Wuhuan and Xianbei tribes to inflict a major defeat on Feng Hou; Feng Zhu dispatched troops to pursue and attack, defeating them again.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0170",
          "zh": "詔以勃海郡屬冀州。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict to attach Bohai commandery to Jizhou.",
              "idiomatic": "By imperial edict, Bohai commandery was attached to Jizhou province.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0171",
          "zh": "武陵漊中蠻叛，郡兵討平之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuling Lizhong barbarians rebelled, commandery troops campaigned and pacified them.",
              "idiomatic": "The barbarians in Wuling and Lizhong rebelled, but commandery troops campaigned against and pacified them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0172",
          "zh": "七年春正月，行車騎將軍鄧鴻、度遼將軍朱徽、中郎將杜崇皆下獄死。",
          "translations": [
            {
              "lang": "en",
              "literal": "Seventh year, spring, first month: Acting Cavalry General Deng Hong, General of Diao Liao Zhu Hui, Colonel Du Chong all were imprisoned and died.",
              "idiomatic": "In the first month of spring of the seventh year, Acting Cavalry General Deng Hong, General of Diao Liao Zhu Hui, and Colonel Du Chong were all imprisoned and executed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0173",
          "zh": "夏四月辛亥朔，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Xinhai day, first day of the month: There was a solar eclipse.",
              "idiomatic": "On the first day of the fourth month of summer, the Xinhai day, there was an eclipse of the sun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0174",
          "zh": "帝引見公卿問得失，令將、大夫、御史、謁者、博士、議郎、郎官會廷中，各言封事。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Emperor summoned and saw the dukes and ministers to ask about successes and failures, ordered the generals, grandees, censors, palace attendants, erudites, deliberative gentlemen, and court gentlemen to assemble in the court, each to speak of sealed memorials.",
              "idiomatic": "The Emperor summoned the dukes and ministers to inquire about successes and failures; he ordered the generals, grandees, censors, palace attendants, erudites, deliberative gentlemen, and court officials to assemble in the court, each to present their sealed memorials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0175",
          "zh": "詔曰：『元首不明，化流無良，政失於民，讁見於天。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict said: 'The ruler is unenlightened, the transformation flows without goodness, governance fails with the people, pity appears in Heaven.",
              "idiomatic": "An imperial edict stated: 'The ruler is unenlightened, the moral transformation lacks goodness, governance fails the people, and Heaven shows its pity.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0176",
          "zh": "深惟庶事，五教在寬，是以舊典因孝廉之舉，以求其人。",
          "translations": [
            {
              "lang": "en",
              "literal": "Deeply considering all matters, the five teachings are in leniency, therefore the old institutions follow the recommendation of the filial and incorruptible, to seek such men.",
              "idiomatic": "Deeply considering all matters, the five moral teachings lie in leniency; therefore the old institutions follow the recommendation of the filial and incorruptible to seek such worthy men.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0177",
          "zh": "有司詳選郎官寬博有謀、才任典城者三十人。』",
          "translations": [
            {
              "lang": "en",
              "literal": "The officials carefully select court gentlemen who are broad-minded and have plans, talented enough to administer cities, thirty persons.''",
              "idiomatic": "The officials shall carefully select thirty court gentlemen who are broad-minded and strategic, with the talent to administer cities.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0178",
          "zh": "既而悉以所選郎出補長、相。",
          "translations": [
            {
              "lang": "en",
              "literal": "Soon after, all the selected court gentlemen were sent out to fill the positions of magistrates and chancellors.",
              "idiomatic": "Shortly thereafter, all the selected court gentlemen were sent out to fill the positions of county magistrates and provincial governors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0179",
          "zh": "五月辛卯，改千乘國為樂安國。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Xinmao day: Changed Qiansheng kingdom to Le'an kingdom.",
              "idiomatic": "On the Xinmao day of the fifth month, the kingdom of Qiansheng was changed to the kingdom of Le'an.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0180",
          "zh": "六月丙寅，沛王定薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Bingyin day: King Ding of Pei passed away.",
              "idiomatic": "On the Bingyin day of the sixth month, King Ding of Pei died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0181",
          "zh": "秋七月乙巳，易陽地裂。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Yisi day: Yiyang experienced a fissure in the earth.",
              "idiomatic": "On the Yisi day of the seventh month of autumn, Yiyang suffered a fissure in the ground.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0182",
          "zh": "九月癸卯，京師地震。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Guimao day: The capital experienced an earthquake.",
              "idiomatic": "On the Guimao day of the ninth month, the capital suffered an earthquake.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0183",
          "zh": "八年春二月己丑，立貴人陰氏為皇后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth year, spring, second month, Jichou day: Established the Honored Lady Yin as Empress.",
              "idiomatic": "On the Jichou day of the second month of spring in the eighth year, the Honored Lady Yin was established as Empress.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0184",
          "zh": "賜天下男子爵，人二級，三老、孝悌、力田三級，民無名數及流民欲占者一級；",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted noble ranks to all males throughout the realm, each two levels; to the Three Elders, the filial and brotherly, and the diligent farmers three levels; to the people without registered households and displaced people wishing to register one level;",
              "idiomatic": "Noble ranks were granted to all males throughout the empire: two levels each; three levels to the Three Elders, the filial and brotherly, and diligent farmers; one level to unregistered people and displaced persons wishing to register;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0185",
          "zh": "鰥、寡、孤、獨、篤癃，貧不能自存者粟，人五斛。",
          "translations": [
            {
              "lang": "en",
              "literal": "Widowers, widows, orphans, the solitary, the gravely ill, the poor who cannot support themselves: grain, each five dou.",
              "idiomatic": "Widowers, widows, orphans, the childless elderly, the gravely ill, and the impoverished who cannot sustain themselves each received five dou of grain.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0186",
          "zh": "南匈奴右溫禺犢王叛，為寇。",
          "translations": [
            {
              "lang": "en",
              "literal": "Southern Xiongnu Right Wen Yu Du King rebelled, became a raider.",
              "idiomatic": "The Right Wen Yu Du King of the Southern Xiongnu rebelled and became a raider.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0187",
          "zh": "秋七月，行度遼將軍龐奮、越騎校尉馮柱追討之，斬右溫禺犢王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month: Acting General of Diao Liao Pang Fen, Cavalry Colonel Feng Zhu pursued and campaigned against him, executed the Right Wen Yu Du King.",
              "idiomatic": "In the seventh month of autumn, Acting General of Diao Liao Pang Fen and Cavalry Colonel Feng Zhu pursued and campaigned against the rebel, executing the Right Wen Yu Du King.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0188",
          "zh": "車師後王叛，擊其前王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Cheshi Rear King rebelled, attacked its Front King.",
              "idiomatic": "The Rear King of Cheshi rebelled and attacked its Front King.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0189",
          "zh": "八月辛酉，飲酎。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth month, Xinyou day: Drank the autumn sacrifice wine.",
              "idiomatic": "On the Xinyou day of the eighth month, he drank the autumn sacrifice wine.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0190",
          "zh": "詔郡國中都官繫囚減死一等，詣敦煌戍。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict that commandery and kingdom central office imprisoned convicts have their death sentences reduced one degree, proceed to Dunhuang garrison duty.",
              "idiomatic": "By imperial edict, convicts imprisoned in commandery and kingdom central offices had their death sentences reduced by one degree and were sent to garrison duty in Dunhuang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0191",
          "zh": "其犯大逆，募下蠶室；",
          "translations": [
            {
              "lang": "en",
              "literal": "Those who committed great rebellion, sent to the silkworm chamber;",
              "idiomatic": "Those guilty of great rebellion were sent to the silkworm chamber;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0192",
          "zh": "其女子宮。",
          "translations": [
            {
              "lang": "en",
              "literal": "their female relatives to the women's quarters.",
              "idiomatic": "and their female relatives to the women's quarters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0193",
          "zh": "自死罪已下，至司寇及亡命者入贖，各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "From death sentences downward, to prison guards and fugitives may redeem, each according to their circumstances.",
              "idiomatic": "Those with death sentences and below, including prison guards and fugitives, could redeem their sentences, each according to their specific circumstances.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0194",
          "zh": "九月，京師蝗。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month: The capital had locusts.",
              "idiomatic": "In the ninth month, locusts infested the capital.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0195",
          "zh": "吏民言事者，多歸責有司。",
          "translations": [
            {
              "lang": "en",
              "literal": "Officials and commoners who spoke on affairs, mostly attributed blame to the officials.",
              "idiomatic": "When officials and commoners spoke on matters, they mostly attributed blame to the authorities.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0196",
          "zh": "詔曰：『蝗蟲之異，殆不虛生，萬方有罪，在予一人，而言事者專咎自下，非助我者也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict said: 'The portent of locusts probably does not arise without cause, the ten thousand regions have sin, it is in me alone, yet those who speak on affairs exclusively blame from below, they are not helping me.",
              "idiomatic": "An imperial edict stated: 'The ominous appearance of locusts surely does not occur without reason; if all the realms are guilty, the fault lies with me alone; yet those who speak on affairs blame only those below, which does not help me.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0197",
          "zh": "朕寤寐恫矜，思弭憂釁。",
          "translations": [
            {
              "lang": "en",
              "literal": "I constantly feel sorrow and compassion whether awake or asleep, thinking of ending sorrow and calamity.",
              "idiomatic": "I am constantly filled with sorrow and compassion, awake and asleep, seeking to end the sorrow and avert disaster.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0198",
          "zh": "昔楚嚴無灾而懼，成王出郊而反風。",
          "translations": [
            {
              "lang": "en",
              "literal": "Formerly King Zhuang of Chu feared without disaster, King Cheng went out to the suburbs and the wind reversed.",
              "idiomatic": "In the past, King Zhuang of Chu felt fear even without disaster, and King Cheng went to the suburbs and the wind changed direction.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0199",
          "zh": "將何以匡朕不逮，以塞灾變？",
          "translations": [
            {
              "lang": "en",
              "literal": "How can you correct my shortcomings, to block calamities and changes?",
              "idiomatic": "How can you correct my deficiencies and avert these calamities and portents?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0200",
          "zh": "百僚師尹，勉修厥職，刺史、二千石詳刑辟，理冤虐，恤鰥寡，矜孤弱，思惟致灾興蝗之咎。』",
          "translations": [
            {
              "lang": "en",
              "literal": "All officials and tutors, diligently attend to your duties, inspectors and two thousand shi officials carefully examine criminal law, settle unjust oppression, care for widowers and widows, pity orphans and the weak, reflect on the guilt that brings disaster and raises locusts.''",
              "idiomatic": "All officials and mentors, diligently perform your duties; inspectors and officials of two thousand shi rank carefully examine the criminal code, rectify unjust oppression, care for widowers and widows, pity orphans and the weak, and reflect on the guilt that causes disasters and brings forth locusts.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0201",
          "zh": "庚子，復置廣陽郡。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengzi day: Again established Guangyang commandery.",
              "idiomatic": "On the Gengzi day, Guangyang commandery was reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0202",
          "zh": "九年春正月，永昌徼外蠻夷及撣國重譯奉貢。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth year, spring, first month: The barbarians beyond the frontiers of Yongchang and the Shan kingdom through multiple interpreters presented tribute.",
              "idiomatic": "In the first month of spring of the ninth year, barbarians from beyond Yongchang's frontiers and the Shan kingdom sent envoys through multiple interpreters to present tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0203",
          "zh": "三月庚辰，隴西地震。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Gengchen day: Longxi experienced an earthquake.",
              "idiomatic": "On the Gengchen day of the third month, Longxi commandery suffered an earthquake.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0204",
          "zh": "癸巳，濟南王康薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guisi day: King Kang of Jinan passed away.",
              "idiomatic": "On the Guisi day, King Kang of Jinan died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0205",
          "zh": "西域長史王林擊車師後王，斬之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Western Regions Grand Administrator Wang Lin attacked the Cheshi Rear King, executed him.",
              "idiomatic": "Wang Lin, Grand Administrator of the Western Regions, attacked the Rear King of Cheshi and executed him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0206",
          "zh": "夏四月丁卯，封樂成王黨子巡為樂成王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Dingmao day: Enfeoffed King Dang of Yuecheng's son Xun as King of Yuecheng.",
              "idiomatic": "On the Dingmao day of the fourth month of summer, King Dang of Yuecheng's son Xun was enfeoffed as King of Yuecheng.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0207",
          "zh": "六月，蝗、旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month: locusts and drought.",
              "idiomatic": "In the sixth month, there were locust infestations and drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0208",
          "zh": "戊辰，詔：『今年秋稼為蝗蟲所傷，皆勿收租、更、芻稾；",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuchen day: Imperial edict: 'This year the autumn crops have been injured by locusts, all do not collect land taxes, poll taxes, and fodder;",
              "idiomatic": "On the Wuchen day, an imperial edict stated: 'This year's autumn crops have been damaged by locusts; all land taxes, poll taxes, and fodder shall not be collected;'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0209",
          "zh": "若有所損失，以實除之，餘當收租者亦半入。",
          "translations": [
            {
              "lang": "en",
              "literal": "if there are losses, remove them based on actual conditions, the remainder that should collect taxes also enter half.",
              "idiomatic": "for areas with losses, remove them according to the actual damage; for the remainder that should collect taxes, collect only half.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0210",
          "zh": "其山林饒利，陂池漁采，以贍元元，勿收假稅。』",
          "translations": [
            {
              "lang": "en",
              "literal": "The abundant profits of mountains and forests, ponds and pools fishing and gathering, to support the common people, do not collect loaned taxes.''",
              "idiomatic": "The abundant resources of mountains and forests, and the fishing and gathering from ponds and pools shall support the common people; loaned taxes shall not be collected.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0211",
          "zh": "秋七月，蝗蟲飛過京師。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month: Locusts flew over the capital.",
              "idiomatic": "In the seventh month of autumn, locusts flew over the capital.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0212",
          "zh": "八月，鮮卑寇肥如，遼東太守祭參下獄死。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth month: The Xianbei raided Feiru, Liaodong Governor Ji Can was imprisoned and died.",
              "idiomatic": "In the eighth month, the Xianbei raided Feiru; Liaodong Governor Ji Can was imprisoned and executed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0213",
          "zh": "閏月辛巳，皇太后竇氏崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Intercalary month, Xinsi day: Empress Dowager Dou passed away.",
              "idiomatic": "On the Xinsi day of the intercalary month, Empress Dowager Dou died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0214",
          "zh": "丙申，葬章德皇后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingshen day: Buried Empress Zhangde.",
              "idiomatic": "On the Bingshen day, Empress Zhangde was buried.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0215",
          "zh": "燒當羌寇隴西，殺長吏，遣行征西將軍劉尚、越騎校尉趙世等討破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Shaodang Qiang raided Longxi, killed senior officials, dispatched Acting General of the West Liu Shang, Cavalry Colonel Zhao Shi and others to campaign and defeat them.",
              "idiomatic": "The Shaodang Qiang raided Longxi and killed senior officials; Acting General of the West Liu Shang and Cavalry Colonel Zhao Shi were dispatched to campaign against and defeat them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0216",
          "zh": "九月庚申，司徒劉方策免，自殺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Gengshen day: Minister of the Masses Liu Fang was dismissed by edict, committed suicide.",
              "idiomatic": "On the Gengshen day of the ninth month, Minister of the Masses Liu Fang was dismissed by imperial edict and committed suicide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0217",
          "zh": "甲子，追尊皇妣梁貴人為皇太后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jiazi day: Posthumously honored the imperial mother Liang Honored Lady as Empress Dowager.",
              "idiomatic": "On the Jiazi day, the emperor's mother, Liang the Honored Lady, was posthumously honored as Empress Dowager.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0218",
          "zh": "冬十月乙酉，改葬恭懷梁皇后于西陵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Yiyou day: Reburied Empress Gonghuai Liang in the Western Mausoleum.",
              "idiomatic": "On the Yiyou day of the tenth month of winter, Empress Gonghuai Liang was reburied in the Western Mausoleum.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0219",
          "zh": "十一月癸卯，光祿勳河南呂蓋為司徒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, Guimao day: Guanglu Xun Henan Lu Gai became Minister of the Masses.",
              "idiomatic": "On the Guimao day of the eleventh month, Lu Gai of Henan, the Guanglu Xun, was appointed Minister of the Masses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0220",
          "zh": "十二月丙寅，司空張奮罷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month, Bingyin day: Minister of Works Zhang Fen was dismissed.",
              "idiomatic": "On the Bingyin day of the twelfth month, Minister of Works Zhang Fen was dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0221",
          "zh": "壬申，太僕韓稜為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Renshen day: Grand Coachman Han Ling became Minister of Works.",
              "idiomatic": "On the Renshen day, Han Ling, the Grand Coachman, was appointed Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0222",
          "zh": "己丑，復置若廬獄官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jichou day: Again established the Rulu prison officials.",
              "idiomatic": "On the Jichou day, the Rulu prison officials were reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0223",
          "zh": "十年春三月壬戌，詔曰：『堤防溝渠，所以順助地理，通利壅塞。",
          "translations": [
            {
              "lang": "en",
              "literal": "Tenth year, spring, third month, Renxu day: Imperial edict said: 'Dikes, barriers, ditches, and canals are for following and assisting the earth's configuration, opening and benefiting blockages.",
              "idiomatic": "On the Renxu day of the third month of spring in the tenth year, an imperial edict stated: 'Dikes, barriers, ditches, and canals serve to follow and assist the earth's natural configuration by opening and benefiting blockages.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0224",
          "zh": "今廢慢懈弛，不以為負。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now they are abandoned and neglected, slack and remiss, not considered a responsibility.",
              "idiomatic": "Now they are abandoned and neglected, slack and remiss, and no one considers it their responsibility.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0225",
          "zh": "刺史、二千石其隨宜疏導。",
          "translations": [
            {
              "lang": "en",
              "literal": "Inspectors and two thousand shi officials should dredge and guide according to what is appropriate.",
              "idiomatic": "The inspectors and officials of two thousand shi rank should dredge and direct according to local conditions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0226",
          "zh": "勿因緣妄發，以為煩擾，將顯行其罰。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Do not arbitrarily mobilize based on connections, causing disturbance and trouble, I will clearly execute their punishments.''",
              "idiomatic": "Do not mobilize forces arbitrarily based on connections, causing disturbance and trouble; their punishments will be clearly enforced.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0227",
          "zh": "夏五月，京師大水。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fifth month: The capital suffered severe flooding.",
              "idiomatic": "In the fifth month of summer, the capital experienced severe flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0228",
          "zh": "秋七月己巳，司空韓稜薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Jisi day: Minister of Works Han Ling passed away.",
              "idiomatic": "On the Jisi day of the seventh month of autumn, Minister of Works Han Ling died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0229",
          "zh": "八月丙子，太常太山巢堪為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth month, Bingzi day: Grand Herald of Taishan Chao Kan became Minister of Works.",
              "idiomatic": "On the Bingzi day of the eighth month, Chao Kan of Taishan, the Grand Herald, was appointed Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0230",
          "zh": "九月庚戌，復置廩犧官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Gengxu day: Again established the Linxi officials.",
              "idiomatic": "On the Gengxu day of the ninth month, the Linxi officials were reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0231",
          "zh": "冬十月，五州雨水。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month: Five provinces experienced flooding.",
              "idiomatic": "In the tenth month of winter, five provinces suffered from flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0232",
          "zh": "十二月，燒當羌豪迷唐等率種人詣闕貢獻。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month: Shaodang Qiang chieftains Mi Tang and others led their tribesmen to the court to present tribute.",
              "idiomatic": "In the twelfth month, the Shaodang Qiang chieftains Mi Tang and others led their tribesmen to the imperial court to present tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0233",
          "zh": "戊寅，梁王暢薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuyin day: King Chang of Liang passed away.",
              "idiomatic": "On the Wuyin day, King Chang of Liang died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0234",
          "zh": "十一年春二月，遣使循行郡國，稟貸被灾害不能自存者，令得漁采山林池澤，不收假稅。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh year, spring, second month: Dispatched envoys to tour the commanderies and kingdoms, providing grain loans to those suffering disasters who cannot support themselves, allowing them to fish and gather in mountains, forests, ponds, and marshes, not collecting loaned taxes.",
              "idiomatic": "In the second month of spring of the eleventh year, envoys were dispatched to tour the commanderies and kingdoms, providing grain loans to those suffering from disasters who cannot support themselves; they were permitted to fish and gather in mountains, forests, ponds, and marshes without collecting loaned taxes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0235",
          "zh": "丙午，詔郡國中都官徒及篤癃老小女徒各除半刑，其未竟三月者，皆免歸田里。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingwu day: Imperial edict that commandery and kingdom central office convicts and severely ill, elderly, small, and female convicts each have half their sentence removed, those whose sentences are not yet complete within three months, all pardoned and returned to their fields and villages.",
              "idiomatic": "On the Bingwu day, by imperial edict, convicts in commandery and kingdom central offices and those who are severely ill, elderly, young, or female had their sentences reduced by half; those with less than three months remaining were all pardoned and returned to their homes.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0236",
          "zh": "夏四月丙寅，大赦天下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Bingyin day: Great amnesty throughout the realm.",
              "idiomatic": "On the Bingyin day of the fourth month of summer, a general amnesty was granted throughout the empire.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0237",
          "zh": "己巳，復置右校尉官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jisi day: Again established the Right Colonel official.",
              "idiomatic": "On the Jisi day, the Right Colonel official was reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0238",
          "zh": "秋七月辛卯，詔曰：『吏民逾僭，厚死傷生，是以舊令節之制度。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Xinmao day: Imperial edict said: 'Officials and people exceed their station, lavish funerals harm life, therefore the old regulations restrict their institutions.",
              "idiomatic": "On the Xinmao day of the seventh month of autumn, an imperial edict stated: 'Officials and commoners exceed their proper stations, and extravagant funerals harm life; therefore the old regulations restrict such practices.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0239",
          "zh": "頃者貴戚近親，百僚師尹，莫肯率從，有司不舉，怠放日甚。",
          "translations": [
            {
              "lang": "en",
              "literal": "Recently the noble relatives and close kin, all the officials and mentors, none are willing to follow, the officials do not report, negligence and laxity increase daily.",
              "idiomatic": "Recently, noble relatives and close kin, as well as all officials and mentors, have been unwilling to comply; the authorities do not report violations, and negligence grows worse day by day.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0240",
          "zh": "又商賈小民，或忘法禁，奇巧靡貨，流積公行。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover merchants and small people, some forget legal prohibitions, strange and clever wasteful goods, flow and accumulate in public circulation.",
              "idiomatic": "Moreover, merchants and common people sometimes forget legal prohibitions, with strange and extravagant luxury goods flowing and accumulating in open circulation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0241",
          "zh": "其在位犯者，當先舉正。",
          "translations": [
            {
              "lang": "en",
              "literal": "Those in office who violate, should first be corrected and regulated.",
              "idiomatic": "Those in office who commit violations should first be corrected and regulated.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0242",
          "zh": "市道小民，但且申明憲綱，勿因科令，加虐羸弱。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Market streets and small people, for now just clarify the constitutional principles, do not because of regulations and orders, add abuse to the weak and feeble.''",
              "idiomatic": "For merchants in the markets and common people, for now just clarify the legal principles; do not add further abuse to the weak and feeble because of regulations and orders.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0243",
          "zh": "十二年春二月，旄牛徼外白狼、貗薄夷率種人內屬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth year, spring, second month: The Bai Lang and Zhu Bo barbarians beyond the Maoniu frontier led their tribesmen to submit internally.",
              "idiomatic": "In the second month of spring of the twelfth year, the Bai Lang and Zhu Bo barbarians from beyond the Maoniu frontier led their tribesmen to submit and join us.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0244",
          "zh": "詔貸被灾諸郡民種糧。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial edict to loan seed grain to the people of various commanderies suffering disasters.",
              "idiomatic": "By imperial edict, seed grain was loaned to the people of the various commanderies affected by disasters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0245",
          "zh": "賜下貧、鰥、寡、孤、獨、不能自存者，及郡國流民，聽入陂池漁采，以助蔬食。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted to the lower poor, widowers, widows, orphans, the solitary, those who cannot support themselves, and commandery and kingdom displaced people, allowed to enter ponds and pools to fish and gather, to supplement their vegetable food.",
              "idiomatic": "Grants were made to the lower poor, widowers, widows, orphans, the childless elderly, those unable to support themselves, and displaced people from commanderies and kingdoms; they were permitted to fish and gather in ponds and reservoirs to supplement their vegetable diet.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0246",
          "zh": "三月丙申，詔曰：『比年不登，百姓虛匱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Bingchen day: Imperial edict said: 'In recent years harvests have failed, the common people are empty and lacking.",
              "idiomatic": "On the Bingchen day of the third month, an imperial edict stated: 'Harvests have failed in recent years, leaving the common people destitute and impoverished.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0247",
          "zh": "京師去冬無宿雪，今春無澍雨，黎民流離，困於道路。",
          "translations": [
            {
              "lang": "en",
              "literal": "The capital last winter had no lasting snow, this spring no beneficial rain, the common people are displaced and scattered, distressed on the roads.",
              "idiomatic": "Last winter the capital had no lasting snow, this spring no beneficial rain has fallen; the common people are displaced and wandering, suffering hardship on the roads.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0248",
          "zh": "朕痛心疾首，靡知所濟。",
          "translations": [
            {
              "lang": "en",
              "literal": "I am pained in heart and head, know not what to do for relief.",
              "idiomatic": "My heart and head ache with pain; I know not how to provide relief.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0249",
          "zh": "「瞻仰昊天，何辜今人？」",
          "translations": [
            {
              "lang": "en",
              "literal": "'Gazing up at Vast Heaven, what guilt have the present people?'",
              "idiomatic": "'Gazing up at the vast heavens, what guilt do the people of today bear?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0250",
          "zh": "三公，朕之腹心，而未獲承天安民之策。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Three Dukes are my innermost heart, yet I have not obtained strategies for receiving Heaven and pacifying the people.",
              "idiomatic": "The Three Dukes are my closest advisors, yet I have not obtained strategies for following Heaven's will and bringing peace to the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0251",
          "zh": "數詔有司，務擇良吏。",
          "translations": [
            {
              "lang": "en",
              "literal": "I have repeatedly instructed the officials to diligently select good administrators.",
              "idiomatic": "I have repeatedly instructed the authorities to diligently select worthy officials.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0252",
          "zh": "今猶不改，競為苛暴，侵愁小民，以求虛名，委任下吏，假勢行邪。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now still not changed, compete to be harsh and violent, invade and trouble the small people, to seek empty reputation, entrust lower officials, borrow influence to do evil.",
              "idiomatic": "Yet still they do not change; they compete to be harsh and tyrannical, oppressing and troubling the common people to gain empty reputations; they entrust subordinate officials who abuse their borrowed authority to commit evil.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0253",
          "zh": "是以令下而蕊生，禁至而詐起。",
          "translations": [
            {
              "lang": "en",
              "literal": "Therefore commands descend and buds sprout, prohibitions arrive and deception arises.",
              "idiomatic": "Therefore when commands are issued, corruption sprouts; when prohibitions are established, deception arises.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0254",
          "zh": "巧法析律，飾文增辭，貨行於言，罪成乎手，朕甚病焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Cleverly manipulate laws and analyze statutes, embellish writings and add words, bribes circulate through speech, crimes are formed by hand, I greatly suffer from this.",
              "idiomatic": "They cleverly manipulate laws and parse statutes, embellish documents and add words; bribes circulate through speech, crimes are committed by hand—I am greatly troubled by this.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0255",
          "zh": "公卿不思助明好惡，將何以救其咎罰？",
          "translations": [
            {
              "lang": "en",
              "literal": "Dukes and ministers do not think to help clarify likes and dislikes, how can they save themselves from blame and punishment?",
              "idiomatic": "If dukes and ministers do not help clarify right and wrong, how can they save themselves from blame and punishment?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0256",
          "zh": "咎罰既至，復令灾及小民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Blame and punishment having arrived, moreover causing disasters to affect the small people.",
              "idiomatic": "Once blame and punishment arrive, moreover causing disasters to afflict the common people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0257",
          "zh": "若上下同心，庶或有廖。",
          "translations": [
            {
              "lang": "en",
              "literal": "If superiors and inferiors are of one heart, perhaps there will be some relief.",
              "idiomatic": "If superiors and inferiors unite in purpose, perhaps some relief may be achieved.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0258",
          "zh": "其賜天下男子爵，人二級，三老、孝悌、力田三級，民無名數及流民欲占者人一級；",
          "translations": [
            {
              "lang": "en",
              "literal": "Grant noble ranks to all males throughout the realm, each two levels; to the Three Elders, the filial and brotherly, and the diligent farmers three levels; to the people without registered households and displaced people wishing to register each one level;",
              "idiomatic": "Noble ranks were granted to all males throughout the empire: two levels each; three levels to the Three Elders, the filial and brotherly, and diligent farmers; one level to unregistered people and displaced persons wishing to register;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0259",
          "zh": "鰥、寡、孤、獨、篤癃、貧不能自存者粟，人三斛。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Widowers, widows, orphans, the solitary, the gravely ill, the poor who cannot support themselves: grain, each three dou.''",
              "idiomatic": "Widowers, widows, orphans, the childless elderly, the gravely ill, and the impoverished who cannot sustain themselves each received three dou of grain.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0260",
          "zh": "壬子，賜博士員弟子在太學者布，人三匹。",
          "translations": [
            {
              "lang": "en",
              "literal": "Renzi day: Granted cloth to the disciples of the established Erudite officials who are at the Grand Academy, each three bolts.",
              "idiomatic": "On the Renzi day, cloth was granted to the disciples of the established Erudite officials at the Grand Academy, three bolts each.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0261",
          "zh": "夏四月，日南象林蠻夷反，郡兵討破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month: The barbarians of Rinan Xianglin rebelled, commandery troops campaigned and defeated them.",
              "idiomatic": "In the fourth month of summer, the barbarians of Rinan and Xianglin rebelled, but commandery troops campaigned against and defeated them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0262",
          "zh": "閏月，賑貸敦煌、張掖、五原民下貧者糓。",
          "translations": [
            {
              "lang": "en",
              "literal": "Intercalary month: Provided relief loans of grain to the especially poor people of Dunhuang, Zhangye, and Wuquan.",
              "idiomatic": "In the intercalary month, relief loans of grain were provided to the especially impoverished people of Dunhuang, Zhangye, and Wuquan commanderies.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0263",
          "zh": "戊辰，秭歸山崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuchen day: Zigui Mountain collapsed.",
              "idiomatic": "On the Wuchen day, Zigui Mountain suffered a collapse.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0264",
          "zh": "六月，舞陽大水，賜被水灾尤貧者穀，人三斛。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month: Wuyang suffered severe flooding, granted grain to those especially poor who suffered water disaster, each three dou.",
              "idiomatic": "In the sixth month, Wuyang suffered severe flooding; grain was granted to those particularly impoverished by the flood disaster, three dou each.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0265",
          "zh": "秋七月辛亥朔，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Xinhai day, first day of the month: There was a solar eclipse.",
              "idiomatic": "On the first day of the seventh month of autumn, the Xinhai day, there was an eclipse of the sun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0266",
          "zh": "九月戊午，太尉張酺免。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Wuwu day: Grand Marshal Zhang Pu was dismissed.",
              "idiomatic": "On the Wuwu day of the ninth month, Grand Marshal Zhang Pu was dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0267",
          "zh": "丙寅，大司農張禹為太尉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingyin day: Grand Minister of Agriculture Zhang Yu became Grand Marshal.",
              "idiomatic": "On the Bingyin day, Zhang Yu, the Grand Minister of Agriculture, was appointed Grand Marshal.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0268",
          "zh": "冬十一月，西域蒙奇、兜勒二國遣使內附，賜其王金印紫綬。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, eleventh month: The two kingdoms of Mengqi and Doule in the Western Regions sent envoys to submit internally, granted their kings gold seals and purple tassels.",
              "idiomatic": "In the eleventh month of winter, the two kingdoms of Mengqi and Doule in the Western Regions sent envoys to submit and join us; their kings were granted gold seals and purple tassels.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0269",
          "zh": "是歲，燒當羌復叛。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, the Shaodang Qiang rebelled again.",
              "idiomatic": "This year, the Shaodang Qiang rebelled once more.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0270",
          "zh": "十三年春正月丁丑，帝幸東觀，覽書林，閱篇籍，博選術蓺之士以充其官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thirteenth year, spring, first month, Dingchou day: The Emperor made a progress to the Eastern Pavilion, viewed the forest of books, perused the writings, broadly selected men of arts and skills to fill their offices.",
              "idiomatic": "On the Dingchou day of the first month of spring in the thirteenth year, the Emperor visited the Eastern Pavilion, viewed the collection of books, perused the writings, and broadly selected men skilled in the arts to fill their official positions.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0271",
          "zh": "二月，任城王尚薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month: King Shang of Rencheng passed away.",
              "idiomatic": "In the second month, King Shang of Rencheng died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0272",
          "zh": "丙午，賑貸張掖、居延、朔方、日南貧民及孤、寡、羸弱不能自存者。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingwu day: Provided relief loans to the poor people of Zhangye, Juyan, Shuofang, and Rinan, as well as orphans, widows, the feeble, and those who cannot support themselves.",
              "idiomatic": "On the Bingwu day, relief loans were provided to the impoverished people of Zhangye, Juyan, Shuofang, and Rinan commanderies, as well as to orphans, widows, the feeble, and those unable to support themselves.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0273",
          "zh": "秋八月，詔象林民失農桑業者，賑貸種糧，稟賜下貧穀食。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, eighth month: Imperial edict that Xianglin people who have lost their farming and mulberry cultivation be provided relief loans of seed grain, granted grain to the lower poor.",
              "idiomatic": "In the eighth month of autumn, by imperial edict, the people of Xianglin who had lost their farming and mulberry cultivation were provided with relief loans of seed grain and grants of grain for the lower poor.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0274",
          "zh": "己亥，北宮盛饌門閣火。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jihai day: The Shengzhan gate pavilion of the Northern Palace caught fire.",
              "idiomatic": "On the Jihai day, the Shengzhan gate pavilion of the Northern Palace caught fire.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0275",
          "zh": "護羌校尉周鮪擊燒當羌，破之，荊州雨水。",
          "translations": [
            {
              "lang": "en",
              "literal": "Protector General of the Qiang Zhou Wei attacked the Shaodang Qiang, defeated them; Jing province experienced flooding.",
              "idiomatic": "Protector General of the Qiang Zhou Wei attacked and defeated the Shaodang Qiang; Jing province suffered from flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0276",
          "zh": "九月壬子，詔曰：『荊州比歲不節，今茲淫水為害，餘雖頗登，而多不均浹，深惟四民農食之本，慘然懷矜。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Renzi day: Imperial edict said: 'Jing province in recent years has been unseasonable, this year excessive waters have caused harm, the remainder though somewhat harvested, yet mostly not evenly distributed, deeply considering the farming and food foundation of the four classes of people, sorrowfully feeling compassion.",
              "idiomatic": "On the Renzi day of the ninth month, an imperial edict stated: 'Jing province has been unseasonable in recent years, and this year excessive flooding has caused harm; although some crops have been harvested, they are mostly not evenly distributed; deeply considering that farming and food are the foundation for the four classes of people, I sorrowfully feel compassion.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0277",
          "zh": "其今天下半入今年田租、芻稾；",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the realm today half pay this year's land taxes and fodder;",
              "idiomatic": "Let the entire empire today pay only half of this year's land taxes and fodder;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0278",
          "zh": "有宜以實除者，如故事。",
          "translations": [
            {
              "lang": "en",
              "literal": "those who should be exempted based on actual conditions, as in the previous precedents.",
              "idiomatic": "for those who should be exempted according to the actual circumstances, follow previous precedents.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0279",
          "zh": "貧民假種食，皆勿收責。』",
          "translations": [
            {
              "lang": "en",
              "literal": "The poor people who borrowed seed grain, all do not collect repayment.''",
              "idiomatic": "For poor people who borrowed seed grain, repayment shall not be collected.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0280",
          "zh": "冬十一月，安息國遣使獻師子及條枝大爵。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, eleventh month: The kingdom of Anxi sent envoys to present lions and large birds from Tiaozhi.",
              "idiomatic": "In the eleventh month of winter, the kingdom of Anxi sent envoys to present lions and large birds from Tiaozhi.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0281",
          "zh": "丙辰，詔曰：『幽、幷、涼州戶口率少，邊役眾劇，束脩良吏，進仕路狹。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingchen day: Imperial edict said: 'You, Bing, and Liang provinces generally have few households and population, border duties are numerous and arduous, cultivating good officials, the path to advancement is narrow.",
              "idiomatic": "On the Bingchen day, an imperial edict stated: 'The provinces of You, Bing, and Liang generally have few households and people; border duties are numerous and arduous; cultivating good officials is difficult, and the path to advancement is narrow.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0282",
          "zh": "撫接夷狄，以人為本。",
          "translations": [
            {
              "lang": "en",
              "literal": "Pacifying and receiving the Yi and Di barbarians, taking people as the foundation.",
              "idiomatic": "In pacifying and receiving the barbarian tribes, people are the foundation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0283",
          "zh": "其令緣邊郡口十萬以上，歲舉孝廉一人；",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the border commanderies with populations of one hundred thousand or more, annually recommend one filial and incorruptible;",
              "idiomatic": "Let border commanderies with populations of 100,000 or more annually recommend one person who is filial and incorruptible;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0284",
          "zh": "不滿十萬，二歲舉一人；",
          "translations": [
            {
              "lang": "en",
              "literal": "those not reaching one hundred thousand, every two years recommend one person;",
              "idiomatic": "those with fewer than 100,000 people, recommend one person every two years;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0285",
          "zh": "五萬以下，三歲舉一人。』",
          "translations": [
            {
              "lang": "en",
              "literal": "fifty thousand and below, every three years recommend one person.''",
              "idiomatic": "those with 50,000 or fewer, recommend one person every three years.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0286",
          "zh": "鮮卑寇右北平，遂入漁陽，漁陽太守擊破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Xianbei raided Youbeiping, then entered Yuyang, the Yuyang governor attacked and defeated them.",
              "idiomatic": "The Xianbei raided Youbeiping, then entered Yuyang, where the governor of Yuyang attacked and defeated them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0287",
          "zh": "戊辰，司徒呂蓋罷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuchen day: Minister of the Masses Lu Gai was dismissed.",
              "idiomatic": "On the Wuchen day, Minister of the Masses Lu Gai was dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0288",
          "zh": "夏四月，遣使者督荊州兵討巫蠻，破降之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month: Dispatched envoys to oversee Jing province troops campaigning against the Wu barbarians, defeated and subjugated them.",
              "idiomatic": "In the fourth month of summer, envoys were dispatched to oversee Jing province troops in their campaign against the Wu barbarians, who were defeated and brought to submission.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0289",
          "zh": "庚辰，賑貸張掖、居延、敦煌、五原、漢陽、會稽流民下貧穀，各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengchen day: Provided relief loans of grain to the especially poor displaced people of Zhangye, Juyan, Dunhuang, Wuquan, Hanyang, and Kuaiji, each according to their circumstances.",
              "idiomatic": "On the Gengchen day, relief loans of grain were provided to the especially impoverished displaced people in Zhangye, Juyan, Dunhuang, Wuquan, Hanyang, and Kuaiji commanderies, each according to their specific circumstances.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0290",
          "zh": "五月丁未，初置象林將兵長史官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Dingwei day: For the first time established the office of General of the Troops and Grand Administrator of Xianglin.",
              "idiomatic": "On the Dingwei day of the fifth month, the office of General of the Troops and Grand Administrator of Xianglin was established for the first time.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0291",
          "zh": "六月辛卯，廢皇后陰氏，后父特進綱自殺。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Xinmao day: Deposed Empress Yin, her father Specially Advanced Gang committed suicide.",
              "idiomatic": "On the Xinmao day of the sixth month, Empress Yin was deposed; her father, the Specially Advanced Gang, committed suicide.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0292",
          "zh": "秋七月甲寅，詔復象林縣更賦、田租、芻稾二歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Jiazi day: Imperial edict to exempt Xianglin county from poll taxes, land taxes, and fodder for two years.",
              "idiomatic": "On the Jiazi day of the seventh month of autumn, an imperial edict exempted Xianglin county from poll taxes, land taxes, and fodder for two years.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0293",
          "zh": "壬子，常山王側薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Renzi day: King Ce of Changshan passed away.",
              "idiomatic": "On the Renzi day, King Ce of Changshan died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0294",
          "zh": "是秋，三州雨水。",
          "translations": [
            {
              "lang": "en",
              "literal": "This autumn, three provinces experienced flooding.",
              "idiomatic": "This autumn, three provinces suffered from flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0295",
          "zh": "冬十月甲申，詔：『兗、豫、荊州今年水雨淫過，多傷農功。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Jiashen day: Imperial edict: 'Yan, Yu, and Jing provinces this year have had excessive flooding, greatly injuring farming efforts.",
              "idiomatic": "On the Jiashen day of the tenth month of winter, an imperial edict stated: 'Yan, Yu, and Jing provinces have suffered excessive flooding this year, greatly damaging farming efforts.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0296",
          "zh": "其令被害什四以上皆半入田租、芻稾；",
          "translations": [
            {
              "lang": "en",
              "literal": "Let those suffering damage of four-tenths or more all pay half the land taxes and fodder;",
              "idiomatic": "Let those areas suffering damage of 40% or more pay only half their land taxes and fodder;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0297",
          "zh": "其不滿者，以實除之。』",
          "translations": [
            {
              "lang": "en",
              "literal": "those not reaching that amount, exempt them based on actual conditions.''",
              "idiomatic": "for those with less damage, exempt them according to the actual circumstances.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0298",
          "zh": "辛卯，立貴人鄧氏為皇后。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinmao day: Established the Honored Lady Deng as Empress.",
              "idiomatic": "On the Xinmao day, the Honored Lady Deng was established as Empress.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0299",
          "zh": "丁酉，司空巢堪罷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingyou day: Minister of Works Chao Kan was dismissed.",
              "idiomatic": "On the Dingyou day, Minister of Works Chao Kan was dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0300",
          "zh": "十一月癸卯，大司農徐防為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, Guimao day: Grand Minister of Agriculture Xu Fang became Minister of Works.",
              "idiomatic": "On the Guimao day of the eleventh month, Xu Fang, the Grand Minister of Agriculture, was appointed Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0301",
          "zh": "是歲，初復郡國上計補郎官。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, for the first time again allowed commanderies and kingdoms to fill court gentleman positions through their annual tallies.",
              "idiomatic": "This year, commanderies and kingdoms were for the first time again allowed to fill court gentleman positions through their annual reports.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0302",
          "zh": "十五年春閏月乙未，詔流民欲還歸本而無糧食者，過所實稟之，疾病加致醫藥；",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifteenth year, spring, intercalary month, Yiyou day: Imperial edict that displaced people who wish to return to their native places but lack food, at their stopping places provide them with actual grain, for illness additionally provide medicine;",
              "idiomatic": "On the Yiyou day of the intercalary month of spring in the fifteenth year, an imperial edict ordered that displaced people wishing to return to their native places but lacking food be provided with actual grain at their stopping places, and that medicine be provided for the ill;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0303",
          "zh": "其不欲還歸者，勿強。",
          "translations": [
            {
              "lang": "en",
              "literal": "those who do not wish to return, do not force them.",
              "idiomatic": "those who do not wish to return should not be forced.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0304",
          "zh": "二月，詔稟貸潁川、汝南、陳留、江夏、梁國、敦煌貧民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month: Imperial edict to provide grain loans to the poor people of Yingchuan, Runan, Chenliu, Jiangxia, Liang kingdom, and Dunhuang.",
              "idiomatic": "In the second month, by imperial edict, grain loans were provided to the impoverished people of Yingchuan, Runan, Chenliu, Jiangxia, Liang kingdom, and Dunhuang.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0305",
          "zh": "夏四月甲子晦，日有食之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Jiazi day, last day of the month: There was a solar eclipse.",
              "idiomatic": "On the last day of the fourth month of summer, the Jiazi day, there was an eclipse of the sun.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0306",
          "zh": "五月戊寅，南陽大風。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Wuyin day: Nanyang experienced a great wind.",
              "idiomatic": "On the Wuyin day of the fifth month, Nanyang suffered from violent winds.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0307",
          "zh": "六月，詔令百姓鰥、寡漁采陂池，勿收假稅二歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month: Imperial edict ordering the common people who are widowers and widows to fish and gather in ponds and reservoirs, do not collect loaned taxes for two years.",
              "idiomatic": "In the sixth month, by imperial edict, widowers and widows among the common people were allowed to fish and gather in ponds and reservoirs without collecting loaned taxes for two years.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0308",
          "zh": "秋七月丙寅，濟南王錯薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Bingyin day: King Cuo of Jinan passed away.",
              "idiomatic": "On the Bingyin day of the seventh month of autumn, King Cuo of Jinan died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0309",
          "zh": "復置涿郡故安鐵官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Again established the iron official in Gu'an of Zhuojun.",
              "idiomatic": "The iron official in Gu'an of Zhuojun was reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0310",
          "zh": "九月壬午，南巡狩，清河王慶、濟北王壽、河間王開並從。",
          "translations": [
            {
              "lang": "en",
              "literal": "Ninth month, Renwu day: Made a southern inspection tour, King Qing of Qinghe, King Shou of Jibei, King Kai of Hejian all accompanied.",
              "idiomatic": "On the Renwu day of the ninth month, he made a southern inspection tour, accompanied by King Qing of Qinghe, King Shou of Jibei, and King Kai of Hejian.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0311",
          "zh": "賜所過二千石長吏以下、三老、官屬及民百年者錢、布，各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted money and cloth to the two thousand shi senior officials and below that the procession passed, the Three Elders, officials, and people who were one hundred years old, each according to their rank.",
              "idiomatic": "Money and cloth were granted to the senior officials of two thousand shi rank and below along the route of the procession, as well as to the Three Elders, other officials, and centenarians, each according to their position.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0312",
          "zh": "是秋，四州雨水。",
          "translations": [
            {
              "lang": "en",
              "literal": "This autumn, four provinces experienced flooding.",
              "idiomatic": "This autumn, four provinces suffered from flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0313",
          "zh": "冬十月戊申，幸章陵，祠舊宅。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, tenth month, Wushen day: Made a progress to Zhangling, sacrificed at the old residence.",
              "idiomatic": "On the Wushen day of the tenth month of winter, he made a visit to Zhangling and performed sacrifices at the old residence.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0314",
          "zh": "癸丑，祠園廟，會宗室於舊廬，勞賜作樂。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guiyou day: Sacrificed at the Garden Temple, assembled the imperial clansmen at the old lodge, rewarded and entertained them with music.",
              "idiomatic": "On the Guiyou day, he performed sacrifices at the Garden Temple, assembled the imperial clansmen at the old lodge, and entertained them with rewards and music.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0315",
          "zh": "戊午，進幸雲夢，臨漢水而還。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuwu day: Advanced to Yunmeng, viewed the Han River and returned.",
              "idiomatic": "On the Wuwu day, he proceeded to Yunmeng, viewed the Han River, and returned.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0316",
          "zh": "十一月甲申，車駕還宮，賜從臣及留者公卿以下錢、布，各有差。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eleventh month, Jiashen day: The imperial carriage returned to the palace, granted money and cloth to the accompanying ministers and those who remained, dukes and ministers and below, each according to their rank.",
              "idiomatic": "On the Jiashen day of the eleventh month, the imperial carriage returned to the palace; money and cloth were granted to the accompanying ministers and those who had remained, from dukes and ministers downward, each according to their position.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0317",
          "zh": "十二月庚子，琅邪王宇薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month, Gengzi day: King Yu of Langye passed away.",
              "idiomatic": "On the Gengzi day of the twelfth month, King Yu of Langye died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0318",
          "zh": "有司奏，以為夏至則微陰起，靡草死，可以決小事。",
          "translations": [
            {
              "lang": "en",
              "literal": "The officials memorialized, believing that at the summer solstice then slight yin arises, the luxuriant grasses die, it is possible to decide small matters.",
              "idiomatic": "The officials memorialized their belief that at the summer solstice, when slight yin energy begins to rise and the lush grasses wither and die, it becomes possible to decide minor judicial matters.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0319",
          "zh": "是歲，初令郡國以日北至案薄刑。",
          "translations": [
            {
              "lang": "en",
              "literal": "This year, for the first time ordered commanderies and kingdoms to review light punishments at the winter solstice.",
              "idiomatic": "This year, commanderies and kingdoms were for the first time ordered to review light punishments on the day of the winter solstice.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0320",
          "zh": "十六年春正月己卯，詔貧民有田業而以匱乏不能自農者，貸種糧。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixteenth year, spring, first month, Jimao day: Imperial edict that poor people who have landholdings but because of destitution cannot farm themselves, loan seed grain.",
              "idiomatic": "On the Jimao day of the first month of spring in the sixteenth year, an imperial edict ordered that poor people who own land but cannot farm it themselves due to destitution be loaned seed grain.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0321",
          "zh": "二月己未，詔兗、豫、徐、冀四州比年雨多傷稼，禁沽酒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Second month, Jiwei day: Imperial edict that Yan, Yu, Xu, and Ji four provinces in recent years have had excessive rain injuring the crops, prohibit selling alcohol.",
              "idiomatic": "On the Jiwei day of the second month, an imperial edict prohibited the sale of alcohol in the four provinces of Yan, Yu, Xu, and Ji, where excessive rains in recent years had damaged the crops.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0322",
          "zh": "夏四月，遣三府掾分行四州，貧民無以耕者，為雇犁牛直。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month: Dispatched the clerks of the three offices to separately tour the four provinces, for poor people who have no means to plow, provide funds to hire plowing oxen.",
              "idiomatic": "In the fourth month of summer, clerks from the three offices were dispatched to separately tour the four provinces and provide funds to hire oxen for poor people who had no means to plow their fields.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0323",
          "zh": "五月壬午，趙王商薨。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Renwu day: King Shang of Zhao passed away.",
              "idiomatic": "On the Renwu day of the fifth month, King Shang of Zhao died.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0324",
          "zh": "秋七月，旱。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month: drought.",
              "idiomatic": "In the seventh month of autumn, there was drought.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0325",
          "zh": "戊午，詔曰：『今秋稼方穗而旱，雲雨不霑，疑吏行慘刻，不宣恩澤，妄拘無罪，幽閉良善所致。",
          "translations": [
            {
              "lang": "en",
              "literal": "Wuwu day: Imperial edict said: 'Now the autumn crops are just earing but drought, clouds and rain do not moisten, suspect officials practice harsh severity, do not proclaim benevolent favor, wrongly detain the innocent, imprison the good, what brings this about.",
              "idiomatic": "On the Wuwu day, an imperial edict stated: 'Now the autumn crops are just forming ears but suffering drought; clouds and rain do not provide moisture. I suspect this is because officials practice harsh severity, do not proclaim benevolent favors, wrongly detain the innocent, and imprison the good.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0326",
          "zh": "其一切囚徒於法疑者勿決，以奉秋令。",
          "translations": [
            {
              "lang": "en",
              "literal": "All prisoners whose cases are doubtful under the law do not decide, to observe the autumn decree.",
              "idiomatic": "Do not decide cases for all prisoners where the law is doubtful, in order to observe the autumn decree.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0327",
          "zh": "方察煩苛之吏，顯明其罰。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Currently investigating officials who are troublesome and harsh, make their punishments clear.''",
              "idiomatic": "Currently investigating officials who are vexatious and harsh, and making their punishments clear.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0328",
          "zh": "辛酉，司徒魯恭免。",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinyou day: Minister of the Masses Lu Gong was dismissed.",
              "idiomatic": "On the Xinyou day, Minister of the Masses Lu Gong was dismissed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0329",
          "zh": "庚午，光祿勳張酺為司徒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gengwu day: Guanglu Xun Zhang Pu became Minister of the Masses.",
              "idiomatic": "On the Gengwu day, Zhang Pu, the Guanglu Xun, became Minister of the Masses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0330",
          "zh": "辛巳，詔令天下皆半入今年田租、芻稾；",
          "translations": [
            {
              "lang": "en",
              "literal": "Xinsi day: Imperial edict ordering that throughout the realm all pay half of this year's land taxes and fodder;",
              "idiomatic": "On the Xinsi day, an imperial edict ordered that throughout the empire, only half of this year's land taxes and fodder be paid;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0331",
          "zh": "其被灾害者，以實除之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Those who suffered disasters, exempt them based on actual conditions.",
              "idiomatic": "For those who suffered disasters, exempt them according to the actual circumstances.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0332",
          "zh": "貧民受貸種糧及田租、芻稾，皆勿收責。",
          "translations": [
            {
              "lang": "en",
              "literal": "Poor people who received loans of seed grain and land taxes, fodder, all do not collect repayment.",
              "idiomatic": "For poor people who received loans of seed grain and exemptions from land taxes and fodder, repayment shall not be collected.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0333",
          "zh": "十二月，復置遼東西部都尉官。",
          "translations": [
            {
              "lang": "en",
              "literal": "Twelfth month: Again established the Western Commandant of Liaodong official.",
              "idiomatic": "In the twelfth month, the Western Commandant of Liaodong official was reestablished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0334",
          "zh": "元興元年春正月戊午，引三署郎召見禁中，選除七十五人，補謁者、長、相。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yuanxing first year, spring, first month, Wuwu day: Summoned the Three Offices gentlemen for audience in the imperial residence, selected and appointed seventy-five persons, filled positions of palace attendants, magistrates, and chancellors.",
              "idiomatic": "On the Wuwu day of the first month of spring in the first year of the Yuanxing era, the gentlemen of the Three Offices were summoned for an audience in the imperial residence; seventy-five were selected and appointed to fill positions as palace attendants, county magistrates, and provincial governors.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0335",
          "zh": "高句驪寇郡界。",
          "translations": [
            {
              "lang": "en",
              "literal": "Gaogouli raided the commandery borders.",
              "idiomatic": "Gaogouli raided the borders of the commandery.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0336",
          "zh": "夏四月庚午，大赦天下，改元元興。",
          "translations": [
            {
              "lang": "en",
              "literal": "Summer, fourth month, Gengwu day: Great amnesty throughout the realm, changed the era name to Yuanxing.",
              "idiomatic": "On the Gengwu day of the fourth month of summer, a general amnesty was granted throughout the empire and the era name was changed to Yuanxing.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0337",
          "zh": "宗室以罪絕者，悉復屬籍。",
          "translations": [
            {
              "lang": "en",
              "literal": "Imperial clansmen who had been cut off for crimes, all restored to the clan registers.",
              "idiomatic": "All imperial clansmen who had been removed from the clan registers due to crimes were restored to them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0338",
          "zh": "五月癸酉，雍地裂。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Guiyou day: Yong experienced a fissure in the earth.",
              "idiomatic": "On the Guiyou day of the fifth month, Yong suffered a fissure in the ground.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0339",
          "zh": "秋九月，遼東太守耿夔擊貊人，破之。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, ninth month: Liaodong Governor Geng Kui attacked the Mo people, defeated them.",
              "idiomatic": "In the ninth month of autumn, Liaodong Governor Geng Kui attacked the Mo people and defeated them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0340",
          "zh": "冬十二月辛未，帝崩於章德前殿，年二十七。",
          "translations": [
            {
              "lang": "en",
              "literal": "Winter, twelfth month, Xinwei day: The Emperor passed away in the Zhangde Front Hall, aged twenty-seven.",
              "idiomatic": "On the Xinwei day of the twelfth month of winter, the Emperor died in the Zhangde Front Hall at the age of twenty-seven.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0341",
          "zh": "立皇子隆為皇太子。",
          "translations": [
            {
              "lang": "en",
              "literal": "Established the imperial son Long as Crown Prince.",
              "idiomatic": "The imperial son Long was established as Crown Prince.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0342",
          "zh": "賜天下男子爵，人二級，三老、孝悌、力田人三級，民無名數及流民欲占者人一級；",
          "translations": [
            {
              "lang": "en",
              "literal": "Granted noble ranks to all males throughout the realm, each two levels; to the Three Elders, the filial and brotherly, and the diligent farmers each three levels; to the people without registered households and displaced people wishing to register each one level;",
              "idiomatic": "Noble ranks were granted to all males throughout the empire: two levels each; three levels to the Three Elders, the filial and brotherly, and diligent farmers; one level to unregistered people and displaced persons wishing to register;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0343",
          "zh": "鰥、寡、孤、獨、篤癃、貧不能自存者粟，人三斛。",
          "translations": [
            {
              "lang": "en",
              "literal": "Widowers, widows, orphans, the solitary, the gravely ill, the poor who cannot support themselves: grain, each three dou.",
              "idiomatic": "Widowers, widows, orphans, the childless elderly, the gravely ill, and the impoverished who cannot sustain themselves each received three dou of grain.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0344",
          "zh": "自竇憲誅後，帝躬親萬機。",
          "translations": [
            {
              "lang": "en",
              "literal": "After Dou Xian's execution, the Emperor personally attended to the myriad affairs.",
              "idiomatic": "After Dou Xian's execution, the Emperor personally handled all state affairs.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0345",
          "zh": "每有灾異，輒延問公卿，極言得失。",
          "translations": [
            {
              "lang": "en",
              "literal": "Whenever there were calamities and portents, he would invite and question the dukes and ministers, speaking to the utmost about successes and failures.",
              "idiomatic": "Whenever calamities or portents occurred, he would invite the dukes and ministers for questioning and speak frankly about what was going well and what was not.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0346",
          "zh": "前後符瑞八十一所，自稱德薄，皆抑而不宣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Before and after auspicious omens in eighty-one places, calling himself of thin virtue, all suppressed and not proclaimed.",
              "idiomatic": "Before and after, there were auspicious omens in eighty-one places, but considering himself of insufficient virtue, he suppressed them all and did not proclaim them.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0347",
          "zh": "舊南海獻龍眼、荔支，十里一置，五里一候，奔騰阻險，死者繼路。",
          "translations": [
            {
              "lang": "en",
              "literal": "Formerly Nanhai presented longan and litchi, ten li a station, five li a guard, rushing and tumbling over dangerous obstacles, the dead following one after another on the road.",
              "idiomatic": "In the past, Nanhai presented longan and litchi fruits; stations were set every ten li and guards every five li; the fruits were rushed over dangerous obstacles, with the dead lying one after another along the road.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0348",
          "zh": "時臨武長汝南唐羌，縣接南海，乃上書陳狀。",
          "translations": [
            {
              "lang": "en",
              "literal": "At the time the magistrate of Linwu Runan Tang Qiang, the county bordering Nanhai, then submitted a memorial stating the situation.",
              "idiomatic": "At the time, Tang Qiang, magistrate of Linwu in Runan commandery (whose county bordered Nanhai), submitted a memorial describing the situation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0349",
          "zh": "帝下詔曰：『遠國珍羞，本以薦奉宗廟，茍有傷害，豈愛民之本。",
          "translations": [
            {
              "lang": "en",
              "literal": "The Emperor issued an edict saying: 'Distant kingdoms' precious delicacies, originally to present and serve the ancestral temples, if there is harm, how can this be loving the people as the foundation.",
              "idiomatic": "The Emperor issued an edict stating: 'The precious delicacies from distant kingdoms were originally meant to be presented to the ancestral temples. If they cause harm, how can this be considered loving the people as the foundation?'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0350",
          "zh": "其勑太官勿復受獻。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the Grand Provisioner be instructed not to receive tribute again.''",
              "idiomatic": "Let the Grand Provisioner be instructed not to accept such tribute again.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0351",
          "zh": "由是遂省焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "From this it was then abolished.",
              "idiomatic": "From this point, the practice was abolished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0352",
          "zh": "論曰：自中興以後，逮於永元，雖頗有弛張，而俱存不擾，是以齊民歲增，闢土世廣。",
          "translations": [
            {
              "lang": "en",
              "literal": "Discussion says: From after the restoration onward, reaching to Yongyuan, although there was somewhat relaxation and tension, yet both preserved non-disturbance, therefore the common people increased year by year, the opened lands broadened generation by generation.",
              "idiomatic": "In discussion: From after the restoration onward, down to the Yongyuan era, although there were periods of relaxation and tension, both preserved a policy of non-interference; therefore the common people increased year by year, and the opened territories broadened generation by generation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0353",
          "zh": "偏師出塞，則漠北地空；",
          "translations": [
            {
              "lang": "en",
              "literal": "Partial armies going out beyond the frontier, then the land north of the desert is empty;",
              "idiomatic": "When partial armies went beyond the frontier, the lands north of the desert were emptied;",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0354",
          "zh": "都護西指，則通譯四萬。",
          "translations": [
            {
              "lang": "en",
              "literal": "the Protector General pointing west, then forty thousand interpreters came.",
              "idiomatic": "when the Protector General extended his authority westward, forty thousand interpreters submitted.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0355",
          "zh": "豈其道遠三代，術長前世？",
          "translations": [
            {
              "lang": "en",
              "literal": "How could their way be far from the Three Dynasties, their methods surpassing previous ages?",
              "idiomatic": "Could it be that their way was far from the Three Dynasties, their methods surpassing previous ages?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0356",
          "zh": "將服叛去來，自有數也？",
          "translations": [
            {
              "lang": "en",
              "literal": "Or that submission and rebellion, coming and going, had their own destiny?",
              "idiomatic": "Or that submission and rebellion, coming and going, had their own inherent pattern?",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0357",
          "zh": "孝殤皇帝諱隆，和帝少子也。",
          "translations": [
            {
              "lang": "en",
              "literal": "Emperor Shang of Han, whose personal name was Long, was the youngest son of Emperor He.",
              "idiomatic": "Emperor Shang of Han, whose personal name was Long, was the youngest son of Emperor He.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0358",
          "zh": "元興元年十二月辛未夜，即皇帝位，時誕育百餘日。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yuanxing first year, twelfth month, Xinwei night: Ascended the imperial throne, at the time born more than one hundred days.",
              "idiomatic": "On the night of the Xinwei day in the twelfth month of the first year of Yuanxing, he ascended the imperial throne, at the time being more than one hundred days old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0359",
          "zh": "尊皇后曰皇太后，太后臨朝。",
          "translations": [
            {
              "lang": "en",
              "literal": "Honored the Empress as Empress Dowager, the Empress Dowager held court.",
              "idiomatic": "The Empress was honored as Empress Dowager, and the Empress Dowager held court.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0360",
          "zh": "北匈奴遣使稱臣，詣敦煌奉獻。",
          "translations": [
            {
              "lang": "en",
              "literal": "Northern Xiongnu sent envoys to declare themselves subjects, went to Dunhuang to present tribute.",
              "idiomatic": "The Northern Xiongnu sent envoys to declare themselves subjects and went to Dunhuang to present tribute.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0361",
          "zh": "延平元年春正月辛卯，太尉張禹為太傅，司徒徐防為太尉，參錄尚書事，百官總己以聽。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yanping first year, spring, first month, Xinmao day: Grand Marshal Zhang Yu became Grand Tutor, Minister of the Masses Xu Fang became Grand Marshal, participated in recording Secretariat affairs, all officials took orders from him.",
              "idiomatic": "On the Xinmao day of the first month of spring in the first year of Yanping, Grand Marshal Zhang Yu was appointed Grand Tutor; Minister of the Masses Xu Fang was appointed Grand Marshal and participated in recording Secretariat affairs; all officials took orders from him.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0362",
          "zh": "封皇兄勝為平原王。",
          "translations": [
            {
              "lang": "en",
              "literal": "Enfeoffed imperial brother Sheng as King of Pingyuan.",
              "idiomatic": "Imperial brother Sheng was enfeoffed as King of Pingyuan.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0363",
          "zh": "癸卯，光祿勳梁鮪為司徒。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guiyou day: Guanglu Xun Liang Wei became Minister of the Masses.",
              "idiomatic": "On the Guiyou day, Liang Wei, the Guanglu Xun, became Minister of the Masses.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0364",
          "zh": "三月甲申，葬孝和皇帝於慎陵，尊廟曰穆宗。",
          "translations": [
            {
              "lang": "en",
              "literal": "Third month, Jiashen day: Buried Emperor Xiaohe in Shenling, honored his temple as Muzong.",
              "idiomatic": "On the Jiashen day of the third month, Emperor Xiaohe was buried in Shenling, and his temple was honored as Muzong.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0365",
          "zh": "丙戌，清河王慶、濟北王壽、河間王開、常山王章始就國。",
          "translations": [
            {
              "lang": "en",
              "literal": "Bingxu day: King Qing of Qinghe, King Shou of Jibei, King Kai of Hejian, King Zhang of Changshan first took up residence in their kingdoms.",
              "idiomatic": "On the Bingxu day, King Qing of Qinghe, King Shou of Jibei, King Kai of Hejian, and King Zhang of Changshan first took up residence in their respective kingdoms.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0366",
          "zh": "五月辛卯，皇太后詔曰：『皇帝幼沖，承統鴻業，朕且權佐助聽政，兢兢寅畏，不知所濟。",
          "translations": [
            {
              "lang": "en",
              "literal": "Fifth month, Xinmao day: Empress Dowager edict said: 'The Emperor is young and tender, inherits the great enterprise, I for now temporarily assist and help with governing, reverently and cautiously fearful, know not what to do for relief.",
              "idiomatic": "On the Xinmao day of the fifth month, the Empress Dowager issued an edict stating: 'The Emperor is young and inexperienced, inheriting this great imperial enterprise; I shall temporarily assist and help with governing, reverently and cautiously fearful, knowing not how to provide relief.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0367",
          "zh": "深惟至治之本，道化在前，刑罰在後。",
          "translations": [
            {
              "lang": "en",
              "literal": "Deeply considering the foundation of supreme governance, moral transformation comes first, punishments come after.",
              "idiomatic": "Deeply considering the foundation of supreme governance: moral transformation must come first, punishments afterward.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0368",
          "zh": "將稽中和，廣施慶惠，與吏民更始。",
          "translations": [
            {
              "lang": "en",
              "literal": "Will examine the balanced harmony, widely bestow felicitous favors, renew with officials and people.",
              "idiomatic": "I shall examine balanced harmony, widely bestow felicitous favors, and make a fresh start with officials and the people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0369",
          "zh": "其大赦天下。",
          "translations": [
            {
              "lang": "en",
              "literal": "Let there be a great amnesty throughout the realm.",
              "idiomatic": "Let there be a general amnesty throughout the empire.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0370",
          "zh": "自建武以來諸犯禁錮，詔書雖解，有司持重，多不奉行，其皆復為平民。』",
          "translations": [
            {
              "lang": "en",
              "literal": "From the Jianwu period onward, all those imprisoned for violating prohibitions, although edicts have released them, the officials are cautious, many do not carry them out, let them all become commoners again.''",
              "idiomatic": "From the Jianwu era onward, all those imprisoned for violating prohibitions—although edicts have released them, the officials have been cautious and many have not carried them out—let them all become commoners again.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0371",
          "zh": "壬辰，河東垣山崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Rencheng day: Hedong Yuan Mountain collapsed.",
              "idiomatic": "On the Rencheng day, Yuan Mountain in Hedong collapsed.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0372",
          "zh": "六月丁未，太常尹勤為司空。",
          "translations": [
            {
              "lang": "en",
              "literal": "Sixth month, Dingwei day: Grand Herald Yin Qin became Minister of Works.",
              "idiomatic": "On the Dingwei day of the sixth month, Yin Qin, the Grand Herald, became Minister of Works.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0373",
          "zh": "郡國三十七雨水。",
          "translations": [
            {
              "lang": "en",
              "literal": "Thirty-seven commanderies and kingdoms experienced flooding.",
              "idiomatic": "Thirty-seven commanderies and kingdoms suffered from flooding.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0374",
          "zh": "己未，詔曰：『自夏以來，陰雨過節，煗氣不效，將有厥咎。",
          "translations": [
            {
              "lang": "en",
              "literal": "Jiwei day: Imperial edict said: 'From summer onward, the yin rains have exceeded proper measure, the warming qi has not taken effect, there will be fault for this.",
              "idiomatic": "On the Jiwei day, an imperial edict stated: 'Since summer, the yin rains have exceeded proper bounds, the warming energies have not taken effect; there will be blame for this.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0375",
          "zh": "寤寐憂惶，未知所由。",
          "translations": [
            {
              "lang": "en",
              "literal": "Awake and asleep filled with worry and fear, know not the cause.",
              "idiomatic": "I am constantly filled with worry and fear, awake and asleep, knowing not the cause.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0376",
          "zh": "昔夏后惡衣服，菲飲食，孔子曰「吾無閒然」。",
          "translations": [
            {
              "lang": "en",
              "literal": "Formerly the Xia ruler disliked fine clothing, ate plain food, Confucius said 'I have no criticism of this.'",
              "idiomatic": "In the past, the ruler of Xia disliked fine clothing and ate plain food; Confucius said, 'I have no criticism of this.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0377",
          "zh": "今新遭大憂，且歲節未和，徹膳損服，庶有補焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now newly suffering great sorrow, and the year's seasons are not harmonious, withdraw from feasts and reduce clothing, perhaps this will provide some remedy.",
              "idiomatic": "Now newly suffering great sorrow, with the year's seasons not yet harmonious, I shall withdraw from feasts and reduce my clothing; perhaps this will provide some remedy.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0378",
          "zh": "其減太官、導官、尚方、內署諸服御珍膳靡麗難成之物。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Let the Grand Provisioner, Guide Office, Imperial Workshops, and inner offices reduce all luxurious and difficult-to-make items of clothing, service, precious foods.''",
              "idiomatic": "Let the Grand Provisioner, Guide Office, Imperial Workshops, and inner offices reduce all luxurious and difficult-to-make items of clothing, service, and precious foods.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0379",
          "zh": "丁卯，詔司徒、大司農、長樂少府曰：『朕以無德，佐助統政，夙夜經營，懼失厥衷。",
          "translations": [
            {
              "lang": "en",
              "literal": "Dingmao day: Imperial edict to the Minister of the Masses, Grand Minister of Agriculture, Chamberlain for the Palace Revenues said: 'I with my lack of virtue assist and help govern the realm, early and late laboring, fear losing the proper balance.",
              "idiomatic": "On the Dingmao day, an imperial edict to the Minister of the Masses, Grand Minister of Agriculture, and Chamberlain for the Palace Revenues stated: 'I, lacking virtue, assist and help govern the realm, laboring early and late, fearing to lose the proper balance.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0380",
          "zh": "思惟治道，由近及遠，先內後外。",
          "translations": [
            {
              "lang": "en",
              "literal": "Considering the way of governance, from near to far, first inner then outer.",
              "idiomatic": "Considering the way of governance: from near to far, first inner affairs then outer.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0381",
          "zh": "自建武之初以至于今，八十餘年，宮人歲增，房御彌廣。",
          "translations": [
            {
              "lang": "en",
              "literal": "From the beginning of Jianwu onward until now, more than eighty years, palace women increase yearly, the chambers and attendants become increasingly numerous.",
              "idiomatic": "From the beginning of the Jianwu era until now, more than eighty years have passed; palace women increase yearly, and the chambers and attendants have become increasingly numerous.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0382",
          "zh": "又宗室坐事沒入者，猶托名公族，甚可愍焉。",
          "translations": [
            {
              "lang": "en",
              "literal": "Moreover imperial clansmen who for crimes were confiscated into servitude, still falsely claim the name of imperial clan, this is very pitiable.",
              "idiomatic": "Moreover, imperial clansmen who were confiscated into servitude due to crimes still falsely claim the name of imperial clan; this is very pitiable.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0383",
          "zh": "今悉免遣，及掖庭宮人，皆為庶民，以抒幽隔鬱滯之情。",
          "translations": [
            {
              "lang": "en",
              "literal": "Now all release and send away, and the palace women of the Yeting, all become commoners, to relieve the feelings of secluded isolation and pent-up stagnation.",
              "idiomatic": "Now all shall be released and sent away, including the palace women of the Yeting; they shall all become commoners, to relieve feelings of secluded isolation and pent-up stagnation.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0384",
          "zh": "諸官府、郡國、王侯家奴婢姓劉及疲癃羸老，皆上其名，務令實悉。』",
          "translations": [
            {
              "lang": "en",
              "literal": "All officials, commanderies, kingdoms, and noble houses' slave servants surnamed Liu and those who are ill and elderly, all submit their names, ensure they are completely accurate.''",
              "idiomatic": "All officials, commanderies, kingdoms, and noble houses shall submit the names of their slave servants surnamed Liu and those who are ill and elderly; ensure they are completely accurate.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0385",
          "zh": "秋七月庚寅，勑司隸校尉、部刺史曰：『夫天降災戾，應政而至。",
          "translations": [
            {
              "lang": "en",
              "literal": "Autumn, seventh month, Gengyin day: Instructed the Metropolitan Commandant and the provincial inspectors saying: 'Heaven sends down calamities, they come in response to governance.",
              "idiomatic": "On the Gengyin day of the seventh month of autumn, the Metropolitan Commandant and provincial inspectors were instructed: 'Heaven sends down calamities; they come in response to governance.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0386",
          "zh": "間者郡國或有水灾，妨害秋稼。",
          "translations": [
            {
              "lang": "en",
              "literal": "Recently some commanderies and kingdoms have had flooding disasters, harming the autumn harvest.",
              "idiomatic": "Recently, some commanderies and kingdoms have suffered flooding disasters that harmed the autumn harvest.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0387",
          "zh": "朝廷惟咎，憂惶悼懼。",
          "translations": [
            {
              "lang": "en",
              "literal": "The court takes blame, worried and fearful in sorrow.",
              "idiomatic": "The court takes blame for this, filled with worried sorrow and fear.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0388",
          "zh": "而郡國欲獲豐穰虛飾之譽，遂覆蔽灾害，多張墾田，不揣流亡，競增戶口，掩匿盜賊，令姦惡無懲，署用非次，選舉乖宜，貪苛慘毒，延及平民。",
          "translations": [
            {
              "lang": "en",
              "literal": "Yet the commanderies and kingdoms desiring empty reputation for bountiful harvests, then conceal disasters, exaggerate cultivated fields, do not assess displaced people, compete to increase household numbers, conceal bandits and thieves, causing evil to go unpunished, appointing out of order, selecting improperly, greedy and harsh to cruelty, extending to the common people.",
              "idiomatic": "Yet the commanderies and kingdoms, desiring empty reputations for bountiful harvests, conceal disasters; they exaggerate cultivated fields without assessing displaced people; they compete to inflate household numbers; they conceal bandits and thieves, allowing evil to go unpunished; they appoint officials out of order and select improperly; they are greedy, harsh, and cruel, extending this to the common people.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0389",
          "zh": "刺史垂頭塞耳，阿私下比，「不畏於天，不愧於人」。",
          "translations": [
            {
              "lang": "en",
              "literal": "The inspectors hang their heads and stop their ears, curry favor privately with subordinates, 'not fearing Heaven, not ashamed before people.'",
              "idiomatic": "The inspectors hang their heads and stop their ears; they curry favor privately with subordinates: 'not fearing Heaven, not ashamed before people.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0390",
          "zh": "假貸之恩，不可數恃，自今以後，將糾其罰。",
          "translations": [
            {
              "lang": "en",
              "literal": "The favor of loans and advances cannot be relied upon repeatedly, from now onward, will correct and punish them.",
              "idiomatic": "The favor of loans and advances cannot be relied upon repeatedly; from now onward, they shall be corrected and punished.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0391",
          "zh": "二千石長吏其各實覈所傷害，為除田租，芻稾。』",
          "translations": [
            {
              "lang": "en",
              "literal": "The senior officials of two thousand shi rank shall each truly investigate the harm suffered, exempt them from land taxes, fodder.''",
              "idiomatic": "The senior officials of two thousand shi rank shall each truly investigate the harm suffered and exempt them from land taxes and fodder.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0392",
          "zh": "八月辛亥，帝崩。",
          "translations": [
            {
              "lang": "en",
              "literal": "Eighth month, Xinhai day: The Emperor passed away.",
              "idiomatic": "On the Xinhai day of the eighth month, the Emperor passed away.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0393",
          "zh": "癸丑，殯於崇德前殿。",
          "translations": [
            {
              "lang": "en",
              "literal": "Guiyou day: Laid in state in the Chongde Front Hall.",
              "idiomatic": "On the Guiyou day, he was laid in state in the Chongde Front Hall.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0394",
          "zh": "年二歲。",
          "translations": [
            {
              "lang": "en",
              "literal": "Aged two years.",
              "idiomatic": "He was two years old.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "sentences": [
        {
          "id": "s0395",
          "zh": "贊曰：『孝和沈烈，率由前則。",
          "translations": [
            {
              "lang": "en",
              "literal": "Praise says: 'Xiaohe was profound and fierce, followed by previous examples.",
              "idiomatic": "In praise: 'Emperor Xiaohe was profound and fierce, following previous examples.'",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0396",
          "zh": "王赫自中，賜命彊慝。",
          "translations": [
            {
              "lang": "en",
              "literal": "The King's brilliance from the center, bestowed mandate on the strong and evil.",
              "idiomatic": "The King's brilliance emanated from the center, bestowing the mandate on the strong and evil.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0397",
          "zh": "抑沒祥符，登顯時德。",
          "translations": [
            {
              "lang": "en",
              "literal": "Suppressed and hidden auspicious omens, elevated and displayed timely virtue.",
              "idiomatic": "He suppressed and hid auspicious omens, elevated and displayed timely virtue.",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        },
        {
          "id": "s0398",
          "zh": "殤世何早，平原弗克。』",
          "translations": [
            {
              "lang": "en",
              "literal": "Shang's world how early, Pingyuan not attained.''",
              "idiomatic": "The Shang era ended so early, Pingyuan was not attained.''",
              "translator": "Garrett M. Petersen (2025)",
              "model": "grok-1.5"
            }
          ]
        }
      ],
      "translations": [
        {
          "lang": "en",
          "literal": "",
          "idiomatic": "",
          "translator": ""
        }
      ]
    }
  ]
}